[{"title":"The Latest: Trump says Obama took Biden off ‘the trash heap’","text":"The audience cheers as President Donald Trump arrives at Elko Regional Airport, Saturday, Oct. 20, 2018, in Elko, Nv., for a campaign rally. (Carolyn Kaster/Associated Press)\nELKO, Nev. — The Latest on President Donald Trump (all times local):\n12:35 ","bias":"left-center"},{"title":"Morning Bits: It will be Republicans own fault","text":"Saudi Crown Prince Mohammed bin Salman, right, tours a flood-damaged area in Houston in April. (Strever Gonzales/Houston Chronicle via AP)\nOpinion writer\nIt’s their own fault for not listening to voters when it mattered. “Many Republicans, who swept ","bias":"left-center"},{"title":"Khashoggi’s disappearance is a betrayal of Trump","text":"Columnist\nIf, as appears increasingly likely, Saudi Crown Prince Mohammed bin Salman ordered the killing of journalist Jamal Khashoggi, then he has joined Vladimir Putin and Kim Jong Un among the ranks of rogue leaders who assassinate their critics o","bias":"left-center"},{"title":"Trump says US will pull out of intermediate range nuke pact","text":"President Donald Trump speaks to media before boarding Air Force One at Elko Regional Airport, Saturday, Oct. 20, 2018, in Elko, Nev., after a campaign rally. (Carolyn Kaster/Associated Press)\nELKO, Nevada — President Donald Trump said Saturday he wi","bias":"left-center"},{"title":"Why one man’s disappearance captured the outrage and media attention that war has not","text":"Robert Mahoney, deputy executive director of the Committee to Protect Journalists, speaks at a news conference at the United Nations on Oct. 18 that brought together activists seeking answers about Jamal Khashoggi’s disappearance. (Timothy A. Clary/A","bias":"left-center"},{"title":"Trump’s Reputation With Foreigners Is Worse Than Vladimir Putin’s, A New Survey Shows","text":"One of President Donald Trump's most repeated promises is that he'll always put America first. No matter how you think that promise is working in the United States, it seems to have had a significant effect abroad. According to a new survey, Trump's ","bias":"left-center"},{"title":"Trump, Biden campaign on opposite sides of Nev. Senate race","text":"ELKO, Nev. — Campaigning on opposite sides of a pivotal Senate race, President Donald Trump and former Vice President Joe Biden appealed to party loyalists in Nevada as early voting began Saturday in the state.\nWrapping up a three-day visit to Wester","bias":"left-center"},{"title":"Why Hillary Clinton’s comments were even more painful than Trump’s","text":"Deputy editorial page editor\nBetween the man who is president and the woman who ran against him, there is, for me, no contest; Hillary Clinton would have been a far better president than Donald Trump. But both Trump and Clinton, in their own trademar","bias":"left-center"},{"title":"Trump’s sure bet turned out to be his biggest foreign policy crisis","text":"The country that President Trump once believed would offer his White House the surest path to Middle East peace has instead created his administration’s greatest foreign policy crisis yet. Despite campaign boasts to the contrary, Trump is learning th","bias":"left-center"},{"title":"Happy Hour Roundup","text":"Opinion writer\n* Erin Cunningham and John Wagner report that President Trump seems to be moving toward an acknowledgement of the obvious:\nPresident Trump said Thursday it appears that Jamal Khashoggi is dead and warned that his administration could c","bias":"left-center"},{"title":"China Needs to Stop Enabling North Korea","text":"Back in 2016’s November elections, the Obama administration warned Donald Trump’s transition team that North Korea would be the top security priority for the incoming administration. The advice proved to be true; North Korea has increasingly become a","bias":"right"},{"title":"What the Europeans get about Khashoggi that Trump doesn’t","text":"Secretary of State Mike Pompeo, center, walks with Saudi Foreign Minister Adel al-Jubeir in Riyadh, Saudi Arabia, on Tuesday. (Leah Millis/Pool via AP)\nOpinion writer\nThe Post reports:\nPresident Trump said Thursday it appears that Jamal Khashoggi is ","bias":"left-center"},{"title":"Japan, US agree to take ‘all necessary measures’ against North Korea","text":"On Monday, Japanese Prime Minister Shinzo Abe said that he and President Donald Trump have agreed to take further actions against North Korea after the communist country’s latest missile test.\nNorth Korea conducted its second missile test in a month ","bias":"right"},{"title":"Mnuchin still plans to attend Saudi anti-terror financing meeting after Khashoggi disappearance","text":"Treasury Secretary Steven Mnuchin has decided to take part in an anti-terrorism finance meeting with Saudi security officials and their Middle Eastern counterparts in Riyadh later this month, opting to attend despite growing global outrage over the s","bias":"left-center"},{"title":"Nikki Haley warns countries abetting North Korean aggression in U.N. speech","text":"United States Ambassador to the United Nations Nikki Haley warned that North Korea would be in danger of military retaliation if it continued its aggressive acts, but pointed to other options the Trump administration had before them.\n“Make no mistake","bias":"right"},{"title":"Jeff Sessions: What to know about his relationship with Donald Trump","text":"President Donald Trump has reportedly discussed with White House advisers firing Attorney General Jeff Sessions, according to a story from the Associated Press.\nTrump, who has seemed to grow increasing angry with Sessions over his decision to recuse ","bias":"left-center"},{"title":"The U.N. General Assembly is not going so well for President Trump","text":"The United Nations General Assembly’s kicked into gear with high-level meetings this week, and President Donald Trump’s many skirmishes with world leaders have bubbled to the surface in a spectacularly simultaneous and visible manner.\nCNN reported on","bias":"left"},{"title":"‘Never Trumpers’ unite to back Trump’s battle for Kavanaugh","text":"President Trump’s fight for Supreme Court nominee Brett Kavanaugh is breaking up the “Never Trump” coalition of GOP leaders and pundits, many who are now uniting behind the president in advance of Saturday’s Senate confirmation vote.\nRocked by the wa","bias":"right-center"},{"title":"AP News in Brief at 11:04 p.m. EDT","text":"Trump says US will pull out of intermediate range nuke pact\nELKO, Nevada — President Donald Trump said Saturday he will exit a landmark arms control agreement the United States signed with the former Soviet Union, saying that Russia is violating the ","bias":"left-center"},{"title":"Trump cuts CBS interview short over this one question","text":"President Donald Trump abruptly ended an interview with “CBS This Morning” Monday after reporter John Dickerson turned the discussion to the president’s past claims that former President Barack Obama wiretapped Trump Tower.\n“I don’t stand by anything","bias":"right"},{"title":"MSNBC hosts say Trump’s wiretapping claims show the US is ‘in crisis’","text":"The end of the world is nigh. Don’t believe it? Just ask MSNBC “Morning Joe” hosts Mika Brzezinski and Joe Scarborough.\nThe cable news duo expressed gloom and doom Monday because of President Donald Trump’s administration, despite the fact that they ","bias":"right"},{"title":"Justice Dept. charges Russian woman with interference in midterm elections","text":"The Justice Department announced Friday it had charged a Russian woman who prosecutors say conspired to interfere with the 2018 U.S. election, marking the first criminal case that accuses a foreign national of interfering in the upcoming midterms.\nEl","bias":"left-center"},{"title":"The Trump administration’s see-no-evil indulgence of Saudi Arabia","text":"Columnist\nWhen the United States does not stand up for human rights and freedom of expression, there are tragic consequences. The apparent torture and murder of journalist Jamal Khashoggi is one of them.\nFrom the beginning, President Trump and his ad","bias":"left-center"},{"title":"Mexicans Angry at Their President for Not Demanding Trump Apology, Meeting Called a ‘Disaster’","text":"MEXICO CITY (AP) — Mexicans responded angrily to what they saw as a weak performance by President Enrique Pena Nieto, who appeared to let Republican presidential candidate Donald Trump emerge unscathed from a meeting Wednesday.\nPena Nieto tried gamel","bias":"right"},{"title":"Trump: Saudi arrests in Khashoggi death ‘a good first step’","text":"President Donald Trump waves after speaking at a campaign rally Friday, Oct. 19, 2018, in Mesa, Ariz. Trump is in Arizona stumping for Senate candidate Martha McSally. (Matt York/Associated Press)\nLUKE AIR FORCE BASE, Ariz. — President Donald Trump o","bias":"left-center"},{"title":"Free President Trump","text":"Free President Trump\nPerhaps the media will not be able to fool all the people all the time with disinformation about President Trump. However low President Trump's opinion poll rating may be – it is said to hover at about 37-38% – the public's trust","bias":"right"},{"title":"Chinese central bank orders all financial transactions with North Korea halted","text":"Make no mistake: this is a huge step forward in putting pressure on North Korea to halt its rush to develop nuclear weapons and long-range missiles. It will have a near immediate impact on North Korea's ability to pay its bills.\nIn a major diplomatic","bias":"right"},{"title":"‘This country doesn’t want them’: Trump rails against migrants trying to enter the U.S.","text":"President Trump speaks at a campaign rally in Mesa, Ariz., on Friday, Oct. 19, 2018. (Matt York/AP)\nPresident Trump railed against migrants traveling toward the southern border Friday, telling supporters in this border state that, “this country doesn","bias":"left-center"},{"title":"At charity dinner, Nikki Haley takes jabs at Trump and other political elites","text":"During an address to an annual charity dinner in New York on Thursday night, outgoing U.N. Ambassador Nikki Haley, the daughter of immigrants from India, recalled the first time President Trump learned of her heritage.\n“When the president found out t","bias":"left-center"},{"title":"Lindsey Graham says Obama wiretapping would be ‘biggest scandal since Watergate’ - for Trump","text":"President Donald Trump lit the political world afire with his tweets accusing former President Barack Obama of wiretapping Trump Tower Saturday morning. In response, Sen. Lindsey Graham (R-S.C.) said that he would get to the bottom of the accusations","bias":"right"},{"title":"There can be no coverup of this act of pure evil","text":"LET’S BE clear: The Saudi “investigation” of the disappearance of journalist Jamal Khashoggi, which the Trump administration contends needs to be given more time to reach conclusions, does not exist. The Saudi leadership under King Salman and Crown P","bias":"left-center"},{"title":"Trump trashes the laws that protect free speech. But he would be lost without them.","text":"Media columnist\nEarly this week, the writers’ coalition, PEN America, sued President Trump in federal court.\nTrump “has made eminently clear his disdain for the press and the legal protections the First Amendment affords it,” the lawsuit said. It rec","bias":"left-center"},{"title":"John Oliver Says Trump's Saudi Arabia Deal Is More Important To Him Than A \"Butchered Journalist\"","text":"On Sunday's episode of Last Week Tonight, host John Oliver condemned Trump's Saudi Arabia deal following the mysterious disappearance of a journalist at the Saudi consulate in Istanbul, Turkey. Oliver criticized Trump's relationship with the Saudi mo","bias":"left-center"},{"title":"Expert weighs in on Trump’s tough North Korea talk as China, Russia appear more willing to act","text":"President Donald Trump said this week that North Korea would be met with “fire and fury like the world has never seen” if dictator Kim Jong Un continues on his current track to develop nuclear weapons and threaten nations of the world with pre-emptiv","bias":"right"},{"title":"How Turkey’s president pressured the Saudis to account for Khashoggi’s death","text":"Saudi Arabia’s decision to acknowledge the death of Saudi journalist Jamal Khashoggi followed calls for justice from around the world. But no individual had put more pressure on the oil-rich monarchy than Turkish President Recep Tayyip Erdogan.\nIn th","bias":"left-center"},{"title":"Explaining SoftBank’s Close Ties With Saudi Arabia","text":"The controversy over the disappearance of journalist Jamal Khashoggi has prompted business leaders to distance themselves from Saudi Arabia. U.S. Treasury Secretary Steven Mnuchin, JPMorgan Chase & Co. Chief Executive Officer Jamie Dimon and Uber Tec","bias":"left-center"},{"title":"Top Hillary Clinton adviser tries to slam Trump over Putin - but cold-clocks Obama & Clinton instead","text":"Brian Fallon, the man who served as Hillary Clinton’s press secretary during last year’s election, took to Twitter Friday in an attempt to slam President Donald Trump over Trump’s apparent positive relationship with Russian President Vladimir Putin a","bias":"right"},{"title":"We knew Trump wouldn’t condemn a congressman for assaulting a reporter. Now, he celebrates it.","text":"Twice in two months, President Trump has gone to Montana and praised that state’s congressman for assaulting a reporter.\nOn Thursday, Trump outright celebrated the incident, which led to Rep. Greg Gianforte (R-Mont.) eventually pleading guilty to a m","bias":"left-center"},{"title":"The Trump Effect on the Middle East","text":"The Trump Effect on the Middle East\nThe fledgling Trump administration’s Middle East policy has thus far shown to be a dramatic departure from his predecessor. Thus far, the Trump effect on the Middle East has been a welcome recalibration of American","bias":"right"},{"title":"Trump’s ‘60 Minutes’ interview lags behind Stormy Daniels’","text":"This image taken from video provided by CBS shows President Donald Trump, left, with Lesley Stahl during the taping of an interview for “60 Minutes” that aired on Sunday, Oct. 14. President Trump reached 11.7 million viewers for his “60 Minutes” inte","bias":"left-center"},{"title":"Turkey to host four-nation summit on Syria crisis","text":"FILE - In this Oct. 13, 2018, file photo, a fighter of Syrian opposition stands at a checkpoint in northwestern city of Idlib, Syria. A Turkish official says Friday, Oct. 19, 2018, that a summit between the leaders of Turkey, France, Germany and Russ","bias":"left-center"},{"title":"Japan's Shinzo Abe charts more ambitious path in Asia and beyond","text":"Japan’s Prime Minister Shinzo Abe, center, meets with African leaders in Nairobi in 2016 to discuss trade and investments in infrastructure. (Khalil Senosi/AP)\nJapan’s Prime Minister Shinzo Abe stood before African leaders in Nairobi two years ago an","bias":"left-center"},{"title":"GOP war room blasts endless stream of criticism at Democrats, with Warren its latest target","text":"The Republican Party’s research director, Mike Reed, found out about Sen. Elizabeth Warren’s DNA test before he got out of bed Monday. From his bedroom, the GOP attack machine started whirring.\nAt the White House, President Trump and his aides initia","bias":"left-center"},{"title":"Why transactional foreign policy is destined to fail","text":"Secretary of State Mike Pompeo shakes hands with Saudi Crown Prince Mohammed bin Salman in Riyadh, Saudi Arabia, on Tuesday. (Leah Millis/Pool via AP)\nOpinion writer\nSince the Iraq War, debate has raged in U.S. foreign policy circles and in public di","bias":"left-center"},{"title":"US and South Korea again call off a major military exercise","text":"U.S. Defense Secretary Jim Mattis, center, and Singapore’s Defense Minister Ng Eng Hen, front right, attend an informal lunch meeting with defense ministers at ASEAN Defense Ministers’ Meeting in Singapore Friday, Oct. 19, 2018. (Don Wong/Associated ","bias":"left-center"},{"title":"Nikki Haley joins a growing list of Trump officials who criticize Trump on their way out the door","text":"She was one of the few Trump administration officials to leave on her own terms and with reputation intact. And yet that hasn’t stopped outgoing United Nations Ambassador Nikki Haley from joining a growing list of White House officials criticizing th","bias":"left-center"},{"title":"Time to unite against North Korea? Not McCain, Schumer, Feinstein","text":"After years of doing nothing to stop North Korea, it appears we are headed for a showdown. Bill Clinton gave North Korea four billion dollars in \"energy aid\" in 1994, hoping North Korea would stop its nuclear program. Clinton said it was a great deal","bias":"right"},{"title":"Saudi-supported cultural festival goes forward at Smithsonian","text":"Vocalist and percussionist Hafez Kotain is among the performers for the “Arab Culture Weekend” event at the Freer and Sackler galleries. (Freer and Sackler Gallery)\nA two-day celebration of Arab culture funded by a state-owned Saudi Arabian oil compa","bias":"left-center"},{"title":"Heitkamp renews ad apology; Cramer says she’s not bipartisan","text":"North Dakota Democratic U.S. Sen. Heidi Heitkamp, left, and Rep. Kevin Cramer shake hands at the conclusion of the U.S. Senate Candidate Debate sponsored by the North Dakota Newspaper Association on Thursday, Oct. 18, 2018, in Bismarck, N.D. (Tom Str","bias":"left-center"},{"title":"U.S., South Korea suspend joint military exercise because of North Korea talks","text":"A U.S. B-1B bomber flies with fighter jets from South Korea and the United States fighter over the Korean Peninsula during last December’s Vigilant Ace air-combat exercise. This year’s has been canceled. (Handout/Getty Images)\nThe United States and S","bias":"left-center"},{"title":"Putin will disappoint Trump","text":"President Trump has begun the biggest change to America's stance on China since Nixon . He conveyed that America cannot have friendly relations with China as long as North Korea is launching ballistic missiles with Xi Jinping's money. The tweet was n","bias":"right"},{"title":"‘It doesn’t matter.’ ‘We’ll see.’ The Trump Doctrine is sounding more fatalistic every day.","text":"Most presidents maintain that things matter — life, words, people. So what to make of Trump’s “nothing matters” rhetoric? Here, the president gestures to supporters at a campaign rally in Iowa on Oct. 9. (Scott Olson/Getty Images)\nIt was Feb. 27, 200","bias":"left-center"},{"title":"Khashoggi outcry galvanizes critics against Saudi arms sales","text":"International outrage over the killing of Jamal Khashoggi, a journalist and Washington Post contributor, has galvanized lawmakers and critics who are seeking to curb arms sales to Saudi Arabia.\nThe kingdom is the largest importer of U.S.-made weapons","bias":"left-center"},{"title":"The Daily 202: Response to Khashoggi crisis typifies the Trump foreign policy doctrine","text":"With Breanne Deppisch and Joanie Greve\nTHE BIG IDEA: President Trump’s escalating effort to contain the political and diplomatic fallout from Jamal Khashoggi’s disappearance, rather than confront Saudi Arabia, is emblematic of both his broader worldv","bias":"left-center"},{"title":"China fires a shot across President-elect Trump’s bow in anticipation of coming trade war","text":"The election of Donald Trump to the presidency has already had a major impact on United States trade policy, as President Obama announced over the weekend that the Trans Pacific Partnership (TPP) trade deal — which was slated to be his signature seco","bias":"right"},{"title":"South Korea’s foreign ministry praises Trump’s response to North Korea’s nuclear threat","text":"South Korea’s foreign ministry praised Donald Trump’s “clear warning” to North Korea on Tuesday, arguing that the president-elect has an understanding of the threat posed by the Hermit Kingdom.\nAccording to Reuters, North Korean dictator Kim Jong Un ","bias":"right"},{"title":"Did Saudi Arabia have a reputation to ruin?","text":"A portrait of Saudi Crown Prince Mohammed bin Salman in Riyadh on Oct. 18. (Fayez Nureldine/AFP/Getty Images)\nWhatever happened to journalist Jamal Khashoggi, his disappearance looks like an unmitigated disaster for Saudi Arabia’s international reput","bias":"left-center"},{"title":"The Latest: US responds to Saudi news that Khashoggi is dead","text":"Turkey’s Foreign Minister Mevlut Cavusoglu speaks to the media after a meeting with U.S. Secretary of State Mike Pompeo at the Esenboga Airport in Ankara, Turkey, Wednesday, Oct. 17, 2018. Pro-government newspaper Yeni Safak on Wednesday said it had ","bias":"left-center"},{"title":"This new technology could send American politics into a tailspin","text":"This photo of President Trump chatting with Russian President Vladimir Putin last year is real, but a deepfake video and audio recording of their conversation could be so realistic it would difficult to detect it was made up. (MIKHAIL KLIMENTYEV/AFP/","bias":"left-center"},{"title":"Return to sender: Postal union warns of fallout if US leaves","text":"FILE - In this Wednesday, Oct. 3, 2018 file photo, Secretary of State Mike Pompeo briefs reporters at the State Department in Washington. No international letters, no international packages: A top official with a 192-country postal union says that’s ","bias":"left-center"},{"title":"Trump expresses regret on AG pick; he rips Sessions, probe ‘conflicts’","text":"WASHINGTON -- President Donald Trump said Wednesday that he never would have appointed Attorney General Jeff Sessions had he known Sessions would recuse himself from overseeing the Russia investigation that has dogged his presidency, calling the deci","bias":"left"},{"title":"At Montana rally, Trump praises congressman for assaulting reporter","text":"President Donald Trump on Thursday openly praised Rep. Greg Gianforte (R-Mont.) for assaulting a reporter in his bid for Congress last year, as the United States faced an unfolding crisis over missing journalist Jamal Khashoggi, who is believed to ha","bias":"left-center"},{"title":"Pressure turns to Mexico as migrant caravan heads for border","text":"Honduran migrants leave Guatemala City at sunrise Thursday, Oct. 18, 2018 as they make continue their way north toward the U.S. Many of the more than 2,000 Hondurans in a migrant caravan trying to wend its way to the United States left spontaneously ","bias":"left-center"},{"title":"In July, the Trump-era wave of protests started taking a back seat to campaign rallies","text":"President Trump arrives to cheers at the Four Seasons Arena at Montana ExpoPark on July 5 in Great Falls, Mont. (Carolyn Kaster/AP)\nThis is the 18th installment in a monthly series reporting on political crowds in the United States. The Crowd Countin","bias":"left-center"},{"title":"Melania Trump responds after Ivana Trump calls herself 'first lady' fo","text":"Melania Trump is living in the White House, but Ivana Trump says she will always be the “first lady” in President Donald Trump’s past.\n>> Read more trending news\nThe ex-wife of the president sat down for an interview with “Good Morning America” on Mo","bias":"left-center"},{"title":"If Trump helps cover up Khashoggi’s alleged murder, that will also come out","text":"(Jabin Botsford/The Washington Post)\nOpinion writer\nHorrifying new details are leaking out about the reported murder of journalist Jamal Khashoggi: According to a Turkish official who described audio of the killing, Saudi agents beat and tortured Kha","bias":"left-center"},{"title":"Obama was ‘flat out wrong’ on North Korea sanctions, expert says","text":"A North Korea expert says that former President Barack Obama was “flat out wrong” when he said that the United States applied all the sanctions it possibly could on North Korea.\nBruce Klingner, senior research fellow for Northeast Asia at Heritage Fo","bias":"right"},{"title":"Why Republicans are so afraid of Elizabeth Warren","text":"Sen. Elizabeth Warren (D-Mass.) (Charles Krupa/AP)\nOpinion writer\nSen. Elizabeth Warren (D-Mass.) has not had her best week. Her release of a DNA test, which showed a distant Native American ancestor, led to attacks from many on the right, some on th","bias":"left-center"},{"title":"Pompeo meets with Mexican officials as a migrant caravan inches north","text":"As thousands of Central American migrants inched closer to Mexico’s southern border, Secretary of State Mike Pompeo met with top officials here, hoping to avert the caravan before it reaches the United States.\nBy Friday morning, at least a thousand m","bias":"left-center"},{"title":"European, Asian leaders want free trade, push back at Trump","text":"European Council President Donald Tusk, bottom left, and China’s Prime Minister Li Keqiang, bottom right, pose for a group photo at an EU-ASEM summit in Brussels, Friday, Oct. 19, 2018. EU leaders met with their Asian counterparts Friday to discuss t","bias":"left-center"},{"title":"European, Asian leaders want free trade, push back at Trump","text":"China’s Prime Minister Li Keqiang, center, speaks with German Chancellor Angela Merkel, right, and European Council President Donald Tusk, left, during a group photo during an EU-ASEM summit in Brussels, Friday, Oct. 19, 2018. EU leaders met with the","bias":"left-center"},{"title":"Stephen Colbert wants Trump to run in 2020. Here’s why.","text":"There is already speculation about the Democratic candidate field readying to oppose President Trump in the 2020 election.\nBut that premise may be faulty if you consider one question: Is Trump even going to run?\nMSNBC “Morning Joe” co-host Joe Scarbo","bias":"left-center"},{"title":"‘America First’ doesn’t work without American values","text":"Columnist\nSaudi Arabia’s apparent killing of journalist Jamal Khashoggi — and the Trump administration’s haphazard response — is an unmistakable sign that U.S. foreign policy has swung too far away from its roots in promoting American values abroad. ","bias":"left-center"},{"title":"Many American allies are troubled, and threatened, by Donald Trump’s foreign policy","text":"WITHIN hours of signing his executive order restricting travel from seven Muslim countries, President Donald Trump called King Salman of Saudi Arabia to discuss closer ties. “Trump reassures the allies…and the travel restrictions befuddle the world”,","bias":"left-center"},{"title":"The Bolton-Kelly shouting match inside the White House unmasks one of Trump's biggest lies","text":"Opinion writer\nA shouting match has erupted inside the White House between two of President Trump’s top advisers. While angry arguments are typical in the world of stressful, high-stakes White House decision-making, this one has true revelatory poten","bias":"left-center"},{"title":"Saudi claims that Khashoggi died in a ‘brawl’ draw immediate skepticism","text":"Claims by the government of Saudi Arabia that Washington Post contributing columnist Jamal Khashoggi died in a physical altercation inside the Saudi Consulate in Istanbul drew immediate skepticism and contradicted earlier dueling accounts from Saudi ","bias":"left-center"},{"title":"President Trump, Chinese President Xi commit to denuclearization of North Korea","text":"President Donald Trump and Chinese President Xi Jinping said Thursday they will work together to denuclearize North Korea.\n“As long as we stand together, that threat will never happen — doesn’t even have a chance,” Trump said from Beijing. “The entir","bias":"right"},{"title":"Happy Hour Roundup","text":"Opinion writer\n* Robert Costa and Karoun Demirjian report that when it comes to the death of Jamal Khashoggi, the right is being just as classy as you’d expect:\nHard-line Republicans and conservative commentators are mounting a whispering campaign ag","bias":"left-center"},{"title":"Yes, the U.S. sometimes supports warlords and dictators. So when should we stop?","text":"Saudi Arabia’s Mohammed bin Salman with Jared Kushner and Ivanka Trump in Riyadh, Saudi Arabia, in May 2017. (Jonathan Ernst/Reuters)\nColumnist\n“He may be an S.O.B., but he’s our S.O.B.”\nThat maxim, sometimes attributed to President Franklin D. Roose","bias":"left-center"},{"title":"Feinstein: If Trump fires Mueller, it will mark the ‘beginning of the end’ of his presidency","text":"A top Senate Democrat declared over the weekend that if President Donald Trump attempts to fire FBI special counsel Robert Mueller, that would mark the “beginning of the end” of his presidency.\nMueller, appointed in May after Trump fired James Comey ","bias":"right"}]
