{"authors":["Associated Press"],"date_download":"2018-10-23 02:26:27","date_modify":"2018-10-23 02:26:27","date_publish":"2016-01-29 16:55:53","description":"LONDON (AP) — Thousands of people have been left without electricity as winter storm Gertrude lashes northern Britain with snow, rain and wind gusts of more ...","filename":"data/vaneerConsumption/1000swithoutpowerasstormGertrudelashesBritain.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:0507f94750f34a5a9b2349ee51334a6e-4PuZeKVXE7cd9005b2c876c63bb7-570_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423077_1000s-without-power-storm-Gertrude-lashes-Britain_1540261587.html","title":"1000s without power as storm Gertrude lashes Britain","title_page":"1000s without power as storm Gertrude lashes Britain | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"1000s without power as storm Gertrude lashes Britain\nLONDON (AP) — Thousands of people have been left without electricity as winter storm Gertrude lashes northern Britain with snow, rain and wind gusts of more than 100 miles an hour (161 kph).\nThe Met Office weather service says 60 to 70 miles per hour (96 to 113 kph) winds are expected over large areas of Scotland and Northern Ireland. A gust of 105 miles an hour (169 kph) was recorded Friday in the Shetland islands, off Scotland's northern coast.\nAround 10,000 homes were left without power in Scotland and Northern Ireland, and there was widespread disruption to train and ferry services.\nA walker is soaked by waves crashing over the sea defences in Portrush, Northern Ireland, Friday, Jan. 29, 2016. Thousands of homes were left without electricity after a storm swept across Northern Ireland bringing gale force winds and rain. (AP Photo/Peter Morrison)\nA ferry from Rotterdam failed to dock in the English port of Hull because of high winds and had to remain at sea. It was due to try again later.\n___\nThis story has corrected the conversion in the first paragraph to 100 miles an hour (161 kph).\nWaves crash over the sea defences the sea front at Portrush, Northern Ireland, Friday, Jan. 29, 2016. Thousands of homes were left without electricity after a storm swept across Northern Ireland bringing gale force winds and rain. (AP Photo/Peter Morrison)","url":"https://www.dailymail.co.uk/wires/ap/article-3423077/1000s-without-power-storm-Gertrude-lashes-Britain.html"}
