{"authors":["Peter Devlin For Daily Mail Australia"],"date_download":"2018-10-23 02:16:46","date_modify":"2018-10-23 02:16:46","date_publish":"2017-04-26 13:15:34","description":"Man Kaur from India, who is 101-years-old, proved age is no barrier as she took out gold in the 100m sprint in just one minute and 14 seconds.","filename":"data/vaneerConsumption/101yearoldwins100msprintMastersGamesinAuckland.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9F181600000578-0-image-a-28_1493206099220.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447370_101-year-old-wins-100m-sprint-Masters-Games-Auckland_1540261006.html","title":"101-year-old wins 100m sprint Masters Games in Auckland","title_page":"101-year-old wins 100m sprint Masters Games in Auckland | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A 101-year-old woman has taken out gold in the 100 metres sprint at the World Masters Games in Auckland.\nMan Kaur from India proved age is no barrier as she crossed the line in one minute and 14 seconds - a mere 64 seconds off Usain Bolt's 100m world record set in 2009.\nAnd there is no end in sight for the 101-year-old who plans to compete in the event next year.\nScroll down for video\nMan Kaur took out gold in the 100 metres sprint at the World Masters Games in Auckland\nSlow and steady wins the race: Man Kaur from India proved age is no barrier as she crossed the line in one minute and 14 seconds\nKaur is the oldest competitor entered in the 2017 World Masters Games\n'I enjoyed it and am very, very happy,' she told reporters after the race on Monday.\n'I'm going to run again, I'm not going to give up. I will participate, there's no full stop.'\nAlthough Kaur was the only participant in the 100-years-and-over category, the Masters Games has attracted 25,000 competitors.\nKaur only took up athletics eight years ago, at the tender age of 93.\nShe had no prior sporting experience before her son suggested she join him in competing on the international masters games circuit.\nAfter a medical check-up she was given the all-clear and since then mother and son have taken part in dozens of masters athletics meets around the globe.\nLate bloomer: Kaur only took up athletics eight years ago, at the tender age of 93\nMan Kaur of India, who is 101-years-old, competes in the 100m sprint at the World Masters Games at Trusts Arena in Auckland on Monday\nHer son told said Kaur was on a strict diet that included wheat grass juice and a daily glass of kefir (fermented milk) in preparation for the games.\nWorld Masters Games 2017 chief executive Jennah Wootten said the Auckland organisers were delighted to host such an inspiration.\n'Man Kaur truly personifies the 'sport for all' philosophy which World Masters Games is all about and we are thrilled to have her here,' she said.\n'I have no doubt that she and many of the other 24,905 athletes competing in these games are inspiring others to lead more active lifestyles and take up a sport.'\nLet the party begin: 101-year-old Man Kaur (centre) of India celebrates after competing in the 100m sprint","url":"https://www.dailymail.co.uk/news/article-4447370/101-year-old-wins-100m-sprint-Masters-Games-Auckland.html"}
