{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 18:41:57","date_modify":"2018-10-30 18:41:57","date_publish":"2015-10-09 03:40:34","description":"A monument of the Ten Commandments was removed from the grounds of the Oklahoma State Capitol grounds per the state Supreme Court.","filename":"data/vaneerConsumption/10CommandmentsRemovedfromStateCapitolperOklahomaSupremeCourt.json","image_url":"https://media.breitbart.com/media/2015/07/10-commandments-monument-oklahoma-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_08__1540924917.html","title":"10 Commandments Removed from State Capitol per Oklahoma Supreme Court","title_page":"10 Commandments Removed from State Capitol per Oklahoma Supreme Court | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A monument of the Ten Commandments was removed by workers this week from the grounds of the Oklahoma State Capitol per the order of the state Supreme Court.\nIn a 7-2 ruling, the Oklahoma Supreme Court overturned a lower court ruling and decided in favor of the ACLU in June, stating, “the monument at issue operates for the use, benefit or support of a sect or system of religion,” and therefore “violates Article 2, Section 5 of the Oklahoma State Constitution it is enjoined and shall be removed.”\nThat section of Oklahoma’s constitution states:\nNo public money or property shall ever be appropriated, applied, donated, or used, directly or indirectly, for the use, benefit, or support of any sect, church, denomination, or system of religion, or for the use, benefit, or support of any priest, preacher, minister, or other religious teacher or dignitary, or sectarian institution as such.\nAccording to NewsOK, the six-foot granite monument was removed and is being installed instead outside the offices of the Oklahoma Council of Public Affairs.\nBrady Henderson, legal director for the ACLU said the Oklahoma legislature’s approval of a bill in 2009 that favored placing the monument on the grounds of the state Capitol was not based on sound legal analysis.\n“They didn’t really think this through, or look carefully at how court precedent works,” he said.\nOklahoma Gov. Mary Fallin (R) called for a constitutional amendment to restore the monument on Tuesday, NBC News reports.\n“It’s not a Republican, Democrat or independent issue,” Fallin, said at a press conference in Oklahoma City. “The Ten Commandments is a historical monument. We brought it to this location. We felt it was a good place to be able to display it properly so people could see it.”\n“We’re going to let the people of Oklahoma decide this issue,” she added.\nIn a statement sent to Breitbart News, Hiram Sasser, deputy chief counsel for Liberty Institute, who worked with Oklahoma Attorney General Scott Pruitt, said, “We are disappointed the Oklahoma Supreme Court declined to follow the United States Supreme Court, the United States Courts of Appeal for the Tenth, Ninth, Eighth, and Fifth Circuits and the Colorado Supreme Court.”\nSasser continued:\nIndeed, Judge Alfred P. Murrah ruled in 1973 that an identical monument bearing the Ten Commandments was perfectly constitutional where it stood in Salt Lake City. The Oklahoma Supreme Court has taken the most radical position on removing the Ten Commandments of any court in this Nation’s history. It is my hope the legislature and the governor take appropriate actions to repeal this section of the Oklahoma Constitution in hopes of restoring the appropriate legal analysis forged by Judge Murrah decades ago.\nState Rep. Mike Ritze (R) said the Ten Commandments monument was “identical to many others upheld as constitutional by courts across the country, including the United States Supreme Court.”\n“We will focus our efforts on restoring the monument to its rightful place,” he added.\nIn addition, former state Rep. Mike Reynolds (R) said the removal of the monument should be a wake up call for voters.\n“I think that today is an excellent day to expose the hypocrisy in our state government, whether it’s the Supreme Court, the attorney general or the governor’s office making bad decisions, it’s time for citizens to start looking for ways to change the process,” he said.","url":"https://www.breitbart.com/politics/2015/10/08/10-commandments-removed-state-capitol-per-oklahoma-supreme-court/"}
