{"authors":["Kipp Jones"],"date_download":"2018-10-30 18:53:29","date_modify":"2018-10-30 18:53:29","date_publish":"2016-04-29 01:50:53","description":"In the wake of Will Ferrell's decision to spoof Ronald Reagan's battle with Alzheimer's disease, we've compiled list of other tragic illnesses which the comedian might consider for follow-ups. No doubt, Mr. Ferrell, with his sophisticated insights, will be able to mine the humor in all of these. | Entertainment","filename":"data/vaneerConsumption/10DiseasesOtherThanAlzheimersRipeforWillFerrellComedy.json","image_url":"https://media.breitbart.com/media/2016/04/Will-Ferrell-Wedding-Crashers.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_04_28__1540925609.html","title":"10 Diseases Other Than Alzheimer's Ripe for Will Ferrell Comedy","title_page":"10 Diseases Other Than Alzheimer's Ripe for Will Ferrell Comedy | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In the wake of Will Ferrell’s decision to spoof Ronald Reagan’s battle with Alzheimer’s disease, we’ve compiled a list of other tragic illnesses which the comedian might consider for follow-ups. No doubt, Mr. Ferrell, with his sophisticated insights, will be able to mine the humor in all of these.\n1. HIV/AIDS:\nHIV attacks the body’s immune system, affecting the body’s ability to fight off infections. Over time, infections or cancers take advantage of the weakened immune system and signal that the person has AIDS, the last state of HIV infection.\nIn the U.S., 6,955 people died from HIV and AIDS in 2013, according to the CDC.\n2. Lupus:\nLupus is a chronic inflammatory disease that occurs when the body’s immune system attacks its own tissues and organs. Inflammation caused by lupus can affect many different body systems — including joints, skin, kidneys, blood cells, brain, and heart and lungs.\n3. Cerebral Palsy (CP):\nCerebral palsy (CP) is a disorder that affects muscle tone, movement, and motor skills (the ability to move in a coordinated and purposeful way).\n4. Parkinson’s Disease:\nParkinson’s disease is a progressive disorder of the nervous system that affects movement. It develops gradually, but Parkinson’s disease symptoms worsen as the condition progresses over time.\n5. Childhood Leukemia:\nLeukemia is the most common childhood cancer and is defined as a type of blood cancer. Roughly 2,700 children are diagnosed with leukemia in the United States each year. Children suffering from the disease often experience fever, nausea, fatigue, pain in their joints, enlarged lymph nodes, and bruise easily. That is before treatment makes them lose their hair.\n6. Multiple Sclerosis (MS):\nMultiple sclerosis (MS) is a potentially disabling disease of the brain and spinal cord (central nervous system). In MS, the immune system attacks the protective sheath (myelin) that covers nerve fibers and causes communication problems between your brain and the rest of your body, according to the Mayo Clinic.\n7. Meningitis:\nMeningitis is an inflammation (swelling) of the protective membranes covering the brain and spinal cord known as the meninges. This inflammation is usually caused by an infection of the fluid surrounding the brain and spinal cord.\n8. Amyotrophic Lateral Sclerosis (ALS):\nALS, or amyotrophic lateral sclerosis, is a rapidly progressive and fatal neurodegenerative disease that affects nerve cells in the brain and the spinal cord.\n9. Zika Virus:\nSpread to people primarily through infected mosquitoes, the Zika virus can cause microcephaly in infants. Microcephaly is a condition where a baby’s head is abnormally small. The condition can cause intellectual disabilities, poor motor skills, vision problems, and hearing loss.\n10. Tuberculosis:\nTuberculosis is a potentially fatal disease, caused by a bacteria that generally attacks the lungs, but can attack any part of the body, including the kidneys, the spine, and the brain.","url":"https://www.breitbart.com/entertainment/2016/04/28/10-diseases-other-than-alzheimers-ripe-for-will-ferrell-comedy/"}
