{"authors":["Kyli Rodriguez-Cayro"],"date_download":"2018-10-31 01:51:55","date_modify":"2018-10-31 01:51:55","date_publish":"2018-09-13 21:22:50","description":"Often times, it seems like environmental justice is treated more like an afterthought or \"future\" issue to worry about, rather than a pressing social justice concern, leaving it to grassroots environmental groups to effect change. However, now more…","filename":"data/vaneerConsumption/10EnvironmentalGroupsToFollowInTheFightAgainstClimateChange.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/4/23/d3438717-5af7-4f9e-986b-57e6c4e452d3-getty-651246676.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_10-environmental-groups-to-follow-in-the-fight-against-climate-change-8864648_1540950715.html","title":"10 Environmental Groups To Follow In The Fight Against Climate Change","title_page":"10 Environmental Groups To Follow In The Fight Against Climate Change","title_rss":"NULL","source_domain":"bustle.com","text":"Often times, it seems like environmental justice is treated more like an afterthought or \"future\" issue to worry about, rather than a pressing social justice concern, leaving it to grassroots environmental groups to effect change. However, now more than ever, people are beginning to understand that protecting the earth is just as much a human rights issue as an environmental one. This became clearly evident after the Flint Water Crisis began in 2014, and even more so after the long, Indigenous-led fight against the Dakota Access Pipeline at the Standing Rock Sioux Reservation that occurred throughout 2016.\nMoreover, just a few months into Trump's presidency, his administration rolled back many environmental protections, and slashed the budget of the Environmental Protection Agency (EPA). On Feb. 2, Trump's decision to dramatically shrink Bears Ears National Monument and Grand Staircase-Escalante — to the dismay of many Indigenous communities — went into effect.\nLuckily, there are environmental organizations across the U.S. — many that are led by Indigenous communities and people of color — that are tirelessly fighting for environmental, economic, and social justice in their communities through grassroots organizing, education, and policy change. Here are 10 environmental causes and organizations you may not know, but that you should follow ASAP.\n1 Seeding Sovereignty Seeding Sovereignty is an Indigenous youth-and-women-led organization that works at the intersection of ending violence against women, and against the earth. Through art, webinars, articles, and various programs, Seeding Sovereignty works to empower young Indigenous women to become environmental leaders, and to educate people on the connection between violence against women and environmental justice.\n2 SLC Air Protectors After being inspired by the Indigenous activists at Standing Rock, the Native-led, grassroots group SLC Air Protectors was formed to fight air pollution in the state of Utah through direct action and community service projects.\n3 Bioneers Bioneers is a nonprofit organization based in Santa Fe, New Mexico, that is dedicated to educating people on environmental and social justice issues, and finding innovative solutions for them. The organization has six main programs, including a Native-led and women-led initiative. They also created a radio series, and host an annual Bioneers Conference.\n4 OceansGlobal oceansglobal on Instagram The organization OceansGlobal combines ocean conservation efforts with mental healthcare. They provide people in substance abuse recovery — who are are in sober living communities or outpatient programs — with ocean-based, recreational therapy. According to their website, OceansGlobal's mission is \"to bring the therapeutic benefits of the sea as alternative treatment for substance abusers and replace their addictive behaviors into being passionate about the ocean, and how to conserve it.\" Pretty cool, huh?\n5 Chispa Chispa is a grassroots group that is dedicated to raising awareness around how climate change affects Latinx communities. And they are dedicated to giving Latinx people a platform to engage in the conversation about environmental justice. The group has launched different programs and campaigns across the U.S., all focused on how Latinx communities are impacted by environmental issues.\n6 The Red Nation According to their site, The Red Nation is \"a coalition of Native and non-Native activists, educators, students, and community organizers advocating Native liberation.\" The grassroots social justice group organizes direct actions to advocate for Indigenous peoples, their rights, and to end the destruction and pollution of their lands.\n7 Together Restoring Economic Empowerment (TREE) Led by youth and young adults of color, Together Restoring Economic Empowerment (TREE) is a civil rights organization that fights for both environmental and economic justice. TREE's Action Center has information on active and past direct actions, projects, and resources for you to become more involved in climate justice.\n8 The Alliance of Climate Education (ACE) The Alliance of Climate Education (ACE) develops educational programs and engagement opportunities for teens to develop a deeper understanding of climate change and environmental issues. Not only do they provide climate-related resources and lesson plans for teachers, but they've launched youth action Teams across the U.S. who organize unique environmental projects.\n9 Black Belt Citizens Fighting for Health and Justice Black Belt Citizens Fighting for Health and Justice (BBCFHJ) is an organization that has been been fighting for climate justice and to end pollution in Uniontown, Alabama, since 2005. They fight for political, economic, and environmental justice in their community; Black Belt Citizens' campaigns are currently focused on eliminating toxic coal ash from the area caused by a landfill, and providing clean water to citizens.\n10 The Southern Environmental Law Center With a team of more than seventy lawyers, the Southern Environmental Law Center (SELC) is a six-state wide organization dedicated to fighting for environmental justice through policy and politics. According to their website, \"SELC strengthens laws, we make government agencies do their job, and, when necessary, we go to court to stop environmental abuses or to set far-reaching precedents.\"","url":"https://www.bustle.com/p/10-environmental-groups-to-follow-in-the-fight-against-climate-change-8864648"}
