{"authors":[],"date_download":"2018-10-30 18:30:08","date_modify":"2018-10-30 18:30:08","date_publish":"2017-01-02 17:53:00","description":"The new year brings with it a new slate of cultural events to look forward to.","filename":"data/vaneerConsumption/10eventswecantwaittoseein2017.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AccessAtlanta/2017/01/02/Images/Rachel%20Van%20Buskirk.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/events_performing-arts_events-can-wait-see-2017__1540924208.html","title":"10 events we can’t wait to see in 2017","title_page":"10 events we can’t wait to see in 2017","title_rss":"NULL","source_domain":"ajc.com","text":"The new year brings with it a new slate of cultural events to look forward to. Here are 10 concerts, exhibits and performances we’re eagerly anticipating in 2017.\nA musical and a makeover\nThe Alliance Theatre is about to be homeless — but only for a year. In May the Woodruff Arts Center’s resident playhouse will shutter for a major renovation. But first, Artistic Director Susan V. Booth will stage “Troubadour” (Jan. 18-Feb. 12), a new musical by Atlanta playwright Janece Shaffer and Grammy Award winner Kristian Bush, followed by a new play based on Melissa Fay Greene’s “The Temple Bombing” (Feb. 22-March 12). Not to worry, though: While the theater undergoes its physical transformation, the show will go on. For its 2017-2018 season, the Alliance will mount pop-up productions at soon-to-be-announced venues around the city. Come fall of 2018, it will move back to its newly imagined Peachtree Street home, just in time to celebrate its 60th anniversary season. (Alliance Theatre, 1280 Peachtree St. Atlanta. www.alliancetheatre.org.)\nMucho movies\nWithin the first five months of 2017, two of Atlanta’s biggest, longest running film festivals with bring an eclectic mix of movies to multiple big screens around town. First up is the 17th annual Atlanta Jewish Film Festival (Jan. 24-Feb. 15, $9-$18, various venues, 678-701-6104, www.ajff.org.) Opening night features the World War II drama “Alone in Berlin” with Emma Thompson and Brendan Gleeson, directed by Vincent Pérez, at Cobb Energy Centre. Closing night at Woodruff Arts Center’s Symphony Hall is “The Women’s Balcony,” an award-winning Israeli comedy with feminist themes. Other screenings among the 75 films scheduled is the Atlanta premiere of “Bang! The Bert Berns Story,” about the influential rock ‘n’ roll songwriter, and some classic films as well, including the Peter O’Toole 1982 showpiece “My Favorite Year.” Come spring is the 41st annual Atlanta Film Festival (March 24-April 2, various venues, 1-877-725-8849, atlantafilmfestival.com.) Among the festival’s 150 films is “Traces,” a virtual reality short film exploring the meaning of memory for a woman living with Alzheimer’s, and “Black Memorabilia,” a documentary about the production and collection of objects with demeaning representations of African-Americans.\nLooking for America\nThere is life – and art — outside New York City. The High Museum will launch a show Feb. 12 investigating the impact of regional artists, including photographers and self-taught artists, on the leading edge of contemporary art. Called “Cross Country: The Power of Place in American Art, 1915-1950,” the show will incorporate work from artists rarely presented together, such as photographers Ansel Adams, Gordon Parks and Harry Callahan, self-taught artists Bill Traylor and Jacob Lawrence and painters Thomas Hart Benton, Georgia O’Keeffe and Grant Wood. Three members of the Wyeth family will be represented, including illustrator N.C. Wyeth and his son, Andrew. The show will also boast monumental works from both sides of the country, with a Utah landscape from Western artist Maynard Dixon and a 20-foot canvas from Southern muralist Hale Woodruff. (Through May 7. $14.50. High Museum, 1280 Peachtree St. Atlanta. 404-733-4444, www.high.org.\nSting gets intimate\nIn case the news that Sting was releasing his first pop/rock project in more than a decade (aka no lutes allowed) wasn’t cause enough for celebration, he then announced a subsequent tour. Couldn’t get much better, right? Well, it did. Because many of the shows on the tour will take place in small venues, and Atlanta is one of the fortunate markets. The ageless Sting will promote his robust “57th & 9th” album, released in November, with an intimate performance at The Tabernacle. He’ll be joined by a three-piece band including longtime guitarist Dominic Miller, as well as Josh Freese on drums and Rufus Miller on guitar. Special guests include singer/songwriter Joe Sumner as well as San Antonio-based Tex Mex band, The Last Bandoleros. (Feb. 27. $80.50-$174.50. Tabernacle, 152 Luckie St., Atlanta. 1-800-745-3000, www.livenation.com.)\nA new era at Atlanta Ballet\nAtlanta Ballet’s first season under Gennadi Nedvigin’s artistic direction marks a critical transition as the company leaves an era long led by John McFall. To date, Nedvigin’s meticulous coaching has polished and vivified this season’s “Nutcracker,” choreographed by McFall. February’s revival of “Carmina Burana” will likely reflect Nedvigin’s lustrous touch. In the spring, two Nedvigin-curated programs may show whether or not audiences who’ve come to appreciate cutting-edge dance will warm up to the Russian-born dancer’s more classically aligned vision and taste. A program called Gennadi’s Choice, March 17-19 at Cobb Energy Centre, will feature selections from “Paquita,” the North American premiere of “Vespertine” by Liam Scarlett and the world premiere of “Denouement” by Gemma Bond. In April, rising dancer Jackie Nash appears in Yuri Possokhov’s “Firebird” (April 14-16). ($26-$134, Cobb Energy Centre, 2800 Cobb Galleria Parkway, Atlanta. 404-892-3303, www.atlantaballet.com.)\nDance venue debuts\nShipping containers and abandoned railroad tracks seem unlikely places for dance concerts, but affordable venues are scarce in Atlanta. For many local choreographers, such site-specific performance spaces are as much an artistic trend as a necessity. That unfortunate state of affairs is about to change. On March 24-25, “Metamorphosis,” a full-length contemporary dance work by Ivan Pulinkala, chair of Kennesaw State University’s Department of Dance, is scheduled to open the Dance Theatre at KSU. The renovated, 450-seat theater with a permanently installed sprung Marley floor is located on the campus of what was formerly Southern Polytechnic University, but is now the Marietta campus for KSU. In addition to providing a home for the school’s dance program, the space will be available for low-cost rental to other dance troupes. Pulinkala hopes to eventually present touring groups, but for now, he’d like to see local dance companies call the Dance Theater their performance home. (1100 S. Marietta Parkway, Marietta. arts.kennesaw.edu/dance.)\nViolin virtuoso\nHilary Hahn, who takes the stage March 26 at Clayton State University’s Spivey Hall with pianist Robert Levin, is a celebrated violinist in a league with artists like Joshua Bell and Yo-Yo Ma – classical musicians that have crossed over into the broader pop culture conversation. Spivey is a fitting place to hear a musician of Hahn’s caliber; the hall is among the best venues in the metro area. Her Spivey concert will run the gamut from Baroque (a Bach sonata) to more contemporary fare; an Anton Garcia Abril partita, written for Hahn, and a solo piano work by Hans Peter Turk, composed for Levin, represent the 21st century. After intermission, Beethoven steps in, with Hahn performing the composer’s “Kreutzer” sonata. ($70, 2000 Clayton State Blvd., Morrow. 678-466-4200. www.spiveyhall.org.)\nR&B legends\nYou can imagine the level of respect Mariah Carey has for Lionel Richie to accept second billing on a tour with the R&B legend. Both artists secured residencies in Las Vegas in 2016, but beginning in March they will traverse the country for the 35-show “All the Hits” tour. They’ll bring their trove of classics — “All Night Long (All Night)” “Truly” and a list of Commodores hits for him and “Dreamlover,” “Fantasy” and about 10 more No. 1 songs for her. The pair hasn’t nailed down the format of the tour yet, but it would seem a wasted opportunity if Carey didn’t join Richie for a duet of “Endless Love.” (May 24. $39.95-$500. Philips Arena, 1 Philips Drive, Atlanta. 1-800-745-3000, www.ticketmaster.com.)\nComedy galore\nJust in time for some much-needed levity in the universe, comedian Chris Rock goes on tour for the first time in a decade, coming to the Fox May 26. ($65-$145, 660 Peachtree St., Atlanta. 404-881-2100, www.foxtheatre.org.) But you don’t have to wait that long for some comic relief. Huge names in comedy are coming to Atlanta in the coming months. Legendary talk show host Jay Leno brings his cavalcade of jokes to Cobb Energy Center Feb. 18, a place he sold out in 2014. A group of veteran comics grace Philips Arena April 7, including Mike Epps, Sommore, Tommy Davidson and Bruce Bruce. On the same night at the Fox Theatre, Jerry Seinfeld unleashes his wry observational humor. The following night, on April 8 at Cobb Energy Centre, part-time Atlantan Ron White returns with his scotch, cigar and mischievous grin. Former Villa Rica resident Rod Man, who won “Last Comic Standing” in 2014, headlines a show at the Buckhead Theatre April 15. His fellow “Blue Collar Comedy Tour” mates Jeff Foxworthy (of Alpharetta) and Larry the Cable Guy provide double the humor at the Fox on April 29.\nTrain a comin’\nBig things are coming to the Atlanta History Center, starting with a 50,000-pound, 51-foot-long artifact called Texas, one of two locomotives involved in the Civil War escapade known as the Great Locomotive chase. In fall 2017, the newly restored engine will be installed in its new home, a specially designed glass-front gallery connecting Atlanta History Museum’s Allen Atrium to the new Lloyd and Mary Ann Whitaker Cyclorama Building. Speaking of which, that really big 1887 painting, “The Battle of Atlanta,” viewed in the round at it former home in Grant Park, will be transported with much effort and care to the Atlanta History Center’s Buckhead campus this year to undergo months of restoration. There are plans to offer public tour of the restoration process, but those eager to see the painting fully installed at the center will have to wait until 2018. ($11-$16.50, 130 W. Paces Ferry Road NW, Atlanta. 404-814-4000, www.atlantahistorycenter.com.)\n— Contributed by Wendell Brock, Bo Emerson, Rodney Ho, Cynthia Bond Perry, Melissa Ruggieri, Jon Ross","url":"https://www.ajc.com/events/performing-arts/events-can-wait-see-2017/l2eFGLm8I6LFC247HdGkML/"}
