{"authors":["Lars Gotrich"],"date_download":"2018-10-22 20:33:21","date_modify":"2018-10-22 20:33:21","date_publish":"2014-12-30 00:00:00","description":"In 2014, metal still believes in traditions and keeps the faith, but recognizes that evolution is inevitable — with some of its defenders kicking and screaming.","filename":"data/vaneerConsumption/10FavoriteMetalAlbumsOf2014.json","image_url":"https://media.npr.org/assets/img/2014/12/28/riot_unleash-the-fire_wide-7e3eb4df50ceae4c729bccda3daa45d65ea6f4b2.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2014_12_30_372467357_10-favorite-metal-albums-of-2014_1540240401.html","title":"10 Favorite Metal Albums Of 2014","title_page":"10 Favorite Metal Albums Of 2014 : NPR","title_rss":"NULL","source_domain":"npr.org","text":"10 Favorite Metal Albums Of 2014\nEnlarge this image toggle caption Courtesy of the artist Courtesy of the artist\nI like to look at 2014 in metal through the lens of two very different, very thoughtful covers projects. In one, Brownout's joyous Brownout Presents Brown Sabbath, members of the Austin, Texas-based music collective took the iconic riffs of Ozzy-era Black Sabbath and surrounded them with a soulful horn section, funky Latin percussion and thick, thick fuzz. It plays with tradition, reinvigorating what we think about songs like \"N.I.B.\" and \"Hand of Doom\" and placing them in a cross-cultural context that is very approachable because it sounds like the border party of Ozzy's dreams.\nAt the other end of 2014 was The Soft Pink Truth's Why Do the Heathen Rage?, a record that not only brings black metal classics into the dance club but also appropriates their meanings. Sarcofago's \"Ready to F- - -\" becomes a glittery, queer house jam sung by Jenn Wasner (Wye Oak, Dungeonesse). Somewhere, somebody is voguing to \"Beholding the Throne of Might,\" Darkthrone's original now soundtracking executive realness. It's unapologetic, it's profane, it's delicious.\nNeither of these albums makes this year-end metal list because, well, they aren't metal. But they do illustrate how we think about tradition and what we value in this 40-year-old genre. Do we want the riffs? Yes. Do we want it heavy? Well, yes, c'mon. How do we feel about politically-charged lyrics? I mean, Metallica and Slayer stuck it to the man back in the day. What if metal was prettier? I mean, Anathema's cool and all ... What if a trio of Japanese girls started singing about chocolate and throwing up horns? Uhhhh ... What if the societal dynamic of metal changed? [Dead silence, followed by endless comment threads not worth linking to.]\nThese are the growing pains of 2014. We still believe in the traditions and keep the faith, but recognize that evolution is inevitable — some of us kicking and screaming. Below are my favorite metal albums of the year that, perhaps tellingly, straddle both: underground legends who never gave up the tradition, young guns that keep it going; an underground legend who never stops innovating, young metalheads leaping across genres.\nRanking be damned, this personal top 10 list is in alphabetical order. (If you're aching for more than 10 albums, head on over to my blog for the metal records I hated to cut.)","url":"https://www.npr.org/2014/12/30/372467357/10-favorite-metal-albums-of-2014"}
