{"authors":["Laurie Whitwell For Mailonline"],"date_download":"2018-10-23 02:20:36","date_modify":"2018-10-23 02:20:36","date_publish":"2016-01-11 14:15:48","description":"The FA Cup is a chance for youngsters at Premier League clubs to get match action, while players at lower leagues have an opportunity to show their ability against a higher level than usual.","filename":"data/vaneerConsumption/10FACupyoungsterswhoimpressedinthethirdroundrevealedbySportsmail.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300AAAD000000578-0-image-a-19_1452521634489.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3393972_Kemar-Roofe-scored-twice-against-Swansea-Kelechi-Iheanacho-struck-Manchester-City-Sportsmail-looks-10-youngsters-impressed-FA-Cup_1540261236.html","title":"10 FA Cup youngsters who impressed in the third round revealed by Sportsmail","title_page":"10 FA Cup youngsters who impressed in the third round revealed by Sportsmail | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"FA Cup third-round weekend might not have been awash with upsets but a number of young players made impressions worthy of notice.\nThe competition is a chance for those developing in the game at Premier League clubs to get match action, while players at lower leagues have an opportunity to show their ability against a higher level than usual.\nHere, Sportsmail looks at 10 young players who did well.\nKemar Roofe gave the standout performance of the round as he scored twice for Oxford against Swansea\nKemar Roofe, 23, Oxford United\nProbably gave the standout performance of the round, scoring two brilliant goals to fell Premier League Swansea. The attacking midfielder rifled in from 18 yards, then converted a rapid counter-attack to send his League Two side through. Possesses quality having spent six years at West Bromwich and is now getting his chance.\nTransfer potential\nUnlikely to go anywhere in January unless someone comes in with a crazy offer. Only £2million would make Oxford even consider it.\nConor Washington (right) scored a header, his 13th goal in 14, to help Peterborough claim victory over Preston\nConor Washington, 23, Peterborough\nThe in-form striker converted a towering header to confirm Peterborough’s victory over Championship Preston and take his run to 13 goals in his last 14 matches. He is another player to progress from non-League, having started at St Ives Town and Newport County.\nTransfer potential\nReading are believed to have failed with a £3m bid this month with chairman Darragh MacAntony also turning down two other clubs.\nOliver Burke was man of the match as Nottingham Forest defeated Queens Park Rangers in the third round\nOliver Burke, 18, Nottingham Forest\nAnother promising talent from Forest’s academy, the winger was man of the match in the victory over Queens Park Rangers. His burst from deep and cross-shot set up Jamie Ward’s winner, another fine display following on from his debut goal in the Christmas draw at Cardiff.\nTransfer potential\nForest’s embargo increases their reluctance to sell and an approach by Aston Villa has been rejected. Only made three starts but big promise.\nAaron Pierre (right) stood strong at centre-back for Wycombe as they held Aston Villa to a draw on Saturday\nAaron Pierre, 22, Wycombe\nDescribed as a special player by manager Gareth Ainsworth, the centre-back stood out against Aston Villa. His blocks, headers, and strength ensured a replay for the League Two side. He finished the game with a bandage wrapped round his head after injury. Born in Southall, London, Pierre started at Fulham before moving to Brentford, joining Wycombe in 2014.\nTransfer potential\nSuch is his physical stature he looks mature for his age and appears capable of Championship football. Wycombe’s finances are very tight.\nJoe Lolley starred in Huddersfield's 2-2 draw with Reading and is establishing himself in the Championship\nJoe Lolley, 23, Huddersfield Town\nGave a vibrant display in the 2-2 draw with Reading, striking a sweet shot from range and delivering a wonderful pass to start the move that saw the opening goal. He's working his way up the divisions having spent time at Littleton and Kidderminster.\nTransfer potential\nEstablishing his ability in the second tier with three goals in his last seven games and could attract interest.\nBen Chilwell played for Leicester against Tottenham and the left back is attracting interest from Liverpool\nBen Chilwell, 19, Leicester City\nClaudio Ranieri rates the young left back highly and is poised to keep him around the first-team squad after a loan at Huddersfield Town. His start at Tottenham was only his second in a Leicester shirt and he coped well against a fine Premier League attack.\nTransfer potential\nLiverpool are keen and are plotting £4m bid for the England Under 20 captain.\nSam Byram featured for Leeds against Rotherham and is attracting interest from Everton and Sunderland\nSam Byram, 22, Leeds United\nPlayed his part in victory for Steve Evans’ side, helping to keep a clean sheet against Rotherham. As usual, the right back got forward regularly and went close to scoring with a back-post effort. Vastly experienced for his age, Byram has more than 130 appearances for Leeds already.\nTransfer potential\nByram’s contract expires at the end of this season and Everton and Sunderland could make moves this window.\nRuben Loftus-Cheek scored his first Chelsea goal against Scunthorpe with a composed left-footed strike\nRuben Loftus-Cheek, 19, Chelsea\nProvided Roman Abramovich with the biggest smile of the day – in weeks, no doubt – by scoring his first goal for Chelsea in the victory over Scunthorpe. Arriving as a half-time substitute, he converted Cesar Azpilicueta’s cross with a composed left-footed strike.\nTransfer potential\nLoftus-Cheek will be staying at Chelsea with Guus Hiddink prepared to give him greater game time.\nKelechi Iheanacho scored his fifth goal of the season for Manchester City against Norwich in the third round\nKelechi Iheanacho, 19, Manchester City\nProduced a terrific, instinctive finish to help ease City past Norwich and score his fifth goal of the season on only his third start. He has made 11 appearances off the bench. He also showed good link-up play, flicking on a long ball in the move for Kevin De Buryne’s goal.\nTransfer potential\nManuel Pellegrini needs the Nigerian to supplement his relatively thin attack.\nMoussa Dembele scored his 11th goal of the season but could not stop Fulham losing to Sheffield Wednesday\nMoussa Dembele, 19, Fulham\nPut in another good show despite his side losing to Sheffield Wednesday, scoring his 11th goal of the season with sharp control and a smart finish. Also went close twice in the second half, denied by a super save from Joe Wildsmith – himself only 20 – and a flying block.\nTransfer potential","url":"https://www.dailymail.co.uk/sport/football/article-3393972/Kemar-Roofe-scored-twice-against-Swansea-Kelechi-Iheanacho-struck-Manchester-City-Sportsmail-looks-10-youngsters-impressed-FA-Cup.html"}
