{"authors":["Lauren Grounsell For Daily Mail Australia"],"date_download":"2018-10-22 21:00:33","date_modify":"2018-10-22 21:00:33","date_publish":"2016-01-28 06:03:40","description":"FEMAIL shares the 10 foods you should avoid to beat the bloating on your wedding day.","filename":"data/vaneerConsumption/10foodsyouneedtoavoidtopreventbloatingonyourweddingday.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/06/30A715EB00000578-0-image-a-61_1453960915429.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3420100_10-foods-need-avoid-prevent-bloating-wedding-day_1540242033.html","title":"10 foods you need to avoid to prevent bloating on your wedding day","title_page":"10 foods you need to avoid to prevent bloating on your wedding day | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Dietitian Geraldine Georgeou said not eating can also cause bloating\nBrides tempted to skip a meal on their wedding day – beware.\nNot eating regularly can cause your stomach to bloat, but what you eat is just as important.\nAccredited practicing dietitian and director of Designer Diets Geraldine Georgeou told Daily Mail Australia short chain carbs and foods like beans, carbonated beverages and reheated rice can cause your stomach to swell.\n‘It’s important when preparing for your wedding day to don’t not eat,’ she said.\nScroll down for video\nBloated bride? To avoid feeling uncomfortably full on your wedding day, try avoid bloat-inducing foods\nFeeling full: Bloating can be caused by an imbalance of bacteria in the stomach and some foods can cause gas\n‘People who have trouble with bloating are often not eating regularly.’\nShe said different foods could cause bloating because the bacteria in your stomach is not balanced, they contain artificial sweeteners that can irritate the stomach or create irritable-bowel like symptoms or the foods are gassy, causing wind and bloating.\nHere FEMAIL looks at the foods you should ditch before you get hitched to beat the bloating and feel your best walking down the aisle.\nCHEWING GUM\nSpit it out: Chewing gum contains artificial sweeteners that can irritate the stomach\nChewing gum might seem innocent enough, but it will leave you with more than fresh breath.\n'Chewing gum has artificial sweeteners known as polyols, and polyols are known to irritate or create irritable bowel like symptoms in people,' Mrs Georgeou said.\nPopsugar.com.au reported gum also causes you to swallow more, and the excess air can bloat the stomach.\nBEANS\nThe musical fruit! A bowlful of beans can cause wind and bloating in some people\nThey're not called the 'musical fruit' for nothing.\nMrs Georgeou said beans are a high-fructan food which can cause adverse reactions in some people.\n'These foods, for some people, can create more wind and bloating,' she said.\nFor your wedding day, she advised: 'Try not to have a big bowl of beans, like red beans or lentils'.\nCARBONATED BEVERAGES\nPut down the bubbles: Carbonated beverages can cause gas in the stomach and bloating\nPut simply, bubbly beverages will make you gassy.\nFizzy drinks, Champagne or even sparkling mineral water can make your stomach bloat, and as Mrs Georgeou put it, the excess gas has 'got to come out somehow'.\nTo avoid any unpleasantness stick with still, not sparkling.\nREHEATED RICE\nNot so nice: Reheated rice can produce a gas in your stomach that leaves you feeling bloated\nGot leftover Thai food in the fridge? Think again before reheating your curry.\nReheated rice can produce gas, leaving you uncomfortably full.\nMrs Georgeou advised brides-to-be to steer clear.\nONION AND GARLIC\nPacks a punch: Onions and garlic are short-term carbs that can cause bloating, stomach pain, diarrhea or constipation\nThey add an extra kick to any dish, but brides-to-be would be best to avoid onion and garlic.\nThe potent vegetables are short-term carbohydrates which can make your stomach swell.\nMrs Georgeou said other side effects could be stomach pain, diarrhea or constipation.\nJUNK FOOD\nBloating binge: Fatty foods take longer to digest than protein or carbohydrates\nIt might seem obvious, but junk food is definitely one to avoid in the lead up to your big day.\nPizza, burgers or fries are full of fat, which can take longer to digest than protein or carbohydrates.\nThe result? You feel uncomfortable stuffed.\nDAIRY\nSilent side effects: 'Some people get bloating from lactose unknowingly,' Mrs Georgeou said\nIt might be packed with calcium, but dairy products can cause some people distress if they have trouble digesting lactose or milk sugar.\n'Some people get bloating from lactose unknowingly,' Mrs Georgeou said.\n'Make sure to be aware of that.'\nCRUCIFEROUS VEGETABLES\nNot today: Certain vegetables, such as cauliflower or brussel sprouts, have sugars and starches that cause gas\nVeggies might seem a safe choice.\nBut brussel sprouts, cabbage, cauliflower or carrots can cause bloating.\nThese vegetables contain sugars and starches that can cause gas in the stomach.\nSALTY FOODS\nSalty snack? Try not to, as excess sodium causes water retention in the body\nWant to feel slim on your wedding day? Steer clear of high-salt snacks.\nPopsugar reported salt can cause the body to retain water.\nThe trick? Stick to less than 2,000 milligrams a day.\nALCOHOL\nJust water, thanks: Booze can cause sulfur-bearing gases and weaken the digestive system\nDrinking too much on your wedding day will leave you with more than just a hang over.\nPopsugar reported alcohol can cause sulfur-bearing gases and weaken the digestive system.","url":"https://www.dailymail.co.uk/femail/article-3420100/10-foods-need-avoid-prevent-bloating-wedding-day.html"}
