{"authors":["Amy Sciarretto"],"date_download":"2018-10-30 23:00:29","date_modify":"2018-10-30 23:00:29","date_publish":"2014-08-14 14:30:03","description":"Halle Berry celebrates her 48th birthday today (August 14) and the actress has dazzled fans for years with her films. But her increasingly classic personal style (that's perfect outfit inspiration for your next interview) , is ever-evolving and…","filename":"data/vaneerConsumption/10HalleBerryFashionMomentsThatProveShesStillAStyleStormToBeReckonedWith.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/31ff3fed-e636-4f6b-897f-d23174e8f6ea.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35736-10-halle-berry-fashion-moments-that-prove-shes-still-a-style-storm-to-be-reckoned-with_1540940429.html","title":"10 Halle Berry Fashion Moments That Prove She's Still A Style Storm To Be Reckoned With","title_page":"10 Halle Berry Fashion Moments That Prove She's Still A Style Storm To Be Reckoned With","title_rss":"NULL","source_domain":"bustle.com","text":"Halle Berry celebrates her 48th birthday today (August 14) and the actress has dazzled fans for years with her films. But her increasingly classic personal style (that's perfect outfit inspiration for your next interview) , is ever-evolving and always incorporates sexy touches. The mother of two is known for her pixie cut, which she has said doesn't define her, even though it shows off her fine features. She is also celebrated for her flawless frame. All these things have made Berry a style icon.\nEven when she dealt with wayward hubbies (Eric Benet) or battles between her two baby daddies (Gabriel Aubry, the father of her daughter Nahla, and current husband, actor Olivier Martinez, the father of her son Maceo), Berry always emerges from the drama with grace and style.\nBerry's style, which can be best defined as new classic and sexy, does have some instantly recognizable hallmarks. While Berry has diverged from her signature short 'do occasionally in the past, she always returns to it and is rocking it currently. She is also comfortable showing off her killer figure in clingy couture and a variety of red carpet ensembles. Slits? She doesn't fear those and can often be found wearing something that highlights her legginess. Her style is age-appropriate but still fun and youthful, making this Oscar winner someone to emulate, no matter what your age.\nThese are 10 of Halle Berry's (mostly) recent fashion hits that demonstrate how she has refined and developed her unique style at this point in her amazing life. Yep, she's fine. I said it. It's a fact that cannot be denied.\n1. Gunmetal Girl\nMark Davis/Getty Images Entertainment/Getty Images\nBerry's gunmetal knit dress, worn to an Extant event earlier this summer, hugged every last one of her curves. The Jenny Packham frock looked like it was designed precisely with Berry in mind.\n2. Asymmetrically Awesome\nJoe Scarnici/Getty Images Entertainment/Getty Images\nThis Elie Saab gown showed major thigh — thanks to a slit of perfect height on one side — and left her arm uncovered, save for a single cap sleeve on the other. The asymmetry of this black dress with cherry blossom print was stunning and anything but basic. Saab is a go-to for Berry; she wore one of his designs when picking up her Best Actress Oscar in 2002.\n3. The Now-Classic Oscar Dress\nVince Bucci/Getty Images Entertainment/Getty Images\nSpeaking of her Oscar 2002 dress, the Saab creation is still recalled, fondly, as an all-time Academy Awards fave by fashion critics, thanks to the burgundy color, metallic skirt, and sheer top, which mixed different elements and materials seamlessly.\n4. Well Hello There LBD\nDimitrios Kambouris/Getty Images Entertainment/Getty Images\nWhoa! LBDs are LBDs — little and black. But Berry's clingy Michael Kors dress, worn while little Maceo was gestating in 2013, was another \"Wowza\" moment.\n5. Hellbent For Leather\nKevin Winter/Getty Images Entertainment/Getty Images\nBerry executed separates in edgy, rock 'n' roll fashion here, pairing an asymmetrical leather pencil skirt with strappy heels, a simple black top, and a chain belt. I want to go shopping right now and recreate this look.\n6. Multi-Way Maxi Style\nAndreas Rentz/Getty Images Entertainment/Getty Images\nBerry likes to show off her killer gams with slits in form-fitting dresses. It's one of her preferred silhouettes and it's so awesome since one outfit can look totally different depending on how she walks and at what angle. Above, her smoky-hued dress is a stretchy, sexy sheath with a slit. But below...\nAndreas Rentz/Getty Images Entertainment/Getty Images\n...it looked like a comfy and clingy maxi. That's an enviable style move. Check out the intangible accessory, which would be the confidence with which she strutted.\n7. Silver Fox\nKevin Winter/Getty Images Entertainment/Getty Images\nThis blingy, strapless, and silver Dolce & Gabbana mini called attention to Berry's toned shoulders, arms, and legs. Who needs to be a golden goddess when you can be a silver one?\n8. Okay, So She Is A Golden Goddess, Too\nMichael Caulfield/Getty Images Entertainment/Getty Images\nBerry loves a strapless mini and it's a shape she revisits. She wore this teeny, gilded cocktail number in 2010, flashing just enough dewy skin. To borrow a phrase from Clueless: \"Nice stems.\"\n9. Another Standout Black Gown\nKevin Winter/Getty Images Entertainment/Getty Images\nBow down to Berry! The top half of a black gown, donned in 2010, showed off just enough cleavage.\nKevin Winter/Getty Images Entertainment/Getty Images\nIt was even more artistic from this angle, thanks to the open back. It was certainly an eye-catching dress, but Berry still held all the attention.\n10. Long Hair, Don't Care\nFrancois Durand/Getty Images Entertainment/Getty Images\nWhile the gamine pixie is Berry's signature, even more so than it is Rihanna's, she has sported a long cascade of curls, like so! We're not used to her in a tea length frock, like this one, but she remained sublimely scorching.\nImages: Getty Images (12)","url":"https://www.bustle.com/articles/35736-10-halle-berry-fashion-moments-that-prove-shes-still-a-style-storm-to-be-reckoned-with"}
