{"authors":["Associated Press"],"date_download":"2018-10-23 03:15:20","date_modify":"2018-10-23 03:15:20","date_publish":"2017-03-16 14:04:16","description":"MILAN (AP) - Volcanic rocks and steam injured at least 10 people, including tourists and scientists, following an explosion on Sicily's Mount Etna Thursday,...","filename":"data/vaneerConsumption/10injuredinexplosiononeruptingMountEtnavolcano.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/15/wire-229145-1489677277-504_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320418_Injuries-reported-explosion-erupting-Mount-Etna_1540264520.html","title":"10 injured in explosion on erupting Mount Etna volcano","title_page":"10 injured in explosion on erupting Mount Etna volcano | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MILAN (AP) - Volcanic rocks and steam injured at least 10 people, including tourists and scientists, following an explosion on Sicily's Mount Etna Thursday, witnesses and media reported.\nTourists had been drawn to Etna to observe the spectacle of the active volcano erupting, only to be caught by surprise when spewing magma hit snow, causing an explosion.\nThe president of the Italian Alpine Club chapter in Catania, Umberto Marino, was traveling up the volcano in a snowcat when injured people started running in his direction.\nMount Etna, Europe's most active volcano, is seen from the side of a road as it spews lava during an eruption in the early hours of Thursday, March 16, 2017. A new eruption which began on March 15 is causing no damages to Catania's airport which is fully operational. (AP Photo/Salvatore Allegra)\n\"The material thrown into the air fell back down, striking the heads and bodies of people who were closest,\" Marino was quoted by the Catania Today website as saying.\nAccording to Italian news agency ANSA, six people were hospitalized, mostly with head injuries. None of the injuries was listed as grave.\nAmong those present on the mountain at the time of the midday explosion were scientists from Italy's volcanology institute. The institute said its staff were among the injured, but did not immediately have details of how many or how badly they were hurt.\nThe BBC's global science reporter, Rebecca Morelle, also was on the mountain, and described the experience in a series of tweets.\n\"Running down a mountain pelted by rocks, dodging burning boulders and boiling steam - not an experience I ever ever want to repeat,\" she wrote.\nThe BBC crew was shaken, but physically OK, having suffered cuts, bruises and burns, she wrote.\nMorelle said the explosion was \"a reminder of how dangerous (and) unpredictable volcanoes can be.\"\nMount Etna has been active for the past two days, creating a visual spectacle as it spews lava and ash into the air. A new lava flow started from the southeastern crater on Wednesday.\nSo far it has not disrupted traffic at the nearby Catania airport or created inconvenience for residents in the area.\nSnow-covered Mount Etna, Europe's most active volcano, spews lava during an eruption in the early hours of Thursday, March 16, 2017. A new eruption which began on March 15 is causing no damages to Catania's airport which is fully operational. (AP Photo/Salvatore Allegra)\nSnow-covered Mount Etna, Europe's most active volcano, spews lava during an eruption in the early hours of Thursday, March 16, 2017. A new eruption which began on March 15 is causing no damages to Catania's airport which is fully operational. (AP Photo/Salvatore Allegra)\nSnow-covered Mount Etna, Europe's most active volcano, spews lava during an eruption in the early hours of Thursday, March 16, 2017. A new eruption which began on March 15 is causing no damages to Catania's airport which is fully operational. (AP Photo/Salvatore Allegra)\nSnow-covered Mount Etna, Europe's most active volcano, spews lava during an eruption in the early hours of Thursday, March 16, 2017. A new eruption which began on March 15 is causing no damages to Catania's airport which is fully operational. (AP Photo/Salvatore Allegra)","url":"https://www.dailymail.co.uk/wires/ap/article-4320418/Injuries-reported-explosion-erupting-Mount-Etna.html"}
