{"authors":["Press Association"],"date_download":"2018-10-22 23:11:49","date_modify":"2018-10-22 23:11:49","date_publish":"2016-01-29 10:55:51","description":"Detectives are offering a £10,000 reward for information which leads to the arrest of a teenager suspected of killing a 16-year-old boy at a party. Munashe C...","filename":"data/vaneerConsumption/10krewardoverfatalstabbingof16yearoldboyatparty.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-689b65bc-5095-40c1-8af7-1b16986041e1-3bmscybNe842cce83474b5482bbd-173_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3422327_10k-reward-fatal-stabbing-16-year-old-boy-party_1540249909.html","title":"£10k reward over fatal stabbing of 16-year-old boy at party","title_page":"£10k reward over fatal stabbing of 16-year-old boy at party | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"£10k reward over fatal stabbing of 16-year-old boy at party\nDetectives are offering a £10,000 reward for information which leads to the arrest of a teenager suspected of killing a 16-year-old boy at a party.\nMunashe Charles Kutyauripo, known as Charlie, was stabbed to death outside a female friend's 16th birthday party at playing fields in Woodford, east London.\nScotland Yard have named Aaron Alexander Tavares-Gaiete, also 16, as a prime suspect and are appealing for help to track him down.\nMunashe Charles Kutyauripo, known as Charlie, was stabbed to death in Woodford, east London (Metropolitan Police/PA)\nSpeaking for the first time about the murder, Charlie's brother, Dennis, 21, said the family had been left broken by his death.\nHe said: \"Charlie was someone I turned to all the time. He was younger than I am, but in my whole life I have not met anyone who understood me like he did.\n\"The situation breaks you every time and we really cannot move forward at the moment.\"\nHe urged anyone who knows anything about the murder to speak to police.\nHe said: \"We are appealing to anybody to come forward with information because it could have happened to their family. If this happened to them I am sure they would want answers too.\"\nCharlie, a student from Collier Row, Havering, east London, was seen leaving the birthday party at the social club at Ashton playing fields at 9.35pm on Saturday January 9 with someone police believe was Aaron.\nOutside, the pair became embroiled in an altercation and Charlie was fatally stabbed once in the chest as four other teenage boys looked on.\nOther party-goers dashed out to try to help him, but Charlie died.\nAaron ran away from the social club and was seen in Snakes Lane East, Woodford. He was last spotted in Stratford, east London, the day after the murder.\nOfficers have launched a manhunt for Aaron, who is black, 5ft 10in and of slim build with facial hair. He was last seen wearing a dark hooded jacket with a yellow motif on the left sleeve, dark coloured trousers and trainers. He was also carrying a distinctive black \"man bag\" with a white Nike logo.\nDetective Chief Inspector Mark Lawson, from the Homicide and Major Crime Command, said: \"I am sure that there are people out there who know where Aaron is and are helping him, by offering a place to stay or money.\n\"If you are doing that through loyalty to Aaron, it's important that you understand that you leave yourself open to arrest - assisting an offender is a serious offence.\n\"If you are worried about speaking out and contacting the police, then we can offer you support, reassurance and also confidentiality.\n\"If you know where Aaron is, or have information about who may be helping him, then please get in touch with us.\"\nHe added: \"Charlie's family deserve answers, they are devastated by his loss, and they want answers.\"\nFour people have been arrested and bailed in connection with the investigation.","url":"https://www.dailymail.co.uk/wires/pa/article-3422327/10k-reward-fatal-stabbing-16-year-old-boy-party.html"}
