{"authors":[],"date_download":"2018-10-22 21:15:18","date_modify":"2018-10-22 21:15:18","date_publish":"2014-06-04 19:11:36","description":"A 90-foot yacht was being launched in Washington state when it suddenly capsized. The cause is under investigation.","filename":"data/vaneerConsumption/10MillionYachtSinksDuringLaunchinWashingtonState.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/487866/140604-yacht-overturns-wash-1537_bf0a678ae4709991fb0a640e06574011.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_business-news_10-million-yacht-sinks-during-launch-washington-state-n122711_1540242918.html","title":"$10 Million Yacht Sinks During Launch in Washington State","title_page":"$10 Million Yacht Sinks During Launch in Washington State","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA $10 million, 90-foot yacht was being launched in Washington state when it suddenly capsized.\nThe yacht, named Baden, had already been lowered into the water in Anacortes, about 80 miles north of Seattle, when it slowly tilted and then sank, according to media reports.\nThe cause of last month's accident is under investigation, but New World Yacht Builders, which built the yacht under the Northern Marine brand, said the problem appeared to be in the launch apparatus, not with the boat.\n\"The physical evidence on, and adjacent to, the launch ramp suggests that the dolly carrying the weight of the port stern of the yacht may have suddenly dropped off the edge of the boat ramp during the launch, causing the vessel to experience a sudden list to port, from which it could not recover in its light condition for launch,\" Northern Marine said in a press release.\nA YouTube video from YachtVid shows someone at the launch ceremony breaking the ritual champagne bottle on the hull before the boat slid into the water.\nAs it entered the water, the vessel started to lean to the port side, and then quickly capsized. Six people were on board and all escaped serious injury, according to reports.\nNorthern Marine said it has launched more than 35 vessels at the same ramp with no previous problems. Baden is a so-called \"explorer yacht,\" designed more for remote expeditions than leisure.\nThe company added that it has \"complete confidence\" in its designs. According to a local media report, New World Yacht has since laid off its staff of 52 and production has been suspended.\n—CNBC and NBC News staff","url":"https://www.nbcnews.com/business/business-news/10-million-yacht-sinks-during-launch-washington-state-n122711"}
