{"authors":["Sarah Kimmorley","Business Insider Australia"],"date_download":"2018-10-31 00:16:49","date_modify":"2018-10-31 00:16:49","date_publish":"2016-12-02 00:00:00","description":"Here's what you need to know on Friday, December 2.","filename":"data/vaneerConsumption/10mostimportantthingsinworldDecember2.json","image_url":"https://amp.businessinsider.com/images/58412835dd089532448b4724-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-10-most-important-things-in-the-world-right-now-december-2-2016-12_1540945009.html","title":"10 most important things in world, December 2","title_page":"    10 most important things in world, December 2 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"U.S. President Barack Obama sings Jingle Bells with Santa Claus and Chance the Rapper (L) at the National Christmas Tree lighting in Washington, U.S. December 1, 2016. REUTERS/Jonathan Ernst Hello! Here's what you need to know on Friday.\n1. US President-elect Donald Trump has picked Marine Gen. James \"Mad Dog\" Mattis for the role of defense secretary. Mattis will oversee roughly 3 million military and civilian personnel and face myriad challenges, from ISIS and to the ongoing territorial and strategic dispute in the South China Sea.\n2. Theranos is retiring its board of counselors. That means Henry Kissinger and George Shultz are out.\n3. The IRS is threatening to tear down Bitcoin's veil of privacy, to pursue customer identities and 2014 to 2015 transaction records from Coinbase, the largest Bitcoin exchange in the US.\n4. Francois Hollande will not seek a second term as the French president. This makes Hollande the first president in modern French history not to seek re-election.\n5. Paris, Mexico City, Madrid, and Athens will stop using diesel-powered cars and trucks. The leaders of those four major global cities say their plan, to improve air quality, will be complete by the middle of the next decade.\n6. Children in South Africa are becoming resistant to AIDS— and nobody knows why.\n7. Six tennis players, and another 34 people, have been arrested for match-fixing in Spain. Police allege the accused deliberately arrange the loss of tennis games in at least 17 different events.\n8. US companies won't be able to leave the country anymore \"without consequences\", according to President-elect Donald Trump. He added that his administration will aim to reduce business regulation to support the local economy.\n9. A Russian supply space craft headed for the International Space Station never made it after being \"burned up\". The unmanned cargo ship was destroyed as it passed through the atmosphere at an altitude of 190km.\n10. Italy's referendum is on Sunday - and it could move markets. How exactly? No one can be sure after Brexit and the US election this year. But this excellent flow chart provides a whole series of potential outcomes to consider.\nAnd finally...\nYou've been eating Toblerone wrong.","url":"https://www.businessinsider.com/the-10-most-important-things-in-the-world-right-now-december-2-2016-12"}
