{"authors":["Sarah Kimmorley","Business Insider Australia"],"date_download":"2018-10-30 23:34:54","date_modify":"2018-10-30 23:34:54","date_publish":"2016-12-06 00:00:00","description":"Here's what you need to know on Tuesday, December 6.","filename":"data/vaneerConsumption/10mostimportantthingsinworldDecember6.json","image_url":"https://amp.businessinsider.com/images/58466d5cdd08953f448b4cc3-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-10-most-important-things-in-the-world-right-now-december-6-2016-12_1540942494.html","title":"10 most important things in world, December 6","title_page":"    10 most important things in world, December 6 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A reveller dressed as a devil gives sweets to children, on the eve of Saint Nicholas Day, at the Old Town Square in Prague, Czech Republic December 5, 2016. REUTERS/David W Cerny Hello! Here's what you need to know on Tuesday.\n1. The CEO of United Technologies, parent company of Carrier, has let slip there will be fewer jobs as consequence of a deal struck between Donald Trump and the air-conditioner manufacturer. The admission comes after pressure from the US president-elect and a pledge to keep 1000 jobs in Indiana from moving to Mexico. Automation will be used to drive down costs, meaning fewer jobs anyway.\n2. US Vice President Joe Biden could run for president again in 2020. While his comments fell short of a commitment to challenge Donald Trump in four years, Biden seems to be at least leaving the door open.\n3. A mistrial has been declared in the murder trial of a US policeman who allegedly killed an unarmed black man. The decision came because despite deliberating for more than 22 hours over four days, the jury was unable to reach a consensus.\n4. Donald Trump had an \"extremely interesting conversation\" on climate change with former US Vice President Al Gore. Trump has previously expressed skepticism on the issue.\n5. Markets are muted after the Italian referendum, but instability could be starting to simmer under the surface. Based on uncertainty caused by recent events such as Brexit and a Trump presidency, financial markets have made it clear that they don't like not knowing what is next.\n6. One person is dead, two others are injured after after vehicles plunged into a water-filled sinkhole in Texas. Utility officials say the sinkhole appeared after a sewer line ruptured during heavy rain.\n7. South Korean corporate chiefs have denied seeking favors for donations. The alleged donations were sought for charities backing initiatives by President Park Geun-hye, in exchange for special treatment. Park, who has offered to step down in the face of constant protests, is also fighting off a looming impeachment vote over corruption scandals.\n8. Tribal clashes leave 31 people dead in the Democratic Republic of Congo. The violence between tribal militia and security forces was sparked by a row between an uncle and a nephew over the title of a traditional chief.\n9. Both Russia and China have blocked a UN demand for a seven-day truce in Syria's Aleppo. Russia argued a truce would allow rebel fighters to strengthen their positions.\n10. Israel's parliament has retroactively legalised thousands of settler homes on Palestine's West Bank. The move has been condemned by the UN and US and even prime minister Benjamin Netanyahu warned senior politicians could face the International Criminal Court in the Hague as a result.\nAnd finally … The 20 most common hobbies of the richest people in the world.","url":"https://www.businessinsider.com/the-10-most-important-things-in-the-world-right-now-december-6-2016-12"}
