{"authors":["Sarah Kimmorley","Business Insider Australia"],"date_download":"2018-10-30 21:04:33","date_modify":"2018-10-30 21:04:33","date_publish":"2016-12-22 00:00:00","description":"Here's what you need to know on Thursday, December 22.","filename":"data/vaneerConsumption/10mostimportantthingsinworldDecember22.json","image_url":"https://amp.businessinsider.com/images/585b85e6dd08959b7f8b47c9-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-10-most-important-things-in-the-world-right-now-december-22-2016-12_1540933473.html","title":"10 most important things in world, December 22","title_page":"    10 most important things in world, December 22 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"People walk into a giant illuminated Christmas ball installed on Oktyabrskaya Square for the upcoming New Year and Christmas season in Minsk, Belarus December 21, 2016. REUTERS/Vasily Fedosenko Hello! Here's what you need to know on Thursday.\n1. Berlin police are offering a €100,000 reward for Anis Amri, the prime suspect after a truck drove through a Christmas market on Monday, killing 12 people.\n2. British MPs will almost certainly be given a final vote on Brexit. As Business Insider's Adam Bienkov writes, \"If the Supreme court decide, as is likely, that MPs must be given a vote on triggering Article 50, then it is surely inconceivable that they would not also be given a vote on the final exit deal.\"\n3. Uber has shut down its self-driving car program in San Francisco after regulators revoked the registration of the vehicles. Apparently the ride-sharing company didn't obtain the proper licence from the DMV that is required by all self-driving carmakers.\n4. Japan plans to boost its Coast Guard budget to 210 billion yen, as well as add five new patrol ships and over 200 more personnel, as the dispute with China over islands in the East China Sea heats up. It's part of a steady military build up in response to China's increasing maritime presence.\n5. Las Vegas just became the largest US city to run on 100% renewable energy. City officials had been working toward this goal since 2008, when they first began the transition to renewable energy. Since then, the city has saved some $5 million a year.\n6. Delta airlines is denying a claim that it allegedly removed a YouTube star from a flight for speaking Arabic. Adam Saleh, who is notorious for his pranks on YouTube, and a friend were removed from a Delta flight following \"disturbance in the cabin,\" says the airline. Saleh said he will be contacting his lawyers.\n7. Boeing will build the next US Air Force aircraft for less than $4 billion after meeting with US President-elect Donald Trump. Trump described the cost for Boeing's contract to develop the next presidential fleet as \"out of control.\"\n8. Almost all communication between the US and Russia has ceased, according to the Kremlin. Tensions between Moscow and Washington are growing, a month before US President Barack Obama hands over power to Donald Trump, who has praised Russian president Vladimir Putin.\n9. An effort to repeal North Carolina's \"bathroom law\" has failed, ending what was expected to be a day of bipartisan compromise in one of America's most bitterly divided states. The law, known as House Bill 2, has cost the state hundreds of millions of dollars.\n10. US President-elect Donald Trump has tapped Peter Navarro to lead a newly formed White House National Trade Council. Navarro is an economic adviser to Trump's campaign and is well known for his tough-on-China stance, which matches up with Trump's rhetoric from the campaign trail.\nAnd finally …\nA Cold War technology designed to make jets fly for days might solve Earth's looming energy crisis.","url":"https://www.businessinsider.com/the-10-most-important-things-in-the-world-right-now-december-22-2016-12"}
