{"authors":["Sarah Kimmorley","Business Insider Australia"],"date_download":"2018-10-30 22:28:34","date_modify":"2018-10-30 22:28:34","date_publish":"2016-12-13 00:00:00","description":"Here's what you need to know on Tuesday, December 13.","filename":"data/vaneerConsumption/10mostimportantthingsinworldDecember13.json","image_url":"https://amp.businessinsider.com/images/584fa865dd08955d558b494c-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-10-most-important-things-in-the-world-right-now-december-13-2016-12_1540938514.html","title":"10 most important things in world, December 13","title_page":"    10 most important things in world, December 13 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Children enjoy a ride in an amusement park during a celebration to mark the birthday anniversary of Prophet Mohammad, in Kairouan, Tunisia December 12, 2016. REUTERS/Zoubeir Souissi Hello! Here's what you need to know on Tuesday.\n1. Exxon Mobil CEO Rex Tillerson looks set to be named as US President-elect Donald Trump's secretary of state. It comes after former Massachusetts Gov. Mitt Romney posted on Facebook to say it was an honor to be considered for the role.\n2. Philip Hammond has admitted Brexit will take too long for Britain to stick to the Article 50 timeline. The chancellor of the exchequer is the first senior minister in Theresa May's government to admit that Brexit is going to be harder, take longer, and cost more than previously thought.\n3. Italy's new Prime Minister, Paolo Gentiloni, has announced his new cabinet. Gentiloni succeeds Matteo Renzi, who resigned after losing a referendum eight days ago.\n4. The 300,000 passengers who travel on Britain's Southern train services every weekday will have to find another way to commute today, after the unionised drivers went on strike for 48 hours.\n5. Donald Trump will wait until January to reveal his plans for leaving his businesses. The US president-elect was due to announce his plan this week, but said he wanted more time so he could focus on appointing members of his future Cabinet.\n6. Venezuela is shutting down its border to combat currency smuggling. It comes after the government gave 72-hours notice that it would pull the 100-bolivar bank note from circulation in an effort to fight smuggling and food scarcity.\n7. Britain has a new legal definition of \"anti-Semitism,\" in an attempt to curb hate crimes against Jews, which have been on the rise post-Brexit.\n8. Cuba has signed a deal for faster internet access to Google content. The agreement between the tech giant and Cuba's state-run telecommunications company Etecsa, comes after US President Barack Obama restored relations with the country earlier this year.\n9. UN secretary-general Ban Ki-moon has voiced alarm \"over reports of atrocities against a large number of civilians\" in Aleppo, Syria and urged all the sides to protect civilians. 50,000 people are thought to remain under bombardment in Aleppo with the Russians refusing to a ceasefire to allow people to evacuate.\n10. The governor of Jakarta, Indonesia is on trial for blasphemy, accused of insulting Islam by misusing a Koranic verse to increase his chances in an upcoming governorship election. Basuki Tjahaja Purnama, known as Ahok, is the city's first non-Muslim governor in more than 50 years.\nAnd finally …\nGoogle employees confess all the things they hated most about working at Google.","url":"https://www.businessinsider.com/the-10-most-important-things-in-the-world-right-now-december-13-2016-12"}
