{"authors":["Sarah Kimmorley","Business Insider Australia"],"date_download":"2018-10-30 21:49:52","date_modify":"2018-10-30 21:49:52","date_publish":"2016-12-16 00:00:00","description":"Here's what you need to know on Friday, December 16.","filename":"data/vaneerConsumption/10mostimportantthingsinworldDecember16.json","image_url":"https://amp.businessinsider.com/images/58539b62dd08952b208b4583-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-10-most-important-things-in-the-world-right-now-december-16-2016-12_1540936192.html","title":"10 most important things in world, December 16","title_page":"    10 most important things in world, December 16 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Aymara witch doctors perform during a farewell ceremony of the totora reeds 'Viracocha III', a boat made only from the reed, as it is being prepared to cross the Pacific from Chile to Australia on an expected six-month journey, in La Paz, Bolivia December 15, 2016. REUTERS/David Mercado Hello! Here's what you need to know on Friday.\n1. US President Barack Obama is planning to take action against Russia over the election hacking scandal. It comes after a report from US Intelligence revealed Russian president Vladimir Putin personally supervised the hacking.\n2. Buses have evacuated thousands of Aleppo residents under a ceasefire deal that would end years of fighting for the city. Some 3,000 civilians and more than 40 wounded people, including children, have already been evacuated.\n3. Britain will be given a £50 billion ($62.1 billion) bill as soon as Prime Minister Theresa May triggers Article 50 and starts the official two-year Brexit negotiation process, according to one of the European Union's chief Brexit negotiators.\n4. Traces of explosives have been found on victims of an EgyptAir flight that crashed in May. A criminal investigation will now begin into the crash of Flight 804, which killed all 66 people on board.\n5. China is militarising islands in the disputed South China Sea, and there are photos to prove it. The mysterious hexagonal facilities the Chinese began installing on the islands appear to be anti-aircraft and anti-missile systems, according to the Asia Maritime Transparency Initiative (AMTI), a unit of the Center for Strategic and International Studies.\n6. European Union leaders have agreed to extend the bloc's main economic sanctions against Russia over the turmoil in Ukraine for six months until mid-2017. The bloc slapped sanctions on Russia after it annexed Ukraine's Black Sea peninsula of Crimea from Ukraine in 2014 and stepped them up as Moscow went on to support a separatist rebellion in Ukraine's industrial east.\n7. Dylann Roof has been found guilty of federal hate crimes after he killed nine black church members in South Carolina in June 2015. The same jury will reconvene next month to decide whether Roof should get the death penalty or be sentenced to life in prison.\n8. Iraq is already cheating on OPEC's output deal. Just a week after it agreed to OPEC's output-cut deal, Iraq is showing signs of going rogue, and instead of cutting crude exports — a logical byproduct of lowered production — it plans to increase oil sales in January.\n9. Theresa May wants an early deal on what Brexit means for the status of Britons in Europe and EU citizens in the UK. It comes after there has been concern in other countries about the status of their nationals in the UK, post-Brexit.\n10. China says no country can be an exception to the \"one China\" principle. Chinese Foreign Minister Wang Yi said the principle is the prerequisite and basis for other countries to develop their relations with China.\nAnd finally …\nHere are the 11 best memes of 2016.","url":"https://www.businessinsider.com/the-10-most-important-things-in-the-world-right-now-december-16-2016-12"}
