{"authors":["Charles Clark"],"date_download":"2018-10-30 20:31:38","date_modify":"2018-10-30 20:31:38","date_publish":"2016-12-30 00:00:00","description":"Here's what you need to know on Friday, December 30.","filename":"data/vaneerConsumption/10mostimportantthingsinworldDecember30.json","image_url":"https://amp.businessinsider.com/images/5866078add089510208b4c6f-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-10-most-important-things-in-the-world-right-now-december-30-2016-12_1540931498.html","title":"10 most important things in world, December 30","title_page":"    10 most important things in world, December 30 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"North Korean leader Kim Jong Un attends a performance held for participants of the ruling party's party meeting in this undated picture provided by KCNA in Pyongyang on December 29, 2016. KCNA/via Reuters Hello! Here's what you need to know on Friday.\n1. President Obama has expelled 35 Russian diplomats from the US in response to \"malicious cyber-enabled activities\" targeting the presidential election. The diplomats will be given 72 hours to leave the country.\n2. Syria's Russian-backed ceasefire has been ushered in despite reports of isolated clashes. The truce, a potentially major breakthrough in the 6-year conflict, was announced hours earlier by Russian President Vladimir Putin and confirmed by the Syrian army and opposition.\n3. Labour Leader Jeremy Corbyn says his party won't block Britain's exit from \"distrusted\" EU. In his New Year speech, Corbyn will say he \"accepts and respects the result of the referendum.\"\n4. Britain's benchmark share index, the FTSE 100, closed at an all-time high for a second consecutive day on Thursday, as UK stocks continue to soar on the back of the weak pound.\n5. German anti-terror experts ranked the Berlin truck attack suspect Anis Amri as \"a low threat,\" despite him being a known Islamist who had volunteered for a suicide attack\n6. Hong Kong has reported a second human case of bird flu. A 70-year-old man has tested positive for the H7N9 virus which killed six people in Hong Kong in 1997.\n7. Microsoft's first-ever PC is performing better than anyone expected. The company expected to ship 15,000 Surface Studio PCs in the first quarter they were available, but it may end up shipping as many as 30,000 units instead.\n8. The Russian Embassy in London has trolled the US over Obama's new sanctions with a picture of a duck. Their tweeted response said that \"everybody,\" including Americans, will be glad to see the end of his \"hapless\" administration.\n9. Iraqi forces have entered the \"second phase\" of the fight for ISIS' stronghold in Iraq. Forces pushed into eastern Mosul after the massive operation to recapture the northern city from the Islamic State group was launched in October.\n10. Tennis superstar Serena Williams is marrying Reddit cofounder Alexis Ohanian.\nAnd finally ...\nSomeone has put all the awful things that happened in 2016 into a fake horror movie trailer.","url":"https://www.businessinsider.com/the-10-most-important-things-in-the-world-right-now-december-30-2016-12"}
