{"authors":["Sarah Kimmorley","Business Insider Australia"],"date_download":"2018-10-31 00:35:32","date_modify":"2018-10-31 00:35:32","date_publish":"2016-12-01 00:00:00","description":"Here's what you need to know on Thursday, December 1.","filename":"data/vaneerConsumption/10mostimportantthingsinworldDecember1.json","image_url":"https://amp.businessinsider.com/images/583fd5b7dd089530448b45c8-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-10-most-important-things-in-the-world-right-now-december-1-2016-12_1540946132.html","title":"10 most important things in world, December 1","title_page":"    10 most important things in world, December 1 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Syrian refugee girls study Koran in a mosque in Nizip refugee camp, near the Turkish-Syrian border in Gaziantep province, Turkey, November 30, 2016. REUTERS/Umit Bektas Hello! Here's what you need to know on Thursday.\n1. OPEC has finally agreed to a production cut. The news to reduced the total world output by 2% sent oil prices surging up almost 9%. It was the cartel's first cut since 2008.\n2. Amazon is giving AI to any startup that wants it. The internet giant has opened up access to its image recognition, text-to-speech and natural language understanding services, now all are available on-demand.\n3. Britain's housing market is defying the Brexit doom forecasts. But luxury estate agent Knight Frank warns that the outlook for London and the rest of the UK remains \"uncertain.\"\n4. US President Barack Obama's administration has expanded the US' war on terror, but some fear it will leave President-elect Donald Trump with tremendously expanded war powers.\n5. Colombia's congress has formally ratified a peace agreement allowing leftist rebels to enter politics. It comes after five decades of war, more than four years of negotiations, and two signing ceremonies.\n6. China's manufacturing sector hasn't looked this good in over two years. The government's latest purchasing managers index jumped to 51.7 in November. The figure was higher than the 51.2 level of October and expectations for a decline to 51.0.\n7. Australian telecommunications providers are cutting network connectivity to any remaining Samsung Galaxy Note 7 users. So those still holding onto Note 7s on December 15 will find suddenly that they're nothing but very fancy — and flammable — calculators.\n8. The plane carrying a Brazilian soccer team that crashed Colombia was running out of fuel. The plane also had no electrical power, and was preparing for an emergency landing, according to a recording of the pilot's last message to a control tower operator.\n9. Norway's Magnus Carlsen has won the World Chess Championship. He beat Russia's Sergey Karjakin to win the chess world's most prestigious trophy for the third time.\n10. The inventor of the Big Mac has died. Michael Delligatti, who was known as \"Jim,\" died Monday night in Pittsburgh at the age of 98.\nAnd finally...\nHere's the unofficial Goldman Sachs gift guide for 2016.","url":"https://www.businessinsider.com/the-10-most-important-things-in-the-world-right-now-december-1-2016-12"}
