{"authors":["Sarah Kimmorley","Business Insider Australia"],"date_download":"2018-10-30 21:13:29","date_modify":"2018-10-30 21:13:29","date_publish":"2016-12-21 00:00:00","description":"Here's what you need to know on Wednesday, December 21.","filename":"data/vaneerConsumption/10mostimportantthingsinworldDecember21.json","image_url":"https://amp.businessinsider.com/images/585a35b1dd08959b7f8b4768-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-10-most-important-things-in-the-world-right-now-december-21-2016-12_1540934009.html","title":"10 most important things in world, December 21","title_page":"    10 most important things in world, December 21 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Zoo owner Manny Tangco feeds a Bengal tiger named \"Duterte\" during the Animal Christmas party at Malabon zoo in Manila, Philippines December 21, 2016. REUTERS/Czar Dancel Hello! Here's what you need to know on Wednesday.\n1. ISIS has claimed credit for the Christmas market attack in Berlin, Germany. The terrorist group had their claim published by Amaq News Agency, the unofficial propaganda news arm of ISIS. The attack killed 12 people and wounded at least 48 others.\n2. Dozens of cities across China have issued pollution \"red alerts\" as smog shuts down schools, stops flights, and closes roads. In Shijiazhuang, the capital of northern Hebei province, air quality readings of PM2.5 fine particulate matter soared beyond 1000 micrograms per cubic metre on Monday night — more than 100 times the level recommended by the WHO.\n3. Twenty nine people are dead after explosions at a fireworks market in Mexico. Federal police believed a further 70 people have been wounded in the incident. The cause of the explosions was still under investigation.\n4. The World Bank will loan Iraq almost $1.5 billion to lessen the impact of low oil prices on its economy and shoulder the cost of the war on ISIS.\n5. The US Congress will now require the Pentagon to reveal the true cost of war. The requirement comes as President-elect Donald Trump has begun scrutinising the Defense Budget and voicing complaints about excessive spending and over-the-top contracts.\n6. The boss of one of the largest accounting firms in the world told Business Insider about London's Brexit contingency plans. John Veihmeyer, the global chairman of KPMG, said that banks and financial institutions are sitting tight for now.\n7. US President Barack Obama has permanently banned offshore oil drilling in the \"vast majority\" of US-owned northern waters. The White House cited the \"vulnerability\" of the region to oil spills as its motivation.\n8. India is trying to solve its cash crisis with a massive lottery of electronic money. Beginning on Christmas Day, the Indian government will hold a daily lottery for anyone who buys into a new system of electronic payments. The prize amounts vary from roughly $15 to $1,500, culminating in an April 14 draw for more than $1.5 million.\n9. Venezuela has reopened its border with Colombia, eight days after president Nicolas Maduro closed it in order to combat smuggling. It came at the same time he announced the withdrawal of the country's highest denomination bank note.\n10. Anti-terrorism police in Indonesia have killed three suspects after a bomb was found during a house raid. The raid followed the interrogation of 14 suspects after a series of arrests relating to planned suicide attacks in the capital, Jakarta.\nAnd finally …\n'The internet will shut down for 24 hours next year.'","url":"https://www.businessinsider.com/the-10-most-important-things-in-the-world-right-now-december-21-2016-12"}
