{"authors":["Sarah Kimmorley","Business Insider Australia"],"date_download":"2018-10-30 23:03:23","date_modify":"2018-10-30 23:03:23","date_publish":"2016-12-09 00:00:00","description":"Here's what you need to know on Friday, December 9.","filename":"data/vaneerConsumption/10mostimportantthingsinworldDecember9.json","image_url":"https://amp.businessinsider.com/images/584a61a6dd089569558b4611-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-10-most-important-things-in-the-world-right-now-december-9-2016-12_1540940603.html","title":"10 most important things in world, December 9","title_page":"    10 most important things in world, December 9 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A boy blows bubbles to show customers at a stall near a beach in Colombo, Sri Lanka December 8, 2016. REUTERS/Dinuka Liyanawatte Hello! Here's what you need to know on Friday.\n1. The Brexit legal case in the UK Supreme Court has come to an end. After four days of vigorous legal debate, Gina Miller and the claimants who brought the case against Theresa May's government will have the ruling in early January.\n2. US Republicans plan to \"go after Russia\" for its alleged interference in the US election, saying it's a national security issue, despite their candidate, Donald Trump, winning. It comes after the US Department of Homeland Security accused Russia of hacking the Democratic Party.\n3. Vietnam has begun dredging work on a reef in the disputed South China Sea. It is the latest move by the Communist state to bolster its claims in the strategic waterway. The move is likely to anger Beijing, which claims sovereignty over the area.\n4. South Korea's embattled president Park Geun-hye is going to be impeached. Park is embroiled in a political scandal that has sparked massive protests and calls for her resignation. The country's Parliament voted to impeach her today, which suspends her powers.\n5. John Glenn, the first American to orbit Earth, has died at the age of 95. The former Marine and US Senator had been in a hospital in Ohio for more than a week. He died surrounded by his children and wife of 73 years.\n6. China will increase the number of air force patrols near Taiwan after the controversial telephone call from US President-elect Donald Trump. It follows concerns that the US may shift its policy towards the self-governed island.\n7. The scale of the terrorism threat to the UK has reached an \"unprecedented\" level. According to MI6, \"hybrid warfare,\" which included cyber-attacks and subverting democracy, is becoming an \"increasingly dangerous phenomenon.\"\n8. A 7.8 magnitude earthquake shook the Solomon Islands and triggered a tsunami warning, since lifted. There were no reports of casualties. It comes after a 6.5-magnitude quake in Indonesia killed more than 100 people.\n9. 50,000 ISIS fighters have been killed since the United States started battling the group more than two years ago, according to US military officials.\n10.Mick Jagger is dad for the eighth time at the age 73. The Rolling Stones frontman and his 29-year-old girlfriend, American ballerina Melanie Hamrick, gave birth to a boy in New York. That makes him younger than Jagger's great-grandchild, who was born in 2014.\nAnd finally …\n50 places to travel to in 2017.","url":"https://www.businessinsider.com/the-10-most-important-things-in-the-world-right-now-december-9-2016-12"}
