{"authors":["Sarah Kimmorley","Business Insider Australia"],"date_download":"2018-10-30 22:06:33","date_modify":"2018-10-30 22:06:33","date_publish":"2016-12-15 00:00:00","description":"Here's what you need to know on Thursday, December 15.","filename":"data/vaneerConsumption/10mostimportantthingsinworldDecember15.json","image_url":"https://amp.businessinsider.com/images/58524a31dd089514558b4c92-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-10-most-important-things-in-the-world-right-now-december-15-2016-12_1540937193.html","title":"10 most important things in world, December 15","title_page":"    10 most important things in world, December 15 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Arman Kushkarov, a hunter with a golden eagle, raises a hand for landing of his tamed bird during training outside of the village of Shamalgan, in Almaty region, Kazakhstan, December 14, 2016. Picture taken December 14, 2016. REUTERS/Shamil Zhumatov Hello! Here's what you need to know on Thursday.\n1. The details of more than a billion Yahoo accounts have been stolen in what could possibly be the biggest hack of all time. The company has not yet been able to identify the intrusion associated with this theft. The breach could have implications for the $4.8 billion sale of Yahoo to Verizon, which has yet to close.\n2. The US Federal Reserve raised its benchmark interest rate, as expected, and upped its expectation for the number of rate hikes in 2017. Rates were increased by 25 basis points to a corridor of 0.50% to 0.75%, the second rate hike in as many years.\n3. A deal to evacuate the last rebel-held part of eastern Aleppo is back on, according to Syrian rebels. It come a day after a previous agreement on a ceasefire fell through.\n4. The former leader of the UK's Liberal Democrats thinks the government is heading for trouble with Brexit. \"I think this government is one of the most clueless in living memory,\" Nick Clegg told Business Insider.\n5. Australia will host the world's most lethal combat jet as the US gets \"ready to confront\" China in the Pacific. Admiral Harry Harris, the head of the US Pacific Command, confirmed that the F-22 Raptor will now be based in Australia as the US aims to leverage the country's proximity to the disputed South China Sea.\n6. China appears to have installed weapons on all seven of the artificial islands it has built in the South China Sea, according to a US think tank. New satellite imagery shows anti-aircraft and anti-missile systems despite Beijing saying it has no intention of militarising the islands.\n7. A new defense policy bill will give US President-elect Donald Trump greater influence over US foreign broadcasting entities. The bill is expected to be signed into law this month by President Barack Obama.\n8. A 13-year-old Oklahoma girl has been arrested after police suspected she was plotting a mass attack on her school. Following a search of the girl's home police seized handguns and rifles, ammunition, and the girl's personal writings.\n9. Philippines president Rodrigo Duterte has admitted to summararily killing people. He said that when he was mayor of southern Davao city he used to hunt suspects on his motorcycle, shooting people on the spot, and encourage police officers to do the same.\n10. A man from the US has been charged with the largest cyber-attack of financial firms in America's history. FBI and US secret service agents arrested Joshua Samuel Aaron, 32, at New York's JFK airport. Until now he has been a fugitive living in Moscow. He is accused of illegally accessing the personal information of 100 million people in 2012-15.\nAnd finally …\nHere's who sat where during Trump's big meeting with tech leaders.","url":"https://www.businessinsider.com/the-10-most-important-things-in-the-world-right-now-december-15-2016-12"}
