{"authors":["Sarah Kimmorley","Business Insider Australia"],"date_download":"2018-10-30 23:10:16","date_modify":"2018-10-30 23:10:16","date_publish":"2016-12-08 00:00:00","description":"Here's what you need to know on Thursday, December 8.","filename":"data/vaneerConsumption/10mostimportantthingsinworldDecember8.json","image_url":"https://amp.businessinsider.com/images/5849105bdd08953f448b4f91-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-10-most-important-things-in-the-world-right-now-december-8-2016-12_1540941016.html","title":"10 most important things in world, December 8","title_page":"    10 most important things in world, December 8 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Clowns participate in a parade during Salvadoran Clown Day celebrations in San Salvador, El Salvador, December 7, 2016. REUTERS/Jose Cabezas Hello! Here's what you need to know on Thursday.\n1. A plane crash in Pakistan has killed 47 people. Flight PK661 lost contact with the control tower after taking off from the Northern Chitral region, en route to Islamabad, before it crashed about 125km north of the destination. No one is believed to have survived.\n2. Glencore and Qatar have bought a $11.3 billion stake in Russia's largest oil company. The 19.5% stake in Rosneft is the largest privatisation deal, as well as largest sale and acquisition in the global oil and gas sector this year.\n3. Rescuers are still searching for survivors in Indonesia's Aceh province after an earthquake killed 97 people. Another 600 people were injured in Pidie Jaya, the area worst hit by the 6.5 magnitude quake.\n4. Italian prime minister Matteo Renzi has handed in his resignation, three days after losing a referendum. President Sergio Mattarella has started consultations with political parties over forming a caretaker government.\n5. UK MPs have backed the government's plan to start formal talks on Brexit by the end of March next year. Labour's motion calling for parliament to \"properly scrutinise\" the government in its proposals for leaving the EU has also been supported by 448 votes to 75 — a margin of 373.\n6. If there was any doubt the Chinese economy is humming again, it's surely been dispelled today. Trade data has beaten across the board in October, a good sign for not only its economy but global demand as a whole.\n7. Japanese economic growth has been revised sharply lower. The economy grew by 1.3%, well below the initial estimate and expectations for an upgrade to 2.4%.\n8. Major banks are in advanced stages of planning to shift operations from London to Paris, according to France's leading financial regulator. Benoit de Juvigny of AMF said that \"many other companies\" had lodged informal inquiries about moving post-Brexit.\n9. Syrian rebels have called for an immediate five-day ceasefire in Aleppo. While the ceasefire would allow for the evacuation of civilians and wounded, the rebels gave no indication they were ready to withdraw, as demanded by Damascus and Moscow.\n10. ISIS British hostage John Cantlie has appeared in a new propaganda video. The journalist was captured in Syria in 2012 and has since appeared in several propaganda videos. In this most recent footage he condemns western airstrikes on the Iraqi city of Mosul.\nAnd finally …\nA self-made millionaire just trashed the 2 most popular pieces of money advice.","url":"https://www.businessinsider.com/the-10-most-important-things-in-the-world-right-now-december-8-2016-12"}
