{"authors":["Sarah Kimmorley","Business Insider Australia"],"date_download":"2018-10-30 22:16:36","date_modify":"2018-10-30 22:16:36","date_publish":"2016-12-14 00:00:00","description":"Here's what you need to know on Wednesday, December 14.","filename":"data/vaneerConsumption/10mostimportantthingsinworldDecember14.json","image_url":"https://amp.businessinsider.com/images/5850f92add089568528b4ad6-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-10-most-important-things-in-the-world-right-now-december-14-2016-12_1540937796.html","title":"10 most important things in world, December 14","title_page":"    10 most important things in world, December 14 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"U.S. President-elect Donald Trump and musician Kanye West pose for media at Trump Tower in Manhattan, New York City, U.S., December 13, 2016. REUTERS/Andrew Kelly Hello! Here's what you need to know on Wednesday.\n1. Syrian rebel officials have reached a ceasefire deal with Russia to evacuate civilians of Aleppo, which has mostly fallen to regime forces. Aid workers have described horrific conditions as the one functioning hospital still operating, which ran out of supplies last month, receives more than 350 injuries per day.\n2. A military plane circling low over Manhattan caused widespread confusion among New Yorkers. Col. Nicholas Broccoli of the 160th Rescue Wing said the C-130 plane was simply carrying out \"standard military training.\"\n3. A British man has been sentenced to 366 days in prison over his attempted assassination of Donald Trump. Michael Sandford, 20, was charged over grabbing a policeman's gun at a rally in Las Vegas in order to shoot at the now president-elect. He pleaded guilty and could be eligible for release in four months' time, at which point he will be deported to the UK.\n4. A US judge wants to see the search warrant application that led to the review of Hillary Clinton's emails. District Judge Kevin Castel has ordered federal prosecutors to show him the warrant used to enable the FBI to access emails related to Clinton's private server.\n5. The governor of Ohio has signed off on a law banning abortions 20 weeks into pregnancy. John Kasich also vetoed the heartbeat bill because it bans abortion after the heartbeat of a fetus can be detected, saying it was \"clearly contrary to the Supreme Court of the United States' current rulings on abortion.\"\n6. The US will limit arms sales to Saudi Arabia after president Barack Obama's administration said it was concerned over \"flaws\" in the way air strikes are targeted in Yemen. In October, more than 140 people were killed in a strike on a funeral in the country.\n7. Gambia's security forces have taken over the country's electoral commission offices, instructed its chairman to leave, and barred other employees from entering. It comes as West African heads of state began arriving in the country to convince long-term president Yahya Jammeh to relinquish power after losing an election this month.\n8. Astronomers have found evidence for a \"dark\" gravitational force that might fix Einstein's most famous theory. A contentious theory by Erik Verlinde at the University of Amsterdam suggests dark matter may not be matter at all.\n9. Tomorrow the US Federal Reserve's FOMC will almost certainly hike interest rates by .25% at the conclusion of its December policy meeting. It will be the second time in 12 months.\n10. The world's biggest cruise ships sails into Sydney, Australia tomorrow. Royal Caribbean's brand new $1 billion supercruiser, Ovation of the Seas, weighs 168,66 tonnes, is 347-metres in length, and has capacity for up to 4,905 guests.\nAnd finally …\nPhotos show Aleppo before and after war.","url":"https://www.businessinsider.com/the-10-most-important-things-in-the-world-right-now-december-14-2016-12"}
