{"authors":["Sarah Kimmorley","Business Insider Australia"],"date_download":"2018-10-30 21:28:46","date_modify":"2018-10-30 21:28:46","date_publish":"2016-12-20 00:00:00","description":"Here's what you need to know on Tuesday, December 20.","filename":"data/vaneerConsumption/10mostimportantthingsinworldDecember20.json","image_url":"https://amp.businessinsider.com/images/5858e263dd0895d61f8b47e7-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-10-most-important-things-in-the-world-right-now-december-20-2016-12_1540934926.html","title":"10 most important things in world, December 20","title_page":"    10 most important things in world, December 20 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A child plays in a maze among Christmas decorations outside a mall in Singapore December 19, 2016. REUTERS/Edgar Su Hello! Here's what you need to know on Tuesday.\n1. Twelve people are dead and 48 have been wounded after a truck plowed into a Christmas market in Berlin, Germany. A suspect was arrested near the site of the incident.\n2. Russia's ambassador to Turkey has been assassinated in Ankara by an elite police officer. Three other bystanders were shot in what Russia has called an act of terror. The gunman was shot dead by other police at the scene.\n3. The Electoral College has officially made Donald Trump the president-elect of the United States of America. Trump secured the necessary 270 electoral votes to formally become the 45th president.\n4. A shooting near an Islamic center in Zurich, Switzerland wounded three people. Local police believe the suspect fled the scene. A body was later found nearby, but police could not comment on any link to the shootings while investigations were still under way.\n5. Talks between Iran, Turkey, and Russia will still go ahead in Moscow despite the ambassador's assassination. The foreign and defense ministers of Russia, Iran, and Turkey are set to meet to discuss the future of Syria.\n6. A federal judge has ordered the unsealing of the search warrant FBI agents used to reopen their investigation of Hillary Clinton's use of a private email server. The judge said the public had a right to see the warrant.\n7. Australian authorities now think the search area for the missing Malaysian Airlines flight MH370 is in a different place. The discovery comes two years and almost $200 million after a search program for the plane started — and just two months past the due date of the search to end.\n8. Uber lost $800 million in the third quarter, putting it on track to lose $2.8 billion for the year. It is yet another quarter of staggering losses for the world's biggest startup — a $60 billion transport behemoth.\n9. The UK government has dismissed Nicola Sturgeon's request for Scotland to stay within the single market, even if the UK opts for a \"hard Brexit.\" Downing Street quashed the leader of the Scottish National Party's request, warning that it would undermine overall Brexit talks.\n10. \"Super Mario Run\" is smashing \"Pokemon Go\" records. \"Super Mario Run\" has reportedly surpassed 25 million downloads and earned more than $21 million in revenue after just four days. It took \"Pokémon Go\" 11 days to reach the same result.\nAnd finally …\nAmazon's store brand makes a lot of great tech, but these are the 10 gadgets actually worth buying.","url":"https://www.businessinsider.com/the-10-most-important-things-in-the-world-right-now-december-20-2016-12"}
