{"authors":["Peter Jacobs"],"date_download":"2018-10-30 20:45:32","date_modify":"2018-10-30 20:45:32","date_publish":"2016-12-28 00:00:00","description":"Here's what you need to know on Wednesday, December 28.","filename":"data/vaneerConsumption/10mostimportantthingsinworldDecember28.json","image_url":"https://amp.businessinsider.com/images/58636cb4dd0895947f8b4a64-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-10-most-important-things-in-the-world-right-now-december-28-2016-12_1540932332.html","title":"10 most important things in world, December 28","title_page":"    10 most important things in world, December 28 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A Bangladeshi girl plays on a swing, in Dhaka, Bangladesh, December 27, 2016. REUTERS/Mohammad Ponir Hossain Hello! Here's what you need to know on Wednesday.\n1. The White House is getting ready to announce what it will do to punish Russia for its alleged meddling in the US election. The Washington Post reported that a number of punitive measures were on the table, including \"economic sanctions and diplomatic censure.\"\n2. Oil prices are rising and speculators are already staking out bullish positions on futures for the next few months. Contracts that pay off big time if oil prices hit $100 per barrel by December 2018 just saw a spike in interest.\n3. Former Argentina President Cristina Fernandez was indicted in a corruption case involving public works. A federal judge approved charges of illicit association and fraudulent administration against Fernandez and two former aides.\n4. US Senator John McCain has pledged US support to the security of Russia's three Baltic neighbors amid worries that President-elect Donald Trump may not be fully committed to the defense of NATO allies. McCain, chairman of the Senate Armed Services Committee, said during a visit to Estonia that Washington should consider at least basing troops permanently in that country.\n5. Venezuela took delivery of a load of new, bigger denomination banknotes, but there was no sign of them in circulation yet despite official promises and mounting public anxiety.\n6. Four years of fighting have transformed Aleppo from Syria's industrial and commercial powerhouse to a divided and dysfunctional city. It will take many months and millions of dollars to breathe life back into Aleppo's devastated water, electricity, and transportation networks.\n7. Trump Tower in New York City was evacuated after a \"suspicious package\" was found in the lobby. Shortly after 5 p.m. local time Tuesday, the New York Police Department reported that the situation at Trump Tower was \"all clear.\"\n8. Korean Air flight attendants will now have freer access to on-board Tasers. The Seoul-based airline has \"loosened\" the usage policy for tasers located on board its aircraft.\n9. Carrie Fisher, the actress known around the world for playing Princess Leia in the \"Star Wars\" movies, has died at the age of 60. Fisher recently suffered a heart attack while on a plane.\n10. 2017 should be a big year for discovering new potentially habitable worlds. Expectations are high that we'll find more of super-Earths in 2017 thanks to the launch of new telescopes and observatories.\nAnd finally ...\nThe death of Queen Elizabeth will be the most disruptive event in Britain in the last 70 years.","url":"https://www.businessinsider.com/the-10-most-important-things-in-the-world-right-now-december-28-2016-12"}
