{"authors":["Sarah Kimmorley","Business Insider Australia"],"date_download":"2018-10-30 23:45:19","date_modify":"2018-10-30 23:45:19","date_publish":"2016-12-05 00:00:00","description":"Here's what you need to know on Monday, December 5.","filename":"data/vaneerConsumption/10mostimportantthingsinworldDecember5.json","image_url":"https://amp.businessinsider.com/images/584518cedd08953d448b4936-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-10-most-important-things-in-the-world-right-now-december-5-2016-12_1540943119.html","title":"10 most important things in world, December 5","title_page":"    10 most important things in world, December 5 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Skiers and snowboarders dressed as Santa participate in a charity run down a slope at Sunday River Ski Resort in Newry, Maine December 4, 2016. REUTERS/Joel Page Hello! Here's what you need to know on Monday.\n1. Italian prime minister Matteo Renzi will resign after his constitutional referendum was rejected. Renzi made the announcement shortly after midnight Italian time after exit polls revealed a \"No\" vote on his proposed package of constitutional reforms. That sent the value of the euro diving on markets.\n2. Far-right Austrian presidential candidate Norbert Hofer's campaign manager has conceded defeat in the presidential election. Greens leader Alexander Van der Bellen took a clear lead in the polls, dealing a blow to his rival's bid to become the first freely elected far-right head of state in Europe since WWII.\n3. New Zealand prime minister John Key is resigning. His surprise resignation follows eight years in the nation's top job. The 55-year-old cited family among his reasons to step down.\n4. Thirty three bodies have been recovered from a warehouse in Oakland, California, after a deadly fire. The cause of the blaze is still undetermined as criminal investigators continue to assist recovery teams at the scene.\n5. The UK Supreme Court is set to begin a landmark legal hearing to determine Brexit powers. It will seek to rule on whether the UK parliament's consent is required before official Brexit negotiations can begin.\n6. US President-elect Donald Trump says companies leaving the US will face \"retribution,\"and businesses which outsource their operations to another country should be \"forewarned\" before making \"a very expensive mistake.\"\n7. Police have arrested a gunman who entered a restaurant that was the target of fake news reports claiming it operated a child abuse ring led by Hillary Clinton. No shots were fired and there were no injuries.\n8. Oil prices fell by 1%, triggered by rising production. This follows last week's decision by OPEC to cut output in 2017. The cuts aim to rein in a supply glut that has weighed on markets for over two years.\n9. ISIS wives have posed as refugees to kill Libyan troops in separate suicide blasts. Three female jihadists have killed 38 soldiers and injured dozens more in Sirte, on the Mediterranean coast.\n10. Donald Trump has doubled down on his threats to go after China. His comments via Twitter come after Trump spoke with the president of Taiwan by phone on Friday, raising diplomatic tensions between China and the US.\nAnd finally …\n8 reasons why Google's Pixel is better than the iPhone.","url":"https://www.businessinsider.com/the-10-most-important-things-in-the-world-right-now-december-5-2016-12"}
