{"authors":["Sarah Kimmorley","Business Insider Australia"],"date_download":"2018-10-30 22:45:51","date_modify":"2018-10-30 22:45:51","date_publish":"2016-12-12 00:00:00","description":"Here's what you need to know on Monday, December 12.","filename":"data/vaneerConsumption/10mostimportantthingsinworldDecember12.json","image_url":"https://amp.businessinsider.com/images/584e592cdd08955d558b4784-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-10-most-important-things-in-the-world-right-now-december-12-2016-12_1540939551.html","title":"10 most important things in world, December 12","title_page":"    10 most important things in world, December 12 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Children leap into a tidal pool as temperatures soar at Camps Bay beach in Cape Town, South Africa, December 11, 2016. REUTERS/Mike Hutchings Hello! Here's what you need to know on Monday.\n1. Oil is going crazy after the first deal in 15 years is sealed between Russia and Saudi Arabia to cut production. The price of oil surged more 5% after surprise cuts from major oil producing countries.\n2. More than 160 people were killed in Nigeria after the collapse of a church. The roof of the Reigners Bible Church in the Akwa Ibom state capital of Uyo collapsed on worshipers after workers rushed to finish it in time for Saturday's ceremony to ordain founder Akan Weeks as a bishop.\n3. US President-elect Donald Trump has questioned why the US should be bound to the \"One China\" policy and criticised China over issues such as currency, the South China Sea and North Korea, in what is likely to increase tensions between the two countries.\n4. Bill English is the new prime minister of New Zealand. It follows John Key's surprise resignation last week after eight years.\n5. Marine Le Pen, leader of France's far-right National Front, wants to end free education for the children of undocumented immigrants. She said all foreigners using the state education system must be living in France legally and paying taxes. Education for all is protected in the French constitution.\n6. Italy's Monte dei Paschi bank is racing to raise €5 billion (£4 billion or US$5.3 billion) by the end of 2016. The world's oldest bank says it will stick to the recovery plan it outlined on October 25 in order to avoid a state rescue.\n7. A bombing at Cairo's largest Coptic cathedral killed at least 25 people and wounded 49, many of them women and children attending Sunday mass. It is the deadliest attack on Egypt's Christian minority in years.\n8. Venezuela will replace the country's highest-denomination banknotes with coins within 72 hours. The government hopes that will help combat smuggling and tackle food shortages.\n9. ISIS has retaken the Syrian city of Palmyra, hours after the Russian defence ministry said it had carried out 64 strikes, and appeared to have driven the militants back.\n10. Romania's Social Democratic Party looks set to return to power, according to exit polls from Sunday's parliamentary election. The party's resurgence comes after its former leader Victor Ponta was forced to resign after a deadly nightclub fire in October 2015 prompted a corruption crackdown.\nAnd finally …\nThe biggest science stories in 2016.","url":"https://www.businessinsider.com/the-10-most-important-things-in-the-world-right-now-december-12-2016-12"}
