{"authors":["Sarah Kimmorley","Business Insider Australia"],"date_download":"2018-10-30 21:40:05","date_modify":"2018-10-30 21:40:05","date_publish":"2016-12-19 00:00:00","description":"Here's what you need to know on Monday, December 19.","filename":"data/vaneerConsumption/10mostimportantthingsinworldDecember19.json","image_url":"https://amp.businessinsider.com/images/5857900ddd0895567f8b4619-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-10-most-important-things-in-the-world-right-now-november-28-2016-12_1540935605.html","title":"10 most important things in world, December 19","title_page":"    10 most important things in world, December 19 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Miss Puerto Rico Stephanie Del Valle (C) reacts to being named Miss World as Miss Philippines Catriona Elisa Gray (L) and Miss Kenya Evelyn Njambi Thungu watch during the Miss World 2016 Competition in Oxen Hill, Maryland, U.S., December 18, 2016. REUTERS/Joshua Roberts Hello! Here's what you need to know on Monday.\n1. Evacuations have resumed from east Aleppo after buses sent to collect civilians were set alight by rebels. At least 350 people have reportedly left rebel enclaves in convoys, heading west towards government territory. Thousands more are waiting.\n2. Republican and Democratic senators are uniting to call for a probe into Russia influencing the US election. They have called for a special bipartisan panel to investigate cyber attacks against by foreign countries.\n3. The delay of a Brexit deal will cost the UK economy £65 billion in cancelled, delayed, or lost investment, according to Barclays. Analysts Fabrice Montagne and Andrzej Szczepaniak say, \"the difficulty in properly assessing the ramifications of Brexit … mean that downsides risks will only materialise gradually over time and lead to growth being lower for longer, rather than a crash and rebound.\"\n4. Lebanon has formed a new government. President Michel Aoun, and Prime Minister Saad al-Hariri have a new government of 30 ministers, nearly two months after October's presidential election.\n5. Jordanian police have freed tourists trapped inside a medieval castle after they were held hostage by gunmen. At least nine people, including a Canadian woman, three other civilians and five police officers, were killed in a shoot out between the police and the armed men. Another 27 were wounded.\n6. Apple will launch a legal challenge against the EU tax ruling this week. It comes after the European Commission ordered the tech giant to pay about $14 billion in taxes to Ireland. Apple argues that EU regulators ignored tax experts and corporate law to deliberately picked a method that would maximize the penalty.\n7. South Korea has returned eight North Korean civilians and two vessels back across the maritime border. The eight were rescued last week after their boats were found drifting, and said they wanted to return to the North. At least one person was believed to have died from starvation.\n8. More than 300 people have been arrested during protests in Venezuela. The protests follow the 100 bolivar note being pulled from circulation this week before new bills were created, causing a national cash shortage.\n9. Zsa Zsa Gabor has died at age 99. The Hungarian-born actress, who would have turned 100 in February, passed away at her home. Married 9 times, she famously quipped that \"I am a marvelous housekeeper: Every time I leave a man I keep his house.\"\n10. \"Rogue One: A Star Wars Story\" had a huge weekend at the box office. The Disney franchise earned $290.5 million globally, making it the second-best December opening weekend on record in the UK, US, and Canada, beaten by last year's \"Star Wars: The Force Awakens.\" The US delivered more than half the revenue at $155 million.\nAnd finally …\nNike's new $720 shoe is all about the tech — and it marks a big shift for the brand.","url":"https://www.businessinsider.com/the-10-most-important-things-in-the-world-right-now-november-28-2016-12"}
