{"authors":["Sarah Kimmorley","Business Insider Australia"],"date_download":"2018-10-30 23:24:40","date_modify":"2018-10-30 23:24:40","date_publish":"2016-12-07 00:00:00","description":"Here's what you need to know on Wednesday, December 7.","filename":"data/vaneerConsumption/10mostimportantthingsinworldDecember7.json","image_url":"https://amp.businessinsider.com/images/5847bf6ddd089538448b4beb-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-10-most-important-things-in-the-world-right-now-december-7-2016-12_1540941880.html","title":"10 most important things in world, December 7","title_page":"    10 most important things in world, December 7 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"People protest on the day white nationalist leader Richard Spencer of the National Policy Institute is due to speak on campus at an event not sanctioned by the school, at Texas A&M University in College Station, Texas, U.S. December 6, 2016. REUTERS/Spencer Selvidge Hello! Here's what you need to know on Wednesday.\n1. Samsung has won its smartphone patent fight with Apple, after the US Supreme Court threw out an Appeals Court ruling that said the South Korean company had to pay a $399 million penalty to its American rival for copying key iPhone designs.\n2. The UK Supreme Court is now considering whether Article 50 needs approval from the Scottish parliament. Wrapping up day two of the battle to determine whether the UK government can use \"Royal Prerogative\" to take Britain out of the EU, or whether it must push a bill through parliament first, the court now must rule on whether Scotland's devolved parliament must also first approve the bill.\n3. Taiwan's president is downplaying her phone call with US president-elect Donald Trump last week. President Tsai Ing-wen says it was simply to congratulate Trump on his election, rather than the start of a policy shift away from the long-standing one-China policy by the US.\n4. At least 25 people have died after a 6.5-magnitude earthquake struck off Aceh province on Indonesia's Sumatra island. Seven children were among the deceased, and another 26 have been seriously injured.\n5. Citi's Japanese trading operation is being investigated by the Bank of England for its role in October's \"flash crash\" of the pound. The Financial Times reports that while Citi did not start the crash, its Japanese trading operation made things worse by placing a large number of sell orders after the initial fall.\n6. Donald Trump has signed a $50 billion deal with Japanese billionaire and Softbank CEO Masayoshi Son. The deal, which is expected to bring 50,000 jobs to the US, initially appeared to be a direct investment from Japan's second-largest telecom company, SoftBank, but a deeper look shows there are still many unclear details and unanswered questions.\n7. The CEO of LaMia, the airline that crashed in Colombia last week, killing nearly all of Brazil's Chapacoense soccer team, has been detained. Gustavo Vargas and two other employees were taken into custody by Bolivian authorities for questioning after it was revealed that the plane apparently ran out of fuel.\n8. A refrigerator could be the source of the Oakland warehouse fire that killed 36 people. The US Bureau of Alcohol, Tobacco, Firearms and Explosives has identified the appliance as a potential source of ignition behind the blaze, which broke out during a dance party Friday night.\n9. Uber now wants to follow you after you finish your ride. A new update to the app sees Uber request permission to collect location information for five minutes after a ride has ended, even if the app is not running.\n10. Angela Merkel has laid out her case for a fourth term as German chancellor. She has vowed to ban full-face Muslim veils and promises a tougher stance on immigration after a record influx of refugees to the country.\nAnd finally…\nTHE FUTURE OF DIGITAL: 2016.","url":"https://www.businessinsider.com/the-10-most-important-things-in-the-world-right-now-december-7-2016-12"}
