{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 19:58:15","date_modify":"2018-10-30 19:58:15","date_publish":"2017-03-06 12:40:58","description":"Spring is here, which means more metro Atlanta restaurants offering up new options for brunch and lu...","filename":"data/vaneerConsumption/10newplacesforbrunchandlunchinmetroAtlanta.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_ne_730747d948d206f89279d5a19e91505d__1540929495.html","title":"10 new places for brunch and lunch in metro Atlanta","title_page":"10 new places for brunch and lunch in metro Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"Spring is here, which means more metro Atlanta restaurants offering up new options for brunch and lunch. Check out these spots for twists on traditional breakfast and Southern dishes.\nAmara\nThe Inman Park Indian restaurant -- which recently made some changes in its kitchen -- is now open for lunch from 11:30 a.m.-2:30 p.m. Tuesday through Thursday and noon-3 p.m. on Saturday, and from Sunday brunch from 11 a.m.-3 p.m.\nLunch options include Indian wraps and curry bowls all $14 and under, while brunch offers a mix of traditional and Indian brunch items including a masala omelet, pulled goat benedict and Inman Village Waffle made with Chantilly cream, garam masala syrup and mango compote.\nTake a first look at Amara here and read our review here.\n870 Inman Village Parkway, Atlanta. 470-305-7405, amaraatlanta.com\nBeetleCat\nBeginning April 22, the Ford Fry seafood spot will offer brunch from 11 a.m.-2 p.m. Saturdays and Sundays. The restaurant and Den will remain open with the full dinner menu beginning at 2 p.m.\nMenu items include donuts with with oreos and chocolate sprinkles, pork floss, tres leches with toasted coconut and whipped cream, a French toast stack with griddled donuts, maple syrup and strawberries, Monte Cristo with ham, gruyere, raspberry jam and powdered sugar and glazed chicken, crispy chicken between two plain jane donuts topped with a fried egg.\n299 North Highland Ave. NE, Atlanta. 678-732-0360, beetlecatatl.com\nThe Brunch at Local Three. / AJC file photo\nLocal Three Kitchen & Bar\nIf you're a fan of this restaurant's Sunday brunch -- named by the AJC dining team as one of the five best in Atlanta -- you'll be happy to know the spot has started serving up Saturday brunch from 10 a.m.-2 p.m., as well.\nThe brunch buffet, which asks guests to move through the kitchen and interact with the chefs as they pick up their food, features 18-25 seasonally-inspired items ranging from baked treats and mixed greens, to Southern breakfasts staples, lunch entrees and desserts.\nThe bar will be open for full service and will feature brunch cocktails including Bloody Marys, Bloody Marias, mimosas, bellinis, whiskey cocktails and beer and wine.\nBrunch costs $24.93 for adults and $12.53 for kids ages 6-12.\n3290 Northside Parkway N.W., Atlanta. 404-968-2700, localthree.com.\nJai Ho\nThe new Indian restaurant right off the Beltline is now serving a weekend buffet from from noon-3 p.m. Look for salad and omelette stations, four different appetizers, eight main dishes, sandwich platters, a dessert bar and either unlimited mimosas or two Bloody Marys for $19.99 per person through April, then $25 per person.\n560 Dutch Valley Rd NE, Suite 100, Atlanta. 404-458-6888, jaihoatlanta.com/\nMediterranea Mediterranean Breakfast with fresh fruit, dried fruit, nuts, dolmas, hard cooked egg, yogurt , fig compote, and seasoned bread. / Photo credit- Mia Yakel.\nMediterranea\nThis newly-opened Grant Park spot offers a variety of gluten-free options for lunch and brunch. Read more here\n332 Ormond Street S.E., Atlanta. 404-748-4219, mediterraneaatl.com.\nNine Mile Station\nThe restaurant and beer garden, which opened atop Ponce City Market in October 2016 , is now serving Sunday brunch from noon to 3 p.m.\nExecutive chef Jonathan McDowell's menu offers a mix of sweet and savory items such as eggs benedict made with two poached eggs, a pretzel croissant, Nueske bacon, spinach and hollandaise; banana stuffed French toast topped with Grand Marnier syrup and candied pecans; merguez sausage hash served with crispy potatoes, caramelized onions and harissa agrodolce; and eggs-in-a-hole featuring brioche, shoestring potatoes, sausage gravy and truffle oil. Dinner items including pressed sandwiches, sausages and patty melt will also be served during brunch.\nHead bartender Randy Hayden's brunch cocktails include the Maple Bacon Old Fashioned made with bourbon, maple, orange bitters, chocolate bitters and candied bacon; the 9 Mile Bloody Mary featuring a mix of Tito’s vodka and house-made smoked bloody Mary mix; and the Sunday Smash mixed with customers' choice of vodka, gin, tequila or bourbon with lemon, jalapeno, maple and seasonal fruit. The restaurant also offers 12 rotating craft beer taps.\nPonce City Market, 675 Ponce De Leon Ave NE, Atlanta. 770-999-1532, 9milestation.com/\nOsteria Mattone\nThe Italian spot has rolled out a Roman-inspired weekend brunch featuring breakfast classics, a selection of pastas and pizzas, specialty cocktails and pastries and sweets from 11:30 a.m.-3:30 p.m Saturdays and Sundays.\n1095 Canton Street, Roswell. osteriamattone.com, 678-878-3378\nRize Artisan Pizza + Salads\nThe second location of the Atlanta pizza spot opens today in Sandy Springs and offers several pizza options, salads, small plates, flatbreads, pasta and dessert, as well as drinks including craft beers, wine, sangria and several non-alcoholic options.\n6050 Roswell Road, Sandy Springs. 404-334-0851, rizeartisanpizza.com.\nBreakfast sandwich from Smokebelly. / Photo courtesy of Smokebelly\nSmokebelly BBQ\nTry out the restaurant's new Sunday brunch from 11 a.m.-3 p.m., featuring dishes including sweet potato pancakes with sweet potato soufflé and topped with bourbon cinnamon crème; the smoked Benny, with poached eggs over grilled biscuit halves, served with beef brisket and chipotle hollandaise and a choice of brunch potatoes or cheese grits; French toast stuffed with bananas Foster, cream cheese and Myer’s rum and garnished with praline bacon crumbles; and more traditional Southern fare including Farmhouse biscuit sandwich and Cajob jamalaya omelet.\nBarbecue staples from the restaurant's regular menu are also available, as well as a Bloody Mary bar and $4 mimosas and Bellinis, and brunch cocktails including the Nice Pear made with pisco, pear brandy, velvet falernum, lemon, bitters and Prosecco, an assortment of coffee cocktails, wines and beers.\n128 East Andrews Drive, Atlanta. 404-848-9100, smokebellybbq.com.\nGulf Coast lump crab benedict from Tupelo Honey. / Photo courtesy of Tueplo Honey\nTupelo Honey\nThe Sandy Springs spot has served brunch since it opened in summer 2016 , but is unveiling new items for the spring.\nEvery Saturday and Sunday from 9 a.m.-4 p.m., customers can order the cinna-biscuit topped with pecans and frosted in a rum sauce and can order the chef’s prix fixe menu option featuring two courses and bottomless coffee or tea for $22. Options include dishes such as avocado toast topped with farmer’s cheese, aleppo pepper and red chili honey drizzle, or Gulf Coast lump crab benedict served with a buttermilk biscuit, hollandaise, peperonata and potato cracklins.\n4600 Roswell Road, Building C, Suite 110, Sandy Springs. 404-649-6334, tupelohoneycafe.com/location/sandy-springs/\nMore Atlanta brunch:\nWhere to eat brunch in metro Atlanta\nWhat to eat\nWhat to drink\nGet on top of brunch with these maps, videos, quizzes and other interactives\nMore brunch and breakfast\nRead The A List: The faces, places, dishes and drinks defining the Atlanta dining scene right now\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook , following @ATLDiningNews on Twitter and @ajcdining on Instgram","url":"https://www.ajc.com/blog/atlanta-restaurants/new-places-for-brunch-and-lunch-metro-atlanta/CLOMbjNavJWPZzPmpHMywN/"}
