{"authors":["Rebecca Fearn"],"date_download":"2018-10-31 01:45:17","date_modify":"2018-10-31 01:45:17","date_publish":"2018-09-14 14:07:34","description":"If you love learning about new beauty products as much as I do — you follow all those beauty product rumour Insta pages too, right? — then you'll totally be down for this weekly round-up of new beauty products out this week. This edition's list…","filename":"data/vaneerConsumption/10NewBeautyProductsOutThisWeekToGetExcitedAFOver.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/3a417d2b-9cf7-420e-8b86-fb954b14ff84-makeup.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_10-new-beauty-products-out-this-week-to-get-excited-af-over-11917091_1540950317.html","title":"10 New Beauty Products Out This Week To Get Excited AF Over","title_page":"10 New Beauty Products Out This Week To Get Excited AF Over","title_rss":"NULL","source_domain":"bustle.com","text":"If you love learning about new beauty products as much as I do — you follow all those beauty product rumour Insta pages too, right? — then you'll totally be down for this weekly round-up of new beauty products out this week. This edition's list features skincare, haircare, and a lot of amazing new makeup. Warning: you're going to want to get your hands on it all.\nBut first, let's start with the makeup: there are some awesome new palettes from the likes of Urban Decay and Hourglass, a debut foundation from Beautyblender, and Fenty Beauty's newest lip gloss, which completely rocks. Then there's Charlotte Tilbury's Pillowtalk extension (which I reviewed late last week) as well as new NARS eyeshadow duos and a cool new foundation from Revolution for under a tenner. You should also check out the brand's super diverse, inclusive campaign to sit with the foundation, too. Lastly, Laura Mercier and It Cosmetics have released two new complexion products that'll change your routine forever.\nHair-wise, there's a great new offering for curly hair from Color Wow and for skin, Fresh has just launched the most Insta-friendly face mist known to man. Keep scrolling to read about each product in more detail.\nHourglass Ambient Lighting Edit Unlocked £69 Hourglass/Cult Beauty So popular it already has a waiting list on Cult Beauty, Hourglass' latest Ambient Lighting Palette was always going to be a hit. I'm particularly interested in this year's drop, as it looks as though it's a little less shimmery as usual. The shades are all metallic, and include a gorgeous champagne highlighter and a pretty blusher. Buy Now\nFenty Beauty Gloss Bomb Universal Lip Luminizer £16 Fenty / Harvey Nichols When Rihanna first dropped her Fenty Beauty line, we all went nuts for it. One of the best-sellers quickly became the OG Gloss Bomb, which was a beautiful rose gold hue. This new shade has an amazing pearlescent shimmer, perfect for wearing alone or on top of your favourite lipstick shade. Another win for Fenty. Buy Now\nNARS Duo Eyeshadows £24 NARS/Space NK There's nothing better than a NARS shadow, and these new duos are an absolute beauty dream. From defining mattes to radiant shimmers, there are plenty of shades to choose from and at £24 for two shadows, the price isn't half bad. I love this Kuala Lumpur shade. Buy Now\nLaura Mercier Translucent Setting Powder — Glow £29 Laura Mercier If the idea of Instagram-friendly highlighter freaks you out completely, this is the powder to give you a subtle yet effective glow. Based on Laura Mercier's best-selling translucent powder to mattify, this is also sold with a shaped brush for easy application. It comes in two shades and has completely won me over. Buy Now\nColor Wow Dream Coat For Curly Hair £24 Color Wow/Space NK We all know about Color Wow's OG Dream Coat Supernatural Spray, and this version has just answered the prayers of the curly-haired ladies among us. The texture is like water and completely non-sticky, meaning hair is smooth and ready to style after application. Your locks will be left looking shiny and silky, and curls will look better than ever. Buy Now\nFresh Vitamin Nectar Antioxidant Glow Water £34 Fresh UK Ok so there's beauty products, and then there's boujee beauty products. Fresh's new face mist is so Insta-friendly it's unreal. But it's certainly not just for show. This nourishing spray floods the skin with vitamins and works as a priming formula, setting spray for makeup and an energising face mist. Buy Now","url":"https://www.bustle.com/p/10-new-beauty-products-out-this-week-to-get-excited-af-over-11917091"}
