{"authors":["James Dunn For Mailonline"],"date_download":"2018-10-23 00:07:18","date_modify":"2018-10-23 00:07:18","date_publish":"2016-01-11 08:43:49","description":"CSU Minister Gerd Müller (pictured) says that the Schengen Agreement - a border-free zone within Europe - has 'collapsed' and the only way to deal with the crisis is to support other countries financially.","filename":"data/vaneerConsumption/10ofmigrantshavereachedEuropesofarclaimsGermanministerGerdMller.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/08/3006003700000578-0-image-a-81_1452501757307.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393551_Only-10-migrants-reached-Europe-far-claims-German-development-minister-warns-ten-million-people-way_1540253238.html","title":"10% of migrants have reached Europe so far, claims German minister Gerd Müller","title_page":"10% of migrants have reached Europe so far, claims German minister Gerd Müller | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A German minister claims that only ten per cent of the migrants heading to Europe have arrived as he warned Germany cannot continue to accept people at the rate they have done this year.\nCSU Minister Gerd Müller says that the Schengen Agreement - a border-free zone within Europe - has 'collapsed' and the only way to deal with the crisis is to support other countries financially.\nHe warned that Europe can expect 8-10 million more migrants, who can now find out how prosperous the lifestyle enjoyed by its citizens is because of the internet.\nCSU Minister Gerd Müller says that the Schengen Agreement - a border-free zone within Europe - has 'collapsed' and the only way to deal with the crisis is to support other countries financially\nMr Müller told Bild: 'The biggest refugee movements are ahead: Africa's population will double in the coming decades. A country like Egypt will increase to 100million people, Nigeria 400million. In our digital age with the Internet and mobile phones, all know about our prosperity and our way of life.'\n'The people fleeing hunger, misery, violence, and because they see no future for themselves and their families. But we live in a globalized world. We can not build fences around Germany and Europe. When people suffer, they will come.'\nHe added: 'Only ten per cent of the triggered in Syria and Iraq escape shaft has reached us. 8 to 10 million is still on its way. Those who come to us now, for several years sat in the tent cities, basements or goat stables without water and electricity. It is shameful that the international community is not able to ensure the survival on the spot.'\nMr Müller called on European countries to create a 10billion euro fund to help people that arrive in Europe, fleeing war-torn regions in the Middle East and North Africa.\nThe comments come amid demonstrations in the wake of the sexual assaults around Cologne's main station on New Year's Eve\nHe also said that Turkey, a crossing point for many migrants, is at capacity and needs the three billion euros it has been promised by Europe, that has not yet been delivered.\nBut he warned against accepting too many more migrants in Germany, saying that it would be impossible to integrate them all into society unless there is a reduction.\nIt is reminiscent of the speech given by Home Secretary Theresa May, who warned last year that high levels of immigration would damage 'cohesion' in Britain.\nLast year alone, Germany expected 1.5million asylum claims, and offered Syrian refugees favourable treatment.\nHowever, the political tide may be turning after a woman claimed she was sexually abused by crowds of immigrants in Cologne.","url":"https://www.dailymail.co.uk/news/article-3393551/Only-10-migrants-reached-Europe-far-claims-German-development-minister-warns-ten-million-people-way.html"}
