{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:23:08","date_modify":"2018-10-30 21:23:08","date_publish":"2018-07-26 17:56:00","description":"Celebrate National Peach Month with these drinks and dishes.","filename":"data/vaneerConsumption/10peachykeenmetroAtlantapeachdishes.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/19/Images/Peach%20Cobbler.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_pe_09e7a5741223dc749820f574ba1ed217__1540934588.html","title":"10 peachy keen metro Atlanta peach dishes","title_page":"Best metro Atlanta peach dishes, dessert, and cocktails","title_rss":"NULL","source_domain":"ajc.com","text":"We bet you didn’t know that August is National Peach Month. Our state fruit takes center stage in a host of dishes, desserts and drinks at eateries all across metro Atlanta. Try one of these 10 peachy keen treats in honor of National Peach Month.\n1. Peach crisp. At the newly opened Coalition Food and Beverage in Alpharetta (part of RO Hospitality, which also operates Osteria Mattone and Table & Main in Roswell), Executive Pastry Chef Kelly Lovett is showcasing Pearson Farm peaches in the Fruit of the Moment crisp. Available until at least mid-August, this peach crisp dessert features a brown sugar and oat crumble, caramel, and buttermilk ice cream.\n50 Canton St., Alpharetta. 470-839-6725, coalitionfoodandbeverage.com.\n2. Peach cobbler. This summertime dessert staple makes an appearance on the menu at Il Giallo Osteria & Bar in Sandy Springs. Pastry chef Libby Muldawer created the dish, called Crostata de Pesca, which is a Southern peach cobber served warm, with vanilla gelato. Classic, simple and oh so gooey and good.\n5920 Roswell Road, Sandy Springs. 404-709-2148, https://ilgialloatl.com.\n3. Woke cocktail. Drink your peaches at Barleygarden Kitchen & Craft Bar in Alpharetta’s Avalon. The Woke cocktail is a mixture of Four Roses Bourbon, Merlet Trois, Peach puree, lemon and mint. The result is a light and refreshing blend that’s ideal for sipping on the beer garden’s rooftop on hot summer nights.\n900 Avalon Blvd., Alpharetta. 678-266-6218, barleygardenkitchen.com.\nThe peach salad on Muss & Turner's dinner menu features Pearson Farm peaches. (Courtesy of Muss & Turner's)\n4. Peach salad. In Smyrna, Muss & Turner’s has a bevy of menu items highlighting peaches, on both the lunch and dinner menus. For dinner, try the peach salad, featuring Pearson Farm peaches, Tucker Farm arugula, red onion, ricotta salata, pecans and pickled mustard seed vinaigrette. For dessert, go for the peach upside down cake with blueberry lemon ice cream.\n1675 Cumberland Parkway SE, Smyrna. 770-434-1114, mussandturners.com.\n5. Peach Twist. Check out Shake Shack at Perimeter Mall in Dunwoody, which offers a special Peach Twist frozen custard concrete treat. The Peach Twist is crafted from vanilla custard, Preserving Place hot peach and ginger jam, and H&F Bread Co. cinnamon sugar twist. (Bonus: 5 percent of sales proceeds from the Peach Twist support Kate’s Club, a nonprofit that works to empower children and teens facing life after the death of a parent or sibling.)\n4400 Ashford Dunwoody Road, Dunwoody. shakeshack.com.\nDoughnut Dollies is offering a brown butter peach shortcake doughnut. (Courtesy of Doughnut Dollies)\n6. Brown butter peach shortcake doughnut. At Doughnut Dollies in Marietta, the brown butter peach shortcake doughnut is the Fresh Fruit Shortcake of the Moment — a specialty offering that rotates seasonally throughout spring and summer. The brioche doughnut is fried in non-GMO sunflower oil and tossed in sugar while still hot. Chef Anna Gatti then fills it with brown-butter-roasted peaches and whipped cream to order. Decadent and delicious.\n724 Cherokee St., Marietta. 404-365-5437, mydoughnutdollies.com.\n7. Peach pizza. A summer pizza is on offer at Colletta in Alpharetta. Topped with san simon di costa, pork tesa (cold-cured pork belly), chives, vin cotto and parmesan, the refreshing peach pizza is a unique combo of juicy fresh Georgia peaches and rich pork tesa.\n900 Third St., Alpharetta. 678-722-8335, collettarestaurant.com.\n8. Papa Don’t Peach bread. Breadwinner Cafe in Sandy Springs cooks up homemade breads from family recipes passed down through generations — baking everything from scratch in small batches. Try the Papa Don’t Peach bread, featuring Georgia peaches, and made-from-scratch peach sweet tea glaze. We dare you to stop at just one slice.\n220 Sandy Springs Circle NE, Atlanta. 404-843-0224, breadwinnerbreads.com.\nNosh on a slice of peach pie and a fuzzy navel slushie at King Barbecue. (Courtesy of King Barbecue)\n9. & 10. Peach pie and fuzzy navel slushie. At King’s Barbecue in Alpharetta, you can enjoy a casual meal, Southern hospitality and a menu of all wood-smoked meats. For dessert, dig into a slice of the peach pie, and wash it down with a fuzzy navel slushie for the ultimate peach fix.\n4195 Avalon Blvd., Alpharetta. 678-248-5159, kingbarbecueatl.com.\nGet a taste of the new fusion revolution with the 2018 AJC Spring Dining Guide: Global Mashup\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/peachy-keen-metro-atlanta-peach-dishes/tODk6DcwcMuKZ93x8uDsDM/"}
