{"authors":["Joe Ridge For Mailonline"],"date_download":"2018-10-22 23:18:06","date_modify":"2018-10-22 23:18:06","date_publish":"2016-01-29 11:00:38","description":"Match of the Day will have a different feel to it this weekend as 18 Football League clubs mix it with 14 Premier League clubs in the FA Cup fourth round. Here are 10 players to keep an eye out for...","filename":"data/vaneerConsumption/10playerstowatchintheFACupfourthroundthatyoumightnothaveheardof.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/10/30B16D4500000578-0-image-a-26_1454063903603.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422474_Ten-players-watch-FA-Cup-fourth-round-not-heard-of_1540250286.html","title":"10 players to watch in the FA Cup fourth round that you might not have heard of","title_page":"10 players to watch in the FA Cup fourth round that you might not have heard of | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Match of the Day will have a different feel to it this weekend as 18 Football League clubs mix it with 14 Premier League clubs in the FA Cup fourth round.\nWhile the majority of the top-flight players on view will be familiar to all, there are bound to be several lesser-known players creating some FA Cup magic for their respective clubs on your TV screens.\nHere are 10 players to keep an eye out for this weekend...\nOxford's Kemar Roofe (right) celebrates after scoring against Swansea in the FA Cup third round\nGeorge Thorne, DERBY v Manchester United\nA powerhouse midfielder with a little bit of everything, the 23-year-old was surprisingly allowed to leave West Brom for Derby in the summer of 2014 having been a shining light in the Baggies' academy alongside Saido Berahino. England youth international will cause United problems.\nAlex Gilbey, COLCHESTER v Tottenham\nColchester have struggled badly in League One this season but Gilbey, another rangy midfielder, continues to impress. The Us turned down a bid from Bristol City for their 21-year-old vice-captain last week but may not be able to cling on to him for much longer should he play well on Saturday.\nDerby's George Thorne (left) and Colchester's Alex Gilbey are both midfield marauders\nZach Clough, BOLTON v Leeds\nAnother to have attracted interest from Bristol City, who had a £2million bid accepted this month before Clough turned them down, the pint-sized playmaker is an outstanding prospect. Initially a winger, he has excelled playing centrally under Neil Lennon and has scored nine goals in 24 games.\nLewis Cook, Bolton v LEEDS\nNot 19 until next month, Cook has already made 66 first-team appearances in Leeds's midfield. Leeds have turned down bids for the England youth international, with Bournemouth at the front of the queue desperate to sign him. A metronome of a passer with a low centre of gravity.\nTwo of the Championship's best prospects Zach Clough (left) and Lewis Cook face each other\nKemar Roofe, OXFORD v Blackburn\nMade a name for himself in the last round as he scored twice to help Oxford see off Premier League Swansea. An energetic, direct and skilful midfielder who loves to shoot, the 23-year-old has scored 18 goals this season playing in the No 10 role. Roofe, like Thorne, was let go by West Brom.\nErhun Oztumer, West Brom v PETERBOROUGH\nDespite standing at just 5ft 3in, the Turkish midfielder has emerged as one of the biggest prospects in the lower leagues, creating and scoring goals for fun in League One. Will enjoy the test of playing against Premier League opposition as he returns to London having been released by Charlton.\nKemar Roofe (left) will hope to make the headlines again and Erhun Oztumer will relish the limelight\nTom Bradshaw, Reading v WALSALL\nWith 14 goals this season for League One surprise packages Walsall, Bradshaw has attracted from Championship clubs Preston, Birmingham and Saturday's opponents Reading. If the 23-year-old Welshman scores the winner at the Madejski Stadium, Reading may just step up their bid to buy him.\nMoses Odubajo, Bury v HULL\nPreviously an exciting young winger in League One with Leyton Orient, Odubajo has emerged as one of the best full backs outside the top flight. Steve Bruce paid Brentford £3.5m to sign the 22-year-old in the summer and his marauding runs have become a feature of Hull's play.\nWalsall's Tom Bradshaw (left) has been prolific this season while Moses Odubajo has impressed for Hull\nAndre Gray, Arsenal v BURNLEY\nProbably the highest-profile name on this list, 17-goal Gray will be itching to play at the Emirates and show what he can do at the highest level. Gray was prolific in non-League with Luton and then in the Championship with Brentford last season, convincing Burnley to splash out £6m on his signature.\nJake Forster-Caskey, MK DONS v Chelsea\nOddly let go on loan by Brighton this season given his reputation as one of the best young English midfielders outside the top flight, Forster-Caskey's game has come on under Karl Robinson. Blessed with a fine left foot, the 21-year-old has 12 England Under 21 caps.","url":"https://www.dailymail.co.uk/sport/football/article-3422474/Ten-players-watch-FA-Cup-fourth-round-not-heard-of.html"}
