{"authors":["Kieran Gill For Mailonline"],"date_download":"2018-10-22 22:42:25","date_modify":"2018-10-22 22:42:25","date_publish":"2016-01-29 10:02:02","description":"The FA Cup weekend gets going with Derby vs Manchester United on Friday night before a host of tasty ties across Saturday and Sunday. Sportsmail pick out 10 things to look out for.","filename":"data/vaneerConsumption/10thingstowatchoutforintheFACupthisweekendLouisvanGaalontheropesasArsenallooktoextendunbeatenrunincompetition.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/309F3C0200000578-0-image-a-4_1454078066710.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422465_10-things-watch-FA-Cup-weekend-Louis-van-Gaal-ropes-Arsenal-look-extend-unbeaten-run-competition_1540248145.html","title":"10 things to watch out for in the FA Cup this weekend: Louis van Gaal on the ropes as Arsenal look to extend unbeaten run in competition","title_page":"10 things to watch out for in the FA Cup this weekend: Louis van Gaal on the ropes as Arsenal look to extend unbeaten run in competition | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The FA Cup weekend gets going with Derby vs Manchester United on Friday night before a host of tasty ties across Saturday and Sunday.\nThere is also Colchester vs Tottenham, Arsenal vs Burnley, Liverpool vs West Ham, Carlisle vs Everton and MK Dons vs Chelsea, among others.\nWe may be in store for a giant-killing or two and here, Sportsmail pick out 10 things to look out for this weekend.\n1. Louis van Gaal on the ropes\nThe FA Cup weekend opens with none other than Derby vs Manchester United.\nVan Gaal is clinging to his job and a trip to face a Championship club who are fighting to prove they should be in the Premier League next season is exactly what he could have done without.\nAttacking football is in short supply at United – they relied on a last-minute penalty to beat League One Sheffield United in the third round – and Derby will fancy their chances.\nLouis van Gaal is under pressure at Manchester United and a FA Cup run could help him keep his job\n2. West Ham hat-trick vs Liverpool\nWest Ham have already beaten Liverpool twice this season, scoring five goals and conceding none. They are out to make it a hat-trick on Saturday at Anfield.\nSlaven Bilic is cautious, however, and the West Ham manager said: ’I didn’t think, “Oh yeah we beat them twice. Come on.” I thought, “Why Liverpool?”\n‘It’s Liverpool. But on the other hand we are confident because we did beat them twice. and we have a very recent memory of beating them. It’s still here what we have to do.’\nAs for Liverpool, Jurgen Klopp is set to make significant changes to his side as they enter their fifth game in 13 days.\nMichail Antonio scores for West Ham in one of their two wins over Liverpool this season\n3. Emmanuel Adebayor debut… and his first competitive match in months\nHe won’t start but Crystal Palace’s new signing could make his debut as a substitute against Stoke.\nAlan Pardew signed the former Arsenal, Manchester City, Tottenham and Real Madrid striker two days ago and talked up the striker ahead of their FA Cup clash at Selhurst Park.\nThe 31-year-old’s last competitive match in England came for Tottenham as a substitute against his former club City in early May.\nYet Adebayor is desperate for the world to know he has been keeping fit – those who have him on Snapchat will be well aware – and the forward could be thrown into the mix against Stoke.\nEmmanuel Adebayor has signed for Palace until the end of the season and could play this weekend\n4. Trading places – Portsmouth and Bournemouth\nIn 2007-08, Portsmouth were in the Premier League and won the FA Cup. Bournemouth, meanwhile, were relegated from League One to the Football League’s basement division.\nNowadays, the roles have reversed, with Portsmouth are in League Two and Bournemouth competing in the Premier League.\nFor 90 minutes on Saturday, though, it will be XI vs XI and Portsmouth will try to rekindle the good, old days when they could go on a run in this competition.\nLeague Two Portsmouth play Bournemouth - just eight years after they won the FA Cup\n5. Son Heung-min to lead Tottenham\nHarry Kane didn’t start either of the FA Cup third-round ties against Leicester, with Mauricio Pochettino putting his faith in Son in the fixture at the King Power Stadium.\nThe South Korea scored and impressed so much that he subsequently started in the Premier League against Crystal Palace.\nSon is set to be used again with Pochettino, who had to cancel his pre-match press conference on Thursday due to illness, expected to give Kane a place on the bench.\nHeung-Min Son looks set to lead the line for Spurs in their Cup tie with Colchester\n6. MK Dons out to beat Chelsea\nA sold-out tie at stadium:mk will watch Championship club MK Dons lock horns with Chelsea.\nMK Dons are no stranger to a giant-killing, having beaten Manchester United in a 4-0 humiliation in the Capital One Cup last season.\nDifferent season, different competition, different club, same or different outcome?\nChelsea don’t have a lot to shout about this season as they sit 13th in the Premier League but they are unbeaten in their last eight games, having won four and drawn as many. This is a Sunday showdown to savour.\nMk Dons manager Karl Robinson will hope his side can cause an upset against Chelsea\n7. Villa looking for something to shout about… or just avoid being humiliated?\nBeing an Aston Villa fan isn’t too appealing this season.\nThe Championship beckons, with the club sitting rockbottom in the Premier League and in the relegation zone by 10 points, and they could use a distraction. In fact, they have even won more cup matches (3) than league games (2) this season.\nThe FA Cup can do exactly that. Trouble is, they face Manchester City at home.\nManuel Pellegrini’s side have scored the most goals in the Premier League this season as they fight for the title and they could run riot at Villa Park.\nSergio Aguero and Manchester City have scored the most goals in the League this season and they travel to bottom club Aston Villa in the FA Cup - just days after reaching the League Cup final\n8. Arsenal to extend unbeaten FA Cup run to nearly three years\nArsenal have won the FA Cup for the last two seasons and their last defeat in this competition came against Blackburn after a late Colin Kazim-Richards goal.\nBurnley are flying high and sit third in the Championship as they push for promotion to the Premier League.\nArsenal are competing for the title but also fancy making it a hat-trick of FA Cups. The tie will likely see Mohamed Elneny make his Arsenal debut while Olivier Giroud has a fine record in this competition – nine goals in his last 13 appearances.\nOlivier Giroud has an excellent record in the FA Cup with nine goals in his last 13 appearances\n9. Lowest-ranked Carlisle to heap more misery on Everton\nCarlisle had a tough start to 2016, given they have been forced to play away from their home at Brunton Park, which was submerged as Storm Desmond swept across the UK.\nThey’ve returned, though, and are even the lowest-ranked team left in the FA Cup.\nThe Premier League visitors, Everton, are off the back of being beaten by Manchester City as they were knocked out of the Capital One Cup at the semi-final stage.\nWill that make Everton even more determined in the FA Cup? Roberto Martinez was left furious by calls going against his team and they could take it out on Carlisle.\nJabo Ibehre and Carlisle will hope to heap more misery on Everton this weekend\n10. Bolton could do with every penny\nIt said a lot about the dire situation at Bolton that they needed the money the FA Cup brings even more than non-League Eastleigh.\nThe Championship club got £67,500 for getting beyond the third round and will get a further £90,000 if they can see off Leeds on Saturday.\nEvery penny counts at Bolton, who are cash-strapped and face relegation to League One. They will look to give their supporters something to shout about at the Macron Stadium.\nBolton have not had a lot to smile about this season - but an FA Cup run could help them financially","url":"https://www.dailymail.co.uk/sport/football/article-3422465/10-things-watch-FA-Cup-weekend-Louis-van-Gaal-ropes-Arsenal-look-extend-unbeaten-run-competition.html"}
