{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 21:34:34","date_modify":"2018-10-30 21:34:34","date_publish":"2016-12-20 00:00:00","description":"Here's what you need to know.","filename":"data/vaneerConsumption/10thingsEuropeanmarketsopenDec20.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_10-things-european-markets-open-dec-20-2016-12_1540935274.html","title":"10 things European markets open Dec 20","title_page":"    10 things European markets open Dec 20 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Children dressed as Santa Claus in a parade held to collect food for the needy, in Lisbon, Portugal December 12, 2016. REUTERS/Rafael Marchante Good morning! Here's what you need to know.\nA Turkish gunman killed Russia's ambassador. Andrey Karlov, was assassinated Monday, shot in the back by a lone attacker while attending a private event at an Ankara art museum.\nAt least 12 people were killed in Berlin. Around 50 more were wounded after a truck plowed into a Christmas market in Berlin on Monday evening, according to German police.\nThe UK will receive China's top diplomat. He will visit Britain this week for regular talks and a meeting with Prime Minister Theresa May, China's Foreign Ministry said, amid uncertainty about the process of Britain leaving the European Union.\nItaly's banking crisis continues. A key investor in ailing Italian bank Monte dei Paschi di Siena's privately funded rescue plan is unhappy with one crucial aspect of the deal, a disagreement that could sink the entire plan if not resolved, the bank said.\nSoftBank Group will invest $1 billion in OneWeb. The company is building a constellation of satellites to improve global broadband access, the Japanese Internet conglomerate and the US startup firm said.\nBritish Airways is powering through Christmas. The company said on it planned to operate a full schedule over Christmas despite a planned strike by cabin crew.\nChina's growth is slowing. The Chinese Academy of Social Sciences on forecast China's economic growth will slow again next year to 6.5%, which would be the slowest pace in more than 25 years, down from expected growth of around 6.7% for this year.\nA New York hedge fund is the focus of a $1 billion fraud. US prosecutors said that the founder of the New York-based hedge fund Platinum Partners and six others were set to be indicted on charges that they participated in a fraud totaling approximately $1 billion.\nBanks in Britain could sue the EU. They are being advised they may be able to sue the European Union if it fails to grant them a staggered departure from the trading bloc using rights from an arcane treaty that usually governs international law.\nBird flu has hit South Korea. The country is concerned about a bird flu outbreak that has seen the biggest-ever cull of chickens and other poultry, its second vice finance minister said. \"The number of culled birds is rising very quickly,\" Song Eon-seok told reporters.","url":"https://www.businessinsider.com/10-things-european-markets-open-dec-20-2016-12"}
