{"authors":["Ben Moshinsky"],"date_download":"2018-10-31 00:17:05","date_modify":"2018-10-31 00:17:05","date_publish":"2016-12-02 00:00:00","description":"Here's what you need to know.","filename":"data/vaneerConsumption/10thingsEuropeanmarketsopenDec2.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_10-things-european-markets-open-dec-2-2016-12_1540945025.html","title":"10 things European markets open Dec 2","title_page":"    10 things European markets open Dec 2 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"An Indian Navy marine commando demonstrates his skills during a rehearsal ahead of Navy Day celebrations in Mumbai, India, December 1, 2016. REUTERS/Danish Siddiqui Good morning! Here's what you need to know.\nBoris was in hot water. Foreign Secretary Boris Johnson denied reports he had told four EU ambassadors that he was personally in favor of allowing free movement of people within the bloc.\nThe US has got a money laundering problem. The United States received failing scores for its efforts to prevent the laundering of criminal proceeds by shell companies, accountants and real estate agents, the Financial Action Task Force (FATF) said in a report.\nNokia phones are coming back. Nokia, once the world's top mobile phone maker, will make a comeback on the smartphone market in the first half of 2017, the company and its licensee said.\nMcDonald's is selling its China stores. A consortium led by private-equity firm Carlyle Group and Chinese conglomerate Citic Group Corp has neared a deal to buy McDonald's stores in China and Hong Kong for up to $3 billion.\nPutin wants an economic boost. Russia needs to introduce economic and tax reforms to end its stagnation, President Vladimir Putin said, urging the government to plan for 2019 and beyond, after the 2018 presidential polls.\nStandard Chartered has a new top lawyer. The bank hired Barclays' top regulatory lawyer Chris Allen as its new general counsel for clients and products. He will be based in Singapore and report to the bank's most senior lawyer, general counsel David Fein.\nThere'll be another big referendum next year. Turkey may hold referendum on constitutional change including a more powerful executive presidency at start of summer next year, Prime Minister Binali Yildirim said.\nSaudi Arabia was hacked. The country has suffered a series of \"destructive\" cyber attacks over the past few weeks, according to a Bloomberg News report.\nImmigration numbers rose. Immigration into the UK hit record levels just before Britain voted to leave the European Union, according to data from the Office for National Statistics.\nThere's tension in Ukraine. Ukraine's military said its two-day missile drill starting on Thursday would avoid the airspace over Crimea, sidestepping a possible confrontation with Russia which annexed the peninsula in 2014.","url":"https://www.businessinsider.com/10-things-european-markets-open-dec-2-2016-12"}
