{"authors":["Associated Press"],"date_download":"2018-10-22 20:40:12","date_modify":"2018-10-22 20:40:12","date_publish":"2016-01-28 02:40:02","description":"Your daily look at late-breaking news, upcoming events and the stories that will be talked about Thursday: 1. CONFLICTING CLAIMS FOLLOW DEATH OF OREGON PROTE...","filename":"data/vaneerConsumption/10ThingstoKnowforThursday28January2016.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:9f5b269e104247d1bdb5b7b2a4c6f6dd-2vdWmEltwXfba0ce28e6322ea12a-692_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3418940_10-Things-Know-Today--27-January-2016_1540240812.html","title":"10 Things to Know for Thursday - 28 January 2016","title_page":"10 Things to Know for Thursday - 28 January 2016 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"10 Things to Know for Thursday - 28 January 2016\nYour daily look at late-breaking news, upcoming events and the stories that will be talked about Thursday:\n1. CONFLICTING CLAIMS FOLLOW DEATH OF OREGON PROTESTER\nOne of Ammon Bundy's followers says Robert Finicum was shot when he charged at federal agent. Members of the Bundy family claim that Finicum did nothing to provoke authorities.\nIranian President Hassan Rouhani arrives for a meeting in Paris, Wednesday, Jan. 27, 2016. Rouhani says his first visit to Europe since the nuclear accord was signed has proven that there are \"great possibilities\" for economic, academic, scientific and cultural cooperation and that \"today we are in a win-win situation\" after years of mutual losses due to sanctions. (AP Photo/Christophe Ena)\n2. JUSTICE DEPARTMENT REACHES TENTATIVE DEAL WITH FERGUSON, MISSOURI\nThe agreement to overhaul the city's police department follows an officer's fatal shooting of 18-year-old Michael Brown in 2014.\n3. BRIGHTER PICTURE OF ZIKA OUTBREAK EMERGES\nNew figures released by Brazil's Health Ministry as part of a probe into the Zika virus find fewer cases of a rare birth defect than first feared.\n4. WHY SOME INVESTORS ARE ANGRY WITH TRUMP\nThe billionaire businessman pitched three companies in recent years to a number of middle-class folks — but the investments didn't pan out.\n5. FACEBOOK POSTS ANOTHER STRONG QUARTER\nThe social network is growing rapidly as it enters adolescence, putting it in a position to challenge Google as the Internet's most powerful company.\n6. WHO'S PUTTING OUT WELCOME MAT FOR IRAN'S ROUHANI\nEurope is greeting the visiting leader, hoping he can orchestrate lucrative business deals and push for peace in the Mideast.\n7. PENTAGON DEFENDS RELIANCE ON RUSSIAN ROCKET ENGINES\nCritics say the use of Russian technology to launch U.S. military satellites enriches Putin's friends.\n8. WHAT WALL STREET IS LOOKING FOR FROM APPLE\nNow that the company has confirmed a slowdown in iPhone sales, all eyes are on its plans for the iPhone 7 and other efforts to spark growth.\n9. SCIENTISTS REPORT POSSIBLE ADVANCE IN FIGHT AGAINST SCHIZOPHRENIA\nResearchers pursuing the biological roots of the disease zero in on a potential factor — a normal brain process that gets kicked into overdrive.\n10. RARE SUCCESS FOR BRITS AT AUSSIE OPEN\nAndy Murray and Johanna Konta reach the semis, marking the first time since the Australian Open in 1977 that two British players have advanced to the final four of any major.","url":"https://www.dailymail.co.uk/wires/ap/article-3418940/10-Things-Know-Today--27-January-2016.html"}
