{"authors":["John Hayward"],"date_download":"2018-10-30 18:10:52","date_modify":"2018-10-30 18:10:52","date_publish":"2016-11-18 18:59:36","description":"President-elect Donald Trump's choice of Rep. Mike Pompeo (R-KS) as CIA director merits exploring interesting facts about the congressman.","filename":"data/vaneerConsumption/10ThingsYouDidNotKnowAboutMikePompeo.json","image_url":"https://media.breitbart.com/media/2015/07/Pompeo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_11_18__1540923052.html","title":"10 Things You Did Not Know About Mike Pompeo","title_page":"10 Things You Did Not Know About Mike Pompeo","title_rss":"NULL","source_domain":"breitbart.com","text":"President-elect Donald Trump’s choice of Rep. Mike Pompeo (R-KS) as CIA director merits exploring some interesting facts about the congressman.\n1. Pompeo, 52, graduated first in his class at West Point in 1986, with a major in mechanical engineering. His Army service included patrolling the Berlin Wall before it came down.\n“My generation was the tail end of the Cold War,” Pompeo said during a 2014 visit to Kansas State, where he discussed the battle against the Islamic State. He added:\nBefore that, you had Nazism. This will ultimately be this generation’s fight, this battle where radical Islam continues to want to take on the West in fundamental ways, in the same way these other ideologies wanted to do before. I think we’re going to be at this for a while. We ought to be vigorous and thoughtful and effective in the way we respond.\nIn a 2011 profile of soldiers in Congress published by the Association of the United States Army, Pompeo is quoted as saying, “I still remember the first acronym I learned, BLUF: Bottom Line Up Front. I still try to communicate that way. No reason to dance around getting to the point.”\n2. He continued his education at Harvard Law School after completing his active-duty Army service in 1991, and was an editor at the Harvard Law Review. He worked as a lawyer in Washington for several years, at the powerful law firm Williams & Connolly.\n“When he arrived here after graduating first in his class at West Point and serving with distinction as an Army officer, he was bent on going into politics,” law professor Mary Ann Glendon recalled in a 2011 interview, continuing:\nWhen he went into business instead, I felt real regret to see yet another young person of great integrity and ability swerve from his original path. But in fact he didn’t. Mike waited until he and his wife, Susan, had raised their son and assured a sound financial footing for the family. This past November, he was elected to the U.S. Congress from the 4th District of Kansas.\n3. As Professor Glendon said in her interview, Pompeo did not go into politics immediately after his time as a D.C. lawyer. Instead, he returned to his hometown in Orange County, California, and founded a company called Thayer Aerospace with some friends from his West Point days. After serving as Thayer CEO for more than a decade, he sold Thayer and became president of Sentry International, a Wichita-based company that sells oil field equipment.\nOne of the minor investors in Thayer was Koch Venture Capital. Given the Left’s deranged obsession with the Koch brothers as the focus of big-money evil in modern politics, we can expect to hear a great deal about this, even though Pompeo has said their investment was less than 2 percent of Thayer’s total funding. There will also be some caterwauling about Koch support for Rep. Pompeo’s congressional campaign.\nPompeo wrote an op-ed in 2012 chastising Democrats for “harassing the Koch brothers,” specifically on the Keystone XL pipeline issue. “The Democrats’ obsession with the Kochs as a political target is, indeed, additional evidence of a truly Nixonian approach to politics,” he said.\n4. Given this background, it is no surprise that Pomepo serves on both the House Intelligence and House Energy and Commerce committees. He was also appointed to the House Select Benghazi Committee.\n5. Perhaps surprisingly, given his business background, Pompeo’s net worth is rated below average by various public interest sites – 69 percent below the average member of Congress, according to InsideGov, which pegs his net worth at $345,011.\n6. Pompeo was elected to Congress in 2010 on the Tea Party wave and is now serving his third term. He was, at one point, seen as a dark-horse challenger to Rep. Paul Ryan (R-WI) for Speaker of the House. There were also rumors he was considering a Senate run.\n“While we have had our share of strong differences – principally on the politicization of the tragedy in Benghazi – I know that he is someone who is willing to listen and engage, both key qualities in a C.I.A. director,” Rep. Adam Schiff (D-CA), ranking Democrat on House Intelligence Committee, said in praise of Pompeo on Friday morning.\n7. Pompeo was originally a supporter of Senator Marco Rubio’s (R-FL) presidential bid, moving his support to Trump after it became clear he would be the GOP nominee. He is close to Vice President-elect Mike Pence, having served with him when Pence was in Congress. During a breakfast for Kansas delegates to the Republican National Convention in July, he called Pence a “friend and mentor” whose “values … are very much like those of us in Kansas.”\n“You have seen him make good decisions in his business life, his family life – with his children, so I am excited for a commander in chief who fearlessly puts America out in front,” Pompeo said of Trump at the same event.\n8. He is a strong critic of the Iran nuclear deal, remarking just Thursday on Twitter that he is “looking forward to rolling back this disastrous deal with the world’s largest state sponsor of terrorism.” Among other actions, he has sponsored bills to increase sanctions on Iran and to require the Obama administration to investigate Iran for violating the Geneva Convention in its treatment of ten captured American sailors last year. He also unsuccessfully attempted to obtain a visa to visit Iran and observe its most recent round of elections.\n9. Pompeo has supported online surveillance programs. He has said former NSA contractor Edward Snowden should be “brought back from Russia and given due process.” He stated, “I think the proper outcome would be that he would be given a death sentence” because he “put friends of mine, friends of yours who serve in the military today at enormous risk because of the information he stole and then released to foreign powers.”\n10. Pompeo has been accused of “Islamophobia” by the Council on American-Islamic Relations, for statements such as this one, made after the Boston Marathon bombing in 2013: “When the most devastating terrorist attacks on America in the last 20 years come overwhelmingly from people of a single faith, and are performed in the name of that faith, a special obligation falls on those that are the leaders of that faith.” He continued, “Instead of responding, silence has made these Islamic leaders across America potentially complicit in these acts and more importantly still, in those that may well follow.”","url":"https://www.breitbart.com/politics/2016/11/18/10-things-didnt-know-mike-pompeo/"}
