{"authors":["Associated Press"],"date_download":"2018-10-22 23:23:52","date_modify":"2018-10-22 23:23:52","date_publish":"2016-01-29 11:05:36","description":"Your daily look at late-breaking news, upcoming events and the stories that will be talked about today: 1. FOR GOP DEBATERS, A TASTE OF WHAT COULD HAVE BEEN ...","filename":"data/vaneerConsumption/10ThingstoKnowforToday29January2016.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:f4003591e1d14d159c6afc4b337594a3-4PuZeKVXE7cd9005b2c876906a5f-267_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422560_10-Things-Know-Today--29-January-2016_1540250632.html","title":"10 Things to Know for Today - 29 January 2016","title_page":"10 Things to Know for Today - 29 January 2016 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"10 Things to Know for Today - 29 January 2016\nYour daily look at late-breaking news, upcoming events and the stories that will be talked about today:\n1. FOR GOP DEBATERS, A TASTE OF WHAT COULD HAVE BEEN\nDonald Trump's absence creates space for his rivals to delve more deeply into their differences on immigration, foreign policy and their approach to governing.\nIn this Jan. 26, 2016 photo, Daniele Ferreira dos Santos holds her son Juan Pedro, who was born with microcephaly, outside her house in Recife, Pernambuco state, Brazil. Santos was never diagnosed with Zika, but she blames the virus for her son¿s defect and for the terrible toll it has taken on her life. (AP Photo/Felipe Dana)\n2. WHERE THE EPICENTER IS FOR VIRUS\nAuthorities are straining to control the Zika outbreak in northeast Brazil, where mosquitoes spread the virus and families struggle with birth defects that may be linked to the disease.\n3. TEXAS TEEN, FAMILY HAD CRIMINAL HISTORY\nAn AP review of documents show that long before Ethan Couch became notorious for using an \"affluenza\" defense in a fatal drunken-driving crash, his family had multiple run-ins with the law.\n4. WEAK GDP REPORT EXPECTED FROM GOVERNMENT\nThe U.S. economy likely slowed significantly in the final three months of 2015 — and the picture seems to have grown gloomier in the first few weeks of 2016.\n5. WHAT MIDEAST FIGHTERS ARE USING AS WEAPON OF WAR\nThe combatants' use of blockades is causing a food shortage as millions across Syria, Yemen and Iraq struggle with hunger and starvation.\n6. FBI SHOWS VIDEO OF OREGON OCCUPIER SHOOTING\nA law enforcement official says a spokesman for the armed activists of a wildlife refuge, who died in a confrontation with officers earlier this week, was shot when he reached for his waistband.\n7. HOW COLLEGES ARE SORTING OUT CHINESE APPLICANTS\nAmerican universities are increasingly turning to video interviewing services to assess students' language skills, get a feel for their personality — and weed out fraudsters.\n8. WHO IS POISED TO DETHRONE A TECH GIANT\nWith the digital ad market booming and demand for smartphones waning, Google's parent company, Alphabet Inc., is ready to knock off Apple as the world's most valuable company. (backslash)\n9. JEFFERSON AIRPLANE CO-FOUNDER DIES\nGuitarist Paul Kantner, who stayed with the seminal San Francisco band through its transformation from 1960s hippies to 1970s hit makers, is dead at 74.\n10. OUT OF WORK TIGHT END GETS THE CALL\nNick Kasa went from an out-of-football Broncos fan to a member of team's practice squad just in time to help Denver prepare for Super Bowl.","url":"https://www.dailymail.co.uk/wires/ap/article-3422560/10-Things-Know-Today--29-January-2016.html"}
