{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 21:44:18","date_modify":"2018-10-30 21:44:18","date_publish":"2016-12-19 00:00:00","description":"Here's what you need to know.","filename":"data/vaneerConsumption/10thingsEuropeanmarketsopenDec19.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_10-things-european-markets-open-dec-19-2016-12_1540935858.html","title":"10 things European markets open Dec 19","title_page":"    10 things European markets open Dec 19 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A girl watches herders selecting and sorting reindeer near the enclosure in the settlement of Krasnoye in Nenets Autonomous District, Russia. REUTERS/Sergei Karpukhin Good morning! Here's what you need to know.\nRenzi admitted his mistake. Italy's former prime minister Matteo Renzi said he made a mistake by \"politicising\" a referendum on constitutional reform that saw him bundled out of office last week. \"We lost, we ultra-lost,\" the 41-year-old Renzi told lawmakers from his centre-left Democratic Party.\nChaos is building in Venezuela. Hundreds of Venezuelans jumped barriers to defy their government's closure of the Colombian border on Saturday while looting and protests continued due to a cash shortage, causing pre-Christmas chaos.\nCar companies are focusing on electricity over petrol. Nissan Motor, Renault and Mitsubishi Motors will combine their electric vehicle platforms in an effort to slash prices down to levels comparable to conventional gasoline cars, the Nikkei newspaper said.\nSupport is growing for a Brexit transition. Britain may need a transitional agreement to smooth its exit from the European Union but it should not \"buy back\" into too many of the bloc's regulations, Britain's trade minister Liam Fox said on Sunday.\nGermany's justice division will seek to crack down on fake news. German judges and state prosecutors need to crack down straight away on fake news disseminated through social media platforms such as Facebook, Germany's Justice Minister Heiko Maas said in an interview published on Sunday.\nThe Polish political crisis is escalating. Around two dozen members of Poland's main opposition party extended their sit-in protest in parliament on Sunday after talks to resolve a dispute over proposed restrictions on media access failed to produce an agreement.\nNigel Farage said he wanted to be a bridge between the British government and the new US administration. \"I can help to be a bridge between the government in this country, the new trade department in this country, and not just Donald Trump but his team, his administration, and I would like to do that,\" Farage told BBC Radio.\nGerman airline Air Berlin's chief executive resigned. He will to step down in the new year, to be replaced by a senior manager at Lufthansa following a wide-ranging shake-up of the loss-making carrier.\nIran bought planes from Europe's Airbus. A deal for IranAir to purchase 100 passenger planes from Europe's Airbus has been finalised, Iranian state news agency IRNA said.\nNorway is getting a new oil minister. Norwegian Oil Minister Tord Lien will step down on Tuesday and be replaced by Terje Soeviknes, news agency NTB reported. Justice Minister Anders Anundsen will also resign.","url":"https://www.businessinsider.com/10-things-european-markets-open-dec-19-2016-12"}
