{"authors":["Associated Press"],"date_download":"2018-10-22 21:34:25","date_modify":"2018-10-22 21:34:25","date_publish":"2017-03-16 01:35:14","description":"Your daily look at late-breaking news, upcoming events and the stories that will be talked about Thursday:1. TRUMP'S REVISED TRAVEL BAN PUT ON HOLDPresident...","filename":"data/vaneerConsumption/10ThingstoKnowforThursday16March2017.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/01/wire-225701-1489628119-587_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318558_10-Things-Know-Thursday--16-March-2017_1540244065.html","title":"10 Things to Know for Thursday - 16 March 2017","title_page":"10 Things to Know for Thursday - 16 March 2017 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Your daily look at late-breaking news, upcoming events and the stories that will be talked about Thursday:\n1. TRUMP'S REVISED TRAVEL BAN PUT ON HOLD\nPresident Trump calls decision by a federal judge in Hawaii an 'unprecedented judicial overreach.'\nIn this October 2016 photo provided by ARC Center of Excellence for Coral Reef Studies, a scientist measures coral mortality following bleaching on the northern Great Barrier Reef, Austrlia. Reducing pollution and curbing overfishing won't prevent the severe bleaching that is killing coral at catastrophic rates, according to a study of Australia's Great Barrier Reef. In the end, researchers said, the only way to save the world's coral from heat-induced bleaching is with a war on global warming. (Tane Sinclair-Taylor/ARC Center of Excellence via AP)\n2. DUTCH LEADER HOLDS OFF ANTI-ISLAM CHALLENGER IN ELECTIONS\nPrime Minister Mark Rutte's party claimed a dominating victory over the party of Geert Wilders in parliamentary elections seen as test for far-right populism in Europe.\n3. WHAT CUTS ARE EXPECTED IN TRUMP'S FIRST BUDGET\nThe Environmental Protection Agency and the State Department face steep cuts while military spending will increase significantly.\n4. WHO HAS BEEN CHARGED IN DEVASTATING YAHOO BREACH\nTwo Russian intelligence agents and a pair of hired hackers are charged in the scheme that targeted the email accounts of Russian and U.S. government officials, Russian journalists and employees of private businesses.\n5. WHY ONLY STOPPING GLOBAL WARMING WILL SAVE CORAL REEFS\nA study of Australia's Great Barrier Reef finds that reducing pollution and curbing overfishing won't prevent the severe bleaching that is killing coral at catastrophic rates.\n6. TRUMP INCREASINGLY ISOLATED IN HIS OBAMA WIRETAPPING CLAIM\nAttorney General Jeff Sessions says he had not given Trump any reason to believe he was wiretapped by Obama, while Republican Rep. Devin Nunes, chairman of the House intelligence committee, says he has seen no information to support the claim.\n7. SUICIDE BOMBING IN SYRIA'S CAPITAL KILLS 30 PEOPLE\nThe attacks reflect a renewed effort by militants to use insurgent tactics against President Bashar Assad's forces in a bid to recover lost momentum as the civil war enters its seventh year.\n8. REPORTS OF SEXUAL ASSAULTS UP AT TWO OF THREE MILITARY ACADEMIES\nAssault reports rose at the U.S. Naval Academy in Annapolis, Maryland, and the U.S. Military Academy at West Point, New York, while dropping at the U.S. Air Force Academy in Colorado, according to details obtained by the AP.\n9. A NEW WAY TO PAY BAR TABS WITHOUT CREDIT CARDS\nAn upgrade being rolled out this summer to Mastercard's mobile payments service will let people open, manage and close their tabs at participating bars and taverns completely through their phones.\n10. CUONZO MARTIN RESIGNS FROM CAL TO TAKE JOB AT MISSOURI\nHe's headed back to the place he knows so well, a big attraction to lure him away from Berkeley after three seasons.\nMembers of the free-market VVD party of Prime Minister Mark Rutte toast after the first exit poll results of the Dutch parliamentary elections were announced in The Hague, Netherlands, Wednesday, March 15, 2017. (AP Photo/Patrick Post)","url":"https://www.dailymail.co.uk/wires/ap/article-4318558/10-Things-Know-Thursday--16-March-2017.html"}
