{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 21:00:36","date_modify":"2018-10-30 21:00:36","date_publish":"2016-12-23 00:00:00","description":"Here's what you need to know.","filename":"data/vaneerConsumption/10thingsEuropeanmarketsopenDec23.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_10-things-european-markets-open-dec-23-2016-12_1540933236.html","title":"10 things European markets open Dec 23","title_page":"    10 things European markets open Dec 23 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Pope Francis arrives to lead his Wednesday general audience in Paul VI hall at the Vatican December 21, 2016. REUTERS/Alessandro Bianchi TPX Good morning! Here's what you need to know.\nDeutsche Bank settled its US investigation. The bank said it would pay $7.2 billion to the US Department of Justice, related to its issuance and underwriting of residential mortgage-backed securities during 2005 to 2007.\nDonald Trump may be getting ready to crack down on goods coming into the US. According to a report by John King at CNN, the Trump transition team has been floating the idea of an executive order that would impose a 5% tariff on all imported goods soon after Trump takes office.\nSpain has blocked Scotland's EU dream. The Spanish government has flatly rejected Nicola Sturgeon's proposals to keep Scotland in the single market if the rest of the UK leaves it after Brexit.\nBirths are at record lows in Japan. The number of annual births in Japan is set to fall below 1 million this year for the first time since data became available in 1899, reflecting a fast-ageing society and the high cost of childcare, Japanese media reported.\nPhilippine President Rodrigo Duterte announced he would halt all online gambling in his country. Duterte made the comment while announcing a 2017 budget that focused heavily on populist measures.\nUS auto sales will reach a new record this year. Sales will top last year's by 5,000 vehicles, despite a 2.2∞ decline this month from a year earlier, industry consultancies J.D. Power and LMC Automotive said.\nFrench far-right leader Marine Le Pen has run out of money. She does not have the funds she needs for her presidential election campaign next year, as banks continue to decline to lend to her National Front for political reasons, a senior party official said.\nLithuania is blaming Russia for cyber attacks. The Baltic state of Lithuania, on the frontline of growing tensions between the West and Russia, says the Kremlin is responsible for cyber attacks that have hit government computers over the last two years.\nPeru and Brazil are embroiled in a bribery scandal. Peru's President Pedro Pablo Kuczynski denied receiving $20 million in bribes from Brazilian construction giant Odebrecht in exchange for help winning a contract in 2005, when he was prime minister.\nChinese roads are dangerous. The country saw 58,000 deaths in more than 180,000 traffic accidents in 2015, authorities said, adding that poor enforcement of traffic laws still posed a threat to road safety in the country.","url":"https://www.businessinsider.com/10-things-european-markets-open-dec-23-2016-12"}
