{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 20:39:02","date_modify":"2018-10-30 20:39:02","date_publish":"2016-12-29 00:00:00","description":"Here's what you need to know.","filename":"data/vaneerConsumption/10thingsEuropeanmarketsopenDec29.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_10-things-european-markets-open-dec-29-2016-12_1540931942.html","title":"10 things European markets open Dec 29","title_page":"    10 things European markets open Dec 29 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A winter swim lover throws hot water into cold air in Heihe, Heilongjiang province, China, December 27, 2016. REUTERS/Stringer Good morning! Here's what you need to know.\nGermany is taking its gold back. \"In 2016, we brought back again substantially more gold to Germany than initially planned; by now, nearly half of the gold reserves are in Germany,\" Bundesbank President Jens Weidmann told the German tabloid Bild.\nPhilippine President Rodrigo Duterte has threatened corrupt government officials with the prospect of being thrown out of a helicopter mid-air. He warned he has done it himself before and had no qualms about doing it again.\nShares in Toshiba fell more than 19% in morning trade on Thursday. The shares clocked a third day of heavy losses after the Japanese tech-to-nuclear conglomerate said earlier this week it faced a potential multi-billion dollar writedown.\nTurkey and Russia have agreed a ceasefire plan for all of Syria. It came into force at midnight, the state-run Anadolu news agency said.\nGermany's central bank says former president Hans Tietmeyer, who was at the helm of the Bundesbank when the euro was introduced, has died. He was 85. Tietmeyer headed the Bundesbank from October 1993 until August 1999, his term expiring a few months after the common European currency made its debut on financial markets.\nCars are getting banned in Spain. Madrid said all privately-owned cars with even-numbered registration plates will be banned from the Spanish capital's roads on Thursday to curb rising air pollution.\nAlibaba is investing in digital content. Alibaba Digital Media and Entertainment Group, the entertainment affiliate of Alibaba, plans to invest more than 50 billion yuan ($7.2 billion) over the next three years, the affiliate's chief executive said.\nIntesa Sanpaolo is trying to offload bad loans. It has included Apollo Global Management, Cerberus and Christofferson Robb & Company in a short list of bidders for a €2.5 billion ($2.61 billion) bad loan portfolio it aims to sell, two sources close to the matter told Reuters.\nIt wasn't too stormy a year. German insurers paid out around €2 billion ($2.1 billion) for claims from storms, hail and heavy rainfall this year, less than the multi-year average of €2.4 billion, insurance trade body GDV said.\nQualcomm angered South Korea. The country's antitrust regulator has slapped a 1.03 trillion won ($865 million) fine on Qualcomm for allegedly violating competition laws.","url":"https://www.businessinsider.com/10-things-european-markets-open-dec-29-2016-12"}
