{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 21:22:39","date_modify":"2018-10-30 21:22:39","date_publish":"2016-12-21 00:00:00","description":"Here's what you need to know.","filename":"data/vaneerConsumption/10thingsEuropeanmarketsopenDec21.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_10-things-european-markets-open-dec-21-2016-12_1540934559.html","title":"10 things European markets open Dec 21","title_page":"    10 things European markets open Dec 21 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"People paddle on a stand-up paddle board in the Sea of Galilee, northern Israel. REUTERS/Ronen Zvulun Good morning! Here's what you need to know.\nSpain is taking aim at the City. It has set up a commission charged with drawing up incentives to attract London-based financial firms looking to relocate after Britain's vote to leave the European Union.\nThat Brexit plan could be coming soon. British Prime Minister Theresa May said she will deliver a speech early next year outlining the government's approach to leaving the European Union.\nA senior Chinese official was jailed for graft. A Chinese court jailed for life a former deputy governor of the province of Shanxi for corruption, state television said, as the government presses on with its crackdown on deeply ingrained graft.\nThe European Union is preparing to fine Facebook. Antitrust regulators have charged Facebook with providing misleading information during its takeover of WhatsApp, opening the company to a possible fine of 1% of its turnover.\nBlackBerry posted another loss. The company saw a 47.3% fall in third-quarter revenue as the software growth it is relying on failed to make up for shrinking handset sales and lost service fees.\nDeutsche Bank was accused in Russia. Russia's central bank said that a banker at Deutsche Bank's Russian branch had manipulated markets by conducting 300 billion rubles ($4.87 billion) of trades with relatives over two and a half years.\nFrench banks are going after the ECB. France's top lenders are suing the European Central Bank to get an exemption from holding capital against deposits parked with a state-owned fund, the most high-profile challenge to supervision from Frankfurt to date.\nMurdoch didn't mention his proposed takeover of Sky before tabling a bid. Prime Minister Theresa May did not discuss with Rupert Murdoch the proposed takeover of UK pay-TV group Sky by the tycoon's Twenty-First Century Fox at a September meeting, Britain's media minister said.\nScotland has a plan to stay a member of the single market. First Minister Nicola Sturgeon unveiled plans for Scotland to stay in the EU's single market after Brexit but said her preferred option would be for an independent state within the EU.\nUkraine nationalised its biggest bank. The central bank poured more than half a billion dollars into the country's largest bank after nationalising it in a bid to avert its collapse and a financial meltdown.","url":"https://www.businessinsider.com/10-things-european-markets-open-dec-21-2016-12"}
