{"authors":[],"date_download":"2018-10-30 01:19:01","date_modify":"2018-10-30 01:19:01","date_publish":"2018-08-27 19:44:50","description":"The garbage disposal is a hardworking kitchen appliance, but it can’t handle everything thrown...","filename":"data/vaneerConsumption/10thingsyoushouldneverputdownyourgarbagedisposal.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/05/Videos/4431520.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_home_things-you-_d53639bf1c5a420e89db1f1e2b928587__1540862341.html","title":"10 things you should never put down your garbage disposal","title_page":"10 things you should never put down your garbage disposal","title_rss":"NULL","source_domain":"ajc.com","text":"The garbage disposal is a hardworking kitchen appliance, but it can’t handle everything thrown its way. Even though “garbage” is included in the name, be mindful not of what you’re tossing down the sink. It’s worth the extra effort to take care of this valuable kitchen tool to avoid pricey plumbing problems down the road.\n1. Eggshells\nMany people debate whether or not eggshells can go down the garbage disposal; it’s better to err on the side of caution. The thin membranes of the shells can get stuck around the blades of the shredder and cause major issues. Instead, throw eggshells in the trash or use them as fertilizer for your garden.\n2. Grease, fat, and cooking oil\nEver watched what happens to hot grease, fat, and cooking oil as it cools? It thickens and hardens—and it will do exactly the same thing in your pipes if you pour it down the drain. To discard, let it cool and solidify in the cup or jar, and then throw it away.\n3. Fruit pits or seeds\nCan you cut through the pit of an avocado or peach with a knife? Your disposal can’t slice them either.\n4. Bones and seafood shells\nWhile tiny bones and seafood shells might slip through the garbage disposal just fine, larger ones cannot be ground up. The disposal wasn’t built to tackle something so hard and dense.\n» Salmonella: Signs and symptoms of infection\n5. Coffee grounds\nCoffee grounds slip through the garbage disposal but pile up in the pipes and turn into a sludgelike mess, causing a major clog.\n6. Pasta, rice, beans, or oatmeal\nStarchy foods like pasta, rice, beans, and oatmeal will expand when drowned in water, clogging the pipes over time.\n7. Nuts\nGarbage disposal blades work much like a blender, shredding food into tiny bits. What’s the product of grinding nuts? Nut butter, which will create a sticky mess that will adhere to the walls of the pipes.\n8. Fibrous veggies\nThe stringy fibers of vegetables such as celery, pumpkin, lettuces, kale, artichokes, asparagus, and pumpkin can get caught around the disposal blades.\n9. Potato peels\nStarchy potato peels can create a huge mess in the drainpipes down the road. Over time, the peels stick together and form a thick paste that causes a clog.\n10. Medication\nRather than pouring unwanted medication down the garbage disposal (or flushing it down the toilet), take it to the pharmacy, where it can be properly disposed of. The chemicals in the medicine can have a harmful effect on the quality of water in your area.","url":"https://www.ajc.com/lifestyles/home/things-you-should-never-put-down-your-garbage-disposal/acTfiR9tooqngysd1oNHuN/"}
