{"authors":["Eva Taylor Grant"],"date_download":"2018-10-31 01:44:16","date_modify":"2018-10-31 01:44:16","date_publish":"2018-09-06 18:28:21","description":"Cheating is a pattern of behavior, but it also comes along with certain thought patterns. And while infidelity is talked about so often, it can feel like there isn't much insight invested into the psychology behind why people stray outside of their…","filename":"data/vaneerConsumption/10ThingsNoOneTellsYouAboutTheWayCheatersThinkAccordingToPsychologists.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/5/2569c491-a34c-4fab-bcf1-3f8bb85cec39-2t4a9731.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_10-things-no-one-tells-you-about-the-way-cheaters-think-according-to-psychologists-11765892_1540950256.html","title":"10 Things No One Tells You About The Way Cheaters Think, According To Psychologists","title_page":"10 Things No One Tells You About The Way Cheaters Think, According To Psychologists","title_rss":"NULL","source_domain":"bustle.com","text":"Cheating is a pattern of behavior, but it also comes along with certain thought patterns. And while infidelity is talked about so often, it can feel like there isn't much insight invested into the psychology behind why people stray outside of their relationships. But discovering how cheaters think can provide insight into much more than their desire for sex, and can answer some questions about why so many people can break a promise.\n“There is not one single reason or path for cheating in a relationship,\" Joshua Klapow, Ph.D. Clinical Psychologist and Host of The Kurre and Klapow Show tells Bustle. \"However, there are a collection of very distinct psychological patterns that cover the vast majority of reasons why people cheat.\" Psychologists have observed these patterns over the years, and have found certain explanations for their behaviors in things like conflict-avoidance, shame, and passive-aggression.\nWhether you've been cheated on, have cheated in the past, or are curious about psychology and infidelity, these insights might be quite interesting. The stereotypes about cheaters are often quite black-and-white, but a lot of these thinking patterns are much more complicated than common narratives about cheating would have you believe.\nHere are 10 things no one tells you about the way cheaters think, according to psychologists.\n1 They Might Fear Conflict Ashley Batz/Bustle A cheater might turn to infidelity because they are scared of getting into a fight about something that's been bothering them. Cheating, then, is an outlet for these frustrations without having to address them in a way that might be intense. \"People cheat often out of fear of facing conflict,\" Dr. Klapow says. \"They know there are problems in the relationship. They have dabbled with addressing them. They don’t see a change, but they don’t know how to dive in deep with their partner to address conflicts in the relationship. Cheating allows them to escape.\" This aspect can help explain why they would do something seemingly outside of the best interest of the relationship.\n2 They Might Fear Confrontation Ashley Batz/Bustle When someone cheats, there's a pretty good chance they've got issues they're dealing with, but are using cheating as an outlet instead of confronting a more serious issue in the relationship. \"People also cheat out of [anger and] avoidance,\" Dr. Klapow says. \"They are frustrated in their relationship. They feel like their partner doesn’t care, doesn’t listen, doesn’t support them [...] In an act of defiance but also avoidance of the problem at hand — the person cheats. So instead of directly confronting the problem they avoid it and act out by cheating.\" This does not excuse cheating, but can provide insight into the kind of personalities most inclined towards cheating.\n3 They Feel Hopeless Ashley Batz/Bustle Sometimes, cheating isn't a behavior of someone who's angry, but somebody who is feeling out-of-control, or in despair. \"People cheat out of hopelessness,\" Dr. Klapow says. \"In some cases [...] the person feels there is nothing left. They have given up, but they don’t want to put an end to the relationship often for logistic reasons (money, kids, lifestyle).\" In these cases, the person they're cheating with can feel like a point of comfort and security when everything else feels out of control.\n4 They See Cheating As A Last-Ditch Effort Andrew Zaeh for Bustle Sometimes, a person who cheats sees their behavior as a piece of a puzzle to save their relationship. They may think that cheating will be what keeps things together. \"People cheat to keep the relationship together,\" Dr. Klapow says, \"[...] They like things about the relationship; they love things about their partner (e.g. they are responsible, trustworthy, good providers, nurturing) but there are other aspects that are not there. The person doesn’t want to leave but doesn’t know how to pull these other qualities out.\" It's not a sustainable, but it is a thought pattern that can justify infidelity.\n5 Sex May Just Be Part Of The Equation Andrew Zaeh for Bustle Another way a cheater might see infidelity as a means to fix a relationship, is if they begin looking for sexual gratification outside their relationship. \"For some, cheating is about getting sex that is not in the relationship,\" Dr. Klapow says. \"It may be the type of sex, the style of sex, the frequency of sex or the feeling of sex. It may be to address arousal that is not being met in the relationship. It can be physical and purely physical.\" This kind of single-reason cheating is rare, however, and most people are also dealing with relationship conflict of some sort. Moreover, for non-monogamous relationships, this sort of exploration makes sense. Sometimes, people need more than one person can give them. But for infidelity, this behavior is going to hurt people in the long-run.\n6 They Might See Cheating As \"Evening The Score\" Andrew Zaeh for Bustle If they believe their partner has done them wrong, the passive-aggressive cheater might see their infidelity as a way to settle things in a non-confrontational, but still hurtful, way. \"Instead of addressing their anger directly with their [partner], they feel justified in cheating as a way to 'even the score,' If they are unhappy in their marriage but too afraid to end it, they may cheat in hopes (conscious or subconscious) of getting caught,\" Lauren Dummit, LMFT, co-founder and clinical director at Triune Therapy Group, tells Bustle. Getting even is not the most healthy way to settle a conflict, but still, some do it.\n7 They May Have Issues With Power And Control Andrew Zaeh for Bustle For some cheaters, the whole institution of monogamy is the problem. While these types of thinkers likely shouldn't be getting into two-person exclusive relationships in the first place, this kind of reaction happens. For some, the issue isn't with relationships themselves, but power structures as a whole. \"Some cheaters have a resentment towards authority or rules [...] so they cheat as a way to demonstrate to themselves that no one is going to control them,\" Dummit says. For these people, cheating is a form of rebellion more than anything.\n8 They Minimize Their Actions Andrew Zaeh for Bustle When cheaters think about what they are doing, or what they've done, they often rationalize their actions by minimizing them. This way, what they've done isn't as big of a deal as it might be to their partner. \"[Some of these thoughts include,] 'It’s just sex. I can do what I want. After all, it’s just sex,' 'It’s not like we’re married. We’re just dating,' [or] 'It was only a quick hook-up. What’s the big deal?'\" Dr. Carla Marie Manly, clinical psychologist, tells Bustle. This way, when the eventual confrontation arises, the cheater may have already been able to convince themself they were in the right.\n9 They Could Have Low Self-Esteem Or Be Narcissistic Andrew Zaeh for Bustle Not all cheaters have the same way of viewing things; often, the types of people who cheat are polarized between narcissists and people with extremely low self-esteem. Both of these types of people, however, might feel a need for an extra boost of love sometimes. \"They have a need for attention and to be put on the pedestal,\" Dummit says, \"[...] Some people have a constant need [...] for attention as a way to validate themselves because they cannot validate themselves from within. They lack a sense of inherent self-worth.\" Others, who already see themselves as all-that, want constant reassurance.","url":"https://www.bustle.com/p/10-things-no-one-tells-you-about-the-way-cheaters-think-according-to-psychologists-11765892"}
