{"authors":["Will Martin"],"date_download":"2018-10-30 22:16:08","date_modify":"2018-10-30 22:16:08","date_publish":"2016-12-15 00:00:00","description":"Here's what you need to know on Thursday.","filename":"data/vaneerConsumption/10thingsEuropeanmarketsopenDecember15.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_10-things-european-markets-open-december-15-2016-12_1540937768.html","title":"10 things European markets open December 15","title_page":"    10 things European markets open December 15 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Federal Reserve Board Chairwoman Janet Yellen testifies before a House Financial Services committee hearing on \"Monetary Policy and the State of the Economy\" on Capitol Hill in Washington July 15, 2015. REUTERS/Yuri Gripas Good morning! Here's what you need to know on Thursday.\nThe US Federal Reserve hiked interest rates. This move, which markets saw a 100% probability of, will increase the target of the federal funds rate — which banks use to lend to each other overnight — by 25 basis points to a range of 0.50 to 0.75%.\nThe central bank also gave us some idea about what its policy makers think is coming in the future. The \"dot plot,\" part of the FOMC's Summary of Economic Projections released along with the policy decision statement, shows where each participant in the meeting thinks the fed funds rate should be at the end of the year for the next few years and in the longer run. The new plot is a bit more hawkish than some of the recent charts. The median FOMC member sees rates rising to between 1.25% and 1.5% at the end of 2017, suggesting three hikes of 25 basis points each over the next year.\nIt's Bank of England day. The latest in a series of big central banking events this week, the Bank of England will release its latest monetary policy decisions at 12.00 p.m. GMT (7.00 a.m. ET). The bank won't set markets alight, with the most likely outcome another 9-0 vote to leave rates unchanged at 0.25%, and keep QE purchases the same.\nYahoo says 1 billion user accounts stolen in what could be the biggest hack ever. The data — including phone numbers, birthdates, and security questions — may have been stolen by hackers during an attack that took place in August 2013, the company revealed on Wednesday. The announcement of what could represent the largest hack of all time is a separate incident than the one Yahoo disclosed back in September. In that hack, Yahoo said that at least 500 million user accounts were compromised.\nOil prices dropped on Thursday as a hike in U.S. interest rates prompted a flood of money away from commodities and into U.S. bonds and the dollar. U.S. West Texas Intermediate (WTI) crude oil futures were trading at $50.97 per barrel at 6.50 a.m. GMT (1.50 a.m. ET), down 7 cents from their last settlement.\nThe world's biggest insurance market will set up a new EU base after Brexit. The Financial Times reports that Lloyds is deciding between five locations in continental Europe, and will make a decision by February. The market will then seek regulatory clearance for the new subsidiary, which will be used to conduct business around the EU using the passporting system. \"In common with other financial institutions, we need to put our plans in place — at least on a precautionary basis,\" Lloyds chairman John Nelson said.\nThe Japanese government and Hitachi will compile a package worth around 1 trillion yen ($8.5 billion) for a UK nuclear power plant project, a government official involved in the project said on Thursday. The Japan Bank for International Cooperation and the Development Bank of Japan will provide financing for the project, the official told Reuters.\nPresident-elect Donald Trump held a meeting with the top execs from the tech world. The meeting was the first major summit between technology leaders and Trump, who has had a shaky relationship with the tech industry and publicly criticized companies like Apple and Amazon while running for office. The CEOs of the three most valuable public American companies by market cap — Apple, Alphabet (Google), and Microsoft — were included in the meeting with Trump. Twitter and its CEO Jack Dorsey were excluded, despite the site being Trump's favourite communication tool.\nItaly's banking problems can be solved and the EU will do everything to help, European Commission chief Jean-Claude Juncker said Wednesday, dismissing fears of something akin to the euro crisis. \"I do not think that we have to expect that the problems of the Italian banks have to be considered as unsolvable,\" Juncker said in an interview with the German public television ZDF.\nUK unemployment stayed steady, but employment fell slightly. Unemployment remained unchanged at just 4.8% — a 10-year low, according to the data released by the Office for National Statistics. That was in line with forecasts from economists polled prior to the release, and unchanged from the number released in November. The UK's employment rate fell for the first time in over a year, dropping marginally from 74.5% to 74.4%.","url":"https://www.businessinsider.com/10-things-european-markets-open-december-15-2016-12"}
