{"authors":[],"date_download":"2018-10-30 21:11:45","date_modify":"2018-10-30 21:11:45","date_publish":"2016-12-15 00:00:00","description":"This college football bowl season features 40 games, that's a large jump from the handful that kicked off in the 1930s.","filename":"data/vaneerConsumption/10thingsyouneedtoknowaboutcollegefootballbowls.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/15/Images/cfb-peach-bowl.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_college_things-you-n_63f47de642469b64b0eaaca27b4fd44f__1540933905.html","title":"10 things you need to know about college football bowls","title_page":"10 things you need to know about college football bowls","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 10\nGrant Halverson/Getty Images The most-experienced bowl: The Chick-fil-A Peach Bowl matchup in Atlanta features two teams with a combined 99-bowl game experience. Alabama has played in 64 bowl games, while Washington has played in 35 postseason games. Only the Music City Bowl - featuring Tennessee (51) and Nebraska (52) - has the most experienced teams.\n2 / 10\nGeorgia Tech Archives Jackets sting: Conference foes -- in the Southern Intercollegiate Athletic Association, Southern and Southeastern conferences -- between 1896 and 1963, Kentucky and Georgia Tech haven't met on the gridiron since 1960. The TaxSlayer Bowl in Orlando is one of three bowl games to feature a matchup we haven't seen in more than 50 years. For the record, Tech leads the team series 11-7-1.\n3 / 10\nSteven Colquitt/UGA Sports Bulldogs beware: Georgia is undefeated in three prior meetings against TCU. The Horned Frogs, however, are historically among the top winning bowl teams. TCU is 15-5-1 (73.8 winning percentage) in bowl games. Only Utah has a higher all-time bowl winning percentage (78.9%) among teams to have played in five or more postseason games. TCU plays Georgia in the Liberty Bowl on Dec. 30 in Memphis.\n4 / 10\nKirk Irwin/Getty Images Miami (Ohio) vs. SEC: If you weren't planning on tuning into the St. Petersburg Bowl, you may be missing out. Miami (Ohio) is 7-3 in its bowl history, with three of those wins coming against SEC teams (including a 21-10 over Georgia in the 1974 Tangerine Bowl). The Redhawks face Mississippi State on Dec. 26.\n5 / 10\nDaniel Shirey/Getty Images And the other Miami: Five teams will be trying to win their first bowl game in a decade. Among them are Mark Richt's Miami Hurricanes, who are winless in six games since defeating Nevada in the 2006 Computers Bowl. The Hurricanes face West Virginia Dec. 28 in the Russell Athletic Bowl.\n6 / 10\nMichael Shroyer/Getty Images A streaky subject: Virginia Tech -- which faces Arkansas Dec. 29 in the Belk Bowl -- has been to a bowl game every year since 1993. The NCAA considers the 24-game streak the longest active consecutive bowl game streak. Florida State, however, will play in its 35th-straight bowl game this year. The NCAA vacated the Seminoles’ 2006 Emerald Bowl victory over UCLA due to an academic issue, therefore negating them of any streak title. Nebraska is considered the reigning longest bowl streak champ having appeared in 35 bowl games from 1969 to 2003.\n7 / 10\nStreeter Lecka/Getty Images Bowl of confusion: Camping World Stadium (formerly known as the Citrus Bowl and Tangerine Bowl) in Orlando will host three bowl games -- the Cure Bowl (Dec. 17); the Russell Athletic Bowl (Dec. 28); and the Citrus Bowl (Dec. 31). And if you're keeping track at home, the Russell Athletic Bowl is on its seventh sponsor since its inception in 1990. It has been previously known as the Blockbuster Bowl; Carquest Bowl; MicronPC Bowl; Florida Tourism Bowl; Mazda Bowl; and Champs Sports Bowl.\n8 / 10\nAustin Anthony/AP Bowl of what? There are 40 bowl games on the roster this season, that's a large jump from the handful that kicked off in the 1930s. The Raisin Bowl, Salad Bowl and Oil Bowl are names of the past. Most of today's games carry corporate branding. Florida leads the way as the home to nine bowl games this season. One game will be played outside U.S. borders, the Popeyes Bahamas Bowl (above).\n9 / 10\nMike Ehrmann/Getty Images Change in scenery: Four bowl games will be played in stadiums normally home to a baseball diamond. They are: the Miami Beach Bowl (Marlins Park, above); the St. Petersburg Bowl (Tropicana Field); the Cactus Bowl (Chase Field); and the Pinstripe Bowl (Yankee Stadium).\n10 / 10","url":"https://www.ajc.com/sports/college/things-you-need-know-about-college-football-bowls/JCSYFTTtCybHd9RXPKOFLJ/"}
