{"authors":["Will Martin"],"date_download":"2018-10-30 22:23:46","date_modify":"2018-10-30 22:23:46","date_publish":"2016-12-14 00:00:00","description":"Here's what you need to know on Wednesday.","filename":"data/vaneerConsumption/10thingsEuropeanmarketsopenDecember14.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_10-things-european-markets-open-december-14-2016-12_1540938226.html","title":"10 things European markets open December 14","title_page":"    10 things European markets open December 14 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A handler baths a horse from the Garrison Savannah in the Caribbean Sea near Bridgetown, Barbados Reuters/Adrees Latif Good morning! Here's what you need to know on Wednesday.\nIt's Fed Day. It's expected that on Wednesday. the US Federal Reserve's FOMC will again raise its benchmark interest rate by 25 basis points, to a range of 0.50% to 0.75%.\nThe Dow Jones Industrial Average closed just shy of the 20,000 mark on Tuesday — getting within just 40 points of the record midday. Hitting that level would be a hugely psychologically significant. Elsewhere in the US markets, both the S&P 500 and Nasdaq composites also finished in the green the day before the Federal Reserve's big December interest rate announcement.\nGoldman Sachs is expected to elevate David Solomon and Harvey Schwartz to be top lieutenants to Chief Executive Lloyd Blankfein. According to a Wall Street Journal report on Tuesday citing people familiar with the matter, Goldman's hire is expected to be announced as early as Wednesday. It comes after President-elect Donald Trump said he would appoint Goldman Sachs President and Chief Operating Officer Gary Cohn to head the White House National Economic Council.\nExxon Mobil CEO Rex Tillerson has been picked as Donald Trump's secretary of state, his team confirmed on Tuesday.\"I have chosen one of the truly great business leaders of the world, Rex Tillerson, Chairman and CEO of ExxonMobil, to be Secretary of State,\" Trump said in a tweet.\nA clear trend is emerging in the London property market. Prices are finally on their way down. The latest UK House Price Index from the Office for National Statistics — released on Tuesday morning — showed that in October, prices in the capital fell by 1.2% from the previous month, with the average house in the capital now worth £474,475.\nUK inflation rose to its highest level since late 2014 in November, according to the latest data released by the Office for National Statistics on Tuesday.The ONS said that the UK's consumer price index — the key measure of inflation — was 1.2%, up from 0.9% in October, and ahead of the 1.1% forecasted by economists.\nThe longer it takes for Britain to trigger Article 50, the more likely businesses are to leave the UK. \"Such uncertainties may serve to postpone business investment decisions within the United Kingdom or, worse, speed up decisions to relocate some operations outside the United Kingdom,\" Zane E. Brown, partner and fixed income strategist at Lord Abbett, a fund manager with $135.9 billion (£106.9 billion) assets under management, said in his \"2017 Global Outlook\" note.\nTwo of Australia's biggest banks were slapped with a combined $15 million fine for trying to fix the currency markets. The Federal Court fined the ANZ and Macquarie Bank for cartel behaviour by their currency traders. The ACCC (Australian Competition and Consumer Commission) says a trader at Macquarie, traders at ANZ and a number of other banks in Singapore used private online chatrooms to discuss the benchmark rate for the Malaysian ringgit.\nBHP says mining at the Samarco iron ore mine in Brazil, the site of a fatal accident last year, could restart next year.The 50/50 joint venture mine with Vale has submitted licencing applications to relevant authorities for a restart of operations at reduced capacity. BHP, in an update, says a resumption is important for Samarco, BHP Billiton Brasil, Vale, the local communities and for the Brazilian economy. \"A restart of operations is technically feasible in 2017,\" says BHP.\nChina's Taiwan Affairs Office said on Wednesday any interference with or damage to the \"one China\" principle would have a serious impact on peace and stability in the Taiwan Strait.U.S. President-elect Donald Trump said on Sunday the United States did not necessarily have to stick to its long-standing position that Taiwan is part of \"one China\", further upsetting China which was already angered by Trump's earlier telephone call with Taiwan President Tsai Ing-wen.","url":"https://www.businessinsider.com/10-things-european-markets-open-december-14-2016-12"}
