{"authors":["Associated Press"],"date_download":"2018-10-23 02:13:40","date_modify":"2018-10-23 02:13:40","date_publish":"2017-03-10 11:14:38","description":"Your daily look at late-breaking news, upcoming events and the stories that will be talked about today:1. COURT REMOVES SOUTH KOREA'S PRESIDENTThe unanimous...","filename":"data/vaneerConsumption/10ThingstoKnowforToday10March2017.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/11/wire-195625-1489145368-686_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300828_10-Things-Know-Today--10-March-2017_1540260820.html","title":"10 Things to Know for Today - 10 March 2017","title_page":"10 Things to Know for Today - 10 March 2017 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Your daily look at late-breaking news, upcoming events and the stories that will be talked about today:\n1. COURT REMOVES SOUTH KOREA'S PRESIDENT\nThe unanimous ruling caps a stunning fall for Park Geun-hye, the country's first female leader, whose corruption scandal plunges the country into political turmoil.\nSupporters of South Korean President Park Geun-hye cry during a rally opposing her impeachment near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed impeached President Park Geun-hye from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Ahn Young-joon)\n2. DEMOCRATS SWIPE PAGE FROM GOP PLAYBOOK\nDemocratic state attorneys general step up their challenges to Trump's revised travel ban, trying to use the court system to thwart the executive branch the same way the Republicans did under Obama.\n3. FOR SOME WOMEN, GOP BILL A STEP BACK\nWomen seeking abortions - and some basic services such as prenatal care, contraception and cancer screenings - would face restrictions and extra costs under the Republicans' health care bill.\n4. ABBAS, TRUMP TO HOLD FIRST PHONE CALL\nThe Palestinian leader has spent many hours on the phone and in meetings with U.S. presidents and officials over the past decade but so far has been unsuccessful in reaching the new U.S. president.\n5. DUTCH ELECTION A GAUGE OF ANTI-IMMIGRANT WAVE\nAll of Europe is watching a vote in the Netherlands for indications on whether populism, and anti-Islam sentiment, on the continent is gaining strength or blowing over.\n6. TRUMP CAMP KEEPING EX-ADVISER AT ARM'S LENGTH\nThe White House tries to distance itself from Carter Page, who briefly served as a foreign policy adviser on Trump's campaign and is now at the center of the controversy over Trump associates' connections to Russia.\n7. WHO'S HAVING SECOND THOUGHTS\nOrganizers of Boston's embattled St. Patrick's Day Parade - reviled for barring gay veterans from marching - schedule an emergency meeting to reconsider their decision.\n8. REMEDY SOUGHT FOR NEPAL'S AMBULANCE SHORTAGE\nDoctors at Stanford University are training four dozen EMTs in the hope that they can gradually transform the Himalayan nation's meager emergency services.\n9. WHY CYCLISTS NO LONGER HAVE TO HIBERNATE\nMore riders are staying outdoors thanks to \"fat bikes\" - mountain bikes with comically large tires - that allow them to conquer winter's worst.\n10. TEXANS CUT TIES WITH BROCK OSWEILER\nOne year after signing a $72 million, four-year deal with Houston, the quarterback is headed to Cleveland.\nIn this Saturday, Feb. 11, 2017 photo a fat tire bicyclist rides on a cross country ski trail during a race at the Sugarloaf ski resort in Carrabassett Valley, Maine. Gone are the days when cyclists had to hang up their bikes the winter. These days, many of them are grinding through winter's snow and spring's mud thanks to trendy new \"fat bikes\" with extra wide tires. (AP Photo/Robert F. Bukaty)","url":"https://www.dailymail.co.uk/wires/ap/article-4300828/10-Things-Know-Today--10-March-2017.html"}
