{"authors":["Associated Press"],"date_download":"2018-10-22 20:36:06","date_modify":"2018-10-22 20:36:06","date_publish":"2016-01-29 02:26:36","description":"Your daily look at late-breaking news, upcoming events and the stories that will be talked about Friday: 1. TRUMP AGAIN BREAKING ALL THE RULES The candidate ...","filename":"data/vaneerConsumption/10ThingstoKnowforFriday29January2016.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:d2513fbebc394e7da78c1b5e037bcc2e-4PuZeKVXE7cd9005b2c87639535d-841_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420692_10-Things-Know-Today--28-January-2016_1540240566.html","title":"10 Things to Know for Friday - 29 January 2016","title_page":"10 Things to Know for Friday - 29 January 2016 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"10 Things to Know for Friday - 29 January 2016\nYour daily look at late-breaking news, upcoming events and the stories that will be talked about Friday:\n1. TRUMP AGAIN BREAKING ALL THE RULES\nThe candidate holds his own protest event to coincide with the final GOP debate before Monday's Iowa caucuses.\nAn army soldier and a health agent from Sao Paulo's Public health secretary check a water container at a residence during an operation against the Aedes aegypti mosquito, which is a vector for transmitting the Zika virus, in Sao Paulo, Brazil, Thursday, Jan. 28, 2016. Brazilian President Dilma Rousseff has called for a meeting of the Latin American and the Caribbean nations to discuss ways to join forces to eliminate the Aedes aegypti mosquito. (AP Photo/Andre Penner)\n2. WHAT OCCUPIERS OF OREGON REFUGE WANT FROM FEDS\nThe last four members of the armed group say they'll leave the wildlife refuge if federal law officers assure them they won't be arrested.\n3. FRESH WARNING ON ZIKA VIRUS\nThe illness is \"spreading explosively\" and the Americas could see up to 4 million cases next year, health officials say.\n4. 'AFFLUENZA' TEEN ARRIVES IN TEXAS\nEthan Couch is booked into a juvenile detention center after being deported from Mexico.\n5. WHERE BERNIE SANDERS' MOMENTUM COULD STALL\nThe Democrat will likely falter if he can't win over African-American voters in South Carolina.\n6. US MILITARY AIMS TO BE MORE FAMILY FRIENDLY\nDefense Secretary Ash Carter intends to double the length of fully paid maternity leave for female service members, officials say.\n7. TEACHER AT CALIFORNIA JAIL ACCUSED OF AIDING ESCAPE\nNooshafarin Ravaghi, 44, is suspected of providing maps to the three inmates and had \"some type of relationship\" with the alleged mastermind of the break-out, authorities say.\n8. WHICH UNCOMFORTABLE REALITY EUROPE IS FACING\nIf the continent isn't going to welcome more than 1 million people a year, it will have to deport large numbers of them to countries plagued by social unrest and abject poverty.\n9. BARBIE GETTING EXTREME MAKEOVER\nMattel says it will start selling the famous dolls in three new body types — tall, curvy and petite.\n10. WHY PEYTON MANNING IS UNDER A CLOUD\nThe Broncos quarterback enters the Super Bowl amid questions whether he received human growth hormone while he was rehabbing his shoulder four seasons ago.\nThis frame grab from a Thursday, Jan. 28, 2016 taken from a video provided by Mexico's Instituto Nacional de Migracion, INM, shows a hooded Ethan Couch, as he is processed by Mexican immigration agents, in Mexico City. INM said that Couch, who used an \"affluenza\" defense in a 2013 fatal drunken-driving accident in Texas, was taken to the Mexico City airport from an immigration holding center, ending his month-long stay in Mexico. Couch was escorted onto a commercial plane, en route to Dallas, Thursday morning. (Instituto Nacional de Migracion, INM via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-3420692/10-Things-Know-Today--28-January-2016.html"}
