{"authors":["Associated Press"],"date_download":"2018-10-22 21:39:26","date_modify":"2018-10-22 21:39:26","date_publish":"2017-04-26 02:20:18","description":"Your daily look at late-breaking news, upcoming events and the stories that will be talked about Wednesday:1. WHAT CONGRESSIONAL RUSSIA PROBE REVEALSHouse...","filename":"data/vaneerConsumption/10ThingstoKnowforWednesday26April2017.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/02/wire-462649-1493169922-80_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446092_10-Things-Know-Wednesday--26-April-2017_1540244366.html","title":"10 Things to Know for Wednesday - 26 April 2017","title_page":"10 Things to Know for Wednesday - 26 April 2017 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Your daily look at late-breaking news, upcoming events and the stories that will be talked about Wednesday:\n1. WHAT CONGRESSIONAL RUSSIA PROBE REVEALS\nHouse oversight committee leaders say President Donald Trump's former national security adviser, Michael Flynn, appeared to violate federal law over payments from Russian organizations after a trip there in 2015.\nFILE - In this Feb. 1, 2017 file photo, then-National Security Adviser Michael Flynn speaks during the daily news briefing at the White House, in Washington. The White House is refusing to provide lawmakers with information and documents related to President Donald Trump's first national security adviser's security clearance and payments from organizations tied to the Russian and Turkish governments. (AP Photo/Carolyn Kaster)\n2. WHY WASHINGTON HASN'T CHANGED MUCH\nThere's an unconventional new president in the White House, but Washington is still up to its old tricks, engaged in familiar brinkmanship just days from a potential government shutdown.\n3. WHO GOT A GRUFF GREETING IN BERLIN\nIvanka Trump drew groans and hisses from an audience in Berlin while defending her father's attitude toward women, but she brushed it aside as \"politics\" during her first overseas trip as a White House adviser.\n4. JUDGE PRESERVES SANCTUARY CITIES' FEDERAL FUNDING\nA federal judge said President Trump has no authority to withhold funding from \"sanctuary cities\" that do not cooperate with U.S. immigration officials.\n5. WHY TRUMP BLAMES CANADA\nPresident Trump has long railed about unfair trade practices of China and Mexico. Now he's drawn a new target - Canada - involving dairy and timber.\n6. ARKANSAS EXECUTIONS PROMPT QUESTIONS ABOUT TRANSPARENCY\nThe nation's first double execution in more than 16 years raised questions about whether witnesses should be allowed to hear what goes on in the death chamber.\n7. WHY WHITE POWER GROUPS ARE TRYING TO UNITE\nIn a turn from their fractious histories, extremist groups are joining together, with six Klan organizations from around the U.S. announcing a consolidation, The AP has learned.\n8. MISSING TENNESSEE STUDENT ENDURED ALLEGED ABUSE BY MOTHER\nThe 15-year-old Tennessee girl who authorities say was kidnapped by her teacher had endured months of abuse at the hands of her mother, according to court documents, making her particularly vulnerable to an adult predator.\n9. HOW HOLLYWOOD COULD BE HURT BY A WRITERS' STRIKE\nA strike threatened by Hollywood writers would have an immediate effect on late-night television, which could go dark.\n10. WHICH NASCAR LEGEND IS RETIRING\nDale Earnhardt Jr. abruptly announces his retirement at the end of the season, a decision that will cost NASCAR its most popular driver as the series scrambles to rebuild its fan base.\nIvanka Trump, daughter and adviser of U.S. President Donald Trump, touches a stllee when visiting the Memorial to the Murdered Jews of Europe after she participated in the W20 Summit in Berlin Tuesday, April 25, 2017. (AP Photo/Michael Sohn, pool)","url":"https://www.dailymail.co.uk/wires/ap/article-4446092/10-Things-Know-Wednesday--26-April-2017.html"}
