{"authors":["Associated Press"],"date_download":"2018-10-23 01:01:35","date_modify":"2018-10-23 01:01:35","date_publish":"2016-01-11 11:30:49","description":"Your daily look at late-breaking news, upcoming events and the stories that will be talked about today: 1. ICONIC SINGER DAVID BOWIE DIES FROM CANCER He turn...","filename":"data/vaneerConsumption/10ThingstoKnowforToday11January2016.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:2d7c3dfc287d465b9756ab95335ddb80-56CX32zFKLb7123928b84cdf4c90-784_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393740_10-Things-Know-Today--11-January-2016_1540256495.html","title":"10 Things to Know for Today - 11 January 2016","title_page":"10 Things to Know for Today - 11 January 2016 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"10 Things to Know for Today - 11 January 2016\nYour daily look at late-breaking news, upcoming events and the stories that will be talked about today:\n1. ICONIC SINGER DAVID BOWIE DIES FROM CANCER\nHe turned 69 on Friday, the same day he released a new album called \"Blackstar.\"\nFILE - In this Saturday, March 2, 2013, photo, a cigarette burns in an ashtray at a home in Hayneville, Ala. A government study released on Monday, Jan. 11, 2016, shows that even though fewer U.S. teens are smoking, exposure to secondhand smoke remains a big problem. Nearly half of nonsmoking kids in middle school and high school were exposed to secondhand tobacco smoke in 2013, and rates were even higher among smokers. (AP Photo/Dave Martin)\n2. MEXICO BEGINS EXTRADITION PROCEEDINGS AGAINST DRUG LORD\nOfficials warn that the process could take a long time as Guzman's lawyers file legal appeals and maneuver to keep their client in his home country.\n3. WHO SEEKS ROADMAP TO PEACE\nA key gathering opens in Islamabad in which four major countries — Afghanistan, Pakistan, China and the United States — hope to agree on steps to restore security in the Afghan nation.\n4. WHOSE INITIATIVES OFTEN HIT WALL IN CONGRESS\nObama had some high-profile victories last year but his State of the Union proposals, such as calls for free community college and higher minimum wage, are not among them.\n5. IT'S THE 'BIGGEST JACKPOT IN THE HISTORY OF THE WORLD'\nThat's what a lottery official says the estimated $1.3 billion Powerball payoff will be by Wednesday's drawing. POWERBALL JACKPOT\n6. HOW 'MARTIAN,' 'REVENANT' GET BOOST WITH TOP GLOBES WINS\nSunday's ceremony endorses the two films that have been lingering on the edges of an undefined award season, a mere days before the Academy Award nominees are revealed.\n7. SOME COLORADO THEATER SHOOTING JURORS STILL TRAUMATIZED\nMore than four months after the trial, they suffer nightmares, flashbacks and guilt but have bonded together to help each other cope.\n8. CHINA'S XI OFF TO ROCKY 2016\nBarely a week into the new year, the Chinese president is having a rough time of it, with a plummeting stock market, falling currency and provocations from North Korea.\n9. SECONDHAND SMOKE HITS ALMOST HALF OF TEENS WHO DON'T SMOKE\nResearchers say the study results show efforts are needed to expand smoke-free zones.\n10. SEAHAWKS SURVIVE AGAINST VIKINGS IN FRIGID WILD-CARD GAME\nEven as Minnesota Vikings kicker Blair Walsh trotted out for a \"chip shot\" game-winning field goal try, Seattle coach Pete Carroll kept right on believing his Seahawks weren't done yet.\nIn this Friday, Jan. 8, 2016 photo, Joaquin \"El Chapo\" Guzman is made to face the press as he's escorted to a helicopter in handcuffs by soldiers and marines at a federal hangar in Mexico City. Guzman's second prison escape in 2015 from a top security prison though a tunnel had embarrassed President Enrique Pena Nieto and made his capture a national priority. (AP Photo/Eduardo Verdugo)","url":"https://www.dailymail.co.uk/wires/ap/article-3393740/10-Things-Know-Today--11-January-2016.html"}
