{"authors":["Keertana Sastry"],"date_download":"2018-10-30 22:33:45","date_modify":"2018-10-30 22:33:45","date_publish":"2014-08-15 11:00:04","description":"After nine seasons, it's hard to hear anyone say anything bad about Supernatural . Fans have stuck with the show during the darkest of days, thanks to the Winchesters' relationship, the overall struggle against good and evil, and the fact that they…","filename":"data/vaneerConsumption/10ThingsYouShouldNeverSayToASupernaturalFan.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/1aa46567-d46c-4911-8794-88661a45e048.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35199-10-things-you-should-never-say-to-a-supernatural-fan_1540938825.html","title":"10 Things You Should Never Say To A 'Supernatural' Fan","title_page":"10 Things You Should Never Say To A 'Supernatural' Fan","title_rss":"NULL","source_domain":"bustle.com","text":"After nine seasons, it's hard to hear anyone say anything bad about Supernatural . Fans have stuck with the show during the darkest of days, thanks to the Winchesters' relationship, the overall struggle against good and evil, and the fact that they save the world on a frequent basis. But we still know there is a lot of criticism for the show. We get it. We know Supernatural can sometimes be too clever for its own good, and that there have been some questionable episodes. But that doesn't mean fans don't get angry when we hear the same insults and questions over and over again.\nWhile it's impossible to deny every single bad thing ever said about Supernatural, there are a few comments that can really sting and piss fans off. Many of them are statements made by people who don't watch the show and won't bother trying. And sometimes we hear comments that are so accurate we want to put them in the back of our minds and try not to think about them ever again. Season 10 of Supernatural will premiere on Oct. 7, and in honor of the series and my fellow fans, here are just a few responses to comments Supernatural haters make constantly. I can promise that my answers are way nicer than the responses from most other diehard fans, so I suggest you heed my warning.\n\"It's On The CW? It Can't Be That Good\"\nAre you kidding? Sure, The CW has featured many, many teen-based shows that have way too much drama. But it was the home of Gilmore Girls for a while, and still airs awesome shows like Arrow... and Supernatural. The CW was also created from The WB and UPN, which aired brilliant shows like Buffy The Vampire Slayer and Veronica Mars. Just because a show is on a network or cable channel, doesn't mean it's automatically better than anything on The CW (cough, Two And A Half Men, cough).\n\"Where Are The Female Characters?\"\nWe fans have complained about this too, people! While the core cast of Supernatural is comprised of four men, the show has featured a multitude of strong female characters like the incredible mother-daughter duo of Jo and Ellen Harvelle. Sure those two and many other women on the show died, sadly, but there are a few great ones that are still around. Charlie and Sheriff Jody Mills are two awesome examples.\n\"The Winchesters Could Never Actually Get Away With The Laws They Break\"\nDuh. This is a TV show. You have to suspend your disbelief at least a little bit. And it's not like they're never been caught doing illegal things on the show. Just watch every episode with Agent Henriksen. Do you just believe everything on every other show? FYI, the Whitewalkers in Game of Thrones aren't real. Sorry to burst that bubble.\n\"It's Just Trying Too Hard To Be Clever\"\nThere's a difference between trying too hard to do something right and actually doing it right. And when it comes to being clever Supernatural mostly does it right. There have been off moments, sure, but the show usually makes just enough jokes at its own expense and sometimes even at the expense of its fans. Just watch \"Ghostfacers,\" \"Bad Day At Black Rock,\" \"Yellow Fever,\" or \"Mystery Spot\" and try to tell me their cleverness doesn't pay off.\n\"The Show Recycles Its Own Stories A Lot\"\nYes! Fine! We know! The episodes where Sam and Dean argue about walking away from each other for good or where they ruin their chances at saving the world for each other's sake are tiring to say the least. But the themes that are recycled in the show are universal, and for that Supernatural should never apologize or be so heavily criticized.\n\"It's All About Queer-Baiting\"\nThis is an issue that has divided the fandom for years. It's true that Supernatural's cast and crew are well aware of some of the dream couples out there, like the 'shipping of Dean and Castiel. Is the show actually going to follow through with any of the shipping requests? Probably not. Do they tease fans with possibilities of the shipping? Probably yes. This is a question that can't really be answered and can make watching the show difficult for many fans. It's also not a problem exclusive to Supernatural, and one that I think all fans have different opinions on, that they have come to after actually watching the show for themselves.\n\"Don't They Just Kill Ghosts Every Week?\"\nFor people who ask this question, I have a question in return: Have you ever even watched this show?\n\"[Insert Show Here] Is Way Better & Has The Same Supernatural Elements\"\nYou're entitled to watch whatever show you want to watch. And yes, shows like Buffy, Grimm, Sleepy Hollow, and more have supernatural elements and use them well. But that doesn't take away from how successful Supernatural is in the same endeavors. Comparing shows like these is futile.\n\"It Stopped Being Good After Season 5\"\nSure, in nine seasons, there have been some stale moments — the Leviathans of Season 7 come to mind — but somehow the series is able to reinvent itself in many ways. While the trajectory that Supernatural creator Eric Kripke followed for the first five seasons of the show was pretty terrific, the new leaders have had their own moments of brilliance.\n\"The Fandom Is Crazy\"\nYou bet we are. We are passionate about an awesome show. Deal with it.\nImages: The CW; lookprettyliveclassyplaydirty (2), fandomzbitch, supernatural-huntress-natz, i-do-what-i-want-bitch, heck-fuck, miss-lovely-soul, allthesupernaturalgifs, whatshouldwecallquitting/Tumblr","url":"https://www.bustle.com/articles/35199-10-things-you-should-never-say-to-a-supernatural-fan"}
