{"authors":["Lea Rose Emery"],"date_download":"2018-10-31 01:47:37","date_modify":"2018-10-31 01:47:37","date_publish":"2018-08-27 18:29:02","description":"Sometimes, you're undeniably still hung up on your ex — thinking about them all the time and imagining you'll get back together. Other times, it might surprise you. You think you're doing fine until you see their name pop up on Instagram or walk by…","filename":"data/vaneerConsumption/11BestPlaylistsToListenToWhenYoureMissingYourEx.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/7ffd2714-65c7-409b-baed-2036053d5abe-fotolia_69528768_subscription_monthly_m.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_11-best-playlists-to-listen-to-when-youre-missing-your-ex-10244694_1540950457.html","title":"11 Best Playlists To Listen To When You're Missing Your Ex","title_page":"11 Best Playlists To Listen To When You're Missing Your Ex","title_rss":"NULL","source_domain":"bustle.com","text":"Sometimes, you're undeniably still hung up on your ex — thinking about them all the time and imagining you'll get back together. Other times, it might surprise you. You think you're doing fine until you see their name pop up on Instagram or walk by the restaurant where you had your first date and suddenly, it all just hits you in the gut. But no matter what the circumstances are, missing your ex is tough. Not only can it feel heavy and suffocating, it's also easy to get into an blackhole where you can't stop thinking about them on a loop.\nSo how can you get over them... rather than doing something silly like calling them over and over at 2 a.m.? Well, it can be hard to stop yourself, but a good distraction can help. (And if you feel like being hung up on your ex is affecting your day-to-day, it's always a good idea to talk to loved one or a therapist.)\nIf you're feeling like you can't stop thinking your ex, here are some playlists worth checking out — from the angry anthems to the uplifting hits that remind you will fall in love again — because sometimes it helps to remember that others have been there before and that this feeling will pass, eventually.\n1 When You're Angry As Hell This playlist has you covered, with the very apt title, \"f*ck you, i miss you, i hate you so much\". Expect a little of everything, from Big Sean to Adele to Justin Bieber. It's a great choice when you want to vacillate between wallowing and telling them to eff right off.\n2 When You Just Want To Be Sad If it's a fresh breakup, you may still be in the very sad stage. And that's OK. Give yourself some time to feel down before you make yourself snap out of it.\n3 When You Want To Shout It Out These breakup anthems, from Tay Tay to Sam Smith to Post Malone, have a lot of heartache you can belt out, but also enough upbeat choices in between to help you feel positive.\n4 When You Need Reminding It Wasn't Right It's an entire playlist called \"Better Off Alone\" — need I say more?\n5 When You're Ready To Look Forward This \"It Gets Better\" playlist has 100 songs from Lady Gaga to Pink, all ready to remind you that you won't feel this way forever.\n6 When You Need A Mood Lift This playlist comes straight from Spotify. It's called \"Daily Lift\" and it's always ready with upbeat and uplifting songs to help you start your day off with a little boost.\n7 When You Just Need Beyoncé Here's an entire playlist devoted to Queen Bey. And to be honest, her music is basically medicine when it comes to getting over breakups, so just listen, learn, and heal.\n8 When You Want To Snap Out Of It If you're done wallowing and you want to remember all of the great things that are heading your way, this is a playlist full of anthems to remind you that being single can be the effing best.\n9 When Your'e Feeling Nostalgic Sometimes when you're hurting, it's time to just go straight for the cheese. This playlist is full of classic anthems and love songs for the classic rock lover buried in your soul — belt out Journey and forget your problems.\n10 When You're In The Shower A playlist dedicated to singing along? Yes, please — let the catharsis and healing begin.","url":"https://www.bustle.com/p/11-best-playlists-to-listen-to-when-youre-missing-your-ex-10244694"}
