{"authors":["Jenna Ballard"],"date_download":"2018-10-30 23:18:44","date_modify":"2018-10-30 23:18:44","date_publish":"2014-08-13 20:44:29","description":"Even if you aren't sure what an epistolary novel is, you've probably already read at least one without even realizing it, like The Color Purple, Dracula, or The Perks of Being a Wallflower. Starting to see a thread here? They're stories told through…","filename":"data/vaneerConsumption/11ContemporaryEpistolaryNovelsThatAreaBlasttoRead.json","image_url":"https://imgix.bustle.com/rehost/2017/5/31/666bcee2-a92b-4066-ab9f-c64e1b000491.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_34809-11-contemporary-epistolary-novels-that-are-a-blast-to-read_1540941524.html","title":"11 Contemporary Epistolary Novels That Are a Blast to Read","title_page":"11 Contemporary Epistolary Novels That Are a Blast to Read","title_rss":"NULL","source_domain":"bustle.com","text":"Even if you aren't sure what an epistolary novel is, you've probably already read at least one without even realizing it, like The Color Purple, Dracula, or The Perks of Being a Wallflower. Starting to see a thread here? They're stories told through journal entries, letters, emails, text messages, and other documents. Got it.\nOne of the reasons epistolary novels are so much fun to read is that it's like there's no narrator at all — it feels as if you've actually stumbled upon the character's old diary entries or a letter she wrote to her best friend. If the novel includes documents from multiple people or time periods, it's like you're the only one who holds them all, and you get to piece together the story's puzzle.\nEpistolary novels are also a pretty fascinating way to capture how we communicate at a certain moment in time. When was the last time you actually sent a handwritten letter? We don't even use AOL Instant Messenger anymore, and that was wasn't even that long ago. When technology changes in a flash — usually right around the time your parents have finally, mercifully figured out how to use something — you can envision epistolary novels like mini-communication time capsules. They help us remember what it was like to wait weeks for a letter from your pen-pal, or how much you agonized over what that certain smiley face your middle school crush sent you on AIM really meant. It's only a matter of time before we get a novel told entirely in Instagram and Twitter updates — and if it's written anything like Anna Kendrick's Twitter, I will totally buy it.\nIn the meantime, here are 11 incredibly fun contemporary epistolary novels, both YA and adult, now that you're most certainly in the mood to read one:\nAttachments by Rainbow Rowell\nClick Here To Buy\nWritten by Rainbow Rowell pre- Eleanor & Park fame, Attachments is partially told in work emails between Beth and Jennifer, two best friends who work at the same newspaper. Usually their email exchanges aren't so much work-related as \"relationship troubles/pregnancy scares/cute new guy in the office\"-related. Lincoln works at the newspaper, too, monitoring coworker emails that have been flagged for possible inappropriate content. Soon, Lincoln finds himself looking forward to reading Beth and Jennifer's exchanges and eventually falling in love with Beth (though he's never actually met her). Lincoln is endearing, Beth and Jennifer's banter is hilarious, and the best part is that the whole story takes place in 1999/2000 — bring on the references to Titanic and Y2K hysteria.\nWhere'd You Go , Bernadette by Maria Semple\nClick Here To Buy\nBernadette Fox hates Seattle: the city, the people, and especially the other parents she encounters at her 15-year-old daughter's school. She hates it so much that she has a personal assistant living in India who completes her most basic errands virtually so Bernadette never has to leave the house. Bernadette promises her daughter, Bee, that they'll go on a family trip to Antarctica as a reward for Bee's amazing grades, but then she vanishes. The book is made up of emails, journal entries, and various documents that piece together where Bernadette has gone, but this is not a disturbing, Gone Girl type of disappearance — you'll be laughing at Bernadette's utter absurdity on every page.\nThe Year of Secret Assignments by Jaclyn Moriarty\nClick Here To Buy\nOne of Jaclyn Moriarty's loosely-connected Ashbury/Brookfield novels, The Year of Secret Assignments is a glorious combination of the touching female friendships from The Sisterhood of the Traveling Pants and the outrageous hijinks of MTV's High School Stories: Scandals, Pranks, and Controversies (remember that show?!), plus, everyone is Australian. Three high school girls are forced to participate in a pen-pal program with students from their rival private school. Their assigned pen-pals just so happen to be three guys, so of course some adorable teen romances occur, all while a prank war escalates between the two schools.\nThe Murder of Bindy Mackenzie by Jaclyn Moriarty\nClick Here To Buy\nBindy Mackenzie is a peripheral character in The Year of Secret Assignments, but in this novel her journal, memos, typed transcripts, and letters take center stage. Bindy has a total Type-A, teacher's pet personality, which is probably why most of the other kids in her school don't like her. This book is similar to Where'd You Go, Bernadette in that the title and premise make it sound like a potentially horrifying or heartbreaking story, but nothing is further from the truth. Bindy's earnestness yet total lack of self-awareness will have you simultaneously cracking up and shaking your head. And without giving anything away: a twist near the end will have you feverishly turning pages until the conclusion.\nClick Here To Buy\nMeg Cabot's \"Boy\" series is made up of three books that are loosely connected to one another, but each can also be read as a stand-alone novel. They're made up of the emails, IMs, and journal entries of the staff at a fictional New York City newspaper. Full of dishy workplace gossip and romantic entanglements, each book reads like a contemporary romantic comedy that's actually witty.\nThe \"Internet Girls\" Trilogy by Lauren Myracle\nClick Here To Buy\nTTYL, TTFN, and L8TER, G8TER will take you back to your days of pestering SmarterChild with immature questions and leaving Away Messages peppered with emo Fall Out Boy lyrics. Each novel is told entirely in the Instant Message conversations between three best friends, Angela, Maddie, and Zoe as they navigate family troubles and the typical high school highs and lows.\nThe Princess Diaries Series by Meg Cabot\nClick Here To Buy\nIf you're someone who has seen The Princess Diaries movies starring Anne Hathaway, but hasn't read the original book series, do yourself a favor and change that, like, yesterday. The movies are fun and charming in their own way, but the books are extremely different and ten times better. Mia's father, aka the Prince of Genovia, is actually alive for all 10 books, and Mia's Genovian grandmother is definitely NOTHING like sweet, classy Julie Andrews: she smokes and drinks Sidecars while she barks orders at Mia during princess lessons, and has eyeliner tattooed on her eyelids \"so she doesn't have to waste time with makeup when she could be, you know, terrorizing people.\" All of the books are told mostly through Mia's diary, though they also include IMs, class notes, and endless pop culture references.\nDear Mr. Knightly by Katherine Reay\nClick Here To Buy\nAfter a complete stranger known as Mr. Knightly offers to pay 23-year-old orphan Samantha Moore's tuition at the Northwestern University Medill School of Journalism, she agrees to his one and only condition of regular progress updates in the form of personal letters. The book was published in 2013, but Samantha's letter-writing style feels straight out of a Jane Austen novel — probably because it's based on the 1912 epistolary novel Daddy Long Legs by Jean Webster.\nRoomies by Tara Altebrando and Sara Zarr\nClick Here To Buy\nOf all the books on this list, Roomies is closest to a traditional novel in terms of narration. Most of the book is told in first-person narration that alternates between two soon-to-be college roommates Elizabeth and Lauren; however, the only way they interact with one another is through emails. Their exchanges start as the practical, \"Who's bringing the mini-fridge?\"-type of conversations, but as they continue to correspond throughout the summer, they find themselves sharing more about their lives with each other than with anyone else they know.\nAbsolutely Normal Chaos by Sharon Creech\nClick Here To Buy\nMary Lou Finney's English teacher has tasked the class with keeping a journal over the summer, to be handed in when they return to school in the fall. At first, Mary Lou is completely against the idea — then she fills up multiple journals recounting her endless family drama, including an older cousin who comes to stay at their already-crowded home for the summer, and her best friend Beth Ann, who will not stop talking about her new boyfriend. This book is a quick, easy read that's perfect for when you're feeling nostalgic about those summers as a kid when you felt cooped up with your own crazy family.\nLove, Rosie by Cecelia Ahern\nClick Here To Buy\nBy the author of PS, I Love You (which was made into that movie with Hilary Swank you saw with all of your female family members and cried your eyes out during), Love, Rosie is a romance told in the emails, letters, and text messages written over many years between Rosie and Alex. The childhood best friends become separated when Alex leaves Ireland for college in Boston and Rosie must remain home after an unexpected event puts a dent in her own moving plans, though they never lose touch with each other over 50 years. The novel was recently made into a movie starring Lily Collins and Sam Claflin that will hit theaters in October.","url":"https://www.bustle.com/articles/34809-11-contemporary-epistolary-novels-that-are-a-blast-to-read"}
