{"authors":["Gabrielle Moss"],"date_download":"2018-10-30 22:26:25","date_modify":"2018-10-30 22:26:25","date_publish":"2014-08-15 17:54:09","description":"Listen, you need to relax. And not just because you've seemed all exhausted and twitchy lately — you need to relax because it's National Relaxation Day! Founded in Britain in 2001 (under the much sassier name of National Slacker Day), National…","filename":"data/vaneerConsumption/11FreeWaystoRelaxonNationalRelaxationDayBecauseYoureLookingaLittleTense.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/5afaf6f9-b1ff-4901-88c3-55ec415f994f.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35932-11-free-ways-to-relax-on-national-relaxation-day-because-youre-looking-a-little-tense_1540938385.html","title":"11 Free Ways to Relax on National Relaxation Day, Because You're Looking a Little Tense","title_page":"11 Free Ways to Relax on National Relaxation Day, Because You're Looking a Little Tense","title_rss":"NULL","source_domain":"bustle.com","text":"Listen, you need to relax. And not just because you've seemed all exhausted and twitchy lately — you need to relax because it's National Relaxation Day! Founded in Britain in 2001 (under the much sassier name of National Slacker Day), National Relaxation Day urges us all to take today to step aside from that impossibly long research paper/drawn-out relationship drama/Excel spreadsheet and chill out a little.\nIt's important to relax today — even if you don't believe in doing things just to celebrate obscure and recently invented holidays. Lowering your stress levels and relaxing can do everything from keeping you from catching colds to helping you sleep better. But while it would be great to be the kind of person who can relax by waking up at dawn and doing some yoga in the great outdoors before sipping some herbal tea and then heading down to the spa for a nice rubdown, that's probably not your life. And it probably never will be. But just because you can't spend a week meditating in a monastery, that doesn't mean you can't still seriously relax. Here are some unconventional, free, and totally doable ways to de-stress during your day. Best of all? None of them involve saying \"namaste\" to a dude in a ponytail.\nFILL UP AN ONLINE SHOPPING CART with your dream goods . . . AND THEN DON'T BUY ANYTHING\nShopping releases endorphins — and no, I am not quoting Clueless, I am quoting an actual medical fact. Shopping is linked to activity in the areas of the brain most closely associated with pleasure and positivity. But since paying off a pair of gladiator sandals for the next three years is not good for any part of your brain, online window shopping is a great compromise.\nJust fill up a fantasy online shopping cart on your favorite luxury shopping website. A $600 Zac Posen ¾-sleeve peplum dress? Sure, that’ll look great at the pub quiz next week! Frye boots that cost more than my annual car insurance payments? Why not? Then, let your finger briefly hover over the “check out” button, close out the window completely, reap the endorphin high, and pretend it's in the mail.\nMASTURBATE\nEasy to do with tools you already have on hand (ha!), masturbation offers stress relief benefits like you wouldn't believe, from improved sleep to better body image. So buzz one out tonight in the name of deeper sleep, healthier confidence, a more stress-free world, and Johnny Depp circa 1993 (or, you know, whatever works for you).\nRE-READ A FAVORITE BOOK FROM YOUR TWEEN YEARS\nClaudia and Mallory, Harry and Hermione, Jessica and Elizabeth, Anne Shirley, or Margaret (you know, the one who wanted to talk to God?) are all right where you left them, years ago, before the stresses of things like jobs and rent and Tinder invaded your life. Doing something familiar is relaxing on its own, so sit back, relax, and remember a time before you ever had a student loan. TV shows you loved from your youth can work, too, though exercise caution with them — some of them have aged poorly (side-eye in your direction, Sabrina the Teenage Witch).\nDANCE IT OUT TO A POP SONG YOU SECRETLY LOVE\nDance in and of itself is a source of exercise and stress relief, but add in the exquisite pleasure of dancing to a song that you just can't keep yourself from loving, and you've got a next-level stress relief activity. I personally credit my own sunny disposition to the fact that I close my office door and do an impassioned interpretive dance to the Jessica Simpson version of \"Take My Breath Away\" two to five times a week. So whether it's mall emo from high school, a goofy show tune, or the theme from Titanic, hide yourself away from prying eyes, blast your tunes, and head for Relaxation City, Population: You.\nCHILL WITH A PET (or watch a video of one)\nPlaying with your pet dog, cat, or capybara can lower your heart rate and blood pressure, leading to increased relaxation. If you don't have any pets in your life, try looking at some videos or pictures of dogs or cats, which also has been proven to upgrade your mood. I hear that there might be a few of those on the internet, somewhere.\nLISTEN TO SOME FUNNY MUSIC\nA band called Marconi Union wrote a song that scientists have deemed is the most relaxing song of all time. I listened to it, and it's true — it felt like taking a Xanax through my earbuds. Which is fine. But I personally like to combine the stress relief benefits of laughter (which include soothing tension and improving mood) with my music to relax. Yes, I am addicted to joke music. Try Lonely Island, Jack Black's Tenacious D, Weird Al, or even random novelty songs, like this song by Rob Cantor about Shia Labeouf's strange hobby.\nRob Cantor on YouTube\navoid INTERNET COMMENTS\nYou know how it is: You scroll to the bottom of an article, read the first comment, and then get accidentally sucked down a rabbit hole of weird, angry strangers venting their weird, angry frustrations on other equally weird, angry strangers. And you were just trying to read an article on how to make your own pumpkin spice lattes!\nComment sections are more often than not places that can stress you out beyond belief and make you lose all faith in humanity. So pledge to spend the day staying away from the comments section on all websites. YouTube? You don’t. Huff Post? I huff not. The New York Times? New . . . uh, just don't do it.\nTAKE A WALK\nTake it from legal mastermind Elle Woods — physical exercise releases endorphins, which relieves stress. Luckily, you don't have to go to spin class to get endorphins; even a mid-day walk outside to a coffee shop a few extra blocks away (which is a special stress relief trip I always take when I feel like I am on the verge of completely losing my shit) can help chill you out (and not shoot your husband, obvi).\nPLAY A GOOFY GAME ON YOUR PHONE\nGuys, we’re not spending all of our future children’s inheritance on Kim Kardhasian’s Hollywood because we genuinely believe that Kim Kardhasian is a wise sage who can really help us get to the top of the A list. We're doing it because games help reduce stress and depression, and repetitive phone games, like Angry Birds or Candy Crush, help us zone out and relax, creating an oasis of sanity. So don't feel guilty for that hour you spent noodling around on Bejeweled — it really can take the edge off.\nDON'T CHECK YOUR VOICEMAIL\nWhat is it about that little voicemail notification icon that’s so much worse than reading a text or an email? Well, it's no surprise that I (and, I am sure, many of you) get super stressed out by the prospect of checking my voicemail — most voicemails these days are generally related to work, bill collection, and parents who don't know how to use email. It is the perfect trifecta of stress-induction. So, on this National Relaxation Day, give yourself a pass and just don’t check it.\nWATCH THE REAL HOUSEWIVES\nWe're all in this together, guys. No judgment.\natlhousewivesfan on YouTube\nImages: hercampus.com, viralplay.com, wecravegamestoo.com, babysittersclub.wikia.com, fuckyeahdancinggifs.tumblr.com, Giphy (6), jezebel.com","url":"https://www.bustle.com/articles/35932-11-free-ways-to-relax-on-national-relaxation-day-because-youre-looking-a-little-tense"}
