{"authors":["Ben Kew"],"date_download":"2018-10-30 20:38:07","date_modify":"2018-10-30 20:38:07","date_publish":"2018-07-31 20:38:46","description":"Islamic State claimed a van explosion at a military checkpoint in the Philippines which killed 11 people, an army spokesperson has confirmed.","filename":"data/vaneerConsumption/11KilledinIslamicStateBombinginPhilippines.json","image_url":"https://media.breitbart.com/media/2018/07/philippines-van-bombing-isis.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_07_31__1540931887.html","title":"11 Killed in Islamic State Bombing in Philippines","title_page":"11 Killed in Islamic State Bombing in Philippines","title_rss":"NULL","source_domain":"breitbart.com","text":"The Islamic State (ISIS) claimed responsibility for a van explosion early Tuesday morning at a military checkpoint in the Southern Philippines that killed 11 people, an army spokesperson confirmed.\nPhilippines Army Lieutenant Colonel Jonas Templo confirmed that the detonation took place in the early hours of Tuesday morning in Basilan, the island stronghold of Islamist group Abu Sayyaf.\nThose killed in the blast included a soldier, five paramilitary troops, four civilians, and the suspect himself. An additional seven people were wounded. The Islamic State later claimed responsibility for the attack, calling it “a martyrdom operation.”\nThis view was corroborated by Lt. Col. Mon Aldomovar, commander of the Third Scout Ranger Battalion in the area, who said that the local caliphate of Abu Sayyaf organized the attack.\n“Abu Sayyaf are responsible for this incident,” he said of the group founded in the 1990s, which has since brought havoc to the region through a series of bombings and kidnappings. Last year, multiple soldiers died trying to prevent the beheading of German sailor Jurgen Kanter.\nAldmovar indicated the explosion might have been premature.\n“Our troops were alerted when they saw a suspicious-looking driver. But when he was told to stop and when our troops were about to inspect the vehicle, it suddenly exploded,” he said. “We don’t know what was really the target. It was prematurely detonated at our checkpoint when our personnel stopped the vehicle from going into the city.”\nPresidential spokesman Harry Roque condemned the attack as a “war crime,” calling it “an illegal use of force, even in times of armed conflict.” He also vowed “to bring the perpetrators of this brazen attack to justice.”\nThe attack came just days after President Rodrigo Duterte approved the Bangsamoro Organic Law (BOL) that provides greater autonomy for majority-Muslim areas of Mindanao. While working with Muslim groups in the region, Duterte has repeatedly refused to negotiate with Abu Sayyaf and vowed to eradicate them.\nIslamic terrorism still remains a major problem in the Philippines and other countries across the region, with multiple attacks taking place over the past decade. Some analysts fear the country’s Islamic regions could become a future jihadi stronghold.\nLast year, Duterte expressed frustration with his success in reducing the threat of the Islamic State and threatened to “carpet” bomb the country’s only officially Islamic city if it meant keeping soldiers safe.\n“I will not put the soldiers at high risk,” he said at the time. “If I have to bomb [and] flatten the place, I will do it. And I will take full responsibility for it.”\nFollow Ben Kew on Facebook, Twitter at @ben_kew, or email him at bkew@breitbart.com.","url":"https://www.breitbart.com/national-security/2018/07/31/11-killed-islamic-state-bombing-philippines/"}
