{"authors":[],"date_download":"2018-10-22 21:23:31","date_modify":"2018-10-22 21:23:31","date_publish":"2014-06-05 02:34:36","description":"The first complete skull of the ancestor of today's bizarre \"worm lizards\" reveals that they have been largely unchanged for 11 million years.","filename":"data/vaneerConsumption/11MillionYearOldWeirdWormLizardDiscovered.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/488631/140604-wormlizard_2f02d7495c49d6b03d3278769d8fec09.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_weird-science_11-million-year-old-weird-worm-lizard-discovered-n123141_1540243411.html","title":"11 Million-Year-Old Weird Worm Lizard Discovered","title_page":"11 Million-Year-Old Weird Worm Lizard Discovered","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"Their fossil record was until now limited to isolated and usually fragmented bones,\" Bolet told LiveScience in an email. \"Thus, the study of a complete fossil skull more than 11 million years old was an unprecedented opportunity.\" [The 12 Weirdest Animal Discoveries]\nWorm lizards are found around the world today, though most of the 180 or so extant species live in the Arabian Peninsula, Africa and South America. Some have rudimentary legs, but most have no limbs at all, and resemble large earthworms.\nThe new skull was found in sediments excavated in 2011 in the Vallès-Penedès Basin in Spain's Catalonia region. The skull is surrounded by a concretion of carbonate rock that has hardened around it like cement.\nThe researchers knew it would be impossible to remove the rock crust from the fossilized bone without damaging the skull inside. So they used computed tomography scanning to create a 3-D virtual reconstruction of the bone still locked in the rock.\nBased on their study of the model, researchers determined that the specimen, which measured only 0.23 inches (5.8 mm) at its widest spot and had 20 teeth, was a previously unknown species. They dubbed the animal Blanus mendezi in honor of Manel Méndez, the technician who discovered the skull.\nTheir report on the worm lizard was published Wednesday in the journal PLOS ONE.\n— Stephanie Pappas, LiveScience\nThis is a condensed version of a report from LiveScience. Read the full report. Follow Stephanie Pappas on Twitter and Google+. Follow LiveScience on Twitter, Facebook and Google+.","url":"https://www.nbcnews.com/science/weird-science/11-million-year-old-weird-worm-lizard-discovered-n123141"}
