{"authors":["Carolyn Steber"],"date_download":"2018-10-31 01:44:23","date_modify":"2018-10-31 01:44:23","date_publish":"2018-09-06 18:12:59","description":"Two types of inflammation can occur in the body: either acute or chronic. While the former is necessary for the body to heals itself, the latter can actually be quite damaging and lead to health issues over time. And that's why it's important to be…","filename":"data/vaneerConsumption/11SmallHabitsThatCanIncreaseInflammationInYourBody.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/9a80510b-b86b-4d54-ac16-774d69cfb567-zaeh_bustle_apr2016-444.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_11-small-habits-that-can-increase-inflammation-in-your-body-11471919_1540950263.html","title":"11 Small Habits That Can Increase Inflammation In Your Body","title_page":"11 Small Habits That Can Increase Inflammation In Your Body","title_rss":"NULL","source_domain":"bustle.com","text":"Two types of inflammation can occur in the body: either acute or chronic. While the former is necessary for the body to heals itself, the latter can actually be quite damaging and lead to health issues over time. And that's why it's important to be aware of habits that can increase inflammation.\n\"Inflammation is the body's natural response to something harmful. Acutely, it is necessary for helping us heal from injuries and illness,\" Lori Miranda, Certified Health & Wellness Coach, Certified Nutrition Coach, and founder of Wellbody, tells Bustle. \"However, chronic inflammation is not good for the body and can lead to several health conditions.\"\nThis can happen when inflammation levels stay high and continue unchecked — due to untreated health conditions, or unhealthy lifestyle habits. \"For instance, arthritis is inflammation of the joints, heart disease is inflammation of the arteries, and there is growing research indicating the link between inflammation and Alzheimer's Disease, as well as diabetes [and] cancer,\" Miranda says. \"It's at the root of several major chronic diseases, which is why it's important to manage.\"\nBy avoiding harmful habits, like the ones listed below, you can keep your inflammation levels low. Here are a few of the biggest culprits, according to experts, as well as what to do about them.\n1 Sitting For Long Periods Of Time Hannah Burton/Bustle Even though it may not seem like a big deal, sitting for long periods of time can have quite the impact on the body, including increasing inflammation. \"Studies show sitting increases markers of inflammation, especially in women,\" Dr. Eudene Harry, medical director for Oasis Wellness and Rejuvenation Center, tells Bustle. \"Interestingly this occurs whether you exercise routinely or not.\" There is good news, though, as you can avoid this side effect by simply getting up and moving throughout the day. \"The key is not to sit continuously for longer than three hours at a time,\" Dr. Harry says, or even longer than an hour if you can help it. While at work, get up and stroll around the office, or walk around the block. And while at home, make sure you get up often while reading or watching TV.\n2 Not Making Stress Relief A Priority Andrew Zaeh for Bustle Stress can also increase inflammation in the body, Dr. Harry says, so it's incredibly important to do whatever you can each day to keep it under control. Things like yoga, meditation, and light exercise can do the trick, as well as deep breathing. \"Deep breathing [techniques] can take the edge off a stress response,\" Dr. Harry says. \"Breathe in deeply through the nose for a count of four, hold for a count of seven, then completely exhale.\"\n3 Exercising Too Vigorously Andrew Zaeh for Bustle Everyone's different when it comes to exercise routines, and what feels right for them. But experts say super intense workouts — such as high-intensity bootcamps — can lead to inflammation in the body. \"[Intense workouts seem] to be all the rage now, but jumping into these high energy, high intensity exercises can lead to muscle inflammation because the muscles are overworked,\" physical therapist Dr. Karena Wu, owner of ActiveCare Physical Therapy, tells Bustle. \"This intracellular swelling will reduce the muscles ability to contract, which can lead to dysfunctional movement patterns and potential injury.\" So always check with your doctor before starting one of these regimens. \"Subtle signs of inflammation are feeling fatigued ... increased body temperature, any red/flushed areas, some sort of discomfort, and possibly even mental distress,\" Dr. Wu says. \"Basically, not feeling 100 percent, sprightly and sharp, and ready to conquer the world.\"\n4 Skipping Out On Sleep Ashley Batz/Bustle By not getting the recommended seven to nine hours of sleep each night, you really are doing your body a disservice. \"Not getting the amount of sleep that your body requires reduces standard immune factors, which can lead to inflammation,\" Dr. David Greuner, of NYC Surgical Associates, tells Bustle. \"Inadequate sleep also makes you more prone to stress, which we already know isn’t good for our bodies.\" To ensure you're getting enough rest, try to go to bed at the same time each night, and practice good sleep hygiene.\n5 Drinking Diet Or Sugary Drinks tongpatong/fotolia It's fine to sip on the occasional soda, but consuming too many sugary drinks — including sugar-free options — can increase inflammation. \"Eating too many foods and drinking beverages with added sugars (such as table sugar and high-fructose corn syrup) can spike inflammation,\" Dr. Gruener says. \"Consuming too much sugar is linked to ... insulin resistance, diabetes, fatty liver disease, cancer and chronic kidney disease.\" By sticking to sugar-free beverages, such as water and teas, you won't be putting your body under so much stress, and adding to its inflammation.\n6 Smoking Sean Gallup/Getty Images News/Getty Images We all know there are a million and one reasons to quit smoking, seeing as it can increase your risk of things like lung cancer and gum disease. But smoking also adds inflammation to the body. \"While most people know that smoking cigarettes is a bad habit, there are some experts who believe that part of the reason they are so bad — and part of the damage they cause — is related to chronic inflammation of the lungs,\" Miranda says. \"It only takes a few weeks after quitting for inflammation markers to drop.\" So do your best to stop, ASAP.\n7 Eating Too Many Processed Foods Scvos/fotolia As with sugary drinks, it's OK to have processed foods and unhealthy snacks occasionally. But do keep in mind how they can lead to inflammation. \"Many processed foods have long ingredient labels full of additives that can be harmful to health,\" registered dietician Staci Gulbin, MS, MEd, RD, LDN, tells Bustle. \"As far as food is concerned, research shows that additives in food like food dyes may increase oxidative stress in the skin, and foods high in sugar may ... increase risk of chronic disease when consumed in excess.\" She recommends sticking with foods that have five ingredients or less on the labels, and focusing on natural ingredients most days. That way, you can avoid processed foods, and keep inflammation in your body.\n8 Using Chemical-Laden Body Products Andrew Zaeh for Bustle You should read the labels on your skincare products the same way you read labels on food, all in the name of avoiding as many harmful ingredients as possible. \"Toxic chemicals in certain body products, such as lotions and shampoos, can cause hormonal imbalances, which trigger inflammation,\" Dr. Greuner says. \"Read labels carefully to make sure your products don’t contain harmful ingredients like petroleum distillates and hydroabietyl alcohol.\"\n9 Wearing High Heels Antony Jones/Getty Images Entertainment/Getty Images Ever notice how badly your feet hurt after wearing high heels all day, especially if you're not used to them? That's thanks, in part, to inflammation. \"Wearing high heels causes the ankle to be plantar flexed (toes down position, like when you're lying on your back),\" Dr. Wu says. \"This puts the calf muscles in a shortened position, which can lead to inflammation, pain, and inflexibility in the muscles as well as the joints.\" Whenever possible, switch on over to flat, more supportive shoes to give your heels and calf muscles a break.\n10 Drinking Alcohol Hannah Burton/Bustle There's nothing wrong with having the occasional glass of wine. \"However, alcohol can interfere with blood sugar and balanced blood sugar levels,\" diet and nutrition expert Carolyn Dean, MD, ND tells Bustle. \"Over consumption of alcohol and spiking insulin levels can create inflammation because alcohol consumption produces acetaldehyde. Acetaldehyde is a particularly potent toxin that can damage all the tissues in the body including the brain. It is produced when you drink alcohol, breathe the exhaust from cars, and smoke cigarettes.\"","url":"https://www.bustle.com/p/11-small-habits-that-can-increase-inflammation-in-your-body-11471919"}
