{"authors":["Dan Trepanier","Articles Of Style"],"date_download":"2018-10-30 21:49:18","date_modify":"2018-10-30 21:49:18","date_publish":"2016-12-17 00:00:00","description":"Here's what you should know if you're in the market for an investment timepiece.","filename":"data/vaneerConsumption/11thingsyoushouldknowbeforeinvestinginaluxurywatch.json","image_url":"https://amp.businessinsider.com/images/552bdcda69beddde01bd511f-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_11-things-you-should-know-before-investing-in-a-luxury-watch-2016-11_1540936158.html","title":"11 things you should know before investing in a luxury watch","title_page":"    11 things you should know before investing in a luxury watch - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Buy a watch that is versatile enough for any outfit or situation. Articles of Style I'm not a watch expert, but Ariel Adams from A Blog to Watch is.\nI recently picked his brain (and combed his website) about investing in quality watches (he has a lot to say on the subject) and tried to summarize it in a simple \"Guide to Investing in a Timepiece\".\nIf you're in the market for an \"investment watch\", here are some things you should know:\nFit\nThe proportion on your wrist is key. If you have a big clunky wrist/hand, you'll want to look at bigger, stronger watch faces.\nToo small (or too slim) and it can look dainty, delicate, and too formal for casual wear. Too large (or complex) and it can look overly utilitarian and too casual for a sharp suit.\nStyle\nIdeally you can find a watch that is versatile enough for just about any outfit or situation, similar to the Montblanc Timewalker that I've been wearing on the site for years. I suggest looking for something that is minimal and classic. Something that won't clash with your outfits and something that you won't get sick of looking at every day. Think about a neutral colored face that is easy to read with limited complications (or \"functions\" like sport timers and chronographs), one simple crown (the dial you use to change the time), and a sharp metal or leather (or crocodile) band that you can replace with other straps (like grosgrain for the summer, suede for the Fall, etc). It felt like a lot of money when I first bought my watch, but five years later I'm still wearing it almost every day - that's a good investment in my mind.\nMovements\nThere are three basic ways that watches tell time:\n\"Digital watches are powered by an ultra-small watch battery (the kind you usually see by the checkout counter in electronic stores).\nQuartz watches are analog timepieces that run on a tiny, vibrating, electrified quartz crystal. They keep extremely accurate time (within a minute each year).\nFinally, mechanical watches are powered by a complex array of gears and springs. These watches can command a hefty price as a result of their superior craftsmanship. Unfortunately, the ancient art of hand-wound watchmaking remains imperfect. Mechanical watches lose about an hour a year and must be wound regularly… The name of the luxury watch game is having the best possible mechanical movement. Why? This is not an easy question to answer, to be honest, because quartz watches are actually more reliable and accurate, for the most part. Still, a mechanical watch movement never needs a battery, represents the classic way of making watches, and offers a certain emotional value that the \"tick, tick, ticking\" of a quartz watch simply cannot offer.\"\nValue retention\n\"First, watches should not be thought of as financial investments. While it is possible to purchase watches that will retain or even possibly increase in value… those instances are the exception and not the rule. Timepieces are like cars, and in most instances they depreciate after you buy them. The amount of depreciation depends on a huge number of factors, and the best way to know how much a specific watch may depreciation is to look for pre-owned ones online and see what they are selling for versus the new ones. If a watch is priced at within 20% of its retail price when lightly used, we'd say that it holds value pretty well… Get a steel Rolex sports watch and you'll know the meaning of how a watch can retain value.\"\nHow much to spend\nREUTERS/Hans Deryk \"You should not spend more than you can afford on a watch. If you can afford a lot for a new watch that is all the better, but if you are pushing yourself only to think you can later resell your watch and recoup your investment, it might be worth managing your exceptions a bit. They don't call them luxury watches for nothing.\nWhat you should be looking for is value for your money. You want to get a lot for your money, and if you aren't familiar with what to expect then I recommend our watch buying guides that specifically cover the topic of what features to look for in watches of various price points. Nice watches are expensive. If you want a decent mechanical Swiss watch it is going to cost you about $500 on the very lowest-end. You should expect to spend $1,000 - $3,000 for most 'entry-level mechanical Swiss watches', and mid-range mechanical Swiss watches can go from $5,000 - $10,000 (or a bit more) these days. The sky is really the limit from there.\"\nBuying with trust\n\"You must trust the person you are buying your watch from. That is crucial. No matter if it is from a large department store, small dealer, or individual person selling a pre-owned watch, you need to trust them. We are talking not only about high-value goods, but also about items that can be very costly to repair. Getting a broken watch is a hassle you don't want to deal with. So in the event you get a damaged or defective timepiece you need to trust that the retailer or seller will fix the problem either by repairing the watch or by returning your money… Trust means that the seller will do the right thing if there is a problem, and that you are getting a real watch.\nThis leads into something called the gray market where people sell new watches outside of the authorized dealer work. New or newer watches can be had for discounts. Sometimes great discounts. However, buying this way is not with out risks and buyers who are new to this should stick to more traditional sales channels. Deals too good to be true often are but modest discounts even at authorized dealers aren't totally uncommon. The best way to get the best price is to approach a respected dealer and have a real intent to buy. Ask for their best price and that if you are satisfied you'll buy then and now. \"\nFinding a discount\n\"Watch brands don't like it when we suggest non-official ways to buy watches, but it only takes a mere Google search to determine that many watches are available online at prices under their standard retail price. It is a good idea to also know how much discounting is going on. Steep discounting can mean that a watch isn't in demand, that it is no longer in production, or that there is a very high availability of inventory. That doesn't mean it is a bad watch, but it is good information to know. Buying from brand boutiques or authorized third-party retailers is probably the safest way to get a watch, but it certainly isn't the only way.\nYou should also check eBay. The world's most popular auction site is also the world's most popular place to buy watches. That's just a fact. There is a huge inventory there and people sell both new and used watches on eBay everyday. eBay most certainly doesn't have everything, and sometimes not even the best price, but it would be ignorant for a guide on buying your next watch to ignore the importance of the eBay watch marketplace.\"\nOn a budget? Go Japanese\nFacebook/Seiko \"When people ask me about getting new mechanical watches for under $500, the first thing out of my mouth is always \"get something from a Japanese watch maker like Seiko, Orient, or Citizen.\" I say this because for the most part, these companies produce the best quality \"cheap\" mechanical watches. I suppose that also goes for quartz watches, if you are into that. When I talk of quality, I don't just mean the movements, but also the cases, dials, straps, etc… Japanese watches are often the first \"real\" watches most watch lovers end up getting, and many people (even though seriously into luxury Swiss watches) find themselves buying Japanese watches for years.\"\nBuying vintage\n\"While we generally tend to advice against the purchase of most vintage watches for most people, they can be an enjoyable and emotionally pleasing investment for many people. Our main reasons against getting old watches is because (depending on how old they are) they are more fragile, less mechanically sound, and often too small for modern tastes. That means more care and money into their upkeep. But again, it really depends on the specific watch as well as the owner… Many vintage watches are like vintage cars - and with that comes all the servicing and maintenance headaches… Depending on how old or rare a vintage watch is, it might not be something that can be serviced at all.\"\nMaintenance\n\"Don't abuse the little machine with moving parts that is on your wrist. Buy a \"beater watch\" like a Casio G-Shock that you'll wear when you know your watch might get beat up. Think of watches like shoes. Different shoes are used for different situations. Would you go hiking in your dress shoes? Also be sure to have a professional watch maker service your watch when it breaks or starts to tel time inaccurately.\"\nMake it personal\nFlickr/Youssef Abdelaal \"The pleasure of owning a fine watch (or many watches) is immeasurable for those who love history, design, engineering, mechanics, and art. Though like many \"toys for big boys\" watches aren't always cheap so carefully consider each purpose. The best advice I can say is to buy watches that you yourself want and like. At the end of the day you need to wear it. Make sure the dial is easy to read and that it wears comfortably on your wrist. Don't buy a watch just because you see it on other people's wrists or because someone tells you it is popular. It's a very personal decision so consider it an extension of your good taste, lifestyle, and maybe a sign of your success.\"\nThanks for reading and special thanks to Ariel Adams for dropping some knowledge on us today! For more info on all things timepieces, including in-depth reviews and buying guides, check out A Blog To Watch.","url":"https://www.businessinsider.com/11-things-you-should-know-before-investing-in-a-luxury-watch-2016-11"}
