{"authors":["Taylor Maple"],"date_download":"2018-10-31 01:47:25","date_modify":"2018-10-31 01:47:25","date_publish":"2018-08-27 18:57:59","description":"Connor is well on his way to becoming the dreamy favorite of plenty of Bachelor Nation fans, and his time on Bachelor In Paradise will probably only serve to further that. He wasn't one of the very last ones standing on Becca's season of The…","filename":"data/vaneerConsumption/11ThingsConnorsInstagramRevealsAboutTheNewBachelorInParadiseArrival.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/86f0f778-c148-4b83-8043-c10b93979239-149577_2881.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_11-things-connors-instagram-reveals-about-the-new-bachelor-in-paradise-arrival-10248078_1540950445.html","title":"11 Things Connor's Instagram Reveals About The New 'Bachelor In Paradise' Arrival","title_page":"11 Things Connor's Instagram Reveals About The New 'Bachelor In Paradise' Arrival","title_rss":"NULL","source_domain":"bustle.com","text":"Connor is well on his way to becoming the dreamy favorite of plenty of Bachelor Nation fans, and his time on Bachelor In Paradise will probably only serve to further that. He wasn't one of the very last ones standing on Becca's season of The Bachelorette, so fans don't know him as well as they do some of the other guys. But there's still a lot we can learn from Connor's Instagram as Bachelor In Paradise offers him a brand new platform to impress.\nConnor was never necessarily a frontrunner in Becca's season the way that ultimate finalists like Jason, Blake and Garrett were. But his 1950s movie star good looks and the unexpectedly dashing glasses he donned had viewers crushing on him all season. Of course, we can't forget the unfortunate incident in which he threw Lincoln's framed photo of him and Becca into the pool, shattering it, when Lincoln got a little too cheeky flaunting his date success. But that outburst quickly faded into the background, especially when other contestants on the same season were outed as accused sexual harassers, people with troubling social media histories, and, you know, actual convicted sex offenders.\nLong story short, Connor is a cute and ultimately inoffensive character who has fans' attention, even if his social media posts lean towards the posed and corny variety. \"Love to casually lay in bed, shirtless with a hat and glasses on, with a mug in one hand and a cute dog in the other. Just bein’ casual,\" wrote Reddit user isabel_rae in response to this Instagram post of Connor's.\nSure, Connor's feed definitely seems carefully curated and a little rehearsed, but that's not exactly unexpected from a reality star, and it doesn't make it any less fun to look at. Let's see what details we can glean.\nHe Celebrates His Birthdays Shirtless, As One Does iam_cjo on Instagram The photo has it all — the party hat, the cross hanging onto his chest, the perfectly timed smile. But the real concern here is that cupcake is very on fire, and he should probably have something between his bare skin and an open flame of that magnitude.\nHe's All About Fitness iam_cjo on Instagram You don't get that Instagram-ready body without a little elbow grease. Connor is actually a professional personal trainer, has a history in professional baseball, and holds a degree in public health.\nHis Core Workout Will Make You Feel Inadequate I mean, this tutorial from Connor's fitness regime is almost offensive, but it certainly explains those abs.\nHe Has A VERY Cute Dog... iam_cjo on Instagram Connor probably knows that a cute, dressed up dog will skyrocket his picture perfect persona, but it's not just that — he really appears to love this dog with his whole heart. He's visible all over his Instagram, and they are apparently best pals.\n...Who Seems To Be His Main Sweetheart iam_cjo on Instagram It doesn't matter that Connor didn't win Becca's heart on The Bachelorette — he's already got this little fella on deck to share wine-fueled sunsets on the beach with.\nThey Have Matching Hats iam_cjo on Instagram Are you kidding me? You know what, I don't care how curated his Instagram feed is as long as I can get more \"dogs in hats\" content, even if they do don the name of Connor's fitness company.\nAnd They Have Matching Costumes iam_cjo on Instagram Holy smokes. It feels like I need to make this entire article about Connor's dog. I'll resist the temptation, but it's hard when this adorable mug is staring me in the face.\nHe's Close With His Mom iam_cjo on Instagram Amidst all the professional modeling shots, Connor features this gem — an adorable picture wishing his mom a happy Mother's Day, along with a genuinely sweet caption.\nHe Loves The Life Of Luxury iam_cjo on Instagram Connor always looks like he just stepped out of a GQ ad, which is good, I guess, considering the brand he's trying to promote. Nothing says \"luxurious\" like some cherry red loafers and a sleek white sports car.\nHe Was Salt Bae For Halloween This uncharacteristically silly post from around Halloween last year shows that Connor is up to date on all the hot memes, just like the rest of us.\nHe Reads His News Just Like The Rest Of Us iam_cjo on Instagram Ah yes — catching up on a little light reading while sprawled on the couch in Calvins while a camera happens to snap his picture — who among us hasn't experienced the same?","url":"https://www.bustle.com/p/11-things-connors-instagram-reveals-about-the-new-bachelor-in-paradise-arrival-10248078"}
