{"authors":[],"date_download":"2018-10-30 18:06:32","date_modify":"2018-10-30 18:06:32","date_publish":"2015-10-06 20:40:40","description":"Nothing beats that great American road trip — open roads, great places, random roadside oddities… However, before hopping in the car and heading out, there are a few simple tricks you can use to make your next trip a little easier and perhaps cut down on some consternation should anything go awry.","filename":"data/vaneerConsumption/11thingseveryoneshouldkeepinthecar.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/Rare_Life/2015/10/06/Images/photos.medleyphoto.8241873.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_things-everyone-should-keep-the-car__1540922792.html","title":"11 things everyone should keep in the car","title_page":"11 things everyone should keep in the car","title_rss":"NULL","source_domain":"ajc.com","text":"Nothing beats that great American road trip — open roads, great places, random roadside oddities…\nHowever, before hopping in the car and heading out, there are a few simple tricks you can use to make your next trip a little easier and perhaps cut down on some consternation should anything go awry.\nIt goes without saying everyone should have jumper cables, a spare tire and a jack that can be used to change tires. But what about food for a real emergency? Little tricks that take just a few minutes to prepare could go a long way if they are ever needed.\nSo make like a Boy Scout and “be prepared” with a few items everyone should keep in the car. If nothing else, maybe they’ll stave off disaster during the next road trip.\nEnergy bars and other snacks\nIn 2012, metro Atlanta was caught off guard by an ice storm, and thousands of commuters spent the night in their cars, as they were stranded on the city’s interstates. After a few hours, many of those unfortunate souls started to get hungry, if not hangry.\nKeeping a box of energy bars or any shelf-stable snack in the trunk does not compete with a gourmet meal at a five-star restaurant, but it’ll likely turn back hunger and allow one to focus on other maddening issues, such as why a major city wasn’t better prepared for less than two inches of snow.\nSeat belt cutter/window smasher\nLet’s hope it’s never needed, but in the event of a true disaster, this little hammer-like tool can save a person’s life. If a motorist is trapped, he or she can use one end of the hammer to smash the window and the other side to cut the seat belt. Just be sure it’s kept in a place where it can be easily accessed in an emergency; there will be no time to go to the trunk to grab it when it is most needed.\nIf investing in a new tool isn’t in the cards, a heavy duty flashlight can also smash a window in a pinch.\nToolkit\nThis may be the most obvious suggestion, but it should include some key things: an aerosol flat tire repair, a multi-tool, a tire gauge, a flashlight and road flares.\nAlso consider keeping some duct tape and rags in the toolbox for the times when a MacGyver-like repair is necessary. (You get bonus points for a fire starter!)\nClothing\nThis is a good habit to get into, whether you’re taking a cross-country road trip or just tooling around town. Drive long enough and any motorist, no matter how seasoned, will inevitably find himself in a situation where a change of clothes is needed. That can certainly be the case if a tire change in the hot sun is in the cards.\nA small duffle bag with a wardrobe change takes up minimal space. In the wintertime, consider packing a space blanket, scarf and/or sweatshirt.\nLunch box cooker\nThis one may seem a little odd, but nothing makes a road trip more enjoyable than a portable cooker that can be powered by the car’s cigarette lighter (known today as the 12-volt socket). For the real gourmets out there, meals can be prepared in advance and cooked while driving down the highway.\nMap or atlas\nConsider this one a bit of a history lesson: before GPS came on the scene, there were these books that contained maps of various locations. These maps could be used to navigate and help lost people find their way.\nIt’s definitely a novel concept for many smartphone-toting young’uns to comprehend. But, as difficult as it may be to grasp, sometimes technology fails. It doesn’t hurt to have a backup, just in case. If an atlas is too much to tote around, consider a free map available at most rest stops.\nPhone charger/USB battery pack\nNews flash: Using GPS for a 12-hour road trip will drain its battery, and there is nothing worse than traveling with a dead device. To ensure plenty of power so you can Snapchat along the way, be sure to pack extra phone chargers — at least one for each device. Also consider a USB battery pack that can be used to recharge a phone when no outlet is available.\nFirst aid kit\nChances are, no one will be performing major surgery while in the car. But after sustaining a cut that will likely arise after performing an emergency roadside repair, it’s easy and safe to sterilize and bandage that bleeding thumb if there’s a first aid kit handy.\nTrash bags\nYou may be on a road trip, but you still need to keep the car clean (or at least prevent it from becoming a rolling dumpster). It’s pretty straightforward: Keeping the car clean in real time cuts down on how long it’ll take to clean it at your final destination. And trash bags can double as motion sickness bags should the need arise.\nSpare change\nAnyone who has driven to Florida knows toll booths are everywhere. While many toll authorities are moving toward passes that automatically pay tolls, they also still accept change. (And declaring to be an out-of-state resident doesn’t always work as a defense.)\nShould the need arise, consider purchasing an electronic toll payment device, such as Florida’s SunPass, which can be mounted on your car’s windshield and allows you to pay tolls without stopping.\nToilet paper\nThis one pretty much speaks for itself. Bringing your own can make the great American road trip just a bit more pleasant.","url":"https://www.ajc.com/lifestyles/things-everyone-should-keep-the-car/nszudG1t7lFx4dt6fVzYuK/"}
