{"authors":["Linette Lopez"],"date_download":"2018-10-30 21:34:29","date_modify":"2018-10-30 21:34:29","date_publish":"2016-12-20 00:00:00","description":"If you have a paisley tie, I don't want your excuses just burn it.","filename":"data/vaneerConsumption/11thingseveryoneonWallStreetneedstostopwearingASAP.json","image_url":"https://amp.businessinsider.com/images/58596fe8ca7f0cdf1e8b69d2-1136-568.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_11-things-everyone-on-wall-streeters-needs-to-stop-wearing-asap-2016-12_1540935269.html","title":"11 things everyone on Wall Street needs to stop wearing ASAP","title_page":"    11 things everyone on Wall Streeters needs to stop wearing ASAP - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"You'll see this tie soon. YouTube Like any tribe, Wall Street has its own way of dressing, passed down from executives to managing directors, VPs to associates, and so on.\nIt is a (mostly) classic style for a very hierarchical set, and as such it evolves quite slowly. But it does evolve. Sadly, some on Wall Street do not evolve with it.\nThat is why we wrote this list, to make everyone aware of the things that have been left behind in the past, exactly where they belong. To do it, we talked to stylist Jessica Cadmus, of the Wardrobe Whisperer, who regularly cleanses the closets of bankers from coast to coast.\n\"When I edit a wardrobe, I designate three classes of items: those that are still relevant, those on 'probation,' meaning that they are serviceable but my eye is on them for an imminent upgrade, and those that need to be burned,\" she told Business Insider.\nThe items on this list, she said, \"are from the third class.\"\nSome of these picks were once staples but have gone out of style. Others are simply tired (as in we're tired of looking at them).\nIf you know someone who has these in his closet, help him see the light if you can.","url":"https://www.businessinsider.com/11-things-everyone-on-wall-streeters-needs-to-stop-wearing-asap-2016-12"}
