{"authors":["Kristie Rohwedder"],"date_download":"2018-10-30 23:55:02","date_modify":"2018-10-30 23:55:02","date_publish":"2014-08-12 21:32:18","description":"Willow Pape. Oh, Willow Pape. (If you would be so kind, please imagine Heath Ledger's Joker muttering the following under his breath as he hijacks a semi truck): Willow, Willow, Willow Pape. The villain of Kim Kardashian: Hollywood is a…","filename":"data/vaneerConsumption/11WillowPapeQuotesThatAreasSloppyHilariousasTheCharacterBehindThem.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/7aafb9aa-508b-424c-a335-3446379bc0dc.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35498-11-willow-pape-quotes-that-are-as-sloppy-hilarious-as-the-character-behind-them_1540943702.html","title":"11 Willow Pape Quotes That Are as Sloppy & Hilarious as The Character Behind Them","title_page":"11 Willow Pape Quotes That Are as Sloppy & Hilarious as The Character Behind Them","title_rss":"NULL","source_domain":"bustle.com","text":"Willow Pape. Oh, Willow Pape. (If you would be so kind, please imagine Heath Ledger's Joker muttering the following under his breath as he hijacks a semi truck): Willow, Willow, Willow Pape. The villain of Kim Kardashian: Hollywood is a fame-obsessed, malicious, and unrelenting demon in a skirt. KK:H is lucky to call her its villain.\nPatricia Hernandez of Kokatu dubbed The Pape the best game rival since Gary Oak from Pokémon, and I agree 240%. Ugh, freakin' Gary Oak. Every time that Poké-dweeb would interrupt my gameplay and demand a battle, my eyes would turn red and I would groan. NOT NOW, GARY, I would think. CAN'T YOU SEE I AM IN THE MIDDLE OF SOMETHING?\nThe Pape's timing is very Gary Oak-like (read: inconvenient). Whenever she accosts me just as I'm about to meet a potential collaborator at The Brew Palms or on my way to a fashion show, I groan.\nNOT NOW, WILLOW. CAN'T YOU SEE I'M IN THE MIDDLE OF SOMETHING?\nI will say this much: Whenever The Pape rears her blonde head, you can count on her to utter something LOL-worthy. And hey, I like to laugh out loud.\nThe definitive ranking of Willow Pape's best digs\n#11:\nGretchen Wieners couldn't make \"fetch\" happen, and you definitely can't make \"fetch\" happen, Pape. Sorry, Pape.\n#10:\nShe was \"Anon\" all along and she DGAF.\n#9:\nEhhh, not your harshest burn, Pape.\n#8:\n...Who are the \"you guys\" she's talking to?\n#7:\nRe: \"did Kim mention me yet?\": Same.\n#6:\nSo very meta.\n#5:\nWHOA, did she just call me a bird?!?!?!?!\n#4:\nWhen the yellow exclamation point bubble is attached to The Pape, it shoves me to the very edge of my seat. What's she going to say this time?!?!?!\n#3:\nShe'd been saving that one for a while. I can feel it.\n#2:\n\"SO BLEGH!\"\n#1:\nSpeaking in hashtags. \"Gutter trash.\" The only thing this diamond is missing is a mic drop.\nImages: willow-pape/tumblr; silvermoon424/tumblr; hoebutmadefashion/tumblr; euphoricrevelation/tumblr; givemepearls/tumblr; kimkhollywoodposts /tumblr(2); number31/tumblr; bowsandberettas/tumblr","url":"https://www.bustle.com/articles/35498-11-willow-pape-quotes-that-are-as-sloppy-hilarious-as-the-character-behind-them"}
