{"authors":["Lucia Peters"],"date_download":"2018-10-31 00:02:31","date_modify":"2018-10-31 00:02:31","date_publish":"2018-10-28 13:11:28","description":"It’s one of the greatest conundrums that faces any new dog or cat owner: What should I name my new pal? I mean, there are just so many options — but you can’t go wrong by looking to famous people from history to name your pet after. No matter what…","filename":"data/vaneerConsumption/12DogCatNamesInspiredByHistoricalPeople.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/6/21/c69d60ec-79d1-4c38-8eb5-516a296f4e03-getty-453289716.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_12-dog-cat-names-inspired-by-historical-people-9503962_1540944151.html","title":"12 Dog & Cat Names Inspired By Historical People","title_page":"12 Dog & Cat Names Inspired By Historical People","title_rss":"NULL","source_domain":"bustle.com","text":"It’s one of the greatest conundrums that faces any new dog or cat owner: What should I name my new pal? I mean, there are just so many options — but you can’t go wrong by looking to famous people from history to name your pet after. No matter what your interests, or what your furry pal’s personality is like, there’s someone from the annals of history who will likely inspire some terrific monikers — and while you’re at it, bonus points if you come up with a really clever pun.\nMy own pets — two cats, a Maine Coon and some kind of unspecific shorthair (they're both rescues, so their breeds remain something of a mystery) — are actually named after fictional characters; if I were ever to get another friend for them, though, I might consider breaking with my established tradition. The popularity of certain pop culture properties might ebb and flow, but our own past? Well, that’s obviously not going anywhere. And just think about: You’ve got artists, scientists, rulers, philosophers, and so many other variety of people to choose from. You might not ever get the chance to meet your own personal heroes, but if you name your pet after one of them, you can hang out with them every day anyway.\nIf you’re currently dreaming up a name for a new pupper or cat-face, these 12 ideas might get the juices flowing. Feel free to get creative; your furry friend deserves the best name you can think of.\n1 Suiko Giphy Remember Empress Suiko? We talked about her a little while ago, but here we are talking about her again, because she’s rad. Born in 554, she became the 33rd monarch of Japan in 593 and reigned until her death in 628. She established the Seventeen-Article Constitution, and also saw Buddhism officially recognized as a religion. The next cat I get, I’m naming Suiko.\n2 Ernest Giphy I have long harbored a wish to have a miniature Schnauzer named Ernest. Schnauzers look like little old men, and Ernest seems like the perfect name for a dog that looks like a little old man. If my little old man dog named Ernest wrote books, those books would be full of short yet poignant sentences that mean way more than they appear to at first. Actually, come to think of it, I feel like a dog trying to write like Ernest Hemingway would probably just end up producing Snoopy’s novel. Good thing? Bad thing? You be the judge.\n3 Madame C. J. Walker Giphy Born in 1867, Sarah Breedlove, AKA Madame C. J. Walker, became the first woman self-made millionaire in the United States due to her creation of an enormously successful company specializing in beauty and haircare products for black women. She was also well known for her activism and philanthropy. For a Madame Walker-inspired pupper name, I’d go with Walker; C. J. would work for pretty much any pet; and for a cat, you could really pull out the stops and go with Meowdame C.J. Walker. Sorry, not sorry.\n4 Beethoven Giphy I mean, if you get a St. Bernard, obviously you have to name it Beethoven, right? You probably don’t need me to tell you who Ludwig van Beethoven was, but in case you need a refresher, he was born in 1770, died in 1827, and composed some of the greatest works of music of the Classical and Romantic eras, including Piano Sonata 14 (known as the Moonlight Sonata), his Fifth Symphony, and his Ninth Symphony.\n5 Simeowne de Beauvoir Giphy Feminist and existential philosopher Simone de Beauvoir’s best known work is undoubtedly The Second Sex, which was published in 1949; however, her body of work also includes She Came To Stay, The Ethics of Ambiguity, and a whole lot more. Obviously, Simeowne de Beauvoir is a perfect name for an aloof and independent cat. Get it? Simone de Beauvoir? Except… a cat? …I’ll show myself out.\n6 Curie Giphy Marie Curie not only pioneered research on radioactivity; she was also the first woman to win a Novel Prize, the first person and only woman to win it twice, and the only person to win one in two different sciences. She won the first one in 1903 along with Pierre Curie and Henri Becquerel “in recognition of the extraordinary services they have rendered by their joint researches on the radiation phenomena discovered by Professor Henri Becquerel” and the second in 1911 “in recognition of her services to the advancement of chemistry by the discovery of the elements radium and polonium, by the isolation of radium and the study of the nature and compounds of this remarkable element.” I can’t take the credit for coming up with this one as a pet name; I have a couple of friends who got a dog recently and named her Curie, so they’re the brainiacs behind this one. It is, however, perfect, so… do with that what you will.\n7 Tesla Giphy Much like I like the idea of a dog named Curie, I love the idea of a pet — any pet, dog, cat, whatever — named Tesla. Allow me to refer you to this comic by The Oatmeal about why Nikola Tesla was awesome (besides the fact that David Bowie played him in The Prestige, which, honestly, just makes the whole thing better), and this song because it is terrific.\n8 Edith Giphy Like Curie, I can’t credit for this one; I have a friend whose dog’s full name is Edith Piaf, but I love it, so... here we are. You know Piaf, right? French chanteuse? Played by Marion Cotillard in La Vie en Rose? Sang this gem? And this one? And this one? Save this name for a particularly vocal pet — the kind who makes sounds so expressive, they may as well be speaking human words.\n9 Ida B. Wells Giphy Ida works. So does Wells. Or Ida B. Or, heck, take the whole thing and call your furry pal Ida B. Wells, especially if said furry pal is an independent cat who likes to hang out with you, but is also totally able to take care of itself (although TBH, I could easily see a dog taking to the name Ida, too). Born into slavery in Mississippi in 1862, Ida B. Wells became one of the most notable journalists and activists in American history, championing civil rights and women’s rights. She was also one of the first women in American history to keep her own name after she got married. Rad.\n10 Dali Giphy Surrealist artist Salvador Dali — he of the melting clocks — was obviously known for a great deal of accomplishments; beyond his paintings, he produced art in virtually every medium you can imagine, from sculpture to film. He also had a pet ocelot named Babou, so obviously a Dali-inspired cat name is just waiting to happen. Bonus points if your cat has markings that look like a mustache.\n11 Diogenes Giphy One of the founders of Cynic philosophy, which posited that the point of life was to live with virtue, encouraging its followers to cast aside desires for things like wealth and power and live without possessions or property, Greek philosopher Diogenes is often described as being \"dogged\" or \"dog-like.\" I mean... it's kind of hard to argue with naming a dog after the dog-like philosopher, right? True, your pup will likely not be down with a toy-free life — but the joke is too good to pass up. Fun fact: When the mood struck him, Diogenes sometimes lived in a tub (or maybe a wine barrel, depending on who you ask) on the streets of Athens.","url":"https://www.bustle.com/p/12-dog-cat-names-inspired-by-historical-people-9503962"}
