{"authors":[],"date_download":"2018-10-22 22:53:15","date_modify":"2018-10-22 22:53:15","date_publish":"2014-06-11 09:58:50","description":"“The way down the cave is very challenging, even for experienced climbers,\" rescue official says.","filename":"data/vaneerConsumption/12HourTrektoClimberTrappedinCaveProvesTooExhausting.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/501286/140611-germany-cave-rescue-550a_0586b0d7aae37890780044da40a97b2a.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_europe_12-hour-trek-climber-trapped-cave-proves-too-exhausting-n128161_1540248795.html","title":"12-Hour Trek to Climber Trapped in Cave Proves Too Exhausting","title_page":"12-Hour Trek to Climber Trapped in Cave Proves Too Exhausting","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBERCHTESGADEN, Germany – Rescuers trying to evacuate a researcher trapped 3,000 feet down an Alpine cave were forced to dispatch a second medical team to assess and evacuate him early Wednesday after the first party became too exhausted to continue, officials said.\nThe relief team with another doctor started the 12-hour climb required to reach the experienced climber who has been fighting for his life after falling stones hit him Sunday morning. If the 52-year-old is deemed medically stable enough for an evacuation, officials said it would be another six days at least until he would reach the surface.\nSign up for breaking news alerts from NBC News\nThe first team was taking a break about halfway down the climb and would wait to be joined by the second crew, officials said. Once the two parties met up, they would decide who could continue on the journey.\nA third team was already with the injured researcher.\nStefan Schneider of Bavaria’s mountain rescue service told NBC News that the crews were still in good spirits despite the slowdown.\n“Just like on the mountain, there’s no guarantee that you will reach the top,” he said. “The way down the cave is very challenging, even for experienced climbers.”\nThe cave where the researcher suffered severe head injuries is a labyrinth of tunnels, canyons and deep shafts, some of which are submerged in water. Officials were not releasing the researcher's name.\n“The patient is stable and that’s most important,” Schneider said.\nThe first rescuers reached the researcher on Monday. About 200 emergency personnel are involved in the search.\n- Carlo Angerer","url":"https://www.nbcnews.com/news/europe/12-hour-trek-climber-trapped-cave-proves-too-exhausting-n128161"}
