{"authors":[],"date_download":"2018-10-30 18:41:40","date_modify":"2018-10-30 18:41:40","date_publish":"2016-03-23 20:06:00","description":"Thomasville is a small Georgia town located three and a half hours south of Atlanta and one hour north of Tallahassee, Florida. Home to one of the ...","filename":"data/vaneerConsumption/12HoursinThomasvilleGeorgia.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/03/23/Images/photos.medleyphoto.9036630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/travel_spend-day-charming-thomasville-georgia__1540924900.html","title":"12 Hours in Thomasville, Georgia","title_page":"12 Hours in Thomasville, Georgia","title_rss":"NULL","source_domain":"ajc.com","text":"Thomasville is a small Georgia town located three and a half hours south of Atlanta and one hour north of Tallahassee, Florida. Home to one of the most charming downtown areas in the state, it is filled with enough cozy restaurants and unique shops to while away a day. Make the most of a visit, from morning coffee to an evening show, and enjoy the town's abundance of Southern hospitality.\n10 a.m.: Stop by Grassroots Coffee Company (116 S. Broad Street, 229-226-3388) for a taste of locally-roasted coffee, specialty beverages and freshly-made, sweet and savory breakfast goods. Next door, peek into the Artist Collective, a gallery of the Thomasville Center for the Arts, which showcases featured artists and, recently, an exhibit on local history.\n11 a.m.: The bright and airy downtown bookstore, The Bookshelf (126 S. Broad Street, 229-228-7767) has been a town fixture for over 30 years. Boasting an exceptionally curated selection of fiction, nonfiction and children's books, the store also offers a wide variety of gifts for book lovers.\nNoon: Sweetgrass Cheese Shop (123 S. Broad Street, 229-228-6704) brings the wares of Thomasville's Sweetgrass Dairy to downtown. With an assortment of wines, cheeses and creative sandwiches — like the Nola, a peppery best-seller — this cozy eatery is a local favorite.\n2-6 p.m.: Enjoy browsing Thomasville's downtown shops: Relish (107 S. Broad Street, 229-236-5999) for artisan syrups, relishes and beautiful kitchen accoutrement; Tallokas Road (114 S. Broad Street, 229-236-1516) for luxurious candles, fragrances and gifts; Kevin's Fine Outdoor Gear & Apparel (111 S. Broad Street, 229-226-7766) for high-quality sportswear and outdoor goods; Firefly (125 S. Broad Street, 229-226-6363) for unique gifts, children's toys and home decor, and SmallCakes Cupcakery (127 N. Broad Street, 229-233-8180) for a sweet, mid-afternoon treat.\n6 p.m.: Settle in for dinner at Jonah's (109 E. Jackson Street, 229-226-0508), famed for their fish and grits, creative appetizers and specialty seafood dishes.\n8 p.m.: Take in a show at the Thomasville On Stage and Company (TOSAC) community theater (117 S. Broad Street, 229-226-0863). The 2015-16 season will bring Neil Simon's \"Plaza Suite\" to the stage in April and May, as well as \"Elf The Musical, Jr.\" during the summer months.","url":"https://www.ajc.com/travel/spend-day-charming-thomasville-georgia/sUC00qaSK9aAiLX78CmAFJ/"}
