{"authors":[],"date_download":"2018-10-30 21:07:27","date_modify":"2018-10-30 21:07:27","date_publish":"2018-07-13 18:28:00","description":"12 Russians indicted: Here’s what the DOJ says happened","filename":"data/vaneerConsumption/12RussiansindictedHereswhattheDOJsayshappened.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/07/13/Videos/4437907.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_russians-indi_ac438790955eb33fa173e5f67faa5f7f__1540933647.html","title":"12 Russians indicted: Here’s what the DOJ says happened","title_page":"12 Russians indicted: Here’s what the DOJ says happened  ","title_rss":"NULL","source_domain":"ajc.com","text":"The U.S. Justice Department announced charges Friday against 12 Russian intelligence officers suspected of hacking into the Democratic National Committee, the Democratic Congressional Campaign Committee and the campaign of Democratic presidential nominee Hillary Clinton.\nThe indictments were announced by Deputy Attorney General Rod Rosenstein as part of the ongoing probe by special counsel Robert Mueller into Russian interference in the 2016 presidential election.\n>> Read more trending news\nHere is what the indictment says happened:\nRussian intelligence officers began a program of cyberattacks in March 2016. They aimed to hack the email accounts of employees of Clinton's presidential campaign.\nThe indictment said the alleged conspirators “spearphished” individuals in the Clinton campaign throughout the summer of 2016, then \"on or about July 27, 2016, the conspirators attempted after hours to spearphish for the first time email accounts at a domain hosted by a third-party provider and used by Clinton's personal office. At or around the same time, they also targeted seventy-six email addresses at the domain for the Clinton campaign.”\n\"The defendants covertly monitored the computers, implanted hundreds of files containing malicious computer code, and stole emails and other documents,” Rosenstein said in a press conference Friday.\nAccording to the indictment, the conspirators also hacked into the computer network of the Democratic Congressional Campaign Committee and Democratic National Committee. They searched a campaign committee computer specifically for terms including \"Hillary,\" \"Cruz,\" \"Trump\" and \"Benghazi Investigations\".\nOnce they had access to the information, Rosenstein said, the Russians created fictitious online personas, such as \"DCLeaks\" and \"Guccifer 2.0,\" to release stolen emails, such as those belonging to Clinton campaign chairman Jon Podesta, and other information.\nRussian officers also hacked a state election board's website, the indictment said, and stole the information of around 500,000 voters. They hacked into computers belonging to a company that supplies software that local and state election offices use to verify voter information, the indictment also charges.\nWhile they corresponded with several Americans during the operation, there is no allegation in the indictment that any U.S. citizen committed a crime, Rosenstein said.\nHe also said that there is no evidence brought in this indictment that the hacking had any impact on the election results.\n“The goal of the conspirators was to have an impact on the election. What impact they may have had . . . is a matter of speculation, that’s not our responsibility.”\nThe indictment also says that Russians provided opposition research to a congressional candidate. That person is not named.\nThe Mueller investigation has been charged with looking into U.S. intelligence findings that Russians interfered in the 2016 presidential election, and if they had any links or coordinated with President Donald Trump’s campaign.","url":"https://www.ajc.com/news/national/russians-indicted-here-what-the-doj-says-happened/C3tGcHiHXOnGcroKV79GXL/"}
