{"authors":["Amen Oyiboke"],"date_download":"2018-10-31 01:49:52","date_modify":"2018-10-31 01:49:52","date_publish":"2018-08-27 17:34:59","description":"As great and important as it is to see women slay on-screen, it's just as big a deal to see women working behind the scenes writing and directing films. In the entertainment industry, female filmmakers are vastly underrepresented, which is why it's…","filename":"data/vaneerConsumption/12September2018MoviesWrittenOrDirectedByWomenThatAreAbsoluteMustSees.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/aea47e65-d384-45a8-8ef5-04e8f73a4026-a-simple-favor.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_12-september-2018-movies-written-directed-by-women-that-are-absolute-must-sees-10188575_1540950592.html","title":"12 September 2018 Movies Written Or Directed By Women That Are Absolute Must-Sees","title_page":"12 September 2018 Movies Written Or Directed By Women That Are Absolute Must-Sees","title_rss":"NULL","source_domain":"bustle.com","text":"As great and important as it is to see women slay on-screen, it's just as big a deal to see women working behind the scenes writing and directing films. In the entertainment industry, female filmmakers are vastly underrepresented, which is why it's so essential to honor the ladies who are creating work on the big and small screens — and seeing these September 2018 movies written or directed by women is a way to do just that.\nFrom A Wrinkle In Time to Blockers to The Spy Who Dumped Me, there have been some great movies released this year already that were directed or written by women filmmakers. And this fall, there will be plenty more, despite the fact that the number of movies led by women is still ridiculously low overall. A recent study by the Directors Guild Of America showed that diversity in directing is at a five year low, and the world of screenwriting isn't much better. So we should all do our parts to support projects created by women this coming month and see these 12 upcoming movies that were directed and/or written by female filmmakers.\n1. Hal (Sept. 7)\nKVIFF on YouTube\nThis documentary was directed by Amy Scott, who uses interviews and archival footage to give insight into the life and work of director Hal Ashby. The filmmaker made an impact in Hollywood’s classic film genre with movies like Harold and Maude and Shampoo.\n2. Kusama — Infinity (Sept. 7)\nMagnolia Pictures & Magnet Releasing on YouTube\nFilmmaker Heather Lenz brings us into the life of Japanese artist Yayoi Kusama who made waves in the 1960s for her avant-garde and political art. The documentary follows the now 88-year-old as she draws inspiration from living in a mental institution.\n3. I’m Not A Witch (Sept. 7)\nMadman Films on YouTube\nZambian-Welsh director Rungano Nyoni brings to the big screen a documentary about an eight-year-old girl in a small Zambian village who is accused of witchcraft. The young girl is forced to choose between being death by her peers or life with other enslaved women in a witch camp.\n4. God Bless The Broken Road (Sept. 7)\nChristian Film Trailers on YouTube\nWritten by Jennifer Dornush, God Bless the Broken Road centers on a single mother who is trying to survive after losing her husband in the Afghan war.\n5. A Simple Favor (Sept. 14)\nLionsgate Movies on YouTube\nWith a screenplay written by Jessica Sharzer, A Simple Favor has far from a simple storyline. The movie centers on Stephanie (Anna Kendrick), a mommy vlogger who befriends Emily (Blake Lively) and soon becomes the main investigator in her pal's sudden disappearance. Stephanie finds out that her new friend's life is far from what she imagined.\n6. A Boy. A Girl. A Dream: Love On Election Night (Sept. 14)\nSamuel Goldwyn Films on YouTube\nCo-written by screenwriter Samantha Tanner, A Boy. A Girl. A Dream: Love on Election Night follows a Los Angeles man named Cass (Omari Hardwick) who meets a woman named Frida (Meagan Good) on the night of the 2016 presidential election.\n7. MDMA (Sept. 14)\nShout! Factory on YouTube\nMDMA follows a young woman named Angie who is forced into becoming an expert maker of the drug Ecstasy in her university’s chemistry lab. The movie is both written and directed by Angie Wang.\n8. Lost Child (Sept. 14)\nFlorida Film Festival on YouTube\nWritten and directed by Ramaa Mosley, this thriller (formerly called Tatterdemalion) follows an army veteran, Fern (Leven Rambin), who returns home to look for her missing brother, only to discover an abandoned boy lurking in the woods. She searches for clues to find out his identity and discovers the local folklore about a malevolent, life-draining spirit that comes in the form of a child.\n9. The Song Of Sway Lake (Sept. 21)\nAri Gold Films on YouTube\nA young record collector (Robert Sheehan) and his friend go to his family's lake house to find some valuable jazz music. While he is there, his estranged grandmother tells him about his family's years of suffering. The movie's screenplay comes from Elizabeth Bull, who also helped make Adventures of Power.\n10. Love, Gilda (Sept. 21)\nMagnolia Pictures & Magnet Releasing on YouTube\nDirector Lisa Dapolito tells the incredible story of comic icon and Saturday Night Live original Gilda Radner in Love, Gilda.\n11. All About Nina (Sept. 28)\nONE Media on YouTube\nAll About Nina is a comedy about an up-and-coming comedian in New York City (Mary Elizabeth Winstead) who is trying to break down the barriers in the male-dominated comedy world. The movie comes from Raising Victor Vargas director Eva Vives.\n12. Little Women (Sept. 28)\nNew Trailer Buzz on YouTube\nBased on the classic book, Little Women tells the story of three sisters who grow up dreaming of changing the world together. However, as they get older, their relationships become strained. Directed by Clare Niederpruem, Little Women shows how the tests of life can make or break sisterly bonds.\nThe number of films on this list may be a little low due to the lack of female filmmakers out there, but the projects are absolutely worth watching. Women are killing the game in the entertainment world, and it's up to us to support their work.\nEditor's Note: This article was updated from its original version due to a factual error.","url":"https://www.bustle.com/p/12-september-2018-movies-written-directed-by-women-that-are-absolute-must-sees-10188575"}
