{"authors":["Harry Pettit For Mailonline"],"date_download":"2018-10-23 03:16:08","date_modify":"2018-10-23 03:16:08","date_publish":"2017-03-10 12:41:32","description":"Builder Terry Jobson found the skull and bones just a couple of feet underground in 2014. Now researchers in Croydon have revealed that the adult died young and had a tumour on their skull.","filename":"data/vaneerConsumption/1300yearoldAngloSaxonskeletonfoundbeneathdriveway.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22753200000578-0-image-a-2_1489150383612.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4300786_1-300-year-old-Anglo-Saxon-skeleton-beneath-driveway_1540264568.html","title":"1,300-year-old Anglo-Saxon skeleton found beneath driveway","title_page":"1,300-year-old Anglo-Saxon skeleton found beneath driveway | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A skeleton found under a south London driveway dates back 1,300 years to a century before Alfred The Great became King.\nThe almost-complete adult skeleton was unearthed in Croydon, along with a child's bone from the same period.\nBuilder Terry Jobson found the skull and bones just a couple of feet underground while digging up the front garden of Alison, 43, and 48-year-old Michael Carpenters' home while they were on holiday in 2014.\nScroll down for video\nA skeleton found under a south London driveway dates back 1,300 years to a century before Alfred The Great became King. Image shows the skeleton now on display in Croydon museum in South London, presented in a two metre (6.6ft) glass case\nCROYDON SKELETON The person lived and was buried in the Croydon area during AD 670 to 775 - the days of the Anglo-Saxons. It is unclear whether they were male or female. They died no older than 36, but their sex remains a mystery. They were at least 5ft 8ins (1.7m) tall. The person had residual rickets and a benign tumour on their skull. They also had osteoarthritis which suggests they did repetitive work.\nPolice sealed off the house and the area was treated as a crime scene while it was established whether to open a murder inquiry.\nA sample of the bones were sent to a laboratory in Florida for carbon dating.\nThe results showed the bones dated from AD 670 to 775, meaning the person lived and was buried in the Croydon area during the days of the Anglo-Saxons.\nThe skeleton of the adult, who experts found died no older than the age of 36, and a thigh bone of child aged between three-and-a-half and 11 which was found with it, have now gone on public display at the Museum of Croydon.\nA report was commissioned last year to find out more about the skeletons and what they could tell us about the Anglo-Saxon period.\nThe bones dated from AD 670 to 775, meaning the person lived during the days of the Anglo-Saxons. The adult skeleton, who experts found died no older than the age of 36, was found with the thigh bone of a child aged between three-and-a-half and 11\nA report was commissioned last year to find out more about the skeletons and what they could tell us about the Anglo-Saxon period. The in-depth report couldn't confirm the sex of the near-complete skeleton - it showed both male and female traits\nIt was conducted by Dr Rebecca Redfern of the Museum of London's Centre for Human Bioarchaeology.\nThe in-depth report couldn't confirm the sex of the near-complete skeleton - it showed both male and female traits.\nNeither could the report determine the sex of the child from the single thigh bone.\nBut Museum collections officer Emily Lansell said: 'I reckon they were at least 5ft 8ins (1.7m).\nBuilder Terry Jobson found the skull and bones just a couple of feet underground while digging up the front garden of a family home while they were on holiday in 2014. Pictured are a small selection of the bone fragments that Mr Jobson found\nAlison and Michael Carpenter with their children Jasmine, 13 (right), Joel, 11 (left), Toby, 9 (front centre) and Zac, 15 (back centre), outside their home in south London where a builder discovered a pile of old human bones\n'It fills a two by two metre display case and is squeezed into that.'\nThe report revealed plenty about the health of the Anglo Saxon adult.\nEmily said: 'We have been able to determine that it had residual rickets - it had rickets as a child.\n'That is caused by lack of vitamin D which makes your bones brittle. That probably relates to the way the person lived.'\nThe report was able to determine that the adult skeleton had rickets disease from a young age, a disease caused by a lack of Vitamin D which makes the bones brittle. The experts say that this likely relates to the way that the Anglo-Saxon lived\nThe experts said the adult also had a benign tumour on their skull, osteoarthritis - which suggests they did repetitive work\nAnalyses revealed evidence of a heeled inflammatory infection in the adult's leg\nShe said the adult also had a benign tumour on their skull, osteoarthritis - which suggests they did repetitive work, and evidence of a heeled inflammatory infection in the leg.\nThe name 'Croydon' has been suggested as being Anglo-Saxon in origin, derived from 'Croh denu' meaning crocus valley.\nEmily added: 'With the school curriculum now I think it's really important for our school students to understand about our past.'\nThe display in the Museum of Croydon where the skeleton is now on display","url":"https://www.dailymail.co.uk/sciencetech/article-4300786/1-300-year-old-Anglo-Saxon-skeleton-beneath-driveway.html"}
