{"authors":["Olivia Muenter"],"date_download":"2018-10-30 23:16:09","date_modify":"2018-10-30 23:16:09","date_publish":"2014-08-13 21:00:04","description":"As you may have heard before, one of the major keys to a happy and healthy life is staying organized. Even though I dispute this theory and like to think that it is more about chocolate and less about keeping all my socks in the same drawer, I still…","filename":"data/vaneerConsumption/13Cute20142015PlannersForFallThatWillTrickPeopleIntoThinkingYouHaveYourLifeCompletelyTogether.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/56f6f628-60ad-4929-b599-683f72de9c9d.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35512-13-cute-20142015-planners-for-fall-that-will-trick-people-into-thinking-you-have-your-life_1540941369.html","title":"13 Cute 2014/2015 Planners For Fall That Will Trick People Into Thinking You Have Your Life Completely Together","title_page":"13 Cute 2014/2015 Planners For Fall That Will Trick People Into Thinking You Have Your Life Completely Together","title_rss":"NULL","source_domain":"bustle.com","text":"As you may have heard before, one of the major keys to a happy and healthy life is staying organized. Even though I dispute this theory and like to think that it is more about chocolate and less about keeping all my socks in the same drawer, I still have to acknowledge benefits of leading a well-organized life. Generally speaking, when you have a plan (and record it) for the next day or the next month, you're more likely to succeed (and that includes plans to work out, go to meetings, go shopping, and/or take over the world). And if all of that means I have to schedule my life in a cute notebook, well, I'm definitely not complaining.\nSome use their journals to schedule spin classes and client meetings, and others use their agendas/planners to remind them to not eat the entire container of Ben & Jerry's in one day (me) or to watch Game of Thrones on a certain night (also me). Whatever you use your journal for, it's bound to be at least minimally helpful.\nAnd besides, the most positive aspect of having a cute agenda is that even if your life is a total wreck, and nothing you schedule inside your planner actually helps you in any way, people will still think you're organized and efficient. And isn't that what life is all about, really?\n1. Kate Spade Polka Dots\nLike I always say, polka dots are pretty much the answer to everything.\nSet the Stage 17-Month Agenda, $36, Kate Spade\n2. Kate Spade Book Shelves\nThe best thing about the Kate Spade planners and agendas is that they have a fun quote (more like a piece of advice) at the beginning of every month. And come on, I see you all pinning those inspirational quotes on Pinterest. What girl doesn't like a good quote?\nSet the Stage 17-Month Agenda, $36, Kate Spade\n2. Ban.Do \"I Am Very Busy\"\nHint: Look for this journal on eBay and Amazon if it's sold out when you're shopping (it's ridiculously popular).\n2015 Ban.Do 17-Month Agenda, $20, Shop Bando\n3. \"Quit Slackin...\"\nWell, the cover kind of speaks for itself, don't you think?\n2014-2015 12-Month Academic Planner, $25, Etsy\n4. \"Though She Be Little...\"\nLittle and fierce. The Justin Bieber of planners, if you will. But in a positive way.\n2014-2015 12-Month Academic Planner, $25, Etsy\n5. \"What Would Beyoncé Do?\"\nWhat better way to plan your life than with Beyoncé in mind?\nWhat Would Beyonce Do? 2014-2015 Academic Calendar, $22, Etsy\n6. Lily Pulitzer\nIf florals are your thing, I think I have found you a winner.\nLarge Agenda, $28, Lily Pulitzer\n7. Sarah Pinto\nSimple, cute, and pink. A girl can't complain.\n2014-15 Academic Planner, $20, Sarah Pinto\n8. Moleskine\nYou really just can't go wrong with Moleskine.\nLe Petit Prince 2015 12-Month Limited-Edition Weekly Planner, $20, MoleSkine\n9. Floral Agenda\nMore flowers! Something about florals and organization just works, I guess.\n2014 September to 2015 September Weekly Planner, $24, Etsy\n10. Emily Ley\nYou can purchase one of these bad boys as of September 3, and they allow you to plan your days down to the hour, so it's safe to say that you'd be the most organized of them all with this agenda.\nThe Simplified Planner Daily Edition, $58, Emily Ley\n11. The Monthly Planner\nStriped and cute and organized.\n2014-2015 Monthly Planner, $46, Etsy\n12. The Look-Ahead Planner\nNeon is so in right now. This one comes with a couple sheets of cool stickers to make planning more exciting.\nThe Look-Ahead Lime Green Poppin' Planner, $15, Poppin\n13. The May Book\nCan't let go of summer? How about a preppy little sailboat pattern on your planner?\nMay Book, $22, May Designs","url":"https://www.bustle.com/articles/35512-13-cute-20142015-planners-for-fall-that-will-trick-people-into-thinking-you-have-your-life"}
