{"authors":["Kirsten Nunez"],"date_download":"2018-10-31 01:41:00","date_modify":"2018-10-31 01:41:00","date_publish":"2018-09-14 20:31:14","description":"We all know what it's like to make decisions with a large group of people. From dinner plans to party dates, doing anything can end up being harder than it should be. And while choosing an easy group costume for Halloween can be just as daunting, a…","filename":"data/vaneerConsumption/13EasyGroupHalloween2018CostumeIdeasForYouYourSquad.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/b61cd8bf-0ebd-454a-8bfc-a3248145d21f-ghostbusters.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_13-easy-group-halloween-2018-costume-ideas-for-you-your-squad-11882592_1540950060.html","title":"13 Easy Group Halloween 2018 Costume Ideas For You & Your Squad","title_page":"13 Easy Group Halloween 2018 Costume Ideas For You & Your Squad","title_rss":"NULL","source_domain":"bustle.com","text":"We all know what it's like to make decisions with a large group of people. From dinner plans to party dates, doing anything can end up being harder than it should be. And while choosing an easy group costume for Halloween can be just as daunting, a little inspiration can go a long way. I mean, it's not uncommon for a group to have conflicting opinions and budget concerns, so why not keep things simple?\nBesides, there are so many perks to dressing up with your friends. To start, the group approach makes more of an impact. This means each person doesn't have to dish out a chunk of change for the occasion. However, when you stand together or take a group picture, your otherwise simple outfits make for an amazing (and hilarious) Halloween group costume idea.\nPlus, like all things related to Halloween, everything is more fun if you do it with other people. You can recruit anyone from your roommates, friends, family members, or co-workers. If your group costume idea involves some prep work, consider making a party out of it. Serve a few tasty Halloween snack recipes, put on your favorite classic fall movie, and craft on.\nEither way, the outcome of your efforts will be so worth it. Looking for inspiration? Check out these ideas for easy group costumes for Halloween.\n1. Social Butterflies\nSoft Butterfly Adult Wings in Blue, $10, Target | Soft Butterfly Wings in Orchid Bloom, $10, Target\nIn true millennial fashion, you and your squad can dress up as social butterflies. All you need to buy are pairs of butterfly wings. Next, print out the logos of social media platforms like Facebook, Instagram, LinkedIn, and Twitter. Pin or tape it to your clothing and you're good to go. (But not before you post it on the 'gram, obviously.)\n2. Orange Is The New Black Inmates\nNetflix Amazon Amazon\nM&M SCRUBS Women's Scrub Set in Orange and Khaki, $16, Amazon\nWhen everyone in your life is obsessed with Orange is the New Black, it only makes sense to recreate the show's iconic outfits. Luckily, thanks to scrubs, this is extremely easy to do. It's also usually cheaper than buying a show-specific outfit from the costume store.\nOh, and it's super comfy, too. How can you say no?\n3. Shark Week\nBiting Shark Hat, $5, Party Supplies Delivered | Women's Plus Size Core V-Neck T-Shirt in Flat Gray, $8, Target\nAre there seven people in your crew? Dress up as shark week. Each person needs a ridiculous (but awesome) shark hat and a gray shirt. Write a day of the week on each shirt using black paint or duct tape. Finally, splatter yourselves with fake blood.\n4. Tacky Tourists\nCaribbean Joe Printed Rayon Short Sleeve Shirt, $7, WalMart | Alvish Hawaiian Shirt Mens Allover Ocean Scenic Camp Party Aloha Holiday Beach, $18, WalMart\nThis one is so easy, it hurts. Everyone needs the tackiest \"vacation shirt\" they can find, and that's it! For extra details, you can wear fanny packs, high socks, visors, sunglasses, and other vacation-themed goodness. A dollop of sunscreen on your nose doesn't hurt, too. Carry around your cameras, point at everything, and most importantly, have fun.\n5. Mice\nSpirit Halloween Target\nWomen's Plus Size Core V-Neck T-Shirt in Flat Gray, $8, Target | Faux Fur Mouse Ears, $6, Spirit Halloween\nGrab some of your besties and dress up as mice. Easy! First, each person will need a gray shirt. Top it off with mouse ears, and draw on a pink nose and some whiskers. Done and done.\n6. Ghostbusters\nForever 21 Walmart\nUtility Jogger Jumpsuit, $38, Forever21 | CTM Women's Leather 1 1/18 Inch Dress Belt in Red, $4, WalMart\nI think we can all agree that Ghostbusters costumes will never, ever get old. It also doubles as an awesome group outfit idea. However, this doesn't mean you need to spend a pretty penny on a costume you'll never use again. Create a makeshift costume with a tan jumpsuit and red belt. Print out the Ghostbusters logo and pin it to your clothing.\nIf you're feeling extra, wear a black backpack. You're going to need put that candy somewhere, after all.\n7. Powerpuff Girls\nWarner Bros. Television Distribution Forever 21 Lulus Charlotte Russe\nBib Neck Skater Dress, $29, Charlotte Russe | Heathered Skatered Dress in Light Pink, $15, Forever 21 Dress Rehearsal Mint Green Skater Dress, $62, Lulus\nThe Powerpuff Girls are perfect for a group of three. To dress up as Bubbles, one person will need a blue dress and pigtails. Blossom will need a pink or coral dress and a large bow. Finally, Buttercup will need a green dress and a \"don't mess with me\" attitude. If you can, pair the dresses with black belts for extra detail.\n8. Bank Robbers\nPlus Size Striped Tie-Front Top, $22, Forever 21 | Ribbed Knit Beanie, $7, Forever 21\nNo matter how many people are in your squad, you can't go wrong with bank robber costumes. Each person needs a black and white striped shirt and a black beanie. In fact, you might already have these items on hand. You can also add a dollar sign to a black pillowcase or tote bag to hold your loot (also known as candy).\n9. Bag of M&Ms\nGildan Short Sleeve Adult T-Shirt in Cherry Red, Royal Blue, Safety Orange, and Irish Green,$4, Michaels\nM&Ms are perfect for last-minute group costumes. Each person needs a different colored shirt and a large \"M\" on the shirt. You can use white fabric paint or white duct tape.\nPro tip: Head to the craft store. Here, you can easily find inexpensive and plain t-shirts in literally every color.\n10. Skittles\nMichael's Michael's Michael's Michael's\nGildan Short Sleeve Adult T-Shirt in Irish Green, Cherry Red, Safety Orange, and Purple,$4, Michaels\nPlain t-shirts are also excellent for a Skittles group costume. I mean, you're supposed to \"taste the rainbow\", so there are quite a few colors to choose from.\nTo dress up as Skittles, you and your friends will need bright plain t-shirts with a white \"S\" on each.\n11. Football Players and Referee\nNFL 49ers Baseball Jersey, $12, Forever 21 | V-Neck Referee Shirt, $21, WalMart\nTo dress up as a group of football players, wear merchandise featuring your favorite team. You can even just wear your school's football jerseys.\nAnother option is to dress up as basketball, baseball or soccer players. One person can also be the referee if they wear a striped black and white shirt.\n12. Snow\nCharlotte Russe Windy City Novelties\nPlus Size Eyelash Lace Hi Low Dress, $20, Charlotte Russe | LED Snowflake Headbopper Headband, $3, Windy City Novelties\nIf you and your group can't wait for winter, dress up as actual snow. Each person needs a white outfit and an adorable snowflake headband. Finish off the look with frosty, sparkly makeup and you're all set.\n13. Scarecrows\nAdult Straw Western Hat, $3, Michael | Distressed Skinny Denim Overalls, $35, Forever 21 | Women's Stine's Favorite Flannel Shirt - Plaid, $42, Eddie Bauer\nNothing says \"autumn\" like scarecrows, so why not dress up as them? This costume idea calls for straw hats, denim overalls, and plaid shirts. Paint on the \"stitching\" with makeup.\nWith the same clothes, you can also dress up as a cowboy. Just swap the straw hat for a cowboy hat and slip into some Western-inspired boots.","url":"https://www.bustle.com/p/13-easy-group-halloween-2018-costume-ideas-for-you-your-squad-11882592"}
