{"authors":["Kerri Jarema"],"date_download":"2018-10-31 01:43:57","date_modify":"2018-10-31 01:43:57","date_publish":"2018-08-27 21:28:52","description":"Labor Day is just around the corner and with that, we've got to bid an unofficial farewell to summer. While I love autumn intensely, and can't wait for cool, crisp days, colorful leaves, and fall activities, there is always something melancholy…","filename":"data/vaneerConsumption/13SummeryBooksToPackForYourLaborDayGetaway.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/965deaa5-a84b-4496-821d-e66618223b06-pjimage-9.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_13-summery-books-to-pack-for-your-labor-day-getaway-10247371_1540950237.html","title":"13 Summery Books To Pack For Your Labor Day Getaway","title_page":"13 Summery Books To Pack For Your Labor Day Getaway","title_rss":"NULL","source_domain":"bustle.com","text":"Labor Day is just around the corner and with that, we've got to bid an unofficial farewell to summer. While I love autumn intensely, and can't wait for cool, crisp days, colorful leaves, and fall activities, there is always something melancholy about saying goodbye to the slower summer months. But thankfully, I've got one last long weekend to head down to the beach, lay out by the pool, have a picnic in the park, and, of course, fit in some last-minute summer reading. If you've been slacking on picking up some seasonal reads the past three months, now is the time to lose yourself in some sunshine-laden, summer-set, beachy reads before the cozier nights of fall come creeping in.\nBelow are 13 books that were all released this summer, and which are set in the season and dabble in some of its biggest delights. Think beach days and ice cream cones, summer weddings and road trips, and more summer flings than your heart will be able to handle. And there's something here for everyone, from YA contemporaries to thrillers, historical fiction to literary fiction. Whatever summer memories you want to indulge in this Labor Day, these books will have you embracing the final few days lazy days of hot weather, and finishing up your summer reading goals with a flourish.\n'Stay Sweet' by Siobhan Vivian It isn't summer in Sand Lake without a trip to Meade Creamery — the local ice cream stand founded in 1944 by Molly Meade. Amelia has worked at the stand for the past three years, but when Molly unexpectedly passes away, Amelia isn’t sure that the stand can go on. That is, until Molly's nephew Grady arrives and asks Amelia to help him run the business. Click here to buy.\n'The Seasonaires' by Janna King An idyllic Nantucket summer begins like a dream for Mia, Presley, Cole, Jade and J.P., six twenty-somethings who are working as seasonaires — influential brand ambassadors — for the clothing line Lyndon Wyld. But like all things that look too good to be true, the darkness lurking underneath slowly rises to the surface. Click here to buy.\n''Summer of Salt' by Katrina Leno Georgina Fernweh waits with growing impatience for the arrival of her magic, abilities that have been passed down through every woman in her family. Her twin sister, Mary, has already received hers. But with their 18th birthday looming at the end of the summer, Georgina is starting to worry that she won't inherit the magic after all. Click here to buy.\n'Boardwalk Summer' by Meredith Jaeger When Violet Harcourt is crowned 1940's Miss Bathing Beauty in her hometown of Santa Cruz, she’s determined to become an actress. But her pageant victory comes with a price, and she quickly discovers Hollywood is not all she dreamed of. In 2017, Marisol Cruz lives in the seaside cottage that belonged to her grandfather. Drawn to the local history, she discovers his connection to a beauty queen who died too young. Click here to buy.\n'The Way You Make Me Feel' by Maurene Goo Clara Shin loves jokes, but when one of her pranks goes way too far, her father hopes she'll learn some responsibility by spending her entire summer working on his food truck alongside her uptight classmate, Rose Carver. But as she and Rose get to know each other, and Clara falls for a cute boy named Hamlet, saying goodbye to her carefree past suddenly doesn't seem so bad. Click here to buy.\n'The Perfect Couple' by Elin Hilderbrand When a bride-to-be discovered is dead in Nantucket Harbor just hours before the ceremony, everyone in the wedding party is a suspect. And as Chief of Police Ed Kapenash investigates, he discovers that every lavish Nantucket wedding is a minefield — and no couple is as perfect as they seem. Click here to buy.\n'The Last Summer of the Garrett Girls' by Jessica Spotswood Kat lands the lead in the community theater’s summer play, but the drama spills offstage when her ex and his new girlfriend are cast. Bea and her boyfriend are heading off to college together, but Bea isn’t sure she still wants the same things. Vi has a crush on the girl next door. And Des shoulders a lot of responsibility for her family, making it hard to dream big. This summer, the Garrett sisters will rethink everything they thought the knew about themselves — and each other. Click here to buy.\n'The Summer List' by Amy Mason Doan Laura and Casey were once inseparable, floating on their backs in the sunlit lake, dreaming about the future, and teaming up for wild scavenger hunts in their small California lakeside town. Until one summer night, when a shocking betrayal broke them apart. But the past is impossible to escape, and now, after 17 years away, Laura is pulled home and into a reunion with Casey she can’t resist — one last scavenger hunt. Click here to buy.\n'Almost Impossible' by Nicole Williams When Jade decided to spend the summer with her aunt in California, she thought she knew what she was getting into. But nothing could have prepared her for Quentin. Staying up late, sneaking out for a midnight swim, Quentin is determined to give Jade a summer worth remembering. But when rumors come to light, Jade knows Quentin is hiding a secret, and she's determined to find out what it is. Click here to buy.\n'The Summer I Met Jack' by Michelle Gable When Alicia arrives in Massachusetts as a Polish refugee in 1950, she is set to work as a maid for one of the wealthiest families in America. She is dazzled by the oldest son, a rising politician named Jack. Though they soon fall in love, his father forbids their relationship. A decade later, on the eve of Jack’s inauguration as president, the two must confront their past. Click here to buy.\n'August and Everything After' by Jennifer Salvato Doktorski Desperate for a fresh start after graduation, Quinn is eager to escape to her aunt's house on the New Jersey shore for the summer. Quinn can't bear to focus on the future. She doesn't even think she deserves one — not after her best friend died in a car accident. But when Quinn meets Malcolm, a musician struggling with his own demons, she starts to believe in second chances. Click here to buy.\n'What We Were Promised' by Lucy Tan After years of chasing the American dream, the Zhen family has moved back to China. Settling into a luxurious serviced apartment in Shanghai, Wei, Lina, and their daughter, Karen, join an elite community of Chinese-born, Western-educated professionals who have returned to a radically transformed city. Over the course of a summer, the Zhen's high-rise luxury Shanghai apartment becomes the setting for emotional reckonings. Click here to buy.","url":"https://www.bustle.com/p/13-summery-books-to-pack-for-your-labor-day-getaway-10247371"}
