{"authors":["Charlotte Ahlin"],"date_download":"2018-10-31 01:44:27","date_modify":"2018-10-31 01:44:27","date_publish":"2018-09-06 18:00:04","description":"It's happened again: summer came and went, and already the gourd imagery and the Twitter arguments about the political significance of the flavor \"pumpkin spice\" have arrived. I know that we're all prisoners of linear time and, as someone who has…","filename":"data/vaneerConsumption/13WitchyBooksToGetYouInTheHalloweenSpirit.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/73b90247-a29c-4e44-a6a7-ae7e54d8890c-goodhouse3.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_13-witchy-books-to-get-you-in-the-halloween-spirit-11470301_1540950267.html","title":"13 Witchy Books To Get You In The Halloween Spirit","title_page":"13 Witchy Books To Get You In The Halloween Spirit","title_rss":"NULL","source_domain":"bustle.com","text":"It's happened again: summer came and went, and already the gourd imagery and the Twitter arguments about the political significance of the flavor \"pumpkin spice\" have arrived. I know that we're all prisoners of linear time and, as someone who has only ever lived on the East Coast, I should no longer be shocked and disturbed by the fact that seasons regularly change. But it can be hard to say goodbye to summer. Summer is so nice. Autumn is so cold. And wet. And I always drop my scarf on the coffee shop floor. However, autumn does have one redeeming factor that summer can never touch, and that is witch imagery. Autumn is a time for all of us to connect with our inner occultist. So here are a few of the best witchy books out there, for a magical transition into the season of the witch.\nI mean, let's be honest — at this point, September is really just a teaser trailer for October, and October is really just a month-long Halloween. And I have no problem with that. It's the one time of the year when wearing all black and talking to your cat and leaving society to live in a coven of powerful, cauldron-loving women is actually celebrated. We're living in a beautiful golden age, as far as witch-based literature goes, and here are some of the witchiest books to check out:\n'A Discovery of Witches' by Deborah Harkness Diana Bishop wants nothing to do with witchcraft. Yes, she's descended from a long line of witches, but when she calls up a bewitched alchemical manuscript, she returns it to the library stacks almost at once. Unfortunately, it's a bit too late for Diana to have an ordinary life, and her discovery has unleashed hordes of daemons, witches, and vampires, who all want to get their hands (or claws) on this rare treasure that Diana never meant to find in the first place. Click here to buy.\n'Labyrinth Lost' by Zoraida Córdova Alex is a bruja, and a powerful one at that. The only problem is that Alex doesn't want to do magic. She decides to rid herself of her powers once and for all on her own Deathday celebration—but her spell backfires, causing her entire family to vanish into thin air. Whoops. Now Alex will have to use her own magic to get them back... if it's not already too late. Click here to buy.\n'Witchmark' by C.L. Polk In an Edwardian England that never was, Miles Singer has been marked for suffering. He can either live as a slave to his family, or wind up in the witch asylum. So Miles decides to die. Or rather, he fakes his own death and creates a new life as a doctor... until he's pulled into a medical mystery that just might put his own freedom at risk. Click here to buy.\n'The Chronicles of Chrestomanci' by Diana Wynne Jones If you've somehow made it this far without ever reading the enchanted fiction of Witch Mother Diana Wynne Jones, you must rectify that situation at once. Her Chronicles of Chrestomanci, beginning with Charmed Life, tell the story of the great nine-lived enchanter Chrestomanci (think somewhere between Dr. Who and a young, hot Dumbledore) and the various witches, warlocks, and goddesses who stumbled into his path. Click here to buy.\n5 'The Good House' by Tananarive Due Look, books about reluctant witches and friendly witches and teenaged witches are all well and good. But sometimes you want a witch who's actually scary. An entity with the power to curse a whole town. According to local lore, Angela's grandmother was such a woman... but now that Angela's back in town, she'll have to find the truth behind the rumors (and behind the deadly tragedies that have taken place in her grandmother's old house). Click here to buy.\n'The Bone Witch' by Rin Chupeco Tea didn't mean to raise her brother from the dead. But now that she's done it, she's realized that she's not like the other witches in her family: She's a bone witch. That makes her a threat. Bone witches are feared by ordinary people. Now Tea and her brother will have to seek out a strange new land to fully understand who they are and what they can do, as dark forces begin to gather on all sides. Click here to buy.\n'The Witch's Market' by Mingmei Yip Assistant professor Eileen Chen has dismissed witchcraft as mere superstition. At least, that's what she says in public... in private, she finds herself drawn to the possibility of real witches. And when her research brings her to Tenerife, she finds self-proclaimed witches who challenge all her preconceived notions. But are these witches truly magical? And can Eileen figure out who to trust in this world that's so dangerously different from her own? Click here to buy.\n'Circe' by Madeline Miller You may remember Circe as that witch from The Odyssey who enjoyed hanging out with lions and turning men into pigs (honestly, same). But you don't know her real story. Circe is a brilliant re-imagining of the classic mythic character, starting with her strange childhood in the halls of the gods and following her through multiple adventures as she comes into her own witchy sense of self. Click here to buy.\n'The Rules of Magic' by Alice Hoffman Susanna knows that her three children are different. Franny is difficult and Jet is a mind reader and Vincent is always, always looking for trouble. Plus, there's the family curse. None of these children can ever grow up and fall in love. Susanna tries to set rules for her kids, but once they start to uncover the family secrets for themselves, the Owens children decide that they're going to set out on a risky quest to break the curse, rules or no rules. Click here to buy.\n'Iron Cast' by Destiny Soria Ada and Corinne make an unlikely pair in Boston of 1919. But their \"afflicted\" blood gives them the strange ability to weave illusions onstage together at the Cast Iron nightclub. They use these same abilities to con elites into keeping the club open. At least, until their conning goes too far and Ada winds up behind bars. Now Corinne will have break her friend out of the asylum and find a way to rebuild their perilous, magical lives before they're torn apart again. Click here to buy.\n'The Near Witch' by Victoria Schwab The \"Near Witch\" is a story told to frighten children in the town of Near. It's not meant to be true. But when Lexi spots a strange boy in the night, and the children of Near begin to disappear with no explanation, Lexi starts to wonder if there's some truth to the Near Witch after all. All she knows for sure is that she has to protect this odd new boy with no name, and find the real culprit before he's blamed for all the town's woes. Click here to buy.\n'Akata Witch' by Nnedi Okorafor Sunny is feeling a little lost. Born in New York but living in Aba, Nigeria, all she wants to do is play sports like the other kids, but her albino skin forces her to stay out of the sun. She's bullied and lonely. It's only once she meets her strange new friends Orlu and Chichi that Sunny begins to uncover the secrets of her new home—like the secret world of the Leopard People and her own impossible powers. Click here to buy.","url":"https://www.bustle.com/p/13-witchy-books-to-get-you-in-the-halloween-spirit-11470301"}
