{"authors":["Kristina Wong"],"date_download":"2018-10-30 18:45:57","date_modify":"2018-10-30 18:45:57","date_publish":"2017-03-16 08:23:48","description":"WASHINGTON – There are 14 Obama holdovers still at the Pentagon, two months into the Trump administration.","filename":"data/vaneerConsumption/14ObamaHoldoversStillatthePentagon.json","image_url":"https://media.breitbart.com/media/2016/08/ISISMemoObama.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_03_16__1540925157.html","title":"14 Obama Holdovers Still at the Pentagon","title_page":"14 Obama Holdovers Still at the Pentagon","title_rss":"NULL","source_domain":"breitbart.com","text":"Currently, Defense Secretary Jim Mattis is the only presidentially-appointed, Senate-confirmed appointee at the Pentagon, out of 53 such positions.\nObama holdovers are filling four of those positions: Deputy Defense Secretary Bob Work remains in his position; Robert Speer is serving as Acting Army Secretary; Sean Stackley is serving as Acting Navy Secretary; and Lisa Disbrow as Acting Air Force Secretary.\nThe Pentagon said there are 10 other Obama holdovers still serving, but has declined to name who they are or what positions they are filling.\nTrump has filled an additional 32 slots for non-Senate confirmed positions, for a total of 33 hires, including Mattis. That number is less than a fourth of the 163 political appointees at the Pentagon on election day.\nThe White House was expected to announce a handful of names for top political positions at the Pentagon as soon as this week, a defense official told Breitbart News. The White House declined to give a time frame for the announcement.\nPentagon spokesman Navy Capt. Jeff Davis on Monday brushed off suggestions it was taking longer than usual to get appointees in:\n“You have to remember, eight years ago, we kept our secretary — Secretary [Robert] Gates at the time, so a lot of people stayed on with him, and you didn’t have as abrupt of a transition. For those of us who were around 16 years ago, it was pretty abrupt and we saw positions that went unfilled for many months. It takes time to interview, to find the most qualified candidates, to vet them, to get agreement on them, to send them to the Senate for confirmation.”\nTrump has also named picks for Pentagon general counsel and Air Force Secretary, but the Senate has not yet confirmed them.\n“There will be more to come. It’s a process,” Davis said. He said Mattis has “put a lot of names forward that are currently going through the final stages of vetting. We think that there will be multiple announcements coming very soon.”\nCivil servants and former defense officials say the lack of political appointees has had an effect on Pentagon’s operations.\nOne civil servant complained privately that the Joint Staff — military staff who support a body of senior military leaders who advise the president — is running “roughshod” over the Office of Secretary of Defense, according to a former defense official.\nThe former official said civil servants who are filling leadership roles temporarily don’t want to formulate new policies that get ahead of Trump appointees who may change or disagree with them, and either sit silent in meetings or advocate for previous policies.\nIt’s not clear how that might be affecting several reviews the Pentagon is currently undergoing, including on the strategy to destroy the Islamic State in Iraq and Syria (ISIS), on how to rebuild readiness of the armed forces, and on its nuclear missile defense posture.\nFormer Obama administration defense official Loren DeJonge Schulman said without a trusted agent from the Trump political team in the building to lead those reviews, it may be a more military-led process.\n“There are fewer politicals, there are civilians who are not in power, and President Trump trusts the military more…the [elements] are there to have a more military-led process,” said Schulman, currently deputy director of studies and the Leon E. Panetta Senior Fellow at the Center for a New American Security.\n“It’s hard to run a strategy review when you don’t have your political leader in place,” she said.\nAnother official at the Pentagon said it is possible the military is having more influence in policy discussions, but pointed out that at the end of the day, policy decisions go to Mattis, who despite being a retired-four star Marine general, is a civilian.\nA spokesman from the Joint Staff said in an email to Breitbart News: “From our perspective, the Joint Staff is being participating, contributing and working collaboratively with OSD fully when, where and how asked,” he said.\nSchulman, who first served as a special assistant to former Defense Secretary Robert Gates, said that what is more worrisome is that the lack of appointees is preventing important work from being done, particularly with foreign partners.\nShe said, for example, the prime minister of a small country who is visiting the U.S. may not meet with the president but will often meet with senior defense officials instead.\nNow, she said, there is rarely anyone to meet with. Some defense officials have gone overseas to meet with foreign counterparts, but could only sit and listen, not participate or negotiate since they lack policy guidance, she said.\n“Any meeting they go to which requires them to have a position or be a part of a negotiation, it either requires them to stay silent, or to rely on the old administration’s policy, or to have to go to Mattis and say, ‘Hey what’s our position on X, Y, and Z,’ and that’s simply not possible for him to weigh in on everything DOD does. That’s why we have political appointees,” said Schulman.\nThere has also been grumbling from Capitol Hill, with lawmakers complaining there is no one to talk to at the Department.\nSchulman said it has always taken awhile for administration to get top appointees in place, such as under secretaries. However, she said under the Obama administration, deputy assistant secretaries put almost immediately in place in priority areas, she said.\n“We’re not seeing that here,” she said.","url":"https://www.breitbart.com/politics/2017/03/16/14-obama-holdovers-still-at-the-pentagon/"}
