{"authors":["Dave Burke For Mailonline"],"date_download":"2018-10-23 00:15:54","date_modify":"2018-10-23 00:15:54","date_publish":"2017-03-16 09:21:06","description":"Tear gas filled the streets in cities across Brazil and furious protesters clashed with police as anger mounted over plans which will see the retirement age increased and changes to employment laws.","filename":"data/vaneerConsumption/1500protestersoccupyBrazilsfinanceministry.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E52A06200000578-0-image-a-50_1489656050597.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319242_1-500-protesters-occupy-Brazil-s-finance-ministry_1540253754.html","title":"1,500 protesters occupy Brazil's finance ministry","title_page":"1,500 protesters occupy Brazil's finance ministry | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tear gas filled the streets in cities across Brazil and furious protesters clashed with police as anger mounted over plans which will see the retirement age increased and changes to employment laws.\nMore than 1,500 demonstrators broke into the Finance Ministry in capital Brasilia, and tens of thousands took to the streets in Sao Paulo to show their opposition to the controversial measures.\nAfter a demonstration in Rio de Janeiro, protesters smashed windows and fought running battles with police into the night. Towards the end of the demonstration, a group of masked men threw stones and homemade bombs at troops, who responded with tear gas.\nMasked demonstrators clashed with police in Rio in yesterday's nationwide rally against controversial reforms\nProtesters threw stones at troops in Rio De Janeiro during a demonstration against controversial labour law and pension reforms\nThousands of people took part in a strike and demonstrations in Sao Paulo to protest President Michel Temer's proposed measures\nRiot policemen walk past a barricade on fire after a clash with anti-government demonstrators during a protest in Rio\nDemonstrators scuffle during a protest against a pension reform proposed by Brazilian President Michel Temer in Rio de Janeiro\nThey are angered by changes proposed by President Michel Temer, which they say would reduce job security for workers and force many people to work longer and reduce retirement benefits for many.\nThe government plans to set a minimum age of retirement at 65, in a country where people work on average until the age of 54 years before retiring.\nTemer said the reform is needed to ensure the pension system does not collapse due to lack of funding, but this is disputed by trade unions. Unionists and teachers took part in demonstrations across the country yesterday.\nDemonstrators in Porto Alegre take to the streets to show their opposition to the reforms by the Brazilian government\nHolding a shield covered with the message 'We make war because is the only language they understand', a demonstrator runs amid tear gas during a demonstration against federal government proposed reforms in Rio de Janeiro\nProtesters break the windows of a bank during a demonstration against federal government proposed reforms in Rio de Janeiro\nA person on a skateboard jumps in front of a fire started during a demonstration against the Brazilian government's plans in Rio yesterday\nHis government also wants to give companies more flexibility in hiring, including allowing longer temporary contracts, more part-time work and longer work days.\nBrazil is locked in a deep two-year-old recession which has seen unemployment rise to 12.6 percent.\nMilitary police said more than 1,500 people in Brasilia broke into the Finance Ministry overnight and occupied it for several hours. The flag of activist group the Movement of Rural Workers Without Land, flew from one of the ministry's widows.\nAngry demonstrators including teachers and unionists took to the streets of Rio to show their opposition to the government's plans\nLarge groups gathered to demonstrate against the proposals to change employment laws and increase the age of retirement\nProtests in Rio escalated through the night, with troops being pelted and windows being smashed\nTransport workers went on strike in Sao Paulo, where less than half the city's buses ran during yesterday's morning commute, and four of six subway lines operated normally.\nIn a speech Wednesday, Temer said his proposed overhaul would keep Brazil from having to make the kinds of radical changes that European countries like Portugal and Greece were forced to make to revive their economies.\nBrazilians 'little by little will understand that it's necessary to support this road to put the country back on the rails', he said.\nThousands took to the streets across Brazil, including this protest in Rio, over plans to reform employment laws and increase the retirement age\nTroops responded to disorder by using teargas on protesters as a demonstration in Rio turned ugly last night\nA masked demonstrator carries a flare during a protest against proposed federal government reforms in Rio de Janeiro\nA group of Brazilian troops march through the streets in Rio during yesterday's demonstrations, which saw thousands protest across the country\nPamela Lopes, a commuter in Sao Paulo disagreed, saying she wants to see more resistance to the changes even if it meant a tough commute.\n'Life is difficult, and the government is deceiving us,' said Lopes, a 23-year-old who works in human resources. 'Everyone should be on strike.'\nYesterday Luiz Inacio 'Lula' da Silva, who was president in for seven years until 2010 and has signaled that he will stand in next year's election told supporters in Sao Paulo: 'I would like to congratulate you because in taking to the streets you are showing those who believe that people are happy, that people are accepting (the situation), are wrong.\nGas mask wearing demonstrators take cover as they face off with police during yesterday's demonstration in Rio\nMunicipal guards stand in formation as they face off with demonstrators protesting proposed federal government reforms in Rio de Janeiro","url":"https://www.dailymail.co.uk/news/article-4319242/1-500-protesters-occupy-Brazil-s-finance-ministry.html"}
