{"authors":["Alex Kritselis"],"date_download":"2018-10-30 23:33:10","date_modify":"2018-10-30 23:33:10","date_publish":"2014-08-13 17:15:25","description":"At some point after a breakup, I think we all reach the \"fuck you\" stage — it just happens at different times for different people. Sometimes it comes almost immediately, just moments after turning and walking away for the last time or sending that…","filename":"data/vaneerConsumption/15BreakupAnthemsFromtheEarly00sThatWillGetYouThroughAnyEverything.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/7/9/509824c3-8d8b-42bc-9ea9-132857c62132-getty-2284068.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35580-15-breakup-anthems-from-the-early-00s-that-will-get-you-through-any-everything_1540942390.html","title":"15 Breakup Anthems From the Early '00s That Will Get You Through Any & Everything","title_page":"15 Breakup Anthems From the Early '00s That Will Get You Through Any & Everything","title_rss":"NULL","source_domain":"bustle.com","text":"At some point after a breakup, I think we all reach the \"fuck you\" stage — it just happens at different times for different people. Sometimes it comes almost immediately, just moments after turning and walking away for the last time or sending that final, biting text (no emojis). Other times, it comes after weeks and weeks of laying on the couch in ill-fitting sweat pants, drinking Moscato and eating Cheetos crumbs out of the folds of your stained t-shirt. Whenever it arrives, the \"fuck you\" stage after a breakup can be, well, exhilarating.\nAll those times you farted and thought I didn't know — fuck you! You eat at Arby's — fuck you! Your sister looks like a troll doll — fuck you! YOU WERE ALWAYS MISQUOTING THE OFFICE AND I NEVER SAID ANYTHING UNTIL NOW — DOUBLE EXTRA FUCK YOU!!\nEven if you know that your rage will only last for about 15 minutes before your back to mourning your lost love, the \"fuck you\" stage is the perfect time to break out your iPod, turn up the volume, and just BLAST your favorite breakup anthems. And no, not the \"boo hoo, I'm so sad, please come back to me\" breakup anthems, but the middle-finger-in-the-air breakup anthems — the ones that make you feel like you can do anything! The ones that make you feel empowered. The ones that make you feel like you're finally ready to move on and take on the world (even if you're just going to sit down afterward and have yourself a good cry)!\nThis is your official \"fuck you\" breakup anthem playlist, featuring songs from the early '00s, because, let's face it, that was a special time in popular music: *N SYNC was still a thing, American Idol still mattered, and Destiny's Child was absolutely everywhere. So, sit back, relax, and get ready to tell your ex...\n*N SYNC — \"Bye Bye Bye\"\nNSYNCVEVO on YouTube\nA boy band classic!\nBreakup-iest Lyrics: \"It ain't no lie/ I wanna see you out that door/ Baby, bye, bye, bye!\"\nChristina Aguilera — \"Fighter\"\nCAguileraVEVO on YouTube\nSing it, Xtina.\nBreakup-iest Lyrics: \"Guess I couldn't trust/ Called your bluff/ Time is up/ 'Cause I've had enough...\"\nSugababes — \"Hole in the Head\"\nsugababesmusic on YouTube\nA little empowerment from across the pond.\nBreakup-iest Lyrics: \"Erased your number from my telephone/ And if you call me, I won't be at home...\"\nDestiny's Child — \"Independent Women Part 1\"\nDestinysChildVEVO on YouTube\nFew groups can make you feel as good about yourself as the legendary Destiny's Child.\nBreakup-iest Lyrics: \"Only ring your cell-y when I'm feelin' lonely/ When it's all over, please get up and leave...\"\nMiranda Lambert — \"Kerosene\"\nmirandalambertVEVO on YouTube\nThis is the most badass country song in the history of country songs. (Admittedly, my knowledge of country songs is pretty limited...but I stand by my statement.)\nBreakup-iest Lyrics: \"He's out there holdin' on to someone/ I'm holdin' up my smokin' gun...\"\nBlu Cantrell — \"Hit 'Em Up Style (Oops!)\"\nBluCantrellVEVO on YouTube\nA surprisingly unforgettable song from this one-hit wonder.\nBreakup-iest Lyrics: \"Get your hands on his cash/ And spend it to the last dime/ For all the hard times...\"\nBritney Spears — \"Stronger\"\nBritneySpearsVEVO on YouTube\nGet 'em, Brit!\nBreakup-iest Lyrics: \"Hush, just stop/ There's nothing you can do or say, baby/ I've had enough/ I'm not your property as from today, baby...\"\nKelly Clarkson — \"Since U Been Gone\"\nkellyclarksonVEVO on YouTube\nYou were just waiting for this song to make an appearance, weren't you? It's so epic.\nBreakup-iest Lyrics: \"Since you been gone/ I can breathe for the first time/ I'm so movin' on, yeah, yeah!\"\nJoJo — \"Leave (Get Out)\"\nSourav Gouri on YouTube\nJoJo was 13 years old when she sang this song. 13 years old!!!\nBreakup-iest Lyrics: \"It's the end of you and me/ It's too late and I can't wait for you to be gone...\"\nDestiny's Child — \"Survivor\"\nDestinysChildVEVO on YouTube\nThe chorus is iconic.\nBreakup-iest Lyrics: \"You thought that I'd be weak without you/ But I'm stronger/ You thought that I'd be broke without you/ But I'm richer...\"\nJustin Timberlake — \"Cry Me a River\"\njustintimberlakeVEVO on YouTube\nThis song is so cold...but I love it.\nBreakup-iest Lyrics: \"Your bridges were burned/ And now it's your turn/ To cry, cry me a river...\"\nToni Braxton — \"He Wasn't Man Enough\"\nToniBraxtonVEVO on YouTube\nI was obsessed with this song when I was in the 7th grade because...well, because.\nBreakup-iest Lyrics: \"Did you know I made him leave?/ Did you know he begged to stay with me?/ He wasn't man enough for me...\"\nPink — \"There You Go\"\nPinkVEVO on YouTube\nAs always, Pink is committed to telling it like it is.\nBreakup-iest Lyrics: \"Now, when I say I'm through, I'm through/ Basically, I'm through with you...\"\nEden's Crush — \"Get Over Yourself\"\nrimapasi on YouTube\nFeaturing former Pussycat Doll Nicole Scherzinger!\nBreakup-iest Lyrics: \"Get over yourself, goodbye/ It must be hard to be you, yeah, livin' in your life...\"\nCarrie Underwood — \"Before He Cheats\"\ncarrieunderwoodVEVO on YouTube\nThis isn't just a breakup anthem, it's a revenge anthem.\nBreakup-iest Lyrics: \"Maybe next time he'll think before he cheats...\"\nImages: Giphy","url":"https://www.bustle.com/articles/35580-15-breakup-anthems-from-the-early-00s-that-will-get-you-through-any-everything"}
