{"authors":["Tori Telfer"],"date_download":"2018-10-30 23:04:49","date_modify":"2018-10-30 23:04:49","date_publish":"2014-08-14 11:30:04","description":"The other day, one of my best friends texted me frantically: \"I just got an Northwestern alum email and it randomly made me miss that place! Why aren't we secretly sipping margaritas on Deering Field at this EXACT MOMENT?!\" Her text led me to a…","filename":"data/vaneerConsumption/15CollegeBooksThatllMakeYouNostalgicforYourDaysontheQuad.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/5/31/a638ccfe-95f0-4dd7-a1b4-617ab207da1b-getty-842831292.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_34168-15-college-books-thatll-make-you-nostalgic-for-your-days-on-the-quad_1540940689.html","title":"15 College Books That'll Make You Nostalgic for Your Days on the Quad","title_page":"15 College Books That'll Make You Nostalgic for Your Days on the Quad","title_rss":"NULL","source_domain":"bustle.com","text":"The other day, one of my best friends texted me frantically: \"I just got an Northwestern alum email and it randomly made me miss that place! Why aren't we secretly sipping margaritas on Deering Field at this EXACT MOMENT?!\" Her text led me to a flurry of Internet stalking, where I stumbled across my alma mater's Summer Checklist for Incoming Students, and that's when the nostalgia really began to flow. \"Mail final high school transcript. Complete AlcoholEdu,\" ran the list. I did that once! I did!\nDon't get me wrong: My friends and I never secretly sipped margaritas on Deering Field. We weren't that savvy about leeching the most out of every collegiate moment. But we're getting to that point in life where we look back on college with fond nostalgia, instead of sharp relief. Everything I did in college is now tinged with a rosy glow, more or less, like drinking André in a car by the lake while playing Truth or Dare, slogging out of the library late at night feeling a strange mix of depression and elation (I call that feeling College), and barely keeping up with 40 percent of my assigned reading.\nMaybe it's because I was an English major, but nothing reminds me of college more than certain books do. I must have taken almost 15 creative writing classes, and it often seemed like I was assigned the exact same short story collection in every single one. (Kafka is great, but geez.) These 15 tomes are almost guaranteed to trigger visions of college reading: Syllabi in beige classrooms, frantic Sparknote summaries, and finally speaking up on the last day of class in a last-ditch effort to get a good participation grade. Here's to our semi-literate youth.\n1. The Immortal Life of Henrietta Lacks by Rebecca Skloot\nAccording to a report by the National Association of Scholars, The Immortal Life of Henrietta Lacks was the most-assigned book by far in \"common reading\" college programs. During the 2012-2013 school year, one in ten colleges using a \"common reading\" model assigned Skloot's book to incoming students. If the book doesn't make you think about college, it'll definitely have your little siblings feeling nostalgic in a few years.\nClick here to buy.\n2. A Good Man is Hard to Find by Flannery O'Connor\nO'Connor's most famous short story was assigned to me in approximately ten million writing classes, and though we discussed The Misfit to death, we could never quite figure him out, nor did I ever hear a satisfactory explanation for why the grandma calls him \"one of [her] own children\" at the end. And that's why the story is forever amazing.\nClick here to buy.\n3. Ulysses by James Joyce\nPERHAPS YOU'VE HEARD OF IT? I hope for your sake that you encountered Joyce's twisty magnum opus within the safe confines of a college classroom, because otherwise, I have no idea how you survived the experience. Unfortunately for the Joyceans among us, Ulysses is too long to read in a single college class (unless your professor was a straight-up maniac), so chances are you were only assigned part of it. (I chose \"Circe.\") And that's why you never really understood it. Oh, and showing the movie on the last day of class didn't help either, PROFESSOR MACHUGH.\nClick here to buy.\n4. The embarrassingly easy foreign language workbook you never finished\nYOU TOOK EIGHT YEARS OF FRENCH. WHAT IS WRONG WITH YOU?\nClick here to buy.\n5. Three Cups of Tea by Greg Mortenson\nIf you were a college freshman sometime during the past eight years, chances are you read this feel-good manifesto (and maybe caught some of the scandal over Mortenson's lies that erupted afterward). If you didn't read this book specifically, you were probably assigned something similar — easy nonfiction reading that emphasized globalism and multiculturalism, probably in a class called Introduction to Social Policy.\nClick here to buy.\n6. The Communist Manifesto by Karl Marx\nTrue life: My alma mater's library chased me down for years after I graduated because I owed them $10 for a copy of The Communist Manifesto that I never returned (I LOST IT, OKAY?). Something about not paying them back made me feel incredibly communist, which is probably evidence of how little attention I actually paid to Marx's seminal, controversial, and appealingly slim work.\nClick here to buy.\n7. The Fountainhead by Ayn Rand\nThis is one of those books that either changed your life or made you hate the world in general and Ayn Rand in particular. Sounds like junior year!\nClick here to buy.\n8. Your professor's book\nIt was incredibly awkward discussing it in class, since the author was sitting right there, grading you on your opinion. But you still own it, and it's signed, and a small but hopeful part of you believes that one day your professor will stop drinking and publish a second novel that becomes moderately successful and then you'll sell the thing for $50 and take yourself out to dinner.\n9. The Art of Public Speaking by Stephen E. Lucas\nBefore the required public speaking class began, you thought to yourself, \"Why am I taking a class on how to speak?\" But halfway through the first round of presentations — as you watched the cute football player nearly break down in tears — you remembered that people fear public speaking more than they fear death, and so you clutched this textbook and whispered, Save us all.\nClick here to buy.\n10. Candide by Voltaire\nThere were so many lessons for impressionable minds to be found in this satire. Money corrupts! Blind optimism is naive! French philosophers are smarter than you!\nClick here to buy.\n11. The math book you'll never, ever use again\nOh, but you might! Someday, you'll be presented with a problem that only microeconomics (or statistics, or pre-calc) can solve, and when that day comes, you'll be overjoyed that you lugged your greying textbook from apartment to apartment for an entire decade after graduation!\n12. Your favorite course packet\nYou threw most of your course packets away after graduation, but this one has \"The Lottery\" in it (STILL SO CREEPY), plus a poem that you wrote in the margins when you were bored in class (and you'd die before admitting this, but you think it could be published someday). It's like a time capsule of collegiate boredom, inspiration, and half-complete grocery lists.\n13. Zen And The Art Of Motorcycle Maintenance by Robert M. Pirsig\n…or another book that taught, through analogy, how to live life with care, and inspired you to be a better person for three whole days, during which you cooked rice and beans, cleaned your entire room, and called home every night before bed.\nClick here to buy.\n14. Skinny Bitch by Rory Freedman and Kim Barnouin\nNever was this book assigned in a college classroom, but it blew up during the years when most Millennial women were in or nearing college, and it was all over our off-campus housing bookshelves. Our friends let us borrow their copies, and we tried to adopt our terrible eating habits to the authors' perfectly clean ones. I had a weird roommate who went drastically vegan after reading the book and proceeded to cut her hand terribly trying to de-pit an avocado. It wasn't pretty, but it affected us all.\nClick here to buy.\n15. The book you never quite finished\nMine was Heart of Darkness. It was on the assigned reading list for so many classes that I gradually came to believe that I had read it through a sort of literary osmosis. Why did I need to read all the way through when I had already discussed the meaning of \"The horror, the horror!\" multiple times? Maybe I should finish this book someday, but the warm glow I get when I think of how many times I didn't finish it is a special collegiate memory all on its own.\nClick here to buy.\nImage: Wikimedia Commons","url":"https://www.bustle.com/articles/34168-15-college-books-thatll-make-you-nostalgic-for-your-days-on-the-quad"}
