{"authors":[],"date_download":"2018-10-30 18:14:37","date_modify":"2018-10-30 18:14:37","date_publish":"2017-01-13 00:00:00","description":"Photos of Dr. Martin Luther King, Jr. in Atlanta.","filename":"data/vaneerConsumption/15photosofDrMartinLutherKingJrandhisfamilyinAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/CmgOldContent/2017/01/13/Images/LakanaImages.7034205.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_photos-martin-luther-king-and-his-family-atlanta__1540923277.html","title":"15 photos of Dr. Martin Luther King Jr. and his family in Atlanta","title_page":"15 photos of Dr. Martin Luther King Jr. and his family in Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 15\nThe Rev. Dr. Martin Luther King Jr. gestures and shouts to his congregation in Ebenezer Baptist Church in Atlanta, Ga. on April 30, 1967 as he urges America to repent and abandon what he called its \"Tragic, reckless adventure in Vietnam.\" (AP Photo)\n2 / 15\nDr. Martin Luther King Jr., carries books as he heads toward the airplane that was to take him from Atlanta to Birmingham, Oct. 30, 1967 where he faced a 5-day jail for parading against court orders during 1963 civil rights demonstrations in the Alabama. With King for the trip - and the jail term - were, from left, the Rev. A.D. King, Ralph Abernathy and Wyatt Tee Walker. (AP Photo)\n3 / 15\nThis is a photo of Julian Bond and Dr. Martin Luther King Jr. casting their ballots to fill Bond's vacant seat in the U.S. House of Representatives in Atlanta, Ga., on Feb. 23, 1966. Bond was refused his seat in congress because of his endorsement of a statement which charged th U.S. with committing aggression in Vietnam. (AP Photo)\n4 / 15\nDr. Martin Luther King, Jr., left, and his wife, Coretta Scott King, second from left, join pickets during a tour of an Atlanta slum area, Feb. 1, 1966, which King described as \"appalling\". The two women carrying signs were protesting the arrest of Hector Black, a volunteer who was charged with trespassing while handing out blankets at an apartment in the area. (AP Photo)\n5 / 15\nIn this 1968 photo, AP reporter Kathryn Johnson, right, interviews Coretta Scott King in her office in Atlanta. In a new memoir, \"My Life with the Kings: A Reporter's Recollections of Martin, Coretta and the Civil Rights Movement,\" retired Associated Press reporter Kathryn Johnson describes many civil rights flashpoints that she covered in the 1960s, and details her close relationship with the movement’s leader, the Rev. Martin Luther King Jr., and his family. (AP Photo)\n6 / 15\nDr. Martin Luther King Jr., (bottom, 5th from left) leads this long line of demonstrators toward Georgia’s State Capitol in Atlanta, Jan. 14, 1966, in protest of the Georgia House’s barring Rep.-elect Julian Bond. Bond, a 26-year-old civil rights worker, was refused his seat in the House for his statements opposing the draft and denouncing U.S. participation in Viet Nam. (AP Photo/Horace Cort)\n7 / 15\nBlack students began classes with white students in more than 50 Georgia schools in Atlanta, Aug. 30, 1965. Among them were two children of Dr. Martin Luther King, Jr., integration leader. King's daughter, Yolanda, right and son Martin II, left, are with their mother, Coretta Scott King, in the front seat, leaving school. Center is Juandalynn Abernathy, daughter of the Rev. Ralph Abernathy and his wife Juanita. Abernathy, treasurer of Southern Christian Leadership Conference, has three children in Spring St. School. (AP Photo)\n8 / 15\nTwo prominent civil rights leaders denied any disunity in their ranks and announced that their organizations will cooperate on future projects in Atlanta, April 30, 1965. At the left is James Foreman, executive secretary of the Student Non-violent Coordinating Committee. Dr. Martin Luther King Jr., center, heads the Southern Christian Leadership Conference. Singer Harry Belafonte, right, was an objective observer. King and Foreman said they would continue to work together despite differences of opinion. (AP Photo/Horace Cort)\n9 / 15\nDr. Martin Luther King Jr. under arrest by Atlanta Police Captain R.E. Little, left rear, passes through a picket line in front of a downtown department store on Oct. 9, 1960. with King is another demonstration leader, Lonnie King and an unidentified woman. The integration leader was among the 48 African-Americans arrested following demonstrations at several department and variety stores protesting lunch counter segregation. (AP Photo/stf)\n10 / 15\nPart of the large crowd of civil rights demonstrators who marched on the Georgia Capitol in Atlanta, Georgia, Jan. 14, 1966 in protest of Rep.-elect Julian Bond being denied a seat in the House because of his statements opposing the draft and denouncing U.S. participation in Viet Nam as aggression. One segment of the marchers was led by Dr. Martin Luther King Jr. (AP Photo/Horace Cort)\n11 / 15\nAfrican American integration leader Dr. Martin Luther King Jr., right, winner of the 1964 Nobel Peace Prize, receives a glass bowl inscribed to him as a “citizen of Atlanta, with respect and admiration,” from Rabbi Jacob Rothschild of the Temple Synagogue in Atlanta on Jan. 27, 1965. (AP Photo)\n12 / 15\nDr. Martin Luther King Jr., President of the Southern Christian Leadership Conference, is heavily guarded as he speaks to an estimated crowd of 2,500 who braved freezing weather to attend an anti-segregation rally in downtown Hurt Park in Atlanta Sunday, Dec. 16, 1963. Police said the integration leader’s life had not been threatened, but the officers were a precautionary measure. (AP Photo/Horace Cort)\n13 / 15\nDr. Martin Luther King Jr., President of the Southern Christian Leadership Conference, is heavily guarded as he speaks to an estimated crowd of 2,500 who braved freezing weather to attend an anti-segregation rally in downtown Hurt Park in Atlanta Sunday, Dec. 16, 1963. Police said the integration leader’s life had not been threatened, but the officers were a precautionary measure. (AP Photo/Horace Cort)\n14 / 15\nDr. Martin Luther King Jr. and his wife, Coretta Scott King, sit with three of their four children in their Atlanta, Ga, home, on March 17, 1963. From left are: Martin Luther King III, 5, Dexter Scott, 2, and Yolanda Denise, 7. (AP Photo)\n15 / 15","url":"https://www.ajc.com/news/photos-martin-luther-king-and-his-family-atlanta/eFjQKkP4TQWH5UXCXcRKVK/"}
