{"authors":["Kerri Jarema"],"date_download":"2018-10-31 01:38:16","date_modify":"2018-10-31 01:38:16","date_publish":"2018-09-14 22:04:53","description":"September 15 marks the beginning of Latinx Heritage Month in the United States, an annual month-long celebration that celebrates the cultural contributions of the Latinx community and brings them to the forefront. And this year, it feels more…","filename":"data/vaneerConsumption/15QuotesFromLatinxAuthorsThatWillMakeYouWantToPickUpTheirBooksASAP.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/097a9230-4ab9-4e2d-8744-31fa0bbfa274-pjimage-35.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_15-quotes-from-latinx-authors-that-will-make-you-want-to-pick-up-their-books-asap-11854503_1540949896.html","title":"15 Quotes From Latinx Authors That Will Make You Want To Pick Up Their Books ASAP","title_page":"15 Quotes From Latinx Authors That Will Make You Want To Pick Up Their Books ASAP","title_rss":"NULL","source_domain":"bustle.com","text":"September 15 marks the beginning of Latinx Heritage Month in the United States, an annual month-long celebration that celebrates the cultural contributions of the Latinx community and brings them to the forefront. And this year, it feels more crucial than ever to take this time to shine a bright light on the incredible impact and vibrant lives of Latinx people in the United States. If you've been paying even a modicum of attention to the current political state in the United States, you'll know that 2018 has been a scary year of heartbreak and frustration for Latinx people throughout the country.\nFamilies seeking asylum have been separated the border, there have been mass deportations throughout the country, Puerto Ricans are still reeling from the deadly impact of Hurricane Maria on the island, and some Latinx are being denied passports in South Texas. It is obvious that now is the time to embrace and celebrate stories about the Latinx experience, told by Latinx people themselves. And one of the best ways to do it is to pick up some books from Latinx authors. Below are 15 quotes by Latinx authors that will have you desperate to pick up their books ASAP.\n\"I only know that learning to believe in the power of my own words has been the most freeing experience of my life. It has brought me the most light. And isn't that what a poem is? A lantern glowing in the dark.\" ― Elizabeth Acevedo, The Poet X\n\"But how do we live with these secrets locked within us? How do we tie our shoes, brush our hair, drink coffee, wash the dishes, and go to sleep, pretending everything is fine? How do we laugh and feel happiness despite the buried things growing inside? How can we do that day after day?\" ― Erika L. Sánchez, I Am Not Your Perfect Mexican Daughter\n\"We all get scared and want to turn away, but it isn’t always strength that makes you stay. Strength is also making the decision to change your destiny.\" ― Zoraida Córdova, Labyrinth Lost\n\"I have heard all of the stories about girls like me, and I am unafraid to make more of them.\" ― Carmen Maria Machado, Her Body and Other Parties\n\"All of the women in my life were telling me the same thing. My story, my truth, my life, my voice, all of that had to be protected and put out into the world by me. No one else.” ― Gabby Rivera, Juliet Takes a Breath\n\"Demented is the man who is always clenching his teeth on that solid, immutable block of stone that is the past.\" ― Valeria Luiselli, The Story of My Teeth\n\"We're the unknown Americans, the ones no one even wants to know, because they've been told they're supposed to be scared of us and because maybe if they did take the time to get to know us, they might realize that we're not that bad, maybe even that we're a lot like them. And who would they hate then?\" ― Cristina Henriquez, The Book of Unknown Americans\n\"I strike the ground with the soles of my feet and life rises up my legs, spreads up my skeleton, takes possession of me, drives away distress and sweetens my memory. The world trembles.\" ― Isabel Allende, Island Beneath the Sea\n\"You have to live in the world to say anything meaningful about it.\" ― Cristina Garcia, Dreaming in Cuban\n\"Because the truth is, it isn't worth loving something if you aren't going to love it all the way.\" ― Goldy Moldavsky, Kill the Boy Band\n“Even in its first faint traces, love could alter a landscape. It wrote unimagined stories and made the most beautiful, forbidding places.” ― Anna-Marie McLemore, Wild Beauty\n\"The truth has a strange way of following you, of coming up to you and making you listen to what it has to say.\" ― Sandra Cisneros, Woman Hollering Creek\n“There is only one way to go now: forward, into the unknown” ― Cristina Moracho, Althea & Oliver\n\"When God feels like I do ― there are floods. There is fire. If God felt what I was feeling right now, the clock would explode. The windows would crack. The floor would split open.\" ― NoNieqa Ramos, The Disturbed Girl's Dictionary","url":"https://www.bustle.com/p/15-quotes-from-latinx-authors-that-will-make-you-want-to-pick-up-their-books-asap-11854503"}
