{"authors":["Jessica Booth"],"date_download":"2018-10-31 01:43:46","date_modify":"2018-10-31 01:43:46","date_publish":"2018-08-27 21:46:45","description":"If you haven't watched Shark Tank yet, you're missing out on one of the most interesting reality television shows on right now. For those who are unfamiliar, the show features aspiring entrepreneurs who make business presentations to a panel of five…","filename":"data/vaneerConsumption/15SharkTankProductsThatAreNowSOSuccessful.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/7f66f8e9-ed57-41e5-ba55-bf1667b16ef6-scrub-daddy.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_15-shark-tank-products-that-are-now-so-successful-10224581_1540950226.html","title":"15 ‘Shark Tank’ Products That Are Now SO Successful","title_page":"15 ‘Shark Tank’ Products That Are Now SO Successful","title_rss":"NULL","source_domain":"bustle.com","text":"If you haven't watched Shark Tank yet, you're missing out on one of the most interesting reality television shows on right now. For those who are unfamiliar, the show features aspiring entrepreneurs who make business presentations to a panel of five investors (the \"sharks\"). The investors then decide whether they are going to invest in the business idea or not. While the show presents a lot of amazing ideas and innovations, obviously not all of them can become a reality. Of course, some of the products or companies never really make it off the ground, but in some cases, these items become incredibly popular. Certain Shark Tank products are now so successful that it's hard to believe they came from a television show.\nSome of these products have become so popular that you might not even realize they got their start on Shark Tank. These could be items that you use all the time without knowing their history, which is pretty fascinating. It's also kind of inspirational to see how well some of these products do - it's a corny little reminder that if you really go after your dreams, then maybe you too can get on a television show and make them come true. In all seriousness, though, it is very cool to see these products go from just an idea to a full-fledged success.\nBelow are some of the biggest products that have come out of Shark Tank so far. They'll definitely make you want to spend some money!\n1 Scrub Daddy Amazon Scrub Daddy Scratch-Free Sponge, $9.99, Amazon Scrub Daddy is probably the most successful product to come out of Shark Tank. Inventor Aaron Krause got a $200,000 investment in the smiley-faced sponge, and through 2017, has sold more than 10 million sponges with $50 million in sales. So what's so special about this particular sponge? The texture and function changes as you adjust the water temperature. In warm water, it acts as a traditional sponge. With cold water, though, it gets more firm, allowing you to use it for deeper stains without scuffing or scratching anything. The mouth part isn't just for show - it makes it easy to clean hard-to-reach items like silverware or cups. It also washes off easily and is odor-free.\n2 Bombas Bombas Women's Tri-Block Ankle Sock, $12, Bombas Bombas are another everyday item that became wildly successful: socks. In Season 6, Bombas were introduced, and one investor gave the cofounders $200,000 to get started. The athletic sock company donates a pair of socks to a homeless shelter for every pair sold. What makes them stand out is the extra-long staple cotton that makes them, breathable, the extra cushioning that keeps them comfortable, and the genius blister tab. The founders once said they had sold $400,000 worth of socks in four days after their television appearance, and Business Insider says that the company made $50 million in 2017.\n3 Squatty Potty Squatty Potty Squatty Potty, $24.99, Amazon In Season 6, Shark Tank viewers were introduced to the Squatty Potty, which pretty much became an instant success. It's basically just a plastic stool meant to be placed under your feet to help you poop better. According to Mental Floss, the company made $1 million in product less than 24 hours after the broadcast, and in 2016, topped $30 million in sales.\n4 Tipsy Elves Tipsy Elves Women's Happy Birthday Jesus Sweater, $49, Tipsy Elves Who knew ugly Christmas sweaters could be so popular? In 2013, Tipsy Elves co-founders got a $100,000 investment in their company, which features ugly sweater designs. In 2015, sales exceeded $10 million. Today, their site boasts lots of different novelty clothing options, not just ugly sweaters.\n5 Bubba's Q Boneless Ribs Bubba's Q The Ultimate Bubba's BBQ Pack, $99.99, Bubba's In 2014, former NFL player Al \"Bubba\" Baker pitched Bubba's Q boneless rubs He got a $300,000 investment, and then went on to do $16 million in sales in 2017. It was the first time someone could buy boneless ribs online, and they are now sold on QVC and in Costco.\n6 Drop Stop Amazon Drop Stop, $19.99, Amazon The Drop Stop is one of those inventions you think of out of nowhere and wonder why it wasn't created yet... then think that if you had access to something like Shark Tank, you could definitely make it happen. It's a foam-filled log that fits in the crack between a car seat and center console, so that if you drop anything there (which you usually do), it doesn't disappear into the depths of your car. Since their appearance on the show, co-founders went on to sell 2.4 million Drop Stops with $24 million in revenue.\n7 Wicked Good Cupcakes Wicked Good Cupcakes Two-Pack Cupcakes In Jars, $20.95, Wicked Good Cupcakes In Season 4, a mother-daughter duo from Boston went on Shark Tank with the idea to make cupcakes in a jar. Since appearing on the show, these cupcakes, called Wicked Good Cupcakes, have expanded and gotten new locations. Investor O'Leary said it was his most profitable investment of the show, and the company began to make about $4.8 million annually.\n8 Simple Sugars Simple Sugars Avocado Facial, $19, Simple Sugars In Season 4, 18-year-old Lani Lazzari pitched skincare company Simple Sugars, and made a deal with Mark Cuban for $100,000. Within 24 hours of the premiere, sales went from $220,000 to $50,000 and then hit $1 million six weeks later. What makes Simple Sugars different is that it is all-natural skincare dedicated to very sensitive skin.\n9 GrooveBook Groovebook Groovebook is an app that allows users to print photos off of their phone and make them into a custom monthly photo book - and it's super inexpensive, at only $3.99 per month with free shipping. You can also tear them out easily, as the pages are perforated. After their appearance on Shark Tank, according to TechCrunch, the company went from 18,000 paid subscribers to 500,000. In 2015, they sold for $14.5 million to Shutterfly.\n10 Lumio Lumio Classic Lumio, $200, Lumio In Season 6, Max Gunawan pitched a foldable, magnetic-lamp company called Lumio on Shark Tank, and got a $350,000 investment. In 2015, Lumio made $3 million in sales and won a host of awards. It's durable, simple, modern, and great on battery life.\n11 ReadeRest Readerest Stainless Steel ReadeREST, $10.99, ReadeREST ReadeREST is another one of those brilliant ideas you'll wonder why you didn't think of first. Created by Rick Hopper after years of frustration from misplacing his reading glasses, the product is a small magnetic pocket filler that allows glasses-wearers to clip their glasses to their shirt when needed. The clip keeps glasses from slipping out of a pocket and breaking, and helps keep them right on hand. Since appearing on the show, they've made over $27 million in sales.\n12 Kodiak Cakes Kodiak Cakes Kodiak Cakes Power Cakes, $18.78, Amazon Kodiak Cakes are basically nutritious pancakes or waffles. It's a flour-based mix with more whole grains and proteins than most grocery-store brands out there. It was featured on the show in 2013, but the owner, Joel Clark, didn't get any investments. He did get a lot of attention, though, and went on to eventually get $54 million in revenue in 2017 and is now the fourth largest pancake mix on shelves. Proof that sometimes just the exposure alone can be enough to make a product successful!\n13 Cousins Maine Lobster Cousins Maine Lobster One pound lobster meat, $99, Cousins Maine Lobster In 2012, two cousins, Sabin Lomac and Jim Tselikis, started Cousins Main Lobster food truck in Los Angeles to bring an authentic Maine lobster roll experience to the West Coast. On Shark Tank, they got a $55,000 investment, which helped them grow considerably and led to sales of more than $20 million. Now you can even order live Maine lobsters from their website.\n14 Grace and Lace Grace and Lace London Lace Boot Cuffs, $15, Grace and Lace In 2013, Grace and Lace appeared on Shark Tank, which led to a $175,000 investment by Corcoran. Now, Grace and Lace, owned by couple Rick and Melissa Hinnant, has grown from $1 million to over $20 million in sales. The company makes clothing as well as items like lace extenders for skirts and dresses and boot cuffs that make it look like you're wearing socks under your boots.","url":"https://www.bustle.com/p/15-shark-tank-products-that-are-now-so-successful-10224581"}
