{"authors":["Casey Rackham"],"date_download":"2018-10-31 01:35:47","date_modify":"2018-10-31 01:35:47","date_publish":"2014-08-12 19:33:20","description":"I don't know about you, but I'm in serious need of a new band to listen to while I dance sporadically by myself in my kitchen and pretend to clean my dishes. Scratch that — I need a new band that I can listen to, dance to, and obsess over. Enter,…","filename":"data/vaneerConsumption/15TimesMagicManYourNewFavoriteBandWasCompletelyAdorable.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/c87c4116-197f-443c-9d1d-fafe7c3ebe4b.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35131-15-times-magic-man-your-new-favorite-band-was-completely-adorable_1540949747.html","title":"15 Times Magic Man (Your New Favorite Band) Was Completely Adorable","title_page":"15 Times Magic Man (Your New Favorite Band) Was Completely Adorable","title_rss":"NULL","source_domain":"bustle.com","text":"I don't know about you, but I'm in serious need of a new band to listen to while I dance sporadically by myself in my kitchen and pretend to clean my dishes. Scratch that — I need a new band that I can listen to, dance to, and obsess over. Enter, Magic Man. The Boston band, which is set to perform on Tuesday's episode of Late Night with Seth Meyers, is a five-piece indie-pop band with some major synth-rock thrown in. So their music is perfect for those end-of-summer vibes.\nThe group is comprised of lead singer Alex Caplow, guitarist Sam Lee, bassist Gabe Goodman — who all went to high school together — drummer Joey Sulkowski, and, the only female musician in the group, pianist Justine Bowe. Add them all together and you've got a band that sounds good and dresses exceedingly well. (Based on their first music video, \"Paris,\" they've got a little Vampire-Weekend-slash-New-England going on in the wardrobe department.) Basically, all five of them are the most adorable people ever, and when you put them all together, you've got a band exploding with I-want-to-wear-what-you're-wearing style, or, rather, I-want-to-date-someone-who-wears-what-you're-wearing style. Plus, in my humble opinion, they all have great hair, so that doesn't hurt.\nMagicManMusicVEVO on YouTube\nLet's just take a moment to appreciate all of the times that the members of Magic Man were the most delightful people ever on Twitter.\n1. I told you they all dressed really well.\nJust look at those New England shoes and rolled up sleeves.\n2. Let's look at a close-up of Bowe's outfit.\nYeah, she can pull off the overalls look.\n3. While we're at it, let's just look at another one of her outfits.\nAs one Twitter user said, \"A salute to Justine for being the cutest member of Magic Man.\"\n4. When Sulkowski's birthday was obviously a success.\nLike my mother always says, \"It ain't your birthday if you're not on the ground at some point.\" (Note: My mother has never said that, and will never say that.)\n5. When Sam danced to Walk the Moon.\nBoth bands were on tour together with Panic! at the Disco.\n6. When Caplow took a band selfie.\nThat hair.\n7. When all of the guys pet Bowe's head.\nIn an interview with Glamour, Bowe revealed what it's like to be in band with all guys: “It’s constant enlightenment, plus a lot of what you’d expect from being in a very confined space with four dudes. I’m a little more patient than I was before, probably. I don’t always get the shower I want, though. I’ve definitely washed my hair in some venue sinks.\"\n8. When they went to an office party.\nI'd work in that office.\n9. When they all fit into a photo booth together.\nKind of.\n10. When Caplow fed Goodman grapes.\nThat's friendship.\n11. When they tried to do laundry.\nOh, the smells.\n12. When Sulkowski called his mom via Siri.\nWhich mom?\n13. When they posed for pic at a gas station.\nDiggin' those shorts.\n14. When they took a nap together.\nCuddle time.\n15. When they turned themselves into Power Rangers.\nLooks like we've found our new cast.\nImages: MagicMan/Twitter","url":"https://www.bustle.com/articles/35131-15-times-magic-man-your-new-favorite-band-was-completely-adorable"}
