{"authors":[],"date_download":"2018-10-23 05:39:59","date_modify":"2018-10-23 05:39:59","date_publish":"2016-01-11 18:31:30","description":"The number of Syrian refugees stuck on the border with Jordan has climbed from 12,000 to nearly 16,000 since December, the kingdom's government spokesman sai...","filename":"data/vaneerConsumption/16000SyrianrefugeesstuckatJordanborderminister.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-7023x-3WAQP5SaQH704788ebcf7e2055f7-674_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3394384_16-000-Syrian-refugees-stuck-Jordan-border-minister_1540273199.html","title":"16,000 Syrian refugees stuck at Jordan border: minister","title_page":"16,000 Syrian refugees stuck at Jordan border: minister | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"16,000 Syrian refugees stuck at Jordan border: minister\nThe number of Syrian refugees stuck on the border with Jordan has climbed from 12,000 to nearly 16,000 since December, the kingdom's government spokesman said on Monday.\nMohamed Momani, who is also Jordan's information minister, said \"around 16,000 Syrians are located in camps situated a few hundred metres from the Jordanian side (of the border) in no-man's land.\"\nThe UN said in December that 12,000 Syrians were stranded on the border and urged Jordan to take them in, but Momani at the time dismissed the report as exaggerated.\nSyrian refugees arrive in the eastern town of Ruwaished where they were welcomed and checked by the Jordanian authorities after a 120-kilometre drive from a makeshift camp on the border with Syria on September 10, 2015 ©Khalil Mazraawi (AFP/File)\nOn Monday, he told AFP in written remarks that the refugees were receiving humanitarian assistance from Jordan as well as the UN and aid organisations.\n\"The Syrians in these camps are being provided with their needs of supplies, tents and medications,\" he said, adding that there were also clinics inside the compounds.\nJordan says it is hosting 1.4 million Syrian refugees who have fled the now nearly five-year war across the border, while the UN refugee agency UNHCR puts the number at 600,000.\nDuring the first two years of the Syrian conflict, 45 crossing points were open along the 378-kilometre (235 mile) frontier.\nThere are now only two open, with the UNHCR saying they are located in rocky desert areas, devoid of water, shade or vegetation.\nJordan has imposed strict screening of refugees at the border, saying the security measures are important to guarantee the safety of the country and the refugees.\n\"Jordan's security is the first priority for the kingdom, nevertheless our borders remain open,\" said Momani.\nHe said the 1.4 million Syrian refugees present in Jordan represent 20 percent of the country's total population.\nJordan receives \"up to 5,000 refugees per day at times. This has been mostly done at Jordan's expense,\" he added.\nThe kingdom has repeatedly said that the influx of refugees is a burden that has strained its already poor resources in water and electricity and urged more help from the international community.\n\"Jordan is willing to cooperate with any country which might be able to take refugees from the border camp,\" said Momani.\n\"Jordan encourages international agencies to provide all the needed support,\" he added.","url":"https://www.dailymail.co.uk/wires/afp/article-3394384/16-000-Syrian-refugees-stuck-Jordan-border-minister.html"}
