{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:17:33","date_modify":"2018-10-30 22:17:33","date_publish":"2015-05-01 21:04:01","description":"16,000 Registered CA Gun Owners Cannot Legally Own Guns","filename":"data/vaneerConsumption/16000RegisteredCAGunOwnersCantLegallyOwnGuns.json","image_url":"https://media.breitbart.com/media/2014/12/handguns-display-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_05_01__1540937853.html","title":"16,000 Registered CA Gun Owners Can't Legally Own Guns","title_page":"16,000 Registered CA Gun Owners Can't Legally Own Guns","title_rss":"NULL","source_domain":"breitbart.com","text":"On April 30 SF Gate reported that 16,000 gun owners on California’s registry cannot legally own guns.\nThey are barred by their criminal record or mental illness, yet they still possess guns after the CA Department of Justice was given $24 million in 2013 with which to take these guns off the streets.\nAccording to SF Gate, the CA DOJ was supposed to use the money to hire “agents to confiscate guns from owners who had lost their rights due to felony convictions, domestic violence actions, mental health conditions or addiction to narcotics, among other things.”\nThere were 19,784 people illegally in possession on of guns in CA in 2013, that number has only been reduced to 16,396. This means that 1.5 years into the three year effort, the CA DOJ has only “reduced the backlog by only 3,400 people.”\nAnd the job is only getting more difficult with time, because more and more Californians are acquiring guns.\nFor example, Breitbart News previously reported that handgun sales in California broke records in 2014, with 510,000 guns sold. On April 8 The Washington Times reported that buying at this level has continued in 2015, with 200,000 background checks for handgun purchasers in March alone.\nSF Gate reports that Stephen Lindley–chief of the CA DOJ Department of Firearms–pointed out that the list of prohibited persons is certain to keep growing with gun sales at such a pace. And he defended the DOJ’s efforts to track down illegal gun owners by suggesting the “prohibited-persons list would have grown to 28,000” by now had not the DOJ been doing its job.\nNevertheless, as State Attorney General Kamala Harris prepares for a Senate run in 2016, many express concern over her DOJ”s inability to take more illegal guns off the streets.\nFollow AWR Hawkins on Twitter @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/local/2015/05/01/16000-registered-ca-gun-owners-cannot-legally-own-guns/"}
