{"authors":["Merrill Hope"],"date_download":"2018-10-30 18:53:31","date_modify":"2018-10-30 18:53:31","date_publish":"2015-06-27 15:40:43","description":"School is out for summer but one Texas border city's health officials called 163 elementary schoolchildren back into the classroom for testing following possible tuberculosis (TB) exposure.","filename":"data/vaneerConsumption/163TexasBorderStudentsTestedforTB.json","image_url":"https://media.breitbart.com/media/2015/04/ap_ap-photo436-1024x758.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_06_27__1540925611.html","title":"163 Texas Border Students Tested for TB","title_page":"163 Texas Border Students Tested for TB","title_rss":"NULL","source_domain":"breitbart.com","text":"School is out for summer but one Texas border city’s health officials called 163 elementary schoolchildren back into the classroom for testing following possible tuberculosis (TB) exposure.\nEarlier in the week, the City of El Paso Department of Public Health sent letters via certified mail to families of these 163 youngsters in the Clint Independent School District (ISD). They came in contact with someone with active TB at Frank Macias Elementary in Horizon City. The letter invited them to attend an informational session where professionals tested the children for TB on Thursday morning, June 25.\nBreitbart Texas spoke to Bruce Parsons, health department assistant director, who said this first session was only for children on a list of those possibly exposed to the bacterial pulmonary infection. On Monday, June 29, more of the affected children will meet with health officials.\n“Next Tuesday morning, we’ll run some informational sessions for parents whose children are not on the list but are concerned. We’ll give them a tuberculosis 101 so that they understand why certain people are on the list, why they are not, and information so they can understand the basics about TB, diagnosis and treatment,” he said.\nParsons said he was very pleased that on such short notice up to 70 of the 163 children showed up for Thursday’s first meeting.\n“We are approaching the 4th of July holiday. One of the reasons we are trying to get as many as these kids tested as possible over the course of this week is that many of those families will plan to leave town,” he added, emphasizing the importance of parents getting the children tested and not waiting for symptoms to develop to receive treatment.\nParsons pointed out on the positive side, “Children of this age bracket are really unlikely to transmit to others.”\nThe Centers of Disease Control & Prevention (CDC) say this is because young children contract a milder TB strain than adults. It is called pediatric tuberculosis. However, when infected, youngsters are more likely than adults to get sick more quickly.\nThe CDC includes among the most common childhood signs and symptom of tuberculosis: cough; feelings of sickness or weakness, lethargy, and/or reduced playfulness; weight loss or failure to thrive; fever; and/or night sweats.\nPreviously, the El Paso Times reported Parsons would not say if the individual with active TB was a student or an adult on the campus because of privacy laws.\nHe told the local newspaper: “After learning about the active TB case, we immediately initiated a full-scale investigation.” He said they determined there were up to 163 students and 8 staff members who may have been exposed. Faculty in question will be tested too.\nThere are approximately 1,100 students and 100 employees at the elementary school, according to the El Paso Times. The school year ended on June 9.\nIn a press release, Parsons stated that El Paso health officials continue to work closely with the Clint ISD and the Texas Department of State Health Services (TDSHS) on the matter. El Paso health department officials began investigating the possible tuberculosis exposures on June 15.\nFOX-14 reported this was not the first TB scare in the El Paso area. Last September, 859 newborns in an area hospital’s postpartum and newborn nursery were potentially exposed to the infection. No active cases emerged although 11 infants tested positive.\nThis latest health jolt is of concern to El Paso officials because tuberculosis rates are higher along the Texas-Mexico border. El Paso is just north of that border.\nIn 2013, the TDSHS accounted for 1,222 cases of tuberculosis, a rate of 4.6 per 100,000 population. Of those, 51 percent were among Hispanics; 19 percent, African American; 14 percent, Caucasian; and 16 percent, Asians. One was reportedly extremely drug resistant.\nBreitbart Texas reported on a TB outbreak in East Texas just weeks ago at a community college. One case quickly spread to 60 people, who were later screened for the infectious airborne bacterial illness.\nAnyone can contract TB. It is more likely to be diagnosed in people born in a foreign country where pulmonary infection is prevalent. Over 95 percent of TB cases are in developing countries, according to the World Health Organization (WHO).\nNot everyone infected with the bacteria becomes sick. For some, it remains dormant, a person shows no symptoms and is not contagious. However, once the TB bacteria is active, a person manifests the disease.\nFollow Merrill Hope on Twitter @OutOfTheBoxMom.","url":"https://www.breitbart.com/border/2015/06/27/163-texas-border-students-tested-for-tb/"}
