{"authors":[],"date_download":"2018-10-30 21:28:32","date_modify":"2018-10-30 21:28:32","date_publish":"2016-05-20 13:14:00","description":"All jokes aside, lots of Atlanta millenials really do live with their parents. Some 19.7 percent of the 835,000 \"working age\" millenials who reside...","filename":"data/vaneerConsumption/165KAtlantamillenialsstilllivewiththeirmomshereswhy.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/05/20/Images/photos.medleyphoto.9871878.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_real-estate_why-almost_6580403acd25dcfcae7148daacb5aace__1540934912.html","title":"165K Atlanta millenials still live with their moms--here's why","title_page":"165K Atlanta millenials still live with their moms--here's why","title_rss":"NULL","source_domain":"ajc.com","text":"All jokes aside, lots of Atlanta millennials really do live with their parents.\nAbout 165,000 working age millennials — those 24 to 34 years old — who reside in Atlanta are living with mom, according to Zillow data scientist Jamie Anderson in an analysis released in May.\nWhy so many staying at home? To quote the study:\n\"This uptick [in staying with mom] is tied to a combination of the current rental affordability crisis — particularly for lower-earning younger workers – and the weak economy many of these millennials graduated into, limiting their job options. ... \"And given that first-time homebuyers rent longer than ever before, these boomerang kids probably won't be buying their own place anytime soon.\"\n[Read more: Millennials want homes, just don’t have money]\nAnderson analyzed data from the 2005 American Community Survey through 2014, the most recent year available. Of the top 35 U.S. cities, Miami has the most 24- to 34-year-olds living with parents (33.4 percent), while Columbus, Ohio, came in with the least (13.5 percent).\nThe statistics indicated that men are more likely to live with their parents than women. About 55 percent of the millennials living at home in 2014 were guys, a ratio Monroe says stayed constant between 2005 and 2014.\nAtlanta, which is ninth among major U.S. metro areas with about 850,000 working-age millennials, has 165,000 of them still living with parents (19.7 percent). That places Atlanta 15th among the cities studied. Atlanta's percentage did increase slightly, up from 18.4 in 2013, but its nine-year high for millennials living with parents was 19.9 percent in 2012.\nIn 2005, the first year covered by the analysis, around half the current number of those ages 24-34 in Atlanta lived with parents (10.3 percent).\nThe Zillow analysis also showed that the number of working-age millennials sheltering with parents is fairly stable across racial and ethnic lines, though a few cities had notable growth in certain categories.\nThese are the percentages of Atlanta adults ages 24-34 who lived with their parents, by race and ethnicity, in 2014:\nBlack: 8.9 percent\nWhite: 7.3 percent\nHispanic: 1.7 percent\nAsian: 1.4 percent\nThe Zillow analysis also points out that in 2014, 14.1 percent of 24- to-34-year-olds living with at least one parent were unemployed, compared to 6.1 percent of those who were on their own.\nTo read more about the Zillow study, click here.","url":"https://www.ajc.com/news/real-estate/why-almost-percent-atlanta-millennials-live-with-their-parents/SXNfhnUHg5CL6WalDsXMbP/"}
