{"authors":["Megan Grant"],"date_download":"2018-10-31 00:02:03","date_modify":"2018-10-31 00:02:03","date_publish":"2018-10-28 19:38:29","description":"Living alone is the best — until you find yourself needing to perform a simple repair and you're not armed with the proper tools. Since attempting to pulls nails out of the wall with your fingers and unscrew things with your bare hands doesn't tend…","filename":"data/vaneerConsumption/16BasicToolsYouNeedIfYouLiveAlone.json","image_url":"https://imgix.bustle.com/uploads/image/2018/10/26/b62ca2d3-a628-4396-9e05-c1b725c56815-toolz.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_16-basic-tools-you-need-if-you-live-alone-12630597_1540944123.html","title":"16 Basic Tools You Need If You Live Alone","title_page":"16 Basic Tools You Need If You Live Alone","title_rss":"NULL","source_domain":"bustle.com","text":"Living alone is the best — until you find yourself needing to perform a simple repair and you're not armed with the proper tools. Since attempting to pulls nails out of the wall with your fingers and unscrew things with your bare hands doesn't tend to work (also? ow), equip yourself with these 16 basic tools you need if you live alone.\nThere are certain home repairs we all need to be prepared for, whether we rent or own, whether we have a house or an apartment. Leaky pipes, clogged toilets, assembling that IKEA bookshelf you just bought — all require an arsenal of at least the most simple tools. We tend to be intimidated by the thought of carrying a loaded tool belt (women in particular), because WTF do we do with all these odd-looking objects? Rest assured there are very helpful, very simple resources that can guide you through just about anything, and they're called Google and YouTube. This writer can confirm they can get you through everything, from broken kitchen table chairs to fixing the cheap towel rack that broke in the middle of the night, fell on the floor, and gave everyone in the home a mild heart attack.\nYou aren't Bob Vila, and this isn't an episode of This Old House, but if you want to be self-sufficient and prepared for anything, here are 16 simple tools you should consider always having on hand.\n1 Utility Knife FC Folding Pocket Utility Knife $13.99 Amazon You're going to look so cool carrying this around. These heavy-duty steel blades are able to cut *all* the things. It's the ultimate pocket knife.\n9 Hammer Maxcraft 60626 8-oz. Stubby Claw Hammer $12.95 Amazon It's one of the most basic tools of all — and one you can't live without. Don't skip the hammer and use a shoe instead. I can confirm this is a bad idea.\n11 Screwdriver ORIA Screwdriver Set $15.99 Amazon The job won't always call for a high-powered electric drill, so keeping a screwdriver set in the home is always a wise idea.","url":"https://www.bustle.com/p/16-basic-tools-you-need-if-you-live-alone-12630597"}
