{"authors":["Associated Press"],"date_download":"2018-10-23 02:14:36","date_modify":"2018-10-23 02:14:36","date_publish":"2016-01-28 16:58:44","description":"LAGOS, Nigeria (AP) — Multiple suicide bombings have killed 15 civilians and a soldier in the Nigerian town of Chibok, where Boko Haram extremists kidnapped ...","filename":"data/vaneerConsumption/16deadmanycriticallywoundedinChibokNigeria.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:fe64d42afd76420ea54b9bc7a40b6ab0-4vVdYopwYQ7f641721b07af77849-426_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420674_16-dead-critically-wounded-Chibok-Nigeria_1540260876.html","title":"16 dead, many critically wounded in Chibok, Nigeria","title_page":"16 dead, many critically wounded in Chibok, Nigeria | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"16 dead, many critically wounded in Chibok, Nigeria\nLAGOS, Nigeria (AP) — Multiple suicide bombings have killed 15 civilians and a soldier in the Nigerian town of Chibok, where Boko Haram extremists kidnapped scores of schoolgirls almost two years ago, local leaders said Thursday.\nMany of those wounded in the attack Wednesday suffered severe burns and are \"battling for their lives,\" Dr. Idrissa Danladi told The Associated Press by telephone.\nTen people were evacuated for better medical care but the town's small hospital still is overwhelmed, he said.\nFILE - In this Monday, May 19, 2014 file photo, an unidentified woman sits outside her home in Chibok, Nigeria. Multiple suicide bombings have killed a number of civilians and a soldier and the toll is expected to rise among those critically wounded in the Chibok, community leaders said Thursday Jan. 28, 2016 in the town from which Boko Haram kidnapped scores of schoolgirls almost two years ago. (AP Photo/Sunday Alamba, File)\n\"People are trying to help with donations, but there's a shortage of blood,\" he said.\nResidents blamed Boko Haram, the Islamic extremist group that kidnapped nearly 300 schoolgirls in April 2014. Dozens of the girls escaped but 219 still remain missing. The militants have turned to suicide bombings since troops last year forced them out of towns and villages.\nThe 16 victims were buried Wednesday, said Pogu Bitrus, head of the Chibok Development Association.\nHe said six male and female suicide bombers entered the northeast Nigerian town on Wednesday, when people gather for the weekly vegetable market. The first blast came when a man blew himself up at a military checkpoint. A soldier was injured and later died, Bitrus said.\nThat explosion raised the suspicions of the military commander, who rushed to the market to warn people to disperse. As he arrived, however, a woman about to be searched blew herself up, Bitrus said. Several people died and the commander was wounded.\nOther explosions followed swiftly, of veiled women who had already slipped into the market.\nBoko Haram's increasing use of child and adult suicide bombers has raised fears the group is using captives as weapons. A military bomb expert has told the AP that some explosives on suicide bombers have been remotely detonated, indicating that the carriers might not be willing.\nOn Thursday, two female suicide bombers targeted a government school in Cameroon's northern town of Kerawa, killing only themselves but wounding some students, said regional governor Midjiyawa Bakari.\nNo further details were immediately available, although Boko Haram militants have carried out such attacks in Cameroon's north.\n__\nAssociated Press writer Edwin Kindzeka Moki contributed to this report from Yaounde, Cameroon.","url":"https://www.dailymail.co.uk/wires/ap/article-3420674/16-dead-critically-wounded-Chibok-Nigeria.html"}
