{"authors":["Amie Gordon For Mailonline"],"date_download":"2018-10-23 01:55:35","date_modify":"2018-10-23 01:55:35","date_publish":"2017-03-16 12:11:02","description":"Ideal for revellers and keen party hosts, Park Hall just outside the market town of Clitheroe in Lancashire, boasts seven bedrooms, a second detached bungalow on the site and guest apartment.","filename":"data/vaneerConsumption/16mmansionwithsaunaspagymcinemaandNIGHTCLUB.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E53C59F00000578-0-image-a-60_1489664206391.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319864_1-6m-mansion-sauna-spa-gym-cinema-NIGHTCLUB_1540259735.html","title":"£1.6m mansion with sauna, spa, gym, cinema and NIGHTCLUB","title_page":"£1.6m mansion with sauna, spa, gym, cinema and NIGHTCLUB | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ideal for keen party hosts and revellers, a stunning mansion which doubles up as a nightclub has gone on the market.\nPark Hall, just outside the market town of Clitheroe in Lancashire, has gone up for sale for £1,595,000.\nThe stunning seven bedroom home boasts its own gym, sauna, spa and cinema as well as a second detached bungalow on the site, double garage with a guest apartment, and a commanding view over the River Ribble.\nThe property also comes with two large lounges, a kitchen with breakfast bar, two porches, six bathrooms, a dressing room, a master suite with ensuite and small veranda, and a large veranda above the party room.\nThe incredible Park Hall, just outside the market town of Clitheroe in Lancashire, has gone up for sale for £1,595,000\nThe nightclub room comes with a ceramic tiled floor with matching skirting and LED colour changing skirting lighting, a corner bar unit, a double refrigerator and ice maker and two walls with LED light displays\nOffering a luxury experience, the property comes with its own cinema - ideal for hosting dozens of guests\nThe stunning seven bedroom home boasts its own gym, sauna, spa and cinema as well as a second detached bungalow on the site\nOffering something of a spa experience, the bathrooms are fitted with bath spas, showers with side jets, and even televisions.\nThe lounge comes with a ceramic tiled floor with matching skirting and LED colour changing skirting lighting, a corner bar unit, a double refrigerator and ice maker and two walls with LED light displays.\nIt opens up to a music room complete with a remote controlled colour LED lighting system, low voltage lighting and a corner stage area.\nSet in gardens of some three acres, the home comes with adjoining open farmland.\nThe property also comes with a dressing room, a master suite with ensuite and small veranda, and a large veranda above the party room\nThe kitchen comprises an island work station, separate barbeque, and fitted matching dining table with Corian surface and fitted leather seating\nThe hallway: The detached residence was constructed in the 1950s but has since been lovingly restored and furnished\nOutside is a garden over open farmland with views over Brungerley Park and the River Ribble and with distant views toward Waddington Fell\nThe property benefits from a separate large detached true bungalow, substantial four car garage block with staff living accommodation and manicured gardens with further outbuildings and extensive outside entertaining/relaxation areas\nOutside, a long driveway leads to a large turning circle where there is also a purpose built recreation area with a large thatched gazebo, brick built barbecue, sink, and fireplace.\nA spokesperson for estate agents Prime Location said: 'Park Hill is a truly outstanding detached residence constructed in the 1950s and benefitting from recent extensions and redesigning, and occupying a truly wonderful elevated location with aspects over Brungerley Park and the River Ribble and with distant views towards Waddington Fall.\n'The sizeable internal accommodation has been renovated to very high standards and offers a rare opportunity to purchase a property of exceptional quality being very conveniently positioned for all the amenities of Clitheroe which are within one mile travelling distance.\n'The property lies in gardens of approximately three acres and adjoins open farmland to the side.'","url":"https://www.dailymail.co.uk/news/article-4319864/1-6m-mansion-sauna-spa-gym-cinema-NIGHTCLUB.html"}
