{"authors":["Stephanie Linning For Mailonline"],"date_download":"2018-10-23 04:07:55","date_modify":"2018-10-23 04:07:55","date_publish":"2016-01-11 17:08:53","description":"The impressive collection of rare and unusual motors is set to fetch more than £1.7million when it goes under the hammer at Goodwood Members' Meeting in Chichester, West Sussex, in March.","filename":"data/vaneerConsumption/16vintagevehiclesarebeingsoldoffaftertycoonKingsleyCurtisdeath.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/300BBC3100000578-0-image-a-122_1452530046973.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394070_Cool-car-collection-16-vintage-vehicles-collected-half-century-air-conditioning-tycoon-sold-1-7million-death_1540267675.html","title":"16 vintage vehicles are being sold off after tycoon Kingsley Curtis' death","title_page":"16 vintage vehicles are being sold off after tycoon Kingsley Curtis' death | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"From a vintage Rolls-Royce to a horse-drawn hearse, this remarkable collection is sure to impress even the most discerning rare car enthusiast.\nThe impressive set of vehicles was assembled over 50 years by tycoon Kingsley Curtis, the pioneering chairman of refrigeration company, HRP. It is set to fetch more than £1.7million when it goes under the hammer at Goodwood Members' Meeting in Chichester, West Sussex, in March.\nLeading the collection is the 1955 Mercedes-Benz 300SL Gullwing, which could be sold for as much as £1million. It was one of the earliest models built and the third to be delivered to the UK. The vintage motor remains an iconic example of engineering thanks to its distinctive wing-like doors.\nOther big ticket models in the lot include a 1960 Maserati 3500 GT, which is expected to go for as much as £220,000, and a 1923 Bentley 3-Litre TT Replica, which could fetch as much as £280,000.\nPerhaps the most unusual offering is a horse drawn hearse from 1880, which is expected to be auctioned for between £2,000 and £4,000.\nMr Curtis, who died last September, purchased his first classic car in 1963 when he spotted a 1924 Bean 11.9 parked outside a pub in Richmond. He snapped up the car on the spot, beginning a lifelong passion for rare and unusual vehicles.\nTim Schofield, Bonhams UK Head of Motoring, said: ' Each car in the collection had a purpose; the 1923 Bentley 3-Litre TT Replica, his favourite car, was used for local touring, the Maserati for long drives, and the Aston Martin as a summer car.'\nBonhams Members’ Meeting sale will take place at Goodwood Motor Circuit, Chichester, on Sunday 20 March 2016.\nStylish: This 1960 Maserati 3500 GT, which was used by tycoon Kingsley Curtis for long drives, is expected to fetch as much as £220,000 at auction. The model, built from 1957 to 1964, established Maserati as a road car manufacturer as it was their first production project\nMacabre: This black horse drawn hearse, built in roughly 1880 by John Marston of Birmingham, is the most unusual item in the lot and will go for as much as £4,000. The carriage would have been pulled by two or four black horses wearing plumes attached to their bridles\nEerie: A photograph taken inside the carriage of the hearse reveals delicate floral paintwork and mirrors inlaid on either side, adding to the sense of grandeur. For the Victorians, death was an important social ocassion and customs and appearance were very important\nClassic: This 1920 Bean boasts 11.9hp and is expected to go for between £9,000 and 12,000 when it goes under the hammer in March. Bean Cars was a brand of motor vehicles made by A Harper Sons & Bean, Ltd at factories in Dudley, Worcestershire, and Coseley, Staffordshire\nOriginal features: The 1920 Bean boasts a lion mascot above the grill, left, and a vintage dashboard that adds to its charm, right\nMellow yellow: This striking La Buire 12A, which was built in Lyon between 1924 and 1925, will be sold for as much as £22,000. The five-door model, which was owned by Mr Curtis until his death last September, offers 14hp and would be a novel addition to a car collection\nCool: This two-seater 1923 Rolls-Royce 20hp is expected to fetch up to £38,000 at auction in March. The model was built between 1922 and 1929 was the manufacturers 'small car' for the 1920s, although many were sold to customers with chauffeurs\nPopular: This model was introduced to meet requests for a smaller, less expensive car in keeping with the trend after the First World War\nPersonal favourite: Mr Curtis used this 1923 Bentley 3-litre TT Replica, which is expected to go for as much as £280,000 for drives around the local area. The elegant model was more than capable of competing with the best of European and American sports cars in in the 1920s\nVintage: The four-seater set up means the driver of this stylish Bentley will have plenty of room to take passengers on a ride\nWell maintained: The vehicle is one of 16 collected by Mr Curtis over more than 50 years. Pictured the dials on the dashboard\nIconic: Leading the collection is the 1955 Mercedes-Benz 300SL Gullwing, which could be sold for as much as £1million. It was one of the earliest models built. The vintage motor remains an iconic example of engineering thanks to its distinctive wing-like doors","url":"https://www.dailymail.co.uk/news/article-3394070/Cool-car-collection-16-vintage-vehicles-collected-half-century-air-conditioning-tycoon-sold-1-7million-death.html"}
