{"authors":["Martha Sorren"],"date_download":"2018-10-30 22:52:38","date_modify":"2018-10-30 22:52:38","date_publish":"2014-08-14 17:17:55","description":"Shark Week is upon us and the Discovery Channel schedule is jam-packed with awesome-sounding programs. In the more educational of them, the audience is often reminded that sharks may eat humans, but not all that often. You're more likely to get…","filename":"data/vaneerConsumption/16WeirdestThingsEverFoundInsideaSharksStomach.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/bf9fde9f-3ff6-4d91-bdb7-32ae68676565.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35742-16-weirdest-things-ever-found-inside-a-sharks-stomach_1540939958.html","title":"16 Weirdest Things Ever Found Inside a Shark's Stomach","title_page":"16 Weirdest Things Ever Found Inside a Shark's Stomach","title_rss":"NULL","source_domain":"bustle.com","text":"Shark Week is upon us and the Discovery Channel schedule is jam-packed with awesome-sounding programs. In the more educational of them, the audience is often reminded that sharks may eat humans, but not all that often. You're more likely to get killed by a vending machine than a shark. But while it's true that people aren't a shark's favorite meal, they don't just restrict themselves to a diet of sea life. The weirdest things can be found in the belly of a shark from clothing to toys to animals you never even see near the ocean.\nThe most common culprit of this strange feeding behavior is the Tiger shark. Nicknamed the \"garbage can of the sea,\" these deadly animals have been found full of the oddest objects. But occasionally other sharks like Greenland sharks, Sand Tiger sharks, Lemon sharks, and more have also been discovered with strange stomach contents.\nCutting open the stomach of one of these creatures just goes to show you what people are dumping in the oceans these days, and the sharks are paying the price. After all, it's not like sharks are strolling on to land to eat tires, shoes, and more. That stuff usually finds its way into the water thanks to some thoughtless humans. So here are the 16 weirdest things ever found in a shark's stomach.\nPOLAR BEARS\nSean Gallup/Getty Images News/Getty Images\nThe Greenland Shark hunts in the polar waters off the coast of, you guessed it, Greenland. The animal can live until the age of 200 and grow to 23 feet long. That makes them excellently equipped to eat huge animals like polar bears, who are usually considered pretty fearsome themselves. I certainly wouldn't want to meet one of these guys in the ocean.\nREINDEER\nGetty Images/Getty Images News/Getty Images\nThe Daily Mail reports that Greenland sharks have also been found with full size reindeer in their stomachs, antlers and all. So can someone please explain what a reindeer was doing in the ocean?\nLICENSE PLATES\nStephen Brashear/Getty Images News/Getty Images\nFrom nearly every state, including land locked ones like Kansas. They're a popular meal for many a Tiger shark, but they're not picky. In fact the rest of this list is comprised of things found in Tiger shark bellies.\nTIRES\nSean Gallup/Getty Images News/Getty Images\nUnfortunately National Geographic says tires are a pretty common thing for sharks to eat because humans are terrible and think the ocean is a trash can.\nCHICKEN COOP COMPLETE WITH CHICKENS\nDavid McNew/Getty Images News/Getty Images\nI can see how some (thoughtless) person could chuck a chicken coop in the ocean to discard of it, but with the chickens still inside? Okay then.\nFULL SUIT OF ARMOR\nIan Gavan/Getty Images Entertainment/Getty Images\nCasual.\nA FUR COAT\nDominique Charriau/Getty Images Entertainment/Getty Images\nAccording to The New York Times, one shark had even eaten an expensive fur coat. Some rich lady was probably really mad about this one, I'm sure.\nRUBBER BOOTS\nMatt Cardy/Getty Images Entertainment/Getty Images\nLosing your shoes to a shark must be even worse than losing them on the NYC subway tracks (which I have done, so I know.)\nPORCUPINE\nFrederick M. Brown/Getty Images Entertainment/Getty Images\nOuch.\nPET DOGS\nPeter Macdiarmid/Getty Images News/Getty Images\nAccording to Shark!: Killer Tales from the Dangerous Depths, everything from an adult spaniel complete with a collar to a bulldog's head have been found inside a Tiger shark's stomach. Long story short, keep your pups out of the ocean.\nA VIDEO CAMERA\nEthan Miller/Getty Images News/Getty Images\nYou have to figure with all the time networks spend filming sharks underwater, they're gonna lose a camera or two. Here the inquisitive Tiger shark swallowed the camera while it was still running, giving us an up close look inside the mouth of of the world's most dangerous animals. The moment comes at about 3:13.\nStuartCoveDiveBahama on YouTube\nA HORSE HEAD\nAndrew Burton/Getty Images News/Getty Images\nWhat was a horse doing in the ocean? The world may never know.\nA BAG OF MONEY\nAnnie Tritt/Getty Images News/Getty Images\nThat's a rough thing to lose. Except I feel like no one but bad guys carry money around in bags, so maybe it's a good thing that they lost their stolen goods.\nBIRTH CONTROL PILLS\nSandy Huffaker/Getty Images News/Getty Images\nHey, sharks deserve to have safe sex too. ReefQuest Centre for Shark Research reports that an entire contraceptive packet was once found inside a Tiger shark.\nBARBIE DOLLS\nMario Tama/Getty Images News/Getty Images\nWith the hair still intact and everything.\nANOTHER SHARK\nResearchers in Delaware caught more than they bargained for when a Sand Tiger shark leapt out of the water to grab their captured Dogfish shark. Once again proving that sharks are the most bad ass animals in the ocean.\nImages: lwpkommunikacio/Flicker; Getty Images (15); AMC (2); giphy","url":"https://www.bustle.com/articles/35742-16-weirdest-things-ever-found-inside-a-sharks-stomach"}
