{"authors":["Sophie Borland Health Correspondent For The Daily Mail"],"date_download":"2018-10-22 20:21:47","date_modify":"2018-10-22 20:21:47","date_publish":"2016-01-28 00:58:51","description":"As many as 3,000 out of 11,674 chemists may have to shut, said health minister Alistair Burt, and those most at risk are smaller, family run pharmacies described as the 'salt of the earth'","filename":"data/vaneerConsumption/170mNHScutscouldkilloffaQUARTERofourchemists.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/00/0D3A75BF00000578-0-image-a-42_1453942590112.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420226_170m-cuts-kill-quarter-chemists-pile-pressure-E_1540239707.html","title":"£170m NHS cuts could kill off a QUARTER of our chemists","title_page":"£170m NHS cuts could kill off a QUARTER of our chemists | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Up to a quarter of England's pharmacies could close because of funding cuts, the Government has admitted.\nAs many as 3,000 out of 11,674 chemists may have to shut, said health minister Alistair Burt.\nThose most at risk are smaller, family-run pharmacies, described as the 'salt of the earth' for serving local communities.\nTheir annual funding is being slashed by £170million – 6 per cent – as part of efficiency savings across the NHS.\nUp to a quarter of England's pharmacies could close because of funding cuts, the Government has admitted (file photo)\nEach chemist is allocated a pot of money each year depending on how many prescriptions it dispenses and additional services it provides for the community.\nOn average, up to 90 per cent of their income comes from the NHS while the remainder is generated by sales of over-the-counter remedies and toiletries.\nThe cuts have been proposed just as patients are being repeatedly told to make better use of their pharmacies as an alternative to seeing the doctor.\nHealth Secretary Jeremy Hunt, NHS England head Simon Stevens and other senior officials have urged the public to go to chemists instead of A&E or a GP.\nThe Government has not earmarked particular pharmacies for closure, meaning the exact number will depend on how they cope with the cuts. But this month, Mr Burt told MPs on the All Party Pharmacy Group that between 1,000 and 3,000 may shut.\nThe minister promised money to keep pharmacies in areas where closures would leave patients without help, according to minutes of the meeting revealed by the magazine Chemist and Druggist.\nOn average, up to 90 per cent of pharmacies' income comes from the NHS while the remainder is generated by sales of over-the-counter remedies and toiletries\nSandra Gidley, from the Royal Pharmaceutical Society, said: 'We have a number of concerns. We have spent a lot of time and energy encouraging people to come to pharmacies for health advice to cut pressure on A&E departments and GP services.\n'Under the plans, pharmacies could be forced to cut staff and have less capacity to give important health advice. The Government must consider the capacity that the community pharmacy network provides to relieve pressures on GPs and A&E.'\n'WE ARE THE SALT OF THE EARTH' The owner of the Ruislip Manor Pharmacy in West London fears the cuts may force him to close. Sanjay Doegar already had to make one employee redundant this month as he could not afford to keep him on full time. ‘This is a bombshell for the profession,’ he said. ‘I’ve already had to let one member of staff go and that’s been upsetting and heartbreaking. ‘We are the salt of the earth. We know the people, we have personal relationships, we deliver medicines to vulnerable patients. ‘We are the fuel that keeps the NHS burning. Small pharmacies will be the ones that suffer but this is an attack on all pharmacies. ‘It’s completely bizarre when pharmacies are meant to be doing more and more for the NHS by stopping people from going inappropriately to GPs and A&E. ‘We have so much armoury to help the local community. How can this make sense?’ He said his pharmacy takes medicines to 30 to 50 people a day and smaller pharmacies give a much more personal service than chains.\nChemist closures would ramp up pressure on buckling hospital A&E units.\nThis month, it emerged that a string of casualty departments closed as they were overwhelmed, diverting patients and ambulances to other units.\nNHS figures showed how trusts have used 89 such A&E 'diverts' since the end of November.\nClosures would also hit the accessibility of out-of-hours GPs, who face picking up the slack.\nA leaked report revealed problems at the NHS out-of-hours hotline, with a shortage of doctors and other staff putting patients at 'serious risk'.\nSanjay Doegar, who owns a chemist in West London, said local pharmacies are 'the salt of the earth' because of their vital role helping patients. Ministers want more pharmacists to work in GP surgeries and A&E to reduce doctors' workload.\nThey also believe that some areas have too many as businesses tend to cluster together. At the same time, the NHS is urging patients to order more prescriptions online, reducing the need for high street outlets.\nA pharmacy typically receives £220,000 a year depending on the number of prescriptions it issues and what extra services it offers, such as carrying out flu jabs.\nPharmacists are medical experts with four years of training at university. The Government believes they could carry out some tasks undertaken by GPs and A&E doctors.\nSir Kevin Barron, chairman of the parliamentary group, warned that the Government was engineering 'a crisis where people are going bust because income is taken off them'.\nRob Darracott, chief executive of industry body Pharmacy Voice, said: 'We're extremely concerned. It's a massive shock. Some are really going to struggle.'\nKeith Ridge, chief pharmaceutical officer at NHS England, said: 'We are looking at ways to make greater use of pharmacists in GP surgeries, A&E, care homes and other settings, and make better use of technology.","url":"https://www.dailymail.co.uk/news/article-3420226/170m-cuts-kill-quarter-chemists-pile-pressure-E.html"}
