{"authors":[],"date_download":"2018-10-22 21:39:03","date_modify":"2018-10-22 21:39:03","date_publish":"2014-06-05 21:48:34","description":"Unlike nearby Latin American nations where a tourist's dollar seemingly stretches forever, Brazil is astoundingly expensive.","filename":"data/vaneerConsumption/17BurgerWorldCupTouristsShouldPrepareforPriceShock.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/490921/140605-brazil-tourists-1727_e55d80f82f01af0ac7a2dc00ca23f1a8.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_world-cup_17-burger-world-cup-tourists-should-prepare-price-shock-n124026_1540244343.html","title":"$17 Burger? World Cup Tourists Should Prepare for Price Shock","title_page":" $17 Burger? World Cup Tourists Should Prepare for Price Shock","title_rss":"NULL","source_domain":"nbcnews.com","text":"The dizzying prices are referred to here as the \"Custo Brasil,\" or \"Brazil Cost\" — the mixture of high taxes and steep import tariffs, combined with bad infrastructure, a dose of inefficiency and a thick shot of bureaucracy.\nDemand leading up to a big event like the World Cup naturally raises prices. But, since costs already were high to begin with, tourists should prepare to dig deep into their wallets and not be too miffed to receive goods or services of inferior quality, said Rafael Alcadipani, a business administration professor at the Getulio Vargas Foundation, Brazil's top think tank.\n\"Anything you buy in Brazil will be more expensive than in the United States or Europe, but the quality is going to be worse,\" Alcadipani said.\nHotel rates in many of the World Cup host cities more than doubled ahead of the tournament. Massachusetts-based TripAdvisor reports visitors to Rio will face the highest prices, with hotel rates averaging $445 per night. Add in food, a ticket and other expenses, and a solo traveler to Rio should prepare to spend $682 each day.\nNext costliest are Fortaleza and Manaus, where average daily expenses are estimated at $602 and $554, respectively. Even the more affordable host cities will set travelers back a good amount: $457 per day in Cuiaba and $477 in Sao Paulo.\nExperts say prices are kept high because supply can't keep up with demand. About 40 million Brazilians — a fifth of the population — joined the middle class in the past decade, on the back of strong economic growth and increased government social programs. Between 2009 and 2012, average annual income rose by more than 40 percent, from $8,140 to $11,630, according to the World Bank.","url":"https://www.nbcnews.com/storyline/world-cup/17-burger-world-cup-tourists-should-prepare-price-shock-n124026"}
