{"authors":["Tatiana Tenreyro"],"date_download":"2018-10-31 01:40:50","date_modify":"2018-10-31 01:40:50","date_publish":"2018-08-28 14:45:58","description":"It’s been 15 years since The O.C. first aired, but fans still have strong opinions about the minor characters from the show. Of course, nothing beats the nostalgia felt towards the core four, but minor characters from The O.C. are still very…","filename":"data/vaneerConsumption/17MinorTheOCCharactersRankedFromEvilVillainsToTotalFanFavorites.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/ed624a8b-6206-47cd-b1f1-1916fe817046-screen-shot-2018-08-27-at-54955-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_17-minor-the-oc-characters-ranked-from-evil-villains-to-total-fan-favorites-10255352_1540950050.html","title":"17 Minor 'The O.C.' Characters Ranked, From Evil Villains To Total Fan Favorites","title_page":"17 Minor 'The O.C.' Characters Ranked, From Evil Villains To Total Fan Favorites","title_rss":"NULL","source_domain":"bustle.com","text":"It’s been 15 years since The O.C. first aired, but fans still have strong opinions about the minor characters from the show. Of course, nothing beats the nostalgia felt towards the core four, but minor characters from The O.C. are still very important to fans in 2018. Just ask anyone what they think about Oliver, Trey, or Volchok and you’ll likely get a passionate response. But besides the characters that fans love to hate, there are others that people wish would’ve stuck around longer, like Anna, Alex, and Lindsay.\nSome minor characters on the show were luckily turned into series regulars, like Taylor and Che — who both went from being hated to showing a more endearing side. But there were also so many who, despite being on the show for a short time, managed to have a huge impact on the storylines. This was sometimes to fans’ dismay, while at other times, fans fell in love with these characters until they were written off. The individuals below shook things up for the core four, bringing tons of drama to Newport — even going as far as causing Marissa’s death.\nLet’s take a look back at The O.C.’s most memorable minor characters, from fan favorites to the most controversial villains, with a ranking from most-hated to most-loved.\n17 Volchok TheOCET on YouTube The position for worst O.C. character is very close between Volchok, Oliver, and Trey. But considering how Volchok ends up killing Marissa and is an absolutely terrible boyfriend, he's the worst. If you need a reminder of why, re-watch Marissa's death scene.\n16 Oliver Marissa Cooper on YouTube Many fans believe Oliver is the absolute worst — and it’s for a good reason. Oliver manipulates Marissa and breaks up her first stable relationship out of selfishness, showing no remorse for his actions. Marissa is already going through a lot and he ruins things further, even going as far as threatening to kill himself when she won't hook up with him.\n15 Trey Giphy Following the trend of the men in Marissa's life being terrible, Trey is at the same level of horribleness as Oliver and Volchok. Trey is the poster boy for toxic masculinity, as he tries to sexually assault Marissa when she refutes his advances. Once Ryan confronts him, their fight is so physically intense that Marissa has to intervene by shooting Trey to save Ryan.\n14 Johnny Shadow2012121212 on YouTube Even though he isn't as terrible as Oliver, Johnny gave fans some serious déjá vú when he entered Marissa's life. His reckless behavior and desire to be with Marissa leads to his gruesome death — making her feel guilty, even though Johnny was the one who didn't respect her feelings.\n13 Che M3ta1 on YouTube Che does sort of redeem himself by the fourth season, but who can forget how his selfishness causes Summer to be kicked out of Brown? He never really feels remorseful about what he did, though Seth and Summer end up forgiving him. Also, the fact that he's willing to break up Seth and Summer shouldn't be forgotten.\n12 Luke Giphy Luke becomes a sweet, comedic relief later on in the show, but he's initially introduced as a violent jerk who cheats on Marissa. Even though he's not the best, he's one of the characters who grows the most throughout the show. Plus, who can forget his iconic line?\n11 Frank Namehere15 on YouTube Ryan's dad Frank is an abusive alcoholic, but by the fourth season, it's clear he's trying to rectify his actions and become part of Ryan's life. Julie Cooper also becomes an unlikely partner who helps bring out a loving, caring side of Frank.\n10 Dawn Ricky Mk on YouTube Like Frank, Dawn isn't the best parent to Ryan. When she first appears in the first season, she makes a scene by getting drunk in front of Newport's richest folks at a charity casino. But when Ryan reunites with her during the third season, she shows him how much she's changed for the better and how much she cares about him.\n9 Hailey Giphy Kirsten's sister Hailey forms a close bond with both Seth and Ryan and occasionally wrecks havoc despite having the best intentions. Hailey isn't the most likable character from the show, but she definitely causes exciting moments, from standing up to Julie Cooper to being caught stripping by Seth.\n8 Sophie a.k.a. \"The Nana\" Everything The O.C. on YouTube The Nana is an underrated badass. Upon finding out she has cancer, she decides to evoke a positive outlook and retains it once she's on remission. This change helps her become more involved in the Cohens' lives, even accepting Ryan.\n7 Sadie BestoftheOC on YouTube Sadie might not be the best minor character out of the women Ryan dates, but she serves as a good support system while he's struggling emotionally after not being able to stop Johnny's death and finding out his brother almost raped Marissa.\n6 Dr. Kim Dr. Kim is one of the most underrated minor characters from The O.C. When Ryan moves to Newport, she becomes one of his first supporters, encouraging him to apply to Harbor and fulfill his potential once she discovers his passion for architecture.\n5 Bullit FriendsFreeakFOX on YouTube When Kaitlin experiences the loss of Marissa and then has to deal with other family issues, Bullit becomes an incredible father figure to her. Their dynamic is so endearing to watch, considering how happy he makes Kaitlin. It makes you wonder what Marissa's life would've been like if Julie had met him sooner.\n4 Lindsay Gemma S on YouTube Before dating Taylor, Ryan briefly romances another headstrong, outspoken teen. Lindsay helps Ryan get in touch with his feelings and move on after dating Marissa. But unfortunately, Lindsay doesn't last very long after it's revealed that she's actually Caleb's daughter and Kirsten's half-sister, making her relationship with Ryan super awkward.\n3 Alex Giphy Alex is hands down the best person Marissa dates besides Ryan. She's patient, understanding, and there for Marissa during a time of emotional turmoil. Their relationship didn't last long after the network pressured creator Josh Schwartz to wrap up Alex's arc, but Alex became a very important character for LGBTQ fans at a time where there was a severe lack of representation of queer characters on TV.\n2 Theresa Marissa Cooper on YouTube Theresa is one of The O.C.'s most empowering female characters. She's smart, independent, and hard working. Theresa is by no means perfect, but does everything she can to help her loved ones. Not only does she decide to raise her kid on her own to not tarnish Ryan's future, but she denies financial help from the Cohens and goes on to become a hotel manager.","url":"https://www.bustle.com/p/17-minor-the-oc-characters-ranked-from-evil-villains-to-total-fan-favorites-10255352"}
