{"authors":[],"date_download":"2018-10-30 20:52:48","date_modify":"2018-10-30 20:52:48","date_publish":"2018-07-13 18:15:00","description":"A 17-year-old was arrested Friday in connection with an armed robbery and shooting outside an Atlant...","filename":"data/vaneerConsumption/17yearoldarrestedinshootingoutsideAtlantacountryclub.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/13/Videos/4438098.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_breaking-ye_6eaac93e42cd29f1eb978a1ce7d2a28f__1540932768.html","title":"17-year-old arrested in shooting outside Atlanta country club","title_page":"17-year-old arrested in shooting outside Atlanta country club","title_rss":"NULL","source_domain":"ajc.com","text":"A 17-year-old was arrested Friday in connection with an armed robbery and shooting outside an Atlanta country club, police said.\nJayden Myrick is charged with three counts of aggravated assault, one count of aggravated battery and one count of possession of a firearm during the commission of a felony.\nThe arrest comes two days after police released a surveillance video and sketch of the suspect they believed was linked to the shooting and increased the reward for information leading to his capture to $10,000.\nBut police said Friday they no longer believe the man in the video, who was connected to a carjacking in Forest Park, is Myrick.\nThe victim, Christian Broder, 34, was a wedding guest at Capital City Country Club on West Brookhaven Drive and Capital City Lane. He and three others were waiting for an Uber outside the club when a car pulled up and Myrick got out with a gun and demanded all of their possessions, police said.\nChristian Broder, the 34-year-old father and restaurant general manager, was shot in the stomach early Sunday outside a wedding reception at the Brookhaven Country Club (ABC Affiliate WJLA-TV)\nWhen Broder tried to negotiate, police said Myrick shot him in the stomach.\nMORE: Wedding guest shot while waiting for Uber outside country club, police say\nAccording to a GoFundMe page, Broder is in critical condition in the intensive care unit at Piedmont Hospital and has undergone multiple lifesaving operations.\nHe is the general manager of several Washington D.C.-area restaurants, including Millie’s, a well-known California Baja-style restaurant.\nInvestigators are still working to identify and arrest the driver of the car involved in the incident.\nMORE: Country club shooting victim ID’d as manager of several restaurants in D.C. area\nIn other news:","url":"https://www.ajc.com/news/crime--law/breaking-year-old-arrested-shooting-outside-atlanta-country-club/EcP0RIrBNPOMIZ14ulGV6L/"}
