{"authors":["Nicholas Gilbertson"],"date_download":"2018-10-30 21:38:43","date_modify":"2018-10-30 21:38:43","date_publish":"2016-06-02 20:38:36","description":"Former Secretary of State Hillary Clinton’s counsel and chief of staff Cheryl Mills replied at least 189 times with variations of \"I don't know\" or \"I don't recall\" during a deposition about the Clinton email scandal, a transcript of the deposition reviewed by Breitbart News shows. | Politics","filename":"data/vaneerConsumption/189TimesIn7HoursCherylMillsDidNotKnoworDidNotRecallAlmostEverythingAboutHillaryClintonEmailScandal.json","image_url":"https://media.breitbart.com/media/2016/02/cheryl-mills-hillary-clinton-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_06_02__1540935523.html","title":"189 Times In 7 Hours: Cheryl Mills Did Not Know or Did Not Recall Almost Everything About Hillary Clinton Email Scandal","title_page":"189 Times In 7 Hours: Cheryl Mills Did Not Know or Did Not Recall Almost Everything About Hillary Clinton Email Scandal | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Former Secretary of State Hillary Clinton’s counsel and chief of staff Cheryl Mills replied at least 189 times with variations of “I don’t know” or “I don’t recall” during a deposition about the Clinton email scandal, a transcript of the deposition reviewed by Breitbart News shows.\nThe deposition, conducted last week by government watchdog group Judicial Watch, lasted about seven hours. As such, Mills’ consistent failure to remember any significant details is worrying. This deposition came in a case separate from an FBI investigation into the homebrew email server system that Clinton created. As of now, there are at least 147 FBI agents investigating the Clinton email scandal.\nThis is not the first scandal Mills has found herself in with the Clintons. Mills has been closely involved with the Clintons since the 1990s, serving as former President Bill Clinton’s counsel during his impeachment proceedings over the Monica Lewinsky and Paula Jones scandals. Mills has been a central adviser to both Clintons throughout their time on the national political stage.\nBelow, Breitbart News has compiled a list of the 189 questions to which Mills replied with a form of not remembering or not knowing the answer.\n1. QUESTION: Sure. Do you remember providing testimony before Judge Lamberth in the Alexander case?\nANSWER: I don’t believe I’ve had occasion to meet Judge Lamberth, but that might be just inaccurate.\n2. Q. Well, I’m not asking general litigation. I’m asking actually in a case in which you provided testimony –with respect to requests for e-mails, and in that case there being an issue with the mail to server. And the capture–\nA. So I don’t remember the mail to server. I’m quite confident I should start with I had to provide a lot of different testimony during the time period when I served in the government. I’m happy to have my memory refreshed, if there’s something that could do that.\n3. Q. Okay. Did you have a lot of conversations with him?\nA. Not that I recall a lot of conversations 7 with Lou Lukens. I certainly did have conversations 8 with him.\n4. Q. Okay. Can you tell me what those were?\nA. No, I can’t recall them.\n5. Q. I don’t want every single — I don’t want you to describe every single conversation you had with him. But with respect to setting up the — making sure that everything is set up in the office.\nA. So it’s not my recollection that I was typically engaging with Lou Lukens on a lot of those matters.\n6. Q. Okay. How about devices to communicate via e-mail?\nA. MS. BERMAN [Department of Justice Attorney who was representing Mills in her official capacity as a former State Department official]: Objection. Vague. Whose devices?\n7. Q. Devices for you, for example, Ms. Mills.\nA. So I don’t know when conversations about our — my device would have occurred. But I would have imagined it would have occurred close in time to when we were onboarding.\n8. Q. Okay. Do you recall what the conversations were?\nA. No. I’m sorry. I mean, it’s just harder for me to — to actually remember conversations at the time. Probably just weren’t significant in my mind. …So I don’t have a memory of — now, sadly. Many years ago.\n9. Q. Okay. Did you ask for it [a BlackBerry from the State Department]?\nA. I don’t recall if I asked for it or not, but I know I received one.\n10. Q. Okay. And did you have a State Department e-mail when you came on board?\nA. I don’t know when they created my State Department e-mail, but I did have a State Department e-mail that I used when I was at the department.\n11. Q. Okay. With respect to your e-mail account from the State Department, do you remember if you had to make a request for that, or was that something just issued to you?\nA. I believe that was issued, but I could be wrong about that. So I don’t know. I don’t have a specific memory as to how it came about. But I believe it was issued.\n12. Q. So did you just assume that she was going to use the e-mail that she had before as Secretary of State?\nA. I don’t have a specific memory of the conversations that may or may not have occurred. I know that I understood she was going to be using her personal e-mail, and that’s what she did.\n13. Q. Do you recall her specific e-mail address?\nA. I don’t recall her specific e-mail account. It has her initials in it, and @Clintonemail.com.\n14. Q.How did — how did she communicate that to you?- That she got a new address?\nA. I don’t know that I have a specific recollection of a communication as much as I have an understanding that we needed to change the e-mail 18 address we were e-mailing her at.\n15. Q. Was there — was there an e-mail that went out within the Secretary’s office with respect to — to the change?\nA. I don’t remember that. There might have been. So I could be wrong, but I don’t remember that.\n16. Q. Well, during this time in March, did you have an assistant?\nA. So I don’t recall the assistant’s name at that time, and I apologize. But she was someone who had been provided by the department who was what we call an OMS. And she provided support largely through the first probably six, seven, eight months that I was there. So I don’t know that I can — but I apologize, I don’t remember her name. And not because she didn’t do a great job.\n17. Q. Did you communicate to her about the Secretary’s transition?\nA. I don’t know that I did or didn’t. Maybe some context would help.\n18 Q. Just so we’re clear that we’re speaking about the same e-mail address for Clintonemail.com, is that the e-mail address that the Secretary was using during her tenure, the HDR22@Clintonemail.com?”\nA. So I don’t know which of the two, because they both got assigned to the account. And so this might be a reflection of the timing of when materials were. But she typically used I thought HROD17.\n19. Q. And just — are you aware if the Secretary used any auto forward function?\nA. I don’t know.\n20. Q. Okay. And just going back to my previous question. And if you can refresh my recollection. Why do you remember that it was March when the — when the Secretary transitioned her e-mail?\nA. I don’t know that I can add more to what I’ve already said.\n21. Q. Why is it that you think the — Secretary Clinton started using the Clintonemail.com in March?\nA. don’t know that I could answer the question as to why she started using the Clinton e-mail in March. If you’re asking why I have a recollection of that being that time period — is that your question?\n22. Q. Okay. Is it because that’s when the Secretary said that she started using the e-mail in March?\nA. I don’t know that I can answer that question.\n23. Q.Was Ms. Abedin working at the State Department at this time, on January 30th, 2009?\nA. I believe she might have been. I don’t know that for sure. I don’t know what date is her official transition on date.\n24. Q. Okay. Do you recall the entire e-mail address before the at AT&T?\nA. I don’t. I saw the HR15, and that strikes me as probably accurate, but it was — I knew it was an at AT&T.\n25. Q. Ms. Mills, did you recall that it was March when Secretary Clinton transitioned to the Clintonemail.com because — or when you reviewed the e-mails that she was returning to the State Department?\nA. No.\n26. Q. You had that recollection before you reviewed e-mails that she was returning to the State Department?\nA. I ‘m trying to think about how to answer your question consistent with my obligations as — as counsel. But the answer is I did — I did not have that recollection based on materials returned to the department.\n27. Q. When did she ask you to undertake to assist her [as representation] in the matter?\nA. I don’t know that I have a specific date that she — that she did that, but it was post February of 2013.\n28. Q. Okay. The date of the e-mail is August 22nd. So is it fair, I mean, to say that you were contacted in July of 2014, at a minimum?\nA. So I don’t know how to — so my — my — my experience of my memory with respect to that time period was that there was a set of conversations around materials that were going to be provided to the Hill, and questions that they had with respect to media inquiries that they anticipated. And then subsequent to that there was communication with respect to the department potentially needing all of her dot gov e-mails. And in terms of timing of that, I believe that was sometime in the late summer. And I don’t know if my last month was accurate or not accurate. But that’s my best understanding.\n29. Q. Okay. And I’m not asking about what those discussions were, but I am asking you about that time frame. When — when did you learn that?\nA. I don’t know if I could tell you when I learned that. I know that — because, obviously, over the past now year and a half I’ve been stepping through that process. So I don’t know that I have a pinpoint moment where I could tell you where there was an aha or I know or I don’t know kind of moment.\n30. Q. Was it in 2014?\nA. I don’t know the answer to that question. Like, I don’t know if it was before or later. Like, I don’t know how to answer that question based on having a temporal understanding. But I know that I have had conversations with respect to the setup of her e-mail, and I’ve had those conversations over a period of time.\n31. Q. Who are they [attorneys that work at Williams & Connolly]?\nA. I don’t know that I could name the names.\n32. Q. I’m not asking for the entire firm directory.\nA. I know. But I’m being transparent with you. I don’t know that I can name. And I — that’s not a reflection — because most of my conversations with are David Kendall. But I know that there are other attorneys, obviously, there who work on matters that involve representing Secretary Clinton. And then there were obviously agents of her that I also engaged in conversation with.\n33. Q. Okay. Was he [Bryan Pagliano] working for the Clintons at the time that you spoke to him about the — about the setup of the server?\nA. Well, I don’t know how to answer your question because I don’t know the time period. And I know that — at least I have come to understand that he obviously did service the setup of her e-mail during the period where he was at the department.\n34. Q.Okay. Did he [Mr. Cooper, Bill Clinton’s senior adviser] set up or register the domain name for —?\nA. I don’t actually know who actually registered.\n35. Q. Did you have any discussions with Mr. Cooper, prior to you or Secretary Clinton leaving the State Department, about the setup of the server?\nA. I don’t recall any discussions about the setup of the server.\n36. Q. Did you ever discuss with him about the server itself?\nA. So I don’t have a technological background, so I’m confident I would have had conversations about the fact that she used an e-mail. But in terms of the technicalities of how it was managed, that’s not something that I had — or at least I don’t have any recollection of having conversations around that until the time period where I was representing Secretary Clinton with Mr. Cooper.\n37. Q. How about anybody at the State Department; did you speak with anybody at the State Department about the setup of the server?….After you left the State Department.\nA. I don’t recall having a conversation with anyone after she left the State Department about the setup of her server.\n38. Q. Okay. When did you first learn about Platte River Networks serving her server?\nA. I don’t know when I first learned about Platte River. I know that Platte River obviously transitioned her e-mail in 2013.\n39. Q. Did you have any discussions with them prior to leaving the State Department, when you were getting ready to leave the State Department?\nA. I don’t recall. I might have, but I don’t recall that.\n40. Q. Okay. When you spoke with Platte River Networks, did you learn about how the server was set up at that point?\nA. I don’t know the answer to your question. And — I don’t know the answer to your question.\n41. Q. Okay. Did you learn that Datto Network transitioned over e-mail from Secretary Clinton from Platte River Networks?\nA. I don’t know that to be the case.\n42. Q. Okay. Did you contact Datto, Inc., ever, or anybody from Datto, Inc.?\nA. Not to my recollection.\n43. Q. Okay. Is that a e-mail account that Ms. Abedin used while she was at the State Department — as far as you know?\nA. No, not to my knowledge.\n44. Q. Do you know whether Ms. Abedin had more than one e-mail account on the Clinton server?\nA. I don’t know.\n45. Q. Okay. Do you know how she [Abedin] was issued that e-mail address?\nA. I don’t know.\n46. Q. Do you know if she had to request an e-mail address for it to be issued?\nA. I don’t know.\n47. Q. I want to go back to when you started at the State Department. Was there a directory or something similar to a directory, with officials who worked within the Secretary’s office and their contact information, just for staff to be able to use if they needed to contact anybody?\nA. Not to my knowledge.\n48.Q. Okay. Do you know if Ms. Abedin had an assistant?\nA. I don’t know.\n49. Q. Do they [Hillary Clinton’s special assistants] ever e-mail her?\nA. I don’t know the answer to your question. But they frequently walked in and out of her office to engage with her, to provide her with materials.\n50. Q. Okay. And do you know how frequently they [Hillary Clinton and Abedin] e-mailed?\nA. I don’t.\n51. Q. Do you have any reason to dispute that of 8 the Secretary e-mails that she returned to the State Department, Ms. Abedin sent 3,000 — or Mrs. Clinton sent 3,490 e-mails to Mrs. Abedin and Ms. Abedin received 872 e-mails from Secretary Clinton?\nA. So I know that the Secretary returned over 30,000 e-mails. I don’t know the breakdown of that in terms of how they broke down by individual.\n52. Q. Okay. And do you know if Secretary Clinton e-mailed with Ms. Rice?\nA. I don’t know.\n53. Q. Okay. Why did Secretary Clinton e-mail Susan Rice?\nA. I don’t know why she chose to at that — on that — on that occasion to e-mail her.\n54. Q. Did Susan Rice request — make a request for Secretary Clinton’s e-mail account?\nA. I don’t know.\n55. Q. Okay. Do you know if Secretary Clinton requested directly to Secretary — I’m sorry, if Susan Rice made a request to Secretary Clinton for the Secretary’s e-mail address?\nA. I don’t know.\n56. Q. Okay. Did you provide Emanuel Rahm the Secretary’s e-mail address?\nA. I don’t know. I would hope I did, because I said I would. But I don’t have a recollection of it.\n57. Q. Okay. Did you know — I mean, did Secretary Clinton e-mail with John Kerry during her time at the State Department?\nA. She may very well — she very may well have. I don’t — I don’t know that I had a contemporaneous understanding of that.\n58. Q. Okay. How did Secretary Chu learn of 11 Mrs. Clinton’s e-mail address?\nA. I have no idea.\n59. Q. Okay. When did you begin using that e-mail address [CMills@HillaryClinton.com]?\nA. I don’t know.\n60. Q. Was it still active in July 9 of 2009?\nA. I actually don’t know. I didn’t have a strategy for accessing it, so I don’t know the answer to that question. It might have continued to have a life, but I didn’t access that e-mail.\n61. Q. Okay. Did he send you an e-mail to the HillaryClinton.com e-mail account before you responded on July 9, 2009?\nA. I just don’t know.\n62. Q. Okay. Next page, please, of the exhibit. Did Secretary Clinton e-mail with David Axelrod?\nA. I don’t know how frequently she e-mailed with David Axelrod. I know, based on this e-mail traffic, that I provided her with his address.\n63. Q. Okay. Who was David Axelrod at that time?\nA. I don’t know what role David Axelrod was serving in at that time.\n64. Q. Was he at the White House?\nA. So David Axelrod was both in the White House for a period of time during Secretary Clinton’s tenure and also not in the White House during a period of time. And I just don’t have enough facility in my mind to know which period this was in, even by looking at the dates. I just don’t remember if he came into the government first with the President and then left or if he came in later and then — because that’s the best of my recollection. But he did serve in government for a period of time.\n65. Q. Okay. What capacity did he serve in when he was at the White House?\nA. I don’t know what his — I don’t know what his title was or what his capacity was. I know that he served as someone who obviously was advising the White House, but I couldn’t tell you more than that.\n66. Q. Well, that e-mail, just to make sure we’re looking at the same thing, the last page, that’s actually not. Do you see that anywhere on the second to the last page?\nA. So I don’t know how records get produced. Because obviously these are records that have been produced — I’m not going to speculate where they came from. But I think part of the confusion, at least for me as I’m reading these, is they have a variety of different e-mail addresses that I don’t believe actually are reflective of the Secretary’s at that time. And I think it’s more a reflection of the time and when these got produced. And some of these are just aggregated. Because this second e-mail page is actually still in the same traffic. It starts with the same, For future reference, this is my — my Gmail. Thanks. And then she has the same thing, That’s all I have. And then it says, You’ve always e-mailed me on my State. And then it says, Weird, since my address book has your Gmail. Maybe the Chinese hacked it. And focuses on you. Which at least I interpret as a joke. And then it says, Even weirder. So I think of the weirder as after being weird. So I don’t know how these records were created or why they’re just aggregated in the way they are. But there is a set of things that for me make it difficult to understand the train and also the addressing on them. But at least if you were asking me, I would say that these were part of the same exchange.\n67. Q. Okay. Do you know how Secretary Clinton — or why she had Nora Toiv’s Gmail address?\nA. I don’t. Are we done with this exhibit?\n68. Q. Okay. And when she transitioned, did she — from her AT&T e-mail account, did she get a new BlackBerry?\nA. I don’t know the answer to that question.\n69. Q. Okay. Was Secretary Clinton ever issued a BlackBerry from the State Department so she could e-mail?\nA. Not to my knowledge.\n70. Q. Okay. How many BlackBerrys did she use?\nA. I don’t know.\n71. Q. Okay. How — what was set up for her to use there [office space outside of Secretary Clinton’s office]?\nA. I don’t know that I have a specific recollection other than, obviously, there was a phone there so that she could use a phone if she was.\n72. Okay. And did she go — did she use that office for e-mailing purposes?\nA. I don’t know. Because typically her way of engaging with folks was in meetings and was through phone calls. And so I don’t know how frequently she went out to go use that space.\n73. Q. Do you know why it [a separate network PC for Secretary Clinton] was never set up?\nA. I don’t know why it was not set up. I do know that she was not someone who used a computer. And so to the extent the objective was to place that computer there for her use, it would not have been used.\n74. Q Did you know Mr. Pagliano prior to him starting at the State Department?\nA. I don’t know that I can add to what I’ve already said on that one.\n75. Q. Does this help at all refresh your recollection whether Mr. Pagliano was hired as Schedule C?\nA. I don’t know if he ended up being hired as a Schedule C or not. I believed he was, but I don’t know that for sure.\n76. Q. What is IRM?\nA. I don’t know what IRM stands for. I know it’s the acronym that’s associated with the technology department at the State Department.\n77. Q. Okay. Is there a separate department that handles technology just for the Secretary’s office?\nA. Also I don’t know how to think about the divisions. I do know that there was a group called Poems that typically is who I called when I was an issue with respect to my e-mail or my devices. And so did other folks who were in the seventh floor, which would be the Secretary and extended senior leadership’s offices.\n78. Q. Okay. And do you know if — if he worked for IRM when he was hired?\nA. I believe that’s where he worked for, but I don’t know that for sure. I mean, I don’t know exactly where he was assigned, but I believe he was in IRM.\n79. Okay. These e-mails seem to be dated between February, March, 2009. Would it be long after these e-mails that he was hired?\nA. I don’t know.\n80. Q. Can you tell?\nA. I don’t know.\n81. Q. Do you know, was it typical for employees hired by the State Department to work for the IRM to be hired as Schedule C?\nA. I don’t know.\n82. Q. He didn’t have, though, any policy role in his work at the State Department.\nA. I don’t know that to be the case.\n83. Was Mr. Pagliano hired by the State Department in some capacity relating to policy for the State Department?\nA. I don’t know that — I don’t know that — I don’t know what the scope of his duties were and what he ultimately ended up handling at the State Department.\n84. Q. Okay. I thought you said that he was hired as a technician, or IT?\nA. That’s not my recollection. So if I stated that, I — I don’t know that I would have stated that he was a technician.\n85. Q. Or to provide technical support?\nA. No, I don’t know that. I think of him as someone who has an expertise with technology, and I know he was hired in the technology department.\n86. Q. Did Mr. Pagliano ever service Secretary Clinton’s server when he was at the State Department?\nA. I don’t know that I had contemporaneous knowledge of that\n87. Q. Okay. Can you tell me what — what those interactions [with Pagliano] were about?\nA. So I don’t know that I have a lot of recollections, but I would meet with him from time to time. I don’t know that I could tell you what the different issues might be about\n88. Q. Okay. Do you know if they engaged with respect to issues or problems related to the Secretary’s e-mail?\nA. I don’t know.\n89. Q. Did Mr. Pagliano often interact with the Secretary?\nA. In my presence, I don’t recall occasions where he interacted with the Secretary.\n90. Q. How about with anybody within the Secretary’s office?\nA. In my presence, I don’t recall him engaging with folks in the Secretary’s office.\n91. Q. Okay. There were times when the Secretary’s e-mail didn’t work, or she was having issues with people receiving her e-mails, and that sort of thing. Do you recall that?\nA. I don’t recall that.\n92. Q. You don’t recall that at all?\nA. I don’t.\n93. Q. Okay. I guess just pointing your direction towards the last two pages of the exhibit. The e-mails between Ms. Abedin and Secretary Clinton, where she’s talking about, Means your e-mail must be back. It seems that there was — that Secretary Clinton was having issues with her e-mails being delivered.\nA. So I don’t have a recollection of this. I don’t have a recollection of this time period or set of exchanges.\n94. Q. Okay. Did Mr. Pagliano address the issue with her e-mail being down during Sandy?\nA. I actually don’t know.\n95. Q. During that time?\nA. I don’t know. He might have.\n96. Q. Okay. So who did the Secretary go to when her e-mail was down?\nA. I don’t know.\n97. Q. Her e-mail was down?\nA. I don’t know the answer to that question as to who she would reach to. But I — but she didn’t reach to me.\n98. Q. Okay. Was it any of the assistants in the Secretary’s office?\nA. So I — I don’t know — I don’t know the answer. I don’t know that I can help you any more than that. I don’t know who she would reach to for that.\n99. Q. Do you know how it was resolved?\nA. I don’t know how it was resolved.\n100. Q. Do you know who may know?\nA. I don’t have a recollection of it. And I apologize, but I — I just don’t. And I know that, certainly given the limits of my own technical capacity, that I was probably not high on the list of people to reach to.\n101. Q. When the Secretary was having the e-mail issue, let’s just say, for — during Hurricane Sandy, does she discuss that with Huma Abedin?\nA. I don’t know. She might.\n102. Q. You don’t — you’re not aware of any of those discussions?\nA. I don’t have a recollection of those discussions. That’s not to say it didn’t happen; I just don’t remember.\n103. Q. Do you recall Ms. Abedin complaining about her e-mail not working during that time?\nA. I don’t know if I have a particular recollection of her complaining about that. I think at that time period everybody’s e-mail was affected. I mean, it was kind of a — if you were on the East Coast, everybody’s e-mail was affected. So I don’t know if I have a particular paradigm for her saying —that.\n104. Q. Did Ms. Abedin do anything as a result to try to get the issue resolved with the Clinton e-mail during Hurricane Sandy?\nA. I don’t know.\n105. Q. You said your e-mail was down during Hurricane Sandy?\nA. No. I said there were a lot of folks that were down. I can’t remember if the department’s were down during that time period or not. We might have been. I just don’t remember.\n106. Q. And the first two pages, they’re just some test e-mails. Or the second page of the exhibit, you sent a test e-mail to Secretary Clinton?\nA. Yeah. I don’t remember that.\n107. Q. You don’t know why you would have sent her a test e-mail?\nA. I don’t, actually.\n108. Q. Okay.\nA. It’s just that I don’t remember it. I’m not — that’s all.\n109. Q. Okay. Do you remember ever sending her test e-mails because she was having issues receiving e-mails?\nA. No. That’s why it’s odd to me. Obviously I sent her an e-mail that says Test, but I don’t have a recollection of it.\n110. Q. Okay. And the question is in the context of Mrs. Clinton’s e-mail being down.\nA. I don’t know if Mrs. Clinton’s e-mail was down, or Secretary Clinton’s e-mail was down on these occasions. I just know that there’s a test being sent. So I don’t know why.\n111. Q. When were those discussions [About Clinton having a state.gov account]?\nA. Oh, I don’t know that. I don’t have a recollection of that. But there absolutely might have been discussions about whether or not she would or wouldn’t. I know — certainly know when I first came in, one of the questions that we were stepping through was getting her a BlackBerry. And that BlackBerry would have been a State account. And so ultimately what the department indicated was that she couldn’t use a BlackBerry, whether or not it was State or not, inside the SCIF. And so she ultimately didn’t end up then getting a State BlackBerry.\n112. Q. Okay. Do you recall discussions about her obtaining a State e-mail after the initial discussions about her being able to use the BlackBerry in the SCIF?\nA. I don’t recall, but I’m happy to have my memory refreshed.\n113. Q. Separately we are working to provide the Secretary per her request a department-issued BlackBerry to replace her personal unit.” Do you recall discussing that with Stephen Mull?\nA. I do not.\n114. Q. You don’t have any recollection with respect to any discussions in this time frame, 2011?\nA. I don’t have a recollection in this time frame of discussion with respect to issuing her a BlackBerry.\n115. Q. Did you discuss with Stephen Mull at any point with respect to Secretary Clinton’s use of e-mail and FOIA?\nA. I don’t recall having a conversation with him with respect to her use in e-mail and FOIA.\n116. Q. Okay. Do you recall this e-mail exchange between you and Stephen Mull?\nA. I don’t know that I recall this e-mail exchange. I recall that there were discussions that I would have had about the fact that her secure calls and nonsecure calls and the comms equipment that was with her was not working, and that was a persistent challenge throughout her tenure as Secretary.\n117. Q. Okay. Did Monica discuss the details discussed in this e-mail with Steve Mull — as far as you know?\nA. I don’t know.\n118. Q. Everything I’m asking here is just based on your knowledge.\nA. Okay. So I don’t have a recollection of whether or not Monica did or didn’t, to my knowledge.\n119. Q. And then — well, did you discuss — did you discuss the possibility of having a State-Department-issued BlackBerry that’s referenced in the second part of this e-mail?\nA. I don’t recall that I did. I recall that my concerns or considerations that got prompted was the persistent challenge she was having with respect to her calls being handled and managed.\n120. Q. What I was asking about earlier with respect to the State Department BlackBerry, the possibility of that being issued?\nA. I may have. I don’t — I don’t know. I don’t have a recollection of that.\n121. Q. Do you know why she thought — why Ms. Abedin thought it [a state BlackBerry] didn’t make a whole lot of sense?\nA. I don’t know what — why Huma thought what she thought.\n122. Q. Did you discuss with Ms. Abedin why she thought it didn’t make a whole lot of sense?\nA. I don’t recall whether or not I did or didn’t. I might have. I don’t recall.\n123. Q. Did — at any point did you discuss with Ms. Abedin or anybody within the Secretary’s office the Secretary’s e-mail, and that being subject to FOIA?\nA. I don’t have a recollection of having a discussion with somebody in the Secretary’s office and her e-mail being subject to FOIA. It was my impression it was.\n124. Q. When FOIA requests came implicate — to the Secretary’s office implicating the Secretary’s e-mails, how did the office go about searching the Secretary’s e-mail to respond to FOIA?\nA. So I don’t know how the Executive Secretary or the special assistant staff would have undertaken to look for the responsive records, but — so I don’t have an answer for that question, although I’m assuming that they would undertake that process.\n125. Q. Okay. So the Executive Secretariat’s office who manage the records, let’s say with the FOIA requests that implicated the Secretary’s e-mail, how did they go about searching for the Secretary’s e-mails in response to a FOIA request —for her email?\nA. So II don’t know- I don’t know what their process was for how they went about that. Yeah. I don’t.\n126. Q. And what about if the subject matter contained communications between the Secretary and others outside of the State Department?\nA. So I don’t know what would have been their process for how they would have captured that. And I think that’s one of the things that is a challenge and one of the things that I think as the Secretary has spoken about, it would have been smarter for her to have had or better for her to have had an account. And if she had it to do over again, she would.\n127. Q. Did you or anybody inform anybody within the Executive Secretariat’s office that Secretary Clinton’s account was not captured on the State Department’s system?\nA. So I don’t have a recollection, with respect to FOIA, of making that type of an affirmative engagement. Because Secretary Clinton e-mailed relatively a wide swath of folks, more than a hundred, certainly, in the department. And so her use of her e-mail was not something that was unknown.\n128. Q. Okay. But I guess my question is different. My question is whether you or anybody within the Secretary’s office informed the Executive Secretariat, when they were doing their searches to respond to FOIA requests implicating the Secretary’s e-mails — that the Secretary’s account was not on the State.gov e-mail system?\nA. I don’t recall having a conversation about her account not being on the State.gov system. I would also be surprised that they would be unaware that it was not on the State.gov system. The Secretary e-mailed with, as you indicated, a number of folks in the State Department, and her immediate staff was aware of her e-mailing with folks in the department because she typically e-mailed with people on their State accounts.\n129. Q. Okay. So just so I understand, the process when you received a FOIA request that related to your e-mails, you or somebody searched your e-mail account to respond to the FOIA request. But that wasn’t done for purposes of responding to FOIA requests relating to the Secretary’s e-mail account.\nA. I don’t know that.\n130. Q. Okay. What about Ms. Abedin, if there was a request with respect to records related to her e-mails?\nA. I don’t know how they would have 15 undertaken that with her.\n131. Do you know if the ones that were printed, 8 were they retained and saved within the Secretary’s office?\nA. I don’t know the answer to that question.\n132. Okay. So did you step through differently when you had a FOIA request relating to Benghazi as opposed to other document requests related to Benghazi?\nA. I don’t recall having a FOIA request related to Benghazi that I was stepping through while I was there.\n133. Ms. Mills, did you communicate with the Secretary about the Benghazi attacks by e-mail?\nA. I may have. I don’t recall. Because in realtime obviously her office is about, happily or sadly, five to seven feet from mine. And so given the sets of events that were happening in that time period, there was a lot of, obviously, direct communication.\n134. Q. Okay. Did you communicate with Ms. Abedin about the Benghazi attacks via e-mail?\nA. I absolutely might have. I don’t have a recollection of doing that, but I might have.\n135. Okay. Did everybody in the State Department — I mean in the Secretary’s office do that with respect to the document requests that came in from Congress — related to the Benghazi attacks?\nA. I don’t know the answer to your question. I would imagine that they would have. But if you’re asking me, I don’t know.\n136. Who would know why there was a different process for searching the Secretary’s e-mail account, as opposed to your e-mail account?\nA. I don’t know the answer to your question, is maybe the best way to answer that. I know that if there was a FOIA request, it came in through one process. I can only speak to what came to me.\n137. Thank you. Ms. Abedin’s e-mail. Was her e-mail account searched by anybody within the Secretary’s office?\nA. I don’t know.\n138. Q. What about the Secretary? What about Secretary Clinton; was her e-mail account ever searched in response to — in response to a FOIA request?\nA. I don’t know the answer to that question.\n139. Q. With respect to Jacob Sullivan and FOIA requests implicating his e-mail, how — what was the process for searching his e-mails?\nA. I don’t know the answer to that question.\n140. Q. With respect to FOIA requests that came in to the Secretary’s office, how were any of their e-mail accounts searched?\nA. I don’t know how their e-mails were searched.\n141 Q. Have you seen this document [letter from Senator Grassley to Secretary Kerry] before?\nA. I don’t know if I’ve seen this document, but I’ve seen references to this document before.\n142. Q. Okay. Do you recall a FOIA request that came in from CREW that’s discussed in this document?\nA. I don’t recall the specific FOIA request in terms of what was in the request. But I’ve obviously seen references to this in the media since then.\n143. Q. Do you recall a FOIA request that came in relating to — when you were at the State Department, of course, relating to the e-mail accounts used by Secretary Clinton and records that would provide for what the e-mail address was?\nA. I don’t have a specific recollection of it. But I certainly have read in the media exactly what is in here. And so while it doesn’t necessarily refresh my recollection, I do know that this — obviously this matter took place.\n144. Q. Okay. Do you recall or did Brock Johnson bring this FOIA request to your attention?\nA. I don’t have a specific memory of that.\n145. Q. Did you ever — or did you speak with Heather Samuelson regarding the CREW request?\nA. I don’t have a memory of that.\n146. Q. Okay. So is it fair to say that the discussions you had with Ms. Samuelson would have been after the [OIG’s] report came out?\nA. I — I don’t know if that’s fair to say. I don’t have a recollection. But I know I did have a conversation with her, and my conversation was does she remember this set of events with respect to it coming in. I don’t know if it’s fair to say if it was before or after. I can make that assumption, but I don’t know.\n147. Q. Okay. But you don’t remember what she told you with respect to whether she remembers it or not?\nA. I don’t believe she did remember it, but I don’t know that.\n148. Q. So, Ms. Mills, as we sit here today, you don’t have a recollection whether, with respect to the CREW FOIA request, whether you transmitted it to Ms. Samuelson, instructing her to make queries about the status of the State Department’s response to that FOIA request?\nA. I don’t have a recollection of that, correct.\n149. Q. Okay. For FOIA requests that came to the Secretary’s office, do you know if there was a specific office within the Secretary’s office that would respond to FOIA requests?\nA. I don’t know that.\n150. Q. Okay. Do you have — did you engage with him [Clarence Finney] in conversation or any communications with respect to any FOIA requests that came during your time there?\nA. I don’t recall doing so.\n151. Q. Do you recall if he engaged with anybody else within — or did he ever engage with Ms. Abedin with respect to FOIA requests?\nA. I don’t know.\n152. Q. Do you know who Mr. Finney reported to?\nA. I don’t.\n153. Q. Did you ever inform Mr. Finney about the Clinton e-mail account during your time there, with respect to FOIA requests?\nA. I don’t have a recollection of doing so.\n154. Q. Do you know if he was aware of Secretary’s use of the Clinton e-mail for government business?\nA. I don’t know.\n155. Q. Who is John Bentel?\nA. I don’t believe I know John Bentel.\n156. Q. Do you know of Mr. Bentel?\nA. So I might have read about him in the newspaper, but I don’t believe I know John Bentel, and I don’t know if I can tell you more than that.\n157. Okay. Did you ever engage in any communications while you were at the State Department with Mr. Bentel?\nA. I don’t recall having a conversation with him, but I might have.\n158. Q. Did he have any role in — with respect to setting up the Clinton e-mail server?\nA. I don’t know.\n159. Q. Was he told by anyone that the server, the Clinton server, or Mrs. Clinton’s personal e-mail system, was approved by legal at the State Department?\nA. I don’t know.\n160. Q. Do you know if he ever — or did he ever respond to any concerns that was raised by staff at the State Department with respect to Secretary Clinton’s e-mail account and the ability of searching that account in response to FOIA requests?\nA. I don’t know.\n161. Q. Now I want to talk about the planning and transition to depart from the State Department with respect to Secretary Clinton. Was there any planning with respect — in the context of her departure, with respect to saving her e-mails that she communicated while she was at the State Department?\nA. So I don’t know the answer to the question from my perspective.\n162. Do you know who, if anybody else, did?\nA. I don’t know what others might have done in that regard.\n163. Q. Were there any preparations with respect to making sure that her e-mails were retained by the State Department before she left?\nA. I don’t know. I don’t know of any from my perspective.\n164. Q. Did you have any discussions with the Secretary prior to leaving about the e-mails that were stored on her Clintonemail.com account to make sure that those would be available for Secretary Kerry coming in?\nA. I don’t recall having those discussions. And, you know, I can only speak to what I can recall.\n165. Q. Okay. And John Bass, when you were leaving, what did his office do with respect to the Secretary’s federal records that were in paper form?\nA. I don’t know the answer to your question.\n166. Q. Do you know if he did anything with respect to saving Secretary Clinton’s e-mails from her time at the State Department so they could be records managed after she left the State Department?\nA. I don’t know.\n167. Q. Did you have any discussions with Patrick Kennedy during the transition period, transitioning out of the State Department, with respect to what would happen to Secretary Clinton’s e-mails that were on her — stored on her account?\nA. I don’t recall having such discussions.\n168. Q. Did he do anything to make sure that the Secretary’s e-mails would be saved for records management for purpose of the State Department — by the State Department prior to her leaving?\nA. I don’t know.\n169. Q. Did he address that with anybody from your office?\nA. I don’t know.\n170. Q. Do you know if he had any discussions about that with the Secretary prior to her leaving?\nA. I don’t know.\n171. Q. Did you and the Secretary have any discussions with respect to inventorying or identifying federal records from her e-mails?\nA. I don’t recall having those kinds of discussions.\n172. Q. Okay. The question is, did you have any discussions about inventorying or identifying federal records amongst Secretary Clinton’s e-mails?\nA. I don’t recall having those — discussions.\n173. Q. Were there any discussions that you had prior to leaving with respect to how the State Department was going to access Secretary Clinton’s e-mails on her Clintonemail.com server — in response to — well for government business?\nA. I don’t recall having discussions about how someone might access her e-mail apart from what was already in the State Department system. So I don’t — I wish I did.\n174. Q. So are you aware of Secretary Clinton 2 deleting any federal records that were on her e-mail account when she was the Secretary?\nA. I don’t know if she did or she didn’t.\n175. Q. Okay. The federal records that she provided last year, did you have any discussion when you were at State with respect to preserving those e-mails and not deleting them while she was head of the agency?\nA. I don’t recall having a question — I mean having a conversation like that.\n176. Q. So did you have any discussions with Secretary Clinton with respect to her e-mails being saved, her federal e-mail records being saved, on other people’s State.gov e-mail accounts?\nA. I don’t recall whether or not I had a conversation or not.\n177. Q. Do you know if anybody did have such a conversation with the Secretary?\nA. I don’t know.\n178. Q. Did you have any such discussions with anybody other than the Secretary?\nA. I don’t know. I might have. I don’t know.\n179. Did you ever discuss with her with respect to whether she could delete them or not?\nA. I don’t recall having a conversation like that.\n180. Did you ever have any such discussions with anybody other than the Secretary?\nA. I don’t recall having such discussions.\n181. Q. And when did you become aware — when did you first learn of this lawsuit?\nA. I actually don’t know when I first learned of it. So I actually don’t know. And I don’t know when you all first filed.\n182. Q. Okay. With respect to the search of Secretary Clinton’s records, you were involved in that. Right?\nA. I don’t know what you mean by “search.”\n183. Q. How about with respect to that were documents on — that were perhaps politically sensitive or shedding the Secretary in a negative light?\nA. I don’t know how to answer your question.\n184. Q. Okay. And when that happened, did you at any time inform them with respect to Secretary Clinton’s e-mail account and that her e-mails were stored on her account?\nA. I don’t recall doing that.\n185. Q. Did you receive any training regarding FOIA when you came to the State Department?\nA. Not that I recall.\n186 Q. How about any training with respect to preserving federal records and records management of your e-mails?\nA. Not that I recall.\n187. Q. Did you learn that [the server was preexisting] from Mr. Pagliano?\nA. I don’t know that I did learn that from Mr. Pagliano.\n188. Q. Do you recall how you learned that information?\nA. I don’t. Only because my representation of Secretary Clinton started after I left the department, and there might have been any number of ways in which I came to have that information.\n189. Q. But you never discussed records management with the Secretary, with respect to her e-mail account at the State Department?\nA. I don’t know that there’s more that I can add to what I’ve already said today.","url":"https://www.breitbart.com/politics/2016/06/02/189-times-in-7-hours-cheryl-mills-did-not-know-or-did-not-recall-almost-everything-about-hillary-clinton-email-scandal/"}
