{"authors":["Michelle Moons"],"date_download":"2018-10-30 17:58:53","date_modify":"2018-10-30 17:58:53","date_publish":"2016-05-19 07:01:50","description":"Voters in California will face a tidal wave of ballot measures in the November general election, on a wide range of issues.","filename":"data/vaneerConsumption/18BallotMeasuresLikelytoFaceCaliforniaVotersInNovember.json","image_url":"https://media.breitbart.com/media/2016/05/California-ballot-Dawn-Endico-Flickr-CC.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_05_19__1540922333.html","title":"18 Ballot Measures Likely to Face California Voters In November","title_page":"18 Ballot Measures Likely to Face California Voters In November","title_rss":"NULL","source_domain":"breitbart.com","text":"Voters in California will face a tidal wave of ballot measures in the November general election, on issues from the death penalty and condoms to marijuana and plastic bags.\nThe end of June marks a milestone, determining which ballot measures will actually make the cutoff for the November 8, 2016 general election ballot. The Los Angeles Times reported that a daunting 18 ballot measures are likely to qualify statewide.\nWhile seven of the measures have already made the cut, according to the Times report, they could still be pulled pursuant a 2014 change to the initiative process.\nGov. Jerry Brown is spearheading an effort to loosen prison release and juvenile justice laws. If his measure passes, inmates convicted of nonviolent offenses could earn credits toward early release.\nLt. Gov. Gavin Newsom is pressing for multiple ballot measures, including measures on gun control and marijuana legalization. Newsom is also campaigning to take over for Gov. Brown in the 2018 election.\nNewsom’s 2016 ballot shot at guns would require background checks for ammunition purchases. California Senate President Pro Tem Kevin de León (D-Los Angeles) would prefer to push a similar restriction through the legislature. (De León hopes that Newsom will set aside the ballot initiative if the ammunition control legislation makes progress by June.)\nA tobacco tax could slap smokers with an additional $2-per-pack cigarette cost. The measure’s backers claimed on Monday that they have turned in enough signatures to put their tax on the ballot. Billionaire political activist Tom Steyer bills the measure as an effort to make smokers pay “their fair share,” according to the Associated Press. Steyer has loaded the campaign with $1 million of his own money. Newsom also supports this measure, according to the Times report.\nOne measure put forth by the legislature and pushed by Senator Ricardo Lara (D-Bell Gardens) is a measure that would repeal 1998’s Proposition 227, which put restrictions on bilingual education in favor of Wnglish. The California legislature’s Latino Caucus vowed in 2014 to prioritize a push for bilingual education in California schools, as well as affirmative action.\nThe California Supreme Court decided in January to allow a measure that would advise Congress to overturn the landmark 2010 Citizens United ruling. This measure first made an appearance on the November 2014 ballot, but was removed the August before the vote because it is merely advisory, and there were concerns that such measures could allow the initiative process to be abused merely to drive partisan voter turnout.\nChristina Uribe, state director of the progressive Ballot Initiative Strategy Center, told the Times that the volume of ballot measure could be problematic, as confused or uninformed voters are likely to skip the initiatives on the ballot or simply vote no.\nCompeting measures on the death penalty ask voters to decide whether to end the death penalty in California or expedite the legal processing of death penalty cases and require death penalty inmates to work. The California Republican Party has taken a position of support for the measure to expedite death penalty appeals.\nThe California GOP also took a position in early May against an initiative to mandate the use of condoms in pornography. Los Angeles has required the practice since this year, pursuant a L.A. County ballot measure passed several years ago.\nMinimum wage is up for debate again, with a measure that would increase the rate to $15 per hour, taking effect by 2021.\nBallotpedia details aspects of a Medi-Cal hospital reimbursement initiative that would require voter approval for changes to the state’s 2009 hospital fee program. The website states that the program has been criticized over diverting Medicaid matching funds to the state’s general fund.\nCalifornia voters will also be afforded reject a legislative ban on single-use plastic bags and fees on paper bags at grocery stores. Those opposed to thebag ban and fee would vote no to overturn the legislation.\nTwo measures deal with added debt. One would require a public vote on projects that exceed $2 billion and use bonds for funding. Another, with a “yes” vote, would authorize $9 billion in state-issued bonds, a large portion of which is proposed as construction funding for schools through the community college level.\nDrugs purchased directly or indirectly by the state would be limited under a measure that would limit the price any state agency could pay. Allowable prescription drug prices would be tied to the prices paid by the U.S. Department of Veterans Affairs.\nSEIU-United Healthcare Workers West backs a proposed initiative that would restrict salaries and severance packages to health care “executives, managers, and administrators.” The California Hospital Association opposes the measure.\nLegislative bills would be required to be posted on the Internet for at least 72 hours, with an emergency exception, under an initiative that would also require the “Legislature to make audiovisual recordings of all its proceedings, except closed session proceedings, and post them on the Internet.”\nThe personal income tax increase known as Proposition 30, originally sold as “temporary,” would be extended through 2030 under one ballot measure.\nOver 100 ballot initiatives had been proposed and filed as of February, according to Ballotpedia. Based on votes cast in the most recent gubernatorial election, signature requirements for 2016 measures are 585,407 for constitutional amendments and 365,880 for statutes and veto referenda.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2016/05/19/18-ballot-measures-likely-face-california-voters-november/"}
