{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:14:33","date_modify":"2018-10-30 22:14:33","date_publish":"2018-08-02 01:07:51","description":"With 3D gun files and the \"ghost gun\" being the topic of the day, it only seemed fitting to do a long-term review on a 1911 made at home.","filename":"data/vaneerConsumption/1911GhostGun.json","image_url":"https://media.breitbart.com/media/2018/08/awr-breitbart-1911-ghost-gun-review-instagram.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2018_08_01__1540937673.html","title":"1911 'Ghost Gun'","title_page":"Long-Term Review: 1911 'Ghost Gun'","title_rss":"NULL","source_domain":"breitbart.com","text":"With 3D gun files and “ghost guns” being the topic of the day, it only seemed fitting to do a long-term review on a 1911 made at home with a CNC machined frame and a parts kit.\nBreitbart News first reported on this particular gun on January 17, 2018, citing the cost of the gun as $1,800 to $2,000. The current cost would closer to $2,500-$2,800.\nOur 1911 was made via a Defense Distributed Ghost Gunner 2 CNC machine and a Metro Arms Parts Kit.\nThe Ghost Gunner 2 is $2,000, the 1911 parts kit is $450, and the cost for an 80 percent 1911 frame is roughly $200.\nThe very mention of the phrase “ghost gun” drives the left crazy:\nGhost Gun? @awr_breitbart A post shared by Breitbart (@wearebreitbart) on Jan 17, 2018 at 11:06am PST\nThe 1911 we built shoots and operates just as any store bought 1911. The big difference — no serial number, no government paperwork. In fact, the only writing on the entire gun is the .45 caliber designation on the barrel.\nWe have used approximately 500 rounds with the pistol, and it functions without fail. We shot it most recently on August 1, 2018:\nCody Wilson, owner of Defense Distributed, won a suit against the State Department since our first review of the 1911 “ghost gun” and is now fighting to be able to share plans for 3D gun print files online. His Ghost Gunner 1 and 2 are available apart from the suit via ghostgunner.net.\nAWR Hawkins is an award-winning Second Amendment columnist for Breitbart News, the host of the Breitbart podcast Bullets with AWR Hawkins, and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange.","url":"https://www.breitbart.com/sports/2018/08/01/long-term-review-1911-ghost-gun/"}
