{"authors":["Associated Press"],"date_download":"2018-10-22 20:55:57","date_modify":"2018-10-22 20:55:57","date_publish":"2016-01-28 05:12:04","description":"SAN DIEGO (AP) — Nineteen people from four states were arrested Wednesday in connection with an international drug trafficking and illegal gambling ring that...","filename":"data/vaneerConsumption/19arrestedinconnectionwithdruggamblingring.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420335_19-arrested-connection-drug-gambling-ring_1540241757.html","title":"19 arrested in connection with drug, gambling ring","title_page":"19 arrested in connection with drug, gambling ring | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"19 arrested in connection with drug, gambling ring\nSAN DIEGO (AP) — Nineteen people from four states were arrested Wednesday in connection with an international drug trafficking and illegal gambling ring that authorities allege was headed by a former college athlete.\nArrests were made in Southern California, Sacramento, Phoenix, Louisiana and Virginia, the U.S. attorney's office said.\nTwo other people were previously arrested, including Owen Hanson, who played football and volleyball at the University of Southern California more than a decade ago. Hanson was a walk-on tight end and not a major player for the Trojan football team. He was arrested in September on a San Diego-area golf course.\nThey are among nearly two dozen people indicted this month in San Diego.\nThe federal indictment, unsealed Wednesday, alleges that Hanson ran an organization known as \"ODOG\" that sold drugs from heroin to meth, laundered millions of dollars through shell companies, operated illegal sports gambling websites, ran a network of bookies, and strong-armed debtors.\nFederal authorities allege that the organization used violent threats against its debtors, including sending a DVD of a beheading and pictures of a family gravestone to one man who owed them $2 million.\nOperations allegedly were also conducted in the Mexico, Peru and Australia.","url":"https://www.dailymail.co.uk/wires/ap/article-3420335/19-arrested-connection-drug-gambling-ring.html"}
