{"authors":["Caitlyn Callegari"],"date_download":"2018-10-30 22:31:18","date_modify":"2018-10-30 22:31:18","date_publish":"2014-08-15 14:34:20","description":"I can almost hear Owen Wilson and Vince Vaughn off in the distance, chanting, \"It's Duggar wedding season!\" But, to their utter dismay, none of that hanky panky nonsense would be allowed at any of the 19 Kids and Counting nuptials because Jim Bob…","filename":"data/vaneerConsumption/19KidsCountingsJessaDuggarIsEngagedSoBringontheSideHugs.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/31359386-b10c-4ace-b628-ec250eadfa14.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35900-19-kids-countings-jessa-duggar-is-engaged-so-bring-on-the-side-hugs_1540938678.html","title":"'19 Kids & Counting's Jessa Duggar Is Engaged So Bring on the Side-Hugs","title_page":"'19 Kids & Counting's Jessa Duggar Is Engaged So Bring on the Side-Hugs","title_rss":"NULL","source_domain":"bustle.com","text":"I can almost hear Owen Wilson and Vince Vaughn off in the distance, chanting, \"It's Duggar wedding season!\" But, to their utter dismay, none of that hanky panky nonsense would be allowed at any of the 19 Kids and Counting nuptials because Jim Bob and Michelle Duggar have a tight watch over their brood. Anyhow, back to the news that could quite possibly make this the most exciting year for the family yet. Well, if you don't count all those babies and grandbabies being born, but that's probably commonplace in the Duggar household by now. What's really exciting is that Jessa Duggar is engaged!\nIf you've been keeping up with the Duggars, rather than the Kardashians, you know that Jill Duggar was just married in June to husband Derick Dillard. But now it's younger sister Jessa's turn to take the plunge because she and her beau (boyfriend? special person? sweetheart? side-hugger?) Ben Seewald, have turned their courtship into something more permanent. The smitten and sometimes camera-shy teen was just asked for her hand in marriage. Us Weekly relayed Jessa's excitable statement on her engagement, with her exclaiming, \"God has written an amazing story through our courtship, and another chapter has just begun! We are thrilled to see what the future holds — especially the wedding bells!\"\nHard to believe that after watching the Duggar children grow up the past six years, three of them will now be married with families of their own. Where has the time gone?! With only 16 out of the 19 kids left at home, could we possibly witness Jim Bob and Michelle facing empty nest syndrome next season? Or is it perhaps a nice reprieve for the likes of Grandma Duggar who'll now have to do three less loads of laundry every week? I'm thinking that they'll adjust just fine. After all, the Duggars are a close unit and they've got a show to film!\nImages: TLC; Giphy","url":"https://www.bustle.com/articles/35900-19-kids-countings-jessa-duggar-is-engaged-so-bring-on-the-side-hugs"}
