{"authors":["Sean Poulter","Consumer Affairs Editor For The Daily Mail"],"date_download":"2018-10-22 21:13:57","date_modify":"2018-10-22 21:13:57","date_publish":"2017-03-16 00:58:58","description":"The floating hotels appear to have benefited from the fact British and Irish travellers turned away from hotspots such as Tunisia, Turkey and Egypt because of safety fears.","filename":"data/vaneerConsumption/19mBritishandIrishtravellerstookacruiselastyear.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/3E4FE27A00000578-0-image-a-20_1489624570401.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318450_Record-1-9million-cruise_1540242837.html","title":"1.9m British and Irish travellers took a cruise last year","title_page":"1.9m British and Irish travellers took a cruise last year | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A record 1.9million British and Irish travellers took an ocean cruise last year.\nThe floating hotels appear to have benefited from the fact people turned away from hotspots such as Tunisia, Turkey and Egypt because of safety fears.\nThe figures come from the industry trade body, Cruise Lines International Association (CLIA), which expects a further demand for holidays on the ocean wave.\nJust this week details emerged of the new luxury liner, The Celebrity Edge, which has been described as the most extravagant ever.\nMediterranean fly-cruises remain the number one choice with 458,000 passengers in 2016\nNot only will it feature a rooftop garden, penthouse suites and even cashmere mattresses, it will also have a ship climbing magic carpet platform.\nThe platform, the size of a tennis court, will hang off the side of the ship and scale up and down the 16 decks through the day and evening.\nDesigner on the project include Kelly Hoppen, formerly of Dragons’ Den, and the British architect Tom Wright, who helped design the Burj Al Arab hotel in Dubai.\nThe ship is a sign of things to come and will make her first voyage in December 2018 when she sets sail from Fort Lauderdale in Florida for the Caribbean.\nThe CLIA said: ‘This growth comes at a time of sustained investment by the cruise industry.\n‘With global cruise fleet capacity set to increase by at least a third over the next ten years, major source markets such as the UK and Ireland will be spoilt for choice.\n‘As our love affair with the traditional Mediterranean holiday continues to go from strength to strength, the cruise sector is reaping the benefits as holidaymakers make the most of being able to visit multiple European hot spots in one cruise holiday.’\nThe floating hotels appear to have benefited from the fact people turned away from hotspots such as Tunisia, Turkey and Egypt because of safety fears (stock image)\nMediterranean fly-cruises remain the number one choice with 458,000 passengers in 2016. Western Europe itineraries from UK ports were taken by some 272,000 people.\nThe CLIA said: ‘2016 was also a great year when it came to ultra-luxury cruises, with both a host of new ships being launched in the sector, and a record number of passengers opting to sail with one of the ultra-luxury brands.\n‘A near nine per cent rise in sales ensured that the total surpassed the 2012 peak of 28,450 and fell just short of 29,000. A sure sign that the incredible five and six star experiences offered by these cruise lines continue to exceed expectations.’\nUK cruise departures now accounting for 48per cent of the market. Boarding a ship has the advantage of avoiding the queues and delays of getting through an airport.","url":"https://www.dailymail.co.uk/news/article-4318450/Record-1-9million-cruise.html"}
