{"authors":["Associated Press"],"date_download":"2018-10-22 21:25:07","date_modify":"2018-10-22 21:25:07","date_publish":"2016-01-29 06:36:35","description":"BOSTON (AP) — One of the nation's first professional baseball players lies largely forgotten by history in an unmarked grave in Boston. Now, nearly 150 years...","filename":"data/vaneerConsumption/19thcenturybaseballpioneerscontractshitauctionblock.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:e79f341f7250466e93d3592996636d1c-4PuZeKVXE7cd9005b2c8765caa03-317_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422234_19th-century-baseball-pioneers-contracts-hit-auction-block_1540243507.html","title":"19th century baseball pioneer's contracts hit auction block","title_page":"19th century baseball pioneer's contracts hit auction block | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"19th century baseball pioneer's contracts hit auction block\nBOSTON (AP) — One of the nation's first professional baseball players lies largely forgotten by history in an unmarked grave in Boston.\nNow, nearly 150 years after Andrew Jackson Leonard began his professional career, his grandson hopes to raise enough money for a marker to honor his relative and his contributions to the game by auctioning his grandfather's contracts, which are among the oldest known in existence.\n\"He was one of the original boys of summer and we need to do what we can to promote his legacy,\" said Leonard's grandson, 82-year-old Charles McCarty, a Boston native who is now retired in Folly Beach, South Carolina.\nIn this photo made Tuesday, Jan. 26, 2016, Chris Ivy, director of sports auctions at Heritage Auctions displays professional baseball contract from the year 1871 that is up for sale in Dallas. The grandson of one of the nation¿s first professional baseball players is auctioning some of his grandfather's original contracts that date to the 1870s, hoping to raise enough money to buy a marker for his pioneering relative who¿s buried in an unmarked plot in a Boston cemetery. (AP Photo/LM Otero)\nLeonard was born in County Cavan, Ireland, in 1846 and moved to the United States with his mother and siblings when he was 2 years old to escape the potato famine, McCarty said.\nThe family settled in Newark, New Jersey, where Leonard started turning heads as a baseball player.\nHe played for the Cincinnati Red Stockings in 1869, baseball's first professional team. But it's an 1871 contract Leonard signed to play for the Washington Olympics that is perhaps the most historically significant artifact, said Chris Ivy, director of sports at Dallas-based Heritage Auctions, which is handling the sale.\nIt was signed at a time when there was a societal rift over whether baseball should pay its top players or remain amateur. Written on U.S. Treasury Department letterhead and signed by the acting Treasury secretary, the 40-word contract promises Leonard $720 for one year to be a department messenger.\n\"That contract sheds light on what's long been believed but not proven, which was that there were professional baseball players posing as amateurs who were getting paid under the table for no-show jobs, and this is tangible evidence that the government was involved,\" Ivy said.\nThe $720 was about twice what a government messenger made annually in the 1870s.\n\"Andy didn't do a lick of work for the Treasury,\" McCarty said.\nAfter one season with the Olympics, Leonard played seven seasons with the Boston Red Stockings, helping the team win six pennants. The Red Stockings eventually became the Boston Braves, the team that exists today as the Atlanta Braves.\nLeonard died in 1903 at age 57 and is buried in New Calvary Cemetery in Boston.\nThe contracts and a diary Leonard kept during an 1874 baseball tour to England and Ireland could fetch at least $100,000 at auction Feb. 20, Ivy said.\nLeonard deserves a spot in the pantheon of the game's pioneers, said John Thorn, the official historian of Major League Baseball.\n\"Leonard was a very good player, not a great player, but the fact he was recruited to become a charter member of the Cincinnati Red Stockings makes him an important historical figure,\" he said. \"I am entirely behind the idea of marking his grave.\"\nAnd while Leonard may be unfamiliar to many Americans, his legacy lives on in his homeland — the MVP award for the modern-day Irish national baseball league is named for Leonard.\nIn this photo made Tuesday, Jan. 26, 2016, Chris Ivy, director of sports auctions at Heritage Auctions displays professional baseball contracts that are up for sale in Dallas. The contract belonging to Andrew Jackson Leonard who signed to play for the Washington Olympics, is perhaps the most historically significant, according to Ivy. It is written on U.S. Treasury Department letterhead promising Leonard $720. It was signed at a time when there was a societal rift over whether baseball should remain a purely amateur sport or pay its top players. (AP Photo/LM Otero)\nIn this photo made Tuesday, Jan. 26, 2016, a professional baseball contract from the year 1871 is displayed in Dallas. The contract belonged to Andrew Jackson Leonard who was born in County Cavan, Ireland, in 1846 and moved to the U.S. with his mother and siblings when he was 2 years old to escape the potato famine, according to his grandson, Charles McCarty. (AP Photo/LM Otero)\nIn this photo made Tuesday, Jan. 26, 2016, a detail of a professional baseball contract from the year 1871 is displayed in Dallas. The grandson of one of the nation¿s first professional baseball players is auctioning some of his grandfather's original contracts that date to the 1870s, hoping to raise enough money to buy a marker for his pioneering relative who¿s buried in an unmarked plot in a Boston cemetery. (AP Photo/LM Otero)\nIn this photo made Tuesday, Jan. 26, 2016, a detail of a professional baseball contract from the year 1871 is displayed in Dallas. The contract belonged to Andrew Jackson Leonard and was written on U.S. Treasury Department letterhead promising Leonard $720. It was signed at a time when there was a societal rift over whether baseball should remain a purely amateur sport or pay its top players. (AP Photo/LM Otero)","url":"https://www.dailymail.co.uk/wires/ap/article-3422234/19th-century-baseball-pioneers-contracts-hit-auction-block.html"}
