{"authors":[],"date_download":"2018-10-30 20:20:12","date_modify":"2018-10-30 20:20:12","date_publish":"2015-11-30 14:57:58","description":"A Henry County man told police he was watching television news Monday morning when three men entered his second-floor apartment from the balcony.","filename":"data/vaneerConsumption/1bodyfoundinside1outsideafterHenryCountyapartment.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/11/30/Images/photos.medleyphoto.8441650.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_body-found-_61715f1dd4998b8c711470a3ba82ee20__1540930812.html","title":"1 body found inside, 1 outside after Henry County apartment...","title_page":"1 body found inside, 1 outside after Henry County apartment...","title_rss":"NULL","source_domain":"ajc.com","text":"A Henry County man told police he was watching television news Monday morning when three men entered his second-floor apartment from the balcony. All three men had guns, but two were shot to death by the man’s roommate.\n“I just had three guys break in on me,” Stanley Babb told a 911 operator around 7 a.m. “One of them’s shot. I don’t know how many others got shot. I need the cops quick.”\nWhile Babb had his hands in the air, his roommate grabbed a gun and fired shots, Babb said. One of the suspects was bleeding on the foyer floor, Babb said. By the time Henry County officers arrived, the man was dead, Capt. Joey Smith said.\n“Pointing guns at me and all kinds of stuff,” Babb told the operator. “They climbed up my balcony. I live on the second floor.”\nThe other two men, described as wearing dark hoodies and gloves, were initially able to leave the apartment, located at the Sable Chase Apartments on Sable Chase Boulevard. Later Monday, investigators found one of them dead in a field behind the complex, according to Smith.\nThe names of the men killed were not released Monday afternoon as officers continued to investigate the incident. Babb, who was not injured, remained Monday afternoon at police headquarters, where he spend most of the day, he told The Atlanta Journal-Constitution.\nBabb, who is retired, said his apartment was also targeted by would-be robbers over the weekend. He declined to elaborate, but said the three men who entered his home Monday were not the same ones from the weekend incident.\n— Please return to AJC.com for updates.","url":"https://www.ajc.com/news/crime--law/body-found-inside-outside-after-henry-county-apartment-burglary/kgzkmJgtW8FZz9QDpN0ovI/"}
