{"authors":["Associated Press"],"date_download":"2018-10-23 04:05:41","date_modify":"2018-10-23 04:05:41","date_publish":"2017-04-26 15:45:55","description":"NAIROBI, Kenya (AP) - One person has died and another was injured in hotly contested primary elections in the capital Nairobi, a Kenyan police official said...","filename":"data/vaneerConsumption/1persondiesinKenyasprimaryelections.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4448138_1-person-dies-Kenyas-primary-elections_1540267541.html","title":"1 person dies in Kenya's primary elections","title_page":"1 person dies in Kenya's primary elections | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NAIROBI, Kenya (AP) - One person has died and another was injured in hotly contested primary elections in the capital Nairobi, a Kenyan police official said Wednesday.\nBoth opposition and ruling party primaries started on April 13 and have experienced chaotic scenes and accusations of rigging. The ruling Jubilee Party had to postpone the start of its primaries because of a shortage of voting materials.\nA fight started between rival camps after accusations that a candidate's posters were defaced in the Pangani area, Nairobi police boss Japheth Koome said. One person was stabbed and when he fled he was hit by a car and died, Koome said.\nKenya's internal security minister warned Monday of stern action against those causing chaos in the primaries.\nKenya has a history of electoral violence. Fighting that followed the 2007 flawed presidential election killed more than 1,000 people.\nTwo candidates in the upcoming election were killed earlier this year and the governor of Kenya's second-largest city, Mombasa, says his life is in danger after his bodyguard was shot in his car earlier this month during a campaign rally for a party colleague.\nThe U.S. government has asked its citizens residing in or traveling to Kenya to be alert to the security situation as the country heads toward general elections in August. The State Department on Thursday warned citizens to avoid gatherings, protests and demonstrations. It said the advisory will expire on Aug. 31.","url":"https://www.dailymail.co.uk/wires/ap/article-4448138/1-person-dies-Kenyas-primary-elections.html"}
