{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 19:57:47","date_modify":"2018-10-30 19:57:47","date_publish":"2015-05-04 16:51:07","description":"“The first thing you notice is the warm and welcoming smile. Any brother standing in the doorway is sure to get a big smile, hearty handshake, and some sort of kind conversation,” Kawthar Ijai wrote in a February 2010 Arizona Muslim Voice profile of Elton Simpson, the man who officials said carried out a terrorist attack in Garland, Texas on Sunday. |","filename":"data/vaneerConsumption/2010ArizonaMuslimPublicationTexasShooterWellLikedKidsAdoreHim.json","image_url":"https://media.breitbart.com/media/2015/05/ap_ap-photo187-1024x627.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_05_04__1540929467.html","title":"2010 Arizona Muslim Publication: Texas Shooter 'Well-Liked,' 'Kids Adore Him'","title_page":"2010 Arizona Muslim Publication: Texas Shooter 'Well-Liked,' 'Kids Adore Him' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"“The first thing you notice is the warm and welcoming smile. Any brother standing in the doorway is sure to get a big smile, hearty handshake, and some sort of kind conversation,” Kawthar Ijai wrote in a February 2010 Arizona Muslim Voice profile of Elton Simpson, the man who officials said carried out a terrorist attack in Garland, Texas on Sunday.\nSimpson and an accomplice, reportedly armed with AK-47 assault rifles, attempted to carry out an attack on a “Draw Muhammad” free-speech event hosted by Pamela Geller, president of the anti-jihad group American Freedom Defense Initiative (AFDI). Both jihadists were shot dead by police before they could inflict damage upon the event’s attendees.\nIn a 2010 profile of Simpson, after he had been arrested following an FBI terrorism investigation, author Kawthar Ijai wrote that he had adopted the Muslim name Ibrahim. Simpson was described as “the kind of person who always has a positive word for everyone and has a bright outlook, especially when you start talking about his favorite topic – Islam.”\n“Kids adore him. He is always talking to the kids on their level, throwing a ball around with them and playing games with them,” said the author. “They actually come home from their classes with some knowledge about the character of the Prophet Muhammad,” she added.\nSimpson was known to sport a “white thobe” (Muslim male garment popular in Gulf countries), according to the piece, and a Kufi, a hat worn by Muslim men in the Middle East and North Africa.\nConcluding the piece, the author of the Simpson profile solicits donations for Simpson, hoping that the Muslim community will be able to raise enough money to process a $12,000 bail bond.\nThe article also revealed that the Council on American Islamic Relations (CAIR), a Muslim advocacy group that was listed as an unindicted co-conspirator in a terrorism financing trial, encouraged local Muslims to “use caution” when speaking with the FBI about its 2010 investigation into Simpson’s terror connections. The Arizona chapter of CAIR reportedly shared an office with the Arizona Muslim paper that published the glowing portrayal of the suspected terrorist.","url":"https://www.breitbart.com/national-security/2015/05/04/2010-arizona-muslim-publication-texas-shooter-well-liked-kids-adore-him/"}
