{"authors":["Benjamin Zhang"],"date_download":"2018-10-30 21:49:36","date_modify":"2018-10-30 21:49:36","date_publish":"2016-12-17 00:00:00","description":"The 2017 Audi A4 is the latest high-tech, compact luxury sedan to emerge from VW Group's luxury brand. It nearly won Business Insider's 2016 Car of the year.","filename":"data/vaneerConsumption/2016CaroftheYearrunnerupThehightechAudiA4.json","image_url":"https://amp.businessinsider.com/images/583f43cce02ba75d658b5e2b-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_audi-a4-review-car-of-the-year-2017-2016-12_1540936176.html","title":"2016 Car of the Year runner-up: The high-tech Audi A4","title_page":"    2017 Audi A4 sedan Business Insider 2016 Car of the Year runner-up - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Hollis Johnson\nEditorial note: Business Insider just named its 2016 Car of the Year, the Acura NSX. This week, we're re-running our reviews of the five cars that almost beat out Acura for the honor.\nIn the 1980s, the Audi Quattro revolutionized rally racing. In the 1990s, the TT became an instant style icon. In the 2000s, the striking R8 supercar became Iron Man's ride of choice. More recently, the German brand has turned out one industry-leading model after another in the form of stalwarts such as the Q5, the Q7, and RS7, all of which are brilliant vehicles.\nThis fall, Audi dropped off a brand-new 2017 A4 2.0T quattro S tronic sedan clad in Manhattan Gray Metallic paint for Business Insider to check out. It was our first encounter with the company's new fifth-generation A4 sedan. To call the car impressive would be an understatement.\nOne thing became crystal clear to Business Insider's transportation team after just a few days with the new A4: The 2017 A4 is the best car Audi has ever made. Yes, it's that good!\nNo, the new A4 isn't as evocative as the R8. Nor does it have the mind-bending performance of the RS7. The compact luxury sedan certainly doesn't have the vaunted racing pedigree of the Quattro. (The A4 has been known to hold its own as a touring car racer in Europe and the UK.) But what the A4 does have going for it is the ability to do everything Audi and its consumers need it to do with spectacular effectiveness and efficiency.\nAs my colleague Matt DeBord put it, \"The A4 ticks all of the boxes you can tick, but it doesn't create any new ones.\"\nThe brand new A4 sedan starts at a competitive $34,900, while our option-laden test car came with an as-tested price tag of $54,275.\nHere's a closer look at the 2017 Audi A4.\nPhotos by Hollis Johnson unless otherwise credited.","url":"https://www.businessinsider.com/audi-a4-review-car-of-the-year-2017-2016-12"}
