{"authors":[],"date_download":"2018-10-30 21:15:39","date_modify":"2018-10-30 21:15:39","date_publish":"2016-12-30 00:00:00","description":"The Georgia Bulldogs (7-5) and TCU Horned Frogs (6-6) meet in the 2016 Liberty Bowl on Dec. 30, 2016, in Memphis, Tenn.","filename":"data/vaneerConsumption/2016LibertyBowlGeorgiavsTCU.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/30/Images/630689748.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_college_photos-georg_7ffefd38116ccbc11983e93358d91bd4__1540934139.html","title":"2016 Liberty Bowl, Georgia vs. TCU","title_page":"Photos: 2016 Liberty Bowl, Georgia vs. TCU","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 23\nMichael Chang/Getty Images Georgia head coach Kirby Smart lifts the Liberty Bowl Trophy after the Bulldogs rallied to beat the TCU Horned Frogs, 31-23, at the Liberty Bowl Friday, Dec. 30, 2016, at the Liberty Bowl Memorial Stadium in Memphis, Tenn.\n2 / 23\nMichael Chang/Getty Images Bulldogs’ offensive lineman Pat Allen celebrates as the Bulldogs hold the lead over the TCU Horned Frogs in the fourth quarter of Liberty Bowl on Friday, Dec. 30, 2016, in Memphis, Tenn.\n3 / 23\nMichael Chang/Getty Images Georgia head coach Kirby Smart laughs after handing the Liberty Bowl Trophy to his players after they defeated the TCU Horned Frogs, 31-23, at the Liberty Bowl Friday, Dec. 30, 2016, in Memphis, Tenn.\n4 / 23\nMichael Chang/Getty Images Georgia head coach Kirby Smart poses with running back Sony Michel (1) and defensive tackle Trenton Thompson (78) after the 31-23 Liberty Bowl win over the TCU Horned Frogs Friday, Dec. 30, 2016, in Memphis, Tenn.\n5 / 23\nMichael Chang/Getty Images TCU wide receiver John Diarse holds on the ball to secure a touchdown in front of Georgia cornerback Deandre Baker in the second half of the Liberty Bowl Friday, Dec. 30, 2016, in Memphis, Tenn. The Bulldogs defeated the Frogs, 31-23.\n6 / 23\nMichael Chang/Getty Images Georgia running back Nick Chubb runs the ball down field while being tackled by TCU safety Niko Small (2) in the second half of the Liberty Bowl Friday, Dec. 30, 2016, in Memphis, Tenn.\n7 / 23\nMichael Chang/Getty Images Georgia running back Sony Michel runs the ball by TCU cornerback Ranthony Texada in the second half of the Liberty Bowl Friday, Dec. 30, 2016, in Memphis, Tenn. The Bulldogs defeated the Frogs, 31-23.\n8 / 23\nMark Weber/AP TCU quarterback Kenny Hill (7) watches a fumbled ball bounce away against the Georgia defense during the second quarter of the Liberty Bowl Friday, Dec. 30, 2016, in Memphis, Tenn. Georgia rallied for a 31-23 win at Liberty Bowl Memorial Stadium.\n9 / 23\nMark Weber/AP Georgia quarterback Jacob Eason makes a throw against TCU during the first quarter of the Liberty Bowl Friday, Dec. 30, 2016, in Memphis, Tenn. Georgia' freshman quarterback completed 12 of 21 passes for 164 yards and 2 touchdowns.\n10 / 23\nMark Weber/AP TCU defender Tipa Galeai (47) removes his helmet as he celebrates a sack and fumble recovery against Georgia during the second quarter of the Liberty Bowl Friday, Dec. 30, 2016, in Memphis, Tenn.\n11 / 23\nMark Weber/AP TCU receiver John Diarse (left) scrambles past the Georgia defense for a 10-yard touchdown reception during the second quarter of the Liberty Bowl Friday, Dec. 30, 2016, in Memphis, Tenn.\n12 / 23\nMark Weber/AP TCU teammates L.J. Collier (91) and Tony James (28) celebrate after Georgia missed a field goal to end the second quarter of the Liberty Bowl Friday, Dec. 30, 2016, in Memphis, Tenn.\n13 / 23\nMichael Chang/Getty Images TCU wide receiver John Diarse carries the ball by Georgia linebacker Lorenzo Carter during the first half of the Liberty Bowl on Dec. 30, 2016, at Liberty Bowl Memorial Stadium in Memphis, Tenn. TCU led Georgia, 16-14, at halftime.\n14 / 23\nMichael Chang/Getty Images Georgia wide receiver Isaiah McKenzie runs the ball downfield past TCU safety Ridwan Issahaku at the Liberty Bowl Dec. 30, 2016, in Memphis, Tenn. The 77-yard catch and run set up a first quarter touchdown by the Bulldogs. TCU led Georgia 16-14 at the half.\n15 / 23\nMichael Chang/Getty Images Georgia running back Sony Michel falls into the end zone for a touchdown over TCU linebacker Sammy Douglas to give the Bulldogs an early lead at the Liberty Bowl Dec. 30, 2016, in Memphis, Tenn.\n16 / 23\nMichael Chang/Getty Images Horned Frogs quarterback Kenny Hill runs the ball downfield during the first half against the Georgia Bulldogs in the Liberty Bowl at Liberty Bowl Memorial Stadium on Dec. 30, 2016, in Memphis, Tenn.\n17 / 23\nMichael Chang/Getty Images Georgia defensive back Maurice Smith looks to sack TCU quarterback Kenny Hill in the first half of the Liberty Bowl Dec. 30, 2016, in Memphis, Tenn.\n18 / 23\nMichael Chang/Getty Images TCU offensive tackle Aviante Collins (69) helps quarterback Kenny Hill (7) into the end zone for a touchdown in the first half of the Liberty Bowl against the Georgia Bulldogs at Liberty Bowl Memorial Stadium Dec. 30, 2016, in Memphis, Tenn.\n19 / 23\nMichael Chang/Getty Images Georgia running back Nick Chubb looks to maneuver by TCU linebacker Sammy Douglas at Liberty Bowl Memorial Stadium Dec. 30, 2016, in Memphis, Tenn. TCU led Georgia 16-14 at the half.\n20 / 23\nMichael Chang/Getty Images Horned Frogs running back Kyle Hicks (21) runs the ball through traffic during the Liberty Bowl against the Georgia Bulldogs at Liberty Bowl Memorial Stadium Dec. 30, 2016 in Memphis, Tenn.\n21 / 23\nMichael Chang/Getty Images TCU quarterback Kenny Hill looks to escape a tackle by Georgia defensive tackle Trenton Thompson (78) and linebacker Davin Bellamy (17) during the first half of the Liberty Bowl at Liberty Bowl Memorial Stadium Dec. 30, 2016, in Memphis, Tenn\n22 / 23\nMichael Chang/Getty Images TCU running back Darius Anderson goes airborne while being tackled by Georgia linebackers Davin Bellamy (17) and Roquan Smith during the first half of the Liberty Bowl at Liberty Bowl Memorial Stadium Dec. 30, 2016, in Memphis, Tenn.\n23 / 23","url":"https://www.ajc.com/sports/college/photos-georgia-celebrates-liberty-bowl-win-over-tcu/nIUhxi5i3dCzbo0eTdTkCO/"}
