{"authors":[],"date_download":"2018-10-22 21:51:45","date_modify":"2018-10-22 21:51:45","date_publish":"2017-04-25 00:00:00","description":"An illuminating series by NPR's Planet Money team and Business Desk that exposed additional retaliatory wrongdoing by Wells Fargo has earned a 2016 George Foster Peabody Award.","filename":"data/vaneerConsumption/2016PeabodyAwardForNPRsInvestigationOfWellsFargoScandal.json","image_url":"https://media.npr.org/assets/img/2017/04/25/20160927-wells-fargo-sf-0072edit_wide-294a5594e59e32d2673b54cb7326f72cfe06ea4b.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/about-npr_525542513_2016-peabody-award-for-nprs-investigation-of-wells-fargo-scandal_1540245105.html","title":"2016 Peabody Award For NPR's Investigation Of Wells Fargo Scandal","title_page":"2016 Peabody Award For NPR's Investigation Of Wells Fargo Scandal : NPR","title_rss":"NULL","source_domain":"npr.org","text":"2016 Peabody Award For NPR's Investigation Of Wells Fargo Scandal\nEnlarge this image toggle caption Ariel Zambelich/NPR Ariel Zambelich/NPR\nRecognition Marks 64th Peabody Award For NPR\nDelve Into The Award-Winning NPR Series On Wells Fargo at NPR.org\nApril 25, 2017; Washington, D.C. – An illuminating special series from NPR that exposed retaliatory wrongdoing by Wells Fargo, the bank already embroiled in scandal for opening as many as 2 million accounts without customers' consent, has earned a 2016 George Foster Peabody Award. This multi-platform investigative series spanned NPR's Planet Money podcast and its flagship news programs Morning Edition and All Things Considered, as well as online stories.\nThe series revealed, for the first time, the extent of the toxic sales culture that pushed workers to commit fraud by foisting unwanted credit cards, checking accounts, and lines of credit on customers. When some workers refused to take part in the unethical sales practices and called the bank's ethics hotline to report the wrongdoing, Wells Fargo not only fired them but also destroyed their careers.\n\"Our most important task as journalists is to hold big institutions to account,\" said NPR Senior Vice President of News and Editorial Director Michael Oreskes. \"The Wells Fargo CEO was blaming his employees for the bank's systemic choices. Chris Arnold and the Planet Money team stopped him from getting away with that.\"\nAs part of the series, NPR found and interviewed former Wells Fargo employees in Los Angeles, San Francisco, Florida, New Jersey, and Pennsylvania who were fired after they called the bank's ethics line; the bank then wrote negative comments on the workers' 'U-5 documents' — a de facto industry report card for bankers and brokers — making them unemployable by any other bank.\nThis award is shared among members of NPR's Business Desk and Planet Money podcast. The co-creators are Chris Arnold, correspondent and Robert Smith, correspondent. The rest of reporting team included Elizabeth Kulas, assistant producer; Neal Carruth, general manager of podcasts and former supervising senior editor; Uri Berliner, senior editor; Bryant Urstadt, senior editor; and Alex Goldmark, supervising producer.\nNPR's reporting on Wells Fargo's treatment of whistleblowers sparked an inquiry by lawmakers in Washington, who have said they want to see reforms that would better protect workers from employers or managers unfairly damaging their careers.\nPlanet Money Episode 732: Bad Form, Wells Fargo Episode 732: Bad Form, Wells Fargo Listen · 17:10 17:10\nThe special series reached listeners and readers on every platform. Reports aired on Morning Edition and All Things Considered, and Wells Fargo workers gave in-depth accounts of their experiences on the Planet Money podcast.\nThe Peabody Award for NPR's investigation into the Wells Fargo scandal is NPR's 64th nod from the prestigious program recognizing excellence in work by radio and television stations, networks, webcasters, producing organizations and individuals.\nA full list of this year's winners is available at the Peabody Awards website.\nAbout NPR\nNPR's rigorous reporting and unsurpassed storytelling connect with millions of Americans every day—on the air, online, and in person. NPR strives to create a more informed public—one challenged and invigorated by a deeper understanding and appreciation of events, ideas, and cultures. With a nationwide network of award-winning journalists and 17 international bureaus, NPR and its Member Stations are never far from where a story is unfolding. Listeners consider public radio an enriching and enlightening companion; they trust NPR as a daily source of unbiased independent news, and inspiring insights on life and the arts. More information at npr.org/aboutnpr and following NPR Extra on Facebook, Twitter and Instagram.\nContact\nAllyssa Pollard, NPR Media Relations / mediarelations@npr.org","url":"https://www.npr.org/about-npr/525542513/2016-peabody-award-for-nprs-investigation-of-wells-fargo-scandal"}
