{"authors":["William Bigelow"],"date_download":"2018-10-30 20:08:55","date_modify":"2018-10-30 20:08:55","date_publish":"2016-01-14 20:16:08","description":"Now that 2016 has arrived, seventh grade students in California will be required to take sex ed--and to learn that gender identity is fluid.","filename":"data/vaneerConsumption/20167thGradersMustNowTakeSexEd.json","image_url":"https://media.breitbart.com/media/2015/12/stressed-out-college-student-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_01_14__1540930135.html","title":"2016: 7th Graders Must Now Take Sex Ed","title_page":"2016: 7th Graders Must Now Take Sex Ed | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Now that 2016 has arrived, seventh grade students in California will be required to take sex ed–and to learn that gender identity is fluid.\nThe California Healthy Youth Act, signed into law by Governor Jerry Brown on October 1, 2015, states: “Instruction and materials shall affirmatively recognize that people have different sexual orientations and, when discussing or providing examples of relationships and couples, shall be inclusive of same-sex relationships. Instruction and materials shall teach pupils about gender, gender expression, gender identity, and explore the harm of negative gender stereotypes.”\nParents who prefer for their children not to be indoctrinated may opt out, submitting a document to their school or district.\nOther information presented to students will include: “Information on the nature of HIV, as well as other sexually transmitted infections, and their effects on the human body. Information on the manner in which HIV and other sexually transmitted infections are and are not transmitted, including information on the relative risk of infection according to specific behaviors, including sexual activities and injection drug use.”\nHigh school students will be the first of their age across the nation to be required to learn the concept of affirmative consent, a.k.a. “Yes means Yes.”\nCamille Giglio, of California Right To Life, told Bay Area public radio station KQED, “This comes into a whole new category of being forced to listen for six years to one version of so-called sexual health.”\nThe California State PTA enthusiastically supports the process; the organization wrote: “This is consistent with PTA resolutions stating that California’s students should have medically accurate, age-appropriate comprehensive sexual education, including HIV/STD prevention education and information to foster a more accepting school environment via updated health standards that deal with issues of sexual orientation, gender identity and gender expression.”\nPhoto: file","url":"https://www.breitbart.com/local/2016/01/14/2016-7th-graders-forced-to-learn-gender-issues-in-ca/"}
