{"authors":["Alex Swoyer"],"date_download":"2018-10-30 21:27:46","date_modify":"2018-10-30 21:27:46","date_publish":"2015-04-02 23:28:24","description":"As previous reported by Breitbart News, the agreement allows Iran to retain its enrichment facility at an underground bunker. It also allows Iran to maintain a small amount of enriched uranium, and will offer the regime sanctions relief as soon as it can show it is keeping its end of the bargain. As to information about possible military dimensions of Iran’s program, there is nothing but an agreement to talk further. |","filename":"data/vaneerConsumption/2016ContendersPerryHuckabeeandFiorinaCriticizeObamasDealWithIran.json","image_url":"https://media.breitbart.com/media/2015/03/US-EU-Iran-sanctions-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_02__1540934866.html","title":"2016 Contenders Perry, Huckabee and Fiorina Criticize Obama's Deal With Iran","title_page":"2016 Contenders Perry, Huckabee and Fiorina Criticize Obama's Deal With Iran | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Former Texas Gov. Rick Perry says the Obama Administration made too many concessions in its negotiations with Iran to reach the deal it announced Thursday.\n“Americans and our allies are right to be wary of a nuclear deal with Iran that is riddled with concessions by the Obama Administration,” Perry said in an emailed statement to Breitbart News.\nFormer Arkansas Gov. Huckabee also criticized Secretary of State John Kerry and the Obama Administration over how the negotiation with Iran was handled.\nThe likely 2016 presidential candidate issued this statement: “Each and every day, Iran undermines our allies, threatens our vital interests and murders innocent civilians across the globe. John Kerry lacks the judgment, common sense and moral clarity to negotiate any deal, much less Iran, and I am very concerned with the framework of this deal.”\nHuckabee added, “We should be tightening our grip with the current sanctions not abdicating to the Ayatollah’s interests.”\nIn an op-ed for Fox News, former HP CEO Carly Fiorina echoed Gov. Perry’s and Gov. Huckabee’s concerns. She said the deal the U.S. negotiated with Iran threatens American security.\n“U.S. officials know that Iran has had a long-term plan to gain a nuclear weapon and destabilize the region through its support of terrorist organizations. And it is known that President Rouhani has never agreed to full and unfettered United Nations inspections of Iran’s nuclear facilities,” the potential 2016 presidential candidate wrote.\nShe went on to say the Iranian government constantly violated sanctions placed on Iran by the United Nations.\n“We know that they have flat-out lied about every nuclear facility they have built over the last three decades,” added Fiorina. “This is not the behavior of a potential ally or of a partner. These are the actions of a country trying to bluff its way into persuading the United Nations, the United States, and its allies to allow it the freedom to develop a nuclear weapon for military purposes.”\nFiorina says the U.S. should not trust anything Iran signs because of the history of deceit it has displayed.","url":"https://www.breitbart.com/politics/2015/04/02/2016-contenders-perry-huckabee-and-fiorina-criticize-obamas-deal-with-iran/"}
