{"authors":["Ligaya Figueras"],"date_download":"2018-10-30 19:57:06","date_modify":"2018-10-30 19:57:06","date_publish":"2016-10-13 11:01:49","description":"Fabulous food and drink can bring on some sweet dreams.","filename":"data/vaneerConsumption/2016AJCFallDiningGuideAtlantasAList.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/13/Images/WPIMAGE_cmgajcfoodandmore_11255.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_20_8b87548b84c555a19236710709048dab__1540929426.html","title":"2016 AJC Fall Dining Guide: Atlanta's A List","title_page":"2016 AJC Fall Dining Guide: Atlanta's A List","title_rss":"NULL","source_domain":"ajc.com","text":"Fabulous food and drink can bring on some sweet dreams. But stunning spaces, as well as the people behind a restaurant operation — chefs and cooks, yes, but front-of-house folks, too — all contribute toward our lasting memories of a great night on the town.\nIn this year’s fall dining guide, we pay homage to each of these elements, and share with you the faces, places, dishes and drinks that are turning our heads.\nYou’ll get inside the mind of Staplehouse chef Ryan Smith to understand why his technically challenging dishes have such broad appeal. You’ll learn Drift Fish House & Oyster Bar General Manager Jason Raymond’s philosophy of “unobtrusive” service that is on full display at that Marietta restaurant.\nAmong dishes, we’re practicing our pronunciation of the trendy Japanese savory pancake okonomiyaki. We bring you a definitive list of Korean classics and where to try them. It’s also time to say “Aloha” to the Hawaiian foods that are finding their way onto mainstream menus. And to veggies vying with proteins for space on the plate.\nAnd we can’t forget the spaces — including The Atlanta Journal-Constitution dining team’s (no longer) secret hideaways. We give a nod to decor, too. What’s the most beautiful bar in Atlanta? The best seat in this city? Read on.\nHere is where we’re pulling up a chair right now — and why.\nThe faces defining Atlanta's dining scene\nThe places defining Atlanta's dining scene\nThe dishes defining Atlanta's dining scene\nThe drinks defining Atlanta's restaurant scene","url":"https://www.ajc.com/blog/atlanta-restaurants/2016-ajc-fall-dining-guide-atlanta-list/QmkuDWrBhB0D4XVuW1NPuN/"}
