{"authors":["Bryan Logan"],"date_download":"2018-10-30 20:34:36","date_modify":"2018-10-30 20:34:36","date_publish":"2016-12-30 00:00:00","description":"Hint: it's a challenge.","filename":"data/vaneerConsumption/2017AudiR8V10Plusreview.json","image_url":"https://amp.businessinsider.com/images/57c5b37709d2931b008b5280-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_supercars-san-francisco-2017-audi-r8-2016-12_1540931676.html","title":"2017 Audi R8 V-10 Plus review","title_page":"    2017 Audi R8 V-10 Plus review - CLONE - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"2017 Audi R8 V-10 Plus. Bryan Logan/Business Insider Few things are better than the visceral enjoyment of driving a supercar.\nAsk any car enthusiast which driver's seat they prefer, and the answer, almost invariably, will be one that sits low, with a big, thunderous engine out back and a six-figure price tag.\nAs true as that might be, it's almost cliché to say that supercars are the stuff of dreams. Certainly they are for most people. For others — including journalists like myself who get to drive these things from time to time — they are less of a dream and more of a study in harsh realities.\nOutside of a racetrack or some flawless stretch of pavement underneath impeccable weather, supercars are otherwise useless. Some of them are works of art, to be sure, but once removed from their natural habitats and employed as daily drivers, they are basically loud, over-engineered land missiles that cost more than four times the average annual US household income.\nOwn one of these cars in a city like San Francisco and you're in for a stressful experience. And if you're like most city dwellers who don't have a personal garage, you can add paranoia and lack of sleep to the mix.\nAudi tossed me the keys to a 2017 Audi R8 V-10 Plus a few weeks ago. All things considered, this is one of the few supercars that tries to make itself livable as a daily driver.\nThere are more than a few areas where the R8 shines. So my experience driving this car in and around San Francisco, though challenging, had less to do with the car itself and more to do with the general headache caused by city living with this much power beneath my feet.\nAllow me to explain:","url":"https://www.businessinsider.com/supercars-san-francisco-2017-audi-r8-2016-12"}
