{"authors":[],"date_download":"2018-10-30 19:36:25","date_modify":"2018-10-30 19:36:25","date_publish":"2018-08-27 09:00:00","description":"Jedis, Mr. 'Tales of the City' and the real-life heroines of desegregation highlight Sunday's 2018 AJC Decatur Book Festival. Find information about these and other top events to see at the festival in downtown Decatur. Author presentations begin at noon Sunday (street festival noon-6 p.m.).","filename":"data/vaneerConsumption/2018AJCDecaturBookFestival.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/27/Images/newsEngin.22550758_090317-BOOKFEST107.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/events_what-not-miss-sunday-2018-ajc-decatur-book-festival__1540928185.html","title":"2018 AJC Decatur Book Festival","title_page":"Sunday schedule: 2018 AJC Decatur Book Festival","title_rss":"NULL","source_domain":"ajc.com","text":"Age is just a state of mind at the AJC Decatur Book Festival.\nAt 13 years old, the annual Labor Day weekend event already is the largest independent book festival in the country. With 430 authors taking part this year, there’s something guaranteed to appeal to every one of the expected 80,000 attendees.\nStill, youngsters of all ages might want to check out a couple of alleged kids’ events that help bookend Sunday’s closing day lineup. We’ve highlighted some other author appearances on the crowded schedule as well (see decaturbookfestival.com for a complete listing of author appearances).\n“Calling All Jedis!” Adam Rex leads a parade to the Children’s Stage, followed by a session devoted to his hilarious new picture book (“Are You Scared, Darth Vader?”). Parade starts at 11:45 a.m. at the Community Bandstand. Author session at noon at Children’s Stage at Decatur Recreation Center.\n“Logical Family: A Conversation With Armistead Maupin.” The best-selling novelist, including the colorfully captivating “Tales of the City” series, has finally written a memoir covering his odyssey from the old South to freewheeling San Francisco and his search for a “logical family” of people to call his own. 1:15 p.m., First Baptist Decatur Sanctuary.\n“A Girl Stands at the Door: The Generation of Young Women Who Desegregated America’s Schools.” Historian Rachel Devlin illuminates the brave young black women who were at the vanguard of the struggle to desegregate America’s schools. 2:30 p.m., Historic DeKalb Courthouse.\n“Atticus Finch — The Biography.” Emory University historian Joseph Crespino examines how Harper Lee’s real-life father provided key inspiration for her books — and their complex presentations of the fictional father/lawyer character in “To Kill a Mockingbird” and “Go Set a Watchman.” 3:45 p.m., Decatur Presbyterian Sanctuary.\n“Here Say: Speaking as Performance.” Four top writers and storytellers have a “lively conversation” on the power of words and stories on the page, on stage and beyond. 5 p.m., Decatur Library.\nHarry and the Potters in concert. The festival closes out with this free performance by the “first Wizard Rock band.” 6:30 p.m. (doors open at 6 p.m.), Children’s Stage at Decatur Recreation Center.\nCharles Frazier will appear at the AJC tent to sign books at noon.\nEVENT PREVIEW\nAJC Decatur Book Festival\nAuthor presentations begin at noon Sunday (street festival noon-6 p.m.). Free. Various venues, downtown Decatur. See DBF Festival Map for parking locations, take MARTA to the Decatur station or use the free bike valet on North McDonough Street, in front of the DeKalb County Courthouse. decaturbookfestival.com.","url":"https://www.ajc.com/events/what-not-miss-sunday-2018-ajc-decatur-book-festival/P6ggEHoK87zWhl3P5gYCkP/"}
