{"authors":[],"date_download":"2018-10-30 19:38:13","date_modify":"2018-10-30 19:38:13","date_publish":"2018-08-22 14:00:00","description":"Virginia Willis, Todd Richards, Von Diaz and Eddie Hernandez among the talented cookbook authors, drink writers and chefs at the 2018 AJC Decatur Book Festival. Find them on the Culinary Stage.","filename":"data/vaneerConsumption/2018AJCDecaturBookFestivalculinarystageofferstastylineup.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/22/Images/newsEngin.22653082_Culinarystage1.2016.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_dining_decatu_87c5be40e98fd1915b0caf438e7a66a9__1540928293.html","title":"2018 AJC Decatur Book Festival culinary stage offers tasty lineup","title_page":"Best events on the Culinary stage at the 2018 AJC Decatur Book Fest","title_rss":"NULL","source_domain":"ajc.com","text":"From Dragon Con to laser shows and fireworks at Stone Mountain Park, Labor Day weekend promises plenty of fun and entertainment in and around Atlanta. For book lovers, there is but one place to be: the AJC Decatur Book Festival.\nMore than 300 writers, poets, speakers, chefs and personalities will appear at events centered on the square in downtown Decatur Aug. 31-Sept. 2.\nThere will be book signings, author readings, panel discussions, poetry slams, writing workshops and an interactive children’s area.\nBut, for those who love food, the culinary stage is a highlight of the festival. Located again on the MARTA plaza, the stage will see action from 10 a.m. to 6:15 p.m. Sept. 1, and from noon to 5:45 p.m. Sept. 2.\nThis year’s lineup is full of talented cookbook authors, drink writers and chefs.\nMore than a dozen cookbook authors, chefs and drink writers will make appearances on the culinary stage at the AJC Decatur Book Festival. CONTRIBUTED BY TOM MEYER (The Atlanta Journal-Constitution)\nThings will get off to a sizzling start Saturday with barbecue guru Steven Raichlen. For the second year in a row, the author of the best-selling “Barbecue! Bible” cookbook series and 2016 Barbecue Hall of Fame inductee will use techniques from his latest book, “Project Fire,” to show attendees how to up their grilling game.\nThe focus on flames, smoke and meat will continue Sunday, when Tuffy Stone shares his wealth of barbecue know-how. Stone is a five-time World Barbecue Champion and co-owner of Q Barbecue restaurants in Richmond. With the debut of “Cool Smoke,” he now can add cookbook author to his résumé.\n<","url":"https://www.ajc.com/entertainment/dining/decatur-book-festival-culinary-stage-offers-tasty-lineup/8uar7S5ktSTEYBHyVfHQcO/"}
