{"authors":["Caitlin Gallagher"],"date_download":"2018-10-31 01:40:44","date_modify":"2018-10-31 01:40:44","date_publish":"2018-09-14 20:45:52","description":"While the Oscars are struggling to find a way to make the Academy Awards more crowd-pleasing, the Emmys are doing just fine thanks to the thriving and diverse television landscape these days. But because of how much TV content there is, you might…","filename":"data/vaneerConsumption/2018EmmyAwardsPredictionsHighlightJustHowCloseAllTheCompetitionIsThisYear.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/2317ebb5-67c0-4b08-a23a-db03d30f020b-ke_108_rv_161117_0143.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_2018-emmy-awards-predictions-highlight-just-how-close-all-the-competition-is-this-year-11904489_1540950044.html","title":"2018 Emmy Awards Predictions Highlight Just How Close All The Competition Is This Year","title_page":"2018 Emmy Awards Predictions Highlight Just How Close All The Competition Is This Year","title_rss":"NULL","source_domain":"bustle.com","text":"While the Oscars are struggling to find a way to make the Academy Awards more crowd-pleasing, the Emmys are doing just fine thanks to the thriving and diverse television landscape these days. But because of how much TV content there is, you might need some guidance when it comes to making your 2018 Emmy Awards predictions. Especially as one major drama player is back in the race, a comedy show is out of the running for 2018 — and there's no Big Little Lies this year to dominate the miniseries categories. Even with the bounty of shows out there, these seemingly small changes can make all the difference as you'll see when the 2018 Emmys air on Monday, Sept. 17.\nThe drama categories are saying goodbye to some familiar faces this year, meaning the stakes are high for some of your faves. The Americans wrapped up its final season in May. And while The Crown will go on, Claire Foy and Matt Smith will not continue their reign as the Netflix series moves to a new time period. The Handmaid's Tale is looking to repeat its 2017 success, but there is a chance for a shakeup. And yes, Game Of Thrones is back in action after missing the cutoff in 2017.\nThe comedy categories can reward some new faces, too, since Veep didn't air in 2018. Sadly, the HBO comedy took a hiatus due to Julia Louis-Dreyfus' battle with breast cancer. Thankfully, Veep and Louis-Dreyfus are set to return, but it's truly a testament to the talent of Louis-Dreyfus that her absence changed the whole landscape of the comedy categories of the Emmys this year. Then again, there can always be surprises during awards shows, so check out the predictions for the big winners of the 2018 Emmys.\nOutstanding Drama Series Hulu The Americans\nThe Crown\nGame Of Thrones\nThe Handmaid's Tale\nStranger Things\nThis Is Us\nWestworld Will win: The Handmaid's Tale since the Emmys never shy away from repeat winners. Season 2 diverged from its source book, but June's story stayed all too relevant and the performances were out of this world. Could win: The Americans mostly because it's the last time that Emmy voters could bestow this honor on the series. And while Game Of Thrones is always a contender, it's more probable that the HBO fantasy epic will take home the big prize after its final season.\nOutstanding Comedy Series Amazon Atlanta\nBarry\nblack-ish\nCurb Your Enthusiasm\nGLOW\nThe Marvelous Mrs. Maisel\nSilicon Valley\nUnbreakable Kimmy Schmidt Will win: The Marvelous Mrs. Maisel already charmed voters at the Creative Arts Emmy Awards since the show won Outstanding Casting. And with Veep off the table, it's likely this freshman series will win. Could win: Atlanta also has a chance with the absence of Veep, but this is the awards show that gave the Outstanding Comedy Series title to Modern Family five years in a row. So Atlanta may be too cerebral for Emmy voters.\nOutstanding Limited Series Ray Mickshaw/FX The Alienist\nThe Assassination Of Gianni Versace: American Crime Story\nGenius: Picasso\nGodless\nPatrick Melrose Will win: The Assassination Of Gianni Versace managed to suck viewers in even though they already knew the tragic outcome of the designer's life. Season 2 of Ryan Murphy's crime anthology series was more ambitious — and arguably, better — than its predecessor, The People V. O.J. Simpson. And considering how well the premiere season did at the 2016 Emmys, Versace just may be one of the biggest winners of the night. Could win: Godless was a major hit with critics and could be rewarded for its modern, measured take on Westerns.\nOutstanding Lead Actor In A Drama Series Patrick Harbon/FX Jason Bateman, Ozark\nSterling K. Brown, This Is Us\nEd Harris, Westworld\nMatthew Rhys, The Americans\nMilo Ventimiglia, This Is Us\nJeffrey Wright, Westworld Will and should win: Matthew Rhys deserves to be named the victor for his last season as Philip Jennings. Despite being nominated twice before, the Welsh actor has never won an Emmy for his work on The Americans. This is the last year to right that wrong — and to acknowledge that his performance was about a lot more than wigs and fake facial hair.\nOutstanding Lead Actress In A Drama Series George Kraychyk/Hulu Claire Foy, The Crown\nTatiana Maslany, Orphan Black\nElisabeth Moss, The Handmaid's Tale\nSandra Oh, Killing Eve\nKeri Russell, The Americans\nEvan Rachel Wood, Westworld Will win: Elisabeth Moss may become the Julia Louis-Dreyfus of the drama category as she continues to live through the tortures of Gilead. Could win: Don't underestimate the power of Sandra Oh this year for Killing Eve. She'd make history as the first Asian-American woman to ever win in the category. Keri Russell could join her on screen and off screen husband in receiving an Emmy this year, but the actress category is a bit more stacked. Claire Foy and Tatiana Maslany are also up for the last time in their respective roles. While Maslany should get all the awards for Orphan Black, she was previously awarded in 2016. Plus, the final season aired so long ago that voters may have forgotten about her. Foy should absolutely earn an Emmy for her portrayal of Queen Elizabeth II, but it's probable that she'll lose out again to Moss.\nOutstanding Lead Actor In A Comedy Series Guy D'Alema/FX Anthony Anderson, black-ish\nTed Danson, The Good Place\nLarry David, Curb Your Enthusiasm\nDonald Glover, Atlanta\nBill Hader, Barry\nWilliam H. Macey, Shameless Will win: Donald Glover may not see his FX show win Outstanding Comedy Series, but he could win again for his role as Earn Marks — especially with his surreal mid-season performance as Teddy Perkins. Could win: Bill Hader showed off his dramatic range as assassin turned aspiring actor. And while they're long shots, Anthony Anderson and Ted Danson certainly deserve recognition for their critically-acclaimed sitcoms.\nOutstanding Lead Actress In A Comedy Series Amazon Pamela Adlon, Better Things\nRachel Brosnahan, The Marvelous Mrs. Maisel\nAllison Janney, Mom\nIssa Rae, Insecure\nTracee Ellis Ross, black-ish\nLily Tomlin, Grace & Frankie Will win: Rachel Brosnahan already picked up a Golden Globe for Miriam \"Midge\" Maisel and there's no reason to think her winning streak won't continue at the Emmys. Could win: That being said, Allison Janney often sweeps award shows for her role in Mom. And if she won, she'd be one of the few performers to win an Oscar and Emmy in the same year. But Tracee Ellis Ross and Issa Rae are also strong contenders in this category.\nOutstanding Lead Actor In A Limited Series Or Movie Ray Mickshaw/FX Antonio Banderas, Genius: Picasso\nBenedict Cumberbatch, Patrick Melrose\nDarren Criss, The Assassination of Gianni Versace: American Crime Story\nJeff Daniels, The Looming Tower\nJohn Legend, Jesus Christ Superstar Live in Concert\nJesse Plemons, \"USS Callister\" (Black Mirror) Will and should win: Darren Criss is by far the favorite for his career-changing role as Andrew Cunanan. While Benedict Cumberbatch was also incredible, Criss showed he had a talent that many viewers hadn't seen before. And don't worry, John Legend fans — he already earned his EGOT.\nOutstanding Lead Actress In A Limited Series Or Movie Kyle Kaplan/HBO Jessica Biel, The Sinner\nLaura Dern, The Tale\nMichelle Dockery, Godless\nEdie Falco, Law & Order True Crime: The Menendez Murders\nRegina King, Seven Seconds\nSarah Paulson, American Horror Story: Cult Will win: Laura Dern is utterly heartbreaking in Jennifer Fox's movie about her realization that she was sexually abused as a child. Could win: Jessica Biel made her mark in a surprisingly raw role as Cora Tannetti and she also won at the Creative Emmys this year. But don't sleep on Edie Falco either for her performance as the harried defense attorney for the Menendez brothers.\nOutstanding Supporting Actor In A Drama Series Netflix Nikolaj Coster-Waldau, Game Of Thrones\nPeter Dinklage, Game Of Thrones\nJoseph Fiennes, The Handmaid's Tale\nDavid Harbour, Stranger Things\nMandy Patinkin, Homeland\nMatt Smith, The Crown Will win: David Harbor, who showed more of his paternal side, particularly during his emotional scenes with Eleven and Mike, in Season 2 of Stranger Things. Could win: Nikolaj Coster-Waldau is wishful thinking, but Jaime Lannister had a particularly transformative season of Game Of Thrones. But it should be noted that his costar Peter Dinklage is way more of an Emmy favorite. And like Foy, it's Matt Smith's last chance to nab an Emmy as Prince Philip, which voters could take into consideration.\nOutstanding Supporting Actress In A Drama Series George Kraychyk/Hulu Alexis Bledel — The Handmaid's Tale\nMillie Bobby Brown — Stranger Things\nAnn Dowd — The Handmaid's Tale\nLena Headey — Game Of Thrones\nVanessa Kirby — The Crown\nThandie Newton — Westworld\nYvonne Strahovski — The Handmaid's Tale Will win: Yvonne Strahovski may take the Supporting Actress crown from her Handmaid's Tale costar Ann Dowd this year since she really had the opportunity to show off the complexities of Serena Joy in Season 2. Could win: Thandie Newton because her moving performance as Maeve manages to ground the exceedingly complicated Westworld.\nOutstanding Supporting Actor In A Comedy Series Louie Anderson — Baskets\nAlec Baldwin — Saturday Night Live\nTituss Burgess — Unbreakable Kimmy Schmidt\nBrian Tyree Henry — Atlanta\nTony Shalhoub — The Marvelous Mrs. Maisel\nKenan Thompson — Saturday Night Live\nHenry Winkler — Barry Will win: Henry Winkler is nothing short of delightful in Barry. You can tell how much fun this five-time acting nominee is having and it feels oh-so right that Winkler's first win should be for the self-important yet lovable acting coach. Could win: Brian Tyree Henry's gripping performance on this season of Atlanta deserves some recognition, especially for \"Woods.\"\nOutstanding Supporting Actress In A Comedy Series Will Heath/NBC Zazie Beetz — Atlanta\nAlex Borstein — The Marvelous Mrs. Maisel\nAidy Bryant — Saturday Night Live\nBetty Gilpin — GLOW\nLeslie Jones — Saturday Night Live\nKate McKinnon — Saturday Night Live\nLaurie Metcalf — Roseanne\nMegan Mullally — Will & Grace Will win: Even without her Hillary Clinton appearing on a regular basis, Kate McKinnon still had a bag full of impersonations — like her marsupial take on Jeff Sessions — that continued to make her the standout performer of SNL. Could win: Alex Borstein poses as McKinnon's biggest contender. And depending on how much love the Emmys feel for The Marvelous Mrs. Maisel, Susie could strong-arm her way to a win.\nOutstanding Supporting Actor In A Limited Series Or Movie Ursula Coyote/Netflix Jeff Daniels, Godless\nJohn Leguizamo, Waco\nRicky Martin, The Assassination of Gianni Versace: American Crime Story\nEdgar Ramírez, The Assassination of Gianni Versace: American Crime Story\nMichael Stuhlbarg, The Looming Tower\nBrandon Victor Dixon, Jesus Christ Superstar Live In Concert\nFinn Wittrock, The Assassination of Gianni Versace: American Crime Story Will win: Jeff Daniels is the favorite to win as the unfathomably cruel villain of Godless. It certainly doesn't hurt that the disparity between Frank Griffin and his other nominated role highlights Daniels' range. Should win: Brandon Victor Dixon gave a truly remarkable performance as Judas in Jesus Christ Superstar. Many people didn't know the Hamilton star before NBC's live musical, but they're not likely to forget him or his powerhouse vocals.","url":"https://www.bustle.com/p/2018-emmy-awards-predictions-highlight-just-how-close-all-the-competition-is-this-year-11904489"}
