{"authors":["Akin Oyedele"],"date_download":"2018-10-31 00:31:59","date_modify":"2018-10-31 00:31:59","date_publish":"2018-07-09 00:00:00","description":"BI PRIME: Equity strategists at Bank of America Merrill Lynch raised their estimates for 2018 and 2019 earnings, placing one sector in the driver's seat of that revision. They see Q1 as the peak for earnings growth for this cycle but cautioned against selling stocks.","filename":"data/vaneerConsumption/2018earningspershareestimaterevisedhigherbyBankofAmerica.json","image_url":"https://amp.businessinsider.com/images/569483ade6183e8a0f8b87ee-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_stock-market-2018-earnings-per-share-eps-estimate-revised-higher-by-bank-of-america-2018-7_1540945919.html","title":"2018 earnings per share estimate revised higher by Bank of America","title_page":"    2018 earnings per share estimate revised higher by Bank of America - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Getty/Scott Olson\nEquity strategists at Bank of America Merrill Lynch are more bullish on corporate profits now than they were at the beginning of the year.\nThey revised higher their earnings-per-share forecasts for the rest of the year, with higher oil prices the biggest driver of that upgrade.\n\"Higher oil prices are a benefit to S&P 500 EPS, where much of the index either produces commodities or supplies commodity producers,\" Jill Carey Hall, a US equity strategist at BAML, said in a note on Monday.\nBAML's equity strategists forecast earnings of $159 a share for this year ($6 more than the start of the year) and $170 for 2019 ($9 more).\nNearly 40% of the boost to their earnings forecasts for this year and next year come from the energy sector, which should continue to benefit from higher oil prices. BAML's commodity strategists forecast that West Texas Intermediate crude oil, the US benchmark, would average $64 a barrel this year, about 25% more than they had expected at the start of the year.\nWTI has risen 22% this year as some of the world's largest producers agreed to scale back their output.\nBank of America Merrill Lynch\nThe other big contributor to BAML's earnings-revision forecast is the tech sector. Consumer staples is the only group in which earnings are expected to fall.\nEarnings could be even stronger if corporate-tax cuts and share buybacks are more beneficial than expected, Hall said.\nThe first quarter, the strongest period of year-over-year earnings growth for S&P 500 companies in seven years, marked the peak in profit growth for this cycle, if their estimates prove correct.\nBut even if earnings indeed peaked in Q1, investors shouldn't be rushing to sell stocks just yet, Hall said. That's because since 1960 the S&P 500 delivered a median return of more than 10% in the two years that followed peaks in quarterly earnings growth.\nAdditionally, earnings season provides some of the best outperformance opportunities for investors, since stocks have some of their biggest swings based on beats or misses. In an earlier note, BAML identified buy-rated stocks that are underowned by big-money managers, where its analysts' forecasts for earnings are the most bullish versus rest of Wall Street. The companies included Cisco, McDonald's, and Best Buy.\nThe key risk to BAML's higher forecast for EPS is an escalation of global trade tensions with more tariffs imposed on US imports.\n\"We've estimated that a 10% rise in import costs (assuming a small drop in foreign sales) would reduce S&P 500 EPS by 3-4%,\" Hall said. \"But a larger risk is if global growth suffers.\"","url":"https://www.businessinsider.com/stock-market-2018-earnings-per-share-eps-estimate-revised-higher-by-bank-of-america-2018-7"}
