{"authors":[],"date_download":"2018-10-30 18:11:59","date_modify":"2018-10-30 18:11:59","date_publish":"2017-04-11 11:00:00","description":"Good morning. This is LEADOFF, the early buzz in Atlanta sports.","filename":"data/vaneerConsumption/2026WorldCupinAtlantasMercedesBenzStadium.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/11/Images/newsEngin.18364187_040417-atlanta-aerials-ba-013.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_could-atlan_d416b2d2e38f53ebd24ac3a6bd288a0e__1540923119.html","title":"2026 World Cup in Atlanta's Mercedes-Benz Stadium?","title_page":"Leadoff: 2026 World Cup in Atlanta's Mercedes-Benz Stadium?","title_rss":"NULL","source_domain":"ajc.com","text":"Good morning. This is LEADOFF, the early buzz in Atlanta sports.\nMore than once, Arthur Blank has mentioned the World Cup as an event he would like to see in Atlanta’s Mercedes-Benz Stadium someday.\nThat came to mind with Monday’s announcement that the soccer federations of the United States, Mexico and Canada will combine on a joint bid to host the 2026 World Cup — a bid that numerous reports, including this one and this one, suggest likely will succeed.\nThe plan outlined Monday would be for many U.S. cities to host a total of 60 matches, including all from the quarterfinals on, and for Mexico and Canada to host 10 matches apiece in the expanded event.\nSpeculation immediately began on which U.S. cities would host matches if the bid prevails.\nAccording to an Associated Press report, “details of the host cities for 2026 are yet to be announced but the U.S. portion of the bid will rely on the gleaming stadiums opened by the NFL in the past two decades.”\nThe report included Mercedes-Benz Stadium on a list of possibilities, along with MetLife Stadium in East Rutherford, N.J., AT&T Stadium in Arlington, Texas, Levi’s Stadium in Santa Clara, Calif., Gillette Stadium in Foxborough, Mass., Philadelphia’s Lincoln Financial Field, Miami’s Hard Rock Stadium, Chicago’s Soldier Field (“reopened in 2003 after a gut renovation”) and the Los Angeles Rams’ new stadium (slated to open in 2019).\nESPN reported that the FIFA bid process normally would last until 2020, but could be accelerated. “Specific cities and stadiums won’t be finalized for several years,” according to the Washington Post.\n* * *\nEven the Chick-fil-A cow has gone high-tech at SunTrust Park.\nRather than holding a hand-painted sign, as the iconic fiberglass-and-steel cow did at Turner Field, it holds an electronic LED board at the new stadium.\nThat is a not-so-subtle symbol of how technology has been ratcheted up in all corners of the Braves’ new home.\nThe Braves promise fans the fastest WiFi service of any stadium in the country, as well as a deep lineup of video, lighting and sound effects.\nSee full story here on what to expect from technology at SunTrust Park.\n* * *\nHow is Falcons quarterback Matt Ryan dealing with his team’s historic collapse in the Super Bowl?\nSee D. Orlando Ledbetter’s story here.\n* * *\nDo three rousing wins change the Hawks’ playoff dynamics?\nMark Bradley asks and answers that question here.","url":"https://www.ajc.com/sports/football/could-atlanta-mercedes-benz-stadium-host-world-cup/bbOXJaTlk2DxfqYxNFz98M/"}
