{"authors":[],"date_download":"2018-10-23 04:56:00","date_modify":"2018-10-23 04:56:00","date_publish":"2017-04-26 16:26:29","description":"Twenty people died in ethnic clashes last week in the troubled central Kasai region of Democratic Republic of Congo, the United Nations said Wednesday.The...","filename":"data/vaneerConsumption/20killedinclashesinDRCongosKasairegionUN.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/16/wire-466151-1493220391-32_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4448330_20-killed-clashes-DR-Congos-Kasai-region-UN_1540270560.html","title":"20 killed in clashes in DR Congo's Kasai region: UN","title_page":"20 killed in clashes in DR Congo's Kasai region: UN | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The DR Congo region of Kasai has been shaken by violence between security forces and militias since August 2016\nTwenty people died in ethnic clashes last week in the troubled central Kasai region of Democratic Republic of Congo, the United Nations said Wednesday.\nThe UN's DR Congo mission, MONUSCO, said in a statement that the clashes took place on April 19 east of the Kasai capital, Tshikapa, between members of the Lulua-Luba and Chowe-Pende communities, killing 20 Chowe-Pende people.\nThe Chowe-Pende consider themselves indigenous to the Kasai region and accuse the Lulua-Luba from the neighbouring Kasai region of supporting the Kamwina Nsapu militia.\nThe latter claim their authority from chief Kamwina Nsapu who was killed in the region in August 2016 by police after a rebellion against the Congolese authorities.\nKasai has since been shaken by violence between security forces and militias in which around 100 people died, including two UN experts -- American Michael Sharp and dual Swedish-Chilean national Zaida Catalan.\nThe Kamwina Nsapu rebellion has been accused by the UN of numerous atrocities and recruiting children.\nThe security forces, meanwhile, are blamed by the UN for making disproportionate use of force against militia armed mainly with sticks and stones.","url":"https://www.dailymail.co.uk/wires/afp/article-4448330/20-killed-clashes-DR-Congos-Kasai-region-UN.html"}
