{"authors":["Lucia Peters"],"date_download":"2018-10-30 22:31:09","date_modify":"2018-10-30 22:31:09","date_publish":"2014-08-15 14:58:29","description":"It’s been a long time since I first went off to college — but I can still distinctly remember all the characters I met during my time in the dorms. Sure, the exact personas of these folks might mutate a little from generation to generation; time…","filename":"data/vaneerConsumption/20TypesofCollegeRoommatesYouCanExpecttoEncounterDuringFourYearsofDormLife.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/5/23/91d5c3b8-e4a6-4cac-9b51-e1b76bcb25b5-getty-666873936.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_33869-20-types-of-college-roommates-you-can-expect-to-encounter-during-four-years-of-dorm-life_1540938669.html","title":"20 Types of College Roommates You Can Expect to Encounter During Four Years of Dorm Life","title_page":"20 Types of College Roommates You Can Expect to Encounter During Four Years of Dorm Life","title_rss":"NULL","source_domain":"bustle.com","text":"It’s been a long time since I first went off to college — but I can still distinctly remember all the characters I met during my time in the dorms. Sure, the exact personas of these folks might mutate a little from generation to generation; time marches onward, whether we want it to or not. By and large, though, at their very core, they're all still the same classic types.\nOne of the key skills you learn in college that isn't taught in any of your classes is how to live with other people. Odds are you'll end up living with at least one other person after you graduate, so do yourself a favor and learn how to be a good roommate now. Some of your roommates will return the favor; others might not. Either way, though, you’re probably going to encounter at least a few of the different types listed here.\nLuckily, though, we live in the age of the Internet; that means that there are loads of articles (like this one from BuzzFeed) and apps and tools (may we suggest Homeslice?) out there that will help you and the other people co-habiting your space figure out how to be the best roommates possible.\nNow grab your shower caddy, firmly affix your whiteboard to your door, and let’s get rolling!\n1. The Neat Freak\nIf you’re relatively tidy, you’ll probably get along fine with this super organized germaphobe; but if you’re not, be prepared for lines to be drawn. Literally — she’ll use tape to delineate clearly which side of the room is hers and which side is yours. Do not let any of your things cross that line. Ever.\n2. The One Who Thinks All Your Stuff Is for Sharing\nIf you suddenly notice your favorite dress has gone missing or that the box of Cheerios you opened yesterday is now mysteriously empty, you’re probably living with this mooch. It’s not that she’s mean-spirited; she just has a very loose sense of boundaries. Talk to her about it calmly first — with luck, she’ll realize the error of her ways and stop using your things without asking. If she doesn’t, though, invest in some lockable storage containers. She can’t use what she can’t get to.\n3. Hermione Granger\nShe was probably valedictorian, but no matter how smart she is or how good her study habits are, she’s still always worried she’s going to fail all of her classes. She’s incredibly sweet, but also incredibly high strung; sometimes you have to drag her out with you just to keep her from going nuts (and driving you batty right along with her). She would move into the library if she could — not because she doesn’t like you, but because she’ll be in the ideal study environment all day, every day.\n4. The One With the Significant Other from High School\nExpect this one to be on the phone a lot. She’ll be in a constant state of missing her SO, and they’ll probably break up every Friday before tearfully getting back together on Sunday. If the SO lives or goes to school nearby, you’ll either A) see a lot of him or her, because s/he’s always over visiting, or B) never see your roommate, because she’s always visiting her SO. She’s nice, but sometimes you kind of wish she existed outside of her relationship.\n5. The Athlete\nEarly to bed and early to rise is this girl’s motto. As long as you’re both able to keep quiet while the other one is sleeping, you should get along just fine — although be prepared for a lot of sweaty workout gear to heap itself into piles on the floor.\n6. The One Who Has No Idea How to Take Care of Herself\nShe’s never done her own laundry before, she’s never had to make decisions with regards to what she eats, and sometimes, her mom comes over just to change her bed for her because she can’t figure out how to do it herself. Sometimes it’s a miracle that she’s able to tie her own shoes, let alone get to class on time.\n7. The Budding Musician\nShe’s only going to college so she has something to fall back on if her music career doesn’t pan out. She might be talented enough to make it; but then again, she also might only think she’s talented enough to make it. But hey, at least she can play your favorite Ani DiFranco song on her beat-up — er, “artfully distressed” — acoustic guitar.\n8. The One Who Throws Awesome Parties: Classy Edition\nWine, cheese, and cocktails are this gal’s jam; she dresses like Audrey Hepburn and she knows everything there is to know about throwing the best soirees campus has ever seen.\n9. The One Who Throws Awesome Parties: Kegger Edition\nLike her classier cousin, she knows how to have a good time — although her idea of “a good time” means kegs, frat boys, and flip cup. If you like to party, you’ll get along famously with her; just give your liver a rest ever now and again, OK?\n10. The One Who Sexiles You All the Time\nAlmost every time you come home, you’ll see the sock on the doorknob that indicates your roomie is busy gettin’ busy. This means you’ll spend an unfortunate amount of time sleeping on your across-the-hall neighbor’s floor. Of course, at least this roommate isn’t…\n11. …The One Who Has Sex While You’re in the Room\nI see no shame in freely exercising your sexuality, but it’s just bad manners to have sex when your roommate is asleep (or pretending to be) in the bed next to yours. It doesn’t matter how quiet you think you’re being; she’ll still know, and it will be intensely awkward. A word of advice: Don’t be this roommate.\n12. The Gourmand\nNo one — and I mean no one — knows how to turn dining hall fare into a gourmet, five-course meal like the Gourmand. The only downside is that if you have access to a kitchen, sometimes she’ll start breaking out the pots and pans at three in the morning.\n13. Jennifer Jason Leigh\nShe just thinks you’re the bee’s knees, which is flattering at first… until she sets up her schedule to match yours, starts completely copying your style, and tries to steal all your friends and romantic interests. If you suspect you’re living with someone who’s trying to Single White Female you, watch your back. Things could get messy.\n14. The Enigma\nWho is this girl? Where is she from? What’s her story? You’ll never know, because she won’t reveal a thing about herself. At least you’ll benignly co-habit the same space, even if you’ll never really get to know each other.\n15. The One Who Never Leaves the Room\nSeriously. You’re not sure you’ve ever seen her even go to the bathroom, let alone to class. She might be lonely or depressed, though, so try reaching out — maybe she’ll open up.\n16. The Polar Opposite\nApparently those little “roommate questionnaires” the office of residential life sends out mean absolutely nothing, because somehow, you were assigned a roommate who is the complete opposite of you in every possible way: Your sleep schedules don’t match up, your living habits are totally different, and you have absolutely nothing in common. If your school has a room swap option after you’ve been there for a month or two, it might be worth looking into.\n17. The One Who’s Busy Figuring Out Who She Is\nLike The One Who Has No Idea How to Take Care of Herself, this gal has never before experienced life without her family presiding over it. However, rather than floundering around with no idea what to do on her own, she relishes the opportunity, trying on new identities left and right. Sometimes it can be a little exhausting trying to keep up with her; she’s just such fun, though, that it’s hard to stay mad at her for long. That’s what college is for, right?\n18. The Passive-Aggressive One\nWhenever she has an issue with you — which will be often — she’ll either bottle it up inside until it explodes, or she’ll leave notes for you everywhere instead of speaking to you about it directly. The best way to deal with it is to be mindful of how your own behavior affects your roommate; it also helps to keep the lines of communication open on your end, so that hopefully you’ll both get comfortable enough actually talking to each other about your grievances. Notes are annoying.\n19. The Aggressive-Aggressive One\nOf course, there's also the one who says, \"Screw the notes, I'm getting all up in your face!\" Tread carefully, but don't let her start a fight club in your dorm room. Seriously. Bad idea.\n20. The Hetero Life Mate\nAh, the rarest of beasts! You’ll hit it off right away, and it’s like you’ve been friends for your entire life. You’re as close as sisters, you’re always there for each other, and if you get married, you’ll probably be each other’s maid of honor. Sure, you’ll have your ups and downs; you’ll always sort them out in the end, though. This one is a friend for life.","url":"https://www.bustle.com/articles/33869-20-types-of-college-roommates-you-can-expect-to-encounter-during-four-years-of-dorm-life"}
