{"authors":["Maria Yagoda"],"date_download":"2018-10-30 23:00:31","date_modify":"2018-10-30 23:00:31","date_publish":"2014-08-14 14:27:53","description":"Did you know that “freshman year” is actually Latin for “make a shit ton of mistakes?” Well, it is. And, yes, you will. No one wins freshman year, and if you try to, you're doing it wrong. The first year of college is all about making the essential…","filename":"data/vaneerConsumption/21MistakesYoullProbablyMakeFreshmanYearBecauseCollege.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/24ede675-382c-4dd2-87e7-82a95858771f.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_34596-21-mistakes-youll-probably-make-freshman-year-because-college_1540940431.html","title":"21 Mistakes You'll Probably Make Freshman Year, Because College","title_page":"21 Mistakes You'll Probably Make Freshman Year, Because College","title_rss":"NULL","source_domain":"bustle.com","text":"Did you know that “freshman year” is actually Latin for “make a shit ton of mistakes?” Well, it is. And, yes, you will. No one wins freshman year, and if you try to, you're doing it wrong. The first year of college is all about making the essential yet mortifying errors that form you as a person and define your college experience. Because: No parents! No rules! Free condoms! You are living with hundreds (sometimes thousands) of newly liberated, wildly horny 18-year-olds with passions and ideas and fresh fake IDs. Inappropriate shit is bound to happen.\nThe greatest part of freshman year, though, is that no one can judge you, because everyone is making the exact same mistakes — eating too many late night snacks, participating in power hours, procrastinating studying for (and then failing) finals, sleeping over at frat houses. The only person that can really judge you is Senior Year You, Post-Grad You, and pretty much all other iterations of You until you die. So live it up while you can.\nHere are 21 of the most common mistakes you'll make your freshman year of college. The sooner you accept their inevitability, the better.\n1. Eating ice cream for every meal\nJust because it’s there doesn’t mean it should be breakfast.\n2. Reading every word for seminar\nYou could read every word of the 80 books assigned to you each semester. Just know that this will make you miserable, and you still probably won't do well in the class.\n3. Skipping orientation\nAs goofy and redundant as freshman orientation events are, they can help you make friends, or at least First Month of Freshman Year Friends, who are crucial for navigating those first few awkward weeks of college. So suck it up and put some condoms on bananas.\n4. Knowing what you want to major in\nLololololol.\n5. Staying in a long distance relationship\nThis will never end well. In the off chance it does, and you and your long-distance lover survive college, you’ll have completely cut yourself off from making new friends, taking social risks, and having regrettable (but highly formative!) hook-ups.\n6. Dating the first person you make out with (who also lives on your hall, and/or is your lab partner)\nSo many kinds of hook-up mistakes to be made.\n7. Crossfading\nYou always think you can handle it, but you never can.\n8. Worrying About Gaining the Freshman 15\nLove it. Live it. Dream it. Believe it. Accept it.\n9. Enrolling in classes before 9 A.M.\nIt's cute that you think freshman year is about thriving academically, and that if you're super excited about an 8:30 a.m. class, you'll be able to make it on-time, every day. I know you want to learn Portuguese, but I promise you, when your alarm assaults at what feels like the crack of dawn, you'll want that extra hour of sleep MORE. SO MUCH MORE.\nHowever: If you can get your hands on a Sugar Hill Gang alarm clock, you'll be able to wake up for any class, at any time:\nOyv Lil on YouTube\n10. Signing up for all the activities\nThe moment you destroy your overachieving high school mentality is the moment you are free.\n11. Being pre-med\nOrganic chemistry ruins lives.\n12. Not sleeping during finals. Or not sleeping for any reason at all.\nSleep is your single most important asset freshman year (...assuming you've already purchased coffee, ramen, and condoms).\n13. Dieting\nSee #8. You're getting chunky. It's fine. Everyone is getting chunky. The second you stop eating is the second you start flipping tables.\n14. Comparing yourself to all the smart people\nYou're intimidated by all of the incredibly talented, intelligent people who make articulate comments in section. Maybe you've never used the words \"ostentatious\" or \"salient\" or \"in so much as\" before, and you're not sure you're ready.\nBut guess what? It doesn't matter. You're really talented and intelligent, too, whether or not you rock the pretentious academic lingo.\n15. Mocking campus police\nOr: Peeing in public places. Boning in public places. Vandalizing. Causing drunken mayhem in general.\n16. Assuming sweet-tasting things aren't that alcoholic\nJungle juice will ruin you. But you'll dance. Oh, how you'll dance.\n17. Looking nice for class\nFreshman year:\nSenior year:\n18. Having wildly premature existential crises\nYou're not allowed to freak out for a few more years, when shit actually gets real. No one expects you to have it together freshman year... and try not to associate with people who think they do.\n19. Friending all of your classmates on Facebook before you get to campus\nThere is nothing, nothing more awkward than meeting someone for the first time who you prematurely friended on Facebook months prior.\n20. Showing off during section\nBy all means, participate in section; ask questions, listen to the TA, even do the reading if you're so inclined. But don't be the Section Asshole. If your esoteric philosophical tangent runs section five minutes late, you will never be forgiven.\n21. Not making enough dumb mistakes\nNow's the time to make all the mistakes. Cherish every second of it.","url":"https://www.bustle.com/articles/34596-21-mistakes-youll-probably-make-freshman-year-because-college"}
