{"authors":["Francesca Chambers","White House Correspondent For Dailymail.Com","Nikki Schwab","U.S. Political Reporter For Dailymail.Com","Associated Press"],"date_download":"2018-10-23 04:19:23","date_modify":"2018-10-23 04:19:23","date_publish":"2016-01-29 20:01:31","description":"State is required to release more of Clinton's emails today as part of a court order. It will hold 22 back though because they contain high-level classified information.","filename":"data/vaneerConsumption/22HillaryClintonemailsweretopsecretandcanNEVERbepublished.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/20/30B50DF900000578-0-image-a-6_1454097680280.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423367_State-Department-hold-22-Clinton-s-emails-today-secret_1540268363.html","title":"22 Hillary Clinton emails were 'top secret' and can NEVER be published","title_page":"22 Hillary Clinton emails were 'top secret' and can NEVER be published | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The State Department says it will not release 22 of Hillary Clinton's emails today in its monthly, court-mandated dump because they are 'top secret.'\n'The documents are being upgraded at the request of the intelligence community because they contain a category of top secret information,' State Department spokesman John Kirby told the AP.\nHe described the decision to withhold documents in full as 'not unusual.'\nA Fox News source, however called these emails 'too damaging' to national security to release under any circumstances, the network reported.\nThe ruling means the emails won't be published online with the rest of Clinton's digital communications, even with blacked-out boxes.\nThe Clinton campaign quickly responded with a denial that Clinton's email account and home server contained state secrets.\n'This is overclassification run amok. We adamently oppose the complete blocking of the release of these emails,' said campaign spokesman Brian Fallon.\nSCROLL DOWN FOR VIDEO\nThe State Department says it will not release 22 of Hillary Clinton's emails today in its monthly, court-mandated dump because they are 'top secret'. Her campaign blasted the move from Iowa, where's she's speaking to voters today, and said it was 'overclassification run amok'\nThe campaign then said in a blast to reporters, 'We firmly oppose the complete blocking of the release of these emails.\n'Since first providing her emails to the State Department more than one year ago, Hillary Clinton has urged that they be made available to the public. We feel no differently today.'\nThe Clinton campaign decried the process used to release the former cabinet official's emails as one that has 'been dominated by bureaucratic infighting that has too often played out in public view.'\n'The loudest and leakiest participants in this interagency dispute have now prevailed in blocking any release of these emails.'\nIt argued that emails in question were not marked top secret at the time they were sent 'and have been called 'innocuous' by certain intelligence officials.'\nFurthermore, her campaign said, the emails were likely sent through State's unclassified system and remained that way 'for years.'\nOne of the messages, Fallon said, involves information that was public, having already been detailed in a news article.\n'This appears to be over-classification run amok,' he again stated. 'We will pursue all appropriate avenues to see that her emails are released in a manner consistent with her call last year.'\nThe Obama administration confirmed for the first time today that Clinton's unsecured home server contained some of the U.S. government's most closely guarded secrets, censoring nearly two dozen with material demanding one of the highest levels of classification.\nSeven email chains are being withheld in full , the Associated Press reported, because they contain information deemed to be 'top secret.'\nThe 37 pages include messages recently described by a key intelligence official as concerning so-called 'special access programs' — a highly restricted subset of classified material that could point to confidential sources or clandestine programs like drone strikes or government eavesdropping.\nDepartment officials wouldn't describe the substance of the emails to AP or say if Clinton sent any herself.\nThey also wouldn't disclose if any of the documents reflected information that was classified at the time of transmission, but indicated that the agency's Diplomatic Security and Intelligence and Research bureaus have begun looking into that question.\nThe revelation comes just three days before the presidential nomination fight between Clinton and U.S. Senator Bernie Sanders unfolds in Iowa.\nClinton, the front-runner for the Democrats, has insisted she never sent or received information on her personal email account that was classified at the time.\nNo emails released so far were stamped 'CLASSIFIED' or 'TOP SECRET,' but reviewers previously had designated more than 1,000 messages at lower classification levels for public release. Today's are the first at the top secret level.\nFor those that Clinton only read, and didn't write or forward, she still would have been required to report classification slippages that she recognized. But without classification markings, that may have been difficult, especially if the information was in the public domain.\nKirby said the State Department's focus as part of the Freedom of Information Act review of Clinton's emails was on 'whether they need to be classified today.' Questions about their past classification, he said, 'are being, and will be, handled separately by the State Department.'\nPossible responses for classification infractions include counseling, warnings or other action, State Department officials said, though they declined to say if these applied to Clinton or senior aides who've since left the department.\nThe officials weren't authorized to speak on the matter and spoke to AP on the condition of anonymity.\nClinton, the front-runner for the Democratic presidential nomination, has insisted she never sent or received information on her personal email account that was classified at the time\nToday is the deadline for State to release the final batch of the more than 55,000 pages emails Clinton turned over to the government last year.\nIt is sitting on 9,000 pages and told a court that it cannot get them all out today.\nThe federal entity has asked for a one-month extension to finish the tedious job that includes running the former secretary of state's emails by multiple government agencies that have a vested interest in making sure sensitive information is not released to the public.\nIt is expected to release roughly 1,000 of Clinton's later today.\nState's excuse for failing to complete the court order in time is a blizzard that hit Washington last week and shut down the government for two business days and an entire weekend, pushing it into overtime.\nThe release comes at an awkward time for Clinton.\nThe Iowa caucus is on Feb. 1, and her main challenger, Sanders, is running neck and neck with her in the polls there and leads solidly in New Hampshire. Clinton still holds a strong advantage in national polls.\nThe emails have been an issue for Clinton's campaign since it became known 10 months ago that she exclusively used a nongovernment account linked to a homebrew server while in office.\nDonald Trump was quick to attack Hillary Clinton after learning that 22 of her emails were 'top secret' and cannot be released to the public\nSanders, who has the most currently to gain from the email scandal, wouldn't attack.\n'As I said at the first Democratic debate, there is a legal process in place which should proceed and not be politicized. The voters of Iowa and this nation deserve a serious discussion of the issues facing them,' the Vermont senator said in a statement.\nRepublicans, however, had a field day.\nFrontrunner Donald Trump called the release a 'disaster.'\n'At a minimum, how can someone with such bad judgement be our next president?' he added.\nBoth Chris Christie and Marco Rubio said the revelation 'disqualified' Clinton from being president.\n'Now didn't she look us in the eye and tell us that there was not a bit of classified information on her personal server?' Christie said today before a room of Iowa voters. 'She has now definitively, without any question, lied to us.'\n'Hillary Clinton put some of the highest, most sensitive intelligence information on her private server because maybe she thinks she is above the law,' Rubio said at a campaign stop today. 'This is unacceptable. This is a disqualifier.'\nRNC Chairman Reince Priebus also smacked Clinton.\n'Democrats will have to decide whether they really want to nominate a candidate who could face severe legal repercussions in the middle of the campaign and who has so brazenly violated the public trust with her reckless disregard for our national security,' he said in a statement today.\nClinton first called the decision a matter of convenience and then termed it a mistake, even if doing so wasn't expressly forbidden. But the matter could prove more troublesome now that Clinton's former agency has confirmed that business conducted over the account included top-secret matters.\nLike Clinton, the State Department discounted such a possibility last March.\nBoth also said her account was never hacked or compromised, which security experts assess as unlikely, and that the vast majority of her emails were preserved properly for archiving purposes because she corresponded mainly with government accounts.\nThey've backtracked from the archiving claim, while the AP discovered several phishing attempts on her server connected to Russia.\nThe question of special access programs first surfaced last week, when Charles I. McCullough, the inspector general for U.S. intelligence agencies, cited examples on Clinton's account in a letter to Congress.\nRepublicans pounced on the report, though Clinton's campaign insisted none of the exchanges were 'classified at the time' and accused McCullough and GOP lawmakers of selectively leaking materials to damage her presidential hopes.\nKirby confirmed that the 'denied-in-full emails' are among those McCullough recently cited. One of the emails, he said, was among those McCullough identified last summer as possibly containing top secret information.\nThe AP reported last August that one focused on a forwarded news article about the classified U.S. drone program run by the CIA.\nMADAM PRESIDENT? MAYBE: Clinton has struggled in surveys measuring her perceived trustworthiness and an active federal investigation, especially one buoyed by evidence that top secret material coursed through her account, could negate one of her main selling points for becoming commander in chief: Her national security resume\nSuch operations are widely covered and discussed in the public sphere, including by top U.S. officials, and the State Department immediately pushed back against McCullough's claim. The other concerned North Korean nuclear weapons programs, according to officials.\nAt the time, several officials from different agencies suggested the disagreement over the drone emails reflected the government's tendency to over-classify material, and the lack of consistent policies across difference agencies about what should and shouldn't be classified.\nThe FBI also is looking into Clinton's email setup, but has said nothing about the nature of its probe.\nIndependent experts say it is highly unlikely that Clinton will be charged with wrongdoing, based on the limited details that have surfaced up to now and the lack of indications that she intended to break any laws.\n'What I would hope comes out of all of this is a bit of humility' and an acknowledgement from Clinton that 'I made some serious mistakes,' said Bradley Moss, a Washington lawyer who regularly handles security clearance matters.\nLegal questions aside, it's the potential political costs that are probably of more immediate concern for Clinton.","url":"https://www.dailymail.co.uk/news/article-3423367/State-Department-hold-22-Clinton-s-emails-today-secret.html"}
