{"authors":["Chriss W. Street"],"date_download":"2018-10-30 19:09:48","date_modify":"2018-10-30 19:09:48","date_publish":"2016-09-11 17:00:27","description":"After the U.S. stock crash of 2.5 percent on Friday, September 9, Wall Street woke up to the risk of “Two Bumps and a Stumble.\"","filename":"data/vaneerConsumption/25PercentStockCrashWarnsofTwoBumpsandaStumble.json","image_url":"https://media.breitbart.com/media/2016/01/Stock-market-crash-Richard-Drew-Associated-Press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_09_11__1540926588.html","title":"2.5 Percent Stock Crash Warns of 'Two Bumps and a Stumble'","title_page":"2.5 Percent Stock Crash Warns of 'Two Bumps and a Stumble'","title_rss":"NULL","source_domain":"breitbart.com","text":"After the U.S. stock crash of 2.5 percent on Friday, September 9, Wall Street woke up to the risk of “Two Bumps and a Stumble” — i.e. when it takes two interest rate hikes to generate a market reaction.\nThe U.S. Federal Reserve manipulates interest rates in pursuit of its conflicting congressional dual mandate of attaining maximum employment and stable prices. Cutting interest rates tends to heat up the economy and generate jobs. But keeping interest rates too low for too long can cause speculative bubbles, followed by inflation. Eventually the speculative bubble bursts when the Fed raises interest rates to curb inflation.\nAlthough economists develop very complicated formulas to guide the appropriateness of raising or lowering interest rates, William McChesney Martin, the Federal Reserve Chairman in the 1950s and 1960s, simplified the task by commenting that the Fed’s job is “to take away the punch bowl just as the party gets going.”\nAfter the modern record of continually pushing down interest rates for eight years beginning September 18, 2007, the Fed hiked interest rates in December 2015 by 0.25 percent. Stock prices fell by 11 percent over the next two months.\nBut old-timers on Wall Street did not sell stocks in February. They know, from decades of experience, that there tends to be so much momentum from the public enjoying the “party,” that they would shrug off the Fed’s initial interest rate hike and increase buying. From mid-February to the close on September 8, stock prices rose by 16 percent.\nThe Wall Street Examiner reported on September 8 that the speculative “long” Dow Jones Industrial Average futures contracts reached an all-time-record high of 38,382. Speculative “long” S&P 500 futures also hit their highest level since June 2013 at 38,083 contracts.\nWith economists viewing this type of extreme speculative activity as a direct precursor to inflation, there is huge pressure on the Federal Reserve to raise interest rates.\nThe stock selling on September 9 was triggered by “hawkish” remarks supporting an interest rate increase from normally “dovish” Boston Fed President Eric Rosengren, one of the ten voting members of the Federal Reserve Open Market Committee (FOMC), which will vote on raising and lowering interest rates on September 21.\nBut selling turned into a crash after the even more “dovish” FOMC member Lael Brainard stated that she will take the very unusual step of giving a speech next week, presumably to justify why she has changed her mind and will vote for an interest rate hike.\nFrom an expectation of less than 30 percent last month that the Fed would raise interest rates, the probability of a .25-.50 percent interest hike on September 21 is now 76 percent.\nBy virtually all the established valuation methods, current U.S. stock prices were between 52 percent and 97 percent overvalued at the start of September, according to the highly respected and independent Advisor Perspectives’ website, which publishes hundreds of stock market data points.\nThe stock market is already falling in anticipation of the Federal Reserve’s second “bump” up in interest rates. The only question seems to be how big the “stumble” in prices will be.","url":"https://www.breitbart.com/local/2016/09/11/2-5-percent-stock-crash-warns-two-bumps-stumble/"}
