{"authors":["Kipp Jones"],"date_download":"2018-10-30 19:38:18","date_modify":"2018-10-30 19:38:18","date_publish":"2015-04-20 17:03:21","description":"More than five months after a group of hackers crippled Sony Pictures Entertainment, information from thousands of leaked documents and emails is still surfacing. |","filename":"data/vaneerConsumption/28LiesandOtherExcusesToldbyHollywoodAgentsforTheirFamousClients.json","image_url":"https://media.breitbart.com/media/2015/02/Hollywood-Sign-Planes-Reuters-Mario-Anzuoni.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_04_20__1540928298.html","title":"28 Lies and Other Excuses Told by Hollywood Agents for Their Famous Clients","title_page":"28 Lies and Other Excuses Told by Hollywood Agents for Their Famous Clients | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"More than five months after a group of hackers crippled Sony Pictures Entertainment, information from thousands of leaked documents and emails is still surfacing.\nPublished by WikiLeaks a week ago, 173,132 emails and 30,287 separate documents continue to shed light on private conversations and industry practices, and demonstrate the inner-workings of a major Hollywood studio.\nThe latest of those emails being this hilarious list of excuses told by talent agents, as revealed through a private conversation.\nIn an email exchange in April of 2014 to former SPE co-chairman Amy Pascal, Screen Gems president Clint Culpepper vented about a client of Hollywood agent Chris Andrews struggling to finish reading a script, reports Variety.\nCulpepper told Pascal in an email, “Chris Andrews told me that an actor was still reading the script every week for 7 weeks. Finally I said, ‘What page is he on?’”\nPer the site, Pascal asked Culpepper, “What are the worst things an agent can say?… 1. How can I convince you/ change your mind 2. He won’t go in a pool … What else.”\nThe Screen Gems head then replied with a comprehensive list of excuses he’s heard from agents about difficult or unavailable Hollywood actors throughout his career.\nAs reported by TheWrap:\nI’ll get right back to you.\nHe’s got a lot of heat on him right now.\nHe’ll even read for it if necessary.\nAll those stories of what a nightmare he is have all taken place when he was using. He’s been sober again for over a month this time.\nI thought that was just a reading offer.\nHe won’t read.\nHe can’t read.\nHe won’t play gay.\nWe’ve left word for him on his cell and home phone.\nShe was born with those lips. Believe me. She would never tamper with her face. She’s an actress. It’s her instrument.\nI don’t have amazing news.\nEvery other studio in town is offering him everything.\nDonna loves him (likely a reference to Donna Langley, chairman of Universal Pictures)\nEvery director had a first film.\nThis is right in your wheel house.\nI know I made the deal. But call his new agent. He’s not my problem anymore.\nHe’s changed. I swear. Just meet with him and you’ll see.\nI’ve got Kevin Huvane for you. Fine. He insists on holding.\nHis English has gotten better than when you met him. When did you meet him again?\nTrust me when I tell you that he was the talk of Sundance. Every other studio is offering him leads.\nHis manager is attached to produce.\nHe definitely wants to do it. And he loves it so much he wants to direct it. (Pause). Hello?\nI’m in the canyon so if I lose you please understand. I’ll get back to you as soon as I get a signal.\nHe’s hired a trainer. And based on his metabulism (sic), his trainer says he can easily lose at least 50 lbs before you start [physical production].\nI hate making this phone call. Trust me. She didn’t realize she was pregnant when we made the deal. Her doctor is insisting that she could lose the baby if she does the film.\nHope your ears were burning. You were the subject of our staff meeting this morning.\nHis girlfriend produces all his films. OK. He’s only done one film. But it’s still a deal breaker. Hello?","url":"https://www.breitbart.com/entertainment/2015/04/20/sony-hack-28-lies-and-excuses-told-by-hollywood-agents-for-their-famous-clients/"}
