{"authors":["Lucia Peters"],"date_download":"2018-10-30 22:46:07","date_modify":"2018-10-30 22:46:07","date_publish":"2014-08-14 19:44:14","description":"Regardless of whether you actually liked school as a kid, there was always a thrill in the air when September rolled around each year. Me? I loved back-to-school time. Granted, I was generally a fan of school — I liked to read and thought learning…","filename":"data/vaneerConsumption/28ThingsAboutGoingBacktoSchoolinthe90sThatRockedOurTrapperKeepers.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/7/10/f9f27a46-081e-4652-96ac-3de802c1a90b-getty-471853124.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35661-28-things-about-going-back-to-school-in-the-90s-that-rocked-our-trapper-keepers_1540939567.html","title":"28 Things About Going Back to School in the ‘90s That Rocked Our Trapper Keepers","title_page":"28 Things About Going Back to School in the ‘90s That Rocked Our Trapper Keepers","title_rss":"NULL","source_domain":"bustle.com","text":"Regardless of whether you actually liked school as a kid, there was always a thrill in the air when September rolled around each year. Me? I loved back-to-school time. Granted, I was generally a fan of school — I liked to read and thought learning new things was fun, both of which are habits I’ve hung onto as an adult — but there was something extra exciting about getting all ready for your first day back after a few months away. Between sprucing up your wardrobe, getting new shoes (because let’s face it: When you’re a kid, you outgrow your shoes all the freakin’ time), and organizing your school supplies, you couldn’t help but get swept up in the fun, even if it lost its sheen after the first few days.\nAdd to that the nostalgia most of us ‘80s and ‘90s kids feel for most of the trappings of our childhood, and well … sometimes I almost wish I actually was going back to school right about now. Since I don’t happen to have a time machine squirreled away in my back pocket, though, I guess I’ll have to settle for a little Throwback Thursday action instead. Grab your Trapper Keepers, get your Lisa Frank stickers ready, and let’s get ready to head back to school, ‘90s-style!\n1. Getting the letter in the mail that told you who your teacher was going to be for the upcoming year\nThis was only applicable for elementary school kids; but man, was the day that letter arrived exciting or what?\n2. And then calling all your friends to find out who else was going to be in your class\nBefore the days of email and IM, we had to actually, y’know, pick up the phone — which was a landline, of course — every now and again.\n3. All those back-to-school-themed catalogs that the mail carrier stuffed in your mailbox\nYou may or may not have actually shopped using them — this, by the way, also involved using the phone due to the fact that online shopping didn’t exist yet — but they sure were fun to look through.\n4. Picking out which scrunchie to wear on the first day of school\n5. And the outfit to go with it\nBecause of course everything had to be coordinated, from your hair accessory all the way down to your jellies.\n6. Shopping for the perfect Trapper Keeper\n7. And the folders to snap inside of it\n8. And a backpack to hold it all\nSome pledged their allegiance to L. L. Bean; others, to Jansport; but me? I loved my teal Lands' End Collegiate backpack so very, very much.\n9. The first bus trip of the year\nIt got old really fast — especially if, like me, you were one of the first stops in the morning and one of the last ones at the end of the day, but oh well. It was fun while it lasted.\n10. And the brand new mix tape for your Walkman you specifically made to keep you occupied on the bus after it lost its charm\nWhat is this \"iPod\" of which you speak?\n11. Finding out where your locker for the year was\n“Please let it be near my BFF’s, please let it be near my BFF’s…”\n12. And snapping your Master Lock on it for the first time\nJust, y’know… make sure you write your combination down somewhere safe first.\n13. New pencil smell\nBack when the pencils we used were made of wood instead of plastic.\n14. Especially when they had pencil grips on them\nNot the Internet kind.\n17. Two words: Lisa Frank\n18. The first page of a fresh notebook\nSo many possibilities!\n19. And the first glimpse of a clean, un-drawn-upon chalkboard\n20. Or whiteboard\n21. The year's first appearance of the almighty overhead projector\n22. Packing your Ninja Turtles lunchbox with loving care\n23. If you were lucky, you had a Squeeze-It waiting for you inside\nwtcvidman on YouTube\n24. And maybe a Fruit Roll-Up or Fruit by the Foot\nwtcvidman on YouTube\n25. Or the holy grail of packed lunches: Pizza Lunchables\nHamptonRoadsTVFan on YouTube\nThese? Were definitely the best. Even if they were full of processed crap that wreaked havoc on our little 8-year-old systems.\n26. Recess!\nBoth the daily event and the television show.\n27. The triumphant return of the Scholastic Book Club\nThe excitement you felt on the day you got those little order forms was second only to the thrill you got the day your books arrived.\n28. Looking forward to everything to come\nThe novelty always wore off after the first week or so, but the best part about going back to school was dreaming about everything the year ahead of you held. Here’s to the future!\nImages: Rebloggy; Giphy (12); Gif Bin; eBay (8); Wiffle Gif; Teachers Help to Shape the Future/Tumblr; Gif Soup","url":"https://www.bustle.com/articles/35661-28-things-about-going-back-to-school-in-the-90s-that-rocked-our-trapper-keepers"}
