{"authors":["Maggie Mcneary"],"date_download":"2018-10-30 21:35:11","date_modify":"2018-10-30 21:35:11","date_publish":"2017-01-23 00:00:00","description":"Two Arkansas brothers are accused of kidnapping a man Saturday and forcing him to dig his own grave, authorities say. One of the men has been arrested, but the other remains at large.","filename":"data/vaneerConsumption/2Arkansasbrothersaccusedofkidnappingmanforcinghimtodiggraveauthoritiessay.json","image_url":"https://media.arkansasonline.com/img/photos/2017/01/23/Michael_Tommy_Phillips_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_jan_23_faulkner-c_9f18cd1d65bd9b74ee2fbf3ec0990f82__page=1_1540935311.html","title":"2 Arkansas brothers accused of kidnapping man, forcing him to dig grave, authorities say","title_page":"2 Arkansas brothers accused of kidnapping man, forcing him to dig grave, authorities say","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Two Arkansas brothers are accused of kidnapping a man and forcing him to dig his own grave, authorities say. One of the men has been arrested, but the other remains at large.\nADVERTISEMENT\nMore headlines\nAccording to a news release, the Faulkner County sheriff’s office received a call Saturday from someone who described witnessing a man being forced into a vehicle on Brannon Landing Road, according to a news release.\nWhen deputies found a vehicle matching the witness's description on Allen Drive, they found three people, officials said. Deputies were told that Michael and Tommy Phillips forced the kidnapping victim and another man to dig their own graves at gunpoint, the release said.\nDeputy Adam Bledsoe said authorities are still investigating how the second victim got involved.\nThe two victims told authorities that Tommy Phillips ran into the woods.\nWhile searching the area, authorities said, they found a shovel, a green chainsaw, a black ax, freshly disturbed dirt and a hole in the ground.\nBledsoe said Michael Phillips was arrested and charged with kidnapping and criminal attempt to commit capital murder. Tommy Phillips is at large and wanted for questioning, according to the release.\nAnyone with information on Phillips is asked to call the Faulkner County sheriff’s office at (501) 450-4917.\nRead Tuesday's Arkansas Democrat-Gazette for full details.","url":"https://www.arkansasonline.com/news/2017/jan/23/faulkner-county-man-arrested-kidnapping-attempt-co/?page=1"}
