{"authors":["Alanna Bennett"],"date_download":"2018-10-30 23:55:10","date_modify":"2018-10-30 23:55:10","date_publish":"2014-08-12 21:04:06","description":"Listen, it's been a rough couple of days. Tear gas and rubber bullets are being used against crows in Ferguson, Missouri, after the death of unarmed teenager Michael Brown at the hands of a police officer, and Robin Williams was found dead of an…","filename":"data/vaneerConsumption/2ChainzSongCalmsCryingBabyProvesRapMusicIsntJustForAngstyTeensVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/57c796e4-0d95-4ffb-b8a6-9b61f6c48e0c.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35510-2-chainz-song-calms-crying-baby-proves-rap-music-isnt-just-for-angsty-teens_1540943710.html","title":"2 Chainz Song Calms Crying Baby & Proves Rap Music Isn't Just For Angsty Teens - VIDEO","title_page":"2 Chainz Song Calms Crying Baby & Proves Rap Music Isn't Just For Angsty Teens — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Listen, it's been a rough couple of days. Tear gas and rubber bullets are being used against crows in Ferguson, Missouri, after the death of unarmed teenager Michael Brown at the hands of a police officer, and Robin Williams was found dead of an apparent suicide. Things aren't looking so great out there. And so you, like me, might need something to cleanse your palate — something to remind you that there is joy someplace out there in the world. It might help you get through the day, just like it's helping me. Which is why you should watch this video of this baby bouncing to 2 Chainz.\nC'mon, guys, we need this. This baby certainly needed this: It was crying, as babies do, and so some unidentified adult started blasting a 2 Chainz song. The baby was super into it.\nTo be fair, this particular tune — I'm not heavily versed on my 2 Chainz, forgive me — does contain elements reminiscent of a baby-friendly music box. But once the beat really kicks in is also when the baby really kicks in. The bouncing, you guys! The bouncing is so cute!\nLet this be known: When a baby is crying — or when you just need a lift in your day — play them the hip music and film it. It's to the benefit of everyone.\nTheBlkbltbld on YouTube\nImage: TheBlkbltbld/Youtube","url":"https://www.bustle.com/articles/35510-2-chainz-song-calms-crying-baby-proves-rap-music-isnt-just-for-angsty-teens"}
