{"authors":["Associated Press"],"date_download":"2018-10-23 04:02:06","date_modify":"2018-10-23 04:02:06","date_publish":"2016-01-29 19:41:10","description":"BOSTON (AP) — Two American endurance athletes have redefined the meaning of the term \"globetrotter\" by running seven marathons in seven days on all seven con...","filename":"data/vaneerConsumption/2fromUSjoineliteclub7marathons7days7continents.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:4a93f94814cd4ec4a9315e3f358d3eab-3bmscybNe842cce83474b594cf56-794_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423102_2-US-join-elite-club-7-marathons-7-days-7-continents_1540267326.html","title":"2 from US join elite club: 7 marathons, 7 days, 7 continents","title_page":"2 from US join elite club: 7 marathons, 7 days, 7 continents | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"2 from US join elite club: 7 marathons, 7 days, 7 continents\nBOSTON (AP) — Two American endurance athletes have redefined the meaning of the term \"globetrotter\" by running seven marathons in seven days on all seven continents.\nAnd they both did it in world-record time.\nDaniel Cartica, of Chicago, and Becca Pizzi, of Belmont, Massachusetts, won the World Marathon Challenge on Friday — the first U.S. competitors to sweep the strength-sapping event.\nWorld Marathon Challenge winners Becca Pizzi, left, from Belmont, Mass., and Daniel Cartica, from Poughkeepsie, N.Y., pose with an American flag after the seventh and final leg of the World Marathon Challenge, Saturday, Jan. 30, 2016, in Sydney, Australia. The pair completed seven marathons in seven days on all seven continents. (AP Photo/Rob Griffith)\nCartica, a U.S. Marine Corps captain, and Pizzi, a day care center operator, finished with a beachfront marathon in Sydney. They and 13 others began Jan. 23 with a marathon in Antarctica, where the sub-zero temperatures caused Pizzi's iPod to freeze and burst.\nIn between, on consecutive days, they ran 26.2 miles in Chile, Miami, Spain, Morocco and the United Arab Emirates. Cartica averaged around three hours, 33 minutes per marathon, with an event best of 3:12:46 in Chile. Pizzi averaged well under 4 hours; her fastest was 3:41:20 in Miami.\nThey now join a club more elite than those who have voyaged into space or scaled Mount Everest.\n\"We just made history,\" Pizzi told The Associated Press. \"I believed in myself since the moment I signed up for it. I went for it and got it done. When you believe in yourself, anything is possible.\"\nCompetitors squeezed the seven marathons in a span of 168 hours — 59 of those spent trying to recover aboard the charter flight that shuttled them 23,560 miles to all the continents.\nAlong the way, they had to cope with extreme cold and heat as well as wildly varying running surfaces: snow in Antarctica, sand in the Sahara.\nCartica, 27, who grew up in Poughkeepsie, New York, dedicated his run to the four Marines and sailor killed in July when a gunman attacked a U.S. Naval Reserve Center in Chattanooga, Tennessee.\nPizzi, 35, was the first woman across the finish line in all seven races.\nHer highs? \"Antarctica and running on glaciers. It was absolutely stunning.\"\nHer lows? \"Antarctica and the cold. It was my favorite place and my least favorite place.\"\nThe 15 competitors gained a huge following on social media. Pizzi said they were all going back through thousands of emails and messages from well-wishers ahead of a celebratory lunch at the Sydney Opera House.\n\"We're not going to set our alarms,\" she said. \"And we're not going to run tomorrow.\"\n___\nOnline: http://www.worldmarathonchallenge.com\n___\nAssociated Press photographer Rob Griffith contributed to this report from Sydney. Follow Bill Kole on Twitter at https://twitter.com/billkole .\nBecca Pizzi of the United States, holds an American flag after winning the seventh and final leg of the World Marathon Challenge, Saturday, Jan. 30, 2016, in Sydney, Australia. Pizzi, from Belmont, Mass., and Daniel Cartica, of Poughkeepsie, N.Y, won the World Marathon Challenge, completing seven marathons in seven days on all seven continents. (AP Photo/Rob Griffith)\nBecca Pizzi, of the United States, gets set to cross the finish line to win the seventh and final leg of the World Marathon Challenge, Saturday, Jan. 30, 2016, in Sydney, Australia. Pizzi, from Belmont, Mass., and Daniel Cartica, of Poughkeepsie, N.Y, won the World Marathon Challenge, completing seven marathons in seven days on all seven continents. (AP Photo/Rob Griffith)\nDaniel Cartica, left, and Calum Ramm, both from the United States, cross the finish line in the seventh and final leg of the World Marathon Challenge, Saturday, Jan. 30, 2016, in Sydney, Australia. Cartica, from Poughkeepsie, N.Y, and Becca Pizzi, from Belmont, Mass., won the World Marathon Challenge, completing seven marathons in seven days on all seven continents. (AP Photo/Rob Griffith)\nBecca Pizzi of the United States, holds up her trophy after winning the seventh and final leg of the World Marathon Challenge, Saturday, Jan. 30, 2016, in Sydney, Australia. Pizzi, from Belmont, Mass., and Daniel Cartica, of Poughkeepsie, N.Y, won the World Marathon Challenge, completing seven marathons in seven days on all seven continents. (AP Photo/Rob Griffith)\nBecca Pizzi, of the United States, runs along Manly Beach during seventh and final leg of the World Marathon Challenge Saturday, Jan. 30, 2016, in Sydney, Australia. Pizzi, from Belmont, Mass., and Daniel Cartica, of Poughkeepsie, N.Y, won the World Marathon Challenge, completing seven marathons in seven days on all seven continents. (AP Photo/Rob Griffith)\nBecca Pizzi, of the United States, runs along Manly Beach during seventh and final leg of the World Marathon Challenge, Saturday, Jan. 30, 2016, in Sydney, Australia. Pizzi, from Belmont, Mass., and Daniel Cartica, of Poughkeepsie, N.Y, won the World Marathon Challenge, completing seven marathons in seven days on all seven continents. (AP Photo/Rob Griffith)\nBecca Pizzi, of the United States, runs along Manly Beach during the seventh and final leg of the World Marathon Challenge, Saturday, Jan. 30, 2016, in Sydney, Australia. Pizzi, from Belmont, Mass., and Daniel Cartica, of Poughkeepsie, N.Y, won the World Marathon Challenge, completing seven marathons in seven days on all seven continents. (AP Photo/Rob Griffith)\nBecca Pizzi of the United States, smiles a she looks at her trophy after winning the seventh and final leg of the World Marathon Challenge, Saturday, Jan. 30, 2016, in Sydney, Australia. Pizzi, from Belmont, Mass., and Daniel Cartica, of Poughkeepsie, N.Y, won the World Marathon Challenge, completing seven marathons in seven days on all seven continents. (AP Photo/Rob Griffith)\nBecca Pizzi, of the United States, crosses the finish line to win the seventh and final leg of the World Marathon Challenge, Saturday, Jan. 30, 2016, in Sydney, Australia. Pizzi, from Belmont, Mass., and Daniel Cartica, of Poughkeepsie, N.Y, won the World Marathon Challenge, completing seven marathons in seven days on all seven continents. (AP Photo/Rob Griffith)\nDaniel Cartica, left, and Calum Ramm, both from the United States, run along Manly Beach during the seventh and final leg of the World Marathon Challenge, Saturday, Jan. 30, 2016, in Sydney, Australia. Cartica, from Poughkeepsie, N.Y, and Becca Pizzi, from Belmont, Mass., won the World Marathon Challenge, completing seven marathons in seven days on all seven continents. (AP Photo/Rob Griffith)\nBecca Pizzi, of the United States, runs along Manly Beach during the seventh and final leg of the World Marathon Challenge, Saturday, Jan. 30, 2016, in Sydney, Australia. Pizzi, from Belmont, Mass., and Daniel Cartica, of Poughkeepsie, N.Y, won the World Marathon Challenge, completing seven marathons in seven days on all seven continents. (AP Photo/Rob Griffith)\nBecca Pizzi, of the United States, runs along Manly Beach during the seventh and final leg of the World Marathon Challenge, Saturday, Jan. 30, 2016, in Sydney, Australia. Pizzi, from Belmont, Mass., and Daniel Cartica, of Poughkeepsie, N.Y, won the World Marathon Challenge, completing seven marathons in seven days on all seven continents. (AP Photo/Rob Griffith)\nBecca Pizzi, of the United States, runs along Manly Beach during the seventh and final leg of the World Marathon Challenge, Saturday, Jan. 30, 2016, in Sydney, Australia. Pizzi, from Belmont, Mass., and Daniel Cartica, of Poughkeepsie, N.Y, won the World Marathon Challenge, completing seven marathons in seven days on all seven continents. (AP Photo/Rob Griffith)\nBecca Pizzi, of the United States, runs past supporters as she nears the finish line in the seventh and final leg of the the World Marathon Challenge, Saturday, Jan. 30, 2016, in Sydney, Australia. Pizzi, from Belmont, Mass., and Daniel Cartica, of Poughkeepsie, N.Y, won the World Marathon Challenge, completing seven marathons in seven days on all seven continents. (AP Photo/Rob Griffith)","url":"https://www.dailymail.co.uk/wires/ap/article-3423102/2-US-join-elite-club-7-marathons-7-days-7-continents.html"}
