{"authors":["Emma Pettit"],"date_download":"2018-10-30 22:17:19","date_modify":"2018-10-30 22:17:19","date_publish":"2017-03-15 00:00:00","description":"Two Little Rock men were arrested Tuesday in connection to multiple vehicle break-ins and a home invasion in Benton, officials said.","filename":"data/vaneerConsumption/2LittleRockmenarrestedinhomeinvasionvehiclebreakinspolicesay.json","image_url":"https://media.arkansasonline.com/img/photos/2017/03/15/FotorCreated_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_mar_15__1540937839.html","title":"2 Little Rock men arrested in home invasion, vehicle break-ins, police say","title_page":"2 Little Rock men arrested in home invasion, vehicle break-ins, police say","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Henry Lee Conley, 23, of Little Rock and Jacki Jamaal Fossette, 25, of Little Rock\nTwo Little Rock men were arrested Tuesday in connection to multiple vehicle break-ins and a home invasion in Benton last month, officials said.\nOn Feb. 24, several vehicle break-ins, including one that led to a home invasion, were reported to Benton police, according to a news release. The victims of the home invasion told police that three men, at least one of whom was armed, entered the residence and robbed them before they fled in an unknown direction, the release said.\nOn Tuesday, 23-year-old Henry Lee Conley and 25-year-old Jacki Jamaal Fossette, both of Little Rock, were arrested and charged with aggravated residential burglary, theft of property and 10 counts of breaking and entering, all felonies.\n“The communication with the public and hard work of our detectives is essential in successfully solving cases. We anticipate more arrests as this case progresses,\" Chief Kirk Lane said in the release.\nThe investigation is ongoing.","url":"https://www.arkansasonline.com/news/2017/mar/15/two-little-rock-men-arrested-after-robbing-home-be/"}
