{"authors":["Ashley Nerbovig"],"date_download":"2018-10-30 19:02:29","date_modify":"2018-10-30 19:02:29","date_publish":"2014-06-16 00:00:00","description":"Two men were apprehended after attempting to burglarize a Tractor Supply store in Benton using a U-Haul truck, police said Monday.","filename":"data/vaneerConsumption/2mentrytoburglarizestoretoddlerleftinvehiclepolicesay.json","image_url":"https://media.arkansasonline.com/img/photos/2014/06/16/Picture_1_t600.png?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2014_jun_16__1540926149.html","title":"2 men try to burglarize store; toddler left in vehicle, police say","title_page":"2 men try to burglarize store; toddler left in vehicle, police say","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Adam Darrough, 26, (left) and James Weddle, 47, (right) were charged with commercial burglary after officers witnessed them trying to steal tractor supplies from a Tractor Supply store in Benton.\nTwo men were apprehended after attempting to burglarize a Tractor Supply store in Benton using a U-Haul truck, police said Monday.\nJames Weddle, 47, and Adam Darrough, 26, were charged with commercial burglary, theft of property, theft by receiving and criminal mischief after officers witnessed them trying to steal tractor supplies from the Benton store, the Benton Police Department said in a statement.\nDarrough was also charged with child endangerment after leaving his 3-year-old child in a separate vehicle at the crime scene, police said.\nA third person was involved but was not caught, and detectives are searching for him, police said.\nOfficers responded to a business alarm at 17318 Interstate 30 and arrived in time to see a U-Haul truck backed up against the rear of the building, with the business's merchandise in the back of the truck, officials said.\nThe three men ran when they saw the officers. Weedle and Darrough were caught after a short foot pursuit, police said. The three had stolen the U-Haul as well as cut the back lock to Tractor Supply, and a lawnmower stolen from the store was found in the back of the U-Haul, officials said.\nThe investigation is ongoing, and anyone with information is encouraged to call the Benton Police Department at (501) 778-1171 .","url":"https://www.arkansasonline.com/news/2014/jun/16/tractor-supply-almost-robbed-suspects/"}
