{"authors":["Jillian Kremer Brandon Riddle"],"date_download":"2018-10-30 14:29:21","date_modify":"2018-10-30 14:29:21","date_publish":"2018-08-29 03:23:00","description":"Two people died in separate road accidents Sunday.","filename":"data/vaneerConsumption/2peoplekilledinwrecksonstatehighways.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_aug_29__1540909761.html","title":"2 people killed in wrecks on state highways","title_page":"2 people killed in wrecks on state highways","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Two people died in separate road accidents Sunday.\nA Mississippi woman died and another person was injured after a motorcycle crashed off an Arkansas highway Sunday, police said.\nThe wreck happened shortly after 8 a.m. on Arkansas 14 in Searcy County, according to a preliminary report from the Arkansas State Police.\nPolice say 49-year-old Melinda D. McCleer of Hernando, Miss., was traveling on a westbound Harley-Davidson at a downhill curve when the motorcycle left the highway and struck an embankment before hitting a tree.\nMcCleer suffered fatal injuries as a result, according to authorities.\nThe motorcycle's driver, 50-year-old James A. McCleer of Hernando, Miss., was also hurt in the crash.\nThe weather was listed as clear and the highway was said to be dry at the time.\nIn the past week, at least four people have died in motorcycle-related wrecks in the state, according to preliminary state police data.\nA 72-year-old Arkansan was killed in a crash Sunday afternoon after he lost control of his pickup in a highway's curve, state police said.\nThe wreck occurred shortly after 3 p.m. on U.S. 79 near McNeil in Columbia County.\nAccording to a preliminary report, Lonnie Henson of El Dorado was headed north on the highway in a 2002 Dodge Ram 1500 when the pickup traveled off the road in a curve.\nThe truck then hit a tree, and Henson suffered fatal injuries in the crash.\nAuthorities said the weather was clear and the road was dry at the time.\nADVERTISEMENT\nMore headlines\nMetro on 08/29/2018","url":"https://www.arkansasonline.com/news/2018/aug/29/2-people-killed-in-wrecks-on-state-high/"}
