{"authors":[],"date_download":"2018-10-30 20:41:20","date_modify":"2018-10-30 20:41:20","date_publish":"2014-07-18 22:11:35","description":"Two Atlanta men have been sentenced to federal prison for plotting a scheme to pose as police officers while robbing a drug stash house.","filename":"data/vaneerConsumption/2robberycrewmemberssenttofederalprison.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_robbery-crew-members-sentenced-federal-prison__1540932080.html","title":"2 robbery crew members sent to federal prison","title_page":"Atlanta News: 2 robbery crew members sent to federal prison","title_rss":"NULL","source_domain":"ajc.com","text":"Two Atlanta men have been sentenced to federal prison for plotting a scheme to pose as police officers while robbing a drug stash house.\nWoodrow Rudolph Dixon Jr., 42, was sentenced to serve 20 years with six years of supervised release and Cornelius Bernard Wilson, 45, was sentenced to serve 15 years with five years of supervised release, according to a news release from the office of U.S. Attorney Sally Quillian Yates.\nDixon, known as Dro, and Wilson, known as Dog-man, were part of a crew that planned to rob a man they knew as “Tony,” who was actually an undercover Drug Enforcement Administration officer, in June 2012, according to the release. On the day of the robbery, Dixon, who’d left town, directed other members of the crew over the phone, authorities said.\nCrew members who were to rob the stash house had police gear, badges and loaded firearms, officials said. Wilson, who was a member of the crew, was arrested by undercover agents with the Bureau of Alcohol, Tobacco, Firearms and Explosives. Dixon was arrested a few days later, after he returned to Atlanta.\nKirk Floyd, who was part of the crew, was convicted Nov. 25, along with Dixon, on charges of conspiracy to commit armed robbery, possession of firearms, and conspiracy to possess with intent to distribute cocaine, among other charges.\nWilson pleaded guilty on Dec. 3 to firearms and drug charges.\nFloyd is scheduled to be sentenced at a later date.","url":"https://www.ajc.com/news/robbery-crew-members-sentenced-federal-prison/uymf3yhc06zv4jirsJbkzO/"}
