{"authors":["Jillian Kremer"],"date_download":"2018-10-30 14:38:21","date_modify":"2018-10-30 14:38:21","date_publish":"2018-09-10 00:00:00","description":"Authorities said Monday that they have arrested and charged two Arkansas teens in the carjacking of a Democrat-Gazette carrier last month.","filename":"data/vaneerConsumption/2teenschargedincarjackingofDemocratGazettecarrier.json","image_url":"https://media.arkansasonline.com/img/photos/2018/09/10/Screen_Shot_2018-09-10_at_2.21.10_PM_t600.png?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_sep_10__1540910301.html","title":"2 teens charged in carjacking of Democrat-Gazette carrier","title_page":"2 teens charged in carjacking of Democrat-Gazette carrier","title_rss":"NULL","source_domain":"arkansasonline.com","text":"From left, 19-year-old Diarrius Cartell Carter of West Memphis and 18-year-old Fabian Burks of Forrest City - Photo by Shelby County, Tenn., sheriff's office / Craighead County sheriff's office\nAuthorities said Monday that they have arrested and charged two Arkansas teens in the carjacking of a Democrat-Gazette carrier last month.\nRobert Graham, 61, told officers he was delivering newspapers at an Exxon convenience store in Jonesboro, 207 N. Main St., around 5:20 a.m. Aug. 26 when the robbery occurred.\nAnother vehicle pulled up near his beige 2005 Honda Pilot, at which point two people got out, and one robber pointed a handgun at him, authorities said. The pair then fled in both vehicles.\nOn Tuesday, detectives traveled to interview 19-year-old Diarrius Cartell Carter of West Memphis, a news release states. He had been arrested there after a pursuit in a Memphis vehicle theft case. He was eventually charged in the holdup of the newspaper carrier, police said.\nAfter his arrest, family members of 18-year-old Fabian Burks of Forrest City took him to the police station to speak about the robbery, according to the release.\nHe faces a charge of aggravated robbery and remained at the Craighead County jail Monday afternoon in lieu of $200,000 bond, records show. A warrant has been issued for Carter's arrest, police said, but he was in custody in Memphis at the time of the release.\nAuthorities said they are still working to identify more suspects and recover the stolen SUV.\nLarry Graham, vice president of circulation at the Democrat-Gazette, previously estimated that about 150 newspapers were taken as a result of the carjacking.","url":"https://www.arkansasonline.com/news/2018/sep/10/2-teens-charged-carjacking-democrat-gazette-carrie/"}
