{"authors":["Russ Koesterich","The Blackrock Blog"],"date_download":"2018-10-31 00:12:58","date_modify":"2018-10-31 00:12:58","date_publish":"2014-09-22 00:00:00","description":"Countries’ growth, monetary policy and market performance are increasingly diverging.","filename":"data/vaneerConsumption/2ThemesInvestorsShouldFocusOnNow.json","image_url":"https://amp.businessinsider.com/images/54207ed069bedd833dbe14ca-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_2-themes-investors-should-focus-on-now-2014-9_1540944778.html","title":"2 Themes Investors Should Focus On Now","title_page":"    2 Themes Investors Should Focus On Now - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Flickr/tetsuya yamamoto As I've noted before, a major trend in today's global economy is increasing divergence. Different regions and countries continue to experience diverging growth and monetary policies, and performance among market segments continues to diverge too.\nAs I write in my new weekly commentary, \"World's Apart? Investing in an Era of Divergence,\" this trend is likely to continue into 2015. For example, we are starting to see evidence that monetary policies in the United States and the United Kingdom will further diverge from those in Europe, and market segment performance is also varying.\nLast week developed market equities rallied, with stocks benefiting from low inflation, accommodative monetary policy and continued good fortune in avoiding \"worst-case\" geopolitical scenarios. But emerging markets experienced outflows, struggling on concerns over increasingly erratic Russian policy, slower Chinese growth, higher U.S. rates and a stronger dollar.\nSo what does such divergence mean for investors? I recently wrote about three investing implications of an uneven global economy, including a stronger dollar, lower U.S. rates and a catalyst for international stocks. In my most recent commentary, I add to the list two themes that investors should focus on as year-end approaches:\nBe cautious of particularly rate-sensitive equity market segments.\nAn increasingly active debate is underway at the Federal Reserve (Fed), and we at BlackRock continue to believe that the Fed will begin to normalize policy next year, perhaps earlier than the market expects. A marginal tightening in U.S. monetary conditions suggests caution toward those segments of the U.S. equity market with hidden rate exposure.\nSuch segments include both small caps and certain defensive income plays, like utilities — both of which have historically proved more vulnerable to contracting valuations as real rates rise.\nFocus on relative value.\nGiven that most asset classes look expensive, I continue to prefer market segments that offer relative value. Currently, I see value in select international markets, particularly in Japan and emerging Asia. Despite Japanese equities hitting their best level since the fall of 2007, Japanese stocks are still relatively cheap. In emerging Asia, while flows have turned negative and China is struggling to hit its growth targets, I believe structural reforms in China, India and the rest of Asia should support these markets over the long term.\nYou can read more about my take on these particular asset classes in my latest \"Investment Directions\" monthly market outlook.","url":"https://www.businessinsider.com/2-themes-investors-should-focus-on-now-2014-9"}
