{"authors":["Michelle Moons"],"date_download":"2018-10-30 19:12:02","date_modify":"2018-10-30 19:12:02","date_publish":"2016-09-05 20:58:49","description":"Two unarmed correctional officers were in critical condition after an ex-convict shot them Saturday in the Fresno County jail lobby.","filename":"data/vaneerConsumption/2UnarmedOfficersShotInFresnoCountyJailLobby.json","image_url":"https://media.breitbart.com/media/2016/09/Screen-Shot-2016-09-05-at-1.52.23-PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_09_05__1540926722.html","title":"2 Unarmed Officers Shot In Fresno County Jail Lobby","title_page":"2 Unarmed Officers Shot In Fresno County Jail Lobby | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Two unarmed correctional officers were in critical condition after an ex-convict shot them Saturday in the Fresno County jail lobby, prompting officials to reconsider security at the jail.\nHowever, they said Sunday there were no immediate changes planned.\n37-year-old Thong Vang allegedly shot the head and neck areas of officers Juanita Davila and Toamalama Scanlan inside a public area, according to the Associated Press. The Fresno County Sheriff’s Office stated Sunday that Davila was in critical but stable condition, and Scanlan was in critical condition.\nKnown gang member Vang and fellow gang members kidnapped and raped three young girls — aged 12, 13 and 14 — in 1998, for which he served 16 years and was released on parole in 2014, Sheriff Margaret Mims said in a Saturday press conference. His parole officer communicated to Mims that Vang had no known criminal violations since then.\nJust after 8:30 am on Saturday morning, Vang was seen trying to cut the visitor’s line in the lobby of the Fresno County jail and began acting agitated, showing “bizarre behavior” and pacing in the vicinity of a secure area when experienced officer Davila confronted him. The AP reported that the facility is guarded by unarmed officers and that visitors must pass through metal detectors to get to secure areas.\nSheriff Mims stated that Davila confronted Vang. Vang then pulled a gun from his clothing and began shooting. Scanlan then also responded to the scene and was shot. An estimated 15 adult and child bystanders fled, according to the AP.\nAdditional jail personnel rushed to the scene, where a correctional lieutenant fired at, but did not hit, Vang. This lieutenant was the only person in the jail that was armed at that time, said Sheriff Mims. Mims stated that he will be put on paid administrative leave, concurrent with standard policy.\nOnce Sheriff’s deputies arrived, Vang showed his weapon and said he wanted to be arrested, according to Mims. He was treated for minor injuries, cuts and scrapes according to Mims.\nVang has been booked into the Fresno County jail on suspicion of attempted murder, being a felon in possession of a gun, and bringing drugs into a jail, according to the Fresno County Sheriff’s Office.\nThe county jail’s mail lobby was reopened on Sunday evening.\nSheriff Mims gave a press conference on Saturday during which she said there have been discussions for years about security at the jail. Discussions have included making correctional officers peace officers, and “determining who is armed and who is not within the jail. Of course not even deputy Sheriffs carry firearms on the floors of the jail. No one does.” Mims made a distinction between peace officers and custodial officers.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2016/09/05/2-unarmed-officers-shot-jail-lobby/"}
