{"authors":[],"date_download":"2018-10-30 19:45:15","date_modify":"2018-10-30 19:45:15","date_publish":"2018-08-03 19:31:37","description":"The DeKalb County Sheriff’s Office Fugitive Unit has arrested two additional suspects in the death of a man stabbed 33 times outside Decatur.","filename":"data/vaneerConsumption/2youngpeopleaccusedindeathofDeKalbmanstabbed33times.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/03/Images/Capture_448x280.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_young-people-acc_c54f7f254615be4cf0023ee6cf7068aa__1540928715.html","title":"2 young people accused in death of DeKalb man stabbed 33 times","title_page":"2 young people accused in death of DeKalb man stabbed 33 times","title_rss":"NULL","source_domain":"ajc.com","text":"The DeKalb County Sheriff’s Office Fugitive Unit has arrested two additional suspects in the death of a man stabbed 33 times outside Decatur.\nKessiah A. Rowe, 19, of Ellenwood, and Jared Kelvin Smith, 20, of McDonough, were arrested Wednesday on murder charges. Already in the county jail is Riki Ray Albury Jr., 18, of Marietta, who is also charged with murder in the June 28 death of Ronald Thomas-Roach. Albury has been jailed since July 10.\nREAD: Good things coming for notorious, crime-infested DeKalb complex?\nREAD: Meth, ‘the Devil’s drug,’ is back and killing more people than ever\nREAD: Woman, 24, killed in beating over watch, DeKalb cops say\nThe victim, 50, was found dead in his bedroom early in the morning at Flats of East Atlanta apartments on Flat Shoals Road.\nThe motive, police said, was robbery. It isn’t clear why Thomas-Roach would’ve been targeted for a robbery, but his car and phone were stolen.\nOn Wednesday, DeKalb investigators arrested Rowe at a business in Dunwoody and Smith at a business in Jonesboro.\nAll three suspects have no bond.\nLike DeKalb County News Now on Facebook | Follow on Twitter\nIn other news:","url":"https://www.ajc.com/news/local/young-people-accused-death-dekalb-man-stabbed-times/t2XAcPz8zkLnBMLSULqgBN/"}
