{"authors":["Merrit Kennedy"],"date_download":"2018-10-22 22:00:26","date_modify":"2018-10-22 22:00:26","date_publish":"2016-10-31 00:00:00","description":"Altogether, some 2 billion children worldwide are breathing air that has been deemed a \"long term hazard,\" a report finds. Pollution contributes to around 600,000 deaths annually of kids under age 5.","filename":"data/vaneerConsumption/300MillionChildrenAreBreathingExtremelyToxicAirUNICEFSays.json","image_url":"https://media.npr.org/assets/img/2016/10/31/ap_16288375073612_wide-cc8bebf4ae21cfafe70cc923c90ba3be38f8033d.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_10_31_500048135_300-million-children-are-breathing-extremely-toxic-air-unicef-says_1540245626.html","title":"300 Million Children Are Breathing 'Extremely Toxic' Air, UNICEF Says","title_page":"300 Million Children Are Breathing 'Extremely Toxic' Air, UNICEF Says : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"300 Million Children Are Breathing 'Extremely Toxic' Air, UNICEF Says\nEnlarge this image toggle caption Ng Han Guan/AP Ng Han Guan/AP\nSome 300 million children around the world are breathing highly toxic air, according to a new report from UNICEF.\nThe report, which uses satellite imagery to determine the impacted areas, says these children live in places \"where outdoor air pollution exceeds international guidelines by at least six times.\" Altogether, it states, some 2 billion children are breathing air that has been deemed a \"long term hazard,\" exceeding minimum standards set by the World Health Organization.\n\"Air pollution is a major contributing factor in the deaths of around 600,000 children under five every year — and it threatens the lives and futures of millions more every day,\" UNICEF Executive Director Anthony Lake said in a statement. \"Pollutants don't only harm children's developing lungs — they can actually cross the blood-brain barrier and permanently damage their developing brains — and, thus, their futures. No society can afford to ignore air pollution.\"\nThe report says poor air quality can have an outsize impact on children: Their lungs are still developing; their respiratory airways are more prone to blockages; they \"breathe twice as fast, taking in more air per unit of body weight, compared to adults.\"\nThe impact of living in a place with poor air quality extends far beyond childhood. As the report states, \"studies have shown that the lung capacity of children living in polluted environments can be reduced by 20 per cent — similar to the effect of growing up in a home with secondhand cigarette smoke.\"\nHere's more from the report on the impact:\n\"The combination of respiratory, cardiovascular, cognitive, morbidity and reproductive health effects of air pollution have biological as well as social and economic effects that last a lifetime. These include health conditions, school attendance, school performance, health costs and productivity, which affect income, poverty and inequalities. Air pollution, through its massive and cumulative impact on the overall health and well-being of children and parents, can perpetuate intergenerational cycles of inequality.\"\nBoth outdoor air pollution (such as pollution from a factory) and indoor air pollution (such as smoke from solid fuels used in cooking) are causing damage to children's health, the report finds. Outdoor air pollution is worse in \"lower-income, urban communities,\" while indoor air pollution is more prolific in \"lower-income, rural areas.\" At the same time, the report states that it can be difficult to tease out the impact of each, because individuals are constantly moving between the two environments.\nThe problem is getting worse because of industrialization, based on current projections. \"Unless action is taken to control outdoor air pollution, studies show that outdoor air pollution will become the leading cause of environment-related child death by 2050,\" the report states.\n\"South Asia has the largest number of children living in these areas, at 620 million, with Africa following at 520 million children,\" according to UNICEF. \"The East Asia and Pacific region has 450 million children living in areas that exceed guideline limits.\"\nA recent World Health Organization report said 92 percent of the world's population breathes air containing dangerous levels of pollutants.","url":"https://www.npr.org/sections/thetwo-way/2016/10/31/500048135/300-million-children-are-breathing-extremely-toxic-air-unicef-says"}
