{"authors":[],"date_download":"2018-10-30 18:22:19","date_modify":"2018-10-30 18:22:19","date_publish":"2017-03-10 18:07:00","description":"The year is 1987. Here are a few of the things that happened 30 years ago.","filename":"data/vaneerConsumption/30yearsagoWhathappenedin1987.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/MyAJC/2017/03/10/Images/Moreland%20interchange4.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_years-ago-what-happened-1987__1540923739.html","title":"30 years ago: What happened in 1987","title_page":"30 years ago: What happened in 1987","title_rss":"NULL","source_domain":"ajc.com","text":"The year is 1987. Here are a few of the things that happened 30 years ago.\nRonald Reagan is nearing the end of his second term as president. He nominated Robert Bork to fill a vacancy on the Supreme Court. He was later rejected by the Senate.\nA Belgian Ferry capsizes near Zeebrugge, killing 193 people.\nNASCAR phenomenon Bill Elliot, aka Awesome Bill from Dawsonville, set records at Daytona and Talladega.\nThe massive monument to vehicular movement now known as Spaghetti Junction opened. Then as now, it was officially known as the Tom Moreland Interchange (named for a former Department of Transportation Commissioner), but many were calling it Malfunction Junction. It even had an official nickname, chosen by a contest winner. Proving that you can’t really choose an official nickname, it’s rarely been referred to as the DeKalb Super Looper. Some things are forgotten for a reason.\nThe Jimmy Carter Library at the newly constructed Carter Center, opens to researchers.\n» Flashback photos: 30 years ago in Georgia, 1987 part one\nU2 releases “The Joshua Tree” and Michael Jackson releases “Bad.” The first episode of the TV series “Full House” airs and “The Simpsons” make their first appearance as short clips in “The Tracey Ullman Show.” “Platoon” won best picture at the 59th Academy Awards.\nAnd a baby named Jessica McClure falls down a well in Midland, Texas. The nation is captivated by the rescue effort, eventually successful.\nLiberace, Fred Astaire, James Baldwin, Rita Hayworth and Andy Warhol died.\nZac Efron, Colin Kaepernick, Tim Tebow, Blake Lively, Kendrick Lamar, Frank Ocean, Miles Teller, Ronda Rousey, Michael B. Jordan, Evan Peters, Brooklyn Decker, Samira Wiley and Diana DeGarmo were born.","url":"https://www.ajc.com/lifestyles/years-ago-what-happened-1987/vduvtfFF37LexCn1FnEttN/"}
