{"authors":["Ken Light","Chloe Coleman","Photo Editor Focusing On International News"],"date_download":"2018-10-21 03:05:08","date_modify":"2018-10-21 03:05:08","date_publish":"2018-08-22 10:00:46","description":"Ken Light discusses how his photographs of the U.S.-Mexico border in the '80s resonate with contemporary issues.","filename":"data/vaneerConsumption/30yearoldimagesshowhowlittlehaschangedintheplightofimmigrantsattheUSMexicoborder.json","image_url":"https://www.washingtonpost.com/resizer/R1N66olGhTxG859m7GjlDJCCDH8=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6UGLWTUL6I4RLHB67MV2R5FTTE.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_08_22__1540091108.html","title":"30-year-old images show how little has changed in the plight of immigrants at the U.S.-Mexico border","title_page":"30-year-old images show how little has changed in the plight of immigrants at the U.S.-Mexico border - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"San Ysidro, a district of San Diego north of the U.S.-Mexico border, at midnight on Jan. 14, 1985. (Ken Light/Contact Press Images)\nBrown Field Station in San Ysidro. (Ken Light/Contact Press Images)\nIn the early 1980s, I began traveling to the U.S.-Mexico border to take make photographs for my book “To the Promised Land.” I wanted to tell the story of people desperate to reach America. Although my own immigrant family had no visual record of our journey from Eastern Europe in the late 19th century, I’d always found inspiration in the photographer Lewis Hine, whose work in the early 1900s capturing Ellis Island and images of child labor that had stunned a nation with scenes meant to be hidden — breaker boys in the coal fields, doffer girls in America’s spinning mills, newsies, oyster shuckers. People who just wanted to support themselves and their families, not unlike those trying to cross the border all those years later. I was proud of the work I’d done — and then I focused on other subjects of social concern, the mainstay of my work.\nI returned to my contact sheets this year amid reports of harrowing immigration traumas, family separations, gang wars in Central America and a political debate on the subject that has barely advanced beyond where I left it 30 years ago. I’d hoped then that, despite the ascendancy of TV, the power of still photography was undeniably persuasive and could help shape the immigration conversation, if not shake public fears about immigrants.\nOn my first visit to the border in 1983, I was overwhelmed by what I witnessed. I photographed grown men hiding in bushes, crawling in tunnels, grandfathers with their hands held high in plaintive surrender, the wounds of a man beaten by bandits. Yet the saddest moments were those of the children, exhausted and caught in the middle: mothers and daughters huddled together, uncertain about what would come next; a young boy, maybe 10, sitting alone after his detention, looking sad and unsure. In those days, the Border Patrol was happy to have media on ride-alongs. I could photograph what agents saw as they saw it. The starkness of shooting at night, catching subjects with a strobe in the darkness, had an immediacy and urgency that underscored the struggle of those who had hiked for days, if not weeks.\nNight after night, from 4 p.m. until after dawn, for weeks on end, I photographed people trying to find safe harbor in the United States. Shooting at night was difficult: Film cameras in the ’80s had no autofocus, through-the-lens metering or ultrasensitive digital chips capable of shooting in low light like today. The border areas we traversed were pitch black (or darker on moonless nights). I couldn’t see through my viewfinder, much less focus. Relying on professional instinct and camera settings, I knew that within 10 feet, my images would be sharp; if I moved beyond those parameters, the flash would not deliver or the images would be soft.\nLooking today at my images from the ’80s reminded me how much time can stand still — not just in a photograph but also in the universe around it. On the border, little has changed. In Washington, little has changed. The faces are the same. Photography is a powerful medium: a way to observe our history unfiltered and make historical events resonate decades later. Even in an era dominated by social media, photography still continues to shock and surprise. A still image allows you to look deeply into a moment, without sound or editing splices; a photo just stares you in the face, confronting you. Pictures of injured or dead children — like Syrian refugee Alan Kurdi, found lying facedown on a Turkish beach — can activate deep emotions and sometimes spur a policy change.\nBut not always. And not on the U.S.-Mexico border. Not yet.\nKen Light is a photographer and a professor of photojournalism at the University of California at Berkeley’s Graduate School of Journalism. A version of this photo essay will appear in The Washington Post’s Outlook section on Sunday.\nSan Ysidro, March 29, 1986. (Ken Light/Contact Press Images)\nSan Ysidro, June 2, 1985. (Ken Light/Contact Press Images)\nEl Paso, March 29, 1985. (Ken Light/Contact Press Images)\nSan Ysidro, June 2, 1985. (Ken Light/Contact Press Images)\nSan Ysidro, Aug. 29, 1987. (Ken Light/Contact Press Images)","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/08/22/time-can-stand-still-not-just-in-a-the-photograph-but-also-in-the-universe-around-it-ken-light-discusses-us-mexico-border-images/"}
