{"authors":["Associated Press"],"date_download":"2018-10-23 04:17:41","date_modify":"2018-10-23 04:17:41","date_publish":"2016-01-28 20:06:04","description":"CAPE CANAVERAL, Fla. (AP) — Dozens of educators who competed alongside Christa McAuliffe to become the first teacher in space gathered Thursday to remember t...","filename":"data/vaneerConsumption/30yearssinceChallengerTeacherinSpacefinalistsgather.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:dd026bb4c6f5414282f2eea4a71057e4-4PuZeKVXE7cd9005b2c876101f1f-374_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421438_30-years-Challenger-Teacher-Space-finalists-gather_1540268261.html","title":"30 years since Challenger: Teacher-in-Space finalists gather","title_page":"30 years since Challenger: Teacher-in-Space finalists gather | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"30 years since Challenger: Teacher-in-Space finalists gather\nCAPE CANAVERAL, Fla. (AP) — Dozens of educators who competed alongside Christa McAuliffe to become the first teacher in space gathered Thursday to remember the seven astronauts who perished aboard Challenger 30 years ago.\nMcAuliffe's son, Scott, now 39, also took part in the emotionally charged ceremony, held on a bleak, drizzly morning just six miles from where his mother's space shuttle blasted off for the final time on Jan. 28, 1986.\nMany of the teacher-in-space semifinalists are retired now. They have gray hair. A few limp. But they still believe strongly in what McAuliffe hoped to accomplish aboard Challenger before disaster struck during liftoff.\nPeople attend a Day of Remembrance Ceremony to honor the lives of the seven crew members of the Challenger space shuttle on the 30th anniversary of the 1986 tragedy, at the Kennedy Space Center Visitor Complex on Thursday, Jan. 28, 2016. In addition to paying tribute to the Space Shuttle Challenger, they also honored all of those who have fallen since the beginning of the U.S. space program. (Tim Shortt/Florida Today via AP) NO SALES; MANDATORY CREDIT\n\"It's really hard\" to be back, said William Dillon, 77, a retired teacher who represented California in the competition back in the mid-1980s. He was at Kennedy Space Center for Challenger's launch and had gotten to know not only McAuliffe, but a few of the other astronauts on the doomed flight.\nLinda Preston, 61, also retired as a teacher, choked up as the names of the Challenger dead were read during the memorial service. The former space shuttle pilot reciting the names of all 24 astronauts killed in the line of duty over the years, Jon McBride, had to fight back tears.\n\"All of a sudden, I couldn't breathe,\" Preston later confided to a reporter. She represented Utah in the teacher competition.\nAbout 40 of the 113 remaining semifinalists for teacher-in-space traveled to Cape Canaveral for the anniversary commemoration, the biggest gathering ever for a NASA memorial like this.\n\"We felt we all wanted to be part of it,\" said Connecticut semifinalist David Warner, 63, who still teaches science, robotics and rocketry.\nLike so many of his colleagues, Warner wanted to see Kennedy's \"Forever Remembered\" exhibit that opened last summer. It contains the only piece of Challenger wreckage on public display, a 12-foot section of the left-side body panel complete with the U.S. flag, as well as personal belongings of the Challenger and Columbia crews.\nThe ceremony was one of several NASA memorials that took place Thursday at Arlington National Cemetery and elsewhere around the country.\nAt Kennedy, rain moved the ceremony indoors, directly in front of the \"Forever Remembered\" exhibit. The gathering took place beneath the suspended shuttle Atlantis, which in 2011 made the final shuttle flight.\nAfterward, McAuliffe and other children of the Challenger dead laid a wreath at the outdoor Space Mirror Memorial. Each guest received a rose or carnation to attach to the railing in front of the massive granite mirror.\nMcAuliffe, who works in education technology in Maine, said having his own two sons there with him — ages 6 and 8 — made it easier. It's time, he said, that his children see and learn firsthand all about astronauts and the space program.\nIndeed, in a nod to the second generation, June Scobee Rodgers — widow of Challenger commander Dick Scobee and longtime spokeswoman for the group — passed the torch to daughter Kathie Scobee Fulgham.\nFulgham — not Scobee Rodgers — was on the stage for the ceremony and introduced guest speaker Barbara Morgan, an Idaho schoolteacher who served as Christa McAuliffe's backup so long ago.\nMorgan recalled how Dick Scobee was \"a deep and poetic thinker,\" and how pilot Michael Smith let her \"push the stick\" during a training jet flight. She said Christa McAuliffe taught her not to worry about what's unimportant but rather work harder at what truly counts.\nUp until the final day before launch, Morgan noted, Christa McAuliffe took time to write college recommendations for her students.\nThe rest of the Challenger crew, remembered fondly by Morgan: Judith Resnik, Ronald McNair, Ellison Onizuka and Gregory Jarvis.\nThe crowd of about 500 included family members of astronauts killed in all three of NASA's spacecraft tragedies: Challenger; Columbia's catastrophic descent on Feb. 1, 2003; and the Apollo 1 fire on Jan. 27, 1967.\nFor the astronauts' loved ones, the disasters remain fresh in their minds.\nSteven McAuliffe, a federal judge in Concord, New Hampshire, still declines interviews about his late wife Christa. But he noted in a statement that although 30 years have passed, \"Challenger will always be an event that occurred just recently. Our thoughts and memories of Christa will always be fresh and comforting.\"\nMcAuliffe was presiding over a trial this week in Concord, and so Scott represented his father as well as his younger sister. The McAuliffes normally do not take part in these NASA memorials, so Scott's presence was especially noteworthy.\nAlong with the other Challenger families, Scobee Rodgers established the Challenger Center for Space Science Education just three months after the shuttle disintegrated in the Florida sky. A leak in the right booster doomed the ship; unusually cold weather that morning left Challenger's booster rockets with stiff O-ring seals.\nToday, there are more than 40 Challenger Learning Centers focusing on science, technology, engineering and math, mostly in the U.S. More are being built.\n\"They're not just a field trip for kids. They're actually lessons learned,\" said Scobee Rodgers, an educator who lives in Chattanooga, Tennessee. \"That's why they've lasted.\"\n___\nOnline:\nChallenger Center: http://www.challenger.org/\nNASA: http://www.history.nasa.gov/sts51l.html\nFILE - In this Jan. 28, 1986 file photo, the space shuttle Challenger explodes shortly after lifting off from the Kennedy Space Center in Cape Canaveral, Fla. (AP Photo/Bruce Weaver, File)\nFILE - This photo provided by NASA shows the crew of the Space Shuttle Challenger mission 51L. All seven members of the crew were killed when the shuttle exploded during launch on Jan. 28, 1986. Front row from left are Michael J. Smith, Francis R. (Dick) Scobee, and Ronald E. McNair. Front row from left are Ellison Onizuka, Christa McAuliffe, Gregory Jarvis, and Judith Resnik. (NASA via AP)\nBob Kelley shows a video at the Scobee Education Center planetarium at San Antonio College following a ceremony to honor the lives of the seven crew members of Challenger shuttle flight STS-51L on the 30th anniversary of the 1986 tragedy, Thursday, Jan. 28, 2016, in San Antonio. (AP Photo/Eric Gay)\nKevin Moore visits the Scobee Education Center at San Antonio College where art work was displayed to honor the lives of the seven crew members of Challenger shuttle flight STS-51L on the 30th anniversary of the 1986 tragedy, Thursday, Jan. 28, 2016, in San Antonio. (AP Photo/Eric Gay)\nRick Varner, director of the Scobee Education Center at San Antonio College, places a wreath at the Challenger Memorial Garden during a ceremony to honor the lives of the seven crew members of Challenger shuttle flight STS-51L on the 30th anniversary of the 1986 tragedy, Thursday, Jan. 28, 2016, in San Antonio. (AP Photo/Eric Gay)\nFILE - In this Jan. 28, 1986 picture, the space shuttle Challenger lifts off from the Kennedy Space Center in Cape Canaveral, Fla. shortly before it exploded with a crew of seven aboard. (AP Photo/Thom Baur)\nFILE - In this Jan. 27, 1986 file picture, the crew members of space shuttle Challenger flight 51-L, leave their quarters for the launch pad at Kennedy Space Center in Cape Canaveral, Fla. From foreground are commander Francis Scobee, Mission Spl. Judith Resnik, Mission Spl. Ronald McNair, Payload Spl. Gregory Jarvis, Mission Spl. Ellison Onizuka, teacher Christa McAuliffe and pilot Michael Smith. (AP Photo/Steve Helber)\nFILE - In this Jan. 28, 1986 file picture, spectators at the Kennedy Space Center in Cape Canaveral, Fla. react after they witnessed the explosion of the space shuttle Challenger. (AP Photo/File)\nFILE - This Jan. 28, 1986 file picture shows U.S. President Ronald Reagan in the Oval Office of the White House after a televised address to the nation about the space shuttle Challenger explosion. (AP Photo/Dennis Cook)\nFILE - In this series of Jan. 28, 1986 photos, the space shuttle Challenger explodes shortly after lifting off from the Kennedy Space Center in Cape Canaveral, Fla. A family from Michigan watches the explosion from Shepard Park in Cocoa Beach. (Malcolm Denemark/Florida Today via AP) NO SALES; MANDATORY CREDIT\nFILE - In this Friday, Jan. 28, 2011 file photo, June Scobee Rodgers, widow of Dick Scobee, commander of space shuttle Challenger, looks upward during the playing of the National Anthem at a remembrance ceremony to mark the 25th anniversary of the Challenger explosion at the Kennedy Space Center visitor complex in Cape Canaveral, Fla., Friday, Jan. 28, 2011. On the 30th anniversary of the space shuttle Challenger accident, June Scobee Rodgers _ widow of Challenger commander Dick Scobee and longtime spokeswoman for the families of the lost astronauts _ is passing the torch to daughter Kathie. (AP Photo/John Raoux)\nFILE - This Jan. 28, 1986 photo provided by NASA shows icicles on hand rails of the space shuttle Challenger's service structure on the morning of its final launch from Kennedy Space Center, Fla. The cold weather affected O-ring seals on a solid rocket booster, causing the explosion during launch. (AP Photo/NASA)\nBob Kelley shows a video at the Scobee Education Center planetarium at San Antonio College following a ceremony to honor the lives of the seven crew members of Challenger shuttle flight STS-51L on the 30th anniversary of the 1986 tragedy, Thursday, Jan. 28, 2016, in San Antonio. (AP Photo/Eric Gay)\nFILE - In this Jan. 28, 1986 file photo the space shuttle Challenger is destroyed by an explosion shortly after it lifted off from Kennedy Space Center, Fla. Thursday, Jan. 28, 2016 marks the 30th anniversary of the accident which killed all seven crew members. (AP Photo/Steve Helber, File)\nFILE - In this Friday, Jan. 28, 2011 file photo, June Scobee Rodgers, widow of Dick Scobee, commander of space shuttle Challenger, speaks in front of the Space Mirror Memorial during a remembrance ceremony to mark the 25th Anniversary of space shuttle Challenger at the Kennedy Space Center visitor complex in Cape Canaveral, Fla. On the memorial behind her are the names of the astronauts that perished aboard Challenger. (AP Photo/John Raoux)","url":"https://www.dailymail.co.uk/wires/ap/article-3421438/30-years-Challenger-Teacher-Space-finalists-gather.html"}
