{"authors":["Chris Tomlinson"],"date_download":"2018-10-30 21:20:36","date_modify":"2018-10-30 21:20:36","date_publish":"2018-08-24 10:12:47","description":"French police in the heavily migrant populated suburbs of Paris have seized 32 sheep that were found in the garage of a pizzeria ahead of the Islamic Eid al-Adha festival in which Muslims sacrifice animals.","filename":"data/vaneerConsumption/32SheepfoundInParisSuburbAheadofIslamicRitualFestival.json","image_url":"https://media.breitbart.com/media/2018/08/GettyImages-973147914.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_08_24__1540934436.html","title":"32 Sheep found In Paris Suburb Ahead of Islamic Ritual Festival","title_page":"32 Sheep found In Paris Suburb Ahead of Islamic Ritual Festival","title_rss":"NULL","source_domain":"breitbart.com","text":"French police in the heavily migrant populated suburbs of Paris have seized 32 sheep that were found in the garage of a pizzeria ahead of the Islamic Eid al-Adha festival in which Muslims sacrifice animals.\nThe animals were found in the commune of Drancy, which is located in the heavily migrant populated Seine-Saint-Denis suburbs to the north of Paris which have become well-known for having a large Muslim population. The seized sheep were taken to an animal shelter in Chailly-en-Brie, Le Parisien reports.\nWhile adherents of the Islamic faith are allowed to engage in ritual halal slaughter for Eid al-Adha, by French law they must do so in a controlled environment at a recognized slaughterhouse both for hygiene reasons and to combat potential animal cruelty.\nThe discovery was not the only one of hidden sheep intended to be slaughtered over the Islamic festival. In Clichy-sous-Bois and Montfermeil, police were tipped off by the association for the defence of animals and found five more sheep located at three separate addresses.\nPolice also arrested a man earlier this week after he had illegally shot two sheep.\nThe slaughter of animals in connection with the festival has also been the subject of controversy in neighbouring Belgium, with two of the country’s three regions banning slaughter without having the animal stunned beforehand.\nBelgium Bans Halal Slaughter, But Muslims in Capital Brussels Are Exempt https://t.co/fMGctYBMhG — Breitbart London (@BreitbartLondon) August 22, 2018\nThe region of Brussels, where the notorious suburb of Molenbeek is located, has so far declined to join Flanders and Wallonia in banning the slaughter leading to criticism from animal rights campaigners.\nIn the UK, the Royal Society for the Prevention of Cruelty Animals (RSPCA) has spoken out against halal slaughter practices and advocating that all animals should be stunned before slaughter.\nThe RSPCA slammed the UK government this week for relaxing laws on slaughter methods accusing the government of trying to increase sales of UK halal products to Saudi Arabia.\n“This [deal with Saudi Arabia] is very disappointing news. Non-stun slaughter causes serious suffering for animals,” said Marc Cooper, the head of the RSPCA’s farm animal department and added, “To minimise unnecessary animal suffering, we believe it should follow other European nations and ban the export of meat from non-stunned animals.”","url":"https://www.breitbart.com/europe/2018/08/24/french-police-seize-dozens-of-sheep-hidden-in-garage-ahead-of-islamic-ritual-slaughter-festival/"}
