{"authors":["Lisa"],"date_download":"2018-10-30 19:07:36","date_modify":"2018-10-30 19:07:36","date_publish":"2015-05-19 10:37:00","description":"Three Benton residents were arrested on tax- and computer-related charges Monday after an investigation of an annual baseball and softball tournament.","filename":"data/vaneerConsumption/3arrestedafterIRSinvestigationofBentontournament.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2015_may_19__1540926456.html","title":"3 arrested after IRS investigation of Benton tournament","title_page":"3 arrested after IRS investigation of Benton tournament","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Three Benton residents were arrested on tax- and computer-related charges Monday after an investigation of an annual baseball and softball tournament.\nThe Benton Police Department and the Internal Revenue Service began a six-month investigation of the organizers of the the Wally Hall Tournament of Champions after irregularities were found in their tax reporting, department spokesman Lt. Kevin Russell said.\nMarried couple Kendall Shane Pigue, 48, and Lara Pigue, 46, served as the organizers of the tournament, Russell said.\nThe two were charged with three counts of false or fraudulent report, two counts of failure to pay or file tax returns, three counts of criminal conspiracy and three counts of computer fraud, police said.\nKimberly McClendon, 44, who was also involved in organizing the tournament, was charged with three counts of false or fraudulent report, three counts of criminal conspiracy and three counts of computer fraud.\nAll three arrestees received a signature bond Monday and were released on their own recognizance, Russell said.\nThe investigation is ongoing, and more charges could be forthcoming.\nPhoto by Benton Police Department\nKendall Shane Pigue, 48.\nPhoto by Benton Police Department\nKimberly McClendon, 44.","url":"https://www.arkansasonline.com/news/2015/may/19/3-arrested-after-irs-investigation-benton-baseball/"}
rrested-after-irs-investigation-benton-baseball/?page=1"}
