{"authors":[],"date_download":"2018-10-30 18:22:35","date_modify":"2018-10-30 18:22:35","date_publish":"2018-10-30 16:11:17","description":"Three children died and a fourth was seriously injured Tuesday morning when they were hit by a vehic...","filename":"data/vaneerConsumption/3childrenkilled1injuredwhileboardingschoolbusinIndiana.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/10/30/Images/AP18303566469762.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_children-kill_76615d920de991bdadf6f82dbf30b8ea__1540923755.html","title":"3 children killed, 1 injured while boarding school bus in Indiana","title_page":"3 children killed, 1 injured while boarding school bus in Indiana","title_rss":"NULL","source_domain":"ajc.com","text":"Three children died and a fourth was seriously injured Tuesday morning when they were hit by a vehicle while boarding a school bus in Indiana, according to police and school officials.\n>> Read more trending news\nState police told the Indianapolis Star that the crash happened around 7:15 a.m. at a bus stop near 4600 North State Road 25 in Fulton County.\n@IndStatePolice is working a fatal crash involving students getting on a Tippacanoe Valley School Cororation bus. There are three fatalities and one who has been airlifted to a Ft Wayne hospital. The Parents of the children involved have been notified. — Sgt. Tony Slocum (@ISPPeru) October 30, 2018\nPolice said three children, identified to WLS-TV as 6-year-old twin boys and their 9-year-old sister, died at the scene of the crash. The injured child, identified to WLS-TV as an 11-year-old boy, was airlifted to a hospital in Fort Wayne.\nThe Star reported that a pickup truck hit the children at a bus stop for the Tippecanoe Valley School Corporation. WLS-TV reported that the truck’s driver, a 24-year-old woman, was stopped at the scene and was cooperating with investigators after the crash.\n“Our school corporation has suffered a tragedy this morning,” school district officials said Tuesday morning in a statement. “We are awaiting to learn more confirmed details but wish to ask the community to come together to pray for the families, our students and our staff.”\nPolice continue to investigate the crash.","url":"https://www.ajc.com/news/national/children-killed-injured-while-boarding-school-bus-indiana/ju1pHtkvOIqZeE66CVJVqN/"}
