{"authors":[],"date_download":"2018-10-23 02:07:28","date_modify":"2018-10-23 02:07:28","date_publish":"2014-07-11 00:00:00","description":"Ann Powers says Music City has never been more bohemian — and that's one reason why, alongside the glitz of mainstream country, the underground side of American roots music is booming there.","filename":"data/vaneerConsumption/3CountryArtistsToWatchNPR.json","image_url":"https://media.npr.org/assets/img/2014/07/10/steel-pr-color-dvc-hi-res-a_wide-4d9eb4723c93d073b0b7591bd75b965e7e6da1cb.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=330495191_1540260448.html","title":"3 Country Artists To Watch : NPR","title_page":"The New Sound Of Young Nashville: 3 Country Artists To Watch : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ANN POWERS, BYLINE: Thank you so much, Renee. I'm very happy to be in the other LA - not lower Alabama but Los Angeles, California.\nRENEE MONTAGNE, HOST:\nWell, you did get to see Miranda Lambert play in Nashville last month along with a lot of other bands. But let's start with what's new in the country capital of the world.\nPOWERS: Well, Renee, Nashville's absolutely exploding culturally. There is an amazing food scene. There's all these young entrepreneurs who are opening tons of little shops. The city is pouring money into the arts, so it's a really great bohemian scene. Mainstream country's thriving. Alternative Americana is thriving. The spectrum of music related to traditional American roots music is really at a high point right now in Nashville.\nMONTAGNE: And I gathered part of what you were able to do in those weeks you were there was go to the Country Music Association Festival.\nPOWERS: That was a real thrill to be able to go to CMA Fest because it's a huge gathering that gets up to 70,000 people a day thronging the downtown streets of Nashville. And I got to see 50 acts in five days. It was funny because when I was watching Miranda play one of the giant stadium shows, I noticed a certain person playing pedal steel guitar for her. And I realized that it was Spencer Cullum, who was from one of my favorite young Nashville duos, Steelism. And they play what they call country soul. It's instrumental music. It ranges from surf music to kind of lounge-y music to Latin influence to straight-up country. And they have a record coming out called 615 to Fame. And we're going to hear a really fun cut from that. It's called \"Caught In A Pickle.\"\n(SOUNDBITE OF SONG, \"CAUGHT IN A PICKLE\")\nPOWERS: On another night during CMA Fest, I went to a much smaller show in a club called 3rd and Lindsley. And it happened that Miranda Lambert and Blake, her husband, were sitting just a few tables away from me. One of the really cool, young bands that was on that bill is called Striking Matches.\n(SOUNDBITE OF SONG, \"TROUBLE IS AS TROUBLE DOES\")\nSARAH ZIMMERMANN: (Singing) Woke up this morning with a pounding in my brain.\nPOWERS: Striking Matches is a duo - Sarah Zimmermann and Justin Davis. They met as guitar students. And they're really exciting not only because they write great songs but because they're both just killer guitar players.\n(SOUNDBITE OF SONG, \"TROUBLE IS AS TROUBLE DOES\")\nPOWERS: Their recordings are multifaceted- sometimes very sweet and slow, sometimes really lively and biting. But you've got to see them live to see this total guitar throw-down that they do together. That's one of my favorite things about Striking Matches.\nMONTAGNE: And you've mentioned Miranda Lambert a couple of times, probably could have mentioned her a dozen more times, which makes it sound a little like everyone in Nashville has a Miranda Lambert connection.\nPOWERS: Well, Miranda Lambert's definitely a team player, and she has great taste. So even though she doesn't live in Nashville, I often find her connected to younger artists or newer artists that I find exciting. One guy that I heard is Charlie Worsham. Charlie Worsham toured with her and Dierks Bentley. Right now he's out with Brad Paisley. And he put out a really beautiful album called Rubberband last year. I was just really impressed with Charlie's grace, his beautiful voice and his guitar skills as well. He's just an all-around artist.\n(SOUNDBITE OF SONG, \"MISSISSIPPI IN JULY\")\nCHARLIE WORSHAM: (Singing) Last time I thought about you in a wedding dress I would've been holding your hand. But at 17 you promise things that you don't really understand.\nPOWERS: So Renee, you can hear that that song, which is called \"Mississippi in July,\" is the memory of young love. But it's not a memory about, you know, getting up in your truck and your painted-on pants and all the cliches we associate with what people call bro-country. And Charlie Worsham is a great example of how many male artists in country right now are not doing the bro thing. And, you know, he has this really singer-songwriter-ly way about him. And I feel like we're going to be hearing more of that in the future as the idea of country and the scene in Nashville continue to open up.\nMONTAGNE: Ann Powers, NPR music's pop critic. Thanks for joining us.\nPOWERS: Thanks for having me, Renee.\n(SOUNDBITE OF SONG, \"MISSISSIPPI IN JULY\")\nWORSHAM: (Singing) Oh, Mississippi in July.\nMONTAGNE: This is MORNING EDITION from NPR News. I'm Renee Montagne.\nSTEVE INSKEEP, HOST:\nAnd I'm Steve Inskeep.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=330495191"}
