{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:12:45","date_modify":"2018-10-30 22:12:45","date_publish":"2015-05-08 04:26:27","description":"The Second Amendment Foundation filed a lawsuit against the fed govt for Defense Distributed, flagship company for 3D-printed gun designer.","filename":"data/vaneerConsumption/3DPrintedGunDesignerSuesFedsIStandforFreedom.json","image_url":"https://media.breitbart.com/media/2015/04/Liberator-3D-print-gun-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_07__1540937565.html","title":"3D-Printed Gun Designer Sues Feds: 'I Stand for Freedom'","title_page":"3D-Printed Gun Designer Sues Feds: 'I Stand for Freedom' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On May 6, the Second Amendment Foundation filed a lawsuit against the federal government on behalf of Defense Distributed, the flagship company for 3D-printed gun designer Cody Wilson.\nThe goal is to free Wilson from a federal mandate that he not post blueprints for The Liberator pistol online. The Liberator is “the nation’s first pistol built exclusively on a 3-D printer, consisting of 12 separate parts made from plastic and a single metal firing pin.”\nAccording to Fox News, Wilson posted blueprints for The Liberator on May 5, 2013, and within two days “100,000 people around the world had downloaded them.” The federal government then demanded that he remove the blueprints, and claimed that posting them violated “International Traffic in Arms Regulations. (ITAR)” The feds said ITAR requires that Wilson give the government prior notice before “technical data” can be exported.\nWilson subsequently faces “up to 20 years in prison and [could] be fined as much as $1 million per violation.”\nThe Second Amendment Foundation’s Alan Gottlieb said, “Defense Distributed is being penalized for trying to educate the public about 3-D guns.” He went on to say that his foundation “wants to publish the information about three-dimensional printing of firearms on its web site as educational material for its members, supporters and general public.”\nWilson concurred, saying his technology “will break gun control.” He said, “Specifically within the AR15 community, gun owners can now make the capacity magazines for themselves and there is no need to serialize them. People don’t like to register their firearms any more. They don’t trust the government.”\nWilson said of himself, “I stand for freedom.”\nFollow AWR Hawkins on Twitter @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/05/07/3d-printed-gun-designer-sues-feds-i-stand-for-freedom/"}
