{"authors":[],"date_download":"2018-10-22 21:04:11","date_modify":"2018-10-22 21:04:11","date_publish":"2014-06-03 23:58:13","description":"NASA has lined up 12 research payloads to fly on Virgin Galactic's SpaceShipTwo rocket plane, including an experiment in space-based 3-D printing.","filename":"data/vaneerConsumption/3DPrintinginSpaceNASAPlansExperimentsforSpaceShipTwo.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/485721/140603-cutaway_a7e84796163ab795eec875c79e5e3c12.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_virgin-voyage_3-d-printing-space-nasa-plans-experiments-spaceshiptwo-n121876_1540242251.html","title":"3-D Printing in Space? NASA Plans Experiments for SpaceShipTwo","title_page":"3-D Printing in Space? NASA Plans Experiments for SpaceShipTwo","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nNASA has lined up 12 research payloads to fly on Virgin Galactic's SpaceShipTwo rocket plane, including an experiment aimed at pioneering 3-D printing in outer space.\nThe goal of the 3-D printing research is to let astronauts create replacement parts, tools or other needed items in space from raw materials, rather than waiting to have those items flown up from Earth. It's a potentially time-saving and cost-saving technology, but the zero-G environment poses extra challenges for what's typically a gravity-dependent manufacturing process.\nThe 3-D printing experiment and 11 other payloads were selected through NASA's Flight Opportunities Program to benefit from the few minutes of zero gravity that will be available during SpaceShipTwo's flights to the edge of space.\nSuborbital space ventures such as Virgin Galactic and XCOR Aerospace are hoping to capitalize on offering services for researchers as well as space tourists. Planetary scientist Alan Stern of the Southwest Research Institute has said that over the long run, research projects could become more of a \"killer app\" for the suborbital space industry than tourist flights.","url":"https://www.nbcnews.com/storyline/virgin-voyage/3-d-printing-space-nasa-plans-experiments-spaceshiptwo-n121876"}
