{"authors":["Arkansas Democrat-Gazette Staff","Wire Reports"],"date_download":"2018-10-30 01:12:01","date_modify":"2018-10-30 01:12:01","date_publish":"2018-08-14 02:18:00","description":"Three advocacy groups filed a lawsuit Tuesday challenging the work requirement for Arkansas’ expanded Medicaid program.","filename":"data/vaneerConsumption/3groupsfilesuitchallengingstatesworkrequirementforexpandedMedicaidprogram.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_aug_14__1540861921.html","title":"3 groups file suit challenging state's work requirement for expanded Medicaid program","title_page":"3 groups file suit challenging state's work requirement for expanded Medicaid program","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Three advocacy groups filed a lawsuit Tuesday challenging the work requirement for Arkansas’ expanded Medicaid program.\nThe suit, filed in federal court in Washington, D.C., contends that U.S. Department of Health and Human Services officials acted outside their authority and in an “arbitrary and capricious” manner when they approved the requirement.\n[DOCUMENT: Read the lawsuit]\nThe lawsuit was filed on behalf of three Arkansas Works enrollees by Legal Aid of Arkansas, the National Health Law Program and the Southern Poverty Law Center.\n“The Arkansas waiver plan has it all backwards. Cutting people’s health care and making them jump through administrative hoops will make it harder for our clients to work and make a better life, not easier,” Legal Aid of Arkansas attorney Kevin De Liban attorney said in a news release.\nArkansas was the first state to implement a Medicaid work requirement after the Trump administration said it would allow states to require participants to work to keep coverage. Kentucky was the first state to win approval for a work requirement, but a federal judge in June blocked the state from enforcing it. Arkansas' requirement only applies to its Medicaid expansion, which uses federal and state funds to purchase private insurance for low-income residents.\nArkansas Gov. Asa Hutchinson, a Republican, has promoted the requirement as a way to move more people onto the workforce and eventually off of the government-funded coverage. Hutchinson defended the requirement Tuesday and said the state is providing \"substantial\" assistance to people on the program who have trouble reporting because of limited access to the internet.\n[RELATED: State extends hours of call center to answer questions about Arkansas Works' work requirement]\n\"This lawsuit has one goal, which is to undermine our efforts to bring Arkansans back into the workforce, increase worker training, and to offer improved economic prospects for those who desire to be less dependent on the government,\" Hutchinson said in a statement.\nTwo of the groups involved in the lawsuit over Arkansas' requirement — the National Health Law Program and the Southern Poverty Law Center — sued over Kentucky's requirement. Legal Aid of Arkansas is also suing on behalf of the three residents, each of whom has been unable to meet the work requirement for at least one month.\n\"Arkansas Works gives a person in my situation the ability to continue with my care to resolve whatever health issues I have. Without the program, my health can only get worse,\" Charles Gresham, a plaintiff in the suit, said in a statement. Gresham, 37, has been on the expanded Medicaid program since 2015 but has been unable to find and keep a job because of a seizure disorder.\nParticipants in Arkansas' program lose coverage if they don't meet the work requirement for three months in a calendar year. Arkansas officials said more than 46,000 of the roughly 270,000 people on its Medicaid expansion were subject to the work requirement in July. Once fully implemented, Arkansas' requirement will affect able-bodied enrollees on the program with no children aged 19 to 49 years old. The requirement is being enforced on participants ages 30 to 49 this year and will expand to include those 19 to 29 years old next year.\nRead Wednesday's Arkansas Democrat-Gazette for full details.","url":"https://www.arkansasonline.com/news/2018/aug/14/3-groups-file-suit-challenging-states-work-require/"}
roups-file-suit-challenging-states-work-require/?page=1"}
