{"authors":["John Binder"],"date_download":"2018-10-30 19:10:53","date_modify":"2018-10-30 19:10:53","date_publish":"2018-08-13 23:57:41","description":"President Trump's \"buy American, hire American\" approach to the United States economy has had a trickle-down impact on voters.","filename":"data/vaneerConsumption/3in4USVotersSayItsImportanttoBuyAmerican.json","image_url":"https://media.breitbart.com/media/2018/08/US-Manufacturing-ROBYN-BECKAFPGETTY-IMAGES-640x480-2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_08_13__1540926653.html","title":"3-in-4 U.S. Voters Say It's 'Important' to Buy American","title_page":"Economic Patriotism: 3-in-4 U.S. Voters Say It's 'Important' to Buy American","title_rss":"NULL","source_domain":"breitbart.com","text":"President Trump’s “buy American, hire American” approach to the United States economy has had a trickle-down impact on voters who, by a large majority, are economic patriots.\nIn the latest Rasmussen Reports survey, more than 3-in-4 voters said buying an American-made product is “somewhat important” or “very important,” revealing Americans’ craving for products that are made and manufactured in the U.S. rather than imported from overseas.\nAbout 75 percent of white voters and 81 percent of black Americans said buying American-made products is “important” to them. Another 61 percent of voters said “Made in America” isn’t just a slogan, but a way of life.\nTrump’s tariffs to protect U.S. jobs and industries have been met with backlash from the free trade apparatus of the billionaire Koch brothers and the Chamber of Commerce.\nMeanwhile, Americans — especially Republican voters — increasingly see themselves as economic patriots who are interested in the protection of American jobs, rather than cheap products.\nFor example, when Trump announced he would be delivering $12 billion in aid to American farmers who have been targeted by Chinese retaliatory tariffs, a whopping 78 percent of GOP voters said they supported the effort.\nA Morning Consult Poll conducted in July revealed that nearly half of Republican voters believe the U.S. has benefitted the least from the country’s current free trade deals like NAFTA and KORUS. Additionally, a plurality of Republicans — 46 percent — said the U.S. economy benefits more from imposing tariffs on foreign-made goods to protect domestic industries, while only 30 percent said the U.S. economy benefits more from lowering trade barriers and entering into free trade deals.","url":"https://www.breitbart.com/politics/2018/08/13/economic-patriotism-3-in-4-u-s-voters-say-its-important-to-buy-american/"}
