{"authors":["Chris Arnold"],"date_download":"2018-10-23 05:53:43","date_modify":"2018-10-23 05:53:43","date_publish":"2015-10-17 00:00:00","description":"How do some of the most respected investors on the planet think Americans should be investing their money? NPR talked to three about what a retirement portfolio should look like.","filename":"data/vaneerConsumption/3InvestmentGurusShareTheirModelPortfolios.json","image_url":"https://media.npr.org/assets/img/2015/10/16/promo-allocations-seamus4_wide-f00966f828a5569cdd03befe163bc339866b291e.png?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_10_17_436993646_three-investment-gurus-share-their-model-portfolios_1540274023.html","title":"3 Investment Gurus Share Their Model Portfolios","title_page":"3 Investment Gurus Share Their Model Portfolios : NPR","title_rss":"NULL","source_domain":"npr.org","text":"3 Investment Gurus Share Their Model Portfolios\nHow do some of the most respected investors on the planet think Americans should be investing their money? NPR talked to three about what a retirement portfolio should look like.\nDavid Swensen\ntoggle caption Michael Marsland/Yale University\nChief Investment Officer, Yale University\n1. Diversify\nInstead of just investing in U.S. stocks and bonds, Swensen advocates a broader range of asset classes. He suggests stocks from developed and emerging markets around the world. And he suggests owning real estate through a low-fee fund as a part of your portfolio. In addition to traditional U.S. Treasury bonds, he advises investors to own Treasury inflation-protected securities, or TIPS. In his sample portfolio, he says, some of these slices of the pie will likely rise and fall and rise again at different times and at different rates. So he says to rebalance at least once a year to maintain your target allocation.\n2. Pay the lowest fees possible\nFees can do terrible damage to your investment returns. Even in higher-risk, higher-return asset classes such as stocks you can only expect high-single digit or low double-digit returns over long periods of time. So if you end up paying 1 percent to a financial adviser, and then 1 percent to 2 percent on top of that in mutual fund fees and then adjust for inflation (2 percent to 3 percent a year), you're losing half of your returns or more, Swensen says. The odds, he says, are overwhelmingly in favor of index funds.\nSo Swensen says very-low-fee index funds make the most sense for individual investors. He says if you compare performance of higher-priced actively managed mutual funds to lower-cost index funds, \"when you look at the results on an after-fee, after-tax basis over reasonably long periods of time,\" the odds, he says, are overwhelmingly in favor of index funds.\n3. Adjust your portfolio as you age\nWhen it comes to investing, Swensen says, \"there is no such thing as one size fits all.\" His model portfolio is \"well-diversified, equity-oriented for long-term investors and efficient in the sense that it is as good or better than other alternatives,\" he says. \"So my model portfolio should serve most investors well.\"\nEssentially, what Swensen is saying is that when you're investing for long periods of time — 20 or 30 years, for example — you are likely to make more money holding a sizable portion of your portfolio in stocks or other assets with a high expected rate of return. That's because historically, stocks offer greater returns than \"safer\" alternatives such as U.S. Treasury bonds over the long term. But in the short term, stocks tend to be much more volatile. So as people near retirement age, many investment advisers suggest shifting more assets to the \"safer than stocks\" category. If the stock market crashes and you need to be spending money out of your portfolio as income in retirement, you don't want to suddenly lose 20 or 30 percent of your savings and be forced to sell stocks at a low price. If you're younger and stocks crash, you can just hang tight and wait for the market to recover.\nBut it's not all about age. It's also about appetite for risk. \"Risk tolerance is specific to each individual. Risk-averse investors may want to hold a combination of the model portfolio and cash, which will reduce overall risk,\" Swensen says. \"As wealth increases, tolerance for risk may increase. As investors grow older, tolerance for risk may decrease. Each individual needs to find a portfolio that matches their risk preferences.\"\nGretchen Tai\nRuns Hewlett-Packard's pension and 401(k)\ntoggle caption Courtesy of Gretchen Tai\n1. Active management and fees\n\"Fees matter, so you should be careful what you choose to pay,\" Tai says. She says whether you go with active or passive management, try to keep the total fees you are paying in your portfolio at or below 0.5 percent. That's half of 1 percent. Many financial advisers charge twice that — on top of any mutual fund fees you're paying. But Tai says she doesn't think most people need financial advisers.\n\"Many plan sponsors offer free investment education to their employees, and that's good place to start,\" Tai says. \"Don't pay for things you can get for free.\" Other experts say advisers can be useful to help people stay the course and not, say, panic and sell all their stock after a market crash. But all of the top advisers and economists NPR interviewed said you don't want to overpay for a financial adviser.\n2. Sample portfolio\nLike Swensen, Tai advocates broader diversification than many individual investors often achieve.\n3. Adjust your portfolio by age\nGiven the current interest rate environment, Tai believes that \"a more flexible approach\" to the traditional age-based rules to bond allocation might be more appropriate. So, Tai says her suggested portfolio is a good approach until you reach retirement age. At that point, she says, investors need to look at their nest egg: If it's big enough to live on along with Social Security, \"then it's OK to reduce higher-risk assets such as stocks more quickly to 40 percent.\" If you haven't saved enough, the options aren't so good. \"[You] might need to postpone retirement,\" she says.\ntoggle caption Courtesy of Vanguard\nJack Bogle\nVanguard Group founder\n1. Buy a stock index fund and own your age in bonds.\nBogle says to invest through low-cost index funds. (He created the first one after all.) With an index fund you're not paying people on Wall Street to pick stocks for you. Instead, you basically \"own all of corporate America,\" he says — at least, a small slice. And over time, he says, low-cost index mutual funds outperform the vast majority of actively managed mutual funds. Picking winners with stocks is very hard to do, and for ordinary Americans, it just costs too much to invest that way, he says.\n\"Cost turns out to be everything,\" Bogle says. \"It's just what I've always called the 'relentless rules of humble arithmetic.' \"\n\"Simplicity underlies the best investment strategies. Basic arithmetic works. Keep your investment expenses under control,\" he says. \"Your net return is simply the gross return of your investment portfolio less the costs you incur [such as sales commissions, advisory fees, transaction costs]. Low costs make your task easier.\"\nAs for balancing risk and reward depending on your age, Bogle says:\n\"Let's start with the concept that when we're young, have few assets, are willing to take risks, and seek capital accumulation, we should emphasize common stocks,\" he says. \"But as we age, our assets grow, we gradually become more risk averse, and increasingly seek income, we should emphasize bonds.\"\nOne rule-of-thumb is to begin with a bond position similar to our age — 20 percent (or less) in bonds in our 20s, 80 percent bonds in our 80s — and then make adjustments based on your personal circumstances.\nBogle says he's a fan of holding a mix of Vanguard's Intermediate- and Short-Term Bond Index Funds, though of course similar low-cost funds are available out on the market from other firms.\nHe also suggests investing a portion of your bond allocation in tax-exempt funds if taxes are a concern. For example, Bogle personally uses a mix of Vanguard's Limited-Term and Intermediate-Term Tax-Exempt Funds in his taxable accounts. If you're saving for retirement though in a pre-tax 401(k) account, this isn't a concern.\n2. Factor in Social Security\nBogle says you can justify owning a larger portion of your assets in stocks if you consider that Social Security provides a revenue stream to you in retirement that's safe and stable, much like the Treasury bond category is in your investment portfolio. So he says his basic \"own your age in bonds\" approach is a good starting point. But if you're paying into Social Security with each paycheck, you can safely own more stock. So if you're 28 years old, you might decide to have, say, 10 or 20 percent in bonds and 80 or 90 percent in stock — depending on your risk tolerance.","url":"https://www.npr.org/2015/10/17/436993646/three-investment-gurus-share-their-model-portfolios"}
