{"authors":["Brakkton Booker"],"date_download":"2018-10-23 01:07:57","date_modify":"2018-10-23 01:07:57","date_publish":"2016-06-16 00:00:00","description":"Since Trump secured the GOP nomination, he has done little to quell concerns of many Republicans. Maryland's and Ohio's GOP governors are now among those refusing to endorse him.","filename":"data/vaneerConsumption/3MoreProminentRepublicansSayTheyCannotEndorseDonaldTrump.json","image_url":"https://media.npr.org/assets/img/2016/06/16/trump-in-atl_wide-9a85554d8436d0497bca0c9a6ae48620007a3ede.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_06_16_482337068_3-more-republicans-say-they-cannot-endorse-donald-trump_1540256877.html","title":"3 More Prominent Republicans Say They Cannot Endorse Donald Trump","title_page":"Maryland Gov. Larry Hogan, Ohio Gov. John Kasich Are Refusing To Endorse Trump : NPR","title_rss":"NULL","source_domain":"npr.org","text":"3 More Prominent Republicans Say They Cannot Endorse Donald Trump\nEnlarge this image toggle caption Branden Camp/Getty Images Branden Camp/Getty Images\nAs the general election shifts into high gear, a pair of Republican governors and a 15-term representative this week voiced their frustrations with the party's presumptive presidential nominee and have decided they cannot get onboard the Trump train.\nFred Upton, R-Mich., joins Maryland Gov. Larry Hogan and also Ohio Gov. John Kasich, who ran for president against Donald Trump.\nThis pushback comes as the presumptive Republican nominee marks the one-year anniversary of the start of his remarkable and unconventional candidacy, and as the GOP is at yet another crossroads as to how to maintain party unity with him at the top of the ticket. Meanwhile, presumptive Democratic nominee Hillary Clinton is launching an eight-figure, multi-battleground state campaign ad blitz.\nOn Thursday The Detroit News reported that Upton had said he was going to \"stay in my lane,\" adding that neither Trump nor Clinton should expect his support.\n\" 'There's a lot of things that folks are not happy about with either of these two candidates,' he said. 'We're running our own race, and don't look for me to endorse anyone in this race probably the rest of the year.' \"Upton, who has served in Congress since 1987, joins other Michigan GOP U.S. Reps. Justin Amash of Cascade Falls, Bill Huizenga of Zeeland and John Moolenaar of Midland in not endorsing Trump.\"\nEnlarge this image toggle caption Mark Wilson/Getty Images Mark Wilson/Getty Images\nHogan doubled down on earlier claims that he will not support Trump in the fall. He had supported New Jersey Gov. Chris Christie's presidential bid but has resisted following Christie's lead to embrace Trump.\nHogan told reporters Wednesday not only will he not endorse Trump but he does not plan to vote for him either. Asked whom he would vote for, Hogan told the Washington Post, \" 'I guess when I get behind the curtain I'll have to figure it out. Maybe write someone in. I'm not sure.' \"\nKasich also expressed his unease with Trump at the top of the GOP ticket. But he did leave the door open to supporting him down the line.\nEnlarge this image toggle caption Evan Vucci/AP Evan Vucci/AP\nIn an interview with MSNBC, Kasich was pressed about the pledge he signed stating that he would support the eventual Republican nominee.\n\" 'Yeah yeah yeah, you know it's painful. It's painful. People even get divorces, sometimes things come about that. ... Look I'm sorry that this has happened. We'll see where it ends up. I'm not making any final decision yet, but at this point, I just can't do it.' \"\nKasich, Hogan and Upton join a growing caucus of elected Republican officials who are declining to endorse Trump or at the very least trying to distance themselves from their party's likely nominee. Their actions also underscore the challenge Trump faces in unifying the party.\nTrump did get tepid support from South Carolina Sen. Lindsey Graham for his plan to meet with the National Rifle Association to talk about banning people on the no-fly list from buying guns.\n\"I think he's [going] to the middle on something that's very important,\" Graham told Fox & Friends.\nBut it was far from an endorsement — Graham also exited the presidential race and has been harshly critical of Trump.\nSince he wrapped up the GOP nomination last month, Trump has done little to allay concerns by many Republicans troubled by his tone.\nIn the weeks since clinching the 1,237 delegates needed to make him the presumptive nominee, Trump has insulted New Mexico's Susana Martinez, a rising star in the Republican Party and the nation's only Latina governor. He has attacked the federal judge overseeing his Trump University case for his \"Mexican heritage\" (the judge, Gonzalo Curiel, was born in Indiana). And following the Orlando nightclub massacre over the weekend, he once again called for a ban on Muslims entering the United States, which several Republican leaders have said they don't condone.\nConcerns about tone and policy aside, Trump is also raising eyebrows about the direction his campaign is taking. He has spent valuable time campaigning in deeply Republican states like Texas and Georgia this week that are very likely not going to be competitive for him in the fall.\nMeanwhile, Clinton spent time this week in Pennsylvania and Virginia — both of which are considered tossups in the general election.\nHer campaign has also launched a campaign ad offensive in eight battleground states: Ohio, Nevada, Florida, Colorado, Iowa, New Hampshire, North Carolina and Virginia.\nThe ads highlight Clinton's work helping children and paint Trump as being an out-of-touch, divisive figure not capable of unifying the country.","url":"https://www.npr.org/2016/06/16/482337068/3-more-republicans-say-they-cannot-endorse-donald-trump"}
