{"authors":["Kelli Serio"],"date_download":"2018-10-30 19:21:37","date_modify":"2018-10-30 19:21:37","date_publish":"2015-08-13 17:26:20","description":"Three more women have come forward with claims they were sexually assaulted by comedian Bill Cosby.","filename":"data/vaneerConsumption/3MoreWomenAccuseBillCosbyofSexualAssault.json","image_url":"https://media.breitbart.com/media/2015/08/Cosby-accusers-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_08_13__1540927297.html","title":"3 More Women Accuse Bill Cosby of Sexual Assault","title_page":"3 More Women Accuse Bill Cosby of Sexual Assault","title_rss":"NULL","source_domain":"breitbart.com","text":"Three more women have come forward with claims they were sexually assaulted by comedian Bill Cosby.\nAt a press conference at attorney Gloria Allred’s Los Angeles office Wednesday, the women gave detailed accounts of how they were allegedly victimized by the TV legend many years ago.\nAccording to The Wrap, Colleen Hughes was an American Airlines flight attendant in the early 1970s when she first met Cosby.\nHughes claimed the comedian “flirted with me the entire flight” before he invited her to lunch at a restaurant in Beverly Hills.\nHughes alleges the two went to her hotel room when the plane landed so she could clean up, but when she emerged Cosby had ordered champagne and appetizers.\nCosby reportedly drank champagne out of Hughes’ shoe, but also handed her a glass to drink.\nThe last thing Hughes claims to remember before waking up hours later was Cosby attempting to hold her hand.\n“My clothes were thrown all over the room and I felt semen on the small of my back and all over me,” she said. “Bill obviously did not use a condom and there was no lunch and he was nowhere to be seen.”\nAbout a year later, Hughes alleges she crossed paths with Bill on another flight. After she mentioned the alleged incident to him, the comedian reportedly “turned pale and said ‘Did you ever report that to anyone?'”\nShe said he had not.\nAnother accuser, Linda Ridgeway Whitedeer, told reporters she met Cosby on a movie set in the early 1970s when he told her he was going to interview her in the director’s office.\n“I felt Cosby’s left hand gently grab my long hair behind my head… his giant frame blocked the door so if anyone should try to enter, they would not be able to see what he was doing,” said Whitedeer. “As I looked up his penis was out of his pants and he shoved it in my mouth. His attack was fast with surgical precision and surprise on his side.”\nWhitedeer claims:\nWhen Cosby was done, there was a horrible mess of semen all over my face, my clothes and in my hair. He took out a Kleenex to try to wipe off my face. I was bordering between vomiting and passing out. He was mumbling that I had been blessed with his semen as if it was holy water.\n“Cosby “gloated over my humiliation,” she added.\nEden Tirl, the third alleged victim, claims she was cast as a police officer on “The Cosby Show,” during its fifth season, and was rushed to Cosby’s dressing room one night after a shoot.\nTirl said when she entered the room Cosby closed the door and locked it.\n“There was a palpable shift of power. I lost my breath,” she continued.\nAccording to Tirl, the two talked for nearly half an hour, saying her “knees shook” behind the coffee table the entire time, before she tried to deter Cosby by saying, “Bill, you are Jello pudding pops and Fat Albert to me…you are my childhood.”\n“He barked back instantly, ‘Don’t say that, they all say that!” said Tirl. “I had handled being ‘hit on’ many times in the industry, this had far surpassed that…I felt dominated.”\nDozens of women have come forward to accuse Bill Cosby of sexual assault in recent months, which has resulted in several career setbacks for the comedian.\nNetflix has postponed a comedy special that was set to air last year, NBC shelved another comedy that was in development, and reports surfaced Cosby has been dropped by his top tier talent agency in Los Angeles.\nMartin Singer, Cosby’s attorney, continues to deny all allegations and accusations against the comedian.","url":"https://www.breitbart.com/entertainment/2015/08/13/3-more-bill-cosby-accusers-come-forward-he-thought-his-semen-was-like-holy-water/"}
