{"authors":["Jewel Wicker"],"date_download":"2018-10-30 20:00:15","date_modify":"2018-10-30 20:00:15","date_publish":"2017-03-24 06:00:37","description":"Metro Atlanta’s newest mixed-use community is scheduled to open next month, welcoming Atlanta...","filename":"data/vaneerConsumption/3mustattendentertainmentvenuesnearSuntrustPark.json","image_url":"https://www.myajc.com/rf/image_large/Pub/p8/MyAJC/2017/03/21/Images/WPIMAGE_cmgajcartsculture_6127.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/myajc.com/blog_arts-culture_must-atte_3e1a04836d64a48506f220358a9ea3e8__1540929615.html","title":"3 must-attend entertainment venues near Suntrust Park","title_page":"3 must-attend entertainment venues near Suntrust Park","title_rss":"NULL","source_domain":"ajc.com","text":"While The Battery Atlanta will offer a series of special events throughout the complex, in addition to Braves games at SunTrust Park, and dining and shopping opportunities, there are a few entertainment venues that are dedicated to bringing new live entertainment and gaming options to Cobb County.\nHere are three entertainment spaces within The Battery Atlanta that are sure to entertain both kids and adults:\nCoca-Cola Roxy\nCobb County’s newest Live Nation music venue will be located inside The Battery Atlanta. The 3,800-capacity Coca-Cola Roxy already has four shows lined up, beginning with the April 8 Glass Animals concert ahead of SunTrust Park’s opening game on April 14. Tickets to the first concert at the new music venue and the Braves’ first game in their new ballpark have already sold out. Luckily, music fans will have a variety of other concert options to choose from. Corey Smith (April 22), Lil Wayne (May 8) and Bush (May 10) have also been booked to play the venue.\nThe Coca-Cola Roxy is named after the Buckhead music venue that closed nearly a decade ago. That Buckhead location is currently occupied by Buckhead Theatre.\nVisit LiveNation.com and stay tuned to AJC’s music blog to view Coca-Cola Roxy concerts as they are announced.\n+ × Courtesy of Atlanta Braves\nHope & Will’s Sandlot\nThis kid-friendly area is located inside SunTrust Park, so families will have to have tickets to a Braves game to participate.\nHosted by Children’s Healthcare of Atlanta, the area will feature a series of interactive games to keep children of all ages entertained during a trip to the ballpark.\nSunTrust Park officials say Hope & Will’s Sandlot features the “first-ever zip line and climbing tower inside a professional sporting venue.” Download the Braves app to reserve a timeslot so your kids can enjoy the 150-foot-long zip line and 28-foot-tall climbing wall for $5 each.\nFor less adventurous kids, the space will also feature carnival-like games such as “Chop-A-Mole” ($2), and a LED board that allows kids to run from home to first base and compete against the times of Braves players (free).\nFood and merchandise will also be served in this area.\n+ × Rendering of Punch Bowl Social courtesy of Atlanta Braves\nPunch Bowl Social\nThis entertainment space won’t open until September, but it will likely be a big hit amongst Battery Atlanta visitors looking for a place to eat, drink and play games.\nPunch Bowl Social’s first location in metro Atlanta promises a “Southern-inspired scratch-made menu,” craft drinks and vintage video games.\nThe two-story facility will include eight bowling lanes, a bocce court, three private karaoke rooms and a 2,200-square-foot rooftop patio.","url":"https://www.myajc.com/blog/arts-culture/must-attend-entertainment-venues-near-suntrust-park/7b4p8HNe67F57NGy5HV0cP/"}
