{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:22:20","date_modify":"2018-10-30 21:22:20","date_publish":"2018-08-27 13:00:00","description":"Hummus that's perfect for back-to-school/back-to-the-office.","filename":"data/vaneerConsumption/3ofthebesthummusproducts.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/20/Images/Sriracha%20Carrot%20Drizzled%20Cauliflower%20Tacos%202.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_bu_a08e5d15725f8d832b7be9b607764ae2__1540934540.html","title":"3 of the best hummus products","title_page":"3 of the best hummus products","title_rss":"NULL","source_domain":"ajc.com","text":"Hummus is the new peanut butter and for good reason. We’ve got two local and one national brand we think you ought to try. Perfect for back-to-school/back-to-the-office.\nSriracha Carrot Hummus from Lantana\nThere are lots of national brands of hummus these days. Lantana out of Austin, Texas, is our new favorite. They make 12 flavors like cucumber, beet and cauliflower, and they’re all delicious. But the one we like best is the Sriracha Carrot. If you’re a fan of sweet chili sauce (raise your hands), you’ll enjoy this. A little sweet, a little hot, it’s even topped with sunflower seeds and tiny bits of dried apricot. Not too spicy, the kids around here loved it, too. Don’t restrict your hummus uptake to dipping veggies and crackers. These are delicious as dressings for vegetable and chicken salads, to top pizzas or for using in place of salsa and sour cream with your favorite tortilla-based dishes.\n$4.99 per 10-ounce container. Available at Publix, Kroger, Sprouts, Fresh Market and Target. Use this link to get a $1 off coupon: https://www.lantanafoods.com/coupons.\nSweet potato hummus from Good Gut Feeling\nSweet Potato Hummus from A Good Gut Feeling\nTrevor Miller of Marietta’s A Good Gut Feeling prepares handcrafted foods that reflect his Moroccan heritage. One of his best loved products is his sweet potato hummus, available in both original and a roasted red bell pepper flavor. Unlike other hummus based on beans, these are purees of organic sweet potatoes mixed with tahini, lemon juice, olive oil, garlic and seasonings. The result is smooth and creamy and unlike any other hummus you’ve tried. And try his Cider Fresh beverages in original (with rose water) and ginger flavors. With all his products, Miller is focused on producing food that is nourishing as well as delicious.\n$6 per 8-ounce container. Available at the Alpharetta, Marietta and Morningside farmers markets. http://agoodgutfeeling.com.\nHummus from Epicurean Chef\nHummus from Epicurean Chef\nDecatur-based Kevin Torres is the Epicurean Chef and among other things he makes hummus. He has four varieties, freshly made and then freshly packaged when you purchase them at a local farmers market. We tried the classic garlic hummus and cilantro-lime-poblano variety. The classic is indeed full of garlic flavor and we think we detected some lime zest as well. The cilantro-lime-poblano is tart from the lime, hot from the poblano pepper and full of herbal flavor. They’re both really sharp and fresh. He also makes roasted red pepper and artichoke and arugula hummus. Because they’re made fresh with no preservatives, you should plan to enjoy them within 3 days of purchase. If you’re lucky, they’ll be offering hummus wraps and vegetarian gyros on the day you go shopping.\n$5 per 6-ounce container. Available at the Decatur, Ponce City and East Atlanta Village farmers markets.\nRELATED:\nMore must-buy food products\nTry these Made in Georgia food products\nGet a taste of the new fusion revolution with the 2018 AJC Spring Dining Guide: Global Mashup\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/buy-this-love-hummus-try-these-three/VCuPDFwkhqmBwCTbheeOGI/"}
