{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:21:09","date_modify":"2018-10-30 21:21:09","date_publish":"2018-07-23 13:00:00","description":"The best ways to enjoy cherries in Georgia right now, from a pitter to a jam.","filename":"data/vaneerConsumption/3ofthebestcherryproductstotryrightnow.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/15/Images/cherries1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_bu_99faa367f060b2fa66e1d09df1688027__1540934469.html","title":"3 of the best cherry products to try right now","title_page":"3 of the best cherry products to try right now","title_rss":"NULL","source_domain":"ajc.com","text":"Plump, juicy cherries are one of the highlights of summer. Oh, how I wish they grew here in Georgia. Wouldn’t you love to just pick perfectly ripe cherries right off a tree in your back yard? But our long hot summers and generally warm winters mean we’re dependent on cooler parts of the United States for our cherry fix.\nCherries from Washington, Oregon, Idaho, Utah and Montana\nDark, sweet cherries from the Northwest U.S.\nThis year’s cherries seem extra sweet to me, maybe the product of a cold, wet winter in the parts of the U.S. where cherries are grown. The orchards that are part of the Northwest Cherry Growers expect to yield a harvest more than 226,000 tons of cherries this year. Picking started in June and you should be able to find these northwest cherries at your grocery store through mid-August. Buy plenty to eat fresh out of hand or in salads, but stock up on lots more to pit and freeze for cobblers, pies and yes, that old-fashioned but delicious treat, Cherries Jubilee. Our new favorite way to enjoy frozen cherries is in a cherry-lime slushy created by Lyn Deardorff of The Learning Kitchen at the Sweet Auburn Curb Market. Puree frozen cherries with fresh lime juice and a little sugar if needed. You can make it with fresh cherries, of course. Just add ice.\nMore information at http://nwcherries.com.\nChef’n’s QuickPit Cherry Pitter\nCherry Pitter from Chef'N (David Bell/Â© David Bell_Studio 3, Inc.)\nCherry pits are the only downside of eating fresh cherries. Pop them in your mouth, carefully chew, spit out the pit. Repeat. But not good when you want to use those cherries in a recipe. So we were anxious to try this new cherry pitter from the folks at Chef’N. Pop the cherry into the little space (know that really big cherries might take some finagling), and then pull the handle toward you. Out pops the pit. Amazingly quick and easy. Easily the best pitter we’ve tried. We had the best luck when we did our pitting over a relatively deep bowl so the bowl could catch the juice. We found we needed to either hear the pit hitting the bowl or see it land in the bowl in order to be sure the pit was removed. Sometimes, because of the way you’ve inserted the cherry, the pitter may miss the pit. In that case, you’ll want to pry open the cherry and remove the pit so your diners won’t bite down on something they’re not expecting!\n$9.99. Available at Sur la Table stores or online at http://www.chefn.com/quickpittm-cherry-pitter-cherry.html.\nDragonfly Design Studio’s Black Cherry Jam\nCherry Jam from Dragonfly Design Studio (Picasa)\nDecatur-based Stephanie Mealor Corder loves cherries and that’s a good thing because her Black Cherry Jam is indeed a labor of love. She says it’s the most labor-intensive jam she makes what with stemming and pitting all those cherries, but she keeps making it because her customers love it so much that she frequently sells out. The jam is made with just cherries and sugar, no pectin, so it’s a little loose. We’ve been enjoying this dark and richly flavored jam spooned into yogurt and stirred into glasses of sparkling water. This is a very seasonal flavor with the first jars only available starting in late June and until cherry season is over. Then that’s the end of the Black Cherry Jam until next year.\n$5 per 4-ounce jar, $7 per $8-ounce jar. Sold at the Decatur Farmers Market on Wednesdays and Saturdays. https://www.facebook.com/StephanieMealorCorder/\nMust-buy food and cooking products\nGet a taste of the new fusion revolution with the 2018 AJC Spring Dining Guide: Global Mashup\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/buy-this-fresh-sweet-cherries-pitter-and-cherry-jam-three-things-you-need-enjoy-this-bright-red-fruit-right-now/uPO0F8KQuHWXYlRVuX2MnM/"}
