{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:22:16","date_modify":"2018-10-30 21:22:16","date_publish":"2018-07-15 13:00:00","description":"Ice cream made in the South that you can enjoy at home.","filename":"data/vaneerConsumption/3ofthebestSouthernmadeicecreams.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/15/Images/highroad1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_bu_4369c63cca3b63e69b02a10a0fa7017c__1540934536.html","title":"3 of the best Southern made ice creams","title_page":"3 of the best Southern made ice creams","title_rss":"NULL","source_domain":"ajc.com","text":"Does your ice cream and gelato consumption go up as temperatures soar? Ours, too.\nHigh Road Craft Ice Cream Sandwiches\nIce Cream Sandwiches from High Road Craft Ice Cream\nKeith and Nicki Schroeder founded High Road Craft Ice Cream to make premium ice cream for Keith’s professional colleagues - those pastry chefs at restaurants and resorts too time-pressed or space-confined to make their own. In eight years they’ve expanded from a three-person operation to a team of more than 60 employees making ice cream and sorbets in their own Marietta facility. A recent addition is a line of ice cream sandwiches, the perfect portable summertime dessert. Choosing between them is tough - Chocolate Chip Cookies with Malt Ice Cream .... or .... Peanut Butter Cookies with Chocolate Ice Cream. Do what we did. Buy (and enjoy) both.\n$4.99 to $5.29 per package of two. Available at Publix, Oakhurst Market and most Savi Provisions locations or online from zifty.com or at http://highroadcraft.com.\nMayfield Creamery’s Summer Ice Cream Flavors\nBanana Pudding ice cream from Mayfield Creamery\nWe love that Mayfield Creamery has been making ice cream for Southern families since 1923. The first creamery was in Athens, Tennessee. They’re still making ice cream there and if you’re in their neighborhood you can tour the creamery. You can also browse your grocer’s frozen food aisle and be sure of finding their standby flavors in bright yellow cartons. They have buckets of flavors - with Southern specialties like Black Walnut and Smoky Mountain Fudge. But they make seasonal flavors, too, sold in brightly colored cartons, like the Banana Pudding and the Butterscotch Fudge we just tried. Great for summer. I love these flavors that have add-ins like bits of vanilla wafer and ribbons of fudge. Just makes eating ice cream more fun.\n$5.99 per 1.5 quart container. Available at Publix, Kroger and Walmart. https://mayfieldcreamery.com.\nHoneysuckle Gelato’s Brown Butter Crunch\nBrown Butter Crunch from Honeysuckle Gelato\nHoneysuckle Gelato is made in Atlanta by a team that’s exceptionally talented at turning out decadent varieties of rich, smooth gelato. Flavors like Sea-Salted Caramel and Bourbon Pecan Praline hit every mark. Now there’s Brown Butter Crunch - salty, sweet, smooth and crunchy. The browned butter adds a whole other dimension to the flavor and we love that it’s made with local favorite, Banner Butter. We’re not the only fans, Brown Butter Crunch just won the 2018 Flavor of Georgia contest for best ice cream. In addition to making good gelato, the company is committed to doing good by giving five percent of its companywide profits to the Atlanta Community Food Bank.\n$6.99 per pint. Available at Whole Foods Market and other markets, list available at https://honeysucklegelato.com. Scoops, shakes and sandwiches available at the Honeysuckle Gelato retail shop, Ponce City Market, 675 Ponce de Leon Avenue. Or order online through http://zifty.com.\nNow that summer is here in full blast, we bet you have a few secret go-to frozen treats to help beat the heat. Last week's Best of Atlanta poll was inspired by all things cool and tasty.\nRELATED:\nGet the scoop on metro Atlanta’s top frozen treats\nFind ice cream with an Indian flair from the metro Atlanta company\nAJC readers say this is the best spot for ice cream in metro Atlanta\nSatisfy your sweet tooth at these OTP ice cream shops\nThis Atlanta ice cream shop was named one of the 31 best in America\nA directory of 24 places across metro Atlanta to cool down with something sweet\nCheck out these frozen treats with a twist in metro Atlanta\nMust-buy food and cooking products\nGet a taste of the new fusion revolution with the 2018 AJC Spring Dining Guide: Global Mashup\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/buy-this-cool-off-with-three-southern-frozen-treats/StIk0MQwsuKZ3NWnK6tM3O/"}
