{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:21:00","date_modify":"2018-10-30 21:21:00","date_publish":"2018-08-13 13:15:00","description":"Sometimes you want to brew your tea and sometimes there’s no time. For Labor Day, we’re serving these.","filename":"data/vaneerConsumption/3ofthebestteaproducts.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/08/Images/milos.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_bu_c743c9d1a3356bf399ad7990842f28e1__1540934460.html","title":"3 of the best tea products","title_page":"3 of the best tea products","title_rss":"NULL","source_domain":"ajc.com","text":"We drink iced tea all year round, and love having pitchers of different kinds of tea available. Some straight up sweet tea, some herbal and caffeine-free. Sometimes you want to brew your tea and sometimes there’s no time. For Labor Day, we’re serving these.\nFamous Sweet Tea from Milo’s Tea Company\nSometimes there’s no time to brew tea. Or no place. Or you just don’t think you do as good a job as the professionals. For those times, there’s Milo’s from Bessemer, Alabama. You can count on folks from Alabama to do iced tea right. Milo and Bea Carton opened a restaurant in Bessemer in 1946. In the 1980s Milo’s son Ronnie started selling their tea to local grocery stores and today Milo’s granddaughter Tricia is the CEO of Milo’s Tea Company and their tea is available from coast to coast. The family-owned business company is committed to doing good and donates thousands of gallons to nonprofits each year. And the tea is delicious. The sweet is sweet, but not too much so. They also make no-calorie and decaf sweet tea versions as well as unsweet and a sweet tea/lemonade combination. There’s an organic line as well and peach tea, a seasonal flavor. You can buy it by the gallon, the half gallon and in individual 20-ounce bottles.\n$2.99 per gallon, $.99 per 20-ounce bottle. Available at Kroger, Target, Sprouts and Ingles. Look in the refrigerated juice section or in the deli case with the prepared sandwich and picnic foods. https://drinkmilos.com.\nMint to Be loose tea from Just Add Honey\nMint to Be loose tea from Just Add Honey\nJust Add Honey Tea Company blends all kinds of loose leaf teas - black teas, green teas, white teas and herbal and fruit teas. You’ll find them at local farmers markets with big urns of hot water, lots of teas to sample and special cups with filters in the lid so you can walk around with your own cup of freshly brewed tea, sweetened (or not) just the way you like it. We bought their Mint to Be mix, an herbal blend of spearmint, peppermint, citrus peel, rosehips, lemon myrtle and stevia. The labels provide precise brewing directions for this naturally caffeine-free blend. It was delicious hot, but iced? Perfect with all that wonderful refreshing mint. Just the pick-me-up we need on humid, hot days. You can find their tea available by the cup at shops like Inman Perk, Grant Park Coffee and Blue Eyed Daisy.\n$5 per ounce. Available at Piedmont Park farmers market, Hodgepodge, Carver Community Market, The Beehive, Mama Bath + Body. JS Marriott Buckhead, Hyatt Atlanta and Rinse Bath & Body and at the shop in Sweet Auburn Curb Market, 209 Edgewood Avenue, Atlanta. https://justaddhoney.net\nMirage loose tea from TeaFusions\nMirage loose tea from TeaFusions\nMo Shahteydari is the founder of TeaFusions, a Peachtree-City based vendor and blender of teas. We liked Mirage, a combination of rooibos with marigold petals, cornflower buds and raspberry leaves. Rooibos is an herb that grows in South African and its leaves are widely used in caffeine-free herbal blends. It’s lightly sweet and makes a tea with a red tint. In this TeaFusions combination, the flavors are floral and fruity. In a tasting, it was a favorite of some of the kids, needing no sweetener to be palatable to their young taste buds. They offer rooibos teas in more than a dozen blends including Masala Chai and Orange Zest. All make delicious tea both iced and hot.\n$10 per 2-ounce package. Available at the Peachtree City Farmers Market or online at https://teafusions.myshopify.com.\nRELATED:\nMore must-buy food products\nTry these Made in Georgia food products\n3 Georgia teas you need in your pantry\nMake your own sweet tea with these recipes\nRaise your pinkies to these 4 OTP tea rooms\nGet a taste of the new fusion revolution with the 2018 AJC Spring Dining Guide: Global Mashup\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/buy-this-serving-iced-tea-for-labor-day-yes-three-products-brew-savor/tORBx7t9asdhnWHrWzNqaN/"}
