{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:21:20","date_modify":"2018-10-30 21:21:20","date_publish":"2018-07-30 13:00:00","description":"When peaches aren’t in season, you can still enjoy them in these three products.","filename":"data/vaneerConsumption/3ofthebestpeachproducts.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/28/Images/peach%20glaze.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_bu_1c3ea9527c5c2846b1abe54f87d2a0a4__1540934480.html","title":"3 of the best peach products","title_page":"3 of the best peach products","title_rss":"NULL","source_domain":"ajc.com","text":"Peaches = summer. A big bowl on the counter perfumes your whole kitchen. Hope you’ve been stocking up on some of the best peaches we’ve had in ages. But when peaches aren’t in season, you can still enjoy them in these three products.\nDoc and Artie’s Tangy Ginger Peach Glaze\nErika Wilkins created her Peachtree City-based business based on a passion for cooking developed while watching her godfather, Doc Shepherd, and her grandmother, Artie R. Jones, preparing meals in their work as domestics. She credits them for the opportunity to attend Dartmouth College, become an engineer and then an attorney, and then finally with inspiring her to create Doc and Artie’s Teas, Spices & Foods. Her husband Thaddeus Wilkins is co-owner. She has created dozens of spice blends, teas, salts, soup mixes, sauces and glazes. We tried the Tangy Ginger Peach glaze, an entry in the 2018 Flavor of Georgia competition. It’s a scrumptious combination of honey, soy sauce, ginger, rice vinegar, peaches and mustard and you could absolutely just eat it with a spoon. We used it to glaze grilled salmon but the generous bottle will find lots of use with everything else we take off the grill and as a sauce for the vegetables accompanying our next rice bowl.\n$12 per 16-ounce bottle. Available at the Peachtree City, Newnan, Pinewood Forest and Fairburn farmers markets and online at http://docandarties.com.\n<","url":"https://www.ajc.com/blog/atlanta-restaurants/buy-this-fresh-georgia-peaches-for-now-these-three-peach-products-for-later/R4FbUNLfMNxU6gqGGWYZDL/"}
