{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:22:08","date_modify":"2018-10-30 21:22:08","date_publish":"2018-08-06 13:00:00","description":"We’ve got three pickles we think you should try.","filename":"data/vaneerConsumption/3ofthebestpicklesmadeintheSouth.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/28/Images/chow%20chow.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_bu_068a97f4f3ee74995362be5130d5c4a4__1540934528.html","title":"3 of the best pickles made in the South","title_page":"3 of the best pickles made in the South","title_rss":"NULL","source_domain":"ajc.com","text":"Late summer meant your grandmother would have putting up pickles like crazy. It’s the way to preserve all those bountiful vegetables for fall and winter feasting. We say let somebody else do the work for you. We’ve got three pickles we think you should try.\nJake’s Georgia Chow Chow\n﻿\nChow Chow is one of those old-fashioned relishes that was a staple of Southern kitchens. If you needed to use up cabbage, green tomatoes, peppers and onions, Chow Chow was what you made. And then you served it with the greens and beans that were a staple of Southern dinner tables. Jake’s Produce of White, Georgia, makes delicious Chow Chow along with pickles, salsas and Reaper Pepper Relish, a 2017 Flavor of Georgia finalist and mighty hot! The Chow Chow has a definite bread-and-butter pickle background along with a little bit of heat from jalapeno peppers. It would be great for all the traditional uses but we like it as a substitute for pickle relish in macaroni and potato salads, or mixed into a batch of deviled eggs. They also make a seasonal favorite, Georgia Bourbon Peach Butter, with plenty of bourbon and vanilla to spice up those fresh peaches. We’ve been enjoying that on waffles this summer.\n$8 per 16-ounce jar. Available at Buford Highway Farmers Market, Olive Tree & Vine in Cartersville, Eden Fresh Market in Fayetteville, Lakeview Vintage Market in Hiawassee, Big Door Vineyards in White and the Jake’s Produce retail shop, 591 Knox Bridge Highway, White. https://jakes-produce-cannery.myshopify.com/.\nSweet Gourmet Pickles from Pickled Pink\nPickled Pink’s Sweet Gourmet Pickles\nI confess. I could eat sweet pickles by the jarful. I love them with cheese, I love them with crackers, I love them just by themselves. And these Sweet Gourmet Pickles from Atlanta-based Pickled Pink? They’re so good I had to make myself stop so others could try them. Thick cut cucumbers are pickled, then they sit in a sweet brine with mustard seed, garlic, cinnamon and black peppercorns. It’s an old family recipe. Hand packed into jars with lots of the seasonings, they stay spicy and sweet to the last pickle. Their website has a ton of fun ideas like a Pickled Pink peanut butter sandwich or fried Pickled Pink pickle chips. Or you can be like me and just eat them right out of the jar. Profits from Pickled Pink support Hunter’s Hotline, providing a safe space to report bullying, drug and alcohol abuse and other issues for young lives.\n$5.99 - $7.99 per 16-ounce jar. Available at Sprouts, Star Provisions, Cook’s Warehouse, Buford Highway Farmers Market, Cheese and Mary in Milton, Alon’s, Ace Hardware on Scott Blvd. and Local Exchange in Marietta. https://pickledpinkfoods.com.\nSweet Dill PIckled Okra from Kenny B's\nKenny B’s Sweet Dill Pickled Okra\nYou think you know pickled okra, do you? Well, have you tried sweet pickled okra? Ken Brown of Murrayville, Georgia, started making pickles for himself, friends and family about five years ago. “We started making them at home and couldn’t make them fast enough for our friends,” he said. Now these sweet pickles are made at a commercial facility in Tiger. They’re sweet, they have a little dill and they have a little garlic, but they’re not bread-and-butter pickles and they’re definitely habit forming. There are Sweet Dill Pickles, Sweet & Spicy Dill Pickles Sweet & Spicy Pickled Okra and the okra pickles we tried. We liked the change from traditional pickled okra and we think you will, too.\n$6.00 per 16-ounce jar. Available at Striplings, Jaemor Farms, Chadwick’s Produce in Lawrenceville, Leonard’s Market in Cumming, David’s Produce in Decatur and Georgia Threads, Apparel & Gifts in Buford. For more information and locations: https://www.facebook.com/kennybspickles/.\nRELATED:\nMore must-buy food products\nTry these Made in Georgia food products\nGet a taste of the new fusion revolution with the 2018 AJC Spring Dining Guide: Global Mashup\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/buy-this-three-southern-pickles-you-want-try/NAWjBdiXknQjAbC8EDOXBP/"}
