{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:21:47","date_modify":"2018-10-30 21:21:47","date_publish":"2018-06-28 00:14:00","description":"There’s lots of buzz these days about raw honey.","filename":"data/vaneerConsumption/3ofthebestnewhoneyproducts.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AccessAtlanta/2018/06/27/Images/creamed-honey.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_bu_1fa17755c209959aae7d91e5d793e833__1540934507.html","title":"3 of the best new honey products","title_page":"3 of the best new honey products","title_rss":"NULL","source_domain":"ajc.com","text":"There’s lots of buzz these days about raw honey. If you’re accustomed to grocery store honey, it’s time to branch out and taste the striking differences in local honey, sourced from different flowering trees and shrubs.\nCreamed Honey\nCreamed Honey from H. L. Franklin's Healthy Honey\nH. L. Franklin’s Healthy Honey in Statesboro harvests honey from eight different Georgia plant sources including palmetto, tupelo and gallberry. A very special variety is their crystalized cotton honey. They’ve recently added Creamed Honey to their product line and it was just recognized as the Finalists’ Choice at the 2018 Flavor of Georgia competition and won the best of the Honey and Related Products category. Creamed honey is one of our favorite ways to enjoy this sweet treat. It’s not honey mixed with cream - it’s honey that’s been whipped to create a creamy texture. It doesn’t drip or drizzle. It stays creamy and that means it’s great for spreading on toast or using as a sandwich spread with something like ham or turkey. And that makes it easy to enjoy all day long.\n$16 per 12-ounce jar. Available at Etsy and Amazon and online at http://franklinfoodsllc.com where you will also find a list of retailers.\nHoney from Georgia and North Carolina\nBlue Ridge Honey Company\nBob and Suzette Binnie of Blue Ridge Honey Company in Lakemont near Lake Rabun know a lot about honey. They should, since they manage 2,000 hives and 60 bee yards across Georgia and in neighboring North Carolina. In season, they may have three north Georgia honeys: mountain wildflower, wildflower and sourwood, and three honeys from south Georgia: cotton blossom, gallberry and American honey. Stop by the store and sample each and be amazed at the range of flavor. Each is distinct. Some like mountain wildflower are mild and sweet while others like American holly temper the sweet with just a hint of bitter. You could spend an hour deciding on a favorite. The staff is happy to let you take your time. And while you’re there pick up a few beeswax candles to perfume your rooms with their lovely honey fragrance.\nHoney available in sizes ranging from 2-ounce jars to gallon jugs and starting in price at $1.85. Available at Kroger and Walmart and at Blue Ridge Honey Company, 6306 Highway 441 South, Lakemont. 706-782-6722. Or online at http://www.blueridgehoneycompany.com/.\nHot Southern Honey\nAR's Hot Southern Honey\nSeems everything’s getting infused with chili peppers these days, and honey is no exception. Forgive us if we’re a little skeptical. Not everything needs to be hot. But we are here to tell you that AR’s Hot Southern Honey is terrific. Ames Russell (the “AR”) of Virginia has come up with the perfect formula for infusing sweet honey with flavorful hot red peppers. The result is addictive. It comes both “mild” and “hot.” We tried the mild. At first it’s just sweet, but then you get that little bite of heat. Stay with us now, but it reminded some of us of cinnamon red hots. No cinnamon, no artificial anything, but an intriguing combination of sweet and heat that made us keep reaching for just one more spoonful.\n$6.99 per 8-ounce squeeze bottle. Available online at https://hotsouthernhoney.com/.\nRELATED\nMore must-buy food products\nGet a taste of the new fusion revolution with the 2018 AJC Spring Dining Guide: Global Mashup\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/buy-this-three-ways-get-little-more-honey-your-day/lmnTqv6Lh0l4Hm3j5jhKIP/"}
