{"authors":["Mara Liasson"],"date_download":"2018-10-22 21:15:33","date_modify":"2018-10-22 21:15:33","date_publish":"2016-07-27 00:00:00","description":"A Clinton win would mean the president's policy legacy is kept intact, while a Trump victory would make the election all about a backlash to Obama's tenure.","filename":"data/vaneerConsumption/3QuestionsAheadOfPresidentObamasDNCSpeech.json","image_url":"https://media.npr.org/assets/img/2016/07/27/gettyimages-545147580_wide-2437a50dbcfb372dfd007b00ab9b69a1d839968b.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_07_27_487566634_3-questions-ahead-of-president-obamas-dnc-speech_1540242933.html","title":"3 Questions Ahead Of President Obama's DNC Speech","title_page":"3 Questions Ahead Of President Obama's Democratic National Convention Speech : NPR","title_rss":"NULL","source_domain":"npr.org","text":"3 Questions Ahead Of President Obama's DNC Speech\nEnlarge this image toggle caption Justin Sullivan/Getty Images Justin Sullivan/Getty Images\nTonight President Obama will take the stage at the Democratic National Convention with one goal: convincing voters to elect Hillary Clinton as his successor.\nThe stakes are high for the newly minted nominee, but they are arguably even higher for the incumbent president. A Clinton win would mean his policy legacy is kept intact and there's validation of his tenure in the White House.\nBut if Trump is elected and the story of the election becomes all about race and a backlash against the Obama years, then everything the president has worked for during the past seven years is in jeopardy.\nHere are three questions as Obama gets ready to make what will probably be his last speech before such a large audience.\nHow much of the speech will be valedictory, and how much will be a defense of Hillary Clinton?\nWhite House Press Secretary Josh Earnest has said the president has been working on his speech for several weeks. That underscores just how important Obama knows this address is — plus, he has a tough act to follow after his wife's rousing speech on Monday night.\nWednesday also happens to be the 12th anniversary of the then-U.S. Senate candidate's keynote address at the 2004 Democratic National Convention in Boston that skyrocketed him to political fame.\nThe president is certain to reflect on his journey since then. And he'll also do what he's been doing in many recent speeches: recount what the country has accomplished since he took office, including coming back from the brink of economic collapse with the longest stretch of private-sector job growth in the nation's history.\nBeyond that defense, he'll also hit some of the same themes of the Clinton campaign, underscoring that the country is better off united than divided. And he will provide a character reference for his former secretary of state, describing how the two former rivals became close collaborators and colleagues. He's also expected to explore how he came to believe that she has the judgment, toughness, intellect and experience to succeed in the White House.\nWill the president talk about Donald Trump?\nThis is one of the many balancing acts the Clinton campaign has had to perform this week — how much to build up Clinton while simultaneously trying to tear down Trump?\nClinton's negative ratings are so high, her campaign could decide the best way to win is by simply ripping apart her GOP opponent, who is equally unpopular. But they also want to humanize Clinton and make her more relatable to voters, and Obama's speech will play a major role in that goal. Still, as Clinton campaign chairman John Podesta said on Tuesday, \"the president likes to get his licks in every now and then on Donald Trump,\" so he'll probably do that too.\nWill he provide the missing link in Hillary Clinton's campaign?\nIn 2012, another former president came to Obama's aid with an effective speech at the Democratic convention in Charlotte. Four years ago, Bill Clinton put on his \"secretary of explaining stuff\" hat and made the argument for Obama's re-election better than the incumbent had been able to do himself. Now, Obama has the chance to return the favor for Hillary Clinton.\nThe former first lady has been criticized for running a campaign long on programs and policy proposals and short on a unifying theme or a simple, straightforward explanation of how she will improve people's lives.\nWhatever you may think about the rallying cries to \"Make America Great Again,\" build a wall along the Mexican border or ban Muslims from entering the U.S., Trump's voters know exactly what he means. Maybe Obama, whose simple message of \"hope and change\" helped him win the White House, can help his former rival do the same.","url":"https://www.npr.org/2016/07/27/487566634/3-questions-ahead-of-president-obamas-dnc-speech"}
