{"authors":["Ben Carlson","A Wealth Of Common Sense"],"date_download":"2018-10-30 23:53:57","date_modify":"2018-10-30 23:53:57","date_publish":"2018-07-15 00:00:00","description":"Amazon, Netflix and Microsoft make up most of the gains in the S&P 500 and Nasdaq 100. The concentration of returns in the stock market is one of the most underrated reasons for diversifying investments.","filename":"data/vaneerConsumption/3stocksalonemakeupmostofthegainson2USindices.json","image_url":"https://amp.businessinsider.com/images/5b48ef9967ce352d008b4899-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_3-stocks-alone-make-up-most-of-the-gains-on-2-us-indices-2018-7_1540943637.html","title":"3 stocks alone make up most of the gains on 2 US indices","title_page":"    3 stocks alone make up most of the gains on 2 US indices - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters / Brendan McDermid\nCNBC had a piece this week that looked at how top heavy returns in the stock market have been this year. They showed 3 stocks — Amazon, Netflix and Microsoft — alone make up more than 70% of the gains in the S&P 500 and Nasdaq 100 indexes:\nA Wealth of Common Sense\nWhen you include Apple, Google (I refuse to call this company Alphabet), and Facebook those numbers jump to an absurdly high 98% and 105%, respectively.\nThe obvious takeaway here would seem to be that 2018 market returns (around 5% for the S&P and 14% for the Nasdaq 100) are all being driven by a handful of names. And if that handful of stocks ever come back down to earth, which they've been wont to do on occasion, watch out below.\nThe simplest explanation for these staggering numbers is the fact that this is how market capitalization weighted indexes work. By definition, the largest stocks will have a bigger impact on the returns than the smaller stocks.\nFor instance, Amazon has added nearly $285 billion in market cap this year alone. This number is insane when you consider Amazon's entire market cap was $285 billion in April of 2016. That $285 billion gain this year is the same size as the total combined market cap of the 40 smallest stocks in the S&P 500.\nMany of the names in that list of the 40 smallest stocks by market cap have had good returns this year:\nTripAdvisor +70%\nRobert Half International +21%\nEnvision Healthcare +29%\nAES Corp +23%\nNordstrom +14%\nBut those stocks aren't going to move the needle as much as Amazon or Microsoft or Apple because they don't carry the same weights as the large tech stocks.\nIt would also be more concerning that the gains were so concentrated at the top if the S&P 500 was the only thing going up this year. Spoiler alert — it's not.\nSmall cap stocks are up around 10% in 2018. Mid caps have risen almost 6%. Micro caps, the smallest stocks in the market, making up a measly 2% of the total, are up more than 13% this year.\nAnother way of looking at this is the advance-decline line, which is a way to track market breadth by comparing the number of stocks rising with the number of stocks falling. Here's the latest reading set against the S&P 500:\nA Wealth of Common Sense\nIf there were only a few stocks rising you would see a large divergence between these lines. Instead, we see the advance-decline fairly inline with the stock market. This tells us that there are far more stocks rising than just a few of the biggest names.\nIt may feel odd to see performance being driven by so few stocks but this is how the stock market generally works over time. The majority of returns come from a handful of names. It's like this over both short and long time frames.\nData from Hendrik Bessembinder showed that from 1926 to 2015:\nLess than half of all monthly stock returns in the U.S. are larger than the one-month Treasury bill rates (meaning most stocks don't outperform cash).\nJust 42.1% of stocks have a lifetime return greater than T-bill returns while half deliver negative lifetime returns.\nOver half the wealth created in the stock market came from the 86 top-performing stocks, around 0.33% of the total.\nThis doesn't mean other stocks didn't do well over this period, just that the most wealth was created in the stocks that grew to be the biggest (which seems sort of obvious when you think about it).\nIt can also be instructive to look at how some of the other biggest names are performing this year:\nA Wealth of Common Sense\nYes, tech stocks are the big winners. No, this won't last forever. But it's also true that financial or energy stocks at the top of the market won't be laggards forever either. It's quite possible that they can offset some of the relative losses when we do finally see a mean reversion in technology.\nHere are a few takeaways to wrap things up on this topic:","url":"https://www.businessinsider.com/3-stocks-alone-make-up-most-of-the-gains-on-2-us-indices-2018-7"}
