{"authors":["Lea Rose Emery"],"date_download":"2018-10-31 01:41:10","date_modify":"2018-10-31 01:41:10","date_publish":"2018-09-14 20:05:17","description":"If you've ever bailed on plans with friends or a partner for no other reason than to curl up and watch Netflix by your own damn self, you are definitely not alone. In fact, a new survey of 1,000 adults from Porch, the free home network, found that a…","filename":"data/vaneerConsumption/3ThingsPeopleWouldRatherDoAloneVs5TheyWantToDoWithOthers.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/11/7e396971-f963-428b-996c-ddaea1d553e5-zaeh_bustle_apr2016-171.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_3-things-people-would-rather-do-alone-vs-5-they-want-to-do-with-others-11873984_1540950070.html","title":"3 Things People Would Rather Do Alone Vs. 5 They Want To Do With Others","title_page":"3 Things People Would Rather Do Alone Vs. 5 They Want To Do With Others","title_rss":"NULL","source_domain":"bustle.com","text":"If you've ever bailed on plans with friends or a partner for no other reason than to curl up and watch Netflix by your own damn self, you are definitely not alone. In fact, a new survey of 1,000 adults from Porch, the free home network, found that a lot of us would prefer to do nothing than go out and socialize — even if 69 percent of us do feel ashamed for bailing.\nBut whether you love being alone or get FOMO way too easily, being able to do things on your own is a skill that's so important to have. \"It can be beneficial to go solo sometimes, as it provides a break from external influences and allows an individual to reconnect with their values and goals,\" Jennifer Sweeton, Psy.D., M.S., M.A. tells Bustle.\nAnd one of the interesting parts of the Porch survey was that people agreed that doing some activities alone are way better than others. Some things seemed to require a friend or partner, while other activities.... well, people like it to be just me, myself and I.\nThese are the activities went down the best solo — and the ones where people would prefer a companion.\n3 Things We'd Rather Do Solo\n1 Our Social Media: 54.9% Andrew Zaeh for Bustle Whether they mean scrolling or actually having an account on your own, either of those definitely feel like a solo activity.\n2 Watch TV/Netflix: 45.9% Andrew Zaeh for Bustle No talking, no interruptions — more people would prefer to watch Netflix solo than with a partner.\n3 Gym: 43.3% Andrew Zaeh for Bustle Working out alone or with people is definitely a divisive issue. Some #CoupleGoals revolve around sweating it out at the gym, but for people in this survey, using the gym with someone else is a total nightmare.\n5 Things That Are Better With Others\n1 Going To A Nightclub: 60.5% Hannah Burton/Bustle Even though going to a nightclub was the number one activity that respondents said they'd like to do with others, it's sort of amazing that this number wasn't higher. Wouldn't 100 percent of people want to go to a nightclub with people? Who likes going clubbing alone? Maybe some people are just way more adventurous.\n2 Going To A House Party: 60.5% Hannah Burton/Bustle Didn't most of us spend four years of college and then four more years of graduate school avoiding going to house parties alone? Why would anyone do that?\n3 Having Dinner: 58.6% Hannah Burton/Bustle A lot of people don't like dining alone — although taking yourself on a date from time-to-time can be a really nice form self-care.\n4 Going To Happy Hour: 58.3% Hannah Burton/Bustle Happy hour is another activity that you might assume 100 percent of people would want to go to with a friend, but it wasn't unanimous either.","url":"https://www.bustle.com/p/3-things-people-would-rather-do-alone-vs-5-they-want-to-do-with-others-11873984"}
