{"authors":[],"date_download":"2018-10-23 01:00:14","date_modify":"2018-10-23 01:00:14","date_publish":"2015-11-23 00:00:00","description":"Not everyone delights in turkey as the centerpiece to Thanksgiving. We asked three chefs around the country for their suggestions of winning alternatives. They came up with venison, pork and biryani.","filename":"data/vaneerConsumption/3WaysToSpiceUpThanksgivingWithoutTheBirdTheSaltNPR.json","image_url":"https://media.npr.org/assets/img/2015/11/20/biriyanistuffedpumpkinedited_wide-d48bbbcd0de0952bdaef6ae5d4f2b63c4a4cdd0c.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=456698512_1540256414.html","title":"3 Ways To Spice Up Thanksgiving Without The Bird : The Salt : NPR","title_page":"So Long, Turkey: 3 Ways To Spice Up Thanksgiving Without The Bird : The Salt : NPR","title_rss":"NULL","source_domain":"npr.org","text":"KELLY MCEVERS, HOST:\nIt is now T-minus three days before that turkey hits the table. Wait a second. Does it have to be turkey?\nARI SHAPIRO, HOST:\nUh-uh, no it doesn't. And if you are turkey-averse, turkeyphobic, perhaps just bored with the bird, we've got some other main dish ideas for you.\nAMY THIELEN: What I think his cool is to put a center roast on the table that comes from the woods itself - something wild, something home-hunted like venison.\nSHAPIRO: That's Minnesota's own Amy Thielen, author of \"The New Midwestern Table.\" Hey, Amy.\nTHIELEN: Hi, Ari.\nSHAPIRO: Something from the woods itself like venison - you're talking about a deer.\nTHIELEN: A home-hunted deer. I feel like it's one of those secret underground proteins in the American meat-eating story. I like to use venison loin, which is also called the back strap - you know, a more macho name for it.\nSHAPIRO: Yeah.\nTHIELEN: And I like to rub it with some spices - some spice salt like a rosemary salt and then just kind of slowly cook it in a big cast-iron pan in butter, rolling it around until it just becomes nice and ruby red inside. You want a medium-rare temperature on it just like a beef tenderloin.\nSHAPIRO: OK. So you've rubbed this with herb salt. You've cooked it in butter. It's medium-rare. How are you going to serve it?\nTHIELEN: I like to serve it with, you know, just a little simple pan sauce, which - you deglaze the pan with a little bit of Sherry, and then you thicken that with butter. And you might want to add a little bit of cranberry juice because, you know, traditionally, venison likes that sweet-and-sour kind of condiment to go with it. And then I like to make a mostarda.\nSHAPIRO: Mostarda - explain what that is.\nTHIELEN: A mostarda is an Italian kind of a hot mustard condiment, like - kind of like a chutney. It's sweet and sour, and it has a nice punch of hot mustard.\nSHAPIRO: But it's made from fruit.\nTHIELEN: So it's made from fruit. And I make mine with cranberries. And sometimes, I do it with wild cranberries, wild highbush cranberries. But if you don't have that, just the regular cranberries that are in the store are great.\nSHAPIRO: This is like a fully forged Thanksgiving. You have hunted the deer. You have picked the cranberries.\nTHIELEN: (Laughter).\nSHAPIRO: Probably grown the beets for the sugar, right?\nTHIELEN: No. I don't go that far.\nSHAPIRO: Are you going to serve the traditional Thanksgiving sides along with this?\nTHIELEN: Oh, yeah, a full monty on that. But you know, I think that if you just wanted to keep it simple, you could cook a squash, and then you could whip it in a food processor with a little bit of cream cheese or mascarpone cheese, walnuts. I mean, go crazy from there on your own, but I think squash would definitely work with this.\nANTHONY LAMAS: Venison in cranberries - that's a no-brainer. That sounds wonderful.\nSHAPIRO: And that is Anthony Lamas, chef and owner of the restaurant Seviche in Louisville, Ky. Here's his option for a no-turkey Thanksgiving.\nLAMAS: Well, I got to stick with my Latin culture. So, you know, we love a pork roast. And so for me, I love taking a pork and, like, marinating the day before, you know, adding some citrus in there and may be a little bit of smoky chipotle chilies in there, just get that all nice and marinated with some orange and lemons and limes and some - maybe a little fresh cilantro in there. And let that marinate and soak all that flavor up, and then roast it. I like it with the bone on so you can get like a bone-in pork butt or a, you know, pork shoulder.\nSHAPIRO: The shoulder is the butt, right? The pork butt is what they call the shoulder of the pig.\nLAMAS: Exactly. We'll roast it low, cover it, add a little bit of water in there and some onions and garlic and mirepoix, you know, carrots, celery.\nSHAPIRO: Now, you're throwing French terms into your Latin recipes.\nLAMAS: I know (laughter).\nSHAPIRO: A real mash-up.\nLAMAS: We add some of that in there, you know, and that's going to add some flavor and moisture. And I'll cover that, and I'll put that in the oven for about five hours at about 275, 300.\nSHAPIRO: Five hours seems like a long time. It's not going to dry out?\nLAMAS: No, it won't. It won't. It's so much fat on there, and you got that bone. After about four hours or so, I will take the foil off and turn the oven up to about 425 and let all that fat and little bit of skin on there just get all crispy. I'll take that out, put that on just like you would do a turkey on a platter. And then what I'll do is just kind of carve it, you know? It starts to fall apart, really - just chunks. And I'm telling you; this smell is intoxicating.\nSHAPIRO: Well, everybody knows one of the best things about Thanksgiving is the leftovers. What would you do with the leftovers of this pork butt?\nLAMAS: So I'm going to get me a nice corn tortilla. I'm going to warm it right there on the open flame of a gas stove or just, you know, in a warm pan, add that pork in there, maybe a little salsa verde and - boom. You got yourself some pork tacos the next day. Actually, you can just pull it like that and throw a little barbecue sauce. Pull out one of your favorite barbecue sauces. Throw in some white bread - barbecue pork sandwich.\nSHAPIRO: Anthony Lamas, I'm coming to your house next Thanksgiving.\nLAMAS: You're - well, you're - mi casa es su casa.\nSHAPIRO: (Laughter) All right. We've talked about two meat dishes. And so before anyone hits send on that email that's saying, where are the vegetarian options? Well, relax. We've got one for you right now. It comes from Preeti Mistry. She is the chef owner of Juhu Beach Club. It's a restaurant in Oakland, Calif. Hey, Preeti.\nPREETI MISTRY: Hi. How are you?\nSHAPIRO: I'm good. Please don't give us Tofurky. What have you got?\nMISTRY: (Laughter) Most definitely not Tofurky. We're going to stuff a pumpkin. So you know, I'm of Indian origin, and growing up, biryani was always a fun thing we would do for special occasions. Biryani is this layered rice dish. It's, you know, special on its own in the sense that it does take a certain amount of time to make. But instead of just serving it in a normal casserole dish, we're going to stuff it inside a pumpkin.\nSHAPIRO: That sounds beautiful and also very ambitious.\nMISTRY: (Laughter).\nSHAPIRO: Talk about some of the steps that go into doing this project.\nMISTRY: We're going to cook everything separately. So remember; I said it involves a few steps.\nSHAPIRO: Yeah.\nMISTRY: So we're going to cook the rice. I like to add a little saffron or even a little turmeric for color, throw a few cloves, maybe some green cardamom in there as well. And then you're going to saute all of your vegetables - mushrooms, chard. And then I thought a great base for this to give it a little more luxury would be coconut milk. So we're going to make a curry that involves onions, ginger, garlic, tamarind, tamarind pulp, and then we're going to layer it. So if you're making a pumpkin of a medium size, I would suggest putting your vegetables down and then layering the rice on top and baking the whole thing.\nSHAPIRO: As you're scooping this out of a pumpkin, are you also kind of digging into the side of this cooked pumpkin to get some of the squash in the pile with the rice and the chard and the mushrooms and the curry sauce?\nMISTRY: Yes. So that's the awesome thing that kind of happens, is that, you know, the sort of metamorphosis that takes place in the oven. You get this delicious curry and rice, and you know, I like to, you know, make it really festive and add some nuts and dried fruit on top and stuff like that. But then, once you dig into the flesh of the pumpkin, it's soaked up all of the juices, so you get this really sweet flesh of the pumpkin mixed with the spiciness and tanginess of the coconut milk tamarind curry sauce.\nSHAPIRO: You know, it's really hard to come up with a vegetarian dish that has the same kind of heft as a centerpiece that a turkey has. I think you've done it. I think this qualifies.\nMISTRY: Yeah. I mean I think that, you know, one of the most exciting parts to me about the turkey at Thanksgiving is the presentation. It's, you know, this thing that we've labored on all day, and we've just spoken about all of the labor that's going to go into this stuffed pumpkin. And then from there, it's that wonderful moment when it comes to the table. It feels like this special thing that then you're going to carve or dig into it. And so I think that by doing the biryani stuffed inside the pumpkin, it hits all of those spots.\nSHAPIRO: Well, thanks for the idea.\nMISTRY: No worries.\nSHAPIRO: That's Preeti Mistry, the chef behind Juhu Beach Club in Oakland, Calif. You can get her biryani recipe and the other two suggestions for a turkey-free Thanksgiving at our website, npr.org.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=456698512"}
