{"authors":["Patrick X. Coyle"],"date_download":"2018-10-30 18:25:33","date_modify":"2018-10-30 18:25:33","date_publish":"2015-02-26 04:26:49","description":"The Obama administration hasn’t been kind to young people. Despite grand promises, young people have only faced increased hardships. |","filename":"data/vaneerConsumption/3WaysaYoungConservativeCanSurviveintheAgeofObama.json","image_url":"https://media.breitbart.com/media/2015/02/AP423099290698.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_02_25__1540923933.html","title":"3 Ways a Young Conservative Can Survive in the Age of Obama","title_page":"3 Ways a Young Conservative Can Survive in the Age of Obama | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Obama administration hasn’t been kind to young people. Despite grand promises, young people have only faced increased hardships.\nThe infamous stimulus, which was meant to improve job prospects, wasted hundreds of thousands of dollars on grants asking students to keep track of their consumption of alcohol and marijuana, among other bizarre projects.\nSadly, students looking to enter today’s work force are facing record-high youth unemployment. The Youth Misery Index has also risen 50% while Obama has been in office. In addition, young people are inundated daily with politically correct messages from their professors, administrators, and other liberal groups. Our so-called institutions of higher learning are always eager to work with the Obama administration to allow him to visit campus. Since taking office, Obama has appeared on a college or high school campus one out of every 9 days.\nGiven these facts and others, its not surprising that today’s students are turning away from the ideals that made America great. In an op-ed by Charles M. Blow writing on “Who Loves America?” in the New York Times, only 15% of those between the ages of 18 and 29 believe the United States stands above all other countries.\nHowever, while leftist professors and liberal or apathetic students seem to dominate your school, there are steps you can and should take to stand strong for your values and beliefs.\nStrengthen Your Faith – Obama attacked the Christian faith by equating the evils of radical Islam with the Christian Crusades. Yet, the Crusades were a reaction to protect innocent Christians from being slaughtered by Jihad. You must learn how to be adequately defend your faith. Increasing your knowledge of the history of Christianity as a peaceful religion that protects the innocent decreases the effectiveness of the ignorant Left’s attacks.\nRead the Constitution – Obama and the Left would love for you to remain ignorant about your God-given rights under the United States Constitution, including your right to bear arms, right to free speech in your classroom and on your campus, right to express your faith in the public square, and many more. The Obama administration has already been caught spying on Americans, something you and your peers will not tolerate. By reading and knowing your rights backwards and forwards, you’ll know when those rights are violated.\nGet Involved – Ronald Reagan once said to a group of Young Americans for Freedom activists: “You are most important in this particular moment of history because so many of your peers have listened to false prophets and demagogues.“\nIf you want to change your campus, now is the time to get involved and Young America’s Foundation will provide you with the guidance, resources, and strategies to change the atmosphere on even the most liberal college campus.\nYou can begin by attending an upcoming YAF Freedom Conference in either Nashua, New Hampshire, on March 27 and 28 or in Milwaukee, Wisconsin, on April 10 and 11. At these programs you will come face-to-face with the Conservative Movement’s best tacticians and activists, as well as other young conservatives from across the country who will energize you.\nDon’t wait. If you don’t take action, your peers will become liberal by osmosis.","url":"https://www.breitbart.com/politics/2015/02/25/3-ways-a-young-conservative-can-survive-in-the-age-of-obama/"}
