{"authors":["Wills Robinson For Dailymail.Com"],"date_download":"2018-10-23 05:27:10","date_modify":"2018-10-23 05:27:10","date_publish":"2016-01-28 21:18:37","description":"The rise in cases has prompted health officials to take preventative steps to stop a further spread as scientists warned it has a 'explosive pandemic potential' - and could impact four million people.","filename":"data/vaneerConsumption/3ZikaviruscasesconfirmedinNewYorkCityasnumberacrossUSrisesto31.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/21/30A62A2D00000578-0-image-a-24_1454015786794.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421730_Three-cases-three-cases-Zika-virus-confirmed-New-York-City-number-diagnoses-country-reaches-31_1540272430.html","title":"3 Zika virus cases confirmed in New York City as number across US rises to 31","title_page":"3 Zika virus cases confirmed in New York City as number across US rises to 31 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"For more of the latest on the Zika virus visit www.dailymail.co.uk/zikavirus\nFears have grown for the Olympics this summer after an outbreak in Brazil\nThe risk is higher when mosquitoes are 'active' in the summer months\nScientists have warned of a 'pandemic' that could impact 4 million people\nPuerto Rico has 19 patients and the U.S. Virgin Islands has one\nThe 31 cases have been confirmed in 11 states and Washington D.C.\nback to the U.S. and started to suffer\nCases are thought to have been contracted in\nThree cases of the Zika virus have been confirmed in New York City as the number of diagnoses across the United States reaches 31.\nThe rise in cases have prompted health officials to take preventative steps to stop a further spread while\nAll of them are believed to have caught the infection, which is transferred by the Aedes mosquito, while traveling in the Caribbean or Latin America where there are outbreaks of the tropical illness.\nThe latest update came on the day the scientists warned it has an 'explosive pandemic potential', and could impact up to four million people.\nIt is worryingly thought to cause a brain defect where brains do not develop properly - prompting some countries to warn their residents not to get pregnant.\nThere are now fears the 2016 Rio Olympics could be affected because of a spike in cases, with some athletes being warned not to go.\nThe mosquito-borne Zika virus - thought to cause a birth defect where the brain does not develop properly - has infected 31 people across the United States, including three people in New York City, it has been revealed\nZika cannot be transmitted by casual person-to-person contact. While there is concern that Zika virus may be sexually transmitted, officials at the Centers for Disease Control (CDC) have said the evidence of sexual transmission is insufficient.\nOfficials said Thursday the 31 people are in 11 states and Washington. In U.S. territories, Puerto Rico has 19 confirmed cases and the U.S. Virgin Islands has one.\nThere are seven across New York state, however three are centered in the city.\nNew York City Health Commissioner Dr. Howard Zucker told ABC 7: 'Because Zika virus is primarily transmitted by infected mosquitos, there is very limited chance of local transmission in New York during the winter.\nZIKA VIRUS: WHAT IS IT AND HOW CAN IT BE PREVENTED? The Zika virus is transmitted by the Aedes aegypti mosquito (inset), which is also known to carry yellow fever. The terrifying virus has now started to spread across the Americas How it spreads: Zika virus is spread to people via mosquito bites. The most common symptoms of Zika virus disease are fever, rash, joint pain and conjunctivtis. Infected patients are typically ill for a few days to a week. While the illness is generally mild, some experts in Brazil have suggested a possible link between the virus in pregnant women and subsequent birth defects. The CDC said recently it is aware of reports of increased numbers of babies born with microcephaly, or smaller than expected head size, in Brazil. The Ministry of Health in Brazil is concerned about a possible association between the Zika virus and increased numbers of babies born with microcephaly. How to prevent it: There is no vaccine to prevent, or medicine to treat Zika virus. Travellers can protect themselves by taking steps to prevent mosquito bites, such as using a mosquito net and wearing insect repellent. Pregnant women are being warned to avoid travelling to 22 countries were outbreaks have been reported. Source: CDC\nNew York City Health Commissioner Dr. Howard Zucker (pictured in October) has said he will be taking preventative measures to stop the spread of the virus, adding that the risks are far higher when mosquitoes are more active in the summer\n'Even so, the Department of Health is taking steps now to protect the health of all New Yorkers and to prepare for the warmer months when mosquitos will be active in New York.\nThe government is looking at the issue of blood donations from travelers, although officials think the virus is gone from an infected person's blood in a week or less.\nThe World Health Organisation said the mosquito-borne disease had gone from a mild threat to one of alarming proportions and admitted up to four million people could be infected.\nThe agency will convene an emergency committee of disease experts on Monday.\nIt comes after US experts claimed WHO was not taking a leadership role in the Zika pandemic.\nThey said the organisation needed to learn lessons from its handling of the Ebola epidemic where the 'agency's failure to act decisively cost thousands of lives'.\nZika virus is common in parts of Africa and South East Asia, but since 2007 there have been various outbreaks outside of the disease's comfort zone. It spread to South America in 2014, before reaching Mexico and the Caribbean last year. The first US case was reported in Texas at the start of January\nThe Zika virus has been blamed for causing severe brain damage to newborn babies. Gleyse Kelly da Silva holds her daughter Maria Giovanna as she sleeps in their house in Recife, Pernambuco state, Brazil,\nZIKA, TRAVEL AND UNBORN CHILDREN: WHAT TO DO IF YOU ARE PREGNANT OR ARE CONSIDERING IT IS THERE A VACCINE TO PREVENT OR MEDICINE TO TREAT ZIKA? No. There is no vaccine to prevent infection or medicine to treat Zika. I AM PREGNANT. SHOULD I TRAVEL TO PLACES WHERE CASES OF ZIKA HAVE BEEN REPORTED? Until more is known, and out of an abundance of caution, CDC recommends special precautions for pregnant women and women trying to become pregnant: Pregnant women in any trimester should consider postponing travel to the areas where Zika virus transmission is ongoing. Pregnant women who do travel to one of these areas should talk to their doctor or other healthcare provider first and strictly follow steps to avoid mosquito bites during the trip. Women trying to become pregnant who are thinking about becoming pregnant should consult with their healthcare provider before traveling to these areas and strictly follow steps to prevent mosquito bites during the trip. Because specific areas where Zika virus transmission is ongoing are difficult to determine and likely to change over time, CDC will update this travel notice as information becomes available. Check the CDC travel website frequently for the most up-to-date recommendations. IS IT SFE TO USE INSECT REPELLENT IF I AM PREGANT OR NURSING Yes! Using an insect repellent is safe and effective. Pregnant women and women who are breastfeeding can and should choose an EPA-registered insect repellents and use it according to the product label. IF A WOMANM WHO IS NOT PREGNANT IS BITTEN BY A mMOSQUIOT AND INFECTED WITH ZIKA VIRUS, WILL HER FUTURE PREGNANCIES BE AT RISK? No. If infected Zika virus usually remains in the blood of an infected person for about a week. The virus will not cause infections in a baby that is conceived after the virus is cleared from the blood. SHOULD A PREGNANT WOMAN WHO TRAVELED TO AN AREA WITH ZIKA VIRUS BE TESTED FOR THE VIRUS? See your healthcare provider if you are pregnant and develop a fever, rash, joint pain, or red eyes within 2 weeks after traveling to a country where Zika virus cases have been reported. Be sure to tell your health care provider where you traveled. Source: CDC\nThe WHO says it has set up measures to fight the spread including surveillance, laboratories for testing, clinical care and vector control - killing off the mosquitoes spreading the infection.\nMarcos Espinal, an infectious disease expert at the WHO's Americas regional office, said: 'We can expect 3 to 4 million cases of Zika virus disease'. He gave no time frame.\nScientists had accused the agency of failing to take 'a leadership role in the Zika pandemic'.\nThey said this is particularly urgent given the forthcoming 2016 Olympics in Rio de Janeiro, the article in the Journal of the American Medical Association said.\nThe virus has recently rampaged through the Caribbean and Latin America.\nIn particular, there is an unprecedented outbreak in Brazil, where in the past 12 months there have been nearly 4,000 cases of babies being born with abnormally small heads.\nWHO Director-General Margaret Chan told WHO executive board members the level of alarm is 'extremely high'.\n'As of today, cases have been reported in 23 countries and territories in the (Americas) region,' she said at a meeting in Geneva.\nBrazilian President, Dilma Roussef, has urged Latin America to pull together to combat the virus.\nSharing knowledge about the disease is the only way it will be beaten, she told a summit in Ecuador.\nA meeting of regional health ministers has been called for next week.\nMeanwhile, pregnant women have already been officially warned to avoid travelling to South America.\nThe US and other world leaders have called for swift action in developing a vaccine for the virus but warned it could take up to a decade.\nRio de Janeiro Mayor Eduardo Paes says he doesn't believe the spreading Zika virus 'is a problem for the Olympics,' which open in six months in the picturesque South American city.\nHe notes that the games starting Aug. 5 will occur in the drier, cooler South American winter season when controlling the mosquito population 'will be much easier.'\nAlso speaking Thursday was International Olympic Committee President Thomas Bach, who said his organization is in 'close contact' with Brazilian authorities and the World Health Organization about Zika.\nBach said the IOC would send advice this week to all national Olympic committees, which can then tell athletes about safety guidelines.\nCanadian Blood Services will soon refuse blood donations from those who have travelled to countries where the mosquito-borne Zika virus has become widespread.\nAn army soldier and a health agent from Sao Paulo's Public health secretary talk with a woman as they check her residence during an operation against the Aedes aegypti mosquito, which is a vector for transmitting the Zika virus, in Sao Paulo, Brazil, Thursday, Jan. 28, 2016. Brazilian President Dilma Rousseff has called for a meeting of the Latin American and the Caribbean nations to discuss ways to join forces to eliminate the Aedes aegypti mosquito. (AP Photo/Andre Penner)\nChief medical and scientific officer Dr. Dana Devine says the blood collection agency will decide in the next few days which travel destinations would be linked to a temporary ban on donating blood.\nDevine says the risk of the Zika virus being transmitted through blood transfusion is low, but Canadian Blood Services doesn't want to take any chances.\nThe agency already prohibits Canadians who have travelled to countries where malaria is endemic from donating blood for a period of 12 months","url":"https://www.dailymail.co.uk/news/article-3421730/Three-cases-three-cases-Zika-virus-confirmed-New-York-City-number-diagnoses-country-reaches-31.html"}
