{"authors":[],"date_download":"2018-10-22 22:21:13","date_modify":"2018-10-22 22:21:13","date_publish":"2014-06-09 20:30:07","description":"Spanish archaeologists say they have unearthed a 4,000-year-old tomb littered with skeletons in the Egyptian city of Luxor.","filename":"data/vaneerConsumption/4000YearOldRoyalTombUnearthedinEgypt.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/497736/140609-tomb2_85afca4a980cb95adee82d62ce5dcd43.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_science-news_4-000-year-old-royal-tomb-unearthed-egypt-n126696_1540246873.html","title":"4,000-Year-Old Royal Tomb Unearthed in Egypt","title_page":"4,000-Year-Old Royal Tomb Unearthed in Egypt","title_rss":"NULL","source_domain":"nbcnews.com","text":"Galan said the tomb in the Dra Abu Naga necropolis dates back to the 11th Dynasty, roughly 2125 to 1991 B.C. During that time period, Upper and Lower Egypt were united under pharaonic rule from the ancient city of Thebes, which has given way to modern-day Luxor. Studying the tomb and its contents could provide fresh insights into the era.\nThe circumstances surrounding the remains found in the tomb are unclear. The AFP news service quoted an official from Egypt's antiquities ministry, Ali al-Asfar, as speculating that the tomb may have been used at some point as a mass grave or a cache for bodies. The archaeologists noted that the tomb contained pottery dating to Egypt's 17th Dynasty, about 400 years later, which suggests it was reused at that time.\nThe Djehuty Project has made previous finds in the same area, dating back to the 17th Dynasty as well as the 11th Dynasty. In 2008, Galan's team found an 11th-Dynasty tomb that contained a well-preserved red coffin and the mummy of a man named Iqer. Bows and arrows were placed nearby, suggesting that Iqer might have been a warrior.","url":"https://www.nbcnews.com/science/science-news/4-000-year-old-royal-tomb-unearthed-egypt-n126696"}
