{"authors":[],"date_download":"2018-10-22 22:51:52","date_modify":"2018-10-22 22:51:52","date_publish":"2014-05-12 08:09:01","description":"Parts of Wyoming got up to 3 feet of snow and Colorado saw a foot, while the Plains cleaned up from tornadoes and anticipated more thunderstorms.","filename":"data/vaneerConsumption/400MilesofWyomingHighwayShutDownAfterSpringSnowStorm.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_20/437101/140512-colorado-snow-jsw-312p_a2309a6e4361b26259b9d155ff332468.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_deadly-tornado-outbreak_400-miles-wyoming-highway-shut-down-after-spring-snow-storm-n102811_1540248712.html","title":"400 Miles of Wyoming Highway Shut Down After Spring Snow Storm","title_page":"400 Miles of Wyoming Highway Shut Down After Spring Snow Storm","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA May snowstorm closed hundreds of miles of a highway and snarled traffic in Wyoming and Colorado on Monday, while the Plains cleaned up from tornado damage and expected further frustrations from imminent thunderstorms.\nNearly 400 miles of Interstate-80 in Wyoming was closed for about 24 hours after the spring storm on Sunday dumped up to 3 feet of snow in parts of the state.\nA major east-west truck route, I-80 reopened in Wyoming on Monday a day after its closure stranded thousands of travelers and truckers. The interstate quickly became crowded with the trucks that had packed rest areas.\nThe slick roads and poor visibility were to blame for at least one fatal accident on U.S. Highway 285 southwest of Denver, according to The Associated Press. The slippery roadway became an accident-trap. Two law enforcement cruisers were hit within the same hour after responding to other accidents, the AP reported.\n\"May snow certainly isn't unheard of here in Colorado, even down in the Denver metro area,\" said David Barjenbruch, a Boulder-based weather service meteorologist. \"If we see the total accumulations that we are anticipating from this storm, we are certainly going to see a top 10 May snow event for the Denver metro area.\"\nTexas was dealing with another precipitation dilemma on Monday as thunderstorms brought heavy rains, prompting the National Weather Service to place most of the north of the state under a flash flood watch.\nThe rest of the southern Plains could also expect flash flooding, damaging winds, large hail and possible tornadoes through the evening hours, according to Weather.com.","url":"https://www.nbcnews.com/storyline/deadly-tornado-outbreak/400-miles-wyoming-highway-shut-down-after-spring-snow-storm-n102811"}
