{"authors":["Jessica Booth"],"date_download":"2018-10-31 01:39:42","date_modify":"2018-10-31 01:39:42","date_publish":"2018-08-31 13:00:53","description":"Well, it's finally happening: the unofficial end of the summer is just around the corner. Labor Day is only a few days away, and that means that the months reserved for lounging in the sun and spending time at the beach are about to be long gone.…","filename":"data/vaneerConsumption/40LaborDay2018DealsFreebiesThatWillHelpYouEnjoyTheEndOfSummer.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/30/07d5596b-a4af-41b5-9fac-fb8d6ca89fdc-getty-1025079218.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_40-labor-day-2018-deals-freebies-that-will-help-you-enjoy-the-end-of-summer-11457546_1540949982.html","title":"40 Labor Day 2018 Deals & Freebies That Will Help You Enjoy The End Of Summer","title_page":"40 Labor Day 2018 Deals & Freebies That Will Help You Enjoy The End Of Summer","title_rss":"NULL","source_domain":"bustle.com","text":"Well, it's finally happening: the unofficial end of the summer is just around the corner. Labor Day is only a few days away, and that means that the months reserved for lounging in the sun and spending time at the beach are about to be long gone. Summer might not officially end until the end of September, but for many, Labor Day marks the symbolic end of the season. Once that holiday passes, most people will head back to school or their normal work hours, and the lazy, hazy, hot days of summertime will be long gone. The only thing that makes that a little bit better is the fact that there are a ton of Labor Day deals and freebies you can take advantage of.\nEven if the weather is beautiful outside all weekend, you'll want to take advantage of the many Labor Day sales that are going on. You'll be able to save big on everything from housewares (like mattresses and kitchen supples) to tech gadgets (think TVs and tablets) to beauty items (if you need some new makeup, now's the time to stock up). There are sales that are ideal for students heading into dorm rooms, people looking to change up their fall style, or anyone who just feels like shopping.\nBelow are some of the best Labor Day deals and freebies out there. Apologize to your wallet for us later!\nBEAUTY PRODUCTS Giphy\n1 Fresh Sugar Shop at Fresh.com and get a Fresh Sugar Addict gift set free with any $100 purchase from the site between Aug. 24 and Sept. 3. Use the code LABORDAY at checkout to take advantage of the seven piece set, which includes deluxe samples of some of their bestselling products.\n2 Kat Von D Beauty There are lots of deals going on at Kat Von D Beauty. From Aug. 30 to Sept. 3, you'll get a Kat Von D Beauty travel set free with any purchase of at least $75, as well as limited time discounts on some of your favorite products (no code required). This includes sales on foundation, lip liner, and more.\n3 Kylie Cosmetics Beginning Sept. 1 at 12 p.m. PST and ending Sept. 3 at midnight PST, you can enjoy buy one get one Lip Kits on Kylie Cosmetics.\n4 KKW Beauty From Aug. 31 at 12 p.m. PST until Sept. 3 at 11:59 p.m. PST, get 25 percent off site-wide on KKWBeauty.com, no promo code needed.\n5 KKW Fragrances From Aug. 30 at 12 p.m. PST until Sept. 3 at 11:59 p.m. PST, get 25 percent off Crystal Gardenia, Crystal Gardenia Citrus, and KKW Body (excludes Kimoji Perfume), no promo code needed, on KKWFragrances.com.\n6 Jinsoon From now through Sept. 3, you can get 15 percent off your purchase on JINsoon.com with the code LABORDAY15.\n7 Dr. Brandt Head to Dr. Brandt's website to get 30 percent off the entire site with the code LABOR30 from now until Sept. 4.\n8 Bare Minerals From now through Sept. 3, you'll get $30 off every $100 spent, and $20 off $75 on BareMinerals.com.\n9 Boscia Head to Boscia.com to stock up on products and get 20 percent off your entire purchase with code WLABORDAY between Sept. 3 and Sept. 10.\n10 Sephora If you're a Beauty Insider, you'll be happy to know that Sephora is currently having its Beauty Insider Appreciation Event sale from now through Sept. 3. The deals depend on your level: 20 percent off for Rogue members, 15 percent off for VIBs, and 10 percent off for Insiders.\n11 Ulta Beauty Beginning Sept. 2, Ulta is having their 21 Days of Beauty sale, which features different deals on products every day.\n12 Spongelle From now until the start of fall, you can use the code 30OFF to get 30 percent off the End of Summer Sale at Spongelle.\n13 Dermstore The online beauty store Dermstore is having a huge Labor Day sale on its website that offers 20 percent off participating products from now through Sept. 6.\nCLOTHING AND ACCESSORIES Giphy\n1 Adornia Stock up on jewelry from Adornia.com with 20 percent off site-wide with the code LABOR.\n2 Headbands of Hope Get some hair accessories on HeadbandsOfHope.com using 30 percent off site-wide with code \"laborday.\" For each item sold, a headband is donated to a child with cancer. Plus, on Sept. 1, which is Headband Day, they will be giving free shipping with code \"headbandday\" through Sept. 7.\n3 Tobi On Sept. 3, for one day only, online shop Tobi is offering deals of up to 80 percent off.\n4 ASOS ASOS is letting shoppers take 20 percent off of all new-season clothing items for its Labor Day sale, with no coupon codes necessary.\n5 Adore Me Beginning Aug. 31, Adore Me is offering your first lingerie set under $20 and a free lingerie bag with a $60 purchase.\n6 Ban.do Starting now, you can get 25 percent off planners on Ban.do's site, plus an extra 15 percent off sale items.\n7 Draper James Head to Reese Witherspoon's Draper James site to get up to 75 percent off online from Sept. 2 to Sept. 4.\n8 Mod Cloth Start stocking up on sweaters on Mod Cloth, where Charter School sweaters will be 30 percent off when you purchase two, no code necessary, starting now.\n9 Old Navy Old Navy is taking 50 percent off all jeans, dresses, tees, sweatshirts, and hoodies, starting now and ending on Sept. 3.\n10 Macy's Go to Macy's site and take an extra 20 percent off all clothing, accessories, and more now through Sept. 3 with checkout code WKND. You can also get free shipping on orders of $49 or more.\n11 Kate Spade Kate Spade is offering 30 percent off everything for their Labor Day sale, including purses, shoes, and more.\n12 Banana Republic Get up to 40 percent off your entire purchase during Labor Day sales at Banana Republic.\nHOUSEWARES Giphy\n1 Doveware DoveWare is offering some sales on Amazon for Labor Day for their classic colors. The casserole dish from their DoveWare line will be $30 off from its $129 price — down to $99 for Labor Day. Their 4 quart dutch oven will also have the same discount!\n2 Nectar Sleep If you order from Nectar Sleep between now and Labor Day, you'll get $125 off a Nectar mattress plus two free Nectar pillows.\n3 DreamCloud Sleep If you order from DreamCloud Sleep between now and Labor Day, get $200 off a DreamCloud mattress.\n4 Mattress Firm Now through Sept. 3, Mattress Firm is offering their biggest sale. It includes: FREE adjustable base when you spend $599 or more on a mattress*\nAll beds on sale.\nTwin mattresses starting at $37.\nSerta Memory Foam Queen Mattress for just $397\nBeautyrest Firm Queen Mattress for just $497\nKing for a Queen/Queen for a Twin: Upgrade to a King-sized mattress for the price of a Queen, and a Queen-sized mattress for the price of a Twin – across all brands** Labor Day Doorbusters: Saturday (9/1) Doorbusters while supplies last: $99 Beautyrest Queen Mattress, $5 memory foam pillow, $10 mattress protector, $40 sheets\n5 Overstock.com Head to Overstock.com to get as much as 70 percent off their wide selection with free shipping.\n6 Wayfair Through Sept. 4, Wayfair is offering sales on home appliances, furniture, decor, and bedding items between 65 and 75 percent off. You will also receive free delivery on all items over $49.\n7 Target Target’s sales include everything from home appliances and furniture to some additional deals on clothing, electronics, and more, letting you save as much as 30 percent through Sept. 3.\n8 Crane and Canopy Crane and Canopy is offering up to 40 percent off bedding, duvet covers, pillows, and more from now through Sept. 3.\n9 Dormify Get 20 percent off your order on Dormify from Aug. 31 until Sept. 3 with the code SEEYASUMMER.\n10 Lulu and Georgia Get 15 percent off purchases of $300 or more, $20 off purchases of $600 or more, and $25 percent off purchases of $900 or more now through Sept. 4 with the code LONGWKND at Lulu and Georgia.\nTECH AND APPLIANCES Giphy\n1 Best Buy Best Buy is running a special home appliance sale that allows you to take up to 30 percent off of select appliances from name brands like Samsung, LG, and others. This Labor Day sale runs through Sept. 12 with free shipping.\n2 Home Depot Take as much as 40 percent off of home appliances from Home Depot through Sept. 12.\n3 Sears Sears is offering up to 40 percent off certain sales, or use promo code APPLIANCE10 to get an extra 10 percent off.\n4 Amazon Save up to $100 on Amazon Echo devices now through Sept. 3 on Amazon.","url":"https://www.bustle.com/p/40-labor-day-2018-deals-freebies-that-will-help-you-enjoy-the-end-of-summer-11457546"}
