{"authors":["Julie Peck"],"date_download":"2018-10-31 01:39:57","date_modify":"2018-10-31 01:39:57","date_publish":"2018-09-01 18:00:52","description":"Have you ever seen a product that was so genius, you wondered why you couldn't have invented it, whatever it was? Turns out, there are so many of these life-hack products on Amazon that will make you say \"Damn, that's genius,\" that it's enough to…","filename":"data/vaneerConsumption/43LifeHackProductsOnAmazonThatllMakeYouSayDamnThatsGenius.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/31/47595963-5d12-4f74-9257-79740928af85-6a0359a0-b662-4936-96d2-9f9c5ccf3cd1-can-colander.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_43-life-hack-products-on-amazon-thatll-make-you-say-damn-thats-genius-10436837_1540949997.html","title":"43 Life-Hack Products On Amazon That’ll Make You Say, “Damn, That’s Genius”","title_page":"43 Life-Hack Products On Amazon That’ll Make You Say, “Damn, That’s Genius”","title_rss":"NULL","source_domain":"bustle.com","text":"Have you ever seen a product that was so genius, you wondered why you couldn't have invented it, whatever it was? Turns out, there are so many of these life-hack products on Amazon that will make you say \"Damn, that's genius,\" that it's enough to make you want to quit your day job and just sit around all day and try to be brilliant.\nExcept, as we all know, sitting around and having periodic moments of brilliance doesn't pay. Or else our dogs would all be seriously wealthy.\nThe next best thing? Take a break while you're there at your day job — I won't tell — to peruse these awesome life-hack products and see what I mean. This list includes something for everyone, from the genius armband that keeps a water bottle's worth of fluids within easy hands-free access for drinking at all times to the perfect ice cream scoop that's probably also the last ice cream scoop you'll ever buy, you'll want to add pretty much every product to your shopping cart.\nOh, and don't worry: you can tell all your friends that you found these products yourself. Because you may not have invented them, but you might as well get credit for some of the brilliance.","url":"https://www.bustle.com/p/43-life-hack-products-on-amazon-thatll-make-you-say-damn-thats-genius-10436837"}
