{"authors":["Caroline May"],"date_download":"2018-10-30 18:19:59","date_modify":"2018-10-30 18:19:59","date_publish":"2016-06-16 16:34:41","description":"According to State Department data, since June 12, 441 Syrian refugees have been resettled in communities across the U.S. Just five of the recent arrivals are Christian the rest are Muslim, including 434 Sunni Muslims and one identified as simply “Moslem.” One is listed as having “no religion.” | Politics","filename":"data/vaneerConsumption/441SyrianRefugeesAdmittedtotheUSSincetheOrlandoAttackDozenstoFlorida.json","image_url":"https://media.breitbart.com/media/2016/06/wi/ap_ap-photo-586-e1465951277315.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_06_16__1540923599.html","title":"441 Syrian Refugees Admitted to the U.S. Since the Orlando Attack, Dozens to Florida","title_page":"441 Syrian Refugees Admitted to the U.S. Since the Orlando Attack, Dozens to Florida | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In the days since an Islamic radical murdered 49 people at an Orlando gay bar, the Obama Administration has admitted hundreds more Syrian refugees to the United States, including placing dozens in Florida.\nAccording to State Department data, since June 12, 441 Syrian refugees have been resettled in communities across the U.S. Just five of the recent arrivals are Christian the rest are Muslim, including 434 Sunni Muslims and one identified as simply “Moslem.” One is listed as having “no religion.”\nThe 441 new arrivals have been resettled across 26 states, with Illinois (60), Florida (49), and Arizona (38) taking in the most Syrian refugees over that four-day timeframe.\nOf the 49 new Syrian refugees resettled in Florida since the attack, 10 have been resettled in the greater Orlando area — with five resettled in Orlando proper and five resettled in Kissimmee. The rest of the refugees settled in Florida were placed in Clearwater (six), Delray Beach (five), Miami (five), Pensacola (five), Tampa (18).\nFlorida Gov. Rick Scott says he is opposed to resetting Syrian refugees in his state amid ongoing vetting concerns. Tuesday, following the attack, Scott expressed frustration that the administration is refusing to share information about the Syrians placed in his state.\n“The White House said they will not share that information with the Florida law enforcement. They said, oh, that — those people have privacy rights,” Scott said during an appearance on Fox News.\n“What about our security rights?” Scott continued. “The security and making sure if you live in my state, you’re gonna be safe. I’m responsible for the safety of the people in my state. I’m fed up with the fact that we’re not destroying ISIS. We’re not vetting these people; we’re not taking care of our own citizens.”\nThe Obama administration has dramatically increased its processing speed in order to meet the President’s goal of resettling at least 10,000 Syrian refugees in the U.S. this fiscal year.\nThe 1,523 Syrian refugees admitted so far this month have already exceeded last month’s record high of 1,069 Syrian refugee admissions. So far this fiscal year, the Obama Administration has admitted 4,328 Syrian refugees, 4,289 of whom are Muslims.\nThe administration has accelerated the pace of resettlement despite warnings from top security officials about potential vulnerabilities in vetting migrants from terror-hotspots like Syria and reports that ISIS operatives have infiltrated the refugee flows.\nIn written testimony prepared for a Thursday hearing of the Senate Intelligence Committee, CIA Director John Brennan again warned about the potential for ISIS operatives to manipulate the refugee system, as well as other immigration paths.\n“We judge that ISIL is training and attempting to deploy operatives for further attacks,” he wrote, referring to ISIS by it’s alternate acronym. “ISIL has a large cadre of Western fighters who could potentially serve as operatives for attacks in the West. And the group is probably exploring a variety of means for infiltrating operatives into the West, including refugee flows, smuggling routes, and legitimate methods of travel.”\nThe warning comes days after the U.S.-born son of Afghan migrants slaughtered 49 people and wounded 53 more at an Orlando nightclub while pledging his allegiance to ISIS. The attack is being described as the worst terrorist attack on U.S. soil since September 11, 2001.","url":"https://www.breitbart.com/politics/2016/06/16/441-syrian-refugees-admitted-u-s-since-orlando-attack-dozens-fl/"}
