{"authors":[],"date_download":"2018-10-30 21:28:05","date_modify":"2018-10-30 21:28:05","date_publish":"2018-08-17 16:31:00","description":"The work generated an economic impact of $9.5 billion, state officials say","filename":"data/vaneerConsumption/455movieandTVprojectsfilmedinGeorgiainfiscalyear2018.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/17/Videos/4463446.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_455-movie-and-projects-filmed-georgia-fiscal-year-2018__1540934885.html","title":"455 movie and TV projects filmed in Georgia in fiscal year 2018","title_page":"455 movie and TV projects filmed in Georgia in fiscal year 2018","title_rss":"NULL","source_domain":"ajc.com","text":"Georgia’s film industry ended the fiscal year with 455 movie and television projects completed, representing an economic impact of $9.5 billion, state officials said in a release.\n“Georgia is one of the world’s top destinations for film production and communities across the state are seeing the benefits of welcoming the industry,” outgoing Gov. Nathan Deal said in a statement. “I am proud to see our success continue, as the $9.5 billion in total economic impact reflects the sustainability of the film industry and the benefits of our competitive incentives program.”\nMarvel projects make up a sizable chunk of filming activity. Blockbuster “Black Panther” was released amid global hype earlier this year, followed by “Avengers: Infinity War” and “Ant-Man and the Wasp.” “Spider-Man: Homecoming” was released last year; up next is “Venom,” due out Oct. 5.\nMORE: Samuel L. Jackson surprised the audience at the Atlanta premiere of “Black Panther”\nHere’s where Marvel stars like to hang out in Atlanta\nThe state release heralded not only the productions shooting here but the infrastructure they’ve spurred.\n“In addition to the increase in production expenditures, Georgia has attracted major investments from studio and stage facilities,” it read. “Georgia is now home to more than 1.1 million square feet of purpose-built soundstage space and over 1.2 million square feet of retrofitted soundstage space, up from 40,000 square feet of purpose-built soundstages available before 2010.”\nMarvel has set up shop time and again at the Pinewood Studios facility. “Black Panther” was headquartered at EUE Screen Gems and did some filming at Tyler Perry Studios’ new home at the former Fort McPherson site.\nA number of major fall releases were filmed here, including “Night School,” a Will Packer comedy with Kevin Hart and Tiffany Haddish (Sept. 28); “First Man,” starring Ryan Gosling as astronaut Neil Armstrong; and “The Front Runner,” starring Hugh Jackman as Gary Hart (Nov. 21).\n“The House with a Clock in Its Walls,” starring young Atlanta actor Owen Vaccaro along with Jack Black and Cate Blanchett, is due out Sept. 21. The trailer is above.\nThe Motion Picture Association of America says the industry generated 92,100 jobs and nearly $4.6 billion in total wages in Georgia and that more than 300 new businesses have relocated or expanded here to support the industry.\n“We are very fortunate to have state leadership that understands the vital role that the entertainment industry plays in Georgia’s economic prosperity,” Georgia Department of Economic Development Commissioner Pat Wilson said in a statement. “The film industry creates jobs across almost every profession, in addition to camera, lighting and audio, film companies hire Georgians with skills in a myriad of support services including construction, catering, transportation, accounting and payroll and post-production.”\nAdded deputy commissioner Lee Thomas: “The amount of stage space and support businesses we have here now gives every production the confidence not only in Georgia’s ability to host them, but in our ability to accommodate larger tentpole franchises as well as television shows. With the unwavering support from our legislature, Georgia sends a powerful message to the film industry – attracting greater commitments that will continue this growth for years to come.”","url":"https://www.ajc.com/news/455-movie-and-projects-filmed-georgia-fiscal-year-2018/1kZaysvFARsanFgPYJ2OqM/"}
