{"authors":["Associated Press"],"date_download":"2018-10-22 23:08:31","date_modify":"2018-10-22 23:08:31","date_publish":"2017-03-10 01:59:09","description":"SANTA CLARA, California (AP) - A year after spending most of free agency on the sideline, the San Francisco 49ers had a busy start to the new league year as...","filename":"data/vaneerConsumption/49ersadd7freeagentson1stdayofleagueyear.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4299766_49ers-add-7-free-agents-1st-day-league-year_1540249711.html","title":"49ers add 7 free agents on 1st day of league year","title_page":"49ers add 7 free agents on 1st day of league year | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SANTA CLARA, California (AP) - A year after spending most of free agency on the sideline, the San Francisco 49ers had a busy start to the new league year as coach Kyle Shanahan and general manager John Lynch begin a massive rebuilding process.\nThe 49ers agreed to contracts with seven free agents on Thursday: quarterback Brian Hoyer (two years), receiver Pierre Garcon (five years), linebacker Malcolm Smith (five years), Pro Bowl fullback Kyle Juszczyk (four years), kicker Robbie Gould (two years), receiver Marquise Goodwin (two years) and blocking tight end Logan Paulsen (one year).\nSan Francisco is coming off a 2-14 season that matched the worst record in franchise history and cost coach Chip Kelly and general manager Trent Baalke their jobs. Despite a depleted roster last season, the Niners only signed guard Zane Beadles and backup quarterback Thad Lewis in free agency in Baalke's final season running the team.\nIt has been a far different strategy so far this year as the 49ers have started filling the approximately $100 million in salary cap room, highlighted by a quarterback and receiver who both have experience playing with Shanahan.\nHoyer made 13 starts for Cleveland in 2014 when Shanahan was offensive coordinator. Hoyer won seven of those starts and threw for a career-high 3,326 yards that season.\nHis presence gives the Niners an experienced quarterback as a possible bridge if they choose to draft one with either the second overall pick next month or one of their later selections. Hoyer will reportedly get $10 million guaranteed in the two-year deal.\nOne of his prime targets will be Garcon, who got a contract worth $47.5 million with $20 million guaranteed and $16 million paid in the first year. Garcon set career highs in 2013 in Washington when Shanahan was his offensive coordinator with 113 catches for 1,346 yards.\nGarcon is coming off his second career 1,000-yard season, having caught 79 passes for 1,041 yards in Washington with three TDs.\nFamiliarity is a recurring theme with the signings. Smith spent three years in Seattle with new Niners defensive coordinator Robert Saleh. Smith got a deal worth $26.5 million with $13 million guaranteed to move from Oakland to San Francisco.\nSmith memorably had the game-sealing interception in the 2013 NFC title game for the Seahawks against San Francisco. He went on to win the Super Bowl MVP that season, but struggled at times in his two seasons with the Raiders, especially in pass coverage.\nGoodwin, a 2012 Olympian in the long jump, had a career-high 29 catches for 431 yards and three touchdowns last season for the Bills. He has 49 catches for 780 yards and six scores in his career and would provide a deep threat to complement Garcon and leading returning receiver Jeremy Kerley, who had 64 catches last season operating mostly out of the slot.\nGould replaces free agent Phil Dawson. He spent his first 11 seasons with Chicago before playing last season for the New York Giants. He made all 10 field goal attempts in 2016 and 20 of 23 extra points.\nPaulsen should also help the running game as a blocking tight end who complements receiving threat Vance McDonald.\nJuszczyk, who got a $21 million deal that is the highest for a fullback according to NFL Network, caught 37 passes for Baltimore last season and is a strong blocker.\n___\nFor more NFL coverage: www.pro32.ap.org and http://twitter.com/AP_NFL","url":"https://www.dailymail.co.uk/wires/ap/article-4299766/49ers-add-7-free-agents-1st-day-league-year.html"}
