{"authors":["Unity Blott For Mailonline"],"date_download":"2018-10-23 05:56:07","date_modify":"2018-10-23 05:56:07","date_publish":"2016-01-11 18:46:05","description":"An anonymous 4Chan user posted a picture of what he claims is an explicit text exchange between his girlfriend and his father. He then shared the conversation that saw him confronting her.","filename":"data/vaneerConsumption/4ChanuserdiscovershisgirlfriendischeatingonhimwithhisFATHER.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/18/300DACD100000578-0-image-a-6_1452537814484.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3393631_Man-discovers-girlfriend-cheating-FATHER-reading-racy-text-messages-live-blogs-ordeal-4Chan_1540274167.html","title":"4Chan user discovers his girlfriend is cheating on him with his FATHER","title_page":"4Chan user discovers his girlfriend is cheating on him with his FATHER | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A man has aired his dirty laundry online after allegedly catching his girlfriend cheating on him with his own father.\nThe anonymous 4Chan user posted a picture of what he claims is a text exchange between the pair that he found on his dad's iPhone, before live-blogging his ordeal as it happened.\nThe messages contain explicit sex references and even a naked picture that the woman is believed to have sent after the pair slept together.\nScroll down for video\nThe offending article: The anonymous user found what he claims is a series of explicit texts between his girlfriend and his father. He shared them online, before going on to share the moment he confronted her\nIn his original 4Chan post, he wrote: 'Just found out my girlfriend has been having sex with my Dad. He left his phone at the house while he's at work.\n'All messages discussing how she's his \"dirty little secret\". Nudes and everything, what do I do? I'm broken.' He then shared a series of screen shots of the messages.\nOne, purportedly from the user's father, read: 'Alright gorgeous?' followed by a winking emoji face.\nWhen his girlfriend replied, 'We shouldn't really be talking,' he came back with: 'I no babe, I just can't stop thinkin about u or last nite xxxx' before encouraging her to send him a nude pic of her getting changed, which she did.\nThe cuckolded 4Chan user followed this up 45 minutes later by explaining: 'Been on the phone to my mum explaining the situation. Had to upload the photos to my comp. Sorry for bad quality.'\nAs the 4Chan community chimed in with questionable advice and begged for more details, the man promised to keep them updated as he confronted his girlfriend via social media.\nAfter 4Chan users begged for more information, the anonymous 'broken' man kept them updated with snippets of the conversation as he confronted his 'cheating' girlfriend via Facebook Messenger\n'Please answer me': After being confronted over her infidelity, the man's girlfriend attempted to explain herself\nAnd true to his word, he shortly followed up with images of the conversation between him and his girlfriend on Facebook Messenger.\nWhat followed was a painstaking exchange between him and his girlfriend, as he confronted her over her alleged infidelity.\nAt first she denied any knowledge of what he was accusing her of, but when he revealed he had seen her explicit texts, she replied: 'Im so sorry you know me. You know its not anything.\n'It was an accident and he pressured me lots. I love you to much please answer me. Talk to me bout it we can get past it.'\nShe insisted: 'Your dad is very forward and it didnt mean anything i swear. Anyway i just thought maybe he'd like me more and he was sorta joking with me and it seemed like we could all be ok with it maybe.\n'It was only once': The anonymous 4Chan user laid bare the details of his devastating fallout with his girlfriend via a painstaking conversation on Facebook Messenger which he posted online, and was seen by thousands\n'I know it's your dad but we both know hes not like normal dads. I'd rather call you. Can you answer me please'.\nWhen pressed to say whether or not she'd done the deed, she confessed: 'It was only once I was waiting for you to get back with **** remember and then your dad just sat next to me and we spoke a bit and stuff and i dont kknow :(\n'He kissed me and it was just quite casual i would have told you about it obviously. Your dad isn't like a normal dad. It wasn't for long or anything.\n'I get you will be angry but you cant be to angry you know what its like. We could have just spoken bout it and been casual. Im sorry I know it is bad now what can I do? Im really sorry for everything. You're so important to me its you not him.'\nWhen her devastated boyfriend pushed for details she continued to avoid the question, pleading: 'Do we have to talk bout details it wont make it better I just want to get past it i dont have to ever speak to him again.'\nThe man's girlfriend attempted to justify her actions, but was met with disdain by her 'cuckolded' partner\nShe then appeared to deny any responsibility for what had happened, saying: 'Im sorry it was only once. He mainly touched me and i just let him like whatever. Ask him why he did it not me. He made me basically. But im sorry what can i do??'\nShe then finally admitted sleeping with him, saying: 'Once but not really. Not long and not like us or anything. It sounds worst than it is. answer me please. I can explain better in person. A phone call will be better. Please Im sorry.'\nThe man's original 4Chan post was then shared by an anonymous Imgur user in a post entitled 'Anon literally gets cucked (meaning cuckolded) by his own dad', bringing the unfolding drama to an ever wider audience where it has now been seen by almost one million people.\nIt had people engrossed, with one Imgur user confessing, 'I wanted to stop but I couldn't. I just couldn't get off the bus,' while another said, 'I even delayed driving home from work so that I could finish reading in my car first... Holy s***...'","url":"https://www.dailymail.co.uk/femail/article-3393631/Man-discovers-girlfriend-cheating-FATHER-reading-racy-text-messages-live-blogs-ordeal-4Chan.html"}
