{"authors":["Charlie Nash"],"date_download":"2018-10-30 18:30:18","date_modify":"2018-10-30 18:30:18","date_publish":"2017-03-10 23:11:01","description":"Internet sleuths tracked down the site of Shia LaBeouf's anti-Trump \"He Will Not Divide Us\" stream and replaced his flag with a MAGA hat.","filename":"data/vaneerConsumption/4chanFindsDesecratesFlagpoleonShiaLaBeoufsHeWillNotDivideUsStream.json","image_url":"https://media.breitbart.com/media/2017/03/shia-labeouf.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2017_03_10__1540924218.html","title":"4chan Finds, Desecrates Flagpole on Shia LaBeouf's 'He Will Not Divide Us' Stream","title_page":"4chan Finds, Desecrates Flagpole on Shia LaBeouf's 'He Will Not Divide Us' Stream","title_rss":"NULL","source_domain":"breitbart.com","text":"Internet sleuths tracked down Shia LaBeouf’s anti-Trump “He Will Not Divide Us” protest exhibit on Thursday and disrupted it for the third time, replacing the white flag featured on the online live stream with a pro-Trump t-shirt and MAGA hat.\nThe third location for “He Will Not Divide Us” was not disclosed by LaBeouf following disruptive incidents at previous exhibitions. However, by analyzing flight contrails and even celestial navigation, users from 4chan managed to pinpoint the new location in under two days.\nPage Six reports 4chan users “started studying planes flying over the flag, and took note of flight times” in order to determine where it may be. They also “studied the sun and star patterns behind the flag,” as well as taking note of a picture of LaBeouf in a Tennessee diner to narrow down the area where the flag was hidden. A 4chan user in the suspected area drove around honking the horn of his car so that it could be heard on the video stream, allowing others to triangulate where the flag could be based on the driver’s location.\nThe flag was found in the middle of the night and taken down.\nShortly after the flag’s replacement, the property owner noticed the swap, pulled down the Trump gear, and turned off the stream.\nTHEY FOUND THE FLAG, REPLACED IT WITH A MAGA SHIRT AND HAT, AND NOW THE STREAM IS OFFLINE!#hewillnotdivideus #hwndu pic.twitter.com/rDiD1VC4fv — Manly-Chicken (@Manly_Chicken) March 10, 2017\nEarly on Friday, a 4chan user posted a picture of the alleged stolen flag.\nInternet trolls have interrupted all of LaBeouf’s previous exhibitions, which started off at the Museum of the Moving Image in New York City.\nAs the official site explains, “On February 10, 2017, the Museum of the Moving Image abandoned the project,” following several incidents that showed LaBeouf attacking Trump supporters and trolls at the location.\n“On February 18, 2017, the project the project relocated to a wall outside the El Rey Theater, Albuquerque,” states the site. However, this was also shut down following gunshots at the location.\nOn March 8, 2017, the project moved to the — until now — secret location. The stream is back up at this point, but it currently shows just an empty flag pole.\nCharlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.","url":"https://www.breitbart.com/tech/2017/03/10/4chan-tracks-down-shia-labeouf-secret-latest-he-will-not-divide-us-location/"}
