{"authors":[],"date_download":"2018-10-22 20:54:22","date_modify":"2018-10-22 20:54:22","date_publish":"2014-05-04 23:04:41","description":"At least 28 people have been shot in Chicago, four of them fatally, since Friday afternoon, police said.","filename":"data/vaneerConsumption/4Dead24WoundedinWeekendChicagoViolence.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_18/419486/140504-chicago-violence-jms-1939_319ded6a8af2a992129bf8f60b69e19f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_4-dead-24-wounded-weekend-chicago-violence-n96851_1540241662.html","title":"4 Dead, 24 Wounded in Weekend Chicago Violence","title_page":"4 Dead, 24 Wounded in Weekend Chicago Violence ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Around 7:15 a.m. Sunday, a man was shot in the 900 block of East 81st Street. Police said a 29-year-old man suffered a fatal gunshot wound to head and was pronounced dead at the scene.\nAbout three hours earlier, a 23-year-old man was fatally shot in the 400 block of North Leclaire Avenue, police said.\nThe man was arguing with another man on the sidewalk when the man produced a gun and fired at the victim, striking him multiple times in the abdomen and arm.\nHe was taken to Mount Sinai Hospital where he was later pronounced, police said.\nAround the same time, four people were shot in the city’s River North neighborhood. The victims were on the street in the 500 block of West Erie when people in a dark-colored sedan drove by flashing gang signs and opened fire, police said.\nA 20-year-old man suffered a fatal wound to the head and was pronounced dead at the scene, according to authorities.\nA 21-year-old man was shot in the left torso and left arm, a 20-year-old man was shot in the right foot, and a 19-year-old man was shot in the left shoulder. All three were taken to area hospitals in stable condition.\nAlso Sunday, a 25-year-old man was shot in the 3900 block of West Ohio Street.\nThe man told police he was standing on the sidewalk just before 2 a.m. when he heard shots and felt pain.\nHe suffered wounds to his right hand and buttocks and was transported to an area hospital in stable condition.\nEarlier, a 17-year-old man was walking on the sidewalk near 87th Street and Greenwood Avenue when he heard shots and felt pain.\nThe teen was shot in the chest and abdomen and taken in critical condition to Advocate Christ Medical Center.\nAt least 11 people were shot Saturday afternoon and evening.\nThree men were shot around 9:25 p.m. in the 7900 block of South Merrill Avenue. The trio told police they were walking along Merrill when two men dressed in dark clothing approached them and opened fire. A 17-year-old man was shot in the left foot and was taken to South Shore Hospital in stable condition. Another 17-year-old man suffered a graze wound to the head and a 21-year-old man was shot in the right arm. Both were taken to John H. Stroger, Jr. Hospital of Cook County where the teen was in stable condition and the 21-year-old man was treated and released.\nAbout an hour earlier a 17-year-old man was shot in the buttocks while walking in the 5200 block of South Ashland Avenue in the Back of the Yards neighborhood, police said. The teen was taken to Stroger Hospital in stable condition.\nJust before 7 p.m., a 23-year-old man was shot in the leg in the 8700 block of South Escanaba Avenue. The man was standing on the block when someone fired shots from an SUV, striking the victim, police said. He was taken to Northwestern Memorial Hospital in stable condition.\nAround 3:40 p.m., a 38-year-old man was shot in the face in the 72—block of South Vincennes Avenue, police said. The man was a passenger in the front seat of a vehicle driving northbound on Vincennes when a bullet pierced through the windshield and struck him, according to authorities. The man was driven to the 6900 block of South Harvard for safety where he was then transported by ambulance to Advocate Christ Medical Center in good condition.\nJust after 2 p.m., a 21-year-old man was shot while standing on a sidewalk in the 8200 block of South Kedzie Avenue. The man told police he was approached by an armed offender who fired several shots him, striking his right leg. The victim was taken to Advocate Christ Medical Center in stable condition. Police said the shooting may have been gang-related.\nTwenty minutes earlier, a 16-year-old boy was shot in the left arm and both legs by unknown man in the 2200 block of South Christiana Avenue. He was taken to Mount Sinai Hospital in serious condition, police said.\nAround 12:40 p.m., two men were shot in the 2000 block of West 79th Street. The two men were standing in an alley when three offenders approached on foot and opened fire. A 31-year-old man suffered multiple gunshot wounds and was listed in critical condition at Advocate Christ Medical Center. A 25-year-old man was shot several times in the arm and leg and was listed in serious condition at the same hospital.\nAround 11 a.m., a 20-year-old man was shot in an apparent drive-by shooting in the 5500 block of South Hoyne Avenue. The man was standing on the sidewalk when someone drove by in a dark-colored car and fired at him. The man was not cooperating with investigators following the shooting and was taken to Holy Cross Hospital in good condition.\nAt least six others have been shot since Friday afternoon.","url":"https://www.nbcnews.com/news/us-news/4-dead-24-wounded-weekend-chicago-violence-n96851"}
