{"authors":[],"date_download":"2018-10-22 21:50:52","date_modify":"2018-10-22 21:50:52","date_publish":"2014-06-06 18:11:06","description":"About half of Americans believe humans evolved over millions of years, with most saying that God guided the process, according to a new poll","filename":"data/vaneerConsumption/4in10AmericansBelieveGodCreatedEarth10000YearsAgo.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2018_24/492976/140606-creation-jsw-237p_23ae725d70deb759fc88e04c67ae2107.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_science-news_4-10-americans-believe-god-created-earth-10-000-years-n124701_1540245052.html","title":"4 in 10 Americans Believe God Created Earth 10,000 Years Ago","title_page":"4 in 10 Americans Believe God Created Earth 10,000 Years Ago","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFour in 10 Americans believe God created the Earth and anatomically modern humans, less than 10,000 years ago, according to a new Gallup poll.\nAbout half of Americans believe humans evolved over millions of years, with most of those people saying that God guided the process. Religious, less educated, and older respondents were likelier to espouse a young Earth creationist view — that life was created some 6,000 to 10,000 years ago — according to the poll.\nThough the percentage of people who believe in creationism has changed little over the decades, the percentage of people who believe humans evolved without God has more than doubled, and the percentage who believe in God-guided evolution has decreased. [Creationism vs. Evolution: 6 Big Battles]\nSupernatural Beliefs\nAmericans consistently report high levels of belief in the supernatural. About 80 percent of Americans believe in miracles and three-quarters believe in the virgin birth of Jesus, according to a 2013 Pew survey.\nAt the same time, while most Americans have a healthy respect for science, many could use a refresher course in the basics. For instance, a 2014 National Science Foundation study found that only three out of four Americans know that the Earth revolves around the sun and not vice versa, and a large percentage didn't know the Earth's core was hot. Large percentages didn't know that the father's sperm determines a baby's sex.\nEvolving Views?\nAs part of the Values and Beliefs Survey, Gallup called a random sample of 1,028 landline and cellphone users and asked them which of three descriptions most closely matched their beliefs: that humans have developed over millions of years from less advanced forms of life, but God guided this process; that humans have developed over millions of years from less advanced forms of life, but God had no part in this process; or that God created human beings pretty much in their present form sometime in the last 10,000 years or so. Gallup has asked people similar questions since 1982.\nAbout 42 percent espoused the creationist view presented, whereas 31 percent said God guided the evolutionary process, and just 19 said they believe evolution operated without God involved.\nReligion was positively tied to creationism beliefs, with more than two-thirds of those who attend weekly religious services espousing a belief in a young Earth, compared with just 23 percent of those who never go to church saying the same.\nJust over a quarter of those with a college degree hold creationist beliefs, compared with 57 percent of people with such views who had at most a high-school education, the poll found.\nKnowledge key\nMost of the people who believed in evolution also said they were knowledgeable about the theory, whereas those who said they were not too familiar with the theory also were less likely to believe in it.\nAmericans' belief in creationism is at odds with scientific consensus. Almost all scientists who study human origins believe that we evolved from other life-forms over millions of years. In fact, humans, or individuals in the genus Homo, are said to have emerged on Earth some 2.5 million years ago.\n-- Tia Ghose, Live Science\nFollow Tia Ghose on Twitter and Google+. Follow Live Science on Twitter, Facebook & Google+. Original article on Live Science.\nCopyright 2014 LiveScience, a TechMediaNetwork company. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","url":"https://www.nbcnews.com/science/science-news/4-10-americans-believe-god-created-earth-10-000-years-n124701"}
