{"authors":["Anya Kamenetz"],"date_download":"2018-10-23 01:00:19","date_modify":"2018-10-23 01:00:19","date_publish":"2016-10-28 00:00:00","description":"Hillary Clinton has just proposed a $500 million initiative to help states combat bullying. Here are some things you should know.","filename":"data/vaneerConsumption/4MythsAboutSchoolBullyingAndTheTrumpEffect.json","image_url":"https://media.npr.org/assets/img/2016/10/27/bullying_wide-d47c31883ad936aef44e913e0e392873b2f5b30e.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_ed_2016_10_28_499635141_4-myths-about-school-bullying-and-the-trump-effect_1540256419.html","title":"4 Myths About School Bullying And The 'Trump Effect'","title_page":"4 Myths About School Bullying And The 'Trump Effect' : NPR Ed : NPR","title_rss":"NULL","source_domain":"npr.org","text":"4 Myths About School Bullying And The 'Trump Effect'\nEnlarge this image LA Johnson/NPR LA Johnson/NPR\nOn Thursday, Hillary Clinton packaged a major new school policy proposal as an attack on her rival, Donald Trump.\n\"Donald Trump has made no apologies to the growing list of people that he has attempted to bully since the launch of his hate-filled campaign,\" read the press release from the Clinton campaign about a new $500 million initiative called \"Better than Bullying.\"\nIn order to get the money, states would have to pass comprehensive anti-bullying laws and form plans to use school-based interventions like social and emotional learning curricula, or hiring more school counselors.\nUnder the proposal, the federal government would help pay for those programs by contributing $4 for every $1 put up by states.\nThe emotional resonance is clear. But how good is the evidence for calling bullying an \"urgent crisis,\" as the Democratic nominee's campaign did? Never mind blaming a presidential candidate for a day-to-day increase in bullying?\nHere's some fact-checking:\nBullying is not especially prevalent.\nIn 2013, according to the latest, nationally representative federal statistics, 1 in 5 teenagers reported being bullied at school. That's actually down from 27 percent in 2011. Physical bullying, like being pushed, shoved, tripped or spit on, happened to just 6 percent of teens in the most recent survey, and only a tiny fraction of those said that they were seriously injured.\nThe most common experiences reported were students being \"made fun of, called names, or insulted\" (13 percent), and being the \"subject of rumors\" (also 13 percent).\nThe survey did not ask how many times these things happened, so it's hard to say how much they define the school experience of the students in question.\nAnd there's little proof it's growing because of Trump.\nOn the trail, in a debate and in campaign literature, including the announcement this week, Clinton cited an April 2016 publication by the Southern Poverty Law Center. In the survey, titled \"The Trump Effect,\" teachers reported incidents of ethnically and racially motivated bullying by students connected with Donald Trump's campaign rhetoric.\nNPR Ed was among those covering the report. But, as we noted at the time, it is basically anecdotal and not nationally representative; the teachers who answered had previously been in contact with the law center, and thus were more likely to be concerned about racial issues in the first place.\nBullies aren't solely to blame for what we call bullying.\n\"I'm not pleased with the word bullying,\" says Jonathan Cohen, who works on ways of improving how students and educators treat each other. He is the co-founder and president of the National School Climate Center.\n\"More often than not,\" he says, a student who comes to school and picks fights is struggling with severe adversity at home and may be in need of intervention and support as much as his or her victims. Cohen says this could be an issue with how some anti-bullying laws are written, if the in-school behavior of struggling students becomes criminalized.\nHis research also focuses on the responsibility of bystanders, including educators who may look the other way when a student is repeatedly victimized.\nBullying doesn't just happen at school.\nCyberbullying is an extremely hot topic, but still a fairly rare experience. In that same 2013 report, 7 percent of students said they had been targeted online with unwanted messages or invasions of privacy.\nClinton's proposed initiative includes funding to make the Internet \"a safer space,\" but in practice, schools have limited resources to intervene when students are targeting each other on their own time, and educators may be hamstrung by concerns about privacy or surveillance.","url":"https://www.npr.org/sections/ed/2016/10/28/499635141/4-myths-about-school-bullying-and-the-trump-effect"}
