{"authors":[],"date_download":"2018-10-30 20:20:02","date_modify":"2018-10-30 20:20:02","date_publish":"2015-09-18 10:30:51","description":"Fairburn police have identified the four people arrested in a fatal shooting that investigators believe happened during a drug deal outside a fast food restaurant.","filename":"data/vaneerConsumption/4peoplearrestedinfatalshootingoutsideFairburnHardees.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/09/18/Images/photos.medleyphoto.8167919.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_people-arre_27d1b288c5df82404cbf79791db50376__1540930802.html","title":"4 people arrested in fatal shooting outside Fairburn Hardee’s","title_page":"4 people arrested in fatal shooting outside Fairburn Hardee’s","title_rss":"NULL","source_domain":"ajc.com","text":"Fairburn police have identified the four people arrested in a fatal shooting that investigators believe happened during a drug deal outside a fast food restaurant.\nThe shooting happened late Thursday in the parking lot of the Hardee’s on Senoia Road.\n“We do have information that the victim and the suspects were involved in some kind of transaction, possibly involving marijuana,” Fairburn police Sgt. Anthony Bazydlo told Channel 2 Action News said. “Something went south; we’re still trying to figure out what happened.”\nThe restaurant was closed when the shooting happened, but Bazydlo said there was a witness “that observed the entire incident.”\nAccording to Channel 2, police said the shooting victim, 22-year-old Clayton Smith from Meriwether County, was the person allegedly selling the drugs. One of the suspects was injured by gunfire, but police did not name him.\nThe following suspects were charged with murder and armed robbery in the case:\nQuintavius Hawkins, 20\nMountavius Holt, 20\nRontavius Holt, 18\nLabrinzo Matthews, 21\nHawkins also was charged with aggravated assault and possession of a firearm during the commission of a felony, police said.\nAll four suspects were being booked in the Fulton County jail on Friday.","url":"https://www.ajc.com/news/crime--law/people-arrested-fatal-shooting-outside-fairburn-hardee/2PgpYEADmtfSAmS03UpesM/"}
