{"authors":[],"date_download":"2018-10-30 18:03:51","date_modify":"2018-10-30 18:03:51","date_publish":"2018-09-07 19:22:00","description":"Find out more about the history and attractions of Southern Museum of Civil War & Locomotive History.","filename":"data/vaneerConsumption/4reasonstolearnCivilWarhistoryatthisKennesawmuseum.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/09/07/Videos/4478470.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_attractions_r_b287ab80ba15e0d888bb4cf7754537a7__1540922631.html","title":"4 reasons to learn Civil War history at this Kennesaw museum","title_page":"Southern Museum of Civil War and Locomotive History: Hours, History","title_rss":"NULL","source_domain":"ajc.com","text":"If you take a trip to visit the Southern Museum of Civil War and Locomotive History, you might learn that the American Civil War was the first time that railroads played a significant role in a military conflict.\n»RELATED: Train tourism: Five of the South's top railroad museums and excursions\nThe Southern Museum of Civil War and Locomotive History in downtown Kennesaw first opened in 1972 as the Kennesaw Civil War Museum. Over time, it expanded to included attractions like the Glover Machine Works and more in-depth information about railroads and their role in the Civil War. As a Smithsonian Affiliate, the museum also gets to host traveling Smithsonian exhibits so that visitors have reasons to come back again and again.\nHere are four things you can do at the Southern Museum of Civil War & Locomotive History:\nSee the General Locomotive and the Great Locomotive Chase exhibit – In 1862, a group of Union Civil War spies led by James J. Andrews stole the General locomotive from the area now known as Kennesaw. \"Andrews Raiders\" led The Great Locomotive Chase for 87 miles before they were captured by Confederate forces. Inside the museum, you can follow Confederate Conductor William Fuller's steps as he pursued the Raiders and see the Medals of Honor that were granted to two of the Union spies who managed to escape. Even more, you can see the General itself.\nBring the kids to the Jolley Education Center – Children and their parents can dive into the 19th century by visiting the museum's Jolley Education Center. Inside, there are educational stations for children of all ages. From puzzles and games to telegraph stations and diesel train simulators, this area is a must-see for younger visitors. The Jolley Education Center is open during normal museum hours, but you might want to call ahead in case there is a private event.\nThe General Emporium gift shop is open during normal Museum hours and is free to enter. (SouthernMuseum.org)\nGrab a souvenir at General Emporium Gift Shop – According to the website, the General Emporium Gift Shop is \"created and stocked for children and adults alike.\" You can stop in to buy all things Civil War including maps, books, replicas, and other items. If you're into local foods, there is a selection of jams, jellies and sauces you can purchase in addition to custom-made gift basket. The gift shop is open during normal museum hours and is free to enter.\nTake advantage of Smithsonian Magazine's Museum Day – Smithsonian magazine's 14th Annual Museum Day is coming up on Saturday, Sept. 22. Just download tickets and you and a guest can go to the museum free of charge. This year, the museum chose the theme, \"Women Making History\" to honor women who have made waves in the arts, sciences, innovation and culture. Museum Day visitors can read biographies of women who made an impact during the Civil War period and watch Smithsonian Channel films that highlight women who have made history in other ways.\nCost\nGeneral admission costs $7.50 for adults, $6.50 for senior citizens and $5.50 for children ages 4 to 12. Children age 3 and under can enter the museum for free.\nDiscounts are available for members of AAA or the military.\nWhen to go\nThe museum is open daily for visitors. The hours are 9:30 a.m. to 5 p.m.Monday to Saturday; 11 a.m. to 6 p.m. Sunday. The museum is closed for New Year's Day, Easter, Thanksgiving, Christmas Eve and Christmas day.\nParking\nThere are three different parking areas you can use when visiting. One is located right in front of the museum on Cherokee Street, there is one at the historic Kennesaw train depot across from the museum, and one behind the museum off Shirley Dr. Handicap parking can be found in the first lot.\nHow to get there\nThe Southern Museum of Civil War and Locomotive History is located at 2829 Cherokee Street in Kennesaw.\nIf you're coming from I-75 North or South, take exit 273 to Wade Green Road and then turn toward the west. Wade Green Road turns into Cherokee Street. When you reach Shirley Drive, turn right and follow it to the museum's rear parking area.\nFrom I-575 North or South, take exit 3 to Chastain Road and head west. Chastain Road will turn into McCollum Parkway. Follow it past the airport and then turn right when you hit South Main Street (also called Old Highway 41). Turn right on Sardis Street and then left on Big Shanty Road. Once you reach the intersection before the museum, cross over Cherokee Street onto Shirley Drive and follow it to the museum's rear parking area.\nIf you're taking US 41, turn east on Watts Drive then make a right on J.O. Stephenson Avenue. Cross the railroad tracks onto Cherokee Street, then pass the museum and turn left onto Shirley Drive. Follow the road to the museum's rear parking area.","url":"https://www.ajc.com/entertainment/attractions/reasons-learn-civil-war-history-this-kennesaw-museum/6X6QbMxeTyh3YRMCHi03nK/"}
