{"authors":["Associated Press"],"date_download":"2018-10-22 23:07:43","date_modify":"2018-10-22 23:07:43","date_publish":"2017-03-16 05:49:15","description":"NEW DELHI (AP) - Four suspected militants from a banned Islamist group were killed during a police raid on a building in southeastern Bangladesh, police said...","filename":"data/vaneerConsumption/4suspectedmilitantskilledinBangladeshraid.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/09/wire-227589-1489657770-751_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318928_4-suspected-militants-killed-Bangladesh-raid_1540249663.html","title":"4 suspected militants killed in Bangladesh raid","title_page":"4 suspected militants killed in Bangladesh raid | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NEW DELHI (AP) - Four suspected militants from a banned Islamist group were killed during a police raid on a building in southeastern Bangladesh, police said Thursday.\nSenior police official Shafiqul Islam said police have completed the overnight operation after cordoning off the building where the suspects stayed in Sitakunda in Chittagong district.\nHe said one suspect possibly belonging to Jumatul Mujahedeen Bangladesh was killed by police fire and three others died when they exploded bombs or grenades inside an apartment during the raid. Local media said one of the dead was a woman.\nA Bangladeshi policeman evacuates a family after cordoning off the area where suspected militants were holding up, in Sitakunda in Chittagong district of Bangladesh, Thursday, March 16, 2017. Several suspected militants from a banned Islamist group were killed during a police raid on a building in southeastern Bangladesh, police said Thursday. (AP Photo)\nIslam said two security officials were injured in a gunfight.\nBomb experts were examining the building because explosives were found inside the apartment, which was rented by the suspects, the official said. Twenty other tenants were rescued after officials cordoned off the two-story building on Wednesday afternoon.\nBangladesh has experienced a surge in attacks by suspected militants in recent years, with atheist bloggers and writers, foreigners, members of minority groups among the targets. In July, 20 hostages, including 17 foreigners, were killed in a restaurant in the nation's capital, Dhaka.\nThe Islamic State group claimed responsibility for that attack but the government of Prime Minister Sheikh Hasina rejected that, saying Jumatul Mujahedeen Bangladesh was responsible. The government insists the Islamic State group has no presence in the Muslim-majority country.\nIn a separate development, a suspect from another banned militant group was killed in what police described as a gunfight in the eastern district of Brahmanbaria early Thursday.","url":"https://www.dailymail.co.uk/wires/ap/article-4318928/4-suspected-militants-killed-Bangladesh-raid.html"}
