{"authors":["Associated Press"],"date_download":"2018-10-22 23:15:32","date_modify":"2018-10-22 23:15:32","date_publish":"2016-01-11 05:05:21","description":"NEW YORK (AP) — Four teenagers were taken into police custody in connection with an alleged group rape of an 18-year-old woman at a Brooklyn playground, an i...","filename":"data/vaneerConsumption/4teensincustodyinallegedgrouprapeatNYCplayground.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3392563_Police-say-5-men-raped-woman-inside-New-York-City-park_1540250132.html","title":"4 teens in custody in alleged group rape at NYC playground","title_page":"4 teens in custody in alleged group rape at NYC playground | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"4 teens in custody in alleged group rape at NYC playground\nNEW YORK (AP) — Four teenagers were taken into police custody in connection with an alleged group rape of an 18-year-old woman at a Brooklyn playground, an incident that the mayor called a \"horrific attack.\"\nPolice said Sunday two teenagers surrendered and two were apprehended. Charges were pending against a 14-year-old, 17-year-old and two 15-year-olds. A fifth suspect is still being sought.\nAuthorities said the woman was accosted just after 9 p.m. Thursday as she and her father walked inside Osborn Playground in the Brownsville section of Brooklyn.\nPolice said there were five suspects, and one pointed a gun at the father and told him to leave. Each man raped the woman, police said. The father returned with two police officers, but the attackers fled.\nThe woman was treated at Kings County Hospital and released.\n\"I am disgusted and deeply saddened by the horrific attack,\" New York City Mayor Bill de Blasio said in a statement released Sunday.\nHe added, \"Every New Yorker in every neighborhood deserves to feel safe and protected, and we will not stop until the perpetrators of this disturbing attack are held accountable for their actions.\"\nElected officials, residents and activists spoke out against the alleged assault on Sunday, offering a reward for information leading to an arrest.\nBrooklyn Borough President Eric Adams released a statement saying he was \"sickened\" by reports of the attack and called on the New York Police Department to conduct a full investigation \"not only to identify all those responsible for this horrific attack, but also to determine if everything possible was done to protect the victim and the public.\"\nAn NYPD police spokesman said there was no delay in the police response.\n\"A patrol car from the 73rd Precinct was approached on the street and told about the attack by the victim's father, who directed the officers to the scene,\" police spokesman Stephen Davis said.\n\"The police officers immediately responded and located the victim,\" Davis said. \"The suspects had already fled.\"\nAdams on Sunday also questioned why the police waited until Saturday night, 48 hours later, to alert the public of the crime when it released surveillance video they said showed the men in a bodega before the alleged incident.\nDavis said the commanding officer of the precinct began contacting local community leaders about the alleged rape on Friday.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3392563/Police-say-5-men-raped-woman-inside-New-York-City-park.html"}
