{"authors":[],"date_download":"2018-10-30 20:23:54","date_modify":"2018-10-30 20:23:54","date_publish":"2015-11-25 15:27:28","description":"A $5,000 reward has been offered to help Forsyth County authorities find the person or persons who killed a dog found hanging from a tree near Lake Lanier over the weekend.","filename":"data/vaneerConsumption/5000rewardindeathofdogfoundhanginginForsythCounty.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/11/25/Videos/4631845893001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_000-reward-_74e6b73e96b31ec4303019e2332b09ed__1540931034.html","title":"$5,000 reward in death of dog found hanging in Forsyth County","title_page":"$5,000 reward in death of dog found hanging in Forsyth County","title_rss":"NULL","source_domain":"ajc.com","text":"A $5,000 reward has been offered to help Forsyth County authorities find the person or persons who killed a dog found hanging from a tree near Lake Lanier over the weekend.\nThe reward, which is being offered by the Atlanta security firm Norred & Associates and the Atlanta Humane Society for information leading to the arrests and conviction of those responsible, was announced on Wednesday.\nThe female boxer mix was discovered about 11:30 a.m. Saturday by a man walking along a trail at Bethel Park on Swiss Air Road, according to a Forsyth County Sheriff’s Office incident report obtained by The Atlanta Journal-Constitution.\nOne end of a yellow and blue rope was tied to the branch of a fallen tree with the other end clipped around the dog’s neck, according to the report. Forsyth sheriff’s Cpl. Robin Regan said the fallen branch was still high enough to leave the animal hanging.\n“The owner of the dog was located after our animal control deputy observed a social media post about a missing dog while trying to locate its owner,” Regan said.\nIn a Facebook post, Steven Blackstone, the 2-year-old dog’s owner, wrote: “There are some screwed up people with a screwed up mind to do what they did to her. It’s just unreal.”\nRegan said a necropsy would likely be done to determine the cause of death.","url":"https://www.ajc.com/news/crime--law/000-reward-death-dog-found-hanging-forsyth-county/YTkWpYhv9Sx8JTXko0tCMO/"}
