{"authors":[],"date_download":"2018-10-22 21:56:49","date_modify":"2018-10-22 21:56:49","date_publish":"2014-05-08 18:28:40","description":"Nigerians attacked by Boko Haram criticized security forces for failing to protect them despite warnings the militants were nearby.","filename":"data/vaneerConsumption/50BodiesFoundAfterBokoHaramMarketAttack.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/429976/140508-nigeria_protest-women-pmc-1453_848b605f667c614e1a7f7aa95b222d9c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_50-bodies-found-after-boko-haram-market-attack-n100586_1540245409.html","title":"50 Bodies Found After Boko Haram Market Attack","title_page":"50 Bodies Found After Boko Haram Market Attack ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBAUCHI, Nigeria -- Residents of a Nigerian town attacked by Boko Haram criticized security forces for failing to protect them despite warnings that the Islamic militants were nearby. At least 50 bodies have been recovered, many horribly burned, in the town.\nThe attack on Gamboru, in remote northeastern Nigeria near the border with Cameroon, is part of the Islamic militants' relentless campaign of terror at a time when world attention is focused on the 276 teenage girls who are missing after being kidnapped from their boarding school by the extremists. The students are believed to be held by Boko Haram in the vast Sambisa Forest in northeastern Nigeria.\nThe death toll from the Monday afternoon attack in Gamboru was initially reported by a senator to be as many as 300, but a security official said it is more likely to be around 100. Some Gamboru residents said bodies were recovered from the debris of burned shops around the town's main market, which was the focus of the attack.\nThe bodies were found after the market reopened on Wednesday as health workers, volunteers and traders searched for missing people, said Gamboru resident Abuwar Masta. He said most of the bodies were burned beyond recognition. Some of the victims were traders from Chad and Cameroon, he said.\n\"It seems they hid in the shops in order not (to) be killed while fleeing,\" Masta said Wednesday. \"Unfortunately, several explosives were thrown into the market.\"\nMasta and other traders said that some villagers had warned the security forces of an impending attack after insurgents were seen camping in the bush near Gamboru.\nThe kidnapping of the schoolgirls on April 15 in the town of Chibok have sparked accusations that the Nigerian government is not doing enough to stop the militants. Boko Haram has killed more than 1,500 people so far this year as part of their campaing to impose Islamic law on Africa's most populous nation, which has 170 million people equally divided between Christian and Muslim.\nThe Associated Press","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/50-bodies-found-after-boko-haram-market-attack-n100586"}
