{"authors":["Kipp Jones"],"date_download":"2018-10-30 21:00:44","date_modify":"2018-10-30 21:00:44","date_publish":"2015-07-11 19:35:41","description":"Rapper 50 Cent, whose legal name is Curtis Jackson, is about to dole out a lot more than 50 cents after a court found him guilty of releasing video of a sexual encounter featuring a woman without her consent.","filename":"data/vaneerConsumption/50CentOrderedtoPay5MoverSexTape.json","image_url":"https://media.breitbart.com/media/2015/07/50-cent-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_07_11__1540933244.html","title":"50 Cent Ordered to Pay $5M over Sex Tape","title_page":"50 Cent Ordered to Pay $5M over Sex Tape","title_rss":"NULL","source_domain":"breitbart.com","text":"Rapper 50 Cent, whose legal name is Curtis Jackson, is about to dole out a lot more than 50 cents after a court found him guilty of releasing video of a sexual encounter featuring a woman without her consent.\nPage Six reports during a feud with rival hip hopper Rick Ross in 2009, Jackson obtained a sex tape featuring Ross’s ex—Lastonia Leviston—with her then-boyfriend Maurice Murray and later profited from the video after posting it on his website thisis50.com.\nMurray reportedly sold the tape to Jackson after the relationship between he and Leviston ended.\n“Maurice broke her heart and 50 Cent ruined her life,” Leviston’s lawyer, Philip Freidin, said in his closing statement Thursday, according to Page Six.\nDuring the published video, which was narrated by 50 Cent, the rapper reportedly described Leviston as a “slut” and a “mother—ing porn star.”\nAfter deliberating for just over an hour Friday, a jury of four women and two men found Jackson violated Leviston’s privacy rights and ordered the star to pay her 2.5 million for violating her privacy and $2.5 million for emotional distress.\nIn addition to shelling out $5 million, the rapper might have to appear in court in a week to turn over his state and federal tax returns for the past five years.\nThe release of the video almost drove Leviston, who has two children with Rick Ross, to suicide, according to the report.","url":"https://www.breitbart.com/entertainment/2015/07/11/rapper-50-cent-ordered-to-pay-5m-for-releasing-sex-tape-of-woman/"}
