{"authors":["Rebecca Martinson"],"date_download":"2018-10-31 01:39:33","date_modify":"2018-10-31 01:39:33","date_publish":"2018-08-31 00:00:52","description":"What does it take for a product to be considered mind-blowing? Does it need to have a super-low price so that you're saving money, or should it be something clever that helps solve life's little annoyances? Regardless of what your qualifications…","filename":"data/vaneerConsumption/50ProductsOnAmazonThatAreSoCleverTheyreBlowingPeoplesMinds.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/30/e889ac15-55f5-4873-b3ce-3dffd98e2a42-whisk.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_50-products-on-amazon-that-are-so-clever-theyre-blowing-peoples-minds-10462295_1540949973.html","title":"50 Products On Amazon That Are So Clever, They're Blowing People's Minds","title_page":"50 Products On Amazon That Are So Clever, They're Blowing People's Minds","title_rss":"NULL","source_domain":"bustle.com","text":"What does it take for a product to be considered mind-blowing? Does it need to have a super-low price so that you're saving money, or should it be something clever that helps solve life's little annoyances? Regardless of what your qualifications are, one thing holds true: there are tons of genius products on Amazon that are blowing people's minds, if you know where to look. There's something there for everyone — there's plenty of brilliant ideas that you've always dreamed of, and some you've never even thought of before.\nCase in point? There's a bath mat in here with silicone bristles on the top so your feet get a massage while you shower. It's completely genius. And don't get me started on the power block that has four USB ports on it so you can charge four devices at once — because whoever invented that is a total genius. I'm sure they're now raking in stacks of cash, because he's chock-full of ideas for clever Amazon products, and I'm happy to reap the benefits by purchasing them all.\nAnd don't feel discouraged if you haven't come up with clever inventions — because we can all be winners when it comes to snapping up the latest and greatest mind-blowing products on Amazon.","url":"https://www.bustle.com/p/50-products-on-amazon-that-are-so-clever-theyre-blowing-peoples-minds-10462295"}
