{"authors":["Associated Press"],"date_download":"2018-10-23 03:33:32","date_modify":"2018-10-23 03:33:32","date_publish":"2016-01-29 18:33:47","description":"BOSTON (AP) — More than 50 members of the MS-13 gang in and around Boston have been indicted on federal racketeering charges, federal authorities announced F...","filename":"data/vaneerConsumption/56membersofMS13gangarechargedinMassachusetts.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423173_56-members-MS-13-gang-charged-Massachusetts_1540265612.html","title":"56 members of MS-13 gang are charged in Massachusetts","title_page":"56 members of MS-13 gang are charged in Massachusetts | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"56 members of MS-13 gang are charged in Massachusetts\nBOSTON (AP) — More than 50 members of the MS-13 gang in and around Boston have been indicted on federal racketeering charges, federal authorities announced Friday.\nThe notoriously violent gang, also known as La Mara Salvatrucha, is known for using machetes to kill and injure rival gang members. In 2012, MS-13 became the first and remains the only street gang to be designated by the U.S. government as a \"transnational criminal organization,\" according to the indictment.\nIn all, 56 gang members were indicted on racketeering conspiracy charges, including charges related to murder, conspiracy to commit murder and attempted murder. Some are also charged with drug trafficking, firearm violations, immigration offenses and fraudulent document charges.\nThe gang has more than 30,000 members internationally — mainly in El Salvador, Mexico, Honduras and Guatemala — and over 6,000 members in the U.S., the indictment says.\nAuthorities said 37 of the 56 suspects were in custody Friday morning, some taken in during early morning raids in Boston, Chelsea, Everett, Lynn, Revere and Somerville.\nThe indictment alleges that several of those charged are responsible for the murders of at least five people since 2014 and the attempted murder of at least 14 people. It also alleges that MS-13 members in Massachusetts commit robberies and sell cocaine, heroin and marijuana to pay monthly dues to leaders of MS-13 who are imprisoned in El Salvador.\nProsecutors allege that members of MS-13 recruited prospective members — typically 14 or 15 years old — inside local high schools from communities with significant immigrant populations from Central America.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3423173/56-members-MS-13-gang-charged-Massachusetts.html"}
