{"authors":["Chris Tomlinson"],"date_download":"2018-10-30 18:35:54","date_modify":"2018-10-30 18:35:54","date_publish":"2018-06-20 14:55:20","description":"A 56-year-old Swiss people smuggler has married her failed asylum seeker boyfriend in an \"Islamic ceremony\" in hopes he can remain in Europe.","filename":"data/vaneerConsumption/56YearOldPeopleSmugglerMarriesHerYoungerMigrantBoyfriend.json","image_url":"https://media.breitbart.com/media/2018/06/Swiss-Sugar-Mama.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_06_20__1540924554.html","title":"56-Year-Old People Smuggler Marries Her Younger Migrant Boyfriend","title_page":"56-Year-Old People Smuggler Marries Her Younger Migrant Boyfriend","title_rss":"NULL","source_domain":"breitbart.com","text":"A 56-year-old Swiss woman who was arrested and convicted of trying to smuggle her failed asylum seeker lover into Switzerland has now married him in an “Islamic ceremony” in hopes he can remain in Europe.\nBarbara Schwager married 27-year-old Pakistani migrant Nadeem Akram in Italy where the couple currently lives following Schwager’s conviction for attempting to illegally smuggle him into Switzerland last year, Blick reports.\nThe couple has been living in Italy due to Schwager allegedly not being able to afford the fine handed down following her conviction and risks several days in prison if she returns to Switzerland.\nSchwager told Swiss press that her wedding was “not exactly romantic”, and added: “An imam from Pakistan married us – on the phone. But we are overjoyed.”\nBarbara Schwager (57) sagt Ja zu ihrem Nadeem (27): «Schlepperin» heiratet mit Kopftuch https://t.co/vpXvQOmSq3 pic.twitter.com/16JaBrCR34 — Blick (@Blickch) June 18, 2018\nThe 56-year-old spoke of her new husband saying: “He has been granted a six-month residence permit in Italy and may now even work. As soon as I get my savings in Switzerland, I can officially register for residence in Italy. I already have a tax number. Then nothing stands in the way of a recognised marriage.”\nThe trend of older single women forming sexual relationships with young migrants has been noted in neighbouring Austria where so-called “sugar mamas” are said to entice young migrants with cash and gifts in return for sexual favours.\nThe migrants targetted by the women sometimes complain that despite the gifts, the women ask too much of them. “She wants sex with me four times a day, I am a sex machine for her, nothing more,” one asylum seeker named Hasan said.\nSoros Aligned NGO Under Investigation for Sexually Abusing Migrants in Greece https://t.co/pR0jiQMrcc — Breitbart London (@BreitbartLondon) June 2, 2017\n“Sex Tourism” and sexual abuse of young migrants has also been a problem among volunteers with pro-migrant organisations. In Calais, in the former “Jungle” migrant camp, several female activists were accused of sexually abusing migrants, some of them children.\nLast year, the U.S. charity Mercy Corps was also investigated by the Greek government which accused activists working with migrants in Greece of sexually abusing them.","url":"https://www.breitbart.com/europe/2018/06/20/56-year-old-swiss-people-smuggler-marries-27-year-old-migrant-boyfriend/"}
