{"authors":["Sadie Trombetta"],"date_download":"2018-10-31 01:45:37","date_modify":"2018-10-31 01:45:37","date_publish":"2018-09-06 16:00:52","description":"From A Day Without a Woman in March to the teachers strikes that took place in multiple states throughout the spring to the nationwide prisoner strike that is happening right now, 2018 has been a busy year for labor movements large and small. Of…","filename":"data/vaneerConsumption/5BooksAboutFamousStrikesThatDemonstrateTheHistoricalImportanceOfCivilDisobedience.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/0058626e-d215-403a-a97c-7a6e2df55f21-pjimage-9.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_5-books-about-famous-strikes-that-demonstrate-the-historical-importance-of-civil-disobedience-11477469_1540950337.html","title":"5 Books About Famous Strikes That Demonstrate The Historical Importance Of Civil Disobedience","title_page":"5 Books About Famous Strikes That Demonstrate The Historical Importance Of Civil Disobedience","title_rss":"NULL","source_domain":"bustle.com","text":"From A Day Without a Woman in March to the teachers strikes that took place in multiple states throughout the spring to the nationwide prisoner strike that is happening right now, 2018 has been a busy year for labor movements large and small. Of course, these demonstrations are just the latest in a long history of worker protests in the United States that you can read all about in these books about famous strikes. No matter what the haters (or the president, for that matter) say, civil disobedience is not only an important American tradition, but a method that often garners serious results.\nIn addition to the political news and Washington D.C. drama that has been dominating the news cycle, headlines about unions and labor strikes have made their fair share of appearances this year. Although it may seem like it’s been an unusually energetic period for the workers’ rights, the nation’s laborers have long been fighting for better wages and fairer conditions. From the Lowell Mill Girls strike of the 1830s and the Eight-Hour Day strikes in 1886 to the Memphis Sanitation strike in 1968, there have been dozens of important protests over the last 200 years that paved the way for the workers demonstrating and striking today.\nIf you want to better understand the labor movements of the present, brush up on the most important ones of the past in these five books about famous strikes in American history.\n'Three Strikes: Miners, Musicians, Salesgirls, and the Fighting Spirit of Labor's Last Century' by Howard Zinn, Dana Frank, and Robin D.G. Kelley In this engaging book about twentieth century workers' rights movements, historians Howard Zinn, Dana Frank, and Robin D.G. Kelley explore three of the countries most famous strikes in the United States: the Ludlow Massacre, the counter girls sit-in at Detroit Woolworth's, and the movie theater musicians' strike in New York. Fascinating as it is informative, Three Strikes illuminates not only these important demonstrations, but the lasting spirit of America's labor movements that can still be felt today. Click here to buy.\n'Going Down Jericho Road: The Memphis Strike, Martin Luther King's Last Campaign' by Michael K. Honey It's impossible to truly understand Martin Luther King Jr.'s fight for civil rights without understanding his role in the labor movement of the 1960s, which author Michael K. Honey explores in this essential book about the famous activist's battle for economic justice. A thorough history of the Poor People's Campaign of 1968, Going Down Jericho Road brings to life the characters who clashed in Memphis over workers' rights to fair, safe, and livable conditions, and the strike that changed everything for the city's working poor. Click here to buy.\n'It Started in Wisconsin: Dispatches from the Front Lines of the New Labor Protest' edited by Mari Jo Buhle and Paul Buhle Many Americans think of labor movements as a thing of the past, but this collection of first-hand accounts of the largest pro-labor mass mobilization in modern U.S. history prove the fight for workers' rights is still alive and well today. Featuring essays, comics, photos, and eyewitness reports by striking teachers, students, and activists, It Started in Wisconsin is a testament to perseverance of the country's labor movements. Click here to buy.\n'There is Power in a Union: The Epic Story of Labor in America' by Philip Dray In this incisive history of workers' rights movements in America, author Philip Dray examines the battle between labor and capital that has been waging since the nineteenth century and still continues today. A captivating narrative about organized labor's role in shaping the country's social, political, economic, and cultural identity, There Is Power in a Union thoughtfully and thoroughly demonstrates just that. Click here to buy.","url":"https://www.bustle.com/p/5-books-about-famous-strikes-that-demonstrate-the-historical-importance-of-civil-disobedience-11477469"}
