{"authors":["Press Association"],"date_download":"2018-10-23 02:39:13","date_modify":"2018-10-23 02:39:13","date_publish":"2017-04-26 13:49:41","description":"Zafar Ansari shocked the cricket world on Wednesday by announcing his retirement at the age of 25.","filename":"data/vaneerConsumption/5cricketerswhohavewalkedawayfromthesport.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/13/wire-465235-1493210984-590_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4447664_5-cricketers-walked-away-sport_1540262353.html","title":"5 cricketers who have walked away from the sport","title_page":"5 cricketers who have walked away from the sport | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Surrey and England all-rounder Zafar Ansari shocked the cricket world on Wednesday by announcing his retirement at the age of 25.\nAnsari called time on his emerging career, which included four international appearances, to focus on a future in business.\nThis is not the first instance where a cricketer has quit the game to pursue other interests and, here, Press Association Sport looks at others who have taken the same route as Ansari.\nPRESTON MOMMSEN\nPreston Mommsen (Danny Lawson/PA)\nThe Scotland skipper, aged 29, brought the curtain down on a career that saw him win 66 international caps in November 2016. Mommsen led the Scots to the 2015 World Cup and World T20 the following year, where they beat Hong Kong to claim a first win at a major global tournament, but quit the game to pursue an “attractive opportunity in the corporate world.”\nJOE SAYERS\nJoe Sayers (Nigel French/PA)\nA determined opening batsman, Sayers faced several difficult challenges during a career which saw him score over 5,000 first-class runs for home county Yorkshire. He was diagnosed with Post Viral Fatigue Syndrome in 2010, an illness that often forced him to go to bed at 3pm, and quit cricket four years later at the age of 30 to take up a job in the financial world.\nALEX LOUDON\nAlex Loudon (Nigel French/Empics)\nAll-rounder Loudon rejected the offer of a new deal at Warwickshire, where he spent three years, in order to concentrate on a business career in 2007. He was aged 27 and had just made his England one-day international debut the previous summer.\nBARNEY GIBSON\nBarney Gibson played for Yorkshire (Richard Sellers/PA)\nWicketkeeper Gibson entered the history books when, aged 15 years and 27 days, he became the youngest cricketer to play a first-class match in England. However, just four years after his Yorkshire debut, he retired to pursue other career opportunities.\nJOHN MOONEY\nJohn Mooney in full flow for Ireland (Liam McBurney/PA)\nMooney played 64 ODIs and 27 Twenty20 internationals for Ireland, helping stun England at the 2011 World Cup, before ending his career in December 2015, aged 33, to take on a business opportunity.","url":"https://www.dailymail.co.uk/wires/pa/article-4447664/5-cricketers-walked-away-sport.html"}
