{"authors":["Lauren Holter"],"date_download":"2018-10-31 01:41:57","date_modify":"2018-10-31 01:41:57","date_publish":"2018-09-14 18:25:54","description":"Members of Donald Trump's cabinet have been embroiled in financial scandals since he took office. While the current administration is believed to be the wealthiest in history, Trump officials have made extravagant purchases for their offices and…","filename":"data/vaneerConsumption/5ExpensiveFurniturePiecesTrumpOfficialsHaveInTheirOfficesHomes.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/31e665b7-1429-4147-a634-188e4f8b390c-getty-1009181310.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_5-expensive-furniture-pieces-trump-officials-have-in-their-offices-homes-11917600_1540950117.html","title":"5 Expensive Furniture Pieces Trump Officials Have In Their Offices & Homes","title_page":"5 Expensive Furniture Pieces Trump Officials Have In Their Offices & Homes","title_rss":"NULL","source_domain":"bustle.com","text":"Members of Donald Trump's cabinet have been embroiled in financial scandals since he took office. While the current administration is believed to be the wealthiest in history, Trump officials have made extravagant purchases for their offices and residences using taxpayer money. That's not to mention the millions of dollars spent on private jets, but that's a topic for another day.\nThe Financial Services and General Government Appropriations Act of 2017 states that the head of any department or agency can only spend up to $5,000 to furnish, redecorate, or make improvements to their office, unless they notify Congress beforehand. Multiple members of Trump's cabinet have been accused of breaking this rule, and one was even called out by the Government Accountability Office for overspending.\nThe policy for officials' private residencies is a bit murkier since the only federal officials with taxpayer-funded apartments are the ambassador to the United Nations and her top aide. But voters not only pay the $58,000-per-month rent for Nikki Haley's New York digs, according to a listing, they've also covered some pricey decorations.\nNaturally, money spent redecorating can't go toward government programs designed to help Americans struggling to make ends meet. And Trump's proposed 2019 budget that would slash funds for Medicare, the Supplemental Nutrition Assistance Program, and scientific research doesn't address his cabinet's spending.\nSome Snazzy Shades Kena Betancur/Getty Images News/Getty Images The official residence of the ambassador to the United Nations got a major facelift last year when the State Department installed new curtains that cost a whopping $52,700, The New York Times reported this week. Nikki Haley currently lives in the First Avenue apartment with the expensive curtains, though a spokesman for the ambassador told The Times that plans to buy the curtains were made during the Obama administration. The Times also updated their story to more clearly reflect that it was not Haley's decision to buy the curtains. They were reportedly installed last August. The curtains alone rang up at $29,900, while the additional $22,800 went toward motors that open the curtains. “All she’s got is a part-time maid, and the ability to open and close the curtains quickly is important,” Patrick Kennedy, the top management official at the State Department during the Obama administration, told The Times. He added that the curtains would likely last through a few administrations.\nA Dining Set Fit For A King Shannon Finney/Getty Images Entertainment/Getty Images The Department of Housing and Urban Development (HUD) almost bought a $31,000 dining room set for Ben Carson’s office last year, The New York Times reported in February. The set reportedly included a custom hardwood table, chairs, and a hutch. Aside from being a rather pricey addition to his office, the purchase was criticized in part because it coincided with a White House plan to cut programs for the poor. Carson blamed the purchase on his wife at the time, testifying before the House Appropriations Committee that he left the decision up to her. “The next thing that I, quite frankly, heard about it was that this $31,000 table had been bought,” he said in the congressional hearing. “I said, ‘What the heck is that all about?’ I investigated, I immediately had it canceled. Not that we don’t need the furniture, but I thought that that was excessive.”\n\"Lounge Furniture\" That Breaks The Bank Win McNamee/Getty Images News/Getty Images On top of the $31,000 dining set, Carson's also office commissioned a furniture company for $165,000 worth of “lounge furniture” for the HUD headquarters, The Guardian reported. A whistleblower within HUD filed a complaint with the Office of Special Counsel claiming she was demoted after she refused to break the $5,000 spending limit given to agency heads to redecorate. She resigned after the purchases were made, according to Architectural Digest.\nSoundproofing A Closet For Important Phone Calls Chip Somodevilla/Getty Images News/Getty Images Former Environmental Protection Agency (EPA) Administrator Scott Pruitt had a $43,000 soundproof phone booth installed in his office before resigning three months later. The Washington Post reported in April that the purchase may have violated federal spending laws. The customized phone booth alone only cost $25,000, but the department also paid $18,000 to get it set up in a small closet area. The Government Accountability Office claimed in a letter to Congress that this illegally exceeded the $5,000 decoration cap, while the EPA argued that the phone booth shouldn't be subject to the spending limit. Pruitt's short tenure was full of spending scandals, including tens of thousands of dollars spent on private jets and other travel expenses. He told lawmakers the booth was \"necessary for me to be able to do my job.\"","url":"https://www.bustle.com/p/5-expensive-furniture-pieces-trump-officials-have-in-their-offices-homes-11917600"}
