{"authors":[],"date_download":"2018-10-22 20:46:09","date_modify":"2018-10-22 20:46:09","date_publish":"2014-05-03 22:05:35","description":"Start your week with an infusion of good cheer including a silly squirrel selfie, a remarkable reunion and a prom to remember.","filename":"data/vaneerConsumption/5FeelGoodStoriesOneSquirrellySelfie.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_18/416856/squirrel_1c559eaba48118243e8df70610fb9234.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/nightly-news_5-feel-good-stories-one-squirrelly-selfie-n96436_1540241169.html","title":"5 Feel Good Stories: One Squirrelly Selfie","title_page":"5 Feel Good Stories: One Squirrelly Selfie","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nStart your week with an infusion of good cheer including a silly squirrel selfie, a remarkable reunion and a prom to remember.\nSay No to Selfies\nThis squirrel selfie went from cute to crazy in seconds. It seems that at least one squirrel has a distinct aversion to social media antics.\nThe Prom Couple to Rule All Prom Couples\nThe Prom Couple to Rule All Prom Couples Meet quite possibly the world’s best grandson. This Ohio teen took his grandmother as his date to prom because she never had an opportunity to go when she was in high school. Don’t worry. He brought her home by curfew.\nThis Little Piggy Got a Second Chance\nIt’s a piglet in a wheelchair. What else do you need to know? OK, the animal was geared to become someone’s dinner until a freak accident put it on another course.\n‘You Are Beautiful’\nA 13-year-old girl is hoping to inspire random acts of kindness with her Sidewalk Smiles campaign.\nVietnam Vets Reunite After 40 Years\nIt took more than 40 years, but using social media a Vietnam veteran is able to track down members of his platoon.","url":"https://www.nbcnews.com/nightly-news/5-feel-good-stories-one-squirrelly-selfie-n96436"}
