{"authors":[],"date_download":"2018-10-30 20:39:33","date_modify":"2018-10-30 20:39:33","date_publish":"2015-04-22 20:28:03","description":"Five Georgia Southern University students were killed Wednesday in a crash near Savannah, according to a letter from the college’s president.","filename":"data/vaneerConsumption/5GeorgiaSouthernnursingstudentskilled2injuredincrash.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/WSBTV/2015/04/23/Images/photos.medleyphoto.7154797.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_georgia-south_5fde06a3ed59f67f34e0b6a0427d1939__1540931973.html","title":"5 Georgia Southern nursing students killed, 2 injured in crash","title_page":"5 Georgia Southern nursing students killed, 2 injured in crash","title_rss":"NULL","source_domain":"ajc.com","text":"Five Georgia Southern University students were killed Wednesday in a crash near Savannah, according to a letter from the college’s president.\nThe letter from President Brooks Keel, posted on Georgia Southern’s website, said the five students were killed in an early morning crash on I-16 eastbound. Two more students were injured.\nThe victims were identified as Emily Clark, a junior from Powder Springs, Morgan Bass, a junior from Leesburg, Abbie Deloach, a junior from Savannah, Catherine (McKay) Pittman, a junior from Alpharetta, and Caitlyn Bagget, a junior from Millen.\nBrittney McDaniel of Reidsville and Megan Richards of Loganville were injured in the crash. All seven girls were students in the nursing school.\nMore trending stories\nPolice say a tractor trailer failed to stop as traffic slowed in front of it on the interstate around 5:45 a.m. The truck smashed into a line of cars. In total seven vehicles, including two tractor trailers and five passenger cars, were involved in the crash.\nPolice say four of the students died at the scene. Three other students were taken to the hospital, where one died. Three other people were also injured in the crash.\n“Every one of our students contributes in no small measure, to the Eagle Nation,” Keel’s letter said. “The loss of any student, especially in a tragic way, is particularly painful. Losing five students is almost incomprehensible. Our hearts go out to the families, friends and classmates of these students.”\nMemorial arrangements were pending, Keel said. The school’s flag will fly at half-staff Thursday, he said.\nPolice say charges are pending the completion of the investigation.\nAccording to St. Joseph's/Candler Hospital in Savannah, Wednesday should have been the women's last day of clincal rotations at the hospital.\nIn a Facebook post, the hospital said:\n\"We are terribly saddened because we were close to them. \"Today should have been a day of celebration for this bright group of students. It was their last day of clinical rotations at St. Joseph’s/Candler in their first year of nursing school. “This was a great group that had some wonderful experiences on the unit,” said Sherry Danello, Vice President of Patient Care Services at St. Joseph’s/Candler and Chief Nursing Officer. “You could tell that they really loved what they did. They didn’t just go through the task, they really connected to the patients.”\n\"Training future healthcare leaders is a responsibility the co-workers at St. Joseph’s/Candler take very seriously. We have a long-standing relationship with Georgia Southern University’s School of Nursing and their students bring additional joy and enthusiasm to our hospitals. Our thoughts and prayers are with the families of these extraordinary students as well as the entire Georgia Southern University community.\"\nRemembering Emily Clark\nLoved ones and former co-workers told WSB-TV’s Carl Willis that they believe the victims of the crash are in a better place.\n\"It’s just a nightmare, a perfect tragedy is what it is,\" said Heather Woods.\nThat's how a family friend summed up the loss of Emily Clark, 20, of Cobb County.\nClark was a Harrison High School graduate.\n\"It's very surreal when you go back and think about it, you think about your friends and think, 'I could've been in the car,'\" said former co-worker Emmie Trull.\nWillis talked to Trull at the Marietta restaurant where she worked with Clark before she went to college.\nTrull said Clark touched many lives through her sorority Alpha Delta Pi and the nursing program.\n\"Emily was a very vibrant girl. She's always really happy, always smiling, always cracking jokes with me,\" Trull said. “I saw where she had a little sister so I'm definitely going to be praying for her little sister because I have a little brother. I can't even imagine what the family is going through.”\n\"Emily was an amazing person. If you see a picture she was a beautiful girl. But her beauty on the inside abounded,\" Woods said.\nAmong the five victims, metro Atlanta also lost Catherine Pittman, 21, from Alpharetta.\n(Source: WSB-TV)","url":"https://www.ajc.com/news/national/georgia-southern-nursing-students-killed-injured-crash/UnI7WKNAFHRnpiCcnIs0RJ/"}
