{"authors":["Carina Wolff"],"date_download":"2018-10-31 01:49:00","date_modify":"2018-10-31 01:49:00","date_publish":"2018-09-06 14:38:47","description":"Going commando is something that may sound more silly than it does practical, but it turns out going sans underwear can actually do your body some good. Although it might feel strange to imagine going out and about without anything on underneath,…","filename":"data/vaneerConsumption/5GrossThingsAboutGoingCommandoThatAreActuallyBenefitingYourHealth.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/912537f5-fc2e-431f-9ab2-50bd56f459f8-zaeh_bustle_apr2016-648.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_5-gross-things-about-going-commando-that-are-actually-benefiting-your-health-11500521_1540950540.html","title":"5 \"Gross\" Things About Going Commando That Are Actually Benefiting Your Health","title_page":"5 \"Gross\" Things About Going Commando That Are Actually Benefiting Your Health","title_rss":"NULL","source_domain":"bustle.com","text":"Going commando is something that may sound more silly than it does practical, but it turns out going sans underwear can actually do your body some good. Although it might feel strange to imagine going out and about without anything on underneath, there are a number of health benefits of not wearing underwear. While many people may go commando to avoid panty lines — or because it simply feels good for them — not wearing underwear can be a good idea for your vaginal health.\nFor the most part, going commando can help prevent frequent yeast infections. \"Whenever it is excessively humid, or [the] temperature changes, or you're consuming unusual amounts of simple sugars and carbs such as alcoholic beverages etc., there is a greater risk of yeast infection formation,\" Dr. Falguni Patel, OB/GYN and RealSelf contributor, tells Bustle. \"That is always a good idea to consider going commando.\"\nIn some cases, such as wearing a rough pair of jeans, going commando might actually do more harm than good, if it's causing painful friction on your skin and pubic area. But if you're rocking some nice loose boyfriend pants or flowy summer skirts, going commando might not be such a bad idea.\nHere are five \"gross\" things about going commando that can actually benefit your health, according to experts.\n1 It Prevents Yeast Infections Andrew Zaeh for Bustle For those who get yeast infections often, going commando can sometimes help alleviate the problem. \"Certain underwear can trap moisture, increasing your chances of yeast infections,\" Dr. Kecia Gaither, OB/GYN tells Bustle. \"Undergarments without a cotton or natural fiber crotch don’t allow 'breathability' in the vaginal area, so moisture accumulates and germs proliferate. If you're prone to repetitive yeast infections, going commando allows air in the vaginal region, preventing moisture accumulation which yeast thrive in.\"\n2 It Can Prevent Chafing Andrew Zaeh for Bustle If you're a fan of tight clothing with equally tight underwear, it might benefit you to go commando from time to time. \"With underwear that's too tight, irritation and chafing of the vaginal area can occur due to the friction generated,\" says Dr. Gaither. However, this could also depend on the type of fabric you're wearing. \"You could get chafing as the delicate vulvar tissue rubs against courser, thicker, rougher material used for outside clothing,\" Dr. Kim Langdon, OB/GYN from ParentingPod tells Bustle. If you want to ditch those drawers, you're better off doing so when wearing a softer fabric.\n3 It Can Diminish Discharge Andrew Zaeh for Bustle \"Often people wear non-cotton undergarments, which prevents proper ventilation,\" says Dr. Patel. \"This leads to greater vaginal discharge. The discharge is not necessarily bad. However, the excessive moisture plus the addition of other negative stimuli such as carbs, antibiotic use, and stress can definitely leads to an over growth of yeast and cause symptoms.\"\n4 It Can Diminish Discomfort From Vaginal Odor Andrew Zaeh for Bustle While vaginal odor is completely natural and common, if you notice it creating discomfort, especially from sweating, you may consider going commando. \"Excess vaginal moisture ... can be irritating, thus leading to discomfort and even pain with sex,\" says Dr. Patel. If you do have a vaginal odor that seems uncommon for you, though, you may want to go to your doctor to test for an infection or STI.","url":"https://www.bustle.com/p/5-gross-things-about-going-commando-that-are-actually-benefiting-your-health-11500521"}
