{"authors":["Sadie Trombetta"],"date_download":"2018-10-31 01:47:24","date_modify":"2018-10-31 01:47:24","date_publish":"2018-08-27 19:00:52","description":"September is right around the corner, and you know what that means: millions of Americans will be heading off to university for the very first time. If you are one of these new students, or you know someone who will be, you might want to check out…","filename":"data/vaneerConsumption/5NonfictionBooksAllFreshmanShouldReadBeforeHeadingOffToCollege.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/b8602ef7-8c73-4c67-90e8-046d2fa1c998-pjimage-8.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_5-nonfiction-books-all-freshman-should-read-before-heading-off-to-college-10178323_1540950444.html","title":"5 Nonfiction Books All Freshman Should Read Before Heading Off To College","title_page":"5 Nonfiction Books All Freshman Should Read Before Heading Off To College","title_rss":"NULL","source_domain":"bustle.com","text":"September is right around the corner, and you know what that means: millions of Americans will be heading off to university for the very first time. If you are one of these new students, or you know someone who will be, you might want to check out these books all freshman should read before their first day of college.\nAccording to the pop culture of my youth — Dawson's Creek, Gilmore Girls, Felicity, even Boy Meets World — American colleges are made up of picturesque campuses where students have big, beautiful dorms and off-campus apartments, engaging and supportive professors, and, somehow, enough time and money to do well in school, go out with friends, fall in love, and take incredible spring breaks. In reality, though, college life is a lot more challenging than how it was portrayed through the rose-colored glasses of early 2000s television.\nThe life of the modern college student is rife with personal, financial, and social challenges. For starters, higher education is over 200 percent more expensive than it was 30 years ago. In addition to bearing the brunt of these increasing financial burdens, the modern collegiate faces increasingly troubling social issues that have huge impacts on their ability to succeed in school. On average, 11.2% of all students experience some for of sexual assault or rape, and even more are subjected to racial, religious, and gender discrimination from their peers and their professors.\nInstead of telling young people how to decorate their dorm rooms or how to improve sub-par dining hall food, we should be preparing them for the realities of modern college life, its warts and all. These five books can help do exactly that.\n'Gross Anatomy: Dispatches from the Front (and Back)' by Mara Altman Let's face it, health and sexuality education in the United States is sub-par. That's why most college freshman will benefit from reading Mara Altman's Gross Anatomy, a humorous and informative guide to understanding what it is like to have and live in a human body. Featuring relatable personal anecdotes and compelling research, this handy book will make existing in shared bathrooms that much easier. Click here to buy.\n'We Should All Be Feminists' by Chimamanda Ngozi Adichie For decades, feminism has thrived on college campuses across America, where students embrace notions of female equality and empowerment, many for the first time. That’s what makes We Should All Be Feminists, a short, enlightening, and persuasive guide, the perfect primer for first time freshman who should know, before their first day of school, that women’s rights are human rights. Click here to buy.\n'Asking For It: The Alarming Rise of Rape Culture — and What We Can Do About It' by Kate Harding There are plenty of studies that show a nationwide increase of sexual assault, harassment, and violence against women, but Kate Harding's Asking for It is more than a book of alarming facts and figures about the rise in America's rape culture. It's also a helpful guide for those who want to change it. A timely and effective handbook every college student, no matter their gender, can learn from, this necessary book can help new freshman transform campus life for the better. Click here to buy.\n'So You Want to Talk About Race' by Ijeoma Oluo Every college student, but especially white college students, should read Ijeoma Oluo's compelling book about race in America and the way it shapes our every day lives and interactions. Sharp, informative, and powerful, So You Want to Talk About Race? will not only open students eyes to the injustices their peers of color face on campus every day, but encourage them to examine, and hopefully improve, their own behavior. Click here to buy.","url":"https://www.bustle.com/p/5-nonfiction-books-all-freshman-should-read-before-heading-off-to-college-10178323"}
