{"authors":[],"date_download":"2018-10-22 22:42:40","date_modify":"2018-10-22 22:42:40","date_publish":"2014-05-09 19:30:18","description":"The commotion kicked up by the new super computer at \"Mad Men\" advertising agency SC&P is nothing compared to the havoc it wreaked at IBM 50 years ago.","filename":"data/vaneerConsumption/5ReasonstoLoveMadMensNewStarTheIBM360.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/432091/140509-ibm-360-mn-1120_389febddf130d37b7293f5406ad49307.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_gadgets_5-reasons-love-mad-mens-new-star-ibm-360-n101716_1540248160.html","title":"5 Reasons to Love 'Mad Men's' New Star: The IBM 360","title_page":"5 Reasons to Love 'Mad Men's' New Star: The IBM 360","title_rss":"NULL","source_domain":"nbcnews.com","text":"The IBM 360 really did change everything\nClever TV critics point to the \"2001: Space Odyssey\" allusions hidden throughout the \"Mad Men\" episode featuring the IBM 360 debut -- plunked right in the middle of SC&P's \"creative lounge.\" But unlike the monolith which confronts apes in Stanley Kubrick's masterpiece, the room-sized computer is more than just a metaphor for epochal change. As Don Draper says to Harry Crane, “In fact it’s quite literal.”\nSpicer confirms, \"It was a massive disruption for IBM and computing, and the biggest development project the company has ever taken on, before or since.\"\nThe IBM 360 is the first computer able to upgrade\nMarketed to serve every degree of industry, \"the IBM 360 was a response to an internal crisis,\" Spicer says.\nPrior to the 360's development, IBM had six or seven mainframe computer lines able to process large amounts of data for either business or science -- just not both. To add to the cost and confusion, each line required its own sales and support team. If a customer wanted to upgrade to a bigger mainframe, the software on the old computer had to be completely rewritten. \"It was very confusing for salesmen and too expensive to support,\" Spicer says.\nFor the first time, \"the IBM 360 allowed customers to upgrade to more powerful models without completely rebuilding the system.\"","url":"https://www.nbcnews.com/tech/gadgets/5-reasons-love-mad-mens-new-star-ibm-360-n101716"}
