{"authors":[],"date_download":"2018-10-22 22:35:37","date_modify":"2018-10-22 22:35:37","date_publish":"2014-06-10 17:23:20","description":"In today’s midday post: a couple takes wedding photos near a wildfire, a waitress loses a $1,000 tip and President Obama talks student loans.","filename":"data/vaneerConsumption/5SpeedReadsCoupleMarriesNearWildfire.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/499736/140610-wildfire-wedding-1248_cccf99f0f7b3562c8c729c10dc067aed.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/nightly-news_5-speed-reads-couple-marries-near-wildfire-n127491_1540247737.html","title":"5 Speed Reads: Couple Marries Near Wildfire","title_page":"5 Speed Reads: Couple Marries Near Wildfire","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\n1. Couples Marries, Narrowly Avoiding Raging Wildfire\nAs far as unique wedding photos go, Michael Wolber and April Hartley’s ranks at the top of the list. As the couple prepared for their wedding in Bend, Oregon, a beautiful area with tall trees and lush grass, a large wildfire was burning on the outskirts of town. During the ceremony on Saturday, firefighters showed up, prepared to evacuate the wedding party. But somewhere down the line, the firefighters had a change of heart and allowed the couple to quickly marry, before evacuating to a relocated reception nearby. With the wildfire now raging at a safe distance, the wedding photographer seized the moment to take some one-of-a-kind pictures of the newlyweds.\n2. Hillary Clinton Says Obama Campaign Asked Her to ‘Attack’ Palin\nIn an interview with NBC News’ Cynthia McFadden, Hillary Clinton said President Obama’s 2008 campaign asked her to attack Sarah Palin immediately after Palin was tapped as John McCain’s running mate. “I said, ‘Attack her for what – being a woman? Attack her for being on the ticket that’s trying to draw attention? There’ll be plenty of time to do what I think you should do in politics, which is draw distinctions,’” said Clinton, who is on tour with her new book, “Hard Choices.” We’ll have more of her interview tonight on NBC Nightly News.\n3. Waffle House Denies Woman $1000 Tip\nA Waffle House waitress in North Carolina says she got a $1,000 tip on Mother’s Day, only to find out she couldn’t keep it. Shaina Brown, 26, was working the overnight shift when a customer called her over for the bill. He paid with his credit card and wrote $1,500 in the tip line: $1,000 for Brown and $500 for another woman at a table nearby. But, as it turns out, Waffle House’s policy is to refund large tips that aren’t made in cash or check, in case the customer decides to dispute the tip later or ask for a refund. Ouch.\n4. Obama to Answer Questions on Tumblr\nEver wanted to chat with President Barack Obama about education, college affordability or student debt? Here’s your chance. Obama will field questions in a live Q&A on Tumblr Tuesday afternoon. On Monday, the president announced the expansion of the Pay As You Earn repayment program, which started in 2012 as a way to limit a student borrower’s monthly payments to 10 percent of discretionary income. You can watch the live stream on the White House’s Tumbler Page starting at 4 p.m. ET.\n5. Sixth Graders Demand Pay for Taking Test\nKids say the darndest things. Sixth graders at a Massachusetts middle school are asking for payment after doing a trial run of the new Common Core test. The 37 students, who were randomly selected for the exam, claim they lost a week of instruction time taking the test. If they were paid minimum wage, the amount of cash the group would have earned during that time could buy textbooks and school supplies, they say. An enterprising student wrote a letter requesting compensation and collected more than 50 signatures, including that of his principal, assistant principal, and his teacher, who sent it to U.S. Education Secretary Arne Duncan, Massachusetts Secretary of Education Matthew Malone and the Partnership for Assessment of Readiness for College and Careers, which administered the test. PARCC says it doesn’t make any money off the test.\nWant to catch up on the day’s news? Sign up for Nightly Perspective newsletter from Brian Williams and the Nightly News team here.","url":"https://www.nbcnews.com/nightly-news/5-speed-reads-couple-marries-near-wildfire-n127491"}
