{"authors":[],"date_download":"2018-10-22 22:59:25","date_modify":"2018-10-22 22:59:25","date_publish":"2014-06-11 17:10:23","description":"In today's midday post: a funny Celine Dion cover, JK Rowling’s political donation, and a huge, controversial Christ the Redeemer balloon.","filename":"data/vaneerConsumption/5SpeedReadsEpicAirportMusicVideoCreatedAllByMyself.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/502606/140611-las-vegas-airport-1303_5897fb78fb6de6964f3302c044df8021.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/nightly-news_5-speed-reads-epic-airport-music-video-created-all-myself-n128581_1540249165.html","title":"5 Speed Reads: Epic Airport Music Video Created 'All By Myself'","title_page":"5 Speed Reads: Epic Airport Music Video Created 'All By Myself'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\n1. Empty Airport Inspires Epic Music Video\nEver been stuck in an airport at night, all alone? Richard Dunn feels your pain. He stayed overnight in the Las Vegas McCarran International Airport after volunteering to take a later Delta flight in exchange for vouchers. But instead of killing time by wandering aimlessly, he created an impressive airport music video lip syncing to Celine Dion. But with all the fancy moves, and zooms, was he really \"all by himself?\"\n2. JK Rowling Donates £1 Million to Keep Scotland in UK\nJK Rowling, best known for her incredibly popular Harry Potter books, is now making a name for herself in Scottish politics. She just donated £1 million to the anti-independence campaign Better Together to keep Scotland part of the United Kingdom. Rowling, who lives in Edinburgh said, \"My hesitance at embracing independence has nothing to do with the lack of belief in Scotland's remarkable people or its achievements. The simple truth is that Scotland is subject to the same 21st century pressures as the rest of the world.\" The Better Together campaign has been warning supporters that its opponent, Yes Scotland, has more money backing it.\n3. Luxury Home Clings to Collapsing Cliff\nStunning pictures from Texas show a home sitting on the edge of a 75-foot cliff -- in danger of falling into Lake Whitney. Soil and debris have eroded to the point there is a huge gap of space underneath the center of the $700,000 house. From one vantage point, the house boasts spectacular views and a manicured lawn -- but across the lake, you can see the danger lurking below.\n4. Sophia Grace and Rosie Snag Movie Deal\nThe two cute British cousins featured on “The Ellen DeGeneres Show,” who first became famous for knowing every word to Nicki Minaj’s “Super Bass,” are setting their sights on the big screen. Sophia Grace and Rosie reportedly have a five-picture deal for straight-to-video movies. The first one will be called \"Sophia Grace & Rosie's Royal Adventure.\" And in case you're wondering, TMZ reports 11-year-old Sophia Grace will make $50,000 for the first movie, $75,000 for films two and three and $100,000 for the fourth and fifth installments. The details for younger Rosie are not available.\n5. Christ the Redeemer World Cup Stunt Causes a Stir\nA 151-foot tall hot air balloon replica of Brazil's famous \"Christ the Redeemer\" statue, wearing a soccer jersey with the slogan #KeepTheFaith, is causing quite a stir in Australia. The balloon is the brainchild of Australian gambling site Sportsbet, and is currently flying over the city of Melbourne. But not everyone's happy about it. Some politicians and business executives are \"outraged.\" What do you think? Tell us in the comment section.\nWant to catch up on the day’s news? Sign up for Nightly Perspective newsletter from Brian Williams and the Nightly News team here.","url":"https://www.nbcnews.com/nightly-news/5-speed-reads-epic-airport-music-video-created-all-myself-n128581"}
