{"authors":[],"date_download":"2018-10-22 20:55:24","date_modify":"2018-10-22 20:55:24","date_publish":"2014-06-03 18:00:34","description":"In today’s midday post: a plane nearly clips a beachgoer, Seattle’s minimum wage rises and the TV show anchored by “Egypt’s Jon Stewart” gets the ax.","filename":"data/vaneerConsumption/5SpeedReadsPlaneNearlyLandsonSunbathingMan.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/483496/tdy-140603-plane-beach-mn-840_50ec117c3a3842fafb2e81723b43bd15.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/nightly-news_5-speed-reads-plane-nearly-lands-sunbathing-man-n121466_1540241724.html","title":"5 Speed Reads: Plane Nearly Lands on Sunbathing Man","title_page":"5 Speed Reads: Plane Nearly Lands on Sunbathing Man","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\n1. Plane Nearly Hits Sunbather\nA sunbather in northern Germany nearly had a run-in with the front end of a plane’s propeller. The man was lying on a beach next to an airstrip (it doesn’t make sense to us either), when a small plane approached. The pilot misjudged his landing and came in dangerously low, even clipping part of a nearby fence. Luckily, the sunbather was deep enough in the sand to avoid getting hit. Check out the video.\n2. Less Work, More Play in Sweden\nWorkaholics of the world: prepare to be green with envy. Gothenburg, Sweden’s second largest city, will begin experimenting this summer with six-hour workdays, with full pay. The trial starts July 1, and will divide government workers into two groups – one will work six hours a day, while the other will continue working the traditional eight hours. If the enviable group with shorter hours are found to be better off mentally and physically, and are more productive, the six-hour workday may extend to other parts of the country. Who’s ready to move to Sweden?\n3. Seattle Approves $15 Minimum Wage\nOn Monday, the Seattle City Council made history by unanimously raising the minimum wage to $15 per hour – the highest minimum wage in the country. The plan, which includes a lower training wage aimed at teens, will be phased in over the next three to seven years starting in April 2015. Council members believe roughly one in four of the city’s workforce earns less than $15 an hour.\n4. Cancelled: ‘Jon Stewart of Egypt’ Goes Off Air\nBassem Youssef, better known as Egypt’s version of Jon Stewart, says his political satire show “Al-Bernameg” has been cancelled. Youssef says his broadcaster, MBC-Misr, was under pressure from the government to crackdown on satire in Egypt. The country’s former army chief, Abdel-Fattah el-Sissi, just won the presidency last week. “Al-Bernameg” had mocked el-Sissi and asked him not to run for president. MBC-Misr has not yet commented on its programming change.\n5. Species Are Dying at a Rapid Rate\nThese days, more and more plants and animals are going the way of the dodo bird. Scientists say extinctions are happening at a rate 1,000 times faster than before humans inhabited Earth. New research published in the journal “Science” demonstrates that the planet has experienced five major extinctions -- and now we may be on the verge of a sixth. Scientists say humans are to blame due to our tendency to destroy habitats; move animals around and introduce them to new environments; and contribute to global warming.","url":"https://www.nbcnews.com/nightly-news/5-speed-reads-plane-nearly-lands-sunbathing-man-n121466"}
