{"authors":["Deborah Danan"],"date_download":"2018-10-30 20:23:00","date_modify":"2018-10-30 20:23:00","date_publish":"2016-08-29 14:54:28","description":"TEL AVIV - Israeli vacationers were given blue wristbands differentiating them from other guests at a five-star resort in Rhodes, Greece, Israel’s Channel 10 reported on Sunday.","filename":"data/vaneerConsumption/5StarRhodesResortDistinguishesIsraelisFromOtherGuestsUsingDiscriminatoryBlueWristbands.json","image_url":"https://media.breitbart.com/media/2016/08/Screen-Shot-2016-08-18-at-09.28.41.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_08_29__1540930980.html","title":"5-Star Rhodes Resort Distinguishes Israelis From Other Guests Using 'Discriminatory' Blue Wristbands","title_page":"5-Star Rhodes Resort Distinguishes Israelis From Other Guests Using 'Discriminatory' Blue Wristbands | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Israeli vacationers were given blue wristbands differentiating them from other guests at a five-star resort in Rhodes, Greece, Israel’s Channel 10 reported on Sunday.\nThe Imperial Hotel distributes plastic tags that allow access to the resort’s facilities, yet only Israelis were given blue ones, the report said.\nA hotel representative told Channel 10’s investigative duo Orly Vilnai and Guy Meroz that the colors were arbitrary and simply identify the country of origin.\nHowever, the two reporters revealed that the rest of the guests were given bracelets in a range of colors, regardless of their country of origin.\n“I was unaware of this incident,” Yehuda Zafrani, an Israeli adviser to air carriers said. “When it happens and everyone keeps quiet, nothing changes. Vacation package deal providers must be made aware of this story so something can change.”\n“This policy is discriminatory and harmful,” he added.\nHotels in the Israeli resort town of Eilat also provide different-colored wristbands to their guests, but these simply indicate the date of their arrival at the hotel.\nEarlier this year, Rhodes Tourism Deputy Mayor Marisa Chatzilazarou called her country “the favorite destination of Israelis” while speaking at Israel’s International Tourism Fair.\nIn 2015 alone, 102,705 Israelis visited Rhodes, Chatzilazarou claimed.\nRhodes’ fifth largest pool of tourists is comprised of Israelis, surpassed only by England, Germany, Sweden, and Russia. Due to its status as one of the safest tourist destinations, Israelis choose Rhodes as their number one vacation choice.","url":"https://www.breitbart.com/middle-east/2016/08/29/5-star-rhodes-resort-distinguishes-israelis-from-other-guests-using-discriminatory-blue-wristbands/"}
