{"authors":[],"date_download":"2018-10-30 14:25:03","date_modify":"2018-10-30 14:25:03","date_publish":"2017-04-28 11:22:00","description":"1. President Donald Trump returns to Georgia.","filename":"data/vaneerConsumption/5thingstoknowtodayTrumpheadstoAtlantatospeakatNRAmeeting.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/28/Images/trump%204-28.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_things-know-today-trump-heads-atlanta-speak-nra-meeting__1540909503.html","title":"5 things to know today: Trump heads to Atlanta to speak at NRA meeting","title_page":"5 things to know today: Trump heads to Atlanta to speak at NRA meeting","title_rss":"NULL","source_domain":"ajc.com","text":"1. President Donald Trump returns to Georgia. The president is here on Friday for the first time since his election with a whirlwind visit that includes a speech to the National Rifle Association’s convention in downtown Atlanta and a fundraiser for Republican Karen Handel’s campaign for Congress. [Read here]\n2. Falcons select UCLA’s pass rusher Takkarist McKinley. The Falcons pulled off a trade with Seattle on Thursday night to land UCLA pass rusher Takkarist McKinley with the 26th pick in the NFL draft. The Falcons gave up a third-round and a seventh-round pick to move up from the 31st spot to the 26th spot to draft McKinley, a 6-foot-2, 250-pound defensive end. [Read here]\n3. How to deal with heavy traffic in downtown Atlanta Friday. The combination of as many as 80,000 of attendees to the National Rifle Association’s annual convention and tens of thousands of Atlanta Hawks fans flocking to downtown Atlanta for a playoff game create a recipe for heavy traffic. Here’s how to deal with it. [Read here]\n4. Fog blankets metro Atlanta. Moisture in the air from overnight storms left metro Atlanta in a foggy haze. And that fog may not start to lift until about 11 a.m. Areas along and south of I-85 and I-20 have the thickest fog, and visibility could drop to a half-mile or less in Gwinnett and DeKalb counties, according to the National Weather Service. [Read here]\n5. Neighbors: Tyler Perry’s old Johns Creek home turning into an eyesore. A 58-acre estate in Johns Creek once owned by filmmaker and actor Tyler Perry has some neighbors in the area concerned. Channel 2 Action News reports most of what made the property special has been scrapped. Perry sold the land and house to a property developer, Lennar Atlanta, who cleared the site for future real estate development. But the land is back on the market and not being taken care of. [Read here]","url":"https://www.ajc.com/news/things-know-today-trump-heads-atlanta-speak-nra-meeting/sOzDdFHLAcFjJjA847ESdO/"}
