{"authors":[],"date_download":"2018-10-30 14:07:50","date_modify":"2018-10-30 14:07:50","date_publish":"2018-10-30 12:53:00","description":"In their first game back after the bye week, the Atlanta Falcons (3-4) are set to face the Washingto...","filename":"data/vaneerConsumption/5thingstoknowaftertheFalconsbyeweek.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Images/falcons-redskins.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_notable-thi_14702d3edf93c86889164d7f47d87266__1540908470.html","title":"5 things to know after the Falcons’ bye week","title_page":"5  things to know after the Falcons’ bye week","title_rss":"NULL","source_domain":"ajc.com","text":"In their first game back after the bye week, the Atlanta Falcons (3-4) are set to face the Washington Redskins (5-2) at 1 p.m. Sunday at FedEx Field in Landover, Md.\nHere are five stats that set up the matchup:\n1. Series. This will be the 25th meeting between the two franchises. The Redskins hold a 14-9-1 advantage. However, the Falcons have won the last five meetings.\n2. Revamped line. Because of injury, the Falcons will start their third different combination along the offensive line with Ben Garland taking over at right guard for Brandon Fusco. The unit will be charged with improving the rushing attack. The Falcons are averaging 83.3 yards per game, which ranks 30th in the league. The Redskins, who held the Giants to 38 yards rushing in their 20-13 win on Sunday, allow 80.1 yards per game, which ranks second in the league.\n3. Sack attack. Led by defensive tackle Matt Ioannidis (2.5 sacks), Washington had seven sacks against the Giants.\n4. Peterson is aging well. Washington running back Adrian Peterson, who’s 33, rushed for 149 yards, including 107 in the fourth quarter in the win over the Giants. He had a 64-yard touchdown run and was running 20.37 miles per hour, according to NFL’s Next Gen Stats.\n5. Ryan climbing the charts. In the win over the Giants before the bye week, Falcons quarterback Matt Ryan completed 18 consecutive passed to close out the 23-20 victory and completed passes to 10 different receivers.\nRyan, who’s played in the passing friendly era, moved up to 13th on the all-time completions list. He moved ahead of Vinny Testaverde (3,787).","url":"https://www.ajc.com/sports/football/notable-things-consider-after-the-falcons-bye-week/n24t3cCYr0TicWW2rfEC3N/"}
