{"authors":[],"date_download":"2018-10-22 22:55:59","date_modify":"2018-10-22 22:55:59","date_publish":"2014-06-11 08:42:28","description":"David Brat launched himself as the Tea Party's new star when he defeated Eric Cantor pm Tuesday. Here are five things to know about him.","filename":"data/vaneerConsumption/5ThingsAboutTeaPartyBackedDavidBratWhoBeatEricCantor.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/501221/140611-david-brat-primary-4a_159fd392206216507a142880ae547287.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_elections_5-things-about-tea-party-backed-david-brat-who-beat-n128151_1540248959.html","title":"5 Things About Tea Party-Backed David Brat, Who Beat Eric Cantor","title_page":"5 Things About Tea Party-Backed David Brat, Who Beat Eric Cantor","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nDavid Brat launched himself as the tea party's new star when he defeated House Majority Leader Eric Cantor Tuesday in the biggest primary upset in recent memory. Here are five facts about the man who will run for the GOP in Virginia's 7th district:\n1. His campaign budget was tiny compared to Cantor's war chest\nIn terms of fundraising this contest made David and Goliath look like an even fight. Cantor raised almost $5.5 million during the cycle, more than 25 times the amount of Brat’s shoestring budget of $200,000, a third of which came from small contributions, according to opensecrets.org.\nIn fact, Cantor spent more on steak houses than Brat did in his entire campaign. This divide extended to their respective campaign teams, with Brat eschewing the large and experienced group of staffers used by the incumbent in favor of a skeleton crew and grassroots campaigning.\n2. He is a college economics professor - and a very dedicated one at that\nBrat gained a Ph.D. in economics at the American University in Washington, D.C., before going on to work as an economics professor at Randolph-Macon College, a liberal arts college north of Richmond, Va.\nSo dedicated is he to his profession that he canceled a packed schedule of meetings with key conservative activists in May because he had papers to grade.\n\"He had school stuff to take care of,\" his 23-year-old campaign manager Zachary Werrell told the Washington Post. His Democrat challenger in the staunch-Republican district is Jack Trammell, also a professor at Randolph-Macon.\n3. He beat Cantor on immigration reform\nImmigration became the focus of much of the debate in the campaign, with Brat painting Cantor as an advocate of amnesty for immigrants living illegally in the U.S. This forced a change in tone for the incumbent, who has repeatedly said he supports giving citizenship to immigrants brought to the U.S. as children.","url":"https://www.nbcnews.com/politics/elections/5-things-about-tea-party-backed-david-brat-who-beat-n128151"}
