{"authors":[],"date_download":"2018-10-30 20:07:31","date_modify":"2018-10-30 20:07:31","date_publish":"2016-10-02 20:21:00","description":"All-Pro wide receiver Julio Jones and quarterback Matt Ryan put on a passing clinic to carry the Fal...","filename":"data/vaneerConsumption/5thingswelearnedfromtheFalcons4833winoverthePanther.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/02/Images/100316%20falcons%20photos%20bs34.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_things-lear_628f8b696f0c282ff1847d9148a903bb__1540930051.html","title":"5 things we learned from the Falcons’ 48-33 win over the Panther","title_page":"5 things we learned from the Falcons’ 48-33 win over the Panther","title_rss":"NULL","source_domain":"ajc.com","text":"All-Pro wide receiver Julio Jones and quarterback Matt Ryan put on a passing clinic to carry the Falcons to a 48-33 victory against the Carolina Panthers before 70,508 fans on Sunday at the Georgia Dome.\nRyan passed for a franchise-record 503 yards and Jones hauled in 12 passes for a franchise-record 300 yards and one electric 75-yard catch-and-run for a key fourth-quarter touchdown.\n“They totally rely and count on one another,” Falcons coach Dan Quinn said on Jones and Ryan. “That chemistry was certainly on display today.”\nThe Falcons weren’t safe until cornerback Robert Alford made two interceptions to close out the Panthers.\n“We knew it was going to be an all-day fight,” Quinn said.\nThe Falcons made the Panthers pay for not keeping their top cornerback Josh Norman over the offseason. With Norman in Washington, Jones was free to terrorize the Panthers’ defensive backs.\nThe Falcons, who improved to 3-1, believe they are team to beat in the NFC South.\n“On yeah, no doubt,” left tackle Jake Matthews said. “We knew we were the team to beat in the division going into the year. That’s the confidence that we have.”\nThe Panthers, the three-time defending NFC South champs, dropped to 1-3.\nHere’s are five things we learned from the victory:\n1. The Julio Jones show. A week after having one catch for 16 yards, the Falcons opened the game by throwing three consecutive passes to Jones, who had gains of 22, 14 and 15 yards. He had six catches for 152 yards at the half. He finished with 12 catches for 300 yards, the most ever against a Carolina defense (Rod Gardner, Washington, Oct. 21, 2001, 208 yards).\nWith Ryan and Jones connecting the Falcons raced to a 14-0 lead.\nJones accounted for 51 yards of the opening 71-yard touchdown drive. Ryan tossed a 4-yard pass to tight end Jacob Tamme.\nOn their second possession, the Ryan tossed a 43-yard pass to Jones. Two plays later, running back Devonta Freeman darted up the middle for a 13-yard touchdown run.\nThe Falcons’ offense continued to operate at high level despite having poor field position.\nThe Falcons put together a string of long drives against the Panthers’ defense, which entered the game as the third-rated defense in the league.\nThe drives were 71, 98, 65 (field goal), 99, 92 and 53 (field goal) yards.\nRyan previous career-high was 448 yards passing, which he set in a 37-34 win over the New Orleans Saints Sept. 7, 2014.\nJones previous high was 259 yards in a 43-37 loss to the Green Bay Packers on Dec. 8, 2014.\n“They put the young corner on me man-to-man,” Jones said. “It was open with them playing me one-on-one. They singled me out today and Matt made some great decisions.”\nJones has seen a lot of double- and triple-teams this season. “I love it.” Jones said of one-on-one coverage.\nJones 75-yard touchdown was Ryan’s fourth touchdown pass of the game.\n“We got Julio the ball in space,” Ryan said. “When he has the ball in space, he’s just so explosive. He just finished the run so good. It was impressive to see.”\n2. Pick six. The Falcons were cruising along, looking to build on their lead, when disaster struck.\nOn second-and-5 from their 6-yard line, Ryan’s pass intended for Freeman was tipped by Panthers linebacker Thomas Davis. Safety Kurt Coleman intercepted and returned it eight yards for the touchdown.\nIn the fourth quarter, with the score 41-33, Alford intercepted Carolina’s Derek Anderson and returned it 30 yards for a clinching touchdown and then Alford intercepted Anderson again on the next Carolina possession.\n3. Shutting down Newton. The Falcons knew they had to do a good job with Newton’s designed running plays.\nLinebacker Deion Jones and defensive end Vic Beasley both had open-field tackles on Newton, who rushed for five times for 30 yards.\nJones had a hit on Newton on a two-point conversion run in the fourth quarter and knocked him out of the game. Newton suffered a concussion on the play and was replaced by Anderson.\n4. Covering the tight end. The Falcons’ defense continued to struggle to cover the tight end.\nThey have now given up a touchdown to a tight end in each of their games.\nCarolina’s Pro Bowl tight end Greg Olsen didn’t catch a pass until the fourth quarter against the Falcons. He made a nice one-handed touchdown catch with 3:58 left in the game and made a grab on a two-point conversion to make it 34-26.\n5. The pass rush a factor. With veteran Dwight Freeney leading the way, the Falcons mounted a pass rush against the Panthers.\nFreeney had a sack and two quarterback hits. Overall, the defense had eight quarterback hits.","url":"https://www.ajc.com/sports/football/things-learned-from-the-falcons-win-over-the-panthers/4KYYm5TR1Q8rKF6zw0uxSI/"}
