{"authors":["Brakkton Booker"],"date_download":"2018-10-23 05:50:40","date_modify":"2018-10-23 05:50:40","date_publish":"2015-05-03 00:00:00","description":"The pediatric neurosurgeon, who entered the presidential race Sunday night, performed pioneering operations on conjoined twins and hasn't held public office before. Here's what you might not know.","filename":"data/vaneerConsumption/5ThingsYouShouldKnowAboutBenCarson.json","image_url":"https://media.npr.org/assets/img/2015/05/01/2141062_wide-5ccbb5a52e37a75e24424072b6a358403b61e4bd.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_itsallpolitics_2015_05_03_403599009_5-things-you-should-know-about-ben-carson_1540273840.html","title":"5 Things You Should Know About Ben Carson","title_page":"5 Things You Should Know About Ben Carson  : It's All Politics : NPR","title_rss":"NULL","source_domain":"npr.org","text":"5 Things You Should Know About Ben Carson\nEnlarge this image toggle caption Carolyn Kaster/AP Carolyn Kaster/AP\nThis post was updated at 10 a.m. ET\nThe field of major Republican presidential candidates is growing larger. Former Hewlett-Packard CEO Carly Fiorina jumped into the race Monday. And former Arkansas Gov. Mike Huckabee is expected to jump into the race this week.\nDr. Ben Carson, a pediatric neurosurgeon, got into the race Sunday night in an interview with Florida TV station WPEC. \"Many people have suggested to me that I should run for president,\" Carson said, \"even though I'm not a politician.\"\nEnlarge this image toggle caption Getty Images Getty Images\nCarson is also expected to speak Monday in Detroit. He's considered a long shot, but with his backstory and the fact that he's unencumbered by any previous political record, Carson is definitely someone worth watching.\nHere's what you need to know.\n1. He grew up poor, and was a poor student and quick-tempered\nBenjamin Solomon Carson was raised in Detroit by his single mother. Carson's mom would make ends meet cleaning houses and other low-wage work and she was determined to make education a priority for her boys. She'd make Carson and his older brother finish two books a week and write up book reports on them. She'd mark the reports up with check marks and the like even though she couldn't read. She suffered from depression and would from time to time check herself into a mental institution.\nCarson did not start out a model student. He got poor marks early in school and some of his classmates would call him \"dummy.\" Carson also had a quick temper and once tried to stab someone with a camping knife during his youth. He eventually overcame his anger issues and academic challenges and graduated from Yale University and University of Michigan Medical School.\n2. He was the director of pediatric neurosurgery at Hopkins\nIn 1984, when he was 33 years old, Carson became the director of pediatric neurosurgery at Johns Hopkins University. At the time, he was the youngest doctor in America to hold such a position.\nIn 1987, Carson earned world-wide recognition when he led a team that performed the first successful separation of twins, Benjamin and Patrick Binder, who were joined at the head. In all it took five months of planning and 22 hours of surgery, and it required a 70-person team to complete. He is also credited with the revival of a medical procedure known as a hemispherectomy, an operation where half a patient's brain is removed in order to cure certain brain diseases that cause seizures.\n3. He's an accomplished author and Presidential Medal of Freedom recipient\nEnlarge this image toggle caption Ron Edmonds/AP Ron Edmonds/AP\nCarson's life story, from growing up a poor kid in inner-city Detroit to becoming a groundbreaking neurosurgeon, was documented in his autobiography Gifted Hands. He has gone on to write other books since then, including a New York Times best-seller, One Nation, in 2014.\nIt was Gifted Hands that made Carson a hero, particularly among African-Americans, and it was a staple for many parents and schools to assign the book as mandatory reading. The book eventually was turned into a movie and Carson was played by Academy-Award winner Cuba Gooding Jr. in 2009. A year before that movie premiered, President George W. Bush honored Carson with the Presidential Medal of Freedom. It's the highest award given to a civilian. Carson was reportedly notified he was a recipient of the award while performing a seven-hour surgery.\n4. He gave a famous 2013 National Prayer Breakfast speech\nAt an event that is typically apolitical, Carson delivered a sharp critique of President Obama's tax policies and implementation of his signature health care law. While Carson never referenced the health care law or the president by name, President Obama was sitting only a few feet away. Almost instantly Carson was jeered by progressives who thought that this was inappropriate, given the setting, and celebrated by conservatives who saw this as speaking truth to power. It's also seen as the moment that launched Carson's ascendency toward running for the Oval Office.\n5. He has never held or run for public office\nDespite never running for or holding public office, Carson remains a darling among certain segments of the conservative base, particularly those who tilt toward the Tea Party. He is one of the most sought-after conservative speakers in the country. In many polls he outpaces well-established elected officials who will likely announce their own presidential bids, like Louisiana Gov. Bobby Jindal, former Texas Gov. Rick Perry, New Jersey Gov. Chris Christie and South Carolina Sen. Lindsey Graham.","url":"https://www.npr.org/sections/itsallpolitics/2015/05/03/403599009/5-things-you-should-know-about-ben-carson"}
