{"authors":["Wade Goodwyn"],"date_download":"2018-10-22 21:36:09","date_modify":"2018-10-22 21:36:09","date_publish":"2015-06-04 00:00:00","description":"The former Texas governor is running again for the GOP presidential nomination. Did you know that he was once an Al Gore Democrat, he and George W. Bush have bad blood and he used to be a cheerleader?","filename":"data/vaneerConsumption/5ThingsYouShouldKnowAboutRickPerry.json","image_url":"https://media.npr.org/assets/img/2015/06/03/ap584342108765_wide-485e76a6e1983101a7d3f3f1b2ac54ee3ce02294.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_itsallpolitics_2015_06_04_411777080_5-things-you-should-know-about-rick-perry_1540244169.html","title":"5 Things You Should Know About Rick Perry","title_page":"5 Things You Should Know About Rick Perry : It's All Politics : NPR","title_rss":"NULL","source_domain":"npr.org","text":"5 Things You Should Know About Rick Perry\nEnlarge this image toggle caption Nati Harnik/AP Nati Harnik/AP\nThis post has been updated to note that Perry has entered the 2016 presidential race.\nFormer Texas Gov. Rick Perry released a video Thursday morning strongly suggesting that he's running again for president. The video ends with a \"Perry President\" logo and notes that it is \"Paid for by Perry for President Inc.\" His website has also been rebranded ahead of his expected midday announcement speech in Dallas on Thursday.\nYouTube\nHis 2012 presidential campaign was tripped up by back surgery medication and several embarrassing missteps, including his \"oops\" debate moment, in which he forgot the third federal agency he said he wanted to cut.\nHe has tried to get past that with a new look and better preparation this go-round. Here are five things to know about Texas' longest-serving governor:\nYouTube\n1. Perry started his political career an Al Gore Democrat.\nIt's hard to believe now, but Rick Perry was a Democrat for five years when he first began as a Texas state representative in 1984. He admired Al Gore as a Southern centrist he could emulate and supported Gore's presidential campaign in Texas in 1988. It's a popular myth that Perry actually chaired Gore's campaign that year. Former U.S. Rep. Ron Paul ran an ad against Perry in his home state during the 2012 presidential race, charging that Perry was Al Gore's Texas cheerleader. (More on the cheerleader bit later.)\n2. Perry was for big government projects before he was against them.\nInterstate 35, which runs right up the middle of the state all the way to Canada, was in desperate need of expansion. Gov. Perry came up with the Trans-Texas Corridor — a superhighway, super-train track, super-everything that would transport people and goods to and from Mexico like nobody's business. The only problem was that it was so wide it ate up half of Texas and rural landowners hated it. Conservative talk show celebrity Alan Jones accused Perry of trying to create his own country out of the middle parts of Mexico, the U.S. and Canada. Perry denied it. The Trans-Texas Corridor proposal eventually made like Gen. Douglas MacArthur and faded away.\n3. Perry tried to protect young teenage girls from cervical cancer.\nTo the surprise and delight of the state's Democrats, in 2007 Perry ambushed and bypassed the predominately Republican legislature by issuing an executive order mandating HPV vaccines for all sixth-grade public school girls. Liberals were puzzled but thrilled with Perry's \"enlightened\" order, while conservatives, especially the state's evangelicals, were beside themselves. It turns out that Perry's former chief of staff and longtime supporter Mike Toomey had become a lobbyist for Merck. And Merck made Gardasil, the vaccination which protects girls from the sexually transmitted cancer. And protecting hundreds of thousands of Texas's sixth graders would have required quite the batch. Indignant, the Legislature repealed Perry's order. During their 2011 presidential debate, Minnesota Rep. Michele Bachmann accused Perry of \"crony capitalism\" because of this controversy. The accusation surprised and stung the Texas governor.\nYouTube\n4. The two former GOP Texas governors — Perry and George W. Bush — aren't big fans of the other.\nIt started in 1998, when Perry was first running for lieutenant governor and was in a very tight race with Democrat John Sharp. Perry's campaign wanted to run an attack ad against Sharp, but Gov. George Bush's man Karl Rove said no. Rove was in the midst of re-electing a very popular Gov. Bush in a sort of \"compassionate conservative\" campaign, laying the groundwork for Bush to run for president in 2000. Rove knew Bush had the governor's re-election in the bag, and he didn't want to alienate any Democrats with negative campaigning. Rove said that if Perry ran the attack ad against Sharp, Bush would withhold his endorsement from Perry. So the Perry camp caved, didn't run the attack ad and barely squeaked out a win. There's been bad blood ever since. When Bush did run for president, Perry backed Rudy Giuliani instead and called Bush a profligate fiscal spender. It did not help smooth relations.\n5. Rick Perry was a cheerleader at Texas A&M — specifically, an Aggie Yell Leader.\nAt Texas A&M, the cheerleaders are all men, as was the entire student body a long time ago. While cheerleaders at other academic institutions dress in colorful outfits and lead their fans in cheering the team, at A&M the Yell Leaders dress all in white and make large gestures while screaming at the fans — thus the name. When a game is close, they've been known to, well, squeeze their private parts so as to share the pain of the team on the field. It's serious business in College Station.","url":"https://www.npr.org/sections/itsallpolitics/2015/06/04/411777080/5-things-you-should-know-about-rick-perry"}
