{"authors":[],"date_download":"2018-10-22 21:10:13","date_modify":"2018-10-22 21:10:13","date_publish":"2014-05-05 23:45:18","description":"The White House's National Climate Assessment, due for release on Tuesday, can make a difference in at least five areas, environmentalists say.","filename":"data/vaneerConsumption/5ThingsEnvironmentalistsWantFromWhiteHousesClimateReport.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_46/422056/140505-global-warming-jms-2002_5a4cc2612d5aaec403994353806a48cf.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_environment_5-things-environmentalists-want-white-houses-climate-report-n97746_1540242613.html","title":"5 Things Environmentalists Want From White House's Climate Report","title_page":"5 Things Environmentalists Want From White House's Climate Report","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThis is the year of the climate report: The Intergovernmental Panel on Climate Change is in the middle of releasing its latest series of global assessments, the American Association for the Advancement of Science has begun a major educational campaign, and the National Academy of Sciences and the Royal Society have issued their own take on climate science.\nAll of those reports lay out the evidence for claims that Earth's climate is undergoing a rapid transition, that industrial activity has a lot to do with the transition, and that dealing with changing climate is one of the biggest challenges we face over the next century.\nSo how much of a difference will there be when the 1,300-page National Climate Assessment, which was issued in draft form last year, gets its official release at the White House on Tuesday?\nOn one level, maybe not much. \"I don't expect any different response to this report from the previous reports,\" Steven Cohen, executive director of Columbia University's Earth Institute, told NBC News. Climate activists are already familiar with the evidence, and climate skeptics are already primed to dispute it.\nBut on another level, Cohen and other environmental experts hope the report will boost climate initiatives on the national as well as the state and local level. Environmentalists see at least five opportunities to capitalize on the findings:\n1. Raise awareness among state and local officials: Unlike the IPCC's assessment, the White House report details the current and future impacts of climate change for each region of the United States, with a sector-by-sector breakdown of the economic impact. \"We hope that this new report will really bring home what's at stake to local and state leaders, what they can lose due to climate change, and what they can gain from cleaning up those problems,\" said Aliya Haq, climate change special projects director for the Natural Resources Defense Council.\n2. Reduce power-plant emissions: Haq noted that the Obama administration is expected to propose greenhouse-gas emission standards for existing power plants sometime in the next month. \"What we would like to see is a lot of energy efficiency in that proposal, and a lot of renewable energy,\" she said. \"States are going to play a part in how that standard gets designed.\" The White House report should provide the specifics that governors, mayors and other officials will need to stimulate their own climate plans and sell them to their constituents.\n3. Marshal support for climate-oriented public projects: Cohen may have conservative expectations for climate reports, but he recognizes that they do make a difference — particularly when extreme weather events have high-profile impacts, as was the case in 2012 with Superstorm Sandy. As an example, Cohen pointed to the $20 billion plan to fortify New York against future superstorms. \"We are seeing change,\" he said. \"This is becoming part of a serious political dialogue.\"\n4. Turn attention to fossil-fuel extraction and export: Greenpeace hopes this week's climate report will encourage the Obama administration to address a \"major blind spot\" in its climate action plan. \"While President Obama has taken some important steps to address climate change at home, his administration is undermining that progress by ignoring the huge amounts of carbon pollution that would accompany the fossil fuel industry's plans to export coal, liquefied natural gas and oil abroad,\" Gabe Wisniewski, Greenpeace USA's climate and energy campaign director, said in an emailed statement. \"Climate change is a global crisis which will only be made worse by extracting and exporting fossil fuels, whether it's fracked gas from Appalachia, coal strip-mined from Montana, or oil drilled from the Arctic.\"\n5. Educate the next generation about climate issues: Minda Berbeco, programs and policy director for the National Center for Science Education, said she hopes teachers will find ways to incorporate the report's specifics into localized lesson plans on climate science. For example, students in the Southwest could learn about the climate connection to drought and wildfires, while students in Alaska could focus on shrinking sea ice and thawing permafrost. \"I think it's a huge opportunity for education,\" she told NBC News, \"not just for adults and voting-age citizens, but for everyone who's going to have to deal with climate change in the future. Which means kids.\"\nThe National Climate Assessment is due to be published on the GlobalChange.gov website on Tuesday. TODAY weather anchor Al Roker will interview President Barack Obama about the report and its impact. For more information, follow the U.S. Global Change Research Program on Facebook and Twitter, and stay tuned for continuing coverage on NBCNews.com and TODAY.com.","url":"https://www.nbcnews.com/science/environment/5-things-environmentalists-want-white-houses-climate-report-n97746"}
