{"authors":["Press Association"],"date_download":"2018-10-23 02:01:34","date_modify":"2018-10-23 02:01:34","date_publish":"2017-03-10 10:48:05","description":"Alex Hales and Joe Root´s centuries helped England complete a historic 3-0 one-day international whitewash with a 186-run win in Barbados.","filename":"data/vaneerConsumption/5thingswelearnedfromEnglandsODItourofWestIndies.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/11/wire-195633-1489145590-874_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4300752_5-things-learned-England-s-ODI-tour-West-Indies_1540260094.html","title":"5 things we learned from England´s ODI tour of West Indies","title_page":"5 things we learned from England´s ODI tour of West Indies | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"England’s 3-0 victory over West Indies is their first one-day international whitewash of their hosts in the Caribbean.\nHere, we look at five things we learned from the short and successful tour.\n1 Plunkett and Finn are in the frame\nLiam Plunkett\nAt 31, Liam Plunkett has added several new strings to his bow. He did not hide the fact he was annoyed to be left out of last winter’s white-ball tour of South Africa, but has addressed the qualms which were put to him back then. Plunkett is now emphatically no longer just about pace. He can still bowl as quick as most, and steepling bounce will always be an asset too. But he has a growing collection of variation deliveries, and was rewarded here with 10 wickets at under 10 each. Steven Finn, meanwhile, arrived as the spare seamer but stepped in when injury struck Jake Ball and soon bagged his 100th ODI wicket.\n2 Hales is centre stage\nAlex Hales had endured a taxing winter to date, sitting out Bangladesh because of security fears after losing his Test place and then breaking his hand on the new-year trip to India. But after six white-ball matches on the sidelines, he returned with a man-of-the-match century as England completed the whitewash in style in Bridgetown - leaving little doubt that he is the man to partner Jason Roy.\n3 West Indies have a long way to go\nStuart Law\nCoach Stuart Law rightly identified “glimpses” of encouragement after the hosts pushed England in Antigua before running badly out of steam in Barbados. Dropped catches, and evident frailty at the top of the order, both cost the Windies dear. Ultimately, despite winning three tosses to offset the gulf, a vastly inexperienced line-up was outclassed by opponents who are scarcely recognisable from their own hapless displays at the last World Cup. England can begin to dream of not just a second but possibly a third global trophy over the next two years. For West Indies, already on the outside looking in this summer, it will be a triumph of sorts if they manage to qualify for the second of those tournaments, the ICC World Cup in 2019.\n4 Jos Buttler needs to find some form\nJos Buttler\nBefore they even arrived in the Caribbean, England prescribed an extended Indian Premier League campaign for their supremely-gifted wicketkeeper-batsman. After Buttler took his white-ball aggregate to 88 runs in eight innings so far this year, it may be just what he needs to be performing at a world-class level with Mumbai Indians but away from the spotlight of his native supporters on international duty.\n5 Stokes can still blow\nBen Stokes\nBen Stokes had his moment of payback on Carlos Brathwaite, for the mauling which won last year’s ICC World Twenty20 for West Indies with four successive sixes in Kolkata, when he had his fellow all-rounder lbw on DRS with the only ball he bowled at him all series. Of at least equal note, though, was that Stokes - no stranger to the occasional on-pitch disciplinary issue of late - was evidently riled afterwards by Jonathan Carter, to the extent that both he and captain Eoin Morgan were spoken to by the umpire. There appeared little need to become embroiled in any such exchange with the opposition while England were coasting to victory.","url":"https://www.dailymail.co.uk/wires/pa/article-4300752/5-things-learned-England-s-ODI-tour-West-Indies.html"}
