{"authors":[],"date_download":"2018-10-30 20:04:16","date_modify":"2018-10-30 20:04:16","date_publish":"2016-12-19 00:08:00","description":"Running backs Devonta Freeman and Tevin Coleman powered a fast start as the Falcons bullied the outm...","filename":"data/vaneerConsumption/5thingswelearnedfromFalconsvictoryagainst49ers.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/18/Images/121916%20falcons%20photos%20CC12.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_things-lear_c001ed6c19331921ddc31ec4e86cce51__1540929856.html","title":"5 things we learned from Falcons’ victory against 49ers","title_page":"5 things we learned from Falcons’ victory against 49ers","title_rss":"NULL","source_domain":"ajc.com","text":"Running backs Devonta Freeman and Tevin Coleman powered a fast start as the Falcons bullied the outmanned San Francisco 49ers on their way to a 41-13 victory on Sunday.\nThe Falcons’ march back to the playoffs continued before a festive crowd of 70,164 fans at the Georgia Dome.\nFreeman, running with authority, carried the ball 20 times for 139 yards and three touchdowns. It was the third time in his career he has rushed for three touchdowns in a game. Coleman added 58 yards on 13 carries.\n“I think we did a good job running the ball,” Freeman said. “The offensive line did a good job blocking and creating lanes, Patrick DiMarco (too).”\nFreeman broke loose after he was stuffed for 6 yards on six carries last week by the Rams.\n“Just believing in each other,” Freeman said. “That’s the key. Going out there and executing whatever the coaches call and do what we are capable of. When we play as a unit, I feel like we are unstoppable.”\nOverall, the Falcons amassed a season-high 248 rushing yards on 41 carries against the 49ers.\n“It was good to see our offensive line and the run game take control of this game like they did today,” Falcons coach Dan Quinn said.\nThe Falcons improved to 9-5 and ensured a winning regular-season record for the first time since the 2012 season. With Tampa Bay’s 26-20 loss to Dallas, the Falcons have a one-game lead with two games to play in the NFC South.\nIf the playoffs started today, the Falcons would be the No. 3 seed in the NFC.\nIt was San Francisco’s 13th consecutive loss as they dropped to 1-13.\nHere are the five things we learned from the win:\n1. Standard is high. Falcons quarterback Matt Ryan was efficient as he completed 17 of 23 passes for 282 yards and two touchdowns before being relieved by Matt Schaub in the fourth quarter.\n“I think it was probably the first time in my career that I hadn’t played in the end of two games in a row,” Ryan said. “That’s a good trend. That doesn’t happen very often.”\nFor the second week in a row the Falcons were playing one the weakest teams in the league.\nLast week, they Falcons jumped on the Rams and built a 42-0 lead. Against the 49ers, the Falcons didn’t play down to their level as they took care of their business early. The Falcons built a big lead with three first-quarter touchdowns.\n“When you get into December football, you better do that,” Quinn said of playing to your own level. “Knowing that every time you get a chance to go battle, you have your intent and your game right.”\n2. Quick strike. After holding the 49ers to a three-and-out, the Falcons struck quickly.\nReturner Eric Weems set the offense up with a 42-yard punt return to San Francisco’s 47-yard line.\n“Everything goes to the guys up front,” Weems said. “They did well setting up and getting their blocks. I just found the creased that they gave me.”\nFreeman, with DiMarco clearing the way, scored on a 5-yard touchdown run to cap a six-play drive.\nOn 49ers’ ensuing possession, linebacker Deion Jones forced 49ers running Carlos Hyde to fumble and safety Keanu Neal recovered at the 50.\nAfter a run for no gain, Ryan connected with Taylor Gabriel for 20 yards and Coleman ripped off a 21-yard run to the 9. After an incompletion, Ryan found Gabriel in the back of the end zone for a touchdown and a 14-0 lead.\nThe Falcons raced to 28-13 halftime lead as Freeman and Coleman combined for 140 yards from scrimmage and two touchdown on 19 touches. Wide receiver Aldrick Robinson finished with four catches for 111 yards.\n3. Scoring record. Ryan’s 9-yard touchdown pass to tight end Austin Hooper, who was injured late in the game and carted off, and Matt Bryant’s extra point made it 21-0. Those points gave the Falcons 449 this season, setting a franchise record. The previous mark of 442 was set by the 1998 team, the only team in franchise history to advance to the Super Bowl.\nRyan tied his career high in touchdown passes with 32 on the pass to Hooper. He also had 32 touchdown passes in 2012.\nIn addition to Ryan being pulled for Schaub, center Alex Mack was replaced by Ben Garland with 6:15 left to play.\n“I think it goes back to the work that we put in during the week,” left tackle Jake Matthews said. “The way that Alex gets us ready to (identify) a defense. All of that stuff is very important to what we do.”\n4. Gashing the 49ers. The Falcons cut through the 49ers’ defense rather easily.\nAfter the 49ers scored to make it 21-7, the Falcons, after an exchange of possessions, had gains of 10, 20, 29 and 20 to help set up a hard-charging 9-yard touchdown run by Freeman to make it 28-7.\nWide receiver Mohamed Sanu caught a 10-yard pass from Ryan, Robinson got loose for a 20-yard reception, Coleman slashed off the right side for a 29-yard gain and Freeman followed with a 20-yard burst to the left side.\nThe drive was typical of how the Falcons moved on the 49ers, who were back on their heels for most of the game.\n5. Injury report. The Falcons did not need any more bad injury news, but rookie linebacker De’Vondre Campbell left the game with a concussion and did not return. With less than three minutes to play, Hooper left the game with a knee injury.\nGabriel had a shoulder injury, but he later returned.\nThe Falcons played the 49ers without wide receiver Julio Jones (sprained toe), defensive end Adrian Clayborn (knee), cornerback Jalen Collins (knee), wide receiver Nick Williams (concussion) and safety Robenson Therezie (ankle).","url":"https://www.ajc.com/sports/football/things-learned-from-falcons-victory-against-49ers/qqNGdlf1Ow6FQRWBB9KvEK/"}
