{"authors":["Sadie Trombetta"],"date_download":"2018-10-31 01:49:09","date_modify":"2018-10-31 01:49:09","date_publish":"2018-09-06 14:00:52","description":"It’s heartbreaking to admit, but over the last few years, I have been going through a long and painful bookish breakup with something I once thought was the reading love of my life: mysteries and thrillers. Luckily, however, thrillers and I have…","filename":"data/vaneerConsumption/5ThrillersMysteriesThatMadeMeFallInLoveWithTheGenreAgain.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/efaffcd2-edd2-4d40-84af-d13f9d63aefa-pjimage-8.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_5-thrillers-mysteries-that-made-me-fall-in-love-with-the-genre-again-11477242_1540950549.html","title":"5 Thrillers & Mysteries That Made Me Fall In Love With The Genre Again","title_page":"5 Thrillers & Mysteries That Made Me Fall In Love With The Genre Again","title_rss":"NULL","source_domain":"bustle.com","text":"It’s heartbreaking to admit, but over the last few years, I have been going through a long and painful bookish breakup with something I once thought was the reading love of my life: mysteries and thrillers. Luckily, however, thrillers and I have begun patching things up again, thanks in part to some truly incredible books that made me fall for the genre all over again.\nIt was my mother who handed me my first thriller novel, a book by the Queen of Suspense herself, Mary Higgins Clark. I can still remember that first time feeling utterly hooked by a book, of being so intrigued with the story that the world around me just faded away until there was nothing but me and the mystery before me. To this day, I credit that experience with making me into the avid reader and proud book-lover I have become. If it weren’t for that early introduction to mysteries and thrillers, I may not have found my favorite hobby, one that I have been lucky enough to turn into a satisfying and utterly rewarding career.\nSomewhere along the line, though, I fell out of love with the genre that helped transform me into the proud bibliophile I am today. Maybe it was the pressure in college to read more Literature with a capital L, or the fact that thrillers are misjudged as being too simple and too commercial to be considered anything other than guilty pleasures or beach reads. I can’t point a finger to the exact cause, but in my early twenties, something or someone drove a wedge between me a thrillers that lead me to avoid them for years.\nThe thing is, though, I don’t think I ever stopped enjoying the genre, I think I just let the world of book-shaming pressure me into giving up something I truly loved. After all, it was thrillers that showed me how much fun reading could be, that taught me the world was a dangerous place for women, and that proved to me they could survive despite that danger. How could I ever stop loving something so crucial to shaping who I am not only as a reader, but as a woman? The truth is, I couldn’t. Like Ross and Rachel from Friends, we just needed to go on a break for me to see how much thrillers really mean to me.\nIf you, like me, have had a falling out with a genre you once enjoyed and want nothing more than to patch things up, here are the five books that made me love thrillers again. Trust me when I say, they will make you feel the same way, too.\n'The Woman in the Window' by A.J. Finn For as long as I have been a fan of thrillers, I have been a fan of Alfred Hitchcock films. That is probably why I so thoroughly enjoyed The Woman in the Window, a twisty psychological novel about a recluse living alone in New York who loves nothing more than drinking, watching old movies, and spying on her neighbors. When a new family moves in across the way, she witnesses something she shouldn’t have, and her world starts to fall apart. Was it real or did she imagine the shocking event? Read this instant bestseller and find out. Click here to buy.\n'Providence' by Caroline Kepnes Romance, suspense, and a hint of the supernatural? How could I not fall in love with Caroline Kepnes’s latest thriller, Providence? A gripping narrative about two best friends and soulmates torn apart by a kidnapping and its mysterious consequences, this captivating novel served as the perfect reminder that the thriller genre has so much to offer. Click here to buy.\n'Still Lives' by Maria Hummel Before Reese Witherspoon made it her August book club pick, this readers fell head-over-heels for Maria Hummel’s captivating thriller Still Lives. A pulsating mystery about a famous artist who goes missing on the opening night of her biggest exhibit yet, this tense narrative explores not only the dark underbelly of the Los Angeles art scene, but our culture’s disturbing obsession with violence against women, and I savored every last word of it. Click here to buy.\n'The Favorite Sister' by Jessica Knoll I may not be an avid viewer of reality television, but that didn’t stop me from devouring Jessica Knoll’s addictive thriller set in that very world. A gripping whodunit that explores the complicated themes of ambition, sisterhood, sexism, and so much more, The Favorite Sister is a truly stunning book I couldn’t help but marathon-read. Click here to buy.","url":"https://www.bustle.com/p/5-thrillers-mysteries-that-made-me-fall-in-love-with-the-genre-again-11477242"}
