{"authors":["Kristin Collins Jackson"],"date_download":"2018-10-30 23:00:40","date_modify":"2018-10-30 23:00:40","date_publish":"2014-08-14 14:00:03","description":"I'm constantly checking the ingredients on everything my parents use. I've been paranoid of their mortality since I was about 6 years old, when my father went to pick my mom up in a snowstorm. Hours after he left (well, my sister says it was more…","filename":"data/vaneerConsumption/5ToothpasteBrandsWithoutTriclosanPlusOneNaturalDIYRecipeForCarcinogenFreeFreshBreath.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/7/10/40a35da8-12d1-494a-ac7d-f07bbec95c48-getty-57204262.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35658-5-toothpaste-brands-without-triclosan-plus-one-natural-diy-recipe-for-carcinogen-free-fresh-breath_1540940440.html","title":"5 Toothpaste Brands Without Triclosan, Plus One Natural DIY Recipe For Carcinogen-Free Fresh Breath","title_page":"5 Toothpaste Brands Without Triclosan, Plus One Natural DIY Recipe For Carcinogen-Free Fresh Breath","title_rss":"NULL","source_domain":"bustle.com","text":"I'm constantly checking the ingredients on everything my parents use. I've been paranoid of their mortality since I was about 6 years old, when my father went to pick my mom up in a snowstorm. Hours after he left (well, my sister says it was more like seven minutes), I began to have a serious panic attack and imagined all the horrors that were happening on the dark snowy roads in New Hampshire. I planned their funeral, picked out all the things I wanted of theirs, and told my sister she could have the house in the 15 minutes that they were gone. When my mother walked in the door, I cried so hard that I vomited all over myself — that was kind of my thing when I was small.\nFortunately, I've eased up on panicking when they don't answer my texts or calls. Although, I do find myself babying them more than ever now. \"You are too old to eat candy for dinner,\" I chastise my father, removing a bag of Swedish fish from the kitchen counter. \"You are too old to be using these harsh deodorants! Who are you trying to impress, anyway?\" I demand of my mother, as if with age you stop wanting to smell good. Yup, I'm truly obnoxious and, as someone who lies about my smoking and drinking habits to them, quite a hypocrite as well. Recently, I have a new culprit to fixate on. As my trip home grows closer, I've already sent out several emails to my parents, warning them to get rid of this harsh chemical to avoid me resorting to a childlike tantrum: triclosan.\nTriclosan is finally getting more criticism in the press. It's highly toxic to humans and animals at even small levels. Studies are coming out monthly regarding the link to triclosan and cancer cell growth, disrupted development in children and dermatitis. It's found in hand soaps, surgical cleaners, toys, and toothpaste. Oh . . . what's that? Toothpaste?? You mean like the kind I put in my mouth? Nah, I'm not about that life and no mother or father of mine will be putting triclosan on their teeth. Originally, this compound was found safe as an antibacterial and anti-fungal chemical that had additional cleaning benefits. Sites like Beyond Pesticides have stated that there is no increased health benefit to triclosan — in fact it puts our health at risk.\nWhat's more troublesome is the accused link between triclosan and dioxins. Let me tell you something about dioxins: We are all exposed to them on a daily basis. Dioxins are environmental pollutants (Persistent Organic Pollutants or POPs) that are present in our food, most commonly in meats and dairy. According to Beyond Pesticides, because of the highly toxic nature of these pollutants they are regulated before the food touches are lips to decrease the amount of human exposure. So basically, when you eat some beef stew (is that a thing?) and then brush your teeth with a toothpaste that has triclosan in it, you are basically throwing a middle finger up to the FDA that was kind enough to regulate your exposure to dioxins.\nAccording to sources at Bloomberg News, the studies on triclosan are so overwhelming that retailers are demanding certain brands remove the chemical from their products. Guys, even Walmart is trying to get this shit removed. I'll pause for you to reflect on the fact that it's that bad. Fortunately, while we let these giant companies go toe to toe in the media, we have healthy alternatives that will keep our teeth bright, healthy, and strong.\nThe following brands are Kristin-Approved — plus a bonus DIY toothpaste recipe:\nI can't stress enough that, despite how cute I look in a lab coat, I am, in fact, not a scientist. But I'm fairly certain that if you are looking for a strong antibacterial and anti-fungal agent to replace triclosan you don't have to look too far beyond nature. Tea tree oil can be your new bestie. It's highly anti-fungal, so much so that it is a natural fungal infection killer, and it has high antiseptic qualities that have been used for thousands of years. Here is what you need for my take on Wellness Mama's DIY toothpaste recipe:\nYou'll add your powders together first and then just add about two drops of tea tree oil and a few drops of rosemary essential oil. These oils are highly potent and a little goes a long way. Mix in your coconut oil (I like to use raw coconut oil in its hardened state) so that the texture is nice and whipped. The rosemary will make the baking soda and calcium powder less harsh and add some serious teeth benefits. Rosemary is known to kill bad breath and germs, plus it promotes healthy gums. Baking soda is a natural cleaner that has brightening and cleansing properties. The calcium is added for demineralization of the teeth and to prevent teeth decay.\nBonus Tip: Even though this DIY toothpaste is au naturale, please resist any urges to eat it. Tea trea oil should never be consumed.\nImage: Giphy; Kristin Collins Jackson","url":"https://www.bustle.com/articles/35658-5-toothpaste-brands-without-triclosan-plus-one-natural-diy-recipe-for-carcinogen-free-fresh-breath"}
