{"authors":[],"date_download":"2018-10-30 18:36:24","date_modify":"2018-10-30 18:36:24","date_publish":"2016-10-14 22:22:00","description":"DeKalb County is home to a variety of quirky attractions, including The Monkey from Mars, which was actually a regular monkey who didn't fall from space.","filename":"data/vaneerConsumption/5weirdandgreatroadsideattractionsinDeKalb.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/14/Images/monkey%20mars.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_actual-factual-d_10d6395cb2e78e08799edbe68bc29a8b__1540924584.html","title":"5 weird (and great) roadside attractions in DeKalb","title_page":"5 weird (and great) roadside attractions in DeKalb","title_rss":"NULL","source_domain":"ajc.com","text":"This is \"Actual Factual DeKalb,\" a regular column in which I answer reader questions about goings-on and history in DeKalb County.\n-\nHello, DeKalb. You’ve sent some great questions since this feature got started. I’ve got a couple in the hopper, have no fear. But in the meantime, a topic piqued my interest. So I have a question for you:\nWanna get weird?\nYou’re too late.\nActually, I have to level with you: You’re a weirdo, DeKalb. An odd duck. A strange bird. An oddball. A fruitcake. No, no. I'm sorry. An eccentric. That’s the good kind, right?\nThe evidence is all around.\nWith that in mind, I came up with a list of notable (and glorious) quirks you can visit just down the road.\n1. The Monkey from Mars, the Georgia Bureau of Investigation Crime Lab Museum, 3121 Panthersville Road, Decatur:\nBack in 1953, three young men – two barbers and a butcher – called the cops to say they found a Martian flying saucer outside Austell. Worse, they accidentally ran over one of the occupants.\nThey got their picture in the paper with the shriveled dead creature, which the police let them keep, apparently not knowing what to do with it.\nBut, of course, it turned out it was just a story. Of the hoax variety. “One of the greatest ever perpetrated in the Atlanta area,” The Atlanta Constitution said.\nThe Martian was a monkey.\nThe men had made up the story over a card game and carried it out by buying a $50 monkey at a pet store. They killed it with chloroform and stripped its hair, according to Constitution archives.\nThe creature remains preserved in a jar at the GBI Crime lab museum. You can visit by calling 404-270-8525 to make an appointment.\n2. Wal-mart mausoleum, Wal-mart, 3580 Memorial Drive, Decatur:\nThe Crowley family owned the land long before the big-box store came.\nStarting in 1960, the land was parceled off for various projects, including a mall.\nThere was concern about the family members who’d been buried on the homestead. Developers agreed to leave the graves safe from the coming growth, which finally resulted in the creation of a mausoleum.\nToday, it stands out proud – if a bit out of place – in the back of the parking lot.\n3. Waffle House Museum, 2719 East College Ave., Avondale Estates:\nThe first Waffle House was built in 1955 here. Two neighbors, Joe Rogers Sr. and Tom Forkner (yes, as in fork...), figured Avondale Estates needed a 24-hour restaurant.\nWe all know what happened next, of course. Waffle Houses sprang up everywhere and became an institution, a destination for about anyone from families to late night boozers hoping food can stave off the hangover from the party.\nThe original location has been restored and features Waffle House “memorabilia” from the past 60 years.\n4. Tiny Doors ATL, Little Shop of Stories, 133 East Court Square, suite A, Decatur:\nThis inventive art project aims to “bring big wonder to tiny spaces,” and does so by installing miniature doors at sites around the Atlanta area.\nThey’ve shown up at the Krog Street Tunnel, near the Historic Fourth Ward Skatepark on the Atlanta Beltline and in Decatur at Little Shop of Stories.\n“The door is an accessible symbol to a broad audience,” Sarah Meng, one of the artists, told The AJC last year. “The size of the door enables us to … invite them into curiosity and wonder.”\n5. David J. Sencer CDC Museum, 1600 Clifton Road NE, Atlanta:\nEver visit a museum and feel like it’s missing something? Ever feel like that something is an intricate and accurate historical perspective on swine flu?\nMe too.\nWhich is why I was glad to learn about the museum at The CDC.\nIt showcases how “CDC scientists merge old-fashioned detective work with high-tech science to crack the cases of mystery diseases,” the website says.\nIt’s free and gets more than 90,000 visitors a year. Where have we been?\n— I am a staff writer with the AJC and a proud DeKalb County resident. To submit “Actual Factual DeKalb” questions, contact me at joshua.sharpe@ajc.com, @JoshuaWSharpe on Twitter or via the form below.","url":"https://www.ajc.com/news/local/actual-factual-dekalb-have-you-ever-seen-the-monkey-from-mars/g1I3Kh0cB1C8DukKws7P0H/"}
