{"authors":["John Nolte"],"date_download":"2018-10-30 21:48:26","date_modify":"2018-10-30 21:48:26","date_publish":"2015-08-28 14:54:03","description":"Sixty years ago today, Emmett Till, a 14 year-old black teenager from Chicago whistled at a white woman in Mississippi while on vacation with his family. |","filename":"data/vaneerConsumption/60YearsEmmettTillsMemoryDesecratedByTrayvonMartinFergusonRaceHoaxers.json","image_url":"https://media.breitbart.com/media/2015/08/otemmetttill2004.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_28__1540936106.html","title":"60 Years: Emmett Till's Memory Desecrated By Trayvon Martin/Ferguson Race Hoaxers","title_page":"60 Years: Emmett Till's Memory Desecrated By Trayvon Martin/Ferguson Race Hoaxers | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Sixty years ago today, Emmett Till, a 14 year-old black teenager from Chicago whistled at a white woman in Mississippi while on vacation with his family. The woman was 21 year-old Carolyn Bryant. At the time she was working behind the counter of her family’s grocery store.\nTill’s family understood what the young man did not: that in 1955 Mississippi this perfectly innocent whistle was a potential death sentence. They rushed Emmett out of there but three days later Carolyn Bryant’s husband and his brother found Emmett asleep, took him from his bed in the middle of the night, and later brutally murdered him.\nA few months later, both men were acquitted by an all-white jury.\nTo those of us who didn’t come of age during this time, this America is unimaginable today, especially now that we live in a country where our shrill media shrieks “Hate Crime!” after Donald Trump dares put the words “silent” and “majority” together; especially in a country where Barack Obama is just finishing up his second failed term as President of the United States.\nNevertheless it is important to remember America’s past. It is important to take pride in how far we’ve come in such a short time. It is also important to remember that the same Democrats who created the segregated South that denied justice to Emmett Till and his family are the same Democrats who today balkanize blacks in a different way but for the same mercenary purposes.\nThanks to Till’s brave family and a once-righteous Civil Rights Movement, Emmett Till’s murder was not in vain and will hopefully never be forgotten.\nWhat should also never be forgotten is how our mainstream media and activist Democrats (like Obama’s attorney general Eric Holder) have desecrated the memory of Emmett Till by raising his name to perpetuate one shameless national race hoax after another.\nA Hispanic man shooting Trayvon Martin in self defense has as much to do with the racist murder of Emmett Till as a ham sandwich.\nA police officer in Ferguson shooting and killing strong-arm robber Michael Brown in self-defense has as much to do with Emmett Till as a lawnmower.\nThere is a special place in Hell for race hoaxers, but most especially these race hoaxers.\nFollow John Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/politics/2015/08/28/60-years-emmett-tills-memory-desecrated-by-trayvon-martinferguson-race-hoaxers/"}
