{"authors":["Maggie Mcneary"],"date_download":"2018-10-30 22:10:21","date_modify":"2018-10-30 22:10:21","date_publish":"2017-03-27 00:00:00","description":"A central Arkansas man is accused of shooting at another driver Saturday afternoon after cutting him off.","filename":"data/vaneerConsumption/67yearoldcentralArkansasmanaccusedofcuttingoffdriveronI30shootingathimlater.json","image_url":"https://media.arkansasonline.com/img/photos/2017/03/27/Screen_Shot_2017-03-27_at_9.51.36_AM_t600.png?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_mar_27_central-ar_4c0324ad759ffd4bbbccc8594fa77025__page=1_1540937421.html","title":"67-year-old central Arkansas man accused of cutting off driver on I-30, shooting at him later","title_page":"67-year-old central Arkansas man accused of cutting off driver on I-30, shooting at him later","title_rss":"NULL","source_domain":"arkansasonline.com","text":"A central Arkansas man is accused of shooting at another driver Saturday afternoon after cutting him off.\nPolice said a 30-year-old Little Rock man told them that Larry White, 67, of Mabelvale cut him off at the Alexander exit on I-30 and shot at him a little after 4 p.m. Saturday.\nAfter leaving the interstate, White pulled over at in the 10000 block of I-30, and the 30-year-old parked behind him, according to a Little Rock Police Department report.\nThe driver told officers that White jumped out of the car and fired two shots at him with a black handgun, police said. After shooting, White walked to the passenger's-side door of his car and pulled out another gun, according to the report.\nWhite pointed both guns at the victim and took cover behind his passenger door, then got in his car and drove off, the report said. The 30-year-old said he attempted to follow White’s car but lost it.\nPolice said no one was injured in the shooting, and the driver's car was not hit by any bullets. A witness said he saw White pointing a gun at a “black guy” who was standing behind a black vehicle yelling “don’t do this.”\nWhite surrendered to officers, the report said. White’s wife allowed police to search their home, where they found a gun hidden under a white bucket in the garage, authorities said.\nWhite was charged with two counts of aggravated assault and taken to Pulaski County jail, where he is being held without bail.","url":"https://www.arkansasonline.com/news/2017/mar/27/central-arkansas-man-accused-firing-shots-another-/?page=1"}
