{"authors":["Associated Press"],"date_download":"2018-10-23 03:10:45","date_modify":"2018-10-23 03:10:45","date_publish":"2016-01-28 18:32:38","description":"LONDON (AP) — A British court on Thursday cleared six brokers of trying to fix the benchmark interest rate known as Libor, the London interbank offered rate....","filename":"data/vaneerConsumption/6brokersclearedofmarketraterigginginUK.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421332_6-brokers-cleared-market-rate-rigging-UK_1540264245.html","title":"6 brokers cleared of market rate-rigging in UK","title_page":"6 brokers cleared of market rate-rigging in UK | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"6 brokers cleared of market rate-rigging in UK\nLONDON (AP) — A British court on Thursday cleared six brokers of trying to fix the benchmark interest rate known as Libor, the London interbank offered rate.\nThe six men had been accused of helping convicted banker Tom Hayes manipulate the Libor rate — the key rate that banks use to borrow money from each other — over four years.\nHayes was sentenced to 14 years in prison last year for manipulating the rate while working at UBS and Citigroup between 2006 and 2010. He was the first to be convicted by a British jury of Libor rigging, but he said he was made a scapegoat for a common practice.\nFive of the brokers — Noel Cryan, Danny Wilkinson, Colin Goodman, James Gilmour and Terry Farr — were cleared of conspiracy to defraud Wednesday after a four-month trial. The sixth, Darrell Read, from New Zealand, was cleared Thursday amid applause in the London courtroom, where the other accused hugged each other and cheered from the public gallery.\n\"It feels like they were trying to go after the little guys and to make an example of us,\" Cryan told reporters.","url":"https://www.dailymail.co.uk/wires/ap/article-3421332/6-brokers-cleared-market-rate-rigging-UK.html"}
