{"authors":["Carolyn De Lorenzo"],"date_download":"2018-10-31 01:41:20","date_modify":"2018-10-31 01:41:20","date_publish":"2018-09-14 19:15:55","description":"If you’re recovering from an injury, you’ll probably need a period of downtime and rest in order to heal up — which, for anyone who's used to regular workouts, can be kind of frustrating. It’s never a good idea to push an injured area too hard, but…","filename":"data/vaneerConsumption/6ExercisesToTryWhenYoureInjuredAccordingToExperts.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/c2e4ca42-af03-407d-a7ae-e52a7c12cfad-zaeh_bustle_apr2016-331.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_6-exercises-to-try-when-youre-injured-according-to-experts-11875391_1540950080.html","title":"6 Exercises To Try When You're Injured, According To Experts","title_page":"6 Exercises To Try When You're Injured, According To Experts","title_rss":"NULL","source_domain":"bustle.com","text":"If you’re recovering from an injury, you’ll probably need a period of downtime and rest in order to heal up — which, for anyone who's used to regular workouts, can be kind of frustrating. It’s never a good idea to push an injured area too hard, but some movements can be therapeutic. Knowing which types of exercise to do when you’re injured can help keep you moving safely, while allowing your injury time to mend.\n\"\"Every form of exercise, from boxing to tai chi, is a form of stress on your body. Ideally, the stress is appropriate enough that it [...] results in your muscles and tissues getting stronger\" over time, movement scientist Gregory Gordon, teaching fellow for the Cybex Research Institute, and founder of Exercise-Intelligence in Manhattan, tells Bustle via email. Recovering well from an injury tends to hinge on what type of injury you have, while also making sure that your fitness plan during the healing process and post-injury is right for your individual needs, Gordon says.\nDr. Armin Tehrany, founder of Manhattan Orthopedic Care, tells Bustle via email that \"Depending on the type of injury [you have], active rest and non-weight bearing workouts are best as they promote healing.\"\nWhile it will take some time to get back up to speed with your fitness routine post-injury, and you should always check in with your doctor to make sure you're clear for certain movements, here are six exercises to try when you’re injured, that can help keep you active and assist your recovery, according to experts.\n1 Walking Gonzalo Arroyo Moreno/Getty Images Sport/Getty Images Walking is one of the simplest and best forms of exercise, and can be a great way to stay active when you're injured. According to Active, walking is a good choice if you're recovering from neck or upper body injuries. Dr. Tehrany also notes that walking is a \"low-impact exercise that allows you to work your muscles as you gradually heal and get back to 100 percent.\"\n2 Stretching VCG/Getty Images News/Getty Images Stretching can help keep your body limber while you're injured. Per Verywell Health, tight muscles contribute to back and neck pain, so keeping these muscle groups loose can help reduce discomfort — bearing in mind that you never want to stretch an inflamed or injured area. Gordon also suggests, however, that stretching alone won't solve an underlying structural issue going on in your body. In certain cases, muscles are \"tight for protective reasons,\" Gordon says, so make sure you're being treated for any chronic injuries or issues if you're experiencing ongoing muscle tightness.\n3 Stationary Bike Al Messerschmidt/Getty Images Sport/Getty Images If you have plantar fasciitis, or upper body or back injuries, exercising carefully on a stationary bike can be a great way to get some cardio in while you recover, according to Active. Just make sure to check with your doctor or physical therapist to make sure cycling is a good choice for you.\n4 Aqua Jogging Mark Wilson/Getty Images News/Getty Images Dr. Tehrany suggests, \"Light swimming or 'aqua jogging' is another great low-impact exercise that can help you work your muscles during recovery.\" The Guardian notes that aqua jogging is a great way to stay fit while injured, while offering a safe form of resistance training for those who need to avoid high-impact routines.\n5 Isometric Exercises Andrew Zaeh for Bustle Verywell Health notes that isometric exercises, or exercises where you just contract your muscles, are often used in physical therapy for injury rehabilitation. Mike Septh, trainer with Aaptiv tells Bustle via email that gradually building up strength and resistance within an injured area, \"can [help create] a stronger neuromuscular connection through the incorporation of external force or resistance.\" Septh recommends that focusing on floor-based and standing isometric exercises and holds first, post-recovery, and then moving on to \"adding external forces such as resistance bands and medicine balls,\" as a next step.\n6 Yoga Drew Angerer/Getty Images News/Getty Images Yoga can be a great addition to your injury-healing routine. Dr. Tehrany recommends yoga during recovery as a way to \"release muscle tension and discomfort where you feel pain. As a result, your body will feel energized, and you'll feel an increased mobility overall.\" Just remember to check with your doctor or physical therapist to make sure your yoga series is modified for your specific recovery needs. Some poses may not work for you when you're injured.","url":"https://www.bustle.com/p/6-exercises-to-try-when-youre-injured-according-to-experts-11875391"}
