{"authors":["Scott Neuman"],"date_download":"2018-10-23 05:47:19","date_modify":"2018-10-23 05:47:19","date_publish":"2014-12-07 00:00:00","description":"Four Syrians, one Tunisian and one Palestinian were released to the South American country early today as part of a deal to reduce the inmate population at the controversial prison.","filename":"data/vaneerConsumption/6GitmoDetaineesTransferredToUruguayUSSays.json","image_url":"https://media.npr.org/assets/img/2014/12/07/34162101_h33271933_wide-059bc361083d916e8c53957f64c5e901aadc4e27.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2014_12_07_369112460_6-gitmo-detainees-transferred-to-uruguay-u-s-says_1540273639.html","title":"6 Gitmo Detainees Transferred To Uruguay, U.S. Says","title_page":"6 Gitmo Detainees Transferred To Uruguay, U.S. Says : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"6 Gitmo Detainees Transferred To Uruguay, U.S. Says\nEnlarge this image toggle caption Walter Michot/MCT/Landov Walter Michot/MCT/Landov\nUpdated at 2:10 p.m. ET\nSix men long detained at Guantanamo Bay – four Syrians, one Tunisian and one Palestinian – were transferred this morning to Uruguay in a deal forged by the White House to reduce the inmate population at the controversial prison, which President Obama has promised to close.\nThe New York Times says the move represents \"the largest single group of inmates to depart the wartime prison in Cuba since 2009, and the first of the detainees to be resettled in South America. \"\nThe U.S. government announced the release of the six, who have been held at Guanatamo for the past 12 years.\nThe Pentagon said it \"transferred custody\" of three other Pakistani detainees held in Afghanistan, to Islamabad.\n\"This followed consultations between the United States and Pakistan and after receiving appropriate assurance, the headquarters of U.S. Forces in Afghanistan said in a statement. \"The Government of the Islamic Republic of Afghanistan was not involved in this transfer.\"\nPakistani Taliban chief Latif Mehsud was one of the three, sources said.\nThe Associated Press says:\n\"All were detained as suspected militants with ties to al-Qaeda in 2002 but were never charged. They had been cleared for release since 2009 but could not be sent home and the U.S. struggled to find countries willing to take them. \"Uruguayan President Jose Mujica agreed to accept the men as a humanitarian gesture and said they would be given help getting established in a country with a small Muslim population.\"\nReuters adds:\n\"Differences over the pace of such transfers, said one U.S. official, added to friction between Defense Secretary Chuck Hagel and Obama's inner circle, culminating in Hagel's resignation last month. \"The release of the six was put off again in August when Uruguay became concerned about domestic political risks in the run-up to its October presidential election. But outgoing President Jose Mujica then pressed ahead with the transfer.\"\nAccording to the Times:\n\"The transfer included [Abu Wa'el Dhiab, a 43-year-old Syrian] who has been on a prolonged hunger strike to protest his indefinite detention without trial, and who has brought a high-profile lawsuit to challenge the military's procedures for force-feeding him. His release may moot most of that case, although a dispute over whether videotapes of the procedure must be disclosed to the public is expected to continue. \"The transfer was also notable because the deal has been publicly known since it was finalized last spring. Significantly, however, bureaucratic delays by Secretary of Defense Chuck Hagel in signing off on the arrangement placed it in jeopardy. Mr. Hagel's slow pace this year in approving proposed transfers of low-level detainees contributed to larger tensions with the White House before his resignation under pressure last month.\"\nThe AP says the U.S. has transferred 19 prisoners from Guantanamo this year, all but two of them within the past month. With the release of the six today, the prison still holds some 136 detainees, according to AP, while the Times says the number is 137.","url":"https://www.npr.org/sections/thetwo-way/2014/12/07/369112460/6-gitmo-detainees-transferred-to-uruguay-u-s-says"}
