{"authors":["Kadeen Griffiths"],"date_download":"2018-10-30 22:26:50","date_modify":"2018-10-30 22:26:50","date_publish":"2014-08-15 16:53:07","description":"People sure seem to have a weird hang-up about the word feminist. When Shailene Woodley claimed she wasn't a feminist, my love for her kind of took a hit — at least until I realized that Woodley was a feminist. She just, like a lot of celebrities,…","filename":"data/vaneerConsumption/6JosephGordonLevittMoviesThatProveHeWasaFeministAllAlong.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/caee9074-01e8-4c3f-b401-ba0d4f78e425.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35939-6-joseph-gordon-levitt-movies-that-prove-he-was-a-feminist-all-along_1540938410.html","title":"6 Joseph Gordon-Levitt Movies That Prove He Was a Feminist All Along","title_page":"6 Joseph Gordon-Levitt Movies That Prove He Was a Feminist All Along","title_rss":"NULL","source_domain":"bustle.com","text":"People sure seem to have a weird hang-up about the word feminist. When Shailene Woodley claimed she wasn't a feminist, my love for her kind of took a hit — at least until I realized that Woodley was a feminist. She just, like a lot of celebrities, doesn't really know what the word means and has bought into the negative stereotype affixed to it. Thankfully, there are some celebrities, like Beyoncé, like Amy Poehler, like Lena Dunham, who not only know the proper definition of the word feminism but who also aren't afraid to stand up and proudly declare themselves to be feminists. Surprisingly, or unsurprisingly all things considered, Joseph Gordon-Levitt considers himself a proud feminist as well.\n\"If you look at history, women are an oppressed category of people,\" said Gordon-Levitt in an interview with The Daily Beast. \"There’s a long, long history of women suffering abuse, injustice, and not having the same opportunities as men, and I think that’s been very detrimental to the human race as a whole. I’m a believer that if everyone has a fair chance to be what they want to be and do what they want to do, it’s better for everyone.\"\nPreach. Of course, we should have picked up on the signs before now that Gordon-Levitt is a supporter of feminism. It's not just in his interviews; it's also in his movies. Some of them are hiding feminist themes that can be a little hard to pick up on, even if it's just in the fact it has well-developed female characters. (You'd be shocked at how many movies can't brag that.) Watch these six movies again and you'll realize that Gordon-Levitt has been a not-so-secret feminist this entire time.\n(500) Days of Summer\n(500) Days of Summer is a movie that has been misinterpreted by most of the audience since it came out. Contrary to popular belief, it's not the story of a poor guy who has his heart put through the meat grinder by a quirky girl named Summer. It's actually about a guy who projects a series of unrealistic fantasies on a girl who is unwilling and unable to live up to them and then replaces her with a new girl — Autumn — as soon as she's gone. Essentially, it's a cautionary tale to guys about the difference between fantasy and reality and how you have to take women as they are instead of as you wish they were.\n10 Things I Hate About You\n10 Things I Hate About You is a quintessential high school bet movie that was based off a Shakespeare play called Taming of the Shrew, which doesn't really bode well for feminism. Somehow it became less about making Kat Stratford more docile and more about both Stratford girls learning to think about other people (in Bianca's case, to think about anyone else, and in Kat's case, to think about Bianca). Besides, Kat Stratford is basically a feminist icon, so it's no surprise Gordon-Levitt was in this movie.\nDon Jon\nOK, so Don Jon is about a guy who calls himself, well, Don Jon and is addicted to pornography despite all of the sex he has outside of it. However, the movie does a good job of contrasting, and adding complexity, to his two lovers, Barbara and Esther. While Barbara is a controlling romantic who dumps Jon as soon as she finds out about his porn addiction, Esther is an understanding widow who helps him figure out exactly what it is about real-life sex that he finds so unsatisfying. Don Jon gets points for not painting female sexuality — or sexuality in general really — as a shameful or unsavory thing. Porn addiction is a problem; enjoying sex is not.\nInception\nInception only has two named female characters, but it makes very good use of them. As soon as Ariadne joins the team, brought in as the newcomer to ask all the questions that the audience needs answers to, she is treated as an equal by all the other team members who basically have to trust her with their lives considering how integral her architectural skills are to their mission. And Mal — or rather Cobb's fictional version of Mal — is perhaps the most complex character in the entire film, a dangerous, seductive anti-villain who is so much more than the archetypical Deceased Ex-Lover the White Male Lead Angsts Over.\n50/50\n50/50 is more about cancer and friendship than it is about feminism, but who's to say that it can't be about all three? After Adam's girlfriend cheats on him due to an acute inability to handle his cancer diagnosis, he finds himself growing closer to his young and inexperienced therapist Katherine. However, Katherine is more than just a love interest. She is a three-dimensional character with thoughts, feelings, and an integral plot role of her own. By the end of the film, she and Adam are only going on their first date because the film was never about getting the girl and Katherine was always a therapist first.\nThe Dark Knight Rises\nTo be honest, it wasn't really difficult to be more female-friendly than The Dark Knight which, for all its strengths, pretty much only had the character of Rachel Dawes around for Batman to pine over and then angst over when she was killed. It's probably no coincidence that the same film that introduced Gordon-Levitt as John Blake also introduced Talia al Ghul and, more importantly, Catwoman. Two female characters in the main cast? Both of them kicking ass and taking names? We should just start bookmarking Gordon-Levitt's filmography if we want to watch films that treat their female characters well. But what else would we expect from a proud feminist like him?\nImage: for-reasonsunknown, heathledgers, wedoitbetta, brucieboy297, 500daysoftom-hansen, comics-watchtower/Tumblr","url":"https://www.bustle.com/articles/35939-6-joseph-gordon-levitt-movies-that-prove-he-was-a-feminist-all-along"}
