{"authors":["Associated Press"],"date_download":"2018-10-23 03:09:57","date_modify":"2018-10-23 03:09:57","date_publish":"2016-01-11 15:51:24","description":"ABUJA, Nigeria (AP) — Militants from opposing political parties killed two soldiers and four police officers in shootouts after the governor of Nigeria's oil...","filename":"data/vaneerConsumption/6killedasoppositionwinselectionforgovernorinNigeria.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3394065_6-killed-opposition-wins-election-governor-Nigeria_1540264197.html","title":"6 killed as opposition wins election for governor in Nigeria","title_page":"6 killed as opposition wins election for governor in Nigeria | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"6 killed as opposition wins election for governor in Nigeria\nABUJA, Nigeria (AP) — Militants from opposing political parties killed two soldiers and four police officers in shootouts after the governor of Nigeria's oil-rich Bayelsa state was declared the winner of elections there, an election monitor said Monday.\nSaturday's election was a rerun because of violence, ballot box theft and fraud that marred Dec. 5 balloting. Incumbent Governor Dickson Seriake of the People's Democratic Party easily won the vote in the southern state that is home to former President Goodluck Jonathan, who was defeated in March elections by former military dictator Muhammadu Buhari.\nPhilip Okolo of the Society for Peace Studies and Practice said that militants hours later were involved in a shootout and that he saw several people killed, including two soldiers and four police officers.\nIn a separate development, the army announced that an independent board of inquiry has recommended action be taken against nearly 100 officers and soldiers accused of unprofessional and partisan conduct during the 2015 general and presidential elections.\nA statement from army spokesman Col. Sani K. Usman did not specify allegations but at the time Buhari's party charged soldiers were acting to influence the election in favor of Jonathan and his party.","url":"https://www.dailymail.co.uk/wires/ap/article-3394065/6-killed-opposition-wins-election-governor-Nigeria.html"}
