{"authors":["Carina Wolff"],"date_download":"2018-10-31 01:38:12","date_modify":"2018-10-31 01:38:12","date_publish":"2018-09-14 20:55:31","description":"When it comes to feelings of anxiety and depression, it's easy to assume they are a result of a mental health disorder — after all, that would make the most sense, right? But sometimes these issues are a side effect of another medical problem, and…","filename":"data/vaneerConsumption/6PhysicalHealthIssuesThatAreOftenMisdiagnosedForMentalHealthDisorders.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/4e69f34b-e2a5-4805-8864-defa2b7b1861-zaeh_bustle_apr2016-522.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_6-physical-health-issues-that-are-often-misdiagnosed-for-mental-health-disorders-11915804_1540949892.html","title":"6 Physical Health Issues That Are Often Misdiagnosed For Mental Health Disorders","title_page":"6 Physical Health Issues That Are Often Misdiagnosed For Mental Health Disorders","title_rss":"NULL","source_domain":"bustle.com","text":"When it comes to feelings of anxiety and depression, it's easy to assume they are a result of a mental health disorder — after all, that would make the most sense, right? But sometimes these issues are a side effect of another medical problem, and there are a number of misdiagnosed health issues that may be mistaken for mental health issues. Symptoms of mood disorders can be surprisingly similar to other health issues, and just because you noticed these changes first doesn't necessarily mean you have a mental health disorder.\n\"In some cases, diagnosis is a simple process,\" Scott Dehorty, LCSW-C, Executive Director at Maryland House Detox, tells Bustle. \"If there is a nail sticking out of your hand ... the treatment will be to remove the nail and treat the wound. Other cases are not so simple. If the presenting symptoms are lethargy, poor appetite, difficulty concentrating, increased body aches and pain, and irritability, that could be a whole host of illnesses, each with very different treatments.\"\nAlthough in some cases, your symptoms may indeed be a result of a mental health issue, there are certain medical conditions which are too often misdiagnosed. Here are six physical health disorders that get misdiagnosed as mental illness, according to experts.\n1 Thyroid Disorder Andrew Zaeh for Bustle Thyroid issues are often mistaken for anxiety or depression. \"Thyroid levels can cause havoc with mood, energy, and the general ability to enjoy life,\" says Dehorty. \"This is also what depression looks and feels like. Thyroid should always be tested when depression is thought to be an issue, since it is a simple blood test and very treatable.\"\n2 Lyme Disease Andrew Zaeh for Bustle \"[For some people with Lyme Disease,] symptoms often are identified as depression or simply an abnormal illness behavior, meaning someone is behaving as if they have a specific diagnosis,\" says Dehorty. \"Due to the size of the tic, most don’t notice the initial bite. Therein lies the problem, because the mark left by the bite is very specific and diagnostically important.\"\n3 Neuroendocrine Tumors Ashley Batz/Bustle Rare conditions such as a pheochromocytoma (a typically noncancerous adrenal tumor producing excess amounts of adrenaline), may sometimes be misdiagnosed as anxiety or panic disorder when the condition is unrecognized. \"Pheochromocytomas may also cause the symptoms of palpitations in conjunction with excess sweating, headache, and tremors,\" physician Dr. Nesochi Okeke-Igbokwe tells Bustle. When in doubt, always talk to your doctor and possibly even get a second opinion.\n4 Diabetes Ashley Batz/Bustle Type 2 diabetes development can mimic depression. \"This includes low mood, irritability, and weight loss,\" says Dehorty. However, these changes actually have to do with insulin resistance, not mental health. Oftentimes, these symptoms are also a reaction to living with the disease and the stress that comes with managing it, according to the American Diabetes Association.\n5 Chronic Fatigue Syndrome Ashley Batz/Bustle Chronic Fatigue Syndrome (CFS) is a disease characterized by extreme fatigue, loss of memory or concentration, poor sleep, and more, according to Mayo Clinic. So it should come as no surprise that it's often mistaken for something like depression. Symptoms of CFS can result personal, social, and occupational, changes in a person that can look like depression, but actually reflect another issue.","url":"https://www.bustle.com/p/6-physical-health-issues-that-are-often-misdiagnosed-for-mental-health-disorders-11915804"}
