{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:12:24","date_modify":"2018-10-30 21:12:24","date_publish":"2015-03-24 14:15:00","description":"Atlanta is the number two city in the country for waffle favorites, according to Foursquare.","filename":"data/vaneerConsumption/6PicksforChickenandWaffles.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/31/Videos/4451132.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_picks-for-chicken-and-waffles__1540933944.html","title":"6 Picks for Chicken and Waffles","title_page":"6 Picks for Chicken and Waffles","title_rss":"NULL","source_domain":"ajc.com","text":"Atlanta is the number two city in the country for waffle favorites, according to Foursquare. As as an ode to the South, we wanted to share the many ways to enjoy chicken and waffles. How do you like yours? Classic, crispy and browned, or soft and soaked in syrup. Here's 6 ways to indulge in chicken and waffles.\nChick a Biddy\n“Original Cheddar” waffle and chicken: served with honey butter and syrup, and three fried chicken tenders.\nwaffles-folkart\nFolk Art\n“Sweet potato” batter chicken waffles: topped with whiskey peach compote.\nGladys Knights Chicken and Waffles\n“Midnight Train” headliner: an original waffle with four Southern-fried chicken wings.\nNamed after Knight’s 1973 hit song.\nNana G’s Chicken & Waffles\n“The Papa G’s”: A bacon-infused Belgium waffle with 48-hour fried chicken\nNana recently celebrated her 102nd birthday. She’s still cooking up a story at her triple-digit age!\nSouth City Kitchen Midtown and Vinings\n“Buttermilk fried chicken and waffles”: Springer Mountain chicken served atop a buttermilk waffle with maple syrup.\nUrban Cannibals\n“Chicken and Waffles“ ancho espresso cornmeal dusted grilled chicken breast over sweet potato waffles topped w/ fig balsamic maple sauce. Available only Saturday and Sunday for brunch.\nchicken and waffles\nRELATED\nBreakfast or brunch? Where to find best waffles in Atlanta\nAtlanta's best Southern breakfast sandwiches\nWhat you can and can’t get at Waffle House’s only drive thru","url":"https://www.ajc.com/blog/atlanta-restaurants/picks-for-chicken-and-waffles/c0cW0rRdL2dPptOXr4WcIK/"}
