{"authors":["Associated Press"],"date_download":"2018-10-23 02:31:00","date_modify":"2018-10-23 02:31:00","date_publish":"2016-01-11 14:52:55","description":"CONCORD, N.H. (AP) — Six presidential hopefuls have found some common ground on the nation's future, according to a bipartisan group created to bridge the di...","filename":"data/vaneerConsumption/6presidentialhopefulstakeProblemSolverPromise.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:e4a029cfeaaa4ba18a7b6ec67090f4d4-56CX32zFKLb7123928b84cfdcddc-191_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3394004_6-presidential-hopefuls-Problem-Solver-Promise_1540261860.html","title":"6 presidential hopefuls take 'Problem Solver Promise'","title_page":"6 presidential hopefuls take 'Problem Solver Promise' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"6 presidential hopefuls take 'Problem Solver Promise'\nCONCORD, N.H. (AP) — Six presidential hopefuls have found some common ground on the nation's future, according to a bipartisan group created to bridge the divide between Republicans, Democrats and independents.\nNo Labels, formed after the 2010 midterm elections, is asking candidates to embrace four broad goals related to job creation, the federal budget, energy independence and entitlements, promote them in the campaign and promise to work with a bipartisan group in Congress on at least one of them within 30 days of taking office.\nTo be sure, the goals are general enough so that people of vastly different political opinions — not to mention temperaments — can get behind them.\nFILE - In this Jan. 2, 2016, file photo, Democratic presidential candidate Martin O'Malley pauses while speaking in West Des Moines, Iowa. No Labels, bipartisan group created to bridge the divide between Republicans and Democrats says six presidential hopefuls have found some common ground on the nation¿s future. On Monday, the group¿s leaders are announcing the six who stepped up: Democrat O'Malley, and Republicans Ben Carson, Chris Christie, John Kasich, Rand Paul and Donald Trump. (AP Photo/Andrew Harnik, File)\nOn Monday, the group's leaders are announcing the six who stepped up: Democrat Martin O'Malley, and Republicans Ben Carson, Chris Christie, John Kasich, Rand Paul and Donald Trump.\n\"I'm totally blown away that notwithstanding the ugly talk you find during any primary campaign, you have six very diverse candidates — a bipartisan group — who are interested in a Problem Solvers promise,\" No Labels co-chairman Jon Huntsman told The Associated Press. \"That means they're thinking beyond the primary and thinking about the process that will need to be in place to get some really important things done for the American people.\"\nThe poll-driven No Labels agenda calls for creating 25 million new jobs over the next decade, securing Social Security and Medicare for the next 75 years, balancing the federal budget by 2030 and making the United States energy secure by 2024.\nMore than 1,000 people came to the group's convention in Manchester in October, when eight candidates showed up. Volunteers have been dogging candidates at town hall forums around New Hampshire. Next week, the group will deploy several trucks adorned with billboards to serve coffee to people and enlist their interest in having more candidates make the promise.\nJoe Lieberman, the group's other co-chairman, hopes more candidates sign on.\n\"People, beginning with our supporters in New Hampshire, will be asking the candidates who didn't make the promise, why haven't you made the promise yet?\" he said. \"We tried to phrase it in a way that was broadly acceptable and that nobody would feel that they were doing anything particularly controversial by accepting these national goals that are supported so overwhelmingly by the people of New Hampshire and throughout the country.\"\nWhile the group also has staff in Iowa, which hosts the first presidential caucuses, it has mostly focused on New Hampshire, which will hold the earliest presidential primaries Feb. 9.\nFILE - In this Oct. 12, 2015, file photo, Republican presidential candidate Chris Christie speaks at a No Labels Problem Solver convention in Manchester, N.H. No Labels, a bipartisan group created to bridge the divide between Republicans and Democrats says six presidential hopefuls have found some common ground on the nation¿s future. On Monday, the group¿s leaders are announcing the six who stepped up: Democrat Martin O'Malley, and Republicans Ben Carson, Christie, John Kasich, Rand Paul and Donald Trump. (AP Photo/Jim Cole, File)","url":"https://www.dailymail.co.uk/wires/ap/article-3394004/6-presidential-hopefuls-Problem-Solver-Promise.html"}
