{"authors":[],"date_download":"2018-10-22 20:37:58","date_modify":"2018-10-22 20:37:58","date_publish":"2014-06-02 17:15:07","description":"In today’s midday post: D-Day then-and-now, a $110 million apartment and a 91-year-old runs a marathon.","filename":"data/vaneerConsumption/6SpeedReadsAmazingThenandNowPicturesFromDDay.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/481856/140602-dday-omaha-beach-1253_83eb4800a61c874b45d52dab0dcd1d10.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/nightly-news_6-speed-reads-amazing-then-and-now-pictures-d-day-n120411_1540240678.html","title":"6 Speed Reads: Amazing Then-and-Now Pictures From D-Day","title_page":"6 Speed Reads: Amazing Then-and-Now Pictures From D-Day","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\n1. Amazing Then-and-Now Photos of D-Day\nFriday marks the 70th anniversary of D-Day. That’s when the Allies launched 156,000 troops to storm the beaches of France in Operation Overlord. In memory of that day, photographer Peter Macdiarmid took modern-day pictures at war sites, originally photographed back in 1944, to show how they’ve changed over time. Check it out.\n2. What Kind of Real Estate Will $110M Buy?\nIn the market for a new apartment? Have a lot of money to spend? The newly converted penthouse at the Woolworth Building in downtown New York City may be for you. For $110 million, you can get the keys to the 8,975 square-foot, nine-floor apartment. It has four bedrooms, a private elevator and observation deck. The appraiser says, “The price is more reflective of the unique historical nature of the property” than its location.\n3. Ann B. Davis, ‘Brady Bunch’ Housekeeper Alice, Dies at 88\nAnn B. Davis, the actress best known for playing Alice, a housekeeper on TV sitcom “The Brady Bunch,” has died. Her agent said she fell in the bathroom and became comatose. She later died at a San Antonio hospital. After the “Brady Bunch” went off-air, the Schenectady, New York, native led a relatively quiet life and spent much of her later years in church. Davis was 88 years old.\n4. 91-Year-Old Marathon Runner: Proof Age Is Just a Number\nFor anyone out there trying to find the right motivation to work out – here’s a wake-up call: on Sunday, 91-year-old Harriette Thompson finished the 2014 Rock ‘n’ Roll San Diego Marathon in 7:07:42, setting a new record in the 90 to 94-year age group. What’s even more incredible: she didn’t start running until she was 76 years old – it all goes to show, it’s never too late to set a new goal. Skip ahead to 7:00 to see her in action.\n5. Solar Plane to Travel the World\nSwiss engineers are testing their new solar-powered plane before its big flight around the world. It successfully made its inaugural test flight – a voyage that lasted 2 hours and 17 minutes. The single-seater plane is made of carbon fiber and weighs about as much as a normal car. It has 17,000 solar cells in its wings that convert light into energy for four electric motors. Scientists say the plane will embark on its trip around the world next year.\n6. Unvaccinated Travelers Drive Measles Spike\nThe number of measles cases in the U.S. has reached a 20-year high, with a total of 228 cases reported in the first five months of this year. Unvaccinated American travelers who go overseas are bringing the virus back with them, Slate reports, attributing “a stunning 97 percent” of current cases to people visiting other countries. Measles is highly contagious, and produces fever, runny nose, cough and a rash. According to the Centers of Disease Control, for every 1,000 children who get measles, one or two will die.","url":"https://www.nbcnews.com/nightly-news/6-speed-reads-amazing-then-and-now-pictures-d-day-n120411"}
