{"authors":[],"date_download":"2018-10-22 21:14:38","date_modify":"2018-10-22 21:14:38","date_publish":"2014-06-04 16:57:04","description":"In today’s midday post: High schoolers surprise their principal, new video shows Bowe Bergdahl’s release, and a train crushes an 18-wheeler.","filename":"data/vaneerConsumption/6SpeedReadsStudentsPrankPrincipalbyHiringMariachiBand.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/487366/mariachi_band_738ae4d990870dea593fb456d5060f0c.1200;630;7;70;5.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/nightly-news_6-speed-reads-students-prank-principal-hiring-mariachi-band-n122546_1540242878.html","title":"6 Speed Reads: Students Prank Principal by Hiring Mariachi Band","title_page":"6 Speed Reads: Students Prank Principal by Hiring Mariachi Band","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\n1. Senior Prank: Students Hire Mariachi Band to Follow Principal\nWe’ve heard of some crazy senior high school pranks, but this one is unique. Students at West Linn High School in Santa Barbara, California, hired a mariachi band to follow their principal around the school for an hour. When principal John Becchio walked in his office, four musicians were waiting for him. Granted, he was a good sport about it, but we’re pretty sure he was glad when it ended.\n2. New Video Shows Bowe Bergdahl’s Release\nThe Taliban has released video showing the tense moments when former prisoner Bowe Bergdahl was handed over to American special forces. The 17-minute video was sent to NBC News by a known Taliban spokesman. It shows both sides quickly shaking hands before Bergdahl is handed over and the Americans leaving via helicopter. Staff Sgt. Bergdahl spent five years in Taliban custody before being released Saturday in exchange for five high-ranking Taliban detainees at Guantanamo Bay.\n3. Replica of Van Gogh's Ear Grown From Relative's Cells\nCall it the cross section of art and science: a German museum has put a copy of Vincent van Gogh’s ear on display. It was grown using some of the artist’s genetic material. Van Gogh allegedly cut his left ear off during a psychotic episode in 1888. The Center for Art and Media Karlsruhesays this replica ear was grown from samples from the great-great-grandson of van Gogh’s brother.\n4. Train Slams Into Watermelon Truck\nThis is a lesson on what happens when an unstoppable force hits an immovable object. In Florida, the trailer of an 18-wheeler full of watermelon got stuck on train tracks as an oncoming train approached. The train honked its horn, warning the truck driver, but the driver could not move in time, and in a matter of seconds there was a huge explosion of green and red melon chunks all over the road. Fortunately, no one was hurt, but a father and son happened to record the whole incident as it unfolded.\n5. Deaf Boy’s Sweet Moment With Team Mascot\nIt started with 7-year-old Hunter Samworth wanting to meet the mascot at a minor Dayton Dragons baseball game. But Hunter is deaf and nonverbal. So when he spotted the team’s mascot, Heater, he signed: “Nice to meet you.” To his surprise, Heater started signing right back. It turns out the man inside the mascot is training to be a sign language interpreter. Hunter’s parents say their son was smiling “ear to ear” and that this is something he’s going to remember for the rest of his life.\n6. Fake Murder Captured on Google Street View\nGoogle Street View has captured some pretty unusual things over the years, but this might be the craziest yet. A Scottish mechanic and his buddies staged a fake murder as one of the Google tracking cars passed by. You can see a man wielding an ax, looming over another guy laying face down -- seemingly lifeless -- on the road. The men involved say they decided to pull the prank back in August of 2012, but it wasn’t until more than a year later that someone saw the images and called the police. Fortunately for the pranksters, one of the local police knew the mechanics and had a sense of humor. Well, that’s one way to get exposure for your company.","url":"https://www.nbcnews.com/nightly-news/6-speed-reads-students-prank-principal-hiring-mariachi-band-n122546"}
