{"authors":[],"date_download":"2018-10-22 21:32:41","date_modify":"2018-10-22 21:32:41","date_publish":"2014-06-05 17:32:45","description":"In today’s midday post: WestJet surprises a father, a hockey fan loses his dream of going to the Stanley Cup and Amazon may unveil a new phone.","filename":"data/vaneerConsumption/6SpeedReadsWestJetsFathersDayGifttoDadWithSickKid.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/490166/grimard_family_416c3d17037cfcd19748408568a19ae7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/nightly-news_6-speed-reads-westjets-fathers-day-gift-dad-sick-kid-n123731_1540243961.html","title":"6 Speed Reads: WestJet's Father's Day Gift to Dad With Sick Kid","title_page":"6 Speed Reads: WestJet's Father's Day Gift to Dad With Sick Kid","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\n1. Dad’s Surprise Trip to Reunite With His Wife and Sick Son\nThis may be one where words come up short. Watch what happens when a father is surprised by a plan hatched by Ronald McDonald House and Canadian airline WestJet to reunite him with his wife and sick son. Sure, it’s great publicity for WestJet, but all that seems insignificant when you watch the smile on his little boy’s face upon seeing his dad.\n2. Hotel Guest Films President Obama Pumping Iron\nEver wondered how heads of state stay in shape? New video of President Obama working out might give you a clue. The video was taken while the commander-in-chief was pumping iron in the gym of a 5-star Marriott hotel in Warsaw, Poland. He used some free weights, does lunges and then goes for a jog on the elliptical. The footage got out, because according to Secret Service spokesman Edwin Donovan, “Hotel guests were not asked to leave the gym…nor were they asked to refrain from taking pictures.”\n3. Stanley Cup Tickets for $12?\nNew Jersey hockey fan Kavi Arora had made an incredible discovery on StubHub: Four seats to the Stanley Cup Finals. Game 6. Madison Square Garden. $12. He bought them immediately. But the next morning, StubHub emailed him saying his transaction was cancelled because the seller was “unable to fulfill the order.” StubHub has offered customers comparable seats in similar situations, but in this case the company opted to give back his $12, because there were no comparable seats at that price. In addition, they offered to give him a $300 voucher, but Arora still wants his seats. Similar tickets for that game start at more than $2,500. Do you think Arora got cheated or should he take the voucher and run? Tweet your response @NBCNightlyNews.\n4. Last Original Code Talker Dies\nChester Nez, the last of the 29 Navajo code talkers from World War II, died on Wednesday. Nez was part of a group recruited to develop a code based on the Navajo language. He enlisted when he was in the 10th grade. The code’s sophistication ensured it was impenetrable to the Japanese and it was never broken. Nez went on to serve in the Korean War and then later worked as a painter at the Albuquerque Veterans hospital. He received a Congressional Gold Medal for his service in 2001 and spent much of his later years traveling and telling his story. Chester Nez was 93.\n5. Amazon Unveiling New 3D Phone?\nAmazon is reportedly planning to jump into the smartphone world and make a big splash. It appears its new phone will feature a 3D holographic display. No worries, it likely won’t require 3D glasses. It is rumored to include both a cheaper and higher-end model, but we’ll learn more when the device is unveiled on June 18.\n6. This Robot Knows Exactly How You Feel\nPepper, a robot that reads human emotions, is very cool and slightly creepy at the same time. Created by global conglomerate SoftBank, it stands 4-feet tall and weighs roughly 61 pounds. It has big round eyes, a child-like face, arms, hands, a chest -- and most importantly, an “emotional engine.” The emotional engine is supposed to help Pepper read situations, like smiles and tone of voice, for instance, and report that back to a user. It also giggles and seems to look right at you. Pepper is meant for the home and will be available by the end of next year.","url":"https://www.nbcnews.com/nightly-news/6-speed-reads-westjets-fathers-day-gift-dad-sick-kid-n123731"}
