{"authors":[],"date_download":"2018-10-22 21:53:34","date_modify":"2018-10-22 21:53:34","date_publish":"2014-05-08 00:00:00","description":"In today’s midday reads: Amazing Dog Protects 3-year-old boy, Shelly Sterling fights to own the Clippers and a YouTube video that melts hearts.","filename":"data/vaneerConsumption/6SpeedReadsLost3yearoldandDogFoundTogether.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/429826/carson-urness-and-family-dog-cooper_e0af889f6eacf889bbdf0be30b72d163.nbcnews-fp-1200-630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/feature_speed-reads_6-speed-reads-lost-3-year-old-dog-found-together-n100536_1540245214.html","title":"6 Speed Reads: Lost 3-year-old and Dog Found Together","title_page":"6 Speed Reads: Lost 3-year-old and Dog Found Together  - NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"1. Lost 3-year-old Found With Family Dog Protecting Him\nCarson Urness, a 3-year-old North Dakota boy, is best friends with his family’s dog, Cooper. The Urness family adopted the golden retriever-German shepherd mix as a puppy after finding him abandoned on the side of the road. Since then, he and Carson have been regular playmates and often frolic in the yard together. But Monday night, they went a little too far. Carson’s mother called 911 after she couldn’t find him in the yard. Even more troubling, it was getting dark, raining and the family’s house backs up to more than 2,000 acres of North Dakota farmland. More than 200 volunteers searched for Carson that night. Highway patrol dispatched aircraft searches for the boy -- still no sign. Then, at 2 a.m., a firefighter trekked over a hill about a mile away from the family’s home and caught something with his flashlight: Carson lying face down on the ground asleep with Cooper the dog on top of him keeping him warm. Aside from some torn jeans, a ripped jacket and a little mud, the little boy is fine.\n2. Would You Risk Harm to Retrieve A Stolen Smartphone?\nHow much do you value your smartphone? A mobile security firm found 68 percent of those who were victims of smartphone theft would be willing to put themselves in danger to retrieve a stolen phone. Why? Most said it was because of the valuable personal data on those phones — the photos, contact numbers, email addresses. Increasingly, smartphone theft dominates robbery reports. One in 10 surveyed said they were victims of theft. That sobering statistic and the willingness of victims to fight back only increases pressure on manufacturers to include a ‘kill switch’ on their devices. A ‘kill switch’ would render a phone useless — once stolen.\n3. Shelly Sterling Fights Back, Says She’s Holding Onto Clippers\nThe NBA may be gearing up for a ferocious legal battle centered on whether Shelly Sterling should lose her ownership rights like her husband Donald Sterling as the league tries to force him to sell the L.A. Clippers. Shelly Sterling is part owner of the Clippers and said she believes she is legally entitled to maintain ownership of the team. Sterling told the Los Angeles Times she is a “die-hard” fan of the Clippers and said “the sanctions against Donald Sterling – which included a lifetime ban and a $2.5-million fine – do not apply to ‘me or my family.’” No comment yet from the NBA.\n4. Rare Megamouth Shark Caught in Japan\nHave you ever heard of a megamouth shark? They’re extremely rare. In fact, there have only been 58 known sightings, but one was recently caught off the coast of Shizuoka, Japan and given a public autopsy. The 13-foot female was captured a month ago. She is a beastly sight with her bulbous head. Megamouth sharks mainly feed on krill. They usually swim at great depths and only rise up at night to feed.\n5. Toilet to Tap: Texas Town Treats Waste Water to Use As Faucet Water\nWe’re all for environmental conservation, but this may be a little hard to swallow. City officials in Wichita Falls, Texas, have come up with a plan to use toilet water as tap water. The town has built a 13-mile pipeline that will connect its waste treatment facility to a water purification plant. The hope is that water purified from toilets, bathtubs and sinks will be purified and used to supply half the city’s 100,000 residents with clean, fresh tap water. The Texas Department of Environmental Quality is still testing the process, but expects it will be complete within a month. Who wants to take the first drink?\n6. YouTube Personality Surprises Homeless Man With a House\nBack in March, YouTube personality MagicofRahat surprised a homeless man by buying him a fake lottery ticket. Little did the man know, MagicofRahat worked out a deal with a local store clerk so that the homeless man would receive $1,000 for redeeming the ticket. When the man, named Eric, was paid out ‘his earnings’, he turned around and generously tried to share it. Video of the surprise touched so many of MagicofRahat’s fans that they started sending money to the YouTube star to further help Eric. In 17 days, the Internet raised $44,000. MagicofRahat used that to secretly rent Eric a house for a year. And when he finally unveiled the new home, Eric’s reaction was priceless.","url":"https://www.nbcnews.com/feature/speed-reads/6-speed-reads-lost-3-year-old-dog-found-together-n100536"}
