{"authors":[],"date_download":"2018-10-22 22:45:50","date_modify":"2018-10-22 22:45:50","date_publish":"2014-05-12 00:00:00","description":"In today’s midday reads: Cities bid for spicy Sriracha, “Dracula’s castle” is for sale, and Eminem’s Mother’s Day apology.","filename":"data/vaneerConsumption/6SpeedReadsTexasCourtsSrirachaPlant.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_15/315416/140410-sriracha-mn-1145_1db3b99705378d7d43edb51f452d1105.nbcnews-fp-1200-630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/feature_speed-reads_6-speed-reads-texas-courts-sriracha-plant-n103351_1540248350.html","title":"6 Speed Reads: Texas Courts Sriracha Plant","title_page":"6 Speed Reads: Texas Courts Sriracha Plant - NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"Texas Wants California Sriracha Plant to Move to Lone Star State\nA group of Texas lawmakers will meet with Sriracha producer Huy Fong Foods on Monday in Irwindale, Calif., to try and convince the hot sauce maker to move to Texas. Huy Fong Foods has been under attack from some of its neighbors who complain of pungent smells emanating from the Sriracha plant. The Irwindale City Council recently decided not to label the plant a public nuisance, but it hasn’t stopped other cities and states from coming forward to woo the spicy sauce company and its 80 employees.\nHow Michael Sam Could Change the NFL\nSaturday afternoon, Michael Sam officially became an NFL player -- the first openly gay NFL player. While many influencers like Lebron James and President Obama have congratulated Sam on being drafted, he’s received flack after ESPN showed him kissing his boyfriend upon getting word of his draft selection. Don Jones, a cornerback for the Miami Dolphins, had some disparaging tweets about the TV moment; he’s since been fined. Many advocating change say the athletic world needs to continue to watch Michael Sam, who may represent a cultural shift in one of America’s favorite sports.\n'Dracula’s Castle' Is For Sale\nIf you love 19th century literature, have unlimited funds and are in the market for a new house – we have the perfect listing for you: \"Dracula’s Castle.\" It’s nicknamed the Bran, and is supposedly the inspiration behind the castle Bram Stoker depicts in “Dracula.” Stoker actually never visited the castle, but he is believed to have read extensively about it in writing the novel. Documents also suggest Vlad Dracul was imprisoned there for a period of time. The castle dates back to 1388 and boast 57 rooms -- though, you might need to do some remodeling. None of the rooms is a bathroom. And because we know you’re wondering, it’s expected to fetch anything between $79 and $135 million.\nDoes Your Teen Read Like You Did Growing Up?\nIn this digital age, when there are so many options to entertain teens -- tablets, smartphones, computer games -- the news that fewer teens are reading for fun may not be surprising. What is surprising is just how few teens read for fun. A new study from Common Sense Media found that only 45 percent of 17-year-olds say they read for fun -- once or twice a year. In 1984, 64 percent said they read for fun once a week or more. Even more distressing may be that nearly 30 percent said they hardly ever read for pleasure. Experts say teens do have more homework to deal with nowadays, but it’s also impossible not to question the impact of Instagram, Twitter and Snapchat.\nRare “Mono Mono” Twins Hold Hands Immediately After Birth\nAny baby that’s born healthy is a happy birth, but the arrival of two identical twin girls in Akron, Ohio, was particularly momentous. The newborns were monoamniotic or ‘mono mono’ twins, sharing an amniotic sac and placenta that put them at severe risk of umbilical cord entanglement, which could cut off blood supply and result in death. To reduce the risk, mom Sarah Thistlewaite spent 57 days on bed rest. So on Friday, when little Jenna and Jillian arrived healthy by C-section, the doctors in the delivery room couldn’t wait to show them off. Born 45 seconds apart, when the girls were introduced to mom and dad, they put on an extra special show -- they held hands. Luckily for the proud parents, their adorable gesture was captured on camera. Best baby album photo ever.\nMonoanmiotic were born holding hands. @AkronChildrens via Twitter\nEminem Apologizes to His Mom\nGiven the hateful lyrics he’s rapped about his mom in the past, Eminem doesn’t seem like the kind of guy who would celebrate Mother’s Day. But this year was different: he issued an apology to his mother, Debbie Mathers, in anew music video directed by Spike Lee for the song “Headlights.” In the track, which was released last year on “The Marshall Mathers LP 2” album, Eminem raps: “I went in headfirst / Never thinking about who what I said hurt, in what verse / My mom probably got it the worst.” The song continues: “Did I take it too far? / 'Cleaning Out My Closet' and all them other songs / But regardless I don't hate you 'cause, Ma, / You're still beautiful to me, 'cause you're my mom.” Throughout the video, we see images of Eminem’s hometown of Detroit, and a character who appears to be Debbie Mathers, who he finally reunites with after several years. Perhaps, given the song’s name, Eminem is finally seeing his childhood in a new light.","url":"https://www.nbcnews.com/feature/speed-reads/6-speed-reads-texas-courts-sriracha-plant-n103351"}
