{"authors":[],"date_download":"2018-10-22 21:01:07","date_modify":"2018-10-22 21:01:07","date_publish":"2014-05-05 00:00:00","description":"In today's midday reads, Shaun White's prom date, Denver Broncos Wes Welker gives away $100 bills and new hires at Apple fuel iWatch rumors.","filename":"data/vaneerConsumption/6SpeedReadsShaunWhiteCrashesHighSchoolProm.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/420656/140505-shaun-white-prom-selfie-jsw_6c8598f81f42ccf1b246fe992c18afd2.nbcnews-fp-1200-630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/feature_speed-reads_6-speed-reads-shaun-white-crashes-high-school-prom-n97376_1540242067.html","title":"6 Speed Reads: Shaun White Crashes High School Prom","title_page":"6 Speed Reads: Shaun White Crashes High School Prom - NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"1. Shaun White Surprises Teen at Senior Prom\nShaun White is an Olympic gold medalist, an X Games legend and all-around superstar. So you can imagine the look of shock on Pennsylvania senior Carly Monzo’s face when he showed up at her high school prom. Monzo is a huge fan of White’s and jokingly asked him to prom with a GoPro video - one of his sponsors - on Twitter. Well, White saw the tweets and contacted her school. The night of the big dance, school officials called a clueless Monzo onto the stage. When the curtains dropped, White was standing there with his band and she got a chance to rock out with her date.\n2. Target CEO Steps Down\nTarget’s huge data breach last year has cost its chairman and CEO his job. The shopping giant announced this morning Gregg Steinhafel is stepping down immediately. \"After extensive discussions, the board and Gregg Steinhafel have decided that now is the right time for new leadership at Target,\" the board said in a statement. Target’s CFO will fill Steinhafel’s roles until the board finds a replacement. The cyber-attack announced in December resulted in the theft of 40 million card numbers and 70 million other pieces of customer data.\n3. Denver Broncos Wes Welker Shares Derby Winnings with Strangers\nNote to self: the next time you go gambling, make sure Wes Welker is nearby. The Denver Broncos Pro Bowl receiver was at the Kentucky Derby this weekend and apparently won big. So what does a multi-millionaire do with stacks of cash won from the track? He becomes a man of the people. Welker started handing out $100 bills to random strangers as he left Churchill Downs. Must be nice.\n4. This Version of the ‘Napoleon Dynamite’ Dance Will Make You Smile\nSure, we’ve seen some crazy bucket-list items, but this guy’s dance challenge is pretty unique. Remember that awkward routine from “Napoleon Dynamite?” He nailed it 100 times perfectly and the supercut of it is pretty spectacular. Happy Monday, gosh!\n5. Recent Apple Hires Hint at New Product on Its Way?\nCould the latest Apple gadget debut be sooner than we think? Apple hasn’t launched a new product type since the iPad in 2010, but recent expert hires in biomedicine and sensory technology may hint at what the company has planned next. According to Reuters, Apple’s ambitions are well beyond just creating an iWatch and other wearable tech, and include creating an entire health and fitness platform that works like its apps stores. Of course, the famously secret company had no comment.\n6. The ‘Beygency’\nBey. Queen Bey. Yonce. Whatever you want to call her, it seems Beyonce can do no wrong, which is why “SNL” decided to have a little fun with the songstress. In a sketch this weekend, Andrew Garfield plays a man who makes the mistake of criticizing Beyonce. The result isn’t pretty. He spends the rest of his time on the run from the Beygency – a C.I.A.-esque group designed to make sure no one gets away with talking bad about Mrs. Carter. It’s definitely worth the three and a half minutes.","url":"https://www.nbcnews.com/feature/speed-reads/6-speed-reads-shaun-white-crashes-high-school-prom-n97376"}
