{"authors":[],"date_download":"2018-10-22 22:16:34","date_modify":"2018-10-22 22:16:34","date_publish":"2014-05-09 00:00:00","description":"In today’s midday reads: high schoolers “draft” prom dates, arguing can shorten your life and Chicago elderly help Brazilian students learn English.","filename":"data/vaneerConsumption/6SpeedReadsCaliforniaHighSchoolPromDraftSparksOutrage.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/432361/corona_del_mar_9800b8cc6bb3ac70d2a8555ac0d3e63c.nbcnews-fp-1200-630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/feature_speed-reads_6-speed-reads-california-high-school-prom-draft-sparks-outrage-n101596_1540246594.html","title":"6 Speed Reads: California High School Prom Draft Sparks Outrage","title_page":"6 Speed Reads: California High School Prom Draft Sparks Outrage - NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"1. Corona del Mar High School Students Use ‘Draft’ to Pick Prom Dates\nStudents at a California high school are in hot water over trying to apply the NFL Draft process to their high school prom. Corona del Mar is a fancy school. Students drive BMW’s and live in large houses and some are saying that sense of privilege may have gone too far. Boys at the school allegedly held a draft to ask girls to prom. There are reports that participants could even pay money to get an earlier “pick.” The school’s principal has alerted the community of the scandal and parents are outraged. Katrina Foley, a school district trustee, said the boys “probably believe it’s not offensive or objectionable and that’s part of the problem. A lot of this stuff comes back to wealth and being responsible with wealth.”\n2. Dr. Dre May Be on the Brink of Becoming the First Billionaire of Hip Hop\nIt looks like rap mogul Dr. Dre is poised to add a lot of 0’s to his bank account, if Apple goes through with its purchase of the star’s Beats Electronics. Dre is currently ranked second on Forbes’ list of wealthiest hip-hop artists, with an estimated $550 million. Sean Combs is ahead of him with a net worth of $700 million. Beats is valued at around $3.2 billion and if Dr. Dre has at least a 15 percent stake in the company, which experts say is highly likely, then that’ll give him the $450,000 needed to top $1 billion and become Hip Hop’s first member of the “Billionaire Boy’s Club.”\n3. One Company Where Contacting a Colleague on Vacation is Forbidden\nIn an age where we’re all constantly wired and connected, a vacation completely unplugged from the office is a non-reality. Unless, perhaps, you work at a tech company like Bandwidth, where contacting a fellow employee on vacay is a strict violation of company policy. Managers are required to send out emails alerting staff that “Joe is on vacation embargo.” And if you contact Joe or happen to be Joe and contact the office from the beach, you will get in trouble. CEO David Morken says his reasons are selfish. His staff can’t be creative overachievers when “they’re feeling overworked, overstressed, overwhelmed and disconnected from the people that matter most in their lives.” P.S. Bandwidth makes it mandatory for employees to take all of their vacation time, too.\n4. Race and the NFL: How Scouts Describe Players\nHave you ever wondered if NFL scouts talk about players differently because of their race? Do particular words come up more frequently to describe black players than white? Deadspin did a little digging. It pulled text from NFL.com, CBS and ESPN scouting reports about prospective players –- almost 70,000 words in total -- and created an interactive that allows you to see how often a single word, like “natural” or “competitive” or “tenacious” is used in a scouting report describing black athletes versus whites. Check it out. It’s pretty fascinating.\n5. Frequent Arguing May Increase Your Risk of Death\nEver met someone who just lives to argue? That’s not a good idea if they plan on living long, according to researchers at the University of Copenhagen. It turns out all that constant bickering is linked to a higher mortality risk -- as much as two to three times the normal rate. Men and the unemployed are most impacted by the nagging, but researchers don’t yet know why. They think it has something to do with one’s personality and ability to handle stress. So next time you feel conflict brewing, think twice about just staying ‘chill.’\n6. Brazilian Kids Learn English by talking to Lonely Elderly People\nBrazil has a lot of students wanting to practice their English. America has a lot of elderly people who love to talk. It’s a perfect match. FCB Brazil just launched a program connecting the two. It’s called “Speaking Exchange” and is part of the CNA language schools. Young Brazilian students use webchats to connect with elderly Americans living in a retirement home in Chicago. The conversations get recorded and uploaded to a private YouTube page for evaluation. Sweet, yes, but does this mean there’s going to be a young Brazilian population speaking English with Midwestern accents?","url":"https://www.nbcnews.com/feature/speed-reads/6-speed-reads-california-high-school-prom-draft-sparks-outrage-n101596"}
