{"authors":[],"date_download":"2018-10-22 23:04:33","date_modify":"2018-10-22 23:04:33","date_publish":"2014-05-13 00:00:00","description":"In our midday reads: ‘Space Oddity’ video goes offline soon, Christopher Columbus’ ship may have been found and the key to living a long life.","filename":"data/vaneerConsumption/6SpeedReadsHurryLastChancetoSeeSpacesFirstMusicVideo.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_20/439706/140513-nn-hadfield_2efdbef03b75c2aee8417f95caf55475.nbcnews-fp-1200-630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/feature_speed-reads_6-speed-reads-hurry-last-chance-see-spaces-first-music-n104341_1540249473.html","title":"6 Speed Reads: Hurry! Last Chance to See Space's First Music Video","title_page":"6 Speed Reads: Hurry! Last Chance to See Space's First Music Video - NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"1. One Day Left to Watch Commander Chris Hadfield’s ‘Space Oddity’ Video\nOur favorite music video from space is going offline Tuesday and we're already in mourning. Canadian Astronaut Commander Hadfield tweeted this morning that it was \"Bowie's last day\" and that he \"only had permission for a year\" to post his rendition of \"Space Oddity\" filmed from the International Space Station. The video has now been viewed more than 22 million times on YouTube, made Commander Hadfield one of the most famous astronauts around, and no doubt, has introduced the coolness of space to a whole new generation.\n2. Brazil Tells World Cup Tourists Not to Scream If Robbed\nIf you’re heading to the World Cup in Brazil and you happen upon any armed criminals, keep your mouth shut. That’s the advice Brazilian police are offering to soccer fans traveling to the country this summer. Police have compiled a list of tips for staying safe in cities like Rio de Janeiro and Sao Paulo, where crime rates have soared ahead of the 2014 World Cup. “Do not react, scream or argue,” with armed robbers, reads the brochure drafted by police. Tourists are also advised not to flaunt valuable objects, to be careful at night and to make sure no one is following them. About 600,000 tourists are expected to travel to Rio for the Cup.\n3. Christopher Columbus’ Ship Found?\nThe leader of an undersea expedition believes he’s found wreckage belonging to possibly the most famous explorer of all-time: Christopher Columbus. Underwater archaeologist Barry Clifford says his team, funded by the History Channel, has tracked down the remains of Columbus’ Santa Maria off the coast of Haiti. “All the geographical, underwater topography and archaeological evidence strongly suggests that this wreck is Columbus’ famous flagship, the Santa Maria,” Clifford told The Independent. The ship was the largest of the three in Columbus’ New World convoy and was the only one to wreck in the Americas over 500 years ago.\n4. New Jacqueline Kennedy Letters Uncovered\nFor 14 years, Jacqueline Kennedy revealed secrets of her private life in letters to a man named Joseph Leonard, an Irish priest she met only twice. Kennedy describes her feelings on life in the White House and the assassination that left her “bitter against God.” She said she was consumed by ambition, “like Macbeth … maybe I’m just dazzled and picture myself in a glittering world of crowned heads and Men of Destiny – and not just a sad little housewife.” The correspondence also reveals Jackie’s concern that her husband would stray, as well as her struggle through the loss of two children and JFK’s assassination: “God will have a bit of explaining to do to me if I ever see Him.” The letters are now up for auction in Ireland, and are expected to fetch up to 1.2 million euros, or about $1.6 million.\n5. DJ Casey Kasem Is Missing\nFamily of legendary DJ Casey Kasem says he is missing and they’re worried about his safety. A Los Angeles Superior Court Judge has ordered an investigator to locate the 82-year-old father of three. His daughter Kerri Kasem told NBC News that she saw her him last Tuesday at a medical facility that she did not name. Kerri alleges the DJ’s wife, Jean, is the one that checked him out from his medical facility and is keeping his location a secret. Jean Kasem’s attorney says he’s unsure of Casey’s whereabouts but that he’s “been removed from the country.”\n6. Live Longer With a Purpose\nHaving a purpose in life will help you live longer, according to Canadian researcher Patrick Hill of Carleton University. Hill studied 6,000 adults over 14 years and discovered those who were focused and purpose-driven lived longer. About 9 percent of the subjects died during that 14-year period and those who did had reported having a lower life purpose. So, whether it’s mastering a foreign language, discovering God or beating a world record, the key to a long life seems to be finding a goal.","url":"https://www.nbcnews.com/feature/speed-reads/6-speed-reads-hurry-last-chance-see-spaces-first-music-n104341"}
