{"authors":[],"date_download":"2018-10-22 21:32:34","date_modify":"2018-10-22 21:32:34","date_publish":"2014-05-07 00:00:00","description":"In today’s midday reads: An NFL prospect makes good on a childhood promise, New York gets an official snack and Michael Jordan speaks out on race.","filename":"data/vaneerConsumption/6SpeedReadsNFLProspectDeliversOnPromiseToMother.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/426706/140507-escalade-bridgewater-mn-1315_7eb8225d334e669414305d659d98e2e5.nbcnews-fp-1200-630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/feature_speed-reads_6-speed-reads-nfl-prospect-delivers-promise-mother-n99491_1540243954.html","title":"6 Speed Reads: NFL Prospect Delivers On Promise To Mother","title_page":"6 Speed Reads: NFL Prospect Delivers On Promise To Mother - NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"1. NFL Prospect Makes Good On Childhood Promise To Mother\nAs a third-grader growing up in inner-city Miami, Teddy Bridgewater made a promise to his mother that one day he would buy her a pink Cadillac Escalade. Teddy’s mother was diagnosed with breast cancer in 2007, but still supported him all throughout his high school years. Teddy worked hard, earned a college scholarship and played some amazing football. So much so that he is one of the top college quarterback prospects in this year’s NFL Draft. Which brings us to that third-grade promise. This week, amid all the hoopla surrounding his future success, he made good on that gift for mom. Spike Lee documented the unveiling, and Bridgewater even stuck with the pink color – in support of his mother’s battle with cancer.\n2. The Navy’s New eReader for Submarine Life\nIt’s called NeRD, short for Navy eReader Device, and it will soon become a part of submarine life for sailors everywhere. In a tight-quartered sub where iPads, Kindles and other e-readers are disallowed because of the security risks Wi-Fi and cameras present, the modified e-reader is a sort of throwback digital device. NeRd has no Wi-Fi, no option to delete or add titles. It’ll come preloaded with 300 titles the Navy’s General Library Program selects. No surprise, Tom Clancy will be among the best-selling authors featured, along with the classics, professional development titles and history books.\n3. New York Has An Official Snack?\nStates already have official flags, songs, flowers and birds. So, why not an official snack? The New York State Senate has declared yogurt the official state snack. The bill passed by a 52-8 vote. It still needs to go to the Assembly for approval, but it declares, “Yogurt is a healthy food that tastes great and is a good source of protein, calcium, vitamin B-12, potassium and magnesium, all nutrients that are an important part of a good diet.” It also references yogurt as an economic driver across the state. All fair points, but might apples be feeling a little slighted?\n4. MJ: “I Was Against All White People”\nIn the wake of the NBA’s recent battle with racism and Donald Sterling, the league’s greatest player is opening up about his own struggles with race. In his new book, “Michael Jordan: The Life,” the Hall of Famer details growing up in a part of North Carolina heavily occupied by the Ku Klux Klan. Jordan talks about how he was suspended from school in 1977 after throwing soda at a girl who called him the N-word, saying, “I was really rebelling. I considered myself a racist at the time. Basically, I was against all white people.” Jordan’s biographer says it’s those obstacles that made him play with a chip on his shoulder and shaped his drive and competitive spirit.\n5. Stanford Divests Coal Investments\nEvery year you hear about growing university endowments and institutions with 11-figure accounts. So, it turns heads when a school turns down future earnings in favor of what it sees as a better social and environmental practice. Enter Stanford. The university’s guidelines allow the Board of Trustees to evaluate the “policies or practices” of companies they invest in that “create substantial social injury.” After a five-month review, an advisory panel concluded stocks from companies “whose principal business is coal” should be sold and excluded from future investments. The Board upheld the recommendation making Stanford the first major university to make such a move. The divestment affects nearly 100 companies and is estimated to represent a small portion of the school’s $18.7 billion endowment.\n6. Millennials Are Giving Millennials a Bad Name\nHow often do you play hooky from work? Chances are pretty high you have if you’re a millennial. A travel survey by SpringHill Suites found roughly 60 percent of Americans between 18 to 34 admitted to making excuses to take impromptu vacations. That’s compared to about 18 percent of people 65 and older. Experts say millennials have a higher expectation of not making work a central part of life. We know a few millennials who agree.","url":"https://www.nbcnews.com/feature/speed-reads/6-speed-reads-nfl-prospect-delivers-promise-mother-n99491"}
