{"authors":["Lia Beck"],"date_download":"2018-10-31 01:43:11","date_modify":"2018-10-31 01:43:11","date_publish":"2018-08-27 21:59:56","description":"For those who are obsessed with the drink, pumpkin spice latté season is almost here. (For everyone else, I guess it's just fall.) And if you're someone who likes everything from your coffee to your Oreos to taste like they came straight out of a…","filename":"data/vaneerConsumption/6SurprisingHealthBenefitsOfPumpkinSpiceApartFromHowDeliciousItIs.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/06f86546-f648-47e7-9bf2-452e0addd0f1-getty-857367872.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_6-surprising-health-benefits-of-pumpkin-spice-apart-from-how-delicious-it-is-10233516_1540950191.html","title":"6 Surprising Health Benefits Of Pumpkin Spice (Apart From How Delicious It Is)","title_page":"6 Surprising Health Benefits Of Pumpkin Spice (Apart From How Delicious It Is)","title_rss":"NULL","source_domain":"bustle.com","text":"For those who are obsessed with the drink, pumpkin spice latté season is almost here. (For everyone else, I guess it's just fall.) And if you're someone who likes everything from your coffee to your Oreos to taste like they came straight out of a pumpkin patch, then you might already know what spices make up pumpkin spice. But, lesser known might be whether or not pumpkin spice has any health benefits. Turns out, it does! Now, I'm not saying that drinking a PSL will cure the common cold or anything (you should drink it anyway, of course), but the spices that are mixed together to make pumpkin spice each have their own health benefits.\nPumpkin spice is generally cinnamon, nutmeg, ginger, cloves, and allspice. When making a pumpkin pie from scratch, these are the ingredients that are included (you can also buy pumpkin pie spice already all mixed up). But, if you're looking at a pumpkin spice product — lattes, cookies, rum, deodorant (?!?!) — then the spices that are included (or not included) will depend on whoever's making it.\nIt should be noted that the health benefits of the ingredients in pumpkin spice mixtures all require more research, and of course, you should definitely consult your doctor before starting any new supplements. And also, you probably won't notice any massive change in your health from drinking a PSL all fall. But, if we're speaking in technical terms, the ingredients that make up the classic pumpkin spice mixture have been said to hold the following health benefits:\nCinnamon\nThere have been multiple studies done on the potential health benefits of cinnamon, but there is nothing set it stone yet about it being beneficial to humans. For instance, there was one study that showed cassia cinnamon may help with controlling blood sugar levels, but more research needs to be done. Dietician Lisa Drayer told CNN, \"I think the bottom line is that cinnamon is a perfect pantry staple, a pleasant spice that can add flavor to foods... with antioxidant properties that may give an edge to those looking to better control their blood sugar. But we need to see more research before we can make any solid health claims linking cinnamon to reduce risk of disease or improved health.\" (It is also possible, but rare, to have too much cinnamon and danger your health.)\nNutmeg\nWebMD notes that people have attempted to use nutmeg to treat stomach issues, cancer, kidney disease, pain, and more. WebMD also notes that there is insufficient evidence supporting nutmeg being used as a medicine for any of these. (On the other end of the spectrum, if ingested in large portions, it can be a hallucinogen.) Nutmeg can be used to make skin treatments that are reportedly effective for treating acne — of course, know if you're allergic or sensitive to any ingredients before trying anything.\nGinger\nThe primary medicinal use for ginger is to treat nausea, and WebMD says that it is \"possibly effective for\" nausea caused by HIV/AIDS treatment, osteoarthritis, painful periods, morning sickness, and more. A study listed on the U.S. National Library of Medicine states, \"The best available evidence demonstrates that ginger is an effective and inexpensive treatment for nausea and vomiting and is safe.\" That said, eating a slice of pumpkin pie probably won't help with nausea. You'd be better off trying a ginger tea. (And, as always, be sure to check out any interactions it could have with other medicines.)\nCloves\nCloves are commonly used to treat toothaches because the chemical compound eugenol, which is found in cloves is an anesthetic and analgesic. WebMD notes, though, that the FDA downgraded the effectiveness rating of eugenol. WebMD also lists a whole bunch of other things that cloves have been thought to treat but that there is insufficient evidence for.\nAllspice\nAllspice also contains eugenol, as well as other compounds that \"collectively possess antioxidant, anti-inflammatory, cancer-fighting, sedative, antiseptic, antiviral and antifungal properties,\" according to Fox News. Again, WebMD lists what it considers the effectiveness of allspice treating different ailments and lists intestinal gas, vomiting, diarrhea, flu, colds, and more under \"insufficient evidence for\".\nPumpkin\nNot all pumpkin spice lattés contain actual pumpkin, but since Starbucks added it to theirs in 2015, it makes the list. According to WebMD, pumpkins are high in fiber and provide a ton of vitamin A, which is good for eyes, skin, and fighting infections.\nSo, yeah, there aren't a ton of confirmed health benefits in pumpkin spice spices. And unless you're looking to treat nausea with ginger or try a clove medication for a toothache, you aren't going to feel any benefits right away, anyway. The actual pumpkin is the winner here.","url":"https://www.bustle.com/p/6-surprising-health-benefits-of-pumpkin-spice-apart-from-how-delicious-it-is-10233516"}
