{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 21:31:30","date_modify":"2018-10-30 21:31:30","date_publish":"2016-01-14 06:14:40","description":"A substitute teacher at a suburban Chicago middle school is under investigation for watching porn videos in the classroom, a report says.","filename":"data/vaneerConsumption/6thGradeTeacherUnderInvestigationforAllegedlyWatchingPorninClass.json","image_url":"https://media.breitbart.com/media/2015/06/Screen-Shot-2015-06-04-at-8.39.30-AM-e1434201276839.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_13__1540935090.html","title":"6th Grade Teacher Under Investigation for Allegedly Watching Porn in Class","title_page":"6th Grade Teacher Under Investigation for Allegedly Watching Porn in Class | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A substitute teacher at a suburban Chicago middle school is under investigation for watching porn videos in the classroom, a report says.\nChicago’s ABC affiliate reports that a teacher at Haven Middle School in Evanston, a northern suburb of Chicago, was accused of inappropriate behavior when a 12-year-old girl saw what she described as porn playing on the teacher’s laptop computer.\nStudent Genevieve Adams told ABC7 that the teacher was acting suspiciously when she walked up to him with a question.\n“He would say like, ‘Wait over there. Don’t come near me.’ And then he would turn down the volume or something, click out of something, and then turn the computer away, so we wouldn’t see. And then he would say, ‘Now come in,'” Genevieve said.\nThe child’s mother, Alexis Adams, also reported to the school that, according to her child, the teacher was “making out with himself” in the classroom. “Extremely sick. Extremely sick,” she added.\nSchool officials have launched an investigation into the teacher’s actions, but police were also called and confiscated the computer.\nSchool administrators informed parents via email that the sixth grade substitute science teacher “was immediately removed from the classroom” and assured all that “No students were involved and all students are safe.”\nFollow Warner Todd Huston on Twitter @warnerthuston, or email the author at igcolonel@hotmail.com.","url":"https://www.breitbart.com/politics/2016/01/13/6th-grade-teacher-in-illinois-under-investigation-for-watching-porn-videos-in-classroom/"}
