{"authors":[],"date_download":"2018-10-22 21:18:04","date_modify":"2018-10-22 21:18:04","date_publish":"2015-02-25 00:00:00","description":"Disillusionment with Wall Street, big political parties, big deficits and big government in general began even under Republican George W. Bush, but it took a hard turn after the election of 2008.","filename":"data/vaneerConsumption/6YearsOnIsTheTeaPartyHereToStay.json","image_url":"https://media.npr.org/assets/img/2015/02/25/ap493208336191_wide-1826598ee643c7f39d5a659e85e297d45bdb9f71.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=388901979_1540243084.html","title":"6 Years On, Is The Tea Party Here To Stay?","title_page":"6 Years On, Is The Tea Party Here To Stay? : NPR","title_rss":"NULL","source_domain":"npr.org","text":"LINDA WERTHEIMER, HOST:\nThe political right has gathered in Washington for the Conservative Political Action Conference since 1973. CPAC, for short, is a showcase for candidates and a launching pad for conservative causes. Six years ago, that gathering coincided with the emergence of what came to be called the Tea Party. As CPAC returns this week, NPR senior editor and correspondent Ron Elving looks back.\nRON ELVING, BYLINE: The early months of 2009 belonged to the newly inaugurated President Obama and his big Democratic majorities in Congress. The country seemed about to make a major move to the left. And some people were not happy about it.\n(SOUNDBITE OF ARCHIVED RECORDING)\nRICK SANTELLI: We're thinking of having a Chicago tea party in July. All you capitalists that want to show up to Lake Michigan - I'm going to start organizing.\nELVING: That's Rick Santelli, on-air analyst for CNBC cable news one week before the 2009 Conservative Political Action Conference. Big and boisterous and totally unbowed, CPAC kicked off with radio host Rush Limbaugh, who had recently said he wanted the new president to fail.\n(SOUNDBITE OF ARCHIVED RECORDING)\nRUSH LIMBAUGH: I want any force, any person, any element of an overarching big government that would stop your success - I want that organization, that element or that person to fail. I want you to succeed.\n(APPLAUSE)\nELVING: People were talking about both Santelli and Limbaugh at CPAC that year, but it was that phrase, tea party, that was catching on. Ron Paul had talked about a tea party in his last presidential campaign. But suddenly, it was everywhere. Anti-Obama protests were being called tea party rallies. And at first, the focus was on taxes and spending. But soon the focus shifted to health care. Tom De Luca is a political science professor at Fordham University.\nTOM DE LUCA: Well, I think having Obama become president, for whatever reasons, really deepened that anger and sort of that rage at, you know, a kind of establishment that's gone wrong, first under Bush to some degree - you know, even Republican - but then much more so under Obama. And then to symbolize all of that, of course, at least from their perspective, is Obamacare.\nELVING: Some of the angriest Tea Party moments came at town hall meetings in August 2009 and in the months while Congress debated the bill. By the time CPAC met again in February 2010, Tea Party was a household term, and its stars were on stage. Dick Armey of Texas, once the Republican majority leader in the House, was at CPAC with a Tea Party group called FreedomWorks, sending this message to the nation's leaders.\n(SOUNDBITE OF ARCHIVED RECORDING)\nREPRESENTATIVE DICK ARMEY: They must come to us and show they're worthy of our loyalty. We don't go to them.\nELVING: In 2010, Tea Party activists ignited a ballot box explosion, delivering the U.S. House and many state offices to the GOP. But their contribution came with a cost. Tea Party insurgents challenged Republican incumbents and party-preferred candidates for the Senate in 2010 and 2012. A number of these challengers won their primaries, sometimes going on to the Senate but other times losing what had been safe - more likely Republican seats. Still, the Tea Party was welcome in the conservative movement. Here's longtime CPAC Chairman David Keene in 2011.\n(SOUNDBITE OF ARCHIVED RECORDING)\nDAVID KEENE: Where else would you find millions of people holding up copies of the Constitution? You know, these are obviously people that we wanted.\nELVING: Tea Party insurgents did not do so well in the primaries last year, perhaps because the Republican Party as a whole had adjusted to the Tea Party influence and impact. The movement had caught lightning in a bottle, says Fordham's Tom De Luca.\nDE LUCA: The real question is whether the Tea Party itself in its various manifestations is still the kind of force it was some years ago. My guess is it isn't. But we'll have to wait to see, especially as you move to the 2016 elections.\nELVING: So listen for lots of shout-outs to the Tea Party this week as CPAC meets again and more than a dozen presidential prospects speak. Ron Elving, NPR News, Washington.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=388901979"}
