{"authors":[],"date_download":"2018-10-22 21:52:26","date_modify":"2018-10-22 21:52:26","date_publish":"2018-08-08 00:00:00","description":"This episode is for everyone who ever had to ask their coworkers to quiet down. Today on the show: We meet the man who stole your office door.","filename":"data/vaneerConsumption/704OpenOffice.json","image_url":"https://media.npr.org/assets/img/2018/08/08/openofficepic1_wide-c0ce6eb016468c304432fcc64984f64657f3c54c.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=636667382_1540245146.html","title":"#704: Open Office","title_page":"#704: Open Office : NPR","title_rss":"NULL","source_domain":"npr.org","text":"STACEY VANEK SMITH, HOST:\nHere at PLANET MONEY, we work in an open office. If I turn my chair around, I can see the entire team. And even if I don't turn my chair around, I can hear them.\nJACOB GOLDSTEIN, BYLINE: So the interesting thing about the oil is the marginal cost is so different.\nDAVID KESTENBAUM, BYLINE: Yes, it's like there's one place that makes screws for a penny...\nNICK FOUNTAIN, HOST:\nI sit between David Kestenbaum and Jacob Goldstein, and they are bickering all day long. It's like they're a married couple who you're not really sure if they're going to make it.\nVANEK SMITH: No. I know. When I first started at PLANET MONEY, on my first day, they got into a fight about Keynesian economics. An actual fight. And I remember sitting there thinking, No. 1, I need to read up on Keynesian economics right now, and, No. 2, I am never going to be able to get any work done in this office. It's too loud. I can't even hear my own thoughts. I can just hear Jacob's thoughts (laughter).\nFOUNTAIN: Yeah. Robert has some really loud thoughts, too.\nROBERT SMITH, BYLINE: It was literally a form of accounting. That's why writing exists. It's not the other way around. It's not, like, oh...\nVANEK SMITH: And then there is Noel King's laugh.\nNOEL KING, BYLINE: (Laughter).\nFOUNTAIN: Love that laugh.\nVANEK SMITH: I know. It's a pretty great laugh. It's epic. But it is hard to get work done with all of this noise happening. And this is the world that most of us are working in. Seventy percent of us work in some kind of open office set up. And, I will be honest right here. Sometimes I just dream of having a door with walls that go all the way around me.\n(SOUNDBITE OF BRYAN JAMES SAMMIS AND DANIEL ABRAHAM BRAUNSTEIN SONG, \"JUST LIKE ME\")\nFOUNTAIN: Hello, and welcome to PLANET MONEY. I'm Nick Fountain.\nVANEK SMITH: And I'm Stacey Vanek Smith. Today on the show, we meet the man who stole my door and who gave us the hell that is the open office.\nFOUNTAIN: Oh, come on. It's pretty nice.\nVANEK SMITH: It's...\nFOUNTAIN: We have a nice office.\nVANEK SMITH: It's so bad (laughter).\nFOUNTAIN: Also, we have the inside story of one of the first open offices and all the drama that ensued. Just a heads up - this episode is a rerun. It originally ran in 2016.\n(SOUNDBITE OF BRYAN JAMES SAMMIS AND DANIEL ABRAHAM BRAUNSTEIN'S \"JUST LIKE ME\")\nVANEK SMITH: So before we get into the story of the open office, I'll introduce you to one of the people who ended up working there. His name is Paul Spencer (ph), and he works in advertising.\nDo you have any campaigns that you're particularly proud of?\nPAUL SPENCER: Well, the one I'm most famous for and I'm still coasting on decades later is for the New York Lottery. Hey, you never know. That was me.\nVANEK SMITH: That was you?\nSPENCER: That was me.\nVANEK SMITH: No way.\nSPENCER: Yeah. Yeah, so...\nVANEK SMITH: Wow. You've probably sold a lot of lottery tickets.\nSPENCER: I know.\nVANEK SMITH: Back in 1994, Paul was just starting out in his career. He was freelancing, and he got a call from Chiat\\Day. It was, like, the hottest ad agency in New York.\nSPENCER: Chiat was a prestigious place. You know, you were really creative if you were there. And you wanted to be able to say, yeah, I was at Chiat. Yeah. No big deal.\nFOUNTAIN: Yeah. You know, no big deal. They just made the Energizer Bunny famous and made a bunch of Super Bowl ads. No big deal. Just, like, the most creative people you could put in a room in New York advertising at the time. That was Chiat\\Day. And at the time Paul got the call, all of New York was buzzing about Chiat\\Day's new office.\nVANEK SMITH: As the story goes, the CEO of Chiat\\Day, Jay Chiat, had a vision on the ski slopes of Telluride.\nFOUNTAIN: As one does.\nVANEK SMITH: As one does, of a totally new workspace.\nFOUNTAIN: So he hired this super-famous architect to build it for him. His name, Gaetano Pesce.\nGAETANO PESCE: Gaetano Pesce, Italian, from Venice. I am 76, and I work on the field of creativity.\nVANEK SMITH: This is the man who stole my door.\nFOUNTAIN: Deep breaths, Stacey. Deep breaths.\nVANEK SMITH: (Laughter).\nFOUNTAIN: For what turned out to be such a big moment in office history, the instructions that Jay Chiat gave Gaetano, they were pretty vague.\nVANEK SMITH: What did he say when he came to you?\nPESCE: He wanted an office without paper.\nVANEK SMITH: An office without paper?\nPESCE: Yes.\nVANEK SMITH: So this sounds kind of mundane. But if you think about it, this was profound. I mean, most of the things we think of as being associated with an office are essentially paper-management devices - staplers, hole punches, file folders, file cabinets. And, if you think about it, even desks are pretty much just there to hold paper. But this was 1994. You didn't really need paper all that much anymore. There were laptops. There was email.\nFOUNTAIN: The office, it was kind of just a holdover from a more primitive time. And these guys, they were trying to reinvent the office, start anew.\nVANEK SMITH: Gaetano Pesce was given a blank slate, the entire floor of a skyscraper in lower Manhattan, 29,000 square feet. So he went down to check it out.\nPESCE: Yes, I remember. It was in the evening, this place was raw, empty, with bulbs that touched to the ceiling.\nVANEK SMITH: What did you think when you saw it?\nPESCE: I start to think, you don't need the office.\nFOUNTAIN: You don't need the office.\nVANEK SMITH: Gaetano Pesce started sketching out designs for this new office, the likes of which the world had never seen. It looked like a giant living room.\nPESCE: It was an open space with a lot of corners, with a sofa, comfortable chair, with a coffee shop because I think people when they meet, they like to have a drink. They like to eat.\nFOUNTAIN: This was radical. At the time - remember, it's 1994 - your typical workplace was all about cubicles. Everything was uniform. Everything was efficient. There were neutral colors. And Gaetano was going to build a big living room with a coffee shop.\nVANEK SMITH: There was also a Ping-Pong table, a giant staircase to nowhere and, the piece de resistance, the floor - poured plastic resin. And not beige, or white or any normal color. It was the color of a tangerine with all these red, yellow and blue designs, like arrows, and big loops and words poured by Gaetano himself, who had to walk around with special spiky shoes while it was drying.\nFOUNTAIN: The way he tells it, his inspiration was pretty much whatever he was thinking about that day.\nPESCE: I remember in the corner one day when they were doing the floor, I was thinking, Venice. I put the arrow on the floor. At the end, they write Venice because that was the direction of Venice.\nVANEK SMITH: You know, east?\n(LAUGHTER)\nVANEK SMITH: Venice is east.\nFOUNTAIN: The desks in this office were all on wheels, and the chairs were plastic with coiled springs for legs.\nVANEK SMITH: And critics went crazy over this new office. Here's a quote from The New York Times Magazine. It said, the workers seemed to be traveling through some new, improved dimension. These young, Gap-garbed hotshots go breezing by. They pace, they stride, they circle, gesticulating with one hand, clutching a cellular phone in the other. Or, they briefly touch down at a computer console, one of a cluster of free-floating work stations that can be wheeled around the floor to take advantage of the spectacular skyline views. Thumbs up.\nI think that's a really long-winded for thumbs up.\nFOUNTAIN: Two thumbs up.\nVANEK SMITH: Two thumbs up.\nFOUNTAIN: So many people wanted to see the office, Chiat\\Day started arranging tours.\nVANEK SMITH: And this is the office that Paul Spencer walked into on his first day. That was the guy you heard from in the beginning who had just taken this exciting new job, his dream job. And when he showed up, he was almost as excited to see the office as he was to start working there. The elevator took him up to the 38th floor, and he walked into the office of the future.\nSPENCER: You know, I just remember a lot of orange and taupe colors, and there was a design. Like, drawings and paintings built into the floor. It was, like, there was kind of a rubbery coat over it. And it felt good. I remember thinking, wow, this is great. This is so beautiful.\nVANEK SMITH: Here he was, at one of the most creative places to work in advertising and in the most creative office space he had ever seen. This was not a bland cubicle farm. This was inspiring.\nFOUNTAIN: Paul walks up to the reception desk. They had this cool system where you would check out a laptop and a cellphone for the day. And the laptops and cellphones were kept in these lockers that looked pretty cool. They looked like they were out of a movie.\nSPENCER: You know, like a police drama where they're, like, unlocking metal cages and giving you your .38 revolver, whatever. It was, like, wow, I'm going into creative battle.\nVANEK SMITH: Paul met up with this guy he was going to partner with, this art director named Mike. And he said, hey, Mike. It's so nice to meet you. This place is amazing.\nSPENCER: And he just kind of, like, shrugs and rolls his eyes.\nVANEK SMITH: And you were like, hmm.\nSPENCER: Hmm. I wonder why. I mean, it's so beautiful.\nVANEK SMITH: Paul starts his first day at work. And, a few hours later, he and Mike, the art director, are sitting in Gaetano Pesce's cafe batting around ideas for an ad for a telephone company. And Paul starts to have this weird feeling.\nSPENCER: It was kind of, like, late in the day. Looking across the table in the kitchen at Mike and, there's a problem. This place is kind of, you know, scorching my brain. It's, like, I can't focus.\nFOUNTAIN: Everything was too bright, too loud, too open.\nVANEK SMITH: And Paul was not the only one having a bad reaction to the office. Shalom Auslander was a creative director at Chiat\\Day.\nSHALOM AUSLANDER: You're kind of, like, sitting inside of a migraine.\nFOUNTAIN: (Laughter).\nAUSLANDER: Like, if you could climb inside a migraine headache, that's what that felt like.\nVANEK SMITH: It wasn't just the bright colors and the plastic floor. Although, he did say that the floor had this weird smell that gave him terrible headaches. Shalom says the real problem was the openness.\nFOUNTAIN: Extreme openness, right? 'Cause once you got your laptop and your cellphone, you had no idea where to go.\nAUSLANDER: For me, it was a very unmoored kind of feeling. So you spend a lot of time - I walked a lot. I walked a lot because I was constantly walking around and around - you know, hey, did you see John? Yeah. He's in that room, or he's in that room or (laughter) no, no, he just left to that room - and passing other people who were walking around in the other direction looking for people.\nVANEK SMITH: And, all of this stuff, the personal stuff that the old style of office had contained, it all came spilling out in this big, open space.\nAUSLANDER: And the saddest element of it is that you'd see somebody with a phone, just a poor human being (laughter) in this awful plasticness with a phone pressed to their ear. And clearly something was going on. They were getting divorced, somebody was dying, something human was happening on the other end of that phone. And they're just walking around, and all they're saying is, hang on, hang on, hang on, let me find somewhere, hang on. Hey, Jim. How you doing? Hey. No. Wait. Hang on, hang on. And just, like, desperately - and going into some dark corner somewhere and just sitting there with their heads in their hands trying to have some interaction with an actual human being.\nFOUNTAIN: Shalom says he just couldn't get any work done.\nVANEK SMITH: Did you have, like, coping mechanisms?\nAUSLANDER: Yeah. It was called my house.\n(Laughter).\nAUSLANDER: I would go to my house, which did not have plastic floors, or hives, or nooks, or work crannies or whatever else they called it. I would just go home and sit at my ordinary kitchen table and have an ordinary martini and figure out some commercial for whatever and go back the next day and act like I'd been there.\nVANEK SMITH: Paul Spencer told me he started to hate the open office, and he felt really bad about it. He felt like maybe he wasn't cool enough, or maybe somehow he was failing the space.\nFOUNTAIN: It's like this whole thing was a big, big experiment to figure out what would happen if you freed people from cubicles, from their cages. What potential can be realized when you let people run free?\nVANEK SMITH: It turns out people realized they just really wanted walls.\nFOUNTAIN: Paul says he would walk into the office looking for his colleagues, and he'd find them in the few places with doors, with walls - the conference rooms.\nSPENCER: Clearly, there was, like, tribal happenings going on there where people had, like, camped out in, like, little conference rooms that were supposed to be just, you know, temporary. You would come in and, you know...\nVANEK SMITH: They had, like, taken them over?\nSPENCER: They'd be like - and they'd be, like, get the hell out. This is mine. You know? They'd, like, take over a corner, and they're like, we're in here. And it was, like, all about kind of getting in and getting your corner early.\nAUSLANDER: You felt like you were part of somebody's idea of how people were supposed to be. But we're not really that way.\nVANEK SMITH: The architect of this space, Gaetano Pesce, would drop by to visit his creation. And he told me, yes, he did hear this complaint that the open office thing was just not working for some people.\nDoes that make you feel bad?\nPESCE: No. New things bother in the beginning. When you make something new, it's - first reaction is, I don't like.\nVANEK SMITH: I mean, do you think the open office went too far?\nPESCE: No, no. There is never too far.\nVANEK SMITH: I mean, what would you say to somebody who said, I worked in this office and, like, it was beautiful, but I couldn't get any work done?\nPESCE: Did he understand the possibility, the creativity?\nFOUNTAIN: Gaetano said he's heard from a lot of people who loved the space. And also, for what it's worth, these did turn out to be some of the most creative years for Chiat\\Day. They came up with the famous Apple Think Different campaign, with the Taco Bell chihuahua...\nVANEK SMITH: Yo quiero Taco Bell?\nFOUNTAIN: That one.\nVANEK SMITH: And other companies looked at Chiat\\Day's office space and they said, I want that. The open office seemed exciting. It was cool. People could communicate and collaborate really easily.\nFOUNTAIN: And, added plus - it was cheaper. You could fit more people into a smaller space, save on rent.\nVANEK SMITH: In the end, though, the Chiat\\Day open office experiment was short-lived. Chiat\\Day was doing so well, it got bought up by another company, a much bigger company that moved them out of this office and into a much more traditional space. Just a few years after they'd moved into this crazy, new, open office, they moved out.\nFOUNTAIN: Gaetano's creation was dismantled. Architecture critics started calling it a failure, a good idea taken too far.\nVANEK SMITH: But the office didn't die entirely. In fact, Gaetano Pesce started seeing pieces of it all over the place. He saw one of the rolling desks in Milan, a plastic chair in Paris, a piece of a wall panel in Aspen.\nPESCE: The office was exploded around the world.\nVANEK SMITH: It really was an open office.\nPESCE: Yes. It was.\nVANEK SMITH: Shalom Auslander and Paul Spencer both eventually left Chiat\\Day. But they said everywhere they went, this office followed them.\nFOUNTAIN: It followed all of us. If you look at pictures of the old Chiat\\Day and you look at pictures of Google or Facebook or the NPR headquarters in D.C., they look the same.\nVANEK SMITH: The open office in some form is everywhere. It's inescapable.\nAUSLANDER: When I die, I am going to hell. And it is going - they've definitely gone over to open space.\nVANEK SMITH: (Laughter). So Nick, I have been working in this office with you guys for almost two years now.\nFOUNTAIN: Yeah.\nVANEK SMITH: And, even though I had my doubts in the beginning, I have to say there are some things that I really like about it. I feel like my ideas get a lot better because we're always batting them around all the time. And I feel like I laugh a lot more than I did when I was working in a room by myself. I think I'm actually happier.\nFOUNTAIN: Yeah. I feel like this is the most collaborative and funny place I've ever worked. And I think for all of us, there's a larger, just human experience point to make here, which is that as human beings, we crave human interaction. We like to be around other humans.\nVANEK SMITH: Yes. That's true. All of those things are true. And sometimes I just want you guys to stop [expletive] talking (laughter).\nGOLDSTEIN: I'll tell you what. I had a piece of chicken. So I went to Hale and Hearty...\nVANEK SMITH: I stopped caring (laughter). I'm sorry.\n(SOUNDBITE OF EMANUEL KALLINS AND STEVE SKINNER'S \"FEEL GOOD GROOVE\")\nFOUNTAIN: All right. So we've left the NPR office.\nVANEK SMITH: Yes.\nFOUNTAIN: Why have you taken me here?\nVANEK SMITH: This is the one quiet place on the floor of our whole building. It is a dead-end hallway right next to a fire exit, and you always see people in this hallway making private calls.\nFOUNTAIN: Or, I guess, doing the credits.\n(SOUNDBITE OF EMANUEL KALLINS AND STEVE SKINNER'S \"FEEL GOOD GROOVE\")\nFOUNTAIN: If you have any horror stories from your open office experiences, please send us an email. You can send it to planetmoney@npr.org.\nVANEK SMITH: Or you can tweet us, @planetmoney.\nFOUNTAIN: I'm @nickfountain.\nVANEK SMITH: And I'm @svaneksmith.\nFOUNTAIN: Special thanks to Sally Helm, who produced today's podcast. Thank you, Sally.\nVANEK SMITH: Thanks, Sally. And we would also, of course, like to thank our wonderful colleagues. They might be loud, but we love them very much. We would not change them if we could. Maybe just the volume.\nFOUNTAIN: I'm Nick Fountain.\nVANEK SMITH: And I'm Stacey Vanek Smith. Thanks for listening.\n(SOUNDBITE OF EMANUEL KALLINS AND STEVE SKINNER'S \"FEEL GOOD GROOVE\")\nFOUNTAIN: All right. We have a little challenge for you, dear listener. Let's see if you can deal with what we deal with every day, the banter that happens. Can you do this challenge?\nVANEK SMITH: It is called the Open Office Challenge, and here it is. For the next 30 seconds, name all the state capitals you can. And, go.\nUNIDENTIFIED PERSON #1: It's the great thing. There was one guy who thought this up who was like, hey. You know, it's to take the gold to Milan. He's like, I think I should take my gold here.\n(LAUGHTER)\nUNIDENTIFIED PERSON #1: Wait a minute. Stop the ship. Stop the ship. (Laughter).\nUNIDENTIFIED PERSON #2: Like, with the two ships passing each other kind of got an identical amount of gold.\nUNIDENTIFIED PERSON #1: (Laughter). Wait a minute. Wait.\nUNIDENTIFIED PERSON #2: And they both hit each other.\nUNIDENTIFIED PERSON #1: (Laughter) As they're sinking to the bottom of the ocean with all the gold, like, we did it.\nUNIDENTIFIED PERSON #3: I have a to-go.\nVANEK SMITH: OK. Time. How many did you get, Nick?\nFOUNTAIN: Five.\nVANEK SMITH: That's better than I did.\nCopyright © 2018 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=636667382"}
