{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 21:15:23","date_modify":"2018-10-30 21:15:23","date_publish":"2015-01-27 17:55:30","description":"Tuesday marks the seventieth anniversary of the liberation of the Nazi Auschwitz death camp in southern Poland. The Nazis who ran the execution site were responsible for the slaughter of over one million people within a five-year timespan, with the vast majority of them being Jews. In Auschwitz alone, from 1940-1945, the Nazis killed roughly six-hundred people per day, twenty-five per hour, one every 144 seconds. |","filename":"data/vaneerConsumption/70YearsAfterAuschwitzAntiSemitismRemainsMorePrevalentThanEver.json","image_url":"https://media.breitbart.com/media/2015/01/auschwitz-death-camp-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_01_27__1540934123.html","title":"70 Years After Auschwitz, Anti-Semitism Remains More Prevalent Than Ever","title_page":"70 Years After Auschwitz, Anti-Semitism Remains More Prevalent Than Ever | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Tuesday marks the seventieth anniversary of the liberation of the Nazi Auschwitz death camp in southern Poland. The Nazis who ran the execution site were responsible for the slaughter of over one million people within a five-year timespan, with the vast majority of them being Jews. In Auschwitz alone, from 1940-1945, the Nazis killed roughly six-hundred people per day, twenty-five per hour, one every 144 seconds.\nAbout 300 Auschwitz survivors returned to the Nazi death camp on Tuesday. They were greeted by several heads of state and top governmental officials.\nThe Germans had turned Poland into a “cemetery for Jews,” Polish President Bronislaw Komorowski said in his welcome speech, according to the BBC.\nThe Polish President’s sentiments are shared by many European leaders. However, too many quickly forget that Nazism was a pan-European movement, and not just one that took place inside Germany’s borders. There were countless Polish and French Nazis, as well as Nazis from Hungary, The Netherlands, Belgium, and many other countries.\n“I lived my mother’s dream to see the oppressor defeated,” Auschwitz survivor Halina Birenbaum said defiantly. She elaborated on how anti-Semitism remains, unfortunately, a worldwide problem in 2015.\nHolocaust survivor Renee Salt, 85, told the BBC that she has gone back to Auschwitz every year for the past ten years. “I’ll do it for as long as I can. Why? There are still a lot of Holocaust-deniers the world over and if we don’t speak out, the world won’t know what happened,” Salt explained.\nBoth the German and French Presidents were on hand at Auschwitz to commemorate the anniversary. Russian President Vladimir Putin was not at the ceremony due to diplomatic disputes with Poland, but attended a Moscow observance to commemorate the day with the country’s Chief Rabbi. U.S. President Barack Obama sent Treasury Secretary Jack Lew to the commemoration ceremony. President Obama was instead in Saudi Arabia on Tuesday to pay his respects to the country’s late dictator, King Abdullah, in a place where Israeli Jews are not welcome for “political” reasons.\nAnti-Semitism remains a global issue, but one that has gotten much worse in Europe in recent years. Much of this has been attributed to Islamic anti-Semitism. In some major European cities, Jews remain simply unwelcome, and showcasing one’s Jewish faith may result in threats and physical attacks. In the Islamic world, seventy-four percent of the population shares anti-Semitic sentiments, according to the Anti Defamation League. The ADL found in a recent global survey that 1.1 Billion people worldwide harbor anti-Semitic attitudes.","url":"https://www.breitbart.com/national-security/2015/01/27/70-years-after-auschwitz-anti-semitism-remains-more-prevalent-than-ever/"}
