{"authors":["Press Association"],"date_download":"2018-10-22 20:08:36","date_modify":"2018-10-22 20:08:36","date_publish":"2016-01-29 00:32:17","description":"More than three quarters of people polled about drink driving support reducing the limit in England and Wales to the same as Scotland, an alcohol health grou...","filename":"data/vaneerConsumption/77supportlowerdrinkdrivinglimitsaysalcoholhealthgroup.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-daeac208-91f9-4f82-bff6-e863016ea63a-4PuZeKVXE7cd9005b2c8762d2618-832_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3421954_77-support-lower-drink-driving-limit-says-alcohol-health-group_1540238916.html","title":"77% support lower drink-driving limit, says alcohol health group","title_page":"77% support lower drink-driving limit, says alcohol health group | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"77% support lower drink-driving limit, says alcohol health group\nMore than three quarters of people polled about drink driving support reducing the limit in England and Wales to the same as Scotland, an alcohol health group has said.\nThe findings were published on the day the House of Lords will debate a Private Members' Bill on dropping the limit from 80mg of alcohol in 100ml of blood to 50mg.\nThe current limit in England and Wales is the highest in Europe, with the exception of Malta, the Alcohol Health Alliance (AHA) said.\nThree quarters of people support a reduced drink drive limit, a survey suggests\nIn the three months after Scotland lowered its drink-driving limit to 50mg in 2014, alcohol-related road traffic offences went down 17%, it said.\nResearch has shown that lowering the limit in line with Scotland would save more than 100 lives a year and £300 million in costs to the emergency services and hospitals.\nThe AHA polled 4,869 people and found 77% people support a 50mg limit to bring England and Wales in line with Scotland.\nBacking the call was double-gold and silver Paralympic cyclist Simon Richardson, who has twice been hit by drink drivers and retired from his sport as a result.\nHe said: \"In 2011 a drink driver almost killed me.\n\"240 other people weren't so 'lucky'.\n\"I lived, but my health was destroyed, as well as my dreams of competing at the London 2012 Paralympic Games.\n\"As a previous Paralympic twin gold medal winner and cycling world record holder I should have been part of the 2012 success story.\n\"My daily pain does not register as one of the annual drink-drive fatality statistics that has refused to fall since 2010.\"\nAHA chairman Professor Sir Ian Gilmore said: \"Studies consistently show that reducing the drink driving limit clearly reduces the risk of road traffic collisions by changing the behaviour of those likely to drink and drive.\n\"The North Review of drink-driving law, Nice, the World Health Organisation and countless others recommend we lower the limit to 50mg/100ml, and it is now time that Parliament votes to lower it.\"\nGary Rae, campaigns director for the road safety charity Brake, advocated a zero drink-drive limit and said reducing it was a step towards that.\n\"One in seven UK road deaths result from crashes where the driver was over the drink-drive limit,\" he said.","url":"https://www.dailymail.co.uk/wires/pa/article-3421954/77-support-lower-drink-driving-limit-says-alcohol-health-group.html"}
