{"authors":[],"date_download":"2018-10-30 20:51:37","date_modify":"2018-10-30 20:51:37","date_publish":"2015-08-28 04:00:00","description":"Not many people know that the idea behind one of Atlanta's most innovative urban projects — the Atlanta Beltline — was first introduced as a master's degree thesis.","filename":"data/vaneerConsumption/7amazingAtlantaBeltlineartworkstocheckout.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/MyAJC/2015/08/27/Images/photos.medleyphoto.8035320.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_amazing-atlanta-beltline-artworks-check-out__1540932697.html","title":"7 amazing Atlanta Beltline artworks to check out","title_page":"7 amazing Atlanta Beltline artworks to check out","title_rss":"NULL","source_domain":"ajc.com","text":"Not many people know that the idea behind one of Atlanta's most innovative urban projects — the Atlanta Beltline — was first introduced as a master's degree thesis.\nIn 1999, Georgia Tech graduate student Ryan Gravel advocated for repurposing the old railroad tracks to revitalize existing neighborhoods and create a new way of life for people in the city.\nSeventeen years later, the thesis is halfway towards its full realization. The blueprint calls for the 22-mile loop to be completed by 2030. Construction costs are covered by both public and private sources.\nThe most well-known and completed stretch of the Beltline is the Eastside trail, which runs from Piedmont Park to Krog Street Market. It also passes the old Sears, Roebuck & Co. warehouse and distribution center, now revived as Ponce City Market.\nSeven amazing pieces of art on the Atlanta Beltline\n1. Hense\nAlex Brewer, also known as the artist Hense, has several mind-blowing colorful murals in the Atlanta area.\nOne of the most popular murals is under Virginia Avenue near Piedmont Park.\nBrewer, born in Atlanta, has more local art in downtown Atlanta as part of the South Broad Mural Project and the Westside Cultural Arts Center in West Midtown.\n2. Tiny Doors ATL\nThese tiny doors have been popping up all over Atlanta since late last year, with a few near Paris on Ponce and under Freedom Parkway near the Fourth Ward Skatepark.\nThe artist cooperative's intricately designed projects have become an interactive part of the community.\n“You’re going about your life, and it surprises you,” says Sarah Meng, co-director of Tiny Doors ATL, about what it's like to work on the project.\n3. 247 Timestar\nThis structure by Charlie Blackcat Smith overlooks the Old Fourth Ward Skatepark.\n4. Cool Stuff by olive47\nThe collaboration between Yik Yak and olive47 lives at Ice Box Cool Stuff and greets Beltline runners coming from Krog Street Market. And yes, we do love ATL.\n5. \"The Highball Artist\" mural by Hadley Breckenridge\n\"Highball\" is railroad slang for an engineer who runs the train at high speeds. This mural, with its ribbons of bright colors, look like a train sped right through it. This mural can be found on the Westside Trail under the Lucile Avenue bridge.\n6. \"Object of Wo(man) by William Massey\nYou can't miss this mindtrick under the Freedom Parkway near the Fourth Ward Skatepark.\n7. Teenage Mutant Ninja Kermit\nThis quirky mural is in Old Fourth Ward On Bradley Street SE near the intersection of Bradley and Decatur Street SE (AKA DeKalb Ave.) Bradley is the street nearest the Thumbs Up Diner on Edgewood Ave. and it runs one way to Decatur St. so Edgewood is your route to Kermit. You can also see him traveling east on Decatur St./DeKalb Ave. depending on traffic.","url":"https://www.ajc.com/news/local/amazing-atlanta-beltline-artworks-check-out/ab9j8sCVTEsTzpPEHyPrnM/"}
