{"authors":["Eva Taylor Grant"],"date_download":"2018-10-31 01:46:13","date_modify":"2018-10-31 01:46:13","date_publish":"2018-09-11 17:30:15","description":"Many long-term couples see growing old together as a romantic, dreamy ideal. Yet the stereotype of the bickering older couple still prevails. It's possible this is because, whether or not they end up being the kiss of death in a relationship, there…","filename":"data/vaneerConsumption/7ArgumentsThatDontGoAwayAfterTheFirstYearOfYourRelationship.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/e97143e8-64e1-4bf8-9334-6c14822d2090-zaeh_bustle_aug2015-468.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_7-arguments-that-dont-go-away-after-the-first-year-of-your-relationship-11782943_1540950373.html","title":"7 Arguments That Don't Go Away After The First Year Of Your Relationship","title_page":"7 Arguments That Don't Go Away After The First Year Of Your Relationship","title_rss":"NULL","source_domain":"bustle.com","text":"Many long-term couples see growing old together as a romantic, dreamy ideal. Yet the stereotype of the bickering older couple still prevails. It's possible this is because, whether or not they end up being the kiss of death in a relationship, there are certain argument couples may not be able to get past. If you and your partner are early on, but already seem to be having the same fight over and over, it's possible it will continue down the line.\n“I believe there are certain arguments in a relationship that [can be] impossible to overcome,\" LGBT-affirming therapist Katie Leikam tells Bustle. \"Those are primarily arguments that are based on value and moral judgements because thought arguments are based in thought and belief systems that are very difficult to change.\" Whether or not you and your partner feel comfortable allowing room for a major disagreement in your relationship is up to a variety of factors, but if you settle into this reality you may still end up butting heads from time to time.\n\"The deeper purpose of the committed relationship, or marriage, is to be able to accept differences and stay connected, despite them,\" licensed marriage and family therapist (LMFT) Evie Shafner tells Bustle. \"We need to know how to talk and listen in a way that helps us maintain that connection, not destroy it.\" With proper counseling, there's always a possibility of fixing your relationship problems, and solving an argument.\nAnd even if you cannot overcome one of these differences, you may be able to learn how to argue in a healthier way. So don't panic just yet. Here are seven arguments that you may not get past after the first year.\n1 Who You Can Be Friends With Andrew Zaeh for Bustle If you and your partner already disagree about who can be friends with whom, you likely have landed on a sticking point that will exist for the remainder of your relationship. One common argument couples may continue to have is whether or not their partner is allowed to hang out with people of the opposite sex, people who they might be attracted to, or people they've previously dated. \"This is often a value-based argument and one that can be rooted in jealousy, it can also be rooted in upbringing or values and religion,\" Leikam says. Even if you and your partner can find an equilibrium that balances respect and the potential for jealousy, it's likely that the argument will creep back up. If it seems like your partner is trying to set rules for you, however, it could be a dangerous form of control or a potential sign of emotional abuse. It is then worth examining whether or not these behaviors are healthy for you with the help of a loved one or a therapist.\n2 How You Might Discipline Your Children Andrew Zaeh for Bustle If you and your partner are less than a year in, but have already butted heads on how children should be raised, that's a red flag that this argument will continue well into the future. “[Another common argument is about] how you discipline your [potential] children,\" Leikam says. \"Often this is also a belief system brought on by how you are raised and values and belief systems. These values are difficult to change from childhood.\" That means that if, at a meet-the-family gathering, you two ended up fighting about how a child is being punished, this argument may come around again soon. It's hard to change perspectives on something so engrained.\n3 Arguments About Each Others' Families Andrew Zaeh for Bustle Another issue that often comes up during the first year and then doesn't go away is the issue of family. If you're early on in your relationship and already butting heads because you don't like each other's family, you may keep having this fight for the foreseeable future. “These [inter-family] relationships can grow stronger as time goes on, but if one of you doesn't like the other's family, that can lead to splitting among you and that splitting is difficult to overcome because it forces your partner to choose between two people they love,\" Leikam says. \"It's a really difficult situation to put your partner in.” It's hard to be on both sides of this argument, so even if you find a way around it, it may creep back in from time to time and cause some stress. Finding a couples' counselor you both like can help you two work through this issue together if you're committed to staying together.\n4 Opposing Religious Views Andrew Zaeh for Bustle A lot of these arguments are based on deep-rooted beliefs, and for some people there is nothing more deeply-rooted for them than their religious beliefs. That means that if you and your new partner have already began to argue about life, the afterlife, or other aspects of faith, you may continue to see this argument come up for the future of your relationship. “If you highly value your faith or religious beliefs, and these shape how you live your life, but your partner is an atheist, you may continue in the relationship with your partner being opposed to something that is especially important to you,\" Julie Williamson, Licensed Professional Counselor, tells Bustle. \"As a result, you won't be able to share this very important piece of your life with them, which could cause you to compartmentalize your partner and your faith, instead of having an authentic relationship where you can share all aspects of your life, even if you're not on the same page.\" This doesn't mean you can't love each other and have different views, but it does indicate that you may have a recurring argument down the line.\n5 Arguments About Your Wellbeing Andrew Zaeh for Bustle If you have yet to approach your first anniversary, but one of you is already concerned enough about the other's wellbeing for it to become an argument, you may not be able to get past that as the relationship progresses. \"[It's a bad sign to be] arguing over negative patterns of behavior, [like] if you notice that your partner copes with difficult emotions by using drugs or alcohol instead of facing the problem,\" Williamson says. \"If you've spoken with your partner about your concern for their well-being, physically and emotionally, and they refuse to change or seek help, this may be a sign of their disregard for your feelings or of a deeper problem, such as an addiction or inability to cope in healthy ways.\" While it is possible to love and stay with someone through one of these issues, be sure to look out for your own wellbeing, and seek the help of a therapist if things become particularly challenging. Editor's Note: If you or someone you know is seeking help for substance use, call the SAMHSA National Helpline at 1-800-662-HELP(4357).\n6 Arguments Where Your Partner Doesn't Listen To You Ashley Batz/Bustle Not all of the arguments that are most likely to recur throughout the lifespan of a relationship are centered around beliefs; some are centered around actions. If your partner has already displayed that they have a tendency to tune you out, that's less likely than other arguments to improve over time. \"An example of your partner being unwilling to listen to you would look like avoiding [or] emotionally distancing themselves from you, either by refusing to talk about problems, using sarcasm, or resorting to verbally abusive or derogatory comments,\" Williamson says. While these issues can be overcome, they may be a point of contention if your relationship lasts past the first year. And if your partner consistently stonewalls you or withholds affection, it is possible that the behavior is abusive, and seeking the help of a therapist or loved one can give you the confidence to prioritize your safety and wellbeing.","url":"https://www.bustle.com/p/7-arguments-that-dont-go-away-after-the-first-year-of-your-relationship-11782943"}
