{"authors":["Awr Hawkins"],"date_download":"2018-10-30 18:56:15","date_modify":"2018-10-30 18:56:15","date_publish":"2015-12-03 00:35:09","description":"With the gunmen in the San Bernardino attack still on the loose, celebrities began tweeting for more gun control.","filename":"data/vaneerConsumption/7CelebsWhoTweetedHotTakesonSanBernardinoMassacreBeforeFactsCameIn.json","image_url":"https://media.breitbart.com/media/2015/12/Olivia-Wilde-1-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_12_02__1540925775.html","title":"7 Celebs Who Tweeted Hot Takes on San Bernardino Massacre Before Facts Came In","title_page":"7 Celebs Who Tweeted Hot Takes on San Bernardino Massacre Before Facts Came In","title_rss":"NULL","source_domain":"breitbart.com","text":"With the gunmen in the San Bernardino attack still on the loose and no description of the gunmen beyond clothing being reported, celebrities Amy Schumer, Zoe Kazan, Olivia Wilde, Elizabeth Banks, Josh Gad, Billy Eichner, and Moby tweeted for more gun control.\nZoe Kazan led the pack by asking Hillary Clinton to step in and help secure gun control. Kazan tweeted, “Hillary Clinton help us mobilize. How can I use my powers as a citizen to help bring greater gun control to my country? How can I act NOW?” Olivia Wilde responded to Kazan’s tweet by tweeting, “I am with you.”\nNext came Pixel’s Josh Gad, who tweeted, “How many times a month, week, or day must there be mass shootings 4 us to demand gun control? #WhenIsEnoughEnough? Beyond sad. Prayers 2 all.”\nGad was followed by Billy Eichner, who responded to people offering thoughts and prayers for victims by tweeting, “Your ‘thoughts and prayers’ don’t mean a damn thing. #GunControlNOW.”\nAmy Schumer tweeted next, writing, “It doesn’t have to be this way. join the movement and help us.” She asked people to go to WeCanEndGunViolence.org to help secure gun control.\nThen Elizabeth Banks tweeted, “If you are as disgusted by the killing of innocent Americans by ‘long guns’ as I am, support Every Town and Moms Demand.”\nSinger-songwriter Moby tweeted, “Isn’t there one ‪#republican with the courage to stand up to the ‪@NRA? what a bunch of fucking cowards, taking blood money from devils.”\nNone of the Hollywood personalities mentioned that California has some of the most stringent gun controls of any state in the US, including expanded background checks and registration requirements for “assault weapons.”\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/entertainment/2015/12/02/hollywood-weighs-early-san-bernardino-shooting-calls-gun-control/"}
