{"authors":["Cynthia Howell"],"date_download":"2018-10-30 18:41:11","date_modify":"2018-10-30 18:41:11","date_publish":"2016-01-23 03:08:00","description":"Existing open-enrollment charter school groups are planning to open as many as seven new campuses -- including five in the Little Rock School District over three years -- if their pending applications are approved by state officials in the coming weeks.","filename":"data/vaneerConsumption/7chartercampusesproposed.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_jan_23__1540924871.html","title":"7 charter campuses proposed","title_page":"7 charter campuses proposed","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Existing open-enrollment charter school groups are planning to open as many as seven new campuses -- including five in the Little Rock School District over three years -- if their pending applications are approved by state officials in the coming weeks.\nIf the proposals are approved, the number of new charter seats in Pulaski County alone would accommodate about 3,000 more students.\nLISA Academy, which operates charter campuses in Little Rock and Sherwood, has applied to the state to open a elementary school for kindergarten through sixth grade in a former movie theater that is now a private technical college off Bowman Road in west Little Rock.\nThe eSTEM Public Charter Schools, based in downtown Little Rock, would open an additional elementary school and an additional adjoining junior high on Shall Street near Heifer Project headquarters, and move the 10th- through-12th grades of its existing downtown high school to the University of Arkansas at Little Rock.\nQuest Middle School of West Little Rock, to be renamed Quest West Little Rock in July, has proposed a sixth-grade school to open on Hardin Road off Financial Parkway -- which would be in an addition to the existing Quest campus on Rahling Road.\nOutside Pulaski County, Haas Hall Academy charter school -- which already has campuses in Fayetteville and Bentonville for grades seven through 12 -- wants to replicate its program at a 360-student school in the Jones Center for Families in Springdale.\nAnd KIPP: Delta Public Schools, headquartered in Helena-West Helena, has applied to the state to establish a new campus and reconfigure the grade span of its existing schools in Blytheville -- making use of the former Central Elementary School, which has been purchased from the Blytheville School District.\nAdditionally, Quest Pine Bluff charter school is seeking to expand the number of grades it serves.\nFuture School of Fort Smith, approved in late 2015 for opening in August 2016, is asking for an address change to the former Girls Inc. building at 622 N. Seventh St.\nThe state's Charter Authorizing Panel, made up of the Arkansas Department of Education's deputy and assistant commissioners as well as other top-level staff members, will conduct hearings on each of the applications for amendments to existing charters at a three-day meeting set for Feb. 17-19.\nThe decisions of the panel are subject to review by the nine-member Arkansas Board of Education, which can accept the panel's decisions or conduct its own hearing on an application. The state Education Board can conduct a hearing either on its own initiative or at the request of the charter organization or the local, traditional school district that will be in competition with a proposed charter school.\nIn recent months, the authorizing panel and the state Education Board have already approved two entirely new open-enrollment charter schools -- Future School of Fort Smith and Arkansas Connections Academy based in Bentonville -- and one new campus attached to an existing charter for opening in August, Scott Charter School, which will be operated by Academics Plus Charter Schools in the Scott community of east Pulaski County.\nThe latest applications for amendments to charters for public but independently operated charter schools were submitted to the Department of Education earlier this month.\nBaker Kurrus, the state-appointed superintendent of the Little Rock School District, said Thursday that he had the charter applications on his desk but it will be state Education Commissioner Johnny Key's call, not his, on whether to oppose the establishment of more charter schools in the state's largest traditional school district of about 24,000 students.\nThe Little Rock district is under state control because six of its 48 schools are labeled as academically distressed. That's the result of chronically low student scores on state math and literacy tests.\n\"I'm the executive officer and the School Board has to make a decision -- that's the commissioner,\" Kurrus said about the chain of command in the state-controlled system. \"I'm very familiar with the applications, and I'll talk to the commissioner and give him my thoughts. He will have to guide me on that from a policy standpoint.\n\"Everybody is running at our middle-income students,\" Kurrus added about the charter school planners. He said the eSTEM and LISA schools have a high level of student affluence -- as indicated by eligibility for subsidized school meals -- that is topped by only three of Little Rock's elementary schools, Forest Park, Jefferson and Roberts elementaries. Students from more affluent families typically score higher on state tests than students from low-income families.\n\"That's the secret to all of this,\" Kurrus said. \"Look at who they recruit. Who do they enroll? It's going to be interesting from a demographic standpoint to see where these students come from. I guess they come from Little Rock [School District] and we have excess capacity already.\"\nThe eSTEM expansion proposal, first publicly announced last fall and since tweaked, is the most ambitious of the recent round of applications. It would expand three schools in two downtown buildings to five campuses across Little Rock, and the enrollment cap would expand from 1,462 students to 3,844, an increase of 2,382.\nCurrently the organization has a kindergarten-through-eighth-grade elementary and middle school in the former Arkansas Gazette building at Third and Louisiana streets, and a ninth-through-12th-grade high school in a former Federal Reserve Bank building across Third Street.\nThe eSTEM application calls for opening in 2018-19 a kindergarten-through-sixth-grade school at 400 Shall St. and a seventh-through-ninth-grade junior high in a second building at the Shall Street address in east Little Rock. The elementary school would lease the 50,000-square-foot facility from eSTEM Public Charter Schools Inc. The 34,888-square foot junior high would do the same.\nThe former Arkansas Gazette newspaper building would house only elementary school grades K-6 . The Federal Reserve building would convert to a junior high school for grades seven through nine. Grades 10-12 would be housed in the renovated Ross and Larson halls on the UALR campus, beginning with the 2017-18 school year. There, the high school students would be able to take concurrent college courses, according to the eSTEM application.\n\"These changes are necessary to help provide the more than 6,000 students currently on our waiting list an opportunity to participate in the eStem educational program,\" said eSTEM Chief Executive Officer John Bacon in a prepared statement. \"We are excited to partner with the University of Arkansas at Little Rock to provide a unique educational experience that is unparalleled in the country.\"\nLeaders of the eSTEM charter organization have told the state that the charter amendment requests \"are integrated with and fully dependent upon each other, thus we request that they be considered in their entirety.\"\nApplications for the other charter campus additions have not been publicized as much as the eSTEM plan.\nLISA Academy last fall applied to open a new elementary campus in what is now the Nichols Furniture Store on Shackleford Road but withdrew that application because of traffic concerns.\nThe organization is now proposing a new 600-seat kindergarten-through-sixth-grade school in what is now the ITT Technical Institute building at 12200 Westhaven Drive -- a loop connecting Bowman Road and Chenal Parkway. The 31,796-square-foot building that will cost the charter group $396,572 a year in rent is a former multiauditorium movie theater.\nThe charter system is also asking for an increase in its 1,500-student enrollment cap to 2,100 students.\nThe new elementary school would be in addition to what is now a sixth-through-12th-grade LISA Academy campus that is 1.7 miles away at 23 Corporate Hill Drive off West Markham Street. That campus would become a seventh-through-12th-grade school if the elementary school opens, according to the application.\nLISA Academy North, on Landers Road in Sherwood, would continue to serve kindergarten through 12th grades.\n\"This amendment will complete the missing piece in a unified school system for K-12 education in west Little Rock,\" the application states. \"This new elementary school will also provide positive support for the existing LISA West schools\" in that it will open up space for additional students, more high school course offerings and extracurricular activities.\n\"Parents in the West Little Rock community are seeking alternative education,\" the application also said, citing 20 private schools serving more than 8,200 students and another 1,924 home school students. \"Therefore, a public school option for these families is inevitable.\"\nThe LISA Academy survey of the parents of current students at the west Little Rock middle and high school showed that those students have some 270 elementary school-aged siblings.\nThe new elementary would replicate the program at the LISA Academy North campus, including an emphasis on the STEM subjects of science, technology, engineering and mathematics; foreign language in the upper elementary grades; and the use of strategies such as tutoring and holiday practice packets to help low-performing pupils.\n\"The rigorous pace presented at the middle school level can be jarring to some students without the proper educational backgrounds,\" the LISA Academy application said. \"Therefore, an elementary school in the west Little Rock area that will provide the educational background to students is needed to be successful in the competitive world of STEM.\"\nAnother of the charter amendment requests is for Quest Middle School of West Little Rock, which is operated by Responsive Education Solutions, a Lewisville, Texas-based charter school management organization.\nThe organization is applying to move its sixth grade --which has 75 students this year -- to 400 Hardin Drive off Financial Parkway. That would free space to add more upper-level grades as prescribed by the charter. There are 233 students in sixth through ninth grades at the Rahling Road campus this year.\nResponsive Education owns the building at 400 Hardin Drive and had planned at one point in 2014 to open its entire school there until objections rose from some about the potential for traffic congestion.\nThe charter organization is asking for the sixth grade to move away from Rahling Road at a time when the Little Rock School District is opening a new middle school, starting with sixth grade in August, in the former Leisure Arts building on Ranch Drive. Both Ranch Drive and Rahling Road are in the northwest part of the city, while Hardin Road is just west of Interstate 630 and Shackleford Road. The Little Rock district is planning for 300 sixth-graders at its new campus.\nThe KIPP: Delta Public Schools' request to the state for an amendment to its charter centers on its Blytheville College Preparatory School, which serves grades four through eight and its Blytheville Collegiate High School, which houses grades nine and 10, all at 1200 Byrum Road in Blytheville.\nKIPP: Delta has purchased the vacant former Central Elementary School for $806,000 from the Blytheville School District. The charter organization is seeking permission to move grades four through six to the newly purchased site, which will eventually expand to include kindergarten through sixth grades. KIPP: Delta's currently used site -- referred to as the Sen. Steve Bryles Campus --would house grades seven through 11 in 2016-17 and add 12th grade in the following year.\nA Section on 01/23/2016","url":"https://www.arkansasonline.com/news/2016/jan/23/7-charter-campuses-proposed-20160123/"}
/23/7-charter-campuses-proposed-20160123/?page=1"}
