{"authors":["Lauren Dana"],"date_download":"2018-10-31 01:47:42","date_modify":"2018-10-31 01:47:42","date_publish":"2018-08-27 17:50:48","description":"Regardless of whether you live with your partner or not, spending the night with them can be a much needed de-stressor from your busy day. However, it's hard not to get caught up in the hustle-and-bustle of the real world. Often times, you and your…","filename":"data/vaneerConsumption/7CleverNighttimeHabitsThatllMakeYouFeelMoreConnectedtoYourPartner.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/fbb6e46c-8ef9-4634-9a7b-d6df0145aa23-2t4a0228.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_7-clever-nighttime-habits-thatll-make-you-feel-more-connected-to-your-partner-10192295_1540950462.html","title":"7 Clever Nighttime Habits That’ll Make You Feel More Connected to Your Partner","title_page":"7 Clever Nighttime Habits That’ll Make You Feel More Connected to Your Partner","title_rss":"NULL","source_domain":"bustle.com","text":"Regardless of whether you live with your partner or not, spending the night with them can be a much needed de-stressor from your busy day. However, it's hard not to get caught up in the hustle-and-bustle of the real world. Often times, you and your partner may be in the same bed, but your minds may be elsewhere. Whether one of you is reading a book while the other one is catching up on unfinished work from the day, it's hard to stay present and connected to each other. If you're looking to feel closer to your partner, there are lots of productive and intimate nighttime habits to start with your partner if you're looking to feel more connected to them.\nThese routines go beyond the obvious one of just having sex (but this is equally as important). In fact, many of these routines are just as intimate, but also super low-key and casual.\nThe first step to creating your routine with your partner is to figure out what works best for your relationship \"Create a nighttime ritual which reflects the couple's identity. Whether it's dancing to a jazz song or telling a joke, identify a routine that brings a smile to both partners' faces,\" sex expert and consultant Dr. Dorothy M. Russ, tells Bustle.\nSo whether your prefer peacefully reading together or even brushing your teeth together (if you have a big enough sink), here are some more unexpected and adorable nighttime habits that you and your partner can start, according to experts.\n1 Shower Or Bathe Together Tom Wang/fotolia Showering or bathing together may sound pretty common, but in order for the activity to truly bring you and your partner closer, you'll have to look each other in the eyes for at least four minutes. \"If you look into your partner's eyes for an extended period of time in a relaxing environment such as a bath you will naturally feel more connected,\" relationship expert Jennifer Seiter tells Bustle. Of course this doesn't have to be a staring contest, but just something to consider to make the experience even more intimate.\n2 Talk About Social Media Ashley Batz/Bustle Although social media can sometimes get a bad rap, many of us still love to browse through Snapchat, Facebook, Instagram, Twitter, Reddit, and more. Going through social media with your partner can positively impact your relationship. \"Take a couple of days a week and cull through the latest and greatest news and entertainment buzzkills,\" relationship coach Chris Armstrong tells Bustle. \"Talk about them. Laugh about them when appropriate. Most importantly, be reminded that while all of that [stuff] it happening out there, you are together and happy in bed.\" And there's something comforting about that.\n3 Create A Nighttime Saying Ashley Batz/Bustle Inside jokes can be more than just \"jokes,\" especially in long-term relationships. Silly sayings and reaffirmations of love are often times interchangeable, and serve as reassurance for your partner. \"Having inside jokes is just as important as how we greet and say goodbye to our [partner],\" Angel M. Hoodye of Flourishing Hope Counseling tells Bustle. \"Communication is key. Have a special nighttime saying you say to each other before you catch some shuteye.\"\n4 Have Sex (If You're in the Mood) Andrew Zaeh for Bustle If you're looking to get closer with your partner but also catch some z's, sex may be a good option for you if you're both up for it. A study from CQUniversity in Australia found that 64 percent of women reported improved sleep following an orgasm with their partner. \"Sexual activity that leads to climax releases endorphins and dopamine, both of which help reduce stress and calm the body,\" Chris Brantner, Certified Sleep Science Coach at SleepZoo, tells Bustle. It's definitely something to think about.\n5 Read A Book Together Hannah Burton/Bustle If you and your partner are bookworms at heart, or simply are sick of binge watching the same show over and over, try reading a book to each other out loud before bed. \"Reading a book to each other is a unique way to get closer to your partner,\" Seiter says. \"It's an activity that creates teamwork.\" So whether you're a true crime addict or a lover of rom-coms, there are literally tons of books for you and your partner to try.\n6 Express Gratitude For Each Other Andrew Zaeh for Bustle The impacts of gratitude are endless, especially when it comes to relationships. Practice gratefulness each night with your partner before you go to sleep by taking a moment to reflect what you are thankful for. \"Take a moment and talk about what you are thankful for individually and as a couple. Focus on what went well rather than the problems of the day,\" Hoodye says. For example, you could say \"I'm grateful you did the dishes when I was stuck at work,\" or, \"I'm really thankful that you were able to surprise me with flowers at my desk.\" After all, a little recognition goes a long way.","url":"https://www.bustle.com/p/7-clever-nighttime-habits-thatll-make-you-feel-more-connected-to-your-partner-10192295"}
