{"authors":["Emily Dixon"],"date_download":"2018-10-31 01:50:49","date_modify":"2018-10-31 01:50:49","date_publish":"2018-09-06 11:03:46","description":"It doesn't matter how impressive the picnic, or how passable the weather: true horror fans know that there is nothing charming about the great British countryside. From The Wicker Man, to An American Werewolf in London, to A Field in England,…","filename":"data/vaneerConsumption/7CreepyBooksSetInTheBritishCountrysideToStopYouEverLeavingTheCityAgain.json","image_url":"https://imgix.bustle.com/uploads/image/2018/5/21/5d73e306-ecd0-4170-9526-7ff37d176979-stocksy_txpb0c5fa539vx100_small_1938260.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_7-creepy-books-set-in-the-british-countryside-to-stop-you-ever-leaving-the-city-again-9115334_1540950649.html","title":"7 Creepy Books Set In The British Countryside To Stop You Ever Leaving The City Again","title_page":"7 Creepy Books Set In The British Countryside To Stop You Ever Leaving The City Again","title_rss":"NULL","source_domain":"bustle.com","text":"It doesn't matter how impressive the picnic, or how passable the weather: true horror fans know that there is nothing charming about the great British countryside. From The Wicker Man, to An American Werewolf in London, to A Field in England, countless horror filmmakers have recognised and exploited the potential for fright lurking behind the rural idyll. But horror films don't have a monopoly on the terrors of the countryside, as these creepy books set in the British countryside show.\nFrom the classics — Mary Shelley's Frankenstein, or Bram Stoker's Dracula — to more recent takes, like Susan Hill's The Woman in Black or Andrew Michael Hurley's The Loney, rural Britain has long been the setting for the starkest of literary scares. But if you're running short on time, haven't finished an entire novel since GCSE English, or just prefer your chills in the most concentrated possible form, you're best off dipping into the great British tradition of the scary short story — and there's an awful lot of them to choose from.\nTry M.R. James for what the New Yorker calls \"the very highest calibre of jolt\", or Thomas Hardy for some social commentary with your night terrors. Or combine a perfectly genteel visit to Kenilworth Castle with Kamila Shamsie's story set amongst the ruins. Strap in for some sleepless nights, horror fans: the countryside is about to get creepy.\n1 'The Wood of the Dead' — Algernon Blackwood (1906) kkgas/Stocksy It's likely you haven't heard of Algernon Blackwood, the London-born writer and journalist who died in 1951 at the age of 82. And yet he's recognised as a master of the supernatural short story genre; in his lifetime, he wrote over 200 stories, alongside novels, plays, and children's fiction. In The Wood of the Dead, a traveller's meal in a West Country inn is interrupted by a softly spoken old man whose appearance presages impending tragedy (yes, a tragedy even worse than a stranger starting a conversation when you're just trying to eat your lunch).\n2 'The Withered Arm' — Thomas Hardy (1888) Liam Grant/Stocksy Published as part of Hardy's Wessex Tales, \"The Withered Arm\" centres on isolated milkmaid Rhoda Brook and the beautiful Gertrude Lodge, newly married to the father of Rhoda's son. After Rhoda experiences a frighteningly visceral nightmare, Gertrude's arm begins to wither; Rhoda, once scorned as a witch, fears she is to blame. Hardy's not one for a meaningless narrative: his themes of choice — rural poverty, isolation, fate, gender inequality, and just everything being really really bleak — abound in \"The Withered Arm.\" Click here to buy.\n3 'Mr. Jones' — Edith Wharton (1928) Wikimedia Commons Edith Wharton, who became the first female winner of the Pulitzer Prize for Literature in 1921 after writing The Age of Innocence, turns her pen to a predicament we're all familiar with in Mr. Jones: you turn 35, a distant relative you've never met dies and bequeaths you a giant country house on the Sussex Downs, but your staff won't light you a fire in the parlour of your choice because of the very specific preferences of an invisible butler who may or may not be dead. Edith, have you been reading my diary again? Click here to buy.\n4 'Oh, Whistle, and I'll Come to You, My Lad' — M. R. James (1904) Liam Grant/Stocksy I'm 90% sure it's actually illegal to compile a list of British scary stories and exclude M. R. James, the master of the antiquarian ghost story. James was a provost at Eton and Cambridge, and his protagonists frequently reflect his academic lifestyle: in \"Oh, Whistle, and I'll Come to You, My Lad,\" published in the collection Ghost Stories of an Antiquary, the unlucky central character is Parkins, a Cambridge professor on holiday in Suffolk. Parkins finds and blows a mysterious whistle with ominous Latin inscriptions, only to invite unspeakable horrors onto himself. The story's so palpably tense that I promise you, you will not spend the entirety wondering why anyone, upon finding a whistle of unknown provenance that literally anyone could have coated in their saliva, would proceed to put it in their mouth. Parkins! What are you doing? Click here to buy.\n5 'Foreboding' — Kamila Shamsie (2017) Wikimedia Commons Shamsie wrote \"Foreboding\" for Eight Ghosts, a 2017 short story collection celebrating English Heritage sites; hers is based in Kenilworth Castle, Warwickshire, inspired by the real-life ghostly occurrences experienced by staff and visitors alike. Her protagonist, Khalid, is a night guard at the castle, newly arrived from an unidentified war-torn country; over one night, the trauma of his past bleeds into the horrors lurking in the castle. Shamsie was galvanised by the \"unusually large\" windows of Kenilworth: \"it raised the question,\" she told the Guardian, \"did they want to let in the light or were they afraid of something in the dark?\"\n6 'A View from a Hill' — M. R. James Liam Grant/Stocksy Yes, it's another James, and I won't apologise, because this story has hovered malignantly in the corners of my brain for every minute of the four years since I read it. Fanshawe, an antiquary (surprise!), is visiting his friend Richards in the countryside of South-West England, where Richards digs out some old binoculars for his friend to borrow. But when Richards looks at a nearby abbey, he sees it in ruins; when Fanshawe looks through the binoculars, he sees it intact. When Richards looks to a distant hill, he sees trees; when Fanshawe looks through the binoculars, he sees a body swinging from a gibbet. The truth of the binoculars' origins will take you entirely by surprise — and irrevocably turn your stomach. Click here to buy.","url":"https://www.bustle.com/p/7-creepy-books-set-in-the-british-countryside-to-stop-you-ever-leaving-the-city-again-9115334"}
