{"authors":["Sophie Mcevoy"],"date_download":"2018-10-31 01:41:41","date_modify":"2018-10-31 01:41:41","date_publish":"2018-08-28 08:40:08","description":"The city of London is a never-ending source of history that dates back centuries, with the majority of it teeming right beneath your very feet — and not in a good way. Although it's considered one of the most beautiful cities in the world, England's…","filename":"data/vaneerConsumption/7CreepyLondonUndergroundStoriesThatWillHaveYouReplanningYourNextJourney.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/03325a47-d03f-4625-816c-ab7dae68d65a-1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_7-creepy-london-underground-stories-that-will-have-you-replanning-your-next-journey-10165110_1540950101.html","title":"7 Creepy London Underground Stories That Will Have You Replanning Your Next Journey","title_page":"7 Creepy London Underground Stories That Will Have You Replanning Your Next Journey","title_rss":"NULL","source_domain":"bustle.com","text":"The city of London is a never-ending source of history that dates back centuries, with the majority of it teeming right beneath your very feet — and not in a good way. Although it's considered one of the most beautiful cities in the world, England's capital has a pretty dark and, quite frankly, scary AF past. And because of what happened way back when, there are so many places that are now considered to be haunted. Ever heard some of the creepy London Underground stories from staff past and present? Well, brace yourself, because you're about to.\nOver the years, terrified Transport for London employees and passengers have reported countless occurrences of alleged paranormal activity. They've seen, heard, and experienced things that have totally freaked them out. After hearing their stories, some believe there are perfectly logical explanations. However, the fact is, not everything can be explained 100 percent of the time, and some people think that the strange goings-on may have something to do with the tube’s grisly past.\nYou see, while building the London Underground, workers accidentally unearthed several mass burial sites. \"Various resources hold that there are a number of places where engineers hit bodies,\" reports the BBC. And according to Peter Ackroyd's 2012 book London Under, the tube \"system passes through many burial grounds and plague pits.\"\nCould the underground's dark history have something to do with today's spooky goings-on?\nApologies if I've freaked you out, but this feature is about to get a whole lot worse. Below, I've sourced seven of the creepiest London Underground stories around. Perhaps don't continue reading if you're about to go to bed — or get on the tube for that matter.\n1 Bethnal Green Station Giphy During World War II, Bethnal Green was utilised as an air raid shelter due to it being one of the few \"deep-level tunnels in the East End,\" according to the BBC. However, while it saved countless lives, the station also became a site of tragedy. On March 3 1943, a stampede — and subsequent crush — occurred due to a sudden panic amongst civilians after hearing the unfamiliar sounds of \"a nearby anti-aircraft battery fired its salvo of 60 rockets.\" Some 173 people died from asphyxiation, and the disaster became the \"deadliest civilian incident of World War Two.\" Today, staff at Bethnal Green station claim to experience paranormal activity during their night shifts. According to Haunted Rooms, one member of TfL staff heard \"children sobbing\" while working the night shift. When he decided to investigate, he was met with the sounds of \"female voices and screams, as well as noises which he could not identify,\" that lasted for \"10-15 minutes.\"\n2 Bank Station Giphy If Bank Station is part of your morning commute, you might want to rethink where you're getting on — or off — the tube after reading this story. An apparition known as the Black Nun is said to haunt the tunnels of Bank Station, bringing forth \"feelings of despondency and apprehension, moans and wails\" along with it, reports Historic Mysteries. The ghostly figure is said to be the spirit of a mourning woman named Sarah Whitehead. Many, many years ago, her brother worked at the Bank of England and was hung after committing forgery. Following his death, Whitehead would consistently return to the bank in a \"long black dress with a matching full face veil,\" asking for her brother. Eventually when the woman passed, her remains were interned \"in a plot behind the Bank itself.\" If that wasn't enough to give you the heebie jeebies, Bank Station was also built upon a plague pit, which some believe could account for some additional spirits allegedly haunting its underground tunnels alongside the Black Nun.\n3 Holborn Station Giphy Did you know there was once a British Museum station? Well, there was, however, one day, it was suddenly taken off the map and it hasn't been used in over 80 years. Rumour has it, there is still a tunnel connecting the British Museum, more specifically, its Egyptian room, to Holborn Station. According to Secret London, some believe the ghost of Egyptian God Amun-ra (which lives in the museum's Egypt room) uses the abandoned tunnel to lure tube passengers to his lair. \"People have blamed him for the disappearance of two women from neighbouring Holborn station in 1935,\" the website states.\n4 The Kennington Loop Giphy Over the years, many TfL employees, both past and present, have reported strange goings-on while driving trains through Kennington Loop's dark tunnels. If you haven't heard of it, it's because this section of the tube is used only by staff when terminating trains for the evening. Legend has it, staff began first to realise something wasn't quite right about Kennington Loop back in 1980, when a driver and a guard were stopped there, waiting at a red light. As they waited for a green signal, the pair both \"heard the unmistakable sound of interconnecting carriage doors open and slam shut,\" according to Spooky Isles. At the time, they were supposed to be the only people on the train, so they went to investigate and look for stranded passengers, however, \"when they looked, the carriages were empty.\" So who or what was opening and slamming the doors? When the two members of staff reported what happened, they learnt that many of their colleagues had experienced very similar goings-on. Apparently, the opening and slamming of doors started happening after a man died was killed after falling on the tracks while trying to move from one carriage to another on a moving train. Is his ghost now haunting Kennington Loop?\n5 Liverpool Street Giphy Built upon a plague pit, Liverpool Street is home to a host of strange occurrences. Apparently, there is a frequent ghostly visitor in a certain part of the station, specifically the \"eastbound central line platform during closing hours,\" reports the Evening Standard. There have also been plenty of mysterious goings-on throughout the station, including \"strange figures on the CCTV system in the dead of night,\" according to Secret London. Apparently, staff at Liverpool Street station have reported encountering a man in white overalls, who is \"seemingly waiting for a train that never comes\" at the station too. However, whenever staff go to approach him, he mysteriously disappears. Even though there aren't any reports of this man being a malevolent ghost, you might want to alter your commute a little bit if you happen to use this platform.\n6 Aldgate Station Giphy Also built on an ancient plague pit, it's little wonder there have been so many claims about Aldgate Station being haunted. Apparently, the hauntings started pretty much straight away after the station opened in 1876, with \"tube staff [hearing] ghostly footsteps in the tunnels only for the noise to abruptly and mysteriously stop,\" reports Sabotage Times. However, according to the Telegraph, the supposed ghost at Aldgate Station is more of an \"elderly angel\" than a troublesome spirit. The paper claims that the ghost made its first appearance more than 100 years ago, when an electrician was almost killed after falling on a live rail and was electrocuted by over 20,000 volts. Miraculously, however, he survived, and staff who were working at the station at the time claim it was because the alleged \"elderly angel\" helped him. \"They saw the luminous figure of an old lady kneeling next to the stricken worker, stroking his hair,\" the paper claims. I feel like I'm getting an electric shock just thinking about that.\n7 Brompton Road Station Giphy Not necessarily haunted but still freaky AF, the abandoned station of Brompton Road was used during World War II as \"the secret underground command centre for the anti-aircraft division of the RAF\", the Telegraph reports. The station still remains as it did when it closed in 1934, acting as a permanent time capsule for a segment of London's distant past right under your feet. Weird, right? And whilst there haven’t been any haunted sightings, there’s certainly enough history in those tunnels to imagine that some ghostly inhabitants could be calling this station home.","url":"https://www.bustle.com/p/7-creepy-london-underground-stories-that-will-have-you-replanning-your-next-journey-10165110"}
