{"authors":["Wynton Hall"],"date_download":"2018-10-30 18:10:30","date_modify":"2018-10-30 18:10:30","date_publish":"2015-01-28 13:00:23","description":"A recent House rules change by Republicans designed to curb insolvency in the Social Security Disability Insurance (SSDI) trust fund has sparked ire among some Democrats and guaranteed a forthcoming debate over the explosive growth in America’s disability program. |","filename":"data/vaneerConsumption/7FactsAboutAmericasDisabilityCheckExplosion.json","image_url":"https://media.breitbart.com/media/2015/01/social-security-checks-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_28__1540923030.html","title":"7 Facts About America’s Disability Check Explosion","title_page":"7 Facts About America’s Disability Check Explosion | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A recent House rules change by Republicans designed to curb insolvency in the Social Security Disability Insurance (SSDI) trust fund has sparked ire among some Democrats and guaranteed a forthcoming debate over the explosive growth in America’s disability program.\nHere, then, are seven facts every American should know about the nation’s disability program.\nAmerica Spends Nearly Twice as Much on Disability Checks as on Food Stamps.\nIn 2013, taxpayers spent $140 billion on disability checks, a sum double what America spent on the program just 10 years ago. By comparison, last year taxpayers spent $73.7 billion giving benefits to the nation’s 46,674,364 food stamp recipients.\nWhen the costs of health care for disability workers are included, federal spending on disability swells to $260 billion, reports National Public Radio (NPR).\nThe Number of Disability Beneficiaries Has Skyrocketed to 10,931,092.\nBy the end of Dec. 2014, disability beneficiaries totaled 10,931,092. Since Jan. 2009, the number of disability beneficiaries in America has risen by 1,634,602.\nAs the Wall Street Journal notes, “While the pool of workers eligible for disability benefits increased by 11.3% between 1999 and 2014, to 151 million from 136 million, the number of workers (not including dependents) getting these benefits grew by 83.5%.”\nIndividuals on Disability Rarely Return to Work.\nThe disability program was originally intended to be a stopgap program to keep injured workers financially afloat while healing from injuries or relearning a new skill to accommodate their impairment.\nBut according to a White House report by the Obama administration, “Workers on SSDI rarely return to the labor force, resulting in a loss to society of the economic contribution those workers could have made.\nAccording to CBS News’ 60 Minutes investigation, Disability, USA, “Each new case will eventually cost taxpayers on average $300,000 in lifetime benefits.”\nLess than 1% of individuals who went on disability at the beginning of 2011 returned to the workforce.\nReasons for Being Disabled Have Morphed Into Fuzzier Maladies.\nIn 1961, “heart disease and stroke” were the top reasons for being labeled disabled.\nToday, more than one-in-three (33.8%) diagnosed disabled workers cited “back pain and other musculoskeletal problems” as the reason they can no longer work for a living.\nOver 33% of Puerto Rico’s disability recipients qualified citing “mood disorders.”\nAccording to the New York Times, the Supplemental Security Income (SSI) Program is Creating “Soul-Crushing Dependency” that Now Ensnares Children.\nIn December 2012, liberal New York Times columnist Nicholas Kristof traveled to poor regions of the country to investigate the SSI program’s impact on poor children and their families. Kristof found that parents were purposefully yanking their children out of literacy programs to ensure that they received their $698 monthly disability check, which SSI children receive until age 18, before being transitioned into other disability programs.\n“This is what poverty sometimes looks like in America: parents here in Appalachian hill country pulling their children out of literacy classes,” wrote Kristof. “Moms and dads fear that if kids learn to read, they are less likely to qualify for a monthly check for having an intellectual disability.”\nKristof added, “This is painful for a liberal to admit, but conservatives have a point when they suggest that America’s safety net can sometimes entangle people in a soul-crushing dependency.”\nAs of Nov. 2014, 1,302,319 SSI recipients were under 18.\nThe GAO Says at Least $1.3 Billion in Disability Overpayments Were Made Between Dec. 2010 and Jan. 2013.\nA Sept. 2014 Government Accountability Office (GAO) report found that at least $1.3 billion in overpayments went to individuals who weren’t eligible to receive them.\nReports of disability fraud are common. In 2013, federal authorities broke up a Puerto Rico disability fraud ring involving doctors who allegedly charged individuals between $150 and $500 to claim they were disabled. Approval rates in Puerto Rico have skyrocketed in recent years. In 2006, 36% of residents were approved. That number leapt to 69% by Dec. 2010.\nDisability Trust-fund Reserves Run Out in 2016.\nAs Lanhee Chen notes in the Wall Street Journal, in 2013, “spending outpaced receipts by $32 billion, and the balance of the program’s trust fund was a little more than $90 billion.” That means the disability trust-fund reserves will be depleted by Dec. 2016, which would trigger a 19% cut in benefits.\nRepublicans who spearheaded the rule change say it will force Congress to confront stark fiscal realities.\n“In 2016 the fraud-plagued disability program will become insolvent,” said Rep. Sam Johnson (R-TX). “Unfortunately, the President and Democrats support raiding the Social Security retirement program to bail out the disability program. My measure creates a point-of-order to prohibit any diversion of funds from the retirement program to the disability program.”\nJohnson added, “But more than that, the rule seeks to encourage much-needed reform.”","url":"https://www.breitbart.com/politics/2015/01/28/7-facts-about-americas-disability-check-explosion/"}
