{"authors":["Amanda Chatel"],"date_download":"2018-10-31 01:43:52","date_modify":"2018-10-31 01:43:52","date_publish":"2018-08-27 21:41:19","description":"If you've yet to learn about love languages, then now is the time. A theory conceived by Dr. Gary Chapman in 1995, a love language is the way in which people give and recognize love. According to this theory, there are five love languages: Words Of…","filename":"data/vaneerConsumption/7GiftsToGiveAPartnerWhoseLoveLanguageIsActsOfService.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/966fa1b6-1012-42ce-a978-8cb738183b02-zaeh_bustle_apr2016-380.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_7-gifts-to-give-a-partner-whose-love-language-is-acts-of-service-3244733_1540950232.html","title":"7 Gifts To Give A Partner Whose Love Language Is Acts Of Service","title_page":"7 Gifts To Give A Partner Whose Love Language Is Acts Of Service","title_rss":"NULL","source_domain":"bustle.com","text":"If you've yet to learn about love languages, then now is the time. A theory conceived by Dr. Gary Chapman in 1995, a love language is the way in which people give and recognize love. According to this theory, there are five love languages: Words Of Affirmation, Quality Time, Receiving Gifts, Acts Of Service, and Physical Touch. Although you can have elements of the five languages within your personality, for the most part, people speak primarily one love language.\n\"We all have our set love language and speak to your partner in their language,\" founder of the University of Love & Sexuality and Raw Attraction Magazine, Steve Burford, tells Bustle. \"This could be touch, this could be quality time, if could be gifts, words of affirmation, or it could be acts of service. The reason why this is meaningful is because you are giving your thought and attention to your partner, this makes a relationship more loving and therefore more meaningful. The two are so strongly linked.\"\nIf you're not quite sure what your love language is or what your partner's love language is, Dr. Chapman actually has a quick online test you can take which will clear up any confusion. But don't worry if you and your partner have different ones — the idea is that you work together to make sure you're both getting your needs met. Once you have that information in your back pocket, both you and your partner can start working on trying to be more aware and respectful of what you each need if your languages aren't the same.\nIf your partner's love language is Acts of Service and yours isn't, then here are seven gift ideas to help make them feel truly loved and appreciated.\n1 Do Their Chores For Them jumlongch/Fotolia Although partnerships are great and so is chore equality, someone whose love language is Acts of Service is really going to love a gift in which their partner is providing an action to help them out. The easiest and most obvious \"act of service,\" is giving them a break with the chores. Sure, you didn't want to find yourself scrubbing the toilet every week for a month, but this is a great gift every now and then for those who speak acts of service.\n2 Be On Top Of Your Game In Helping Out Andrew Zaeh for Bustle If your partner needs something from you, don't waffle about, waiting until the last minute to lend them a hand or support them. It's all about showing up for them when they need you. See the theme here?\n3 Take Something Off Their Plate Mediteraneo/Fotolia I don't mean literally reach across the table and remove a piece of food from their plate to show them you love them (although it would be funny), but if you know your partner has a lot going on one day, do what you can to make it easier. For example, pick them up from work so they don't need to take the bus, offer to help them with whatever project they're working on, order in their favorite dinner — any of these actions say so much and are interpreted as love.\n4 Make Them Breakfast In Bed Rawpixel.com/Fotolia Breakfast in bed is probably one of the best gifts and kindest gestures on the planet. The only thing I can think that might rival having food brought to you the second you wake up is morning sex. It doesn't matter if your partner had a bad week, good week, or a week that was totally forgettable, waking up to breakfast in bed on Sunday morning is literally the bee's knees.\n5 Give Them A Day Off From Everyone Andrew Zaeh for Bustle Give your partner a day to themselves, for example with a spa certificate. Tell them to not think about anything but themselves and just melt away into relaxation bliss. This really is a gift of the ultimate service on your end.\n6 Give Them A Special Lunch AVAVA/Fotolia You know how hard your partner works, so you know that packing them a special lunch, ordering something in, or showing up to their work to take them out for a special lunch is really going to make them feel loved. Tossing in a cute note, even if their love language isn't Words of Affirmation, is a good idea, too.","url":"https://www.bustle.com/p/7-gifts-to-give-a-partner-whose-love-language-is-acts-of-service-3244733"}
