{"authors":["Eva Taylor Grant"],"date_download":"2018-10-31 01:47:39","date_modify":"2018-10-31 01:47:39","date_publish":"2018-08-27 18:20:44","description":"No one can be in control of another's mental health. But, with aging parents comes an increased responsibility to look out for the needs of the people who raised you. Aging and mental illness sometimes go hand-in-hand, so, as your mom or any other…","filename":"data/vaneerConsumption/7MentalHealthChangesToLookOutForAsYourMomAges.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/949e9dc2-b5a4-4db4-8107-05212703eb2e-fotolia_164076272_subscription_monthly_m-4.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_7-mental-health-changes-to-look-out-for-as-your-mom-ages-10247182_1540950459.html","title":"7 Mental Health Changes To Look Out For As Your Mom Ages","title_page":"7 Mental Health Changes To Look Out For As Your Mom Ages","title_rss":"NULL","source_domain":"bustle.com","text":"No one can be in control of another's mental health. But, with aging parents comes an increased responsibility to look out for the needs of the people who raised you. Aging and mental illness sometimes go hand-in-hand, so, as your mom or any other loved one gets older, you can give back by keeping an eye out to make sure they're as healthy as possible.\n“As we get older, we face unique mental health challenges, which can impact our overall quality of life if not treated,\" Dr. Jacque Strait, Licensed Psychologist and co-owner of Winding Way Therapy tells Bustle. \"Although mental health problems are not [always] part of the aging process, it is important for us to be aware of potential mental health issues.\" While it's essential not to be alarmist about your mother forgetting her keys or seeming gloomy on a particular day, it's also an important part of being a good family member.\nYounger people may not understand the ways mental health and the aging process interact, and the specific risks of both the social and biological changes that go along with aging. \"Aging can take a significant toll on one’s mental health,\" Reshmi Saranga M.D., a geriatric psychiatrist and founder of Saranga Comprehensive Psychiatry, tells Bustle. \"It’s more common than most people realize for older people to suffer with mental health issues such as depression, anxiety and addiction.\" So, if you see your mom displaying these signs, it may be worth looking into further.\nHere are 7 mental health changes that are important to look out for as your mom ages, according to experts.\n1 Personality Changes hedgehog94/fotolia At any age, personality changes can be a sign of something more serious. But for someone in their later years, personality changes can be a particularly poignant symptom. \"If your mom is typically upbeat and positive, but now she’s more irritable and sad, this may be a sign of a mental health issue,\" Dr. Strait says. \"Everyone has bad days, but if you notice several days in a row of strange behavior in your mom, talk to her doctor about your concerns.\" Personality changes can be caused by issues from depression to dementia, so keep an eye out.\n2 Decrease In Activity olezzo/fotolia Activity level can change based on a variety of physical and mental health conditions. Regardless of the cause, these changes are worth looking out for as your mother ages. \"As mothers get older, they may naturally slow down a little bit,\" Dr. Strait says. \"She may not be able to get around as much as she used to. But if you see a considerable decrease in your mom’s activity level, this change may be due to depression or another mental health challenge.\" On top of that, chronic conditions or injuries that decrease mobility can cause depression as well. Let your mom know that you can lend a listening ear, and reach out for help if you've realized her change in activity level has been drastic.\n3 Memory Problems logdog7/fotolia Memory problems are one of the better-known mental health issues that come along with aging, but they can be hard to spot. \"Your mother’s memory may slightly decline with age,\" Dr. Strait says. \"But severe memory loss is not a normal part of aging.\" Everything from thyroid problems to depression and Alzheimer's can cause memory loss, so learning the signs is key. \"[Severe memory loss] does not mean the common misplacement of keys or remote but more of the things that could be life-threatening, such as forgetting to turn off the stove, forgetting their address, or [displaying] any disorientation,\" licensed clinical psychologist Dr. Cheryl Andaya tells Bustle. If any of these symptoms occur, encourage your mom to seek help.\n4 Mood Changes WONG SZE FEI/fotolia Mood changes are another symptom that can occur with mental illnesses at any age, but can be particularly worrisome when they occur in someone who is aging. \"[Take note if you mom] exhibits more [sadness], is more subdued when they used to be high-spirited, or is more irritable than usual,\" Dr. Andaya says. These symptoms could just be a result of mood swings or her changing over the years, but also could potentially signal depression or neurological diseases like Alzheimer's or dementia. If your mom has become noticeably moodier over a sustained period of time, it's likely worth looking into.\n5 Increased Social Isolation rocketclips/fotolia If your mom is becoming less active, but still making time for friends and family, that may be a less worrisome sign of aging. If she becomes noticeably less social, however, you may need to take a closer look. \"Children should look for signs of isolation,\" Dr. Saranga says. \"One major sign of depression is isolation. Feelings of loss and loneliness can cause them to socially withdraw ... You can help encouraging them to socialize. Make plans to do something with them even if it’s just to watch a movie or have a cup of coffee together. Support their interests and help combat isolation by doing things they once loved.\" So if you live close, plan a night to hang out with your mom doing something that makes you both happy. And if you're far away, try enlisting one of her friends or family members to do the same.\n6 Prolonged Grieving altanaka/fotolia Sometimes, there is a fine line between sadness and depression, and as your mom ages and potentially experiences more loss, it's important to make sure she's healing as healthily as possible. \"Children should lookout for signs of grief,\" Dr. Saranga says, \"... You can help by simply reaching out and communicating with your [mom]. Your compassion and company can help eliminate their feelings of loneliness. Encourage conversation and talk about happy memories that will brighten their mood. If grief goes on to the point that it interferes with their day-to-day functioning, it’s time to get professional help.\" Unfortunately, grief is a universal experience. But that means that the resources out there are plentiful.","url":"https://www.bustle.com/p/7-mental-health-changes-to-look-out-for-as-your-mom-ages-10247182"}
