{"authors":["Charlotte Owen"],"date_download":"2018-10-31 01:48:47","date_modify":"2018-10-31 01:48:47","date_publish":"2018-09-13 22:04:11","description":"Whether it's a matter of coincidence — or perhaps some deep psychological flaw I'm yet to get to grips with — I always find myself feeling restless in September. Seasonal change, back to school vibes, and a post-summer hangover are usually all in…","filename":"data/vaneerConsumption/7NewFragrancesOutThisAutumnThatYouNeedToGoTestOutImmediately.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/8114b363-cd9a-4ab9-ab1a-bc64f4bc9baf-stocksy_txp497c12d6f55200_small_1250337.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_7-new-fragrances-out-this-autumn-that-you-need-to-go-test-out-immediately-11900707_1540950527.html","title":"7 New Fragrances Out This Autumn That You Need To Go & Test Out Immediately","title_page":"7 New Fragrances Out This Autumn That You Need To Go & Test Out Immediately","title_rss":"NULL","source_domain":"bustle.com","text":"Whether it's a matter of coincidence — or perhaps some deep psychological flaw I'm yet to get to grips with — I always find myself feeling restless in September. Seasonal change, back to school vibes, and a post-summer hangover are usually all in the mix. What tends to happen next is an impulsive change. Most often it's a new haircut, but after making one too many bad decisions and with a 30th birthday looming, I'm lowering the stakes and increasing the pay off this year. My fix? One of these new fragrances out this autumn.\nAs someone who has a tray of scents already on their dresser, it's going to take a lot for me to make the plunge and invest in another. Or at least that's what I tell myself, but that's clearly a lie (see: psychological flaw mentioned above). The truth is, putting on a new scent shifts my mindset. There's a reason, as the Guardian reports, that so many actors utilise fragrance as a tool for them to get in character. \"I think there’s a little sense-memory about it,\" actor Anne-Marie Duff told the newspaper in a 2016 interview, \"so if ever I smell that perfume on somebody else it will always remind me of a story I’ve told.\" So, what character do you fancy playing this autumn? Read on for the best of the new releases.\n1 Joy By Dior Joy By Dior £75 Boots Buy Now This is Dior's first new fragrance since 1999, and it's being fronted by Jennifer Lawrence. She told Elle that she visited the laboratory in Paris where they put the scent together, even taking her mum along with her. Pretty cute. Expect floral and citrus tones, with a hint of wood and musk.\n3 Jo Malone Honeysuckle & Davana Jo Malone Honeysuckle & Davana £47 Jo Malone Buy Now Ah, Jo Malone. The latest addition to their range is the Honeysuckle and Davana. Now, if the visualising the scent thing didn't quite float your boat, perhaps a \"taste the scent\" vibe might do the trick. If you're London based, head along to The Ivy Market Grill, where the clever bar staff have whipped up a cocktail inspired by the new scent. I won't tell you what's inside, it's a surprise.\n4 Laboratory Perfumes No. 001 Amber Laboratory Perfumes No. 001 Amber £65 Liberty Buy Now Liberty's beauty section has a great mix of fragrances and a brilliant website to help you get your hands on them wherever you are in the UK. The iconic retailer has actually seen a 40 percent increase year on year in the sale of unisex fragrances — perhaps this means we can stop gendering fragrances in the first place, and people can just wear what they like? — and Laboratory Perfume's No. 001 Amber is one of their most popular.\n5 Tom Ford Lost Cherry Tom Ford Lost Cherry £218 Tom Ford Buy Now Now I'm jumping the gun a bit on this one as this fragrance isn't actually available until later in the Autumn, but you can pre-order now. Even then, it's definitely way more at the splurge end of the spectrum. But look at it. It's a thing of beauty, and definitely going on my Christmas wish list (Hi, @Mum&Dad).\n6 Jason Wu Beauty Jason Wu Beauty £54 Net-a-Porter Buy Now For Jason Wu's first ever fragrance, he collaborated with Frank Voelkl, the nose behind many of Le Labo's finest scents. The perfume was designed to invoke Wu's childhood memories of Taiwan, and in particular, a neighbour's Jasmine flowers. See, nostalgia really never does go out of fashion, and neither will a lingering hint of summer if you wear this come autumn.","url":"https://www.bustle.com/p/7-new-fragrances-out-this-autumn-that-you-need-to-go-test-out-immediately-11900707"}
