{"authors":["Sadie Trombetta"],"date_download":"2018-10-31 01:50:09","date_modify":"2018-10-31 01:50:09","date_publish":"2018-09-13 22:00:52","description":"Fall is fast approaching, which means Halloween will be here before you know it, as will a flood of stories and products featuring broom-riding, wart-nosed, curse-casting witches. If you’re curious about the real women behind the spooky aesthetic,…","filename":"data/vaneerConsumption/7NonfictionBooksAboutWitchesBecauseTheyArentJustTheStuffOfFairyTales.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/ca24d493-e0ca-4aeb-b882-82fb48c18136-pjimage-32.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_7-nonfiction-books-about-witches-because-they-arent-just-the-stuff-of-fairy-tales-11852509_1540950609.html","title":"7 Nonfiction Books About Witches, Because They Aren't Just The Stuff Of Fairy Tales","title_page":"7 Nonfiction Books About Witches, Because They Aren't Just The Stuff Of Fairy Tales","title_rss":"NULL","source_domain":"bustle.com","text":"Fall is fast approaching, which means Halloween will be here before you know it, as will a flood of stories and products featuring broom-riding, wart-nosed, curse-casting witches. If you’re curious about the real women behind the spooky aesthetic, it’s time you read some nonfiction books about witches, because they’re so much more than the stuff of fairy tales.\nWhile autumn is generally affiliated with the beautiful colors of the changing leaves, the comfortable return of oversized sweaters, and the iconic taste of pumpkin spice everything, the season is often associated with one other thing: witches. With their pointy hats and boiling cauldrons in hand, these magical (and often misunderstood) women take over everything from your bookshelf and your television screen to your wardrobe and your home decor. Even makeup and fashion brands release products like mystical-themed eyeshadow palettes, wand-shaped brushes to witch-inspired accessories.\nNow, I would be lying if I said I didn’t love this aesthetic, black lace, dark colored nail polish, scary horror stories and all, but it's hard not to see how easily it can go from cool to problematic. Wicca is, after all, a very real, very religion that people all over the world practice, people who have historically been persecuted for their beliefs. While plenty of consumers, book-lovers included, are ready to work witch-inspired pieces into their wardrobe and magical stories into their reading rotations, many remain ignorant about the real people, and the real practices, behind it.\nIf you want to learn more about witches, pick up one of these seven nonfiction books about religion, magic, healing, and more.\n'The Witch: A History of Fear, from Ancient Times to the Present' by Ronald Hutton For centuries, societies all over the world been terrified of witchcraft and persecuted its practitioners. In The Witch, renowned scholar and expert on ancient, medieval, and modern paganism Ronald Hutton takes a deep-dive into its context, beliefs, and birth, revealing not only why so many have feared witchcraft, but how we can erase that misunderstood fear once and for all. Click here to buy.\n'Witches, Midwives, & Nurses: A History of Women Healers' by Barbara Ehrenreich and Deidre English Originally published in 1973 and updated to cover today's healthcare crisis, Witches, Midwives, and Nurses is a short but informative history of the problems that plague the medical establishment that traces its roots all the way back to witch hunters. Powerful and provocative, this guide will change how you see modern medicine and the women healers it had eradicated to become what it is today. Click here to buy.\n'Voodoo Queen: The Spirited Lives of Marie Laveau' by Martha Ward Infamous free women of color in 19th century New Orleans, the Laveaus — a mother and dauther pair who shared the same name — were leaders of religious and spiritual traditions that many around them believed to be evil. In Voodoo Queen, author Martha Ward uses research and never-before-printed eyewitness accounts of their ceremonies and magical crafts to tell the story of these two remarkable Maries, both persecuted women who spent their entire lives fighting for the freedom to be who they wanted to be, and practice the indigenous American religion they believed in. Click here to buy.\n'The Penguin Book of Witches' by Katherine Howe Featuring historical documents, including a manual for witch hunters from 1597, court documents from the 1962 Salem Witch Trials, and newspaper coverage of the stoning deaths of women accused of practicing magic, The Penguin Book of Witches presents readers with real-life accounts of paganism, from medieval Europe through colonial America. A fascinating glimpse into the past, this is essential reading for anyone who wants to understand the history of witches and the people who spent centuries persecuting them. Click here to buy.\n'Witches of America' by Alex Mar In this immersive memoir, Alex Marr brings readers along on her five year journey into the occult. Featuring a history of modern paganism that starts in 1950s England and follows to its present-day practitioners all across the country, Witches in America shines a bright light on an ancient belief system so few people truly understand. Click here to buy.\n'The Oxford Illustrated History of Witchcraft and Magic' by Owen Davies Whether you want to learn more about magical beliefs and practices, the rise of the witch trials, the portrayal of witchcraft in literature and pop culture, or the resurgence of modern paganism, The Oxford Illustrated History of Witchcraft and Magic can help. An in-depth look at witchcraft and magic through the centuries, this is a must-read for anyone who wants to know the truth behind the stories. Click here to buy.","url":"https://www.bustle.com/p/7-nonfiction-books-about-witches-because-they-arent-just-the-stuff-of-fairy-tales-11852509"}
