{"authors":["Christine Distasio"],"date_download":"2018-10-30 23:09:51","date_modify":"2018-10-30 23:09:51","date_publish":"2014-08-14 00:19:12","description":"What's a reality series without a great soundtrack, am I right? We're coming up on the 10-year anniversary of MTV's Laguna Beach , it only seems to fair to honor the series that started it all. And by \"it all,\" I mean those little in-episode…","filename":"data/vaneerConsumption/7ofLagunaBeachsBestSongMomentsThatllGiveYouAllTheNostalgicFeels.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/a5f0feda-c688-42cc-82c4-d1f605a3434b.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35678-7-of-laguna-beachs-best-song-moments-thatll-give-you-all-the-nostalgic-feels_1540940991.html","title":"7 of 'Laguna Beach's Best Song Moments That'll Give You All The Nostalgic Feels","title_page":"7 of 'Laguna Beach's Best Song Moments That'll Give You All The Nostalgic Feels","title_rss":"NULL","source_domain":"bustle.com","text":"What's a reality series without a great soundtrack, am I right? We're coming up on the 10-year anniversary of MTV's Laguna Beach , it only seems to fair to honor the series that started it all. And by \"it all,\" I mean those little in-episode pop-ups that identify the artist and song that's playing during a scene on all of MTV's series these days. The only thing more iconic than Kristin Cavallari's bitchy and amazing quotes might be that Season 2 premiere scene where Stephen and Lauren are riding in his car, listening to Journey's \"Don't Stop Believin'.\" Because it essentially made everyone go nuts and run to the nearest computer to download a song that was over 20 years old.\nLaguna Beach had perfect music moments, from its theme song by Hilary Duff — I'm comiiiing cleeean — to its multiple shout outs to everyone's favorite band of the early '00s, Dashboard Confessional. I'm pretty sure I still have a \"Laguna Soundtrack\" playlist on my iTunes because the music on this show was actually that good. (With the exception of \"Don't Stop Believin'\" because I never want to hear that damn song again.) So, get ready to feel nostalgic for simpler times when you had to choose between #TeamLC and #TeamKristin — here are 7 of Laguna Beach's best music moments from Seasons 1 and 2 (those are the only ones that really matter anyway, right?).\nStephen & Lauren's Car Ride — \"Don't Stop Believin'\" by Journey\nWe just want to forget this song, but we never will. Never. Ever. Probably because of this moment — Steeephennn.\nListen to \"Don't Stop Believin'\" here.\nJason & Alex's Double \"Date\" With Casey & Cedric — \"Screaming Infidelities\" by Dashboard Confessional\nJason, you cheating bastard. MTV went for a super-literal application of Dashboard Confessional big hit and, well, it was amazing.\nListen to \"Screaming Infidelities\" here.\nTalan Asks Kristin To Prom — \"Roll Into You\" by Five Times August\nDid anyone know who Five Times August was before this moment? Okay, some people definitely did, but this was one of best prom-posal of all time — only made better by this sweet song.\nListen to \"Roll Into You\" here.\nThe Theme Song — \"Come Clean\" by Hilary Duff\nAll hail queen Hilary, may we never forget \"Come Clean\" as we'll never forget Laguna Beach.\nListen to \"Come Clean\" here.\nSeason 2 Graduation — \"Time\" by Chantel Kreviazuk\nTHE FEELS. ALL OF THE FEELS. ALL OF THE TIME. UGH, TIME.\nListen to \"Time\" here.\nKristin's Shopping Montage — \"We Got More Bounce (In California)\" by Soul Kid #1\nThis song is amazing. And it's only made more amazing by playing over Kristin and Alex crossing the streets of sunny SoCal mid-shopping trip. #praise\nListen to \"We Got More Bounce (In California)\" here.\nSeason 1 Graduation — \"Graduation (Friends Forever)\" by Vitamin C\nThe graduation song — obviously Laguna used it wisely. Even though I can't say I was sad to see LC graduate.\nListen to \"Graduation (Friends Forever)\" here.\nImages: MTV (8)","url":"https://www.bustle.com/articles/35678-7-of-laguna-beachs-best-song-moments-thatll-give-you-all-the-nostalgic-feels"}
