{"authors":["Kyli Rodriguez-Cayro"],"date_download":"2018-10-31 01:52:03","date_modify":"2018-10-31 01:52:03","date_publish":"2018-09-13 21:11:17","description":"There's no denying that the health of our bodies and our minds are super interconnected. If you don't feel well physically, there's a decent chance your mental health is not going to be in the best of shape, and vice versa. In fact, studies suggest…","filename":"data/vaneerConsumption/7PhysicalDisordersThatAreLinkedToMentalHealthIssues.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/ec5e1b5d-9194-496c-b7a7-33216190de31-stock_ab-0101.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_7-physical-disorders-that-are-linked-to-mental-health-issues-9122010_1540950723.html","title":"7 Physical Disorders That Are Linked To Mental Health Issues","title_page":"7 Physical Disorders That Are Linked To Mental Health Issues","title_rss":"NULL","source_domain":"bustle.com","text":"There's no denying that the health of our bodies and our minds are super interconnected. If you don't feel well physically, there's a decent chance your mental health is not going to be in the best of shape, and vice versa. In fact, studies suggest that those living with severe mental illness — which the National Alliance on Mental Illness (NAMI) estimates is one in twenty-five people in the U.S. — are more prone to developing serious physical disorders. Moreover, TIME reported in February 2017 that research has also found that those with common chronic physical health issues, like psoriasis and diabetes, can have symptoms exacerbated by mental health issues and stress.\nIf you have a chronic health condition and/or a mental illness, it can a be a vicious cycle: Your mental health can trigger physical symptoms, and physical symptoms can trigger mental health issues, and so on. Though mental health issues and physical health issues are often treated separately by physicians, the distinction between the two is a lot less meaningful than you'd think. Scientists have found that certain disorders that we may typically think of as only being a \"physical\" disorder are inextricably linked to anxiety, depression, and other mental illnesses. From eczema to lupus, here are seven common physical disorders that often co-occur, or are linked to an increase risk of mental health conditions.\n1 Endometriosis Ashley Batz/Bustle Endometriosis is a reproductive health issue that occurs when uterine tissue abnormally grows outside the uterus. It can cause pelvic pain, heavy menstruation, pain during intercourse, uncomfortable bowel movements, and in some cases, infertility. The Endometriosis Foundation of America estimates 200 million people across the globe have this reproductive heath disease, and one in ten women in the U.S. alone are diagnosed with endometriosis. Interestingly, a study published last May the International Journal of Women’s Health found people who experience endometriosis reported higher rates of depression, anxiety, and psychiatric disorders, as well as a lower quality of life when compared to people who didn't have the disorder.\n2 Eczema Voyagerix/Fotolia According to the National Eczema Foundation, around 30 million Americans are affected by this health issue, which causes skin to become red, inflamed, and itchy. People with eczema can experience physical health complications like asthma and skin infections, but a survey from the National Eczema Foundation revealed 30 percent of people with eczema also have anxiety, depression, or another mental health issue. Moreover, a study published in 2016 found children with eczema were more likely to have \"emotional, conduct and hyperactivity problems, but not peer problems, compared with children without these diseases.\" In fact, eczema and other skin disorders like psoriasis are sometimes referred to as a psychophysiologic disorders, because they are so interconnected to mental health, and stress can trigger symptoms of these skin conditions.\n3 Fibromyalgia Ashley Batz/Bustle Fibromyalgia is a chronic pain condition that the National Fibromyalgia Association (NFA) estimated affects around 10 million Americans, though women are most likely to develop this disorder — accounting for at least 75 percent of the people who have it in the U.S. Common symptoms of fibromyalgia include fatigue, brain fog (aka, \"fibro fog\"), pain, sleep issues, restless leg syndrome, temperature sensitivity, and more. Fibromyalgia often co-occurs with autoimmune disorders, hypothyroidism, and chronic fatigue syndrome, but it is also linked to major depressive disorder, and other mental illnesses.\n4 Irritable Bowel Syndrome (IBS) exxxplosion/Fotolia As Healthline reported, irritable bowel syndrome (IBS) is an intestinal disorder that can cause abdominal pain, bloating, diarrhea or constipation (or alternating bowel movements), gas, fatigue, food intolerances, and more. A 2015 discovered that people with IBS were at higher risk of having a mood or anxiety disorder, compared to those who don't have IBS. Further, research from 2014 suggests there is a bidirectional connection between IBS, and schizophrenia and bipolar disorder.\n5 Lupus s_l/Fotolia The National Resource Center on Lupus explains that, \"lupus is a chronic autoimmune disease that can damage any part of the body (skin, joints, and/or organs).\" Meaning, your immune system misfires, attacking your body's healthy tissues as if they were an infection. A study from 2009 found women with lupus were more likely to have a severe mood or anxiety disorder than the general population. In fact, up to 75 percent of people with lupus also have neuropsychiatric symptoms.\n6 Acne Andrew Zaeh for Bustle Acne is a pretty common skin condition, so it may surprise you that it can actually have a negative impact on your mental health. As reported by Allure, a study published this past February in the British Journal of Dermatology revealed that acne is linked to an increased risk of depression.\n7 Chronic Fatigue Syndrome Andrew Zaeh for Bustle According to Medline Plus, chronic fatigue syndrome (CFS), aka myalgic encephalomyelitis (ME), is a chronic health condition characterized by intense fatigue that is not helped by sleep, brain fog, pain, faintness, and severe fatigue after physical or mental exertion. A 2010 study that due to the \"dysregulation of the stress system, the immune system, and central pain mechanisms\" that CFS can cause, it makes people with this disorder more susceptible to mental illness.","url":"https://www.bustle.com/p/7-physical-disorders-that-are-linked-to-mental-health-issues-9122010"}
