{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 19:54:24","date_modify":"2018-10-30 19:54:24","date_publish":"2017-04-28 16:00:33","description":"There’s never a wrong time or season to drink\nrosé\n.","filename":"data/vaneerConsumption/7placestodrinkrosaroundAtlantarightnow.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/28/Images/WPIMAGE_cmgajcfoodandmore_15893.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_pl_37db0b38ab328d8bd6f60e9782288d2f__1540929264.html","title":"7 places to drink rosé around Atlanta right now","title_page":"7 places to drink rosé around Atlanta right now","title_rss":"NULL","source_domain":"ajc.com","text":"There’s never a wrong time or season to drink rosé . The wine’s food-friendly versatility and cheerful approachability as a stand-alone sipper make for perfection in a glass. Whether you’re lounging by the pool with a good book or crushing a burger and fries on the patio, rosé has found a year-round home in wine shops and on menus around Atlanta.\nSpring\nSpring’s simple sophistication extends to the restaurant's small but carefully curated wine list full of food-friendly pairings including a syrah rosé from Domaine Saint Andrieu in the Provence region of southeastern France. Syrah rosés tend to be a bit funky and full-bodied which means they’re great for pairing with hearty proteins like roast lamb yet won’t overpower the fresh vinegar acids of a strawberry and beet salad. This is the bold red drinker’s rosé.\n90 Marietta Station Walk NE, Marietta. 678-540-2777, springmarietta.com.\nThe Regent Cocktail Club\nNow through the summer, The Regent Cocktail Club will be hosting “Wine Wednesdays” with Whispering Angel rosé and live music on their patio. You’ll find this rosé dry and refreshing with subtle hints of red berries. Special by-the-bottle pricing as follows: $45 for a 750ml, $100 for a 1.5L and $250 for a 3L.\nThe Shops Buckhead Atlanta, 3035 Peachtree Road NE #140, Atlanta. 770-415-9961, regentcocktailclub.com.\nWine Wednesdays with Whispering Angel rosé bottle specials continue through the summer at The Regent Cocktail Club in Buckhead. Photo by Chris Watkins\nAria\nWhile a redo of the interior may have taken this Buckhead classic from coat and tie to khakis and a polo, neither the food or the restaurant’s baller wine program have suffered. General manager and wine director Andres Loaiza continues to hand-select Aria’s bible full of rare and vintage wines. While the by-the-glass menu changes nightly, a sparkling and still rosé seem to always be present. You won’t find weak pinks here. Loaiza likes his rosés funky and fresh for pairing alongside chef Gerry Klaskala’s dishes.\n490 E. Paces Ferry Road NE, Atlanta. 404-233-7673, aria-atl.com.\nGrain\nPeople-watching on the patio and buckets of canned rosé. Grain takes day drinking seriously with $25 buckets of ice cold cans of Great Oregon Wine Company rosé. Slightly sweet and a touch dry with notes of peach and cherry, each can is the equivalent of one glass of wine.\n856 West Peachtree St. NW, Atlanta. 404-881-5377, grain-bar.com.\n8 ARM\nA wine list that is unpretentious and approachable yet sophisticated enough for the oenophile. Lusca alum Tim Willard has created a program centered around the youthful energy of the Poncey-Highland neighborhood in which 8 ARM resides. Rosé is no stranger to Willard’s menus and is sipped regularly on the Ponce-side patio by the glass, carafe and half-carafe. You won’t find sweet rosés full of candied apples and peaches on the menu here. We’re talking dry, crisp and refreshingly subtle pinks.\n710 Ponce De Leon Ave. NE, Atlanta. 470-875-5856, 8armatl.com.\nSip rosé by the glass, carafe or half-carafe on the Ponce-side patio at 8 ARM. Photo by Lauren Zarzour\nStaplehouse\nWhen you’re offered a glass of rosé port as a digestif after a meal at Staplehouse, you say yes. While most ports tend to lean sweet with warm spice rack notes, Kopke rosé port is light and lovely with hints of fresh berries. Beverage director Melissa Davis tells us, “Kopke specializes in Colheita ports (single vintage, one harvest) and began producing this rosé port a couple of years ago. It's still pretty unknown in our market but it's killer with food and life and porch times!” A $7 glass of summery port. We’re sold.\n541 Edgewood Ave. SE, Atlanta. 404-524-5005, staplehouse.com.\nMediterranea\nIt’s as if Mediterranea has always been on Ormond Street in the quaint neighborhood of Grant Park. Opened in January 2017, the restaurant’s gluten-free kitchen transforms simple, seasonal ingredients into dishes not unlike those you would see in Italy, southern France or Greece. But what caught our eye was the impressive wine list. There’s no shortage of rosé at Mediterranea which includes on its menu a sparkling brut from northern Italy, a Cinsault syrah rosé from southern France and a sangria mixed with rosé, Malfy lemon gin and fresh berries. That rooftop patio is calling our name.\n332 Ormond St. SE, Atlanta. 404-748-4219, mediterraneaatl.com.\nFour rosés to consider for your wine rack\nDomaine de Triennes rosé, Provence, France\nA rosé which has been described as summer in a bottle. Fresh with hints of citrus and red berries, this rosé is slightly dry with a moderate amount of acidity. Your porch sipper.\nCommanderie de la Bargemone rosé, Provence, France\nAn editor’s choice by Wine Enthusiast, this pale-colored rosé is crisp and dry with subtle notes of fresh watermelon and strawberries. A surprising touch of orange zest at the finish.\n2012 Terrazze Dell'Etna rosé , Sicily, Italy\nSarah Pierre of 3 Parks Wine Shop in Glenwood Park tells us this sparkling rosé is 90% pinot noir and 10% nerello mascalese. Grown on volcanic soil, the barely pink rosé is delicate yet balanced with notes of fresh red fruits like strawberry and raspberry.\nMoët Grand Vintage rosé 2008, Champagne, France\nDrinks like a light red with tight bubbles and good effervescence that’s not overwhelming. A nice balance between the dry and sweet Champagne styles.\nRelated\nRead more of our coverage of the Atlanta bar scene\n5 negronis to sip around Atlanta\nMini documentary “New Orleans Sazerac” now online (video)\n15 mimosa brunches around Atlanta\n4 new Atlanta-distilled spirits to add to your home bar\nExplore where to eat in Atlanta with the AJC’s Spring Dining Guide\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following@ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/places-drink-rose-around-atlanta-right-now/4ghHjpxTjvSf3ousH3lDMK/"}
