{"authors":["Quinn Keaney"],"date_download":"2018-10-30 22:56:51","date_modify":"2018-10-30 22:56:51","date_publish":"2014-08-14 16:03:29","description":"When it comes to the Kardashians, finding a redeemable quality is like searching for for a patch of skin on Kris Jenner's face that hasn't been touched by Botox — it's not gonna happen. That being said, one of the few reasons I still held out hope…","filename":"data/vaneerConsumption/7ReasonsKhloeKardashianFrenchMontanasRelationshipNeedstoEndASAP.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/f8fe3e17-7458-4482-8f40-5810241baa0a.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35748-7-reasons-khloe-kardashian-french-montanas-relationship-needs-to-end-asap_1540940211.html","title":"7 Reasons Khloe Kardashian & French Montana’s Relationship Needs to End ASAP","title_page":"7 Reasons Khloe Kardashian & French Montana’s Relationship Needs to End ASAP","title_rss":"NULL","source_domain":"bustle.com","text":"When it comes to the Kardashians, finding a redeemable quality is like searching for for a patch of skin on Kris Jenner's face that hasn't been touched by Botox — it's not gonna happen. That being said, one of the few reasons I still held out hope for E!'s cash cow of a royal reality TV family (besides Lord Disick, of course) was thanks to one person and one person only: Khloé Kardashian. The youngest of the three Kardashian sisters, Khloé immediately stood out as the funny, self-deprecating, most down-to-earth of them all. That's why I'm so baffled as to why Khloe's still dating French Montana, the scummy rapper and jort enthusiast.\nHer legendary cursing and the fact that she has zero qualms about calling out Kim for acting like an insane person every now and then is reason enough to crown Khloé Queen of the Kardashian Klan, but her relationship with French (even though it was sanctioned by Puff Daddy himself) is a major step down. I mean, Koko definitely went through hell following her very messy, and very public, divorce from basketball player Lamar Odom, but still. French Montana? Really? Come on. Unlike him, I am worried about something, and that something happens to be the badass Kardashian sister that makes the rest of them slightly more tolerable. French needs to be run over with Scott Disick's fleet of Lambos for the following reasons:\n1. French doesn't understand how belts work\nObviously a deal breaker.\n2. He spends his days in fluffy white robes sniffing money while posing next to pianos he definitely doesn't know how to play\nOkay, maybe he doesn't spend his ENTIRE day doing this, but I'm willing to bet at least three or four hours.\n3. On a more serious note, French has some serious baby-mama-drama\nRapper Trina, his ex and mother of his child Kruz, has made it more than clear that she's not a fan of Khloé, who she claims French up and left her for. Regardless of whether or not the reports are true, a man with all this public baggage probably isn't the best way for Khloé to move on from her own.\n4. Kris Jenner isn't too thrilled with him\nCuddly Instagram pics aside, Kris Jenner has made it clear (or, sources for Kris Jenner have made it clear) over the past few months that French isn't her number one choice for her daughter, especially once a picture of French and Khloé surfaced holding guns and chugging champagne.\nKris is worried that Khloé has lost herself. She is just so blown away that Khloe would post a photo of herself like that. This is not something she would have ever done in the past,” a friend spilled in an exclusive with HollywoodLife. “She knows better. She’s living in French’s world, not the other way around and Kris is worried about her.”\nWhen Kris Jenner, momager from hell, starts worrying, so should we.\n5. French's taste in music videos is... creepy\nHis Purge- inspired music video for \"Don't Panic\" stars the Kardashian sis, and the whole thing is just... ick. From the clown masks to the screaming woman tied to a chair, it leaves a bad taste in my mouth. To be fair, however, the snippet of the couple laughing at the end of the video is pretty cute. Not cute enough to justify her dating him, but whatever.\nFrenchMontanaVEVO on YouTube\n6. He may be using Khloé to spike his career\nAlthough the rapper adamantly denies it, Khloé has easily tripled his star-status since the pair started dating. From Instagrams and tweets with every member of the family to his new video getting a bump from her role in it, French is definitely coming out on top thanks to her.\n7. And finally, French Montana wore this outfit once\nFrederick M. Brown/Getty Images Entertainment/Getty Images\n#shame #unforgivable #bye\nImages: Getty Images (2); Kris Jenner/Instagram","url":"https://www.bustle.com/articles/35748-7-reasons-khloe-kardashian-french-montanas-relationship-needs-to-end-asap"}
