{"authors":["Amy Sciarretto"],"date_download":"2018-10-30 22:28:47","date_modify":"2018-10-30 22:28:47","date_publish":"2014-08-15 16:30:04","description":"Today, August 15, is National Relaxation Day! While most of us would like to take the day off, chill out on the beach, and turn off the iPhone to allow the work emails to pile up and remain unanswered until Monday, that's not always a reality. But…","filename":"data/vaneerConsumption/7RelaxingBeautyProductsToMakeYouFeelTotallyChillAndZenEveryDay.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/8c3fe406-0e02-4528-946e-c4e990583d37.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35880-7-relaxing-beauty-products-to-make-you-feel-totally-chill-and-zen-every-day_1540938527.html","title":"7 Relaxing Beauty Products To Make You Feel Totally Chill And Zen Every Day","title_page":"7 Relaxing Beauty Products To Make You Feel Totally Chill And Zen Every Day","title_rss":"NULL","source_domain":"bustle.com","text":"Today, August 15, is National Relaxation Day! While most of us would like to take the day off, chill out on the beach, and turn off the iPhone to allow the work emails to pile up and remain unanswered until Monday, that's not always a reality. But that doesn't mean that you can't engage in a bunch of relaxing activities or indulge in relaxing products today... or any day, really. Don't let fake holidays tell you when you can and can't chill out.\nIf you can't make it a massage table anytime soon, don't stress any more than you already are. It's not good for your posture.\nInstead, head over to Duane Reade or CVS or your favorite retailer and stock up on these products that will help you take it easy any day of the week. Whether it's through tactile stimulation of your skin or through the tickling of your olfactory sense, these products will aid you in your goal to achieve a relaxed state on some level — and then every day will be like National Relaxation Day!\nUse this as your key. Try and make some relaxation time (maybe aim for an hour) for yourself each and every week. Escape from the chaos of your day and pamper your skin and your senses. Or start your day with relaxing exercises or routines. You deserve it.\nYou can't be go-go-go all the time. Even tigers need to take a break from roaring in favor of a nap. Like this guy!\nEven talk show doyennes need long soaks in hot baths.\nHere are seven products that will help you relax, just like Frankie Goes to Hollywood would want it.\nBaby Magic Soft Cotton Blooms Lotion, $7, Amazon\nMmm, the soft fresh scent of baby lotion. Baby Magic's Gentle Baby Lotion in Soft Cotton Blooms has this fragrance that is light, soothing, and lingers all day. I slather this on immediately after showering on days that I don't want to do perfume. The bouquet-ish mix of jasmine and lilies helps me relax with every inhalation.\nMedium Body Brush, $28, Skin Preserve\nI realize that the thought of rubbing rough, harsh bristles on the still-sleepy skin of your arms and legs when you first wake up doesn't sound appealing. But trust me: Dry brushing is better than a wake up shot of espresso. Not only does it slough off dead skin cells before you shower, leading to glowing, pretty skin, it also stimulates and stokes bloodflow and circulation, which leads to a warm and tingling sensation. It's not easy to endure, but it hurts so good. But if you suck it up and just do it, it's worth it.\nJosie Maran Argan Sugar Balm Body Scrub, $23, Amazon\nAfter I brush my skin, I hop in the shower, slather on Josie Maran's Argan Sugar Balm Body Scrub, which further but gently exfoliates and then softens my skin. The gritty texture reminds me of taking a relaxing stroll on a sandy beach.\nL'Occitane Relaxing Essential Oil Blend, $18, L'Occitane\nMost L'Occitane items are supremely luxe and its Fall 2014 Aromachologie offerings are no slouch in that department. These will totally up the relaxation ante — the label even says so. The oh-so-soothing Relaxing Essential Oil Blend can be rubbed into temples or pulse points, while The Relaxing Body Cream is richly moisturizing and I always feel loosened up and destressed when slathering an opulent cream on my body.\nNeutrogena's Light Sesame Formula Body Oil, $11, Amazon\nNeutrogena's Light Sesame Formula Body Oil is divine and the now-classic, cult product is fragrance-free. Still, the light yet supremely moisturizing formula is relaxing because you give yourself an impromptu massage by rubbing it into your arms, legs, back, feet, and hands. I am drifting into a lull just thinking about it.\nJojoba Company Australian Golden Jojoba Oil, $27, Amazon\nJojoba Company Australia's 100% Natural Ultimate Jojoba Youth Potion is one helluva multi-tasker. It moisturizes and soothes both face and body, but I use it specifically before bedtime, dabbing some on my fingertips and rubbing my scalp, since it's so nerve-dense, and on my cuticles, which can get dry. It's like a DIY mani in-between my weekly nail salon appointment. I also use a few drops on my face in the morning, massaging in a circular motion before applying my regular SPF lotion. Ahhh!\nGoody Tanglefix Lightweight Tear Free Styling Brush, $5, Amazon\nThis Goody detangler brush is meant to, well, detangle, but I use it to massage the scalp. Get a good(y) grip on the tool, place it on the scalp, and slowly pull it down the length and shaft. Sometimes I do half-circles for a little more tingle, but not too much, because it can get caught in the hair. But I use it for \"feel good\" purposes. It feels amaze. Know what feels even better? Having someone else do it for you.\nImages: Giphy (2); Amy Sciarretto (6); L'Occitane","url":"https://www.bustle.com/articles/35880-7-relaxing-beauty-products-to-make-you-feel-totally-chill-and-zen-every-day"}
