{"authors":["Amanda Chatel"],"date_download":"2018-10-31 01:45:52","date_modify":"2018-10-31 01:45:52","date_publish":"2018-08-27 20:13:49","description":"When it comes to important components to a healthy relationship, trust between you and your partner, along with communication, aren't just important but paramount. It's so crucial to put these two front and center. Especially if it feels like that…","filename":"data/vaneerConsumption/7SignsYourPartnerDoesntTrustYouAccordingToExperts.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/68e0405d-0cfc-4cbe-9382-2c5953d04ca1-zaeh_bustle_aug2015-570.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_7-signs-your-partner-doesnt-trust-you-according-to-experts-10246572_1540950352.html","title":"7 Signs Your Partner Doesn't Trust You, According To Experts","title_page":"7 Signs Your Partner Doesn't Trust You, According To Experts","title_rss":"NULL","source_domain":"bustle.com","text":"When it comes to important components to a healthy relationship, trust between you and your partner, along with communication, aren't just important but paramount. It's so crucial to put these two front and center. Especially if it feels like that trust and communication are wavering.\n\"For the most part, a lack of trust in a relationship is something that will break the bond,\" sexuality counselor and author of My Husband Wont Have Sex With Me and The Ultimate Intimacy Guide For Passionate People, Dr. Dawn Michael, tells Bustle, \"People have to feel like they can trust the person they love and feel like they can be themselves around that person, trust truly defines the nature of the relationship being a close intimate committed relationship as opposed to one that is never truly committed.\"\nEven if you feel like there's no reason for your partner not to trust you, that doesn't mean that they do. People can have trust issues for so many different reasons, from things that happened in past romantic relationships, like infidelity, to something traumatic from their childhood. So if your partner doesn't trust you, it's not always because of your actions. But it is important to talk to them about it. So here are seven signs your partner doesn't trust you, according to experts.\n1 They Check Your Phone Andrew Zaeh for Bustle Your partner may ask to see your phone or maybe you've even caught them looking at it when you're coming out of the shower. Either way, that's major sign that they don't trust you. And, they may even go about it in a super sneaky way. In some cases, according to Dr. Michael, your partner might even ask how your phone works, just to have access to it. \"They ask to look at your phone because they are curious about how it functions, or your computer... they are sneaky about it but not sneaky enough if you are paying attention,\" says Dr. Michael. \"They don't want you to know they are checking up on you so they go about it in a passive way. This can be that they don't trust you or that they have a difficult time trusting.\" Ultimately, snooping does more damage than good, because so much can be misread or misconstrued. \"And what is your partner looking for? Signs that you are cheating — or staying in touch with one of your exes,\" Dr. LeslieBeth Wish, noted author, licensed psychotherapist, and founder of Love Victory, tells Bustle.\n2 They Ask A Lot Of Questions Andrew Zaeh for Bustle If you feel like you're on an episode of Law & Order when you come back from a night with your friends, because you're literally being interrogated by your partner, it's pretty clear they don't trust you and have doubts about your honesty. \"[They question] you about everything and when you answer they ask more questions or seem to not be pleased with your answer,\" says Dr. Michael. \"Some people are more direct in their approach and others are more subtle.\"\n3 They Follow Your Whereabouts Andrew Zaeh for Bustle \"[They call] your friends to see if you are really with them, as you said you were, or call your workplace,\" says Dr. Wish. \"Similarly, this surveillance comes from doubts that the relationship is solid.\" According to Dr. Michael, the whereabouts question definitely comes into play. Even if the inquiry isn't exactly direct and they're trying to get information from others.\n4 They Look Into Your Finances Ashley Batz for Bustle Of course, what you do with your money is your business, but that won't always stop a partner who doesn't trust you from invading your financial privacy. \"Your partner could be wondering what you might be up to,\" says Dr. Wish. \"For example, does your balance suddenly go down or up a lot. And just for what and to whom are you writing checks? This behavior is common in relationships where a partner is abusive and controlling.\"\n5 They Keep You At Arm's Length Ashley Batz for Bustle If your partner doesn't trust you, they're going to play it close to the chest, and who can blame them? Even if their lack of trust is unfounded, it doesn't matter; they're going to create space between you and them. \"Your partner is unwilling to open up about themselves and get too attached to you, always keeping you at a distance,\" says Dr. Michael. \"They may not trust your enough to want to reveal too much about themselves and get close to you, keeping you at arms length.\"\n6 It Seems Like They're No Longer Enjoying Sex With You Ashley Batz for Bustle A lack of trust can be a mental roadblock for some people. If that's the case, the roadblock might pop up during sex too. So, take note if they seem checked out or different when you're in bed. \"Sexually, it can play out where they may not be able to have an orgasm or let go while having sex,\" says Dr. Michael. \"They don't trust you enough to just let go an enjoy the experience.\" In other cases, according to Dr. Wish, there may no longer be sexual intimacy at all.","url":"https://www.bustle.com/p/7-signs-your-partner-doesnt-trust-you-according-to-experts-10246572"}
