{"authors":[],"date_download":"2018-10-30 21:11:50","date_modify":"2018-10-30 21:11:50","date_publish":"2016-12-29 05:00:00","description":"Top-ranked Alabama faces fourth-ranked Washington in the Chick-fil-A Peach Bowl on New Year’s...","filename":"data/vaneerConsumption/7thingstoknowaboutAlabama.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/29/Images/newsEngin.17145885_Alabama-Practice-Foot_Team-2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_college_things-know-about-alabama__1540933910.html","title":"7 things to know about Alabama","title_page":"7 things to know about Alabama","title_rss":"NULL","source_domain":"ajc.com","text":"Top-ranked Alabama faces fourth-ranked Washington in the Chick-fil-A Peach Bowl on New Year’s Eve at the Georgia Dome in Atlanta. The winner of the College Football Playoff semifinal game will move to the national championship game Jan. 9, 2017, in Tampa, Fla., against the winner of the Fiesta Bowl between Clemson and Ohio State.\nKEY PLAYER, OFFENSE: JALEN HURTS\nAlabama built its offense around its freshman quarterback. Hurts has delivered throughout the season. Hurts’ mobility added another dimension to Alabama’s offense that it hasn’t had under coach Nick Saban (Blake Sims was a mobile quarterback, but Alabama didn’t run him much). Hurts has thrown for 2,592 yards and 22 touchdowns, and rushed for 841 yards and 12 touchdowns this year. He’s racked up plenty of honors for his play. Hurts was named first-team All-SEC and was voted both SEC Offensive Player of the Year and Freshman of the Year. Hurts also was in the Heisman Trophy conversation at one of the season. Look for him to be mentioned in those talks again next year.\nKEY PLAYER, DEFENSE: JONATHAN ALLEN\nThere are a number of Alabama defenders who could be mentioned here, but we’ll go with Allen since he became the first Alabama player in school history to win national defensive player of the year. Allen, the winner of the Bednarik Award, Nagurski Trophy and Hendricks Award, has a career-high 56 tackles this season, including 13 tackles for loss and 8.5 sacks. Allen also has 15 quarterback hurries, a blocked field-goal attempt and two fumble recoveries, both of which were returned for touchdowns. Allen is one of three Alabama players selected unanimous All-American. He was one of Alabama’s most consistent players and he also performed some highlight plays. Allen finished seventh in the Heisman Trophy race.\nKEY GAME OF THE SEASON\nAlabama’s win over Ole Miss sticks out because the Rebels had beaten Alabama the two previous years. For much of the first half, it looked like Alabama was going to lose its third consecutive game to the Rebels. Ole Miss jumped to a 24-3 lead late in the second quarter, but a kick out of bounds gave Alabama great field position and the Tide took advantage with a touchdown. After the defense forced a punt, safety Eddie Jackson returned a punt for a touchdown to cut Ole Miss’ lead to seven. It was a quick turnaround for Alabama. Who knows how Alabama’s season ends if it doesn’t defeat the Rebels to get over that hump. The win propelled Alabama throughout the year, and now the Tide is 13-0 heading into the playoff.\nUNSUNG PLAYER: DALVIN TOMLINSON\nYou won’t find his name on any postseason awards list, but Tomlinson was one of the more important players on Alabama’s defense. He drew double teams that allowed teammates to make plays and was a dominant force along the defensive line with 54 total tackles, three sacks, seven quarterback hurries and four pass breakups. Tomlinson also added 4.5 tackles for loss and forced a fumble. He was tough against the run with 48 of his tackles coming against the rush. Alabama’s coaching staff recognized Tomlinson as a player of the week against Ole Miss, Mississippi State, Chattanooga, Auburn and Florida.\nSTRONGEST UNIT: DEFENSIVE FRONT\nDespite all of the talent Alabama lost from last year’s national championship run, the Crimson Tide managed to improve against the run this season. Alabama smothered their opponents’ rushing attack to the tune of 63.4 rushing yards per game, the best in the country and the best mark of the Nick Saban era. Wisconsin, the next best team, allowed 96.9 rushing yards per game. Alabama’s total also is the best mark by any team since 2008, when TCU held opponents 47.1 rushing yards per game. Alabama has allowed just three rushing touchdowns this year. That’s the fewest since Alabama gave up only three rushing touchdowns in 2011.\nMOST VULNERABLE UNIT: SECONDARY\nIt feels like nitpicking to say that any part of the No. 1 defense in the country is vulnerable, but if there is one way opponents could try to attack Alabama, it’s throwing the ball downfield. Alabama is 15th in the nation and second in the SEC in pass defense, allowing 184.5 yards per game. But the Crimson Tide have given up some big plays through the air this season. While only giving up three rushing touchdowns, Alabama has allowed 11 touchdowns through the air. Two of those came against Florida in the SEC Championship game. The Gators feature one of the most inept offenses in the country, so Alabama will need to clean those things up heading into the Peach Bowl. Washington has several talented receivers, so it’s going to be a challenge for Alabama’s secondary, which also is banged up. Starting cornerback Marlon Humphrey and nickel back Tony Brown are both nursing injuries.\nHOW ALABAMA CAN WIN THE PEACH BOWL\nBy playing the way its played all year. Alabama has relied on a stingy defense and explosive plays on offense to propel them to this point. Alabama has given up two touchdowns in its past five games and it’s hard to envision a scenario where Washington is able to match the physicality of Alabama’s defensive front. If Alabama is able to get pressure by rushing only four defenders, it could be a long afternoon for quarterback Jake Browning and the Huskies. Washington has a lot of trick plays in its arsenal, so Alabama will have to be aware of those. On offense, the Crimson Tide must take care of the ball. Washington is No. 1 in the country in turnover margin, which means the Huskies don’t often give the ball away, while also forcing their opponents into mistakes. The Huskies have forced 33 turnovers and have committed only 12 this season. Alabama is the more talented team, but it will take Alabama’s best game of the year to beat Washington.","url":"https://www.ajc.com/sports/college/things-know-about-alabama/cZgFRItY5CwScwRh1QeI2O/"}
