{"authors":["Georgette Eva"],"date_download":"2018-10-30 22:46:04","date_modify":"2018-10-30 22:46:04","date_publish":"2014-08-14 19:49:10","description":"Along with being an old soul and having a crown of glorious golden tresses, Taylor Swift is a big nerd. Seriously. I don’t mean Natalie Benson, who was Tay Swizzle’s alter-ego on The Tonight Show Starring Jimmy Fallon, but don’t you get the…","filename":"data/vaneerConsumption/7TimesTaylorSwiftWasaCompleteandUtterNerd.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/3d74bf3b-2484-4294-b191-f879468d64ad.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35829-7-times-taylor-swift-was-a-complete-and-utter-nerd_1540939564.html","title":"7 Times Taylor Swift Was a Complete and Utter Nerd","title_page":"7 Times Taylor Swift Was a Complete and Utter Nerd","title_rss":"NULL","source_domain":"bustle.com","text":"Along with being an old soul and having a crown of glorious golden tresses, Taylor Swift is a big nerd. Seriously. I don’t mean Natalie Benson, who was Tay Swizzle’s alter-ego on The Tonight Show Starring Jimmy Fallon, but don’t you get the impression that Natalie's what Swift’s inner self looks like? It’s not a bad thing. I, too, enjoyed Natalie’s \"tri-tail\" hairstyle and braces, having sported some myself once. Of course, later on in the show, I wasn’t surprised when Swift, back to her stage-ready and well-dressed Swift-iness, admitted that a lot of Natalie was influenced by herself. Yeah, the whole “I am Natalie I like to create popsicle stick castles by myself sometimes” was pretty much Swift’s childhood. She proved it by showing Fallon a scar on her leg, which she got because of a crafting accident concerning a popsicle stick castle and an industrial strength hot glue gun, because she goes hard when it comes to craft supplies.\nSwift was making a slide for the bears that lived inside the castle and her overeagerness got the better of her. Granted, Swift was 10 or 11 at the time, and it is certainly adorable that she was making a fancy abode for her bears, but as Fallon said, that was “such a nerdy story.” It’s not the first time Swift’s let her true nerd show. In fact, here are the six nerdiest Taylor Swift moments with scientific nerd rankings.\nThe Tonight Show Starring Jimmy Fallon on YouTube\nShe’s a Cat Lady\nSwift’s fans are well acquainted with Swift's cat Meredith. She constantly posts photos of the feline on her Instagram, and she even decked out her phone cover with kittens. I get it. She likes cats. Her BFF Ed Sheeran even told MTV that “When she’s on stage, she’s an entertainer and a performer. But when she’s off stage, she spends half the time tossing cat treats to her cat.”\nNerd Level: One overly large pair of thick black rimmed glasses\nShe Needlepoints\nSwift apparently graduated from popsicle stick castles to needles and colorful thread. Swift made Sheeran a needlepoint, which he has hanging on his wall. It even has a Drake quote which makes this nerdy masterpiece even nerdier, because it practically breaches that line of fanart.\nNerd Level: Two pocket protectors\nShe Bakes\nIt certainly falls into the realm of her Susie Homemaker persona. It's adorable and tasty for sure, but it falls into the nerdy category especially because when she hosts a Fourth of July part of stars like Lena Dunham and Jamie King, Swift's fun activity is baking American flag cakes.\nNerd Level: One mouthful of braces\nShe Has a Onesie\nNo explanation needed.\nNerd Level: One adult-sized onesie\nShe Named Her Cat after a TV Character\nThis cute fluffy kitten — Cats! More cats! — is named after Law and Order SVU's Olivia Benson. TV show dedication like that is a high fanatical level.\nNerd level: a set of Dungeons and Dragons dice\nShe's a History Buff\nOK, I assumed that from this Instagram shot of her and model Cara Delevingne that she enjoys studying our Founding Fathers — then again, who doesn't? — but she does get nerd points for striking George Washington's pose for this cheesy photo.\nNerd Level: Uncontrollable snorts and laughter\nI inputted all of the data, and it looks like Swift is indeed a huge nerd. She's actually at pro-nerd level here. But that's OK because while I'm laughing hard at Swift's impression of herself as Natalie, I'm also secretly wishing I had a pegacorn too.\nThe Tonight Show Starring Jimmy Fallon on YouTube\nImages: Taylor Swift/Instagram (5)","url":"https://www.bustle.com/articles/35829-7-times-taylor-swift-was-a-complete-and-utter-nerd"}
