{"authors":["Amanda Chatel"],"date_download":"2018-10-31 01:44:51","date_modify":"2018-10-31 01:44:51","date_publish":"2018-08-27 21:07:50","description":"As one of the many women who travel alone, and has traveled to some faraway, exotic places, I can attest to the fact that it's an extraordinary experience. In some ways, traveling alone can be better than traveling with your friends because you get…","filename":"data/vaneerConsumption/7TravelHacksThatllMakeYouFeelMoreConfidentWhenYoureTravelingAlone.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/0881a2ef-fdc4-46d5-a01e-e3f5738ca3ff-fotolia_217476144_subscription_monthly_m.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_7-travel-hacks-thatll-make-you-feel-more-confident-when-youre-traveling-alone-10249649_1540950291.html","title":"7 Travel Hacks That'll Make You Feel More Confident When You're Traveling Alone","title_page":"7 Travel Hacks That'll Make You Feel More Confident When You're Traveling Alone","title_rss":"NULL","source_domain":"bustle.com","text":"As one of the many women who travel alone, and has traveled to some faraway, exotic places, I can attest to the fact that it's an extraordinary experience. In some ways, traveling alone can be better than traveling with your friends because you get to enjoy things in an intimate way that traveling with a group doesn't allow. When you travel alone, you're forced to get out of your comfort zone, talk to people you wouldn't normally talk to, and even face some of your fears. But to do so requires confidence and a backbone that your day-to-day life doesn't usually require.\n\"I think a lot of women are afraid to travel solo because they’ve been told it’s not possible or it’s not safe,\" Hostelworld’s head of product and design and travel expert, Breffni Horgan, tells Bustle. \"Don’t let that stop you. If you’ve done your research, planned wisely, and set your mind on traveling, you will succeed and it will change your life. Everyone tells you that traveling will make you more confident, that you’ll find yourself, that you’ll be creatively inspired. That’s all true, but only if you take a chance on solo travel and embrace the challenges that will inevitably pop up along the way.\"\nSince you can't achieve being more confident without gaining confidence along the way, here are some travel hacks to boost your confidence when you're traveling solo.\n1 Do Your Research Ashley Batz for Bustle \"Take some time to figure out the best places to go,\" Erica McCurdy, life coach and master certified coach of LunaNav Consulting, tells Bustle. \"Knowing the top destinations, the times they are open, and the most interesting things to do makes a destination feel less [alone].\" Although there are many ways to do that, I would highly suggest Anthony Bourdain's Parts Unknown. His insight on how to really travel fearlessly will always be just as relevant as it is important to cultures everywhere.\n2 Download Local Transit Apps Ashley Batz for Bustle \"Many cities now have apps for local transit,\" says McCurdy. \"Download the app and play around with finding your way in a virtual setting. This way, when you land, you already have a sense of where you are and how different places connect. You will also have information on your phone so you can 'point and show' people where you are heading if you get lost or language is an issue.\" If you can find travel apps that work without an internet connection, like Google Maps, even better. Vietnam, for example, has zero cell reception with not the greatest WiFi in very few areas outside of hotels, so without apps, you'd be lost for sure.\n3 Memorize The Big Five Phrases Ashley Batz for Bustle \"In any language, know what I call the big five key phrases,\" says McCurdy. \"These are: hello, goodbye, please, thank you, and excuse me. With these, one can always start and finish a conversation or request help politely and in the language of the country. These five words are a game-changer for a traveler.\" Even if you stumble or mispronounce something, you have made an effort to use the local language, which many people will appreciate. While you can rely on apps that translate what you want to say out loud, doing it the old-fashioned way, you know, with your mouth, is likely to be more welcome. Especially in countries where technology advances aren't exactly there yet.\n4 Make Friends With The Concierge naka/Fotolia Although Anthony Bourdain once said, \"If you're at the mercy of a concierge, you're in a bad place,\" being on friendly terms with the concierge can be a good thing. Because if you tell them you want something local and free of tourists, they'll know in which direction to send you. You just need to be clear about what you want. \"Introduce yourself to the concierge or front desk clerk at your hotel or guest house,\" says McCurdy. \"These people are well-wired in the local community. Usually, they are friends with local restauranteurs and café owners. Let them know why you are visiting and share a little bit about something positive you have experienced in their city or country.\" Locals love to share what their city has to offer. I had Vietnamese BBQ at a hole-in-the wall spot with the guys who worked at my hotel in Hanoi and it was amazing. Sitting on a dirty floor, in a place down a dark alley, although daunting at first, is an experience worth having. \"Often, this relationship opens doors to more local relationships and potentially new global friendships,\" says McCurdy.\n5 Give Yourself A Project Related To Your Travels Hannah Burton for Bustle \"Divert that nervousness into something more productive,\" says McCurdy. \"Make a plan to blog about your experience or plan on sharing your trip via Instagram story or photographs. This gives your energy a place to 'land' other than worrying about things you cannot control.\" Wherever I go, I always bring a book that takes place in that country. For me, any nervousness that might arise is quickly put to bed by getting lost in a book about my surroundings. It will also give you ideas of things to see that might not be in tourist guides.\n6 Take A Class Flamingo Images/Fotolia \"You are alone, but you don’t have to do everything solo,\" says McCurdy. \"Take a local cooking class or museum tour. Floating in and out of groups lets us have some interaction and can help dissipate that feeling of isolation.\" I always try to take a cooking class in every country I explore. Although I've yet to master chakalaka, a traditional South African dish, the experience and the people I met was worth re-realizing I shouldn't cook. In cooking classes, especially, you learn so much about the culture because food brings people together.","url":"https://www.bustle.com/p/7-travel-hacks-thatll-make-you-feel-more-confident-when-youre-traveling-alone-10249649"}
