{"authors":["Kristine Fellizar"],"date_download":"2018-10-31 01:45:24","date_modify":"2018-10-31 01:45:24","date_publish":"2018-09-14 13:32:36","description":"Sociopaths aren't exactly known for being the best type of partners. They tend to focus more on themselves than anyone else. When it comes to commitment, experts say sociopaths in relationships have some pretty unexpected habits to be aware…","filename":"data/vaneerConsumption/7UnexpectedHabitsSociopathsHaveInRelationships.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/12/f794c3ce-32d4-45da-96e6-fd4a19ae7c66-2t4a9710.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_7-unexpected-habits-sociopaths-have-in-relationships-11891630_1540950324.html","title":"7 Unexpected Habits Sociopaths Have In Relationships","title_page":"7 Unexpected Habits Sociopaths Have In Relationships","title_rss":"NULL","source_domain":"bustle.com","text":"Sociopaths aren't exactly known for being the best type of partners. They tend to focus more on themselves than anyone else. When it comes to commitment, experts say sociopaths in relationships have some pretty unexpected habits to be aware of.\n\"While 'sociopath' is not a formal diagnosis, sociopaths typically have some (or all) of the characteristics of antisocial personality disorder and/or narcissistic personality disorder,\" licensed mental health counselor Erin Parisi tells Bustle.\nWhen dealing with people, Parisi says sociopaths tend to use others for their own personal gain. They don't feel like rules or even laws apply to them, and they often put themselves first and may not feel genuine empathy. Once they've received whatever it is they need or want from a person, they move on. Gaslighting is also another tactic sociopaths know how to do very well in relationships.\n\"Sociopaths can take many forms, depending on what it is they're looking to gain from the relationship,\" she says. \"Spotting a sociopath is difficult because they’re often skilled chameleons.\" They're basically masters at manipulation and know how to act around someone in order to stay undetected.\nAs Parisi says, spotting them can be challenging. So here are some unexpected habits sociopaths may have in relationships, according to experts.\n1 They Communicate A Lot In The Beginning Ashley Batz/Bustle As Lucio Buffalmano, relationships coach and founder of ThePowerMoves.com, tells Bustle, \"Sociopaths often follow a typical three-wave phase in a relationship: idealize, devalue, and discard.\" So at the beginning of a relationship, a sociopath may do what they can to make their partner feel like they really want them. They want their partner to feel like they're excited about getting to know them and will try to stay in constant communication by texting or calling them first. Whereas this can be the marker of a good relationship in some cases, in a relationship with a sociopath this type of attention can quickly fade.\n2 They Stay Friends With Their Exes Andrew Zaeh for Bustle A 2017 study published in the journal Personality and Individual Differences found that people who have \"dark\" personality traits such as narcissism, duality, and psychopathy try to keep their exes around. As you would guess, these people tend to stay friends with exes for self-serving reasons including a desire for love, status, information, money, or sex. For a sociopath, it's fairly easy to get back in their ex's good graces. \"It’s easy for the sociopath to figure out what someone needs to hear,\" Parisi says. \"They can easily say it and continue on doing whatever it is they want to do.\"\n3 They Have A Person Who's Well-Liked In Their Corner Andrew Zaeh for Bustle Sociopaths usually look to form relationships with people who are well-liked and have good character. In doing so, Grace W. Wroldson, author of So You Love an...Alcoholic? : Lessons for a Codependent, tells Bustle, a high-functioning sociopath will feel like they have credibility or status just by being associated with this well-liked person. \"Look for who they are using,\" she says. While it is one thing for someone to have popular friends, a sociopath will use these friends for personal gain.\n4 They Like Spontaneous, Thrilling Dates Andrew Zaeh for Bustle An excessive need for thrill and stimulation could be signs os a sociopath. \"While this can often be mistaken for ‘spontaneity’, sociopaths are constantly looking for novel thrills and risks due to their low self-discipline and boredom,\" Caleb Backe, Health and Wellness Expert for Maple Holistics, tells Bustle.\n5 They Keep It Cool During Extremely Hard Times Andrew Zaeh for Bustle \"Sociopaths have tendencies to stay serene in even the most absurd circumstances,\" Backe says. Although it's good to be around people who can stay calm during challenges or stressful situations, it's a little different with sociopaths. According to Backe, for them it's \"more like a super-human untouchable power, like they couldn’t care less about what happens.\" A lack of empathy may be to blame for this.\n6 They Want To Know Everything About Their Partner, But Will Share Little About Themselves Ashley Batz/Bustle Unlike narcissists, Backe says a sociopath will rarely turn the attention to themselves. \"You will find yourself walking away feeling somewhat vulnerable as they know everything about you,\" he says. Unfortunately the same couldn't be said for the someone getting to know them. A sociopath will give someone just enough information to feel like they're in the know, but in reality, it's rarely anything deep or personal.","url":"https://www.bustle.com/p/7-unexpected-habits-sociopaths-have-in-relationships-11891630"}
