{"authors":["Emily Dixon"],"date_download":"2018-10-31 01:38:27","date_modify":"2018-10-31 01:38:27","date_publish":"2018-08-28 17:22:22","description":"Arthritis, a joint disorder that results in inflammation and pain, is not a disease most people associate with youth. According to the NHS, over ten million people in the UK are living with the condition, the most common subtypes of which are…","filename":"data/vaneerConsumption/7UnexpectedSignsOfEarlyOnsetArthritisBecauseTheDiseaseDoesntJustAffectOlderPeople.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/6e2ea0f1-6b1d-4adb-a1af-72333939ec9b-stocksy_txp71f394b9a24200_small_1865431.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_7-unexpected-signs-of-early-onset-arthritis-because-the-disease-doesnt-just-affect-older-people-10259498_1540949907.html","title":"7 Unexpected Signs Of Early Onset Arthritis, Because The Disease Doesn't Just Affect Older People","title_page":"7 Unexpected Signs Of Early Onset Arthritis, Because The Disease Doesn't Just Affect Older People","title_rss":"NULL","source_domain":"bustle.com","text":"Arthritis, a joint disorder that results in inflammation and pain, is not a disease most people associate with youth. According to the NHS, over ten million people in the UK are living with the condition, the most common subtypes of which are osteoarthritis and rheumatoid arthritis — but not all of them are elderly. The Guardian reports that in the UK, 27,000 people under 25 have a form of the disorder, so if you're experiencing any of the signs of early onset arthritis, don't discount them simply because of your age.\nLet's unpack the subtypes of arthritis first. The NHS says that osteoarthritis is the most common form of the disorder in the UK, impacting approximately 8 million people. It occurs when cartilage around the joints breaks down, causing swelling, pain, bony growths called \"osteophytes\", and impeded movement. Osteoarthritis most frequently afflicts people in or over their late 40s, especially women.\nRheumatoid arthritis, meanwhile, is an autoimmune disease, causing the immune system to mistakenly target \"the cells that line your joints.\" Over 400,000 people have the disease in the UK, and the symptoms are similar: stiffness, pain, and swelling. It usually develops between the ages of 40 and 50, and again, women are more likely to experience it — three times more likely, according to the NHS. There's a specific subcategory for the types of arthritis that set in before the age of 16; they're known as juvenile idiopathic arthritis, according to Arthritis Research UK.\nWhile there's no absolute cure for arthritis, there are numerous treatments available to alleviate the symptoms of the condition. Those with osteoarthritis might be prescribed painkillers, steroids, or non-steroidal anti-inflammatory drugs, according to the NHS; in severe cases, surgical intervention might help. People diagnosed with rheumatoid arthritis, meanwhile, might be offered painkillers or disease-modifying anti-rheumatic drugs, and could also be encouraged to exercise regularly or try physiotherapy. In short? There's treatment out there, so don't ignore your symptoms; if you're experiencing any of the following, make an appointment with your GP.\n1 Joint Pain Rob and Julia Campbell/Stocksy Joint pain is probably the most obvious symptom of arthritis — it is, after all, a joint disorder. The pain typically resulting from rheumatoid arthritis, according to the NHS, is “a throbbing and aching pain” which might get worse after you’ve been inactive, or first thing in the morning. Those living with osteoarthritis might also notice “a grating or crackling sound or sensation”, or might experience pain when moving the affected joints.\n2 Swelling, Warmth, And Redness Leander Nardin/Stocksy Inflammation is particularly problematic for people with rheumatoid arthritis, according to the Arthritis Foundation, because \"the immune system attacks the lining of the joint\", causing it to become inflamed. Those with osteoarthritis might also experience inflammation \"in response to the cartilage breakdown\" that occurs around the affected joints. If the areas around your joints swell up, feel warm, or become red, bring it to the attention of your doctor.\n3 Stiffness BONNINSTUDIO/Stocksy According to WebMD, joint stiffness and other symptoms of arthritis \"tend to develop and worsen over several weeks or months\"; stiffness is usually worse in the morning, and while it might gradually improve, it might also last throughout the day. Common areas afflicted by stiffness, according to the website, include the knees, ankles, wrists, hands, fingers, hips, elbows, shoulders, and feet.\n4 Weight Loss Kathryn Swayze/Stocksy There's a range of possible causes behind unexplained weight loss, but according to Heathline, unintended weight loss can be a symptom of rheumatoid arthritis. Whether it's down to arthritis or otherwise, it's worth having a chat to your doctor if you've lost weight unexpectedly, in order to figure out if there's a particular cause behind it.\n5 Fatigue Kayla Snell/Stocksy According to the Arthritis Foundation, there’s two major reasons why arthritis can lead to fatigue. Firstly, dealing with chronic pain, to put it frankly, is exhausting; plus, it can disturb your sleep, tiring you out even further. And secondly, in the case of rheumatoid arthritis, the resulting inflammation stresses and wears out the body, particularly during a severe or lengthy flare-up. Feeling extra tired out lately? Make an appointment with your GP.\n6 Skin Problems Javier Pardina/Stocksy Arthritis doesn't just affect the joints — it can also make itself known on your skin, too. According to WebMD, people with rheumatoid arthritis in particular might experience rheumatoid vasculitis, an inflammation of the blood vessels which can lead to ulcers, or rheumatoid nodules, which are hard lumps under the skin (particularly on bony areas like the fingers, elbow, or ankle). Speak to your doctor if you've noticed any worrying changes in your skin.\n7 Limited Range Of Motion Leandro Crespi/Stocksy \"Inflammation in your joints can cause tendons and ligaments to become unstable or deformed,\" Healthline explains. As a result, you might find your range of motion limited, and might struggle to flex or straighten affected joints. According to WebMD, your doctor might suggest you perform certain exercises to preserve your range of motion and strengthen your joints.","url":"https://www.bustle.com/p/7-unexpected-signs-of-early-onset-arthritis-because-the-disease-doesnt-just-affect-older-people-10259498"}
