{"authors":["Chris Tomlinson"],"date_download":"2018-10-30 21:58:46","date_modify":"2018-10-30 21:58:46","date_publish":"2016-03-31 11:56:44","description":"A report from Libya claims there are at least 800,000 migrants on the coast waiting for the right moment to cross the sea to Italy, and the European Union (EU) plans a new summit to prepare for the next potential great wave of migrants","filename":"data/vaneerConsumption/800000MigrantsLieInWaitInLibyaReadyToBreakForEurope.json","image_url":"https://media.breitbart.com/media/2016/03/GettyImages-490499170.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_03_31__1540936726.html","title":"800,000 Migrants Lie In Wait In Libya, Ready To Break For Europe","title_page":"800,000 Migrants Lie In Wait In Libya, Ready To Break For Europe","title_rss":"NULL","source_domain":"breitbart.com","text":"A report from Libya claims there are at least 800,000 migrants on the coast waiting for the right moment to cross the sea to Italy, and the European Union (EU) plans a new summit to prepare for the next potential great wave of migrants.\nAustrian paper Kronen Zeitung reports that French Interior minister Jean-Yves Le Drian claimed the number of migrants in North Africa waiting to cross the Mediterranean sea numbered in the “hundreds of thousands.” European Union foreign policy chief Federica Moghoerini confirmed the fears of the French official saying that the EU estimated at least 500,000 displaced people were waiting to flee to Italy. Ms. Mogherini was slammed by critics last week after she cried during a press conference following the Brussels attacks, with Members of the European Parliament calling for her resignation over the incident.\nLibya has been a more or less failed state since the fall of Muammar Gaddafi in 2011, and has seen rebel fighters and Islamic State militants battle for control of the country. For months Libyan government forces have struggled to combat the two groups who use the migrant crisis to extort money from African migrants who want to come to Europe.\nMr. Le Drian said their is an urgent need for sides to come together and form a national unity government to control the borders or Europe risks hundreds of thousands of African migrants arriving when the weather on the sea improves.\nHe noted that the European mission to combat people smuggling from North Africa, code named Operation Sophia, has only a limited effectiveness.\nThe ships that track migrant vessels only have the ability to do so in international waters and not in Libyan territory. Mr. Le Drian says that a working government would benefit greatly by allowing EU ships to cooperate with Libyan officials to stop smuggling at the source rather than hope to find them miles out at sea.\nIn the past year around 200,000 people have crossed the sea from Libya into Italy. Around 3,700 of them were killed in accidents where makeshift rafts capsized, resulting in drownings. Some migrants, later identified as Christians, did not survive the trip for different reasons, as they were thrown off boats by Muslims before they could make it to shore. At least 15 Muslim migrants were arrested in one particular incident according to Italian police.\nEuropean leaders have convened a new summit for April 18th to discuss the situation in Libya. The topic of the summit will be how to potentially handle the 800,000 migrants who may attempt to cross into Europe this summer.\nAn unnamed spokesperson for the EU Foreign Affairs Council told Belgian site EurActiv: “…the discussion will focus on the EU support of an inclusive agreement in all sectors, from humanitarian to migratory… including security related aspects. the discussion will take place on April 18th following the regular Foreign Affairs Council meeting and ahead of Foreign Affairs Council Defence on April 19th, in Luxembourg.” The spokesman also said, “the objective will be to bring together foreign affairs ministers with their counterparts in defence in order to effectively address the new challenging situation.”\nBreitbart London previously reported that the EU border agency Frontex has said that stated Africa will be the next great challenge for illegal migration into Europe. Millions of Africans face poverty, war, and disease, and due to a weak regime in Libya, combined with a growing cottage industry of people smuggling, the threat of 800,000 migrants may only be the beginning.","url":"https://www.breitbart.com/europe/2016/03/31/800000-migrants-lie-in-wait-in-libya-ready-to-break-for-europe/"}
