{"authors":["Press Association"],"date_download":"2018-10-22 21:26:04","date_modify":"2018-10-22 21:26:04","date_publish":"2016-01-29 06:48:16","description":"At least 80,000 council homes could disappear by 2020 across England unless local authorities are handed more powers to build new properties, according to th...","filename":"data/vaneerConsumption/80000englishcouncilhomescouldvanishby2020warnslocalgovernmentbody.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-4e9670e5-2520-46fb-ae56-d3eb1d3eeadb-3bmscybNe842cce83474b518a857-703_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3421981_80-000-English-council-homes-vanish-2020-warns-local-government-body_1540243564.html","title":"80,000 english council homes could vanish by 2020, warns local government body","title_page":"80,000 english council homes could vanish by 2020, warns local government body | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"80,000 English council homes could vanish by 2020, warns local government body\nAt least 80,000 council homes could disappear by 2020 across England unless local authorities are handed more powers to build new properties, according to the Local Government Association (LGA).\nThe body estimates that 80,000 out of the 88,000 homes expected to be sold due to the Right to Buy scheme by 2020 will not be replaced.\nThe LGA said that some new housing measures, such as the loss of £2.2 billion from council housing budgets by 2020 as a result of social housing rent cuts, risk making building replacement homes \"all but impossible\".\nEighty thousand of the 88,000 homes in England expected to be sold due to the Right to Buy scheme by 2020 will not be replaced, predicts the Local Government Housing Association\nTown hall leaders forecast that 66,000 council homes will be sold to tenants under the existing Right to Buy (RTB) scheme by the end of the decade, but the LGA said that \"complex rules and restrictions\" make it hard for councils to quickly replace the majority of homes sold.\nCouncils keep a third of sale receipts to build new homes - but they have argued that they should be allowed to retain 100% of receipts locally.\nThe LGA predicts councils could be forced to sell a further 22,000 \"high value\" homes to fund the Government's plans to extend Right to Buy to housing association tenants - adding that this number could be higher depending on the definition of high value .\nThe body argued that the Government should fund the Right to Buy extension by giving councils the power to help raise £13 billion by building more homes on surplus public land rather than forcing the sale of other valuable homes.\nThe LGA warned that a fall in affordable council rented housing would drive up the housing benefit bill by an estimated £210 million by the end of the decade as more families will end up moving into the more expensive private rented sector.\nCllr Peter Box, the LGA's housing spokesman, said: \"As a minimum, we forecast that 88,000 council homes will be sold up to 2020.\"\nHe continued: \"Councils have long called for the ability to replace housing sold through Right to Buy quickly and retain 100% of receipts from all sales.\n\"This is imperative to ensure that councils can reinvest in rapidly building the homes that people in their areas desperately need.\"\nA Department for Communities and Local Government (DCLG) spokesman said: \"The LGA figures are misleading and based on speculation, more council housing has been built since 2010 than in the previous 13 years.\n\"More homes were built as a result of Right to Buy, under the first year of the reinvigorated scheme - showing councils are delivering on their commitment to provide a new affordable property within three years.","url":"https://www.dailymail.co.uk/wires/pa/article-3421981/80-000-English-council-homes-vanish-2020-warns-local-government-body.html"}
