{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:32:12","date_modify":"2018-10-30 20:32:12","date_publish":"2016-01-21 04:15:28","description":"The Department of Defense (DOD) told SIGAR it cannot explain how a project in Afghanistan costing U.S. Taxpayers nearly $800 million failed.","filename":"data/vaneerConsumption/800MillionAfghanistanProgramFailed.json","image_url":"https://media.breitbart.com/media/2016/01/bombed-hospital-afghanistan-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_20__1540931532.html","title":"$800 Million Afghanistan Program Failed","title_page":"Pentagon: $800 Million Afghanistan Program Failed","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON, D.C. — The Department of Defense (DOD) told the Special Inspector General for Afghanistan Reconstruction (SIGAR), a congressionally-appointed watchdog agency, that it cannot explain how a project costing U.S. Taxpayers nearly $800 million failed to produce “the intended economic growth or stabilization outcomes that justified its creation.”\nSIGAR described the program, known as the “Task Force for Business and Stability Operations (TFBSO),” in testimony before the Senate Armed Services Subcommittee on Readiness and Management Support as the Pentagon’s “principal vehicle for stimulating private sector investment in Afghanistan in order to reduce violence, enhance stability, and stimulate the economy.”\n“Over the past two years, SIGAR has received more complaints of waste, fraud, and abuse relating to TFBSO activities than for any other organization operating in Afghanistan,” adds the testimony.\nThe Pentagon implemented the task force to reduce violence, boost stability, and support economic development in Afghanistan.\n“TFBSO was intended to contribute to U.S. government objectives in Afghanistan by bolstering a very weak Afghan economy,” explains SIGAR.\n“Unfortunately though, SIGAR’s cumulative work to date has shown that TFBSO’s nearly $800 million investment in Afghanistan has generally not delivered on its stated goals,” it later adds. “Further, it appears that TFBSO’s activities in Afghanistan were stymied by several avoidable problems and repeated mistakes from its Iraq experience that hindered Task Force operations and outcomes.”\n“A lack of strategic direction and inconsistent management resulted in a scattershot approach to economic development, in which the Task Force invested in everything from importing rare blond Italian goats to bolster the cashmere industry in Herat, to landmine removal, to biofuel research, to funding large-scale projects to support the development of extractives industries,” notes Alexander Bronstein, a spokesman for SIGAR. “Based on TFBSO’s own economic assessment, this inconsistent, unfocused approach has done little to spur economic growth in Afghanistan.”\nThe Pentagon shut down the program at the end of 2014.\n“Founding director Paul Brinkley told SIGAR that as TFBSO director, he approved programs without knowing what they would cost… Since April 2015, DOD has stated that since Congress ended funding for TFBSO, the Department does not have the expertise, authority, or funding to respond to investigations related to TFBSO activities in Afghanistan,” reports Bronstein. “DOD’s responses to SIGAR requests since March 2015 raises a question whether TFBSO operated independent of any internal DOD management and oversight.”\n“The stated failure of the Department to retain any institutional knowledge, and its apparent failure to seek input from what institutional knowledge remained at DOD, indicates a fundamental lack of planning that has resulted in adverse effects on oversight and accountability” he adds. “This failure inhibits oversight of the activities of a Task Force that obligated approximately $760 million.”\nOf the nearly $823 million that Congress had appropriated since 2009 for the program in Afghanistan as of September 30, 2015, nearly $760 million was obligated and about $640 million has been disbursed.\n“TFBSO ended its programs in Afghanistan on December 31, 2014, and ceased all operations on March 31, 2015,” notes SIGAR.","url":"https://www.breitbart.com/politics/2016/01/20/watchdog-pentagon-unable-to-explain-how-a-nearly-800-million-program-in-afghanistan-failed-to-meet-its-objective-the-department-of-defense-dod-told-the-special-inspector-gener/"}
