{"authors":[],"date_download":"2018-10-22 21:52:30","date_modify":"2018-10-22 21:52:30","date_publish":"2018-08-01 00:00:00","description":"Is there a secretive postal organization fixing international shipping rates, and giving American businesses a bad deal?","filename":"data/vaneerConsumption/857ThePostalIlluminati.json","image_url":"https://media.npr.org/assets/img/2018/08/01/postalilluminati_wide-449825fd7a238c509b2a473cd611a1724e9f8000.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=634732388_1540245150.html","title":"#857: The Postal Illuminati","title_page":"#857: The Postal Illuminati : NPR","title_rss":"NULL","source_domain":"npr.org","text":"KENNY MALONE, HOST:\nWhen a source comes to you and says, hey, come out to New Jersey, and I will tell you about an international price-fixing conspiracy that is giving foreign businesses a major advantage in the growing e-commerce war, you have only one choice.\nSo we think it's this building, yeah?\nNICK FOUNTAIN, HOST:\nThat's where they're smoking.\nIt's a Friday afternoon, and we're on some beaten up side street next to a junkyard next to a welding facility in Rahway, N.J.\nMALONE: Jayme? Are you Jayme? No?\nWe're going to be calling our source Jayme, Jayme Smaldone, because his real name is Jayme Smaldone, and he does not mind attention at all.\nJAYME SMALDONE: Hey. What's going, man?\nMALONE: Jayme?\nSMALDONE: Kenny?\nMALONE: Good to meet you, man.\nSMALDONE: What's up, man?\nFOUNTAIN: Jayme Smaldone is a ball of energy. He's constantly moving or talking or one might imagine knocking things over.\nMALONE: Which is why it works out very well that Jayme's the CEO of a company that makes a mug that is very hard to knock over. It's called The Mighty Mug. And Jayme demonstrates that it works because of some complicated suction cup system and, I don't know, science.\nSMALDONE: So when you put it down and you knock into it...\nMALONE: Jayme is smacking this mug like a toddler.\nSMALDONE: So you see that?\nFOUNTAIN: The mug is stuck to the table.\nSMALDONE: But then, when you lift it, see?\nMALONE: Oh, my God.\nFOUNTAIN: What?\nSMALDONE: It's unnatural.\nFOUNTAIN: A few years ago, Jayme started to notice that knockoff Mighty Mugs were popping up all over the place.\nSMALDONE: OK. So I have all of them here. I have a bunch of them here.\nMALONE: All right. Jayme is running off.\nFOUNTAIN: Every great conspiracy theorist has a moment of revelation and Jayme's came from a plastic mug.\nMALONE: Specifically, a red knockoff Mighty Mug that he is now returning with.\nSo this is the one?\nSMALDONE: Yeah.\nMALONE: Where did you get this mug?\nSMALDONE: So I bought that particular one on eBay for $5.69, free shipping from China.\nMALONE: Maybe you've noticed this as well. You can go on eBay or AliExpress. You can buy a mug or, like, a phone charger, and it comes from all the way across the world with free shipping. And the whole thing costs next to nothing. It is dirt cheap. And this does not make sense.\nFOUNTAIN: Like, sure. Maybe you can make this stuff for really cheap, but mailing it across oceans certainly must be expensive.\nMALONE: And this is what Jayme was thinking when that red knockoff mug arrived at his office. Like, how did this thing get here for $5.69 total cost? So he turns to his shipping guy. And he asks, how much would it cost for us just to ship this mug, like, not across the ocean, just across the street?\nSMALDONE: He told me it's going to cost us about $6.30 to ship this item.\nFOUNTAIN: Across the street?\nSMALDONE: Across the street, yeah.\nMALONE: And you say what?\nSMALDONE: Oh, [expletive].\nFOUNTAIN: That's a direct quote?\nSMALDONE: Yeah.\nFOUNTAIN: What dawns on Jayme is that his business is in deep trouble because, somehow, his competitors can manufacture and deliver a mug for less than Jayme pays just to ship his mug.\nMALONE: Jayme Smaldone has been telling anyone who will listen that something is wrong with international shipping. He showed up at his local post office demanding answers. He sent a 15-page letter to the White House. He sent a bunch of messages to us at PLANET MONEY.\nFOUNTAIN: And he says he has finally figured out what is going on. There is a secretive international organization that gets together to fix the price of global shipping, and it's screwing over American small business.\nSMALDONE: I knew - it was like the universe opened up to me. If you go back and you look at my messages to you, like, I saw how everything was going to play out.\nMALONE: Are you aware that when you say these kinds of things...\nSMALDONE: How weird they sound?\nMALONE: ...How - I don't know. I don't want to say conspiracy tin hat-y (ph).\nSMALDONE: Look, I realize how it sounds. But it's - like, look where we are, right? Like, you're here. I knew that you guys would eventually be here.\nMALONE: Jayme was right. We did show up. What if he's right about all of it?\n(SOUNDBITE OF FRENCH INDIE CLUB 4'S \"SUNBURN\")\nFOUNTAIN: Hello, and welcome to PLANET MONEY. I'm Nick Fountain.\nMALONE: And I'm Kenny Malone. Today, on the show, we take the red mug, and we follow it all the way down.\nFOUNTAIN: We'll find out why you can order a cheap gizmo from across the world with dirt-cheap shipping.\nMALONE: And we're not going to say the answer is the Illuminati. But we're not not saying that.\n(SOUNDBITE OF FRENCH INDIE CLUB 4'S \"SUNBURN\")\nFOUNTAIN: The first rule of conspiracy theory reporting is do not get all your information from the guy in New Jersey yelling at the top of his lungs.\nMALONE: Luckily, we found one of the few experts on international postal policy - a guy named Jim Campbell.\nFOUNTAIN: First, we should check for plosives. Would you say postal policy 10 times fast?\nJIM CAMPBELL: (Laughter) OK. Postal policy, postal policy, postal policy, postal - like that...\nFOUNTAIN: You're pretty good, yeah.\nMALONE: That's not bad.\nFOUNTAIN: Jim's done consulting for big private shipping companies, like UPS, DHL, FedEx.\nMALONE: And he told us, oh, yeah, there is absolutely a group of postal policy people. In fact, they are powerful postal policy people, pretty private.\nCAMPBELL: The Universal Postal Union, the UPU. The UPU is headquartered in Bern, Switzerland.\nFOUNTAIN: The Universal Postal Union is part of the United Nations, and it's made up of representatives from the Postal Services of 192 countries.\nCAMPBELL: Basically, the UPU stuff is all secret.\nFOUNTAIN: Ooh.\nMALONE: But Jim tells us not only has he managed to get access to one of these meetings, he has video.\nFOUNTAIN: Well, maybe we might ask you to share it if it - if there's some exciting times.\nCAMPBELL: (Laughter) Yeah. I can share it. I don't know how exciting it is, but...\n(SOUNDBITE OF VIDEO)\nUNIDENTIFIED PERSON #1: On functions of...\nMALONE: We should warn you. If you are operating heavy equipment right now or maybe you're on the road, open the window. Pull off to the side because this is one of the most boring things we have ever put under this podcast.\n(SOUNDBITE OF VIDEO)\nUNIDENTIFIED PERSON #1: We will consider proposals 15.107.2, 1.1 VS as well as 1.1 tier (ph).\nFOUNTAIN: This was the UPU's 2016 Congress in Istanbul. It looks like a fancy ballroom with chandeliers and ornate carpeting and then rows and rows of people wearing, like, translator headsets.\n(SOUNDBITE OF VIDEO)\nUNIDENTIFIED PERSON #2: The term postal service in the UPUX (ph) is used...\nMALONE: So conspiracy point No. 1 - yeah, there is a secret international postal group that...\nFOUNTAIN: They're not that secret.\nMALONE: They're a secret-ish (ph) international postal group. But what exactly are they up to? What are they talking about?\n(SOUNDBITE OF PHONE RINGING)\nALTAMIR LINHARES: Hello? This Altamir speaking.\nFOUNTAIN: We took this question to Altamir Linhares, who's worked at the UPU for 16 years.\nMALONE: And I'm curious. Is this a dream of yours to work at the UPU? How do you come to this?\nLINHARES: Well, if I may, I find your question quite personal. And, probably, it's not to the point of our conversation...\nMALONE: Oh.\nLINHARES: We are supposed to have - to talk about the UPU and not really my professional career...\nMALONE: Sure. Fair enough...\nLINHARES: ...But in any case, I had a long 20-year career in the Brazilian post.\nMALONE: See? Little secretive...\nFOUNTAIN: Secret-ish.\nMALONE: Sure. Whatever, secret-ish. What the UPU does requires a bit of explaining. I mean, maybe we should do this as a - like a hypothetical situation. So let's say you send us a package. We're in New York City, right? So you're shipping to us from Bern.\nLINHARES: OK.\nFOUNTAIN: What's the specialty of Bern? Is there any...\nMALONE: Oh, yeah. What should you send us? Chocolate?\nLINHARES: No. Chocolate I would not send to you because it's a perishable and it's not accept in the postal stream.\nFOUNTAIN: (Laughter).\nMALONE: OK, so not that.\nFOUNTAIN: Is there any...\nLINHARES: I would send you a cellphone.\nFOUNTAIN: Let us take a breath and appreciate the man-made miracle that is international mail.\nMALONE: Altamir can take this hypothetical cellphone to his local Swiss Post, buy Swiss postage, and it will show up on our doorstep in New York. He doesn't have to think about it again.\nFOUNTAIN: He doesn't have to tell Swiss Post what route to take.\nMALONE: He doesn't have to buy U.S. postage.\nFOUNTAIN: Or French postage or postage of any other country that our cellphone might pass through.\nMALONE: No. And this is because - cue the boring sound.\n(SOUNDBITE OF VIDEO)\nUNIDENTIFIED PERSON #1: On functions...\nMALONE: This secret-ish group of boring mail people have boring meetings, and they work out the rules to make international mail function.\nFOUNTAIN: OK. So now for the problematic part. Remember; our cellphone is in the hands of the Swiss Post. It leaves Bern. It flies to the United States, probably to JFK Airport.\nLINHARES: During his movement, there is a moment where the international items - they mix with the domestic items.\nFOUNTAIN: And it is at that moment the cellphone switches hands from the Swiss Post to the United States Postal Service. And the USPS will finish what's known as the final mile.\nMALONE: The important thing here is that this final mile of the journey is generally the most expensive part of the journey, as in it accounts for the majority of the cost of getting that cellphone from a foreign post office to our door.\nFOUNTAIN: Because it's pretty expensive to send someone in a truck or walking down the street to deliver something by hand, right? That's the idea?\nLINHARES: Yeah. Somehow, it's more labor intensive when it comes to delivery than in other parts of the process.\nMALONE: This creates a problem. The USPS got stuck with the expensive part of delivery of our cellphone, but they did not get any of Altamir's money. He paid Swiss Post.\nFOUNTAIN: And when the UPU started, they figured let's not worry about this. We all know the final mile is super expensive, but we're all sending each other mail. We'll all take turns eating the cost of that lousy final mile. It'll all even out.\nMALONE: But come on. This is like going out to eat with a group of friends and saying, let's just split the check. But then, you have that one friend - let's call him Dave Cruzca (ph), who just keeps ordering expensive beers. But I'm here drinking water, and this is certainly not going to split evenly...\nFOUNTAIN: Anyways, yes. This problem happened with international mail. Some countries were getting flooded with foreign mail but were barely sending any, which meant their postal service was getting stuck doing more final miles than was fair.\nMALONE: For the last five decades, the UPU has been trying to fix this by saying, hey, let's start reimbursing each other for that final mile.\nFOUNTAIN: But in general, they still have a gentlemen's agreement where they don't pay each other back the full cost. And this is really important because there are still countries getting screwed because they're delivering a lot of packages and eating some of the cost.\nMALONE: We wanted to know who is winning and who is losing in this.\nFOUNTAIN: And so we asked Altamir Linhares. Can we see how much it costs to send packages around the world and also how much countries reimburse each other?\nMALONE: Is there a place just to, like, to see what these numbers are?\nLINHARES: No. These are considered sensitive data, so it's not supposed to be open to the public.\nMALONE: Why not? That seems like good information to have as a customer or as...\nLINHARES: Yeah. Well, it could be. But I've never seen this happening. I don't know, for example, what Walmart would be paying to their franchises or McDonald's for example. So...\nFOUNTAIN: But these are not corporations...\nLINHARES: ...These are intercompany data. Sorry...\nFOUNTAIN: Altamir, these are not corporations. They're, like, arms of governments.\nMALONE: Yeah.\nLINHARES: Well, I understand your opinion. This may be a valid point.\nMALONE: And we should say here, Nick, that this was the first moment we really started to feel like Jayme Smaldone, our New Jersey mug-maker, was not just feeding us some conspiracy mumbo jumbo because there is a secret-ish postal society. They are getting together, and they're agreeing to give each other special below-market shipping rates.\nFOUNTAIN: Which brings us to the final part of Jayme's postal theory of everything. America and American small businesses are somehow getting screwed by this postal Illuminati.\nMALONE: Altamir was like, look; I just work at the UPU. It's up to the members whether or not they want to share intimate postal details with you. You guys are American. Why don't you just ask the United States Postal Service?\nFOUNTAIN: We did. They would neither confirm nor deny our interview requests.\nMALONE: So we did what we always do at PLANET MONEY.\nFOUNTAIN: Yeah. We called an economist. Would you say you're the foremost postal economist in the world?\nANNA MOLLER BOIVIE: Maybe I wouldn't drag it that far but one of the, I would say.\nMALONE: OK. We'll take that. This is Anna Moller Boivie.\nBOIVIE: In Swedish, you would pronounce it Muller Beoveh (ph). But I think that's too difficult for you.\nFOUNTAIN: A few years ago, the United States Postal Regulatory Commission wanted to know what we want to know - who's winning and who's losing in this UPU system.\nMALONE: They hired Anna's company, an economics consulting firm, to do a bunch of studies. And Anna tells us, in fact, for a long time, the United States was a big-time winner in this system. We were a big economy exporting lots of goods.\nBOIVIE: But, also, exporting a lot of, you know, mail...\nMALONE: Why? Why mail? What are we sending?\nBOIVIE: You're sending catalogs, letters, documents, marketing material...\nMALONE: Junk mail.\nBOIVIE: Yeah. Junk mail.\nMALONE: This was great for the United States. We were making other countries' postal people do the expensive part of delivering stuff. And because of the UPU, we didn't have to pay them back for it all.\nFOUNTAIN: Sure. When someone from another country sent a package to the U.S. we had to deliver their stuff and not get fully reimbursed. But on the whole, there weren't as many packages and letters coming in as we were sending out.\nMALONE: And this we actually do have numbers on. Eight years ago, the U.S. was making money off this imbalance to the tune of $275 million per year.\nFOUNTAIN: But then, the E's. Email meant less need for international letters. But, more importantly, e-commerce meant that Americans started ordering stuff direct from other countries.\nBOIVIE: Slowly, slowly, slowly, and since then, it has just, you know, escalated.\nFOUNTAIN: More and more stuff came into the United States. And then, three years ago, a big switch flipped. For the first time, we were losers. We started to lose money on the mail delivery imbalance.\nMALONE: Last year, the U.S. Postal Service lost around $80 million. And it is almost certainly going to be worse this year because we are almost certainly ordering more stuff from overseas.\nFOUNTAIN: But our mug-maker Jayme does not care if the USPS is losing money.\nMALONE: No. The claim he made and the claim, honestly, we were most skeptical of is that this system has actually made it cheaper to ship a mug into the United States from China than to send a mug across the street.\nFOUNTAIN: We ran this past every person we talked to, including Anna Moller Boivie.\nMALONE: Can I tell you the little story that kind of started this whole thing?\nBOIVIE: Sure.\nMALONE: So there's this guy who makes mugs. They're fancy mugs...\nBOIVIE: Jayme.\nMALONE: You know Jayme?\nBOIVIE: Jayme. I've talked to Jayme.\nMALONE: OK. Are you familiar with his mug? It's a very fancy mug.\nBOIVIE: Yeah, the Mighty Mug.\nMALONE: You can't knock it over. It's very hard...\nBOIVIE: (Laughter) I saw the YouTube clip.\nFOUNTAIN: She didn't, however, know Jayme's whole story. So we told her about how Jayme was looking for knockoffs and how it appeared to cost less to ship a mug into the United States from China than it did to ship the mug across the street.\nMALONE: That story rings true to you.\nBOIVIE: Yes, very much.\nMALONE: And so it is possible that shipping something from China is cheaper than shipping something to your neighbor next door?\nBOIVIE: Yeah, pricewise; costwise, no.\nMALONE: Meaning, of course, it costs a lot of money to ship something from China. But because of these artificially low UPU reimbursement rates, the actual price for China Post is way less.\nFOUNTAIN: Anna sent us a chart that estimates how much less. And it says, if you or I wanted to send a three-quarter-pound package somewhere in the U.S., the U.S. Postal Service would charge around $4.76 for the last leg of the journey.\nMALONE: Yeah, the so-called final mile. However, if that same package came in from China, the USPS would only charge China Post $1.39. That means the USPS charges you and me roughly 3 1/2 times more than what they charge China Post.\nBOIVIE: Yes.\nFOUNTAIN: Like, do you get how crazy it is?\nBOIVIE: I do and, I mean, this is the system which totally, you know, skews the market function.\nFOUNTAIN: What the UPU has created is almost like a reverse trade barrier. Like, why would I buy something that ships from the U.S. when the U.S. Postal Service is essentially subsidizing shipping from China?\nMALONE: And this is true for virtually every country in the world. There is often an incentive to buy something that ships from another country instead of your own. And that, Anna says, means the UPU has been quietly changing the flow of the global economy.\nFOUNTAIN: When you think about this system, how do you feel about it?\nBOIVIE: From a pure, you know, economics point of view, it's distorting price signals. That's how I would, you know, put it from a purely theoretical point of view. And that's...\nFOUNTAIN: OK. Now as a human.\nBOIVIE: And then, of course, as a human, I feel frustration that is going on. We...\nMALONE: Why is that?\nBOIVIE: ...It makes us buy a lot of things online, crappy things that we shouldn't have bought otherwise. It also means, you know, a lot for the environment, that we, you know, ship a lot of things by airplane or, you know, even boat. But it's just bigger than, you know, money.\nMALONE: And so this brings us to the final part of Jayme Smaldone's conspiracy theory. The price-fixing postal Illuminati are screwing over American small businesses.\nFOUNTAIN: And so I think we can say this is arguably true.\nMALONE: Yeah, it's arguably true.\nFOUNTAIN: Especially if most of your customers are in the United States. Jayme is shipping his mugs around the country, and the USPS is giving a better deal to China Post than it is to him.\nMALONE: In other words, Nick, I think what you're saying is a posse of powerful postal people are playing with parcel prices, proliferating pandemonium and potentially prying profits from our protagonist, a patriotic producer of portable, plastic, pouring products.\nFOUNTAIN: Precisely.\nMALONE: After the break, we'll call poor Jayme and tell him he was right all along.\n(SOUNDBITE OF MUSIC)\nFOUNTAIN: Hey, Jayme?\nSMALDONE: Yup?\nFOUNTAIN: How's it going? It's Nick and Kenny.\nSMALDONE: Hey. What's up, guys? How are you?\nMALONE: So we know it's been a long time since we talked.\nSMALDONE: I actually thought you forgot about it.\nMALONE: Yeah. We never stopped looking into it. And, I mean, I guess I should say, Jayme, when we first met you and when you told us this expansive theory, we thought you sounded, like, a little loony.\nSMALDONE: Right. I knew how you were going to view the whole situation.\nMALONE: (Laughter) I mean, I think it's fair to say, Nick, that, like, everything Jayme told us is, like, true.\nFOUNTAIN: Checks out.\nSMALDONE: That makes me feel good because, like, you guys know I was harassing you before we met to talk about this, so...\nMALONE: Yeah.\nFOUNTAIN: We're about to lose the studio. It was awesome talking with you...\nMALONE: Oh, yeah.\nSMALDONE: Absolutely. Also, I have another story for you guys. I'll email it to you. It's an incredible story (laughter).\nMALONE: All right, man. I mean, like, OK.\nFOUNTAIN: Thank you so much.\nMALONE: OK.\nSMALDONE: All right, guys. Good talking to you.\nFOUNTAIN: All right.\n(SOUNDBITE OF FRENCH INDIE CLUB 4'S \"SUNBURN\")\nFOUNTAIN: Do you know of a conspiracy theory that is not just a theory, it is true? If so, email us, planetmoney@npr.og or all the social media stuff.\nMALONE: Our supervising producer is Alex Goldmark, and our editor is Bryant Urstadt.\nFOUNTAIN: I'm Nick Fountain.\nMALONE: And I'm Kenny Malone. Thanks for listening.\nFOUNTAIN: And one last thing. When we were visiting Jayme and testing his Mighty Mug, he did mention this one thing.\nMALONE: You're saying I can't spill this?\nSMALDONE: Yeah. Go ahead. Try.\nMALONE: This is like a challenge.\n(SOUNDBITE OF BANGING)\nSMALDONE: You have to hit it with about 6 or 7 pounds of pressure. So, eventually, anything hit will dislodge it.\nMALONE: All right.\nFOUNTAIN: Fast-forward months later to this studio, which has a lot of expensive equipment in it, Kenny bought a Mighty Mug and apparently forgot the lesson.\nMALONE: They don't spill.\n(SOUNDBITE OF BANGING)\nMALONE: Oh, [expletive].\nFOUNTAIN: (Laughter).\n(SOUNDBITE OF FRENCH INDIE CLUB 4'S \"SUNBURN\")\nMALONE: That's too hard.\n(SOUNDBITE OF FRENCH INDIE CLUB 4'S \"SUNBURN\")\nCopyright © 2018 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=634732388"}
