{"authors":["Ashley Mateo"],"date_download":"2018-10-30 22:26:37","date_modify":"2018-10-30 22:26:37","date_publish":"2014-08-15 17:25:01","description":"I have a bone to pick with Taylor Swift — she's making the rest of us gym-goers look bad. While I come out of the gym looking like a sweaty mess, Swift's all perfectly put-together, like she doesn't even perspire. But, even more than her outfits, I…","filename":"data/vaneerConsumption/8HairMistakesYoureMakingAtTheGymPlusWhatYouShouldBeDoingInstead.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/f3cf9057-fd3a-43ed-8d60-3f13b804626b.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_34415-8-hair-mistakes-youre-making-at-the-gym-plus-what-you-should-be-doing-instead_1540938397.html","title":"8 Hair Mistakes You're Making At The Gym (Plus, What You Should Be Doing Instead)","title_page":"8 Hair Mistakes You're Making At The Gym (Plus, What You Should Be Doing Instead)","title_rss":"NULL","source_domain":"bustle.com","text":"I have a bone to pick with Taylor Swift — she's making the rest of us gym-goers look bad. While I come out of the gym looking like a sweaty mess, Swift's all perfectly put-together, like she doesn't even perspire. But, even more than her outfits, I envy her post-workout hair. Straight or curled, pulled back or in loose waves, it looks perfect — a feat in itself, because going to the gym can lead to some serious strand damage.\nObviously, that's not a reason to ditch your workout (it's not). All it means is we need to rethink how we treat our hair while exercising — turns out, a lot of the things we do without a second thought can wreak havoc. So, I turned to hairstylist Chris Naselli (the man responsible for Connie Britton's amazing mane) to find out what anti-hair mistakes we're making at the gym — and, of course, what we can do to fix 'em. You may not leave the gym as perfectly coiffed as Swift, but your hair will look better in the long run. Promise.\n1. You're not carrying hair refresher\nDry shampoo is non-negotiable when it comes to packing your gym bag, but don't forget a hair refresher: \"Oribe Cote d'Azur Hair Refresher has an amazing fragrance that will neutralize odor and refresh your hair,\" says Naselli. \"It hydrates, smoothes and conditions.\"\nOribe Cote d'Azur Hair Refresher, $23, Amazon\n2. You're shampooing after every workout\nApparently, this is a big no-no. Who knew? \"As gross as it sounds, shampooing too much — even after the gym — can dry out your hair and strip away all of the natural oils that keep your scalp and hair healthy,\" says Naselli. Instead, keep a travel size dry shampoo in your gym bag (he recommends Serge Normant Meta Revive Dry Shampoo — it soaks up all the unwanted sweat and oil while absorbing all the impurities). Still not convinced? \"Try a cleansing conditioner like L'Oreal EverCreme Cleansing Conditioner instead of shampoo,\" he suggests. \"It's a one-step wonder that will do the cleaning trick and keep your natural oils.\"\nL'Oreal EverCream Conditioner, $7, Amazon\n3. You're not prepping your hair pre-workout\nI know, I know — it seems silly to spend time beautifying before getting all sweaty. But spending a few seconds on your hair is crucial for better strands post-gym. \"Ideally, you should use a dry shampoo on your roots before your workout,\" advises Naselli. \"It prevents excess moisture from saturating your whole head with sweat.\" He recommends powder-based dry shampoo for best results, like Serge Normant Meta Revive Dry Shampoo or Bamboo StyleTranslucent Dry Shampoo.\nSerge Normant Meta Revive Dry Shampoo, $25, Amazon; Bamboo StyleTranslucent Dry Shampoo, $15, Amazon\n4. You're brush-abusing your hair\nYank any old brush through post-gym tangles, and you'll cringe when you see all the broken pieces frizzing up. \"Every girl should own a Mason Pearson Detangler Nylon Hair Brush,\" says Naselli. \"It’s designed to detangle hair without breakage. It has six ringlets of Nylon tufts that are ideal to work out those knots after any workout. It's great for all hair types and best on wet hair after your shower.\"\nMason Pearson Detangler Nylon Hair Brush, $68, Amazon\n5. Your ponytail is too tight\nI get it, it keeps the hair out of your eyes. But, stop it! \"Avoid pulling your hair into a tight ponytail if you can help it,\" says Naselli. \"Opt for clips or snag free elastics that are easier on your hair, like Goody Ouchless Ponytail Holders. They're great and about $5 for a pack of 29. Polartec Power Stretch makes amazing headbands that are super soft and keep you dry, too. They also have a special ponytail hole opening that gives your hair a place to go without having to use a rubber band.\" Goodbye, dents!\nGoody Ouchless Ponytail Holders, $5, Amazon\n6. You're not thinking beyond the pony\nHaven't you been on Pinterest lately? You have options! \"A loose, high bun will give you tons of volume after a workout,\" suggests Naselli. While you work out, try a fishtail or a knotted braid. If extra control is needed, braid your bangs back and to the side to keep off your face. Tie the rest into a low bun and secure with a spin pin rather than an elastic. When you're done, use Oribe Texturizing Spray, blast with a blowdryer and shake out for beautiful loose waves.\"\nOribe Texturixing Spray, $44, Amazon\n7. You're not protecting your hair from the sun\nObviously, this doesn't apply indoors. But if you're a regular runner (or any kind of outdoor exerciser), your scalp is just as sensitive to sun as the rest of your skin — and it isn't pretty when it burns. (And the itching? A nightmare.) \"Phyto Phyotoplage is an amazing lightweight SPF for your hair,\" says Naselli. \"It prevents sun damage, preserves your color, and prevents fading.\"\nPhyto Phytoplage Protective Sun Veil, $30, Amazon\n8. You're not moisturizing your hair post-workout\nAll that salt in your sweat? It dries out your hair. If you have time to wet your hair post-workout, you need to condition. But, \"if you're on the go and need to quickly condition and detangle, use Oribe Foundation Mist,\" says Naselli. \"It will re-activate any product and instantly hydrate without having to wash your hair. The last thing you want is to pile on products that will weigh down your hair.\"\nOribe Foundation Mist, $27, Check It Out\nImages: Voyagerix/Fotolia; Birchbox; Giphy; Tumblr; Tumblr; Wikia; Syllable in the City; OK Movie Quotes; NY Mag.","url":"https://www.bustle.com/articles/34415-8-hair-mistakes-youre-making-at-the-gym-plus-what-you-should-be-doing-instead"}
