{"authors":["Associated Press"],"date_download":"2018-10-23 00:29:46","date_modify":"2018-10-23 00:29:46","date_publish":"2016-01-11 09:51:47","description":"BEIJING (AP) — Barely more than a week into 2016, Chinese President Xi Jinping is having a rough time of it, with challenges ranging from a plummeting stock ...","filename":"data/vaneerConsumption/8reasonsChinaanditspresidentareofftoarocky2016.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:06fde87659b743439612d0b2b40b080e-48qEJGFphM8d437f0aaf92320d5d-126_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393478_Amid-stock-slide-Taiwan-polls-Chinas-Xi-rocky-2016_1540254586.html","title":"8 reasons China and its president are off to a rocky 2016","title_page":"8 reasons China and its president are off to a rocky 2016 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"8 reasons China and its president are off to a rocky 2016\nBEIJING (AP) — Barely more than a week into 2016, Chinese President Xi Jinping is having a rough time of it, with challenges ranging from a plummeting stock market to new provocations from obstreperous ally North Korea. While none pose an existential threat to his administration, the world will be watching to see whether he has the sophisticated touch needed to find durable solutions and maintain stability.\nBelow is a look at eight key issues Xi is contending with:\n___\nA man eats near an electronic board displaying stock prices at a brokerage house in Beijing, Monday, Jan. 11, 2016. Barely a week into 2016, Chinese President Xi Jinping is already having a rough time of it, with a plummeting stock market, falling currency, new provocations from boisterous ally North Korea and strong prospects for a victory by the pro-independence opposition in Taiwan, which China sees as a renegade province. (AP Photo/Andy Wong)\nSTOCK MARKET VOLATILITY\nChina twice deployed its \"circuit breaker\" mechanism to halt trading as stock markets nosedived by 10 percent in the first week of the year. Beijing finally abandoned the mechanism, and left the perception that regulators don't have a clue as they try to stabilize a market that more than doubled between late 2014 and June, then dived 30 percent, causing deep pain among retail investors.\n___\nCURRENCY QUEASINESS\nMeanwhile, China's currency, the yuan, has slid to a five-year low against the dollar, forcing the government to spend tens of millions of dollars from its foreign currency stockpile to defend it. The government last week guided the yuan 1.5 percent lower to assist hard-pressed exporters, but the clumsy move sent shockwaves through world markets, further weighing on Chinese share prices.\n___\nSLOWING ECONOMY\nHiccups in the world's second-largest economy are expected to continue in 2016, with growth falling to a six-year low of 6.9 percent in the July-September quarter and forecast by the International Monetary Fund to decline further to 6.3 percent this year. That bodes ill for the economy's ability to generate enough new jobs for the more than 7.5 million students due to graduate from college this year, while also building momentum for a transition from an investment-based economy to one focused on services.\n___\nNORTH KOREA\nDespite persistent calls for restraint, China's traditional ally North Korea staged what it claims was a hydrogen bomb test blast on Jan. 6 that sent actual tremors across the border into northeastern China and drew condemnation from Beijing. China now finds itself again under pressure to use any possible leverage with the North to tamp down tensions in northeast Asia, while facing the possibility of more robust security cooperation between South Korea and China's traditional rivals Japan and the United States.\n___\nTAIWAN\nVoters on the self-governing island democracy appear set to elect a new president whose party opposes Beijing's goal of unification between the sides. Beijing's economic inducements have failed to persuade the Taiwanese public of the benefits of political union. If opposition Democratic Progressive Party candidate Tsai Ing-wen wins Saturday, as she is widely expected to do, Beijing may feel compelled to embark on economic and diplomatic pressure that could send relations into reverse. It's unlikely that Beijing would go so far as to back up its longstanding threat to use force to bring the island under Chinese control.\n___\nPOLITICS\nWhile Xi faces no such electoral challenges under China's one-party system, he does face resistance from political rivals and the vast bureaucracy. Xi shows no sign of abandoning his signature anti-corruption campaign blamed for creating a sense of fear and paralysis among the rank and file. His growing cult of personality exudes an exterior confidence. But with the economy slowing and no sign of political reforms, he may come under pressure from critics and rivals to show results on jobs, growth, good governance and addressing the yawning income gap.\n___\nSOUTH CHINA SEA\nSince the year began, China has landed three aircraft on a new island it built in the South China Sea, drawing protests from Vietnam and the Philippines, which have competing territorial claims in the region.\nChina's robust assertions of its claim to virtually the entire South China Sea have long drawn complaints and sparked the occasional maritime confrontations in the area through which $5 trillion in global trade passes each year. The test flights landed on one of seven new islands Beijing has built by piling sand atop reefs and atolls. The U.S. is adamant that the new features don't deserve the legal status of actual islands, and the U.S. Navy has flown and sailed close to them, drawing a furious response from Beijing. Xi now has to defend China's actions while avoiding damage to its foreign relations.\n___\nHONG KONG\nChina faces continuing opposition from pro-democracy forces in Hong Kong, the former British colony that reverted to Chinese rule in 1997 while retaining its own legal and economic systems. Beijing's hand-picked chief executive, Leung Chun-ying, is deeply unpopular, and planned electoral changes stalled after massive street protests in 2014, leaving deep rifts in hyper-efficient Hong Kong's society and politicizing a generation of students. Now, the recent disappearances of people associated with a publishing company that specializes in titles critical of China's leadership have raised fears that Beijing is tightening its grip on Hong Kong's freedom of the press and other civil liberties.\nA couple walk past a display showing the security features of the new 100 Yuan note in Beijing, Monday, Jan. 11, 2016. Barely a week into 2016, Chinese President Xi Jinping is already having a rough time of it, with a plummeting stock market, falling currency, new provocations from boisterous ally North Korea and strong prospects for a victory by the pro-independence opposition in Taiwan, which China sees as a renegade province. (AP Photo/Andy Wong)\nFILE - In this Nov. 30, 2015 file photo, China's President Xi Jinping attends the opening session at the COP21, United Nations Climate Change Conference, in Le Bourget, outside Paris. Barely more than a week into 2016, Chinese President Xi Jinping is having a rough time of it, with challenges ranging from a plummeting stock market to new provocations from obstreperous ally North Korea and strong prospects for a victory by the pro-independence opposition in Taiwan, which China sees as a renegade province. (Eric Feferberg/Pool Photo via AP, File)\nFILE - In this Sunday, Jan. 10, 2016 file photo, Taiwan's opposition Democratic Progressive Party presidential candidate Tsai Ing-wen, center, cheers supporters from a truck as she parades through the streets of Tainan, Taiwan prior to the nation's presidential election on Saturday, Jan. 16. Voters on the self-governing island democracy appear set to elect a new president whose party opposes Beijing¿s goal of unification between the sides. (AP Photo/Wally Santana, File)\nFILE - In this Sunday, Jan. 10, 2016 file photo, a protester wearing a mask of missing bookseller Lee Bo stands in a cage during a protest against the disappearances of booksellers in Hong Kong after five men associated with a Hong Kong publisher known for books critical of China's leaders have vanished one by one in the last three months, alarming activists and deepening suspicions that mainland authorities are squeezing free expression in the enclave. The sign in front reads: \"Missing men.\" (AP Photo/Vincent Yu, File)\nA salesperson, center, waits for customers at a clothing store having sales near a display showing traditional Chinese gold coins, foreground, at a shopping mall in Beijing, Monday, Jan. 11, 2016. Barely a week into 2016, Chinese President Xi Jinping is already having a rough time of it, with a plummeting stock market, falling currency, new provocations from boisterous ally North Korea and strong prospects for a victory by the pro-independence opposition in Taiwan, which China sees as a renegade province. (AP Photo/Andy Wong)\nAn office building is reflected on a new 100 Yuan note on display outside a bank in Beijing, Monday, Jan. 11, 2016. Barely a week into 2016, Chinese President Xi Jinping is already having a rough time of it, with a plummeting stock market, falling currency, new provocations from boisterous ally North Korea and strong prospects for a victory by the pro-independence opposition in Taiwan, which China sees as a renegade province. (AP Photo/Andy Wong)","url":"https://www.dailymail.co.uk/wires/ap/article-3393478/Amid-stock-slide-Taiwan-polls-Chinas-Xi-rocky-2016.html"}
