{"authors":["Awr Hawkins"],"date_download":"2018-10-30 21:19:40","date_modify":"2018-10-30 21:19:40","date_publish":"2015-10-12 21:50:09","description":"An 8th grader was suspended for wearing a t-shirt which bore the image of a \"traditional soldier memorial\" featuring a helmet and rifle,","filename":"data/vaneerConsumption/8thGraderSuspendedforTShirtwithSoldierMemorial.json","image_url":"https://media.breitbart.com/media/2015/10/Student-T-Shirt-KATU-News.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_12__1540934380.html","title":"8th Grader Suspended for T-Shirt with Soldier Memorial","title_page":"8th Grader Suspended for T-Shirt with Soldier Memorial","title_rss":"NULL","source_domain":"breitbart.com","text":"Last week Alan Holmes–an 8th grader at Dexter McCarty Middle School in Gresham, Oregon–was suspended for wearing a t-shirt which bore the image of a “traditional soldier memorial” featuring a helmet, rifle, and boots.\nHolmes wore the shirt out of the pride he has in his brother, who joined the Marines and ended up doing a tour in Iraq at age 19. Referencing the day his brother made it back home safely, Holmes said, “I was proud of him. I remember the day he came home and I was just so happy. I was little but I still remember it, he made me happy.”\nSo Holmes wore a t-shirt to school bearing the image of a soldier memorial and the words, “Standing for Those who Stood for Us.” But KATU reports that the Dexter McCarty school principal reacted to the shirt by giving Holmes “an ultimatum”–he could either change shirts or “face in-school suspension.” Holmes took the suspension.\nHolmes was distressed by the principal’s reaction. He said, “My brother, he means everything for me. Just being able to help and give back to the people who fought and died for us, it just makes me feel good.”\nKATU reached out to the school district, but they refused to comment, “citing student confidentiality requirements.” The district did say that “Weapons on a shirt are not appropriate in a school setting.”\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/10/12/oregon-8th-grader-suspended-t-shirt-soldier-memorial-containing-rifle/"}
