{"authors":["Caitlin Gallagher"],"date_download":"2018-10-30 23:04:52","date_modify":"2018-10-30 23:04:52","date_publish":"2014-08-14 11:00:03","description":"The world of Doctor Who is vast — like really vast. Since the Doctor knows no boundaries of space or time, anything, and I mean anything, can happen. So to be a legitimate Doctor Who fan, you have to be pretty open-minded. Doctor Who fans must be…","filename":"data/vaneerConsumption/8ThingsYouShouldNeverSaytoaDoctorWhoFanortheCybermenWillGetYou.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/bb15ffc1-e2b5-4e1d-8bb3-d12e5f19ab6f.jpeg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35532-8-things-you-should-never-say-to-a-doctor-who-fan-or-the-cybermen-will-get_1540940692.html","title":"8 Things You Should Never Say to a 'Doctor Who' Fan or the Cybermen Will Get You","title_page":"8 Things You Should Never Say to a 'Doctor Who' Fan or the Cybermen Will Get You","title_rss":"NULL","source_domain":"bustle.com","text":"The world of Doctor Who is vast — like really vast. Since the Doctor knows no boundaries of space or time, anything, and I mean anything, can happen. So to be a legitimate Doctor Who fan, you have to be pretty open-minded. Doctor Who fans must be able to adapt to a new actor playing the beloved Time Lord, companions leaving in tragic ways, and aliens trying to destroy Earth. And we take it all in stride. But there are some things that Whovians should just not have to tolerate.\nWith a new Doctor on the horizon in the form of Twelfth Doctor Peter Capaldi, it feels appropriate to note what Doctor Who fans do not want to hear. The Doctor has his own rules, and so do we! And like the Doctor, Whovians are hesitant to give people (or aliens) a second chance after they've been warned.\nNow tried-and-true Doctor Who watchers will have seen classic Who and not just the modern episodes. But since the world of Doctor Who is so expansive — and for the sake of my sanity (I don’t want to be going all Doctor Donna on you and overloading my mind with too much knowledge) — this list will mainly focus on Doctor Who from 2005 on.\nNow here's what you should never, ever say to a Whovian.\n\"Amy Pond was the best companion\"\nI don’t think there’s anyway to list a definitive “best” companion — everyone has their own tastes. But the modern Doctor Who had its own sort of reboot starting with Season 5 when Steven Moffat replaced Russell T. Davies as the showrunner. That season introduced Eleventh Doctor Matt Smith and companion Amy Pond (Karen Gillan). Amy became such a permanent fixture of the series (including a version of the opening show credits with her narrating her Doctor story in Season 6 — ugh!), that it felt like Amy overload at times.\nBowTiesRCool on YouTube\n\"What’s a Dalek?\"\nHow dare you not know the Doctor’s archenemy? EXTERMINATE!\n\"Christopher Eccleston must have not been a good Doctor if he was only on one season\"\nChristopher Eccleston confirmed he left the show due to politics after only appearing in Season 1 of Doctor Who. But just because he was only in a single season doesn’t mean he didn’t add his own charm to the role. Yes, the special effects were particularly shoddy back then, but this leather jacket-wearing Ninth Doctor brought the role back to pop culture relevancy. A talented actor (just check out his mind-blowing work on HBO’s The Leftovers ), his Doctor had a darkness and intensity that I’m hoping Capaldi will also bring to the role.\n\"Don't blink.\"\nWhat are you doing?! Trying to give us a heart attack?? These words are only to be spoken when the Weeping Angels are around. The Eleventh Doctor also may get very emotional if you bring this up.\n\"The Doctor should date his companions\"\nNo! The Doctor may have two hearts, but he still has too much going on to give one of them fully to his human companions. Plus, even though he is a humanoid, he still is an alien.\n\"Isn't River Song too old for the Doctor?\"\nThe actress who plays River song, the fantastic Alex Kingston, may be older than both David Tennant and Smith, who she acted against, but what's wrong with a woman being older than a man in a relationship? In the Whoniverse the Doctor has been stated as a bunch of different ages, but we can say he was between 900 and 1200 in his interactions with River (and I'm still crossing my fingers that she'll appear with Capaldi's Doctor). Since River herself has characteristics of a Time Lord and had the ability to regenerate, her age is also a bit complicated. So age really shouldn't be a point of contention when it comes to the Doctor and River (but maybe her lineage should be). Check yourself before you wreck yourself, sweetie.\n\"They should make an American version\"\nUgh. This is the worst thing to say about anything. Even Community knows what a terrible idea it is, as shown when their Doctor Who spoof Inspector Spacetime got Americanized. And I can't imagine Moffat agreeing to such a thing when the American version of his British hit show Coupling was such a flop. (And good to note that the real version of Coupling recognized the importance of fearing Daleks.)\nDr. Who?\nFirst off, it's Doctor — spelled out, never abbreviated. Second, I guess you can ask the immortal Doctor Who question, but you should know you'll never get a real answer.\nImages: BBC; isashi-nigami, matt-smith-fans, holmeless-watson, halorvic, lestrady, eleven-our-raggedy-doctor, gallifreyan-detective, bobbystiltskin, rosetylered, bbcouplingifs, riveralwaysknew/Tumblr","url":"https://www.bustle.com/articles/35532-8-things-you-should-never-say-to-a-doctor-who-fan-or-the-cybermen-will-get"}
