{"authors":["Mary Chastain"],"date_download":"2018-10-30 17:57:40","date_modify":"2018-10-30 17:57:40","date_publish":"2016-03-01 16:05:32","description":"A German doctor, treating Yazidi victims of the Islamic State reported he treated an 8-year-old who set herself on fire to stop jihadists from raping her.","filename":"data/vaneerConsumption/8YearOldYazidiGirlSetsSelfonFiretoPreventIslamicStateRape.json","image_url":"https://media.breitbart.com/media/2015/04/Yazidi-women-REUTERSRodi-Said.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_03_01__1540922260.html","title":"8-Year-Old Yazidi Girl Sets Self on Fire to Prevent Islamic State Rape","title_page":"8-Year-Old Yazidi Girl Sets Self on Fire to Prevent Islamic State Rape","title_rss":"NULL","source_domain":"breitbart.com","text":"German doctor Jan Ilhan Kizilhan, treating Yazidi victims of the Islamic State (ISIS/ISIL/IS), tells the Agence France-Presse he has treated an 8-year-old girl who set herself on fire to stop jihadists from raping her.\n“IS sold her eight times during the 10 months she was held hostage, and raped her hundreds of times,” he said. “This is one of the cases I always have in my mind.”\nThe fire burned 80 percent of her body, and Kizilhan said the girl lost her nose and ears. The AFP reports:\nIS fighters had held the girl and her sisters for weeks, raping and torturing them, before they escaped. Then one night sleeping in her tent in the refugee camp, the girl dreamt IS fighters were outside. In a panic she poured gasoline over herself and lit a match, hoping it would make her so ugly they would not rape her again. Kizilhan had that girl chartered out immediately for fear she might not survive. She remains in hospital in Germany after more than a dozen operations, and will still need 30 more types of skin and bone surgery.\nKizilhan has treated over 1,000 women who escaped the horrors of the Islamic State.\n“They have been through hell,” he sighed.\nThe Islamic State targets Yazidis because they consider followers of the minority religion “devil-worshippers,” as their religion “blends elements of Islam, Judaism and Christianity with even more ancient practices, including sun worship.”\nAuthorities in the German state Baden-Wurttemberg decided to act in 2014, putting Kizilhan in charge of the project with a budget of 95 million euros ($104 million). The group “began flying in traumatised victims from northern Iraq last April, and brought the last group over earlier this month.”\n“These women really need specialised treatment. If we don’t help them, who will?” he asked at the human rights conference.\nWomen have expressed fear of fitting back into their communities after their escape due to “a deeply traditional culture.” According to The Sunday Times:\nThe magnitude of the crisis is such that Baba Sheikh, a prominent Yazidi religious leader, issued an unprecedented statement to the community. It declared the women were victims who had suffered through no fault of their own and should be supported, not ostracised. Young women worry they will be stigmatised and become “unmarriageable” in a culture in which sexual intercourse before marriage is frowned upon. Although abortion is illegal in Kurdistan, even for cases of rape, some doctors have secretly been performing terminations for those who have come back pregnant. Some returning Yazidi girls are also secretly seeking surgery to reverse the loss of virginity.\nIslamic State terrorists kidnapped Sarah when she was only 13 years old and forced her to marry a 40-year-old man. The man wanted “to make Sarah pregnant.” She faked an illness to visit a female doctor, who put her on birth control pills until she could escape. She left with the man’s other sex slaves when their guard fell asleep. Her family put her in touch with a smuggler who “re-kidnaps” victims from ISIS.\nSarah remains traumatized.\n“I refused both of them; I don’t want to fall in love,” she cried. “I don’t think I can. I don’t want to be married or have children — I am damaged goods.”\nA young Yazidi girl, known only as Noor, told CNN the Islamic State justified raping her because it would make her Muslim.\n“He showed me a letter and said, ‘This shows any captured women will become Muslim if 10 ISIS fighters rape her.’ There was a flag of ISIS and a picture of [ISIS leader] Abu Bakr Al Baghdadi,” she said.\nIn May, Zainab Bangura, the United Nations special representative of the secretary-general on Sexual Violence in Conflict, interviewed numerous females whom ISIS kidnapped and forced into sex slavery. She found cases of what others have previously discovered: rape, slavery, slave markets, and women undergoing surgery to restore their virginity.\n“Women and girls are at risk and under assault at every point of their lives,” she explained, adding that the threats lurk behind them “every step of the way … in the midst of active conflict, in areas under control of armed actors, at check-points and border crossings, and in detention facilities.”","url":"https://www.breitbart.com/national-security/2016/03/01/8-year-old-yazidi-girl-sets-self-on-fire-to-stop-islamic-state-jihadists-from-raping-her/"}
