{"authors":["Rachel Simon"],"date_download":"2018-10-30 22:28:50","date_modify":"2018-10-30 22:28:50","date_publish":"2014-08-15 16:27:09","description":"Look, I'm not about making fun of celebrities for their choices in religion. While I may not personally understand why wearing a red bracelet suddenly made Madonna an expert in Kabbalah or how Leah Remini thought Scientology was a good idea even…","filename":"data/vaneerConsumption/90sStarAndrewKeeganStartedHisOwnReligionItsTrulyAmazing.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/6fe56f0b-7c38-491e-a862-6801678073b0.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35926-90s-star-andrew-keegan-started-his-own-religion-its-truly-amazing_1540938530.html","title":"'90s Star Andrew Keegan Started His Own Religion & It's Truly Amazing","title_page":"'90s Star Andrew Keegan Started His Own Religion & It's Truly Amazing","title_rss":"NULL","source_domain":"bustle.com","text":"Look, I'm not about making fun of celebrities for their choices in religion. While I may not personally understand why wearing a red bracelet suddenly made Madonna an expert in Kabbalah or how Leah Remini thought Scientology was a good idea even before they chased her out, it's not my place to judge people, even famous ones, on the things they believe. It's an entirely different story, however, when a celebrity decides to create his/her own religion, and that religion is absolutely ridiculous, such as 10 Things I Hate About You actor Andrew Keegan's new \"movement,\" Full Circle. With this, all criticism is fair game, because, I mean, come on.\nAccording to the religion's website, Full Circle is \"a Community based Cultural Center,\" a social movement meant to \"provide an experiential environment designed to creatively expand consciousness through visual and performing arts, movement classes, workshops, forums and healing therapies.\"\nKeegan, an actor best known for his role as Joey Donner in 10 Things, began Full Circle after suffering a violent beating in 2011. He and friends were attacked by gang members, resulting in a visit to the hospital. For him, the significance of this occurring at the same time as the Japanese tsunami, as well as a series of other odd events, caused him to consider the \"synchronicity\" of life and explore the ideas more deeply.\nAnd that's about where he stopped making any sense. Despite Keegan's attempts at explaining Full Circle in an interview with Vice, I have come to the conclusion that Full Circle is a confusing, strange, so-ridiculous-it-can't-be-real religion that, thankfully, is very, very real. A few of its most amazing aspects, as described in the Vice article:\n\"When I visited the church, I was greeted at the door by a man who said his name was Third Eye. He quickly introduced me to the community pet Krishna, a giant talking parrot.\"\nThird Eye. Community parrots. Already, Full Circle is great.\n\"I met the rest of the inner circle, who told me they believed I came through the 'vortex' created by Keegan's energy.\"\nAlthough, as the writer admitted, this was somewhat true since Keegan's fame is what led him to learn about Full Circle, it still is hilarious to think that the energy of the rich kid from 10 Things I Hate About You is what draws members to the community.\n\"Some local artists were asked to take the stage and sing songs about cutting up their credit cards and using mantras to pay their bills.\"\nSeems reasonable.\n“Synchronicity. Time. That's what it's all about. Whatever, the past, some other time. It's a circle; in the center is now. That's what it's about.\"\nA quote from Keegan about the religion's name, this sounds like it was stolen from a monologue on True Detective. I approve.\n\"The meditation at the service had involved water crystals, which participants used to focus their energy to bring an ending to the conflict between Israel and Palestine.\"\nI mean, really, why didn't John Kerry think of that?\n\"While Third Eye and his fellow members see Keegan as a visionary and a leader, the actor said his community is not cultish.\"\nWell that's . . . reassuring.\n“When you feel those chakras aligned, there's guided messaging coming in. If there is something of spiritual ego within that, it must not exist.”\nI've read this sentence five times and I still don't understand what it means. Actually, I don't understand what anything about Full Circle means. Maybe the talking parrot could explain?\nIn all seriousness, Keegan seems to have found his purpose, and Full Circle's general message, when finally understood, isn't bad. It's just hard for me to accept that Joey \"Eat Me\" Donner has grown into a religious leader; this new life of his, I bet, probably doesn't include arguing over proms and drawing genitalia on nerdy guys' faces. Oh, how the times have changed.\nImages: Full Circle Venice/Facebook (4); Tumblr","url":"https://www.bustle.com/articles/35926-90s-star-andrew-keegan-started-his-own-religion-its-truly-amazing"}
