{"authors":[],"date_download":"2018-10-22 21:30:03","date_modify":"2018-10-22 21:30:03","date_publish":"2014-06-04 13:51:26","description":"A 12-year-old girl who was stabbed 19 times in Wisconsin was having trouble breathing and covered in blood when a bicyclist called 911.","filename":"data/vaneerConsumption/911CallReleasedinWaukeshaSlenderManStabbings.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/484231/stabbing-ejo-60214_66b495f1fea0a68afcfef54f3eaac06d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_slender-man-stabbing_911-call-released-waukesha-slender-man-stabbings-n122291_1540243803.html","title":"911 Call Released in Waukesha 'Slender Man' Stabbings","title_page":"911 Call Released in Waukesha 'Slender Man' Stabbings","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA 12-year-old girl who was stabbed 19 times in a bizarre and gruesome plot in the woods of Wisconsin was having trouble breathing and was covered in dried blood when a bicyclist who found her called 911.\n\"She said she can take shallow breaths. She's alert,\" said Greg Steinberg, the man who found the young victim of the \"Slender Man\" stabbing in the Milwaukee suburb of Waukesha.\nThe girl had managed to drag herself to a grassy area of a dead-end road, where Steinberg found her, after being attacked in the woods. Her alleged attackers, two 12-year-old friends of hers, are charged with attempted murder for purportedly trying to please an online demonic creature called \"Slender Man\" with their plot to kill her.\nThe 911 operator urged Steinberg to stay with the girl and remain on the phone until an ambulance and police officers arrived.\n\"Just let me know if she is remaining conscious or not, OK?\" the operator said.\nHe asked the caller if the girl had blood on her, and if Steinberg could see her stab wounds — which were on her torso, legs and arms.\n\"I don't know if I should be rolling her over and checking her or not,\" Steinberg responded.\nThroughout the call, Steinberg remains calm, explaining to the 911 operator that he was just passing through the area on his bike when he saw the horrific scene.\nAt one point, Steinberg is heard comforting the girl.\n\"They'll be here any minute. Somebody to help you. Who did that to you? Or don't you want to talk? OK, if it's better not to talk, then we won't talk. Save your energy, \" he said.\nThe 911 operator wanted to know if Steinberg saw the attacker or attackers nearby. He said no.\n\"Let me know immediately if you see anything else suspicious in the area. A car, a person,\" the operator said.\nThe call ends when the squad car arrives.\nThe two girls charged in the case, also of Waukesha, told investigators they had been planning for months on killing their friend to please Slender Man, a character they learned about on a horror website, a criminal complaint says.\nThe victim was not named in court documents. One of her stab wounds was a millimeter away from a major artery in her heart, but on Monday, she was said to be in stable condition.\nBoth suspects were charged Monday as adults with first-degree attempted homicide and face up to 60 years in prison if convicted. Bail was set at $500,000 cash each.\n\"The bad part of me wanted her to die, the good part of me wanted her to live,\" one girl allegedly told an investigator.\nThe girls told investigators that the incident started with a sleepover on Friday, to which they invited the victim. Their plan, according to the complaint, was to duct tape their friend's mouth while she was sleeping, blanket her in covers so it looked like she was sleeping, then run away to Slender Man's mansion.\nInstead, they waited until Saturday, when they could lure her to a nearby park and stab her in the bathroom so her blood would trickle down the drain. Armed with a knife, they convinced her to come to the park and get into the bathroom, but once in there, neither girl could bring herself to do the stabbing. After passing the knife between them, they went into the woods, the complaint said.\nAt that point, one girl pushed the victim down and pinned her down by sitting on her. The girls again traded the knife back and forth before one of them began stabbing her, according to the complaint.\nThe suspects, who NBC News is not identifying because of their age, left their blood-covered victim in the woods.\n\"The bad part of me wanted her to die, the good part of me wanted her to live,\" one girl allegedly told an investigator.\nWaukesha Police Chief Russell Jack called the incident \"extremely disturbing as a parent and as chief of police\" at a news conference Monday.\nThe Internet meme that allegedly inspired the bizarre attack appears on the website Creepypasta Wiki, a collection of fictional horror stories. Nonetheless, the girls allegedly told police that they believed Slender Man, a tall, faceless figure in a black suit, was real.\nOne allegedly said they wanted to become \"proxies\" of the character and would prove their dedication through the killing, reported NBC affiliate WGBA in Green Bay, and said they would take the victim's body to an area of Wisconsin's Nicolet National Forest where Slender Man supposedly lives.\nPolice said the victim screamed, “I hate you. I trusted you,” to her attackers, according to the Milwaukee Journal Sentinel.\nThe Associated Press contributed to this report.","url":"https://www.nbcnews.com/storyline/slender-man-stabbing/911-call-released-waukesha-slender-man-stabbings-n122291"}
