{"authors":["Edwin Mora"],"date_download":"2018-10-30 21:35:37","date_modify":"2018-10-30 21:35:37","date_publish":"2016-06-08 00:53:18","description":"21 family members of the 9/11 attacks implored President Obama to declassify 28 pages of an inquiry into the al-Qaeda attack.","filename":"data/vaneerConsumption/911FamiliestoObamaRelease28SecretPagesof911Report.json","image_url":"https://media.breitbart.com/media/2015/12/9-11-tribute-in-lights-nyc-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_06_07__1540935337.html","title":"9/11 Families to Obama: Release 28 Secret Pages of 9/11 Report","title_page":"9/11 Families to Obama: Release 28 Secret Pages of 9/11 Report","title_rss":"NULL","source_domain":"breitbart.com","text":"A group composed of 21 family members and survivors of the Sept. 11, 2001, terrorist attacks wrote a letter to the White House, imploring President Barack Obama to declassify 28 pages from a bipartisan joint congressional inquiry into intelligence failures surrounding the al-Qaeda strike.\nThe letter’s authors pleaded with President Obama to immediately release the secret portion of the 838-page Joint Inquiry into Intelligence Community Activities Before and After the Terrorist Attacks of September 11, 2001, conducted by the House and Senate intelligence committees and published in December 2002.\n“Not a single day of further delay can be justified,” wrote the advocates in the letter dated June 6.\nSome of the few U.S. lawmakers who have been granted access to the 28 pages claim it documents evidence linking the Kingdom of Saudi Arabia, nominally a U.S. ally, to the 9/11 terrorist attacks.\n“As you know, this September will mark the 15th anniversary of the horrific attacks that claimed the lives of our innocent loved ones, and transformed our nation and world,” the families and survivors told the White House in their letter. “We know from our efforts since that day to pursue justice on behalf of our loved ones that individuals and institutions that bear culpability for their murders — many of them Saudi — have never been held to account.”\n“We are encouraged that you have initiated a process to address that injustice, and look forward to working with you and your administration in any way possible towards that goal,” they added.\nThe survivors and family members called on the Obama administration to release any information, beyond the classified pages, that provides evidence associating the government of Saudi Arabia to the worst terrorist attack on U.S. soil.\n“As we have indicated on many occasions, any meaningful effort to provide the American public with the truth concerning Saudi Arabia’s role in the emergence of al Qaeda and events of 9/11 must encompass the full spectrum of evidence bearing on questions of Saudi culpability, and not merely the 28 pages,” they wrote.\nThe advocates added:\nThe body of evidence in the possession of the United States addressing Saudi support for al Qaeda includes literally tens of thousands of pages of documents beyond the 28 pages which, like the 28 pages, still have not been released… we hope and trust that you regard the release of the 28 pages as only the first step in responding to the public calls for transparency and accountability.\nThe Daily Beast has reported that the FBI is in possession of another 80,000 classified documents, including many that link the Saudis to the 9/11 terror plot.\nThe 9/11 families and survivors, in addition to their letter, provided the Obama administration with nine categories of records they believe should be declassified, including records of unpublished 9/11 Commission investigations and documents linking Saudi religious organizations to al-Qaeda.\n“There has never been any conclusive proof tying senior levels of the Saudi government to al Qaeda ahead of 9/11, but scrutiny around a possible connection has lingered for years,” reports The Hill. “Saudi leaders have repeatedly rejected the allegations and have said that the pages should be released to quell any speculation.”\nThe families of victims and survivors of the 9/11 attacks have filed a lawsuit against Saudi Arabia, alleging that the Kingdom supported al-Qaeda in executing the terrorist attacks.\nLast year, a federal judge in New York dismissed the lawsuit, which is currently the subject of an ongoing appeal.\nUnder current U.S. law, the kingdom is protected from such legal actions by sovereign immunity. The Obama administration has threatened to veto a bipartisan bill to allow the families of September 11th victims to sue Saudi Arabia if the Sunni country is found to be guilty of supporting the terrorist attacks. In May, the GOP-led Senate unanimously passed the legislation. It remains unclear when the House will vote on the bill.\n“The withholding of key evidence by our own government during the pendency of our lawsuit has unquestionably helped culpable parties secure dismissals already, and thereby allowed them to avoid any consequences for their roles in the murder of our loved ones and grave injuries of many survivors,” wrote the families and survivors to the White House.\nObama’s CIA Director John Brennan has come out against releasing the 28 pages. Meanwhile, the U.S. Director of National Intelligence (DNI) James Clapper has declared the release of the documents this month “a realistic goal.”\nNevertheless, the DNI also indicated that the pages would be reviewed by U.S. lawmakers first, a move that could potentially delay their release to the public.","url":"https://www.breitbart.com/national-security/2016/06/07/911-families-obama-release-28-secret-pages-911-reprt/"}
