{"authors":[],"date_download":"2018-10-22 20:32:05","date_modify":"2018-10-22 20:32:05","date_publish":"2014-06-02 01:53:35","description":"Harriette Thompson broke the U.S. record for fastest marathon run among people 90 to 94 years old.","filename":"data/vaneerConsumption/91YearOldBreaks2RecordsatSanDiegoMarathon.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_22/480571/140601-harriette-thompson-jms-2054_4809904d7b9da2ba60baadd914e095df.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_91-year-old-breaks-2-records-san-diego-marathon-n119981_1540240325.html","title":"91-Year-Old Breaks 2 Records at San Diego Marathon","title_page":"91-Year-Old Breaks 2 Records at San Diego Marathon","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFrom NBC San Diego\nThe 2014 Rock ‘n’ Roll San Diego Marathon saw new records for time and age shattered by one runner.\nAt 91 years old, Harriette Thompson has become the oldest woman to complete the Southern California race – her 15th time running it. That made her the second oldest marathon runner in U.S. history.\nWith a time of 7 hours, 7 minutes and 42 seconds, she also broke the U.S. record for the fastest marathon run in the 90-94 age group.\nThe previous record was held by a 90-year-old runner in Portland, Oregon, who ran a marathon in 8:53:08, according to U.S.A. Track & Field.\nBut a brief chat with Thompson reveals her story outpaces even her record-breaking running.\nThe North Carolina resident is a cancer survivor, most recently battling squamous cell carcinoma on her legs, Runners World reports.\n“I’m having radiation on my legs. I just had nine radiation treatments, and they’re being healed now,” she said before Sunday’s race.\nTreatments and hospitalizations forced her to skip last year’s Rock ‘n’ Roll San Diego Marathon, but she came back this year with a new spring in her step. Before the race, she said she felt fine, though one leg was giving her a bit of trouble.\nThrough her runs, Thompson helps to raise money for the Leukemia and Lymphoma Society’s Team in Training. The team’s campaign director told the Charlotte Observer Thompson’s efforts have generated more than $90,000 for the society.\nThe cause is close to her heart because everyone in her family had died from leukemia or some form of cancer, she told NBC 7.\nRecently, she lost her 99-year-old brother to lymphoma, so keeping up her own health is one of her main motivations to run.\nIn previous races, Thompson has trained with a team, but this year, she had a hard time keeping up with them – understandable, since they are a group of 20 year olds.\nInstead, she put together her own routine.","url":"https://www.nbcnews.com/news/us-news/91-year-old-breaks-2-records-san-diego-marathon-n119981"}
