{"authors":[],"date_download":"2018-10-30 17:50:29","date_modify":"2018-10-30 17:50:29","date_publish":"2018-10-30 17:27:32","description":"Nearly 2 billion children – about 93 percent of the world’s children under the age of 15...","filename":"data/vaneerConsumption/93percentoftheworldschildrenbreathetoxicpollutedaireachday.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/04/19/Videos/4375031.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_health_percent-t_5185999a63127df08de56810653babf0__1540921829.html","title":"93 percent of the worlds children breathe toxic, polluted air each day","title_page":"93 percent of the worlds children breathe toxic, polluted air each day","title_rss":"NULL","source_domain":"ajc.com","text":"Nearly 2 billion children – about 93 percent of the world’s children under the age of 15 – breathe toxic, putrid air that’s so polluted it puts their health and well-being at serious risk, a new report said.\nMany of the children die: The United Nations' World Health Organization (WHO) estimates 600,000 children died in 2016 from lower respiratory infections caused by dirty air.\n» Paris plans to ban all gas cars by 2030\n“Polluted air is poisoning millions of children and ruining their lives,” said Dr. Tedros Adhanom Ghebreyesus, director-general of the WHO. “This is inexcusable. Every child should be able to breathe clean air so they can grow and fulfill their full potential.”\nAir pollution can affect children's cognitive ability and can also trigger asthma as well as cancer. Children who have been exposed to high levels of air pollution may be at greater risk for chronic illnesses such as cardiovascular disease later in life.\nThe problem is most severe in low- and middle-income countries, the report said, primarily nations in Africa, Southeast Asia, the eastern Mediterranean and western Pacific.\nPark Won-soon, mayor of Seoul, South Korea, said \"the WHO report clearly shows that adults' daily behaviors are threatening the health of innocent children. No single adult on the planet can be free from the pain suffered by our children due to air pollution.\"\n» Why is the sun red, the sky yellow in London?\nThe report said that overall, about 7 million people around the world die each year because of air pollution. In fact, one-third of the deaths from stroke, lung cancer and heart disease stem from polluted air, the WHO said.\nIn order to reduce pollution, the WHO suggests accelerating the switch to clean cooking and heating fuels and technologies, as well as promoting the use of cleaner transport, energy-efficient housing and urban planning.\n“The enormous toll of disease and death revealed by these new data should result in an urgent call to action for the global community,” the Geneva-based organization said. \"For the millions of children exposed to polluted air every day, there is little time to waste and so much to be gained.\"","url":"https://www.ajc.com/lifestyles/health/percent-the-worlds-children-breathe-toxic-polluted-air-each-day/DWFl6oT1CzvLJEAuJzHMUN/"}
