{"authors":["Kristine Fellizar"],"date_download":"2018-10-31 01:45:58","date_modify":"2018-10-31 01:45:58","date_publish":"2018-08-27 19:46:13","description":"A deep and meaningful relationship doesn't just happen out of nowhere. Unlike passion and attraction that can be felt instantly, it takes time and effort to reach a point of emotional safety in a relationship. If you and your partner are willing to…","filename":"data/vaneerConsumption/9AwkwardThingsYouAndYourPartnerCanDoToFeelEmotionallySafeInYourRelationship.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/265f00a5-c235-421a-abae-863416c8f0cd-2t4a0691.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_9-awkward-things-you-your-partner-can-do-to-feel-emotionally-safe-in-your-relationship-10247983_1540950358.html","title":"9 \"Awkward\" Things You And Your Partner Can Do To Feel Emotionally Safe In Your Relationship","title_page":"9 \"Awkward\" Things You And Your Partner Can Do To Feel Emotionally Safe In Your Relationship","title_rss":"NULL","source_domain":"bustle.com","text":"A deep and meaningful relationship doesn't just happen out of nowhere. Unlike passion and attraction that can be felt instantly, it takes time and effort to reach a point of emotional safety in a relationship. If you and your partner are willing to do a few very important and somewhat awkward things, you can have a deep emotional connection that's meant to last.\nEmotional safety in a relationship is important for a number of reasons, but one matters most of all. According to research on the neuroscience and power of safe relationships by Stephen Porges, Ph.D., emotional safety is one the most important components of a satisfying romantic connection.\n\"If you feel emotionally safe in your relationship, you are able to express your emotions without fear of being ridiculed or shamed,\" Amy McManus, licensed marriage and family therapist, tells Bustle. \"You may not be fully understood, but you will be listened to and you will feel heard.\"\nWhen you feel like you can express yourself without fear, you're likely to trust that your partner truly loves and cares for you. It's why Dr. Lori Whatley, Licensed Marriage and Family Therapist, tells Bustle that emotional safety is a \"cornerstone for a healthy relationship.\" It's like a safety net that allows for intimacy and connection to grow.\nAs you can imagine, forming a deep connection with your partner will take some work. So here are some \"awkward\" things you and your partner should do in order to feel emotionally safe in your relationship, according to experts.\n1 Be Consistent Andrew Zaeh for Bustle Being consistent is one of the easiest ways to create an environment of emotional safety in your relationship, Scarlett Kennedy, relationship expert and author, tells Bustle. You can do that by checking in with each other regularly, texting when you say you're going to, and following through with plans you've made together. If you need to change up your routine in any way, talk about it so everyone is on the same page. \"Make sure your words match your actions,\" Kennedy says, and explain yourself clearly without being vague.\n2 Share Your Inner-Most Thoughts Ashley Batz/Bustle Being vulnerable isn't easy but it is the key to emotional safety. \"If one partner is vulnerable in sharing and opening themselves up to the other but the other doesn't reciprocate, the one that is vulnerable will get frustrated and potentially no longer feel safe to show their vulnerability,\" certified relationship coach, Susan Golicic, Ph.D., tells Bustle. If no one wants to open up in the relationship, the relationship won't grow. Being vulnerable and opening up about your feelings can create intimacy between you and your partner.\n3 Give Positive Affirmations To Each Other Ashley Batz/Bustle When you're with someone for a while, it's easy to forget to say things like \"I love you\" or \"I appreciate what you do for me.\" But as relationship coach, Jennifer Walton LPC, tells Bustle, these positive words of affirmation help to create security in your relationship. Try incorporating them into a routine, so you don't forget to express them.\n4 Be Honest With Your Partner Even If It Makes Things Uncomfortable Ashley Batz/Bustle When you're looking to spend a lifetime with someone, you should expect to tackle some of the more awkward and uncomfortable conversations. As Caleb Backe, Health and Wellness Expert for Maple Holistics, tells Bustle, whatever you do, don't lie. \"You don’t have to share everything all the time, but if you don’t want to share something at any time, say so,\" Backe says. \"Never lie and say everything is OK, when it isn’t.\" Creating emotional safety will require you to be a little uncomfortable. But once you overcome it, you and your partner will be much closer.\n5 Be Clear With Your Boundaries Andrew Zaeh for Bustle \"As a child sex abuse survivor, it is paramount that I feel emotionally safe in my relationship,\" Alisa Zipursky, founder of HealingHonestly.com tells Bustle. \"Emotional safety to me is about each person communicating their boundaries and honoring the other's boundaries.\" For instance, if you don't want your partner touching you a certain way, you should be able to communicate that and your partner should respect it. Similarly, if your partner tells you that they need some alone time, it's up to you to honor their wish.\n6 Talk About Your Baggage Andrew Zaeh for Bustle Talking about your past may be uncomfortable, but Tara Eisenhard, Divorce Coach and Mediator, tells Bustle, it's important for you both to understand each other's triggers. \"This awareness is powerful as it brings understanding and empathy,\" she says. \"When partners know the 'what' and 'why' of their pain points, they’re able to work together to overcome them.\"\n7 Cut Unnecessary People Out Of Your Lives Andrew Zaeh for Bustle These would be people like exes who have no real reason (i.e. kids) to still be in your life. Having a relationship with an ex, even a friendly one, can ruin the emotional safety you've built in your relationship if both of you are not on the same page. \"You need to focus on what will make your partner comfortable when it comes to you and your ex, and work on that,\" relationship expert and author April Masini tells Bustle. \"Sacrifice in relationships is part of long-term stability.\" No one should feel like their request is \"unreasonable.\" Instead, both partners should talk it through.\n8 Take Responsibility For Your Share Of Any Relationship Problems Ashley Batz/Bustle In order to feel emotionally safe, it's important to also be emotionally mature as well. \"Don't make the most common mistake of not taking responsibility for your bad moods, fears, and letting your partner feel responsible,\" psychotherapist Tina B. Tessina, LMFT, PhD, tells Bustle. Doing so will only create dysfunction and separate the two of you.","url":"https://www.bustle.com/p/9-awkward-things-you-your-partner-can-do-to-feel-emotionally-safe-in-your-relationship-10247983"}
