{"authors":["Brandi Neal"],"date_download":"2018-10-31 01:44:30","date_modify":"2018-10-31 01:44:30","date_publish":"2018-09-06 17:48:04","description":"While sleeping is likely one of your favorite activities, that sweet slumber can sometimes be disrupted by a creepy dream. Perhaps your dreams creep you out so much that you keep them to yourself because you fear you're the only one having them.…","filename":"data/vaneerConsumption/9CreepyDreamsYouMightNotRealizeAreSuperCommon.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/5/13/184eeeea-d261-45ca-a670-2a9dc9147134-getty-512431292.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_9-creepy-dreams-you-might-not-realize-are-super-common-9071577_1540950270.html","title":"9 Creepy Dreams You Might Not Realize Are Super Common","title_page":"9 Creepy Dreams You Might Not Realize Are Super Common","title_rss":"NULL","source_domain":"bustle.com","text":"While sleeping is likely one of your favorite activities, that sweet slumber can sometimes be disrupted by a creepy dream. Perhaps your dreams creep you out so much that you keep them to yourself because you fear you're the only one having them. Common creepy dreams fall into four basic categories, according to a dream study cited by Psychology Today. This means that you and your creepy dreams are in good company, and what you're experiencing when you close your eyes is totally normal. In fact, more than 70 percent of bad dreams tend to fall into the themes of physical aggression, interpersonal conflicts, failure, or hopelessness.\nWhat's more, creepy dreams should not be interpreted literally. If you have a dream that all of your teeth are falling out, it doesn't mean that you're really going to lose your teeth. All dreams are metaphors for things going on in your life, and creepy dreams are basically alerts that you need to address them. This means that if you dream that you're being chased, it's unlikely that you're going to have to outrun Freddy Krueger the next day. Instead, a dream of being chased might mean that you're avoiding something, and almost everyone has this dream at one time or another. If you're feeling all alone with your creepy dreams, these nine creepy dreams are actually pretty common.\n1 You've REALLY Gotta Go, But There's No Bathroom Giphy Perhaps you've been embarrassed to reveal to your besties that you have a recurring creepy dream about really having to relieve yourself ,but not being able to find a bathroom. It's actually pretty likely, however, that you're friends are having it too. If you have this creepy dream on the regular, the website Dream Moods noted that it means that you feel like you don't have enough privacy IRL.\n2 You're Bitten By A Snake Giphy If you have creepy dreams about snakes, this is totally normal. According to Dream Moods, dreaming of snakes, especially if you don't particularly like snakes, represents a subconscious fear. \"Because snakes are sometimes hard to see and are slithering in bushes, they are also symbolic of a hidden threat and/or a betrayal. They lie in wait waiting for the perfect opportunity to make a move. If the snake bites you, then the dream is trying to alert you to something in your waking life that you are not aware of or that has not yet surfaced.\"\n3 Your Teeth Fall Out Giphy If you've ever had that horrifyingly creepy dream that all of your teeth are falling out, you're definitely not alone. According to the website How To Lucid, it's one of the 58 most common dreams. \"[This dream] is all about your power and usually means you’re feeling subconsciously repressed or controlled. It can mean you really want to leave a job, but you’re feeling trapped or like you can’t for some reason.\"\n4 You're Naked In Public Giphy Being naked in a place that generally requires clothes is one of the most common creepy dreams, but you likely already knew that because it's referenced constantly on TV and in movies. According to How To Lucid, dreaming that you're without clothes while you're someplace like the airport (oops) means that you're self conscious or afraid that you're going to be publicly embarrassed or ridiculed IRL.\n5 Creepy Food Dreams Giphy If you have creepy food dreams, like perhaps a hamburger is trying to eat you, the meaning of this dream actually isn't creepy at all. According to How To Lucid, dreaming of food means you're not getting enough mental stimulation and you need to learn something new. It could also just mean that you really want a hamburger. Get one the day after you have this dream and see if the dream stops. If it doesn't, it might be time to learn a second language or learn how to play a musical instrument.\n6 Dreaming That You're Dying Giphy This is another scary dream that actually has a positive meaning IRL. If you have a dream that you're dying, or you're killed in a dream, it actually means that one chapter of your life is ending and it's time to open yourself up to new beginnings, according to Dream Moods. \"Dreaming of your own death symbolizes inner changes, transformation, self-discovery and positive development that is happening within you or your life. You are undergoing a transitional phase and are becoming more enlightened or spiritual.\"\n7 Dreaming Of Demons & Monsters Giphy Dreaming of confronting demons or monsters, or dreaming that you have become a demon or monster, can be creepy AF. However, this is one of the most common creepy dreams, and it's another one that has a positive meaning, even though it can be really scary while it's happening. \"[Dreaming of] demons and monsters tends to mean you’re looking to change aspects of yourself,\" How to Lucid explained. \"If you keep seeing yourself as a demon, you need to think about what you don’t like about yourself, and change it.\"\n8 Dreaming About Spiders Giphy Dreaming about any type of insect or vermin is my least favorite creepy dream. Same? Dreaming about spiders is really common, and it actually means you feel out of control, or that you're being excluded from a group, IRL. It's also common to dream about spiders after finding out that your partner has been unfaithful, according to How to Lucid.","url":"https://www.bustle.com/p/9-creepy-dreams-you-might-not-realize-are-super-common-9071577"}
