{"authors":[],"date_download":"2018-10-30 14:36:57","date_modify":"2018-10-30 14:36:57","date_publish":"2018-08-11 01:35:00","description":"Every fall Atlanta’s stages, parks, galleries and movie theaters come alive with so many stell...","filename":"data/vaneerConsumption/9fallartseventsyoudontwanttomiss.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/11/Images/newsEngin.22721147_Elton-John.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/events_performing-arts_fall-events-you-won-want-miss__1540910217.html","title":"9 fall arts events you don’t want to miss","title_page":"9 fun things to put on your calendar this fall","title_rss":"NULL","source_domain":"ajc.com","text":"Every fall Atlanta’s stages, parks, galleries and movie theaters come alive with so many stellar shows, exhibits and movies, it can be overwhelming. Because you can’t go to everything, we’re here to help by recommending some of the events we’re looking forward to this season. Some are perennial favorites that come around every autumn, others are brand-new. Together they make up a multi-faceted showcase of Atlanta’s rich cultural offerings.\nT.I. performs at One Musicfest, which has moved to Central Park this year. DAVID BARNES / DAVID.BARNES@AJC.COM (The Atlanta Journal-Constitution)\nOne Musicfest. Most music festivals are either contracting or remaining stagnant in size, but the homegrown R&B/hip-hop/funk/soul gathering is still on the rise. This year the event expands to two days and moves to the roomier Central Park. With a multi-generational parade of artists spanning Nas, T.I., H.E.R., Miguel, George Clinton and Parliament Funkadelic, Brandy and Jeezy, there will be plenty of pulsating grooves. Sept. 8-9, Central Park, 1-800-745-3000, www.onemusicfest.com.\nJessica Assef will appear in the Atlanta Ballet’s September production, “Return to Fall.” Contributed by Rachel Neville (The Atlanta Journal-Constitution)\n‘Return to Fall.’ Atlanta Ballet brings an eclectic autumn program — the company’s first since 2011 — with Jiri Kylian’s “Return to a Strange Land,” a tribute to his mentor John Cranko, and a world premiere by Ricardo Amarante. Also featured are a pas de deux from “Don Quixote” and George Balanchine’s “Tchaikovsky Pas de Deux,” Artistic Director Emeritus Robert Barnett’s first restaging for the main company in 21 years. A new partnership presents members of Czech National Ballet performing an excerpt from Mauro Vigonzetti’s “Vertigo.” Sept. 14-16, Atlanta Ballet, Cobb Energy Performing Arts Centre, 800-745-3000, cobbenergycentre.com.\nPeter Sagal, host of the NPR game show “Wait, Wait … Don’t Tell Me,” will be among the writers appearing at the Marcus Jewish Community Center’s 2018 book festival. CONTRIBUTED (The Atlanta Journal-Constitution)\nMarcus Jewish Community Center of Atlanta Book Festival. For 27 years the Marcus Jewish Community Center of Atlanta has brought culture and conversation to the city through its annual book festival and related events. More than 13,000 people from across the Southeast will attend the five-week festival featuring appearances by more than 45 authors, including Kenny Leon, Peter Sagal, Sally Field, Stuart Eizenstat and Anna Quindlen. Prologue to the Book Festival Sept. 20-Oct. 21. Book Festival Oct. 30-Nov. 18.Marcus Jewish Community Center of Atlanta, 678-812-4005,www.atlantajcc.org/\nFlux: Grant Park. Flux, an evening of free open air public art and performance, has been in flux in recent years. First staged in the Castleberry Hill neighborhood in 2010, the event attracted 20,000 people by 2013. Since then it has relocated and experienced some ups and downs. This year Flux stretches over four days in Grant Park, in celebration of the historic park’s 135th birthday. Four Atlanta artists have been selected to lead projects: Rachel K. Garceau, Rebecca M. K. Makus, Iman Person and Lauri Stallings. The events will take place during park hours and will climax Saturday night with a “participatory, light-based happening.” Visitors can come for an hour, a day, or multiple days. 6 a.m.-11 p.m., Sept. 27-30, Free, Grant Park, fluxprojects.art/\nOut on Film. Over 11 days this fall,Atlanta’s premier LGBT film festival will screen about 125 movies that explore themes of love, prejudice, politics, anguish and acceptance. Among them are “TransMilitary,” which examines the predicament of the 15,000 trans soldiers serving in a military that won’t accept them, and “Mapplethorpe,” a biopic on the provocative New York artist, his transgressive sexuality and his portrayal of the S&M underground. Sept. 27-Oct. 7. Plaza Theatre, Landmark Midtown and Outfront Theatre Company. 404-296-3807, www.outonfilm.org/\nThe Texas, the famous participant in the Civil War-era Great Locomotive Chase, finally arrives at its new home at the Atlanta History Center. FILE (The Atlanta Journal-Constitution)\nTexas at Atlanta History Center. The Texas is a Civil War-era locomotive that was commandeered to run down Union spies during the Great Locomotive Chase of 1862. For 71 years it was on display in the basement of the Cyclorama building in Grant Park where “The Battle of Atlanta” panoramic painting was also exhibited. In 2015, both were removed and have been undergoing restoration for display in their new home, the Atlanta History Center. Now in mint condition and encased in a glass building, The Texas will be unveiled this fall. Restoration of “The Battle of Atlanta” won’t be complete until next year. Nov. 17, Atlanta History Center, 404-814-4000, www.atlantahistorycenter.com/\n“Infinity Mirrored Room Love Forever” will be among the installations in Yayoi Kusama’s highly anticipated “Infinity Mirrors” show at the High Museum of Art. Contributed by Cathy Carver (The Atlanta Journal-Constitution)\n‘Infinity Mirrors.’ One art exhibition promises to dominate all others this fall when 89-year-old Japanese conceptual artist Yayoi Kusama’s blockbuster exhibition “Infinity Mirrors” opens at the High Museum of Art after attracting endless crowds and lines in Washington D.C., Los Angeles, Seattle and other stops. Considered one of the most important living Japanese artists, Kusama became an Instagram-sensation as her tour broke attendance records and invited hand-wringing over whether it was the art or the Instagram post that mattered most. The exhibition features six mirrored rooms, paintings, sculptures, works on paper and a number of new works. Nov. 18-Feb. 17, High Museum of Art, 404-733-4400, www.high.org.\nWhiskey Fast Facts\nElton John. At the announcement for his three-year retirement tour, the British piano-pop icon immediately clarified that his exit from the road doesn’t mean an exit from public life. “When I say I’m stopping touring, I’m not stopping music. But mostly, I’ll be taking my kid to soccer academy,” John said. Still, this will be your last chance to warble off-key to “Your Song” with the flamboyant star in the same room. 8 p.m. Nov. 30-Dec. 1, Philips Arena, 1-800-745-3000, www.ticketmaster.com.\n‘The Dark Crystal.’ The Center for Puppetry Arts’ Worlds of Puppetry Museum debuts the new, long-running exhibit, “Jim Henson’s The Dark Crystal: World of Myth and Magic,” featuring more than 50 items from the 1982 fantasy/adventure film. Distinguished by landmark puppet animatronics and special effects, the film was marketed as a family film despite it’s dark tone and scary creatures. Objects on display include puppets used in the film, prototypes, props, costumes, behind-the-scenes production photos and Brian Froud’s original concept art. A Dark Crystal Ball will kick off festivities on Aug. 30. Aug. 31-2019, Center for Puppetry Arts, 404-873-3391, www.puppet.org/\n— Cynthia Bond Perry, Felicia Feaster and Melissa Ruggieri contributed to this story.\nMORE 2018 FALL ARTS GUIDE\nTheater\nMusic\nDance\nClassical Music\nVisual Arts","url":"https://www.ajc.com/events/performing-arts/fall-events-you-won-want-miss/UCnFuvcdqV0tJMihkpCJuJ/"}
