{"authors":["Erin Mayer"],"date_download":"2018-10-30 22:56:51","date_modify":"2018-10-30 22:56:51","date_publish":"2014-08-14 16:00:01","description":"Welcome to mid-August, when the end-of-summer blues start setting in, back-to-school advertisements begin popping up everywhere (they're still depressing well into adulthood) and we prepare to kiss long days and warm nights goodbye. But no need to…","filename":"data/vaneerConsumption/9FallSweatersThatHelpYouTransitionThoseSummerDressesForChillierWeather.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/30f30eaf-7ad2-48ef-b420-b7989f2c5ba7.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35136-9-fall-sweaters-that-help-you-transition-those-summer-dresses-for-chillier-weather_1540940211.html","title":"9 Fall Sweaters That Help You Transition Those Summer Dresses For Chillier Weather","title_page":"9 Fall Sweaters That Help You Transition Those Summer Dresses For Chillier Weather","title_rss":"NULL","source_domain":"bustle.com","text":"Welcome to mid-August, when the end-of-summer blues start setting in, back-to-school advertisements begin popping up everywhere (they're still depressing well into adulthood) and we prepare to kiss long days and warm nights goodbye. But no need to pack away those breezy sundresses just yet — there's plenty of time left to wear them.\nYou can extend the shelf-life of a summer dress well beyond the point when the humidity starts to break by simply embracing the concept of layering. The right lightweight sweater comes in handy once the temps begin to drop and your flawless sleeveless number that served you so well in the heat now reduces you to shivers and goosebumps. A good knit can mean the difference between trembling your ass off at that end-of-summer barbecue and using that energy to finally make a move on your warm-weather crush. Ah, the power of clothing.\nSince you're probably too busy hitting the beach and drinking homemade frozen margaritas on fancy rooftops to shop for sweaters (kidding — no one is ever too busy for shopping) I've rounded up nine of the best for you to stock up on before Labor Day. Trust me, you don't have to be warm to look hot!\n1. Oversized Cardigan\nAn oversized grandpa cardigan with elbow patches gives your floral sundress a grungy flavor.\nOlive & Oak Elbow-Patch Cardigan, $79, Urban Outfitters\n2. Geometric Print\nWho has time for boring layers? Not you!\nCrochet Top, $77, ASOS\n3. Fit to Be (Bow)Tied\nFor when short sleeves and cute details will suffice.\nAlice + Olivia Bow-embellished Sweater, $275, Net-A-Porter\n4. Simple and Cropped\nA plain cropped sweater turns your floral sundress into stylin' separates.\nFisherman Cropped Sweater, $56, Topshop\n5. Colorblocked Stripes\nTimeless stripes with a twist.\nHalogen Stripe Block Merino Wool Cardigan, $78, Nordstrom\n6. Draped\nNo gust of late-summer wind is too much for this bad boy.\nMarled Rib-stitch Open Cardigan, $110, J.Crew\n7. Big 'N Comfy\nFull disclosure: I just bought this sweater. It is a dream for battling vaguely chilly nights and overly air conditioned restaurants.\nSlouchy Stripe Pullover, $108, Free People\n8. Jeweled Cardi\nUpgrade a traditional cardigan silhouette with jeweled buttons.\nCardigan with Jewel Buttons, $50, Zara\n9. Gone FishingThis will last longer than the real goldfish you won at the county fair this summer.\nMarkus Lupfer 'Grace' Sequin Prize Fish Sweater, $390, Nordstrom\nImages: Urban Outfitters, ASOS, Net-a-Porter, Topshop, Nordstrom(2), J. Crew, Free People, Zara","url":"https://www.bustle.com/articles/35136-9-fall-sweaters-that-help-you-transition-those-summer-dresses-for-chillier-weather"}
