{"authors":["Ashley Mateo"],"date_download":"2018-10-31 01:50:30","date_modify":"2018-10-31 01:50:30","date_publish":"2018-09-06 13:00:52","description":"Everyone knows they want money. Here’s what they’re not thinking about. There’s so much power in creating a wedding registry. You can add anything you want. Like that insanely overpriced copper cookware set everyone keeps Pinning, or the Playstation…","filename":"data/vaneerConsumption/9GiftsEveryEngagedCoupleWantsEvenIfTheyDontKnowItYet.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/5/da5864a3-bee0-422a-943b-bb50a61816ba-kitchenaid.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_9-gifts-every-engaged-couple-wants-even-if-they-dont-know-it-yet-11503744_1540950630.html","title":"9 Gifts Every Engaged Couple Wants, Even If They Don't Know It Yet","title_page":"9 Gifts Every Engaged Couple Wants, Even If They Don't Know It Yet","title_rss":"NULL","source_domain":"bustle.com","text":"Everyone knows they want money. Here’s what they’re not thinking about. There’s so much power in creating a wedding registry. You can add anything you want. Like that insanely overpriced copper cookware set everyone keeps Pinning, or the Playstation your partner wants but isn’t allowed to spend money on because you’re, you know, paying for a wedding. And people will buy it for you! It’s like your birthday and the holidays all rolled up into one, except you know exactly what’s going to be in those prettily-wrapped boxes.\nEven though you think you know how you want your guests to spend their money, they go off-script and surprise you with a gift you didn’t even know you wanted — or needed. After hearing the surprising gifts these brides got, you just might want to add a few more items to your own registry.\n1 Amex Gift Cards American Express “Restaurant gift certificates to a couple's favorite spots or even Amex gift cards. Once the wedding and honeymoon has passed, it's so nice to have fun (and free!) dates to look forward to. It keeps the celebration going and the first year feeling fun and fresh. And it's thoughtful because it shows you know the couple well or maybe you even shared good memories there together. Highly recommend!” —Lauren, 31\n2 Airline Miles pxhere “Airline miles. You can actually gift them to people. It totally fueled our first year of travel.” —Jo, 37\n3 Furniture Pottery Barn “Furniture! My grandparents gifted us a really beautiful hutch to hold all the new pretty china and glassware we had gotten as gifts. We didn’t have anything like that already, and without it, all that great stuff we had registered would still be in boxes or hidden in cabinets.” —Brita, 31\n4 Quality Linens pxhere “Quality linens. These are things you typically don't splurge on because sheets are sheets, right? Wrong. Nice linens are life-changing and you will never go back.” —Megan, 31\n5 A Lawyer BONNINSTUDIO “A referral to and a portion of the retainer for a lawyer to write a prenuptial agreement. I know it sounds crazy, but sometimes having it be a gift makes it easier for both sides to have the discussion.” —Meg, 35\n6 Towels pxhere “Nice towels. You can never have too many; they’re not sexy but they are necessary.” —Clem, 33\n7 Experiences pxhere “Something to do together. My husband and I already lived together pre-marriage, so we had most of the stuff we needed. It was the honeymoon experiences people gifted us (we got a candlelit dinner on the beach and a chance to swim with dolphins in Hawaii) that we remember the most.” —Katherine, 26\n8 A Mixer KitchenAid “A KitchenAid mixer. Are you even engaged if you don’t register for the fanciest, newest KitchenAid?” —Kaitlin, 32","url":"https://www.bustle.com/p/9-gifts-every-engaged-couple-wants-even-if-they-dont-know-it-yet-11503744"}
