{"authors":["Ashley Mateo"],"date_download":"2018-10-31 01:49:10","date_modify":"2018-10-31 01:49:10","date_publish":"2018-09-06 13:58:53","description":"Sometimes, it’s really just the thought that counts. Wedding gifts should be no-brainers, right? Most couples spend a serious amount of time choosing the things they want for their wedding registry (whether they’re actually slogging it out with a…","filename":"data/vaneerConsumption/9NewlywedsRevealTheWeddingGiftsTheyReturnedImmediately.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/5/0c74db7c-687b-4ce6-979f-c45a5ff97ac1-clear-close-up-crystal-glasses-60554.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_9-newlyweds-reveal-the-wedding-gifts-they-returned-immediately-11503991_1540950550.html","title":"9 Newlyweds Reveal The Wedding Gifts They Returned Immediately","title_page":"9 Newlyweds Reveal The Wedding Gifts They Returned Immediately","title_rss":"NULL","source_domain":"bustle.com","text":"Sometimes, it’s really just the thought that counts. Wedding gifts should be no-brainers, right? Most couples spend a serious amount of time choosing the things they want for their wedding registry (whether they’re actually slogging it out with a price scanner in store, or just registering online). All their guests have to do, then, is pick out something in their price range and splurge for wrapping. If all else fails, cash is a foolproof way to thrill any newlywed.\nBut of course there are registry renegades, guests who decide their gift ideas are better than what they bride- and groom-to-be are literally telling you they want. And so almost every couple ends up with a few weird or even WTF-worthy presents they can’t take or send back fast enough. These brides share the gifts they could live without.\n1 A Different Version Of The Glasses They Specifically Asked For Crate and Barrel “A surprising amount of people bought us different versions of kitchen items than we registered for (for example, we registered for a shape of glasses at Crate and Barrel and someone bought us completely different ones from a store we weren’t registered at). I appreciate the thought but like… we gave you links to the ones we want.” —Alie, 33\n2 An Electric Wine Chiller pxhere “Someone bought us an electric wine chiller (who needs that if you have a fridge?) with no gift receipt, so we put it out on the street.” —Amy, 27\n3 The Kitchen Items That Don't Actually Fit In Their Apartment pxhere “We returned a few things from our Bed Bath & Beyond registry because once they arrived, we realized we just didn't have the space for them in our Manhattan kitchen (ex: cupcake carrier). After we returned them, we mysteriously received the same items a few weeks later from another guest. It turns out that when we returned them, the items showed up as ‘unpurchased’ on our registry so a different guest bought them for us! It was so annoying to re-return the same items.” —Allison, 30\n4 Wall Crosses Wellcome Collection “My husband is a pastor, and for our wedding we got, no joke, 22 wall crosses. We do love Jesus and appreciated them, but didn’t want our house to look like a monastery. We returned every one we could for store credit so we could get like...a blender and plates and other necessary stuff for our new life.” —Colleen, 38\n5 Serving Trays Cooperhewitt \"We ended up returning a bunch of serving trays, because how many serving trays do you really need?!” —Casey, 28\n6 Anything Heart-Shaped CC0 Public Domain “I returned anything that was heart-shaped or said ‘wedding’ or ‘bride and groom’ on it. Once the wedding is over, what are you supposed to do with a mug that says ‘bride’?” —Caitlin, 28\n7 Sheets And Hand Towels That Weren't On The Registry pxhere “We received sheets and hand towels that weren't on our registry — even though we had sheets and towels on our registry, a couple people thought their color/brand/whatever choices were better than ours.” —Liz, 31\n8 Lingerie From The Bride's Mom Peyton Weikert “So, my mother read somewhere online that it's tradition for the mother of the bride to give said bride a penquior set (ostensibly a sexy nightie with matching robe). Fast forward to opening gifts with my fiance and pulling out lacy piece of lingerie with a card that said: ‘For your honeymoon! Love, Mom’ We returned it the next day.” —Emily, 38","url":"https://www.bustle.com/p/9-newlyweds-reveal-the-wedding-gifts-they-returned-immediately-11503991"}
