{"authors":["Natalia Lusinski"],"date_download":"2018-10-31 01:41:50","date_modify":"2018-10-31 01:41:50","date_publish":"2018-09-14 18:48:53","description":"While money issues are a natural topic in romantic relationships — who pays for what, how you’ll split the rent or mortgage, and so on — they can also be a point of contention. For instance, maybe you and your significant other get an apartment…","filename":"data/vaneerConsumption/9ReasonsYouShouldNeverLoanMoneyToYourSignificantOtherAccordingToExperts.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/c2324da1-feb5-4273-bf08-a7dd5b7b7137-andrew-zaeh-unhappy-couple.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_9-reasons-you-should-never-loan-money-to-your-significant-other-according-to-experts-11916203_1540950110.html","title":"9 Reasons You Should Never Loan Money To Your Significant Other, According To Experts","title_page":"9 Reasons You Should Never Loan Money To Your Significant Other, According To Experts","title_rss":"NULL","source_domain":"bustle.com","text":"While money issues are a natural topic in romantic relationships — who pays for what, how you’ll split the rent or mortgage, and so on — they can also be a point of contention. For instance, maybe you and your significant other get an apartment together and split the rent… but then your partner gets laid off and asks you to loan them money “for a month or two.” You may think it’s no big deal, but several money experts believe you should not loan money to your significant other whatsoever.\n“Lending money, especially to a significant other, can jeopardize your relationship,” Chelsea Hudson, personal finance expert at TopCashback.com, tells Bustle. “Even if you love and trust your partner, loaning money can lead to further issues, such as resentment, tension, and additional debt.”\nIt may start out innocently, with lending them just a few dollars. If so, think about if you want that money back, Hudson says, like when you're covering them for lunch when they forgot their wallet. “Relationships are a give-and-take, but at what threshold do you decide your partner needs to be more financially responsible,” she says. And, if you then see your partner buy something, like a new pair of shoes, you may wonder where they got the money to do so. “Successful relationships don’t keep score, emotionally or financially,” Hudson says. “But to avoid any pressure, it is easier to squash the idea of loaning money early on.”\nBelow, Hudson and other money experts share why loaning your partner money is not a good idea.\n1 It Can Put A Strain On Your Relationship Andrew Zaeh for Bustle If you’ve ever loaned someone money, you know it’s not easy to ask for it back. Well, when that person is someone you’re in a romantic relationship with, it may be even more difficult. And if you live with them, it’ll probably get even more complicated. “Many times, when money is loaned to your significant other, they will assume that because you’re in a relationship, they can take their time in returning the money to you,” Karen Ford, financial coach and author of Money Matters, tells Bustle. “Or, they may even take liberties and not pay you back at all.” Nate Masterson, CEO of Maple Holistics, agrees. “It’s never good for a relationship when one partner needs to pressure the other partner to pay back a loan,” he tells Bustle. “Avoiding lending money to your significant other prevents an uncomfortable situation in which one partner needs the money but the other partner cannot pay it back — a situation that can cause bad feelings in a relationship.”\n2 It Can Cause Feelings Of Resentment Andrew Zaeh for Bustle As much as you want to help your partner out, if you loan them money, you may start to resent them, especially if you see them start spending money on other things before repaying you. “It’s possible you’ll feel resentful about lending the money,” Lauren Anastasio, wealth advisor at SoFi, tells Bustle. “Providing this loan may delay some of your personal financial goals.” She says to ask yourself: Is loaning the money a sign that your significant other’s financial goals are more important than your own? Masterson, too, thinks lending money to your significant other can create resentment. “This is especially true if one partner lent the money because they felt that they couldn’t say no,” he says. “The lender may feel that the borrower owes them a favor, and the borrower may feel that their significant other lent them the money to ‘buy’ gratitude.\n3 It Can Cause An Imbalance In The Relationship Ashley Batz/Bustle When you owe someone something — anything — it’s not a fun feeling, whether it’s money, time, to go over the rough draft of their novel, you name it. “Your significant other may struggle with feelings of shame or inferiority, regardless of how freely you are able to lend them money,” Anastasio says. “[A partner who is] reliant on you financially could cause an imbalance in your relationship, potentially jeopardizing the ability for you to feel like equals.”\n4 It Can Cause Anxiety Andrew Zaeh for Bustle You probably have enough things to think about without having to worry about when your significant other will pay you back. “You may have anxiety about getting paid back,” Anastasio says. “If your significant other can’t repay you, it could jeopardize your own finances.” She also says that loaning them money could lead to anxiety about your relationship. She says to ask yourself: Is your significant other using you as a bank? Are they going to start dodging your calls when it comes time to collect?\n5 It Could Enable Bad Spending Habits Ashley Batz/Bustle If you loan someone — aka your partner — money, particularly more than once or if they tend to borrow money from people a lot, you may enable their bad spending habits without even realizing it. “This might mean you’re in a relationship with someone where they think they can buy whatever they want,” David Bakke, personal finance expert at Money Crashers, tells Bustle. And it may set a bad precedent for the future. \"They could assume that you’ll be there for them financially whenever they need help,\" Bakke says. \"Nobody really wants to have that responsibility.”\n6 It Can Lower — Or Ruin — Your Credit Score Hannah Burton/Bustle If you loan your partner more than just a small amount of money and cosign a purchase with them, it could negatively affect you down the line. “If you cosign a loan for them — such as a student loan — the loan shows up on your credit history, too,” Kantrowitz says. “A cosigner is a coborrower, equally obligated to repay the debt, so their misbehavior can ruin your credit.”\n7 It May Not Be In Your Budget & May Cause Added Financial Stress Andrew Zaeh for Bustle Perhaps, in the moment, you can afford to loan money to your significant other, but then, next month, you may have an unexpected debt to pay and suddenly be in financial trouble yourself. “Don’t ever put yourself in a tight financial situation to help someone else out,” Hudson says. “Don’t feel pressured into lending money to someone you love and care for — remember, it’s OK to say no.” Instead, she suggests that you can offer your monetary knowledge to help them implement a budget, a plan to pay off any debt, and/or to accrue more savings.\n8 It Could Ruin Your Relationship Andrew Zaeh for Bustle The stress and strain of your partner owing you money may get so bad, it may lead you two to break up. “Love may cloud your judgment in what should be strictly a business transaction,” Mark Kantrowitz, publisher and vice president of research at Savingforcollege.com, tells Bustle. “If your significant other defaults on the loan, it can ruin your relationship — you may lose both your partner and your money at the same time.” Peter Yang, co-founder and CEO of Resume Writing Services, agrees. “You should never loan money to a significant other because there’s additional risk associated with this exchange compared to your average loan,” he tells Bustle. “Banks constantly give out loans because they can afford to incur the risk of never getting their money back. But when it comes to loaning out money yourself, you not only incur the risk of potentially never being paid, you also run the risk of damaging your relationship — which is something even more valuable than money.” Yang adds that it’s important to weigh your risk versus reward in any financial decision you make. “In this case, it’s never worth it to loan money to your significant other,” he says.","url":"https://www.bustle.com/p/9-reasons-you-should-never-loan-money-to-your-significant-other-according-to-experts-11916203"}
