{"authors":["Caitlyn Callegari"],"date_download":"2018-10-30 22:26:41","date_modify":"2018-10-30 22:26:41","date_publish":"2014-08-15 17:24:54","description":"Some fantasize over the Batmobile, others wish to get behind the wheel of the Mach 5 or cruise atop the Nimbus 2000, but those people obviously don't know how to dream. Because, if you had the opportunity to drive any fictional car of your choosing,…","filename":"data/vaneerConsumption/9SpiceGirlsBusFeaturesWeStillWantAllTheseYearsLater.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/1c4afbd9-21af-4b4f-88ce-8e7a163acac1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35924-9-spice-girls-bus-features-we-still-want-all-these-years-later_1540938401.html","title":"9 Spice Girls Bus Features We Still Want All These Years Later","title_page":"9 Spice Girls Bus Features We Still Want All These Years Later","title_rss":"NULL","source_domain":"bustle.com","text":"Some fantasize over the Batmobile, others wish to get behind the wheel of the Mach 5 or cruise atop the Nimbus 2000, but those people obviously don't know how to dream. Because, if you had the opportunity to drive any fictional car of your choosing, there's only one logical choice: The Spice Bus. Yes, that Union Jack-ed, peace-signed, double-decker monstrosity that ruled the streets of London in the Spice World movie. In actuality, the outside of the bus, however phenomenally designed, is nothing in comparison to the inside digs. Listen, even as a 6-year-old, I knew luxury when I saw it, and the Spice Bus was it.\nThe best part of the Spice Bus, unlike those uber fictional rides I previously mentioned (I'm looking at you, flying broom), is that the elements of the Spice Bus were actually attainable. Like, you'd have to have loads of money, a halfway decent engineer, and some kind of a permit — but hey, stranger things have happened, right? And then there's that whole thing where Posh drives it over the gap on Tower Bridge and they land safely, albeit a bit shaken. So I ask you, what other vehicle could have handled such a feat? Right, none. Because the Spice Bus is the apex of automobile design.\nSo, here are the highlights from the Spice Bus that we wish we had in our sad and sorry adult lives right now, and despite the fact that Spice World came out in 1997.\n1. FIRST AND FOREMOST, BABY SPICE'S SWING SET\nA swing AND a slide?! Can you imagine how much more fun road trips would be if you could let off a little steam and swing through bumper to bumper traffic? I would be 75 percent less unpleasant to be around.\n2. POSH'S CATWALK\nShould you wear the little Gucci dress OR the little Gucci dress? Well, you'll never know unless you can model it at 360 degree views for your friends and family. Get me one of these in my house, stat.\n3. SPORTY'S ELLIPTICAL/FITNESS CENTER\nNot that I exactly want to exercise... ever, but it's a necessary evil and if I could peddle away in the comfort of my very own tour bus, I'd save myself a hell of a lot of time and money by combining my gym sessions with commuting.\n4. SCARY'S BOMB ASS FISH TANK\nomar619 on YouTube\nNot that it's necessary, but it's super cool and it'll sure impress your house guests.\n5. A FIRE POLE\nIt can be utilized in so many different and useful ways, I'm hard pressed to find a reason why we don't all have this staple in our houses. Dinner's ready? *Slide* Racing your roommate to the shower in the morning? *Slide*\n6. A SECOND STORY COMMAND CENTER\nImagine a world where you were so important that you needed an entire separate floor just for all of the incoming calls and emails you were receiving. Also, just imagine that you could actually separate yourself from work for five seconds? What's that? You can't read this because you're checking your email at the beach on a Saturday?\n7. A TEAM OF PEOPLE TO HELP RUN YOUR LIFE\nWhat I wouldn't give for a Clifford and Deborah to remind me to make sure I have my headphones, phone charger, and keys before I leave my house each morning. Oh, and a polite text message reminder that I have to pick up a gift for my aunt's birthday and that alternate side of the street parking is in effect.\n8. ILLUMINATED VANITY MIRRORS THAT MAKE YOU LOOK UNREALISTICALLY FANTASTIC\nDidn't have time to apply your makeup before running of the door? Not a problem when you have a mirror so bright and magnified you can see each individual pore on your face.\n9. A WET BAR\nBecause I am always thirsty, aren't you?\nImages: Annie Mole/Flickr; Columbia Pictures (3); ladyzapatoo/Tumblr; tookmyworldwithyou/Tumblr; Giphy (4)","url":"https://www.bustle.com/articles/35924-9-spice-girls-bus-features-we-still-want-all-these-years-later"}
