{"authors":[],"date_download":"2018-10-30 18:18:46","date_modify":"2018-10-30 18:18:46","date_publish":"2016-08-22 20:42:00","description":"Did you know you could go to a 1 a.m. comedy show in Atlanta?","filename":"data/vaneerConsumption/9thingsyoudidntknowaboutAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/04/10/Images/photos.medleyphoto.7093526.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_attractions_things-you-didn-know-about-atlanta__1540923526.html","title":"9 things you didn't know about Atlanta","title_page":"Things you really didn't know about Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"You may have read the myriad lists of “things you didn’t know about Atlanta.” But if you live here, you already know there are entirely too many Peachtree streets and that Varsity is the world’s largest drive-in. For those who call this great city home, here are 9 things about the Capital of the South that you actually may not know.\n1. Piedmont Park isn’t Atlanta’s biggest greenspace.\nSpeak of Atlanta’s greenspace and Piedmont Park immediately comes to mind. With its 185 acres of rolling hills and skyline views, Piedmont is arguably the most well-known park in Atlanta; you may be surprised to know that it is not the largest greenspace, though. The Old Atlanta Prison Farm rests on 300 acres of forest, wildlife and water. Unfortunately, the land is far from pristine; it is so battered and trashed that the city prevents the public from entering. It will take great effort from the community and elected officials to save the neglected beauty.\n2. You can earn points at the Glenn Hotel\nMost residents know about the historic Glenn Hotel because of its famous rooftop bar. The hotel’s rooms are charming eclectic respites, reflecting their moniker as Atlanta’s first boutique hotel. The modern classic architecture and sleek décor are timeless. The hidden secret? Glenn is a Marriott Autograph Property. Hold on to your cash, and experience this historic venue with sensual views of Atlanta using your trusty Marriott points.\nPhotograph shows the final product of the new mural at the Glenn Hotel.\n3. The Walking Dead crew shops in Avondale Estates\nIf you’ve ever passed the unassuming yellow Victorian in Avondale Estates, you may not have known that it’s home to The Odd’s End. Specializing in antiques and curiosities from around the world, The Odd’s End sells oddities like embalming machines, monkey skulls, stuffed cobras and more. Owner Merrick Mixson has been collecting “all kinds of spooky things” for his entire life. Stop in next time you’re in the area and you’ll understand why the props crew from The Walking Dead is a top customer. Peek upstairs at the revamped studio space for local artists.\nThe Odd's End, in Avondale Estates, is a go-to for absurdities and strange items. (Courtesy of The Odd's End)\n4. Comedians perform FREE shows in the morning\nOne of the best ways to wind down a Saturday night, er… Sunday morning, is at 1AM Secret Show at Smith’s Olde Bar. The best comedians in Atlanta and the occasional out-of-town guest perform for free on the late night/early morning stage. Maria Bamford, Todd Glass and Gary Gulman are just a few of the names that have graced the stage of this under-the-radar performance.\n5. Inman Park has a history of alien activity\nAccording to Georgia Skeptics, a nonprofit that investigates paranormal activity, Inman Park harbored three mysterious crop circles in 1991. According to the official chronicle, “The circles were directly in line with a prominent nearby radio tower. The circle closest to the tower was approximately 24 feet in diameter, and the diameter of the middle circle measured 48 feet. The third circle was the smallest, and featured a ring.” The report also reveals that multiple independent sources concluded the crop circles were genuine.\n» RELATED: First Look: Hampton + Hudson a new Inman Park community bar\n6. The Tabernacle has ties to Gone with the Wind\nThe Tabernacle is Atlanta’s sacred concert venue. In 2008, tornadoes tore through the city, devastating the beloved building. During a labored restoration process, Loews Grand Theatre gifted the location with a magnificent glass chandelier, which hangs above the main stage. According to Patti Davis, of Atlanta Movie Tours, the grand décor embellished the entry of the theatre during the Gone with the Wind premiere in 1939. Restoration Industry Association reports the chandelier’s value as $2 million.\n7. There’s an exclusive skate park in Buckhead\nMost Intown residents know the skate park in Old Fourth Ward, but there’s another park in the city. Da Playground is 15,200 square feet of boarder’s paradise situated under Phipps Plaza. It regularly welcomes up-and-coming visitors and tested talent like Miles Silvas and Paul. Don’t grab your board just yet; the opportunity to skate here is by invitation only.\n8. The CDC isn’t the only organization eradicating diseaseThe Yerkes National Primate Research Center resides on the edge of Lullwater Park, at Emory University. According to the Center, “One of the foremost scientific goals is the development of an HIV/AIDS vaccine that will help end the global epidemic now.” It houses nearly 3,400 primates and 12,000 rodents in two locations, at Emory and in Lawrenceville. Each fall the Lawrenceville location hosts an open house, encouraging the public to embrace their work.\nAt Yerkes Regional Primate Research Center on Emory Campus, researcher Annie Weaver checks on a Capuchin monkey. (AJC photo/David Tulis) 11/95 (DAVID TULIS)\n9. You can make an appointment at Atlanta’s starting point\nOne of the driving forces of Atlanta’s growth was her position as the southern terminus of the Western & Atlantic Railroad. The Zero Milepost was erected in the mid-1800s, about 1 foot wide on each side and 42 inches tall, marking a journey to Chattanooga, 135 miles north. Curious folks can view the actual milepost by appointment in the old Georgia Building Authority structure, but might be disappointed to learn this is not the original location. According to its historical marker, the milepost first stood on the corner of Forsyth and Magnolia Streets.\nEditor's note: An earlier version of this story incorrectly reported that Da Playground is located under Lenox Square Mall. It is located under Phipps Plaza.\nRECOMMENDED VIDEO: A few things you didn't know about \"The Falconettes\"","url":"https://www.ajc.com/entertainment/attractions/things-you-didn-know-about-atlanta/d29HTrWmTow47fgeKltaWK/"}
