{"authors":["Mika Doyle"],"date_download":"2018-10-31 01:43:08","date_modify":"2018-10-31 01:43:08","date_publish":"2018-08-27 22:02:02","description":"If you experience certain symptoms or behaviors because of your anxiety, know that you're not alone. People with anxiety never have to apologize for living with what is actually a really common medical condition, just like diabetes or high blood…","filename":"data/vaneerConsumption/9ThingsPeopleWithAnxietyNeverHaveToApologizeForDoingOutInTheOpen.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/8896bc27-7b03-4389-8a0c-841dbe242f36-bustle_102416_082.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_9-things-people-with-anxiety-never-have-to-apologize-for-doing-out-in-the-open-10236583_1540950188.html","title":"9 Things People With Anxiety Never Have To Apologize For Doing Out In The Open","title_page":"9 Things People With Anxiety Never Have To Apologize For Doing Out In The Open","title_rss":"NULL","source_domain":"bustle.com","text":"If you experience certain symptoms or behaviors because of your anxiety, know that you're not alone. People with anxiety never have to apologize for living with what is actually a really common medical condition, just like diabetes or high blood pressure. In fact, anxiety affects around 40 million adults in the U.S., according to the Anxiety and Depression Association of America. And what's more, women experience anxiety more often than men, according to the National Institute of Mental Health. Sometimes, anxiety can show up when you're out living your daily life, but you never need to apologize for it.\nUnfortunately, the negative stigma of mental illness is real, and it can lead to discrimination and even violence against people with mental illnesses, according to the Mayo Clinic. But the National Alliance on Mental Illness says the lack of exposure and education about mental illness is a major contributor to this stigma, so talking about anxiety and being open about how it affects us day to day is a major first step. And that includes not apologizing for how anxiety affects us. Anxiety doesn’t look the same in everyone, but these are just nine things people with anxiety never need to apologize for doing out in the open.\n1 Talk About Your Anxiety Without Fear Of Judgement Andrew Zaeh for Bustle Anxiety is a medical condition, just like cancer or high blood pressure or diabetes. There's no need to talk about it in hushed tones like it's something to hide.\n2 Say Nothing At All For some people with anxiety, certain situations can render them physically unable to speak, according to the Mayo Clinic. If that happens, it's nothing to be ashamed about, and nothing you need to apologize for.\n3 Have A Panic Or Anxiety Attack Not everyone who lives with anxiety experiences panic or anxiety attacks, but those who do often live in fear of when the next will occur, creating a vicious cycle of anxiety. But if you do experience a panic attack in public, know that it isn't an \"inconvenience\" or \"awkward\" — what's most important is you feeling better.\n4 Get A Little (Or A Lot) Overwhelmed Andrew Zaeh for Bustle Perhaps a less common symptom is that those who live with anxiety can feel easily overwhelmed by everyday activities. A few too many questions or emails at the same time can feel like an avalanche just came crashing on their shoulders. Know that your need to take a time-out is not a burden or an annoyance to others.\n5 Be Indecisive Or Overthink Things Decision-making can be extremely challenging when you unintentionally overthink every situation. Sometimes, this causes the person experiencing anxiety to feel paralyzed by, say, the choice between what movie to see or whether to go out to dinner tonight. It's perfectly OK to pass the decision to someone else or give yourself more time to make a decision.\n6 Cancel Plans Or Decline Invitations Hannah Burton for Bustle Sometimes a person experiencing anxiety just needs time alone, and that means declining a party invitation or cancelling plans you've already made together. There's no need to apologize for prioritizing self-care.\n7 Let Loved Ones Know If You're Exhausted When you're constantly in fight-or-flight mode, it can be flat out exhausting. Activities that seem easy-breezy to people who aren't experiencing anxiety can be pretty taxing to people who are living with anxiety. Your loved ones actually appreciate knowing when you need to get some rest.\n8 Feel Proud For Getting Something Done Knowing what challenges you face on a daily basis, it's totally cool to be proud of yourself for getting everyday tasks done. In fact, we recommend celebrating yourself whenever you can.\n9 Have Anxiety Andrew Zaeh for Bustle One of the main things you should never, ever, ever feel ashamed about doing out in the open? Having anxiety. Full stop.","url":"https://www.bustle.com/p/9-things-people-with-anxiety-never-have-to-apologize-for-doing-out-in-the-open-10236583"}
