{"authors":[],"date_download":"2018-10-30 18:46:02","date_modify":"2018-10-30 18:46:02","date_publish":"2016-12-28 16:57:00","description":"The reflective, small hours of 2016 have arrived. Many are ready to bid it a hearty goodbye. It’s been a year of unprecedented change, of shock, of death.","filename":"data/vaneerConsumption/9unforgettablemomentsthatshookDeKalbCountyin2016.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/04/29/Images/photos.medleyphoto.9565097.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_unforgettable-mo_e387649eaee74ba2f9c7de0caf3b7a74__1540925162.html","title":"9 unforgettable moments that shook DeKalb County in 2016","title_page":"9 unforgettable moments that shook DeKalb County in 2016","title_rss":"NULL","source_domain":"ajc.com","text":"The reflective, small hours of 2016 have arrived. Many are ready to bid it a hearty goodbye. It’s been a year of unprecedented change, of amazement, of disappointment and death.\nDeKalb County saw its share of it all.\nWith that in mind, we look back on some of the moments DeKalb won’t forget (in no particular order):\n1. Clashes at Stone Mountain\nThe beloved attraction’s history as a haven for white supremacy was on display. Through rallies, “white power” groups tried to momentarily reclaim the monument, which has become a destination for metro Atlanta’s diverse population. Tensions rose. Rocks flew. Arrests were made. In another fateful moment, the man who carved the iconic Confederate relief on the side of the mountain died.\nFreaknik revelers bring Lenox Road traffic to a standstill after Lenox Square and Phipps Plaza malls closed early, in 1995. (AJC/file) (JOHN SPINK)\n2. Freaknik\nIt was coming back — that colossal reviled, relished party that choked Atlanta’s streets with decades worth of traffic a couple decades ago. And it was coming to DeKalb County in 2016, with a young promoter planning to host a revival of the event off U.S. Highway 78. But, alas, it wasn’t meant to be.\n3. Officer charged with murder\nNow-former DeKalb County policeman Robert Olsen was indicted in January with murder in the death of an unarmed black man, Anthony Hill. Hill was nude and apparently undergoing a mental health episode when Olsen gunned him down outside a Chamblee-area apartment complex. The community roared, upset with what was seen as a senseless killing. Olsen, who’s said he felt threatened, hasn’t gone to trial.\n4. Gang threat comes into view\nThe sins (alleged and proven) of DeKalb’s gangs are many: a Bloods gang leader was said to have ordered the murder of a baby. Authorities said seven Bloods went on a violent spree that ended in death. A fight among Bloods ended with the murder of a 15-year-old girl walking out of a convenience store. Perhaps most shocking of all, a DeKalb cop was indicted after claiming to be working as a hit man for the Gangster Disciples.\n5. Trump candidacy shakes up Emory\nDuring the presidential race, someone tagged Emory University’s campus with Donald Trump’s name. Much ado was made over the scrawling of “TRUMP” across the campus, though the word was in chalk. Later, after he won the presidency, the university publicly flirted with the idea of being a “sanctuary campus” for undocumented immigrant students.\n6. Dunwoody woman among victims in UGA wreck\nHalle Scott, 19, died in an Oconee County car crash along with three fellow University of Georgia students. The wreck sent shock throughout the state, including Dunwoody, where as many as 1,000 people attended her funeral. “She had the smile to end all smiles,” a Dunwoody High teacher said.\n7. Clinton pummels Trump (in DeKalb)\nWhile losing the national race, Hillary Clinton easily defeated Trump in DeKalb. Clinton got 83 percent of the ballots cast in longtime Democratic stronghold. In one precinct, Wadsworth Elementary in Decatur, only one person voted for Trump.\n8. Stonecrest becomes a city\nVoters decided to create the county’s newest city, a municipality of some 50,000 residents in southeast DeKalb, including areas near Lithonia and Stonecrest Mall. An election is set for March to decide who will lead the city.\n9. CEO makes a brief return\nThe Georgia Supreme Court overturned the convictions of former CEO Burrell Ellis in late November. Ellis had already served his jail time. A new CEO had already been elected and waits to take office in January. But the law is the law: with the conviction overturned Ellis was returned to power as the county’s CEO, if only for a few bizarre weeks.\nRELATED: DeKalb County Schools made plenty news, both good and bad in 2016\nLike DeKalb County News Now on Facebook | Follow on Twitter and Instagram","url":"https://www.ajc.com/news/local/unforgettable-moments-that-shook-dekalb-county-2016/vjh46TiR0wgxLzawUZDhEI/"}
