{"authors":["Anneliese Cooper"],"date_download":"2018-10-30 23:30:15","date_modify":"2018-10-30 23:30:15","date_publish":"2014-08-13 17:27:54","description":"Fall is now approaching all too fast, which means back to school, back to sweatshirts — but also, back to our beloved fall TV line-up. In addition to a handful of premieres, September promises the much-awaited reboots and reworkings of our favorite…","filename":"data/vaneerConsumption/9WaysNewGirlIsSecretlytheSameasItsAlwaysSunnyinPhiladelphia.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/283c1d3a-0c4d-4d30-b5ea-369d8434d268.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35590-9-ways-new-girl-is-secretly-the-same-as-its-always-sunny-in-philadelphia_1540942215.html","title":"9 Ways 'New Girl' Is Secretly the Same as 'It's Always Sunny in Philadelphia'","title_page":"9 Ways 'New Girl' Is Secretly the Same as 'It's Always Sunny in Philadelphia'","title_rss":"NULL","source_domain":"bustle.com","text":"Fall is now approaching all too fast, which means back to school, back to sweatshirts — but also, back to our beloved fall TV line-up. In addition to a handful of premieres, September promises the much-awaited reboots and reworkings of our favorite shows — including the recent and thumbs-up-inducing announcement that It's Always Sunny in Philadelphia star Kaitlin Olson will have a recurring role on New Girl . According to Entertainment Weekly, Olson will play Ashley, the former high school nemesis of Jess and Cece who is now Jess's father's fiancé. If had to guess, I'd say hijinks will ensue.\nMore importantly, however, this casting crossover makes one reflect upon the ways in which New Girl is essentially the slightly more twee, traditional sitcom version of the Always Sunny gang's grimy sociopathy. There's the \"one girl, three (and sometimes four) guys\" dynamic, the bar as a central congregating location, the wacky and insular adventures of a group of 30-somethings' protracted adolescence. In fact, the more I think about it, the more I'm convinced that New Girl is the fully realized \"nicer bar\" from the \"Gang Tries Desperately to Win an Award\" episode, or maybe it's an elaborate dream Sweet Dee is having about her glam L.A. life — that is, assuming her whole plan with the show where she plays a butler didn't quite work out.\nReally, I'm now sincerely hoping, to the point of drafting a petition, that Olson's arc on New Girl is somehow explicitly linked to her character on It's Always Sunny. Maybe she could scrap this whole \"Ashley\" thing and just straight-up play Dee Reynolds, finally making a go of it in Hollywood while dating Jess's dad? It would be like how Buffy characters hopped over to Angel from time to time, or Richard Belzer's Detective Munch smoothly transitioned from Homicide: Life on the Streets to Law & Order: SVU, thus setting up a series of crossover appearances to come (and possibly proving that half of all TV shows take place inside a snowglobe — see: The Tommy Westphall Multiverse hypothesis, then let your reality gently melt into a puddle of confused tears).\nPoint being, at the very least, I now feel it's vitally important to go over all of the reasons that New Girl and Always Sunny are secretly exactly the same — if only, perhaps, to create a \"multiverse\" / dreamscape theory of my own. Who's with me?\nSchmidt = Dennis\njonathanjam on YouTube\ntenntitan55 on YouTube\nThe vanity, the perfectionism, the obsession with sexual prowess, the over-enunciated voice they both use when angry (as above, both directed at youths) — I feel like having Max Greenfield and Glenn Howerton in the same room together would very much be a \"don't cross the streams\"-type moment.\nWinston = Charlie\nBecause really, any storyline involving Winston's affinity for animals and/or utter puzzle incompetency could basically be copy-pasted over to the illiterate inventor of Kitten Mittens. (That part in said puzzle episode when he's wearing a sweatshirt as pants even kind of looks like Charlie's signature long underwear...)\nNick = Mac\nOne-syllable names that end in a \"k\" sound! Plus, both Nick and Mac have questionable relationships with their criminal fathers, a sometime penchant for curmudgeonry that fluctuates with almost childlike wonderment — but really, what's most important here is that both characters profess an obsession with karate.\nMARY ELIZABETH ELLIS = kind of the worst\nI mean, I'm sure she's a lovely woman in real life (case in point, she's married to Charlie Day), but in both the New Girl and It's Always Sunny universes, Ellis plays characters we totally empathize with but also can't help but hate a little, whether as Caroline, Nick's ex-then-almost-lived-with-then-ex-again-girlfriend, or the Waitress, rebuffing Charlie's advances only to pine after Dennis. (Of course, she's under no obligation to date Charlie just because he's persistent, nor is anyone in a similar situation, goes without saying — but still, he proposed to her with a musical! He gave that Brad guy the \"H\" box!)\nElaborate invented drinking games\nWhile I would personally prefer CharDee MacDennis over True American — sad but true, I feel more comfortable eating the raw ingredients of a cake than regurgitating details of American history — the fact is that both these crews apparently have a lot of time on their hands, and a lot of alcohol.\nDesperate attempts to fit in with young people\nFox\nSpeaking of youths, both gangs spend an episode (or two) trying to kick it with folks significantly below their age bracket, whether the frat-related episode of Sunny cited above / Season 1's foray into the dangers of underage drinking, or Schmidt and Jess's attempts to fit in with their new 20-something neighbors.\nTrying to get your parents back together over dinner\nFX\nFor Jess, it's Thanksgiving — for Mac, it's the celebration of his dad leaving prison, combined with Charlie's attempt to woo Frank away from his mother, complete with wine smuggled in tomato sauce jars. Surprisingly, neither event is successful.\nAdventures in Wilderness survival\nAnother New Girl Thanksgiving finds the group out in the woods, only their wits and Nick's threatened manliness to guide them, while on the way to Atlantic City, Frank, Dee, and Charlie spend a stranded roadside afternoon communing with the beast in their own right — the beast, in this case, being a particularly zen rabbit.\nSuspicions that people are serial killers\ncottonzway on YouTube\nWhile Nick stalks and freaks out over Jess' suspicious-seeming creative writing student, the Sunny gang mistakes Mac's secret relationship with Carmen for a murder spree.\nThe Michael Keaton Letters\nFox\nWhen Nick finds himself stuck writing Schmidt letters pretending to be Michael Keaton — is it enough to say that this seems like a plot basically ripped from Sunny's script pages (except that it would, of course, be 100 percent intentional / malicious)? What about the letters Mac writes to Chase Huntley? When Sweet Dee gets catfished by an old woman? Or that episode when Dennis goes to \"rehab\" and meets Sinbad and Rob Thomas? Does that count?\nHey, maybe this would be a good place to start the crossover series!","url":"https://www.bustle.com/articles/35590-9-ways-new-girl-is-secretly-the-same-as-its-always-sunny-in-philadelphia"}
