{"authors":["E. Ce Miller"],"date_download":"2018-10-31 01:43:07","date_modify":"2018-10-31 01:43:07","date_publish":"2018-08-27 22:03:53","description":"Something I love almost as much as reading books is reading what other readers (particularly the seasoned, scholarly, decidedly elbow-patchy kind) have to say about the books I’ve read. In the age of 280-character hot takes, true literary criticism…","filename":"data/vaneerConsumption/9WritersToFollowOnTwitterIfYouWantToThinkMoreDeeplyAboutTheBooksYoureReading.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/24/175727dc-cdc4-4f4e-b8a6-7b43d88b9919-stocksy_txp278d218eep3200_small_1857372.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_9-writers-to-follow-on-twitter-if-you-want-to-think-more-deeply-about-the-books-youre-reading-10075596_1540950187.html","title":"9 Writers To Follow On Twitter If You Want To Think More Deeply About The Books You're Reading","title_page":"9 Writers To Follow On Twitter If You Want To Think More Deeply About The Books You're Reading","title_rss":"NULL","source_domain":"bustle.com","text":"Something I love almost as much as reading books is reading what other readers (particularly the seasoned, scholarly, decidedly elbow-patchy kind) have to say about the books I’ve read. In the age of 280-character hot takes, true literary criticism might seem like something left behind in Gertrude Stein’s Saturday evening salons or, at the very least, in your undergraduate English Lit classroom. And that’s kind of a bummer. Because a good lit critic — especially one whose bookish tastes resemble (and challenge) yours — can be your best friend in the book world. They’ll make you think more deeply about the books you’re reading, save you from reading the ones you’d hate (or, at the very least, you won’t be able to say you weren’t warned) and leave you with a half-dozen other books you’ll want to add to your TBR pile, stat. Their jobs aren’t just to criticize — although a healthy dose of that does a reader good — but also to analyze, interpret, and applaud. And when a true lit critic applauds, you can trust that applause is well-deserved (or, at the very least, supported by diligently cited evidence found within both the text at hand and the larger literary canon.)\nHere are nine literary critics that all book-lovers should follow (or bookmark, or whatever it is you do.) I guarantee you’ll be a better reader for it.\nElaine Showalter Have you ever heard the term \"gynocriticism\"? If so, you can thank literary critic Elaine Showalter. (If not, it’s a style of literary criticism that establishes \"a female framework for the analysis of women's literature.\" Aka: feminist book-reading.) Showalter writes about everything from contemporary fashion to Victorian literature — and she’s not afraid to ruffle a few feathers. Check out her recent piece: \"Imagining Violence: The Power of Feminist Fantasy,\" to see what I mean.\nRuth Franklin I have a hard time finding a magazine I read regularly that Ruth Franklin hasn’t written for. A book critic and former editor at The New Republic, she’s also the National Book Critics Circle Award-winning writer of a biography of American mystery and horror writer Shirley Jackson. Her recent work includes: \"The Female Persuasion Should Be a Literary Breakout. Will It Be?\" And one of my all-time favorite interviews \"Who's Afraid of Claire Messud?\" Check her out. (Oh yeah, and her you can find on Twitter.)\nBethanne Patrick Also known as The Book Maven, Bethanne Patrick is kind of the sh*t. She’s a book critic and writer herself, whose obvious love of literature is I-want-to-squee-all-over-you contagious. She recently took on the work of bestselling novelist Megan Abbott for NPR Books, in \"The Science Of Female Anger And Ambition, In Give Me Your Hand.\" Be sure to give her a heart when you see her.\nMichiko Kakutani Michiko Kakutani might be the most famous lit critic (now retired-ish) of all time — mentioned in both Sex and the City and Girls. The former chief book critic for The New York Times, she became known for reviews that were as scathing as they were culture-making. She also, just recently, published her first book The Death of Truth. About Donald Trump. Because, what else?\nZadie Smith Louisiana Channel on YouTube You definitely know her for her novels, like her bestseller, White Teeth, her more recent novel, Swing Time, or her 2018 essay collection, Feel Free. But did you also know that Zadie Smith is has written some equally compelling literary criticism as well? Start with her essay for The New York Review Of Books: Two Paths for the Novel.\nJanet Maslin Former Times film critic and more recently book critic, Janet Maslin is known for being one step ahead of the latest book buzz (in fact, she was the first reporter to review the pseudonymous Elena Ferrante for The New York Times.) Recently she’s tackled the Bill Clinton/James Patterson team-up, The President is Missing, and CNN news anchor Jake Tapper’s novel The Hellfire Club. She’s concise, witty, and not afraid to tell you like it is when it comes to literature.","url":"https://www.bustle.com/p/9-writers-to-follow-on-twitter-if-you-want-to-think-more-deeply-about-the-books-youre-reading-10075596"}
