{"authors":["Matthew Debord"],"date_download":"2018-10-30 23:24:21","date_modify":"2018-10-30 23:24:21","date_publish":"2016-12-07 00:00:00","description":"There's a war being fought in America's bedrooms, and it's between those who sleep and those who insist they don't need to.","filename":"data/vaneerConsumption/AAAnotenoughsleepdrivingstudy.json","image_url":"https://amp.businessinsider.com/images/58481bdcba6eb6771b8b7b5b-480-240.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_aaa-not-enough-sleep-driving-study-2016-12_1540941861.html","title":"AAA not enough sleep driving study","title_page":"    AAA not enough sleep driving study - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Don't yawn and drive. AAA There's a war being fought in America's bedrooms, and it's between those who sleep and those who insist they don't need to.\nAt certain high executive and entrepreneurial levels, getting far less that eight hours in the sack is considered a badge of honor.\nBut unless you have access to a private driver, getting behind the wheel after your nocturnal catnap greatly increases your chances of being in a car crash.\nThat's the verdict from a new study released the the AAA Foundation for Traffic Safety.\n\"Drivers who had slept for less than 4 hours, 4-5 hours, 5-6 hours, and 6-7 hours in the past 24 hours had an estimated 11.5, 4.3, 1.9, and 1.3 times the crash rate, respectively, of drivers who had slept for 7 hours or more in the past 24 hours,\" according to the study.\n\"In an alternative analysis of drivers' usual daily hours of sleep and sleep in the past 24 hours relative to their own usual amount of sleep, drivers who reported that they usually slept for 4-5 hours daily had 5.4 times the crash rate of drivers who reported that they usually slept for 7 hours or more; drivers who reported that in the past 24 hours they had slept for 1-2 hours less than usual, 2-3 hours less than usual, 3-4 less than usual, and 4 or more hours less than usual had 1.3, 3.0, 2.1, and 10.2 times the crash rate, respectively, of drivers who reported that they had slept for at least their usual amount.\"\nYou chances of getting into one of these is increased if you don't sleep. Via Wikimedia Commons\nThe study's methodology was rigorous. \"Logistic regression was used to estimate odds ratios adjusted for potential confounding by driver age, driver sex, driver license status, driver illness, medical diagnosis of sleep apnea, recent change in sleep schedule, trip length, vehicle type, day of week, time of day, and several roadway-related variables,\" the author, Senior Research Associate Brian C. Tefft wrote.\nThis is an alarming instance of the dangerous connection between a fallible physical system — the human body — and a complicated machine that can weight several tons and easily travel 100 miles per hour. People who drive often, especially morning and evening commuters, need to understand that operating a car is an activity that should be prepared for.\nAs with good workplace and athletic performance, getting enough sleep is a critical basic, the AAA study strongly suggests.","url":"https://www.businessinsider.com/aaa-not-enough-sleep-driving-study-2016-12"}
