{"authors":[],"date_download":"2018-10-30 19:42:39","date_modify":"2018-10-30 19:42:39","date_publish":"2018-10-30 19:21:18","description":"We’re at the final week of the regular season and the Class AA state playoff seedings are near...","filename":"data/vaneerConsumption/AAinbriefAbreakdownofregionstandingstiebreakersetc.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/29/Images/Football%20FG%20post.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_high-school-sports_bri_bcd772caa15e278f0bded727a3b2c6e8__1540928559.html","title":"AA in brief: A breakdown of region standings, tiebreakers, etc.","title_page":"AA in brief: A breakdown of region standings, tiebreakers, etc.","title_rss":"NULL","source_domain":"ajc.com","text":"We’re at the final week of the regular season and the Class AA state playoff seedings are nearly complete. We may not know exactly what the playoff picture will be even after Friday’s games, as the final standings could come down to region tiebreakers. The top four teams from each region qualify for the state tournament, and a total 32 AA teams will have the opportunity to realize the ultimate goal of reaching Mercedes-Benz Stadium and winning a state title.\nBelow is a look at the standings for each AA region heading into Week 12. All records posted are region records.\nRegion 1\nCurrent standings: Brooks County (3-0), Fitzgerald (3-1), Early County (1-2), Thomasville (1-2)\nOutlook: Brooks County has already clinched 1-AA, having beaten Fitzgerald last week. Fitzgerald has locked up the No. 2 spot and home-field advantage in the first round. Thomasville and Early County will play on Friday to determine the No. 3-4 spots.\nRegion 2\nCurrent standings: Swainsboro (5-0), Vidalia (4-1), Toombs County (3-2), Jeff Davis (2-3), Metter (2-3), Bacon County (2-3)\nOutlook: Swainsboro has locked up the region championship, having beaten Vidalia, which has locked up the No. 2 spot. Toombs County will need to upset Swainsboro to clinch the No. 3 spot, otherwise it will fall into a tie with the winner of Metter-Jeff Davis and Bacon County, should it upset Vidalia. If the Bacon County upset occurs and Swainsboro wins, Toombs County and Bacon County will be 3-3, and one of Jeff Davis and Metter would be 3-3, putting the region tiebreaker at play for the Nos. 3-4 spots. The final standings would be decided by mini-games played at Vidalia on Monday, Nov. 5. However, if Toombs County and Bacon County lose, Jeff Davis gets the No. 3 seed if it wins, with Toombs County getting No. 4. If Metter wins, it gets the No. 4 seed, and Toombs County gets No. 3.\nRegion 3\nCurrent Standings: Dublin (5-0), Dodge County (5-1), Washington County (4-1), Northeast-Macon (2-3), Bleckley County (1-4), Southwest-Macon (1-4)\nOutlook: This region has a lot left to be decided, with many possible outcomes. Let’s start with the easiest explanation for the top three spots. If Dublin beats Washington County on Friday, it is the region champs, Dodge County takes second place and Washington County takes third. However, if Washington County wins, those three teams would be 5-1, with Dublin losing to Washington County, Washington County losing to Dodge County and Dodge County losing to Dublin.\nThe tiebreaker for 3-AA is a plus-minus 15 points system. How it works: the margin of victory among the matchups of the three teams equals the amount of points they earn, but is capped at 15. For example Dublin beat Dodge County 34-10 on Oct. 5, so it earned 15 points (the maximum a team can earn), while Dodge County accrued minus-15 points. Dodge County then beat Washington County 20-6 on Oct. 15, earning 14 points against its -15, so its final plus-minus score is -1. Washington County sits at -14, so it would need to beat Dublin by 15 or more to win the region. In other words, Dublin can still lose the game and win the region —as long as it doesn’t lose by 15 — and the final standings will be the same — 1) Dublin, 2) Dodge County, 3) Washington County. However, if Washington County does win by more than 15, the standings will go 1) Washington County, 2) Dublin, 3) Dodge County. The points system is used only to determine first place. Once that’s determined, the two remaining schools use their head-to-head record. Dublin would take second because of its head-to-head win over Dodge County.\nNortheast-Macon has already clinched the final playoff spot, even if it loses and finishes with the same record as the winner of the Southwest Macon vs. Bleckley County game. That’s because Northwest has already beaten both of those teams.\nRegion 4\nCurrent standings: Jefferson County 7-2, Hephzibah (7-1), Harlem (5-2), Screven County (5-2)\nOutlook: Jefferson County has locked up the region with its win over Hephzibah, which has locked up the No. 2 seed. Harlem owns the tiebreaker over Screven County so as long as it beats Westside-Augusta (1-6), it owns No. 3 seed.\nRegion 5\nCurrent standings: Heard County (5-0), Callaway (5-1), Bremen (4-1), Spencer (2-3), Lamar County (1-4), Jordan (1-4)\nOutlook: So long as Heard County beats Bremen on Friday, it wins the region, Callaway takes second and Bremen takes third. However, if Bremen wins, there will be a three-way tie, with Bremen beating Heard County, Heard County beating Callaway and Callaway beating Bremen. In that scenario, the tiebreaker used to determine seeding will be a points system based on non-region opponents. The points system is used only to determine first place. Once that’s determined, the two remaining schools use their head-to-head record.\nHow the points system works: if a 5-AA school wins against a non-region opponent, it takes the non-region opponent’s win total and multiplies it by that opponent’s classification. For example, Callaway beat LaGrange on Aug. 31. LaGrange finished the season with one (1) win and plays in Class AAAA, so 1x4 = 4; Callaway earned four (4) points for that win. Bremen finished atop the non-region points standings, so if it beats Heard County, it takes No. 1 based on non-region points, and Heard County takes No. 2 because it beat Callaway head to head.\nFor the final playoff spot, if Spencer beats Jordan, it’s in. However, a Jordan win coupled with a Lamar County win over Temple (0-5) would create a three-way tie between Jordan, Spencer and Lamar County, with Jordan beating Spencer, Lamar County beating Jordan, and Spencer beating Lamar County. In that scenario, Lamar County takes the No. 4 spot because it won the non-region points standings. If Jordan wins and Lamar County loses, Jordan takes the final playoff spot.\nRegion 6\nCurrent standings: Hapeville Charter (6-0), Douglass (6-1), Washington (5-2), South Atlanta (3-3), B.E.S.T. Academy (3-3)\nOutlook: Hapeville Charter is the region champion, Douglass is No. 2, and Washington is No. 3. Unless a the biggest upset of the regular season occurs, B.E.S.T. will lose to Hapeville Charter on Friday, so South Atlanta is assured the No. 4 seed even with a loss, as it beat B.E.S.T. head-to-head. Technically, if B.E.S.T. wins and South Atlanta loses, B.E.S.T takes the No. 4 spot, but that’s not happening.\nRegion 7\nCurrent standings: Rockmart (6-0), Chattooga (5-1), Pepperell (5-1), Coosa (3-3), Gordon Central (2-4), Model (2-4)\nOutlook: Rockmart is the region champ. Chattooga and Pepperell play on Friday to determine second and third place. Coosa and Gordon Central play for the final playoff spot. Model is out — even if it miraculously beats Rockmart (that won’t happen) — because it already lost to Gordon Central and Coosa.\nRegion 8\nCurrent Standings: Union County (6-0), Rabun County (6-0), Elbert County (4-2), Banks County (3-3), Monticello (3-3)\nOutlook: Union County and Rabun County play Friday to decide the 8-AA champion. Elbert County can clinch the No. 3 seed with a win over Banks County. If Banks County wins, it would need Monticello to lose to Social Circle to claim the No. 3 spot. In that case, Elbert County would take the No. 4 spot, as it beat Monticello.\nHowever, if Banks County and Monticello win, Banks County, Elbert County and Monticello will be 4-3, with Elbert County losing to Banks County, Banks County losing to Monticello and Monticello losing to Elbert County. In that case, the tiebreaker is decided by a plus-minus 12 system, which uses the same principles as the plus-minus 15 system in Region 5 (explained above). As it stands, Elbert County sits at plus-12, Banks County sits at minus-3 and Monticello sits at minus-9. If Elbert County loses by less eight, it takes the No. 3 seed and Monticello would take the No. 4 spot because of its head-to-head win over Banks County. If Elbert County loses by eight or more, Banks County takes No. 3 and Elbert County takes No. 4 because of its win over Monticello.\n---\nFor just the second time all season, there was no change to the top 10, as nine of the ranked teams won, while the other — Dublin — was on a bye.\nFor a recap of Friday’s ranked games, go here.\nOn Saturday, the top-ranked Hapeville Charter Hornets allowed a region opponent to score on them for the first time this season, though they won 31-6 over Washington. With the win, they officially clinched their third consecutive 6-AA title and improved to 8-1, 6-0.\nPrep Sports Nation has highlights of the Hornets’ win.\nBelow are the updated rankings, with the team’s previous week’s ranking in parenthesis:\n1. (1) Hapeville Charter (7-1)\n2. (2) Rockmart (9-0)\n3. (3) Heard County (7-2)\n4. (4) Callaway (8-2)\n5. (5) Bremen (8-1)\n6. (6) Rabun County (8-1)\n7. (7) Brooks County (7-2)\n8. (8) Dublin (8-1)\n9. (9) Dodge County (9-1)\n10. (10) Washington County (8-1)\nIn brief :\nFollow the AJC’s Class AA coverage on Twitter.","url":"https://www.ajc.com/blog/high-school-sports/brief-breakdown-region-standings-tiebreakers-etc/3mE9VWWH2FciGITMCP0CzM/"}
