{"authors":["Katie Storey For Mailonline"],"date_download":"2018-10-23 03:01:16","date_modify":"2018-10-23 03:01:16","date_publish":"2017-03-10 12:20:18","description":"He's been at loggerheads with Lewis Bloor ever since the TOWIE star split with his Geordie Shore co-star Marnie Simpson last month amid allegations of cheating.","filename":"data/vaneerConsumption/AaronChalmersreigniteshisTwitterfeudwithLewisBloor.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/22/3E26948600000578-0-image-a-11_1489185974892.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300616_Marnie-Simpson-poses-stark-naked-exes-reignite-feud_1540263676.html","title":"Aaron Chalmers reignites his Twitter feud with Lewis Bloor","title_page":"Aaron Chalmers reignites his Twitter feud with Lewis Bloor | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's been at loggerheads with Lewis Bloor ever since the TOWIE star split with his Geordie Shore co-star Marnie Simpson last month amid allegations of cheating.\nBut just as reality fans thought the feud might be simmering down, Aaron Chalmers laid into the ex-TOWIE star on Twitter yet again on Thursday night.\nThe tattooed star was seen taunting Lewis on Twitter - jokingly reporting him as a 'missing person'.\nFeud: Marnie Simpson split from Lewis Bloor amid cheating allegations\nThe former TOWIE star had challenged Aaron to a charity boxing match, after he hit out at Lewis on Twitter when it was revealed the Essex star had cheated on Marnie during their 'romantic' trip to Barcelona last year.\nNow Lewis has gone quiet after squaring up to Aaron online and the Geordie Shore star couldn't resist mocking him on Thursday evening because of it.\nTaunting Lewis for not following through on his remarks about a boxing fight, Aaron took a very public swipe at the now turned personal trainer.\nStirring trouble: Geordie Shore star Aaron Chalmers had taunted Marnie Simpson's cheating ex Lewis Bloor on Twitter again on Thursday night\nMissing person: The Geordie Shore star couldn't resist mocking Lewis for going quiet on his proposition of a charity fight\nHe tweeted: 'MISSING PERSON @lewis_bloor hasn't been seen or heard from since his outburst over a week ago!!\n'Any1 (sic) sees this b**** please report to me.'\nAaron added: 'LAST SEEN outside kings cross selling 6 min belly blitz DVDs and also a hand bag with nothing it in (MARNIES).'\nLewis is yet to respond to Aaron and MailOnline have reached out to a representative for him for comment.\nAll over: Marnie Simpson confirmed her split with the Essex star after he was caught cheating on Valentine's Day\nAaron's latest dig at Lewis comes after he previously accused the Celebrity Big Brother contestant of 'sponging' money off Marnie.\nMarnie had previously claimed Lewis took the money from her, later retracting her comments and insisting they were not true.\nShe clarified: 'Lewis did not take 25k from me it's unfair for me to let people think that as it's not true.\n'A lot of things have been fabricated through hate and callus.'\nHowever, Aaron had already taken aim at Lewis before the Geordie beauty could set the record straight.\nMore heartbreak: The reality beauty later found out Lewis had been unfaithful on more than one occasion - including on a trip they had taken together to Barcelona\nLocking horns: Aaron had a fiery response to disgraced star Lewis' public apology to his ex girlfriend Marnie\nAaron tweeted Lewis directly, after he had posted a public apology to Marnie for his infidelity, with a fiery response: 'Why don't you start by paying back some of the the 20-25k you sponged off her?'\nLewis replied: 'The day you get back from Australia. We fight. Come on kid what you gonna do.’\nMeanwhile, Marnie has spoken out against her exes going head-to-head on Snapchat and insisted she 'won't let' a fight occur.\nWhile she has vowed 'never to speak' to Lewis again, Marnie admitted she has been mulling over the possibility of reconciling with her reality star ex.\nHappier times: Chloe Ferry's best friend and Lewis made a picture perfect couple while attending a fundraising gala in December last year - romance blossomed for the pair on CBB\nShe penned her relationship woes in her latest column with Star magazine and revealed she is unsure whether she'll be able to forgive Lewis for his infidelities if they did get back together.\n'It’s hard to say if I’ll take Lewis back because I don’t know if I’m strong enough to forgive him,' Marnie said. 'I do still love him even though he’s hurt me.'\nHer relationship with Lewis was rocked by a video that emerged of her beau kissing another girl during a wild night on Valentine's Day.\nMarnie took to Twitter to confirm their split hours after the clip emerged, writing: 'Didn't really want the whole country to know but looks like that didn't last long. Happy Valentine's Day to me. U f***ing scumbag.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300616/Marnie-Simpson-poses-stark-naked-exes-reignite-feud.html"}
