{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:00:31","date_modify":"2018-10-30 21:00:31","date_publish":"2016-11-29 23:40:18","description":"TEL AVIV — Palestinian President Mahmoud Abbas was re-elected to lead the Fatah party for the next five years at its first congress in seven years on Tuesday. | Israel / Middle East","filename":"data/vaneerConsumption/AbbasUnanimouslyElectedToLeadFatahForAdditional5Years.json","image_url":"https://media.breitbart.com/media/2016/10/wi/ap/20/1e6ktki-mahmoud-abbas_photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_11_29__1540933231.html","title":"Abbas Unanimously Elected To Lead Fatah For Additional 5 Years","title_page":"Abbas Unanimously Elected To Lead Fatah For Additional 5 Years | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV — Palestinian President Mahmoud Abbas was re-elected to lead the Fatah party for the next five years at its first congress in seven years on Tuesday.\nThe Ramallah-based convention brought just under 1,400 delegates together who were asked by the Palestinian National Council chairman to collectively elect Abbas “by consensus.”\nPalestinian parliamentary elections have not been held since 2006, a year after Abbas succeeded Yasser Arafat as president of the PA. Abbas’ term officially ended in 2009 but he hasn’t called for elections in over a decade. The long-awaited municipal elections, which were set to take place last month, were also postponed indefinitely. The delays are primarily due to fear of another election defeat by rival group Hamas.\nAt the opening of the five-day Fatah congress, the 81-year-old Abbas addressed the crowd: “You today, in these historic times, are living the writing of modern history.”\nHe added his praise of Fatah’s founders and the “martyrs who died along the path towards freedom and independence.”\nThe party congress was originally set to take place in 2014 but was delayed because of internal disputes.\nCritics regard the congress as a way for Abbas – whose ratings are at an all-time low – to sideline political opponents, and in particular his longtime political rival Mohammad Dahlan.\nAnyone with any connections to Dahlan, who is currently in exile in the UAE, was excluded from taking part in the congress. Jihad Tummaleh, a Fatah official who was ousted from the party because of his alleged affiliation with Dahlan, said he and other Fatah leaders will ignore any decisions taken by the congress.\n“We won’t recognize the decisions. This is an exclusionary conference. The results of the conference are not legitimate, including the election of the central committee,” Tummaleh said.\nDimitri Diliani, a senior member of Fatah’s revolutionary council, said he and dozens of others were not invited to the congress because “we bring a different voice.”\nAccording to Diliani, a separate meeting of Fatah dissidents scheduled to take place the same day was called off after security services issued death threats.","url":"https://www.breitbart.com/middle-east/2016/11/29/abbas-unanimously-elected-to-lead-fatah-for-additional-5-years/"}
