{"authors":[],"date_download":"2018-10-22 20:43:34","date_modify":"2018-10-22 20:43:34","date_publish":"2014-06-02 15:05:47","description":"Move is a major step toward ending a crippling split, but also set the stage for new friction with Israel and possibly with the West.","filename":"data/vaneerConsumption/AbbasHamasCreateConsensusPalestinianGovernment.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/481466/140602-abbas-jsw-1055a_27b1c5c975c386dd2229418ace5b5c96.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_abbas-hamas-create-consensus-palestinian-government-n120281_1540241014.html","title":"Abbas, Hamas Create Consensus Palestinian Government","title_page":"Abbas, Hamas Create Consensus Palestinian Government","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nRAMALLAH West Bank — President Mahmoud Abbas swore in a Palestinian unity government on Monday in a reconciliation deal with Hamas Islamists that set Israel on a collision course with Washington over U.S. pledges to work with the new administration while Israel shunned it.\nAbbas, whose Palestinian Authority in the Israeli-occupied West Bank depends on foreign aid, appeared to have banked on Western acceptance of a 16-member cabinet of what he described as politically unaffiliated technocrats.\nSetting a policy in line with U.S. and European Union demands, the Western-backed leader said his administration would continue to honor agreements and principles at the foundation of a peace process with Israel.\nHamas, which advocates Israel's destruction, has run the Gaza Strip since seizing the territory from Abbas's Fatah forces in a brief civil war in 2007. Numerous reconciliation efforts, largely brokered by Egypt, have failed over power-sharing.\n\"Today, and after announcing the government of national unity, we declare the end of division that caused catastrophic harm to our cause,\" Abbas said, voicing sentiments widely shared by Palestinians, as ministers took the oath of office in a ceremony in the West Bank city of Ramallah.\nIsrael predictably shunned the deal. It barred three Gaza-based ministers from traveling to the West Bank to be sworn in and reaffirmed a decision to freeze U.S.-brokered peace talks made in April, when initial steps toward Palestinian unity were taken.\nThe U.S. State Department, however, said it would work with the new government and cautiously pledged to continue to disburse aid to the Palestinians while monitoring its policies, drawing Israeli anger.\n\"It appears that President Abbas has formed an interim technocratic government that does not include ministers affiliated with Hamas,\" State Department spokeswoman Jen Psaki said in Washington.\n\"But we will continue to evaluate the composition and policies of the new government and calibrate our approach accordingly,\" Psaki said.\nIsrael's ambassador in D.C., said his country was \"deeply disappointed\" by the move and the U.S. passive stance.\n\"Israel is deeply disappointed with the State Department's comments today on the Palestinian unity government with Hamas, a terrorist organization responsible for the murder of many hundreds of Israelis, fired thousands of rockets at Israeli cities, and which remains committed to Israel's destruction,\" said Ambassador Ron Dermer in a statement.\nPrime Minister Benjamin Netanyahu's security cabinet met in emergency session after the deal and threatened to hold Abbas accountable for any attacks against Israel, alluding to sporadic rocket fire from Gaza to which Israel has thus far responded by bombing militant strongholds in the coastal territory.\n\"The agreement with Hamas makes Abbas directly responsible for any terrorist activity from Gaza,\" said a statement from the Israeli government summing up the ministers' meeting.\nIsmail Haniyeh, the outgoing Hamas prime minister in Gaza, said that \"we are starting new era, based on unity and partnership in decision-making and work.\"\n— Reuters","url":"https://www.nbcnews.com/news/world/abbas-hamas-create-consensus-palestinian-government-n120281"}
