{"authors":["Jack Tonhaben"],"date_download":"2018-10-30 20:57:39","date_modify":"2018-10-30 20:57:39","date_publish":"2017-01-31 13:50:38","description":"PA President Mahmoud Abbas told African nations Israel was doing “whatever possible” to prevent the creation of an independent Palestine.","filename":"data/vaneerConsumption/AbbasCallsOnAfricanNationsNotToForgeTiesWithIsraelAtPalestiniansExpense.json","image_url":"https://media.breitbart.com/media/2016/09/mahmud-abbas.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_01_31__1540933059.html","title":"Abbas Calls On African Nations Not To Forge Ties With Israel At Palestinians’ Expense","title_page":"Abbas Calls on African Nations Not to Forge Ties with Israel at Palestinians' Expense","title_rss":"NULL","source_domain":"breitbart.com","text":"JERUSALEM – Palestinian Authority President Mahmoud Abbas on Monday told African nations that Israel was doing “whatever possible” to prevent the creation of an independent Palestinian state and will eventually impose an apartheid system on the Palestinians.\nAddressing the 28th summit of African Union nations in Adis Ababa, Abbas said that any change in the status quo in Jerusalem and the West Bank may undermine chances of peace and stability in the region, according to the Palestinian WAFA news agency.\nHis comment about Jerusalem was likely directed at the White House, which is mulling a move of the U.S. embassy from Tel Aviv to Jerusalem.\nThe PA president may also have been referring to Israel’s green lighting of the construction of additional housing in eastern Jerusalem and the West Bank.\nAbbas called upon the international community to enforce Security Council resolution 2334, which condemned Israeli settlements and described them as destructive to the two-state solution.\nHis talk at the AU comes just a few months after Prime Minister Benjamin Netanyahu concluded a successful tour of African nations.\nIn his visit to Ethiopia on Monday, Abbas urged African leaders not to renew their ties with Israel at the expense of the Palestinian cause.\n“We know that you have interests and that Israel is seeking to make relations with the states of your continent,” Abbas told the African leaders. “But we urge you that this should not be done at the expense of the just cause of our Palestinian people, which still needs your help to get rid of the abhorrent Israeli occupation.”\nDuring Netanyahu’s tour of Africa in July, he visited four countries in Eastern Africa and met with seven heads of state. In September, Netanyahu held a meeting with more than 15 African leaders on the sidelines of the United Nations General Assembly in New York.\nThen in early December, top officials from more than a dozen African countries came to Israel for a three-day conference on agricultural technology.\nThe delegates to the conference included foreign ministers from Nigeria, Togo, Liberia, Guinea, Cape Verde, Gambia, and Sierra Leone; and senior officials from Benin, Burkina Faso, Ivory Coast, Ghana, Guinea-Bissau, and Senegal.\nThe conference, titled “Enhancing Sustainable Agricultural Productivity in Arid and Semi-Arid Regions,” was co-organized by Mashav, Israel’s Agency for International Development Cooperation, and the Economic Community of West African States, known as ECOWAS.","url":"https://www.breitbart.com/middle-east/2017/01/31/abbas-calls-african-nations-not-forge-ties-israel-palestinians-expense/"}
