{"authors":[],"date_download":"2018-10-30 20:56:22","date_modify":"2018-10-30 20:56:22","date_publish":"2015-02-03 14:36:06","description":"euters) - Palestinian President Mahmoud Abbas has ordered an investigation into a cartoon apparently depicting the Prophet Mohammad in an official Palestinian newspaper. |","filename":"data/vaneerConsumption/AbbasOrdersProbeintoPalestinianMohammedCartoon.json","image_url":"https://media.breitbart.com/media/2014/12/upi_BETHLEHEM1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_03__1540932982.html","title":"Abbas Orders Probe into Palestinian Mohammed Cartoon","title_page":"Abbas Orders Probe into Palestinian Mohammed Cartoon | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"euters) – Palestinian President Mahmoud Abbas has ordered an investigation into a cartoon apparently depicting the Prophet Mohammad in an official Palestinian newspaper.\nThe move came less than a month after Abbas joined world leaders in a march for free speech in Paris following a deadly attack by Islamist gunmen on the French satirical weekly Charlie Hebdo, which had caricatured Mohammad.\nA drawing in the West Bank-based newspaper al-Hayat al-Jadidah on Sunday showed a robed man standing astride Earth and reaching into a heart-shaped pouch to sow seeds of love around the world. The caption reads: “Our Prophet Mohammad”.\nArtist Mohammed Sabanneh, a Muslim, said he meant no harm. The figure was not Mohammad but “a symbol of humanity enlightened by what the Prophet Muhammad brought,” he wrote on Facebook.\nIslam frowns on any depictions of its most revered prophet. Strict interpretations of Islamic scripture ban drawing any sentient beings, although court artists in past centuries drew Mohammad in illuminated manuscripts.\nIn a report late on Monday, the official Palestinian news agency WAFA said Abbas had ordered “an immediate investigation.”\nRead the full story at Reuters.","url":"https://www.breitbart.com/national-security/2015/02/03/abbas-orders-probe-into-palestinian-mohammed-cartoon/"}
