{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-23 02:07:14","date_modify":"2018-10-23 02:07:14","date_publish":"2017-03-16 12:32:58","description":"The 31-year-old beauty stopped by the ITV studios on Thursday to chat to Holly Willoughby and Phillip Schofield about her family life with husband Peter Crouch and their two daughters.","filename":"data/vaneerConsumption/AbbeyClancytalksmotherhoodandsaysshesbroody.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E5476C700000578-0-image-a-147_1489671363138.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319996_Abbey-Clancy-talks-motherhood-says-s-broody_1540260434.html","title":"Abbey Clancy talks motherhood and says she's broody","title_page":"Abbey Clancy talks motherhood and says she's broody | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's back on our screens as the host of Britain's Next Top model this week.\nAnd Abbey Clancy stopped by the ITV studios on Thursday to chat to Holly Willoughby and Phillip Schofield about the brand new series of the modelling show and her family life with husband Peter Crouch and their two daughters, Sophia and Liberty.\nThe 31-year-old beauty candidly confessed that while motherhood is her toughest job to date, she would love to expand her brood.\nScroll down for video\nTell all interview: Abbey Clancy stopped by the ITV studios on Thursday to chat to Holly Willoughby and Phillip Schofield\nDiscussing the difficulties of striking the right work/life balance, Abbey said: 'It's something you've got to do. I like it. It's a nice break [going to work]!'\nHer comment prompted Phil to joke that he had gone to extreme measures to ensure his co-host Holly wouldn't miss any more work due to maternity leave.\nReferring to the mother-of-three's husband, he quipped: 'I snuck in [to her house] one night and gave Dan the snip - he still doesn't realise!'\nAbbey enthused: 'I'd love another. It's hard work... but it's life changing and its fun. Pete's happy [with two]... but I'd like more!'\nFamily life: Discussing the difficulties of striking the right work/life balance, Abbey said, 'It's something you've got to do. I like it. It's a nice break [going to work]!'\nAbbey enthused: 'I'd love another. It's hard work... but it's life changing and its fun. Pete's happy [with two]... but I'd like more!'\nThe star revealed that her footballer husband has been trying to get their eldest daughter Sophia, six, into tennis due to her tall frame.\nHowever, it seems unlikely the youngest will be taking after her famous father in the sports department.\nAbbey explained: 'Pete was really keen to get Sophia into sport - because he's got two girls.\nFuture sports star: The star revealed that her footballer husband has been trying to get their eldest daughter Sophia, six, into tennis due to her tall frame\nBest job ever: The 31-year-old beauty candidly confessed that while motherhood is her toughest job to date, she would love to expand her brood\n'He took her into a tennis lesson and she had a meltdown because she had to wear a tracksuit, she wasn't having it!'\nDiscussing her youngest child, 21-month-old Liberty, she said: 'I think the baby is going to be a shot-putter. She’s just a little monkey!'\nAbbey also discussed the upcoming series of BNTM, which debuts this Thursday night, and the media attention surrounding the competition's first ever transgender contestant, Talulah-Eve Brown.\nDiscussing her youngest child, 21-month-old Liberty, she said: 'I think the baby is going to be a shot-putter. She’s just a little monkey!'\nNew series: Abbey also discussed the upcoming series of BNTM, which debuts this Thursday night\nOuch: Poor Abbey was battling with jaw ache during her TV appearance, having just had her wisdom tooth removed\nThe model host said: 'She was picked solely on the way she looked and her personality, she had the most incredible skin and bone structure.\n'We only found out she was transgender afterwards, when she told the girls in the house.\n'She's inspirational and she's been empowering women - it's all about different girls and visions of beauty.'\nLooking good: Abbey was dressed to impress in a slinky, lace embellished jumpsuit\nGlamorous girl: The stunning star stuck to an elegant, all-black ensemble for the occasion\nPoor Abbey was battling with jaw ache during her TV appearance, having just had her wisdom tooth removed.\nShe wailed: 'I can’t laugh because of my wisdom tooth. I’m laughing at you two and my face is killing! Stop making me laugh.'\nFans took to social media to express their delight at the beauty queen's interview, lauding her with compliments about her looks and bubbly personality.\nStunner: Fans took to social media to express their delight at the beauty queen's interview, lauding her with compliments about her looks and bubbly personality","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319996/Abbey-Clancy-talks-motherhood-says-s-broody.html"}
