{"authors":["Megan Pustetto For Daily Mail Australia"],"date_download":"2018-10-22 20:10:11","date_modify":"2018-10-22 20:10:11","date_publish":"2016-01-28 00:27:36","description":"It is one of the most iconic American brands, famed for it's risque campaigns which always feature a slew of famous faces posing for erotically charged images.","filename":"data/vaneerConsumption/AbbeyLeeKershawtoplessinnewCalvinKleinSpring2016campaign.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/27/22/30A3F34C00000578-0-image-a-17_1453932005700.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420081_Abbey-Lee-Kershaw-dares-bare-poses-topless-racy-new-Calvin-Klein-Spring-2016-campaign_1540239011.html","title":"Abbey Lee Kershaw topless in new Calvin Klein Spring 2016 campaign","title_page":"Abbey Lee Kershaw topless in new Calvin Klein Spring 2016 campaign | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It is one of the most iconic American brands, famed for it's risque campaigns which always feature a slew of famous faces.\nAnd the latest Calvin Klein adverts continue certainly doesn't disappoint with a whole host of famous faces posing in provocative shots.\nAmong them is Australian actress, model Abbey Lee Kershaw who flashes her flesh by posing topless for the Spring 2016 campaign.\nScroll down for video\n'I am free': Australian actress, model and musician Abbey Lee Kershaw dares to bare, posing topless for iconic American brand Calvin Klein in their Spring 2016 campaign\nCupping her bare breasts, the 28-year-old shoots a sultry look towards the lens as she raises her other arm up over her head.\nWrithing her body forward to curve her back, she flaunts her impressively svelte figure whilst posing side on.\nThe only item of clothing the Max Mad: Fury Road actress wears is a pair of blue denim jeans which finish just below her navel.\nSporting a minimal application of makeup over her prominent features including a soft rouge lip, the Melbourne-born stunner leaves onlookers bowled over by her natural beauty.\nDefined: Kendall Jenner showed off her chiseled upper body in the campaign\nAbbey Lee shared a sneak peek at the photo series for the American fashion house earlier that day, posting the new image to her Instagram page.\n'I am FREE,' she captioned the racy shot.\nAbbey Lee stars in the campaign alongside a host of famous stars, including Kendall Jenner, Justin Beiber, FKA Twigs and Kendrick Lamar who smoulder against a bright sunset.\nThe talented lot all feature in the campaign shot by photographer and filmmaker Tyrone Lebon which aims to take the popular label out of the bedroom with the call to action, 'I ______ in #mycalvins'.\nIn their individual posters the stars fill in the blank space in their own unique way.\nAbs-tastic: Justin Bieber teased at his Calvins waistband as he posed with his shirt open\nKendall flashes her well-defined abs in the image, sporting a set of sporty black bra and undies with a slogan plastered across her chest that reads: 'I stand tall in #mycalvins'\nMusician Justin, meanwhile, 'glows' in his Calvins.\nWith his platinum tresses tossed over on one side, the 21-year-old wears an open shirt that teases his heavily tattooed torso and his all-important black Calvin briefs.\nFamous faces: The campaign images, which also feature FKA twigs, run alongside a video campaign for the global Spring 2016 ad\nFirst time: Kendrick Lamar models denim, making it the first time that each of the Calvin Klein brands – Calvin Klein Collection, Calvin Klein, Calvin Klein Jeans and Calvin Klein Underwear - have been featured together\nIt's the first time that each of the Calvin Klein brands – Calvin Klein Collection, Calvin Klein, Calvin Klein Jeans and Calvin Klein Underwear - have been presented together.\nFor example, while Robert Pattison's fiancee FKA models a nude top and skirt for her animated campaign shot, Kendrick sports some of the denim.\nThe campaign is also set to feature breakout Danish actress Klara Kristin; independent hip-hop recording artist Joey Bada$; and British model and activist Adwoa Aboah, among others.\nFamiliar face: Calvin Klein's 2011 CK One Fall campaign featured Abbey Lee alongside models Bambi Northwood-Blythe along with Lara Stone and Ruby Aldridge\nIt's not the first time Abbey Lee has posed for the iconic label, featuring in their CK One - Calvin Klein Jeans Fall 2011 campaign.\nIn the edition she starred alongside fellow Australian model Bambi Northwood-Blythe, and also Lara Stone and Ruby Aldridge.\nHowever Abbey Lee stepped out of the modelling game in 2012 having walked for Oscar de la Renta, Gucci, and Halston, and is determined to make her mark in Hollywood.\n‘This is a true passion, so I’m not going to take it lightly’ she told Marie Claire in May.\n‘I’ve started at the bottom of the pile. I have to do it all over again.'\nSee-through: The Mad Max: Fury Road star risked a wardrobe malfunction as she went braless under a sheer black gown at the Critic's Choice Awards earlier this month\nAbbey Lee's acting career has gained momentum since she starred in Mad Max: Fury Road, the latest installment of the Mad Max franchise.\nThe film, which was nominated for two Golden Globes last Sunday, blazed through the Critics' Choice Awards earlier this month winning nine prizes overall - including Best Action Movie.\nThe striking blonde - who plays The Dag, one of five runaway brides in the post-apocalyptic action flick - risked a wardrobe malfunction on the night with her braless, see-though ensemble by haute couture fashion house Balmain.\nNew venture: Abbey Lee's acting career has gained momentum since she played an important role as The Dag in Fury Road, the latest installment of the Mad Max franchise","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420081/Abbey-Lee-Kershaw-dares-bare-poses-topless-racy-new-Calvin-Klein-Spring-2016-campaign.html"}
