{"authors":["Jason Chester For Mailonline"],"date_download":"2018-10-23 04:46:06","date_modify":"2018-10-23 04:46:06","date_publish":"2017-03-10 14:57:41","description":"Dressed in nothing more than a lace bra and matching underwear, Abbey, 31, displays her lithe physique as she reclines on a set of stairs.","filename":"data/vaneerConsumption/AbbeyClancywearslacelingerieinInstagramsnap.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E2345C900000578-0-image-a-146_1489157482562.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4301504_Abbey-Clancy-displays-lithe-physique-lace-lingerie_1540269966.html","title":"Abbey Clancy wears lace lingerie in Instagram snap","title_page":"Abbey Clancy wears lace lingerie in Instagram snap | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Abbey Clancy has given fans a taste of what to expect from her latest promotional shoot in a racy behind the scenes snap, shared with Instagram followers on Friday.\nTaking to the social media platform, where she commands a healthy 388,000 followers, the model wife of Stoke City striker Peter Crouch, 36, shared a tasteful black and white image of her partially clothed body.\nDressed in nothing more than a lace bra and matching underwear, Abbey, 31, displays her lithe physique as she reclines on a set of stairs.\nScroll down for video\nBehind the scenes: Abbey Clancy has given fans a taste of what to expect from her latest promotional shoot in a racy behind the scenes snap, shared with Instagram followers on Friday\nOffering the camera a coquettish gaze, the former Strictly Come Dancing champion is on fine form while arching an arm above her head.\nTellingly captioning the shot, she wrote: ‘Behind the scenes.’\nAbbey, who raises daughters Sophia, five, and Liberty, 20 months, with ex-England international Peter, recently confessed she would love to add to her brood - but her husband is yet to be convinced.\nMy man: Abbey is happily married to Stoke City striker Peter Crouch\n'I'd love more, but the second one doesn't sleep at all - she's up every hour so Pete's like 'no more babies just yet,' she said during an appearance on ITV show This Morning.\n'Liberty is eleven months now, so I think once we get her sleeping it might change his mind.'\nAbbey ha also been busy filming the upcoming series of Britain's Next Top Model, which she now hosts after initially rising to fame as a the runner-up on the show back in 2006.\nSo happy: The pair are proud parents to daughters Sophia, five, and Liberty, 20 months,\nThe 11th series, set to air on Lifetime, sees Abbey teaming up with male model Paul Sculfor, fashion guru Hilary Alexander OBE and photographer to the stars Nicky Johnston.\nThe show returns in March and will see the latest batch of hopefuls endure a gruelling process of photo-shoots and tasks in the hopes of landing a top modelling contract.\nProducers have warned that sparks are set to fly in the upcoming series, which sees 12 aspiring catwalk queens taking part in a series of gruelling tasks in a bid to land a lucrative modelling contract with Models 1.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4301504/Abbey-Clancy-displays-lithe-physique-lace-lingerie.html"}
