{"authors":["Natalie Grover"],"date_download":"2018-10-30 23:29:00","date_modify":"2018-10-30 23:29:00","date_publish":"2016-12-07 00:00:00","description":"Abbott Laboratories said on Wednesday that it had moved to terminate its proposed acquisition of Alere Inc.","filename":"data/vaneerConsumption/AbbottseekstoabortplannedacquisitionofAlere.json","image_url":"https://amp.businessinsider.com/images/58485cd9e02ba738018b7f0a-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_r-update-1-abbott-seeks-to-abort-planned-acquisition-of-alere-2016-12_1540942140.html","title":"Abbott seeks to abort planned acquisition of Alere","title_page":"    Abbott seeks to abort planned acquisition of Alere - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Traders gather at the booth that trades Abbott Laboratories on the floor of the New York Stock Exchange Thomson Reuters Dec 7 (Reuters) - Abbott Laboratories said on Wednesday that it had moved to terminate its proposed acquisition of Alere Inc, citing a \"substantial loss\" in the value of the diagnostics company since they struck a deal 10 months back.\nAbbott filed a complaint in the Delaware Court of Chancery to kill the deal it struck with Alere in late January, worth $5.8 billion at the time.\n\"This is likely posturing by Abbott to set up a scenario where a price cut could be arranged,\" Canaccord Genuity's Mark Massaro told Reuters.\nHe said Abbott's best bet would be to create uncertainty to drive Alere's stock lower so the company's shareholders would agree to a lower price. Alere is slated to hold its annual meeting on Thursday.\nSince the two companies announced the deal, Alere has faced multiple setbacks, while Abbott in April struck a deal to buy heart device maker St. Jude Medical Inc for $25 billion.\nWhen the Alere deal was announced, and shortly thereafter, Abbott has expressed a lot of buyers remorse, Jefferies' analyst Raj Denhoy said.\nThe relationship between the two companies began to cool after Alere failed to file financial statements and disclosed probes into billing and foreign sales practices.\nIn July, at the behest of the U.S. health regulator, Alere recalled a device used to monitor levels of a widely used blood thinner because it was found to generate faulty results.\nThe following month, Alere filed a lawsuit accusing Abbott of dragging its feet on key antitrust submissions to sabotage the deal. In November, Alere lost reimbursement on its Medicare business.\nThese developments are unprecedented and are not isolated incidents brought on by chance, Abbott said on Wednesday.\n\"This damage ... can only be the result of a systemic failure of internal controls, which combined with the lack of transparency, led us to filing this complaint,\" said Scott Stoffel, divisional vice president of external communications at Abbott.\nAlere said on Wednesday that none of the arguments made by Abbott gave it grounds to abandon the merger.\n\"Alere will take all actions necessary ... to compel Abbott to complete the transaction in accordance with its terms,\" the company said.\nAlere's shares tumbled 8.4 pct to $36.49, compared with Abbott's offer of $56 per share. Abbott's shares were off 0.5 percent at $38.21 in afternoon trading.\n\"It is still a good asset for Abbott. One would think that cooler heads should prevail, but we're not in the boardroom,\" Jefferies' Denhoy said. (Reporting by Natalie Grover in Bengaluru; Editing by Shounak Dasgupta and Savio D'Souza)","url":"https://www.businessinsider.com/r-update-1-abbott-seeks-to-abort-planned-acquisition-of-alere-2016-12"}
