{"authors":["Jeff Poor"],"date_download":"2018-10-30 21:49:10","date_modify":"2018-10-30 21:49:10","date_publish":"2016-03-07 19:27:42","description":"Monday on ABC's \"The View,\" network senior legal correspondent Sunny Hostin argued there no difference between Republican presidential front-runner Donald |","filename":"data/vaneerConsumption/ABCsSunnyHostinTrumpsStanceonBorderSecurityImmigrationAkintoHitlersExterminationofJews.json","image_url":"https://media.breitbart.com/media/2016/03/Hostin37.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_03_07__1540936150.html","title":"ABC's Sunny Hostin: Trump's Stance on Border Security, Immigration Akin to Hitler's Extermination of Jews","title_page":"ABC's Sunny Hostin: Trump's Stance on Border Security, Immigration Akin to Hitler's Extermination of Jews | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Monday on ABC’s “The View,” network senior legal correspondent Sunny Hostin argued there no difference between Republican presidential front-runner Donald Trump’s tough tack on immigration and border security and Adolf Hitler’s extermination of the Jews in Nazi Germany.\nPartial transcript as follows:\nPAULA FARIS: I spoke with the campaign last week I covered him on Super Tuesday this of the big take away. He’s a attracting first time voters the crossover voters. And there’s a lot of Democrats that are voting for him, and I think you guys we have to be reflective of this country there are a lot of people that do support him to make a gross generalization that if you’re voting for him here racist, I don’t necessarily think that that’s fair as well.\nSUNNY HOSTIN: That is a generalization I don’t think any of us are saying that every single Trump supporter is racist … but I don’t think we can deny the fact is there are a group of people that his message is resonating with, and that is a message of discrimination and bigotry and misogyny and it’s there.\nJOY BEHAR: Demonizing the other. That’s what his message is.\nJEDEDIAH BILA: When you’re talking about Hitler though. I mean, that is like equating Donald Trump to someone who wants to exterminate a whole race of people. Or a whole religion. He didn’t say anything like that.\nHOSTIN: He wants to build a wall, he wants to send millions and millions of Latinos from this country. He wants to torture people, how is it different?\nBILA: You can’t equate border security with the extermination of the Jewish people.\nHOSTIN: How is it different? I just did.\nBILA: You can’t though. You can’t.","url":"https://www.breitbart.com/politics/2016/03/07/abcs-sunny-hostin-trumps-stance-on-border-security-immigration-akin-to-hitlers-extermination-of-jews/"}
