{"authors":["Mallory Schlossberg"],"date_download":"2018-10-30 23:30:03","date_modify":"2018-10-30 23:30:03","date_publish":"2014-08-13 18:00:38","description":"Gather 'round, Frozen-ophiles, because more Frozen is coming your way — just not in the form of a sequel. Deadline reports that ABC will air a \"making-of\" special about Frozen , that will take you behind the scenes as Kristen Bell, Idina Menzel and…","filename":"data/vaneerConsumption/ABCsFrozenSpecialWillTakeYouInsidetheMakingoftheFeministClassic.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/6fd217fc-ca84-4d57-b4c3-f7f66a2863a0.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35638-abcs-frozen-special-will-take-you-inside-the-making-of-the-feminist-classic_1540942203.html","title":"ABC's 'Frozen' Special Will Take You Inside the Making of the Feminist Classic","title_page":"ABC's 'Frozen' Special Will Take You Inside the Making of the Feminist Classic","title_rss":"NULL","source_domain":"bustle.com","text":"Gather 'round, Frozen-ophiles, because more Frozen is coming your way — just not in the form of a sequel. Deadline reports that ABC will air a \"making-of\" special about Frozen , that will take you behind the scenes as Kristen Bell, Idina Menzel and company worked to make the behemoth that is Frozen. It's a few weeks before the Frozen -laced season of Once Upon A Time begins, so it's a perfect time to get amped for the IRL versions of your favorite characters. Oh, wait — you're already amped, right? Because nothing can shake you from your love for the animated movie musical? You still can't, ahem, \"Let It Go?\" (You saw that one coming. I know it. You can groan.)\nThe special, which will air on September 2, will feature trips to the parts of Norway that inspired Arendelle, a good look at what goes on inside of the famed Disney Studios, and will also feature a little bit of a look at the new Once Upon A Time characters (this is ABC — they weren't going to not plug the upcoming season). At the end, you'll also get a glimpse at the next Disney feature, Big Hero 6 .\nThings you probably will not get: a confirmed answer on a Frozen sequel, a snowman that comes out of your television and sings to you. But for now, this should definitely be sufficient for all of the Frozen fans out there whose hearts are consistently melting in anticipation.\nImage: Disney","url":"https://www.bustle.com/articles/35638-abcs-frozen-special-will-take-you-inside-the-making-of-the-feminist-classic"}
