{"authors":[],"date_download":"2018-10-30 18:29:16","date_modify":"2018-10-30 18:29:16","date_publish":"2018-07-25 18:39:00","description":"The search continues for for Mollie Tibbetts, a 20-year-old University of Iowa student.","filename":"data/vaneerConsumption/Abductorcanclaimrewardmoneyifshe.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/07/25/Videos/4447288.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_fbi-joins-hun_3ba0d71870c34dcd7aab9e7614ec4a98__1540924156.html","title":"Abductor can claim reward money if she&","title_page":"Mollie Tibbetts’ mother: Abductor can claim reward money if she&","title_rss":"NULL","source_domain":"ajc.com","text":"The search continues for for Mollie Tibbetts, a 20-year-old University of Iowa student.\nShe was last seen July 18 jogging around her hometown in Brooklyn, Iowa.\n>> Read more trending news\nThis undated photo released by the Iowa Department of Criminal Investigation shows Mollie Tibbetts, a University of Iowa student who was reported missing from her hometown in the eastern Iowa city of Brooklyn on Thursday, July 19, 2018. (Iowa Department of Criminal Investigation, Getty Images/AP)\nUpdate Aug. 3, 2018 11:07 a.m. EDT: There are no new leads or updates as the search for Mollie Tibbetts goes into its third week, officials with the Poweshiek County Sheriff's Office said during a press conference Friday.\nA $172,000 reward is being offered for information leading to her safe return.\nLaura Calderwood, Tibbetts’ mother, believes her daughter is still alive and said even the kidnapper could claim the reward money if she is returned home.\nDalton Jack, Tibbetts’ boyfriend, said he does not believe Tibbetts would have left on her own.\n“Everybody has a Mollie, a person that has changed your life in such a huge way and that’s in everybody’s lives. Just imagine if somebody had taken your Mollie,” Jack said in an interview Friday on “Good Morning America.”\nJack is not considered a suspect in her disappearance, police said.\nReports of a sighting of Tibbetts at a Missouri gas station proved to be untrue.\nOfficials with the Iowa Division of Criminal Investigation told the Des Moines Register that the reported sighting was not substantiated and has been ruled out by investigators.\nUpdate Aug. 2, 2018 2:30 p.m. EDT: The reward for Tibbetts’ safe return has reached $172,000, the woman’s family said in a press conference Thursday.\nTibbetts’ mother, Laura Calderwood, read a prepared statement, WHO reported.\n“We believe that Mollie is still alive and if someone has abducted her we are pleading with you to release her,” Calderwood said.\nPolice have interviewed a local pig farmer who reportedly pleaded guilty to stalking, Fox News reported.\nPolice have not identified any suspects in the case.\nInvestigators are holding a news conference at 9:30 a.m. Friday at the Poweshiek County Sheriff’s Office to release more about the case.\nUpdate Aug. 2, 2018 10 a.m. EDT: Investigators in Kearney, Missouri, have joined the search for Tibbetts.\nKearney is located just outside Kansas City and is about three hours from Tibbett’s hometown.\nInvestigators were following up on a tip that Tibbetts might have been seen at a truck stop in the area, according to KMBC.\nPolice searched the area, reviewed surveillance video and have interviewed potential witnesses, Kearney police told the Des Moines Register.\nTibbetts’ family told KCCI they are offering a $30,000 reward for her safe return.\nOriginal Story: Federal agents have joined the search for Mollie Tibbetts, 20-year-old University of Iowa student who has been missing from her hometown of Brooklyn for nearly a week.\nVolunteer searches for Tibbetts were called off this week as federal officials took over, KCRG reports.\nA spokesman for the Iowa Division of Criminal Investigation said Tuesday that they’re “leaning more and more toward something happening against her will.”\nAccording to KCRG, Tibbetts was staying at her boyfriend’s house before she disappeared to watch his dogs while he worked at a construction job in Dubuque -- a town about 100 miles away.\nTibbetts’ boyfriend, Dalton Jack, 20, told KCRG that investigators searched his house for the second time Monday afternoon.\n“I still call her every day, too, hoping by some weird chance she will pick up,” Jack told the Des Moines Register. “It just goes straight to voicemail. The phone is dead.”\nNeighbors told police they last saw Tibbetts go for a jog late Wednesday evening.\nShe was reported missing Thursday when she didn’t show up for work.\nOver 1,500 people helped search for Tibbetts in the fields around her house, where she was staying.\nOfficials said the FBI and Iowa investigators are searching places Tibbetts is known to have frequented in the past.\nThey are also studying Tibbetts’ online usage and cellphone apps to help pinpoint where she might be.","url":"https://www.ajc.com/news/national/fbi-joins-hunt-for-missing-student-from-university-iowa/NEUFRcqvjVIZ8vVMLfOb4M/"}
