{"authors":["Charlotte Thomson For The Daily Mail"],"date_download":"2018-10-23 01:24:59","date_modify":"2018-10-23 01:24:59","date_publish":"2016-01-28 15:45:42","description":"A university email lists dos and don’ts – prompting claims of a ‘nanny state gone mad’. Staff and students have been told not to stop or slow down the glass doors and to be aware of others.","filename":"data/vaneerConsumption/AberdeenUniversitystudentsgetlessonsinhowtousearevolvingDOOR.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB580500000578-0-image-a-50_1453995635881.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421142_University-students-lessons-use-revolving-DOOR_1540257899.html","title":"Aberdeen University students get lessons in how to use a revolving DOOR","title_page":"Aberdeen University students get lessons in how to use a revolving DOOR | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"For most people, using a door is a simple matter of opening it and walking through.\nBut some find the revolving kind a little more complicated, if guidance issued by a Scottish university is to be believed.\nStudents at Aberdeen’s Robert Gordon University have been issued with detailed instructions on their use.\nAn email, issued on behalf of the university’s occupational health and safety team, lists dos and don’ts – prompting claims of a ‘nanny state gone mad’.\nThe Robert Gordon University email advised that 'facial injuries can occur if the doors stop unexpectedly'\nStaff and students have been told not to stop or slow down the glass doors and to be aware of others using them. The guidance came after a member of staff fractured their arm at the Garthdee campus in Aberdeen.\nThe email said: ‘Revolving doors are heavy and may cause serious injuries if they strike someone. Do not push the doors hard as they will continue revolving and do not have automatic brakes.\n‘Pay attention and look where you are going when using these doors: facial injuries can occur if the doors stop unexpectedly.’\nA Robert Gordon University spokeswoman said the accident had been reported and investigated.\nAberdeen councillor Ian Yuill said: ‘If someone has been injured in one, there’s been a problem.\n‘If RGU thought it was necessary to provide information on how best to use a revolving door and it avoids someone hurting themselves again, then that’s the main thing.’\nMany social media users poked fun at the sign. On Twitter Jon Hebditch said: ‘I’m hoping they do one on standard doors next. Those things are a menace.’ Richard Whittle wrote: ‘Nanny state stuff, all because someone was stupid?’\nAnd Rab Davidson suggested: ‘Next week a seminar on how to cope with the challenge of tables and chairs.’\nDurham Ranger added: ‘If you have staff that cannot use doors, why are they teaching students?’\nRobert Gordon University students are not the first needing help.\nThree years ago Edinburgh College issued guidance after a student fractured their cheek and arm after being caught in a door. Staff put up signs with instructions on how to use a door without injury.\nThe guidance came after a member of staff fractured their arm at the Garthdee campus in Aberdeen\nWhile some make light of the signs, there have been serious cases involving revolving doors. In 2011, Roderick Elliott, 73, died after he was knocked down as he left South Tyneside District Hospital in South Shields.\nMr Elliott was leaving a check-up at the clinic after suffering two strokes when he was hit by the door and broke his left thigh bone.\nHe died six days after having a screw fitted to his hip to fix the break. An inquest revealed he was the second person to be injured by the door.\nLast year, Tatler Magazine’s beloved pet dog Alan was crushed to death in revolving doors at Vogue House in London after returning from a walk with an intern.","url":"https://www.dailymail.co.uk/news/article-3421142/University-students-lessons-use-revolving-DOOR.html"}
