{"authors":["Aimee Brannen"],"date_download":"2018-10-23 01:12:40","date_modify":"2018-10-23 01:12:40","date_publish":"2016-01-11 11:45:22","description":"Roz and Ian Ellis, from Aberdeen, first met in 1967 and tied the knot a year later but they drifted apart, remarried and became widowed before meeting again and marrying 48 years after they first wed.","filename":"data/vaneerConsumption/AberdeencouplegetsmarriedfortheSECONDtime23yearsaftergettingdivorced.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/10/3007A78000000578-0-image-a-2_1452509544541.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3393704_Couple-gets-married-SECOND-time-rekindling-romance-23-years-getting-divorced_1540257160.html","title":"Aberdeen couple gets married for the SECOND time 23 years after getting divorced","title_page":"Aberdeen couple gets married for the SECOND time 23 years after getting divorced | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A couple who divorced after 23 years of marriage rekindled their romance nearly 23 years later and have tied the knot for a second time.\nRoz and Ian Ellis, from Aberdeen, who first met in Lanarkshire in January 1967 were engaged by November and walked down the aisle a year later.\nBut after having three children, the couple eventually drifted apart and after ended up divorcing in 1991 - both going on to marry different people.\nRoz and Ian Ellis, from Aberdeen, first met in Lanarkshire in January 1967 and married a year later after a whirlwind romance\nBut after having three children, they went on to split 23 years later - but have just walked down the aisle for a second time\nDuring their time apart, both couples remarried - but stayed good friends and rekindled their love 23 years after divorce. Here, they are pictured with two of their sons, Ian and Stewart\nBut Roz and Ian, who have eight grandchildren, stayed friends - and incredibly, nearly 23 years later in 2013, they rekindled their love and have just married for a second time.\nRoz, 66, a former medical secretary, said: 'We first met early in 1967 - my parents managed a hotel, and Ian and I got chatting over the bar.\n'It wasn't quite love at first sight, but there was definitely an attraction.\n'One day I went to a dance and Ian took me home - the rest is history, it was quite a whirlwind romance.'\nThe loved-up pair got engaged on St Andrews Day, November 30, in 1967, and tied the knot a year later on December 21, 1968.\nOver the years they had three sons - Ian, Stewart and Ewan - and eventually eight grandchildren.\nThe couple tied the knot for a second time at the Norwood Hall Hotel in Aberdeen on January 3\nIt was a family affair for the happy couple with their eldest son Ian, 45, being his dad's best man, while middle son Stewart, 43, gave Roz away and their grandchildren filled out the bridal party.\nBoth of the partners that Roz and Ian went on to marry after splitting passed away, and the pair rekindled their romance when their son Stewart got married in August 2013\nBut it wasn't meant to be, and Roz and former teacher Ian, 71, ended up divorcing in 1991.\nRoz said: 'It was just one of those things - we drifted apart and decided to call it a day.\n'We stayed friendly, and we'd see each other at family gatherings.\n'Ian went down south and I stayed in Scotland, and we both remarried.'\nSadly both their partners passed away, but when Stewart got married in August 2013 the romantic occasion reignited a spark for the former lovers.\nRoz said: 'Our eldest Ian and his family live in Tasmania, so when they came over for Stewart's wedding they stayed with Ian.\nRoz and Ian outside the church when they married the first time round in 1967 having met a year before\nThe couple were reunited again at 43-year-old son Stewart's wedding, with Ian to the groom's left and Roz, on the bride's right, with their other sons Ian, 45, and Ewan, 36, as well as grandchildren Claire, 13, Sarah, 10, Lochlan, 12, Josh 12, Ben, 10, Jamie, 6, Ethan, 5 and Isla, 2\n'Ian and I saw a lot of each other while they were here, as I was always popping over to see the kids.\n'After Ian and the family went home, I just carried on popping over.\n'We'd go out to the theatre, out for dinner, on holidays - and it sort of blossomed from there.\n'We waited a while to tell people, but I think my son Ian had his suspicions at the wedding that there might be a spark between us again.\n'It wasn't until January 2014 that we realised we still had feelings for each other, and we decided to give it another shot.'\nIn May 2014 Roz let out her house and moved back in with Ian, and by January 2015 the pair were planning on walking down the aisle again.\nIn May 2014 Roz let out her house and moved back in with Ian, and by January 2015 the pair were planning on walking down the aisle again\nThe couple met when they got chatting over the bar at the hotel Roz's parents managed\nRoz said: 'Everyone said it was such a lovely romantic story - I never thought we'd get married again, but I'm so happy that we did.'\nIt was a family affair for the happy couple when they wed at the Norwood Hall Hotel in Aberdeen on January 3 - their eldest son Ian, 45, was his dad's best man, while middle son Stewart, 43, gave Roz away and their grandchildren filled out the bridal party.\nRoz, who is also mother to Ewan, 36, said: 'Everyone was very happy for us.\n'Our first wedding was a big traditional affair, so we didn't feel the need to do it again - we decided to keep it quite low-key with our family and friends.\n'Everyone said it was such a lovely romantic story - I never thought we'd get married again, but I'm so happy that we did.\n'I kept my original wedding ring, so I used it again this time round - Ian hadn't though, so maybe he's not quite as sentimental as me!\n'I'd just kept it in my jewellery box, and thought it would be a nice touch to have the same ring the second time round.","url":"https://www.dailymail.co.uk/femail/article-3393704/Couple-gets-married-SECOND-time-rekindling-romance-23-years-getting-divorced.html"}
