{"authors":["Alexandra Bruschi"],"date_download":"2018-10-30 23:13:14","date_modify":"2018-10-30 23:13:14","date_publish":"2014-08-13 22:00:50","description":"Thanks to her dramatic story, Abigail Hernandez has been the spotlight of much attention since she reappeared in July after a nine-month disappearance. On Wednesday, Abigail's lawyer released a statement asking for a little peace and quiet. \"Abby…","filename":"data/vaneerConsumption/AbigailHernandezsLawyerWantsYouToQuitSpeculatingAndHesGotAPoint.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/a9a3149b-fdbd-4bb9-adac-1f8966c35783.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35677-abigail-hernandezs-lawyer-wants-you-to-quit-speculating-and-hes-got-a-point_1540941194.html","title":"Abigail Hernandez's Lawyer Wants You To Quit Speculating, And He's Got A Point","title_page":"Abigail Hernandez's Lawyer Wants You To Quit Speculating, And He's Got A Point","title_rss":"NULL","source_domain":"bustle.com","text":"Thanks to her dramatic story, Abigail Hernandez has been the spotlight of much attention since she reappeared in July after a nine-month disappearance. On Wednesday, Abigail's lawyer released a statement asking for a little peace and quiet. \"Abby simply asks that you respect her wishes and the justice process as this case moves forward,\" lawyer Michael Coyne. Coyne has a point.\nIf you haven't been following Abigail's story, here are the basics: Hernandez is a New Hampshire teenager who disappeared while walking home from school on Oct. 9, 2013 and remained missing for nine months. On Jul. 20, 2014, Abigail walked into her mother’s house, and investigators soon arrested Nathaniel Kibby, 34, charging him as her kidnapper. Abigail’s lawyer Michael Coyne made a public statement that Abigail was “violently abducted,” and allegedly suffered “numerous acts of unspeakable violence,” during her disappearance.\nAs with similar cases, Abigail’s disappearance ignited a public desire to understand what happened. In accordance with the Hernandez family’s wishes, however, the family’s lawyers and other officials involved in the case have remained “tight-lipped” about the details of the investigation. Thus, beyond the basic details of her disappearance and return, much remains unclear — and, for Abigail’s sake, it should stay that way.\nOn Aug. 13, Coyne posted on BringAbbyHome.com — a support website created during Abigail’s disappearance— on behalf of Abigail and her mother, requesting some privacy and compassion from the public:\nAbby simply asks that you respect her wishes and the justice process as this case moves forward. We trust that justice will be done. On behalf of Abby, we ask that you be sensitive to the well-being of this child and give her the time and space she needs – that any of us would desire for a member of our own family or loved one who suffered as she has.\nAbigail’s return has prompted an onslaught of media attention and questioning, which has placed the teen and her family under enormous physical and emotional stress — and it needs to stop. The public’s desire to figure out the sordid details of the kidnapping is conflicting with Abigail’s need for time and space away from the media spotlight as she heals. It's bad enough that Abigail had to face her alleged captor in court; news outlets that publish a photograph of Abigail \"gesturing negatively to a camera as she was surrounded by press\" are only adding to the family's stress.\nChristian Science Monitor suggested that speculations that Abigail possibly ran away on purpose can be equally damaging to the teen's recovery, particularly when they're not founded on valid evidence. This runaway theory arose when police revealed that Abby had sent a letter to her mother during her captivity. The letter prompted FBI agent Kiernan Ramsey to suggest that Abby might have chosen to run away from home, though he didn't confirm whether this was the case.\nReporters are estimating that Kibby’s trial, which began with the Jul. 29 arraignment, could take up to 18 months, and it remains unclear what punishments Kibby will face if convicted. 18 months is a long time for a fifteen-year-old girl to remain the subject of media harassment and negative social media commentary. Rather than speculate or probe into the traumatic events of her past year, we should be showing their support and empathy for Abigail. Or, even better — we should leave her alone.\nScreenshots: Boston Globe","url":"https://www.bustle.com/articles/35677-abigail-hernandezs-lawyer-wants-you-to-quit-speculating-and-hes-got-a-point"}
