{"authors":["Simon Black","Sovereign Man"],"date_download":"2018-10-31 00:17:33","date_modify":"2018-10-31 00:17:33","date_publish":"2018-07-11 00:00:00","description":"The people responsible for supplying the world with gold say we are running out of it as mining companies struggle to find new deposits of gold to replace their aging mines. And the trouble is there is not a reasonable substitute for gold.","filename":"data/vaneerConsumption/Abillionaireissoundingthealarmonaglobalgoldshortage.json","image_url":"https://amp.businessinsider.com/images/5536520fecad04bd77514efb-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_a-billionaire-is-sounding-the-alarm-on-a-global-gold-shortage-2018-7_1540945053.html","title":"A billionaire is sounding the alarm on a global gold shortage","title_page":"    A billionaire is sounding the alarm on a global gold shortage - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A man mines for gold at Pidie district, Indonesia's Aceh province November 3, 2009. The villagers can collect up to 1.5 to 2 grams of gold and earn up to 275,000 rupiah ($28) a day. REUTERS/Tarmizy Harva\nA few months ago I sent you a note explaining that major gold discoveries are shrinking.\nSimply put, mining companies are no longer finding vast, new deposits of gold to replace their aging mines.\nI quoted Pierre Lassonde, the billionaire founder of gold royalty giant Franco-Nevada and former head of Newmont Mining:\nIf you look back to the 70s, 80s and 90s, in every one of those decades, the industry found at least one 50+ million-ounce gold deposit, at least ten 30+ million-ounce deposits, and countless 5 to 10 million ounce deposits. But if you look at the last 15 years, we found no 50-million-ounce deposit, no 30-million-ounce deposit and only very few 15 million ounce deposits.\nPierre Lassonde is one of the most well-respected and knowledgeable mining experts in the world. And he thinks we're reaching 'peak gold'.\nBut he's not alone.\nLast month, Rudy Fronk, Chairman and CEO of Seabridge Gold noted:\n\"Peak gold is the new reality in the gold business with reserves now being mined much faster than they are being replaced.\"\nNick Holland, CEO of South Africa's largest gold producer Gold Fields: \"We were all talking about how production was going to increase every year. I think those days are probably gone.\"\nKevin Dushnisky, President of mining giant Barrick Gold: \"Falling grades and production levels, a lack of new discoveries, and extended project development timelines are bullish for the medium and long-term gold price outlook.\"\nBut the biggest warning comes from resource legend Ian Telfer, chairman of Goldcorp. In an interview with Financial Post, Telfer said:\n\"If I could give one sentence about the gold mining business … it's that in my life, gold produced from mines has gone up pretty steadily for 40 years. Well, either this year it starts to go down, or next year it starts to go down, or it's already going down… We're right at peak gold here.\"\nIt's hard to pinpoint a top or a bottom. But there is an interesting opportunity here since gold has fallen in price over the last several weeks thanks to an inexplicable surge in the US dollar.\nThe long-term fundamentals seem pretty obvious- the people responsible for supplying the world with gold are saying the world is running out of gold and that supply is declining at an alarming rate.\nWith a commodity like oil, technology tends to solve the problem of declining supply through more efficient production methods.\nWhen 'peak oil' started becoming a problem 10 years ago, the industry developed new fracking and horizontal drilling technologies. And other industries like solar and wind began developing better substitutes for oil.\nBut there's not really a substitute for gold. And the biggest players in the space are saying we're running out.","url":"https://www.businessinsider.com/a-billionaire-is-sounding-the-alarm-on-a-global-gold-shortage-2018-7"}
