{"authors":[],"date_download":"2018-10-30 14:07:24","date_modify":"2018-10-30 14:07:24","date_publish":"2018-09-14 00:05:50","description":"\"All I know,” the British socialist Beatrice Webb confided in her diary in 1932 as she and her husband Sidney were writing a laudatory two-volume history of the Soviet Union, “is that I wish Russian communism to succeed.” The playwright George Bernard Shaw — a close friend of the Webbs, a fellow socialist, and a great admirer of the communist dictator Josef Stalin — claimed after a nine-day visit to Russia, “There was not, and could not be, a food shortage in the USSR.” Walter Duranty, the New York Times Moscow bureau chief from 1922 to 1936, took that falsehood and raised it to a still more preposterous height, assuring American readers that Soviet granaries “were overflowing with grain” and that the cows were “plump and contented.”","filename":"data/vaneerConsumption/ABlanketofSilence.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/Charlotte_and_George_Bernard_Shaw_Beatrice_and_Sidney_Webb_1932.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540908444.html","title":"A Blanket of Silence","title_page":"A Blanket of SilenceThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"“All I know,” the British socialist Beatrice Webb confided in her diary in 1932 as she and her husband Sidney were writing a laudatory two-volume history of the Soviet Union, “is that I wish Russian communism to succeed.” The playwright George Bernard Shaw — a close friend of the Webbs, a fellow socialist, and a great admirer of the communist dictator Josef Stalin — claimed after a nine-day visit to Russia, “There was not, and could not be, a food shortage in the USSR.” Walter Duranty, the New York Times Moscow bureau chief from 1922 to 1936, took that falsehood and raised it to a still more preposterous height, assuring American readers that Soviet granaries “were overflowing with grain” and that the cows were “plump and contented.”\nUnemployment in the United States reached a peak of 25 percent in the United States in 1933. As terrible as that was, there was human suffering on a far greater scale at this same time inside the Soviet Union: Famine wiped out scores of villages and caused millions of people to starve to death. This was a purely man-made famine — caused by the forced collectivization of agriculture, or the stamping out of an independent peasantry allowed to sell any part of their product in an open market.\nInstead of merely extorting peasants to turn over a large portion of their harvests to the state at low prices, Stalin decided to wage class war against the kulaks in the Ukraine and North Caucasus — the more prosperous peasants… or any peasant who opposed the abolition of private farms and the herding together of all farmers into giant “grain factories.” Begun as a part of the Five-Year Plan of 1928, the inevitable result of this massive exercise in “social engineering” was chaos, crop failures, and the raging 1932-1933 famine.\nOutside the Soviet Union, the famine attracted little notice or concern, due to the reluctance of the Western press corps in Moscow to say anything negative about Stalin… and due to the unstinting praise that was heaped upon the communist tyrant by a long string of Western intellectuals for whom the “failure of capitalism” had become an article of faith. As the English historian Richard Overy observed, “Intellectuals in the 1930s assumed that capitalism was economically inefficient and morally repulsive.”\nDuranty steadfastly denied the existence of a famine or anything worse than “food shortages” in the pages of the New York Times. However, in a private debriefing at the British Embassy in 1933, he told a wholly different story, saying that “The Ukraine had been bled white,” people were dying off “like flies,” and that it was “quite possible that as many as 10 million people may have died directly or indirectly from lack of food in the Soviet Union during the past year.”\nEven without admitting that there was a famine, the two-faced Duranty supplied Stalin and his admirers with a handy rationalization to justify any man-made disaster — saying that the end of creating the ideal socialist state would justify the means, however cruel and destructive. He wrote:\nBut — to put it brutally — you can’t make an omelet without breaking eggs, and the Bolshevik leaders are just as indifferent to the casualties that may be involved in their drive toward socialism as any General during the World War who ordered a costly attack in order to show his superiors that he and his division possessed the proper soldierly spirit. In fact, the Bolsheviki are more indifferent because they are animated by fanatical conviction.\nSuffice it to say that this same rationalization was more than good enough for Shaw, the Webbs, H.G. Wells, Pablo Neruda, and other intellectuals who came to Moscow in the interwar years to bear witness to their dream of a socialist utopia in the making. No one captured the delusionary thinking of this group any better than one of its members — Lincoln Steffens — who famously said: “I have seen the future, and it works.” He wrote that “Soviet Russia was a revolutionary government with an evolutionary plan,” enduring “a temporary condition of evil, which is made tolerable by hope and a plan.”\nToo bad that the hope that this plan inspired in so many intellectuals turned out to be false while the evil turned out to be all too real and long-lasting. Be that as it may, over the last 100 years, socialism has never lacked apologists among the intellectual and media elite.\nAndrew B. Wilson, a long-time contributor to The American Spectator, is senior writer and resident fellow at the Show-Me Institute in St. Louis.","url":"https://spectator.org/a-blanket-of-silence/"}
