{"authors":["Julie Cart","Dan Morain"],"date_download":"2018-10-30 22:50:00","date_modify":"2018-10-30 22:50:00","date_publish":"2018-09-06 02:00:50","description":"Some environmental activists say Gov. Jerry Brown should ban fracking, end new oil drilling and wean the state off fossil fuels.","filename":"data/vaneerConsumption/AblindspotinBrownsgreenworldviewCriticssayitsoil.json","image_url":"https://calmatters.org/wp-content/uploads/Climate-activist-protest_Robbie-Short_112-e1536280341240.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939800.html","title":"A blind spot in Brown's green worldview? Critics say it's oil","title_page":"A blind spot in Brown's green worldview? Critics say it's oil | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"The venue was a high-level international climate conference sponsored by the United Nations, but the demonstrators were undeterred.\nAnti-oil protesters tried to shout down California Gov. Jerry Brown as he spoke at last November’s climate-change conference in Bonn, Germany, one of many interruptions in his appearances there.\nThe occasionally feisty governor didn’t miss the opportunity to debate with the “Keep It In The Ground” campaign troops pushing for no new oil or gas drilling anywhere.\n“Keep it in the ground? Let’s put you in the ground,” Brown shot back, before veering into a well-worn admonition that the industrial world would suffer if fossil fuels suddenly stopped flowing.\nTo some it’s jarring to attack the environmental bona fides of a public figure who has been talking about conservation since the 1970s and has arguably signed more environmental legislation than any American governor.\nAs state attorney general and then governor, Brown has championed regulations supporting clean energy, energy efficiency and a broad suite of laws aimed at reducing greenhouse gases that warm the planet.\nBut even as they acknowledge those gains, some fault Brown for a persistent and significant blind spot in his green worldview: oil.\nTheir message: The California governor, widely known as a climate defender, is in fact a climate offender. He should ban fracking in California, stop issuing oil-drilling permits and find a way to wean the state off fossil fuels, his critics say. Now.\nThe Bonn protestors intend to reprise their political theater at another international climate-change conference, this one hosted by Brown in San Francisco next week. The Global Climate Action Summit will bring together policymakers and business leaders who pledge to reduce emissions that warm the planet.\nSome activists are already dismissing the event as “McSummit” and say they’ll attend only to expose Brown’s “hypocrisy” in hosting a carbon-cutting conference in the nation’s sixth-largest oil producing state.\nGoFundMe campaigns are underway to send young activists to the Bay Area to participate in marches, which will gather dozens of disparate groups under the ominous-sounding banner of “Brown’s Last Chance.”\nA group of Nobel Peace laureates sent a letter to Brown last month praising his leadership on climate issues but adding that the state has a “moral responsibility” to freeze fossil-fuel exploration.\nDozens of elected officials and prominent scientists have joined the campaign, which has some 800 social-justice and environmental groups under its broad umbrella.\nThe governor declined to comment for this article. His spokesman, Evan Westrup, said the critics are myopic, ignoring the changes already occurring at Brown’s hand.\n“Clearly, the world needs to curb its use of oil, and the phase-out is already underway in California, where the state is committed to cutting consumption in half, ” he said in an email.\n“At the same time, oil production in California has dropped 56 percent . There’s a reason the White House and fossil-fuel companies fight California on almost a daily basis—no jurisdiction in the Western Hemisphere is doing more on climate,” Westrup said.\nBut not to R.L. Miller, chairwoman of the state Democratic Party’s environmental caucus and president of the political action committee Climate Hawks Vote, which supports environmental issues and candidates.\nShe said Brown used to be a committed environmentalist, and she gave him credit for promoting solar energy, for example.\nBut oil exploration is another matter, she said. Like many critics, Miller noted Brown’s controversial dismissal of the state’s top two oil and gas regulators in 2011, two days after they warned the governor that oil activities were imperiling the state’s groundwater.\nIndustry representatives, who had complained that the state’s enforcement noose was pulling too tightly, welcomed the move. Brown never publicly gave a reason for firing the officials, who serve at the pleasure of the governor.\nTwo years later, to great fanfare, Brown signed legislation regulating fracking, calling it the toughest in the nation. But the law didn’t go as far as some environmentalists would have liked; they wanted a fracking ban.\n“His blind spot is bigger than just fracking; it’s really the entire oil industry,” Miller said. “He goes out of his way to be friendly to them.” She calls Brown “Chevron’s stenographer.”\nCritics howled again last year when oil interests were given key concessions so that Brown’s signature climate policy—the cap and trade system for reducing industrial pollution—could be extended. The governor himself lobbied legislators for passage.\n“We are a nation-state in a globalizing world, and we’re having an impact,” Brown said at the bill-signing ceremony. “You’re here witnessing one of the key milestones in turning around this carbonized world into a decarbonized, sustainable future.”\nHollow words, to Miller.\n“If he’s serious about climate change, as serious as he sounds, he needs to come to grips with this industry,” she said. “He hasn’t done that.”\nBrown has approved more than 20,000 new drilling permits since 2011. But his staff points out that fewer than 1,500 have been issued in the last two years, mirroring the decline in the price of oil and in statewide production.\nIn fact, Westrup said, Brown was recently criticized for not doing enough to help energy interests, when a group of legislators threatened to block a budget increase for more oil-field inspectors and regulatory staff. The lawmakers complained that the state had created a permitting backlog.\nOil interests, like many others, have donated to the governor’s campaigns and causes. Chevron and Occidental oil companies, for example, have contributed hundreds of thousands of dollars since 2010 to Brown’s gubernatorial runs and the two charter schools he founded in Oakland. Occidental gave $250,000 to a Brown-backed ballot-measure effort about two months after the 2011 oil-regulator firings.\nBut those who say Brown is in the thrall of oil interests misread the governor, according to Bruce Jennings, formerly a senior environmental advisor to the California Legislature.\nJennings, whose 2017 book, “The War on California: Defeating Oil, Oligarchs and the New Tyranny,” examined the oil industry’s considerable influence in the state, said Brown is simply a pragmatist.\nThe governor puts high-level climate policies first and has been willing to allow other initiatives to be subsumed by the necessary deal-making, Jennings said; Brown has disappointed some activists precisely because his rhetoric has promised so much.\n“The legacy of his administration … then becomes a kind of ‘crimes of omission,’ ” Jennings said.\nWith about four months left in his final term, Brown has a desk full of climate-change initiatives he’s pushing, to cap off his public service. But some environmentalists won’t see that as a win.\n“His climate policy will not be complete or successful unless it addresses both fossil-fuel consumption and fossil-fuel production,” said Kassie Siegel, director of the Climate Law Institute for the environmental group Center for Biological Diversity.\n“He has to do this, or his legacy will be failure,” Siegel said. “There is nowhere in the world better suited than California to get started on a phase-out of fossil-fuel extraction.”\nCheck out all of CALmatters’ key climate policy coverage here.","url":"https://calmatters.org/articles/jerry-brown-california-environmental-policy-critics-oil/"}
