{"authors":[],"date_download":"2018-10-22 21:25:47","date_modify":"2018-10-22 21:25:47","date_publish":"2018-09-01 00:00:00","description":"Vladimir Kara-Murza is a Russian opposition figure who has twice been poisoned but keeps working for liberty and change in his country. He was also one of John McCain's pallbearers.","filename":"data/vaneerConsumption/ABondBeyondPoliticsNPR.json","image_url":"https://media.npr.org/assets/img/2018/08/31/gettyimages-1025540424_wide-f0fcc6be4d578f9240c24b9669a0bbd21220dbc5.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=643707486_1540243547.html","title":"A Bond Beyond Politics : NPR","title_page":"Opinion: A Bond Beyond Politics  : NPR","title_rss":"NULL","source_domain":"npr.org","text":"SCOTT SIMON, HOST:\nRepublicans, Democrats, soldiers, sports stars, celebrities, conservatives and liberals are among John McCain's pallbearers. So is Vladimir Kara-Murza. John McCain called him a personal hero whose courage, selflessness and idealism I find awe-inspiring. Vladimir Kara-Murza is 36 years old and chairman of the Boris Nemtsov Foundation for Freedom, named for the admired opponent of Vladimir Putin - and who was shot in the back on a bridge near the Kremlin in 2015. Five men were convicted of his murder, but it's never been determined who ordered the killing.\nVladimir Kara-Murza was in a meeting after lunch just a few months later when he fell violently ill. His organs shut down. He fell into a coma. Doctors said he'd been poisoned. His family flew him to the U.S. to recuperate. And his father told the BBC, if someone did want to frighten us, then they succeeded. But Vladimir Kara-Murza returned to Moscow. He became a leading opposition figure. Two years later, in 2017, he experienced similar symptoms and fell into another coma but recovered. Doctors said he'd been poisoned but never found the source. He told The Independent, the doctors say if there is a third time, that'll be it. I will not survive this again. And then he continued to oppose the Putin regime.\nVladimir is a brave, outspoken and relentless advocate for freedom and democracy in Russia, John McCain said at a rally in Washington, D.C., who was poisoned in order to intimidate him or worse. This was shortly after President Trump gave an interview to Fox News in which he scoffed at the charge that Putin's a killer. There are a lot of killers, said Trump. What, do you think our country is so innocent? This past spring, as John McCain contended with cancer, Vladimir Kara-Murza says the senator asked him to be one of his pallbearers. This is the most heartbreaking honor you can imagine, he told NPR's Ailsa Chang on All Things Considered this week.\nI understand why Politico would say McCain's choice of Russian dissident as pallbearer is final dig at Putin-Trump. But I also see how one man, an American, who was beaten in a prison camp but refused release until all other prisoners had been let go, too, with no reason to believe he wouldn't just be left to perish in that prison, and another man, a Russian, who survived two poisonings but kept working for liberty and change in his country, would have a bond beyond politics, Putin, Trump or the babble of talking heads. Each man knew what it's like to risk their life for their country over and over again.\n(SOUNDBITE OF EMANCIPATOR'S \"WITH RAINY EYES\")\nCopyright © 2018 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=643707486"}
