{"authors":["Brianne Tolj For Daily Mail Australia"],"date_download":"2018-10-22 22:52:29","date_modify":"2018-10-22 22:52:29","date_publish":"2017-03-16 05:03:57","description":"Banok Rind, an Aboriginal nursing student, said she never expected to graduate from her Perth high school after being told by a teacher she would never amount to anything.","filename":"data/vaneerConsumption/Aboriginalstudentchasingdreamtobecomeanurse.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/04/3E51D6D800000578-0-image-a-56_1489640328359.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318780_Aboriginal-nursing-student-Banok-Rind-close-gap_1540248749.html","title":"Aboriginal student chasing dream to become a nurse","title_page":"Aboriginal student chasing dream to become a nurse | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An Aboriginal nursing student who was subject to racism daily said she never expected to graduate from high school after being told by a teacher she would never amount to anything.\nBanok Rind, a Yamatji-Badimia woman from Badimia and Amangu country, 700km north-east of Perth, said she was in Year 10 when her teacher told her she would spend her life as an unemployed drunk.\nThe 22-year-old described the moment to Oxfam Australia as one of the worst that has ever happened to her.\nScroll down for video\nBanok Rind (pictured), an Aboriginal nursing student, said she never expected to graduate from her Perth high school after being told by a teacher she would never amount to anything\n'A teacher told me that I can't do it because I'm an aboriginal person. Stereotypically known to be unemployed, drunk; any stereotype that you associate with an Aboriginal person, that's what she told me,' Ms Rind said.\n'And she said that I can't do it, so I didn't think I would make it to Year 11, Year 12, let alone uni'\n'And all of those things, they eventually add up, and it goes back to what happened in history, because that pain is still there and that still affects us every single day.'\nDespite her teacher's racist remark, Ms Rind was determined and is now studying to be a nurse on the east coast.\nMs Rind (pictured) described iher teacher's racist remark as one of the worst moments of her life, but refused to let it bring her down\nShe is also working to close the gap between healthcare for Aboriginals and non-Indigenous people.\nIndigenous Australians still consistently have higher rates of chronic illnesses and preventable diseases and die up to 17 years earlier than non-Indigenous Australians, according to the Closing the Gap report released on Thursday – National Close the Gap Day.\nMs Rind said her father is one of 12 or 13 children, all of which have diabetes.\n'That's what motivated me to pursue a career in health.'\nShe is working to close the gap between healthcare for Aboriginals and non-Indigenous people\n'We need more health workers, we need more Aboriginal and Torres Strait Islander health workers'\n'It doesn't matter who they are, or where they're from, it's a human in front of you and they're vulnerable and they're asking you for help and you care for them.'\n'I want to go back into my community. We can do it, we can change our people's health.\n'And that's why I wanted to do nursing.'","url":"https://www.dailymail.co.uk/news/article-4318780/Aboriginal-nursing-student-Banok-Rind-close-gap.html"}
