{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 20:09:25","date_modify":"2018-10-30 20:09:25","date_publish":"2015-10-20 16:57:12","description":"A practicing abortionist from 1972 to 2014, Grimes is a member of the editorial board for the SFP journal Contraception.","filename":"data/vaneerConsumption/AbortionistComparesHumanFetustoaCancerousBreast.json","image_url":"https://media.breitbart.com/media/2015/01/Abortion_Reuters-e1420558210685.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_20__1540930165.html","title":"Abortionist Compares Human Fetus to a Cancerous Breast","title_page":"Abortionist Compares Human Fetus to a Cancerous Breast | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Planned Parenthood is retweeting a statement from abortionist Dr. David A. Grimes, who draws a comparison between a healthy unborn human baby and a malignant cancerous breast that requires removal.\nComing out against the Kansas ban on D&E abortion, Dr. Grimes tweeted: “D and E abortion is not a problem any more than a mastectomy is a problem. Both are solutions to a problem.”\nA3: Legislators should #ExitTheExamRoom: their policies make for dangerous medical care https://t.co/rBqo5ejaps pic.twitter.com/MA1861ODqW — RH Reality Check (@rhrealitycheck) October 19, 2015\nA mastectomy is a solution, albeit a radical one, to a malignant tumor in a woman’s breast that cannot be dealt with except by removing the breast itself. An abortion is only a solution if one considers a healthy human fetus to be a diseased organ that must be eradicated.\nGrimes is not just defending any old abortion. According to a former abortionist, D&E abortion involves inserting a Sopher clamp—a sharp-toothed instrument designed for “grasping and crushing tissue”—into a pregnant woman’s womb and feeling around blindly for anything to grab hold of, and then tearing it from the woman’s body.\nMichigan Republican Rep. Laura Cox testified to the House Criminal Justice Committee that a D&E abortion “is a gruesome, horrific and cruel type of abortion procedure whereby tiny unborn humans are literally ripped apart.”\nIn 2005, Dr. Grimes received the Lifetime Achievement Award from the Society of Family Planning, a group dedicated to “advancing science in family planning, including contraception and abortion, by funding research and promoting the expansion and dissemination of family planning knowledge.”\nA practicing abortionist from 1972 to 2014, Grimes is a member of the editorial board for the SFP journal Contraception, as well as an editor and chapter author of the recently published National Abortion Federation text on abortion. He is also author of, most recently, Every Third Woman in America: How Legal Abortion Transformed Our Nation, a book that seeks to legitimize the myths of ubiquitous back-alley abortions that were done away with thanks to the infamous Roe v. Wade decision in 1973.\nGrimes makes the incredible claim that the legalization of abortion resulted in “prompt and dramatic health improvements” for children, something one would have to turn logical backflips to explain, unless one would claim that killing a percentage of the population results in better care for the survivors.\nHe also resorts to typical inflation of statistics for which there is no reliable measure. For instance, he states: “Before Roe v. Wade, an estimated 200,000 to 1.2 million illegal abortions occurred each year in the U.S.” According to the pro-abortion Alan Guttmacher Institute, however, during 1973, when abortion was legalized nationwide, 744,600 abortions were performed in America. If illegal abortion could have reached 1.2 million/year prior to 1973, one would have to explain how the legalization of abortion produced a dramatic drop of more than 450,000 abortions in a year.\nIt is no surprise that Dr. Grimes is a darling of Planned Parenthood, given his extraordinary gift for disinformation and deception. It was Grimes who famously wrote that there is no such thing as a third-trimester abortion, and that the elimination of a fetus during the third trimester of gestation is a “pregnancy termination, but not an abortion.”\nEarlier this month, Dr. Grimes railed against new North Carolina legislation banning the sale of fetal tissue from aborted fetuses.\n“The North Carolina General Assembly has been voting in further restrictions to abortion practice. There’s no need for that. There hasn’t been a death from abortion in this state in decades.”\nNope. Except for all those babies.\nFollow Thomas D. Williams on Twitter @tdwilliamsrome","url":"https://www.breitbart.com/politics/2015/10/20/abortionist-compares-human-fetus-cancerous-breast/"}
