{"authors":["Associated Press"],"date_download":"2018-10-23 02:15:51","date_modify":"2018-10-23 02:15:51","date_publish":"2016-01-29 16:36:36","description":"OVERLAND PARK, Kan. (AP) — More than 390 people have reported getting sick in a norovirus outbreak associated with a suburban Kansas City dinner theater. The...","filename":"data/vaneerConsumption/About400peoplesickenedbynorovirusoutbreakinKansas.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423067_About-400-people-sickened-norovirus-outbreak-Kansas_1540260951.html","title":"About 400 people sickened by norovirus outbreak in Kansas","title_page":"About 400 people sickened by norovirus outbreak in Kansas | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"About 400 people sickened by norovirus outbreak in Kansas\nOVERLAND PARK, Kan. (AP) — More than 390 people have reported getting sick in a norovirus outbreak associated with a suburban Kansas City dinner theater.\nThe Kansas Department of Health and Environment initially said more than 100 people got sick after going to the New Theatre Restaurant in Overland Park. On Thursday, KDHE said more than 390 individuals have now reported illness, and four people have laboratory specimens that confirmed norovirus, KDHE said.\nKDHE is investigating the source of the illness, which is highly contagious and spreads through food, water or person-to-person contact. It is commonly associated with large gatherings of people, and symptoms include vomiting, diarrhea, fever and body aches.\nThe health department said the theater has been fully cooperating with the investigation.\nRob McGraw, vice president of sales and marketing for New Theatre Restaurant, told The Kansas City Star (http://bit.ly/20b9Ss8 ) that three employees have been confirmed for norovirus and that those employees served a man who attended the Jan. 17 matinee performance. That man also has been confirmed to have norovirus. No other employees have fallen ill since the performances, McGraw said.\nThe department asked that people who have attended performances from January 15 until now take part in a confidential online KDHE survey even if they didn't become ill.\nMcGraw said while a few customers have canceled or rescheduled reservations, he has also heard from many supportive season ticket holders. He said the theater, which holds about 625 people, is sold out nearly through the end of February.\n\"They say, 'We know this is not your fault, and we will continue to come,' \" McGraw said. \"The theater, the entire theater, is thoroughly cleaned every day.\"\n___\nThis story has been corrected to show that the Overland Park, Kansas, business spells their name New Theatre Restaurant, not theater.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3423067/About-400-people-sickened-norovirus-outbreak-Kansas.html"}
