{"authors":[],"date_download":"2018-10-30 14:10:13","date_modify":"2018-10-30 14:10:13","date_publish":"2018-10-29 00:00:00","description":"Abrams campaign trail: 8 days before election","filename":"data/vaneerConsumption/Abramscampaigntrail8daysbeforeelection.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/29/Images/103018%20Abrams%20Bus%20Tour_AP12.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_3ed94100ddc9d5315df28e4ac46c0bf7__1540908613.html","title":"Abrams campaign trail: 8 days before election","title_page":"Abrams campaign trail: 8 days before election","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 11\nAlyssa Pointer 10/29/2018 -- Madison, Georgia -- Gubernatorial candidate Stacey Abrams greets a supporter following an early voters rally in Madison, Monday, October 29, 2018. Stacey Abrams was joined by Democratic candidate for Lieutenant Governor Sarah Riggs Amico and Democratic Attorney General candidate Charlie Bailey at the Madison stop of the \"We Are Georgia - Our Voices. Our Votes. Our Time\" Bus Tour. (ALYSSA POINTER/ALYSSA.POINTER@AJC.COM)\n2 / 11\nAlyssa Pointer 10/29/2018 -- Madison, Georgia -- Gubernatorial candidate Stacey Abrams takes a selfie with Democratic candidate for Lieutenant Governor Sarah Riggs Amico (center), Alabama 7th Congressional District Congresswoman Terri A. Sewell (second from left) and her supporters during an early voters rally in Madison, Monday, October 29, 2018. Stacey Abrams was joined by Georgia Democratic candidate for Lieutenant Governor Sarah Riggs Amico and Democratic Attorney General candidate Charlie Bailey at the Madison stop of the \"We Are Georgia - Our Voices. Our Votes. Our Time\" Bus Tour. (ALYSSA POINTER/ALYSSA.POINTER@AJC.COM)\n3 / 11\nAlyssa Pointer 10/29/2018 -- Madison, Georgia -- Gubernatorial candidate Stacey Abrams is joined by Democratic candidate for Lieutenant Governor Sarah Riggs Amico (right) and Democratic Attorney General candidate Charlie Bailey (left) as she speaks during an early voters rally in Madison, Monday, October 29, 2018. (ALYSSA POINTER/ALYSSA.POINTER@AJC.COM)\n4 / 11\nAlyssa Pointer 10/29/2018 -- Warrenton, Georgia -- A Georgia Democrat supporter speaks with Gubernatorial candidate Stacey Abrams following an early voters rally in Warrenton, Monday, October 29, 2018. Stacey Abrams was joined by Georgia Democratic chairman DuBose Porter, Democratic candidate for Lieutenant Governor Sarah Riggs Amico, Democratic Attorney General candidate Charlie Bailey and Democratic Georgia Labor Commissioner Richard Keatley during the Warrenton stop of the \"We Are Georgia - Our Voices. Our Votes. Our Time\" Bus Tour. (ALYSSA POINTER/ALYSSA.POINTER@AJC.COM)\n5 / 11\nAlyssa Pointer 10/29/2018 -- Warrenton, Georgia -- Gubernatorial candidate Stacey Abrams speaks during an early voters rally at Ministers of Faith Christian Center in Warrenton, Monday, October 29, 2018. Stacey Abrams was joined by Georgia Democratic chairman DuBose Porter, Democratic candidate for Lieutenant Governor Sarah Riggs Amico, Democratic Attorney General candidate Charlie Bailey and Democratic Georgia Labor Commissioner Richard Keatley at the Warrenton stop of the \"We Are Georgia - Our Voices. Our Votes. Our Time\" Bus Tour. (ALYSSA POINTER/ALYSSA.POINTER@AJC.COM)\n6 / 11\nAlyssa Pointer 10/29/2018 -- Warrenton, Georgia -- Gubernatorial candidate Stacey Abrams answers questions following an early voters rally at Ministers of Faith Christian Center in Warrenton, Monday, October 29, 2018. (ALYSSA POINTER/ALYSSA.POINTER@AJC.COM)\n7 / 11\nAlyssa Pointer 10/29/2018 -- Warrenton, Georgia -- Gubernatorial candidate Stacey Abrams speaks during an early voters rally at Ministers of Faith Christian Center in Warrenton, Monday, October 29, 2018. Stacey Abrams was joined by Georgia Democratic chairman DuBose Porter, Democratic candidate for Lieutenant Governor Sarah Riggs Amico, Democratic Attorney General candidate Charlie Bailey and Democratic Georgia Labor Commissioner Richard Keatley at the Warrenton stop of the \"We Are Georgia - Our Voices. Our Votes. Our Time\" Bus Tour. (ALYSSA POINTER/ALYSSA.POINTER@AJC.COM)\n8 / 11\nAlyssa Pointer 10/29/2018 -- Warrenton, Georgia -- Gubernatorial candidate Stacey Abrams greets supporters following an early voters rally at Ministers of Faith Christian Center in Warrenton, Monday, October 29, 2018. (ALYSSA POINTER/ALYSSA.POINTER@AJC.COM)\n9 / 11\nAlyssa Pointer 10/29/2018 -- Crawfordville, Georgia -- Georgia Democratic chairman DuBose Porter speaks during an early voters rally in Crawfordville, Monday, October 29, 2018. Stacey Abrams was joined by Georgia Democratic chairman DuBose Porter, Democratic candidate for Lieutenant Governor Sarah Riggs Amico and Democratic Attorney General candidate Charlie Bailey at the Crawfrodville stop of the \"We Are Georgia - Our Voices. Our Votes. Our Time\" Bus Tour. (ALYSSA POINTER/ALYSSA.POINTER@AJC.COM)\n10 / 11\nAlyssa Pointer 10/29/2018 -- Crawfordville, Georgia -- Georgia Democrat supporters use their cellphones to capture Gubernatorial candidate Stacey Abrams during an early voters rally in Crawfordville, Monday, October 29, 2018. Stacey Abrams was joined by Georgia Democratic chairman DuBose Porter, Democratic candidate for Lieutenant Governor Sarah Riggs Amico and Democratic Attorney General candidate Charlie Bailey at the Crawforville stop of the ‚ÄúWe Are Georgia ‚Äì Our Voices. Our Votes. Our Time‚Äù Bus Tour. (ALYSSA POINTER/ALYSSA.POINTER@AJC.COM)\n11 / 11","url":"https://www.ajc.com/news/state--regional-govt--politics/abrams-campaign-trail-days-before-election/z8sjxwbwW93CsDC7is6PhN/"}
