{"authors":["Kristian Wilson"],"date_download":"2018-10-31 01:51:36","date_modify":"2018-10-31 01:51:36","date_publish":"2018-08-27 16:33:53","description":"Someone finally examined how often male authors recommend books by women, and the numbers are pretty depressing. Using The New York Times' \"By the Book\" column, which asks authors about the specific books on their nightstands, UC Berkeley Assistant…","filename":"data/vaneerConsumption/ABreakdownOfByTheBookColumnsShowsThatMaleAuthorsAreFourTimesMoreLikelyToRecommendBooksByMenThanByWomen.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/3e36fd68-0944-4527-af8d-fd2e862f5a97-stocksy_txpa7d6bef6tu3200_small_109321.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_a-breakdown-of-by-the-book-columns-shows-that-male-authors-are-four-times-more-likely-to-recommend-books-by-men-than-by-women-10244493_1540950696.html","title":"A Breakdown Of \"By The Book\" Columns Shows That Male Authors Are Four Times More Likely To Recommend Books By Men Than By Women","title_page":"A Breakdown Of \"By The Book\" Columns Shows That Male Authors Are Four Times More Likely To Recommend Books By Men Than By Women","title_rss":"NULL","source_domain":"bustle.com","text":"Someone finally examined how often male authors recommend books by women, and the numbers are pretty depressing. Using The New York Times' \"By the Book\" column, which asks authors about the specific books on their nightstands, UC Berkeley Assistant Professor David Bamman's analysis shows that male authors recommend books by other men four times as often as they recommend books by women.\nWhen Fates and Furies author Lauren Groff did her \"By the Book\" interview back in May, she named only women writers and their books in her answers. To the last question, which asked for the names of three authors, living or dead, she'd like to invite to a literary dinner party, Groff replied: \"I would invite every woman writer I have mentioned here, plus hundreds of others I did not have space to name. . . . [T]he conversation may eventually meander to touch on that most baffling of questions: When male writers list books they love or have been influenced by — as in this very column, week after week — why does it almost always seem as though they have only read one or two women in their lives? It can’t be because men are inherently better writers than their female counterparts... And it isn’t because male writers are bad people. We know they’re not bad people. In fact, we love them. We love them because we have read them. Something invisible and pernicious seems to be preventing even good literary men from either reaching for books with women’s names on the spines, or from summoning women’s books to mind when asked to list their influences. I wonder what such a thing could possibly be.\"\nOn Saturday, Groff tweeted out a link to George Pelecanos' \"By the Book\" segment, in which the author mentions three books by men and none by women, saying, \"This one goes out to all the men who contacted me to say that my interview (in these these same pages) was bitterly unfair because I said out that men don't read women: Here you go, sweet gents.\" Little Fires Everywhere author Celeste Ng replied to Groff the next day, asking, \"Has anyone done a count of By The Book and how many of the men cite NO women at all? Anecdotally I think the count would be really high.\"\nCiting Groff and Ng's conversation as inspiration, Bamman analyzed the 100 most recent \"By the Book\" columns for interviewees' responses to the \"What's on your nightstand?\" question. According to Bamman's findings, \"Women interviewed by BTB in the aggregate mention men and women as authors about equally (48.9% women/51.1% men, 264 mentions), while men interviewed mention other men four times as frequently as women (20.8% women/79.2% men, 231 mentions).\"\nHalf of the 54 male authors mentioned no women writers, and in two additional \"By the Book\" columns, the all-male recommendations came from women writers. The six interviewees who mentioned no male authors were all female. One of the authors interviewed, Fran Lebowitz, claimed to have no books at all on her nightstand, because she discovered that reading was \"too stimulating\" to do before bed.\nBamman noted that male authors devoting just 20 percent of their attention to work by women writers \"is interestingly similar to our findings for character attention in novels.\" In that tweet, he linked to an article from the Journal of Cultural Analytics, which observed that \"Men remain — on average, as a group — remarkably resistant to giving women more than a third of the character-space in their stories.\" Given the dearth of women writers on male authors' nightstands, it's hardly any wonder that they don't write women into their narratives. Perhaps they don't know how to.","url":"https://www.bustle.com/p/a-breakdown-of-by-the-book-columns-shows-that-male-authors-are-four-times-more-likely-to-recommend-books-by-men-than-by-women-10244493"}
