{"authors":["Jeff Desjardins","Visual Capitalist"],"date_download":"2018-10-30 23:17:06","date_modify":"2018-10-30 23:17:06","date_publish":"2018-07-19 00:00:00","description":"The Great Lakes and the St. Lawrence River make up the most crucial North American trade corridor today, with $77.4 billion worth of goods flowing through the waterways each year. The region will remain a vital and important trade corridor for both America and Canada for a long time.","filename":"data/vaneerConsumption/AbriefhistoryofNorthAmericasmostvitaltradecorridor.json","image_url":"https://amp.businessinsider.com/images/5b50ef4fbbb8831d008b4858-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_a-brief-history-of-north-americas-most-vital-trade-corridor-2018-7_1540941426.html","title":"A brief history of North America's most vital trade corridor","title_page":"    A brief history of North America's most vital trade corridor - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"U.S. President Donald Trump waves next to Canadian Prime Minister Justin Trudeau, following a family photo at the G7 Summit expanded session in Taormina, Sicily, Italy May 27, 2017. REUTERS/Jonathan Ernst\nLong before highways and railroads covered the vast expanses of North America, crucial trade was conducted through the towns and outposts located along the shores of the Great Lakes and the St. Lawrence River.\nThis region is integral in both U.S. and Canadian histories, and it's still the most vital trade corridor in North America today. In fact, every year 230 million metric tonnes of cargo pass through these important waterways, and it's estimated that an impressive 30% of total U.S.-Canada economic activity takes place in the broader Great Lakes region itself.\nToday's infographic comes to us from the Chamber of Marine Commerce, and it uses data from the a recent report covering the economic impacts of maritime shipping in the Great Lakes-St. Lawrence region.\nA CRUCIAL TRADE CORRIDOR\nFreighter trade in the Great Lakes originally gained prominence in the 1840s, when copper and iron ore were discovered in the areas surrounding the lakes. This kickstarted large-scale shipping, and was the catalyst that led to the familiar lake freighters that are often seen on the waters now.\nIn modern times, these metals are just one of many different categories of products that can be found aboard active vessels.\nHere are the most important types of cargo that make up the $77.4 billion (C$100 billion) of goods that flow through these lakes and waterways each year:\nIron ore, aluminum, and finished steel\nLimestone and cement\nGrain (wheat, barley, soybeans, corn, and canola)\nPetroleum products such as gasoline\nFertilizers, sugar, and road salt\nContainers filled with consumer goods or manufactured products\nOversized cargo, such as wind turbines or other machinery\nThere are 100+ port cities and towns that are connected through the waterways, and the region facilitates trade to 60+ countries, as well.\nTHE ECONOMIC IMPACT\nWhat are the economic benefits stemming from all the trade that originates in these 2,300 miles (3,700 km) of river and lake systems?\nAccording to the most recent edition of the report, marine cargo and vessel activity generated a total of $45.6 billion of economic impact in the U.S. and Canada, including $17.9 billion of personal income and $9 billion of tax revenue. Further, it's estimated that 328,500 jobs have been created or are sustained by port activity, with the majority of them in places like Ontario, Quebec, Michigan, Indiana, and Ohio.\nEven in the digital age, physical goods (food, materials, machinery, consumer goods, etc.) are needed each day to keep the economy humming along - and in that respect, the Great Lakes-St.Lawrence region will remain a vital and important trade corridor for both countries for a long time.","url":"https://www.businessinsider.com/a-brief-history-of-north-americas-most-vital-trade-corridor-2018-7"}
