{"authors":["Jeff Desjardins","Visual Capitalist"],"date_download":"2018-10-30 23:04:32","date_modify":"2018-10-30 23:04:32","date_publish":"2018-07-25 00:00:00","description":"Tech companies are in constant negotiations to acquire startups that could help them in the future. Google has made the most acquisitions, with an average of nearly a dozen a year. Microsoft, Cisco and IBM make fewer acquisitions, but the companies they buy tend to have higher valuations.","filename":"data/vaneerConsumption/AbriefhistoryofmajortechacquisitionsintheUS.json","image_url":"https://amp.businessinsider.com/images/5b58bf537daf6d1e008b4594-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_a-brief-history-of-major-tech-acquisitions-in-the-us-2018-7_1540940672.html","title":"A brief history of major tech acquisitions in the US","title_page":"    A brief history of major tech acquisitions in the US - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Business Insider\nTo stay successful in tech, companies must find a way to walk alongside the cutting edge of innovation.\nCompanies do this partially by devoting a large portion of their resources towards research and development (R&D) - but to hedge their bets, these companies also are in constant negotiations to gobble up new startups that could be strategic to their futures.\nIn this giant game of Pac-Man, most of the acquisitions are small and sequential, just like the dots that make up the arcade game's classic maze. That said, sometimes these tech giants get lucky, such as in Facebook's acquisition of Instagram, and buyouts turn into power-ups that can change the dynamics of the game entirely.\nTECH ACQUISITIONS BY COMPANY\nToday's interactive infographic comes to us from IG and it allows you to compare the tech acquisitions made by dominant companies such as Facebook, Apple, IBM, or Cisco.\nAcquisitions can be sorted by industry filters (i.e. e-commerce, security, etc.) and different acquiring companies can be switched in. There are also different tabs that show total M&A expenditures by company, M&A activity by CEO, and frequency of acquisitions measured in quantity per year.\nTHE BIG PICTURE\nBefore we go into specific acquisitions, let's look at the big picture using images pulled from the interactive version of the graphic.\nHere is a comparison of the number of acquisitions made since 1991, for each major company on the list:\nVisual Capitalist\nGoogle has made the most acquisitions, averaging about 10 to 11 per year. That adds up to a total of 214 since the company was founded.\nVisual Capitalist\nInterestingly, while Google has had the most acquisitions, it only ranks in 6th out of this group in terms of dollars spent. Giants like Microsoft, Cisco, and IBM may make fewer acquisitions, but the companies they do buy tend to be more established with higher valuations.\nAs an example of this: Microsoft bought LinkedIn in 2016 for $26.2 billion. That's more than Amazon has spent on all of its acquisitions (including Whole Foods) combined.\nTHE BIG FIVE\nFinally, here's a comparison of the big five - Amazon, Apple, Microsoft, Facebook, and Google (Alphabet) - which are also the five largest companies by market capitalization in the United States.\nVisual Capitalist\nOn the interactive version, it's possible to highlight each acquisition to get the deal value and company name.\nBut, even on the static version above, it's noticeable that each of the Big Five has made at least one real sizable acquisition. Those are the circles that stand out the most on the timeline:\n2011: Google buys Motorola for $12.5 billion\nGoogle buys Motorola for $12.5 billion 2014: Facebook buys WhatsApp for $19 billion, and Apple buys Beats for $3 billion\nFacebook buys WhatsApp for $19 billion, and Apple buys Beats for $3 billion 2016: Microsoft buys LinkedIn for $26.2 billion\nMicrosoft buys LinkedIn for $26.2 billion 2017: Amazon buys Whole Foods for $13.7 billion\nThe gobbling activity for these Big Five has continued into 2018, as well.\nIn fact, just in June 2018, Microsoft announced the acquisition of code repository GitHub for $7.5 billion. The deal is expected to close by the end of the year.","url":"https://www.businessinsider.com/a-brief-history-of-major-tech-acquisitions-in-the-us-2018-7"}
