{"authors":["Jeff Desjardins","Visual Capitalist"],"date_download":"2018-10-30 23:35:58","date_modify":"2018-10-30 23:35:58","date_publish":"2018-07-18 00:00:00","description":"There have been a number of trade fights throughout history. They usually only cause economic effects on the involved countries.  But in some cases, trade wars can have political and diplomatic consequences worldwide.","filename":"data/vaneerConsumption/AbriefhistoryofUStradewars.json","image_url":"https://amp.businessinsider.com/images/5b4ce6984474db3d008b4831-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_a-brief-history-of-us-trade-wars-2018-7_1540942558.html","title":"A brief history of US trade wars","title_page":"    A brief history of US trade wars - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A boy who is waiting to greet then-U.S. Secretary of State Hillary Clinton at the National Museum makes a face while holding the U.S. and Chinese flags in Beijing May 4, 2012. REUTERS/Shannon Stapleton\nHistory is full of trade wars.\nIn the majority of cases, the consequences are mostly economic - trade barriers are enacted, and then retaliatory measures are used to counter. Relations can continue to escalate until an understanding can be reached by both parties.\nIn the minority of cases, trade wars can lead to world-changing consequences.\nYou may remember that the Boston Tea Party of 1773 was a bold response to an unfair trade measure imposed by a ruling power, and it proved to be a key catalyst that led to the American Revolution.\nMeanwhile, the Opium Wars occurred after the Qing Dynasty (China) tried to prevent British merchants from selling opium to the Chinese in the 1830s. These trade barriers led to armed conflicts, and effectively put the nail in the coffin of the Qing Dyasty - the start of China's infamous \"century of humiliation\".\nU.S. TRADE WARS\nToday's chart pulls together details on some of the biggest trade conflicts in modern U.S. history.\nHere are some of the more interesting U.S. trade wars, and how they compare to the current spat that is evolving with major trade partners:\n1. Smoot-Hawley, 1930 Imposed during The Great Depression, the Smoot-Hawley Act is almost universally recognized by economists and economic historians as triggering a trade war that exacerbated the recovery.\n2. Chicken Friction, 1963 Factory farming of chicken in the U.S. ended up catching European farmers off guard. French and German authorities responded by imposing tariffs, and the U.S. then taxed imports such as trucks and brandy.\n3. Jabs at Japan, 1981 Japan's mid-century rise led to the country becoming an export powerhouse. As Japanese cars flooded the U.S. market, intense pressure eventually led to the signing of a Voluntary Export Restraint (VER) agreement that limited sales in the United States. During this same timeframe, the two countries also squabbled about other goods like electronics, motorcycles, and semiconductors.\n4. War of the Woods, 1982 The Canada-U.S. Softwood Lumber dispute kicked off in 1982, but it inevitably resurfaces in the news every few years.\n5. Pasta Spat, 1985 The U.S. was displeased with the level of access for citrus products in Europe, and put a tariff on pasta products. Europe retaliated by taxing walnuts and lemons from the States.\n6. Battle of the Bananas, 1993 Another agricultural trade war, the Battle of the Bananas occurred after Europe slapped tariffs on the import of Latin American bananas. Many of these companies, owned by Americans, were not impressed. In response, there were eight separate complaints filed to the World Trade Organization (WTO). They weren't resolved until 2012.\n7. Steel Salvoes, 2002 These were the last major U.S. steel tariffs introduced before the more recent ones. The goal was similar: to revive the steel industry in the country. However, after a period of brief stability, jobs continued to decline. The European Union responded by taxing oranges exported from Florida.","url":"https://www.businessinsider.com/a-brief-history-of-us-trade-wars-2018-7"}
