{"authors":[],"date_download":"2018-10-30 20:29:05","date_modify":"2018-10-30 20:29:05","date_publish":"2015-09-09 22:34:55","description":"On any given day, one in three MARTA employees is absent from work because of an unplanned event. And for bus drivers, maintenance workers or train operators, that absence rate exceeds 50 percent.","filename":"data/vaneerConsumption/AbsentemployeescostingMARTAmillions.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_transportation_absent-employees-costing-marta-millions__1540931345.html","title":"Absent employees costing MARTA millions","title_page":"Absent employees costing MARTA millions","title_rss":"NULL","source_domain":"ajc.com","text":"On any given day, one in three MARTA employees is absent from work because of an unplanned event. And for bus drivers, maintenance workers or train operators, that absence rate exceeds 50 percent.\nPassengers feel the effects when they deal with late buses or trains, or with cranky workers who were called in on their day off to cover for someone.\nMARTA feels the effects in its bottom line. In 2012, a consultant’s audit found the high rate of call-outs cost MARTA about $11 million a year. Another assessment by a separate consultant late last year found that those costs are rising. Unplanned absences now sap $13.6 million from MARTA’s budget.\nThe transit agency’s board voted Sept. 3 to outsource absence management to a private company as a way to rein in those costs through closer oversight.\n“Our customers benefit, so we don’t have lapses in on-time performance,” said MARTA CEO Keith Parker. “Secondly, it benefits our employees, because sometimes folks aren’t excited about being called in on their day off to fill in for somebody. And third, it benefits taxpayers. If administered properly, we should see a savings.”\nMARTA had been spending $3.1 million a year to manage different types of employee leave internally, including vacation, sick leave and disability programs. The contract for UPMC (University of Pennsylvania Medical Corp.) WorkPartners to manage short and long-term sick leave, as well as family and medical leave, will cost $1.7 million over a three-year period.\nAttendance at issue\nAll those absences are giving MARTA a black eye at a time when it wants to present a pretty face to state lawmakers. The transit agency is lobbying for legislation in 2016 that would give voters the ability to approve an additional half-percent sales tax. The money from such a tax could fund future rail expansions.\nThe problem is there are so many different types of leave. And each is managed through different offices of the transit agency, so that it was nearly impossible to track, according to Parker.\n“There’s no central place where I can get a clear answer about what was our attendance yesterday, or what was it last month,” Parker said.\nBus and paratransit drivers are racking up the highest number of unplanned absences by far, according to a recent assessment.\nMARTA employees sicker?\nRobin Henry, assistant general manager of human resources for MARTA, said bus operators in particular are exposed to factors that can be detrimental to their health. For starters, they sit all day with few breaks. And they have the mental stress of coping with Atlanta traffic and unruly passengers while staying on schedule.\nFactor in the average age of a MARTA worker, which is 47 — 6 years older than the average age of the U.S. workforce — and you have employees who tend to have more chronic health conditions, Henry said. They also tend to call out sick rather than risk a day of poor performance. Working partial days is rarely an option. A shift, once started, needs to be finished.\nHere’s how that could play out in real life:\nAs opposed to an office worker, who might power through a migraine, front-line workers such as bus drivers would have more difficulty doing that because they’re dealing with customers and driving at the same time. Many would call out sick rather than face a full workday, according to Henry.\nWell, some aren’t really ill\nThen there are the people who are faking a crisis or illness. Nobody knows how pervasive the problem is, but few doubt that abuses of the system have been occurring.\nA paratransit service driver who has worked for MARTA for more than a decade said much of the problem is management’s fault, because employee needs or preferences aren’t considered when scheduling shifts. In addition, he said, many coworkers are single parents with no one to rely on when a child gets sick or needs to be out of school. The Atlanta Journal-Constitution granted him anonymity because his job could be in jeopardy if he spoke out.\nSome coworkers also take unfair advantage of the protection afforded by the Family and Medical Leave Act to miss work, he said. The federal law requires employers to provide job-protected and unpaid leave for employees who qualify. (Reasons people seek leave under FMLA could include having a child, caring for a relative, or recovering from a personal ailment.)\n“They say if you get FMLA, your job will be covered and there is nothing they can do to you,” said the driver. “To me it’s wrong. FMLA should really be used by someone that needs it.”\nThe hope is that the new vendor will be able to screen FMLA and other unplanned leave claims more closely.\nWith added scrutiny, “the people beating the system right now will come to the forefront, and we’ve got a lot of people beating the system,” said Freda B. Hardage, a Fulton County representative on the MARTA Board.\nBy outsourcing leave management, MARTA is doing what many large employers in the country have already done. FMLA leave policy is so complicated that outside vendors are increasingly being brought in to manage these programs, said Phil LaPorte, a labor relations expert and professor emeritus at Georgia State University College of Law.\n“They have greater expertise in dealing with it on a day-to-day basis, and they can spend the time to require the medical verification of the condition the employee is alleging,” LaPorte said.\nUnion relations\nMARTA employs about 4,900 people, 62 percent of whom are unionized.\nA representative of Amalgamated Transit Union Local 732 did not respond to multiple calls over the past week seeking comment about MARTA’s decision to outsource leave of absence management.\nA new union contract approved in January tightens some provisions that management said were being exploited.\nIt reduced from 18 months to 12 months the duration for which employees could be out of work on approved leave. The new contract also requires a joint committee of union and management representatives to review employees’ attendance records when they have missed more than 47 workdays in a year. Under the old contract the threshold for review was 60 days, Henry said.\nLastly, investigations of an employee infraction must be completed and a decision made about termination or disciplinary action within 10 days. Previously, the wording of the contract was ambiguous, so an investigation could drag on much longer, Henry said.","url":"https://www.ajc.com/news/transportation/absent-employees-costing-marta-millions/mjVJEoRLobhBy403bLpYlI/"}
