{"authors":["Awr Hawkins"],"date_download":"2018-10-30 21:50:15","date_modify":"2018-10-30 21:50:15","date_publish":"2015-12-09 23:43:01","description":"Acting legend Kurt Russell responded to questions on the San Bernardino attacks by saying it's \"absolutely insane\" to \"think gun control will change terrorists' point of view.\"","filename":"data/vaneerConsumption/AbsolutelyInsanetoThinkGunControlWillChangeTerrorists.json","image_url":"https://media.breitbart.com/media/2015/12/Snake.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_12_09__1540936215.html","title":"'Absolutely Insane' to Think Gun Control Will Change Terrorists","title_page":"Kurt Russell: 'Absolutely Insane' to Think Gun Control Will Change Terrorists","title_rss":"NULL","source_domain":"breitbart.com","text":"In recent interview with Jeffrey Wells, acting legend Kurt Russell responded to questions on the San Bernardino attacks by saying it’s “absolutely insane” to “think gun control will change terrorists’ point of view.”\nThis was preceded by Russell explaining that he doesn’t “understand concepts of conversation about gun culture” because “we’ve lived with guns since, what, the 7th Century or something?”\nBut according to Hollywood Elsewhere, Wells continued to paw at Russell, combining the emphasis on terrorism with the suggestion that guns are something “disenfranchised white guys need” so they can “feel good about themselves.”\nRussell said:\nIf you think gun control is going to change the terrorists’ point of view, I think you’re, like, out of your mind. I think anybody [who says that] is. I think it’s absolutely insane. The problem, the problem that we’re having right now to turn it around…you may think you’ve got me worried about you’re gonna do? Dude, you’re about to find out what I’m gonna do, and that’s gonna worry you a lot more. And that’s what we need. That will change the concept of gun culture, as you call it, to something [like] reality. Which is, if I’m a hockey team and I’ve got some guy bearing down on me as a goal tender, I’m not concerned about what he’s gonna do — I’m gonna make him concerned about what I’m gonna do…\nWells responded with, “I get that,” and Russell seized the opportunity to go back to an earlier question about the line separating fantasy and reality and said that reality is doing what has to be done to “stop” the guy coming at you–whether that guy is in the hockey scenario or in a scenario hedged in by terrorism. And once you “stop him,” Russell said, “That’s when things change.”\nWells countered by sticking with the gun control theme, saying, “Obama’s point was that the guys on the no-fly list, [they’re on it] for good reason because of terrorist connections or suspicions…they can get hold of a gun pretty easily.”\nRussell said, “They can also make a bomb pretty easily. So what? They can also get knives and stab you. Whaddaya gonna do about that? They can also get cars and run you over. Whaddaya gonna do about that?”\nWells said, “They didn’t kill the people in San Bernardino with cars.”\nRussell retorted, “But they’ve killed others that way, haven’t they? Yeah, yeah. Whaddaya gonna do? Outlaw everything? That isn’t the answer.”\nWells then said the words, “Just put some controls…” to which Russell responded, “Put some controls? What, so the people, so the people who want to defend themselves can’t?”\nWells tried to right the ship, saying, “No, not so you can’t, just so the idiots can’t get hold of them [so easily], that’s all.”\nRussell said, “You really believe they’re not going to? Are you serious about that? What good will that…? Oh my God. You and I just disagree.”\nListen to the audio of the interview here.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/entertainment/2015/12/09/kurt-russell-absolutely-insane-think-gun-control-will-change-terrorists/"}
