{"authors":["Jane Flanagan In Cape Town For Mailonline"],"date_download":"2018-10-23 02:47:22","date_modify":"2018-10-23 02:47:22","date_publish":"2017-03-10 12:02:20","description":"Engaged couple Emlyn Culverwell and Iryna Nohai - who is 11 weeks pregnant - spent six weeks in an Abu Dhabi jail for extra-marital sex before being dramatically released without charge.","filename":"data/vaneerConsumption/AbuDhabicouplejailedforsexfreedandgoforbabyscan.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E224E3800000578-0-image-a-24_1489146999669.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300942_Abu-Dhabi-couple-jailed-sex-freed-baby-scan_1540262842.html","title":"Abu Dhabi couple jailed for sex freed and go for baby scan","title_page":"Abu Dhabi couple jailed for sex freed and go for baby scan | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An unmarried couple arrested at a hospital in Abu Dhabi after a doctor discovered that the woman was pregnant, have been dramatically released after being held for six weeks in jail.\nSouth African Emlyn Culverwell phoned his family early today to tell her 'we're free',' his ecstatic mother told MailOnline.\nMr Culverwell, 29, and his fiancée Iryna Nohai, 27, were reported for having unlawful sex outside of marriage on 29 January after Miss Nohai went to hospital suffering from stomach cramps. She had no idea she was pregnant, Linda Culverwell revealed.\nHaving sex outside of marriage is illegal in the United Arab Emirates and those who are convicted can face long jail sentences.\nAfter receiving little or no news of the pair since they were held separately at Al Wathba prison in the UAE capital, Mrs Culverwell, 51, got a call out of the blue.\n'It was Emlyn – he just said, \"hi mum, it's me\". I couldn't believe it! He was the last person I expected to hear from,' the mother of two told MailOnline.\nFree: Tired and pale, 11 weeks pregnant Iryna Nohai and fiance Emlyn Culverwell are delighted to be reunited after six weeks in separate jails for sex outside marriage\nTogether: The couple, who got engaged recently, were imprisoned after Miss Nohai went to the doctor complaining of stomach cramps and discovered she was pregnant\nNo news: The families of the couple heard very little about them in recent weeks until Mr Culverwell rang his mother out of the blue and said: 'Hi mum, it's me'. Pictured: Miss Nohai before her ordeal\n'I was crying and shouting like a mad person, it seemed so unreal.\n'It was the first time I have spoken to him since before they were arrested. He said they were fine, just very tired and emotionally drained. He said they had suddenly been released and all the charges dropped.'\nThe relieved mother, who felt unwell and was hospitalised after learning of her only son's arrest, said they now plan to marry 'quietly and quickly' and continue with their lives in the Gulf.\n'Emlyn said Iryna is okay, she is quite a soft and timid person but he says she is holding up.\n'I am so relieved that they are out. I was alone when I got the call and after I put the phone down, I was crying and celebrating all on my own, I didn't know what to do with myself,' said Mrs Culverwell, who has not seen her son for five years, and has never met her daughter-in-law to be.\nFuture: Mr Culverwell and Miss Nohai plan to marry 'quickly and quietly' in Abu Dhabi and to continue living in the Middle Eastern country\nExpat life: The couple had talked about getting married for some time and Mr Culverwell proposed to Miss Nohai two days before they were arrested\n'I hope they can work past this and get on with their lives. The wedding is going to be very quiet and I would rather they just get married quietly and quickly and maybe do something bigger later on and renew vows.\nRelief: Linda Culverwell was alone when she found out they had been released: 'I was crying and celebrating all on my own, I didn't know what to do with myself'\n'They are apparently looking very thin and tired, but the baby is fine and Iryna is 11 weeks pregnant.\n'It will be my first grandchild and I am so excited. Emlyn will make a great dad, he loves children and has always wanted them.'\nThe couple, who both work for Yas Waterworld in the UAE capital, got engaged just two days before their arrest, Mrs Culverwell said from her home in Port Alfred, a quiet town in South Africa's remote Eastern Cape.\n'They had been talking about getting married for a long time, but had wanted me and Iryna's mother to be there.\n'I explained that I couldn't get there, and told Emlyn it didn't matter if I was there or not.\n'They didn't want a long engagement, and Emlyn proposed to Iryna two days before they were arrested.\n'She had no idea he was going to propose, and Emlyn wanted to surprise me and Iryna's mother by buying us flights to get over there for the wedding,' she explained.\nAccording to local laws, Miss Nohai was suspected of 'Zina', the Islamic legal term referring to unlawful sexual intercourse, which the UAE has criminalised. If found guilty, women and couples are either deported or imprisoned in the country for at least a year\nMr Culverwell has been working in the UAE for the past five years as a lifeguard at Yas Waterworld – the company where his Ukranian fiancée worked in administration.\nThey became a couple almost three years ago.\nAccording to local laws, Miss Nohai was suspected of 'Zina', the Islamic legal term referring to unlawful sexual intercourse, which the UAE has criminalised.\nWomen and couples found guilty of Zina in UAE are either deported or imprisoned in the country for at least a year.\nHundreds of women are imprisoned each year for the crime, including pregnant women and rape victims.\nAnguish: Miss Nohai mother Natalya heard very little of her daughter while in jail but confirmed that all charges had been dropped\nTogether: The pair met in Abu Dhabi and became an item three years ago. Mr Culverwell works as a lifeguard at Yas Waterworld while Miss Nohai is an administrator at the attraction\nThe South African's father Karl also received a short call with the good news.\n'Emlyn sounded in good spirits, but very tired. They just want to put this ordeal behind them and they are obviously relieved that the baby is fine,' he told MailOnline.\nIryna's mother Natalya added: 'All the charges against Iryna and Emlyn have been dropped.'","url":"https://www.dailymail.co.uk/news/article-4300942/Abu-Dhabi-couple-jailed-sex-freed-baby-scan.html"}
