{"authors":["Jerome Hudson"],"date_download":"2018-10-30 18:52:13","date_modify":"2018-10-30 18:52:13","date_publish":"2016-01-20 20:56:35","description":"White voting members of The Academy of Motion Picture Arts and Sciences (AMPAS) are responding to accusations of racism against the organization after last week's announcement of Oscar nominations that included zero non-white entertainers.","filename":"data/vaneerConsumption/AcademyVotersFireBackatOscarsSoWhiteCrowdOffensivetoCallUsRacist.json","image_url":"https://media.breitbart.com/media/2016/01/12-Years-A-Slave-Oscars-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_01_20__1540925533.html","title":"Academy Voters Fire Back at 'Oscars So White' Crowd: 'Offensive' to Call Us Racist","title_page":"Academy Voters Fire Back at 'Oscars So White' Crowd: 'Offensive' to Call Us Racist | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"White voting members of The Academy of Motion Picture Arts and Sciences (AMPAS) are responding to accusations of racism against the organization after last week’s announcement of Oscar nominations that included zero non-white entertainers.\n“I voted for a number of black performers, and I was sorry they weren’t nominated,” AMPAS member and actress Penelope Ann Miller told The Hollywood Reporter. “But to imply that this is because all of us are racists is extremely offensive. I don’t want to be lumped into a category of being a racist because I’m certainly not and because I support and benefit from the talent of black people in this business. It was just an incredibly competitive year.”\nAcademy president Cheryl Boone Isaacs, who is black, said she was “both heartbroken and frustrated about the lack of inclusion” and has vowed to bring “big change” following backlash and calls to boycott next month’s Oscar’s ceremony.\n“There were a lot of omissions of white people,” Miller added, “that I think were just as disappointing. I’m sure [Spotlight‘s] Michael Keaton is bummed, you know?”\n“I have voted for many people of color for awards,” said Jeremy Larner, a civil rights activist in the 1960s and a member of the Academy’s writers branch. “I happen to think Straight Outta Compton is not a great film for reasons of structure and substance. I can imagine it is a powerful affirmation for those who share the assumptions of its music and see it as fans. But to me, a good film has to show a lot more than this one does.”\nTo date, as Breitbart News reports, Spike Lee, actress Jada Pinkett Smith, rapper Snoop Dogg, and documentary filmmaker Michael Moore have all joined Al Sharpton in calling for a boycott of the 88th Academy Awards airing February 28.\nFollow Jerome Hudson on Twitter @jeromeehudson.","url":"https://www.breitbart.com/entertainment/2016/01/20/academy-voters-fire-back-at-oscars-so-white-offensive-to-call-us-racist/"}
