{"authors":["Tom Ciccotta"],"date_download":"2018-10-30 18:48:50","date_modify":"2018-10-30 18:48:50","date_publish":"2016-12-23 00:36:01","description":"An editorial from Salon claims that naming and shaming politically intolerant professors on college campuses is a 'McCarthyist witch hunt.'","filename":"data/vaneerConsumption/AcademicCensorshipIstheProfessorWatchlistaSignofaNewMcCarthyism.json","image_url":"https://media.breitbart.com/media/2015/04/joe-mccarthy-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_12_22__1540925330.html","title":"Academic Censorship: Is the 'Professor Watchlist' a Sign of a 'New McCarthyism'?","title_page":"Academic Censorship: Is the 'Professor Watchlist' a Sign of a 'New McCarthyism'? | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"An opinion-editorial from Salon is claiming that a new online database of radical college professors is a sign of a new desire from the right to shame and blacklist progressive instructors at American institutions, but is this a fair criticism?\nThe Professor Watchlist, a project of Turning Point USA, is a database set up to identify radically progressive instructors at universities across the United States. Candidates for the database are selected by a team of curators who sift through tips from students. Typically, the Professor Watchlist will only add a candidate if there are pre-existing news stories about the instructor’s radicalism.\nCharlie Kirk, the founder of Turning Point USA, claims that the watch list was created in an effort to expose the radicalism that is overwhelmingly present in the modern American university. “Throughout the next 120 days, Turning Point USA will be running ads to make sure students, faculty, and administrators see that these professors made the Professor Watchlist.” Kirk said. “We believe these people need to be exposed.”\nInterestingly, detractors on the left are claiming that the watch list is a form of censorship – an attempt to shame and blacklist professors based on their political viewpoint. Do they have a point? How would conservatives feel if there was a database that tracked and highlighted excessively patriotic instructors? Or professors that held specific views on immigration?\nA column from Sophia A. McClennan of Salon is claiming that the watch list is not just detrimental to academic freedom on campuses but also “frightening” and a sign of a “new McCarthyism.”\nKirk’s list would just be a sad sign of what happens when a young, uneducated conservative pit bull decides to gain a name for himself by bolstering the myth of a dangerous left-wing professoriat poised to poison the minds of the young, if it weren’t so frightening. The problem with the list — besides its more than obvious McCarthyist witch-hunt tactics — is that it’s really stupid. It makes claims that have no basis in reality. It exaggerates. It creates crisis where there is none. And worst of all, it promises to increase conflict rather than improve it.\nAlthough it’s unclear exactly how Kirk’s watch list makes claims “that have no basis in reality,” the rest of McClennan’s concerns deserve to be addressed.\nMcClennan, who is a Professor of International Affairs and Comparative Literature at the Pennsylvania State University, not far away from where I attend university, suggests that the watch list is a “baseless witch hunt” that could potentially curtail academic freedom.\nMcClennan disgustingly attempts to draw a correlation between a gathering of Richard Spencer’s National Policy Institute the Professor Watchlist, based merely on the coincidence that Kirk and Turning Point USA announced the project two days after Spencer’s controversial conference. To McClennan, both Spencer’s gathering and Kirk’s professor watch list are both “frightening” consequences of Donald Trump’s victory in November’s election. To compare the two isn’t just irresponsible journalism, it’s dishonest.\nMcClennan cites Slate’s Rebecca Schuman, another journalist who ignorantly drew a correlation between Spencer’s conference and the launch of the Professor Watchlist.\nIt doesn’t matter if the site wasn’t meant as a No-Goodnik Intellectual Kill List one day after Richard Spencer and his Jungen screeched Heil Trump. Intentionally or not, the Professor Watchlist, simply by being a self-styled watch list, has aligned itself with the ugly, frightening new political status quo.\nMuch like Vanity Fair’s Kurt Eichenwald, who had a bizarre appearance on Tucker Carlson’s Fox News show last week, progressives who view the Professor Watchlist as an academic blacklist of sorts, are becoming dangerously unhinged. They conveniently ignore the reality that American universities are dominated by progressives, that academic departments are overwhelmingly progressive, and that entire academic departments are often void of non-progressive curricula.\nBoth McClennan and Schuman conveniently ignore a crucial message that greets visitors to the Professor Watchlist website, which explains that those behind the watch list will always defend the right of professors to believe and even teach what they wish. “TPUSA will continue to fight for free speech and the right for professors to say whatever they wish; however students, parents, and alumni deserve to know the specific incidents and names of professors that advance a radical agenda in lecture halls.”\nPerhaps there is something Orwellian-sounding about a “watch list,” but if we insist upon the power dynamic theory that progressives have constructed most of their worldview around, a call for transparency with regards to what professors are teaching from the campus minority that is conservative students is far from unreasonable considering how overwhelmingly progressive American academy has become. Unlike the Hollywood blacklist, that happened under McCarthyism in the 1950s, those targeted by the Professor Watchlist are in positions of great influence, and in environments that are wholly supportive. In a report, The Economic Watch Journal found that liberals professors outnumber conservative professors 3,623 to 314. As a result, progressive radicalism often goes unnoticed on campuses.\nIn a private conversation that I had following the election with a Hillary-supporting professor, he told me that he was concerned about the social stigma for both faculty and students surrounding conservative and libertarian dissent to campus’ progressive orthodoxy. He went as far to suggest that it would be a national crisis if students from groups that are traditionally considered to be marginalized were as ostracized on the college campus as he believed conservative and libertarian students had become.\nWhether it’s alumni, parents of students, or students deciding which instructors to take, a database that increases transparency by pulling back the curtain on what certain professors are teaching in the classroom does not restrict academic freedom. In reality, it could likely provide a catalyst for students to finally demand a fair and ideologically-balanced education.\nTom Ciccotta is a libertarian who writes about Free Speech and Intellectual Diversity for Breitbart. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart.com","url":"https://www.breitbart.com/tech/2016/12/22/professor-watchlist-sign-new-mccarthyism/"}
