{"authors":[],"date_download":"2018-10-31 00:04:59","date_modify":"2018-10-31 00:04:59","date_publish":"2016-10-07 00:00:00","description":"What is CalPERS? Here are the basics on the powerful pension fund","filename":"data/vaneerConsumption/ACalPERSprimerTherulesonpublicpensionsinCaliforniaandwhomakesthem.json","image_url":"https://www.trbimg.com/img-5862c4b0/turbine/la-me-el-monte-pension-20161227-photos-007/600","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/latimes.com/projects__1540944299.html","title":"A CalPERS primer: The rules on public pensions in California - and who makes them","title_page":"A CalPERS primer: The rules on public pensions in California — and who makes them - Los Angeles Times","title_rss":"NULL","source_domain":"calmatters.org","text":"What is CalPERS? The California Public Employees’ Retirement System is the largest pension fund in the country. It manages investments for more than 1.8 million people, including current and former employees of the state, most city and county workers, public school employees other than teachers (they have their own pension fund) and employees of other local agencies, such as water districts. This series is a partnership of\nWhere does the money come from? The fund has about $300 billion in assets. That’s derived from three sources: Public employees make contributions by payroll deduction, and the agencies they work for chip in an amount equal to a percentage of each employee’s paycheck. CalPERS invests that money in stocks, bonds and real estate, and the return on those investments constitutes the third source of pension funding.\nHow has that worked out? Most of the money needed to meet pension obligations is supposed to come from investment gains. But two market crashes — the bursting of the dot.com bubble in 2000 and the collapse of the housing market in 2008 — wiped out tens of billions of dollars of value and put the CalPERS fund in a deep hole. It now owes about $100 billion more to current and future retirees than it has set aside to pay for those benefits.\nHow much do employees contribute toward their pensions? And how big is the taxpayers’ share? The largest group of state employees — more than 200,000 office workers at the Department of Motor Vehicles, the Department of Social Services and dozens of other agencies — contributed between 5% and 11% of their salaries in 2015. The state (read: taxpayers) kicked in an amount equal to 24% of employees’ salaries. California Highway Patrol officers, who receive among the most generous pensions in the state, contributed 11.5% of their salaries. The agency contributed a sum equal to 42% of officers’ pay.\nWho runs the show? The 13-member CalPERS board of administration hires (and can also fire) the retirement system’s chief executive officer. The CEO oversees staff members who select and manage investments and who, crucially, determine the size of the required annual contributions from state and local government agencies. ADVERTISEMENT\nHow do people get on the board? Six of the 13 members are elected by active and retired employees to represent different constituencies, including state government workers, civil servants at other public agencies, and school employees. The governor appoints two members: a local elected official and a representative of the life insurance industry. Legislative leaders select a member to represent the public. That makes nine. The remaining four members — the state treasurer, the state controller, the director of the California Department of Human Resources and a representative of the State Personnel Board — serve ex officio.\nWhich way does the board lean? Its makeup is supposed to ensure a diversity of views and balanced decision-making. In practice, the board is heavily influenced by organized labor. The president, Rob Feckner, is a former bus driver for the Napa Valley Unified School District and a former president of the California School Employees Assn. He was elected to the board by school employees. Two other board members elected by public workers, Michael Bilbrey and J.J. Jelincic, are former presidents of large public employee unions. Another, Theresa Taylor, is vice president and secretary-treasurer of the Service Employees International Union, Local 1000, which represents 95,000 state workers. Ron Lind, who was appointed by legislators, is former president of the United Food & Commercial Workers International. Share your story Do you have a government-funded pension? What has been your experience? The board is fiercely independent of the Legislature and governor. In 1992, after former Gov. Pete Wilson took more than $1 billion from the fund to help close a budget deficit, labor sponsored a successful ballot measure giving the board sole authority over the fund’s assets and administration. The measure also mandated that the board’s first responsibility is to maximize retirement benefits for retirees, not to limit costs for taxpayers.\nHas anyone tried to dilute labor’s influence? In 2012, Gov. Jerry Brown proposed adding two board seats, to be filled by people with financial expertise and no claim to a CalPERS pension or any connection to a public employee union. Legislators rejected the idea.\nFollow @jackdolanLAT on Twitter | Contact the reporter.\nCredits: Design and production by Lily Mihalik\nCalifornia's Pension Crisis: Coming next in the series Gov. Jerry Brown brokered the biggest pension rollback in California history. But how much of the problem has he really solved? Sign up for our Essential Politics newsletter to receive the next installment in your inbox Privacy policy","url":"http://www.latimes.com/projects/la-pol-ca-calpers-primer-pensions/"}
