{"authors":["Joseph D. Lyons"],"date_download":"2018-10-31 01:48:04","date_modify":"2018-10-31 01:48:04","date_publish":"2018-09-11 14:37:45","description":"Sen. Susan Collins of Maine has not confirmed whether she will support Judge Brett Kavanaugh's bid to join the highest court in the land. But if she does, activists are already working to fund the campaign of whomever her 2020 opponent ends up…","filename":"data/vaneerConsumption/ACampaignForSusanCollinsKavanaughVoteHasNearlyRaised1MillionHerOfficesIre.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/11/4d41e193-4476-4f4d-83bb-34221b1259d9-getty-1020744210.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_a-campaign-for-susan-collins-kavanaugh-vote-has-nearly-raised-1-million-her-offices-ire-11868014_1540950484.html","title":"A Campaign For Susan Collins' Kavanaugh Vote Has Nearly Raised $1 Million - & Her Office's Ire","title_page":"A Campaign For Susan Collins' Kavanaugh Vote Has Nearly Raised $1 Million — & Her Office's Ire","title_rss":"NULL","source_domain":"bustle.com","text":"Sen. Susan Collins of Maine has not confirmed whether she will support Judge Brett Kavanaugh's bid to join the highest court in the land. But if she does, activists are already working to fund the campaign of whomever her 2020 opponent ends up being. A group of Maine political groups raised money to push Collins towards \"no\" on Kavanaugh. They're nearly to $1 million — all of which will be returned if she's a \"hero\" and opposes his confirmation, they say.\nMaine People’s Alliance and Mainers for Accountable Leadership teamed up with activist Ady Barkan for the online fundraiser. It's similar to a GoFundMe but on crowdpac.com, and as of Tuesday, it had raised $983,648.\nUPDATE: Marie Follayttar, the co-director of Mainers for Accountable Leadership, says in a statement to Bustle, \"The idea of Susan Collins attacking an effort by 35,000 small dollar donors as bribery is politics at its worst. Thousands of Mainers are trying desperately to tell her that she needs to protect abortion access and critical health care coverage across the country by voting 'no' on Kavanaugh.\"\nFollayttar adds that if Collins doesn't listen to constituents and explain why his views are \"not disqualifying,\" \"we absolutely have the right to prepare to unseat her given everything Judge Kavanaugh would do on the Supreme Court to make life worse for Maine women, Mainers with pre-existing conditions and Mainers who care about fabric of our democracy,\" given that a Senate seat is not a lifetime appointment.\nEARLIER: The groups holding the fundraiser lay out two scenarios to potential donors. If Collins votes not to confirm Kavanaugh, then they don't take any of their money. But if she votes yes, then the donors' \"pledge will go to her opponent's campaign, once that opponent has been identified.\"\nThe group also has explained to Collins why they want her to \"to do the right thing.\" The groups write:\nYour swing vote could decide whether a rubber stamp for Trump’s anti-healthcare, anti-woman, anti-labor agenda gets confirmed to the Supreme Court–costing millions of Americans their healthcare, their right to choose, and their lives.\nAdy Barkan on YouTube\nCollins' office is none too happy about the endeavor and told The Daily Beast that the fundraiser is \"basically a bribe.\" To be clear, Collins doesn't get the money if she votes against the confirmation.\n\"Anybody who thinks these kinds of tactics work doesn’t know Sen. Collins,\" Annie Clark, Collins’ communications director, told the news site. \"These tactics will not work — Sen. Collins will make up her mind based on the merits of the nomination.”\nThe fundraising ask has been making rounds on social media with the hashtag #BeAHero. That was started by Barkan, the progressive activist that the Maine groups partnered with. He has ALS and has been an active voice on health care and fighting to keep the Affordable Care Act.\nWith the hashtag #BeAHero, Barkan tweeted, \"I may be losing my voice, but I can still send a message, and I have one for @SenatorCollins: If you vote for Kavanaugh we will fund your future opponent for 2020. Vote NO and #StopKavanaugh.\"\nTwitter users — and even celebrities like Rosie O'Donnell — have taken up the call. She, and others like Chelsea Handler and David Hogg, posted to Twitter with the same basic message. \"Lets show @SenatorCollins that we want her to vote NO on Kavanaugh. Pledge to this campaign. If she votes for @realdonaldtrump 's pick your money will go to fund her future opponent,\" O'Donnell wrote.\nCollins' current stance is that she's undecided. \"I know it’s frustrating to the press, but until I finish my review I’m going to defer my decision-making,” Collins told the Portland Press Herald on Friday. “I have been involved in confirmation hearings for six Supreme Court justices. I have always waited until hearings are done and until I have reviewed the paperwork and cases, et cetera.”\nThe fundraising call makes very clear what the groups' plan will be if Collins votes for Kavanaugh:\nIf you fail to stand up for the people of Maine and for Americans across the country, every dollar donated to this campaign will go to your eventual Democratic opponent in 2020. We will get you out of office.\nWith every dollar raised, that's more and more possible of an outcome.","url":"https://www.bustle.com/p/a-campaign-for-susan-collins-kavanaugh-vote-has-nearly-raised-1-million-her-offices-ire-11868014"}
