{"authors":["Ali Budner"],"date_download":"2018-10-31 00:07:26","date_modify":"2018-10-31 00:07:26","date_publish":"2016-10-07 00:00:00","description":"Cities and states across the country are facing public employee pension debt that is challenging and, in some cases, crippling their budgets. But some municipalities are experimenting with ways to solve that problem.","filename":"data/vaneerConsumption/ACaseStudyOnPensionReformSanJosesGrandCompromise.json","image_url":"https://www.capradio.org/media/8147581/SJPD%20giveaway%20items%20at%20career%20fair%20-%20Ali%20Budner.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/capradio.org/articles_2016_12_29__1540944446.html","title":"A Case Study On Pension Reform: San Jose's Grand Compromise","title_page":"\r\n        A Case Study On Pension Reform: San Jose's Grand Compromise - capradio.org\r\n    ","title_rss":"NULL","source_domain":"calmatters.org","text":"Cities and states across the country are facing public employee pension debt that is challenging and, in some cases, crippling their budgets. But some municipalities are experimenting with ways to solve that problem. In San Jose, California, voters passed a set of sweeping pension reforms back in 2012. The public employee unions fought back in court. Now a new initiative passed this November may offer a compromise that works.\nIt’s a rainy day in October. Three recruiting officers from the San Jose Police Department are standing behind a table in a bustling room on a nearby public university campus. Today is the school’s career fair and the SJPD booth is covered in schwag--stickers, pens, even tiny bottles of hand sanitizer--emblazoned with the Department’s logo. They’re hoping job-seekers will stop and apply.\nDeputy Chief, Michael Knox says staffing numbers are at a dangerous low. In fact, he says they’re down at least 300 street-ready officers right now. “It causes us to put an enormous amount of stress on the existing staff,” Knox says “to make up for everyone who has left this department.”\nHe blames the exodus mostly on a watershed moment back in 2012. That’s when San Jose voters passed local ballot measure B. The initiative poured vinegar into the sweet tea of public worker compensation deals by making sweeping cuts to retirement pensions. Current employees would have to pay more for their retirement benefits or take a less generous pension. New employees would be offered less. All public workers would lose their disability protections as well the certainty of their pensions, altogether if there wasa fiscal emergency.\n“That has made it increasingly difficult to compete with other agencies,” says Knox. “And not only to recruit but to retain our staff.”\nBut the man who pioneered Measure B -- former San Jose Mayor, Chuck Reed -- says pension reform was necessary. When he took office back in 2007, he inherited a massive budget deficit. To deal with it, first he did all the things that make people hate politicians. He laid people off, raised taxes, and made deep cuts to public services. But he sayspension costs were the real culprit.In the first two years of his term, the city’s pension debt had actually skyrocketed to almost a billion dollars. “And so when the choice was cutting services more, raising taxes more, or making some modification to retirement benefits,” Reed says, “the public was supportive of reasonable modifications.”\n“It’s not a hard and fast rule,” says Josh Rauh, professor of Finance at Stanford University. “But once more than 20 percent of the city's revenues are going towards public employee pensions, people start saying 'gee, this is untenable'. That's what happened in San Jose. They crossed that threshold.”\nMeasure B passed with nearly 70 percent of the vote. Reed says, “It felt like the people of San Jose agreed with me that we needed to do something about retirement costs.” He argues it’s something other cities and state of California should be doing, but aren’t.\nHe points to a framed editorial cartoon on his office wall. It shows California as a Titanic-like ship sinking into the sea. And two men with life jackets reading \"San Jose\" and \"San Diego\" (another city that passed its own version of pension reform) are watching it sink from their tiny lifeboat.\n“So San Diego and San Jose are rowing away in a pension reform lifeboat while the state of California sinks,” says Reed.\nBut public employee unions saw Measure B differently. They despised the new law. And it wasn’t just them. Some in the business community worried about its effect on city agencies, especially public safety.\nReginald Swilley, a co-owner of the Minority Business Consortium in San Jose, was so upset about the number of officers the police department lost after Measure B passed, he said he had trouble talking about it. He’s an African American businessman and activist. “You know the problem with police and black people around the country, right?” He says. “We need good police.”\nCritics of Measure B eventually got their say. Soon after voters passed the measure in 2012, the public employee unions challenged its legality. A superior court judge struck down a handful of the law’s provisions -- saying it was unconstitutional to alter benefits for current employees.\n“San Jose made a risky gamble and it failed,” says Tom Saggau, spokesperson for the San Jose police officers and firefighters. He was at the table when the city and the unions negotiated an entirely new voter initiative (Measure F) based on the court ruling. It passed by a healthy margin this November. It’s a compromise that both sides seem happy with.\nFor the workers, says Saggau, “it’s a vested benefit, that restores disability protections, and keeps a promise that if you do what you say you’re going to do, have a career here in San Jose, you're gonna have a retirement benefit that you’re gonna be able to support yourself on.”\nAnd the city says it will still save about $3 billion over the next 30 years. That’s because this compromise will significantly cut down on retiree health benefits and cost of living adjustments. It will also eliminate the “13th check” -- an annual bonus payment public workers had received in the years before 2012.","url":"http://www.capradio.org/articles/2016/12/29/a-case-study-on-pension-reform-san-joses-grand-compromise/"}
