{"authors":["John Hayward"],"date_download":"2018-10-30 19:57:28","date_modify":"2018-10-30 19:57:28","date_publish":"2015-04-24 14:30:42","description":"It's Accountability Theater, and we get a fresh performance every time scandals explode in the Obama Administration, because they know the public has a short attention span, and their faithful media has an even shorter one. |","filename":"data/vaneerConsumption/AccountabilityTheaterNobodyGotFiredOvertheVAScandal.json","image_url":"https://media.breitbart.com/media/2015/02/AP458723257918.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_24__1540929448.html","title":"Accountability Theater: Nobody Got Fired Over the VA Scandal","title_page":"Accountability Theater: Nobody Got Fired Over the VA Scandal | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Obama Administration and its new Secretary of Veterans Affairs, Robert McDonald, loudly claimed that sixty people lost their jobs over the Secret Death List scandal. According to the New York Times, the actual number is: zero.\nAs the Times recalls, soon after the “Sixty heads rolled!” headlines were written, the Department of Veterans Affairs backpedaled and said that only 14 people had actually been removed. That was a lie, too. As so often in the Obama years, it fell to a committee of congressional Republicans to flog the truth out of the Administration, and it took months of effort:\nThe documents given this month to the House Committee on Veterans Affairs, which provided them to The New York Times, show that the department punished a total of eight of its 280,000 employees for involvement in the scandal. One was fired, one retired in lieu of termination, one’s termination is pending, and five were reprimanded or suspended for up to two months. The only person fired was the director of the Phoenix hospital, Sharon Helman, who technically was removed not for her role in the manipulation of waiting lists but for receiving “inappropriate gifts,” according to the department. In a statement released Wednesday night, the department did not dispute the numbers released by the committee, but said that more than 100 other employees were facing disciplinary action. “V.A. is committed to holding employees accountable for misconduct,” the statement said.\nOne person fired for other reasons, one pending termination, and one retirement. If the pending termination goes through, and it actually does cite the Secret Death List horror as the reason, that individual will become the only person explicitly fired for it. Former VA Secretary Eric Shinseki wasn’t fired, he resigned, and Obama made a big production about how it was Shinseki’s idea to go, not the President’s.\nWhat an outrageous load of garbage.\nPresident Obama, Secretary McDonald, and the VA bureaucracy didn’t say they were thinking about vague “disciplinary action” for a hundred employees, back when the scandal was so hot it was burning holes through the daily newspapers. Remember, Obama’s first instinct was to blow the whole thing off with some mumbled promises of reform; he didn’t give a damn until the stories of veterans left to die on secret lists, while administrators filed phony reports and collected fat bonuses for their “superior performance,” created so much public outrage that the White House had to get involved.\nObama resisted asking for former Shinseki’s resignation for an absurdly long time, because he wanted to shrink the scandal until it could be dropped down the Memory Hole, and he worried that sacking the Secretary would pump up the story. In the end, Shinseki was ousted, McDonald took his place… and the Administration put the story to bed with a bald-faced lie about how they were going to fire everyone involved. If McDonald’s appointment had been followed with an airy commitment to subject a hundred people to undefined “disciplinary actions” but keep them on the job, there might have been pitchforks and torches in the streets of Washington.\nIt’s Accountability Theater, and we get a fresh performance every time scandals explode in the Obama Administration, because they know the public has a short attention span, and their faithful media has an even shorter one. All it takes to keep the news cycle rolling is a little puppet show, narrated by a President who declares himself stunned and angry over the incredible story he just read in the newspapers – more angry than anyone in America, he often insists. He vows to get to the bottom of it all, and maybe stages a sham resignation or two. The Times says one of the three people that might, with a great stretch of the imagination, be described as “losing their jobs” at the VA actually retired. The same thing happened in the IRS scandal – Obama pretended to fire a couple of people who were actually retiring on schedule, or reaching the end of temporary appointments.\nThe furious chair of the House Veterans Affairs, Rep. Jeff Miller (R-FL), vowed to introduce legislation that would make it easier to fire VA employees, noting that instead of disciplining or terminating them, “VA often just transfers them to other VA facilities, or puts them on paid leave for months on end.”\nFunny, the same thing happens with awful public school teachers. The abuse of paid leave for “disciplinary” purposes is one of the great under-reported outrages of Washington, the government “punishment” that only hurts the victims.\nMiller said “everyone knows accountability is a major problem” at the VA. It’s not just that one department, although Veterans Affairs has presented one of the most grotesque examples, with victims who deserve the full and faithful attention of our mega-government far more than most of the people it showers billions of dollars on. And even this most blood-boiling example of corruption and failure proved utterly impervious to consequences!\nThe Administration won’t even do us the courtesy of whining that their hands are tied, and they can’t sack anyone responsible because they’re protected by bureaucratic inertia and public unions, because they’ll never admit to such deadly flaws in the filthy-rich, all-powerful system they worship. They don’t want the American people to notice that virtually all promises of meaningful reform end up as cobwebbed skeletons in forgotten corners of that vast bureaucratic maze.\nI’m afraid I must disagree with Rep. Miller’s assertion that “everyone knows” the Department of Veterans Affairs has severe accountability problems. We don’t know that, because the Department, its Secretary, and his boss in the Oval Office lied to us about it.","url":"https://www.breitbart.com/politics/2015/04/24/accountability-theater-nobody-got-fired-over-the-va-scandal/"}
