{"authors":["Alexander Robertson For Mailonline"],"date_download":"2018-10-22 23:33:44","date_modify":"2018-10-22 23:33:44","date_publish":"2016-01-28 12:25:49","description":"Once celebrated for its ball room which could host up to 1,000 people, the Accrington Conservative Club, pictured, is now a jumble of lost floorboards, broken staircases and vandalised walls.","filename":"data/vaneerConsumption/AccringtonConservativeClubsdownfallinphotosthatrevealtheeerieruins.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30AA81A000000578-0-image-a-5_1453987775046.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420804_Missing-floorboards-fire-damage-grand-ballroom-tatters-Evocative-pictures-decrepit-ruin-Britain-s-largest-Conservative-Club-left-rot_1540251224.html","title":"Accrington Conservative Club's downfall in photos that reveal the eerie ruins","title_page":"Accrington Conservative Club's downfall in photos that reveal the eerie ruins | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It was once the bustling centre of political life in Accrington, a backdrop for countless debate as well as the social whirl of a thriving industrial town.\nNow it is a desolate ruin, ravaged by fire and crumbling to dust. Parts of the floors have collapsed while the corridors are strewn with debris.\nIt is a long and undignified journey from Accrington Conservative Club's opening in 1891. It was the biggest in the country and famed for an elegant grand ballroom which could host up to 1,000 people.\nScroll down for video.\nA shot of the grand ball room aiming at stage with light creeping through the windows. The room could hold as many as 1,000 people back in the building's heyday\nFrom the outside the Accrington Conservative Club building is an imposing presence in the centre of the town, near Blackburn in the north west of England\nFrom the outside, there is no hint of the desolation that lies within. The facade of the Grade II listed building is in comparatively good condition, if a little moss-stained.\nFalling membership numbers forced it to close in the 1990s. It was then turned into a nightclub called Churchills but this too shut down after a customer died outside during a fight.\nJames Coles, a local publisher, discovered how decrepit the building had become after stumbling upon it almost by accident.\n'On a business trip I happened to park across the street,' said James. 'When returning to the car I noticed the door open and decided to pop my head in and take a look. The building looked in a reasonable state of repair from the outside, but nothing prepared me for what I found inside.\nA local publishing under the name James Cole was lucky enough to discover this historical archive of hidden beauty lying dormant within the walls of the imposing club\nThe club once counted statesman Robert Peel - who made a fortune in the Accrington textile trade - as one of its inspiring forefathers\n'The lower levels of the building were a scene of utter destruction, with gaping holes where floors once sat and substantial fire damage. The upper floor had a vast dance floor. It was a massive elegant ballroom in its day, but is now just the ghost of a former age.'\nSince closing as a nightclub it has had multiple renovation plans rejected by the local council and only avoided the ballroom being demolished after a local campaign to save it was successful.\n'The state of decay and vandalism was an issue with careful 'tightrope walking' of joists needed to carefully manoeuvre up to the ball room,' said James.\n'It saddens me how listed buildings such as this are allowed to fall into such a shocking state decay, only for them to be demolished once they become past the point of saving.'\nA toilet sits perilously close to the edge of flooring which has already partially collapsed. The building is in a state that represents a far cry from what it was like in its heyday in the late 1800s\nGeoff Kelly used to perform at the venue as a musician in a big band during the 60s and 70s and said the state of the building currently was a far cry from what it was like in its prime years.\n'I played there for 25 years on and off and it was a fantastic place to perform,' he said. 'We used to play on a Saturday night and the place was absolutely heaving; you couldn't fit another person in. It had a really beautiful ballroom and we just loved to perform there.\n'In those days people went out dancing so it wasn't a surprise for it to be so busy. It had a reputation as a great place to go. It was only yesterday that I was in town and thought i'd go the long way round to go past it and have a look.\nIt is in such a state of disrepair now. It is really heart-breaking to think of all the good times that have been had in there and what it has now been reduced to.\nIt is such a big place. The story I heard is that there were two local brothers and one bought the Con Club and the other bought the church opposite, and they would try to compete over which one was the biggest.'\nThe building was the largest Conservative Club in the country when it first opened its doors back in 1891. Pictured here is one of many of its crumbling staircases\nJames Cole said the building looked in a reasonable state of repair from the outside, but nothing could prepare him for what he would discover inside\nThe revealing pictures show missing floorboards, walls and staircases, rooms damaged by fire and extensive vandalism over the years\nA view from the counter of the building's bar, which would have been abuzz with activity in the club's heyday, serving up to 1,000 people at any one party\nAn eerie black and white photo from a window on one of the building's upper floors. Mr Cole said much of the building was almost impossible to reach given the damage to stairwells and doorways\nThe building's former pride of joy, the grand ball room, where parties of hundreds of people were held. The scene is now a danger trap, with rubble and broken glass scattered all over the floor","url":"https://www.dailymail.co.uk/news/article-3420804/Missing-floorboards-fire-damage-grand-ballroom-tatters-Evocative-pictures-decrepit-ruin-Britain-s-largest-Conservative-Club-left-rot.html"}
