{"authors":[],"date_download":"2018-10-30 22:21:05","date_modify":"2018-10-30 22:21:05","date_publish":"2018-10-30 14:05:01","description":"If Benomar worked for Russians instead of Qataris, his detractors believe, efforts to gain immunity would be viewed with greater skepticism expressed at a louder volume.","filename":"data/vaneerConsumption/AccusedHackerSeeksDiplomaticStatusatUN.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/10/Benobar.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540938065.html","title":"Accused Hacker Seeks Diplomatic Status at UN","title_page":"Accused Hacker Seeks Diplomatic Status at UNThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"What media uproar would face Donald Trump for granting diplomatic immunity to the Russians accused of meddling in the American political system?\nThe Trump administration ponders no such thing. But United Nations Ambassador Nikki Haley considers granting diplomatic status to Jamal Benomar, a former adviser to the Qatari government accused of masterminding the media rollout of information purloined in hacks against U.S. citizens. And no media uproar, or even media peep, greets the news.\nElliot Broidy, a Republican fundraiser and Donald Trump supporter, filed suit in U.S. District Court in Los Angeles earlier this year against Qatar. Broidy believes his advocacy against Qatar, and its alliance with Iran, inspired the espionage efforts against him.\nThe plaintiff alleges through the lawsuit: “This is a case about a hostile intelligence operation undertaken by a foreign nation on the territory of the United States against successful, influential United States citizens who have spoken out against that country’s support for terrorism and who have entered into significant business relationships relating to defense and counterterrorism with a rival nation. The purpose of the operation appears to have been to diminish the influence of Plaintiffs within the United States through a campaign to discredit Plaintiffs in the press and in the eyes of government officials, and to disrupt their business relationship with rival nations.”\nThe court dismissed that case on the grounds that U.S. law prevents lawsuits against sovereign states. But Broidy filed a subsequent suit against Benomar, a British citizen born in Morocco but living in the United States for decades before working on behalf of Qatar.\n“On information and belief, as part of his participation in the hacking conspiracy,” the lawsuit reads, “Defendant Benomar helped to mastermind the dissemination of stolen materials to the media and other third parties. On information and belief, as part of his involvement with the conspiracy, Defendant spoke regularly with senior Qatari officials about elements of the conspiracy.”\nApart from providing cell-phone records and six-figure payments buttressing the case, Broidy’s lawyers allege that “Benomar has for a long time served the interests of the State of Qatar. On information and belief, during his tenure at the United Nations, Benomar utilized his official position to advance the Qatari agenda. While serving as the United Nations envoy for Yemen, Benomar invariably sided with Houthi rebels backed by Qatar and Iran against the lawful Yemeni government.”\nA week after that court filing, Morocco sought diplomatic recognition for Benomar, and Benomar, through legal counsel, alleges that the immunity he expects to receive for his diplomatic work should apply retroactively for his work for Qatar, which he claims he did at the behest of the Moroccan government. Benomar, a former political prisoner in Morocco, also boasts a record as a special advisor to UN Secretary-General Ban Ki-moon and work with former President Jimmy Carter for Emory University’s Carter Center.\nBroidy believes the attempt to gain diplomatic status stems from Benomar’s desire to protect himself from legal repercussions, not because of any legitimate diplomatic work. The curious timing of Morocco naming him as a diplomat, coming just over a week after the filing of the lawsuit, raises suspicions.\nThe Moroccan embassy in Washington, D.C. and the Moroccan mission to the United Nations did not respond to inquiries from The American Spectator. The U.S. mission to the United States similarly did not respond to The American Spectator’s call.\nU.S. ambassador to the UN, Nikki Haley, has yet to approve diplomat status, and the immunity that goes with it, to Benomar. Haley, who as the host’s country’s representative holds the power to deny Benomar any status that grants him immunity. As both the host country and the victim’s country, the United States, may view Benomar’s attempt to gain diplomatic immunity as a gambit aimed at shielding him from his alleged involvement in an illegal hacking scheme.\nIf Benomar worked for Russians instead of Qataris, his detractors believe, efforts to gain immunity would be viewed with greater skepticism expressed at a louder volume.","url":"https://spectator.org/accused-hacker-seeks-diplomatic-status-at-un/"}
