{"authors":["Mary Kate Mcgrath"],"date_download":"2018-10-31 00:01:51","date_modify":"2018-10-31 00:01:51","date_publish":"2018-10-28 21:06:26","description":"If The Chilling Adventures of Sabrina feels eerily similar to Riverdale, there's a reason for that. In fact, a Sabrina/Riverdale crossover moment already happened, and you might just have missed it. In the seventh episode titled \"Feast of Feasts,\"…","filename":"data/vaneerConsumption/AChillingAdventuresofSabrinaRiverdaleCrossoverAlreadyHappenedYouTotallyMissedIt.json","image_url":"https://imgix.bustle.com/uploads/image/2018/10/28/97e4d834-5cc9-463d-8cc1-c5185cf763dc-cas_102_unit_01911r3.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_a-chilling-adventures-of-sabrina-riverdale-crossover-already-happened-you-totally-missed-it-13010650_1540944111.html","title":"A 'Chilling Adventures of Sabrina' & 'Riverdale' Crossover Already Happened, & You Totally Missed It","title_page":"A 'Chilling Adventures of Sabrina' & 'Riverdale' Crossover Already Happened, & You Totally Missed It","title_rss":"NULL","source_domain":"bustle.com","text":"If The Chilling Adventures of Sabrina feels eerily similar to Riverdale, there's a reason for that. In fact, a Sabrina/Riverdale crossover moment already happened, and you might just have missed it. In the seventh episode titled \"Feast of Feasts,\" Miss Wardwell orders a pizza for Thanksgiving. The pizza delivery boy is a high school student named Ben, who is from Riverdale High. Fans of Riverdale might remember Ben doing a few similar jobs on the show, such as working the hot dog stand at the Twilight Drive-In or interviewing Chic for a position at the Bijou.\nOf course, the cameo also brings up some important questions, as Ben fell from a hospital window in the third season of Riverdale, and is presumably dead. It's possible that these two shows are on different timelines, or that something even more mysterious is afoot. Ben and the Riverdale easter egg was not the first hint that these two series share a universe. The town of Riverdale is mentioned often on the new Netflix series, just as Sabrina's Greendale is name-dropped on Riverdale.\nIt's no coincidence that these shows intersect — writer and producer Roberto Aguirre-Sacasa is the showrunner for both shows. According to EW, Aguirre-Sacasa wanted to leave open the possibility of the two world's meeting, and some of his ideas would go beyond Ben and his pizza delivery.\nIn an interview with ET, Aguirre-Sacasa answered a few pressing questions about Ben from Riverdale. However, his answers might leaves fans even more confused. When asked whether or not the pizza delivery occurred before or after Ben's fall out of the hospital window, the director didn't have a definite answer. \"That’s a good question, and that depends. It suggests a very deep, deep mythology where time and space bends,\" he said. \"I love that kid. I'm sad that he keeps turning up and horrible things keep happening to him.\"\nAguirre-Sacasa wouldn't confirm or deny that Ben survived the fall either. In fact, the witch magic afoot in Greendale makes things even more difficult to confirm. \"It seemed like it was pretty final, but yet there he is in Greendale,\" he said. \"But in Greendale, everyone pops up — the dead don’t stay dead long in Greendale.\" It sounds like things get pretty complicated when these two worlds meet, but that doesn't mean the director won't try to bring the towns together in a future project.\nThe crossover could be difficult to pull off, but the director is determined to make it happen. In a recent interview, he told EW that he had ideas for how to intersect the worlds. \"I would hate if there was no way possible for there ever to be a crossover,\" he said. \"I think there'd be a great episode where the Riverdale kids hear about a haunted house in Greendale and try to break in and it's Sabrina's house. There's totally a universe where that happens.\"\nIf Aguirre-Sacasa doesn't bring the students of Riverdale into the next season of The Chilling Adventures of Sabrina, he could also see doing a standalone Afterlife movie that brings both casts together. Afterlife With Archie is a spinoff comic in which Sabrina Spellman tries to help Jughead bring his dog back to life, only to unleash a zombie horde on Riverdale.\nFans will have to keep an eye out for future Easter eggs, especially ones as quick as Ben and his pizza delivery. However, it seems likely that these two shows will merge in a big way, though it's difficult to say just what that would mean for the main characters. From a zombie apocalypse to haunted houses, it's sure to be a spooky time.","url":"https://www.bustle.com/p/a-chilling-adventures-of-sabrina-riverdale-crossover-already-happened-you-totally-missed-it-13010650"}
