{"authors":["Laurel Rosenhall","Dan Morain","Robbie Short"],"date_download":"2018-10-30 23:06:40","date_modify":"2018-10-30 23:06:40","date_publish":"2016-04-13 08:00:00","description":"After their 6-year-old son died following a dental procedure, a Bay Area couple went to the California Legislature, hoping a new law could prevent other","filename":"data/vaneerConsumption/Achildsdeathandthepowerofthedentallobby.json","image_url":"https://calmatters.org/wp-content/uploads/dentist_lamp.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940800.html","title":"A child’s death and the power of the dental lobby","title_page":"A child’s death and the power of the dental lobby | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"After their 6-year-old son died following a dental procedure, a Bay Area couple went to the California Legislature, hoping a new law could prevent other families from experiencing similar tragedy.\nWhat they’ve found, so far, is that dentists hold surprising sway in Sacramento. More, it seems, than grieving parents making a plea for change.\nThe California Dental Association spent about $664,000 lobbying in California last year – more than the pharmaceutical industry trade group or the association for Hollywood movie studios.\nDentists and related professional organizations are also big political donors, pouring at least $12 million over the last five years into California races. They spend millions on super-PAC style independent campaigns and have given donations to every lawmaker on the committee that recently watered down the Bay Area couple’s bill.\n“The (dental) association is an influential group,” said Assemblyman Tony Thurmond (D-Richmond), who is carrying the legislation. “I knew this would be a hard bill.”\nIn March 2015, Tim and Eliza Sears brought their son to an oral surgeon in Albany to remove a tooth that was growing in the wrong spot in his mouth. Caleb Sears, a kindergartener, was under general anesthesia because the procedure involved cutting into the bone on the roof of his mouth, his father said. The family now believes the anesthesia ended Caleb’s life.\n“We had a whole conversation about the risks of general anesthesia versus the trauma of doing it without anesthesia,” Tim Sears said. “But we had no clue that the method … would be different than it would be in any other medical setting. And that’s what we’re trying to push for, for parents to be given that information.”\nSince Caleb’s death, the family has learned that oral surgeons are the only medical professionals allowed to both administer anesthesia and perform surgery. Those duties are separated in hospitals.\nThe executive officer of the state’s Dental Board, which is responsible for disciplinary actions, accused Dr. Michael Doucet in February of “gross negligence” in Caleb’s treatment. Doucet denied it and is allowed to continue practicing while the case to revoke his license is pending.\nAs they dealt with their loss, the Sears family tried to learn how many other children had died during dental anesthesia, but found a lack of reliable data. They asked Thurmond, their assemblyman, for a bill to require two providers during oral surgery – one to perform and monitor anesthesia, and another to operate. Thurmond said dentists and oral surgeons pushed back, arguing it would make it harder for poor people to get care.\nSo with the family’s support, Thurmond crafted Assembly Bill 2235 to require notifying parents before their children’s oral surgeries that there is a greater risk of death when a dentist both administers anesthesia and operates.\nLobbyists for dentists and oral surgeons opposed that, too.\n“There is no evidence that dental anesthesia under this model of care carries a greater risk than dental care with a second anesthesiologist present,” Alicia Malaby, spokeswoman for the California Dental Association, wrote in an email.\nDental groups convinced a key lawmaker to block the bill: Assemblyman Rudy Salas (D-Bakersfield), who chairs the committee that oversees professional licensing.\nSalas won re-election in 2014 with significant help from independent expenditure campaigns funded, in part, by the California Dental Association. The association has also made donations to each of the 16 members of his Assembly Business and Professions Committee.\nWhen the committee heard Thurmond’s bill earlier this month, Salas insisted on amendments the dental lobby wanted. They removed the requirement to notify parents about the risks of a single provider doing anesthesia and surgery, replacing it with a more general warning in pre-surgery paperwork about the risks of anesthesia.\nThurmond said he didn’t like the change but would accept it because he thought the dentists’ opposition would doom the tougher version of the bill.\n“We’ve negotiated around the clock up until late last night and sadly… the oral surgeons and (the dental association) have rejected (a) compromise,” Thurmond said at the hearing.\nAbove the lawmakers on the dais hung a portrait of former Assembly speaker Jesse Unruh, famous for saying that “money is the mother’s milk of politics.” In the audience, Eliza Sears — wearing wristbands embroidered with the word “Caleb” — cuddled her one-month old baby. Caleb’s grandparents held up photos of Caleb’s smiling face.\nThe weakened bill passed unanimously out of committee. Salas said later that the dentists’ campaign spending had no influence on the way he handled the bill. The committee did, he said, “what we think is fair and balanced.”\n“We’re not changing an entire system if it doesn’t need to be changed or if this was a bad actor or an outlier,” Salas said.\nThe Sears family has sued Doucet for malpractice. The Dental Board’s case says that after Doucet administered anesthesia, Caleb stopped breathing and went into cardiac arrest. Doucet’s “response and actions during this emergency incident were inadequate and constituted incompetence, gross negligence and repeated acts of negligence,” the Feb. 24, 2016, accusation says.\nDoucet denied the accusation on March 8, 2016, arguing that it was made too late and that the investigation violated his due process rights. His lawyer, Arthur Curley, declined to comment for this story.\nThe Sears family sees the approval of their bill as a first step in a long fight. It will require the Dental Board to study anesthesia incidents and publicly report the findings. They hope to make the bill stronger as it advances, and want to call it “Caleb’s law.”\n“We cry a lot,” Sears said. “But this is our life now and we have to figure out what to do with it… Trying to make sure this won’t happen to other families is one thing we can do.”\nReactions\nA dentist in New York questions the California Dental Association’s safety paradigms. Read his letter here.","url":"https://calmatters.org/articles/a-childs-death-and-the-power-of-the-dental-lobby/"}
