{"authors":[],"date_download":"2018-10-22 21:19:07","date_modify":"2018-10-22 21:19:07","date_publish":"2014-05-06 20:05:12","description":"Fortunately, the flu's gene segments show no sign that the virus is particularly deadly, nor is it adapted to transmit to mammals.","filename":"data/vaneerConsumption/AchooNewPenguinFluFoundinAntarctica.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/424346/140506-science-penguin_d755b14a05c2b67305d9be2984b1c5b8.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_science-news_achoo-new-penguin-flu-found-antarctica-n98541_1540243147.html","title":"Achoo! New 'Penguin Flu' Found in Antarctica","title_page":"Achoo! New 'Penguin Flu' Found in Antarctica","title_rss":"NULL","source_domain":"nbcnews.com","text":"Previous studies of penguins in Antarctica had found that multiple species of the bird sometimes carry flu antibodies in their blood. Antibodies are proteins created by the immune system in response to an infection.\nBut no one had ever found the virus itself. Hurt and his colleagues swabbed the tracheas and cloacas (waste and reproductive orifices) of 301 Adélie penguins from Admiralty Bay and Rada Covadonga on the Antarctica Peninsula. The researchers were also able to take blood samples from 270 of the birds.\nIn eight cases, the swabs turned up an influenza virus. The team was successfully able to culture four of the viruses in the lab, and found that all were strains of H11N2, a version of avian flu.\nIntriguingly, these H11N2 strains did not look like strains seen elsewhere on Earth. Because avian flu is spread by migratory birds, strains tend to cluster in two groups defined by bird migrations: North American strains and Eurasian strains. Very little is known about avian flu in the Southern Hemisphere. Of 19,784 publicly available bird flu genetic sequences, only 5.7 percent come from Africa, 1 percent come from Australia and Oceania, and 0.1 percent come from South America.\nFour of the gene segments analyzed in the new penguin flu look most similar to North American avian influenzas from the 1960s to the 1980s, while other segments look closer to South American strains, the researchers report in the journal mBio. One gene sequence looks most similar to H3N8, a virus known to infect horses, dogs and seals as well as birds.\nJudging by the rate of evolutionary change in the virus, Hurt and his colleagues estimate that the virus has been evolving on its own in Antarctica for between 49 and 80 years.\n— Stephanie Pappas, Live Science\nThis is a condensed version of a report from Live Science. Read the full report.\nFollow Stephanie Pappas on Twitter and Google+. Follow us @livescience,Facebook & Google+. Original article on Live Science.","url":"https://www.nbcnews.com/science/science-news/achoo-new-penguin-flu-found-antarctica-n98541"}
