{"authors":["Linette Lopez"],"date_download":"2018-10-30 22:16:11","date_modify":"2018-10-30 22:16:11","date_publish":"2016-12-14 00:00:00","description":"You know how it is on Wall Street ...","filename":"data/vaneerConsumption/AckmansellsValeantsharesexecutivesleave.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ackman-sells-valeant-shares-executives-leave-2016-12_1540937771.html","title":"Ackman sells Valeant shares, executives leave","title_page":"    Ackman sells Valeant shares, executives leave - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Activist investor Bill Ackman, the CEO of Pershing Square, on the floor of the New York Stock Exchange. Thomson Reuters On Wall Street, the end of the year is a race to balance portfolios and finish crucial business.\nThis has especially been the case for Valeant Pharmaceuticals and its billionaire investor Bill Ackman.\nOver the past week they've covered a lot of ground, including getting through a few well-paid departures and a substantial stock stale by Ackman's fund, Pershing Square.\nFirst, the goodbyes.\nThe company is saying farewell to three key executives: Anne Whitaker, the head of Branded Rx; Dr. Ari Kellen, the head of Bausch & Lomb; and CFO Rob Rosiello.\nThey are, however, not leaving without some parting gifts, according to Wells Fargo analyst David Maris:\n\"We are surprised that Valeant's CEO provided Rosiello and Kellen with consulting agreements on an ongoing basis, as despite these outgoing executives being very highly compensated while at Valeant, the company has lost nearly $80 billion in market value.\n\"Shortly after Valeant's new CEO came onboard, these same executives also received special retention awards, enhanced severance benefits equal to 2x each's annual base salary and target bonus, and continued employment despite Valeant's missed earnings and poor business performance. Additionally, the new CEO and board awarded former CEO Michael Pearson a $9 million severance and a consulting contract. We are unaware on what Pearson is being paid to consult.\"\nFormer Valeant CEO Michael Pearson's consulting contract also includes a nondisparagement agreement.\nValeant's stock crashed by over 90% starting last October after accusations of accounting malfeasance from a short seller combined with government scrutiny over drug pricing to drag the company down. Since then, several government agencies have opened numerous investigations into the company.\nA day after Valeant announced the departure of these executives, Ackman's fund Pershing Square sold $3.47 million worth of Valeant shares. The Wall Street Journal reports that this was done to help generate a loss for tax purposes.","url":"https://www.businessinsider.com/ackman-sells-valeant-shares-executives-leave-2016-12"}
