{"authors":[],"date_download":"2018-10-30 01:24:11","date_modify":"2018-10-30 01:24:11","date_publish":"2016-04-14 08:00:00","description":null,"filename":"data/vaneerConsumption/AClearEyedViewoftheContactLensDebate.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/04/Screen20Shot202016-04-1320at202.23.2020PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862651.html","title":"A Clear-Eyed View of the Contact Lens Debate","title_page":"A Clear-Eyed View of the Contact Lens DebateThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Editor’s Note: Debra J. Saunders is off. The following column is by Veronique de Rugy.\nThe intensity with which some American companies try to use the government to trick or deceive consumers is astonishing. Yet the extent to which lawmakers seem content to cater to these crony pursuits never disappoints, either. Case in point: the current attempt to protect contact lens sellers from competition at the expense of consumers.\nAn estimated 40 million Americans wear contact lenses. That’s a $4 billion industry. Thanks to the heavy-handed government regulation of all things health care, contacts already cost more than they should. However, if an ongoing effort to reduce competition through government cronyism were to succeed, costs might soon rise even more.\nWhat makes the contact lens market unique — and also leaves it extra vulnerable to crony intervention — is the fact that customers are required by federal law to obtain a prescription from a licensed optometrist in order to purchase lenses. It is a rare instance where prescribers are also sellers, which leads to a cozy relationship between manufacturers and the doctors who can steer patients toward their brand.\nPrescriptions are brand-specific. This makes it difficult for consumers to shop around. Choosing a different brand would require paying for another exam in order to obtain a new prescription.\nThe simplest solution would be to do away with the gatekeepers altogether and allow the purchase of contact lenses without a prescription. It works just fine that way in Europe and Japan, but manufacturers and doctors nevertheless protect their legal mandate through lobbying by citing health concerns, even as the same manufacturers happily sell to overseas markets without the same requirements.\nThe best actual guarantee of consumer health is the widespread availability of affordable lenses. The cheaper and more convenient it is for consumers to purchase contacts, the easier it is for them to adhere to guidelines and wear only fresh, clean lenses. The price-reducing effects of market competition thus also improve customer health.\nBarring its outright elimination of the prescription requirement, competition must be protected from abuses. That’s what Congress sought to do in 2003 when it passed the Fairness to Contact Lens Consumers Act.\nAmong other things, it required prescribers to automatically provide copies of the prescriptions to patients so that they could shop around, including shop online or at discount stores such as Costco and Wal-Mart. As expected, this competition, which has led to more cash in consumers’ pockets, hasn’t been welcomed by those who would prefer to see prices artificially inflated. Ever since the enacting of that law, a group called the Coalition for Patient Vision Care Safety — which is made up of Johnson & Johnson, the other major contact manufacturers, the American Optometric Association and other special interests — has sought to weaken and undermine the reforms.\nUnfortunately, those efforts have been rewarded. This week, a bill was introduced by Sen. Bill Cassidy, R-La., called the Contact Lens Consumer Health Protection Act of 2016, which would place pointless and costly new mandates on sellers and eliminate market competition.\nAmong other mandates, it would require dedicated phone lines and email addresses for prescribers to communicate questions to sellers about the prescriptions the sellers need them to verify before the sellers are allowed to fill orders. Past pro-market reforms required prescribers to verify within a reasonable amount of time; otherwise, sellers could assume the prescriptions were valid. This prevented eye doctors who also sold lenses from denying the cheaper competition the right to sell simply by not responding to verification requests.\nThe new bill would undo that time limit anytime a prescriber asks a question through the new communication channels — and if the prescriber then chose not to follow up any more, it could indefinitely stall the verification process in theory, effectively gutting the pro-market reforms included in the 2003 law.\nWith this move, these special interests demonstrate that they would rather avoid the grind of competition, which requires that companies deliver high-quality goods at low prices to consumers. Instead, they’re trying to rig the system to force consumers into paying more for less.\nCOPYRIGHT 2016 CREATORS.COM","url":"https://spectator.org/66040_clear-eyed-view-contact-lens-debate/"}
