{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 20:13:32","date_modify":"2018-10-30 20:13:32","date_publish":"2015-04-10 15:59:29","description":"The ACLU plans a lawsuit, demanding that Catholic bishops provide abortions for Illegal minors.","filename":"data/vaneerConsumption/ACLUDemandsCatholicBishopsProvideAbortionsforIllegalMinors.json","image_url":"https://media.breitbart.com/media/2015/01/pro-life-women-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_10__1540930412.html","title":"ACLU Demands Catholic Bishops Provide Abortions for Illegal Minors","title_page":"ACLU Demands Catholic Bishops Provide Abortions for Illegal Minors | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Religious groups such as the U.S. Conference of Catholic Bishops (USCCB) are the target of an imminent ACLU lawsuit that hopes to order the federal government to release information about how the groups are awarded government funding contracts to assist illegal unaccompanied minors, yet refuse to allow the minors access to contraception and abortion.\nAccording to a press release, the ACLU states, “The U.S. government has committed to providing services to meet the basic needs of these teens. Reports indicate that between 60 and 80 percent of women and girls who cross the border are sexually active.”\n“Some of these organizations impose their religious beliefs on these teens by denying them access to contraception, emergency contraception, and abortion,” the ACLU continues.\nEquating abortion and contraception with “health care,” Brigitte Amiri, senior staff attorney with the ACLU Reproductive Freedom Project, said, “Religious freedom does not include the right to take a government contract that requires providing access to health care, and then refuse to provide a teen who has been raped the health care she needs.”\nThe ACLU’s suit comes in the wake of recent proposed federal regulations that require groups that receive federal contracting funds to assist with care for illegal minors to ensure they are provided with access to contraception and abortion. In response, however, the USCCB said such a requirement would violate religious freedom since contraception and abortion are against the teachings of the Catholic Church.\nAs the largest resettlement agency in the United States, the U.S. Catholic Bishops’ Migration and Refugee Services (MRS) reported last year that “upwards of 90,000” young illegal immigrants were projected to arrive between October 1, 2013, and September 30, 2014. MRS showed a total budget of approximately $71 million, of which nearly $66 million–or about 93 percent–has come from federal grants and contracts.\nThe ACLU charges that “because of USCCB’s refusals, teens are not getting the care they need,” and that, additionally, “some organizations are using their religious beliefs to force teens to leave their program, uprooting the teen from familiar surroundings and the lifeline of their social worker, if they need reproductive care.”\nIn February, Catholic and evangelical agencies providing aid to illegal minors–including Catholic Relief Services and World Relief–submitted joint comments to the Office of Refugee Resettlement (ORR) of the U.S. Department of Health and Human Services (HHS).\n“We believe that, through practical discussions, we can find a resolution that allows the government to fulfill its obligation to care for unaccompanied children, while also respecting the religious and moral beliefs of faith-based organizations that, to date, have provided such critical care for this vulnerable population,” the comments state. “In cases where pregnancy occurs, those of us participating in the program are willing to continue to provide health care access, as we have for years, in a manner consistent with our religious beliefs.”\nThe Catholic and evangelical groups requested that ORR ensure their organizations are able to “remain free to act in accord with their religious beliefs and moral convictions in the area of human sexuality” when caring for illegal minors.\n“Moral convictions in the area of human sexuality” were also at issue last summer with the Obama administration.\nAs Breitbart News reported last July, President Obama issued an executive order banning “all companies that receive a contract from the federal government from discriminating against their LGBT employees.” The U.S. Catholic bishops, in response, said the order was “unprecedented and extreme.”\nThe bishops’ conference stated that Obama’s executive order barring federal contract recipients from any form of discrimination against LGBT employees “needlessly prefers conflict and exclusion over coexistence and cooperation” and “should be opposed.”\nPhil Lawler, editor of Catholic World News (CWN) cautioned the bishops about relying on federal contracts, stating, “Stop taking federal contracts. President Obama doesn’t want help from the Catholic Church. Say it’s a deal; don’t give him any.”\n“Imagine the chaos that would ensue if ‘the largest resettlement agency in the United States’–the bishops’ MRS office–withdrew from that effort,” Lawler wrote. “For decades, some concerned Catholics have warned that by accepting (and, more important, energetically lobbying for) government support, Catholic charities have compromised their independence. President Obama has now illustrated that point.”\nGiven that, from its annual report, the bishops’ MRS program would shrink down to near extinction without federal grants, Lawler concluded, “What would be left would be a recognizably Catholic charity, not a federal program administered through the bishops’ conference.”","url":"https://www.breitbart.com/politics/2015/04/10/aclu-demands-catholic-bishops-provide-abortions-for-illegal-minors/"}
