{"authors":[],"date_download":"2018-10-30 01:07:28","date_modify":"2018-10-30 01:07:28","date_publish":"2017-04-04 00:00:00","description":null,"filename":"data/vaneerConsumption/ACLUtakesabuggywhiptoLancasterCounty.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2017_04_aclu_takes_a_buggy_whip_to_lancaster_county__comments_1540861648.html","title":"ACLU takes a buggy whip to Lancaster County","title_page":"Blog: ACLU takes a buggy whip to Lancaster County","title_rss":"NULL","source_domain":"americanthinker.com","text":"Surrounded by Pennsylvania's Amish country, with its farmland, horses, and buggies, Lancaster School District officials are finding out how expensive it is to have the world come to them – especially if it comes in the form of briefcase-wielding American Civil Liberties Union (ACLU) attorneys. On March 28, the district agreed to bow to an ACLU demand to accommodate \"immigrant refugees\" aged 17 to 21 in a public high school, whose student body typically is aged 14 to 18. On behalf of six of the immigrants, the ACLU sued the district last July, demanding full integration. Joining the suit with the ACLU were the Philadelphia-based Education Law Center, a recipient of funding from radical billionaire George Soros, and Pepper Hamilton LLP. In the settlement, the district will pony up more than $400,000, according to lancasteronline.com. The news comes while authorities in Rockville, Maryland are dealing with the fallout of the rape of... (Read Full Post)","url":"https://www.americanthinker.com/blog/2017/04/aclu_takes_a_buggy_whip_to_lancaster_county__comments.html"}
arently without vetting. Rockville is in Montgomery County, a wealthy suburb that has declared itself a \"sanctuary\" jurisdiction.\nThe Lancaster district had been sending newly settled refugees to a privately run school called the Phoenix Academy, where the district said their needs could better be met. None of the students, some of whom are from Somalia and Sudan, speaks English. They speak Swahili, Somali, Fur (an indigenous language of Darfur), and Hakha Chin (spoken in southern Asia), according to lancasteronline.com.\nThe settlement comes on the heels of a ruling by U.S. district judge Edward G. Smith, a 2013 Obama appointee, who issued a preliminary injunction ordering the district to enroll the immigrants in McCaskey High School. In January, the U.S. Court of Appeals for the Third Circuit upheld Smith's ruling.\nAccording to district lawyer Howard Kelin, McCaskey will create separate classrooms for refugee students ages 19 to 21.\n\"These aren't kids,\" he told a local reporter. \"These are young adults.\"\nThe district's insurance carrier will pay $300,000 for the plaintiffs' legal fees, according to Lancasteronline.com, \"while taxpayers will be on the hook for another $70,000 in out-of-pocket expenses, including plaintiffs' travel and translation.\"\nThe district also will create a $66,500 fund for adult education programs for immigrant students who were unable to enroll in the district or those placed at Phoenix since 2013.\nThe ACLU had been seeking $2 million in legal fees.\nRobert Knight is a senior fellow for the American Civil Rights Union.","url":"https://www.americanthinker.com/blog/2017/04/aclu_takes_a_buggy_whip_to_lancaster_county_.html"}
