{"authors":[],"date_download":"2018-10-30 01:09:05","date_modify":"2018-10-30 01:09:05","date_publish":"2015-03-26 00:00:00","description":null,"filename":"data/vaneerConsumption/ACLUgetsStunginWisconsin.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2015_03_aclu_gets_stung_in_wisconsin_1540861745.html","title":"ACLU gets Stung in Wisconsin","title_page":"ACLU gets Stung in Wisconsin","title_rss":"NULL","source_domain":"americanthinker.com","text":"While miffed by the Court’s action, the American Civil Liberties Union (ACLU) crowed today (Tuesday) that state officials said the law still will not be in effect for the April 7 election.\nGovernor Scott Walker, Wisconsin voters, and champions of clean elections won a crucial decision at the U.S. Supreme Court on Monday when the justices declined to hear a challenge to an appeals court’s decision upholding Wisconsin’s photo voter ID law.\nThe ACLU filed an emergency request on Monday asking for an extension of a stay of the law that had been granted before last November’s election. Within hours, state officials announced that the law would remain suspended because absentee ballots had already been sent out.\n“For now, the voters of Wisconsin will be able to cast their ballots free from the burdens placed on them by this law,” said ACLU Voting Rights Project Director Dale Ho, in a press release. “But this should be the case for voters permanently, not just for one election. We are evaluating our next steps in the fight for the right of all Americans to vote free from unnecessary barriers.\"\nBy “barriers,” the ACLU means the simple requirement for voters to show a photo ID, as people must do for everyday activities such as cashing checks, buying beer, applying for welfare benefits and food stamps, entering certain government buildings, and boarding airplanes.\nIn its appeal, the ACLU argued the head-scratching contention that Wisconsin’s law, which applies equally to all voters, regardless of race, sex or creed, violates the 14th Amendment’s Equal Protection Clause. Also, that because some voters would have to obtain valid IDs to vote, that the law “imposes a severe burden,” violating the 24th Amendment’s prohibition of poll taxes.\nFor good measure, the ACLU further argued that the law violates the Voting Rights Act’s Section 2, which bars “disparate impact” on minorities from any voting rules. The ACLU, like President Obama, Attorney General Eric Holder, and race hustler Al Sharpton, contends that minorities, unlike other citizens, are somehow uniquely incapable of getting IDs. This would be grounds for accusations of racism if it were made by, say, white racists.\nThe race hustlers’ main argument -- that photo voter ID laws “suppress” minority voting, was dealt a serious blow when minority voting increased in the last election despite many states requiring such IDs.\nFor example, in North Carolina, whose photo ID law was in effect for the 2014 mid-term election, but not in 2010, non-Hispanic black participation rose from 38.5 percent in 2010 to 41.1 percent in 2014, according to the North Carolina Board of Elections.\nAs for poll taxes, they were imposed during the abusive Jim Crow era, following the Civil War, when racist authorities created hurdles to prevent blacks from voting. For a concise history of the era’s abuses and their enforcement by Democrats, see \"The Truth about Jim Crow\", a special report by the American Civil Rights Union.\nIn 1965, poll taxes and other Jim Crow laws were swept away when Congress enacted the Voting Rights Act as a complement to the 1964 Civil Rights Act.\nIn Shelby County v. Holder (2013), the U.S. Supreme Court struck down a section of the Voting Rights Act that had singled out Southern states and several other jurisdictions for special scrutiny by the Justice Department or a three-judge federal panel. The 5-4 majority said that times had changed, and that the formula devised 40 years ago to measure discrimination no longer applied. Although liberal taking heads proclaimed that the sky had fallen, the Court noted that the law retains considerable teeth to invoke against electoral racial discrimination.\nWisconsin Attorney General Brad Schimel, in explaining that the state photo ID law was still suspended for the upcoming election, made it clear that this was a temporary setback: “The Voter ID law will be in place for future elections -- this decision is final.”\nBut as predictable as the sun’s rising in the East, the ACLU undoubtedly will try to sell more preposterous claims about voter ID to any court that will listen.\nRobert Knight is a Senior Fellow for the American Civil Rights Union.","url":"https://www.americanthinker.com/articles/2015/03/aclu_gets_stung_in_wisconsin.html"}
