{"authors":["Pam Key"],"date_download":"2018-10-30 18:27:29","date_modify":"2018-10-30 18:27:29","date_publish":"2018-08-01 23:44:09","description":"Wednesday, on HLN’s \"S.E. Cupp Unfiltered,\" CNN Chief White House correspondent Jim Acosta said being shouted at by Trump supporters at a rally in Tampa, | Video","filename":"data/vaneerConsumption/AcostaonFacingCNNSucksChantatTrumpRallyItFeltLikeWeWerentinAmericaAnymore.json","image_url":"https://media.breitbart.com/media/2018/08/Jim-Acosta-.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2018_08_01__1540924049.html","title":"Acosta on Facing 'CNN Sucks' Chant at Trump Rally: ‘It Felt Like We Weren’t in America Anymore’","title_page":"Acosta on Facing 'CNN Sucks' Chant at Trump Rally: ‘It Felt Like We Weren’t in America Anymore’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Wednesday, on HLN’s “S.E. Cupp Unfiltered,” CNN Chief White House correspondent Jim Acosta said being shouted at by Trump supporters at a rally in Tampa, Florida, last night, “felt like we weren’t in America anymore.”\nAcosta said, “I mean, honestly, it felt like we weren’t in America anymore. I don’t know how to put it any more plainly than that. Americans should not be treating their fellow Americans in this way. But unfortunately, what we’ve seen—and this has been building for some time since the campaign—I’ve been talking about this as an issue since the campaign. When the president, during the campaign, referred to us as the dishonest media, the disgusting news media, liars, scum, and thieves, and so on, and then he rolled that right into the Oval Office, and started calling us the fake news and the enemy of the people, he is whipping these crowds up into a frenzy, to the point where they really want to come after us.”\nHe continued, “And my sense of it, S.E., is that these opinions that these folks have at these rallies, they’re shaped by what they see in the primetime hours of Fox News and what they hear from some conservative news outlets that just sort of give them this daily diet of what they consider to be terrible things that we do over here at CNN. It’s very unfortunate, but it’s a pitting of American against American and honestly, it needs to stop.”\nHe added, “I think it’s been dangerous for some time. I was worried during the campaign that a journalist was going to get hurt, and it has been building. But when you refer to members of the press as the enemy of the people, you’re essentially putting targets on our backs and it’s not just some Joe Schmo on a barstool in Kalamazoo saying this. This is the president of the United States. And that comes with a serious force behind it. And he has a lot of people out there who are extremely angry at us.”\nFollow Pam Key On Twitter @pamkeyNEN","url":"https://www.breitbart.com/video/2018/08/01/acosta-on-facing-cnn-sucks-chant-at-trump-rally-it-felt-like-we-werent-in-america-anymore/"}
