{"authors":["Virginia Hale"],"date_download":"2018-10-30 22:19:34","date_modify":"2018-10-30 22:19:34","date_publish":"2016-08-27 13:51:54","description":"Struggling as 10,000 people arrive on its shores each week, Italy has begun to send migrants back to Sudan on charter flights.","filename":"data/vaneerConsumption/ActivistsAngryasRomeFliesMigrantsBacktoSudan.json","image_url":"https://media.breitbart.com/media/2016/08/Migrants-Stranded-At-the-France-Italy-Border.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_08_27__1540937974.html","title":"Activists Angry as Rome Flies Migrants Back to Sudan","title_page":"Activists Angry as Rome Flies Migrants Back to Sudan | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Struggling as 10,000 people arrive on its shores each week, Italy has begun to send migrants back to Sudan on charter flights.\nThe Italian government repatriated the first 48 migrants to Sudan on Wednesday after striking a deal with the North African country earlier this month.\nThe agreement, which comes as 10,000 migrants are arriving in Italy each week, has been met with outrage from activists.\nThe four dozen Sudanese were taken from Ventimiglia, near the French border, and flown back to their homeland on a chartered EgyptAir flight on Wednesday.\nEarlier this month, more than 100 migrants broke through police barriers in the town and made their way to France. Situated on the French border, officials fear the town could become a new Calais, referring to the port’s so-called “jungle” camps, from which migrants attempt to illegally enter Britain.\nSudanese officials identified the first 48 people who could be deported out of a group of hundreds of African men who have been staying in the French-Italian border town.\nThree activists from the “No Borders” network, which demands European taxpayers house, clothe and pay unlimited numbers of migrants, were arrested climbing onto a radar tower at Malpensa Airport.\nSpeaking to il Fatto Quotidiano at the Milan airport, protesters said: “We knew two of the guys on that plane well.\n“Until yesterday they were in the Red Cross centre, they felt safe and they were preparing everything to ask for asylum.”\nThe migrants were flown back to Sudan from Turin-Caselle airport, more than an hour from Milan, so that protesters could not interfere with the flight’s progress.\nImmigration lawyer Alessandra Ballerini blasted the flight as “a mass deportation to a country where fundamental rights are violated and where their lives are in danger.”\nSome politicians opposed the move. Luigi Manconi, a senator for the ruling, centre-left Democratic Party reacted to the deportations with anger.\n“How can we say that Sudan guarantees the protection of their human rights? How can we put in danger the lives of these people forcibly returned?”, the senator asked.\nMr Manconi added: “We can not run the risk of returning anyone without proper guarantees on his safety.”","url":"https://www.breitbart.com/europe/2016/08/27/rome-flies-migrants-back-sudan/"}
