{"authors":[],"date_download":"2018-10-22 20:46:14","date_modify":"2018-10-22 20:46:14","date_publish":"2014-06-02 23:50:14","description":"The acting secretary of Veterans Affairs vowed to act decisively against the mismanagement that led to the agency's scandal over delays in treatment.","filename":"data/vaneerConsumption/ActingVASecretarySloanGibsonVowstoFixAgency.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/482861/140602_sloan-gibson-va_79e311241772849b1a57ea222c948a38.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_acting-va-secretary-sloan-gibson-vows-fix-agency-n120826_1540241174.html","title":"Acting VA Secretary Sloan Gibson Vows to Fix Agency","title_page":"Acting VA Secretary Sloan Gibson Vows to Fix Agency","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe acting secretary of Veterans Affairs vowed to act decisively against the mismanagement that led to the agency's scandal over delays in treatment and cover-ups at VA hospitals across the country.\n\"I will use all available authority to swiftly and decisively address issues of willful misconduct or mismanagement,\" Acting Secretary of Veterans Affairs Sloan Gibson said in a statement Monday. \"VA's first priority is to get all Veterans off waiting lists and into clinics while we address the underlying issues that have been impeding Veterans' access to healthcare.\"\nIn light of the growing scandal, embattled former Veterans Affairs Secretary Eric Shinseki resigned last week after coming under heavy criticism for his handling of the crisis.\nAn investigation showed that hundreds of veterans were kept off official waiting lists as employees manipulated data.\nIn his statement, Gibson thanked Shinseki for his leadership of the VA.\n—Becky Bratu","url":"https://www.nbcnews.com/news/us-news/acting-va-secretary-sloan-gibson-vows-fix-agency-n120826"}
