{"authors":[],"date_download":"2018-10-22 21:39:00","date_modify":"2018-10-22 21:39:00","date_publish":"2014-06-05 21:38:35","description":"\"I will not be part of some effort to maintain the status quo here,\" Sloan Gibson says. \"We’re going to have change in this organization.”","filename":"data/vaneerConsumption/ActingVASecretaryVowstoChangetheStatusQuo.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/490911/140605_sloan-gibson-phoenix_b8fc66f0b11d483211e52a8ed756b445.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_va-hospital-scandal_acting-va-secretary-vows-change-status-quo-n124011_1540244340.html","title":"Acting VA Secretary Vows to Change the Status Quo","title_page":"Acting VA Secretary Vows to Change the Status Quo","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nActing Veterans Affairs Secretary Sloan Gibson reiterated Thursday his commitment to rid the department of mismanagement and misconduct and improve care for veterans.\n\"I will not be part of some effort to maintain the status quo here,\" Gibson said in Phoenix. \"We’re going to have change in this organization.\"\nHis statements followed a visit to the city VA facility that was at the heart of the initial outrage that hundreds of veterans had been kept off official waiting lists as employees manipulated data.\nDozens of veterans are said to have died while waiting for a medical appointment at Carl T. Hayden VA Medical Center.\nOn Thursday, Gibson said 18 veterans who were kept off official waiting lists in that area have died, but he said he does not know whether the deaths were related to the long wait times.\nGibson, who took on his current role last week after Eric Shinseki's resignation as VA secretary, also said the agency would release nationwide data on patient wait times next week.\nAdditionally, Gibson said he would remove the 14-day scheduling goal from employee performance contracts to eliminate any incentives for data manipulation.\nMeanwhile, in Washington, senators agreed Thursday on a bill that would allow veterans waiting 30 days or more for VA appointments to see private doctors enrolled as providers for Medicare or other government health care programs — especially in rural areas.\nGibson said he will not hesitate to boost the department's resources in facilities that need it and will appeal to the Obama administration for help if necessary. He also vowed to use his authority to hold those found guilty of willful misconduct accountable.\n\"Veterans must feel safe walking into our VA facilities - they deserve to have full faith in their VA,\" he said.\n—Becky Bratu\nThe Associated Press contributed to this report.","url":"https://www.nbcnews.com/storyline/va-hospital-scandal/acting-va-secretary-vows-change-status-quo-n124011"}
