{"authors":["Press Association"],"date_download":"2018-10-22 21:44:00","date_modify":"2018-10-22 21:44:00","date_publish":"2016-01-29 07:42:32","description":"A Bafta award-winning actor whose two-year-old daughter died from sepsis has said he fears cuts to the health service could hinder efforts to improve treatme...","filename":"data/vaneerConsumption/Actorjasonwatkinsgovernmentmustgraspnettleonsepsis.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-917982d5-0d8b-4cc1-a28f-4eee831c8a77-4PuZeKVXE7cd9005b2c876691ce5-39_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3421950_Actor-Jason-Watkins-Government-grasp-nettle-sepsis_1540244640.html","title":"Actor jason watkins: government must grasp nettle on sepsis","title_page":"Actor jason watkins: government must grasp nettle on sepsis | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Actor Jason Watkins: Government must grasp nettle on sepsis\nA Bafta award-winning actor whose two-year-old daughter died from sepsis has said he fears cuts to the health service could hinder efforts to improve treatment of the life-threatening illness.\nJason Watkins said his daughter Maude would still be alive if her condition had been caught earlier and urged the Government to \"grasp the nettle\" to avoid more unnecessary deaths.\nThe 49-year-old actor, who won critical acclaim playing the role of Christopher Jefferies, the innocent suspect in the murder of Joanna Yeates, said sepsis was a \"nasty condition\" that doctors and parents often struggled to recognise.\nActor Jason Watkins lost his two-year-old daughter Maude to sepsis\nHe spoke out after Health Secretary Jeremy Hunt apologised to the parents of William Mead, who died in December 2014 after GPs, out-of-hours services and a 111 call handler failed to spot he had sepsis.\nMr Watkins told the Press Association: \"The Government has to grasp the nettle. Hopefully Jeremy Hunt acts on what he has been saying.\n\"There is this awful condition, this terrible syndrome, and we've not really noticed it. A thousand children die a year from sepsis.\n\"My one fear is that lots of things need to be implemented when the NHS is in a very difficult phase and under lots of pressure.\n\"Maybe the health service can never be run like a business. It has to be run in an imaginative way and accept there will be losses.\n\"My worry is with all the cuts, particularly in mental health, we've already seen suicide rates go up. It's the sort of thing one worries about.\"\nSepsis is triggered by an infection which, if not treated quickly, can lead to multiple organ failure and death.\nAround 37,000 people die each year in the UK as a result of the condition, according to the NHS.\nMr Watkins, whose daughter died on New Year's Day in 2011, has appeared in a video urging people to donate to a charity to help improve diagnosis.\nIn the appeal for the UK Sepsis Trust, he says: \"My daughter Maude died of sepsis. We found her lifeless body in her cot one morning. And that is the tragedy of sepsis. If caught early it is treatable and Maude and thousands of others would still be with us.\"\nMr Watkins said he hopes to meet Melissa and Paul Mead, the parents of one-year-old William in the next few days.\nAccording to a report by NHS England, Mrs Mead spoke to medics at least nine times in the 11 weeks leading up to William's death. He was seen by several GPs who failed to spot that his condition was deteriorating.","url":"https://www.dailymail.co.uk/wires/pa/article-3421950/Actor-Jason-Watkins-Government-grasp-nettle-sepsis.html"}
