{"authors":[],"date_download":"2018-10-30 18:29:20","date_modify":"2018-10-30 18:29:20","date_publish":"2016-11-29 20:09:00","description":"Welcome to \"Actual Factual,\" a regular column in which I, Becca Godwin, answer reader questions about goings-on in north Fulton.","filename":"data/vaneerConsumption/ActualFactualNorthFultonWhyisHembreeandCrabappleamess.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/11/29/Images/File_001%20(2).jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_actual-factual-n_43708e8cad421c0de424434d2b83d8a5__1540924160.html","title":"Actual Factual North Fulton: Why is Hembree and Crabapple a mess?","title_page":"Actual Factual North Fulton: Why is Hembree and Crabapple a mess?","title_rss":"NULL","source_domain":"ajc.com","text":"Welcome to \"Actual Factual,\" a regular column in which I, Becca Godwin, answer reader questions about goings-on in north Fulton. Here's one I did recently about what's being built next to a KFC in Roswell.\nNow that you're familiar, you'll find information for submitting your own questions at the bottom of this column. Cheers!\nReader Kari asks: What is going on around the Hembree Road & Crabapple Road area? It's a mess and has been for a while now.\nGreat question, Kari.\nI feel your traffic-related pain. On the list of Highly Aggravating Things, having to regularly use an inconvenient intersection is right up there with \"stepping on a small, pointy object\" and \"spilling coffee on yourself before even leaving the house.\"\nTo answer your question, I first parked on one of the corners — right when Monday rush hour was heating up — and observed the intersection that consists of two, two-lane roads crossing in a neighborhood.\nThe main problem, it seemed, was back-up created by the lack of turning lanes. When a car waiting to turn can't pull out into the intersection far enough for the vehicles behind them to pass, the line gets held up. It happens often.\nThis was most evident as I witnessed one car pull onto the side of the road to get around the car in front of it, which was waiting to turn left. (Note: the author recommends obeying traffic laws at all times. Santa is watching.)\nThe intersection gets very busy at rush-hour.\nThe next thing I did was ask a Roswell spokeswoman if there were any plans to make improvements to the intersection.\nShe contacted Director of Transportation Steven Acenbrak, who acknowledged that the intersection gets congested at certain hours of the day.\n\"This is exacerbated by the construction of the new roundabout at Houze and Hembree just down the street,\" he said in an email. \"And yesterday there was a serious accident on SR 140 in Milton that caused congestion on Crabapple Road much worse than normal.\"\nAs for future plans, it's one of those good news/bad news type situations. Let's hear it in Acenbrak's words.\nThe good: \"We have this intersection identified in our Transportation Master plan for a future improvement.\"\nThe bad: \"However we do not have money currently identified for either study or design at this time.\"\nThe good: \"With the passage of the TSPLOST we now have money to program for intersection improvements such as this one.\"\nThe bad: \"However it will be several years before we have enough of the tax collections to know if this will be a funded project or not.\"\nSo, Kari, there you have it. While your traffic woes won't be gone tomorrow, maybe the words \"future improvement\" can keep you company on your next drive?\nI, Becca Godwin, am a staff writer with the AJC and a lover of metro Atlanta. To submit “Actual Factual” questions, contact me at becca.godwin@ajc.com, @BeccaJGGodwin on Twitter or via the form below.","url":"https://www.ajc.com/news/local/actual-factual-north-fulton-why-hembree-and-crabapple-mess/kF6CeQYcQ7URF7JiqqVPAL/"}
