{"authors":[],"date_download":"2018-10-30 18:30:38","date_modify":"2018-10-30 18:30:38","date_publish":"2017-03-09 19:11:00","description":"It's true: DeKalb police's Maj. Stephen Fore, agency spokesman, calls the practice uncommon for the department.","filename":"data/vaneerConsumption/ActualFactualDeKalbWhydontcopsdustforprintsatburglaries.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/WHIO/2015/04/06/Images/photos.medleyphoto.7073033.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_actual-factual-d_464b3fa1f244c4a285850631a372a048__1540924238.html","title":"Actual Factual DeKalb: Why don’t cops dust for prints at burglaries?","title_page":"DeKalb cops likely won't dust for prints at your burglary. Here's why.","title_rss":"NULL","source_domain":"ajc.com","text":"This is \"Actual Factual DeKalb,\" a regular column in which I answer reader questions about goings-on and history in DeKalb County.\nReader Jarrod H. asks: Why doesn't the Dekalb County Police Department dust for fingerprints when a burglary has been reported?\nWell, Jarrod, it’s a touch complex.\nFirst, let me inform the other readers of your plight: ﻿Jarrod says his home has been burglarized twice, and no one checked for fingerprints either time.\n“So,” he wonders, “how exactly are they supposed to link any of the crimes together, or charge someone with more than one crime?”\nI got some answers related to that question, too, but let’s start with the initial one.\nIt’s true:\nIf your house is burglarized, the DeKalb County Police Department likely won’t dust for prints.\nMaj. Stephen Fore, agency spokesman, calls the practice uncommon for the department, something only done occasionally.\n“For prints to yield any results we have to have someone to compare the print with,” Fore says. “An example where prints might be taken is if a detective has a suspect or believes a series of burglaries might be related and there’s a possibly of prints at the scene.”\nHere’s the deal, though:\nFingerprints in a burglary aren’t always as common as we tend to think, Fore says. They often come from areas touched by plenty of people and, thus, the crook’s prints overlap with anyone’s prints.\nPlus, prints can’t be taken from all surfaces.\nSo how do they solve these cases?\nFore says most burglaries that get solved are ones in which the perpetrators are caught in the act or the stolen items are tracked down.\nAnd what can you do, Jarrod?\nI hate to say it, but I have only one tip. It’s weak. Something you’ve probably already thought of, and something I highly doubt will soothe the insult of suffering two burglaries.\nBut here it is:\nWrite down your serial numbers so the cops can track your stolen stuff.\n— I am a staff writer with the AJC and a proud DeKalb County resident. To submit “Actual Factual DeKalb” questions, contact me at joshua.sharpe@ajc.com, @JoshuaWSharpe on Twitter or via the form below.","url":"https://www.ajc.com/news/local/actual-factual-dekalb-why-don-cops-dust-for-prints-burglaries/YzItTSzR0Byar3W9IWIleN/"}
