{"authors":[],"date_download":"2018-10-30 19:34:10","date_modify":"2018-10-30 19:34:10","date_publish":"2016-12-15 21:51:09","description":"Though Cobb wasn't the main destination during Georgia's gold rush between late 1829 and the early 1840s, it did have a couple of hotspots.","filename":"data/vaneerConsumption/ActualFactualCobbWherewereCobbsoldgoldmineslocated.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/MyAJC/2014/11/13/Images/photos.medleyphoto.6404389.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_actual-factual-c_017f6636e55b86cf83e3bfbdaf659d09__icmp=np_inform_variation-control_1540928050.html","title":"Actual Factual Cobb: 'Where were Cobb's old gold mines located?'","title_page":"Actual Factual Cobb: 'Where were Cobb's old gold mines located?'","title_rss":"NULL","source_domain":"ajc.com","text":"Howdy! This is \"Actual Factual Cobb,\" and thus is much better than the rest of the Internet. In this column series, I — Ben Brasch — will keep rootin' for answers and tootin' news about Cobb County from questions you ask until the esteemed AJC fires me upon realizing how much of the newsroom's coffee budget is expended on me.\nWatch out, y'all, because I think Bob Braude is trying to get rich. He submitted this question to Actual Factual: \"Where were Cobb's old gold mines located?\"\nThough Cobb wasn't the main destination during Georgia's gold rush between late 1829 and the early 1840s, it did have a couple of hotspots mostly centered around family homes in Acworth and a railroad.\nBut first, let’s put into context just how nuts the gold rush was in the state.\nAccording to the New Georgia Encyclopedia, no documented evidence of gold in Georgia was found until Aug. 1, 1829, when the Georgia Journal in Milledgeville published a notice saying two mines had been found in Habersham County.\nBut according to one legend, a young Benjamin Parks was on the lookout for deer west of the Chestatee River in 1828 when he kicked up an unusual-looking stone.\nAnd the rest is history.\nWell into his 90s, Parks recalled in a July 15, 1894, edition of the Atlanta Constitution what the gold rush was like: “The news got abroad, and such excitement you never saw. It seemed within a few days as if the whole world must have heard of it, for men came from every state I had ever heard of. They came afoot, on horseback and in wagons, acting more like crazy men than anything else. All the way from where Dahlonega now stands to Nuckollsville [Auraria] there were men panning out of the branches and making holes in the hillsides.”\nAfter some web-sleuthing, I found the “Second Report on the Gold Deposits of Georgia” on the state Environmental Protection Division website.\nThis report, dated 1909, from the Geological Survey of Georgia, was an absolute bevy of information.\nThe report says that the Carroll County gold belt crossed the northeast corner of Cobb. The gold path within the county passed a few miles northwest of Lost Mountain, crossed the Western and Atlantic Railway and about a mile and a half southeast of Acworth.\nTwo or three miles northeast of where it crossed the railway is where that gold belt met with the historic Dahlonega gold belt near the Cherokee-Cobb county line.\nBut, Bob, I think I know what you want. You want specifics, and I can respect that. So here’s where the state geologists found the largest concentrations of gold in Cobb in that 1909 report:\n♦ The Payne, Kendrick, Randall and House properties were about a mile and a half southeast of Acworth by the Western and Atlantic Railway.\n“Gold was discovered at this locality in the placer deposits along branches tributary to Proctors Creek and these placers, covering comparatively small areas were worked before the Civil War,” the report reads.\n♦ The Freeman mine, near the other properties but half a mile west of the railway, had a main shaft about 230 feet deep.\nBut by that point in 1909, the mine was shut. And a geologist who wrote the report sounded sad that that he wasn’t able to go underground.\nLike Cobb County News Now on Facebook | Follow us on Twitter and Instagram.\n“It was regretted that no opportunity was afforded to examine the vein at this mine, as parties familiar with ore bodies give favorable opinions of their value.”\n♦ The Hamilton mine was just northeast of the Freeman mine but on the eastern side of the railway. After examining the inner workings of the operation, historians weren’t able to figure out how successful the mine was.\n♦ And, OK, I know it’s not in Cobb, but the J.B. Kemp property about 10 miles northeast of Dallas had the goods. An earlier survey from 1896 has results from ore samples from a gold vein that was a foot thick. One sample showed .35 ounces of gold per ton. That worked out to about $7, in 1896, or about $188.26 now.\nSo there you have it, Bob. Just promise me one thing: You’ll remember your old pal Ben when you strike it rich.\nI, Ben Brasch, am a reporter with the AJC. To submit “Actual Factual Cobb” questions, contact me at ben.brasch@ajc.com or on Twitter at @ben_brasch, or via the form below.","url":"https://www.ajc.com/news/local/actual-factual-cobb-where-were-cobb-old-gold-mines-located/jxpzdRAD1bn5OPpxygAsWI/?icmp=np_inform_variation-control"}
