{"authors":["Associated Press"],"date_download":"2018-10-22 20:24:34","date_modify":"2018-10-22 20:24:34","date_publish":"2016-01-28 01:09:49","description":"WASHINGTON (AP) — \"Who is he?\" a new attack advertisement ominously wonders about Republican presidential candidate John Kasich, before trashing him as \"an O...","filename":"data/vaneerConsumption/AdagainstGOPcandidateKasichfundedbymysterydonors.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:2a91cef023cd4a95925b714eca8a037b-2vdWmEltwXfba0ce28e632248c7f-546_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420197_Ad-against-GOP-candidate-Kasich-funded-mystery-donors_1540239874.html","title":"Ad against GOP candidate Kasich funded by mystery donors","title_page":"Ad against GOP candidate Kasich funded by mystery donors | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ad against GOP candidate Kasich funded by mystery donors\nWASHINGTON (AP) — \"Who is he?\" a new attack advertisement ominously wonders about Republican presidential candidate John Kasich, before trashing him as \"an Obama Republican.\"\nBut the commercial raises another question: Who's asking?\nA group called the American Future Fund is paying $1 million to air the anti-Kasich ad in New Hampshire, where the Ohio governor is trying for a strong finish in the Feb. 9 primary that could propel him into the top tier of the dozen GOP presidential contenders.\nRepublican presidential candidate, Ohio Gov. John Kasich speaks during a campaign stop, Tuesday, Jan. 26, 2016, in New Boston, N.H. (AP Photo/Matt Rourke)\nThe 30-second commercial shows Kasich smiling at an appearance with President Barack Obama, noting that the Ohio governor welcomed the expansion of Medicaid, something many Republicans bitterly oppose. The ad calls Kasich \"Not a conservative. Not even a moderate.\"\nAs a nonprofit, the conservative policy group does not have to disclose its donors. That sets it apart from the usual advertisers — candidates and super political action committees — which must regularly make public the names of their donors.\nKasich campaign spokesman Rob Nichols accused the ad's producers of \"shadowy, desperate, misleading attacks.\"\n\"This is a perfect example of dark-money political spending,\" said Paul S. Ryan, deputy executive director of the Campaign Legal Center, which advocates for more campaign finance disclosure. \"It's an ad vetted by clever lawyers who know what they're doing.\"\nThat means that even though Kasich allies have complained to the Federal Election Commission about the \"shady donors with concealed identities,\" they're likely to remain secret.\nNick Ryan, an Iowa-based GOP strategist who founded American Future Fund in 2007, said he never reveals his contributors. The Kasich spot is the group's first of the 2016 presidential race, and he said he deployed the ad because \"until now, John Kasich has pretty much gotten a free pass.\"\nWith no information, something of a parlor game developed as to who might be behind the ads — and whether it could be another candidate.\nKasich's campaign is pointing to recent endorsement by almost all of New Hampshire's daily newspapers, as well as one of the country's largest — the Boston Globe — as evidence of growing momentum in support of the Ohio governor.\nKasich, Marco Rubio, Jeb Bush and Chris Christie are trying to gain steam as the favorite candidate among traditional Republican Party voters, potentially enabling them to compete with frequent poll leaders Donald Trump and Ted Cruz.\nMatt David, a Kasich supporter, said on Twitter that \"multiple sources\" said the ad is linked to Right to Rise, a super PAC backing Bush. Right to Rise leader Mike Murphy responded on Twitter: \"Nope. Not us. I think it is somebody else who likes dark money ads and needs more votes in NH fast.\"\nMurphy appeared to be pointing toward Marco Rubio, who has benefited from $11.6 million in supportive commercials paid for by the advocacy group Conservative Solutions Project — which, like American Future Fund, does not disclose its donors.\nJeff Sadosky, a spokesman for Conservative Solutions Project, said his group had nothing to do with the American Future Fund ad.\nOne reason to suspect a Bush tie is that American Future Fund and Right to Rise have a common admaker, Larry McCarthy. The Bush super PAC also has recently begun using similar messages about Kasich in mailings to New Hampshire voters.\n\"I'm happy to see that we have other allies in the effort to educate voters about Kasich, but this wasn't us,\" McCarthy said about the American Future Fund ad. He said he has not done any work this year with American Future Fund.\nAmerican Future Fund overlaps with yet another presidential candidate: Mike Huckabee.\nNick Ryan leads a super PAC helping the former Arkansas governor, who has staked his candidacy on the Iowa caucuses next week and has done almost no politicking in New Hampshire. Ryan also works with several Iowa nonprofits that oppose Ted Cruz over his desire to end federal ethanol subsidies — an economy driver in the farming-heavy state.\nRyan said no candidate allies approached him about doing the ad.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3420197/Ad-against-GOP-candidate-Kasich-funded-mystery-donors.html"}
