{"authors":["Rodney Ho"],"date_download":"2018-10-30 21:18:28","date_modify":"2018-10-30 21:18:28","date_publish":"2018-10-30 19:53:00","description":"Originally posted Tuesday, October 30, 2018 by RODNEY HO/rho@ajc.","filename":"data/vaneerConsumption/AdamDevineWorkaholicsPitchPerfectrsqu.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Images/Adam%20Devine.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_radiotvtalk_adam-devin_7f155e114a6d6d2f32713ba70c2946d7__1540934308.html","title":"Adam Devine (‘Workaholics,’ ‘Pitch Perfect&rsqu","title_page":"Adam Devine (‘Workaholics,’ ‘Pitch Perfect&rsqu","title_rss":"NULL","source_domain":"ajc.com","text":"Originally posted Tuesday, October 30, 2018 by RODNEY HO/rho@ajc.com on his AJC Radio & TV Talk blog\nAdam Devine, actor and stand-up comic best known for his Comedy Central show “Workaholics,” a recurring spot on “Modern Family” and Bumper in the first two “Pitch Perfect” films, has never performed in Atlanta - until tonight.\nHe comes to the Tabernacle bringing his brand of lighthearted observational humor and Midwestern charm. (Buy $39.50 tickets here.)\n“I’m not as big a maniac as Adam DeMamp [from ‘Workaholics] or my liver would explode in 45 pieces. I’m also not as sweet a person as my ‘Modern Family’ character,’ he said. “I’m a happy medium. Everyone I’ve played, I bring myself. Maybe I’m just not that good of an actor because every character is a version of myself. I know how to act like me.”\nHe had booked a show in Atlanta a couple of years ago but a movie commitment forced him to cancel. His girlfriend Chloe Bridges had shot a season of VH1’s short-lived “Daytime Divas” locally and he visited a couple of times so he’s excited to perform here for the first time.\nDevine was in Charleston, S.C. for a show when I spoke to him Monday. By coincidence, he recently booked a dark comedy on HBO that will shoot there starting in January about a televangelist family called “The Righteous Gemstones” also starring Danny McBride as his older brother and John Goodman as his dad.\n“I’m the grounding force of the family which is pretty fun to play,” Devine said. “We’re wildly successful like Joel Osteen but corrupt, too.”\nIt helps that McBride “is a true hero to me.”\nHe recalled meeting McBride for the first time a few years ago at a party and uttered the dorkiest thing possible: “You’re a bright shooting star!’” He was relieved that years later, McBride does not recall what he said at all.\nCharleston is a fine city to shoot a TV show, he said, but the culinary Siren song there could have serious implications for his waistline.\n“The food and booze here is so delicious, I’m making a decision that my character will be 10 to 15 pounds fatter than Adam Devine normally is,” said Devine, who had just consumed char-grilled oysters slathered in butter and fried chicken for lunch.\nDevine knows this type of diet won’t turn his body into that of his friend Zac Efron, who is not just super abs-hot, he said, but super nice. In fact, Devine said he and his comedy friends spend all day busting each other’s chops, but Efron is too darn sincerely polite. “You feel like a monster if you give him s*** because he won’t give it back at you,” Devine said.\nHis most annoying feature to his friends, he said, is his general gabbiness. During “Workaholics,” in front of reporters, he would tend to dominate the proceedings. “I do have an off switch,” he insists. You just don’t see it that often in public.\nThe Omaha, Neb. native uses his down time to watch Netflix, citing the Midwest show shot in Atlanta “Ozark” as an example. He also purchased a small boat where he goes fishing off Newport Beach. (His dad was a serious bass fisherman.)\nAnd speaking of Netflix, he is excited to go back to his hometown to shoot his upcoming special on that streaming service November 10 at the legendary Orpheum Theatre, a place he remembers going to see “The Nutcracker” as a kid.\n“I set that date and worked my tour around it,” he said.","url":"https://www.ajc.com/blog/radiotvtalk/adam-devine-workaholics-pitch-perfect-comes-atlanta-for-first-time-perform-stand/tbJTGeFEVUyJ6xq5dEwYUO/"}
