{"authors":["Abc News"],"date_download":"2018-10-30 00:53:20","date_modify":"2018-10-30 00:53:20","date_publish":"2018-10-28 17:46:23","description":"Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.","filename":"data/vaneerConsumption/AdamVinatieripassesMortenAndersenonscoringlist.json","image_url":"http://media.video-cdn.espn.com/motion/2018/1029/dm_181029_kershaw_machado_future/dm_181029_kershaw_machado_future_default.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Sports_adam-vinatieri-passes-morten-andersen-scoring-list_story_id=58812038_1540860800.html","title":"Adam Vinatieri passes Morten Andersen on scoring list","title_page":"Adam Vinatieri passes Morten Andersen on scoring list - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"OAKLAND, Calif. -- Move over, Morten Andersen: There's a new NFL all-time points leader.\nIndianapolis Colts kicker Adam Vinatieri moved ahead of Andersen when he made a 25-yard field goal with 29 seconds left in the first half against the Oakland Raiders on Sunday. Vinatieri went into the game needing five points to pass Andersen's 2,544 career points.\nThe game was stopped briefly, and many of Vinatieri's teammates met him on the field and congratulated him. Vinatieri tied Andersen with an extra point and 26-yard field goal in the first quarter.\nThere was a possibility that Vinatieri would have to wait until after the Colts' bye week to pass Andersen because he suffered a groin injury on the first of his two missed extra points in the team's Week 7 game against Buffalo. Vinatieri didn't practice Wednesday before testing his groin out in practice Thursday.\nPassing Andersen, who had held the top spot since he retired in 2007, is just another accomplishment for Vinatieri on his road to likely being a first-ballot Pro Football Hall of Famer. The 45-year-old Vinatieri moved ahead of Andersen for most field goals made in a career on Sept. 30 against Houston.\nVinatieri, who played at NCAA Division II school South Dakota State, began his professional career by making a stop in the now-defunct NFL Europe before getting a shot with the New England Patriots in 1996.\nVinatieri's first significant moment came when he made arguably the greatest kick in NFL history, a 45-yard field goal in a blizzard to get the Patriots to overtime, then made the winner to beat the Raiders in a playoff game in January 2002. That ignited New England's dynasty. Vinatieri has made 27 game-winning field goals, including ones in Super Bowl XXXVI and XXXVIII.\nHe also made an NFL-record 44 straight field goals, a streak that ended during the 2016 season, and he has made at least 80 percent of his attempts in 16 of his 23 seasons.\nVinatieri spent the first 10 years of his career in New England, where he totaled 1,158 of his points before signing with the Colts as a free agent in 2006.","url":"https://abcnews.go.com/Sports/adam-vinatieri-passes-morten-andersen-scoring-list/story?id=58812038"}
