{"authors":["Alex Kritselis"],"date_download":"2018-10-30 22:43:07","date_modify":"2018-10-30 22:43:07","date_publish":"2014-08-14 20:38:55","description":"In June, pop star Adam Lambert kicked off a world tour as the new front man of rock band Queen, and so far, the tour is a success. Critics and fans alike have praised Lambert's ability to \"fill in\" for Queen's former lead singer, the late, great…","filename":"data/vaneerConsumption/AdamLambertQueenMayContinueWorkingTogetherButHowWillThatAffectLambertsSoloCareer.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/ab177133-dec5-4b05-b203-890f93743070.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35831-adam-lambert-queen-may-continue-working-together-but-how-will-that-affect-lamberts-solo-career_1540939387.html","title":"Adam Lambert & Queen May Continue Working Together, But How Will That Affect Lambert's Solo Career?","title_page":"Adam Lambert & Queen May Continue Working Together, But How Will That Affect Lambert's Solo Career?","title_rss":"NULL","source_domain":"bustle.com","text":"In June, pop star Adam Lambert kicked off a world tour as the new front man of rock band Queen, and so far, the tour is a success. Critics and fans alike have praised Lambert's ability to \"fill in\" for Queen's former lead singer, the late, great Freddie Mercury, and the tour is going very well, indeed. So well, in fact, that band member Brian May recently hinted that Queen may continue working with Lambert after the tour is finished. But what would that mean for Lambert's currently on-hold solo career?\nAs TeamRock.com reports, May told Eddie Trunk during a recent interview that working with Lambert has really \"woken\" the band up. He continued:\nThere’s a big call to do more shows now. So, there’s a good possibility that we will do more shows. I think, beyond that, we’ll just see.\nIt's May's cryptic \"we'll just see\" comment that has led some people to believe that Lambert may have a future with Queen beyond the current tour. If there are indeed more opportunities for Lambert to continue working with band members May and Roger Taylor, should he take them? Absolutely! But he needs to keep an eye on his solo career.\nMichael Loccisano/Getty Images Entertainment/Getty Images\nLambert hasn't released a solo album in over two years. His last studio album, Trespassing, was released in May 2012, and it didn't perform especially well for the former American Idol contestant. In 2013, he parted ways with his record label, and he last spoke about his new album with Rolling Stone back in June — but only to say that it wasn't finished yet.\nIn my opinion, Lambert should definitely continue on as the new face of Queen if possible. He's strangely perfect for the role, and it really sounds like the band has a good thing going on right now. Working with Queen will undoubtedly further delay the release of his next album, but Lambert's fans are loyal. They'll wait for him. I'm just not so sure about the general public. This is where it becomes a delicate balancing act.\nMichael Loccisano/Getty Images Entertainment/Getty Images\nThe world of pop music can be very fickle. When you're hot, you're hot. But a couple weeks, a couple months, a couple years later? You could be \"out.\" Granted, two years is not a very a long time in the real world, but it certainly can be in the world of pop music. For example, until recently, Rihanna would put out a new album every year, presumably in an effort to keep her name out there and \"stay relevant.\" If Lambert waits too long to release another album, people could begin to forget about him. It's not easy for singers to rebuild their reputations once they've begun to fade or deteriorate. I think he needs to be careful.\nMichael Loccisano/Getty Images Entertainment/Getty Images\nI'm glad that Queen's tour is going so swimmingly, but I want to hear new material from Lambert, as well. In a perfect world, he'd be able to continue his relationship with Queen AND work on and promote his own stuff, too. We'll just have to wait and see what the future holds!\nQueen will reportedly released Queen Forever , a new compilation album that contains previously unreleased music recorded with Mercury, at some point in 2014.\nImages: Getty Images (3)","url":"https://www.bustle.com/articles/35831-adam-lambert-queen-may-continue-working-together-but-how-will-that-affect-lamberts-solo-career"}
