{"authors":["Richard Spillett","Crime Correspondent For Mailonline"],"date_download":"2018-10-23 00:34:41","date_modify":"2018-10-23 00:34:41","date_publish":"2017-03-16 10:04:24","description":"Former Sunderland footballer Adam Johnson has lost Court of Appeal challenges against his conviction for sexual activity with a besotted 15-year-old fan and his six-year jail sentence.","filename":"data/vaneerConsumption/AdamJohnsonlosescourtappealoverjailsentence.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E351A8200000578-0-image-a-9_1489657339201.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319422_Footballer-Adam-Johnson-LOSES-Appeal-Court-challenge_1540254881.html","title":"Adam Johnson loses court appeal over jail sentence","title_page":"Adam Johnson loses court appeal over jail sentence | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Former Sunderland footballer Adam Johnson lost appeals against his conviction for sexual activity with a 15-year-old fan\nPaedophile footballer Adam Johnson has today lost his legal challenges against his conviction for sexual activity with a 15-year-old fan and his six-year jail sentence.\nThe former England winger is estimated to have spent £1million getting back to court and could also face a further £1million compensation bill from his besotted victim.\nThree judges sitting at the Court of Appeal in London today dismissed his claims that the fact he was a famous footballer counted against him when he was jailed.\nLady Justice Rafferty, Mr Justice Sweeney and judge Julian Goose QC agreed that he had 'capitalised upon his celebrity' to abuse the child.\nThey also rejected his claims that his guilty plea for one offence had not been taken into consideration during his sentencing.\nThe Premier League star, who was sacked by Sunderland, launched a legal fight after he was jailed for six years last March for engaging in sexual activity with the besotted teenage fan.\nHis first appeal against his conviction and sentence was rejected by a single judge in July and today three Appeal Court judges backed the ruling.\nThe 29-year-old footballer admitted two counts of sexual activity with a child, involving kissing and grooming the teen, on the first day of his trial last year.\nThe former Sunderland and Manchester City winger (pictured with his girlfriend Stacey Flounders) was found guilty by a jury last year of one offence of sexual activity with a child\nA jury at Bradford Crown Court later convicted him of a third charge - groping the girl in his Range Rover in County Durham - for which he was jailed for five years.\nHe was cleared of another charge of sexual activity with a child under 16.\nMounting his appeal, Johnson's defence team claimed the trial judge, Jonathan Rose, misdirected the jury on issues of Johnson's credibility, and was influenced by the footballer's fame and success.\nThey argued the judge was wrong to allow the prosecution at trial to cross examine Johnson over the timing of his guilty pleas, which they said was 'misleading'.\nThey claimed this caused prejudice, 'creating the impression that timing was an attempt to save his job and mislead his football club, the Crown, court and public', the three judges noted.\nIn their judgement, they said: 'The renewed application for leave to appeal against conviction is refused. The judge in extensive sentencing remarks reminded himself of all possible relevant issues.'\nJohnson was a high-flying Sunderland and England star at the time he groomed the girl\nThe trio noted the single judge who refused the first appeal said there were many aggravating features - including grooming, the significant degree of planning, the significant disparity in age, and the deliberate seeking out of a private place to commit the offences.\nThe single judge also said: 'The applicant misused his position of influence to manipulate and exploit a girl who was to his knowledge acutely vulnerable because of her age and impressionable because of his perceived status as a celebrity.\n'When set against these aggravating factors, his otherwise good character counted for little; indeed, as the judge correctly pointed out, it set the scene for the commission of the offences.\n'Although a sentence of six years may be stiff, even severe, I do not consider it to be arguable that it was manifestly excessive.'\nThe three judges said they agreed with the single judge.\nThe appeal court judgment was given at the Royal Courts of Justice in London today\nThey added: 'We would not have used the phrase 'abuse of trust' nor would we have suggested his good character aggravated the matter.\n'The true descriptor of the first was that he capitalised upon his celebrity. His good character was of reduced assistance to him as a consequence.\n'Neither of these comments impugns the overall sentence. Its structure was appropriate and avoided double-counting. The discount for plea was adequate.\n'This renewed application is refused.'\nFollowing the judgement, Johnson's sister, Faye, retweeted a MailOnline columnist Katie Hopkins tweet, which called the lost appeal 'utter madness'.","url":"https://www.dailymail.co.uk/news/article-4319422/Footballer-Adam-Johnson-LOSES-Appeal-Court-challenge.html"}
