{"authors":["Kara Frame"],"date_download":"2018-10-23 05:38:27","date_modify":"2018-10-23 05:38:27","date_publish":"2016-11-11 00:00:00","description":"NPR's Kara Frame traces her father's PTSD, and those of his Army comrades, back to a terrible battle in Vietnam. In a short documentary film, she also explores the impact it's had on their families.","filename":"data/vaneerConsumption/ADaughterExploresHerFathersPTSDFromVietnamUntilToday.json","image_url":"https://media.npr.org/assets/img/2016/11/10/kara-ptsd-11-10-16_wide-7ce6b63cf5a19b602f5d5afc789ce96b0f1dcee2.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_parallels_2016_11_11_500674719_a-daughter-explores-her-fathers-ptsd-from-vietnam-until-today_1540273107.html","title":"A Daughter Explores Her Father's PTSD, From Vietnam Until Today","title_page":"A Daughter Explores Her Father's PTSD, From Vietnam Until Today : Parallels : NPR","title_rss":"NULL","source_domain":"npr.org","text":"A Daughter Explores Her Father's PTSD, From Vietnam Until Today\nYouTube\nEditor's Note: NPR's Kara Frame made this short documentary film, I Will Go Back Tonight, on the battles with PTSD that her father and his Vietnam War comrades have faced in the decades since they served. On Veterans Day, here's their story, with an introduction from Kara.\nI first knew my dad, Tom Frame, was different when I was young, but I didn't know exactly how. Every year when he marched in our Memorial Day Parade in Doylestown, Pa., I stood on the side of the road waving my tiny American flag with so much pride.\nHe was my dad, my veteran.\nAs a teenager, I began to learn about his time in Vietnam during the late 1960s. I heard about fallen men, fierce battles and something called post-traumatic stress disorder. I still didn't fully grasp at that time what my father was living with, and it wasn't until my late 20s that I was ready to dive into a project about my dad's PTSD.\nThe U.S. Department of Veterans Affairs estimates that 30 percent of all Vietnam veterans have suffered from PTSD, and the effects can last many years.\nWhen I began this project in 2014, I knew it would give me insight into my dad and his experiences in his early 20s, when he was fighting in Vietnam. I never anticipated the depth of understanding it would offer me into my mother and her life — standing by a veteran with deep-rooted trauma — and the role PTSD has played in their marriage.\nThe documentary project follows the lives of my father and several other Vietnam veterans from his Army unit, the 1st Battalion, 5th (Mechanized) Infantry, 25th Infantry Division, who served together.\nThe veterans recount a terrible ambush at a rubber plantation in Ben Cui on Aug. 21, 1968. And their wives open up on how PTSD has affected their marriages in the decades since.\nTo comment, go to this story on NPR's Facebook page.","url":"https://www.npr.org/sections/parallels/2016/11/11/500674719/a-daughter-explores-her-fathers-ptsd-from-vietnam-until-today"}
