{"authors":["Alisha Prakash"],"date_download":"2018-10-30 21:08:23","date_modify":"2018-10-30 21:08:23","date_publish":"2016-12-22 00:00:00","description":"Oyster's hotel investigator, Alexandra Creange, reveals that the job is really like.","filename":"data/vaneerConsumption/Adayinthelifeofaprofessionalhotelreviewer.json","image_url":"https://amp.businessinsider.com/images/585c0a37dd089575208b4a04-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_what-a-professional-hotel-reviewer-does-2016-12_1540933703.html","title":"A day in the life of a professional hotel reviewer","title_page":"    A day in the life of a professional hotel reviewer - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Unsplash/jonathan pielmayer\nMany lust after the idea of traveling full-time — of swapping their cramped cubicle for a nomadic lifestyle — but Alexandra Creange, a New Jersey native, is one of the lucky few who actually get to call globetrotting her 9-to-5 gig and the world her office. A frequent flier, Creange has visited the beaches of Bora Bora, traipsed through the jungles of Costa Rica, and marveled at the cityscape of New Delhi. Having traveled to 31 countries across four continents (15 of those were for work), her resume reads more like a world map. In 2016 alone, she spent about 160 days on the road, for both work and personal \"out of office\" days.\nSo what's her secret, you ask? Creange is one of Oyster's hotel investigators. That is to say she visits properties around the world to produce honest photos and reviews, so travelers just like her know exactly what they're going to get before they touch down. Each day, we at Oyster offer expert travel advice, hotel reviews, and vacation inspiration. Today, we'd like to take you behind the scenes and reveal what goes into making these decisions. Below, Creange takes us on a journey through the ins and outs of the gig, including the glamorous snip-its (like spotting incredible wildlife in the Galapagos) and mortifying mishaps (like that time she told a hotel manager she was \"pretty\" instead of \"ready,\" thanks to her then-rusty Spanish). She even throws in her favorite hotels and destinations plus some top travel tips, advice, and words of wisdom that she's picked up during her jet-setting adventures. In other words, you can expect a mix of business and pleasure.\noyster.com\nCan you walk us through a day-in-the-life of being an Oyster hotel investigator?\nWhen I'm traveling, my day typically begins around six -- or earlier if a hotel has requested sunrise shots or photos of the breakfast buffet before it opens. After breakfast, I head to my first shoot. Sometimes this is as easy as hailing a cab or driving myself in a rental car. Other times I need to take a boat or an all-terrain vehicle. In Fiji, I arrived at a few remote hotels by seaplane. Typically, I shoot one large hotel or two small hotels per day. A large hotel can take anywhere from six to eight hours to photograph, while some smaller ones take about two or three hours. At the end of the day, I'm usually exhausted, and crash into bed after dinner. When I'm not traveling, I work from home. This is when I get all of my review writing done. A lot of people find it interesting that I never go into an office.\nHow would you describe reviewing hotels for a living?\nReviewing hotels for a living is a dream come true. When I was little, I loved watching Samantha Brown on the Travel Channel. She hosted a show called \"Great Hotels\" and I always dreamt of having a career like hers. Sometimes I still need to pinch myself -- it's hard to believe this is actually my job!\nHas photographing and reviewing hotels as a job changed how you travel and book accommodations?\nBecause I spend so much time at hotels and resorts for work, I like to book B&Bs for my personal travels. I love the intimate nature of bed-and-breakfasts and I really enjoy getting to know their hosts. Also, 90 percent of the destinations I travel to for work are beach-y locations, so when I'm not working, I like to visit cities or mountainous areas. Recently, I went to Fiji for work, then took a two-week vacation on the South Island of New Zealand.\nWhat has been your favorite work trip?\nMy favorite work trip was the Galapagos. The wildlife was incredible and the scenery was almost otherworldly. It was so different from any other place I've ever traveled. And it's so hard to pick a favorite destination. I love the frenetic energy of places like New Delhi and Cartagena, but I also love the tranquility of islands like Maui and Turks and Caicos Islands. Bermuda is my favorite destination to visit in the spring and Prague is unbeatable in the fall. Fiji is number one in my book for hospitality, while Bora Bora wins for wow factor. I lived in Paris for a few months in college, so the City of Lights will always hold a special place in my heart. Did I mention Costa Rica? I love Costa Rica, too.\nCatching the Oyster drone in Punta Cana oyster.com\nAnd what about your favorite hotel?\nThis is another tough one. The Four Seasons Bora Bora wins for favorite luxury spot. Finch Bay Eco Hotel and Cooper Island Beach Club are really cool eco-chic properties. The Reefs and Casa Veintiuno are awesome boutiques. And Garden by the Sea B&B is one of the nicest bed-and-breakfasts I've ever had the pleasure of staying in.\nWhat's one of your most memorable moments on the road?\nMy Spanish has drastically improved since I started this job. I can now conduct entire shoots in Spanish (thank you, Colombia) and I can hold basic conversations with strangers. However, when I first started the job, my high school Spanish skills were a little rusty. One of the funniest mistakes I've ever made was confusing the words \"lista\" and \"linda\" -- \"ready\" and \"pretty.\" At one hotel in Playa del Carmen, whenever I finished shooting an area, I would say \"soy linda\" to the manager. In my mind I was saying \"I'm ready,\" but I was really telling him that I was pretty. He didn't have the heart to correct me, but his chuckles led me to believe I was saying something incorrectly. When I did a quick Google search later on, I was mortified.\nThat's too funny! Have you ever had any mishaps while traveling for work?\nShortly after arriving in Bora Bora, I made the horrifying discovery that the electrical outlets were European, not American. Bringing converters had never crossed my mind and immediate panic set in. Oyster had sent me halfway across the world to cover nearly 30 properties, and because of my careless oversight, I was suddenly incapable of charging my camera equipment. Bora Bora is incredibly remote, so strolling into the nearest Best Buy to purchase a couple of converters wasn't exactly an option. I was staying in a tiny guest house, so the owner drove me to a ramshackle shop down the road. I wish I had a picture of this establishment; from its humble exterior, it looked as though nothing from the 21st century could possibly be sold inside. I don't speak any French, so I pantomimed what I was looking for to the cashier. She rummaged through a few drawers and finally pulled out a dusty converter. I paid her the equivalent of five U.S. dollars. I don't think I've ever been happier. That five-dollar convertor charged all of my camera equipment, my phone, and my laptop for the rest of my month-long trip.\nWorking in the rain in Bora Bora oyster.com\nMany might consider your travel job to be pretty glamorous — would you describe it that way?\nTraveling for a living is a dream job, but it isn't glamorous. A lot of people think I spend my days sipping piña coladas by the pool or getting massages on the beach. They don't realize I have a rigorous schedule that entails long hours and stressful moments just like any other job. I've gotten lost while driving, missed connecting flights, and sometimes I have to deal with a few safety issues that arise from being a solo female traveler.\nWhat's left on your travel bucket list?\nRight now, all of South America is on my radar. For work, it would be a dream to visit hotels in the Atacama Desert or Chilean Patagonia — they look incredible. I've also never been to Africa, so visiting game lodges in the Serengeti or tented camps in the Okavango Delta would be a lot of fun.\nWhat's the most rewarding part about your job? And the worst?\nOne of the most rewarding parts of my job is when I visit small hotels that wouldn't typically be able to afford a professional photo shoot. The service we provide at Oyster is free and some hotel owners are overjoyed to have us come take photos of their property. The worst part of my job is the loneliness. I travel alone constantly and am quite accustomed to being on my own — sometimes I even prefer to be by myself. But loneliness is bound to happen. It's especially tough when I miss out on fun things going on at home or when I'm away for holidays or birthdays.\nCartagena, Colombia oyster.com\nWhich hotel surprised you the most?\nAfter visiting every single luxury hotel in Bora Bora, I was less than thrilled when my next stop was a tiny pension (guesthouse) on Taha'a. Most of the pensions I had visited previously were incredibly rustic with few amenities -- a stark contrast to the Four Seasons and the St. Regis. But when I arrived at Pension au Phil du Temps, my preconceived notions evaporated. Muriel and Franck, the pension's owners, made me feel so welcome in their charming guesthouse. Even though we couldn't communicate very well -- they don't speak much English and I don't know French -- sharing meals with them and a few other guests was a highlight of my trip to French Polynesia. Muriel is an excellent cook and I still dream about her homemade yogurt with local vanilla.\nGiven that you're an expert, do you have any insider tips for folks who are looking for hotels for their own vacation?\nSocial media is a great tool to utilize when looking for hotels. Try connecting with a property's social media outlets (if they have any) before your arrival. Establishing an e-relationship with your hotel usually leads to great customer service.\nOyster/Alexandra Creange\nWhat's your top travel tip for those who aren't frequent fliers such as yourself?\nMy advice would be to research diligently and set expectations accordingly. It's good to know as much as possible about your hotel, like if it's located on the beach or if it's far away from the airport — that way, when you arrive, there aren't any unwanted surprises. It's also important to keep an open mind. Expecting any hotel or vacation to be perfect is unrealistic, so try to roll with the punches whenever they arise.\nOn the flip side, what's the best travel advice you've received?\nThe best travel advice I've ever received actually came from Oyster founder and CEO, Eytan Seidman. When I interviewed for the job, he told me that every hotel exists for a reason, and as hotel investigators, it's our job to find out what that reason is. I think this ideology can extend to traveling as well. All destinations have some kind of appeal. The key to being a successful traveler is discovering what that appeal is and making the most of it. Jamaica wasn't my favorite place on earth, Copenhagen didn't knock my socks off, and I found Honolulu a tad overrated. But that's okay because I can still appreciate what makes these places great. And if nothing else, my time in these places served as valuable learning experiences in my career as a professional traveler.","url":"https://www.businessinsider.com/what-a-professional-hotel-reviewer-does-2016-12"}
