{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:55:54","date_modify":"2018-10-30 19:55:54","date_publish":"2015-05-06 15:52:07","description":"Add Garland Attackers To List Of Names That Prove Background Checks Don't Work","filename":"data/vaneerConsumption/AddGarlandAttackersToListOfNamesThatProveBackgroundChecksDontWork.json","image_url":"https://media.breitbart.com/media/2015/05/garland-shooter-scene-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_06__1540929354.html","title":"Add Garland Attackers To List Of Names That Prove Background Checks Don't Work","title_page":"Add Garland Attackers To List Of Names That Prove Background Checks Don't Work | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On May 5 CNN reported that the two gunmen who attacked Garland’s Curtis Culwell Center acquired their guns “legally.”\nThe use of the word “legally” implies that the two alleged gunmen–Elton Simpson and Nadir Soofi–went through background checks to acquire their weapons. This makes them only the latest in a long list of high profile examples which prove that background checks are an ineffective way to fight crime.\nHere is an updated list of high profile attackers who passed background checks for their guns:\nElton Simpson and Nadir Soofi (Garland), Jared and Amanda Miller (Las Vegas), Aaron Ybarra (Seattle Pacific University), Elliot Rodger (Santa Barabara), Ivan Lopez (Fort Hood 2014), Darion Marcus Aguilar (Maryland mall), Karl Halverson Pierson (Arapahoe High School), Paul Ciancia (LAX), and Aaron Alexis (DC Navy Yard), James Holmes (Aurora theater), Jared Loughner (Tucson), Nidal Hasan (Fort Hood 2009), Jiverly Wong (Binghamton), Seung-Hui Cho (Virginia Tech), and Naveed Haq (Seattle).\nIronically, since 1791 Americans have purchased their guns privately from co-workers, friends, family, neighbors, and other decent people who might be selling a gun to get the four or five hundred dollars they need to make ends meet on a given month. But the left stepped in during the Clinton presidency and told us we were not safe without background checks. Thus background checks for all retail gun purchases were implemented.\nAnd now, Gabby Giffords, her husband Mark Kelly, and outspoken gun control advocate Senator Joe Manchin (D-WV) tell us that an expansion of background checks–so as to include private sales as well–is the “responsible” thing to do.\nYet the Garland attackers stand in stark contrast to these claims and expose the fact that Americans are trading freedom for constraint via background checks, and getting nothing but attacked in return.\nFollow AWR Hawkins on Twitter @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/05/06/add-garland-attackers-to-list-of-names-that-prove-background-checks-dont-work/"}
