{"authors":[],"date_download":"2018-10-30 14:31:55","date_modify":"2018-10-30 14:31:55","date_publish":"2018-07-18 22:39:00","description":"John Wilkins III, who serves at Cafe Lily in Decatur won the 2018 Waiters’ Race in Atlanta.","filename":"data/vaneerConsumption/ADecaturserverremainstheundefeatedWaitersRaceAtlantachampion.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/18/Images/37313553_1911535915810578_2059393250283749376_o_1916x1199.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_decatur-server-r_c93da97ad4c4c603d369aaf243d132b8__1540909915.html","title":"A Decatur server remains the undefeated Waiters’ Race Atlanta champion","title_page":"A Decatur server remains the undefeated Waiters’ Race Atlanta champion","title_rss":"NULL","source_domain":"ajc.com","text":"The winner of last year’s Waiters’ Race almost didn’t make it to defend his title.\nJohn Wilkins III was at a wedding in North Carolina last weekend when he realized the second annual event was on Sunday. So he made a plan: Drive the seven hours from Durham straight to the race at The Shops Buckhead Atlanta — win it — and then immediately head to Charleston for vacation.\nAnd that’s exactly what he did. Trophy in hand.\nWilkins had good reason to derail his plans for the competition, in which local servers are judged on speed, service and style. The prize is a round-trip ticket to Paris for two, and when he took his girlfriend after winning the first time, he came back with a fiancee.\n“It worked out really well,” said Wilkins, who serves at Cafe Lily in Decatur. “The race made that possible.” In addition to his Paris trip, the restaurant gets to keep the trophy for a year.\nRace participants had to navigate obstacles while holding a loaded server’s tray in one hand without spilling its contents. They were then challenged to open and pour a perfect glass of champagne in front of a panel of esteemed judges, such as TV and radio host Dana Barrett and food writer Carolyn O’Neil.\nThe winning #pour! Congratulations to John Wilkins of Cafe Lily on winning the 2018 Waiters’ Race #Atlanta (second year in a row!). @LeBilboquetAtl @ShopBuckheadAtl pic.twitter.com/KYVEIdtz1r — Dana Barrett (@TheDanaBarrett) July 15, 2018\n“My adrenaline was going through the roof,” Wilkins said. He was sure he’d lost — that his champagne bubbles would settle farther than an inch from the rim, or that there wouldn’t be enough water left in the glass on his tray.\nAlas, the Stone Mountain resident narrowly beat more than 20 other servers to win.\nREAD | Job alert: Restaurant coming to Phipps Plaza hiring 285 employees\nREAD | Maine names Atlanta lobster roll world’s best, and people have jokes\nThe Waiters' Race is inspired by a century-old tradition held on the cobblestone streets of Paris, and the event date coincides around the celebration of Bastille Day. It was extra festive this year, Wilkins said, because France had just won the World Cup.\n“Everyone was in a real French state of mind,” he said. The race, partly hosted by Le Bilboquet Atlanta, was book-ended by a summer block party with live entertainment, outdoor cocktail bars, food tasting stations, children’s games and a bocce court.\nWilkins has been with Cafe Lily, a casual fine dining Mediterranean restaurant, since January 2017. The service industry gives him flexibility as an actor, the career he moved to Atlanta to pursue after pivoting from sales and marketing in his 30s.\nThe North Carolina native said he was happy to see more servers, especially women, compete this year. But he hopes many more people enter and attend the event in 2019, mostly because the proceeds go to The Industry Fund and the Giving Kitchen, which are nonprofits that support Atlanta restaurant workers.\nThese groups were recognized by Fulton County Commission Chairman Robb Pitts, who presented the nonprofits a proclamation naming this July 15 as “Waiters’ Race Atlanta Day.”\nAnd, yes, Wilkins plans to compete next year. Vive la France.\n[Insert text here]\nLike Intown Atlanta News Now on Facebook | Follow us on Twitter\nIn other recent news...","url":"https://www.ajc.com/news/local/decatur-server-remains-the-undefeated-waiters-race-atlanta-champion/L7wNxuLYMuxHkauTOG4LUI/"}
