{"authors":["Monique Friedlander","Charlotte Foster For Daily Mail Australia"],"date_download":"2018-10-23 01:44:14","date_modify":"2018-10-23 01:44:14","date_publish":"2017-03-10 10:09:02","description":"Adele wowed audiences in Sydney on Friday despite being forced to leave fans waiting for 45 minutes for the show to start due to transport nightmare.","filename":"data/vaneerConsumption/AdeleforcedtodelayherSydneyconcertfor45minutes.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22BB5000000578-0-image-a-83_1489148113089.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300376_Adele-concertgoers-left-stranded-Sydney-train-stations_1540259054.html","title":"Adele forced to delay her Sydney concert for 45 minutes","title_page":"Adele forced to delay her Sydney concert for 45 minutes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"British singer-songwriter Adele took to the stage on Friday night in Sydney 45 minutes later than she planned as most of her audience were left stranded on public transport.\nAdele sold out ANZ stadium with 95,000 people in attendance and wowed the audience as she took to the stage 45 minutes late.\nFollowing hours of traffic delays and chaos to get to the concert, Adele decided to start her show later because at 7.30pm when the show was meant to start, the stadium was 'about 35 per cent full'.\nScroll down for video\nSydney fans were stunned as Adele graced the stage with backdrops of the Opera House\nRumour Has It! Adele serenaded her Sydney audience despite starting 45 minutes late\nAdele was beaming with excitement to perform to her Sydney crowd of 95,000 people\nDespite starting the show 45 minutes later than anticipated, Adele wowed her 95,000 large audience.\nShe wore a maroon, diamond embellished ballgown as she serenaded her devoted fans who struggled to arrive at the venue on time.\nShe performed award-winning tracks from her latest album titled 25, as well as other classic, fan-favourite songs.\nWouldn't want to get lost in that crowed! The seething mass of fans crowded around before the show began\nLight it up! 95,000 phones lit up for Adele's ballads in Sydney\nPrime position: Adele stunned her audience as she sang hits from her latest album called 25\nPicturesque: Adele wowed her Sydney audience in a purple ballgown\nSquishy situation: Some concergoers lashed out at NSW Trains for failing to prevent over-crowding on public transport ahead of the concert\nToo hot: One Adele fan Tweeted a message to NSW Trains complaining about the lack of air conditioning on public transport ahead of the show\nNot angry, just disappointed! Another fan simply Tweeted that Sydney trains were 'letting us down as usual'\nThousands of concertgoers took to social media to share their concert pictures.\nPhotos from the front section showed Adele up close and personal serenading every fan.\nAudience member at the back of the stadium had a birds eye view of the incredible scenes of every one in the crowd holding up their mobile phones to create a sea of light.\nThe British singing sensation took to the stage after thousands of fans complained of extensive traffic and public transport delays in Sydney to arrive on time.\nStar-studded audience! Former Bachelor contestant Bec Chin attended the event with her boyfriend Dean Vee\nSea of lights: Hoards of lit-up phones swayed in unison as Adele performed some of her most iconic hits\nA flash of red: Snaps from the nose-bleed section of the stadium show the crowds illuminate by screens above the stage\nClose-up: Huge screens showed Adele's every move as she performed in the round\nAt the beginning of the show, the star took to the stage to apologise for the delay.\n95,000 people are expected at Friday's show, with her second concert on Saturday said to be sold out as well.\nAdele is in town to perform on the third leg of her Australian tour, having already sold-outs stadium shows in Perth and Brisbane.\nHoards: The view from ANZ stadium shows thousands of people trying to get to their seats before the start of the Adele concert in Sydney on Friday\nWindswept! A large fan seemed to be blowing toward Adele as she performed on stage\nDelay: Adele chose to start her show 45 minutes late as most of her audience were left stranded on public transport at the time the show was due to start\nGalaxy of stars! Photos taken during the concert could easily have been mistaken for images of space thanks to the expanse of twinkling lights\nHello from the train line! Train platforms all over Sydney were congested with Adele fans\nFans took to Twitter to express their frustration with not being able to arrive at ANZ stadium on time.\nOthers chose to tweet Adele directly and ask her to wait for her crowd that were mostly stuck on train platforms.\nIn response to this, Adele started her show at 8.15pm instead of 7.30pm, as more than 65 per cent of her audience were left stranded on public transport at the time the show was meant to start.\nStranded: Lidcombe station had thousands stranded while waiting for trains to Sydney Olympic Park\nShow-stopping traffic: Thousands were left stranded at train stations all over Sydney\nVideos have emerged of train stations in Western Sydney packed full of people waiting for the next available train to take them to the concert.\nStrathfield, Lidcombe and Central were said to be the busiest stations ahead of the shows.\nRoads all over Sydney are also congested as brave concertgoers attempt to battle the traffic for a prime parking space.\nGlittering moment: Some fans were seated so far away from the songstress appeared no bigger than a speck in the distance\n'Best concert of my life': Fans praised Adele for her jaw-dropping performance\n'Beautiful show!' Devotees flocked to Twitter with congratulatory feedback following the show\nCan't please them all! Some Sydneysiders Tweeted about the loud sounds emanating from the stadium into the night\n'Hello from the other side indeed!' One Sydney resident claimed that they could hear the concert from around 10km away\nHelp needed: Extra trains were running to deal with the crowd but they were still not enough\nHello from the other side: Over 90,000 people fought to make it inside ANZ stadium before the show started at 7.30pm\nThe equal numbers in the crowd have not seen since the 2000 Olympics as people have coined the concert as 'Adele-mageddon'.\nOne commuter played on Adele's lyrics by tweeting: 'Hello from the bus ride, the public transport people died'.\nEven NSW Police had a bit of fun on Twitter and told people to plan ahead.\nAdvice: NSW Police told concertgoers on Twitter to plan their trip\n'Any chance you can delay your show?' Concertgoers asked Adele on Twitter to wait for while people were stuck in traffic\n'We are stuck in traffic' Fans were worried they would miss the show because of the extensive traffic delays\nDespite the delays on Friday, people are being urged to get to the concert on Saturday using public transport instead of driving.\nPolice are encouraging people to take every precaution when arriving at Sydney Olympic Park due to the thousands of people in attendance.\nAfter her last Sydney show on Saturday, Adele will be heading to Adelaide and Melbourne, where she will finish the Australian leg of her tour.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300376/Adele-concertgoers-left-stranded-Sydney-train-stations.html"}
