{"authors":["Greg Styles For Daily Mail Australia"],"date_download":"2018-10-23 03:58:57","date_modify":"2018-10-23 03:58:57","date_publish":"2017-03-10 13:53:15","description":"Adele had her say on Justin Bieber's bad boy antics during the latest leg of her Australian tour on Friday night. After the crowd began to boo at the mention of his name, the singer defended Justin.","filename":"data/vaneerConsumption/AdeletalksaboutJustinBiebersbadboyanticsinSydney.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/3E22DD9800000578-0-image-a-41_1489151985091.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4301130_Adele-Justin-Bieber-bad-boy-antics-Sydney-gig_1540267137.html","title":"Adele talks about Justin Bieber's bad-boy antics in Sydney","title_page":"Adele talks about Justin Bieber's bad-boy antics in Sydney | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Adele had her say on Justin Bieber's bad-boy antics during the latest leg of her Australian tour on Friday night.\nDuring a break from belting out her biggest hits to 95,544 adoring fans at ANZ Stadium in Sydney, the 28-year-old asked the crowd whether they would be attending the controversial Canadian's own gig at the same venue next week.\nThe British songstress's question was met with a chorus of boos before she appeared to defend Justin, who burst on to the music scene with hit single One Time when he was just 15.\nSpeaking up: Adele had her say on Justin Bieber's bad boy antics during the latest leg of her Australian tour on Friday night\nAs the jeers rang out, she protested: 'If you started out at 12, you'd be like that too, okay!'\nAs Adele was commenting on his troubled past, Justin was on stage himself - performing the latest leg of his Purpose World Tour at Melbourne's Etihad Stadium.\nThe 23-year-old will take to the stage at ANZ Stadium on Wednesday - although he is only expected to pull in a crowd of 70,000.\nQ&A: The 28-year-old asked the crowd whether they would be attending the controversial Canadian's own gig at the same venue next week\nUnder-fire: The British songstress's question was met with a chorus of boos before she appeared to defend Justin\nDown Under: As Adele was commenting on his troubled past, Justin was on stage himself - performing the latest leg of his Purpose World Tour at Melbourne's Etihad Stadium\nSince becoming a global sensation as a teenager, the Love Yourself singer has had several brushes with the law and has endured a rocky relationship with paparazzi.\nJustin apologised to his Argentinean fans last year after cancelling plans to take his World Tour to the South American country after he was indicted for an incident involving a photographer in 2013.\nThe pop-star allegedly instructed his bodyguards to beat up and rob the snapper of his possessions after he took a picture of him exiting a nightclub in Buenos Aires.\nTwo months after the incident, in January 2014, Justin was arrested and charged with assault following an alleged attack on a limo driver a month earlier - the charges were dropped later that year.\nCrowd pleaser: The 23-year-old will take to the stage at ANZ Stadium on Wednesday - although he is only expected to pull in a crowd of 70,000\nBad boy: Since becoming a global sensation as a teenager, the Love Yourself singer has had several brushes with the law and has endured a rocky relationship with paparazzi\nAlso in 2014, the artist was ordered to pay $81,000 in damages to a neighbour after pleading no contest to a misdemeanor vandalism charge arising from an egg-throwing incident.\nJustin, who has also been charged with dangerous driving, is currently under investigation after Las Vegas man Rodney Cannon filed a police report alleging that he was attacked by the singer and his bodyguards after a basketball game.\nThe alleged assault is said to have taken place in Cleveland, Ohio in June, with the victim claiming he was struck three times by the world famous star.\nBrisbane's Suncorp Stadium provides the backdrop for the next stop of Justin's Purpose World Tour on Monday, before he concludes the Australian leg with a performance at ANZ Stadium two days later.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4301130/Adele-Justin-Bieber-bad-boy-antics-Sydney-gig.html"}
