{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 21:31:46","date_modify":"2018-10-30 21:31:46","date_publish":"2016-04-28 14:58:49","description":"BY WENDELL BROCK\nAfter I pushed the button\non this week...","filename":"data/vaneerConsumption/AdeliciousCincodeMayococktailrecipefromStaplehouse.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/04/28/Images/WPIMAGE_cmgajcfoodandmore_7969.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_de_aad91c8f8d244535ee4395396072719a__1540935106.html","title":"A delicious Cinco de Mayo cocktail recipe from Staplehouse","title_page":"A delicious Cinco de Mayo cocktail recipe from Staplehouse","title_rss":"NULL","source_domain":"ajc.com","text":"BY WENDELL BROCK\nAfter I pushed the button on this week’s Food & Drink story on how to throw a Cinco de Mayo party , it occurred to me that I should have written a disclaimer: You don’t have to break out the booze to enjoy Chef Eddie Hernandez’s fantastic chilaquiles or the spring-y Strawberry Tres Leches Cake I developed.\nThen again, I can’t stop thinking about Staplehouse’s bright and delicious Oaxaca Flacka Flame, a mexcal-and-Aperol cocktail by the restaurant’s innovative mixologist Shyretha Bolton. I adore the smoky flavor, the bittersweet tang, the almond undertone that comes from a splash of orgeat.\nBut the name probably deserves an explanation.\nMezcal comes from the Mexican state of Oaxaca, of course, but what does “Flacka Flame” mean?\nStaplehouse beverage director Stephen James tells me it’s a riff on Atlanta rap group Waka Flocka Flame.“Maybe he will come in and try it one day,” James says.\nThe drink is easy to make, and you may prepare a batch ahead of time and keep it in a Mason jar or other lidded vessel. When ready to serve: Just add ice, shake and pour.\nWe’d be remiss if we didn’t raise a glass to the Staplehouse team, which heads to Chicago for the 2016 James Beard Awards Gala on May 2 . Staplehouse — which serves as a revenue stream for The Giving Kitchen, an Atlanta non-profit that gives grants to restaurant-industry workers in need — is nominated for Best New Restaurant in America. Let’s raise a glass in their honor.\nStaplehouse’s Oaxaca Flacka Flame\n2 ounces (1/4 cup) mezcal\n1 ounce (2 tablespoons) Aperol\n½ ounce (1 tablespoon) freshly squeezed lemon juice\n1/4 ounce (1½ teaspoons) freshly squeezed lime juice\n1/2 ounce (1 tablespoon) orgeat (Staplehouse uses Tippleman's Island Orxata; I used Fee Brothers)\n2 heavy dashes of Angostura bitters\n1 long strand of lemon peel\nPour the mezcal, Aperol, lemon juice, lime juice and orgeat into a cocktail shaker. Add ice and shake vigorously for about 10 to 15 seconds. Strain twice, and pour into in a rocks glass with ice. Twist the lemon peel over the glass to extract the oils, and toss it into the glass. (Despite the name of the drink, you don’t need to flame the lemon twist.)\nMORE:\nThe best cocktails at Staplehouse\nReview: To Staplehouse, with gratitude\nFood trends in Atlanta dining\nHow to make a Cinco de Mayo feast\n5 places to celebrate Cinco de May in Atlanta","url":"https://www.ajc.com/blog/atlanta-restaurants/delicious-cinco-mayo-cocktail-recipe-from-staplehouse/OZw3NxHPMHdyRAPnv5DTqI/"}
