{"authors":["Hannah Moore For Daily Mail Australia"],"date_download":"2018-10-22 22:59:54","date_modify":"2018-10-22 22:59:54","date_publish":"2017-03-16 05:14:15","description":"Adele's makeup artist of 10 years, New Zealand man Michael Ashton has explained the simple steps required to create her iconic winged eyeliner look.","filename":"data/vaneerConsumption/Adelesmakeupartistonhowtogethereyelookathome.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/03/3E509BD900000578-0-image-a-26_1489634847833.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4318552_Adele-s-make-artist-eye-look-home_1540249194.html","title":"Adele's make up artist on how to get her eye look at home","title_page":"Adele's make up artist on how to get her eye look at home | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Adele is as famed for her iconic cat eye makeup look as she is for her hit ballads.\nAnd now, her make up artist of 10 years, Michael Ashton, from New Zealand, has shared how he creates the hit maker's glamorous stage and red carpet looks.\n'The key to getting her specific, black, black, black eyeliner look is what I call product cocktailing and a lot of patience,' he told Elle Magazine.\nScroll down for video\nAdele's iconic eye makeup featured heavily on her new album 25, and was projected off big screens to audiences at her Australian shows\nAshton recommends always using a base before applying eyeliner to avoid an 'unfinished' look.\nHe previously revealed his base of choice is a combination of Mac Pro Longwear Paint Pot in a colour called Groundwork to create 'added depth', followed by Tom Ford Eyeshadow Eye Colour Quad in Nude Dip.\n'I'll be mixing two lighters shades together, which have golden, bronze hues,' he said during a YouTube tutorial of the technique.\nHe then begins to form the Someone Like You hitmaker's infamous cat-eye eyeliner with a sketch outline, made using a thin pencil.\nMichael (right) has been working with Adele for 10 years, and the makeup artist works with her during her appearances at performances and red carpets\nThe New Zealand born artist is not shy to share his techniques, and often shares lists of products he uses on his high end client\nGET ADELE'S GRAMMY LOOK Michael Ashton shared the products to recreate the 2017 Grammy Awards look at home SKINCARE: Ole Henriksen Pure Truth Melting Cleanser Ole Henriksen Nurture Me Cleansing Cloths. Ole Henriksen Ultimate Lift Eye Cream Ole Henriksen Pure Truth Youth Activating Oil Ole Henriksen Nurture Me Creme Ole Henriksen Nurture Me Facial Water FACE: Marc Jacobs Beauty Under(Cover) Coconut Primer Marc Jacobs Beauty Genius Gel / Bisque Medium Marc Jacobs Beauty Remedy Concealer Pen / Wake - Up Call #InstaMarc Light Filtering Contour Powder / Dream Filter 20 BROWS: Marc Jacobs Beauty Brow Tamer Marc Jacobs Beauty Brow Wow / Taupe + Ash Brown. EYES: Marc Jacobs Beauty Twinkle Pop Eyeshadow Stick / Volver Marc Jacobs Beauty Style Eye-Con 7 Palette / The Lolita Marc Jacobs Beauty Magic Marc'er in Black Marc Jacobs Beauty Velvet Nior Mascara LIP: Le Marc Lip Creme / Slow Burn + Fawn Over Me The make up artist shared this behind the scenes image on awards night\nFlawless: Adele rocked a classic makeup look at the Grammy awards, combining her dramatic winged eyeliner with a pale pink lip\nAshton explained he would start in the middle of the lash line before working his way out towards the corner of the eye in 'small strokes' before hearing back to the inner corner.\n'I leave the flick to last to get the sharpest shape,' he said.\nAfter finishing with the pencil, he fills in the outline with a liquid liner - another 'product cocktail'.\nThe makeup artist tells Elle he uses Marc Jacobs Beauty Magic Marc'er Precision Pen Waterproof Liquid Eyeliner, but opted for Bobbi Brown's Long-Wear Gel Eyeliner in Black Ink during his tutorial.\nClassic: Adele has been sporting the same cat-eye look for years, and it has become synonymous with her work\n'I like to apply it to the back of the hand first as it helps to dry it out a bit,' he said during the YouTube filming.\n'Apply from middle inner corner of the eye, gradually building outwards.\n'As I drag it [the gel eyeliner] outwards and upwards at a 45 degree angle I take a bit of the pressure off for a softer flick,' he says as he creates a perfectly even line.'\nHe then clears around the area to get an even line on both eyelids and remove any excess - but not with a finger or a dry cotton bud.\nIn true A-lister style, Ashton clears the excess eyeliner off Adele's eyelids with Muji Thin Cotton Tips, thinner versions of regular earbuds, dipped in Biorderma micellar water.\nPopular: Proving Adele's aesthetic is just as beloved as her music, Ashton's YouTube makeup tutorial has been viewed more than 2million times\nThe products used for the winged look are all high end, and even mistakes are cleared up with micellar water\nHe drags the cotton tip at a 45 degree angle up and out underneath the wing to get that 'nice feline flick'.\nThe iconic look is then finished off with mascara, before the rest of the hitmaker's makeup is applied.\n'I find if you do the base first and then the eyes, you can end up with too much make-up on and it's too over the top,' he explained.","url":"https://www.dailymail.co.uk/femail/article-4318552/Adele-s-make-artist-eye-look-home.html"}
