{"authors":["Alex Michael For Daily Mail Australia"],"date_download":"2018-10-23 03:09:22","date_modify":"2018-10-23 03:09:22","date_publish":"2017-03-10 12:39:44","description":"Adele smashed Taylor Swift's ANZ single-night attendance record on Friday, performing to over 95,000 fans at the venue","filename":"data/vaneerConsumption/AdeleSMASHESTaylorSwiftsANZStadiumattendancerecord.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E2228B700000578-0-image-a-115_1489149552204.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300474_Adele-SMASHES-Taylor-Swift-s-ANZ-Stadium-attendance-record_1540264162.html","title":"Adele SMASHES Taylor Swift's ANZ Stadium attendance record","title_page":"Adele SMASHES Taylor Swift's ANZ Stadium attendance record | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She just SMASHED Taylor Swift's box office attendance record for Sydney's ANZ Stadium.\nBut Adele, 28, probably isn't interested in sparking any bad blood with the blonde bombshell, whose desires to be 'the biggest female artist in the world' were recently outed by Ed Sheeran.\nHaving just performed for 190,000 fans over two nights, the UK songstress will more likely be content to sit pretty on the $1 million minimum she nabbed for each performance on the tour according to news.com.au\nHello from the record books ! Adele smashed Taylor Swift's ANZ single-night attendance record on Friday, performing to over 95,000 fans at the Sydney venue\nThe megastar's final Sydney show puts her projected tour-end audience figures at around 600,000 happy concertgoers.\nTo put that into perspective, that figure makes up around 20% of Australia's entire 15-24 year-old population.\nThat measly $1 million per night won't mean much to the promoter given the ticket prices starting at $100 at topping out well over $300, which means the gross revenue from door entry alone should exceed $60 million.\nBad Blood? Her 95,000 per-night average over two nights at the venue crushes Taylor Swift's previous record of 78,000 set in 2015\nHow much? The 28-year-old is earning a whopping $1 million minimum per performance on her 8-leg Australian tour, with money from merchandise likely massively increasing that number\nHow many? 600,000 fans to have seen are expected to have attended by the time her tour ends. To put that into perspective, that figure makes up around 20% of Australia's entire 15-24 year-old population\n'With sales of T-shirts and other souvenirs significantly bolstering her takings for the three-week visit, Adele’s tour will be one of the most lucrative ever staged here,' news.com.au reported.\n'The Adele Live 2016 concerts in the US and Europe putting her at No. 5 on Pollstar’s annual Year End Top Worldwide Tours chart with $167.7 million,' they added.\nFor Sydney's largest outdoor stadium, the 190,000 attendees over two nights is by far the highest since the venue downsized after the 2000 Olympics.\nHer 95,000 per-night average crushes Taylor Swift's previous record of 78,000 set in 2015.\nGoing for gold: For Sydney's largest outdoor stadium, the 190,000 attendees over two nights is by far the highest since the venue downsized after the 2000 Olympics\nClose behind: AC/DC is fourth on ANZ Stadium's all-time single-night crowd attendance figures with 76,000, but they actually managed to total 215,000 over three-nights\nRock icons U2 and AC/DC followed closely behind at 77,000 and 76,000 respectively, although the latter actually managed 215,000 over three-nights.\nThis isn't the first time Adele has come out on top over the Bad Blood and Shake It Off singer.\nSales of her latest 25 record reached 7.44 million in 2015 according to Nielsen, who also stated that Taylor only managed 3.66 million for 1989 the year prior.\nThe latest news might not gel with comments made by her friend Ed Sheeran to US Magazine earlier this year.\nKeep shaking it off: This isn't the first time Adele has come out on top over the Shake It Off singer, with 2015 Sales of her latest 25 record more than doubling that of Taylor's 1989 album the year before\nSaid what? This information could potentially disrupt the blonde's ambition, after pal Ed Sheeran revealed: 'She wants to be the biggest female artist in the world'\n'She wants to be the biggest female artist in the world and I want to be the biggest male artist in the world,' the charming red head told the publication.\nTaylor gets the last laugh though, as she topped the Forbes list of highest-earning female solo artists in music last year with a reported $170 million.\nIn comparison, Adele was saying hello from the number 2 slot, way back in the race at $80.5 million.\nThe megastar's tour moves on to Adelaide next week, before finishing with two dates in Melbourne.\nLast laugh! Taylor gets the last laugh though, as she topped the Forbes list of highest-earning female solo artists in music last year with a reported $170 million\nHello, from second place: In comparison, Adele was saying hello from the number 2 slot, way back in the race at $80.5 million","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300474/Adele-SMASHES-Taylor-Swift-s-ANZ-Stadium-attendance-record.html"}
