{"authors":["Bob Treasure For Mailonline"],"date_download":"2018-10-22 20:27:24","date_modify":"2018-10-22 20:27:24","date_publish":"2016-01-28 01:26:49","description":"Adil Rashid and Alex Hales have turned down the opportunity to play in the IPL in a bid to improve their chances of playing for England in this summer's Test series against Sri Lanka and Pakistan..","filename":"data/vaneerConsumption/AdilRashidandAlexHalessnublucrativeIPLdealsinbidtoboostEnglandTesthopes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/27/19/306B74B700000578-0-image-a-9_1453922565338.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_cricket_article-3419697_Adil-Rashid-Alex-Hales-snub-lucrative-IPL-deals-bid-boost-England-Test-hopes_1540240044.html","title":"Adil Rashid and Alex Hales snub lucrative IPL deals in bid to boost England Test hopes","title_page":"Adil Rashid and Alex Hales snub lucrative IPL deals in bid to boost England Test hopes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Adil Rashid and Alex Hales have turned down the opportunity to earn lucrative contracts in the Indian Premier League in a bid to improve their chances of playing for England in this summer's Test series against Sri Lanka and Pakistan.\nYorkshire leg-spinner Rashid – whose 16 wickets in the 2015-16 Big Bash saw him named the competition's second most valuable player – would have been an attractive proposition for IPL franchises in next month's auction.\nBut the 27-year-old will turn his attention to the longer form of cricket in the hope of a returning to the Test team for this summer's home series against Sri Lanka and Pakistan or, more realistically, the tours of Bangladesh and India next winter.\nAlex Hales made his Test debut against South Africa but made just one significant contribution in the series\nTest opener Hales is understood to have been considering another stint in the T20 extravaganza after being drafted by the Mumbai Indians in 2015.\nBut after a difficult start to his Test career in South Africa, Hales will look to get in as much practice with the red ball in order to secure his place in Trevor Bayliss' s side ahead of England's first Test against Sri Lanka on May 19.\nThe move was welcomed by Nottinghamshire director of cricket Mick Newell.\n'He's made a decision not to go to the IPL, so he'll play for us early season,' Newell, also an England selector, said on www.trentbridge.co.uk.\nTest opener Hales is understood to have been considering another stint in the T20 extravaganza\n'He knows his England position is under threat, it's bound to be, and he's made a decision to fight for his place. Hopefully he'll come back with real vigour and desire to do that.'\nIf all goes well in the short format against South Africa, a confident Hales will also hope to lead England's bid for World Twenty20 glory, with the tournament getting under way in March in India.\nIn county cricket, Hales averages nearly 40 and remains a key player for Notts Outlaws in the NatWest T20 Blast and in the Royal London One-Day Cup.\nNewell remained firm in Hales' ability to play more five-day cricket for England but warned: 'What he hasn't done is cement the place so that he can relax in terms of the Sri Lanka series and look ahead.\n'He's got to re-establish his credentials during the early part of the English season, as do a number of players.\nAdil Rashid's 16 wickets in recent Big Bash saw him named the competition's second most valuable player\n'It's a great challenge for him and I hope he comes back from this tour refreshed in terms of really wanting to have a good go at this.'\nJos Buttler is the only player to enter the auction who has featured for England in any of their last three Test series – the wicketkeeper-batsman has listed the second highest base price of INR 1.5 crore (approximately £207,500).\nThe lack of England stars making themselves available appears to be down to a combination of England's hectic schedule - which has seen them play 17 Tests since last April - and the fact their series with Sri Lanka starts before the finale of the IPL on May 29.","url":"https://www.dailymail.co.uk/sport/cricket/article-3419697/Adil-Rashid-Alex-Hales-snub-lucrative-IPL-deals-bid-boost-England-Test-hopes.html"}
