{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 21:06:40","date_modify":"2018-10-30 21:06:40","date_publish":"2015-06-22 12:56:29","description":"Abraham H. Foxman, the outgoing national director of the Anti-Defamation League, has blasted Israel's former envoy to the U.S., Michael Oren, for his comments about how President Barack Obama has deliberately harmed the U.S.-Israel relationship. Foxman is a liberal Democrat, and would rather blame Israel rather than examine the politics of his own party, so his defense of the White House is no surprise. However, he descends to the level of personally smearing Oren. |","filename":"data/vaneerConsumption/ADLsFoxmanSmearsMichaelOrenasantiMuslim.json","image_url":"https://media.breitbart.com/media/2015/06/Abe-Foxman-Michael-Loccisano-Getty-1024x766.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_22__1540933600.html","title":"ADL's Foxman Smears Michael Oren as anti-Muslim","title_page":"ADL's Foxman Smears Michael Oren as anti-Muslim | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Abraham H. Foxman, the outgoing national director of the Anti-Defamation League, has blasted Israel’s former envoy to the U.S., Michael Oren, for his comments about how President Barack Obama has deliberately harmed the U.S.-Israel relationship. Foxman is a liberal Democrat, and would rather blame Israel rather than examine the politics of his own party, so his defense of the White House is no surprise. However, he descends to the level of personally smearing Oren.\nIn an official statement, Foxman accuses Oren of anti-Muslim prejudice:\nMost recently, in his essay in Foreign Policy Magazine, Ambassador Oren revives the meme of the president’s “Muslim heritage” to make the case that American foreign policy in the Middle East is primarily being promoted and dictated by the president’s early upbringing in the Muslim faith and in Muslim traditions.\nThat is a gross distortion of what Oren actually said in his essay, and Foxman surely knows it.\nOren’s first reference to Obama’s Muslim faith describes how Obama himself cited it to argue that he could improve U.S. ties with the Muslim world:\nThe novelty of this approach was surpassed only by Obama’s claim that he, personally, represented the bridge between this Muslim world and the West. Throughout the presidential campaign, he repeatedly referred to his Muslim family members, his earlier ties to Indonesia and the Muslim villages of Kenya, and his Arabic first and middle names. Surveys taken shortly after his election indicated that nearly a quarter of Americans thought their president was a Muslim.\nOren’s next reference, to which Foxman apparently takes the strongest objection, again refers to how Obama describes himself:\nIn addition to its academic and international affairs origins, Obama’s attitudes toward Islam clearly stem from his personal interactions with Muslims. These were described in depth in his candid memoir, Dreams from My Father, published 13 years before his election as president. Obama wrote passionately of the Kenyan villages where, after many years of dislocation, he felt most at home and of his childhood experiences in Indonesia. I could imagine how a child raised by a Christian mother might see himself as a natural bridge between her two Muslim husbands. I could also speculate how that child’s abandonment by those men could lead him, many years later, to seek acceptance by their co-religionists.\nThere is nothing anti-Muslim in any of Oren’s speculations, nor does Oren at any point claim that Obama is actually a Muslim, secretly or otherwise which is the “meme” to which Foxman apparently refers.\nFoxman goes on to say that Oren’s “amateur psychoanalysis” is off limits because it suggests that Islam “has driven the president to embrace the Muslim world at the expense of both Israel and U.S. national security interests” and “results in borderline stereotyping and insensitivity.”\nThat is sheer nonsense. If Obama cites his own Muslim background as a foreign policy credential and an inspiration, it is surely fair game for analysis.\nThe only one guilty of slander is Foxman himself.","url":"https://www.breitbart.com/politics/2015/06/22/adls-foxman-smears-michael-oren-as-anti-muslim/"}
