{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 21:08:10","date_modify":"2018-10-30 21:08:10","date_publish":"2015-06-15 12:55:12","description":"Outgoing Anti-Defamation League chief Abe Foxman has reportedly panicked over what he calls declining U.S. support for Israel, and blamed Israel for taking Americans, and American Jews, for granted. Foxman's claims contradict polls showing that American support for Israel is near an all-time high. The real reason for his freakout: liberals support Israel less, which means that American Jews support Israel less, because of President Barack Obama's confrontational policy toward Israel. |","filename":"data/vaneerConsumption/ADLsFoxmanPanicsoverLiberalSupportforIsrael.json","image_url":"https://media.breitbart.com/media/2015/06/Abe-Foxman-Michael-Loccisano-Getty-1024x766.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_15__1540933690.html","title":"ADL's Foxman Panics over Liberal Support for Israel","title_page":"ADL's Foxman Panics over Liberal Support for Israel | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Outgoing Anti-Defamation League chief Abe Foxman has reportedly panicked over what he calls declining U.S. support for Israel, and blamed Israel for taking Americans, and American Jews, for granted. Foxman’s claims contradict polls showing that American support for Israel is near an all-time high. The real reason for his freakout: liberals support Israel less, which means that American Jews support Israel less, because of President Barack Obama’s confrontational policy toward Israel.\nFoxman pointed the finger of blame at Israel, and urged Israel to “[c]ome up with some creative dynamic approach for peace.” Of course, Israel has done so many times in the past.\nThe previous prime minister, Ehud Olmert, made generous offers for peace, and even Prime Minister Benjamin Netanyahu delivered an historic address calling for the creation of a Palestinian state in 2009.\nThe problem is Palestinians rejected these offers–and the Obama administration ignored them.\nAs former Israeli ambassador to the U.S. Michael Oren noted Monday, and as he argues in a new book, Obama is to blame for the decline in relations–not Israel. “President Obama came to the White House with a tough view regarding any Israeli government, whether right- or left-wing…(and) seeking reconciliation with the Muslim world and the Iranians. That this regime calls for the annihilation of Israel does not prevent Obama from trying to reach an understanding with them.”\nThe core of the dilemma is that liberal American Jews, like Foxman, are struggling to reconcile their slavish loyalty to the Democratic Party with the undeniable reality that the Democratic Party is not supportive of Israel.\nRather than face that fact, Foxman projects blame onto Israel, begging for some type of gesture–even a largely symbolic one–that would make it easier for liberal Jews to believe that there is no contradiction between their partisan loyalty and Middle East reality.\nFoxman, and those who think as he does (and there are more than a few), confuse Obama for America, and Democrats for Americans as a whole. As liberals have given up on Israel–largely under pressure from radical pressure groups, a biased mainstream media, and a corrupted academic elite–conservatives have embraced Israel as a symbol of shared values.\nIt is long past time for liberal American Jews like Foxman to stop blaming Israel and look where the real problem lies.","url":"https://www.breitbart.com/politics/2015/06/15/adls-foxman-panics-over-liberal-support-for-israel/"}
