{"authors":[],"date_download":"2018-10-30 01:12:13","date_modify":"2018-10-30 01:12:13","date_publish":"2017-05-01 00:01:00","description":null,"filename":"data/vaneerConsumption/AdmiralHarrisBeVeryAfraidofNorthKorea.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/04/slide_310226_2740824_free.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861933.html","title":"Admiral Harris: Be Very Afraid of North Korea","title_page":"Admiral Harris: Be Very Afraid of North KoreaThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Despite the fact that North Korea proclaimed that war with the United States is “imminent,” the world probably won’t explode next week. Then again, it might.\nBy all reports, Pacific Command commander Admiral Harry Harris is a cool-headed warrior, not someone given to shouting that the sky is falling. (A Japanese-American, his appointment as PACOM boss unsettled the Chinese.) A friend of mine who knew Harris very well during their days at the Naval Academy said he’s “as straight a shooter as you can get.”)\nTestifying to Congress last week about North Korea’s ability to strike the United States with a nuclear-armed ballistic missile, Harris said, “The crisis on the Korean peninsula is real — the worst I’ve seen.… There is some doubt within the intelligence community whether Kim Jong Un has that capability today or whether he will soon, but I have to assume he has it, the capability is real, and that he’s moving towards it.” When a gent such as Harris says that it’s something we have to take seriously.\nHarris went on to say that “Kim Jong Un is making progress and all nations need to take this seriously because their missiles point in all directions,” Harris said. “If left unchecked, they will match the capability of his hostile rhetoric.”\nMilitary leaders have to measure an enemy by its intentions and capabilities. North Korea’s capabilities are being developed as fast as its scientists — and those from other nations — can propel it.\nRemember A.Q. Khan? He is the Pakistani scientist who may be the world’s worst proliferator. He helped start the North Korean nuclear weapons program that has now come to fruition. The Norks’ sixth nuclear weapons test is expected any day. They may or may not be close to miniaturizing their warheads to fit in a missile’s fairings. They also may or may not be at the point where one of their warhead designs can survive the stresses of launch.\nWhether they have reached those points or not, Adm. Harris assures us they probably will soon. That determines capability. What about intentions?\nThe North Koreans have survived the past 20 years by alternately threatening South Korea and us and making agreements — such as the 1994 Clinton “Agreed Framework” — which blackmailed us into giving them aid. They accepted the aid and continued their nuclear weapons and missile programs in violation of the terms to which they’d agreed. Their first nuclear test was in 2006.\nOn April 20, a North Korean government-controlled newspaper threatened a “super-mighty preemptive strike” that would destroy U.S. and South Korean forces and the U.S. mainland.\nEvery attempt to deal with crises North Korea has created is met with more belligerence. President Trump and Secretary of State Rex Tillerson have both restated that “all options” — meaning military force — are on the table. In answer to those declarations, the Norks have published a propaganda video that shows an American aircraft carrier and Washington, D.C., both destroyed by nuclear attacks.\nWhen Mr. Tillerson convened the U.N. Security Council to ask it to act against North Korea (which, of course, it won’t), the Norks answered with another missile launch. That one failed, as did a similar launch earlier in April.\nPresident Trump told Reuters in an interview on Thursday that a “major, major conflict” with North Korea was possible over its nuclear and ballistic missile programs.\nMr. Tillerson’s U.N. initiative included a signal that we might negotiate directly with North Korea but only under conditions that we would set. Such negotiations, Tillerson must know, can never occur for two reasons.\nThe first is that no negotiation will result in North Korea agreeing to verifiably stopping the development of nuclear weapons and intercontinental ballistic missiles. To do so would have to mean that we — and other Western nations — would be allowed no-notice, unlimited inspections of suspected development sites anywhere in North Korea. That would be a huge surrender by the Kim regime, making it a laughingstock among its fellow members of the new Axis of Evil.\nThose inspections would reveal that which North Korea cannot admit. We would be able to discover what Iran is doing in North Korea to develop its own nuclear weapons and ballistic missiles in partnership with the North Koreans and concealed far from Tehran.\nThe second reason is that North Korea’s rhetoric has backed itself into a corner. Kim and his generals have been drinking their own bathwater for so long that they probably can’t dissent among themselves from their constant high-temperature belligerence. The generals have witnessed the penalty for dissent suffered by some of Kim’s uncles in the past few years. They were murdered, as was Kim’s half-brother (he by the administration of VX nerve gas, confirming that the Kim regime has that horrific weapon and will not hesitate to use it).\nAny general who proposed any deviation from the usual belligerence would be killed.\nThe one condition that will probably prevent the North Koreans from actually starting a war (at least for now) is the fact the regime values nothing more highly than its personal safety.\nKim and his boys are cowards. Although their bluster worked on Bill Clinton and Barack Obama, they have to at least suspect that any nuclear attack on South Korea, Japan, or America would be answered by the literal obliteration of them, their capital city, and what little else of their country is worth targeting. It would be over in an hour. Tens, maybe hundreds, of thousands would be killed in each of the warring nations.\nThat leaves us with a critical question, the answer to which is unknowable. Is Kim really crazy enough to launch such an attack? Are he, and his generals, deluded enough to believe that South Korea and we wouldn’t respond if they unleashed their missiles and massed artillery to bombard Seoul?\nWhat, then, do we do?\nRelying on China to stop North Korea’s nuclear and missile programs simply won’t succeed. Chinese Foreign Minister Wang Yi told the U.N. that “the key to solving the nuclear issue on the [Korean] peninsula does not lie in the hands of the Chinese side.”\nBeyond anything else, we have to realize that North Korea, like Iran, will never give up its nuclear weapons or ballistic missiles peacefully. That’s not our choice, but it is reality.\nWe’re doing some things right. The deployment to South Korea of our Terminal High-Altitude Air Defense system — THAAD — began last week. It doesn’t entirely cancel the threat of the North Korean missiles but clearly reduces the threat substantially. (President Trump’s demand that South Korea pay for it was, fortunately, corrected by National Security Advisor Lt. Gen. H. R. McMaster.)\nKim’s regime must have been unsettled by our dropping the MOAB — the 20,000 pound Massive Ordinance Air Blast bomb — on the Taliban a couple of weeks ago. Unless they’re dumber than I think they are, they understand that one of those bombs, dropped by a stealthy B-2, would obliterate a square mile of their massed artillery.\nNorth Korea will soon have the ability to launch a nuclear attack against the U.S. that would detonate at an altitude planned to create a massive electromagnetic pulse across Hawaii or a large part of the U.S. mainland. If successful, millions of Americans could die in the aftermath.\nOur missile defenses stand in the way, but they must — as Adm. Harris warned — be increased and improved.\nAs I’ve written before, if we have the ability to perform a cyberattack that prevents missile launches or nuclear tests, we should use it at every opportunity. If we don’t, we should develop it as soon as possible.\nShooting down North Korean missiles will have to be done whenever we detect a launch that could result in a warhead being delivered to South Korea, Japan, or the United States.\nBeyond that, there’s not much we can do without going to war. If the North Koreans want to start a war, there’s nothing more we can do than defeat it and destroy the Kim regime.\nWar with North Korea — and Iran — will come. Living with the threat of their nuclear weapons and missiles isn’t a choice because they will use them when — by ideology, insanity or paranoia — they are driven to do so. Deterrence works but only up to that point.","url":"https://spectator.org/admiral-harris-be-very-afraid-of-north-korea/"}
