{"authors":[],"date_download":"2018-10-23 01:05:00","date_modify":"2018-10-23 01:05:00","date_publish":"2017-03-16 10:48:13","description":"Inside an armoured vehicle in Mosul, a colonel scans live footage from a drone flying above the Iraqi city, hunting targets for a new weapon deployed against...","filename":"data/vaneerConsumption/AdoptingIStacticIraqiforcesweaponisesmalldrones.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/10/wire-227829-1489661296-940_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4319658_Adopting-IS-tactic-Iraqi-forces-weaponise-small-drones_1540256700.html","title":"Adopting IS tactic, Iraqi forces weaponise small drones","title_page":"Adopting IS tactic, Iraqi forces weaponise small drones | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A drone deployed by Iraqi forces carrying two grenades flies over Mosul on March 14, 2017\nInside an armoured vehicle in Mosul, a colonel scans live footage from a drone flying above the Iraqi city, hunting targets for a new weapon deployed against jihadists.\nThe Islamic State group has used small commercial drones to drop explosives on advancing Iraqi forces since they launched the offensive to retake Iraq's second city in October.\nAs the battle now focuses on recapturing west Mosul, Colonel Hussein Muayad's federal police forces have adopted the tactic, equipping their own remote-controlled surveillance drones with 40 mm grenades that are usually fired from grenade launchers.\n\"Residents would stare at the sky\" during the Mosul fighting, fearing IS drones, says Muayad, wearing a black jacket over his federal police uniform. \"Now it's the enemy whose eyes never leave the sky.\"\nThe moustachioed police officer in his 40s is clearly proud of the new military tactic.\n\"They used to hit us once. But we can hit them up to four times with a single drone,\" he says.\nLieutenant General Raed Shaker Jawdat of the federal police -- who are taking part in the battle alongside a special forces unit -- says the \"new military tactic\" has been very effective.\n\"Dozens of terrorists have been killed and wounded. Jihadist movements have been paralysed,\" Jawdat says.\nMuayad sits surrounded by four television screens, a black drone at his feet. A dozen oblong explosive devices tipped by the small, rounded grenades are nearby, pin near one end and a netted skirt taken from a badminton shuttlecock on the other.\n\"That's so it keeps its balance as it falls,\" Muayad says.\nChain-smoking cigarettes, the colonel watches the live footage of a weaponised drone as it slowly buzzes over the devastated streets of west Mosul.\nThe device slows to a hover above a white car near the front line.\nMembers of Iraqi forces fly a drone to spot positions of Islamic State group jihadists in the northern Iraqi city of Mosul on March 13, 2017\n\"A vehicle providing logistic support, used to transport fighters or food,\" Muayad explains.\nBut there is no strike on the car, due to the presence nearby of a device designed to jam drone commands that Iraqi forces set up to protect themselves from IS attacks.\n- 'Precise strikes' -\nThe colonel shows AFP footage of previous attacks. The munitions fall in slow motion on a group of fighters gathered in front of a mosque. More explosives are dropped on a car, small clouds of grey smoke erupting on the screen.\n\"West Mosul is very populated. The roads are very narrow,\" Muayad says. \"The point with these drones is to have very precise strikes to target the terrorists, not the residents.\"\n\"Day and night, there are always 12 drones in the air, ready to strike,\" Muayad says.\nBut he refuses to say exactly how many drones -- which can each carry up to four grenades -- the police operate.\nThe devices have been equipped with an extra battery to prolong their flight time and can now cover a distance of eight kilometres (five miles) up from less than five kilometres (three miles) before.\nInside a ravaged courtyard in a neighbourhood recently recaptured from the jihadists, Captain Baraa Mohammed Jassem from the Rapid Response Division silently observes a surveillance drone about to take off.\nHe too says his elite interior ministry force has \"perfected\" drones available commercially so they can drop explosives on the enemy.\n\"We took the... idea from the Daesh terrorist organisation,\" he says, using an Arabic acronym for IS.\nIS has carried out drone attacks throughout the Mosul operation, with the first record of a deadly attack coming a few days before drive was launched in October, killing two Iraqi Kurdish fighters and wounding two French special forces soldiers.\nholds a grenade on March 14, 2017 which is to be attached to a drone in the fight against jihadists in Mosul\nOver the past months, the jihadist group has posted footage online filmed by the cameras of its own remote-controlled drones of explosive devices being dropped on armoured vehicles and four-wheel-drive convoys.\nJassem says the new technique has been useful to Iraqi forces, particularly when they retook important public buildings earlier this month.\n\"With a night drone, we found and carried out a strike on a group of eight jihadists, hitting them directly,\" he says.","url":"https://www.dailymail.co.uk/wires/afp/article-4319658/Adopting-IS-tactic-Iraqi-forces-weaponise-small-drones.html"}
