{"authors":[],"date_download":"2018-10-30 19:53:21","date_modify":"2018-10-30 19:53:21","date_publish":"2018-06-19 14:28:26","description":"A little over a year after 10-year-old Kentae Williams’ death, his adoptive father is set to stand trial for allegedly drowning him in a bathtub in DeKalb County. The trial could draw to a close a shocking episode that led to firings in the Division of Family Children Services.","filename":"data/vaneerConsumption/AdoptivedadtofacetrialinDeKalbdrowningdeathof10yearoldson.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/05/16/Images/18443742_518649158525270_1008817139848577024_n.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_adoptive-dad-fac_bc20c15d559e5f2be51d5f55b4212360__1540929201.html","title":"Adoptive dad to face trial in DeKalb drowning death of 10-year-old son","title_page":"Adoptive dad to face trial in DeKalb drowning death of 10-year-old son","title_rss":"NULL","source_domain":"ajc.com","text":"A little over a year after 10-year-old Kentae Williams’ death, his adoptive father is set to stand trial for allegedly drowning him in a bathtub in DeKalb County.\nThe trial for Leon Williams, a worker at the Georgia Department of Administrative Services, is scheduled to begin July 9, according to court records, at the downtown Decatur courthouse.\nThe trial could close a shocking episode that led to scrutiny, as well as several firings, in the Division of Family Children Services. Mistakes were made in responding to previous mistreatment of the child, DFCS said last year.\nIt all ended April 28, 2017.\nREAD: Grandson's ‘psychotic behavior’ may stop trial in DeKalb woman’s death\nREAD: DeKalb Bloods gang members get long sentences for executing 2 women\nREAD: Here are the plans for the new North DeKalb Mall and Costco\nDeKalb County police documents accuse Leon Williams, 44, of burning the boy’s feet and holding him underwater while lecturing him about acting out in school. CPR efforts by the father and emergency workers failed at their apartment on Glen Hollow Drive outside Decatur, a police report said.\nOne document said: “The suspect stated that the child was not listening to the suspect as he was lecturing him, and admitted to holding the child und er water for 30 to 45 seconds and then repeating the same action again.”\nWilliams is charged with various counts of murder and child cruelty.\nThe district attorney’s office has filed notice of its intent to seek a sentence of life without parole.\nLike DeKalb County News Now on Facebook | Follow on Twitter\nIn other news:","url":"https://www.ajc.com/news/local/adoptive-dad-face-trial-dekalb-drowning-death-year-old-son/91Sct7kEO3xl3MoPaiWLHJ/"}
