{"authors":["Lucia Peters"],"date_download":"2018-10-30 22:56:49","date_modify":"2018-10-30 22:56:49","date_publish":"2014-08-14 16:16:32","description":"Meet Cowboy Bebop, the goat. A lovable little scamp, he lives in New South Wales, Australia. He’s only five weeks old, with all the exuberance that goes with it; he loves balloons, milk, and playing with all his puppy pals. He may not be a…","filename":"data/vaneerConsumption/AdoptedGoatCowboyBebopRocksaHawaiianShirtLikeNoOneElse.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/fc078d8e-0771-48a1-9e73-e3a8f7da09ae.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35786-adopted-goat-cowboy-bebop-rocks-a-hawaiian-shirt-like-no-one-else_1540940209.html","title":"Adopted Goat Cowboy Bebop Rocks a Hawaiian Shirt Like No One Else","title_page":"Adopted Goat Cowboy Bebop Rocks a Hawaiian Shirt Like No One Else","title_rss":"NULL","source_domain":"bustle.com","text":"Meet Cowboy Bebop, the goat. A lovable little scamp, he lives in New South Wales, Australia. He’s only five weeks old, with all the exuberance that goes with it; he loves balloons, milk, and playing with all his puppy pals. He may not be a traditional pet, but that didn’t stop a loving family from adopting him. With a face like that, how could anyone resist him? Bebop had a little help, of course; it’s thanks to pet photographer Ruth O’Leary of Ruthless Photos’ adorable images of him that he found his forever home. Doesn’t he look fetching in his bright orange Hawaiian shirt? Awwwww!\nGoats aren’t O’Leary’s usual fare; she normally sticks with dogs and cats. But when she was approached by rescue organization Haus of Animal for Bebop’s adoption profile, she decided to take a crack at it. She told the Huffington Post, “It was equal parts ‘Here’s a fun project for the afternoon’ and ‘This goat needs great photos to find a home.’”\nThe little goat’s photos were a smash hit; he was adopted a mere week after his profile went live. He now makes his home on a hobby farm with a rescue pig and a few rescue dogs. I’m almost positive there’s an amazing children’s book in there somewhere; anyone want to take a crack at it? The fact that his name seems to be inspired by one of the greatest anime series of all time is an added bonus, of course. But does he do goat parkour? I don't know; you'll have to ask him yourself.\nIf you’re based in Australia, you can take a look at more pet listings at PetRescue.com.au; but even if you’re not, you can still check out more of O’Leary’s work on her Facebook page and at her website.\nImages: Ruthless Photos/Facebook","url":"https://www.bustle.com/articles/35786-adopted-goat-cowboy-bebop-rocks-a-hawaiian-shirt-like-no-one-else"}
