{"authors":["Esra Gurkan For Mailonline"],"date_download":"2018-10-23 00:46:22","date_modify":"2018-10-23 00:46:22","date_publish":"2017-04-26 10:41:39","description":"Adorable photos compiled by Bored Panda show we all appreciate something to hold at night - and animals are no exception. They include a mouse with a toy bear and a cat snuggling a fluffy duck.","filename":"data/vaneerConsumption/Adorableanimalspicturedcuddlingupwithsofttoys.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/24/15/3F8F5FDA00000578-0-image-a-176_1493045084780.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4440472_Adorable-animals-pictured-cuddling-soft-toys_1540255582.html","title":"Adorable animals pictured cuddling up with soft toys","title_page":"Adorable animals pictured cuddling up with soft toys | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"We sometimes treat pets like our children, so it isn't surprising to see that some pampered animals are given a cuddly toy to snuggle at night.\nAn online gallery compiled by Bored Panda captures sleepy animals clinging on to their own furry friends for comfort.\nFrom cats and dogs to pigs and even seals and kangaroos, these pictures prove even the most independent animal occasionally appreciates something to hold onto in the dark.\nThe adorable photos include a mouse with a squashy bear tucked under its arm, a cat snuggling a fluffy duck, and a pig snoozing next to another pig - albeit of the cuddly toy variety.\nCuddling up: This little dog is in need of a soft toy to be able to sleep peacefully on the sofa\nThe bigger the better: The teddy bear might be double the size of the donkey but that doesn't seem to be an issue for him\nBed time made easier: This dog can sleep soundly with the aid of its soft toy next to them\nWhich one is real? It is hard to tell the pig and the soft pig toy apart in this bed\nMirror image: One lonely kitten seeks comfort in the form of a cuddly cat\nSeeing double: A baby Polar bear likes sleeping with a bigger and more cuddly teddy bear version of itself\nTwo of a kind: A kangaroo manages to sleep more easily with the help of its mini me\nOpposites attract: A sloth has made it clear that it wants to keep hold of its new giraffe soft toy\nGrowing up: No matter what its size, this kitten wants to keep hold of its tiny teddy bear\nFrom kitten to cat: No matter how many years pass, this pet won't ever forget about their cuddly duck toy\nSize doesn't matter to this mouse: This tiny animal seeks comfort in an even smaller teddy\nThrough the years: They started off the same size, but now this dog seems to have completely outgrown its toy - but still wants it by their side\nSleeping soundly: With a matching cuddly toy, this Basset Hound can sleep more easily at night\nFrom puppy to dog: This animal might have aged but their interest in a cuddly toy hasn't wavered\nTom and Jerry: This grey kitten proves that cat and mouse can be friends after all\nDon't take him away from me: This dog will do anything to defend its cuddly toy\nFriends forever: A seal got given a cuddly toy by a member of zoo staff and didn't want to let go of it\nTaken in: A rescue baby fox seems to be pleased with its new soft bunny toy\nNew friend: A dog snuggles up with its bright cuddly toy and seems to sleep better with it by its side\nThey don't have to be cuddly: A tortoise prefers a plastic toy to a soft one it seems\nHe's mine: This bear seems particularly protective of its brown furry friend\nThree's a crowd: These two sloths don't seem to mind sharing their plushie with one another\nWhy the long neck? The small kitten is the perfect size to cuddle up with its miniature giraffe\nLoyal friends: This ginger kitten and its soft bunny rabbit toy sleep soundly together\nPuppy love: A little dog's body fits perfectly with its black and white cuddly toy penguin\nLittle spoon: This dog appears to find comfort in sleeping with a cuddly toy version of itself","url":"https://www.dailymail.co.uk/femail/article-4440472/Adorable-animals-pictured-cuddling-soft-toys.html"}
