{"authors":["Myriah Towner For Dailymail.Com"],"date_download":"2018-10-23 00:50:16","date_modify":"2018-10-23 00:50:16","date_publish":"2016-01-28 14:58:16","description":"Four-month-old Olive, a black and white feline with Wobbly Kitten Syndrome, was adopted on Tuesday from the Watauga Humane Society in Boone, North Carolina.","filename":"data/vaneerConsumption/Adorablewobblykittenwhocapturedtheheartsofmillionsfindsanewhome.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AB1A5F00000578-0-image-a-26_1453993031746.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421002_Adorable-wobbly-kitten-captured-hearts-millions-finds-new-home_1540255816.html","title":"Adorable 'wobbly kitten' who captured the hearts of millions finds a new home","title_page":"Adorable 'wobbly kitten' who captured the hearts of millions finds a new home | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An adorable 'wobbly kitten' that suffers from a neurological disorder has found a new home.\nFour-month-old Olive, a black and white feline with Wobbly Kitten Syndrome, was adopted on Tuesday from the Watauga Humane Society in Boone, North Carolina.\nThe kitten, who has been described as 'the sweetest cat ever', was brought into the shelter as a stray in November and captured the hearts of millions last week after a video of her was posted to the shelter's Facebook.\nScroll down for video\nFour-month-old Olive, a black and white feline with Wobbly Kitten Syndrome, was adopted on Tuesday from the Watauga Humane Society in Boone, North Carolina\nThe kitten was brought into the shelter as a stray in November and captured the hearts of millions last week after a video of her was posted to the shelter's Facebook\n'She is a spitfire,' Christy Watson, manager of the Watauga Humane Society, told ABC News.\n'She's got the biggest personality. It's like her disorder doesn't affect her. She plays with other cats and she loves to be held.\n'As soon as she sees a person her motor starts running and she purrs. She's just the sweetest cat ever.'\nThe shelter had posted to Facebook on January 17 sharing a video, which garnered 1.4million views, of Olive wobbling her way around and noted that she was hoping to find a 'forever home'.\nOlive, who is described as 'the sweetest cat ever', was put up for adoption a few weeks ago and was shown in a video, which garnered 1.4million views, posted on the shelter's Facebook\nAt the time, the shelter believed she had Wobbly Kitten Syndrome but were not sure as they tried to figure out what was wrong with her.\nFour days later, they posted an update writing that the veterinarian confirmed that Olive has the neurological disorder also known as Cerebellar Hypoplasia.\n'What happened was her mom was probably positive for feline distemper while she was pregnant with Olive,' Watson told ABC News.\n'What happens is the brain stem doesn't actually form correctly.\n'It affects the way her head [wobbles] kind of like a palsy in a human and her back legs don't have that full muscle tone to them, so she has a hard time walking.'\nWhen Olive was brought into the shelter, they believed she had Wobbly Kitten Syndrome but were not sure as they tried to figure out what was wrong with her\nAfter sharing that Olive was up for adoption, the shelter was flooded with emails, applications and phone calls from as far as Australia with people interested in taking in the kitten\nAfter sharing that Olive was up for adoption, the shelter was flooded with emails, applications and phone calls from as far as Australia with people interested in taking in the kitten.\nHowever, the shelter decided to match Olive with a woman who has experience working with special needs animals.\n'She and her husband have other animals that she's nursed back to heath that are special needs,' Watson told ABC News of the kitten's adoptive family.\nWith all the attention she has received, Watson added that Olive's new family has plans to set up an Instagram to document the kitten's new adventures.\nOn Tuesday, the shelter shared the news of Olive's adoption on their Facebook page and thanked everyone for their love and interest in the kitten\nOn Tuesday, the shelter shared the news of Olive's adoption on its Facebook page and thanked everyone for their love and interest in the kitten.\n'As we congratulate Olive and her new family, we want to thank ALL of you for showing love and interest for sweet Olive,' the post read.","url":"https://www.dailymail.co.uk/news/article-3421002/Adorable-wobbly-kitten-captured-hearts-millions-finds-new-home.html"}
