{"authors":[],"date_download":"2018-10-30 00:54:18","date_modify":"2018-10-30 00:54:18","date_publish":"2016-12-01 18:24:04","description":null,"filename":"data/vaneerConsumption/ADramaticShiftinPennsylvania.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/12/2035050127_cd61d26a72_b.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860858.html","title":"A Dramatic Shift in Pennsylvania","title_page":"A Dramatic Shift in PennsylvaniaThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"From celebration to soul-searching, post-election analysis is everywhere.\nWhile top-of-the-ballot results dominate headlines and your news feed, don’t miss the dramatic shift that occurred election night in Pennsylvania.\nRepublicans achieved historic majorities in both chambers. In the state House, Republicans will control 60 percent of the seats for the first time in 70 years. In the Senate, Republicans will field the largest majority of any party in 68 years. But that’s only part of story.\nFor years, we at the Commonwealth Foundation, which focuses our work in Pennsylvania, have talked about the Taxpayer Party vs. the Big Government Party in Harrisburg. Partisan labels aside, the real question is whether a lawmaker represents taxpayers’ interests or toes the government union leaders’ line.\nWhile the Taxpayer Party has grown over the years, it couldn’t always overcome the strength of the Big Government Party. We saw this in October when significant pension reform legislation fell three votes short in the House.\nOn election night in Pennsylvania and around the nation, the Taxpayer Party saw significant gains in state legislatures. Election results in states like Wisconsin, Pennsylvania, and Michigan showed the political benefit of taking on powerful government union interests to protect taxpayers from tax hikes and special political privileges.\nIt is no coincidence that over the past five years, Wisconsin and Michigan took bold steps to strengthen the Taxpayer Party, including limiting collective bargaining and passing right-to-reelect and right-to-work legislation.\nSimilarly, as the Taxpayer Party has grown in Pennsylvania, we’ve begun to see results. For example, Governor Tom Wolf signed contract transparency legislation, and paycheck protection cleared the state Senate. These steps are critical to address rising government spending that’s consistently driven by the Big Government party.\nNow more than ever, the strengthened Taxpayer Party in Pennsylvania and across the nation has an unprecedented chance to seize opportunities like expanding access to quality education choices and freeing public workers from labor laws that limit their freedom.\nThis will require immense effort and continued vigilance, but the goal is worth the effort.","url":"https://spectator.org/dramatic-shift-in-pennsylvania-255160-2/"}
