{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:32:04","date_modify":"2018-10-30 21:32:04","date_publish":"2015-11-03 19:43:28","description":"A trade group representing the adult film industry is resisting new California regulations that would require \"porn goggles\" on all sets.","filename":"data/vaneerConsumption/AdultFilmIndustryFightsPornGogglesinCalifornia.json","image_url":"https://media.breitbart.com/media/2015/11/Screen-Shot-2015-11-03-at-11.37.14-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_11_03__1540935124.html","title":"Adult Film Industry Fights 'Porn Goggles' in California","title_page":"Adult Film Industry Fights 'Porn Goggles' in California | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A trade group representing the adult film industry is pushing back against new California regulations that would require performers to wear condoms and “porn goggles” on all sets in the state.\nThe Free Speech Coalition is preparing to a file a formal response to Division of Occupational Safety and Health (Cal/OSHA) regulations first introduced in May that mandate new safety standards for ensuring that performers remain safe from sexually transmitted diseases and bloodborne pathogens.\nIn addition to mandating protective eyewear and condoms for all performers shooting adult films in California, the new regulations would also require porn producers to pay for medical visits and Hepatitis B treatments for their actors. The new regulations must still be approved by Cal/OSHA’s Office of Administrative Law and would then be sent to the Secretary of State before taking effect in July 2016.\n“This isn’t regulation, this is a complete shut down of adult production,” Free Speech Coalition CEO Diane Duke said in a statement. “Asking adult performers to wear goggles is up there with asking ballerinas to wear boots. It does not only not match the threat and it effectively prohibits production in California.”\nThe updated regulations are part of a campaign by the AIDS Healthcare Foundation to mandate condom use and safety on all adult films shot in California. The campaign began in 2009, when AHF President Michael Weinstein wrote a letter to Cal/OSHA complaining that porn productions in California were not providing condoms to their performers.\nIn 2012, Weinstein and AHF were instrumental in the passage of Measure B, legislation that mandates condom use on all adult film sets in Los Angeles.\nWeinstein and AHF are also behind the California Condoms in Pornographic Films Initiative, a measure slated for inclusion on the 2016 ballot, which would allow private citizens to sue adult film performers for not wearing condoms on set. The measure gathered the required number of signatures for inclusion on the ballot in July.\nMany performers and producers say that existing safety standards are adequate to prevent the spread of sexually transmitted diseases. Performers are generally tested every two weeks and must prove a clean bill of health before they can begin working.\n“There is already a code of honor between performers [to get tested], because you could kill someone,” actress Anya Ivy told Breitbart News at the Adult Entertainment Expo in Las Vegas earlier this year.\nAdult film performers and producers have long said that increased regulation could lead the multi-billion dollar industry to leave California for more lax states, like Nevada or Florida. But many of those states, including Nevada, are contemplating tougher regulations of their own, leading Cal/OSHA to predict that the porn industry will not leave the state even with the passage of the new standards.\n“The regulated community has a unique legal status nationally, resulting in no states suitable to the relocation of the industry,” the Board wrote in its proposal. “Certain portions of the regulated community have threatened to leave the state; however, this is unlikely because the regulated conduct is illegal in every state except New Hampshire.”\nIn January, adult film actress and Adult Performers Advocacy Committee member Courtney Trouble told Breitbart News that “moving is not a long-term solution” for the industry.\nStill, Trouble added, “performers should be able to make their own choices.”","url":"https://www.breitbart.com/entertainment/2015/11/03/porn-goggles-industry-fights-back-against-eye-protection-regulations/"}
