{"authors":[],"date_download":"2018-10-30 01:23:21","date_modify":"2018-10-30 01:23:21","date_publish":"2018-07-18 10:00:00","description":"Thousands of hotel rooms are already booked, tens of millions of dollars are already invested and hundreds of companies are vying for the right to supply things like carpeting, catering, ice and flowers.","filename":"data/vaneerConsumption/AdvanceSuperBowlpreparationsunderwayforAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/13/Videos/4437877.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_super-bowl-prep-underway-atlanta-200-days-advance__1540862601.html","title":"Advance Super Bowl preparations under way for Atlanta","title_page":"Super Bowl LIII: Advance Super Bowl preparations under way for Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"The Super Bowl is still 200 days away.\nBut thousands of hotel rooms are already booked, tens of millions of dollars are already invested and hundreds of companies are vying for the right to supply things like carpeting, catering, ice, flowers, golf carts, paint, piping and portable potties.\nWith Atlanta getting its third chance as the site of the game, more than 25,000 area residents have applied for 10,000 slots as volunteers who will help out by offering a friendly face and local guidance to visitors, said Brett Daniels, chief operating officer at Atlanta Super Bowl Host Committee. “I would say that there’s a lot in motion already.”\n» Follow: AJC’s Complete coverage of the 2019 Super Bowl in Atlanta\nAtlanta’s Super Bowl just 200 days away\nWith 200 days to go, Atlanta preps for Super Bowl\nNext year’s Super Bowl — like all of them — is a huge economic event. It sends companies scrambling for contracts and opportunities as hotels and restaurants brace for a flood of business.\nIt also has economists arguing about how much the benefits of being the host city outweigh the costs.\nMany hotel rooms are already booked for early February when Atlanta will be in the spotlight as host for the 53rd Super Bowl in Mercedes-Benz Stadium. (Photo by Kevin C. Cox/Getty Images) (The Atlanta Journal-Constitution)\nWhile the game in Mercedes-Benz Stadium Feb 3 may last just a couple hours, the event is actually spread over 10 days, with concerts, promotions,- corporate sales and lots of parties.\nSo that requires many months of advance planning needed to choreograph, Daniels said. “Maybe 75 percent of the conversations have started. But very little of this is finalized, done and buttoned up.”\nSo are thousands of hotel rooms, according to the Atlanta Convention and Visitors Bureau.\n“In downtown Atlanta, Midtown and Buckhead – all the hotels rooms are essentially committed already,” said William Pate, the group’s president and chief executive. “If you go out on the Perimeter, you can see some smattering of rooms. But they will get gobbled up pretty quickly when we get into football season. Everything will be sold out.”\nRELATED CONTENT: SUPER BOWL LIII\nPeter McMahon, general manager of the 1,260 room Hyatt Regency Atlanta, said the process began a while ago.\n“Hotels in downtown, Midtown and Buckhead are already committed for the Super Bowl at this point, which means next winter hotels like ours will be buzzing,” he said. “You’ll see packed restaurants, attractions and stores all over the city. That means many of our neighbors will enjoy a significant boost from the tips and overtime and extra spending that the Super Bowl will bring.”\n‘Pretty big opportunity’\nMercedes-Benz Stadium can hold up to 75,000 people, but organizers think twice that many could come to town to be part of events or to use the Super Bowl as a marketing and sales opportunity. Companies don’t really care who ends up playing in the Super Bowl, and with deep corporate wallets, the bookings started a while ago.\n“They’ll say, ‘I’m going to get 50 or 100 rooms because I know I’ll have customers coming in,’ ” Pate said. “This is a great event to take customers to. And there are so many other events around the Super Bowl.”\nBut it’s not just schmoozing out of town clients that offers a chance for businesses to make money on the Super Bowl while using it as a springboard. The Host Committee is auditioning scores of local businesses – especially those with minority owners – to provide millions of dollars in goods and services.\nThe Vince Lombardi Trophy is seen after the Denver Broncos defeated the Carolina Panthers during Super Bowl 50 at Levi's Stadium on Feb. 7, 2016 in Santa Clara, Calif. (Ronald Martinez/Getty Images)\nSpeedPro Imaging Marietta wants to be one of them, said Littie Brown, co-owner and president of the five-year-old, four-person shop that makes signs, banners, graphics, murals and various displays.\n“For a small business like us, a one-time event where you can make $50,000 to $100,000 is a pretty big opportunity,” she said.\nBut it’s not just a short-term contract, it’s a chance to buff the business’ reputation for the future, she said. “We look at this as an opportunity to get us on the map in the Atlanta area. That is way beyond the Super Bowl.”\nThat same logic leads cities and companies outside Atlanta to see profit in the Super Bowl.\nJennifer Cruce, executive director of Visit Sandy Springs, says six hotels in her city have heard from the NFL with plans to put up visitors. The area always gets overflow from downtown when there is a big event – and this one is the biggest, she said.\n“I don’t think there’s any other single event that has the potential to deliver as many people to a city as the Super Bowl,” she said.\nRELATED CONTENT: ATLANTA HOSTS 2019 SUPER BOWL\nThe 20 hotels of Sandy Springs have about 2,800 rooms. Many are close to a MARTA station.\n“We expect to have a significant impact in Sandy Springs from the Super Bowl,” Cruce said. “Anytime we have a major convention in the city of Atlanta we get business here. People who stay here pay local taxes. They eat locally, they buy gas and everything else.”\nOf course, some of the money spent will go to far-off companies that own the hotels and restaurants – which is part of the ongoing debate among economists about the real economic benefits of having a big event like a Super Bowl.\nImpact questioned\nSome boosters in recent years have talked about an economic bounce of $400 million or even more from the game and related activities.\nSkeptics say those numbers are wildly exaggerated. They argue that boosters often just look at how much money is spent and ignore the costs of putting on the event or the things a city doesn’t do because of the Super Bowl.\nMoreover, the optimists don’t talk much about “leakage,” that is, the money spent here that ends up in far-away pockets. For example, the share of ticket and merchandise sales that flow to the NFL.\nEconomist Bruce Seaman of Georgia State University’s Andrew Young School of Policy Studies was hired to do estimates for Atlanta Sports Council – which has an interest in an optimistic evaluation — but he dismisses some of the estimates as outlandish.\n“I think it’s absolutely clear that these things have an economic impact, but not in the $600 million range,” he said. “I’m looking at something more like $200 million.”\nSetting expectations far lower than that is economist J.C. Bradbury of Kennesaw State University, who has long been critical of boosterish claims about glorious payoffs from big events and taxpayer-funded stadiums.\nSome impacts are hard to measure, like the increased pride that Atlantans may feel about hosting the Super Bowl or how a higher profile for the city might bring in more events and investment, he said. But when it comes to the hard data, Bradbury says the upside is modest.\n“What matters is the net new economic activity minus what it costs and what is displaced,” he said. “Yes, the effect is going to be positive, but probably in the $50 million range. I would say that an estimate of $200 million sounds very high.”","url":"https://www.ajc.com/business/super-bowl-prep-underway-atlanta-200-days-advance/RqmeO8G5Qlno4oWJFYsSqJ/"}
