{"authors":["Michael R. Wickline"],"date_download":"2018-10-30 01:08:04","date_modify":"2018-10-30 01:08:04","date_publish":"2018-08-07 04:30:00","description":"A consultant for the Legislature's tax-overhaul task force said Monday that if state government spending reductions are used entirely to finance an income tax cut, the state's economy and population will shrink as a result.","filename":"data/vaneerConsumption/Adviserdetailstaxcutscenarioseffectsonstateeconomypopulationdrawtaskforcelook.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_aug_07_adviser-details-tax-cut-scenarios-20180__page=2_1540861684.html","title":"Adviser details tax-cut scenarios; effects on state economy, population draw task force look","title_page":"Adviser details tax-cut scenarios; effects on state economy, population draw task force look","title_rss":"NULL","source_domain":"arkansasonline.com","text":"A consultant for the Legislature's tax-overhaul task force said Monday that if state government spending reductions are used entirely to finance an income tax cut, the state's economy and population will shrink as a result.\nPeter Evangelakis, senior economist for Amherst, Mass.-based Regional Economic Models Inc., presented the task force with six assessments of potential fiscal and economic impacts for each of three proposals to cut individual income taxes. He also did assessments of several other tax-overhaul plans. The consultant has a contract for up to $80,500 with the Bureau of Legislative Research to analyze up to 16 tax policy changes.\nRepublican Gov. Asa Hutchinson's plan to cut the state's top individual income tax rate from 6.9 percent to 6 percent is one of the three individual income tax-cut proposals for which the consultant conducted so-called dynamic scoring. Hutchinson has said his proposal would reduce state revenue by about $180 million a year and he plans to finance the cut through \"a combination of economic growth and savings through our budget constraints.\"\nOne assessment of the governor's proposal looked at not cutting state government spending by $180 million to finance the tax cut. Evangelakis said the governor's plan would result in an average annual increase in state population, beyond normal growth, of 2,410 a year between 2019 and 2023. That's largely because of higher after-tax compensation rates and employment opportunities raising the level of in-state migration, he said.\nThe state's total employment would rise by an average of 1,646 a year during this period, with 90.3 percent of the job increase in private nonfarm sectors and the other 9.7 percent in the government sector. Total output would increase by an average of $209.6 million a year, he said. The \"static impact\" of the governor's tax cut would be a $180 million-a-year reduction in state revenue, but the increase in economic activity would partially offset that loss to trim the revenue reduction to an average of $170 million a year, he said.\nAnother assessment factored in $180 million a year in government spending cuts to pay for the tax cuts. Under that scenario, the governor's plan would result in an annual decrease in state population of 118 from 2019 to 2023, Evangelakis said. That would be largely driven by lower employment opportunities that also lower the level of economic in-migration, he said.\nTotal employment would fall by an average of 1,451 a year during this five-year period, with 89.1 percent of the job loss from the government sector and 10.9 percent from the private non-farm sectors, and total output would drop by an average of $164.6 million a year as a result, Evangelakis said. The \"static impact\" would be a $180 million-a-year reduction in revenue and a $2.5 million drop in government expenses from the decrease in population and gross domestic product. These factors would boost the reduction in state expenses to $182.5 million a year, Evangelakis said.\nState Sen. Missy Irvin, R-Mountain View, said two of Arkansas' neighboring states -- Tennessee and Texas -- don't levy an individual income tax and she is concerned about Missouri's march to cut its individual income tax rate.\nIn July, Missouri Republican Gov. Mike Parsons signed a bill cutting that state's top individual income tax rate from 5.9 percent to 5.5 percent, effective Jan. 1.\nJeremy Horpedahl, an assistant professor of economics at the University of Central Arkansas, told the task force that the consultant's report confirms that most of the proposed tax cuts will provide \"some increase in economic activity and some increase in employment, but they are not large enough that they are going to pay for the tax cuts.\n\"It has been a concern at least initially what came out of this task force might be something like what happened in Kansas,\" where tax cuts failed to pay for themselves and led to large budget cuts, he said.\n\"None of the proposals are like that. They are reasonable enough where they are going to cause some economic activity, but are not going to cause any sort of large holes in the budget, at least ones that are planned,\" Horpedahl said.\nHutchinson's proposal to cut the state's top individual income tax \"can be planned for,\" and the consultant's models show that \"the dynamic effects are not that much different from the static effects,\" Horpedahl said.\nBut state Sen. Joyce Elliott, D-Little Rock, said, \"If we are going to look at tax policy in terms of equity, not equality, I think that leads us somewhere to something other than just pro-growth,\" such as creating a state earned income tax credit for low-income people.\nIn 2015 and 2017, the Legislature enacted the governor's plans to cut individual income tax rates for people who make up to $75,000 a year in taxable income. The plans are projected to reduce revenue by a total $150 million a year.\nAfterward, a task force co-chairman, Rep. Lane Jean, R-Magnolia, said, \"We will have some growth in the economy\" to increase revenue and therefore help pay for income tax cuts, but \"we'll have to have some spending cuts.\"\n\"What you don't want to do is just depend on growth and then have a downturn in the economy and then you definitely get into budget cuts,\" said Jean, who also is co-chairman of the Legislature's Joint Budget Committee.\nAnother individual income tax cut proposal analyzed by the consultant would reduce Arkansas' number of tax tables from three to one and reduce the rate from 6.9 percent to 6.5 percent for people who make more than $80,000. The state projects this proposal would cut revenue by $276.4 million a year.\nA third proposal would do the same as the second proposal, and also would repeal tax cuts for people making below $21,000 a year. Those cuts are scheduled to go into effect Jan. 1. The third proposal would instead create a refundable earned income tax credit equal to 10 percent of the federal earned income tax credit for low-income people. The state projects this proposal would cut revenue by $205.7 million a year. This proposal would require a three-fourths vote in the 100-member House and 35-member Senate to be approved, according to the Bureau of Legislative Research.\nMetro on 08/07/2018","url":"https://www.arkansasonline.com/news/2018/aug/07/adviser-details-tax-cut-scenarios-20180/?page=2"}
