{"authors":[],"date_download":"2018-10-22 23:02:06","date_modify":"2018-10-22 23:02:06","date_publish":"2014-06-11 17:18:20","description":"The Eric Cantor defeat frenzy has immigration reform advocates trying to stop suggestions that his loss means immigration reform is dead.","filename":"data/vaneerConsumption/AdvocatesInsistEricCantorLossDidntKillImmigrationReform.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/503036/140611-eric-cantor-mn-1525_39d76318ac4e43897aa08845df55d7c2.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_advocates-insist-eric-cantor-loss-didnt-kill-immigration-reform-n128601_1540249326.html","title":"Advocates Insist Eric Cantor Loss Didn't Kill Immigration Reform","title_page":"Advocates Insist Eric Cantor Loss Didn't Kill Immigration Reform","title_rss":"NULL","source_domain":"nbcnews.com","text":"Amid all the Beltway frenzy over the defeat of House Majority Leader Eric Cantor, a Democratic senator issued this reminder: 99.9 percent of Americans don’t know who Cantor is.\n“What they do know is that by now those 11.5 million (immigrants) who live in the shadows are visible to them. They go to school with their children, they see them under the highway … these people are part of the community,” Connecticut Sen. Richard Blumenthal told a room of Latino reporters.\nBlumenthal and other Democrats and immigration advocates were working quickly Wednesday to douse pronouncements of Cantor’s defeat as the death knell for immigration reform.\n“Eric Cantor has never been a proponent of immigration reform,” insisted Sen. Bob Menendez, D-N.J.\n“No one knew where he stood on the issue,” added Senate Majority Leader Harry Reid, D Nev. “He would tell some of us, yeah I’m going to do it. People could see through that.”\nCantor’s loss is the result of him failing to pay attention to his district and his involvement with national party politics, the senators said. They cited a PPP poll of voters Tuesday night in Cantor's district that showed 72 percent back immigration reform. The poll of 488 registered voters in the district was done for Americans United for Change, a liberal group. It has a margin of error of plus or minus 4.4 percent.\nBrat said Cantor's defeat had everything to do with his support for \"amnesty.\" \"Amnesty, at the end, was a clear differentiator between myself and Eric Cantor\nCantor had initially helped draft a Republican version of a bill to address young immigrants here illegally, also known as DREAMers. But he moved away from it as his primary became competitive and worked to block action on any immigration legislation.","url":"https://www.nbcnews.com/news/latino/advocates-insist-eric-cantor-loss-didnt-kill-immigration-reform-n128601"}
