{"authors":["Rebecca Taylor","Will Stewart In Moscow For Mailonline"],"date_download":"2018-10-22 21:27:20","date_modify":"2018-10-22 21:27:20","date_publish":"2017-04-26 01:54:56","description":"Aeroflot, the Russian airline taken to court over its alleged policy to move older and bigger women onto domestic flights, has said most passengers want to see thin female cabin crew on board.","filename":"data/vaneerConsumption/Aeroflotdefendpaycutforoverweightstewardesses.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F9B4A3100000578-0-image-a-3_1493166955782.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4445976_Aeroflot-defend-pay-cut-overweight-stewardesses_1540243640.html","title":"Aeroflot defend pay cut for overweight stewardesses","title_page":"Aeroflot defend pay cut for overweight stewardesses | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Russian airline has defended its decision to effectively cut pay for 'overweight' female cabin crew, claiming passengers only want to see thin stewardesses.\nAeroflot was taken to court by two female cabin crew who say they were moved from international routes to lower-paid domestic routes because of their physical appearance.\nThe group, which dubbed itself STS, the Russian abbreviation for 'old, fat ugly', took the airline to court saying they had been moved because they were overweight but their claims were rejected.\nAeroflot officials have said they believe their passengers choose the airline because of the staff and the image. Above, an advert for Aeroflot\nFlight attendant Yevgenia Magurina (R), took Russia's Aeroflot Airline tocourt over alleged discrimination over the age, weight and appearance of its flight attendants\nHaving previously denied such a policy on size of the crew was in place, a spokesman, which the airline later claimed did not represent Aeroflot, appeared to confirm it.\nIn a press conference on Tuesday, an airline spokesman said: 'Aeroflot is a premium airline and part of the reason people pay for tickets is the appearance of its employees.'\nHe added: '92% want to see stewardesses who fit into the clothes sizes we are talking about here.'\nThe court rejected the case of the complainants, who said they'd been moved to lower-paid domestic routes\nAccording to the Guardian, Nikita Krichevsky another member of Aeroflot's official team said the wage change should be viewed as an incentive to lose weight.\nMr Krichevsky even cited his own personal weight loss in the press conference.\nAfter the conference, Aeroflot said their statements did not necessarily reflect the airline's positions.\nIn February, one attendant Yevgenia Magurina complained: 'They told us all that only the young and thin will fly abroad for Aeroflot.'\nAnother complained at being weighed like cows by an airline which in Soviet times was the largest in the world, and notorious for poor service and safety, but is now seen as being as good as the best in the West.\nThey said that this means the experienced and loyal crew lose money, and miss out on layovers in exotic foreign destinations - a claim Aeroflot also strongly denied.\nMagurina told the Russian service of RFE/RL that she had been flying for 15 years and was a senior cabin crew member on international flights.\nBut in August she was reassigned to internal routes because she was not thin enough under new rules, she claimed.\nThey claimed they had been regularly photographed and weighed before they were moved to the other lines, despite their long service with the company\nIn a press conference, the airline seemed to agree that such a policy was in place, though it has denied it existed. It since said the airline's views were not made by the representatives\n'We were all photographed en masse and measured - some were even weighed,' she revealed.\n'This was done under the pretext of company rebranding and ordering new uniforms for staff. My life changed in the middle of August.'\nShe said they stopped anyone over the age of 40 and bigger than the Russian equivalent of a UK size 16, flying long-haul.\nThe group claimed women became so desperate to lose weight they were fainting with hunger at work.\nA judge rejected the complainants' case in court.\nAn Aeroflot statement after the press conference to the MailOnline said: 'Nikita Krichevsky and Pavel Danilin are not Aeroflot representatives or officials. They are members of Aeroflot’s Public Council, a 25-member consultative body that typically meets twice per year.\n'Members of the Public Council are not employees of Aeroflot and do not speak on behalf of the company. Aeroflot cannot dictate to members of the Public Council what statements they should or should not make in public.'\nThe spokesman also said the rulings in court vindicated their position.","url":"https://www.dailymail.co.uk/news/article-4445976/Aeroflot-defend-pay-cut-overweight-stewardesses.html"}
