{"authors":[],"date_download":"2018-10-30 22:56:47","date_modify":"2018-10-30 22:56:47","date_publish":"2014-08-14 16:08:54","description":"How many hours have you spent agonizing over whether you should reply to an email? How many times have you cringed as you sent a one-word reply, so as not to be rude and not acknowledge your receipt, but not to drag the conversation on and on? How…","filename":"data/vaneerConsumption/AFaveEmailButtonCouldSolveAllYourReplyAllNightmaresSoBringIt.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/ed522220-bd5c-4559-a7b5-95bacb7dff6b.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35771-a-fave-email-button-could-solve-all-your-reply-all-nightmares-so-bring-it_1540940207.html","title":"A \"Fave\" Email Button Could Solve All Your Reply-All Nightmares, So Bring It","title_page":"A \"Fave\" Email Button Could Solve All Your Reply-All Nightmares, So Bring It","title_rss":"NULL","source_domain":"bustle.com","text":"How many hours have you spent agonizing over whether you should reply to an email? How many times have you cringed as you sent a one-word reply, so as not to be rude and not acknowledge your receipt, but not to drag the conversation on and on? How many times have you thought, 'Hey, wouldn't it be nice to have a simple, streamlined way to quickly reply without really replying at all?'\" Well, to the joy of emailers everywhere, The Atlantic found that an email \"fave\" button is totally doable.\nIt would basically work like Facebook likes or Twitter favorites — when someone \"faves\" your email, you'd receive a notification telling you so. Simple as that! No more chewing your nails to the bone trying to figure out if \"thanks\" should be followed with an exclamation point, or if that makes you seem too overeager (but doesn't that period feel too curt?).\nThe technology is already there. The Atlantic talked to Pete Resnick, a director in the application area of the Internet Engineering Task Force and all around email expert. There's an existing extension to email that would easily allow the email fave to become a thing — it's basically responsible for the read-receipts that used to be so popular with email.\nJoe Raedle/Getty Images News/Getty Images\nResnick laid out how it could work for The Atlantic: After hitting a \"fave\" button a quick email would be automatically generated and sent out to recipients on the thread. But if multiple people \"fave\"d your email, they wouldn't all necessarily pop up, one after another. It could be like Facebook notifications, which aggregate likes and present them all at once if you're not actively using the site.\nYES. This could finally vanquish the worst people to ever engage on email: REPLY ALL-ers. They'll go on for hours, for DAYS, perhaps blissfully unaware that the entire chain is getting their pointless emails that are certainly not directed at the entire group.\nBut the only thing is that we would need to come up with very specific protocol on the fave. Can you \"fave\" an email from your boss? Would old people get it? What is the level of familiarity of the \"fave\" and what does it mean? Can \"faves\" be passive aggressive?\nI'm ready to charge into this wild new world of email faves, though, with the understanding there will still be kinks to work out. Let's make it happen, Internet!\nImage: lian xiaoxiao/Flickr","url":"https://www.bustle.com/articles/35771-a-fave-email-button-could-solve-all-your-reply-all-nightmares-so-bring-it"}
