{"authors":[],"date_download":"2018-10-30 20:07:04","date_modify":"2018-10-30 20:07:04","date_publish":"2016-05-03 21:19:53","description":"Karen Jefferson remembers the first time she met Afeni Shakur. Jefferson, then archivist at the Robert W.","filename":"data/vaneerConsumption/AfeniShakurwantedTupaccollectioninAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/05/03/Images/photos.medleyphoto.9623803.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_afeni-shakur-wanted-tupac-collection-atlanta__1540930024.html","title":"Afeni Shakur wanted Tupac collection in Atlanta","title_page":"Afeni Shakur wanted Tupac collection in Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"Karen Jefferson remembers the first time she met Afeni Shakur.\nJefferson, then archivist at the Robert W. Woodruff Library at the Atlanta University Center, was attending a 2009 meeting at the Tupac Amaru Shakur Center for the Arts. Shakur’s son, the prolific rapper Tupac, had been murdered in a drive-by shooting in Las Vegas years earlier and she was determined that his memory would not only live on but be of benefit to others.\nAlready, university professors across the nation were using her son’s writings, songs and life experiences in class curriculums. Young people and aspiring rappers still eagerly held on the lyrics on his CDs.\nW. Paul Coates, one of Afeni Shakur’s close friends and founder of Black Classic Press in Baltimore, introduced the two of them and they talked about the importance of preserving this historic material and Tupac’s papers for research and study.\n“She already knew that that’s what she wanted to do,” said Coates. “She was very, very focused in preserving her son’s legacy. Tupac had come to Atlanta and he found peace there. He loved Atlanta. It was important to Afeni that his legacy be connected to Georgia and connected to Atlanta. “\nJefferson said Afeni Shakur “was the mover and the primary person to make that decision. She wanted to make sure that people who were influenced by her son and interested in her son would have this opportunity to see his original work, much of it in his own handwriting.”\nThe result was the Tupac Amaru Shakur Collection, which opened in 2011 and contains handwritten song lyrics, poems, track lists and video treatments by Tupac as well as some by members of rap groups that he was affiliated with, including the Outlawz. The collection also includes correspondence, fan mail, organizational material from his production company and legal documents.\nIn all, there’s about 30 boxes of material, and a significant portion is digitized and accessible in the Library’s Archives Research Center. The collection is open to the public for research purposes.\n“”It’s a popular collection which garners a lot of interest,” said Andrea R. Jackson, head of the library’s Archives Research Center. ” Tupac Shakur’s collection is definitely utilized on a frequent basis.” The library grants a small number of researchers travel awards to conduct research in the library’s Archives Research Center. One of the 2016-2017 recipients will visit the collection to study Afeni Shakur and her involvement with the Black Panther Party.\nShare your memories and condolences with friends and family of Afeni Shakur in our online guestbook\nRelated:\nKenny Leon’s “revolution”: Ensuring Tupac’s ‘Holla’ is heard on Broadway\nTupac Shakur’s “Dear Mama” is trending on Twitter\nAfeni Shakur missed her son every day","url":"https://www.ajc.com/lifestyles/afeni-shakur-wanted-tupac-collection-atlanta/c9dD0XI6wqoJlHmbiojYdI/"}
