{"authors":[],"date_download":"2018-10-30 20:08:31","date_modify":"2018-10-30 20:08:31","date_publish":"2016-05-03 15:38:05","description":"Afeni Shakur, who died Monday night, never stopped missing her son.She talks about missing him in a 2011 video, saying “I miss his being.","filename":"data/vaneerConsumption/AfeniShakurmissedTupaceveryday.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/05/03/Images/photos.medleyphoto.9620439.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_afeni-shakur-missed-tupac-every-day__1540930111.html","title":"Afeni Shakur missed Tupac “every day”","title_page":"Afeni Shakur missed Tupac “every day”","title_rss":"NULL","source_domain":"ajc.com","text":"Afeni Shakur, who died Monday night, never stopped missing her son.\nShe talks about missing him in a 2011 video, saying “I miss his being. He was my son and I miss him as my baby, my boy, who I loved, respected, appreciated.”\nTupac Shakur was shot to death in 1996, and his mother took over handling his estate, which reportedly earned close to $1 million a year.\nThe son recorded “Dear Mama” in 1995, forgiving his mother for her failings and thanking her for her love. On Tuesday the song was trending on social media, including Facebook and Twitter.\nIn 2014 Afeni Shakur, a part-time Atlanta resident, co-produced “Holler If Ya Hear Me,” a Broadway musical based on her son’s music.\n“All Eyez On Me,” a movie of Tupac’s life, is set to be released this year.\nWhile celebrating his life, said Afeni Shakur in the 2011 video, she still missed his presence.\n“I miss interacting with that human being, that perfect being that excited, lovable, really magnificent spirit,” she said.\nShe added, “I miss my son every day a little bit more, but I thank God every day for every second that he was here.”\nAfeni Shakur died in California, after suffering possible cardiac arrest. Followers can sign her online guestbook here.","url":"https://www.ajc.com/news/afeni-shakur-missed-tupac-every-day/QMVvfbqySgAy2rXQ0gm1QN/"}
