{"authors":[],"date_download":"2018-10-30 00:50:21","date_modify":"2018-10-30 00:50:21","date_publish":"2018-08-23 13:02:38","description":null,"filename":"data/vaneerConsumption/AFewNotesonDonaldTrumpsTerribleTuesday.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/POTW6-1200x600.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860621.html","title":"A Few Notes on Donald Trump’s Terrible Tuesday","title_page":"A Few Notes on Donald Trump’s Terrible TuesdayThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"First: Do not — repeat not — trust your lawyers. My hero, RN, was done in largely by his awful lawyer, John Wesley Dean.\nDespite the fidelity lawyers are supposed to feel towards their clients, John Dean betrayed Nixon, the Peacemaker, horribly.\nNow Mr. Trump is under attack from his own awful lawyer, Mr. Cohen.\nTo me, his allegations are fraudulent. It’s just some zealous prosecutors and a judge who believe paying off a mistress is a federal case. Mr. Trump had plenty of good reasons to pay off his girls besides trying to corrupt an election. He’s a married man. He didn’t want his wife to know. Surely that’s not a federal crime.\nNext, here’s an idea. Let’s have a special prosecutor with unlimited powers and limitless budget go after Nancy Pelosi and Chuck Schumer. The official could go back decades in his scrutiny. Let’s have him go after the top dogs at the New York Times and MSNBC too. Do you think they might find anything? Let’s have neighborhood special prosecutors to root out anti party wreckers and saboteurs. Let’s just turn to the law of the Jungle. Why not. It worked for Stalin. Why not for today’s America?\nNext, did anyone notice that Trump — not Obama — got rid of the last Nazi war criminal in America? Has anyone thanked him for it? God bless you, Mr. Trump.\nLast night a young Englishman asked why I support Trump. “Because he stands up for the America I was brought up to love. Because he respects the rights of the Israelis to live in peace. Because he keeps his promises.”\nI only met Trump once thirty years ago. I wrote a piece for Barron’s accusing him of bond fraud. He called me to tell me he was going to sue me. He didn’t, but I sure didn’t like him. Now I do and I have a message for those who give their days up to hating him. Get off his back and let him work on what really counts. Peace. Law. And Prosperity.\nAnd an America that’s not a police state run by omnipotent lynch mobs called Special Prosecutors.","url":"https://spectator.org/a-few-notes-on-donald-trumps-terrible-tuesday/"}
