{"authors":["Chloe Lambert For The Daily Mail"],"date_download":"2018-10-22 20:19:59","date_modify":"2018-10-22 20:19:59","date_publish":"2016-01-29 01:05:07","description":"Scientists at Harvard and the University of East Anglia found that eating fruit, especially berries and red grapes, may prevent the dreaded middle-aged spread and even help to shed the pounds.","filename":"data/vaneerConsumption/AfewgrapesreallyCANslimyourwaistandboostyourlovelife.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/30ADC39800000578-0-image-a-38_1454029408536.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/home_article-3422016_The-good-news-grapes-really-slim-waist-boost-love-life_1540239599.html","title":"A few grapes really CAN slim your waist and boost your love life","title_page":"A few grapes really CAN slim your waist and boost your love life | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"New research found they aid weight loss and can improve sex lives\nThe compounds already known to reduce blood pressure and cholesterol\nBursting with natural sugars and deliciously moreish, grapes certainly don't seem like a dieter's best friend.\nBut it seems that simply eating a handful a day could be the answer to shedding the pounds — and boosting your sex life.\nScientists have found that eating fruit — especially berries and red grapes — may prevent the dreaded middle-aged spread and even help you to shed the pounds.\nJust a single serving a day (equivalent to half a cup, or a handful, of grapes) was enough to have an effect.\nScientists have found that eating fruit — especially berries and red grapes — may prevent the dreaded middle-aged spread and even help you to shed the pounds\nThe benefits seem to come from flavonoids — natural compounds that give many fruit and vegetables their vibrant colours and their flavours.\nFlavonoids have attracted attention for some time for their ability to reduce blood pressure and cholesterol, reducing the risk of conditions such as heart disease and cancer.\nBut this week's research shows, for the first time, that they may also help us to maintain a healthy weight, as well as boosting our sex lives.\n'We've known for a long time that a diet rich in fruit and vegetables has many health benefits,' says Helen Bond, a dietitian and spokesperson for the British Dietetic Association.\n'Emerging evidence is suggesting that flavonoids may be responsible.'\nResearchers from Harvard School of Public Health and the University of East Anglia kept track of 124,000 people across the U.S. over 24 years. They were drawn from three groups with average ages of 36, 47 and 48.\nAcross the groups, men gained on average 2.2lb in weight every four years, and women 4.8lb.\nBut those who ate the highest number of flavonoid-rich foods tended to maintain a healthy weight, or even showed a modest weight loss.\nJust a single serving a day (equivalent to half a cup, or a handful, of grapes) was enough to have an effect\nThe flavonoids with the most benefits were a group called anthocyanins — found in grapes, blueberries, strawberries, cherries, blackberries, radishes and blackcurrants.\nOther types of flavonoids that had effects on weight maintenance and loss were flavonoid polymers — large antioxidant molecules found in tea, apples, plums and berries — and flavonols, chemicals similar to flavonoids, found in tea and foods such as onions and apples.\nThe results held true even after the researchers adjusted for factors such as how much exercise the participants did, and other aspects of their diet, including how much fat and fibre they ate.\n'That suggests there is something specific about flavonoids,' says author Aedin Cassidy, professor of nutrition at the University of East Anglia's Norwich Medical School.\n'Rather than being the latest diet fad, this is about maintaining your weight. When people enter middle age, they tend to gain weight — it's just a fact of life.\n'And we know that, at this age, weight gain raises the risk of heart disease and diabetes.\n'This is about preventing that weight gain from happening, which is much better than putting it on then trying to lose it.'\nAnd better still, the flavonoids in berries, grapes and wine won't just keep you slim — they may also help your sex life.\nEarlier this month, another study by Harvard and the University of East Anglia found middle-aged men who regularly ate flavonoid-rich foods were less likely to develop erectile dysfunction.\nAnthocyanins, found in red and blue fruits such as berries, and flavanones and flavones, which are found in citrus fruit — were shown to have the greatest effect.\nResearchers said a flavonoid-rich diet was as good for protecting against erectile dysfunction as briskly walking for five hours a week.\nAnthocyanins, found in red and blue fruits such as berries, and flavanones and flavones, which are found in citrus fruit, had the best effect\nEven better, just a few portions of flavonoids a week were enough to have a positive effect on weight gain. Every tiny increase of daily intake — just 10mg of anthocyanins, or a tenth of a portion of blueberries — was associated with 70-100g less weight gained over four years.\n'It's easy to look at the results and see that they're really tiny changes in weight,' says lead author Monica Bertoia, of the Harvard School of Public Health.\nWe've known for a long time that a diet rich in fruit and vegetables has many health benefits - emerging evidence is suggesting that flavonoids may be responsible Helen Bond, dietitian for the British Dietetic Association\n'But weight maintenance is really important. Just maintaining weight from adulthood onward would have a significant public health impact, because most people are gaining weight.'\nProfessor Cassidy, who eats two portions of berries or grapes a day, says: 'We should probably try to incorporate a few portions a week — ideally one a day.'\nShe believes upping our flavonoid intake could be a valuable and easy way to prevent obesity.\n'We're all told to eat five a day, but this new evidence suggests some fruit and vegetables might be better than others, particularly in terms of weight maintenance.'\nSo, how might flavonoids help us to slim? Experts believe the compounds may help by reducing the amount of fat the body absorbs from food, reducing appetite, or raising our metabolism.\n'There have been studies where mice were fed a high-fat diet then fed flavonoids on top of that, and it seemed to prevent the increase in body weight that you'd expect,' says Professor Cassidy.\nAnother area of focus is flavonoids' effect on gut bacteria — they may alter the type of microbes growing in our gut, meaning our food is metabolised differently and we gain less weight.\nThe flavonoids with the most benefits were a group called anthocyanins — found in grapes, blueberries, strawberries, cherries, blackberries, radishes and blackcurrants\nHowever encouraging the new research into flavonoids is, Professor Cassidy stresses that they aren't a magic bullet: no amount of blueberries will help you lose weight if you're also scoffing biscuits, cakes and cheese all day.\nBut with only a third of Britons managing to get their five-a-day, she and others hope that the promise of a trimmer waistline could encourage people to eat more fruit.\n'We know fruit and veg are good for you and now it looks like you get a double benefit: you're lowering your risk of heart disease and helping to keep a healthy weight, too.'\nHere, we reveal how to get the best from these miracle compounds that can trim your waistline and boost your sex life . . .\nFlavonoids — why fresher is better\nEver wondered why that fruit or veg you've left hanging around in the back of the fruit bowl or fridge tastes less delicious than when it was fresh?\nIt's because they lose some of their flavonoids — which gives them some of their taste — during storage.\nFor example, onions will lose about one-quarter to one-third of their original flavonoid content over six months, with most of the loss occurring in the first two weeks.\nSo, wherever possible, choose fresh, local, seasonal produce to get the most health benefits.\nBut cooking could kill them off\nBut it's not just storage that may have an impact on flavonoid content.\nThey can also be can be lost through contact with water — in some cases, up to 80 per cent of some flavonoids can be lost into cooking water during the boiling of foods.\nBoiling vegetables can result in the loss of up to 80 per cent of flavanoids - natural compounds that give many fruit and vegetables their vibrant colours and their flavours\nLoss of colour-rich flavonoids during boiling may often be seen in a dulling of the food's colours.\nAvoid this by steaming instead, and serving vegetables al dente.\nFlavonoids also can be damaged by heat, so your grilled veg will have fewer health-boosting benefits than steamed or raw.\nEat fruit and vegetables whole\nAvoid cutting, slicing or peeling fruit and veg wherever possible — flavonoids are often concentrated in the skin and outer portions of fruits and vegetables.\nFlavanoids are often concentrated in the skin of fruit and vegetables so it recommended not to cut them\nPick red grapes over white\nBecause flavonoids provide the colour in many foods, to get the best dose you should seek out those fruit and vegetables with the brightest, deepest colours — which means choosing red grapes over white.\nJuices don't count — but frozen berries do\nFrozen fruits are just as good a source as fresh fruit as the freezing process traps the flavanoids\n'There are much higher levels of flavonoids in the whole fruit than there are in the juice. That's because most of them are found in the skin or the pith, which are extracted when juiced,' says Professor Cassidy.\n'That's why you get more in a blueberry than a strawberry, for example — they're tiny little berries, so there's more skin for each one you eat.'\nSo it's much better to eat it whole, rather than in a juice.\nFrozen fruits are just as good a source as fresh, as the freezing process traps nutrients and prevents flavonoid loss.\nAnd best of all . . . wine is fine!\nRed wine is a good source of anthocyanins — the type of flavonols shown to have the greatest effect in protecting against weight gain.\nIndeed, it's these compounds that give it its rich red colour.\nA medium glass of red wine — 140ml — provides 28mg of anthocyanins, about the same as you'd get from half a cup of raspberries.","url":"https://www.dailymail.co.uk/home/article-3422016/The-good-news-grapes-really-slim-waist-boost-love-life.html"}
