{"authors":["Martin Gould In Puerto Vallarta","Mexico For Dailymail.Com"],"date_download":"2018-10-23 05:26:35","date_modify":"2018-10-23 05:26:35","date_publish":"2016-01-11 18:26:51","description":"Ethan Couch and his mother Tonya fled Fort Worth in early December along with $30,000, two handguns and their dog. Virgil. He has been missing since the two were arrested on December 28.","filename":"data/vaneerConsumption/AffluenzateenEthanCouchsdogisMISSINGinMexico.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/18/300D6BA800000578-0-image-a-60_1452536595932.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394342_Dog-belonging-affluenza-teen-Ethan-Couch-MISSING-Mexico-1-000-reward-offered-Virgil-Saarloos-Wolfdog_1540272395.html","title":"'Affluenza' teen Ethan Couch's dog is MISSING in Mexico","title_page":"'Affluenza' teen Ethan Couch's dog is MISSING in Mexico | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The jailed mother of 'affluenza' teen Ethan Couch is worried sick — not just about her wayward son, but also her missing dog.\nVirgil, a Saarloos Wolfdog, hasn't been seen since Couch and his mom Tonya were arrested in Puerto Vallarta, Mexico on December 28, and now fears are growing about what has happened to it.\nNow a relative of the Couches is offering a $1,000 reward for Virgil's return.\nMisty McWilliams, who lives in Burleson, a wealthy suburb of the Couches' hometown of Fort Worth, Texas, slammed the phone down when Daily Mail Online called her to ask about her offer.\nMissing: This is a picture of Ethan Couch's dog, missing in Mexico. When Ethan Couch and his mother Tanya decided to flee from Texas to Puerto Vallarta, they took their dog Virgil with them. Now the dog is wandering the streets of Puerto Vallarta\nFound: Ethan Couch had achieved notoriety for being spared prison despite killing four while driving drunk after a psychiatrist said he had 'affluenza'. He was arrested on December 28 after going on the run in Mexico\nIn a note posted in Spanish on the Puerto Vallarta SPCA Facebook page, McWilliams said the dog went missing near Calle Colombia — the road where Ethan and Tonya Couch were living when they were arrested.\nTonya Couch, 48, was appearing at a hearing in Fort Worth on Monday to try to get her bail reduced from $1 million to $15,000. If she can make bail she would have to hand in her passport and wear an ankle monitor.\nShe is charged with hindering the apprehension of a felon, her 18-year-old son Ethan.\nTonya Couch's attorney told the Fort Worth Star-Telegram that Tonya's 'main concerns were for her son and her dog Virgil'.\nTonya and Ethan Couch fled Fort Worth in early December along with Virgil, $30,000 that she had withdrawn from her bank account and at least two handguns. Tonya had earlier called her husband Fred — whom she divorced and then remarried — to tell him he would never see them again.\nTonya Couch is due at a hearing in Fort Worth on Monday to try to get her bail reduced from $1 million to $15,000. If she can make bail she would have to hand in her passport and wear an ankle monitor\nThey drove over the border into Mexico and completed the 1,200-mile journey to Puerto Vallarta, a popular Pacific Ocean resort.\nThere they stayed at the seafront Los Tules hotel until Christmas Eve when they moved to the second-floor, 1,000 sq. ft, two-bedroom apartment on Calle Colombia.\nLocals who talked to Daily Mail Online described their dog as either a husky or a malamute, but in fact it is a Saarloos Wolfhound, a cross between a female European wolf and a male German Shepherd.\nThe website Dog Breed Info describes the Saarloos as 'only for the lover of the old canine ways, as it retains in a limited state some of the wolf-like and/or ancient canine ways, including an intense pack instinct, tendency towards shyness, and a need to roam or at least have adequate space.'\n'These dogs are exceptionally strong-willed and do not take well to obedience,' the site continues. 'They are still pack-oriented and need a strong leader and a social atmosphere.'\nThe site says the Saarloos is 'not recommended for apartment life,' adding that it should not be around children or live in a kennel. 'Seclusion intensifies anti-social behavior, and the dog may panic if locked in an enclosure.'\nMisty McWilliams, who lives in Burleson, a wealthy suburb of the Couches' hometown of Fort Worth, Texas. slammed the phone down when Daily Mail Online called her to ask about her reward offer\nCouch is wanted in Texas for breaking an appointment with his probation officer. He is on 10 years probation for killing four people in a drunk-driving accident in 2013.\nDuring his court case — in which he pleaded guilty — psychiatrist, G. Dick Miller said Couch's parents coddled him so much as a child that he did not know right from wrong.\nMiller said the Couches' parenting 'strongly enabled' the accident.\nMiller used the term 'affluenza' and Judge Jean Boyd accepted his diagnosis, even though it is not medically recognized. She gave Couch juvenile probation, which included a term that he should not touch alcohol or drugs and time in rehab.\nThe case was fading from memory after 30 months when a six-second video clip was posted on Twitter on December 3 by a girl with the handle @blondespectre, who tagged the Tarrant County sheriff's office with the words 'ya boy ethan couch violating probation. i got more if u want.'\nThe video showed a game of beer pong and a man collapsing a table by jumping on it face first. Couch is seen in the background laughing and clapping.\nSoon after Couch and his mother disappeared, making their way to Mexico. Authorities realized they were missing when he failed to turn up at a scheduled meeting with his probation officer.\nThey were eventually arrested in Puerto Vallarta after a ping from one of their cellphones for a Domino's Pizza order was traced.\nCouch can face only up to 120 days in jail for breaching his juvenile probation. Tarrant County District Attorney Sharen Wilson says she will push for his probation to be upgraded to adult, so if he breaches it again he could spend up to 40 years behind bars.\nThe Saarloos Wolfdog\nDescription: The Saarloos Wolfdog breed was developed in the early 1920s in the Netherlands by Leendert Saarloos. He hoped to improve the German Shepherd breed, which had numerous health issues, by breeding it with a female European wolf. Average cost: $500-$1,000 Size: When full grown the animal can weigh up to 90 pounds, and measure 24-29 inches in height – for both sexes. Characteristics: The Saarloos Wolfdog has a broad, powerful neck and large ears like the German Shepherd. It has long legs with feet that turn slightly outward. Its coat is medium in length ranging in colors from wolf-gray, wolf-brown and red with limited white markings. It is an average shedder. Temperament: The wolfdog is strong-willed and pack-oriented, and requires a strong leader. Tends to be shy and seldom barks. They are also distrustful of strangers. Lots of exercise and large spaces is required because if locked in an enclosure the dog may panic. Life expectancy: About 10-12 years\nHis mother faces up to 10 years for aiding his flight.\nFred and Tonya Couch have been widely blamed for their role in their son's self-destruction. A profile in Dallas's D Magazine was titled 'The Worst Parents Ever.'\nDivorce papers unearthed by the magazine showed that Tonya called then 9-year-old Ethan her 'protector' against Fred's alleged violent outbursts. When Tonya complained that Fred wasn't involved in the boy's upbringing, he replied: 'I am not a mom.'\nA social worker said the main concerns for the boy were 'the codependent relationship Ethan has with his mother and the father’s lack of a regular and consistent relationship with Ethan,' combined with the fact that 'both parents have \"adultified\" Ethan and have allowed him to become overly involved in adult issues and decisions.'\nBut it didn't stop at the divorce. By 13, Ethan was said to be driving himself to his private school. When the principal questioned it, Fred Couch, who made his fortune from his sheet metal factory, reportedly offered to buy the school.","url":"https://www.dailymail.co.uk/news/article-3394342/Dog-belonging-affluenza-teen-Ethan-Couch-MISSING-Mexico-1-000-reward-offered-Virgil-Saarloos-Wolfdog.html"}
