{"authors":[],"date_download":"2018-10-22 21:53:17","date_modify":"2018-10-22 21:53:17","date_publish":"2014-05-08 07:52:09","description":"Militants pledge to start targeting \"military gatherings of foreign invading forces, their diplomatic centers and convoys\" beginning Monday morning.","filename":"data/vaneerConsumption/AfghanTalibanVowBackbreakingStrikesinSpringOffensive.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/428181/140508-taliban-afghanistan-4a_ea9a0af8c66a96ccfaa1ca3dd97ef742.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_afghan-taliban-vow-backbreaking-strikes-spring-offensive-n100051_1540245197.html","title":"Afghan Taliban Vow 'Backbreaking' Strikes in Spring Offensive","title_page":"Afghan Taliban Vow 'Backbreaking' Strikes in Spring Offensive","title_rss":"NULL","source_domain":"nbcnews.com","text":"The Taliban, which was driven from power by U.S.-backed forces in 2001 but has seen a resurgence in the lead-up to the withdrawal of most foreign troops later this year, said it would launch \"backbreaking martyrdom strikes\" and insider attacks. It also pledged to target foreign and Afghan government bases with heavy weapons and missiles.\nThe militants said they would try and \"inflict maximum losses on the invaders while preventing corporeal and financial losses on the ordinary civilians.\"\nThe Afghan government responded by saying the Taliban's tough talk was cover for their failure to disrupt recent elections.\n\"Afghan forces have been on the offensive and Taliban are weakened by all accounts,\" defense ministry chief spokesman Lt. Gen. Zahir Azimi said. \"They do not hold any base inside Afghanistan and that is why they resort to roadside bombings and targeting civilians to get on the headlines.\"The International Security Assistance Force in Afghanistan responded to the Taliban’s statement by saying, “This statement by the Taliban is simply a reiteration of previous years' rhetoric and not reflective of the situation on the ground as it is today. The Afghan National Security Forces countering threats to security now are not the ANSF of 2009 or even a year ago.\n“Since taking the lead for security in June 2013, the ANSF capabilities have progressed to the point where they have achieved tactical superiority over the Taliban and other insurgent groups who would threaten the Afghan people.”\nThe government of outgoing President Hamid Karzai has been trying to conduct talks with the militants but has so far not been able to negotiate a peace or power-sharing agreement with the group.\nAccording to the Afghan government, more than 13,000 soldiers and police officers have been killed there since 2001. At least 2,179 members of the U.S. military have died during the same time, according to The Associated Press' count.\n- F. Brinley Bruton and Fazul Rahim","url":"https://www.nbcnews.com/news/world/afghan-taliban-vow-backbreaking-strikes-spring-offensive-n100051"}
