{"authors":["Associated Press"],"date_download":"2018-10-23 01:23:52","date_modify":"2018-10-23 01:23:52","date_publish":"2016-01-11 12:13:34","description":"KABUL, Afghanistan (AP) — Afghanistan's national cricket team returned home Monday after securing a second Twenty20 win over Zimbabwe in three months, propel...","filename":"data/vaneerConsumption/Afghanistanscricketteamreturnshomevictorious.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393780_Afghanistans-cricket-team-returns-home-victorious_1540257832.html","title":"Afghanistan's cricket team returns home victorious","title_page":"Afghanistan's cricket team returns home victorious | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Afghanistan's cricket team returns home victorious\nKABUL, Afghanistan (AP) — Afghanistan's national cricket team returned home Monday after securing a second Twenty20 win over Zimbabwe in three months, propelling the squad into the top 10 in both the one-day and T20 formats.\nHundreds of fans gathered at the airport in Kabul to welcome the team back from Sharjah, United Arab Emirates. They lined the capital's main roads, cheering, whistling and waving Afghanistan's black, red and green flag.\n\"Our cricket heroes continue to surprise us with the amazing performance. We proudly thank you for all the efforts and hard work,\" Afghan President Ashraf Ghani tweeted.\nCricket is rapidly gaining a solid fan base in Afghanistan, which has been at war for almost 40 years. Most members of the team learned to play while growing up in refugee camps in bordering Pakistan.\nThe Afghans clinched the two-game series Sunday after Mohammad Shahzad hit the fourth-highest score in the format's history with 118, taking his team to an 81-run victory.\nShahzad was also a key part of the earlier five-match ODI series in Sharjah, which Afghanistan won 3-2. The humiliation for Zimbabwe was complete, after losing an ODI series to Afghanistan on home turf in October.\nThat thrilled fans across the country when Gulbadin Naib hit a six with only three balls remaining to propel Afghanistan to their target of 254 and a victory that was greeted with celebratory gunfire across Afghanistan.\nSports have become one of the few bright spots for Afghanistan, as the Taliban insurgency intensifies and spreads across the country, killing thousands of troops and civilians.\nThe cricket victory made up for the disappointment of Afghanistan losing the final of the South Asian Football Federation championship days earlier to India.\nThe team has the support of the International Cricket Council, which put Afghanistan 10th in its one-day international and ninth in the T20 international rankings. The ICC promoted Afghanistan to associate member in test cricket in 2013.\nNazeem Jaar Abdurahimzai, the domestic manager with the Afghanistan Cricket Board, said the national team had earned the support of the public and the government. Bringing in foreign coaches, including former Pakistan captain Inzamam-ul-Haq as head coach, has boosted the professionalism of the team, he said.\n\"In the current situation, with the war, few jobs available for young Afghans and many people leaving the country, cricket is certainly something that can grip the imagination of Afghans, as well as teach them patience, focus and tolerance because both are needed to play the game well,\" Abdurahimzai said.","url":"https://www.dailymail.co.uk/wires/ap/article-3393780/Afghanistans-cricket-team-returns-home-victorious.html"}
