{"authors":[],"date_download":"2018-10-22 20:40:17","date_modify":"2018-10-22 20:40:17","date_publish":"2014-05-02 15:36:47","description":"A landslide triggered by heavy rains buries a village in northeastern Afghanistan, leaving as many as 2,000 people missing.","filename":"data/vaneerConsumption/AfghanLandslide350DeadHundredsMoreMissingInBuriedVillage.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_18/417171/140502-afghan-mudslide-1543_9cf08db2957cb75a331f6db9b341286e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_afghan-landslide-350-dead-hundreds-more-missing-buried-village-n95701_1540240817.html","title":"Afghan Landslide: 350 Dead, Hundreds More Missing In Buried Village","title_page":"Afghan Landslide: 350 Dead, Hundreds More Missing In Buried Village","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nKABUL — At least 350 people were killed and several hundred more are missing and feared dead after a village was buried by a huge landslip in a remote region of Afghanistan, officials said Friday.\nOne-third of the 1,000 homes in the village were completely covered by mud several feet deep, local police told NBC News.\nRescue teams have been dispatched to Aabe Barik in the Argun district of the mountainous Badahkshan province, but heavy rains are making access difficult.\nA United Nations spokesman said at least 350 people were killed, but province governor Shah Waliullah Adeeb said the toll could be as high as 2,500.\nAri Gaitanis, from the United Nations Assistance Mission in Afghanistan, told Reuters the U.N. is working with authorities on the ground to rescue people still trapped.\nAdeep said rescue crews did not have enough equipment and appealed for shovels.\n\"A mountain part slid down. Washing off the entire village,” he told NBC News. “According to our estimates the village [comprised] about 300 families and an estimated population of 2,000 people including women and children.","url":"https://www.nbcnews.com/news/world/afghan-landslide-350-dead-hundreds-more-missing-buried-village-n95701"}
