{"authors":[],"date_download":"2018-10-22 22:20:59","date_modify":"2018-10-22 22:20:59","date_publish":"2017-03-16 03:13:12","description":"The lights go off, the projector whirls,and for the first time in years Afghan families find themselves sharing popcorn and soda as Hollywood and Bollywood...","filename":"data/vaneerConsumption/AfghansfindsomeescapeasfamilycinemaopensinKabul.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/03/wire-226075-1489633995-876_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4318746_Afghans-escape-family-cinema-opens-Kabul_1540246859.html","title":"Afghans find some escape as 'family cinema' opens in Kabul","title_page":"Afghans find some escape as 'family cinema' opens in Kabul | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kabul's new family-friendly cinema is one of the few places where women, usually confined to the home, can spend time in public with their husbands and children\nThe lights go off, the projector whirls,and for the first time in years Afghan families find themselves sharing popcorn and soda as Hollywood and Bollywood stars romp across the silver screen.\nA family-friendly cinema has opened in Kabul, creating a rare venue in Afghanistan's war-torn capital where women, usually confined to the home, can spend time in public with their husbands and children.\nKabul's movie halls are popular with raucous male audiences who clap and whistle at screens wreathed in clouds of hashish and cigarette smoke.\nAs Zahra Sozan, a 25-year-old mother-of-one told AFP, it is not \"traditional\" for women or children to go to the movies.\nBut when the Galaxy was built last year it became the first cinema in Kabul to ban single men for certain hours when families are inside, sheltering women and children from harassment, smoke, and unsuitable behaviour.\n\"It's my first ever experience visiting a cinema in Kabul, and the experience has been great,\" Sozan told AFP, smiling despite having just emerged from watching the 2016 Hollywood supernatural thriller Lights Out.\n\"When the families are inside the hall nobody else is allowed to get inside, the families feel secure,\" said Abubakar Gharzai, one of the Galaxy's owners.\nGalaxy's higher prices -- 300 Afghanis ($6) for a ticket, six times the cost of other cinemas in Kabul -- put it beyond the reach of many families\nSixteen years ago this simple pleasure would have been impossible, with the cinema halls destroyed by civil war and the Taliban regime forbidding nights at the movies.\nThe queue at the Galaxy is an echo of a time before the Taliban's dark era, when Afghan men, women and children openly attended films, theatre and concerts.\nYoung couples wait for tickets, enjoying the novelty and boldness of being in public together -- though many are still cautious, shying away from being interviewed.\nIts higher prices -- 300 Afghanis ($6) for a ticket, six times the cost of other cinemas in Kabul -- also puts it beyond the reach of many in the capital, where unemployment is rampant, adding to the sense of security for those who can afford it.\n\"There aren't many places for women in Afghanistan to hang out, they have a tough life, and this is a secure place,\" Sozan's husband Hamed said.\n- Defying tradition -\nSamira Sozan, visiting the Galaxy with her brother, agreed.\n\"We have a bowling club, recreational park, and Kabul zoo,\" the 22-year-old embassy worker told AFP, ticking off the public places suitable for women in the capital.\nEven at home women are usually too busy washing and cooking to enjoy time with husbands and children, she said.\nThen, her brother heard about the Galaxy. \"We will come again and again,\" she told AFP.\n\"It is not tradition to visit the cinema, but we do not care what people say. It is one of the few places for us to spend time with our families... We cannot ask for a better place to come.\"\nHer happiness sums up why Gharzai chose to run his cinema the way he has.\nIslamist militants have long villified Hollywood and Bollywood as vulgar and sinful, although no cinemas have been attacked in Kabul in recent years.\n\"We want to show the world the positive side of Afghanistan,\" he told AFP. \"That Afghanistan is not about bombs and attacks, but there is also something which makes our people happy.\"\nThe biggest threat to the cinema, he said, is piracy and online streaming.\nAfghan audiences prefer US and Indian movies to those produced by a homegrown film industry stunted by nearly four decades of war.\nHowever, by the time the Galaxy screens recent high-definition offerings such as Dangal, Ae Dil Hai Mushkil and Sultan, many would-be spectators have already watched them online.\nHorror films, Gharzai said, are popular. \"We could not air horror movies because of the children, but the demand was very high, so now we show them.\"\nAfghanistan is still at war with a resurgent Taliban, and security fears at the Galaxy, located inside a Kabul shopping centre guarded by armed police, extend beyond protection from wolf whistles and shame.\nIslamist militants have long villified Hollywood and Bollywood as vulgar and sinful, although no cinemas have been attacked in Kabul in recent years.\n\"There are threats,\" admits Gharzai. \"But we rely on the Almighty.\"","url":"https://www.dailymail.co.uk/wires/afp/article-4318746/Afghans-escape-family-cinema-opens-Kabul.html"}
