{"authors":[],"date_download":"2018-10-22 22:09:39","date_modify":"2018-10-22 22:09:39","date_publish":"2014-05-09 07:57:08","description":"Islam gives girls the right to an education just like boys, so there was no justification for imposing restrictions on females, one demonstrator says.","filename":"data/vaneerConsumption/AfghanSchoolgirlsCondemnBokoHaramsKidnappingsinNigeria.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/431006/140509-afghanistan-nigeria-345a_48970f85d89c91556a0e3681a96e6e91.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_afghan-schoolgirls-condemn-boko-harams-kidnappings-nigeria-n101106_1540246179.html","title":"Afghan Schoolgirls Condemn Boko Haram's Kidnappings in Nigeria","title_page":"Afghan Schoolgirls Condemn Boko Haram's Kidnappings in Nigeria","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAfghan schoolgirls and activists rallied to demand the release of more than 270 kidnapped Nigerian girls on Thursday, calling the militant group behind the abductions un-Islamic.\nAbout 80 demonstrators, some carrying hand-written signs saying \"No Extremism\" and \"No Conservatism,\" gathered in the capital of the mountainous province of Bamiyan, Pajhwok Afghan News reported.\nActivist Ismail Zaki told Pajhwok that Boko Haram, the militant group behind the abductions, was un-Islamic and masquerading as a Muslim organization.\nIslam gives girls the right to an education just like boys, so there was no justification for Boko Haram imposing any restrictions on them, protester Tayyeba Khawari told the news service.\nThe attack on Gamboru, in remote northeastern Nigeria near the border with Cameroon, is part of BoKo Haram's campaign of terror. The students are believed to be held by Boko Haram in the Sambisa Forest in northeastern Nigeria.\nPeople around the world have been showing their support for the kidnapped girls by taking part in protests and joining online campaigns calling for their rescue.\nFirst lady Michelle Obama and Pakistani schoolgirl, human rights activist Malala Yousafzai and actress Angelina Jolie are among those backing the campaign and have posted photos of themselves holding a sign reading \"#BringBackOurGirls.\"\nReuters contributed to this report.","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/afghan-schoolgirls-condemn-boko-harams-kidnappings-nigeria-n101106"}
