{"authors":["Cameron Jenkins"],"date_download":"2018-10-22 21:40:01","date_modify":"2018-10-22 21:40:01","date_publish":"2018-07-31 00:00:00","description":"A U.S. government watchdog says the Afghan government \"may be going back to 'business as usual' and 'simply checking the box' when it comes to fighting corruption.\"","filename":"data/vaneerConsumption/AfghanistanUpdateGovernmentLawlessWeakAndDysfunctional.json","image_url":"https://media.npr.org/assets/img/2018/07/31/gettyimages-864220070_wide-81036425d63b1c15daa0db97fff437bcb61d2cd2.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_07_31_634265577_afghanistan-update-government-lawless-weak-and-dysfunctional_1540244401.html","title":"Afghanistan Update: Government 'Lawless, Weak And Dysfunctional'","title_page":"Afghanistan Update: Government 'Lawless, Weak And Dysfunctional' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Afghanistan Update: Government 'Lawless, Weak And Dysfunctional'\nEnlarge this image toggle caption WAKIL KOHSAR/AFP/Getty Images WAKIL KOHSAR/AFP/Getty Images\nA U.S. government watchdog says the Afghan government \"may be going back to 'business as usual' and 'simply checking the box' when it comes to fighting corruption.\"\nIn a report issued Monday, the Special Inspector General for Afghanistan Reconstruction, or SIGAR, recorded instances of corruption in the very institutions put in place to stop it.\nSIGAR cited a U.S. Department of Justice finding in March that described the situation in Afghanistan as \"consistent with a largely lawless, weak, and dysfunctional government.\"\nSIGAR said \"many corruption cases [are] languishing due to the lack of political will—rather than capacity—of the Afghan government.\"\nCongress created SIGAR for the purpose of providing independent and objective oversight of reconstruction projects and activities in Afghanistan. This is its 40th quarterly report.\nInspector General John Sopko reported that the anti-corruption court established by Afghan President Ashraf Ghani in May 2016, the Anti-Corruption Justice Center (ACJC), is a point of concern. The report, citing the Justice Dept., says the ACJC \"has shown little ability to function as intended\" and \"more than 100 ACJC warrants remain outstanding.\"\nIndividuals ignore warrants, a situation \"so severe that it has undermined the fundamental legitimacy and authority of the ACJC,\" according to the report.\nThe report cited what it called the ACJC's failure to execute search and arrest warrants and to make arrests following the completion of investigations.\nAccording to SIGAR, the Justice Dept. also found,that the Afghan Ministry of Interior \"despite expressing willingness, has not helped the ACJC execute search and arrest warrants.\"\nThe report said since November 2015, when SIGAR began receiving \"district-control data,\" government \"control and influence over its districts\" has declined about 16 percent.\nHowever, for the first time since 2016, SIGAR reported the number of districts under insurgent control had declined. SIGAR says there are 56 districts under insurgent control (11) or influence (45), a decrease of three.\nAfghan National Security Forces have also taken a hit, only functioning at 89.3 percent of its goal strength and short-staffed by about 38,000 staff, the report states.\n\"Fraud, waste, and abuse cannot be tolerated. Corruption cannot be tolerated,\" Lt. Gen. Austin Miller, who will soon take command of U.S. forces in Afghanistan, said in a statement in the SIGAR report.\nSIGAR's next quarterly report will look into the Afghan government's direct response to efforts to stop corruption in the Afghanistan Compact - described by the U.S. embassy in Afghanistan as \"an Afghan-led initiative to demonstrate the government's commitment to creating a peaceful, stable and prosperous society.\"\n\"My staff and I remain committed to conducting the oversight necessary to identify waste, fraud and abuse; develop cases against individuals and companies engaged in criminal activity; and offer recommendations to improve the effectiveness of reconstruction,\" Sopko said in a statement.","url":"https://www.npr.org/2018/07/31/634265577/afghanistan-update-government-lawless-weak-and-dysfunctional"}
