{"authors":[],"date_download":"2018-10-22 20:43:16","date_modify":"2018-10-22 20:43:16","date_publish":"2014-05-03 11:36:16","description":"Rescuers armed with shovels rushed to help residents of Aabe Barik in Afghanistan but hopes of finding 2,000 missing residents alive were fading.","filename":"data/vaneerConsumption/AfghanVillageBecomesMassGraveHopeFadesFor2000InLandslide.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_18/417911/140503-afghanistan-landlside-mn-805_6eef73ab15b8d410eb44a9aaa450df5b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_afghan-village-becomes-mass-grave-hope-fades-2-000-landslide-n96231_1540240996.html","title":"Afghan Village Becomes Mass Grave: Hope Fades For 2,000 In Landslide","title_page":"Afghan Village Becomes Mass Grave: Hope Fades For 2,000 In Landslide","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nKABUL - Hope of rescuing any of the estimated 2,000 villagers missing underneath a massive landslide in Afghanistan “has now disappeared,” a senior United Nations official said Saturday.\nRescuers and volunteers armed with shovels rushed to help residents of Aabe Barik, in the Argun district of the mountainous Badahkshan province, after heavy rains triggered a slide that submerged one third of all the homes there Friday.\nOnly 15 bodies have been recovered so far, the province’s deputy governor Mohammad Baidar told NBC News.\nHe said the village was buried under piles of rubble and government officials were talking to local people about whether to abandon the rescue effort and declare the scene a mass grave.\nFigures on the number of victims vary dramatically. The U.N. says at least 350 people were killed, but province governor Shah Waliullah Adeeb earlier said the toll could be 2,000 or higher.\nMark Bowden, the U.N. Secretary-General’s Deputy Special Representative for Afghanistan, told Al Jazeera that it was too early to issue a definitive death toll in the disaster but added that hope of rescuing the missing villagers “has now disappeared.”\nBaidar said aid supplies have reached the area and tents are being set up for survivors who have been evacuated to higher valleys, but limited progress has been made digging through the mud using machinery.\nFriday's damage was actually caused by two landslides from the hilly terrain, said Abdullah Homayun Dehqan, director of Badakshan province's National Disaster Department. The first, smaller one covered a few houses. When people rushed in to help, a second, bigger landslide came down, burying the rescuers and more houses, he said.\nAnother official with the authority, Ahmad Khan Nafeh, said initial reports suggest that 120 houses had been buried under the mud. Speaking on Afghan television, he said he did not have any information on the number killed or missing but said it was unlikely that anyone buried underneath would be found alive.\n\"I don't think any human who would have been buried under all that mud for more than 12 hours or so, would have been alive,\" he said.\nThe Associated Press contributed to this report. Alastair Jamieson reported from London.","url":"https://www.nbcnews.com/news/world/afghan-village-becomes-mass-grave-hope-fades-2-000-landslide-n96231"}
