{"authors":["Edwin Mora"],"date_download":"2018-10-30 21:00:39","date_modify":"2018-10-30 21:00:39","date_publish":"2015-07-30 23:30:04","description":"Watchdog: Afghan Forces Worse Fighters than They Were Six Months Ago","filename":"data/vaneerConsumption/AfghanForcesWorseFightersthanTheyWereSixMonthsAgo.json","image_url":"https://media.breitbart.com/media/2015/07/Afghan-Forces-AP-PhotoRahmat-Gul.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_30__1540933239.html","title":"Afghan Forces Worse Fighters than They Were Six Months Ago","title_page":"Afghan Forces Worse Fighters than They Were Six Months Ago","title_rss":"NULL","source_domain":"breitbart.com","text":"The Afghan national police and army forces are experiencing a decrease in their capability to fight the Taliban less than a year after they took the lead of combat operations from the U.S. military, reports a watchdog agency appointed by Congress.\nA capable and self-sustaining Afghan National Defense and Security Force (ANDSF), which includes units from the Afghan National Army (ANA) and the Afghan National Police (ANP), is vital to preventing Afghanistan from once again becoming a safe haven for terrorists who can launch attacks against the U.S. and destabilize the region.\nAfghan soldiers and police officers have been victims of a recent surge in Taliban attacks. They, along with civilians, have suffered a record number of casualties at the hands of Taliban terrorists.\nOver the last 14 years, the U.S. Congress has appropriated more than $65 billion to develop the Afghan national security forces, notes Special Inspector General for Afghanistan Reconstruction (SIGAR) John Sopko in SIGAR’s most recent quarterly report to Congress, which summarizes the agency’s oversight efforts carried out from April 1 thru June 30 of this year.\nNevertheless, of the ANP components evaluated by Afghanistan’s Monthly ANDSF Assessment Reports (MAAR), only two were ranked at the highest capability level in April, down from 7 in January, says SIGAR in the report.\nNot one Afghan army unit ranked by the MAAR assessments has obtained the highest capability rating since the United States declared an end to its combat mission in Afghanistan at the end of 2014.\nMAAR is just the latest scheme used to measure the readiness and capabilities of the Afghan forces. The U.S. military capability metric has been changed four times in the last 10 years. Afghanistan is now in charge of gauging its own military’s ability to fight terrorism.\nThe MAAR assessment ratings, in ascending order, are: not rated, in development, partially capable, capable, fully capable, and sustaining.\nBased on its analysis, SIGAR concluded that the Afghan national security forces were ranked as “less capable” than last quarter (January 1 to March 31, 2015). Reports SIGAR:\nSIGAR analysis of the April ANA [Afghan National Army] assessment, which now includes the ANF [Afghan Air Force], determined the percentage of the units as either capable or fully capable in 83.3% of the categories, down from 97.6% in January. No unit obtained the highest rating of sustaining in any category in either the April or January 2015 MAAR. This quarter, the ANA was assessed as less capable in every category except for executing combined arms, in which they held steady. SIGAR analysis of the ANP [Afghan National Police] MAAR, which includes only the AUP [Afghan Uniformed Police] and the ABP [Afghan Border Police], determined the percentage of the categories in which the units were assessed as capable, fully capable, or sustaining as 86.9%, down from 91.7% in January. No capability assessment was reported for eight of the 84 ANP categories which could, in part, account for the decrease.\nCapability assessment data is only publicly available for the highest level of the Afghan military command—corps and provincial headquarters. The capability evaluations of the units commanded by the corps and provincial headquarters is classified.\nU.S. Forces-Afghanistan (USFOR-A) “reports the decrease in capability ratings are largely attributable to the stresses imposed on ANDSF units at the beginning of the 2015 fighting season, in particular with command and control and the coordination of joint-force operations,” notes SIGAR. “DOD also cited fighting-season stresses, noted that Afghans now have the lead in combat operations, and questioned whether, given the recent addition of the AAF to the MAAR, an overall capability decrease had actually occurred.”\nHowever, SIGAR notes, the Afghan security forces began the process of assuming the lead of security operations in July 2011.\n“Halfway through their first fighting season without U.S. combat support, the Afghan National Defense and Security Forces (ANDSF) managed to hold all provincial capitals, but took increased casualties and found themselves stretched thin,” reports SIGAR. “Meanwhile, the Taliban is increasingly fractured, with some commanders claiming allegiance to the Islamic State in Iraq and the Levant (ISIL).”","url":"https://www.breitbart.com/national-security/2015/07/30/watchdog-afghan-forces-worse-fighters-than-they-were-six-months-ago/"}
