{"authors":["Edwin Mora"],"date_download":"2018-10-30 18:55:13","date_modify":"2018-10-30 18:55:13","date_publish":"2018-07-12 13:55:08","description":"Afghanistan is banning “invasive and medically meaningless vaginal and anal exams” on women and girls to see if they are virgins.","filename":"data/vaneerConsumption/AfghanistanVowsEndtoUsingVirginityExamstoArrestGirlsandWomen.json","image_url":"https://media.breitbart.com/media/2016/09/GettyImages-1162762.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_07_12__1540925713.html","title":"Afghanistan Vows End to Using 'Virginity Exams' to Arrest Girls and Women","title_page":"Afghanistan Vows End to Using 'Virginity Exams' to Arrest Girls and Women","title_rss":"NULL","source_domain":"breitbart.com","text":"A new measure unveiled in Afghanistan in July to prohibit government health personnel from performing “invasive and medically meaningless vaginal and anal exams” on women and girls to ascertain whether they are “virgins” is a step in the right direction to protect women’s rights, Human Rights Watch (HRW) said this week in a statement welcoming the policy.\nThe World Health Organization (WHO) has condemned the policy “as degrading, discriminatory and unscientific,” the Guardian acknowledged on July 5 as it announced the change of the virginity test policy long used in Afghanistan to determine whether a woman has committed adultery or had sex before marriage.\nWomen and girls who fail the virginity test are sent to prison, for more than a year at times, the Guardian added, noting, “When they are eventually released, they face a future defined by shame, exclusion and destitution.”\nHundreds of women and girls are currently imprisoned across Afghanistan for failing the virginity test. It is unclear whether or not they will be freed in the wake of the policy change.\nLaw enforcement has reportedly ignored Afghan President Ashraf Ghani’s 2016 ban on virginity testing and continued to arrest females impelled to undergo the exam over suspicions of having sex.\nHRW notes:\n“Virginity examinations” are a routine part of criminal proceedings in Afghanistan. When women or girls are accused of “moral crimes” such as sex outside of marriage, police, prosecutors, and judges regularly send them to government doctors. After examining them, the doctors submit reports reaching conclusions about whether they are “virgins,” also often drawing more detailed – and often damning – conclusions about their sexual histories. These reports are used in court as evidence and have led to long prison terms for many women. These examinations are invasive, humiliating, conducted without meaningful – or sometimes any – consent, and can constitute sexual assault. There is also another problem: they are scientifically invalid.\nMany doctors have mistakenly deemed women and girls not to be virgins. HRW urged Kabul to mandate compliance to the test ban by health workers and to prohibit the authorities from using the exams as evidence.\n“The government should decriminalize consensual sex between adults and ensure that the justice system distinguishes between consensual sex and rape,” the human rights group declares. “Too often in Afghanistan, rape victims are treated as criminals.”\nOn July 5, the Guardian revealed that just one Afghan prison in Balkh province was holding “more than 200 girls and young women” convicted of failing a virginity test.","url":"https://www.breitbart.com/national-security/2018/07/12/afghanistan-vows-end-to-using-virginity-exams-to-arrest-girls-and-women/"}
