{"authors":[],"date_download":"2018-10-22 20:45:53","date_modify":"2018-10-22 20:45:53","date_publish":"2014-05-03 15:18:28","description":"A survivor of the disastrous landslide that buried a village in Afghanistan told Saturday that the rock movement sounded like “a huge explosion.”","filename":"data/vaneerConsumption/AfghanLandslideSurvivorSaysSecondSlipBuriedHelpers.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_18/418161/140503-afghanistan-landslide-mn-1150_27bbc1ff81e5c53134ef319f7566a463.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_afghan-landslide-survivor-says-second-slip-buried-helpers-n96286_1540241153.html","title":"Afghan Landslide Survivor Says Second Slip Buried Helpers","title_page":"Afghan Landslide Survivor Says Second Slip Buried Helpers","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nKABUL - A survivor of the disastrous landslide that buried a village in Afghanistan told Saturday that the rock movement sounded like “a huge explosion.”\nHaji Faizullah said he was in the doomed village of Aabe Barik to attend a wedding along with about 500 other guests when more than one third of the homes were buried.\n“It is the most frightening thing I have ever seen,” he told NBC News by telephone from the scene. “I am still in shock.”\nRescuers and volunteers armed with shovels were picking through the mud but hope of rescuing any of the estimated 2,000 villagers missing “has now disappeared,” a senior U.N. official said.\nFazullah said the Friday’s landslip happened as he was preparing for lunch at around 11 a.m. local time (2.30 a.m. ET) ahead of the wedding.\n“We heard the sound of a huge explosion that shook everything very badly,” he said. “I was thrown off my feet. Then I realized a part of the mountain had slid down.”\n“I was thrown aside and managed to run up the hills. People from nearby homes rushed to the scene to help – and within 15 minutes another part of the hill slid onto the same part of the village, burying all those who had come to help.”\nOnly 15 bodies have been recovered so far, the province’s deputy governor Mohammad Baidar told NBC News.\nFazul Rahim","url":"https://www.nbcnews.com/news/world/afghan-landslide-survivor-says-second-slip-buried-helpers-n96286"}
