{"authors":[],"date_download":"2018-10-23 02:33:56","date_modify":"2018-10-23 02:33:56","date_publish":"2017-04-26 13:41:31","description":"Authorities have arrested 35 soldiers who served on an army base in northern Afghanistan where the Taliban staged a deadly attack last week, officials said...","filename":"data/vaneerConsumption/Afghanistanarrests35soldiersafterattackonbase.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/13/wire-465205-1493210493-186_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4447652_Afghanistan-arrests-35-soldiers-attack-base_1540262036.html","title":"Afghanistan arrests 35 soldiers after attack on base","title_page":"Afghanistan arrests 35 soldiers after attack on base | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Afghan resident Ahmadullah poses for a photograph on April 24, 2017 with a picture of his brother Shir Mohammad, a soldier killed in a Taliban attack on an army base on the outskirts of Mazar-i- Sharif\nAuthorities have arrested 35 soldiers who served on an army base in northern Afghanistan where the Taliban staged a deadly attack last week, officials said Wednesday, as fears grew they had inside help.\nThe defence ministry released its official toll of 135 recruits killed in the assault on the sprawling base, home to the 209th Army Corps, outside the city of Mazar-i-Sharif in Balkh province on Friday.\nGunmen in military trucks and wearing suicide vests stormed the base, killing unarmed young recruits as they ate lunch in the dining hall and prayed in the mosque.\nThe brutal assault is believed to be the deadliest-ever Taliban attack on a military installation.\nThe death toll has been unclear, with Afghan officials -- who have been known to minimise casualties in previous attacks -- ignoring earlier calls for exact figures.\nA senior US defence official has told AFP at least 144 people were killed, while some sources on the base have placed the toll as high as 160.\nThe gunmen were dressed in army uniforms, multiple sources have told AFP, fuelling suspicions of complicity on the 30,000-strong base, where Western instructors are sometimes called on as part of NATO's training, assistance and advisory mission.\nThey also carried valid passes to the base, a senior security source has told AFP.\n\"So far 35 people have been detained and are being questioned in connection with the attack,\" said 209th Corps spokesman Abdul Qahar Aram, adding that they ranked from foot soldiers to colonel.\nSo-called insider attacks -- when Afghan soldiers and police turn their guns on their colleagues or on international troops -- have been a major problem during the war which began in 2001.\nAnalyst and university professor Abdul Hamid Safoot said Friday's assault had highlighted multiple systematic flaws among Afghan forces, ranging from a lack of vetting to inadequate intelligence sharing.\n\"(The) Taliban know these weaknesses, they have people in the government,\" Safoot said.\n\"After the insider attacks on the NATO trainers increased, the foreign mentors no longer allow Afghan soldiers to carry arms during training,\" he added.\nThe recruits in the mosque and the dining hall were unarmed -- a fact which the security source said was known to the militants. He said at least four of the attackers had served at the base.\nThe assault has prompted widespread anger, with the defence minister and his army chief resigning Monday, leaving troops and police in disarray as the Taliban gear up for their spring offensive.\nAfghan forces, already beset by killings and desertions, have been struggling to beat back insurgents since US-led NATO troops ended their combat mission in December 2014.\nTheir casualties soared by 35 percent in 2016, with 6,800 soldiers and police killed, according to US watchdog SIGAR.","url":"https://www.dailymail.co.uk/wires/afp/article-4447652/Afghanistan-arrests-35-soldiers-attack-base.html"}
