{"authors":["Liam Deacon"],"date_download":"2018-10-30 20:34:21","date_modify":"2018-10-30 20:34:21","date_publish":"2015-11-13 15:09:16","description":"An Afghan migrant has killed a father of two, also from Afghanistan, because he considered singing a sin in Islam.","filename":"data/vaneerConsumption/AfghanMigrantStabbedMusicianToDeathBecauseHeWasSingingToHisWife.json","image_url":"https://media.breitbart.com/media/2015/11/Screen-Shot-2015-11-13-at-14.57.21.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_11_13__1540931661.html","title":"Afghan Migrant Stabbed Musician To Death Because He Was Singing To His Wife","title_page":"Afghan Migrant Stabbed Musician To Death Because He Was Singing To His Wife","title_rss":"NULL","source_domain":"breitbart.com","text":"An Afghan migrant has killed a father of two, also from Afghanistan, because he considered singing a sin in Islam. The victim’s wife tragically noted they had “fled here from these religious fanatics”, only to find them in Europe too.\nThe murderous 17-year-old came to Austria as a refugee in 2013. He has now been sentenced to 12 years in prison for repeatedly stabbing his fellow countryman over a religious matter.\nThe killer met his older victim, a 31-year-old musician, when they were both attending a German language course in March.\nThe teen took issue with the musician’s penchant for singing and playing music. He told him he did not want to listen to music because he considered it “haram” and against the teachings of Islam, instructing the older man to desist.\nThe older man, presumably of a more liberal disposition, is reported to have responded badly to the boy instructing him how to practice his religion. He is said to have mocked the boy and even insulted his parents, the Local reports.\nA fight broke out, but the language tutor managed to break it up. However, attending the next lesson a few days later, the boy returned with two knives.\nHe went for the musician as he sung to his wife down the phone, the spouse told the court. He was stabbed seven times, fatally in both the lung and stomach.\nIn his statement to the police, the teenager said: “I can just deal with the insult to my parents, but religion is very important to me.”\nThe victim’s wife told the court that the family had “fled here from these religious fanatics.”\nIn his summary to the court, judge Norbert Gerstberger confirmed that the boy had ambushed the victim in a surprise attack, and felt the need to explain that Austria does not tolerate murders according to religious zeal.\n“This is unacceptable in our society,” he said, before sentencing the teenager to 12 years in prison.\nAustria, which sits on the so-called Balkans route into northern Europe, has received 54,400 Asylum applications between January and October this year – up from 18,111 over the same period last year.\nThe nation is now considering building “technical barriers” along its border with Slovenia, with Interior Minister Johanna Mikl-Leitner saying a fence may be needed to maintain public order.","url":"https://www.breitbart.com/europe/2015/11/13/afghan-migrant-stabbed-musician-death-singing-wife/"}
