{"authors":["Joseph D. Lyons"],"date_download":"2018-10-31 00:02:20","date_modify":"2018-10-31 00:02:20","date_publish":"2018-10-28 16:32:48","description":"Politicians and faith leaders have condemned the Pittsburgh synagogue shooting since 11 were killed on Saturday— and now one of the former rabbis for the affected community has spoken out specifically on the inaction of elected leaders on gun…","filename":"data/vaneerConsumption/AFormerTreeofLifeRabbiAskedElectedOfficialsOnBothSidesToDoSomethingSignificant.json","image_url":"https://imgix.bustle.com/uploads/image/2018/10/28/cb629691-3d1d-43d4-b6f4-c30f66875bcf-screen-shot-2018-10-28-at-122817-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_a-former-tree-of-life-rabbi-asked-elected-officials-on-both-sides-to-do-something-significant-13010051_1540944140.html","title":"A Former Tree of Life Rabbi Asked Elected Officials On Both Sides To \"Do Something Significant\"","title_page":"A Former Tree of Life Rabbi Asked Elected Officials On Both Sides To \"Do Something Significant\"","title_rss":"NULL","source_domain":"bustle.com","text":"Politicians and faith leaders have condemned the Pittsburgh synagogue shooting since 11 were killed on Saturday— and now one of the former rabbis for the affected community has spoken out specifically on the inaction of elected leaders on gun safety. The former Tree of Life synagogue rabbi called on \"both sides\" to \"do something significant\" about reducing gun violence.\nRabbi Chuck Diamond, who served the community for seven years, called for action on both gun control and mental health services, NBC News reported.\n\"I wish the politicians on both sides of the aisle would get off their rear ends and do something significant about it,\" Diamond said. \"That’s what’s frustrating.\"\nDiamond also criticized the typical response of political leaders. \"What are the prayers going to do at this point? We need to take action whatever that might be,\" he said.\nOn Sunday morning authorities released the names of the 11 who were killed. Most of the victims were older members of the community and included a married couple, two brothers, and a 97-year-old woman. More details are pending, but investigators are certain that anti-Semitic hatred motivated the shooter, who screamed, \"All Jews to die!\" at the responding SWAT team.\nGlobal News on YouTube\nThat kind of violence didn't surprise Diamond. \"I’m always thinking as I was up there leading services what if that guy looks suspicious, what’s he got under his coat,” the rabbi said. “Unfortunately, I think that’s the world we live in.”\nThere have also been reports of the current rabbi's views on gun safety, which he described in his blog following a mass shooting earlier this year. Rabbi Jeffrey Meyers wrote in his blog that elected leaders were ignoring calls for action:\nDespite continuous calls for sensible gun control and mental health care, our elected leaders in Washington knew that it would fade away in time. Unless there is a dramatic turnaround in the mid-term elections, I fear that that the status quo will remain unchanged, and school shootings will resume. I shouldn’t have to include in my daily morning prayers that God should watch over my wife and daughter, both teachers, and keep them safe. Where are our leaders?\nPittsburgh Mayor Bill Peduto has called for increased gun safety measures after the attack. \"I don’t think the answer to this problem is having our synagogues, mosques, and churches filled with armed guards, or schools filled with armed guards,\" Peduto said on NBC's Meet The Press Sunday, contradicting Trump's comments that armed guards at the synagogue could have prevented the violence.\n\"I think the approach that we need to be looking at is how we take the guns, which is the common denominator of every mass shooting in America, out of the hands of those that are looking to express hatred through murder,\" he said.\nFormer Rabbi Diamond added, per NBC news, that he thought the community would come together in response. \"Everybody feels like they were attacked in that synagogue,” the rabbi said. \"The community will come together, we're very strong.\"\nOnline, many people are already coming together to support the community, with several crowdfunding sites up and taking donations. One GoFundMe has already raised $350,000 as of Sunday morning.","url":"https://www.bustle.com/p/a-former-tree-of-life-rabbi-asked-elected-officials-on-both-sides-to-do-something-significant-13010051"}
