{"authors":["Molly Solomon"],"date_download":"2018-10-23 05:19:21","date_modify":"2018-10-23 05:19:21","date_publish":"2017-03-30 00:00:00","description":"The sunken Hero, an Antarctic research vessel from the 1960s, is leaking oil into Willapa Bay, where more than half of the state's oysters are grown. And no one knows how to remove it.","filename":"data/vaneerConsumption/AForgottenShipwreckImperilsWashingtonsOysters.json","image_url":"https://media.npr.org/assets/img/2017/03/27/20170327_willapa-bay-sink_ms-2_wide-cd7f728512424ec165e801db661e991eeb89da68.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thesalt_2017_03_30_521666711_a-forgotten-shipwreck-imperils-washingtons-oysters_1540271961.html","title":"A Forgotten Shipwreck Imperils Washington's Oysters","title_page":"A Forgotten Shipwreck Imperils Washington's Oysters : The Salt : NPR","title_rss":"NULL","source_domain":"npr.org","text":"A Forgotten Shipwreck Imperils Washington's Oysters\nEnlarge this image toggle caption Molly Solomon/Oregon Public Broadcasting Molly Solomon/Oregon Public Broadcasting\nDriving up the coast toward Bay Center, Wash., it's obvious when you start to approach Willapa Bay. Fifteen-foot high piles of empty shells begin to appear on the side of the road. This is an oyster town.\nBut it's also home to a sinking piece of history.\nScott McDougall, director of the Pacific County Emergency Management Agency, points out what remains of the Hero, an Antarctic research vessel from the 1960s. The ship, which had been docked near Willapa Bay for a decade, sank on March 4 — McDougall was the first person to file a report. While walking across the street to the Palix River, he points out one of many inlets and waterways that feed into the bay.\n\"That's one of the beauties of Willapa Bay,\" McDougall explains. \"There's all sorts of streams and tributaries that feed into it, and there's a good strong tidal inflow and outflow. This is one of the most pristine bays on the West Coast. And we have a lot of pride in that.\"\nThat sense of pride has been jolted by an oil sheen floating on the water's surface. The Hero's faded green wooden bow, now covered in rust, peeks out of the water. By high tide, most of it will be underwater.\ntoggle caption Miguel L. Brand-Wiener/Courtesy of PalmerStation.com\nThat oil flowing from the wreckage is a huge concern for people that live and work here. Willapa Bay is where more than half of the state's oysters are grown.\n\"It has an adverse effect on the bay, it has an adverse effect potentially on their pocketbooks,\" McDougall says of the ship. \"It has some fairly significant ramifications.\"\nIn its prime, the Hero sailed through frigid temperatures and ice-strewn waters in the South Pole. According to a 1968 article in the Antarctic Journal, the ship was named after the sloop of 20-year-old Nathaniel Palmer, a seal hunter who is credited as the first person to sight Antarctica. Throughout the late 1960s and '70s, the boat carried scientists to and from Palmer Station, a research center on Antarctica's Anvers Island.\nAfter the National Science Foundation retired the floating laboratory in 1984, a group of maritime enthusiasts purchased the Hero and created a foundation with hopes of restoring the vessel. But they failed to raise enough money and the Hero was sold to a private owner, who docked it in a river near Willapa Bay. For 10 years the Hero sat there, with little or no maintenance, before finally sinking earlier this month.\n\"This is a vessel with an amazing amount of history,\" McDougall says. \"Just on a personal note, it makes me really sad to see what was once a beautiful vessel that was dedicated to promoting good ecology and good stewardship of the environment, to see it resting on the bottom and dying the death that it's dying.\"\nGlobal Diving and Salvage, a Seattle-based company contracted by the state of Washington, has been helping with daily cleanup. Workers are using booms in the water and absorbent pads to soak up the materials. So far, they've removed about 1,000 gallons of oily water and more than 60 gallons of diesel fuel and petroleum.\n\"We're taking water samples and pictures every day and we're changing out the absorbents as we see fit,\" says Shawn Zaniewski, a spill responder with the Washington state Department of Ecology. \"This is a very old vessel. There could be small containers of oil on board. As the tide goes up and down, it's going to continue to sheen like that until that stuff washes out.\"\n\"When you have a vessel this old and made of wood, all of the surfaces of the area are impregnated with oil,\" adds McDougall. \"So, as long as the vessel is in the water, there's going to be a sheen that comes off of it.\"\nNobody knows that more than Dick Wilson, one of Bay Center's 276 residents. He moved to the area from Oregon in 1971 and has been farming oysters for more than 40 years. His business, Bay Center Mariculture, owns about 1,000 acres in the bay. His processing plant and storefront are just down the road, about 800 feet from the sinking Hero.\n\"It's something that shouldn't have happened,\" says Wilson, who drove down the hill from his house to check on the progress on the cleanup. \"An incident like this is probably rather typical in a lot of places. But for here, it's abhorrent. We don't want it and it's something we just don't need in the bay.\"\nWilson and other local residents have been warning the state about the poor conditions of the Hero since it first arrived nearly a decade ago. The Department of Ecology is still investigating who owns the wreck — and who is liable for the environmental damage it's causing.\nEnlarge this image toggle caption Washington Department of Ecology Washington Department of Ecology\n\"You can't have a wooden boat and have it sit here for 10 years and not have it go to pot and leak,\" says Wilson. \"That's just what they do.\"\nFor now, the future of how to remove the boat lies with the Washington state Department of Natural Resources.\n\"The department is researching ways to remove and dispose of the vessel, but every avenue we go down, there seems to be roadblocks,\" says Troy Wood, manager of the state's Department of Natural Resource's Derelict Vessel Removal Program.\nAccording to Wood, the Hero's situation is unique. The 125-foot vessel is too large to carry down the river. He estimates lifting it out of the water would require the construction of two large land cranes on site. The cost of those cranes would greatly exceed the DNR's current budget.\nWith only $130,000 left in the biennium budget, a full-scale removal seems unlikely and unaffordable. Estimates on the cost of that project range from $750,000 to $1,000,000.\nSince the program began in 2003, the Derelict Vessel Removal Program has removed almost 670 abandoned boats and ships.\nThis story comes to us from Oregon Public Broadcasting.","url":"https://www.npr.org/sections/thesalt/2017/03/30/521666711/a-forgotten-shipwreck-imperils-washingtons-oysters"}
