{"authors":["Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:08:51","date_modify":"2018-10-31 00:08:51","date_publish":"2016-09-01 08:00:41","description":"This event is Sold Out We invite you to watch the panel discussion live here: WHEN: Wednesday, September 14, 2016 from 6:00 PM to 8:30 PM (PDT) WHERE:","filename":"data/vaneerConsumption/AforAccountabilityEventAReportCardonCAsNewPublicSchoolAssessments.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/AccountabilityCover-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944531.html","title":"A for Accountability Event: A Report Card on CA's New Public-School Assessments","title_page":"A for Accountability Event: A Report Card on CA's New Public-School Assessments | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"This event is Sold Out\nWe invite you to watch the panel discussion live here:\nWHEN: Wednesday, September 14, 2016 from 6:00 PM to 8:30 PM (PDT)\nWHERE: Long Beach State University – 1250 Bellflower Boulevard Beach Auditorium (Parking in lot #3), Long Beach, CA 90840\nCALmatters, Long Beach State University & Southern California News Group invite you to attend an exciting panel discussion “A for Accountability: A Report Card on California’s New Public-School Assessments.”\nThe California State Board of Education is in the process of overhauling its system for evaluating public school performance to include much more than just test scores. Propelled by a new federal law, factors such as graduation rates and how fast English learners gain proficiency will line up along side old-school measurements such as Math and English test results to shape the new “report cards.”\nCome hear the experts offer up their assessment of this new system. Judy Lin, of CALmatters, will moderate this in-depth conversation; California State University Long Beach President Jane Close Conoley will give welcoming remarks; and speakers include former Los Angeles Mayor Antonio Villaraigosa; Assemblymember and Chair of the Assembly Education Committee, Patrick O’Donnell; Assistant Vice Chancellor of Teacher Education & Public School Programs, California State University, Office of the Chancellor, Marquita Grenot-Scheyer; and Dr. Carl A. Cohn, Executive Director, California Collaborative for Educational Excellence. Additionally, CALmatters Editor and CEO, Dave Lesher, Southern California News Group Managing Editor/Content, Tom Bray, and Southern California News Group education reporter, Beau Yarbrough, will be on hand to provide insight.","url":"https://calmatters.org/articles/a-for-accountability-event-a-report-card-on-cas-new-public-school-assessments/"}
