{"authors":["Edwin Mora"],"date_download":"2018-10-30 17:54:35","date_modify":"2018-10-30 17:54:35","date_publish":"2016-01-14 14:58:41","description":"The Arab Spring revolution that spread to various countries after it started in January 2011 has a been a failure, reports Agence France-Presse (AFP).","filename":"data/vaneerConsumption/AFPDeclaresArabSpringaFailure.json","image_url":"https://media.breitbart.com/media/2016/01/Arab-spring-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_01_14__1540922075.html","title":"AFP Declares Arab Spring a Failure","title_page":"AFP Declares Arab Spring a Failure | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Arab Spring revolution that spread to various countries after it started in January 2011, when Tunisians assembled in the streets of their capital and overthrew their longtime dictator Zine El Abidine Ben Ali, has a been a failure, reports Agence France-Presse (AFP).\n“The revolution shook the Middle East, setting off the hopeful uprisings that came to be known as the Arab Spring,” notes the report.\n“But five years later, the countries that followed Tunisia’s example could hardly be worse off, the hopes of their people dashed by new autocrats, strife, civil war and the rise of the virulent jihadism exemplified by the Islamic State [ISIS/ISIL] group,” it continues.\nHafez Ghanem, vice president of the World Bank for the Middle East and North Africa, reminisces about the revolution in a recent book he authored — The Arab Spring Five Years Later: Toward Greater Inclusiveness — about the revolution.\n“Those were exciting days. The democracy fever spread,” he wrote, adding, “But can a country with no democratic tradition and with weak institutions become a well-functioning democracy and improve the lives of its citizens overnight? The answer is obviously no.”\n“It is clear that the Arab transition has taken on a violent, and even scary character,” he also wrote, further stating, “The Arab Spring is not a season. It is a first and important step on the long road to a new political, social and economic order.”\nFew could have anticipated the wave of change to come weeks before Ben Ali stepped down after 23 years in power, notes AFP.\n“A month earlier a street vendor named Mohamed Bouazizi had set himself on fire in the town of Sidi Bouzid, triggering the mass protests that eventually brought Ben Ali down,” reports the French news agency. “Tunisia was not only the first Arab Spring country but also it’s only partial success story.”\nJihadist violence has been on the rise since Ben Ali was overthrown, with the most notable of incidents being the Tunisian Bardo museum attacks and the assault on the country’s Mediterranean resort that left at least 60 people dead, the majority of them foreign tourists.\nNevertheless, Tunisia has elected a new government and a group of four civil society organizations, dubbed the National Dialogue Quartet, received the Nobel Peace Prize in 2015 for helping to transition the country to democracy.\n“Elsewhere in the region, popular uprisings were less the beginnings of a new spring than preludes of harsh winters,” reports AFP.\n“In Egypt, the ouster of Hosni Mubarak was followed by turbulent unrest and eventually a military overthrow of his Islamist successor Mohamed Morsi, the country’s first civilian — and freely elected — president,” it continues. “Then-army chief Abdel Fattah al-Sisi took over and launched a harsh crackdown on Morsi’s supporters, leaving hundreds dead and thousands in prison.”\nEgypt’s restive Sinai Peninsula has been plagued by jihadist violence. An ISIS affiliate there has claimed responsibility for a number of deadly attacks, including the downing of a Russian passenger plane in October that killed all 224 people onboard.\n“In Libya, an uprising against longtime leader [Muammar Gaddafi] quickly became an armed revolution backed by NATO, and his overthrow and killing in 2011 have been followed by continued strife and political chaos,” points out AFP. “Rival parliaments and governments are vying for power and UN efforts to bring about a unity government have so far failed.”\n“[ISIS] jihadists have gained an important foothold in [Gaddafi’s] hometown Sirte and launched attacks, last week killing more than 50 people in a bombing at a police school in Zliten, the worst incident since the revolution,” it adds.\nYemen has been afflicted by insecurity since longtime president Ali Abdullah Saleh was forced to step down by protesters. War broke out after Iran-allied Shiite Houthi rebels forced his successor Abedrabbo Mansour Hadi to flee to Saudi Arabia.\n“Saudi Arabia launched a military intervention last March to support Hadi’s government but there are few signs, despite UN peace efforts, of a war that has killed more than 6,000 people coming to an end,” reports AFP.\n“Shiite protesters inspired by the Arab Spring also launched demonstrations against their Sunni rulers in Bahrain but were put down a month later. Sporadic unrest has continued,” it adds.\nThe Arab Spring in Syria has also been a major failure.\n“Nowhere were the aspirations of the Arab Spring more disappointing than in Syria, where peaceful protests against President Bashar al-Assad evolved into a brutal civil war that has left more than 260,000 dead and forced millions from their homes,” declares AFP.\n“After nearly five years of war Syria is in ruins, its people scattered, many of them turned desperate refugees hoping to reach Europe,” it adds. “Much of the country has been taken over by [ISIS], which has declared a ‘caliphate’ in areas under its control in Syria and neighboring Iraq, committing widespread atrocities as it imposes its harsh interpretation of Islam.”","url":"https://www.breitbart.com/national-security/2016/01/14/afp-declares-arab-spring-a-failure/"}
