{"authors":[],"date_download":"2018-10-22 21:44:49","date_modify":"2018-10-22 21:44:49","date_publish":"2016-11-16 00:00:00","description":"David Greene talks to pastor Darrell Scott, who backed Trump in the election. Scott's views drew criticism from other African-American leaders, but he's excited for what this presidency may bring.","filename":"data/vaneerConsumption/AfricanAmericanTrumpSupporterCelebratesElectionResult.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=502274776_1540244689.html","title":"African-American Trump Supporter Celebrates Election Result","title_page":"African-American Trump Supporter Celebrates Election Result : NPR","title_rss":"NULL","source_domain":"npr.org","text":"DAVID GREENE, HOST:\nLet's hear from a man who was one of Donald Trump's earliest and most fervent supporters. His name is Darrell Scott. He's a pastor from Cleveland who has known Trump for several years. Scott's words and views have drawn criticism from other African-American leaders during the presidential campaign. But he has been celebrating Trump's election victory, and he's excited for what this presidency will bring. Pastor Darrell Scott joined us over Skype. Give me the top one or two ideas, policies, that will be most important to you for a President Trump to get enacted.\nDARRELL SCOTT: That's going to be hard to do, I mean, because it depends on which lens you're looking out of. I mean, from the perspective of a black man, I want to see the inner cities revitalized and redeveloped. And, you know, he's offering tax incentives for minority businesses to locate or relocate in the inner city - not only minority businesses but businesses in general - to stimulate the economy of the inner city. So I'm excited about some of the things he's going to do, you know, as far as the African-American community is concerned.\nGREENE: The Democratic Party would argue that they have stood by people in the inner cities for many years, I mean, back to President Bill Clinton and before that. Was - was there a time that you believed in that party helping the inner cities? And was there a moment that you can look to when they really lost you and you decided that that's not the party that can help?\nSCOTT: They pimped the inner cities. They stood next to the inner cities just like a pimp stands next to a prostitute. They pimped us out. They got monies, and they fiddled while Rome burned. And the very few would profit from the disenfranchisement of the inner city. They would enact different programs, and a lot of politicians padded their pockets while the community itself suffered. So no, they never did a good job with the inner city.\nMost of the businesses that are owned in the city, inner city, are not owned by the residents of the inner city. There are other ethnic groups come into the inner cities and own the stores and own the businesses. And they profit from - they take from the inner city, but they don't give to the inner city. And so no, they never - we never profited by them.\nGREENE: You feel Donald Trump is going to be helping to rebuild and helping communities like yours in Cleveland.\nSCOTT: You have to understand, he looks through the eyes of a developer. He looks through the eyes of a builder. He sees these depressed conditions of the inner cities, and he looks at them as projects that he believes he can turn around. Looking at these cities, he says, hey, I can fix that. I can renovate that. I can - I can rehab that. I can do something with that.\nGREENE: Pastor Scott, Donald Trump has selected a man named Stephen Bannon to be his chief strategist in the White House. He's the former chair of the publication Breitbart News. You know, it's seen as a far-right publication. It's described by many as white nationalist. Does that bother you, to have someone potentially with ties to white nationalism that close to the president and inside the White House?\nSCOTT: I know Steve Bannon. Steve Bannon is a good guy. I consider him as a friend. We've had many conversations, many meaningful conversations. And I have no problem with it.\nGREENE: If you know him, help us understand some of these headlines that his news organization ran - I mean, suggesting that Bill Kristol, the conservative commentator is a, quote, \"renegade Jew,\" I mean, headlines about the president, Obama, bringing in more hating Muslims. I mean, why would he lead a news organization that would use such headlines if you say that, you know, he's a good guy you're comfortable with?\nSCOTT: Actually, the columnist that wrote that story on Bill Kristol was Jewish. Steve Bannon didn't write the article. And so...\nGREENE: But he's still chairman of the news organization at that point. I mean, doesn't he stand by what the...\nSCOTT: Let me tell you something. I don't try to think for Steve Bannon. I can only judge the man based upon my interactions with him and the conversations I've had with him. I don't think he's a racist. He served in the United States military. He's a very educated and very intelligent man. And I don't think he would stoop to racism because I don't think he's that stupid, to be a racist.\nGREENE: What would you tell a member of your church who supported Hillary Clinton in this campaign and is on edge right now and nervous about Donald Trump?\nSCOTT: I don't have to tell my church that. They know Donald Trump is not a racist. Donald Trump has been in my church. And Donald Trump has been my friend for the last five or six years. So they know he's not a racist. They accept the outcome of the election. I made it clear from the very beginning that I would never try to impress my will upon you. I don't really talk about Donald Trump in my pulpit. I never made him a part of my Sunday morning sermons or anything like that. I mean, I had a few that got disgruntled and left the church. But, you know, that's a decision that they have to live with.\nGREENE: What - why did they leave the church?\nSCOTT: I guess for political reasons. I don't know. A lot of people, you know, they - they bought into the media portrayal of Donald Trump.\nGREENE: But they were believing those things and then not wanting to be in your church because they knew you were - you were close to him.\nSCOTT: You know, I had some people question, how can you be close to him. And I know he's not a xenophobe. I know he's not a misogynist. It's easy for me to defend him because I know him. Now, it's up to you whether you believe me or whether you believe the media.\nGREENE: Do you have a lot of work to do to win people over?\nSCOTT: No, I don't. I think Donald Trump is going to prove himself. He's like defending a caged lion. I don't have to defend the lion. I just open up the cage and let him out. He can defend himself. I'll tell you this much. In the next election, if he chooses to run four years from now, you're going to have a large number of African-Americans that support him because they will have seen that he's been an effective president for our community.\nGREENE: All right, Pastor Scott, always good to talk to you. Thanks so much for the time. We really appreciate it.\nSCOTT: You too. God bless you.\nGREENE: That was Pastor Darrell Scott in Cleveland, Ohio.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=502274776"}
