{"authors":["Euan Mclelland For Mailonline"],"date_download":"2018-10-23 02:04:10","date_modify":"2018-10-23 02:04:10","date_publish":"2016-01-28 16:50:31","description":"Walking along without a care in the world, the huge animal flaunts his red lips for the camera while grazing at a private game reserve near Kruger National Park in Johannesburg.","filename":"data/vaneerConsumption/Africanrhinoappearstopuckerupandblowakissforphotographer.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AC77B100000578-0-image-a-114_1453999870282.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421246_Pout-Africa-Rhino-appears-pucker-blow-kiss-photographer_1540260250.html","title":"African rhino appears to pucker up and blow a kiss for photographer","title_page":"African rhino appears to pucker up and blow a kiss for photographer  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This hilarious footage appears to show a notoriously feisty rare black rhino blowing a kiss for the camera.\nThe loveable rhino's bright red pout looks like it could have been painted on with lipstick, as he laps up the lens while out for a morning stroll.\nWalking along without a care in the world, the huge animal puckers up while grazing at a private game reserve near Kruger National Park in South Africa.\nHe was making the moves on photographer Sue Harwood, from Johannesburg, who was on a game drive with her husband and youngest daughter when they bumped into the flirty tonne-weight beast.\nShe said: 'It was an amazing experience.\n'We loved how he started smelling me, seemingly blowing kisses - I could actually smell him and could've touched him.\nThis hilarious footage appears to show a notoriously feisty rare black rhino blowing a kiss for the camera. The loveable rhino's bright red pout looks like it could have been painted on with lipstick, as he laps up the lens while out for a morning stroll\n'We were all totally relaxed, as was the rhino.'\nSue added: 'According to all the game rangers, this was extremely unusual behaviour as black rhinos have a reputation for being aggressive, flighty and elusive.\n'Not long ago we had a very similar encounter in the same area - a black rhino came right up to my husband's door and sniffed him for a while before running off.\nWalking along without a care in the world, the huge animals puckers up while grazing at a private game reserve near Kruger National Park in South Africa. He was making the moves on photographer Sue Harwood, from Johannesburg, who was on a game drive with her husband and youngest daughter\n'We think it's the same rhino as the ear notches are almost identical - he must like us!'\nBlack rhinos are very rare, with just over 5,000 left in the wild.\nThey were previously poached to near extinction.","url":"https://www.dailymail.co.uk/news/article-3421246/Pout-Africa-Rhino-appears-pucker-blow-kiss-photographer.html"}
