{"authors":[],"date_download":"2018-10-23 03:08:54","date_modify":"2018-10-23 03:08:54","date_publish":"2017-03-10 12:38:11","description":"In the beginning was .com, followed by a host of other .somethings, but on Friday, 32 years after the world's first domain name was registered, the African...","filename":"data/vaneerConsumption/africajoinstheinternet.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/12/wire-195955-1489149493-504_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4301136_africa-joins-internet_1540264134.html","title":".africa joins the internet","title_page":".africa joins the internet | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"With the launch of .africa, the continent has \"finally got its digital identity,\" AU officials say\nIn the beginning was .com, followed by a host of other .somethings, but on Friday, 32 years after the world's first domain name was registered, the African Union has launched .africa for the continent.\nAfricans who want to register a website will be able to apply for a .africa domain name in the coming months, which outgoing AU commission chair Nkosazana Dlamini-Zuma said would allow the continent's people and businesses to better reach the world.\n\"With .africa, I would say Africa has finally got its digital identity,\" said Dlamini-Zuma, who will next week hand power to Chadian Foreign Minister Moussa Faki Mahamat after four years at the helm of the continental body\nSub-Saharan Africa has one of the lowest rates of internet penetration in the world, according to the World Bank, with only around 22 percent of people online compared to the global average of 44 percent.\nThe AU has vowed to increase broadband internet penetration by 10 percent by next year as part of its 'Agenda 2063' development proposal.\nAs the continent's largest economy, South Africa dominates African presence online, holding 1.1 million of the two million website registrations on the continent, said Lucky Masilela, CEO of ZA Central Registry, the South Africa-based company that will administer .africa.\nHigh fees are an obstacle to many people who want to register a website, Masilela said.\nIn some African countries, it can cost as much as $250 (235 euro) but Masilela said .africa addresses will be available at a cut-price rate of just $18 to anyone on the continent.\n\".africa is going to be a market disruptor and will assist in lowering the cost of domain names,\" Masilela said.\nThe AU is hoping proceeds from the domain registrations will help cover some of its administrative costs and fund the AU commission.\nThe domain is due to be available to the public in July but it remains unclear how strong demand will be.","url":"https://www.dailymail.co.uk/wires/afp/article-4301136/africa-joins-internet.html"}
