{"authors":["Paddy Dinham For Mailonline"],"date_download":"2018-10-23 01:50:50","date_modify":"2018-10-23 01:50:50","date_publish":"2017-03-10 10:21:48","description":"The four-metre African rock python had recently swallowed a buck whole when it was found by transporter Jaco Kotze on his farm in Groblersdal, South Africa.","filename":"data/vaneerConsumption/Africanrockpythonregurgitatesanentiredeer.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E21CBE000000578-0-image-a-13_1489141303692.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300528_Africn-rock-python-regurgitates-entire-deer_1540259450.html","title":"African rock python regurgitates an entire deer","title_page":"African rock python regurgitates an entire deer | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A snake has been filmed regurgitating an entire deer after evidently biting off more than it can chew.\nThe four-metre African rock python had recently swallowed a buck whole when it was found by transporter Jaco Kotze on his farm.\nThe meal was so big that the snake was unable to move.\nThe footage from South Africa shows the snake stretching its mouth extremely wide to force the buck's stomach back out\nBut when Mr Kotze, from Groblersdal, South Africa, returned with amateur snake catcher Arthur Roden, the python clearly decided digestion would be too much effort.\nMr Kotze then captured its efforts to regurgitate the buck and slither away up a tree on video.\nThe footage shows the snake stretching its mouth extremely wide to force the buck's stomach back out.\nOnce it was finished and caught, Mr Roden was able to take it to be safely released.\nMr Roden, 32, a steel and metal works worker, said: 'I've been doing this since I was 13. I grew up in a small farming town and our house was right next to an open field so there were always lots of snakes.\n'My mom taught me from a very young age to be careful of certain snakes and showed me which ones are dangerous.\n'She took out a book for me at the library about snakes and I just instantly got took liking to them.\n'If you don't know what you're doing with the African rock python you can get into trouble.\nThe buck's legs are the first thing to emerge from the reptile's mouth as it begins the regurgitating process\nOnce the snake has finished getting it out, its slithers away but is caught by Arthur Roden\n'I've never heard of an African rock python actually swallowing someone, but they are constrictors, so if they wrap around your neck or around a child he can suffocate you.\n'If you stay calm and don't move too quickly they aren't as defensive. It's when you are loud and move fast that they become aggressive.\n'I asked Jaco if he doesn't just want to leave the snake, but he breeds expensive game on his farm and he says they've noticing some of them going missing.\n'He thinks the snake was to blame so he asked me to remove and relocate it. I took it to Bushfellows Game Lodge, where I've taken other big snakes before.\n'It was big, but not the biggest I've ever caught. The biggest was in Hartebeespoort Dam. A 5 meter South African Rock Python.'","url":"https://www.dailymail.co.uk/news/article-4300528/Africn-rock-python-regurgitates-entire-deer.html"}
