{"authors":["Ellis Widner"],"date_download":"2018-10-30 00:51:58","date_modify":"2018-10-30 00:51:58","date_publish":"2018-09-13 00:00:00","description":"Eight of the nine current members of the pioneering and influential black arts collective AfriCOBRA, which was co-founded in Chicago in 1968 by Pine Bluff native Jeff Donaldson, will attend the opening of “Respect: Celebrating 50 years of AfriCOBRA” at Mosaic Templars Cultural Center in Little Rock.","filename":"data/vaneerConsumption/AfriCOBRAgettingRespectat50.json","image_url":"https://media.arkansasonline.com/img/photos/2018/09/13/resized_250588-artbeat1-0916_32-25100_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_sep_16__1540860718.html","title":"AfriCOBRA getting ‘Respect’ at 50","title_page":"AfriCOBRA getting ‘Respect’ at 50","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Jeff Donaldson, the late co-founder of the black arts collective AfriCOBRA, titled this silkscreen Victory in Zimbabwe. Donaldson was a native of Pine Bluff and is part of the exhibition “Respect: Celebrating 50 Years of AfriCOBRA.”\nEight of the nine current members of the pioneering and influential black arts collective AfriCOBRA, which was co-founded in Chicago in 1968 by Pine Bluff native Jeff Donaldson, will attend the opening of “Respect: Celebrating 50 years of AfriCOBRA” at Mosaic Templars Cultural Center in Little Rock.\nAt the 6 p.m. Thursday opening reception, they will reveal a first for the collective … a collaborative artwork commissioned by Mosaic Templars in celebration of its 10th anniversary.\n“I am astounded they did this for Mosaic Templars and so excited they will be here,” says Christina Shutt, director of Mosaic Templars. “The work consists of nine 24-by-24-inch panels. It will be part of our permanent collection.”\nThe exhibition, she says, gives the museum an opportunity “to tell a story that hasn’t been told here before.”\nGuest curator Garbo Hearne, owner of Hearne Fine Art in Little Rock, hosted an exhibition by AfriCOBRA in 2016 at her gallery and individual shows by Pine Bluff-born Kevin Cole and photographer/painter Adgar Cowans, who are members.\nThe exhibition at Mosaic Templars will present work by each of the current members of AfriCOBRA. Along with Cole and Cowans, members are Akili Ron Anderson, Michael D. Harris, Napoleon Jones-Henderson, James Phillips, Frank Smith, Nelson Stevens and sculptor Renee Stout. All the current members, except Smith, will attend the reception.\nHearne says the show’s title reflects AfriCOBRA’s ethos.\n“It’s about respect,” Hearne says. “What are you respecting? The black family, the community, the Earth … each artist has his own way to show that respect in the art.”\nHearne says the exhibition — which continues through Dec. 2 — will have 46 works on loan from the current AfriCOBRA members and will include a tribute to Donaldson, who was the first person to receive a doctorate in African-American art history, according to the Encyclopedia of Arkansas History & Culture.\nIt is a way, Hearne says, to show respect for an accomplished Arkansan who is little known in his home state.\n“I wanted this tribute to give him accolades in his home state that he didn’t get while he was alive,” Hearne says. The tribute to Donaldson, who died in 2004, will include three paintings, a timeline, a display showing his connection to the University of Arkansas at Pine Bluff art department (then Arkansas AM&N College) and some of his personal possessions.\nAlso a writer and art critic, Donaldson was dean of the College of Fine Arts at Howard University in Washington when he retired in 1998. His papers are in the Smithsonian Institution.\n“The exhibition will include a portrait of him by Adgar Cowans, also a member of the collective,” Hearne says.\nDonaldson, a vital part of the Black Arts Movement of the 1960s and beyond, co-founded the Organization of Black American Culture, whose members painted a mural called Wall of Respect in 1967 in Chicago that celebrated black cultural achievement and inspired the urban mural movement. A year later, AfriCOBRA — the African Commune of Bad Relevant Artists — was formed.\n“History and social justice are aspects of why this collective came into being,” Hearne says. “It was to show positivity in the black community and making sure that everyone was exposed to art.”\nThe collective defined its mission as “an approach to image making which would reflect and project the moods, attitudes and sensibilities of African Americans independent of the technical and aesthetic strictures of Euro-centric modalities.”\nIn an article from Afri-Cobra HI (University of Massachusetts at Amherst, 1973), Barbara Jones-Hogu, another co-founder of AfriCOBRA, described the collective’s aesthetic as “black, positive, direct statements created in bright, vivid, singing cool-ade colors of orange, strawberry, cherry, lemon, lime and grape. Pure vivid colors of the sun and nature. Colors that shine on black people, colors which stand out against the greenery of rural areas. … Black positive statements stressing a direction in the image with lettering, lost and found line and shape were the beginning elements …”\nHearne says there will be an exhibition catalog, but it won’t be ready until near the end of the show’s run.\n“I plan to document the AfriCOBRA members’ visit to Arkansas with photographs and an essay to include with the catalog,” she says.\nHearne also plans to re-create AfriCOBRA’s first poster with its current members.\n“I hope people will take away the feeling of how beautiful working together, being collaborative, can be. I hope they will learn about a great artist, Jeff Donaldson. Most of all, I hope this exhibition will move the conversation forward and that people will come and appreciate each artist.”\nIt’s all about respect.\nEmail: ewidner@arkansasonline.com\nKevin Cole - Pine Bluff’s Kevin Cole, a member of AfriCOBRA, created this mixed media piece Earthly Ways Heavenly Knows.","url":"https://www.arkansasonline.com/news/2018/sep/16/africobra-getting-respect-50/"}
