{"authors":["Associated Press"],"date_download":"2018-10-22 23:07:48","date_modify":"2018-10-22 23:07:48","date_publish":"2017-03-16 05:49:17","description":"LOS ANGELES (AP) - A federal investigation that targeted violent Los Angeles jail guards took down the longtime former leader of the nation's largest...","filename":"data/vaneerConsumption/Afterstellar50yearcareerexLACountysheriffconvicted.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/05/wire-226577-1489643372-822_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318980_After-stellar-50-year-career-ex-LA-County-sheriff-convicted_1540249668.html","title":"After stellar 50-year career, ex-LA County sheriff convicted","title_page":"After stellar 50-year career, ex-LA County sheriff convicted | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"LOS ANGELES (AP) - A federal investigation that targeted violent Los Angeles jail guards took down the longtime former leader of the nation's largest sheriff's department.\nLee Baca was convicted Wednesday of obstructing an FBI investigation into guards who savagely beat inmates and took bribes to smuggle contraband into the jails he ran.\nThe guilty verdicts represented a stunning turnaround for Baca, who less than three months ago walked out of court feeling victorious when his previous trial was declared mistrial. Jurors had been deadlocked 11-1 in favor of his acquittal and it was no certainty the charges against him would even be refiled.\nFormer Los Angeles County Sheriff Lee Baca talks to the media as he leaves federal court in Los Angeles on Wednesday, March 15, 2017. Baca was convicted Wednesday of obstructing an FBI corruption investigation of jails he ran and of lying to federal authorities. (AP Photo/Damian Dovarganes)\nInstead he became the 21st and final person convicted in the wide-ranging corruption investigation that began with rank-and-file deputies and spread to Baca's inner circle.\nIn addition to tarnishing a reputation earned during a 50-year career as a policing innovator and jail reformer, the conviction threatens to put Baca, 74, who is in the early stages of Alzheimer's disease, behind bars for up to 20 years.\nBaca remained free ahead of a Monday hearing that is expected to set a sentencing date on convictions of obstruction of justice, conspiring to hinder the probe and lying to investigators.\nBaca had escaped the fate of underlings indicted in the case until a year ago, when he unexpectedly pleaded guilty to a single count of making false statements to federal authorities about what role he played in efforts to thwart the FBI.\nAn agreement with prosecutors called for a sentence no greater than six months. But a judge rejected the deal as too lenient. Baca then withdrew his guilty plea, and prosecutors hit him with the additional conspiracy and obstruction charges.\nIn the previous trial, prosecutors had decided to seek a separate trial on the lying charge, but pressed all three counts at the second trial, one of several tactical changes that may have made the difference in winning over a new jury.\nTwo deputies who pleaded guilty in the conspiracy testified at the second trial, putting their former boss at the head of the scheme that included efforts to intimidate an FBI agent who had launched the investigation into civil rights abuses in the jails.\nThe jury foreman told reporters that there were several \"aha\" moments in testimony that helped win over four jurors who initially voted for acquittal. The 51-year-old salesman, who didn't give his name, said the strongest evidence came from those in the department who had done the right thing and stood up to Baca.\nHe cited former Assistant Sheriff Cecil Rhambo, who had warned Baca he would break the law if he obstructed the federal investigation.\n\"Lee Baca knew what was right and what was wrong,\" Acting U.S. Attorney Sandra R. Brown said outside court. \"He made a decision. That decision was to commit a crime, and he led others in a conspiracy to obstruct a federal law enforcement investigation into what he described as 'his jails.'\n\"And when the time came, he lied. He lied to cover up his crimes,\" she said.\nDefense attorney Nathan Hochman didn't dispute the efforts to hide the informant and impede the FBI but said prosecutors had presented no evidence Baca gave orders to obstruct the FBI.\nHochman was frustrated in efforts to present evidence of Baca's diagnosis.\nThere was no evidence Baca suffered from Alzheimer's during the scheme in 2011, and Judge Percy Anderson said mention of it could sway jurors to sympathize with Baca.\nHochman was left to hint at the issue, reminding jurors that Baca was 71 at the time he spoke with prosecutors and wasn't lying but had forgotten details. Baca did not testify.\nThe former sheriff showed no emotion in court as the verdicts were read but struck an upbeat tone outside.\n\"My mentality is always optimistic,\" Baca said. \"I look forward to winning on appeal.\"\nFormer Los Angeles County Sheriff Lee Baca, center with his wife, Carol, left, and his attorney, Nathan Hochman, leave federal court in Los Angeles on Wednesday, March 15, 2017. Baca was convicted Wednesday of obstructing an FBI investigation into corrupt and violent guards who took bribes to smuggle contraband into the jails he ran and savagely beat inmates. He could face 20 years in prison. (AP Photo/Damian Dovarganes)\nFormer Los Angeles County Sheriff Lee Baca, left, and his attorney, Nathan Hochman, talks to the media as he leaves federal court in Los Angeles on Wednesday, March 15, 2017. Baca was convicted Wednesday of obstructing an FBI corruption investigation of jails he ran and of lying to federal authorities. (AP Photo/Damian Dovarganes)\nFormer Los Angeles County Sheriff Lee Baca, second from right, with wife, Carol, and his attorneys, David Hochman, left, and Nathan Hochman, leave federal court in Los Angeles on Wednesday, March 15, 2017. Baca was convicted Wednesday of obstructing an FBI corruption investigation of jails he ran and of lying to federal authorities. (AP Photo/Damian Dovarganes)\nFormer Los Angeles County Sheriff Lee Baca, middle, with his legal team, leaves federal court in Los Angeles on Wednesday, March 15, 2017. Baca was convicted Wednesday of obstructing an FBI corruption investigation of jails he ran and of lying to federal authorities. (AP Photo/Damian Dovarganes)","url":"https://www.dailymail.co.uk/wires/ap/article-4318980/After-stellar-50-year-career-ex-LA-County-sheriff-convicted.html"}
