{"authors":[],"date_download":"2018-10-30 20:22:48","date_modify":"2018-10-30 20:22:48","date_publish":"2015-11-19 13:37:46","description":"On the morning after a line of strong storms dumped torrential rain that snarled the evening commute, downed trees and spawned at least one apparent tornado, metro Atlantans awakened to drier weather and the promise of at least five consecutive sunny days.","filename":"data/vaneerConsumption/AfterWednesdaysstormssunnydaysarehereagain.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/11/19/Videos/4621087981001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/weather_after-wednesday-storms-sunny-days-are-here-again__1540930968.html","title":"After Wednesday’s storms, sunny days are here again","title_page":"After Wednesday’s storms, sunny days are here again","title_rss":"NULL","source_domain":"ajc.com","text":"On the morning after a line of strong storms dumped torrential rain that snarled the evening commute, downed trees and spawned at least one apparent tornado, metro Atlantans awakened to drier weather and the promise of at least five consecutive sunny days.\nIn northwest Atlanta, Thursday morning commuters headed into town on Marietta Road dodged a sinkhole that opened up overnight along the right side of the roadway, where a storm drain had apparently collapsed.\nBut the worst of the damage from Wednesday’s storms was along the Fulton-Coweta county line, where a radar-confirmed tornado touched down.\nThere, debris from downed trees still littered streets just before daybreak Thursday, while large tarps covered roof damage to a few homes.\nTwo homes were damaged in Coweta County, where numerous trees were reported down. Parts of the roofs of both homes were damaged, but no injuries were reported. Trees and power lines were also down in Fairburn, in south Fulton County. Tell Road was impassable because of downed trees and lines, and trees were down on Virlyn B. Smith Road, according to the Fairburn Police Department.\n“It didn’t give us no warning, no nothing,” said Jorge Rubio, explaining his family was watching TV when the house began to shake. “I wasn’t even sure it was a tornado because it was so fast.”\nMike Richardson’s home on John Rivers Road in Fairburn was damaged and six trees were down in his yard, he told The Atlanta Journal-Constitution.\n“It felt like the Wizard of Oz,” he said. “The funnel was right outside the window. It was surreal.”\nDuring the height of the storm, more than 9,000 Georgia Power customers were without electricity, and the majority were in the metro Atlanta area, according to the utility. That number dwindled Wednesday evening as crews worked to restore power, and by 8 a.m. Thursday, only 53 customers were still without power.\nRainfall totals from Wednesday’s storms included 2.46 inches in Alpharetta, 2.11 inches in Johns Creek, 2.04 inches in Chamblee, 1.7 inches in Marietta, 1.29 inches in Jonesboro and 1.04 inches at Hartsfield-Jackson International Airport.\nChannel 2 meteorologist Karen Minton said that once Thursday morning’s patchy fog burned off, Atlanta would begin an extended stretch of dry, sunny weather.\nMinton’s forecast through the beginning of Thanksgiving week is for sunny to mostly sunny skies Thursday through Monday, with much cooler temperatures by the end of the weekend.\nHighs will be in the mid-60s Thursday, low 60s Friday, upper 50s Saturday, upper 40s Sunday and low 50s Monday, Minton said.\nMorning lows will be in the 40s Friday and Saturday, mid-30s Sunday and low 30s Monday, she said.\n— Staff writer Alexis Stevens contributed to this article.","url":"https://www.ajc.com/weather/after-wednesday-storms-sunny-days-are-here-again/WQHUc3rpNNLTu4XUYCeI2M/"}
