{"authors":["Charlie Spiering"],"date_download":"2018-10-30 18:51:30","date_modify":"2018-10-30 18:51:30","date_publish":"2015-03-06 20:27:47","description":"It's a cold March in South Carolina. So President Obama, who travels even short distances in a 747, is warning about global warming. |","filename":"data/vaneerConsumption/AfterTalkingAboutColdWeatherObamaWarnsAboutGlobalWarming.json","image_url":"https://media.breitbart.com/media/2015/01/obama-air-force-one-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_06__1540925490.html","title":"After Talking About Cold Weather, Obama Warns About Global Warming","title_page":"After Talking About Cold Weather, Obama Warns About Global Warming | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In South Carolina today, President Obama warned that, although the weather is cold, that’s no excuse for not worrying about climate change.\n“A lot of young people here, you might not be worried about climate change, although it is very cold down here,” he admitted while speaking at Benedict University in Columbia, S.C.\n“You can’t attribute a couple of days of cold weather or a couple of days of hot weather to the climate changing, but the pattern overall is that the planet is getting warmer,” he argued. “That’s undeniable.”\nObama warned young people in the audience that a warmer climate would lead to devastating circumstances around the world, including rising oceans, drought, war, and the increase of insect-borne diseases such as malaria.\n“What you have to appreciate, young people, is that this will affect you more than old people like me,” he said. “I’ll be gone when the worst of this hits.”\nObama added that climate change threatens the lives of young people and their children.\n“I just want you to understand, what I just described – its not science fiction, it’s not speculation, it’s what the science tells us,” he said. “So we’ve got to worry about it.”\nClimate change, Obama says, is one more reason why the world has to move beyond an oil based economy to wind and solar.\nEven though gas is cheaper than it’s been for years, Obama warned young people to stay away from cars that don’t get high gas mileage.\n“Don’t think that just ‘cuz gas prices are low right now – that’s nice, it put some more money in your pocket, but that’s not going to last – so don’t go out and say, ‘I’m gonna go out and buy a gas guzzler now,’” he said.","url":"https://www.breitbart.com/politics/2015/03/06/after-talking-about-cold-weather-obama-warns-about-global-warming/"}
