{"authors":["Chriss W. Street"],"date_download":"2018-10-30 18:14:32","date_modify":"2018-10-30 18:14:32","date_publish":"2015-11-20 12:52:50","description":"Despite $25 billion in welfare spending, Los Angeles had a 20 percent increase in homelessness.","filename":"data/vaneerConsumption/AfterSpending25BHomelessnessup20.json","image_url":"https://media.breitbart.com/media/2015/11/Skid-Row-Los-Angeles-Jae-C.-Hong-Associated-Press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_11_20__1540923272.html","title":"After Spending $25B, Homelessness up 20%","title_page":"L.A.: After Spending $25B, Homelessness up 20%","title_rss":"NULL","source_domain":"breitbart.com","text":"The U.S. Department of Housing and Urban Development has declared that with a 20 percent jump this year, Los Angeles is still leading the nation in homelessness–despite $25 billion a year in welfare spending going to the L.A. region.\nHUD’s 2015 Annual Homeless Assessment Report to Congress for 3,000 cities and counties estimates that homelessness has declined by 2 percent nationally, but increased by 3 percent in big cities. The booby prize for the worst performance went to the Los Angeles region, with a 20 percent increase, to 41,174 homeless persons.\nLiberal L.A. politicians were outraged at the grim news. Los Angeles City Councilman Mike Bonin said, “We’re now a city of shanties.” County Supervisor Mark Ridley-Thomas added “This is a moral outrage. It represents a failure of both the public and private sector.”\nBut such statistics comes as no surprise to Breitbart News, which has published numerous reports about how California’s extremist taxation, regulation and spending policies have damaged private sector job creation and motivated middle class residents to move to other states. The only reason that the Golden State has achieved any population gain in the last decade is due to importing foreign immigrants.\nSince 2005, California’s annual domestic net migration has been negative, with more Americans leaving the state than moving to the state. The almost 200,000 Americans who leave each year are offset by about the same number of foreign immigrants.\nHalf of the foreign immigrants have some legal status (including green cards and visas), and the other half are illegal aliens/undocumented workers, according to the Department of Homeland Security. Most illegal immigrants tend to have few skills.\nThe size of California’s foreign-born population hit 10,175,839, or about 27 percent of all California residents, according to the latest census figures for December 31, 2013. The top countries of origin for foreign immigrants were Mexico, Philippines and China.\nDespite huge efforts by the Obama administration and Democrat-controlled state government to extend legal status to all foreign immigrants, about 2.67 million California residents are still “undocumented,” according to the Public Policy Institute of California.\nImporting about 100,000 unskilled and undocumented foreign immigrants each year explains why the City of Los Angeles has achieved the crown as America’s Poorest Big City, according to an analysis of Census Bureau data. California’s overall rate of poverty is 16.8 percent.\nBreitbart News recently reported that in WalletHub’s annual survey, California has all 20 of the worst small cities in America according to measures of “1) Affordability, 2) Economic Health, 3) Education & Health and 4) Quality of Life.”\nThe latest publication of the National Bureau of Economic Research on the causes of poverty found that there is a direct correlation between “clustering” of immigrants and the ability to receive welfare.\nNBER analysts determined that California becoming much more generous in its welfare provisions between 1970 and 1990 made the state a magnet for illegal immigrants. California’s Aid to Families with Dependent Children is 20 percent above that provided by New York; 89 percent larger than that provided in Illinois, and almost 280 percent greater than the package offered by Texas.\nHUD’s assessment reported that as of January 2015, there were 564,708 homeless people in America, with major cities now accounting for almost half of the “unsheltered” population. With a 20 percent annual growth rate, Los Angeles homelessness is growing about twice as fast as homelessness New York and almost three times as fast as homelessness in Chicago.\nL.A. Mayor Eric Garcetti declared war on homelessness this summer, and pledged to build more affordable housing and spend an additional $100 million on measures such as new shelters and vouchers to cover rent and security deposits temporarily.\nBut with about half of California’s $51.5 billion state and local welfare expenditures already going to the Los Angeles region, continually spending more government money on homelessness has not reduced the problem.","url":"https://www.breitbart.com/local/2015/11/20/l-spending-25b-homelessness-20/"}
