{"authors":["Bill Chappell"],"date_download":"2018-10-23 05:17:18","date_modify":"2018-10-23 05:17:18","date_publish":"2014-05-16 00:00:00","description":"Two months after they bought a couch for $20, three roommates realized it was stuffed with envelopes of cash. They decided to track down the rightful owner.","filename":"data/vaneerConsumption/AfterFinding40000InThriftStoreCouchRoommatesReturnMoney.json","image_url":"https://media.npr.org/assets/img/2014/05/16/paltz_couch_wide-3813defa1a103930154d1f4c8f37e1b401849a3a.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2014_05_16_313118337_thrift-store-couch-yields-40-000-roommates-return-money_1540271838.html","title":"After Finding $40,000 In Thrift-Store Couch, Roommates Return Money","title_page":"After Finding $40,000 In Thrift-Store Couch, Roommates Return Money : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"After Finding $40,000 In Thrift-Store Couch, Roommates Return Money\nEnlarge this image toggle caption Mike Groll/AP Mike Groll/AP\nMany of us have stories about old couches — particularly ones we had in college, or shortly after. But not many stories are like the one three roommates in New Paltz, N.Y., can now tell.\nAfter the trio realized their beat-up couch was stuffed with more than $40,000, they decided to return the money to its rightful owner.\nIt all started when roommates Reese Werkhoven, Cally Guasti and Lara Russo realized that the lumps in their couch's pillows were actually envelopes stuffed with money. Just two months earlier, they'd bought the couch for $20 at a Salvation Army store.\n\"It had these bubble wrap envelopes, just like two or three of them,\" Werkhoven tells CBS New York. \"We ripped them out and [I] was just like freaking out, like an inch and a half of $100 bills.\"\nOr, as he told SUNY, New Paltz student-run blog The Little Rebellion, \"I almost peed.\"\nThey kept finding more envelopes in the couch, pulling money out of it like an upholstered ATM.\nWerkhoven added, \"The most money I'd ever found in a couch was like 50 cents. Honestly, I'd be ecstatic to find just $5 in a couch.\"\nThe discovery was like a dream for the three friends, all of whom are either in college or recent graduates.\nAs they counted the money, they talked about what they might do with it; Werkhoven says he wanted to buy his mom a new car. But then they spotted a name among the envelopes, and realized they were faced with an ethical puzzle.\n\"We had a lot of moral discussions about the money,\" Russo tells Little Rebellion. \"We all agreed that we had to bring the money back to whoever it belonged to ... it's their money — we didn't earn it. However, there were a lot of gray areas we had to consider.\"\nThey asked their parents for advice; don't spend the money, they were told. A phone number led them to the family that had donated the couch — and to answers about why it was full of money.\nThe roommates drove to the woman's house in what The Little Rebellion calls \"a rustic home in a rough neighborhood.\"\n\"I think the part of this whole experience that cleared away my prior thoughts and worries was when I saw the woman's daughter and granddaughter greet us at the door,\" Werkhoven tells the blog. \"I could just tell right away that these were nice people.\"\nIt turned out that the money was socked away out of the woman's late husband's concerns that he wouldn't always be there for his wife (she has chosen to remain anonymous). It represented decades of savings, including wages from the woman's job as a florist.\nFor years, she also slept on the couch. But recent back problems led her daughter and son-in-law to replace it with a bed, meaning that the couch had to go.\n\"This was her life savings and she actually said something really beautiful, like 'This is my husband looking down on me and this was supposed to happen,' \" Guasti tells CBS NY.\nAfter they returned the money to the woman, Guasti, Russo and Werkhoven received $1,000 as a reward.","url":"https://www.npr.org/sections/thetwo-way/2014/05/16/313118337/thrift-store-couch-yields-40-000-roommates-return-money"}
