{"authors":[],"date_download":"2018-10-30 00:59:56","date_modify":"2018-10-30 00:59:56","date_publish":"2016-02-17 09:00:00","description":null,"filename":"data/vaneerConsumption/AfterScaliaAPoliticoLegalDeluge.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/02/Screen20Shot202016-02-1620at2012.27.4120PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861196.html","title":"After Scalia: A Politico-Legal Deluge","title_page":"After Scalia: A Politico-Legal DelugeThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"George Will sums up Antonin Scalia’s stellar turn at the Supreme Court:\nAntonin Scalia, who combined a zest for intellectual combat with a vast talent for friendship, was a Roman candle of sparkling jurisprudential theories leavened by acerbic witticisms. The serrated edges of his most passionate dissents sometimes strained the court’s comity and occasionally limited his ability to proclaim what the late Justice William Brennan called the most important word in the Court’s lexicon: “Five.” Scalia was, however, one of the most formidable thinkers among the 112 justices who have served on the Court, and he often dissented in the hope of shaping a future replete with majorities steeped in principles he honed while in the minority. Those principles include textualism and originalism: A justice’s job is to construe the text of the Constitution or of statutes by discerning and accepting the original meaning the words had to those who ratified or wrote them. These principles of judicial modesty were embraced by a generation of conservatives who recoiled from what they considered the unprincipled creation of rights by results-oriented Supreme Court justices and other jurists pursuing their preferred policy outcomes.\nCalling Scalia “a jurist of colossal consequence,” Will identifies the great conservative debate teed up by Scalia’s passing: the proper scope of judicial review. How far should the Court go in nullifying legislative and executive power conferred by voting majorities? The principle of judicial restraint calls for substantial deference to majority preferences ostensibly expressed in laws and administrative rules; but the principle of constitutionalism calls for voiding majorities that infringe upon “natural rights”—per the Declaration of Independence, the source of all rights embodied in the Constitution and Bill of Rights.\nVP Joe Biden long ago paid the ultimate tribute to Scalia, saying in 1993 that he regretted most of all his Senate vote to confirm Scalia to the Supreme Court—whom the Senate approved 98-0 in 1986—“because he was so effective.” Proof of that was that Scalia changed not only how his supporters addressed constitutional jurisprudence, he also changed the way his opponents addressed such matters. Thus, left-leaning Justice Elena Kagan said of Scalia:\nNino Scalia will go down in history as one of the most transformational Supreme Court Justices of our nation. His views on interpreting texts have changed the way all of us think and talk about the law.\nScalia’s trademark honesty surfaced this week in an anecdote from Jonathan V. Last. At a small, off-the-record 2009 luncheon held by the Weekly Standard editors:\nWhen he was asked about what sort of justices Barack Obama might nominate, someone asked Scalia if he thought Elena Kagan would be the new president’s pick. His response was, “We should be so lucky. It would be too much to hope for.” In general, Scalia seemed to believe that Obama would nominate someone less intellectual and more reliable. And he seemed to have the highest respect both for Kagan’s legal mind and personal character.\nA prime example of Scalia’s immense stature is his role in enshrining the Second Amendment into the pantheon of fundamental individual rights; prior to Scalia’s landmark opinion, the majority view had been that one’s gun rights were only activated when serving collectively within a militia. An New York Sun editorial notes that at her confirmation hearing Kagan told then-Judiciary Chairman Patrick Leahy that the Second Amendment was indeed recognized as a fundamental right.\nThe Wall Street Journal collected some Scalia gems, including this partial dissent from a 1992 case, on why judges should stick to legal interpretation and leave value judgments to the voters and their elected officials:\nAs long as this Court thought (and the people thought) that we Justices were doing essentially lawyers’ work up here—reading text and discerning our society’s traditional understanding of that text—the public pretty much left us alone. Texts and traditions are facts to study, not convictions to demonstrate about. But if in reality, our process of constitutional adjudication consists primarily of making value judgments; if we can ignore a long and clear tradition clarifying an ambiguous text, as we did, for example, five days ago in declaring unconstitutional invocations and benedictions at public high school graduation ceremonies (citation omitted); if, as I say, our pronouncement of constitutional law rests primarily on value judgments, then a free and intelligent people’s attitude towards us can be expected to be (ought to be) quite different. The people know that their value judgments are quite as good as those taught in any law school—maybe better. If, indeed, the “liberties” protected by the Constitution are, as the Court says, undefined and unbounded, then the people should demonstrate, to protest that we do not implement their values instead of ours. Not only that, but the confirmation hearings for new Justices should deteriorate into question-and-answer sessions in which Senators go through a list of their constituents’ most favored and most disfavored alleged constitutional rights, and seek the nominee’s commitment to support or oppose them. Value judgments, after all, should be voted on, not dictated; and if our Constitution has somehow accidentally committed them to the Supreme Court, at least we can have a sort of plebiscite each time a new nominee to that body is put forward. [Italics added.]\nThe death of Justice Scalia tees up a battle royal over confirmation of his successor, elevating judicial selections to the forefront of the presidential election. A Wall Street Journal editorial summed up Scalia’s immense impact on constitutional jurisprudence, and presented cogent reasons why President Obama should not be given another chance to appoint a justice:\nJustice Scalia correctly predicted that when judges behave as politicians, the people will treat them that way. And so we can see his prophecy play out in the already emerging fight to replace him. President Obama says he will nominate a replacement in this his final year, as he can under the Constitution. But the Senate has no obligation to confirm or even vote on his nominee—especially from a President who has so willfully abused his executive power to rewrite statutes and pack the D.C. Circuit Court of Appeals. A Senate debate in an election year would be unfair to the nominee, who would face very low odds of confirmation. The political brawl would also damage the Senate and the Court itself by suggesting that the judiciary is no different from the elected branches as a venue for partisanship.\nVideo surfaced showing Sen. Chuck Schumer, the canny New York pol who is expected to succeed Harry Reid as leader of Senate Democrats after Reid’s retirement at the end of this Congress: in 2007, a year after Justice Samuel Alito took his seat (Jan. 31, 2006), Schumer stated that President Bush would get no more nominees confirmed to the High Court, as Democrats had taken control of the Senate in 2007. And way back in August 1960, a Democrat-controlled Senate passed a resolution opposing recess appointments to the Supreme Court (Ike had made several), save in emergencies. The text of S.334 reads:\nExpressing the sense of the Senate that the pres. should not make recess appointments to the Supreme Court, except to prevent or end a breakdown in the administration of the court’s business.\nHoover Institution scholar Adam White writes that the Senate has no obligation to vote on any president’s judicial nominee. In all, Presidents have nominated 160 people to the Supreme Court, of which 36 (exactly 22.5 percent) were not confirmed, with 25 of those (70 percent) not even getting a vote. (N.B., the 124 confirmations include 12 justices confirmed twice; hence the 112 total number for different justices.)\nIn a landmark case unanimously striking down President Obama’s attempt to appoint officials to the National Labor Relations Board by construing the Senate in recess—the Senate had demurred—the Supremes reaffirmed that the Senate need not even hold a hearing, let alone, confirm, a presidential nominee; further, the Court would not intervene in what would be a political question. Tellingly, Justice Elena Kagan was one of the nine so voting; in 1999 Senate Republicans had declined to give her nomination to the D.C. Circuit appeals court a hearing.\nNRO’s John Fund examines the limits of the president’s recess appointment power. An Obama recess appointee could serve through the end of the next (115th) Congress’s first one-year session; that same Congress would face a new battle in 2018. The Senate began its current recess noon, Feb. 12; it reconvenes noon Feb. 22. At exactly ten days, the current recess is long enough for the president to make a recess appointment anytime during the recess.\nYet even if Obama eschews this option, there remains a trap for Republicans: Suppose, against all odds, President Obama nominates a genuine moderate, such as the D.C. Circuit’s Sri Srinivasan? He clerked for conservative icon J. Harvie Wilkinson, a star of the 4th Circuit appellate bench, and then for Sandra Day O’Connor. Though the latter is reviled by conservatives for decisions such as her 2003 opinion extending judicial protection of affirmative action for a quarter-century, she was nowhere near as far left as Ruth Bader Ginsburg. “Notorious R.B.G.”’s support for extending federal power to Hamiltonian limits—Alexander Hamilton was the most ardent proponent of expansive federal power among the Framers of 1787—has been a virtual constant. Srinivasan worked twice in the prestigious Office of the Solicitor-General, once in the George W. Bush administration and then again under President Obama, arguing a total of 50 cases before the Supremes. (The S-G is the government’s chief lawyer before the Supreme Court.) In 2013 his nomination to the D.C. Circuit was approved 97-0 by the Senate. Thus, GOP opposition to his selection would—rightly—be painted as hyper-partisan, putting politics above the integrity of the Court.\nIn event Obama goes towards the center and settles for half a loaf, if Republicans reflexively oppose they run huge risks. If the Democrats win the presidency, either Hillary or Sanders—even Joe Biden—starting out with maximum political capital, figures to go well to the left on filling Scalia’s seat. Even a GOP Senate would be hard pressed to adamantly oppose a true moderate, and risk being forced to swallow a hard-core lefty come 2017. And if the Democrats take the Senate with the presidency, a strong possibility, such a political double would enable them to ram through a Marxist (if Sanders wins) or a Stalinist (if Hillary wins). As for a possible Biden pick, recall that in 1987 Biden captained the mendacious, libelous mugging of Robert Bork, whom Democrats portrayed as a radical reactionary based upon his provocative academic writings. They studiously ignored that in his six years on the D.C. Circuit Judge Bork had authored over 400 judicial opinions, not one of which was overturned by the Supreme Court.\nConversely, if Obama nominates a racialist crony like Eric Holder or political hack like Deval Patrick, or other left-wing mediocrity, it is easy for the GOP to oppose with minimal political risk, and great potential upside if they win the presidency and hold the Senate in the fall elections. A lefty with impeccable career credentials, like the D.C. Circuit’s Patricia Ann Millett, would pose the same problem Scalia posed for Joe Biden. But because Millett was one of three judges elevated to the D.C. Circuit by Harry Reid’s 2013 exercise of the “nuclear option”, GOP senators could justify blocking her ascent. GOP surrender to nominees like this would—and should—likely doom the party at the polls this fall.\nOne final note: If the Republicans, now or in 2017, hold a hearing for a lefty nominee, they should conduct it under what I’ll call “Alito Rules”: they should question the Democratic nominee as harshly as Alito was questioned, save for scurrilous personal attacks (that at one point drove his wife to tears). No more passes on judicial viewpoint should be given, as was done with Clinton and Obama nominees—unless, however unlikely (very), a taste of their own results-oriented medicine spurs Democrats to restore pre-Bork hearing rules. Such would limit judicial viewpoint questions to those pertaining to broad jurisprudential philosophy.\nThis latest tempest comes at a moment when millions of voters are in a Howard Beale mood. I refer to the character memorably played by actor Peter Finch in the 1976 film Network. Finch plays a TV anchorman who goes into a mad rant on the air and shouts: “I’m as mad as hell, and I’m not going to take this anymore!”\nThis hopping mad (at both parties) electorate will decide America’s future. It will face this latest vital choice armed with little formal education in matters constitutional, arcane to most voters. And now voters will be bombarded with a new, exceptionally shrill election-year domestic political debate bound to generate far more heat than light.","url":"https://spectator.org/65497_after-scalia-politico-legal-deluge/"}
