{"authors":["Lauren Barbato"],"date_download":"2018-10-30 22:52:35","date_modify":"2018-10-30 22:52:35","date_publish":"2014-08-14 17:33:33","description":"Following reports of increasing police violence in the small St. Louis suburb, President Barack Obama addressed the protests and militarization of Ferguson, Missouri, in a press conference from his vacation home at Martha's Vineyard, Massachusetts,…","filename":"data/vaneerConsumption/AfterMikeBrownShootingObamaTellsFergusonNowIsTheTimeForHealing.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/01ab4d13-d160-417d-b89c-5ed9b9574be7.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35788-after-mike-brown-shooting-obama-tells-ferguson-now-is-the-time-for-healing_1540939955.html","title":"After Mike Brown Shooting, Obama Tells Ferguson, \"Now Is The Time For Healing\"","title_page":"After Mike Brown Shooting, Obama Tells Ferguson, \"Now Is The Time For Healing\"","title_rss":"NULL","source_domain":"bustle.com","text":"Following reports of increasing police violence in the small St. Louis suburb, President Barack Obama addressed the protests and militarization of Ferguson, Missouri, in a press conference from his vacation home at Martha's Vineyard, Massachusetts, on Thursday afternoon. The president called for transparency and accountability from the local government and police forces, noting that there's never a place for law enforcement to use excessive force or arrest journalists. But rather than homing in on the specifics, Obama urged Americans to look ahead and heal from this tragedy.\n\"I want to underscore that now is the time for all of us to look at what has happened [in Ferguson],\" the president said. \"Now is the time for healing. Now is the time for peace and calm.\"\nObama reiterated that justice will be brought to Ferguson and its residents, but it will take some collaboration between the local and federal governments. The president said he has already tasked the Department of Justice and FBI with an independent investigation into the shooting of Mike Brown, an unarmed young black man who was supposed to start college classes this week.\n\"We lost a young man in heartbreaking and tragic circumstances,\" Obama said. \"His family will never hold Michael in their arms again.\"\nAlthough Obama was restrained in his remarks, staying clear of taking any sides, he did emphasize that police forces should never use excessive force against protesters, or throw protesters or journalists in jail for peaceful protests. \"[Police] should not be bullying or arresting journalists for doing their jobs and reporting what they see on the ground,\" the president said.\nHowever, the president didn't state what actions, if any, would be taken against the Ferguson authorities, nor did he address any allegations of racism, which have no doubt spurred the ongoing protests in Ferguson. But Obama did emphasize that, as Americans, we are \"all part of one American family\" that believes in values like \"equality under the law.\"\nScott Olson/Getty Images News/Getty Images\nMinutes before the president spoke in Martha's Vineyard, Missouri Gov. Jay Nixon gave a press conference of his own. Nixon did not announce that he was removing St. Louis County police from Ferguson, as reported earlier on Thursday, but he did promise \"a different tone\" on the suburb's streets.\n\"If people have things to say, they ought to be able to say them, and if people in the news media want to cover stuff and take pictures, they ought to do it,\" Nixon said. \"We live in a free country.\"\nAlso on Thursday, Missouri Sen. Claire McCaskill called for the demilitarization of Ferguson, saying the \"response by the police has become the problem instead of the solution.\"\nImages: Getty Images (2)","url":"https://www.bustle.com/articles/35788-after-mike-brown-shooting-obama-tells-ferguson-now-is-the-time-for-healing"}
