{"authors":["Associated Press"],"date_download":"2018-10-22 22:00:10","date_modify":"2018-10-22 22:00:10","date_publish":"2016-01-11 01:58:13","description":"LANDOVER, Maryland (AP) — Aaron Rodgers recovered from a poor start to throw for two touchdowns, Eddie Lacy and James Starks each ran for a score, and the Gr...","filename":"data/vaneerConsumption/AfterslowstartRodgersPackersoverwhelmRedskins3518.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:06e8a1e5daa2400fa42e182b2e1026cd-3bWLCvS3pZb5eb4fce05c5eae9c9-928_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393241_After-slow-start-Rodgers-Packers-overwhelm-Redskins-35-18_1540245610.html","title":"After slow start, Rodgers, Packers overwhelm Redskins 35-18","title_page":"After slow start, Rodgers, Packers overwhelm Redskins 35-18 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"After slow start, Rodgers, Packers overwhelm Redskins 35-18\nLANDOVER, Maryland (AP) — Aaron Rodgers recovered from a poor start to throw for two touchdowns, Eddie Lacy and James Starks each ran for a score, and the Green Bay Packers came back to beat the Washington Redskins 35-18 Sunday in an NFC wild-card game.\nRodgers opened 1 for 8, and Green Bay's first four drives ended this way: punt, safety, punt, punt.\nTrailing 11-0, the Packers used a bit of hurry-up to score 17 consecutive points, then put the game away on the ground.\nGreen Bay Packers tight end Richard Rodgers (82) celebrates with quarterback Aaron Rodgers (12) after wide receiver Davante Adams caught a touchdown pass during the first half of an NFL wild-card playoff football game against the Washington Redskins in Landover, Md., Sunday, Jan. 10, 2016. (AP Photo/Mark Tenally)\nRodgers connected with Randall Cobb and Davante Adams for TDs. After rushing for only 17 yards in the first half, the Packers finished with 141.\nGreen Bay (11-6), which lost its last two regular-season games, will play at Arizona on Saturday.\nNFC East champion Washington (9-8) had won four games in a row, but its season ends without a victory over a winning team.\nSEAHAWKS 10, VIKINGS 9\nMINNEAPOLIS (AP) — Blair Walsh's 27-yard field goal try into the frigid wind for Minnesota hooked left with 22 seconds remaining, handing Seattle a 10-9 victory over a stunned Minnesota in their wild-card round playoff game.\nThe Seahawks (11-6) didn't score until Russell Wilson's short touchdown pass to Doug Baldwin early in the fourth quarter, and a fumble by Adrian Peterson for the Vikings on the next possession set up a field goal by Steven Hauschka.\nThe Vikings (11-6) took the ball back with 1:42 left at their 39 and, aided by a pass interference penalty on Kam Chancellor, drove deep into Seattle's territory. After draining the clock for the seemingly inevitable win, Walsh missed the winner. He made all three of his earlier attempts.\n___\nAP NFL website: http://www.pro32.ap.org and http://www.twitter.com/AP_NFL\nGreen Bay Packers running back James Starks (44) carries the ball into the end zone for a touchdown as Washington Redskins cornerback Will Blackmon (41) watches during the second half of an NFL wild card playoff football game in Landover, Md., Sunday, Jan. 10, 2016. (AP Photo/Nick Wass)\nWashington Redskins quarterback Kirk Cousins (8) throws the ball under pressure from Green Bay Packers outside linebacker Julius Peppers (56) during the first half of an NFL wild card playoff football game in Landover, Md., Sunday, Jan. 10, 2016. (AP Photo/Alex Brandon)","url":"https://www.dailymail.co.uk/wires/ap/article-3393241/After-slow-start-Rodgers-Packers-overwhelm-Redskins-35-18.html"}
