{"authors":[],"date_download":"2018-10-30 01:01:01","date_modify":"2018-10-30 01:01:01","date_publish":"2018-09-04 00:40:16","description":"Jessica Valenti is a feminist and a liar, but I repeat myself. A couple of weeks ago, Valenti invited scrutiny of her truthfulness by responding to the murder of a young woman in Iowa. On Aug. 22, the White House issued this statement on Twitter: “For 34 days, investigators searched for 20-year-old Mollie Tibbetts. Yesterday, an illegal alien, now charged with first-degree murder, led police to the cornfield where her body was found. The Tibbetts family has been permanently separated. They are not alone.” That message included a brief video of parents whose children were also killed by illegal aliens.","filename":"data/vaneerConsumption/AfterIowaLiesDamnedLiesandFeminism.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/Police_Line_Curb_Police_Tape_3912300267_8c2b94756f_o.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861261.html","title":"After Iowa: Lies, Damned Lies, and Feminism","title_page":"After Iowa: Lies, Damned Lies, and FeminismThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Jessica Valenti is a feminist and a liar, but I repeat myself. A couple of weeks ago, Valenti invited scrutiny of her truthfulness by responding to the murder of a young woman in Iowa. On Aug. 22, the White House issued this statement on Twitter: “For 34 days, investigators searched for 20-year-old Mollie Tibbetts. Yesterday, an illegal alien, now charged with first-degree murder, led police to the cornfield where her body was found. The Tibbetts family has been permanently separated. They are not alone.” That message included a brief video of parents whose children were also killed by illegal aliens.\nMs. Valenti, a columnist for the Guardian and author of several feminist books, responded with an obscenity, calling the White House message “f—king disgraceful,” and then added this remarkable statement: “The deadliest demographic for American women isn’t immigrants — it’s husbands & boyfriends. But the truth about who kills women in this country isn’t politically useful for the White House.”\nWell, since Ms. Valenti has invited an examination of the demographics of murder, let us ask: Who is killing whom in America?\nIt so happens that I’ve previously researched this question, and can say with certainty that Ms. Valenti’s insinuation — that the typical American woman is in danger of being murdered by her boyfriend or husband — is absolutely false. Murder is a rare crime, and the homicide rate has declined significantly in the United States in recent decades. According to the FBI’s Crime in the United States report, there were 15,070 homicide victims in 2016, of whom 11,821 (78.4%) were male. In other words, for every woman murdered in America, 3.63 men were murdered. The fact that male homicide victims outnumber female victims nearly 4-to-1, however, is not something feminists bother to mention when ranting against “male violence.” And as I say, murder is a rare occurrence. While 15,070 homicides a year is a large number, the U.S. population is about 325 million, which means that the average American has less than a 1-in-20,000 chance of being murdered in a typical year.\nContrary to Ms. Valenti’s paranoid anti-male fear-mongering rhetoric, American women are not very likely to be murdered by their boyfriends, by their husbands or by anyone else, for that matter. Because more than three-quarters of murder victims are male, the average American woman’s boyfriend or husband is far more likely to become a homicide victim than she is.\nHaving clarified that matter, now let’s step away from statistical analysis long enough to put human faces on this problem. After all, it is Ms. Valenti who says she wants us to know “the truth about who kills women in this country,” so who are the women getting killed and by whom? Here are a few murder cases that have made headlines in the past month:\nMurder is a rare crime, as I say, but there are still more than 40 homicides on an average day in America, so this sample of recent incidents of murdered women is just the tip of a much larger iceberg, and guess what these cases have in common? None of the accused perpetrators were white, and nearly all the victims were also either black or Hispanic.\nYou see, although Ms. Valenti declares her desire to tell “the truth about who kills women in this country,” feminists routinely ignore violence against women if they don’t find the cases “politically useful.” Some victims are more equal than others, according to the political calculations of feminists, whose commitment to “intersectionality” blinds them to certain realities of crime in America.\nWho is most likely to be murdered and by whom? Of the 15,070 U.S. homicide victims in 2016, more than half — 7,881 (52.3%) — were black. As to the perpetrators, the FBI reports: “When the race of the offender was known, 53.5 percent were Black or African American, 43.9 percent were White, and 2.6 percent were of other races.” Black people are 12.7% of the U.S. population, and are over-represented in murder statistics — both as victims and perpetrators — by a factor of more than 4-to-1.\nIt is true, as Ms. Valenti says, that immigrants aren’t the most likely killers of women in America, and the death of Mollie Tibbetts was statistically anomalous in several ways. First of all, she was both white and female. According to the FBI, white females are less than 13% of U.S. homicide victims (by comparison, black males are nearly 45% of victims). Beyond that, Tibbetts was murdered near a small town in rural Poweshiek County, Iowa. The vast majority of homicides in America occur in a comparative handful of urban areas, so that in 2014 just 5% of U.S. counties accounted for more than two-thirds of the country’s murders, and 54% of counties had zero murders. According to researcher John R. Lott Jr., “the highest numbers [of homicides are] concentrated in areas around major cities like Chicago and Baltimore.”\nMurder is a crime that does not happen randomly. The incidence of murder is disproportionately concentrated both in terms of geography and demographics. What made the murder of Mollie Tibbetts so newsworthy was precisely because it was unusual — “man bites dog,” as they say, an atypical victim of an atypical crime. Yet the crimes committed by illegal aliens are a factor that must be considered in discussions of immigration policy, because the American people have a choice as to which foreigners we should add to our population.\nHere’s a fact that Jessica Valenti might wish to share with her readers: Of the top 10 cities in the world with the highest per-capita murder rates, half of them are in Mexico; the rest of the top 10 are in Brazil or Venezuela. Of the 50 cities with the highest murder rates, only four (St. Louis, Baltimore, New Orleans and Detroit) are in the United States; all the rest are either in Latin America or South Africa.\nWill women be safer in the U.S. if we have more immigration or less? Whatever the actual numbers of immigrants, or which countries the new arrivals come from, wouldn’t it make American women safer if all the immigrants came via legal channels, so that they could be screened and scrutinized? Or should we just do as Ms. Valenti’s left-wing Democrat allies insist, “abolish ICE” and take in whoever happens to show up?\nIt is a falsehood — a lie — for Jessica Valenti to imply that the boyfriends and husbands of U.S. women are “the deadliest demographic,” as if the average American man were a dangerous criminal. We know for a fact that more than half the counties in the United States don’t have even a single murder in a typical year, and overall rates of homicide here are far lower than in most cities in Mexico and other Latin American countries. Ms. Valenti’s dishonest insinuation about “who kills women in this country” is a species of libel, a form of hate propaganda that is not only anti-male, but also anti-American. She should be ashamed of herself, but if she had any sense of shame, she wouldn’t be a feminist, would she?","url":"https://spectator.org/after-iowa-lies-damned-lies-and-feminism/"}
