{"authors":[],"date_download":"2018-10-30 21:47:01","date_modify":"2018-10-30 21:47:01","date_publish":"2016-12-21 20:42:00","description":"Christmas came early for a Virginia couple when they welcomed a set of quintuplets this month after dealing with a pair of miscarriages.","filename":"data/vaneerConsumption/After2miscarriagesfamilywelcomesquintuplets.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_after-miscarriages-family-welcomes-quintuplets__1540936021.html","title":"After 2 miscarriages, family welcomes quintuplets","title_page":"After 2 miscarriages, family welcomes quintuplets","title_rss":"NULL","source_domain":"ajc.com","text":"Christmas came early for a Virginia couple when they welcomed a set of quintuplets this month after dealing with a pair of miscarriages.\n>> Read more trending stories\n\"I have a very odd relationship with hope,\" new mother Margaret Baudinet said Wednesday at a news conference. \"After you suffer two miscarriages – and I think women who have been through that understand – it's really hard to get excited about a pregnancy. As soon as I would get excited, something bad would happen, in my experience.\"\nOn Dec. 4, Baudinet gave birth to four girls and a boy at St. Joseph's Hospital and Medical Center in Phoenix.\n\"I thought with five kids, maybe one would survive,\" Baudinet said. \"We tried really hard to kind of manage our excitement until we thought we might actually have a family at the end of this.\"\nUpdated photos from Day One Posted by Margaret Bolton Baudinet on Sunday, December 4, 2016\nAfter going through two miscarriages, Baudinet and her husband, Michael Baudinet, opted for fertility treatments. Afterward they learned Margaret Baudinet was pregnant with five children.\n\"When I found out I was stunned and I don't think I talked for about four weeks,\" Michael Baudinet said.\nStill, the couple decided to keep all five children.\n\"This is something that we've wanted for a really long time,\" Margaret Baudinet said.\nIn September, thee Baudinets picked up their lives in Virginia and moved temporarily to a rental in Arizona. They took the plunge to work with renowned multi-birth specialist Dr. John Elliott.\n\"He was the first person who really was about to explain to us, 'This is how this can be managed. This is how this can be done,'\" Michael Baudinet said.\nMargaret Baudinet said she was expected to gain between 80 and 100 pounds over the course of her pregnancy.\n\"While it sounds fun to gain that much weight and eat as much as you can, it wasn't,\" she joked. \"I think Chiptole was my go-to.\"\nIn June of 2016, Michael and I learned I was pregnant with quintuplets (five children!). Despite the risks and... Posted by Margaret Bolton Baudinet on Sunday, December 4, 2016\nShe gave birth by caesarian section on Dec. 4, with about 24 doctors and nurses helping to ensure the process went smoothly.\n\"Everything went very smoothly,\" said Dr. William Chavira, one of the three surgeons to help on Dec. 4. \"It was pretty much a routine caesarian section except for instead for there being one baby, it was like a clown car. They just kept coming.\"\nIt was the first time since St. Joseph's was founded 121 years ago that the hospital delivered quintuplets.\n\"We call them our Christmas miracles,\" said Patty White, president and CEO of St. Joseph's Hospital and Medical Center.","url":"https://www.ajc.com/news/national/after-miscarriages-family-welcomes-quintuplets/QWsDrqIa6X6mXElM2ZhwoL/"}
