{"authors":["Tera Dahl"],"date_download":"2018-10-30 20:34:53","date_modify":"2018-10-30 20:34:53","date_publish":"2014-07-21 02:09:05","description":"ERBIL, Iraq - The last Christian reportedly left Iraq's second largest city of Mosul at 12:00pm on Saturday, ending over 6,000 years of Assyrian history |","filename":"data/vaneerConsumption/After2000YearstheLastChristianisForcedtoLeaveMosul.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Peace/2014/Terrorism/isis-flag-youtube-afp.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2014_07_20__1540931693.html","title":"After 2,000 Years, the Last Christian is Forced to Leave Mosul","title_page":"After 2,000 Years, the Last Christian is Forced to Leave Mosul | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"ERBIL, Iraq – The last Christian reportedly left Iraq’s second largest city of Mosul at 12:00pm on Saturday, ending over 6,000 years of Assyrian history in the city. Assyrians have lived in Mosul for over 6,000 years, converting to Christianity over 2,000 years ago. This all came to an end on Saturday, when the last Assyrian Christian left the city.\nOn Thursday, July 17th, the Islamic State (IS)– formerly the Islamic State of Iraq and al-Sham (ISIS)– released a statement demanding the Christians in Mosul either to convert to Islam, paying the jizya (tax on non-Muslims), leave the city, or be killed. The threat was to be implemented on Saturday. It is being reported locally that by noon yesterday, every Christian had chosen to leave.\nHere in Erbil, about an hour an half away from Mosul by car, I have spoken with families who were forced to flee. They describe how ISIS invaded their homes, taking whatever they wanted, and threatening to kill them. The estimates are that over 500,000 refugees have fled Mosul after Islamists took control on June 10th, and the few remaining Christians left yesterday.\nOne group of Christians I spoke with said that when ISIS first invaded Iraq, they portrayed themselves as armed humanitarians but then they quickly undercut that message by implementing strict Sharia law, such as making women wear the full burqa and banning all western clothing. Those Muslims who stayed behind are being forced to comply with the new puritanical laws and now they, too, are trying to leave the city.\nOne resident of Mosul I spoke with said, “It is like the Taliban in Afghanistan before the U.S. invasion.” There, Al Qaeda created the safe-haven from which they launched the 2001 attacks of 9/11 against the United States.\nSome Iraqi Christians had called on the international community to help create a protected zone in Ninevah Province so as to provide protection for all minorities around the city of Mosul and to provide protection from future attacks by IS. While the proposal for a new Ninevah Province has been submitted to the Iraqi Parliament, it was not finalized. Because of the inaction both inside Iraq and the failure of the international community to heed the threats against Christians, the majority of the refugees who have just fled Mosul remain in danger of being attacked once more by IS as it continues its jihadi blitzkrieg across Iraq and Syria.\nSeveral people I have spoken to in Iraq reported that members of IS speak foreign languages and are not from Iraq only. One person said an IS member was speaking an Afghan language and wearing Afghani clothing. Another person said they heard dialects from Pakistan, Libya, and even English.\nEveryone I have spoken with has expressed their frustration with the international community’s lack of response to the crisis facing the people of Iraq. They blamed the United States for creating the current situation and for leaving the country so quickly and so creating the vacuum for IS to exploit. Many also think that it was a serious mistake for the U.S. to “give Iraq to Iran,” allowing Tehran to have a major influence in the Iraqi Parliament.\nAnother local told me he thought it was strange and nonsensical that the U.S. and European countries were opposed to IS in Iraq, but supporting IS groups in Syria and other violent groups against local governments. They warned of the danger such groups pose to the West. “These jihadists will eventually go home to their countries, to Canada, England and the U.S.” said one.\nAnother group of Christians commented on how bad it would be for Iraq if the country split up or were divided. They warned that if Iraq splits into several smaller countries, it will create a domino effect in the whole Middle East, affecting Lebanon, Syrian, Jordan, Turkey, Israel, and Egypt, creating a wave of civil wars. “We fear the U.S. is not supporting the unity of Iraq,” I was told, “But we want to see our country remain as one nation of diverse people, as it has been in history.”\nSince the U.S. invasion in 2003, over 1 million Christians have been exiled from Iraq, leaving only around 300,000 left in the country.\nTera Dahl is the Executive Director of the Council on Global Security","url":"https://www.breitbart.com/national-security/2014/07/20/After-2-000-Years-the-Last-Christian-is-Forced-to-Leave-Mosul/"}
