{"authors":["John Nolte"],"date_download":"2018-10-30 21:21:21","date_modify":"2018-10-30 21:21:21","date_publish":"2016-02-22 21:20:26","description":"During a campaign rally over the weekend, Donald Trump took another one of his glorious swipes at our dishonest media. If we are to believe the reporting |","filename":"data/vaneerConsumption/AfterProvokingTrumpSupportersMediaComplainsAboutNameCalling.json","image_url":"https://media.breitbart.com/media/2016/02/GettyImages-509884176.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2016_02_22__1540934481.html","title":"After Provoking Trump Supporters, Media Complains About Name-Calling","title_page":"After Provoking Trump Supporters, Media Complains About Name-Calling | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"During a campaign rally over the weekend, Donald Trump took another one of his glorious swipes at our dishonest media. If we are to believe the reporting from MSNBC’s Katy Tur (always a risky prospect), out of thousands in the crowd, one screamed at the media, “You’re a bitch,” and another offered “the double bird.” Outraged tweets from many in our elite media soon followed.\nTo be clear, while the “double-bird” is kind of funny, I’m not okay with anyone calling anyone a “bitch,” especially a woman. But as you read the outrage below, keep this in mind: The DC Media started it. For years, the elite media have provoked these everyday American Trump supporters with hate campaigns and name-calling. Now watch as our media gets all wobbly when just a smidgen of the hate they dish out with mendacious glee comes home to roost:\n—\nTrump trashes press. Crowd jeers. Guy by press ‘pen’ looks at us & screams “you’re a bitch!” Other gentleman gives cameras the double bird. — Katy Tur (@KatyTurNBC) February 21, 2016\n—\nDonald Trump’s nasty rhetoric about the media is getting dangerous https://t.co/Al951fvGmi pic.twitter.com/dgj5VM4NfG — Chris Cillizza (@TheFix) February 22, 2016\n—\nThe campaign rhetoric needs to be ratcheted back. This is outrageous and dangerous behavior https://t.co/Qi4eAQxkgb — Chuck Todd (@chucktodd) February 21, 2016\n—\n(In defense of Chuck Todd, Tur is a colleague and he has called journalists “snobs” over their dismissal of the Trump phenomenon.)\n—\n@chucktodd Was he wearing a brown shirt? This is what strong men and mobs look like. Very easy to whip them up — Jennifer Rubin (@JRubinBlogger) February 21, 2016\n—\nThe Washington Post’s Callum Borchers grabbed his left-wing pearls and cried out, “Donald Trump’s virulent rhetoric about the media is getting dangerous.”\n—\nNew York Times Magazine writer Robert Draper puncture this “dangerous” nonsense.\n—\nReporters being jeered at isn’t “dangerous.” This isn’t Mexico. This isn’t the civil rights era. And this isn’t new. https://t.co/ZAizRvtUbC — Robert Draper (@DraperRobert) February 22, 2016\n—\nFor almost a decade, primarily to protect Barack Obama and push his destructive agenda, the DC Media have relentlessly taunted and provoked these same people. Simply for disagreeing with Obama’s agenda, these everyday Americans have been smeared as racists, xenophobes, homophobes, stupid, low-information, sexists, knuckle-draggers, and even compared to anti-Semites and Nazis.\nAnd then there is this breathtaking hypocrisy….\nKeep in mind that this is the exact same made that ensured President Obama paid no political price after his team accused Mitt Romney of murder in 2012; the exact same media that looked the other way when Obama said, “If they bring a knife to the fight, we bring a gun” and “argue with neighbors, get in their face“; the exact same media that downplayed the beating Kenneth Gladney just hours after a top Obama official called on supporters to “Hit back twice as hard.”\nYes, these are now the very same people playing guilt-by-association with Trump because a couple of yahoos at his rally are hating them right back.\nAgain, I’m in no way condoning calling Tur or anyone else a “bitch, but if you don’t want to be called names, don’t start it — don’t provoke with your own hateful name-calling.\nFollow John Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/the-media/2016/02/22/after-provoking-trump-supporters-media-complains-about-name-calling/"}
