{"authors":[],"date_download":"2018-10-22 23:25:06","date_modify":"2018-10-22 23:25:06","date_publish":"2014-09-27 00:00:00","description":"In Detroit, Cody High School's football team was always the visitor. On Friday, they dedicated their new field with a game that honored its name.","filename":"data/vaneerConsumption/After7YearsFinallyAFootballFieldOfTheirOwn.json","image_url":"https://media.npr.org/assets/img/2014/09/26/footballimg_0428_wide-3f485b7047eb4580c86071dd453ccb4303bf1154.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=351878527_1540250706.html","title":"After 7 Years, Finally, A Football Field Of Their Own","title_page":"After 7 Years, Finally, A Football Field Of Their Own : NPR","title_rss":"NULL","source_domain":"npr.org","text":"SCOTT SIMON, HOST:\nThe football team at Cody High School in Detroit never had a home game for seven years. Their own field was in such miserable shape they had to play on the fields of other teams. Well, that changed last night. Michigan radio's Tracy Samilton reports on the Cody Comets first game on their new field.\n(SOUNDBITE OF FOOTBALL GAME)\nCHEERLEADERS: (Cheering) Let's go, Cody.\nTRACY SAMILTON, BYLINE: High school football fields don't get much better than this. The virgin AstroTurf is all springy under your feet and the neon yellow goalposts stretch up into the blue September sky. The Comets should be playing well. They're not.\n(SOUNDBITE OF FOOTBALL GAME)\nUNIDENTIFIED COACH: (Yelling) Backup, backup, backup. Backup.\nSAMILTON: At halftime, the score is zero to zero against archrival Henry Ford. And this year the Comets are supposed to be a much better team. Coach Calvin Norman tells his assistant coaches don't blame the players.\nCALVIN NORMAN: We can't coach because that's coaching out there. We look terrible, we look awful.\nSAMILTON: Meanwhile, team captain Jayvonte Ball is disappointed in his teammates.\nJAYVONTE BALL: We got to play like we want it, the people who made the field working harder than us. They work way harder than us man.\nSAMILTON: In fact it was really hard-work, raising nearly a million dollars for this field, and it almost didn't happen. Chris Lambert is CEO of Life Remodeled, the group in charge of an ambitious volunteer makeover of Cody High School and its surrounding neighborhoods. He says a new football field was a priority but they were $300,000 short on the last day of fundraising.\nCHRIS LAMBERT: Forty-five minutes before I get on stage, a family comes up to me and says do you still need that 300,000? I said, yeah.\nSAMILTON: Lambert figures they'll want the field named after themselves, the Walrich family, Walrich Field.\nLAMBERT: They get out a checkbook. They write a $300,000 check and they say we want to call it Hope Field.\nSAMILTON: Anyway halftime is ending. Maybe it was the stern speeches, maybe it was this prayer by Reverend Bob Shirock, whose suburban Detroit church has adopted Cody High.\nREVEREND BOB SHIROCK: We pray the world would hear that Detroit is rising from the ashes and that stories like Cody would prove that.\nSAMILTON: Whatever it is, the Cody Comets after halftime are different team. They quickly score.\n(SOUNDBITE OF FOOTBALL GAME)\nCROWD: (Cheering).\nSAMILTON: And score again\n(SOUNDBITE OF FOOTBALL GAME)\nCROWD: (Cheering).\nSAMILTON: And again.\n(SOUNDBITE OF FOOTBALL GAME)\nCROWD: (Cheering).\nSAMILTON: Now, we've all seen those corny movies about the team picking itself up and coming back to win. This is just like that. The Comets end up winning the game 24 to zero. And just like that, a field named Hope earns its name. For NPR News, I'm Tracy Samilton.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=351878527"}
