{"authors":["Felicia Mello","Dan Morain"],"date_download":"2018-10-30 23:44:51","date_modify":"2018-10-30 23:44:51","date_publish":"2018-07-19 04:33:01","description":"A UC tuition decrease amounts to only $60 per year. But the change is a sign of new collaboration between university officials and student leaders.","filename":"data/vaneerConsumption/AftertuitionbattlesUCofficialsandstudentleadersunitetopursuecampus.json","image_url":"https://calmatters.org/wp-content/uploads/20180718_154941-600x416.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540943091.html","title":"After tuition battles, UC officials and student leaders unite to pursue campus","title_page":"After tuition battles, UC officials and student leaders unite to pursue campus | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"The tuition decrease University of California regents approved this week amounts to only $60 per year—about the cost of a single used textbook.\nBut what may be more significant about the cost rollback at California’s top public university is the way student leaders found out: on a conference call with university budget staff.\n“They got on the line and were like, ‘We think we can roll back tuition and here’s why,’ ” said Caroline Siegel Singh, vice president of external affairs for UC San Diego’s student association.\nThe call was part of an increasingly collaborative relationship between UC officials and elected student leadership since the two groups lobbied arm in arm this spring for more funding for cash-strapped campuses.\nUC signed a memorandum of understanding with the University of California Student Association in June that it will consult with them monthly on university budget issues and give the student group at least 30 days’ notice before proposing any tuition increases.\nAt UC regents’ bimonthly meeting today, student association leaders gave a presentation on how they had mobilized dozens of students to testify at state budget hearings, flooded legislators with phone calls and leveraged social media with the hashtag #FundTheUC.\nThe strategy paid off. Gov. Jerry Brown signed a budget for the 2018-2019 year that boosts support for UC by nearly $350 million—though much of that is in one-time funds.\n“I think your advocacy was extraordinary. I think the way you organize and the message you delivered is the reason why we’re sitting here today so much better than we were a year ago,” regent Sherry Lansing told students.\nThe love-fest was a far cry from the often-adversarial relationship between student activists and regents in the past. One reason: UC has needed student voices to make a compelling case to legislators jaded by university financial scandals.\nThe partnership with students came about because of “some of the attitudes in the Legislature about the university and the sense that we needed to address those,” said board of regents chair George Kieffer. Kieffer said he is making a point to attend student association meetings so the discussion can continue.\n“UC’s adapting because they’re realizing that what’s been done in the past wasn’t working,” said Siegel Singh.\nDespite the new collaboration, regents’ meetings can still be a forbidding environment for some students. Police barricades surrounded the conference center on UCSF’s Mission Bay campus where Wednesday’s meeting took place. Public comment began at the decidedly non-student-friendly hour of 8:30 a.m. and wrapped up in less than two hours.\nUC Berkeley undergraduate Stephanie Luna, there to ask regents to divest from companies involved in the Trump administration’s immigration crackdown, said the $60 tuition reprieve wouldn’t affect her much. “When the cost of attendance is about $30,000 a year—even more for out-of-state students—$60 is pocket change,” she said.\nBut the slight decrease after years of tuition hikes was a symbolic victory, said Max Lubin, a Berkeley graduate student and former Obama administration staffer who founded the student lobbying group Rise, Inc to fight for tuition-free college. The group has brought a sheen of professionalism to students’ grassroots organizing, incorporating as a 501(c)4 and offering paid fellowships for students to do advocacy work.\n“If we continue to do what we did this year,” Lubin said, “we can roll tuition back, and we can roll it back to zero.”\nThis story and other higher education coverage are supported by the College Futures Foundation.","url":"https://calmatters.org/articles/uc-tuition-decrease/"}
