{"authors":[],"date_download":"2018-10-30 19:41:53","date_modify":"2018-10-30 19:41:53","date_publish":"2018-09-07 18:09:52","description":"Canton council members voted 4-2 to approve that downtown become a restaurant district that allows open containers with restrictions, according to Channel 2 Action News. The ordinance runs a year, starting on Oct. 1 in the Cherokee County city.","filename":"data/vaneerConsumption/AfterhoursofdebateCantoncouncilOKsopencontainersdowntown.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/09/07/Videos/4478013.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_after-hours-deba_57bb0bf4c9ca5a56cf9fdf72ce9945b7__1540928513.html","title":"After hours of debate, Canton council OKs open containers downtown","title_page":"After hours of debate, Canton council OKs open containers downtown","title_rss":"NULL","source_domain":"ajc.com","text":"Folks in downtown Canton will soon be able to walk around with a 16-ounce drink and a chaser of some rules.\nCanton council members voted 4-2 at its Thursday meeting to approve that downtown become a restaurant district that allows open containers with restrictions, according to Channel 2 Action News. The ordinance runs a year, starting on Oct. 1.\nThe television station reported that the ordinance was modeled off the ones in Smyrna and Woodstock.\nThe ordinance covers downtown from 5 to 10 p.m. on Fridays and Saturdays. The to-go containers must be plastic and marked with a date by the server.\nMore places to drink! | SunTrust Park: The rules of open-container tailgating at Braves games\nA group of folks against the effort formed a prayer circle in front of city hall before the meeting.\n“I don’t want my children to be exposed or our church members or others to be exposed to a way of life that is destructive for many families in our county,” The Reverend Fred Goodwin told Channel 2.\nBill Abernathy, a local resident, was worried about the youth.\n“It’s going to bring a different element to the town when you got drinking, walking around on the streets. It will entice young people to get involved,” Abernathy said.\nIn all, the station reported, there were three hours of public comment for and against the vote.\nREAD | Marietta residents will get to vote on Sunday ‘brunch bill’\nCorey Shupert, the owner of Downtown Kitchen inside the open container area, saw the vote as an opportunity.\n“I’d like for y’all to give us a chance to prove that we can do this right in a responsible way,” Shupert told the council.\nAdded resident Gary Lamb: “We’re all adults here, we can all make our own decisions. It’d be a great benefit to our city, the growth of our city, the family activities of our city and make our downtown a destination place.”\nHere’s the ordinance:\nLike Cobb County News Now on Facebook | Follow us on Twitter","url":"https://www.ajc.com/news/local/after-hours-debate-canton-council-oks-open-containers-downtown/CU5D9a7AQyX1eispyAHfqI/"}
