{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:03:42","date_modify":"2018-10-30 21:03:42","date_publish":"2016-12-29 15:07:10","description":"TEL AVIV - Palestinian President Mahmoud Abbas imposed conditions on resuming peace talks with Israel, saying an end to settlement construction and an implementation of existing agreements were necessary in order for the Palestinians to return to the negotiating table.  | Israel / Middle East","filename":"data/vaneerConsumption/AfterRefusingNegotiationsforYearsAbbasSuddentlySaysHesReadytoTalkWithCertainConditions.json","image_url":"https://media.breitbart.com/media/2016/05/abbas.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_12_29__1540933422.html","title":"After Refusing Negotiations for Years, Abbas Suddently Says He's Ready to Talk With Certain Conditions","title_page":"After Refusing Negotiations for Years, Abbas Suddently Says He's Ready to Talk With Certain Conditions | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Palestinian President Mahmoud Abbas imposed conditions on resuming peace talks with Israel, saying an end to settlement construction and an implementation of existing agreements were necessary in order for the Palestinians to return to the negotiating table.\n“The minute the Israeli government agrees to cease all settlement activities… and agrees to implement the signed agreements on the basis of mutual reciprocity, the Palestinian leadership stands ready to resume permanent status negotiations on the basis of international law and relevant international legality resolutions… under a specified timeframe,” he said in a statement following a speech on the Middle East peace process by Secretary of State John Kerry.\nThe Palestinian leader was “fully convinced that a just, comprehensive and lasting peace can be reached in all core issues” and he would “continue to cooperate closely with France, which plans to convene next month an international peace conference, in order to guarantee the launching of a credible peace process.”\nAbbas has in the past refused to resume peace talks, even when Israel implemented a 10-month settlement freeze at President Barack Obama’s behest in 2009. Despite Obama’s insistence that there be no preconditions for talks – and Abbas’ agreement to those terms as recently as September – the PA chairman has continued to makes demands of Israel, including calling for terrorists to be released from Israeli prisons.\nAbbas’s Foreign Minister Riyad al-Maliki called Kerry’s remarks that Palestinians are willing to accept Israel as a Jewish state “unacceptable.”\nHamas, meanwhile, criticized Kerry’s claims that the terror group is ignoring the humanitarian crisis in Gaza by favoring weapons over infrastructure.\n“As the occupation has the right to own a large military arsenal and buys warplanes, Hamas and other Palestinian resistance groups also have the right to develop the needed abilities to confront the occupation,” Hamas spokesman Abdulatif al-Kanou said.\nPrime Minister Benjamin Netanyahu said Kerry’s speech was “a big disappointment” in that it was “skewed” and “obsessive” regarding settlements.\nNetanyahu slammed Kerry for drawing a “false moral equivalence” between settlement construction and Palestinian terrorism. According to the prime minister, Kerry was only “paying lip service” when he condemned terrorism.","url":"https://www.breitbart.com/middle-east/2016/12/29/abbas-reacts-to-kerry-by-imposing-preconditions-for-talks-with-israel/"}
