{"authors":["Associated Press"],"date_download":"2018-10-23 01:21:33","date_modify":"2018-10-23 01:21:33","date_publish":"2017-03-16 11:14:17","description":"THE HAGUE, Netherlands (AP) - Dutch voters showed Europe that populism isn't always inevitable.The disappointing showing by firebrand Geert Wilders in the...","filename":"data/vaneerConsumption/AfterDutchrejectpopulismwillotherEuropeansfollow.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/21/wire-230883-1489700982-934_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319710_After-Dutch-reject-populism-Europeans-follow_1540257693.html","title":"After Dutch reject populism, will other Europeans follow?","title_page":"After Dutch reject populism, will other Europeans follow? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"THE HAGUE, Netherlands (AP) - Dutch voters showed Europe that populism isn't always inevitable.\nThe disappointing showing by firebrand Geert Wilders in the Netherlands election has energized traditional parties across Europe from left and right. But it's unlikely to extinguish the anti-immigrant, anti-establishment sentiment that has been blazing around Europe.\nMark Rutte, the Dutch prime minister who had pushed the electorate through five years of tough economic measures, emerged victorious in a bruising battle with Wilders, whose relentless invective against all things Muslim and anything from the European Union failed to earn him the breakthrough that many had come to count on as a given.\nFrench far-right presidential candidate Marine Le Pen, sings the French national anthem with invited guests in Paris, Monday, March 13, 2017. The first French presidential ballot will take place on April 23 and the two top candidates go into a runoff on May 7. (AP Photo/Michel Euler)\nAfter boosts in Britain and the United States over the past year and Wednesday's setback in the Netherlands, populism now heads to France for its next test of political viability. Now it is for Marine Le Pen of the National Front to carry the torch in presidential elections starting next month.\nWhen French, German, Italian and Bulgarian voters cast ballots in the year ahead, they won't be out to mimic Dutch voters. Instead, they'll be driven as much by local issues as global concerns.\nThe challenge now for candidates like France's Le Pen is to keep up the momentum of her gospel against immigrants, the political elite and European unity. It has resonated so widely that she's likely to come out on top of the first round of presidential voting April 23, though is much less likely to win the May 7 final round.\nAnd the challenge for Europe's more moderate candidates - like Le Pen's chief rival, independent Emmanuel Macron - is to reconnect with voters alienated by European Union bureaucracy and frustrated by economic stagnation. They could also take some lessons from the Dutch.\n\"Mark Rutte just highlighted the fact that, when you deliver clear speech, when you explain what you do, what your constraints are in your country, you can defeat the extremes,\" Macron said Thursday.\nLe Pen, unusually, didn't comment on the Dutch vote result.\nIn the wake of the victory of Donald Trump as U.S. president in November, Wilders surged, and at one point looked like he could get close to one of four Dutch voters behind him. Now, instead of becoming the biggest party in the Netherlands, Wilders was a very distant second, with barely 13 percent of the vote.\nInstead Prime Minister Rutte was the toast of most of Europe, where he and other officials expressed relief at proof the populist tide could be weakened, if not stopped.\nRutte said he now wants to listen to the people who felt disenfranchised in their own nation, but was glad the dominos pushed over by the \"wrong kind of populism\" had been halted.\nSuch was the relief that German Chancellor Angela Merkel called to congratulate him at a time when only exit polls were in.\nThe Dutch election was \"a good day for democracy,\" she said during a speech in Berlin on Thursday. \"I was very glad, and I think many people are, that a high turnout led to a very pro-European result.\"\nGermany holds a general election next September when the virulent anti-immigrant Alternative for Germany party is expected to enter Parliament for the first time.\nSuch is the threat of populism that German Social Democrat leader Martin Schulz immediately looked beyond the historic defeat of his Dutch left-wing political comrades and congratulated Rutte - a paragon of free trade and tough austerity.\n\"Wilders failed to win the Dutch elections. I am relieved,\" Schulz said.\nAnother socialist did likewise. French President Francois Hollande congratulated Rutte for his election success and his \"clear victory against extremism.\"\nHe said that \"the values of openness, respect for others, and a faith in Europe's future are the only true response to the nationalist impulses and isolationism that are shaking the world.\"\nThere also was relief in the European Union. \"The Dutch elections are a perfect start for the electoral year because the populists and the anti-Europeans failed,\" said Manfred Weber, the leader of the EU's Christian Democrat EPP group.\n___\nCharlton reported from Paris.\nPrime Minister Mark Rutte of the free-market VVD party speaks to his supporters after exit poll results of the parliamentary elections were announced in The Hague, Netherlands, Wednesday, March 15, 2017. (AP Photo/Patrick Post)\nFirebrand anti-Islam lawmaker Geert Wilders prepares to cast his vote for the Dutch general election in The Hague, Netherlands, Wednesday, March 15, 2017. (AP Photo/Peter Dejong)\nPrime Minister Mark Rutte of the free-market VVD party celebrates after exit poll results of the parliamentary elections were announced in The Hague, Netherlands, Wednesday, March 15, 2017. (AP Photo/Patrick Post)","url":"https://www.dailymail.co.uk/wires/ap/article-4319710/After-Dutch-reject-populism-Europeans-follow.html"}
