{"authors":["Neil W. Mccabe"],"date_download":"2018-10-30 19:54:23","date_modify":"2018-10-30 19:54:23","date_publish":"2016-08-02 14:35:03","description":"The founder of the government spending watchdog Open the Books told SiriusXM host Stephen K. Bannon on Breitbart News Daily on Monday that instead of spending millions on fancy artwork, the Department of Veterans Affairs should present art created by veterans themselves. | Politics","filename":"data/vaneerConsumption/AfterExposingVAs20MArtSpreeWatchdogGroupSaysShowcaseVeteransArtwork.json","image_url":"https://media.breitbart.com/media/2015/12/VA-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_08_02__1540929263.html","title":"After Exposing VA's $20M Art Spree, Watchdog Group Says Showcase Veterans' Artwork","title_page":"After Exposing VA's $20M Art Spree, Watchdog Group Says Showcase Veterans' Artwork | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The founder of the government spending watchdog Open the Books told SiriusXM host Stephen K. Bannon on Breitbart News Daily on Monday that instead of spending millions on fancy artwork, the Department of Veterans Affairs should present art created by veterans themselves.\nNobody can tell a story about being a veteran like a veteran, said Adam Andrzejewski, the founder and CEO of Open the Books (OTB), the government watchdog that posts and research government tax and spending records.\nMany therapy programs that help veterans recovery from Post Traumatic Stress Disorder, brain injuries and other challenges include art as part of the treatment, he said.\nAndrzejewski told Bannon, the Executive Chairman of Breitbart News, that OTB’s researchers went through 10 years of records from VA that covered fiscal years 2004 through 2014.\n“What we found was that over the course of 10 years, more than $20 million was spent on art and $16.2 million was spent during the Obama administration,” he said. President Barack Obama took office in 2009.\n“It’s absolutely stunning,” he said. “Probably the most stunning detail was the $670,000 spent on a pair of sculptures for a facility in California that treats blind veterans.”\nOther examples of the VA’s art spending spree include $6.3 million in taxpayer funds expended at the Veterans Affairs Palo Alto Health Care System.\nThere, $483,000 went for a large decorative rock and $807,000 was for the site preparation for the rock outside the building. Inside the center, the VA built a $330,000 half arc in the lobby of the mental health clinic, spent $365,000 for a sculpture at the entrance to the pool, and $305,000 for a sculpture in the center’s main lobby.\nMaybe the most ambitious of the health center’s art programs was the $285,000 spent for the wall of dozens of rocks that light up to spell out quotes by President Abraham Lincoln and First Lady Eleanor Roosevelt in Morse Code.\nThe OTB mission statement is to document “every dime online in real-time,” Andrzejewski said. The watchdog currently has more than one billion individual expenditures posted on its site, including federal agencies and department, 48 of 50 states and more than 40,000 municipalities, counties and other regional authorities.\nOpen the Books is based in Burr Ridge, Illinois, and takes its inspiration from the vigilance for government waste that was the hallmark of former Oklahoma Republican senator Dr. Tom Coburn. Coburn serves at the watchdog’s honorary chairman.\nBreitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6AM to 9AM Eastern.\nLISTEN:","url":"https://www.breitbart.com/politics/2016/08/02/exposing-vas-20m-art-spree-watchdog-says-showcase-veterans-artwork/"}
