{"authors":["Antoinette Siu","Dan Morain","Ben Christopher","Dan Walters"],"date_download":"2018-10-30 22:51:41","date_modify":"2018-10-30 22:51:41","date_publish":"2018-07-06 01:12:09","description":"Democratic legislators said today they’ve settled their differences on net neutrality in California, advancing bills that, if passed, would create the most far-reaching internet regulation since the federal government abandoned its Obama-era regulations.","filename":"data/vaneerConsumption/AfterpublicoutcrylawmakersreviveCaliforniasguttednetneutralitybill.json","image_url":"https://calmatters.org/wp-content/uploads/notebook-1850613_1920.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939901.html","title":"After public outcry, lawmakers revive California’s gutted net neutrality bill","title_page":"After public outcry, lawmakers revive California’s gutted net neutrality bill | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Democratic legislators said today they’ve settled their differences on net neutrality in California, advancing bills that, if passed, would create the most far-reaching internet regulation in the country.\nIn December, the Federal Communications Commission voted to repeal net neutrality protections that ensured internet service providers such as Comcast and AT&T give consumers and partners equal access to the web. Then it jettisoned those rules effective last month, saying they were unnecessary and “heavy-handed” market interference. Critics characterize this as a play by the Trump administration to undermine consumer safeguards.\nCalifornia, if this bill were to become law, would restore the old nationwide net neutrality regulations within the state.\n“The Internet wasn’t broken in 2015, when the previous FCC imposed 1930s-era regulations on Internet service providers. And ironically, these regulations made things worse by limiting investment in high-speed networks and slowing broadband deployment,” said the FCC.\nLast month, net neutrality bill author Sen. Scott Wiener, a San Francisco Democrat, said his bill was “gutted” in a committee hearing chaired by Assemblyman Miguel Santiago, a Los Angeles Democrat. Santiago’s committee elbowed through—without time for comment—amendments stripping out key prohibitions, including one designed to block internet providers from charging its customers access fees, and another intended to bar them from creating “zero-rating” services to steer consumers away from competitor content.\nIn response, Wiener had said he would withdraw the “hijacked” bill if those key protections from the FCC’s regulation were not restored.\nAfter weeks of negotiation along with Los Angeles Democratic Sen. Kevin de Léon, author of a related net neutrality bill in the Senate, and Alameda Democratic Assemblyman Rob Bonta, a coauthor of Wiener’s bill, today reached a deal to advance bills they say provide the same protections for Californians that the FCC temporarily provided to all Americans.\n“We know that the federal government is not going to fix things in the foreseeable future,” Wiener said.\nWithout such regulations in place, internet providers would be free to speed up or slow down services like calls or video streaming, based on who pays for “fast lane” access. Advocates say these practices hurt small businesses and consumers who cannot afford more expensive service. For consumers, that could mean higher prices and fewer choices.\nThe bills by Wiener and de Léon would ban internet companies from charging businesses access fees in order to reach its online customers.\nThey also prohibit “zero-rating” services, which allow internet providers to charge consumers for data when accessing competitors’ content, and interference and manipulation at the point where data enters the network. Without that protection, an internet provider could, for instance, slow down competing video applications to give itself competitive advantage.\n“Generally speaking, the bill is great. They are right that it’s the strongest protection in the country … with the three provisions back,” said Ryan Singel, media and strategy fellow at Stanford University’s Center for Internet and Society.\nHe added that grassroot organizations and consumers rallying for net neutrality regulation got legislators to listen. The gutting of Wiener’s bill sparked thousands of calls to legislators, a flood of social media comments and $14,000 in crowdfunding to install a billboard in Santiago’s district.\n“Basically, we won. Literally, this is what a grassroots effort looks like. When the internet is mad at you, it’s really loud and really hard to deal with. We had three things we wanted to defend and we got all of them back,” Singel said.\nDemocrats know a battle is coming but are hopeful the bills—assuming they win approval of the full Legislature and Gov. Jerry Brown’s signature— will stand up to a legal challenge. Republican leaders, however, have warned from the beginning that such regulation will face litigation from internet companies.\n“To be clear, we are not out of the woods … This is going to be a fight,” Wiener acknowledged.\nThe internet giants have denied that they slow down or throttle internet traffic and violate other net neutrality rules. In an open letter earlier this year, AT&T Chairman and CEO Randall Stephenson said:\n“We don’t block websites. We don’t censor online content. And we don’t throttle, discriminate, or degrade network performance based on content. Period.”\nBut these providers also argue that net neutrality regulation will drive up their costs to operate in the state. They say rural areas are more expensive to provide service in, and this regulation would discourage expanding broadband service there.\nThe Internet Association , an organization representing tech companies like Airbnb and Uber, found broadband business did not slow down after the FCC first adopted net neutrality regulations three years ago. Fixed broadband subscriptions increased 3.5 percent and wireless broadband subscriptions increased 10 percent from June 2015 to June 2016.\nNet neutrality supporters, including labor groups and technology companies like Amazon and Twitter, say a fair and protected web is crucial for workers and businesses relying on open communication and access to do their jobs. More than 20 states have recently introduced bills meant to reinstate the federal net neutrality protections. Washington and Oregon have already passed legislation.\n“California is the world’s fifth largest economy and home to the globe’s most important tech companies,” said Robert Cruickshank, campaigns director of Demand Progress , an internet activism organization based in Washington, D.C. “Passage of this bill will also give huge new momentum to the effort to get the U.S. House of Representatives to follow the U.S. Senate and restore the net neutrality protections the FCC gutted last winter.”\nThe bills have passed the Senate and have until Aug. 31 to pass the Assembly and move to the governor for a signature.\n“What happens now is good old-fashioned politics. Just securing the votes. No more negotiating,” said de Léon.","url":"https://calmatters.org/articles/after-public-outcry-lawmakers-revive-californias-gutted-net-neutrality-bill/"}
