{"authors":["John Nolte"],"date_download":"2018-10-30 21:22:14","date_modify":"2018-10-30 21:22:14","date_publish":"2015-10-14 12:43:43","description":"The national media coordinated a weeklong hate storm last week designed to forever destroy the threat of Dr. Ben Carson, The Scary Black Guy Who Preaches |","filename":"data/vaneerConsumption/AfterWeeklongMediaHateStormCarsonStatisticallyTiesTrump11OverHillary.json","image_url":"https://media.breitbart.com/media/2015/10/ap_ben-carson_ap-photo6-wi.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_14__1540934534.html","title":"After Weeklong Media Hate Storm, Carson Statistically Ties Trump; +11 Over Hillary","title_page":"After Weeklong Media Hate Storm, Carson Statistically Ties Trump; +11 Over Hillary | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The national media coordinated a weeklong hate storm last week designed to forever destroy the threat of Dr. Ben Carson, The Scary Black Guy Who Preaches Self-Reliance — The Apostate Off The Liberal ThoughtPlantation, who for the better part of a polling month has proven to be a real threat to Hillary Clinton. A new Fox News poll shows that the media’s “othering” campaign backfired spectacularly. Carson is now statistically tied with Donald Trump and beating Hillary by +11 points nationally.\nIn the poll, which was taken over the weekend, Trump stands at 24% nationally with Carson right next to him at 23%. Only 13% of GOP voters pick Trump as their second choice, while 18% choose Carson.\nThis is a huge jump for Carson, who just two months ago was losing to Trump 25% to 12%.\nIn a head-to-head match-up with Clinton, she loses to all the GOP candidates. By far, Carson holds the widest lead over the former Secretary of State: a spectacular +11 points, 50% to 39%. That is a stunning +16 point climb for Carson. Back in June (the last time this poll matched him with Hillary), Carson was down -5%, 46% to 41%.\nAs someone who has been critical of some of the things Carson has said in the past, I was close to awed by Carson’s performance over the last week. In the face of the DC media’s obvious enmity towards a black man they see as an political apostate, Carson was remarkably calm, composed, and articulate. Best of all he stood his ground and won every exchange.\nNo matter how desperate the DC media is to fabricate a reality where it is “crazy” to suggest students fight back during a mass-shooting; no matter how desperate the DC media is to fabricate a reality where it is “anti-Semitic” to suggest Nazi-era Jews would have resisted even more had the government not confiscated their guns, the tactic didn’t work.\nIn fact, according to this poll the weeklong 24/7 hate storm relentlessly pushed everywhere but especially on MSNBC and CNN, backfired.\nWhat America saw was a very impressive, thoughtful, and skilled man who not only weathered a racially-motivated media assault but beat it back with reason and facts.\nCarson has become a much-improved candidate over the last few weeks. This should worry the DC media as much as it should Trump.\nIn the Real Clear Politics poll of poll, Carson beats Hillary by +5.6%.\nPlease read Jerome Hudson’s “The Liberal Media Lynching of Dr. Ben Carson.”\nFollow John Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/politics/2015/10/14/after-weeklong-media-hate-storm-carson-statistically-ties-trump-11-over-hillary/"}
