{"authors":[],"date_download":"2018-10-23 04:34:23","date_modify":"2018-10-23 04:34:23","date_publish":"2017-03-10 14:48:09","description":"Ageing badminton legends Lee Chong Wei and Lin Dan have been tenaciously defying the odds on their way to the last eight at the All-England Open.The...","filename":"data/vaneerConsumption/AgeinglegendsdefyoddsatAllEnglandBadmintonOpen.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/14/wire-196499-1489157291-569_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4301538_Ageing-legends-defy-odds-All-England-Badminton-Open_1540269263.html","title":"Ageing legends defy odds at All-England Badminton Open","title_page":"Ageing legends defy odds at All-England Badminton Open | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lee Chong Wei of Malaysia, the three-times All-England champion, has defied the odds to reach the last eight at this year's tournament\nAgeing badminton legends Lee Chong Wei and Lin Dan have been tenaciously defying the odds on their way to the last eight at the All-England Open.\nThe post-Olympics months have brought a surge of young talent who are threatening to paint the courts at the first World Super Series tournament of the year with new patterns and styles.\nBut China's Lin, the 33-year-old three-times Olympic champion, and Malaysia's Lee, 34, the three-times All-England champion, did enough to reach the quarter-finals with hopes of defying the years once more.\nLee -- who delivered a revenge win over Brice Leverdez of France and a beautifully controlled performance against Wang Yzu Wei of Chinese Taipei -- has survived despite a lingering knee injury.\n\"It's been good so far, but I have to put it out of my mind. I compete by paying attention to my condition,\" said Lee, who will bid for a semi-final berth against Tian Houwei, the seventh-seeded Chinese player and a surprise finalist last year.\n\"I'm just glad to be back at one of the most prestigious Super Series tournaments,\" said Lin before his quarter-final clash with Denmark's Viktor Axelsen.\nLin has appeared keen to finish what may well be his final All-England by winning a seventh title at the 117-year old event.\nBut he was presented with by far the hardest quarter-final task - against the imposing and ambitious 23-year-old Dane has been in the form of his life.\nAxelsen's capture of the World Super Series title in Dubai in December and the Olympic bronze in Rio has made him feel he can achieve great things here too.\nBut youth will almost certainly have its day in the women's singles. Six of the quarter-finalists, including the top-seeded Tai Tzu Ying and the Olympic champion Carolina Marin, are aged 23 or younger, and all have improved as they adapted to the cool, slightly drifty conditions.\nThe most notable success by far was that of Marin, who has not won a Super Series title since before the Olympics, and whose second round recovery from a game and 17-19 down against He Bingjiao, the teenaged Chinese hope, revealed how badly she wants to win the All-England title again.\nLike Lee, she too has been troubled by injury. And no-one has displayed more desire to win the title than these two.\nBut Marin is the only one bold enough to say she will win it.","url":"https://www.dailymail.co.uk/wires/afp/article-4301538/Ageing-legends-defy-odds-All-England-Badminton-Open.html"}
