{"authors":[],"date_download":"2018-10-30 00:57:01","date_modify":"2018-10-30 00:57:01","date_publish":"2018-07-02 00:05:06","description":null,"filename":"data/vaneerConsumption/AgentsofSHIELDsBroaderSocioculturalImplicationsForHollywood.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/Agents_of_SHIELD_logo.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861021.html","title":"Agents of S.H.I.E.L.D.’s Broader Sociocultural Implications For Hollywood","title_page":"Agents of S.H.I.E.L.D.’s Broader Sociocultural Implications For HollywoodThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The Marvel movies have captured much of the public mind in recent years, scoring tens of billions of dollars at the box office and entertaining a wide array of audiences. However except for the occasional break such as “Deadpool,” as well as their recent cliffhanger and dark turns, they’ve largely followed a “happily-ever-after…till the next movie” model that plays to a positive optimism.\nI recently had the chance to watch one of Marvel’s many derivative television series, “Agents of S.H.I.E.L.D.,” produced by ABC and Marvel Television, which takes a completely different turn from the primary movies. It is much more gritty and “real,” as in incorporating more of the realities of the nature of military action even amid the science fiction premises.\nAt now over 110 episodes and 5 seasons, since its pilot in September 2013 its seasons have earned Nielsen ratings of between 3.5 to 8.5 million. Created by Joss Whedon, Jed Whedon, and Maurissa Tancharoen, it stars the Marvel-favorite Clark Gregg, Chloe Bennet, Elizabeth Henstridge, Luke Mitchell, Brett Dalton, Henry Simmons, Ming-Na Wen, and many more.\nOne reason why the list of starring characters is difficult to fully list is because of the boldness of the series in doing something that the Marvel movies have often refrained from, namely “killing off” its heroes or other main characters.\nThough the series’ premises are obviously science fiction, the series itself does not hesitate in engaging in far more realistic action sequences and storyline developments.\n“Good” and “evil” characters do not engage as much in standard movie monologues, rather with the action and deaths happening quickly. Casualties happen, on both sides, with them sometimes as sudden and without prior sentiment as they would be on a battlefield.\nThere are few Star Wars “Luke vs. Stormtroopers” style “one hero against a battalion” scenes, rather with a far more sensible interplay of the factors involved in the tactical and strategic situations. Action series and choreographed fights are particularly impressive, especially because they embrace a greater element of realism than their standard movie counterparts.\nThe very nature of “good” and “evil” becomes completely confused as well, as a constant series of frequent betrayals, gray areas, tough decisions, and other complexities make it unclear who is outright “good” and “bad,” even with the series’ heroes.\nWhile there are many action and science-fiction series out there, that Marvel has chosen to begun embracing this variant is a stunning switch in typical cinema and entertainment storylines for such a popular franchise of general interest.\nWhen you take “Agents of S.H.I.E.L.D.” and contrast it to the movies, other fascinating and worthwhile deviations become apparent as well. The “realism” of “Agents of S.H.I.E.L.D.” stands in stark contrast to the nature of movies such as “Thor” whose very scenario describes the story of a large and accessible universe (literally) and “Gods” who act in it. The characters of “Agents of S.H.I.E.L.D.” feel small in comparison, just people trying to do their part amid enormous events and persons moving above their head.\n“Agents of S.H.I.E.L.D.” remains intertwined with the Marvel movies themselves, such as greatly expanding upon the “Hydra” war storyline that begun in movies such as “Captain America: The Winter Soldier.” When events happen in the movies, they often have impacts on the television series too.\nYet beyond the extraordinary writing and production, the series also has sociocultural and political impact within itself. The series has been noted for the bold moves it has made in its truly diverse and empowered cast, yet also not pointing that out but rather accepting it as a seamless normal.\nIn a Hollywood that has often faced criticism over its unwillingness to explore diverse and empowered casts due to worries over audience reaction and market performance, Agents of S.H.I.E.L.D. has shown that you can do it effectively, and profitably, without making it seem awkward or forced.\nI greatly enjoyed watching Agents of S.H.I.E.L.D. and am excited to see where the series continues to develop, amid Marvel’s large current expanded universe of other successful television series such as “Daredevil,” “Jessica Jones,” “Luke Cage,” and more. I am also excited however for the impact Agents of S.H.I.E.L.D. will have on the broader entertainment production community and the push towards embracing all the talent our country has to offer.","url":"https://spectator.org/agents-of-s-h-i-e-l-d-s-broader-sociocultural-implications-for-hollywood/"}
