{"authors":[],"date_download":"2018-10-30 00:58:29","date_modify":"2018-10-30 00:58:29","date_publish":"2015-08-07 00:00:00","description":null,"filename":"data/vaneerConsumption/AgentsofInfluenceHumaAbedinandValerieJarrett.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2015_08_8_4_2015_13_24_1540861109.html","title":"Agents of Influence? -- Huma Abedin and Valerie Jarrett","title_page":"Agents of Influence? -- Huma Abedin and Valerie Jarrett","title_rss":"NULL","source_domain":"americanthinker.com","text":"The finding -- which Abedin has formally contested -- emerged publicly Friday after Sen. Charles E. Grassley (R-Iowa) sent letters to Secretary of State John F. Kerry and others seeking more information about an investigation into possible “criminal” conduct by Abedin concerning her pay….\nSomehow the conclusion by State Department investigators that Huma Abedin, close associate and friend of former Secretary of State and presidential candidate Hillary Clinton, was overpaid by some $10,000 as she worked at a State Department job specifically created just for her, does not surprise. Abedin, who is expected to assume the same Rasputin-like role in a Hillary Clinton administration as Valerie Jarrett does for President Obama, has done very well for herself. As the Washington Post reports :\nThe letters also sought the status of an inquiry into whether Abedin had violated conflict-of-interest laws related to her special employment situation, which allowed her to work simultaneously for the State Department, the Clinton Foundation and a private firm with close ties to the Clintons.\nNice work if you can get it. The Clinton Foundation is neck-deep in allegations of influence peddling and Huma Abedin’s history has raised questions of what influence she herself has been peddling and its influence on America’s disastrous foreign policy of late, particularly in the Middle East. As Investors Business Daily has editorialized:\nAbedin made $135,000 a year as Clinton's deputy, a period in which she is reported to have raked in as much as $355,000 from consulting contracts. Having a pipeline into the Clinton inner circle is invaluable to some. This reminds us of Johnny Chung's famous comparison of the Clinton White House to a subway turn style -- you had to put money in to gain entry. Abedin also has some interesting family connections. Her father is said to be close with the Saudi government's Muslim World League, and her mother is said to be a member of the Muslim Sisterhood. World Trade Center bombing prosecutor Andrew McCarthy wrote in National Review: \"The ties of Ms. Abedin's father, mother and brother to the Muslim Brotherhood are both specific and substantiated.\" The Muslim Brotherhood took power in Egypt with the Obama administration's approval after it had all but abandoned the government of Hosni Mubarak, a long-time ally and friend. It was while Abedin was advising Hillary that State dropped its long-standing policy of having no dealings with the Muslim Brotherhood.\nAs Andrew McCarthy wrote in National Review, Huma Abedin’s family and work history suggests a devotion to Islamic supremacist ideology that may go a long way to explaining our imploding Middle East policy from Baghdad to Egypt:\nMs. Abedin worked for many years at a journal that promotes Islamic-supremacist ideology that was founded by a top al-Qaeda financier, Abdullah Omar Naseef. Naseef ran the Rabita Trust, a formally designated foreign terrorist organization under American law. Ms. Abedin and Naseef overlapped at the Journal of Muslim Minority Affairs (JMMA) for at least seven years. Throughout that time (1996–2003), Ms. Abdein worked for Hillary Clinton in various capacities.\nThe consulting firm Abedin worked for was Tenco Strategies, founded by longtime Bill Clinton aide Douglas Band, with the former President initially serving on its board. Abedin allegedly sent some 7,000 emails on her government account that involved Band.\nSen. Grassley has a particular interest in Abedin’s 2013 designation as an SGE, or “special government employee,” which is a government designation for those who fill “an unmet government need for rare or unique expertise, while allowing individuals to retain their private-sector positions. As we have seen Abedin’s expertise is indeed unique and her simultaneous employment by three employers allowed her a unique position to influence and to peddle influence. As the Washington Examiner reported:\n\"The Committee has learned of allegations that, during your simultaneous employment by the Department of State, Teneo, and the Clinton Foundation, you were solicited for and delivered favors for preferred individuals,\" Grassley wrote to Abedin. Abedin was reportedly among several key aides to Hillary Clinton that hosted email accounts on a private server in the presidential candidate's New York home in violation of federal records laws.\nIf Hillary Clinton wins in 2016, she will presumably assume the same role as Valerie Jarrett does in the Obama administration. Valerie Jarrett undoubtedly had significant input into President Obama’s Munich-like deal with Iran, which kicks the nuclear can down the road to assured detonation over Israel, which Iran continues to threaten to wipe off the map when it is not wishing “death to America”. Her influence over President Obama is legendary:\nThe Iranian-born Jarrett (her parents were American-born expatriates) is the only staff member who regularly follows the president home from the West Wing to the residence and one of the few people allowed to call the president by his first name. Her influence is shown by an account in Richard Miniter's book \"Leading From Behind: The Reluctant President and the Advisors Who Decide for Him.\" It relates that at the urging of Jarrett, Obama canceled the operation to kill Osama bin Laden three times before approving the Navy SEAL mission in Pakistan on May 2, 2011. Seems she was concerned about political harm to Obama if the mission failed.\nThose who refuse to learn from history are condemned to repeat it. Valerie Jarrett’s hold over President Obama is as mysterious as it has proven dangerous. We do nor need another Jarrett in the person of Huma Abedin, whose corruption and influence peddling may be surpassed only by the future president who would put her in a position of power.\nDaniel John Sobieski is a freelance writer whose pieces have appeared in Investor’s Business Daily, Human Events, Reason Magazine and the Chicago Sun-Times among other publications.","url":"https://www.americanthinker.com/articles/2015/08/8_4_2015_13_24.html"}
