{"authors":["Mehreen Kasana"],"date_download":"2018-10-31 01:50:11","date_modify":"2018-10-31 01:50:11","date_publish":"2018-09-13 21:51:03","description":"An Australian schoolgirl's protest against the national anthem has sparked nationwide outrage, including vicious condemnation from politicians. While speaking with local news outlet Nine News on Wednesday, Harper Nielsen said she protested the…","filename":"data/vaneerConsumption/AGirlsAustralianNationalAnthemProtestHasLedToPoliticiansViciouslyAttackingHer.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/8436a586-fada-4fca-a2bc-937e64367fa2-screen-shot-2018-09-13-at-24359-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_a-girls-australian-national-anthem-protest-has-led-to-politicians-viciously-attacking-her-11914621_1540950611.html","title":"A Girl's Australian National Anthem Protest Has Led To Politicians Viciously Attacking Her","title_page":"A Girl's Australian National Anthem Protest Has Led To Politicians Viciously Attacking Her","title_rss":"NULL","source_domain":"bustle.com","text":"An Australian schoolgirl's protest against the national anthem has sparked nationwide outrage, including vicious condemnation from politicians. While speaking with local news outlet Nine News on Wednesday, Harper Nielsen said she protested the Australian national anthem to support indigenous Australians. Taking issue with the anthem's proclamation that Australia is \"young,\" Nielsen said, \"When it says Advance Australia Fair, it means advance the white people. And when it says 'we are young,' it completely disregards the indigenous Australians who were here before us for 50,000 years.\"\nNielsen's parents told Nine News that she had been threatened with suspension by her Kenmore South State School. The school issued a statement later, disputing this claim by Nielsen's parents.\n\"The school has been respectful of the student’s wishes and has provided other alternatives, including remaining outside the hall or not singing during the national anthem,\" the school said. \"At no time did the school suggest that the student would be suspended or excluded for refusing to take part in the national anthem.\"\nOthers in the country have rebuked Nielsen — and in some cases, even called for physically punishing her. Right-wing Sen. Pauline Hanson said that Nielsen ought to be \"taken out\" of Kenmore. \"It's about who we are as a nation, it's part of us,\" Hanson said in a Twitter video posted on Sept. 11. \"Here we have a kid who's been brainwashed and I'll tell you what, I'd give her a kick up the backside.\"\nOthers to condemn the child's protest include Australia's former prime minister Tony Abbott. The previous premier said that Nielsen should \"be courteous\" to local rules. \"If this young lady in question doesn’t want to stand for the national anthem,\" Abbott said, \"well, maybe she can go and find a school where the national anthem isn’t taken seriously but hopefully there wouldn’t be one.\"\nWhile some politicians haven't been so kind toward Nielsen, there are people who support the 9-year-old's protest. This also includes her mother and father, Yvette Miller and Mark Nielsen respectively. Her father told The New York Times, \"Anyone who knows Harper know she’s not a kid who can be brainwashed. She’s a very strong-minded and strong-willed young person.\" Mark himself comes from an academic background as an associate professor of psychology at the University of Queensland.\nNielsen's mother, too, has been vocal in supporting her child. In comments to Nine News, she said, \"We were surprised behaviour such as a passive non-participation might be considered in the same realm as something like bringing a knife to school or being violent towards others.\"\nDarrian Traynor/Getty Images News/Getty Images\nThere are others who've also showered Nielsen with praise and solidarity. Per The Times, aboriginal activist Sam Watson told The Courier Mail, \"Her parents should be congratulated for raising a brilliant, thinking young student who won’t be forced to do something that is against her deeply held beliefs.\"\nAs for Nielsen, the young girl told Nine News that she's not the type to blindly adhere to rules. And she wasn't apologetic about it. \"I'm not someone,\" the Kenmore student said, \"who just obliges by the rules of older people just because they're older.\"","url":"https://www.bustle.com/p/a-girls-australian-national-anthem-protest-has-led-to-politicians-viciously-attacking-her-11914621"}
