{"authors":[],"date_download":"2018-10-30 00:51:52","date_modify":"2018-10-30 00:51:52","date_publish":"2018-06-29 00:05:10","description":null,"filename":"data/vaneerConsumption/AGlobalTradeWarWillDoUsNoGood.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/06/1280px-Donald_Trump_with_G7_2018_sign.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860712.html","title":"A Global Trade War Will Do Us No Good","title_page":"A Global Trade War Will Do Us No GoodThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"President Trump’s trade policies are beginning to have a negative impact both here at home and abroad.\nTake, for example, Harley Davidson’s recent decision to move part of their production overseas after the EU, in response to Trump’s tariffs, raised the tariffs on Harley motorcycles from 6% to a massive 32%.\nThis great American company is being compromised by inbound tariffs on steel and aluminum components and declining demand for its products due to price increases.\nThe U.S. HVAC manufacturing industry is similarly facing rising steel and aluminum prices, along with tariffs on many critical components. Adding to the problem, and surprising to many, a majority of U.S. steel manufacturers have already raised their prices by 25%. Buying American steel is not a solution. Small contractors and consumers are suffering greatly from these large increases in cost.\nPresident Trump’s chief trade adviser, Peter Navarro, and Secretary of Commerce, Wilbur Ross, are leading the charge for tariffs. Ross and Navarro may have good intentions, but they fail to understand that tariffs are taxes on the American people. Ultimately, tariffs undermine manufacturing and service jobs (as can be seen with Harley Davidson), raise prices and reduce economic growth (U.S. GDP is actively slowing due to concerns about the tariffs). In my view, both Ross and Navarro are seriously miscalculating the adverse impact of self-imposed tariffs on our economy. They fail to realize that their “negotiating tool” is presenting major hardships to employees and companies across America.\nAt campaign rallies, many of Trump’s faithful applauded the president’s rhetoric on tariffs but this enthusiasm will wane when jobs are lost. The current reaction by the stock market says it all. Markets don’t react well to ill-defined policy, threats, and uncertainty.\nOn a theoretical level, tariffs defy the basic economic and moral principle of cooperation. All human progress is based on cooperation; the fifty American states are the greatest example of the benefits of free trade, i.e. working together in harmony and being enormously productive.\nIn his 1776 book, The Wealth of Nations, Adam Smith stressed the importance of free trade, and was reinforced for centuries by economists such as David Ricardo, Frédéric Bastiat, and Milton Friedman. These economists stated that free trade provides the highest standard of living and America is the best example of the concept. Our citizens have enjoyed a high standard of living for decades because we have been free traders.\nOnce tariffs are imposed, however, a trade war quickly ensues. These wars are losing battles and impossible to win. Trump’s trade war now involves several countries on four continents, with numerous businesses and industries hurting from the impact.\nTo be fair, President Trump’s point on protecting U.S. intellectual property against China is extremely valid. It seems to me that this point specifically should be the thrust of his argument and his negotiations with China. There are several remedies to this problem, including ending the unfair sharing of technology and controlling federal spending (which China helps fund). These types of solutions would be far more effective and much less dangerous than a global economic trade war.\nBoth the United States and our allies understand that right now and in the long term, China presents our biggest economic and foreign policy challenge. I believe this is where we should find a broad consensus with Europe, Britain, Mexico, and Canada. We need to unite with these longtime partners and work together to become less dependent on China. This will require free trade amongst ourselves and stronger capabilities in American technology and manufacturing.\nPresident Trump was on the right track when he suggested at the G7 meeting that the major industrial nations end all tariffs. Unfortunately, that recommendation fell on deaf ears. We will need to practice more use of persuasion, diplomacy, and carefully planned state visits to achieve these goals.\nI can say that Trump’s recent freemarket policies such as lower taxes and decreased intrusive regulation are creating economic opportunity. The results have been stupendous with very low unemployment, strong economic growth and investments in the future of America. This effort must continue. As we’ve seen, tariffs are not the way to support and bolster Americans. The effects will only worsen as the ramifications of these policies continue to play out in the market.\nNow is the time for the United States to be a strong proponent of free markets and unilateral free trade with the EU, UK, Canada and Mexico. My guess is our trading partners will be more then willing to follow our lead.","url":"https://spectator.org/a-global-trade-war-will-do-us-no-good/"}
