{"authors":["Greg Bluestein"],"date_download":"2018-10-30 01:24:22","date_modify":"2018-10-30 01:24:22","date_publish":"2017-04-10 07:00:29","description":"Republican candidates in Georgia’s crowded special election race have tangled over healthcare...","filename":"data/vaneerConsumption/AGOPsplitoverclimatechangeopensinGeorgiaspecialelection.json","image_url":"https://politics.myajc.com/rf/image/PortalConfig/np-paid/assets/politics.myajc/images/og-share-icon.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/politics.myajc.com/blog_politics_gop-split-ove_7013248afb28e90c8c2a155186906b4c__1540862662.html","title":"A GOP split over climate change opens in Georgia special election","title_page":"A GOP split over climate change opens in Georgia special election","title_rss":"NULL","source_domain":"ajc.com","text":"Republican candidates in Georgia’s crowded special election race have tangled over healthcare policy, tax changes and other divides. But on Sunday a new rift about climate change emerged after a contender running as a Donald Trump loyalist broke with most of the Republican field.\nAt a Dunwoody Homeowners Association forum featuring all 18 candidates in the April 18 contest, most of the leading GOP contenders said it should be up to state and local governments, not Congress, to decide how to reduce the nation’s carbon footprint.\nThat is, until the final candidate on the packed podium spoke up. Bob Gray, a former Johns Creek councilman running as a “willing partner” to Trump, said it was a “national issue” that deserves national attention.\n”To think we can solve this problem on a local level isn’t realistic,” said Gray, adding that a solution requires a need to balance the need for economic growth with emerging technologies. He added that he had no firm position on whether climate change was taking place.\n\"As it relates to global warming, I don't know,\" he said. \"Have any of you looked at the science? All you hear is the debate between one political side and another.\"\nIt was a split with most of the 11 Republicans racing to win what could be a sole spot in a June 20 runoff to represent the suburban Atlanta district.\nIt’s the most competitive contest since Trump’s victory, and it’s widely seen as an early test of his popularity. And Republican groups are pumping millions of dollars into the district, which spans from east Cobb to north DeKalb, to stave off an upset victory from Democrat Jon Ossoff.\nClimate change emerged as a new dividing line among Republican candidates, who have already split over healthcare policy, tax overhaul plans and other debates. Many of the GOP contenders stuck to the refrain that it should be up to state or local governments to combat rising temperatures.\nThat’s what former state Sen. Judson Hill argued, saying that voters he meets are more concerned about jobs and education issues. (\"No one has ever asked me about climate change,\" Hill said of his voter outreach.) Karen Handel, the former Georgia secretary of state, said she sees “Congress’ role as being limited so that state and local government lead the way.”\nEx-state Sen. Dan Moody said the U.S. is starting to combat climate change but praised private industry and not government “bureaucrats” for the shift. And tea party organizer Amy Kremer spoke of her love for gardening before criticizing what she cast as the government’s overreach.\nThose stances brought howls from Democrats. Ossoff said “history will condemn us” if the nation walks away from the 2015 Paris Agreement, the accord that committed nearly every country to reduce pollution.\nAnd Richard Keatley, a military veteran and educator, drew ringing applause from many in the crowd of more than 200 at Dunwoody High School when he panned the GOP responses.\n“Local control to control climate change? I don’t know how that works,” he said, adding: “This isn’t your garden ... it’s a scientific existential garden.”\nHe was then followed by Gray, a conservative who staked out his position: He said it was a “national issue but we have to have a commonsense approach. And we do not have that today.”\nWhen asked in an interview after the forum to elaborate on his stance on climate change, Gray stopped short of calling for specific actions Congress or the president should take, and did not say whether he would support the Paris Agreement. But he said a more holistic approach is needed.\n“We live in a country where we all enjoy the entire country – not one state or another,” he said. “It can’t be solved by one particular state. One particular state does not have the resources to actually look at the science, to actually regulate within their own boundaries.”\nUpdate: In a statement on Monday, Gray's campaign said he \"never accepted the premise of climate change in his remarks\" because of \"inconclusive scientific research.\"\n\"His response was strictly about his concern for the environment as an avid outdoorsman who has seen the first-hand effects of pollution growing up in Buffalo, N.Y. and as a tech executive who has done business in countries like India and China,\" said campaign spokesman Joash Thomas.\n***\nThe candidates also tussled over immigration policy, specifically what should be done with the estimated 11 million immigrants living in the country illegally if Trump succeeds in building some sort of wall on the Mexican border.\nMost of the Democrats called for a broader immigration policy that provides a path to citizenship.\n“The only real solution is comprehensive immigration reform that secures our borders and provides a path to legal status for non-felons who are here without proper legal documentation,” said Ossoff.\nNot surprisingly, Republicans largely took up the opposite side. Bruce LeVell, who led Trump’s diversity coalition, said he backed the idea of “self-deportation” to make life so difficult for those in the country illegally that they’ll leave on their own.\nAnd Handel said she flatly opposed “amnesty” or an automatic path to citizenship.\n“These immigrants have come to our country and blatantly disregarded our laws,” she said. “We cannot, we should not reward that. No amnesty. No ability to vote. Get those borders secure and then deal with that situation. I’m not prepared to talk about hypothetical.”\n***\nThere were only a few barbs between the candidates, and most of them revolved around the growing outside influence in the race. Several candidates invoked Ossoff’s eye-popping $8.3 million fundraising haul and the super PACs that are backing Gray and Handel.\nCalling it a sign of his independence, LeVell said he has rejected a string of outside groups that offered to help him.\n“No one owns me. I’ve totally disavowed all PACs,” the Dunwoody business owner said, urging voters to check out the disclosures online. “You’ll see who owns each candidate. They don’t own Bruce LeVell.”\nAnd David Abroms, a GOP executive running as a consensus-builder, slammed both Ossoff for a flood of out-of-state donations and the Congressional Leadership Fund – a PAC with ties to Speaker Paul Ryan - for running a “disgraceful, disgusting ad” attacking Ossoff by invoking Osama bin Laden.\n“They are using the Sixth District as a political football,” Abroms said.","url":"https://politics.myajc.com/blog/politics/gop-split-over-climate-change-opens-georgia-special-election/MkRHk2VXpII2jifvrAQnAP/"}
