{"authors":["Associated Press"],"date_download":"2018-10-23 03:52:09","date_modify":"2018-10-23 03:52:09","date_publish":"2016-01-11 16:52:56","description":"MANCHESTER, England (AP) — Look out, Premier League: Sergio Aguero is back to fitness, back scoring goals and leading Manchester City's charge to reel in Ars...","filename":"data/vaneerConsumption/AguerobackscoringleadingCitysPremierLeaguecharge.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:22ec3598e49c4c12841db88e5b0fcf3f-3WAQP5SaQH704788ebcf7e1072d7-12_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393137_Aguero-scoring-leading-Citys-Premier-League-charge_1540266729.html","title":"Aguero back scoring, leading City's Premier League charge","title_page":"Aguero back scoring, leading City's Premier League charge | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Aguero back scoring, leading City's Premier League charge\nMANCHESTER, England (AP) — Look out, Premier League: Sergio Aguero is back to fitness, back scoring goals and leading Manchester City's charge to reel in Arsenal in the second half of the season.\nAfter an injury-marred end to 2015, the Argentina striker has been eased back into prime shape in the last few weeks by City manager Manuel Pellegrini, who stepped up Aguero's playing time each game over the festive period.\nAguero, the Premier League's top scorer last season, is starting to deliver once again, either netting or assisting four of City's last five goals. On Saturday, he marked his fourth straight start with a stunning solo goal — a weaving run past three defenders before poking in a finish to set City on its way to a 3-0 win over Norwich in the FA Cup.\nManchester United's manager Louis van Gaal takes to the touchline before the English FA Cup third round soccer match between Manchester United and Sheffield United at Old Trafford Stadium, Manchester, England, Saturday Jan. 9, 2016. (AP Photo/Jon Super)\nNext for the player nicknamed \"Kun\" is Everton in the Premier League on Wednesday, one of the standout games from a full midweek program in England's top division.\n\"When Kun continues playing games and playing more minutes, his performance always improves after he comes back from a long injury,\" Pellegrini said of Aguero, who missed 10 weeks of action from October to December because of two separate injuries and is still on 11 goals for the campaign.\n\"We know he is a top player and when he continues playing, he will arrive at his normal performance. When you have players as important as Sergio it is very important for their teammates, for the manager, for the fans to see them playing every game because he is a player that makes a difference.\"\nThird-place City heads into the game at Etihad Stadium a point behind Leicester and three behind Arsenal in the league, after 20 of 38 matches. With Arsenal at Liverpool, there is a real possibility the two leading title contenders could be tied for points after Wednesday's games.\nCity is in the midst of a heavy load of matches: Seven games in 24 days across three competitions. Because City is playing Everton in the two-legged League Cup semifinals this month — Everton won the first leg 2-1 on Wednesday — the teams are meeting three times in three weeks. The second leg of the semifinals is on Jan. 27.\nHere are some other things to look out for on Tuesday and Wednesday:\n___\nUNITED CRITICISM\nManchester United may have won its last two games to end an eight-match winless streak, but it hasn't stopped the criticism from going manager Louis van Gaal's way.\nAfter the tepid 1-0 victory over third-tier club Sheffield United in the FA Cup on Saturday, former United great Paul Scholes said: \"Every time I come to Old Trafford, it's negative football. Fans are bored, even the players are bored, everyone's bored. You look at the bench and Van Gaal looks bored as well.\"\nThousands of fans left Old Trafford before the end of the third-round match, with United won courtesy of an injury-time penalty by Wayne Rooney.\nAsked why, Van Gaal said Monday: \"They are not thinking that we would score, I think, and maybe also because of the traffic that they leave the stadium a few minutes early.\"\nOn Tuesday, United visits Newcastle, which is third from last and has lost its last four games.\n___\nLIVERPOOL'S INJURIES\nLiverpool had 12 players out injured for its 2-2 draw against fourth-tier Exeter in the FA Cup on Friday, but manager Juergen Klopp's problems have eased slightly for the visit of the league leaders.\nKolo Toure and Mamadou Sakho are available again to give Klopp two recognized center backs to select, while midfielders Jordon Ibe, Jordan Henderson and James Milner also have a chance to return to the squad.\n\"The situation now is better than it was two or three days before,\" said Klopp, who is still without first-choice players Philippe Coutinho, Daniel Sturridge and Martin Skrtel.\nLiverpool is in eighth place, 12 points behind Arsenal.\n___\nKANE FACTOR\nFew can have predicted that a match between Tottenham and Leicester in January would be a meeting of two teams in the top four.\nBut they are there on merit, summing up the erratic nature of this season's Premier League.\nLeicester has failed to win any of its last three league games, suggesting a drop-off in form finally after its surprisingly strong start. Tottenham has lost only twice in the league and looks to be the real deal this season.\nHarry Kane came off the bench to earn Spurs a late 2-2 draw from the penalty spot in Sunday's FA Cup match. Tottenham manager Mauricio Pochettino may not rest him a second time against a disciplined - and dangerous - Leicester side.","url":"https://www.dailymail.co.uk/wires/ap/article-3393137/Aguero-scoring-leading-Citys-Premier-League-charge.html"}
