{"authors":[],"date_download":"2018-10-30 14:28:36","date_modify":"2018-10-30 14:28:36","date_publish":"2017-03-03 22:25:00","description":"Your DeKalb Farmers Market is an Atlanta icon and for good reason. The market provides fresh produce, breads, cheese, meats, seafood and int'l products.","filename":"data/vaneerConsumption/AguidetoDeKalbFarmersMarket.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/28/Images/022817%20DeKalb%20Farmers%20Market%20HS46.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_photos-guide-your-dekalb-farmers-market__1540909716.html","title":"A guide to DeKalb Farmers Market","title_page":"Photos: A guide to DeKalb Farmers Market","title_rss":"NULL","source_domain":"ajc.com","text":"Your DeKalb Farmers Market, located on East Ponce de Leon, is an Atlanta icon.\nThe market launched in 1977 as a small produce stand before moving into its current digs, a massive 140,000-square-foot warehouse in Decatur. According to its website, the market serves over 100,000 customers each week with fresh produce, meats, seafood, breads, beer and wine, cheese, a deli and a restaurant.\nDeKalb Farmers Market dubs itself “a world market”. Indeed, 184 flags from countries around the world decorate the ceilings, greeting shoppers as they enter the market. The employees too hail from all over the world with name tags that state their name, country of origin and which languages they speak.\nProduce is where the market shines with more than 450 varieties of domestic and international fruits and vegetables from McIntosh apples to taro root.\nFresh, cold-pressed fruit and vegetable juice is available behind the produce stands.\nTip: Not sure how to slice that prickly durian fruit you just picked out? You can get it and other unwieldy fruits sliced on-site.\nLive crawfish at DeKalb Farmers Market. ([HYOSUB SHIN / AJC])\nIf you’re a seafood fan, whole fish, fillets and shellfish are available along with live seafood.\nTip: Seafood department employees will clean and fillet your whole fish selection while you wait.\nKossivi Gnassou shows live fish. Customers can select Maine lobster, Dungeness crab, Blue crab, crawfish and catfish. ([HYOSUB SHIN / AJC])\nAnh Vo cuts tuna. ([HYOSUB SHIN / AJC])\nSmoked meat and sausages are made in-house. ([HYOSUB SHIN / AJC])\nBeef, pork and chicken, oh my! Plus lamb, veal, goat, turkey, duck, quail and rabbit. Did we mention that the meat is hormone-free and sourced from free-range farms?\nTip: Kosher and Halal-certified meats are available.\nPoultry selection. ([HYOSUB SHIN / AJC])\nCold cuts sliced just the way you like. Nitrate-free and low-sodium options are available. ([HYOSUB SHIN / AJC])\nDried/cured meat selection. ([HYOSUB SHIN / AJC])\nFreshly baked artisan breads including croissants, baguettes, muffins, focaccia, pita, rolls, loaf cake and bagels. ([HYOSUB SHIN / AJC])\nBread lovers, rejoice! Organic ingredients? Check. No high-fructose corn syrup or preservatives? Check. Pure bread-y goodness and free samples on the weekends? Check and check.\nBonus points: Gluten-free and dairy-free options are also available.\nBaguettes at DeKalb Farmers Market. ([HYOSUB SHIN / AJC])\nGrains from around the world. ([HYOSUB SHIN / AJC])\nSpices for days. ([HYOSUB SHIN / AJC])\nTrying out a new recipe? Head over to the market’s wall of spices for a bevy of domestic and international spices, all at jaw-droppingly low prices.\n([HYOSUB SHIN / AJC])\nPre-made cassesroles. ([HYOSUB SHIN / AJC])\nFor those days when you just don’t feel like cooking, check out the pre-made meals near the frozen foods section including breakfast quiches, lasagnas, macaroni and cheese and stuffed pastas.\nStuffed pastas made in-house. ([HYOSUB SHIN / AJC])\nFresh pasta, sauce and pizza at DeKalb Farmers Market. ([HYOSUB SHIN / AJC])\n([HYOSUB SHIN / AJC])\n([HYOSUB SHIN / AJC])\nNot for the lactose-intolerant. ([HYOSUB SHIN / AJC])\nWhether you just want some shredded American cheese or are a dairy aficionado, the market houses over 500 varieties of cheeses.\nVegan “meats”. Yummy! ([HYOSUB SHIN / AJC])\nVegans: DeKalb Farmers Market hasn’t forgotten about you with a section of faux-meats and faux-cheeses.\nHot food selection. ([HYOSUB SHIN / AJC])\nYou’re probably hungry after all of that grocery shopping. Head over to the hot bar for freshly-cooked international cuisine.\nSalad bar ([HYOSUB SHIN / AJC])\nThe coffee shop. ([HYOSUB SHIN / AJC])\nThe coffee shop is caffeine heaven with beans from over 20 countries and 31 flavor options.\nTip: There is a nut grinder near the coffee station to make fresh almond, cashew or peanut butter on-site.\nCandy, candy, candy. ([HYOSUB SHIN / AJC])\nHave you ever had candy made with real fruit juice? It’s life-changing.\n([HYOSUB SHIN / AJC])\nThe Pastry Shop at DeKalb Farmers Market. ([HYOSUB SHIN / AJC])\nTreat yourself at the pastry shop. All of the items are, of course, made in-house.\nTip: They have red velvet cheesecake. Red. Velvet. Cheesecake.\n([HYOSUB SHIN / AJC])\nFor libations, the market organizes wine and beer by geography and category.\n([HYOSUB SHIN / AJC])\nHawilt Haile works in the floral section at DeKalb Farmers Market on Friday, February 24, 2017. ([HYOSUB SHIN / AJC])\nPick up a custom floral arrangement, live plant or fruit basket from the flower department.\n([HYOSUB SHIN / AJC])\nEco-conscious? An extensive recycling center beside the parking lot collects glass, cardboard, aluminum, steel and paper products.\n([HYOSUB SHIN / AJC])\nDeKalb Farmers Market 3000 E Ponce de Leon Ave, Decatur.\nOpen seven days a week, 9 a.m. to 9 p.m. 404-377-6400, dekalbfarmersmarket.com\nDebit cards, EBT, cash and check are accepted. Credit cards are not accepted.\nRECOMMENDED VIDEO: Making beignets with Chef Nick Melvin, executive chef and partner of Venkman’s","url":"https://www.ajc.com/lifestyles/photos-guide-your-dekalb-farmers-market/KtMULOtw9rd2jWnu2VlYGJ/"}
