{"authors":[],"date_download":"2018-10-30 19:44:35","date_modify":"2018-10-30 19:44:35","date_publish":"2018-08-22 17:27:00","description":"A guide to eating and drinking at Atlanta's Mercedes-Benz Stadium, where Atlanta Falcons and Atlanta United FC play.","filename":"data/vaneerConsumption/AguidetoeatinganddrinkingatMercedesBenzStadium.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/07/21/Videos/4136512.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_dining_guide-_e30515e45adec118eb6af5634bfbe4ed__1540928675.html","title":"A guide to eating and drinking at Mercedes-Benz Stadium","title_page":"A guide to food and drink at Atlanta Falcons' Mercedes-Benz Stadium","title_rss":"NULL","source_domain":"ajc.com","text":"Mercedes-Benz Stadium is host to Atlanta’s favorite teams− Atlanta Falcons and Atlanta United. Ever since the stadium opened in late August 2017, fans have arrived with a winning appetite.\nTo satiate that hunger, the 2 million-square-foot sports facility offers many ways to fill the belly and wet a whistle.\nHere’s what you need to know to eat and drink well at Mercedes-Benz Stadium — on game days and nongame days alike.\nFan-first approach\nAMB Sports & Entertainment Group, subsidiary of AMB Group comprised of the Atlanta Falcons, Atlanta United FC and Mercedes-Benz Stadium, have introduced a fan-first model for the new venue. To improve the fan experience when it comes to food and beverage, it addressed pricing, variety, quality and speed of service.\nAs a result, stadiumgoers will see more affordable food and drinks, plus a breadth of offerings from food service contractor Levy Restaurants and partner restaurants.\nFood options will be plentiful at the new Mercedes-Benz Stadium. One seller of tacos, such as these with barbacoa beef or ancho chicken, will be Fresh Mex in Section 123. CHRIS HUNT / SPECIAL\nCertain operational and design elements should translate to faster lines. These measures include tripling the number of concession stands compared to those at the Georgia Dome, placing free-standing soda stands in the concourses rather than behind concession counters, and using whole-dollar pricing to shave off time at the register for those who pay in cash.\nMuch has been said about the low prices for food and beverages. If you’ve missed that chatter, here’s a recap on the cost of core concession items: Soft drinks and water are $2 and come with unlimited refills. Popcorn as well as hot dogs are priced at $2. Waffle fries, a bag of peanuts, a slice of pizza and nachos with cheese all run $3. A cheeseburger is $5; a basket of chicken tenders with fries is $6. A 12-ounce domestic draft beer, such as Bud Light, is $5.\nMercedes-Benz Stadium officials announced that prices of six items, will be reduced by $1 as the stadium moves into its second year of operation.\nThese will be Mercedes-Benz Stadium’s new prices on the items getting $1 reductions next week: $5 for cheese fries, $7 for Italian sausage, $8 for Shock Top bratwurst, $8 for the ATL Bud burger, $9 for chili cheese fries and $10 for West Nest’s free-range fried chicken sandwich. The new prices, averaging 12-percent reductions, will take effect Aug. 30.\nA large full-service commercial kitchen gears up for the needs of the many during game days and events at the new Mercedes-Benz Stadium. CHRIS HUNT / SPECIAL\nPremium concessions\nOut of a massive kitchen — one twice the size of that at the Georgia Dome — come more chef-driven menu items, a change-up from average stadium fare.\nOn the snack side, there are Bavarian pretzels and pretzel bites served with a house mustard made with Goose Island’s Goose IPA, as well as cinnamon-sugar coated pretzels with cream cheese icing.\nMore substantial hand-held items include a brisket grilled cheese sandwich of braised beef, fontina cheese and barbecue aioli on Texas toast with a side of kettle chips.\nBurgers are hand-packed, and meat, like the brisket piled on an order of burnt end nachos or the barbacoa beef for tacos, is smoked in-house. Pickles, dressings and other condiments — a Bud aioli for the brat burger, for example — are made on-site.\nYou don’t have to love meat to enjoy a burger at the new Mercedes-Benz Stadium. A portobello mushroom burger — a portobello mushroom cap with lettuce, tomato, and herb aioli on a challah bun — will be served at ATL Grill in Sections 107, 133, 210, 234, 318, 338 and 347. CHRIS HUNT / SPECIAL\nThose seeking healthier options can expect a portobello mushroom burger that features the mushroom cap grilled and topped with lettuce, tomato and a swath of herbed aioli on a challah bun. Salads include a chicken Caesar as well as a vegetarian Cobb holding chopped romaine, tomatoes, cucumber, red onion, Gorgonzola cheese and chopped eggs with blue cheese dressing.\nLevy Restaurants’ regional executive chef John Nicely oversees its culinary operations at the stadium. According to Nicely, the kitchen sources meat from Atlanta-based meat wholesaler Halperns Steak & Seafood Co. The majority of produce comes from Georgia farms, he said.\nSports fans can find healthy options at the new Mercedes-Benz Stadium, such as the vegetarian Cobb salad, with romaine lettuce, tomato, cucumbers, red onions, Gorgonzola cheese, chopped eggs and blue cheese dressing. It will be served at ATL Fan Fare in sections 105, 113, 205, 308, 322 and 329. CHRIS HUNT / SPECIAL\nFamiliar names in dining\nYou need your daily dose of Chick-fil-A? You can get that here. King of Pops is your go-to for a frozen pop? You can have that at the stadium, too.\nIn total, nearly a dozen and a half area restaurants and food producers have a presence at the stadium. This “Best of Atlanta” group includes: Bruster’s Real Ice Cream, Chick-fil-A, Delia’s Chicken Sausage, Farm Burger, Fox Bros. Bar-B-Q, Gamechanger, Iberian Pig, Jim ‘N Nick’s, King of Pops, Miss D’s Popcorn, Snackology 101 Market, Sublime Doughnuts and two concepts from Concentrics Restaurants group.\nSpecialty items from these partners can be found on each concourse throughout the stadium, either at a dedicated concession stand or a portable pop-up cart. In addition, items are priced the same at the stadium as at their brick-and-mortar restaurant or on retail shelves.\nAntico Pizza and The Varsity, which both provided food in the first year, have since left the stadium.\n“Both have been great partners and we supported their decisions,” a stadium representative said.\nIberian Pig is one of numerous area restaurants that will have a presence at Mercedes-Benz Stadium. Its two concession stands, both located on the 200-level concourse, will offer a serrano ham sandwich (shown here), pork cheek tacos, and a bacon-wrapped beef dog topped with manchego cheese sauce, crispy onions and a red pepper aioli. CONTRIBUTED BY IBERIAN PIG\nSome partners have developed custom menus for Mercedes-Benz. Spanish tapas restaurant Iberian Pig has pork cheek tacos, a serrano ham sandwich, and a bacon-wrapped beef dog topped with manchego cheese sauce, crispy onions and a spicy red pepper aioli on a poppy seed bun. Its side offerings include Spanish fries of twice-fried potatoes with an accompanying dipping sauce and Ensalada Marcona, a lettuce salad with Marcona almonds, dried cherries, manchego cheese and crisped onions dressed with a Champagne vinaigrette.\n﻿RELATED:\nA few restaurateurs have launched brand-new concepts at the stadium. Fox Bros. mans four stands throughout the venue. One of those, Tex Mex-a-Cue, located on the 300 concourse, is a hybrid that will serve up popular Fox Bros. ‘cue along with Tex-Mex. Items on this brief menu include a trio of a la carte tacos as well as barbecue nachos. Taco choices include chopped brisket with charred tomato salsa, guacamole and cotija cheese, a chopped pork taco with avocado, tomatillo salsa and charred jalapeno slaw, and smoked fried chicken with charred tomato slaw and barbecue sauce. All tacos come on a flour tortilla. Co-owner Jonathan Fox said to watch for an expanded menu that will include quesadillas and a chicken-fried steak taco.\nKevin Gillespie of Gunshow and Revival is the player behind Gamechanger. This concession stand has Gillespie’s personality inflected in a concise menu of sandwiches that include his longtime crowd-pleaser, the Closed on Sunday Chicken Sandwich, plus a French dip and a Philly cheesesteak.\n“I love cheesesteaks, but am torn between melted cheese or cheese sauce, so this one comes with both,” Gillespie said.\nAhead of the stadium’s opening, we take a first-look at and hear from the creators of the food and beverage offerings. (Erica A. Hernandez/AJC)\nFor that French dip, Gillespie swaps beef for slow-roasted Berkshire pork shoulder and serves it a on Holeman & Finch hoagie with horseradish sauce and pork jus for dipping.\nThere’s also one side item: sour cream and onion french fries.\nAll food will be prepared in the Gamechanger kitchen at the stadium, and Gillespie is using the same high-quality products, such as Georgia-raised chicken, that he uses at his restaurants.\nConcentrics Restaurants, the group behind such establishments as Two Urban Licks and Parish, will operate the Golden Brown & Delicious concession. On the roster: a fried mortadella sandwich, cheddarwurst sausage corn dog, fish and chips and other retro edibles given a modern spin.\nConcentrics is also a partner for contemporary Southern-style chophouse Molly B’s, the stadium’s headliner restaurant named in honor of Arthur Blank’s mother. Besides chophouse cuts, look for baby back ribs, fried chicken and barbecue brisket sliders, among the many meat offerings. Molly B’s has multiple menus — one for Falcons games, another for Atlanta United matches and a nongame day menu. All were developed by Concentrics culinary director Michael Bertozzi.\nLocated on the 100-level concourse and with a view overlooking the field, Molly B’s is open to ticket-holders and non-ticketed alike.\nOn Falcons game days, the restaurant will be open only to members three hours prior to kickoff and through the end of the first quarter. It will offer an all-inclusive dining experience, including alcoholic beverages. Molly B’s will close during the second quarter and reopen to all ticket-holders at halftime. (For more about Molly B’s membership, go to mercedesbenzstadium.com/molly-bs/.)\nFor Atlanta United matches, Molly B’s is a members-only club beginning three hours prior to game time. Then, it opens to all ticket-holders and remains open two hours after the soccer game ends.\nThe restaurant opens to the general public on nongame days throughout the year during lunchtime (11:30 a.m.-2:30 p.m.) every day on nongame days, with dinner service to be added at a later date. Entry will be through the stadium’s main entrance.\nChef Juliet Peters (left) and Carrichia Clark of the West Nest, which is operated by local nonprofit Westside Works, stand in front of the hand-breaded free-range fried chicken sandwiches they helped prepare at Mercedes-Benz Stadium. A portion of the proceeds from the West Nest concession in Section 324 will benefit the Westside Works Culinary Arts program, a six-week intensive approach to culinary arts education led by Peters. CHRIS HUNT / SPECIAL\nEat for a cause\nThe concession stand in Section 324 is unique. Dubbed the West Nest, it is operated by local nonprofit Westside Works, which creates employment and job training for residents of Atlanta’s Westside community. A portion of the proceeds from the West Nest concession will benefit the Westside Works Culinary Arts program, a six-week intensive approach to culinary arts education led by chef Juliet Peters.\nThis hand-breaded free-range fried chicken sandwich, with Doux South chow chow and honey hot sauce, will be served at the West Nest in Section 324 at Mercedes-Benz Stadium. The West Nest is operated by local nonprofit Westside Works, which creates employment and job training for residents of Atlanta’s Westside community. CHRIS HUNT / SPECIAL\nThe chicken-themed West Nest stand will be manned by Peters and graduates of the culinary academy. With attention toward sourcing locally, they will turn out such items as a hand-breaded chicken sandwich made with Springer Mountain Farm chicken topped with Doux South chow chow on a challah bun from Engelman’s Bakery. Other menu items include a chicken and waffle bowl with honey hot sauce, and a Hotlanta Chicken Sausage with sauteed peppers and onions on a bun.\n“It doesn’t taste like stadium food,” Peters said of the menu she and her students have developed for West Nest.\nQuench your thirst\nBesides $2 unlimited soda and water ($4 for the souvenir cup) at self-service refill stations, the 21-and-up crowd can expect far greater options than at the Georgia Dome. There are 1,264 beer taps (compared to 30 in the Dome) and 16 “neighborhood bars” where imbibers can belly up to a four-sided bar and take in the action on large-screen TVs.\nStadium officials announced a partnership in with an unnamed Atlanta brewery to sell a new craft beer in the stadium starting with the Falcons’ Sept. 16 home opener. It’ll be sold in concession stands throughout the stadium for $5 (12-ounce draft) and $7 (20-ounce draft).\nSure, you’ll have no trouble finding beer at the new Mercedes-Benz Stadium, but frozen cocktails are an option, too: You can choose a Neighborhood Punch, a frozen mai tai with watermelon rounded with Jack Fire grenadine (far left); or a Signature MBS Margarita, a frozen margarita complemented by a red sangria float (far right); or have them both mixed into a colorful swirl combo (center drink). CHRIS HUNT / SPECIAL\nServed out of frozen drink dispensers at all neighborhood bars are two frozen cocktails: the Neighborhood Punch, which is a twist on a mai tai, and the Signature MBS Margarita topped with a float of sangria.\nLook also for drinks at specialty concessions. Chick-fil-A will offer milkshakes. Gamechanger will have local, craft brews plus a rotation of alcoholic slushies. These include peach tea, basil-lemonade and a riff off a Hurricane, all spiked with Tito’s vodka. Spanish cuisine-focused Iberian Pig will offer a specialty cocktail and serve beer by Creature Comforts and Monday Night Brewing.\nLOOKING FOR FOOD?\nMercedes-Benz Stadium restaurant partners and where to find them in the stadium:\nBruster’s Real Ice Cream: 100 level (southwest and northwest sides), 200 level (northeast and southwest sides), 300 level (southeast, southwest and northwest sides)\nChick-fil-A: 100 level (northwest and southwest sides)\nDelia’s Chicken Sausage: 100, 200 and 300 levels\nFarm Burger: 200 level (northeast side)\nFox Bros. Bar-B-Q: 100 level (east side), 200 level (north side), 300 level (north side); Fox Bros. Tex Mex-a-Cue stand is located on the 300 level (south side)\nGamechanger: 200 level (west side)\nGolden Brown & Delicious: 100 level (southwest side)\nIberian Pig: 200 level concourse (club level, north and south sides)\nJim ‘N Nick’s Bar-B-Q: 100 level (southwest side), 200 level (southwest side), 300 level (south side)\nKing of Pops: roaming carts on all levels\nMiss D’s Popcorn: 100 level (southeast and west sides), 200 level (south side) and 300 level (southeast and west sides)\nMolly B’s Kitchen (the concession stand next to Molly B’s restaurant): 100 level (northeast)\nPapa John’s: 200 level (southeast), 300 level (north side)\nSnackology 101: 100 level (southwest), 200 level (south side), 300 level (northeast side)\nSublime Doughnuts: Delta Sky 360 Club and Mercedes-Benz Club\n﻿--Tim Tucker and Yvonne Zusel contributed to this report","url":"https://www.ajc.com/entertainment/dining/guide-eating-and-drinking-mercedes-benz-stadium/vvEgCIwnL3R4yz4F39OJPI/"}
