{"authors":["Kadeen Griffiths"],"date_download":"2018-10-30 22:26:29","date_modify":"2018-10-30 22:26:29","date_publish":"2014-08-15 17:48:36","description":"\"Bug A Boo\" by Destiny's Child was released in 1999 and recorded in 1998. At the time, Beyoncé, Kelly Rowland, LeToya Luckett, and LaTavia Roberson had no way of knowing how technology was about to explode in the next decade. The '90s were a simpler…","filename":"data/vaneerConsumption/AGuidetoAlltheOutdatedTechnologyinDestinysChildsBugaBoo.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/2abe7053-2c6f-4e20-8d02-5db79b884476.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35961-a-guide-to-all-the-outdated-technology-in-destinys-childs-bug-a-boo_1540938389.html","title":"A Guide to All the Outdated Technology in Destiny's Child's \"Bug a Boo\"","title_page":"A Guide to All the Outdated Technology in Destiny's Child's \"Bug a Boo\"","title_rss":"NULL","source_domain":"bustle.com","text":"\"Bug A Boo\" by Destiny's Child was released in 1999 and recorded in 1998. At the time, Beyoncé, Kelly Rowland, LeToya Luckett, and LaTavia Roberson had no way of knowing how technology was about to explode in the next decade. The '90s were a simpler time, when there was a pay phone on every street corner and no one was asking where you were because just the fact that you were near a phone meant that you were probably at your house. Back then, Beyoncé was still the most talented member of a girl group rather than Beyoncé the winner of Time Magazine's Most Influential Person cover. Like I said, those were simpler times.\nHowever, anyone who was born after the '90s, or around the same time that \"Bug a Boo\" came out, might find themselves incredibly confused if they try to listen to it now. After all, \"Bug a Boo\" references a lot of technology that, quite frankly, no one has heard of anymore. There was a time before iPhones and Skype? Were the Flintstones hanging around then too? For non-children of the '90s — or masochists reading this to truly feel their age — here's a rundown of the incomprehensible old technology that Destiny's Child references in \"Bug a Boo\".\nPager\nThe lyric: You make me wanna throw my pager out the window.\nThe explanation: A pager and a beeper were basically the same thing, but not really. Before the advent of cell phones, if someone wanted to reach you then they would \"page\" you. Your pager would pick up their phone number and a quick message and you could call them back when you were near a phone again. I know, I know. How inefficient, right?\nMCI\nThe lyric: [You make me wanna] Tell MCI to cut the phone calls.\nThe explanation: MCI Communications Corp. was a phone company along the same vein as AT&T and Verizon. In fact, it's got a unique and interesting history, but all that's left of it now was bought by Verizon in 2006. Fun fact — Verizon Wireless' Family and Friends plan actually came from MCI. The more you know.\nBeeper\nThe lyric: It's not hot that you be calling me, stressing me, paging my beeper, you're just non-stop.\nThe explanation: As I said, a pager and a beeper were basically the same thing. The only unique thing that a beeper had going for it was that it beeped whenever someone was trying to contact you. You shut it up by checking the number and then, once again, you called the person back when you got near a phone.\nAOL\nThe lyric: [I wanna] have AOL make my emails stop.\nThe explanation: In the olden days, when dinosaurs roamed the earth, you couldn't be online and use your house phone at the same time. The Internet was a miraculous thing brought to us by AOL who would cut off our phone lines with their incredibly slow dial-up Internet and then a monotone voice would inform us, \"You've got mail\" as soon as we signed on. Nowadays, we have that newfangled wireless Internet and AOL isn't really much of a thing anymore, but back in the '90s that was a big deal.\nRelive the dinosaur days by watching the \"Bug a Boo\" video below.\nDestinysChildVEVO on YouTube\nImage: if-you-judge-a-fish, lonnlove12, ohs090s (2)/Tumblr","url":"https://www.bustle.com/articles/35961-a-guide-to-all-the-outdated-technology-in-destinys-childs-bug-a-boo"}
