{"authors":["April Fehling"],"date_download":"2018-10-22 23:13:58","date_modify":"2018-10-22 23:13:58","date_publish":"2014-05-20 00:00:00","description":"It's commencement. You are responsible for calling hundreds of students, one by one, to the stage. Every parent is anxiously waiting for you to pronounce his kid's name — correctly. What do you do?","filename":"data/vaneerConsumption/AhCommencementCapsGownsAndMispronouncedNames.json","image_url":"https://media.npr.org/assets/img/2014/05/20/istock_000001616993medium_wide-9e6bc0c03bc5ff7c4b28c6a07239ed1f9fa61cfc.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_codeswitch_2014_05_20_313992363_ah-commencement-caps-gowns-and-mispronounced-names_1540250038.html","title":"Ah, Commencement. Caps, Gowns And Mispronounced Names","title_page":"Ah, Commencement. Caps, Gowns And Mispronounced Names : Code Switch : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Ah, Commencement. Caps, Gowns And Mispronounced Names\nEnlarge this image toggle caption iStockphoto iStockphoto\nLast Friday on All Things Considered, NPR's Ted Robbins brought us a college commencement story the likes of which we hadn't heard before: the minefield that awaits the ceremony announcer when he or she is handed a list of students' names.\nA list that said speaker must then read aloud.\nIn front of thousands of eager, excited, tuition-paying parents.\nTed's story is more than just a fun listen. The phenomenon Ted chronicled, from Arizona State University in Tempe, also reflects a changing America. Not to mention that the story will strike a chord with almost anyone who has cringed at hearing his name botched.\nWhat's In A Name? Plenty Of Ways To Make A Mistake What's In A Name? Plenty Of Ways To Make A Mistake Listen · 3:32 3:32\nNot that there aren't plenty of pronunciation pitfalls among European-American last names, mind you. But as the country continues to diversify, so, too, does the list of names on a school's commencement roster.\nIf you missed it, Ted's piece introduced us to Peter Lafford, who annually reads the graduating students' names aloud at Arizona State. He's read more than 30,000 names in the past 15 years, he reckons, and he practices for weeks to prepare.\nHis most challenging names this year, Lafford says, came from the university's school of engineering, where many graduates have names with origins in Asia and the Middle East. The toughest name he's ever tackled, he recalls, came along five years ago — that of a student from Hawaii named Gwendolyn Kamakaokapunanaulaokalani Emmsley. If you'd like to hear that pronounced, you should definitely give Ted's piece a listen.\nEnlarge this image toggle caption Andy DeLisle/Courtesy of Arizona State University Andy DeLisle/Courtesy of Arizona State University\nLucky for Lafford, a tech company (aptly named \"Marching Order\") has devised software to help people in exactly this situation. It allows Lafford to input phonetic pronunciation to help him at game time. He can even ask students to call a phone number to record their name for him to hear and repeat.\nFor the record, my dad was a stickler for name pronunciation; he instilled in me long ago how important it was to get these things right.\nI've had plenty of personal experience with the mangled name. My last name is Fehling, pronounced \"failing.\" Strangers have called me Fell-ling and Feel-ing far more often than they've said my name correctly. And at one point in my life, I received an awful lot of mail for April Sailing, whoever she is.\nBy the way, Lafford's weeks of prep paid off. Dheeraj Chidambaranathan, who just graduated with a master's in computer engineering, said he is so used to having his name pronounced every which way that he answers to almost anything. His mother, however, is understandably a bit more exacting — and was delighted when Lafford nailed it.\nAs Ted noted last week, college is expensive. Students and their parents put a lot of blood, sweat and tears into completing school, an experience that can be life-changing. When someone makes the extra effort to ensure those seconds on stage are seamless, it counts for something.\n\"These students, this is their moment in the spotlight,\" Lafford told Ted. \"You want to get it right.\"\nEditor's note: How about you? Is your name regularly mispronounced — or have you mangled someone else's? If you have a personal story of an epic name pronunciation gone awry, share it in the comments or on Twitter, at hashtag #namebotch.","url":"https://www.npr.org/sections/codeswitch/2014/05/20/313992363/ah-commencement-caps-gowns-and-mispronounced-names"}
