{"authors":["Peter Over"],"date_download":"2018-10-23 01:00:54","date_modify":"2018-10-23 01:00:54","date_publish":"2016-02-19 00:00:00","description":"A new analysis shows that outside groups supporting Ted Cruz have run nearly double the ads of pro-Jeb Bush behemoth Right To Rise USA. Here's how the other candidates stack up leading into Saturday.","filename":"data/vaneerConsumption/AheadOfSouthCarolinaPrimaryBushFallsBehindInTheAdRace.json","image_url":"https://media.npr.org/assets/img/2016/02/19/ap_5910092563181_wide-bd630f369a2ef0d9cf93d2bd8195b1d01b8eef84.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_02_19_467377388_in-final-weeks-bush-superpac-outpaced-in-south-carolina_1540256454.html","title":"Ahead Of South Carolina Primary, Bush Falls Behind In The Ad Race","title_page":"Ahead Of South Carolina Primary, Bush Falls Behind In The Ad Race : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Ahead Of South Carolina Primary, Bush Falls Behind In The Ad Race\ntoggle caption Andrew Harnik/AP\nThe TV ad campaign for Republican Jeb Bush is faltering in South Carolina, where GOP voters go to the polls Saturday.\nA new report by the Wesleyan Media Project finds that the pro-Bush superPAC, Right To Rise USA, aired an estimated 2,664 ads in the state between Feb. 1 and Feb. 14. At the same time, Sen. Ted Cruz's organization — his campaign and two superPACs — ran 4,904 ads. Sen. Marco Rubio's campaign and superPAC aired 3,882 ads.\nThe media buys from Right To Rise mark a sharp reversal. Starting in 2015, Right To Rise has filled South Carolina TV with 15,220 ads, not much less than the grand total for the Cruz and Rubio efforts combined. Right To Rise started this year with $58.6 million in the bank, but it's been burning through the cash as Bush had weak finishes in the Iowa caucuses and New Hampshire primary.\nErika Franklin Fowler, a Wesleyan University political scientist and co-director of the media project, said the spending reflects the growing importance of single-candidate superPACs and outside groups. A candidate is restricted to $2,700 per donor for the primaries. But a superPAC has no fundraising limits.\n\"In this campaign-finance landscape, it is an important vehicle for most candidates,\" Fowler said. \"You're disadvantaged if you don't take advantage of the unlimited fundraising and spending.\"\nEvery Republican candidate except billionaire Donald Trump has at least one superPAC. Rubio's operation also includes a 501(c)(4) \"social welfare\" organization, which, unlike a superPAC, need not disclose its donors. It has spent about $8 million on TV, the media project found.\nDemocratic candidates Hillary Clinton and Bernie Sanders are nearly tied in their TV advertising. Neither of them has benefited from superPAC advertising, but both have well-funded campaigns. (A pro-Clinton superPAC, Priorities USA Action, stepped up its efforts after her loss to Sanders in New Hampshire, but hasn't bought TV time.)\nOverall, Clinton's campaign has run 38,811 ads, Sanders' campaign 38,244 — a sign of how Sanders' small-donor campaign has overtaken Clinton's big-budget operation. The media project says Clinton and Sanders have spent more than $20 million apiece on TV.\nIt's equally tight in Nevada, where Democrats hold caucuses on Saturday. Clinton out-advertised Sanders in the two weeks ending Feb. 14, 2,227 ads to 2,120.\nBut Clinton has more than Sanders to contend with. Over in the Republican primaries, Rubio's operation has run 3,804 ads attacking her, almost twice as many as his attacks on competing Republican candidates. The media project found the No. 1 issue in Rubio TV ads has been Benghazi.\n\"I think it's really remarkable how even Clinton and Sanders have been,\" Fowler said. \"But the caveat: Clinton is taking quite a beating from the pro-Rubio ads that are attacking her, so it's not quite evenly matched if you consider that third factor.\"\nAlthough Rubio himself is the primary target of ads from Cruz, Bush and Kasich, Fowler said, \"His primary focus is Clinton, which suggests he's looking forward, toward the general election.\"\nThe ad numbers and dollar amounts are based on estimates from Kantar Media/CMAG, which tracks broadcast, national network and national cable TV. The Nevada numbers include Reno and Las Vegas broadcast.\nOther highlights of the report:\n- Ad spending in the Republican primaries has tripled since 2008. Candidate committees are actually advertising less, as superPACs and nonprofit groups have emerged as the driving force in the air wars. Outside groups produced 58 percent of all ads so far in the 2016 GOP primaries.\n- Total TV spending by candidates' campaigns and outside groups is an estimated $198.6 million. Nearly 80 percent of the money has been flowing in the crowded GOP contest.\n- Positive messages make up more than 99 percent of ads by Clinton and Sanders, 68 percent of ads from Republican candidates and 26 percent of spots from GOP single-candidate outside groups.\n- In Senate primaries, which ramp up later than the presidential contest, 58 percent of the early TV is by nondisclosing tax-exempt groups. Big spenders include the League of Conservation Voters, Natural Resources Defense Council, the Koch network's Americans For Prosperity and U.S. Chamber of Commerce. Fowler said the groups seem to be more prominent on the air more than 30 days before a primary election — that is, before a pre-election disclosure requirement kicks in.","url":"https://www.npr.org/2016/02/19/467377388/in-final-weeks-bush-superpac-outpaced-in-south-carolina"}
