{"authors":[],"date_download":"2018-10-22 21:27:14","date_modify":"2018-10-22 21:27:14","date_publish":"2014-06-05 12:13:13","description":"As the World Cup approaches, police have pushed much overt drug selling out of the center of Rio, but in the outskirts it’s narco business as usual.","filename":"data/vaneerConsumption/AheadofWorldCupRiosDrugTradeShiftstoOutskirts.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/488996/140605-gp-brazil-drugs-cover-8a_e02d26384ad4243ef6f5f13cecd4076c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_world-cup_ahead-world-cup-rios-drug-trade-shifts-outskirts-n123286_1540243634.html","title":"Ahead of World Cup, Rio's Drug Trade Shifts to Outskirts","title_page":"Ahead of World Cup, Rio's Drug Trade Shifts to Outskirts","title_rss":"NULL","source_domain":"nbcnews.com","text":"In central favelas — which tourists might see — traffickers can no longer sell coke and pot so openly or carry assault rifles. One has to travel far out in the urban jungle to reach such scenes like the one in Antares.\nAt the same time, there’s been limited gentrification of some favelas, with middle-class Brazilians and foreigners buying a few properties around and inside them.\nHowever, the pacification program has been criticized, with police accused of murdering some of the residents they are meant to be protecting.\nIn April, a well-known dancer, Douglas Rafael da Silva, was shot dead in the Pavao Pavaozinho favela, provoking protests that turned into clashes.\nPolice claim they were returning fire with drug traffickers at the time of da Silva’s death and weren’t sure whose bullet hit him. But witnesses in the Pavao Pavaozinho favela told GlobalPost that officers had shot at unarmed youths because they were smoking marijuana.\n“Police are totally unprepared for working in this community,” says Paulo dos Santos, a neighbor and actor, who worked with da Silva.\n“They are the law, but they don’t respect it. We don’t want these type of cops.”\n“They are the law, but they don’t respect it. We don’t want these type of cops”\nOne problem is that the authorities are failing to meet a promise to pair police suppression with new schools and investment in the slums, activists say.\n“There is no social aspect to it,” says Andre Fernandes, who runs a favela news network. “It is a project of power that just criminalizes the poor.”\nAnother complaint is that pacification doesn’t stop the drug trade, but merely shifts it.\nEven in “pacified” favelas, some dealers still sell cocaine, just more discreetly, says police commander Rodrigo Oliveira of the elite CORE unit.\n“The problem is that the drug dealers still exist in these areas,” says Oliveira, who has a bullet embedded in his head from a confrontation with traffickers. “Police occupy the territory but they haven’t arrested the drug dealers or taken their weapons.”\nMeanwhile, the most hardened gangsters can take refuge in “unpacified” favelas such as Antares, which is controlled by a gang called the Comando Vermelho, or Red Command.\nBack at the drug shop, Lucas oversees sales to dozens of customers handing over crumpled bills for bags or vials.\nWith tired eyes, Lucas says he is finishing a 24-hour shift. The drug point takes in thousands of dollars each day, he says, but as an employee of the Red Command he only makes a small percentage.\n“This may look easy but it is hard, stressful work,” Lucas says. “That’s why I look like I am much older.”\nLucas says he has been involved in the drug trade since he was 12 and has been in countless gunfights with police.\nHe tried to get out for a while, hoping to be a professional soccer goalkeeper. But he suffered an injury and took refuge back in the gang.\n“I want to get out, to find a proper job, but it’s hard,” Lucas says. “I know this life only leads to jail or the cemetery.”\nAs night falls in the Antares, residents arrange stacks of speakers for a dance party to electronic music, known as a “baile funk,” which Lucas says the drug dealers have paid for.\nYoung and old come out of ragged homes and shake their bodies to pulsating, distorted beats.\nSeveral gang members stand openly with their rifles, some dancing as they hold them.\nA song comes on with lyrics cheering the drug dealers. The traffickers raise their rifles in the air, shouting along: “Red Command! Red Command! Red Command!”\nThis article first appeared on GlobalPost.\nMore from GlobalPost:\nGermany's green dreams turn brown\nThese maps show where you can still go to jail for apostasy or blasphemy\nVatican continues attack on American nuns as Pope Francis stands by","url":"https://www.nbcnews.com/storyline/world-cup/ahead-world-cup-rios-drug-trade-shifts-outskirts-n123286"}
