{"authors":["Jefferson Grubbs"],"date_download":"2018-10-30 22:31:14","date_modify":"2018-10-30 22:31:14","date_publish":"2014-08-15 14:47:01","description":"One of the best things about anthology shows like FX's American Horror Story is that you have no idea what's going to come next. With Ryan Murphy as the showrunner, we can expect certain things like musical numbers and Jessica Lange (sometimes at…","filename":"data/vaneerConsumption/AHSFreakShowSpoilersStraightFromItsSettingJupiterFlorida.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/0079545f-9ba2-440a-b7dd-1e86e3f545e2.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35749-ahs-freak-show-spoilers-straight-from-its-setting-jupiter-florida_1540938674.html","title":"'AHS: Freak Show' \"Spoilers\" Straight From Its Setting: Jupiter, Florida","title_page":"'AHS: Freak Show' \"Spoilers\" Straight From Its Setting: Jupiter, Florida","title_rss":"NULL","source_domain":"bustle.com","text":"One of the best things about anthology shows like FX's American Horror Story is that you have no idea what's going to come next. With Ryan Murphy as the showrunner, we can expect certain things like musical numbers and Jessica Lange (sometimes at the same time!) — but we really have no idea what shape AHS: Freak Show will take until it premieres in October. Murder House, Asylum, and Coven were all so different in both tone and plot, it's difficult to predict what new twisted ideas Murphy will bring to this fourth installment. So while we (im)patiently bide our time until the Freak Show begins, let's go digging for clues.\nOne thing we know for sure about Season 4, or AHS: Freak Show, is the setting: it will take place in Jupiter, Florida in the 1950s. For a show that's so laden with historical references and cultural significance, you know that Murphy was very careful in his choice of location. So what exactly was it about Jupiter that drew his imagination to the town? Despite currently being the ninth Happiest Seaside Town in America (or so says Coastal Living), it turns out that Jupiter has a bit of a creepy history that should make it perfect fodder for Murphy's horror show.\nWhat's in a name?\nAs we all know, Jupiter is the Roman's chief diety, their equivalent to the Greek Zeus. So how did a coastal town in Florida get named after the ancient king of the gods? Through a mistranslation, as it so happens. It actually stems from the name of the local Native American tribe that once lived where the town is now, at the mouth of the Loxahatchee River. Called the Hobe, this tribe was spelled \"Jobe\" by the Spanish, which an American mapmaker mistakenly recorded as \"Jove.\" Jove is, of course, another name for Jupiter... and the rest is history.\nJupiter was the god of sky and weather, while his brother Neptune was the god of the sea, and his brother Pluto was the god of the underworld. We can probably count on Murphy's version of this peaceful seaside community to exist somewhere at the intersection of sea, sky, and hell.\nJupiter Inlet Lighthouse\nThe most famous landmark of the town is the Jupiter Inlet Lighthouse. Completed in 1860, the 105-foot tower is famous for its red brick exterior. Since it's the most distinctive feature of Jupiter, you can count on seeing the lighthouse at least in establishing shots of the town. But I would bet on the show actually venturing inside at least once, especially since local legend maintains that the beacon is haunted. Visitors occasionally claim to have felt \"ghostly hands\" on their shoulders although nobody was behind them. Spooky...\nThe Chillingworth murders\nHas there ever been a more suitable name for a disturbing homicide case than \"The Chillingworth murders?\" Curtis Chillingworth was an attorney who lived in Jupiter with his wife Marjorie. He was the circuit judge for 32 years until his untimely death in 1955. One evening in June that year, the Chillingworths left a dinner party... and were never seen again, according to Jupiter archives. The case went cold for four years until one of their killers was overheard boasting about the murder. Lucky Holzapfel and Bobby Lincoln abducted the spouses, forced them into a boat, tied weights around their feet, and threw them into the ocean.\nEven more twisted was the fact that this wasn't some random and senseless crime. It turned out that Holzapfel was hired as a hitman by Chillingworth's colleague, Joseph Peel. Peel was a municipal court judge who used his position to abet local moonshiners. When Chillingworth caught onto his corruption, Peel had both him and his wife murdered to keep them quiet. Nasty stuff for one of the Happiest Towns in America, huh?\nThe Wild Man of the Loxahatchee\nChillingworth is far from the only person to have died under mysterious circumstances in Jupiter, Florida. Vince \"Trapper\" Nelson, also known as the \"Wild Man of the Loxahatchee,\" was a renegade hunter who lived on a self-founded zoo by the river. He was famous around town for wrestling alligators and generally being an eccentric but lovable hobo. But when health inspectors shut down his zoo, Nelson withdrew from society, grew paranoid and ill, and was eventually discovered dead in his backyard of a gunshot wound. Nelson's death was officially declared a suicide, although speculation was rampant that he was actually murdered.\nNelson's ghost is said to haunt Jonathan Dickinson State Park, which was founded on what used to be the trapper's land. Although he was living in Jupiter throughout the '50s, he didn't die until 1968, so we may or may not actually meet his ghost this season. But even a live and breathing Trapper Nelson would be a colorful addition to Freak Show's cast of characters. (Nelson's story is made even more unusual by the fact that he and Chillingworth were actually close friends and fishing buddies.)\nNearby Gibsonton, Florida\nSyracuse University professor Robert Bogdan, author of Freak Show: Presenting Human Oddities For Amusement And Profit, maintains that there were no sideshows located in Jupiter during the 1950s. But there is a town just three hours away that is famous for its connection to the circus: Gibsonton, located just south of Tampa and across the bay from St. Petersburg. Many carnies made Gibsonton their home during the winter, even owning the likes of local fishing stores and motels. It's not a stretch to assume that the image of an entire town run by carnival freaks helped inspired Murphy's fictional version of Jupiter.\nMarlene Dietrich\nThe famous German-American movie star may have had no personal connection to Jupiter, but according to Murphy she helped inspired Elsa Mars, Jessica Lange's character on Freak Show. Although she skyrocketed to fame in the 1930s in films like The Blue Angel, Morocco, and Shanghai Express, Dietrich's star quickly began to wane. Thanks to a string of flops, she was declared box office poison and although she never stopped making films, by the '50s she was a shadow of her former self. Throughout that decade she worked almost exclusively as a cabaret artist, first in Vegas and then in London.\nAccording to a newspaper report from 1975, her career ended when Dietrich fell off a stage and broke her leg. Per the New York Times, she died of kidney failure in 1992, at the age of 90. While the last two decades of Dietrich's life were undoubtedly tragic, something tells me that Lange will excel at playing an aging, fading, alcoholic former performer.\nBurt Reynolds\nIt's too bad that Freak Show doesn't take place a couple of decades later, because in 1978, actor and Florida native Burt Reynolds founded a theater in Jupiter, appropriately called The Burt Reynolds Dinner Theatre. Though it only operated until 1997 (when Reynolds declared bankruptcy), the theater was famous for attracting big-name stars who played to sold out crowds. How fun would it be to see someone playing a young, handsome Reynolds, running around Jupiter in all his young, handsome glory? Previous seasons of AHS have employed some time jumps — perhaps part of Freak Show will take place in the '70s. Fingers crossed!\nImages: FX; Allie_Caufield/Flickr; Bureau of Land Management/Flickr; Giphy (4); Google Maps (Screengrab)","url":"https://www.bustle.com/articles/35749-ahs-freak-show-spoilers-straight-from-its-setting-jupiter-florida"}
