{"authors":[],"date_download":"2018-10-30 18:13:50","date_modify":"2018-10-30 18:13:50","date_publish":"2016-05-08 02:14:00","description":"The Fellowship of Christian Athletes held its annual spring fundraiser April 28, this time at The Church at Rock Creek in west Little Rock, and on the heels of the spring Red-White game the Saturday before, when it was all 1970s-1980s Razorbacks nostalgia.","filename":"data/vaneerConsumption/Ahumblelegend.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_may_08__1540923230.html","title":"A humble legend","title_page":"A humble legend","title_rss":"NULL","source_domain":"arkansasonline.com","text":"The Fellowship of Christian Athletes held its annual spring fundraiser April 28, this time at The Church at Rock Creek in west Little Rock, and on the heels of the spring Red-White game the Saturday before, when it was all 1970s-1980s Razorbacks nostalgia.\nThe night began with a barbecue buffet dinner provided by Corky's Ribs & BBQ. The church's pastor, the Rev. Greg Kirksey, gave the invocation, and fellowship director Chuck Beale introduced Horace Moseley of Mills High, and Emily Stokes of Cabot Junior High, who gave testimonies. A video montage reinforced the mission of the nonprofit, to spread Christianity among school-age athletes.\nFormer Razorbacks linebacker and the night's master of ceremonies, David Bazzel, joined a sty of former football standouts, Muskie and Leotis Harris, Ron Calcagni, Kevin Scanlon, Jimmie Walker, Bert Zinamon and others, and a couple of basketball stars, too (Joe Kleine and Marvin Delph for sure).\nScanlon gave a moving remembrance for Razorbacks walk-on quarterback Mike Scott, who later became a banker and president of the Fellowship of Christian Athletes. He died Feb. 13.\nBazzel, Scanlon and Calcagni took turns sharing their memories of Coach Lou Holtz. Scanlon's go all the way back to his senior year in high school, when Holtz arrived to recruit him. \"I thought they'd sent the chemistry professor to recruit me.\"\n\"You talk about Christian principles,\" Calcagni said. \"He had us memorize a prayer. Every pre-game meal, we said this prayer, and I would love to join the teammates again to say this prayer.\"\n\"This is the beginning of a new day,\" it began. \"God has given me this day to use as I will. I can waste it, or use it for good. ... The future is just a whole string of nows.\"\nFor Holtz's part, he kept his speech funny and unpredictable. He riffed on memories and standout players -- \"Gary Anderson could turn out the light and get into bed before it's dark. Anderson can play tennis by himself.\"\nBut he seemed to prefer to inspire people's Christianity. He said, \"I don't know how a black cow eats green grass and makes white milk and yellow cheese,\" and \"How come sick people go to a pharmacy and have to walk way to the back to get their prescription, but anyone can go right to the counter and buy cigarettes?\" by way of saying -- he just doesn't get people who don't get God and Jesus Christ.\n\"The human brain is just too complicated to be an accident,\" he said, furthering his point, and \"11 of 12 apostles died as martyrs. You don't die for a lie.\"\n\"Gotta be honest with you, if I knew this was going to be about Lou Holtz, I would not have come. I'm humbled,\" but the highlights are \"the past. I did this for a great cause, FCA.\"\n-- Story and photos by Bobby Ampezzan\nHigh Profile on 05/08/2016","url":"https://www.arkansasonline.com/news/2016/may/08/a-humble-legend-20160508/"}
