{"authors":[],"date_download":"2018-10-23 02:00:43","date_modify":"2018-10-23 02:00:43","date_publish":"2017-03-19 00:00:00","description":"Aid workers have reached the rebel-held town of Madaya, Syria after being cut off for months. They found starving residents and devastation. Lulu Garcia-Navarro talks with Ingy Sedky from the ICRC.","filename":"data/vaneerConsumption/AidReachesSyrianTownAfterBeingCutOffForFiveMonths.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2017_03_19_520708125_aid-reaches-syrian-town-after-being-cut-off-for-five-months_1540260043.html","title":"Aid Reaches Syrian Town, After Being Cut Off For Five Months","title_page":"Aid Reaches Syrian Town, After Being Cut Off For Five Months : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Aid Reaches Syrian Town, After Being Cut Off For Five Months\nAid workers have reached the rebel-held town of Madaya, Syria after being cut off for months. They found starving residents and devastation. Lulu Garcia-Navarro talks with Ingy Sedky from the ICRC.\nLOURDES GARCIA-NAVARRO, HOST:\nThis past week, some 56 trucks from the Syrian Red Crescent arrived in Madaya, Syria, a rebel-held town of 40,000 that had been cut off from aid for five months. Members of the convoy from the United Nations and the International Committee of the Red Cross found appalling conditions and starving residents. Ingy Sedky was there. She's a spokeswoman for the ICRC, and she joins us via Skype from Damascus. Welcome.\nINGY SEDKY: Thank you.\nGARCIA-NAVARRO: Can you tell us about the operation? What did you see when you got to Madaya?\nSEDKY: Well, the humanitarian situation there is really, really dire. Already - I was there last time in September 2016, people were already suffering a lot, for example. It was freezing cold in the town, and people were starting, like, to burn their own furniture or blankets because basically there is no fuel in the city, so they were burning their own belongings in order to to keep a little bit warm. But this time when I went, they even people - they were running out of anything to burn.\nAnd speaking about food, take it into consideration that cooking gas is not available in the town. People were putting the rice or the grains that they have for food in a little bit of water and leaving it under the sun for a couple of hours so it can become a little bit tender to be eaten. This is beyond shocking.\nGARCIA-NAVARRO: Well, what supplies did you bring them to the people?\nSEDKY: This time, we managed to bring some medicine, some food parcels. Basically, it included, like, ready-to-eat meals - hummus, tuna - so they can eat it, like, on the spot without necessarily having the need to cook the food.\nGARCIA-NAVARRO: Did you speak with anyone? Can you tell us one of their stories?\nSEDKY: Well, I spoke to some kids and asked them what they wished for. They wished only, like, to eat an egg or to drink some milk. This is something that are nowhere to be find in Madaya, and people are just in dire need to have just the simple things, like to go to school, to eat an egg or to drink milk.\nGARCIA-NAVARRO: How were you able to coordinate with the Syrian government and the rebels?\nSEDKY: Yeah. We wait until they allow us, like, to access this town and to bring in humanitarian aid. But the thing is we wait between six months or four months to be able to bring aid from either for this town or the other towns, and this is too long. And people - they are so tired, and all they want is to end the suffering which has been lasting for quite a while now. And no human can bear this kind - or endure this kind - of suffering for long.\nGARCIA-NAVARRO: Ingy Sedky is a spokeswoman for the ICRC, and she joined us from Damascus. Thank you very much.\nSEDKY: Thank you.\nCopyright © 2017 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2017/03/19/520708125/aid-reaches-syrian-town-after-being-cut-off-for-five-months"}
