{"authors":[],"date_download":"2018-10-22 22:43:29","date_modify":"2018-10-22 22:43:29","date_publish":"2014-06-10 21:57:10","description":"One of AIG's top executives will take over as CEO, replacing Robert Benmosche, who led the company's effort to repay its government bailout.","filename":"data/vaneerConsumption/AIGsaysCEOWillStepDowninSeptember.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/500631/140610-aig-mms-1805_87f70c9f9af1b8492f27d7190e5ec1d3.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_business-news_aig-says-ceo-will-step-down-september-n127791_1540248209.html","title":"AIG says CEO Will Step Down in September","title_page":"AIG says CEO Will Step Down in September","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nInsurer AIG says one of its top executives will take over as CEO on Sept. 1, replacing Robert Benmosche, who steered the company's effort to repay its government bailout.\nAmerican International Group Inc. said Tuesday that Peter Hancock would become president and CEO and join the board.\nHancock, 55, is an executive vice president and CEO of AIG's property casualty unit. He joined AIG in 2010 after 20 years at J.P. Morgan, where he established the bank's global derivatives group.\nSign up for top Business news direct to your inbox.\nThe New York-based insurer said that Benmosche was expected to also resign from the board and take on an advisory role with the company.\nBenmosche, 70, became CEO in August 2009. He led AIG's effort to repay its $182 billion bailout from the federal government at the height of the 2008 financial crisis. AIG has also been restructuring and selling off businesses, cutting its size in half.","url":"https://www.nbcnews.com/business/business-news/aig-says-ceo-will-step-down-september-n127791"}
