{"authors":[],"date_download":"2018-10-22 21:41:51","date_modify":"2018-10-22 21:41:51","date_publish":"2014-05-07 22:22:18","description":"Former “American Idol” contestant Clay Aiken continued to hold a narrow lead late Wednesday in the Democratic primary for a North Carolina congressional seat.","filename":"data/vaneerConsumption/AikenClingstoSlightLeadinNCHousePrimary.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_20/427951/140507-clay-aiken-jms-2050_17f9e590b07858f80011ad16f85d5778.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_elections_aiken-clings-slight-lead-nc-house-primary-n99821_1540244511.html","title":"Aiken Clings to Slight Lead in NC House Primary","title_page":"Aiken Clings to Slight Lead in NC House Primary","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFormer “American Idol” contestant Clay Aiken continued to hold a narrow lead late Wednesday in the Democratic primary for a North Carolina congressional seat, though his opponent is not ready to concede the race.\nLess than 400 votes separated Aiken and textile entrepreneur Keith Crisco in the race to become the Democratic nominee for the state’s Republican-leaning 2nd Congressional District.\nA spokesperson for the North Carolina State Board of Elections said the current tally does not fall within the 1 percent or less margin required for a candidate to call for a recount, but there are still absentee ballots that could narrow the gap.\nCanvassing begins Tuesday when each county in the district will verify final results. It a statement, Crisco said he wants “officials to have an opportunity to tally the votes and provide a report on their canvass activities” before conceding.\nCrisco has until Wednesday at 5 p.m. next Wednesday to request a recount.\n“This was a very close contest, and as we continue to count the votes, we are more and more excited about our campaign's ability to move forward and be victorious in November,” Aiken said in a statement.\n-- NBC's Andrew Rafferty contributed to this report.","url":"https://www.nbcnews.com/politics/elections/aiken-clings-slight-lead-nc-house-primary-n99821"}
