{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 23:05:27","date_modify":"2018-10-30 23:05:27","date_publish":"2016-10-26 08:00:00","description":"The one shred of power Republicans hold in the California statehouse—enough seats to block Democratic lawmakers from a “supermajority”—is on the brink in","filename":"data/vaneerConsumption/AimingforsupermajorityCaliforniaDemocratsplayTrumpcard.json","image_url":"https://calmatters.org/wp-content/uploads/Supermajority.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940727.html","title":"Aiming for supermajority, California Democrats play Trump card","title_page":"Aiming for supermajority, California Democrats play Trump card | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"The one shred of power Republicans hold in the California statehouse—enough seats to block Democratic lawmakers from a “supermajority”—is on the brink in this election.\nAlready California is one of only seven states in which Democrats control the legislature and the governor’s office (as compared to 23 states where the GOP holds both). Here, Republicans no longer hold a single statewide office. What they do have is enough seats to block Democrats from a two-thirds majority—meaning that Democrats can’t raise taxes or pass certain kinds of bills without some bipartisan support.\nBut even that modicum of clout could slip away at the polls next month. The Republican share of California’s registered voters has dwindled to just 27 percent. Demographics, voting trends and turnout at the polls all threaten to cut even further against the GOP here. And of course there’s the elephant in the room: Donald Trump, a presidential nominee quite unpopular in California.\nIf the state emerges after Nov. 8 with a Democratic supermajority, the only consolation prize for conservatives will be the reality that some of those Democrats will be moderate, pro-business types willing to buck liberals in their own party.\nBut that doesn’t much cushion the fall for Republicans—the once-dominant party of Ronald Reagan, now struggling to maintain a voice in Sacramento.\n“What already looked to have been a very steep uphill challenge for legislative Republicans in California is now looking like an almost insurmountable obstacle,” said Dan Schnur, director of the Unruh Institute of Politics at the University of Southern California, who spent decades working for Republican politicians. “There is simply not enough information available to voters about most Assembly and Senate candidates to disassociate them from the top of the ticket…\n“Most voters translate that ‘R’ next to their name as ‘Friend of Trump.’”\nDemocrats hope to capitalize on that perception, and are paying for ads linking Trump to Republican lawmakers: One portrays Trump as the puppet master of Assemblywoman Young Kim of Fullerton; another shows Trump and Rancho Cucamonga Assemblyman Marc Steinorth as two sides of the same coin; and a third claims Trump and Manhattan Beach Assemblyman David Hadley possess “shared values.”\nThe attacks may not be fair—Steinorth and Hadley have publicly said they’re not voting for Trump—but that hasn’t deterred Democrats.\nWith a long campaign stoking fears of immigrants and insulting Latinos, Trump has given California Democrats plenty of fodder. Latinos outnumber whites in California, home to more immigrants than any other state. Earlier this month, several Democratic legislators staged an event to mobilize Latino and immigrant voters by deploying taco trucks on several Los Angeles street corners—a jab at the Trump supporter who made headlines by ominously predicting that would be America’s future unless Trump was victorious.\n“Donald Trump has had a significant impact on lots of folks in California. His vision for America is something that a lot of folks are rejecting. Anyone associated with his ideas is in trouble now,” said Democratic Assembly Speaker Anthony Rendon, who has been campaigning for Democrats in swing districts. “It’s fair to compare the political stances of California Republicans with the individual who is at the top of their ticket.”\nHis Republican counterpart called the attacks linking California lawmakers to Trump “more than ridiculous,” but acknowledged that Trump’s candidacy is making a tough situation worse. “It is having a negative impact… It makes these races more competitive than they otherwise would be,” said Assemblyman Chad Mayes of Yucca Valley, who leads the GOP caucus.\nThe top of the presidential ticket might not seem to have much bearing on the makeup of the California Legislature, but new research suggests that presidential politics play a surprisingly influential role in how voters pick state legislators.\nEven without Trump, Democrats were in a strong position to gain seats this year. They typically show higher turnout rates in presidential election years—and that may be particularly true this time with little on the state ballot to ignite Republican interest (the two contenders in U.S. Senate race, for example, are both Democrats.) And only 15 percent of California’s 2.2 million new voters have registered as Republicans.\nOf the 100 legislative seats are up for election this fall, the balance of power will be determined by races in 12 swing districts, most of them in Los Angeles, Orange and San Bernardino counties. Assuming Democrats hold the seats they have, they only need to pick up three additional seats—two in the Assembly and one in the Senate—to gain a supermajority.\nIf they succeed, that bloc of Democrats would have enough votes to raise taxes, change political ethics laws, put constitutional amendments on the ballot and override gubernatorial vetoes—wiping out any need to compromise with Republicans.\nIn recent years, Republicans have scored a couple of high-profile victories by insisting on compromises when legislation required a two-thirds vote. They were able to negotiate for money for constructing new reservoirs in the 2014 water bond, and they pressured Democrats to restructure a tax on health plans during negotiations earlier this year.\nBut the biggest issue that once allowed Republicans to leverage their position on two-thirds votes is no longer an issue in Sacramento. Until a few years ago, a supermajority was needed to pass the annual state budget. That led to months of partisan standoffs, which so frustrated voters that they overturned the requirement in 2010. Now Democrats work among themselves to pass the budget with a simple majority.\nIn reality, a supermajority would be unlikely to trigger huge policy changes—at least in the near term. Democrats from swing districts would be reluctant to raise taxes, and the party is already split on key environmental and labor issues. Nor did Democrats do much with the supermajority they won in 2012 before they lost it in early 2014 when two senators went on leave to fight criminal indictments.\nBut this election is unusual because of its potential to shape the Legislature for many years to come. A change to term limits—lawmakers are now allowed to run for re-election to the same house for up to 12 years—means the Assembly will have no vacancies created by term limits until 2024.\n“This election will affect the supermajority for the next decade—not just the next two years,” said Assemblywoman Catharine Baker, a Dublin Republican who has said she’ll write in Condoleezza Rice for president. As Baker fights to keep her seat representing an East Bay district, she’s arguing that her re-election is critical to maintain “any semblance of balance” in the Capitol.\nHadley, the Manhattan Beach Republican who penned an essay about his objections to Trump in his local paper, recently sent an email to supporters saying he’s in “the political fight of my life.” The Democratic Party has poured more than $2 million into supporting his opponent, Al Muratsuchi, who posted “Trump Hadley” signs around their district and launched a web site drawing comparisons between the two.\nBut Hadley said the tactic could end up backfiring: “The sheer dishonesty of the signs combined with the fact that my opponent’s name is on the sign, that he paid for them, really offended people on both sides of the aisle,” Hadley said.\nIn a big, diverse state, however, during a wild election year, it’s little surprise that Democrats are playing the Trump card.\n“They’ve got to take advantage of this,” said Democratic political consultant Paul Mitchell. “It’s a once in a speakership opportunity to really try to spike the football in this election year.”","url":"https://calmatters.org/articles/aiming-for-a-supermajority-in-california-democrats-play-the-trump-card/"}
