{"authors":[],"date_download":"2018-10-22 23:04:14","date_modify":"2018-10-22 23:04:14","date_publish":"2014-05-13 15:38:54","description":"Stolen passports won't be a ticket to ride AirAsia anymore.","filename":"data/vaneerConsumption/AirAsiaBecomesFirstAirlinetoCheckPassportsWithInterpol.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_20/439061/airaisia_ac1756d87a1b40ebeaa267e56eb50a54.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_airasia-becomes-first-airline-check-passports-interpol-n104256_1540249454.html","title":"AirAsia Becomes First Airline to Check Passports With Interpol","title_page":"AirAsia Becomes First Airline to Check Passports With Interpol","title_rss":"NULL","source_domain":"nbcnews.com","text":"The disappearance of Malaysia Airlines Flight 370 two months ago revealed a gaping loophole in aviation security when two passengers were found to have boarded the plane with stolen passports. Interpol said it had information on the theft of the passports but authorities hadn't checked its database.\nAirAsia, which is also based in Malaysia, said it will use Interpol's \"I-Checkit\" system to screen passports when passengers check in. This will be done for its 600 daily international flights using 100 airports across the region, it said.\n\"AirAsia has established the new standard for airline security,\" it quoted Interpol Secretary General Ronald K. Noble as saying. \"This will raise the bar across the industry for passenger safety and security.\"\nAirAsia said no personal data will be transmitted to Interpol other than passport numbers and issuing nation. If there is a positive match against the database, local authorities and Interpol will be notified, it said.\nLess than 10 countries do systematic screening of travel documents against the Interpol database. More than 1 billion times last year, travelers boarded planes without their passports being checked against the database, the international police organization says.\n\"Airlines will no longer have to depend solely on countries screening passports to keep passengers safe from terrorists and other criminals who use stolen passports to board flights. Like AirAsia, they will be able to do it themselves as well,\" Noble said.\n- The Associated Press","url":"https://www.nbcnews.com/business/travel/airasia-becomes-first-airline-check-passports-interpol-n104256"}
