{"authors":[],"date_download":"2018-10-30 01:09:04","date_modify":"2018-10-30 01:09:04","date_publish":"2017-02-22 00:04:07","description":null,"filename":"data/vaneerConsumption/AirbnbandPropertyRightsDontGoTogether.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/02/Portland_Pride_2014_-_144.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861744.html","title":"Airbnb and Property Rights Don’t Go Together","title_page":"Airbnb and Property Rights Don’t Go TogetherThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"For defenders of the so-called “sharing economy,” companies like the housing-sharing website Airbnb and the ride-sharing app Uber are near-sacred. In the case of Uber, “sharing” enthusiasts argue that the company is a symbol of disruption against an anticompetitive status quo. In the case of Airbnb, it offers a similar defense, with the added point that Airbnb hosts are simply exercising their property rights to get more value out of their homes.\nCertainly, these people have a point about Uber. But when it comes to Airbnb, the “disruption” involved does more harm than good. Why? Because contrary to the claim that Airbnb strengthens property rights, in a huge number of cases, that is anything but true.\nDon’t take my word for it, though. Just look to the recent lawsuit filed by Apartment Investment & Management Company (AimCo) against Airbnb. Specifically, look at the grounds for the lawsuit — namely, that Airbnb enabled tenants of Aimco to violate their leases by renting their apartments to unwelcome people without Aimco’s consent. In fact, according to the suit, Aimco even sent Airbnb notices that some of its listings violated its lease agreements, but Airbnb did absolutely nothing. The blog TechCrunch reports:\nThe lawsuit comes after Aimco says it notified Airbnb in August, October and December of last year that some of the listings on Airbnb were in violation of Aimco’s lease agreements, Aimco wrote in a statement. But Airbnb, being Airbnb, is of course going to fight this, saying that it is an “attack on the middle class by powerful interests” that “is wholly without merit,” an Airbnb spokesperson told The WSJ. Airbnb has tried to appease landlords by offering to give them a cut of the revenue, but it’s not clear how well that initiative is going. Depending on how this case turns out, landlords down the road could feel either more or less inclined to take legal action against Airbnb.\nNote the sheer arrogance both of Airbnb’s response and its attempt at appeasement: Apparently, not letting a company profit off a building that you own while handing you an allowance like they’re your parent is an “attack on the middle class by powerful interests.” As opposed to Airbnb, which isn’t a powerful interest at all. Nope, it’s just a mom and pop shop that just happens to be valued at $30 billion.\nKidding aside, the utterly clueless and contentless nature of Airbnb’s response to these very serious charges underscores a simple reality: that contrary to what their defenders suggest, property rights are, at best, an ad hoc justification for what Airbnb does.\nIt cannot be stressed enough that the issue in this case is not, say, someone renting a condo through Airbnb, but rather renting something they themselves are renting — in other words, something they do not own. In view of this, an apartment-sharing company with an interest in protecting property rights would, at minimum, require tenants wishing to “share” their apartments to demonstrate proof of consent from the landlord before listing the property, seeing as the landlord is the person who actually owns the property. Further, when contacted by landlords about removing listings, it would do so, seeing as the tenants have no actual property rights in property they don’t own.\nOf course, if Airbnb wanted to make a principled argument on behalf of tenants having limited property rights over their apartments, it would be free to do so. But the flippancy of its response shows that principle is the last thing it cares about. Rather, it simply wishes to paint the needs of a giant, unaccountable sharing company as somehow aligned with populism, all while stepping on the property rights of, not just large landholders, but every independent landlord in the country.\nAll of which is to say, if you must defend Airbnb, do it on some ground other than respect for property rights. As far as Airbnb is concerned, property takes a backseat to profit.","url":"https://spectator.org/airbnb-and-property-rights-dont-go-together/"}
