{"authors":[],"date_download":"2018-10-30 18:08:06","date_modify":"2018-10-30 18:08:06","date_publish":"2018-07-18 13:37:00","description":"The Super Bowl is coming to Atlanta. If you're coming in from out of town, you'll need a place to stay. Airbnb has some options.","filename":"data/vaneerConsumption/Airbnbhasoptionsforwheretostay.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/18/Videos/4440994.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_where-stay-for-t_e6077ff30a8a911c3d5ed565dfeebe7e__1540922886.html","title":"Airbnb has options for where to stay","title_page":"NFL Super Bowl LIII in Atlanta: Airbnb has options for where to stay","title_rss":"NULL","source_domain":"ajc.com","text":"Super Bowl LIII is 200 days away. It is the third time that the champions of the NFL will be crowned in Atlanta.\nAnd, if you’re a football fan coming in from out of town, where are you going to stay?\nOne option is booking an Airbnb where you can find a short-term rental for the big game.\n» Follow: AJC’s Complete coverage of the 2019 Super Bowl in Atlanta\nAtlanta’s Super Bowl just 200 days away\nWith 200 days to go, Atlanta preps for Super Bowl\nAtlanta companies scrambling for contracts as hotels and restaurants brace for Super Bowl\nHere are some options already available from all over metro Atlanta:\nNear Mercedes-Benz Stadium\n“Luxury Apartment Heart Of The City”\nFour guests, two bedrooms, 1.5 bathrooms, $350 per night\nThe posting says there is a gym, kitchen, free parking, a pool and WiFi on-site.\n“Affordable Comfy Queen Air bed”\nTwo guests, one bedroom, one bathroom, $92 per night\nThe posting says that this rental is just two blocks away from Mercedes-Benz Stadium.\n“Barzini Lodge! Anchored in the heart of it all.”\nSeven guests, one bedroom (with four beds), one bathroom, $1,500 per night\nThis could be an option for larger parties. This rental is for the entire condo.\n“Luxury apartment in the heart of Downtown/Midtown”\nTwo guests, one bedroom, one bathroom, $104 per night\nThis rental has a rooftop pool. It might be a bit cold in February, but who knows with Atlanta’s wacky weather.\n» How MARTA’s preparing to handle the massive crowds\nCamping?\n“Tepee Two at the Goat Homestead”\nTwo guests, one bedroom, one shared bathroom, $54 per night\nYou’ll be staying in a tepee here. No, really. According to the description, the tent sleeps two and is equipped with A/C and heat year-round and is also waterproof. It is nestled in a space that you will share with goats, chickens, hammocks and a fire pit, if that’s your thing.\n“Log Cabin Junior Suit”\nTwo guests, one bedroom, one bathroom, $34 per night\nThis cabin is in Snellville in Gwinnett County. It features a wrap-around porch and is about a block from Norris Lake. It’s equipped with a TV, kitchen and fireplace.\n» Ticket packages for Atlanta’s Super Bowl offer luxury — at a price\nOutside of Atlanta\n“Wooded NE Neighborhood, Close to the Perimeter”\nThree guests, one bedroom, one bathroom, $56 per night\nThis basement apartment near Brookhaven features a full kitchen and separate bedroom.\n“All of the goodies just outside of the city”\nTwo guests, one bedroom, 1.5 bathrooms, $28 per night\nThis room in Norcross comes with its own TV, mini-fridge and surround sound system. About 20 miles from Mercedes-Benz Stadium\n“R1-Great Room, 8 min from Airport/20 min Downtown”\nTwo guests, one bedroom, one shared bathroom, $37 per night\nThis could be an option for fans who want to fly in, catch the game and then fly out.\n“Comfortable guest room near Suntrust Park”\nTwo guests, one bedroom, one bathroom, $40 per night\nThis might also be a good one to bookmark for when the Braves reach the World Series.\n﻿MORE...","url":"https://www.ajc.com/news/local/where-stay-for-the-super-bowl-atlanta-airbnb-already-has-options/hchEFzWSjFk8WZW5pzkQaJ/"}
