{"authors":[],"date_download":"2018-10-22 21:38:52","date_modify":"2018-10-22 21:38:52","date_publish":"2014-06-05 20:43:51","description":"The San Francisco startup that lets strangers share their homes for a fee now wants to do the same for the dinner table.","filename":"data/vaneerConsumption/AirbnbWantsYouToShareDinnerWithStrangers.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/490761/140605-tech-airbnb2_22a877c871bea301f46115dd4ce784b5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_mobile_airbnb-wants-you-share-dinner-strangers-n123951_1540244332.html","title":"Airbnb Wants You To Share Dinner With Strangers","title_page":"Airbnb Wants You To Share Dinner With Strangers","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAirbnb, a San Francisco startup that has grown into a $10 billion business by letting strangers share their homes for a fee, now wants to do the same for the dinner table.\nAirbnb is encouraging hosts to throw dinners for strangers as part of a new pilot program in its home city. The company would take a cut of the proceeds, similar to how it makes money from its core business of letting people list spare bedrooms or homes on its website.\nThe startup began inviting hosts in San Francisco to participate in the dining pilot on Tuesday. A listing for one of the pilot dinners charged $25 per person for a three-course meal.\nMarissa Coughlin, an Airbnb spokeswoman, said the company is \"always experimenting with new ways to create meaningful experiences\" and declined further comment.\nThe dining program is an extension of Airbnb's hospitality empire, whose users have booked 10 million rooms in 192 countries on its online marketplace since 2007.","url":"https://www.nbcnews.com/tech/mobile/airbnb-wants-you-share-dinner-strangers-n123951"}
