{"authors":[],"date_download":"2018-10-30 19:10:22","date_modify":"2018-10-30 19:10:22","date_publish":"2018-09-12 15:02:00","description":"Airbnb will offer free temporary housing to displaced individuals and relief workers deployed to help between now and Oct. 1.","filename":"data/vaneerConsumption/Airbnbofferingfreelodgingforevacuees.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/09/11/Videos/4480879.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/weather_hurricane-florence-_00f213eccaf542023855d7d98156468d__1540926622.html","title":"Airbnb offering free lodging for evacuees","title_page":"Hurricane Florence update: Airbnb offering free lodging for evacuees","title_rss":"NULL","source_domain":"ajc.com","text":"Airbnb will help Hurricane Florence evacuees scratch one significant line item off their list − housing.\nThe online vacation rental portal will offer free temporary housing to displaced individuals and relief workers deployed to help between now and Oct. 1. Airbnb hosts in North Carolina, South Carolina, Georgia and Virginia have joined Airbnb’s Open Homes Program.\n»RELATED: Hurricane tracker: Where is Hurricane Florence now?\n﻿Since Hurricane Sandy hit the East Coast in 2012, Airbnb hosts have opened their homes to evacuees in similar natural disasters to relieve the financial burden of evacuating from affected areas.\n“When disasters strike, our response tool is activated to create additional housing – in or nearby the affected area,” read a statement on Airbnb’s site. “When the tool is activated, Airbnb automatically contacts hosts in the impacted and surrounding areas asking if they have extra space to share with their displaced neighbors. Hosts who respond choose to list their spaces free of charge, and Airbnb waives all booking fees.”\nHere’s how you can help Airbnb offer free lodging to Hurricane Florence evacuees:\nCreate a verified Airbnb account or, for existing members, log in at https://www.airbnb.com/disaster. Sign up your home for a cause of choice. Once your home is listed, agency partners and verified account holders can send requests to stay at your home.\nHosts can decide how long they list their homes for free. Airbnb will expand the territory for hosts offering free lodging if necessary.\nGet complete coverage and forecasts for the hurricane on ajc.com as Florence approaches the coast in the coming days.","url":"https://www.ajc.com/weather/hurricane-florence-airbnb-offering-free-housing-for-evacuees-relief-workers/GOjerbHsx25FlIBXoOB9GN/"}
