{"authors":["Katie Amey For Mailonline"],"date_download":"2018-10-22 21:43:25","date_modify":"2018-10-22 21:43:25","date_publish":"2016-01-28 08:49:23","description":"The Pakistani city has been plagued by armed conflict, terror attacks and targeted killings despite efforts to improve security in recent years.","filename":"data/vaneerConsumption/Airbnboffersroomsfor11anightintheTalibanhotbedofQuetta.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/27/18/30A1D45600000578-0-image-a-14_1453918453412.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3410383_Would-dare-stay-Airbnb-offers-rooms-11-night-Taliban-hotbed-Quetta_1540244605.html","title":"Airbnb offers rooms for £11 a night in the Taliban hotbed of Quetta","title_page":"Airbnb offers rooms for £11 a night in the Taliban hotbed of Quetta | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Travellers can now book budget accommodation in the Taliban hotbed of Quetta via Airbnb.\nThe Pakistani city has been plagued by armed conflict, terror attacks and targeted killings despite efforts to improve security in recent years.\nHowever guests can pay £11 per person, per night for a room in a 'secure', guarded location at a gated housing complex.\nTravellers can now book budget accommodation in the Taliban hotbed of Quetta via Airbnb. Pictured is the rooftop available for guests' use\nThe British Foreign Office advises against all but essential travel to Quetta, which is in the restive province of Balochistan\nUp to six people can stay at the family home, where meals and car parking are available as additional extras.\nHost Muhammad insisted that visitors would be safe in the 'posh' suburban area.\nThe British Foreign Office, on the other hand, advises against all but essential travel to the city in the restive province of Balochistan.\nEarlier this month, a suicide attack on a polio vaccination centre killed 15 people, mainly police officers escorting health workers at risk of attack from Islamic militants.\nOn Monday, a roadside bomb killed at least six paramilitary soldiers on the outskirts of the city in an attack that was claimed by a separatist group.\nQuetta has been plagued by armed conflict, terror attacks and targeted killings despite efforts to improve security in recent years\nThe Taliban's core leadership are also said to have regrouped in Quetta after the US-led invasion of Afghanistan in 2001.\nBut Muhammad claimed the provincial capital had suffered from 'media hype' and was 'much safer' than Pakistan's largest city Karachi, where he has also lived.\nHe said: 'It's a given you need to practise general prudence in avoiding sensitive areas which are quite far away from my place where I myself live as well.\n'The security situation is better by leaps and bounds generally in Quetta.\n'The place is in a suburban area in a peaceful neighbourhood close to the heavily-secured Cantonment area\n'The neighbourhood is in a secure, walled, gated housing scheme with security guards at the gate.\n'No more security arrangements have ever been required in the last 10 years that me and my family have been living here. The area is considered a posh living area so there wouldn't be much concerns related to it. There is 24-hour police patrolling the main road adjacent to the housing scheme.'\nOwner Muhammad claimed the provincial capital had suffered from 'media hype' and was 'much safer' than Pakistan's largest city Karachi. Pictured is the exterior of the house (left) and the terrace (right)\nStays are also available for £36 per night in Hillah, Iraq, close to one of Saddam Hussein's former palaces.\nThe capital of Babylon province was the scene of heavy fighting during the US-led invasion in 2003 but has been trying to welcome back visitors wanting to see ancient ruins.\nTravellers can also pay £15 to stay at a 'large family home' in Najaf, which is considered the Shia world's spiritual capital and welcomes millions of pilgrims every year.\nElsewhere in the city guests can sleep on a sofa for £36 per night.\nThe Foreign Office also advises against all but essential travel to Hillah and Najaf.\nIn Afghanistan, Airbnb users can book a stay at a house in Kabul described as a 'bright, cheery, friendly and peaceful' home, albeit with 24-hour armed guards.\nA guest described the host as 'intellectual, extroverted, sincere and lovely.'\nIn Turkey, another property owner advertises traditional mud-brick houses in the province of Sanliurfa, close to the country's southern border with Syria.\nThe £8-a-night accommodation is in Balikligol, noted for its history and peaceful ambience.\nBut nervous travellers might not be reassured by the fact it is around 80 miles from the Isis heartland of Raqqa in Syria, which has led to a flow of refugees into the province.\nAirbnb, which allows people to list, find and rent lodgings online, attracted controversy earlier this month when a host claimed her flat in London was trashed by more than 100 revellers who held a New Year's Eve party.\nAn Airbnb spokesperson said: 'Before booking international travel or traveling internationally, we recommend you consult the relevant agencies in your government (for example the State Department for US citizens) for any travel warnings or travel advisories that may apply to countries or regions included in your travel plans.'","url":"https://www.dailymail.co.uk/travel/travel_news/article-3410383/Would-dare-stay-Airbnb-offers-rooms-11-night-Taliban-hotbed-Quetta.html"}
