{"authors":["Associated Press","Zoe Szathmary For Dailymail.Com"],"date_download":"2018-10-23 05:10:48","date_modify":"2018-10-23 05:10:48","date_publish":"2017-03-16 16:09:16","description":"Cannon Air Force Base officials say pilot Capt. Andrew Becker (pictured), combat systems officer Capt. Kenneth Dalga and co-pilot 1st Lt. Frederick Dellecker were killed.","filename":"data/vaneerConsumption/AirForceidentifiescrewmemberskilledinaircraftcrash.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/17/03/3E59DC7400000578-0-image-a-56_1489722609177.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320896_Air-Force-identifies-crew-members-killed-aircraft-crash_1540271448.html","title":"Air Force identifies crew members killed in aircraft crash","title_page":"Air Force identifies crew members killed in aircraft crash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Three Air Force service members who were killed Tuesday night in the crash of a reconnaissance and surveillance plane during a training flight in New Mexico have been identified.\nCannon Air Force Base officials say 33-year-old pilot Capt. Andrew Becker, 29-year-old combat systems officer Capt. Kenneth Dalga, and 26-year-old co-pilot 1st Lt. Frederick Dellecker were killed.\nAll three were assigned to the 318th Special Operations Squadron at Cannon.\nVictims: (From left to right) Capt. Andrew Becker, Capt. Kenneth Dalga, and 1st Lt. Frederick Dellecker were killed Tuesday night in the crash of a reconnaissance and surveillance plane\nInvestigators are showing Wednesday gathering evidence near the wreckage of the surveillance aircraft that crashed outside of Clovis, New Mexico, on Tuesday\nOfficials said in a release that Becker, from Novi, Michigan, is survived by his spouse and parents.\nDalga, from Goldsboro, North Carolina, is survived by his spouse, his son and his mother.\nDellecker, from Daytona Beach, Florida, is survived by both of his parents.\nBecker graduated from Embry-Riddle Aeronautical University in 2007, the News-Journal reported.\nThe school said in a statement to the paper: 'It is especially difficult knowing that he came to Embry-Riddle as a committed member of our armed services and served his country with honor.\n'Our thoughts and prayers go out to his family and friends and those affected by this terrible accident.'\nA Fundrazr account set up to help Becker's family says: 'Andrew was a loving husband and respectful son who proudly served his country for 10 years as an officer in the US Air Force..\n'On top of that he was just an all around stand up guy. Andrew was a joyful person with an infectious laugh.\n'If he was happy and within earshot, you couldn't help but be happy as well. He easily made friends with those around him and was always a supportive friend.'\nDellecker, from Daytona Beach, Florida, is survived by both of his parents. He graduated from the Air Force Academy in 2013\nAn Air Force personnel inspects the wreckage of the surveillance aircraft that crashed\nFrederick 'Drew' Dellecker was a 2013 graduate of the Air Force Academy, the newspaper said.\nHis friend Zach Sutton told the outlet: 'Anyone that knew Drew, knew that his lifelong passion was to be in the Air Force.\n'He spent countless hours studying in school just to get into the Air Force Academy (and) got a full ride into it from high school.\n'While all this is so sad, it's not every day that a young man can serve and die honorably for his country.'\nThe cause of the single-engine U-28A's crash near the Clovis Municipal Airport is under investigation\nThe cause of the single-engine U-28A's crash near the Clovis Municipal Airport is under investigation.\nOfficials said Thursday: 'The crash occurred approximately one quarter-mile east of Clovis Municipal Airport at about 6:50 p.m. Tuesday evening.\n'The remains were transported to Albuquerque for autopsy.'\nOn Tuesday, Cannon Air Force Base officials said that 'The incident caused a fire that was extinguished by local first responders at 7:39 p.m.'\nKyle Berkshire, the airport's director, told KOB the plane did 'touch and goes'.\nIt involves the plane touching the runway yet not fully stopping, the station said.\nOn its website, the Air Force says a U-28A crew generally involves two pilots, plus one combat systems officer and one tactical systems officer.\nCapt. Andrew Becker is survived by his spouse and parents. He is seen with his wife Shelly Elizabeth in these Facebook photographs\nOn its website, the Air Force says a U-28A crew generally involves two pilots, plus one combat systems officer and one tactical systems officer. A U-28A plane is seen in a file photo\nIt explains: 'The U-28A provides a manned fixed wing, on-call/surge capability for improved tactical airborne intelligence, surveillance, and reconnaissance (ISR) in support of special operations forces.'\nCol. Ben Maitre, commander of the 27th Special Operations Wing, says the unit's thoughts and prayers are with families and friends of those killed.\nHe said in a statement: 'Our thoughts and prayers remain with the families and friends of those involved in this tragic accident.\n'In doing so, our focus is to also support our larger Air Commando community as we prioritize safe mission accomplishment in both our training and operational commitments.'","url":"https://www.dailymail.co.uk/news/article-4320896/Air-Force-identifies-crew-members-killed-aircraft-crash.html"}
