{"authors":[],"date_download":"2018-10-22 21:17:21","date_modify":"2018-10-22 21:17:21","date_publish":"2014-06-04 19:34:43","description":"LATAM workers in countries where the airline operates were handing out flyers to passengers to warn them of disruptions.","filename":"data/vaneerConsumption/AirlineWorkerStrikeMayDisruptFlightsAheadofWorldCup.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_world-cup_airline-worker-strike-may-disrupt-flights-ahead-world-cup-n122746_1540243041.html","title":"Airline Worker Strike May Disrupt Flights Ahead of World Cup","title_page":"Airline Worker Strike May Disrupt Flights Ahead of World Cup","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nMaintenance workers for LATAM Airlines have threatened to delay or cancel flights throughout South America in support of a strike by Peruvian colleagues in the days ahead of the World Cup.\nLATAM workers in countries where the airline operates were handing out flyers to passengers to warn them of disruptions, Dario Castillo, president of the union of maintenance workers for LAN Chile, told Reuters on Wednesday.\n\"We are going to support our Peruvian colleagues with flight delays and cancellations and that applies to the whole LATAM network,\" Castillo said.\nThe World Cup kicks off on June 12, with Brazil expecting one of the biggest influxes of tourists it has ever seen.\nLATAM Airlines was formed in a merger of Chile's LAN and Brazil's TAM in 2012. LATAM, the region's biggest airline, has operations in Argentina, Brazil, Chile, Colombia, Ecuador, Paraguay and Peru.\nAircraft maintenance workers from LAN Peru have threatened strike action over demands for better pay, after negotiations with the airline broke down last week.\nA union leader in Lima, Freddy Nakashima, said around 250 to 300 technicians would go on strike in Peru, which he said would paralyze the country's network.\nNo date has been decided yet, but the aim would be to hold a strike when it would affect the World Cup in order to apply pressure, Nakashima, said, adding that the strike would go ahead even if approval from the Labor Ministry was not received.\nUnion members posted photos on Facebook on Wednesday showing them handing out leaflets at Buenos Aires' Ezeiza airport. The union said in an open letter that there would be delays \"in upcoming days\" but did not give specifics.\nLATAM Airlines declined to comment.","url":"https://www.nbcnews.com/storyline/world-cup/airline-worker-strike-may-disrupt-flights-ahead-world-cup-n122746"}
