{"authors":[],"date_download":"2018-10-22 21:03:25","date_modify":"2018-10-22 21:03:25","date_publish":"2014-05-05 20:02:47","description":"Airlines are taking in less money from bag fees than they did two years ago, but they are making up for it by adding charges for a slew of extras.","filename":"data/vaneerConsumption/AirlinesSeeDeclineinRevenuefromBaggageFees.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/421541/140505-delta-airplanes-1604_a1557fdd2570bb866d5375114f2dfe2b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_airlines-see-decline-revenue-baggage-fees-n97531_1540242205.html","title":"Airlines See Decline in Revenue from Baggage Fees","title_page":"Airlines See Decline in Revenue from Baggage Fees ","title_rss":"NULL","source_domain":"nbcnews.com","text":"The bag-fee figure was part of information released by the U.S. Department of Transportation, which said that airlines earned $7.3 billion in the fourth quarter of last year, reversing a loss of $188 million in the same period of 2012.\nThe airlines also raised $2.81 billion last year from fees for changing a reservation or ticket, a 10 percent increase over 2012.\nIn 2008, financially strapped American Airlines expanded the fees to checking a regular bag or two, and other carriers soon matched the move. That year, the industry's revenue from bag fees more than doubled, then doubled again the next year, and rose again in 2010. Bag-fee revenue peaked at $3.49 billion in 2012 before falling last year.\nRobert Mann, a former American Airlines executive and now an aviation consultant, said money from bag fees has leveled off because the mix of passengers has changed — by the airlines' design.\n\"You have more people exempt (from the fee) because they use the right credit card or they get status in the airline's loyalty program,\" he said. \"The passenger who gets whacked by the bag fee is the infrequent flier,\" and he thinks more of them are traveling by car, bus or Amtrak to save money.\nJim Weck, a telecommunications company program manager from Atlanta, thinks it's time for the now-prosperous airline industry to give passengers a break from all kinds of fees, which took off when the carriers were losing billions of dollars during a period of recession and rising fuel prices.\n\"We helped you in your hour of need; now it's time to give back,\" Weck said. \"No matter what industry you're in, people don't like being nickel-and-dimed.\"\n— The Associated Press","url":"https://www.nbcnews.com/business/travel/airlines-see-decline-revenue-baggage-fees-n97531"}
