{"authors":[],"date_download":"2018-10-22 22:52:29","date_modify":"2018-10-22 22:52:29","date_publish":"2014-05-12 17:22:19","description":"United Airlines is joining the ranks of carriers that bypass seatback entertainment systems.","filename":"data/vaneerConsumption/AirlinesExpandInFlightTVandMoviestoConnectedTravelers.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_20/436931/140512-lapttop-airplane-1415_62364509dbcc4ac64e1059da032183bc.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_airlines-expand-in-flight-tv-movies-connected-travelers-n103356_1540248749.html","title":"Airlines Expand In-Flight TV and Movies to Connected Travelers","title_page":"Airlines Expand In-Flight TV and Movies to Connected Travelers","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nUnited Airlines is joining the ranks of carriers that can bypass seatback screens and deliver on-demand, in-flight entertainment directly to gadgets brought on board by passengers.\n“We’ve noticed more and more customers have their own personal electronic devices when they fly, so it just makes sense to provide this service,” said United Airlines spokeswoman Karen May.\nThe service, provided by Panasonic, will allow passengers with Wi-Fi enabled devices to access over 150 movies and TV shows stored in on-board servers.\nApple users will access the content through United’s new iOS app; laptop users will just need to open a browser. An app for Android devices is still under construction.\nUnited will begin testing the new service this week on a Boeing 777 flying between the mainland and Hawaii. “We’ll then gradually expand the personal device entertainment system to other 777s flying to Hawaii and then to other fleet types that currently don’t have on-demand seatback entertainment systems,” said May.\nProgramming will be different than that offered via the on-demand seatback system and will be changed quarterly at first and eventually refreshed monthly. During roll-out, the service will be offered to passengers for free, “but I can’t say it will always be that way,” said May.\nUnited is not the first to begin offering on-demand programming to passengers' personal devices. “Many airlines are rolling out this ‘from the Netflix server on the plane to your device via Wi-Fi’ option for passengers,” said John Walton, director of data for Routehappy. Fliers get a wide range of content “often for no more than the price of downloading it from iTunes and, for airlines, it's a lot cheaper and lighter than installing a seatback entertainment system,” he said.\n\"Many airlines would like nothing better than to rip out embedded systems.\"\nFor a fee, passengers on many American Airlines, Delta and US Airways flights can stream on-demand movies and TV shows via Gogo Vision. Other airlines streaming to passenger devices include Air Canada, El Al, Norwegian, Scoot and Virgin Australia. “Southwest offers streaming video plus streaming live TV, while Qantas offers streaming to the airline's own iPads, which are rigged to the seat in front of you in a kind of sling,” said Walton.\nIt seems like a trend, but experts say Hollywood is making sure seatback in-flight entertainment (IFE) systems aren’t going away just yet.“Major airlines are still making significant investments in fixed IFE systems and backseat screens on wide-body aircraft because they want to offer the latest Hollywood blockbusters to passengers on long-haul flights,” said Raymond Kollau, founder of airlinetrends.com, an industry and consumer trends research agency.\n“This so-called early-window content is restricted to fixed seat-back systems and select airline-owned tablets because of the perceived risk by Hollywood that their latest releases will get copied when streamed to passenger devices,” said Kollau.\nBut that barrier may not last long.\n“Many airlines would like nothing better than to rip out embedded systems,” said Mary Kirby, founder of the Runway Girl Network, “and the moment Hollywood relents on early window to personal electronic devices, or connectivity can support streaming over the pipe, is the moment that embedded IFE will go the way of the dodo bird.”","url":"https://www.nbcnews.com/business/travel/airlines-expand-in-flight-tv-movies-connected-travelers-n103356"}
