{"authors":[],"date_download":"2018-10-22 22:02:21","date_modify":"2018-10-22 22:02:21","date_publish":"2014-05-08 20:05:19","description":"Airlines want to emphasize the base airfare in ads but reveal the full price, including taxes and fees, separately.","filename":"data/vaneerConsumption/AirlinesSeektoRollBackAirfareTransparencyRule.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_airlines-seek-roll-back-airfare-transparency-rule-n100711_1540245741.html","title":"Airlines Seek to Roll Back Airfare Transparency Rule","title_page":"Airlines Seek to Roll Back Airfare Transparency Rule","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAirlines tried and failed to block a federal rule making them tell passengers up front the full cost of airfare, including government taxes and fees. So they're trying another route, asking Congress to do what the Obama administration and the courts refused to do: roll back the law.\nA bill in Congress would allow airlines to return to their old way of doing things, which was to emphasize in ads the base airfare — the amount airlines charge passengers to fly — but reveal the full price including taxes and fees separately. It's backed by a bipartisan group of 33 lawmakers led by House Transportation and Infrastructure Committee Chairman Bill Shuster, R-Pa.\nBefore the Department of Transportation put its regulation in place two years ago, airlines and ticketing services would typically display the lower base fare in large type and show taxes and fees in small print. Consumers shopping online often weren't shown taxes and fees unless they scrolled to the bottom of the web page or clicked through several pages after selecting a flight.\nThe bill, supported both by the airline industry and by its pilot and flight-attendant unions, is moving through the House at Mach speed. It was introduced in March and approved by the transportation committee a month later without a hearing and by a voice vote, which means there is no record of who voted for or against it. The committee's entire discussion of the measure lasted 9 minutes.\nThe bill is \"a gift to the airlines,\" said Rep. Jerrold Nadler, D-N.Y., a transportation committee member who said he voted against it. \"What you're going to see is $200 for the airfare, and then you're going to be shocked when it turns out to really be $250,\" he said. \"It's misleading to the consumer. It's just dishonest.\"\nAirlines say they should be able to able to advertise their fares the same way hotels, car rental agencies and other businesses do — by advertising the price of their service and adding in taxes and fees before the final purchase.\n\"Consumers are better served when they can buy airfares like they buy any other product,\" said Sharon Pinkerton, senior vice president of Airlines for America, which represents major carriers. \"I think what's confusing is to have airfares treated differently.\"\n— The Associated Press","url":"https://www.nbcnews.com/business/travel/airlines-seek-roll-back-airfare-transparency-rule-n100711"}
