{"authors":[],"date_download":"2018-10-22 21:22:23","date_modify":"2018-10-22 21:22:23","date_publish":"2014-05-06 23:14:27","description":"Somali immigrant is seen dropping from Hawaiian Airlines jet's wheel well in footage obtained by NBC News","filename":"data/vaneerConsumption/AirportSecurityVideoShowsWobblyTeenStowawayShortlyAfterLanding.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_17/392426/140422-plane-stowaway-jsw-949a_7185f0100dba2aac819d6430986743e4.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_hawaii-stowaway_airport-security-video-shows-wobbly-teen-stowaway-shortly-after-landing-n98691_1540243343.html","title":"Airport Security Video Shows Wobbly Teen Stowaway Shortly After Landing","title_page":"Airport Security Video Shows Wobbly Teen Stowaway Shortly After Landing","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA teenage stowaway who miraculously survived a 5 ½-hour flight from California to Hawaii is seen wobbling around the Hawaiian Airlines jet shortly after it landed in airport security footage obtained by NBC News on Tuesday.\nYahya Abdi, 15, is seen in the 6-minute clip dropping to the tarmac from the jet’s wheel well at the Kahului Airport on Maui in the security surveillance video shot on April 20. He is then unsteadily weaving toward the front of the aircraft before leaving the camera’s view, and later re-enters the picture and approaches an airport or airline worker wearing a yellow vest.\nThe videotape closely matches airport officials’ initial statement on April 21, when they said that the then unidentified “juvenile male” was “found walking on the tarmac” shortly before noon on the previous day.\n“The teen appeared disoriented and was questioned by a worker near the plane who alerted security. TSA and the FBI were also contacted,” they said in a statement. “Surveillance video at Kahului Airport showed what appeared to be the boy exiting from the wheel well of a plane from San Jose, Calif., that had landed in Kahului, Maui, at about 10:30 a.m. The boy was treated by airport and county medics and then transported to a Maui hospital.”\nAbdi’s father, Abdilahi Yusef, said the teen, a Somali immigrant living with his father in Santa Clara, Calif., had been “struggling” to adjust to life in the U.S. and embarked on the journey in an effort to visit his mother, who lives at a U.N. refugee camp in Ethiopia.\nThe mother, Ubah Mohamed Abdullahi, interviewed by Voice of America radio, accused Yusef, her ex-husband, of taking their three children to California without her knowledge and telling them she had died. She said that Abdi had only recently learned she was still alive.\nYusuf traveled to Hawaii last week and took Abdi back home.\nAuthorities have said that the youth somehow survived the flight inside the Boeing 767's wheel well at 35,000 feet despite freezing cold and a near lack of oxygen. Abdi has not yet spoken publicly about his ordeal.\n-- Mike Brunker","url":"https://www.nbcnews.com/storyline/hawaii-stowaway/airport-security-video-shows-wobbly-teen-stowaway-shortly-after-landing-n98691"}
