{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:37:45","date_modify":"2018-10-30 20:37:45","date_publish":"2015-11-20 21:14:35","description":"Heavy bombing by French and Russian warplanes has prompted dozens of ISIS leaders to flee Raqqa.","filename":"data/vaneerConsumption/AirstrikesDriveISISLeadersoutofRaqqa.json","image_url":"https://media.breitbart.com/media/2015/11/French-jet-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_11_20__1540931865.html","title":"Airstrikes Drive ISIS Leaders out of Raqqa","title_page":"Monitor: Airstrikes Drive ISIS Leaders out of Raqqa","title_rss":"NULL","source_domain":"breitbart.com","text":"Heavy bombing by French and Russian warplanes has prompted dozens of Islamic State (ISIS/ISIL) leaders to flee Raqqa, Syria, the jihadist group’s de facto capital, according to a monitor group.\nThe airstrikes follow the Paris massacre and the downing of a Russian passenger plane.\nAccording to the London-based Syrian Observatory for Human Rights (SOHR), a group that monitors the Syrian conflict through a network of sources on the ground, ISIS leaders, most of them non-Syrians, and their family have left their base in Raqqa because it “is not safe anymore” and headed to the ISIS-occupied city of Mosul in neighboring Iraq.\nAt least 33 IS militants had been killed as of Nov. 18 “due to the violent airstrikes carried out by the French and other warplanes that targeted the city of al-Raqqa,” noted the Observatory.\nFrench and Russian warplanes have reportedly focused on bombing Raqqa and the nearby towns of Hawad and Al-Meraab.\n“The death toll is likely to be significantly higher because many of the bodies have been unidentifiable,” reports Haaretz.\nFrance is launching airstrikes in retaliation for the Nov. 13 Paris attacks for which ISIS has claimed responsibility while Russia is bombing the jihadist group for bringing down a Russian passenger airliner in late October, killing 224 people.\nAt least 129 people were killed and hundreds of more wounded in the Paris attacks.\nA spokesman for the Observatory said a Briton had been killed in airstrikes, along with an undisclosed number of civilians, reports Haaretz.\nISIS has reportedly cracked down on activist in Raqqa and is monitoring access to the internet there.\n“The main group that is monitoring the situation in the city, which calls itself Raqqa Is Being Slaughtered Silently, has to operate with extreme caution,” reports BBC.\nSome of the group’s members have been killed by ISIS.\n“You will not be safe from the knife of the Islamic State. Our hand will reach you wherever you are,” warned ISIS in a propaganda video showing one of the group’s members with his throat cut.\nA member of Raqqa is Being Slaughtered Silently spoke to BBC on condition of anonymity out of fear for his safety.\nHe noted that France and other members of the U.S.-led coalition against the Islamic State, also known as IS, have intensified airstrikes in recent days, with nearly 15 daily targeting the jihadist group’s positions.\n“There have been no civilian casualties, but unfortunately we can’t calculate the losses among IS members as they are not releasing any information,” said the anonymous source.\nHe believes that the heavy bombing by the U.S.-led coalition has not been very successful, adding that more airstrikes are necessary to combat ISIS.\nThe source “also alleges that Russian and Syrian government air strikes on Raqqa have not been targeting the extremist group,” reports BBC.\n“All their attacks have been against civilians,” he told BBC. “They have caused a lot of massacres.”\n“The Russian bombing in western Raqqa – which they claimed was against IS – was far away from any IS locations,” he added.\nRussia has denied causing civilian deaths, saying such reports are “information warfare” designed to discredit its intervention in Syria.","url":"https://www.breitbart.com/national-security/2015/11/20/monitor-russian-french-airstrikes-drive-isis-leaders-syrias-raqqa/"}
