{"authors":["Matthew Debord"],"date_download":"2018-10-30 20:45:27","date_modify":"2018-10-30 20:45:27","date_publish":"2016-12-28 00:00:00","description":"The newest Airstream is quite full-featured for its size, with a bathroom and shower, a kitchen, and a built-in Bluetooth speaker.","filename":"data/vaneerConsumption/Airstreamslaunchesnewsmallertrailer.json","image_url":"https://amp.businessinsider.com/images/57d31652b0ef97011d8b4851-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_airstream-launches-smaller-trailer-2016-12_1540932327.html","title":"Airstream's launches new smaller trailer","title_page":"    Airstream's launches new smaller trailer - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Looking for adventure. Airstream There's nothing quite like a shiny, jet-age Airstream trailer. Towing one behind your vehicle, or simply parking one in your driveway, says that you appreciate classic, 20th-century, cutting-edge design.\nThe original Airstream — a sleek, shimmering object of rolling art — was introduced in the 1930s. The lineup has grown over the decades, and the smallest trailer, the Sport Series, has now been outdone by the Basecamp Series.\nDescribed by the company as \"our most nimble Airstream yet,\" the Basecamp is the \"very definition of get-up-and-go.\"\nWhat Airstream is aiming for here is both the highly adventurous and outdoorsy crowd. These are the folks who want to suit up in head-to-toe Patagonia and head out with friends for a weekend of rock climbing, as well as the hardcore camping enthusiasts who don't need, or have room for, a full-on Airstream trailer. Nicer than some apartments. Airstream\nThe Basecamp, Airstream said in a statement, is \"compact, light, and easy to tow, and the perfect place to land after a day of adventure.\"\nThe newest Airstream is quite full-featured for its size, with a bathroom and shower, a kitchen, and a built-in Bluetooth speaker.\n\"We designed Basecamp to rekindle the desire to explore nature and get outdoors,\" said CEO Bob Wheeler in a statement.\n\"Whether it's for the long-time camper who has a garage full of high-end gear that's no longer used, or for the person who has always wanted to get out more but was hesitant, Basecamp is the passport to unimaginable new experiences.\"\nGet out on the highway. Airstream\nThe new trailer weighs 2,585 lbs. and according to Airstream can be towed by smaller crossovers and SUV that are properly outfitted with a hitch.\nThe Basecamp started deliveries in October, with a price of $34,900. Heck, I'm thinking about getting one and putting it in my back yard to use as a hipster guest cottage!","url":"https://www.businessinsider.com/airstream-launches-smaller-trailer-2016-12"}
