{"authors":["Chloe-Lee Longhetti For Daily Mail Australia"],"date_download":"2018-10-23 00:36:47","date_modify":"2018-10-23 00:36:47","date_publish":"2016-01-28 14:38:25","description":"Aisha loved the look so much she decided to wear the same outfit to the Witchery Autumn Winter runway show at Sydney's Carriageworks on Thursday","filename":"data/vaneerConsumption/AishaMcKinnonattendsWitcheryrunwayshowinthesamenavyandwhiteplaysuitwornbyAlliSimpsonattheARIAs.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30AA9EFF00000578-0-image-a-53_1453988086710.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420928_Aisha-McKinnon-attends-Witchery-runway-navy-white-playsuit-worn-Alli-Simpson-ARIAs_1540255007.html","title":"Aisha McKinnon attends Witchery runway show in the same navy and white playsuit worn by Alli Simpson at the ARIAs","title_page":"Aisha McKinnon attends Witchery runway show in the same navy and white playsuit worn by Alli Simpson at the ARIAs | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Alli Simpson certainly turned heads at the ARIA Awards in Sydney in November, wearing an eye-catching navy and white kimono-style playsuit.\nAnd it would appear Big Brother star Aisha McKinnon loved the look so much she decided to wear the same outfit to the Witchery Autumn Winter runway show at Sydney's Carriageworks on Thursday.\nThe 23-year-old showed off her trim legs in the Alice McCalll dress - an outfit she she teamed with white accessories.\nScroll down for video\nIn the blue! Aisha McKinnon attended the Witchery fashion show on Thursday night in Sydney, in a navy and white kimono-style playsuit\nLooks familiar: Aisha wore the look after it was previously seen on singer Alli Simpson, 17, at the ARIA Awards in Sydney in November (R)\nThe reality TV star styled the look a little differently to Alli, 17, who is a singer and Cody Simpson's younger sister.\nAisha pulled her long dark locks into a neat low ponytail with a side part, and teamed the plunging look with a white material choker.\nShe also carried a white clutch, wore white heels and even had a white manicure and pedicure.\nAll in the details: Aisha pulled her long dark locks into a neat low ponytail with a side part, and teamed the plunging look with a white material choker\nAisha showed off a golden tan and kept her make-up relatively simple, wearing dewy foundation, bronzer, a soft gloss and lashings of mascara.\nWhen Alli wore the look, she teamed it with multi-layered silver chains and black shoes, and kept her hair out neatly straightened.\nAisha is currently dating beau Travis Lunardi, who she met on the set of Big Brother in 2014.\nThis week she spoke about her relationship to Daily Mail Australia and said the pair had no plans of marriage, but she knows exactly what kind of ring she wants if he pops the question.\nPicture perfect: The blonde teamed it with multi-layered silver chains and black shoes, and kept her hair out neatly straightened\n'It’s Art Deco, it's beautiful, it's very old school, very big but a girl can dream right!' she said, adding she has sent him a picture of it.\nThe reality TV couple met in the Big Brother House in 2014, and have been happily dating since.\nTravis moved to Sydney four months ago to be with his girlfriend and the love-birds recently celebrated their one year anniversary in Port Stephens.\nWhen DMA asked about how long they had been together, he said: 'Alright lets be honest, last night went out for dinner and we’re doing a Snapchat. And I'm like \"Babe how does it feel... We’ve been together 13 months 8 hours and 6 mins. I love you.\"'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420928/Aisha-McKinnon-attends-Witchery-runway-navy-white-playsuit-worn-Alli-Simpson-ARIAs.html"}
