{"authors":["Matthew Smith For Mailonline"],"date_download":"2018-10-23 01:05:43","date_modify":"2018-10-23 01:05:43","date_publish":"2017-03-16 10:52:09","description":"Middlesbrough confirmed the news about Karanka in a statement on their website, which said the decision had been made as 'both parties have agreed that it is in the best interests of the club'.","filename":"data/vaneerConsumption/AitorKarankasackedbyMiddlesbrough.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E223C4E00000578-0-image-a-65_1489661509366.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319662_Aitor-Karanka-sacked-Middlesbrough_1540256743.html","title":"Aitor Karanka sacked by Middlesbrough","title_page":"Aitor Karanka sacked by Middlesbrough | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Aitor Karanka has left his job as Middlesbrough manager after discussions with the club.\nMiddlesbrough confirmed the news in a statement on their website, which said the decision had been made as 'both parties have agreed that it is in the best interests of the club'.\nKaranka had lost the dressing room after a series of public outbursts, while chairman Steve Gibson was alarmed when he criticised fans in a press conference and then the board over a lack of signings. This week his most recent fallout, with homegrown winger Stewart Downing, proved the final straw.\nMiddlesbrough boss Aitor Karanka has left with the club in the Premier League relegation zone\nKaranka guided Boro to the Premier League last season but they have struggled since\nBoro were knocked out the FA Cup by Manchester City in Karanka's final game in charge\nSeason at a glance Live tables\nFixtures\nScores Premier League\nPremier League\nChampionship\nLeague One\nLeague Two\nScottish Premiership\nScottish Div 1\nScottish Div 2\nScottish Div 3\nLigue 1\nSerie A\nLa Liga\nBundesliga\nThe statement said: 'The club would like to thank Aitor for all his hard work over the past three-and-a-half years and for the success we've had during that time. We wish him all the best for the future.'\nThe club website also features a statement from Karanka, who leaves the club 19th in the Premier League and without a win in the league in 2017.\nThe messge - also tweeted from Karanka's official account - said: 'I'd like to thank Middlesbrough for a wonderful opportunity and the players, staff and all the people at the club who I have worked with. I'd also like to thank the fans for their support.\n'This club will always hold a special place for me and I wish everyone connected with Middlesbrough Football Club the very best for the future.'\nAssistant manager Steve Agnew takes charge of the first team with immediate effect.\nKaranka joined Middlesbrough in November 2013 and guided them to the Premier League last season after reaching the play-off final in his first full season in charge.\nThe 43-year-old former Real Madrid defender, who was in his first full managerial role after serving as Jose Mourinho's assistant at the Bernabeu, succesfully took Boro back into the top flight following a seven-year absence.\nHowever, off the pitch things were not so smooth, with Karanka sensationally walking out in March 2016 - one year and five days before his eventual sacking - following an argument with his players.\nKaranka had a close friendship with Jose Mourinho after working with him at Real Madrid\nKaranka has criticised some of his players in recent weeks, including Stewart Downing\nMIDDLESBROUGH'S LEAGUE FIXTURES Mar 19: Manchster United (H) Apr 2: Swansea City (A) Apr 5: Hull City (A) Apr 8: Burnley (H) Apr 17: Arsenal (H) Apr 22: Bournemouth (A) Apr 29: Manchester City (H) May 6: Chelsea (A) May 13: Southampton (H) May 21: Liverpool (A) TBC Sunderland (H)\nHe missed the team's 2-0 defeat at Charlton the following weekend, before returning the following Monday and overseeing an unbeaten end to the campaign.\nBoro's return to the top flight has been a struggle, with the club winning only four out of 27 games so far, with no victory recorded since they beat Swansea City at the Riverside Stadium on December 17.\nThey are the lowest scorers in the top flight, with only 19 goals in their 27 matches, and have scored once from open play in the league in 2017 - against West Ham on January 21 - with the team on a run of four straight blanks in the league.\nThey were also knocked out of the FA Cup at the quarter-final stage last weekend by Manchester City - Karanka's last game at the club.\nKaranka leaves one year and five days after his infamous training-ground walk out at Boro\nI'd like to thank @Boro for a wonderful opportunity and the players, staff and all the people at the club who I have worked with. #UTB 1/3 pic.twitter.com/JPYTy8XM0H — Aitor Karanka (@Karanka) March 16, 2017\nWHO WILL REPLACE KARANKA? Selected odds courtesy of Oddschecker: Nigel Pearson 4/1 Steve Agnew 5/1 Steve McClaren 11/1 Claudio Ranieri 20/1 Alan Pardew 20/1 Roy Hodgson 25/1 For the full list click HERE\nKaranka's famous ill-temper has also reared its head in recent weeks in public spats with players such as Downing and January signing Patrick Bamford, who have been left out of the squad as the manager said he wanted 'fighters' for his team.\nHe was also unhappy that he was unable to sign key targets in January - Boro missed out on Bojan, Gerard Deulofeu, Robert Snodgrass and Jese - criticising popular chairman Gibson for a perceived lack of support. He also said the fans were not doing enough to support the team or his careful style of play.\nKaranka leaves the club three points from safety and facing a difficult run in.\nThey host Manchester United in their next game on Sunday lunchtime, before trips to relegation rivals Swansea and Hull.\nTheir final five fixtures include Arsenal and Manchester City at home, and their last two away matches are at Chelsea before Liverpool at Anfield on the final day.","url":"https://www.dailymail.co.uk/sport/football/article-4319662/Aitor-Karanka-sacked-Middlesbrough.html"}
