{"authors":["Associated Press"],"date_download":"2018-10-23 04:01:04","date_modify":"2018-10-23 04:01:04","date_publish":"2016-01-28 19:48:30","description":"LESBOS, Greece (AP) — Chinese artist and activist Ai Weiwei said Thursday he decided to withdraw his works from two Danish museums out of deep anger at a new...","filename":"data/vaneerConsumption/AiWeiweisaysdeepangermadehimpullworksfromDenmark.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:646d26fbd2494525883b5099fae20ba1-4PuZeKVXE7cd9005b2c8760e3438-908_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421496_Ai-Weiwei-says-deep-anger-pull-works-Denmark_1540267264.html","title":"Ai Weiwei says deep anger made him pull works from Denmark","title_page":"Ai Weiwei says deep anger made him pull works from Denmark | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ai Weiwei says deep anger made him pull works from Denmark\nLESBOS, Greece (AP) — Chinese artist and activist Ai Weiwei said Thursday he decided to withdraw his works from two Danish museums out of deep anger at a new law allowing Denmark to seize valuables from migrants.\nAi said he wanted to give a \"clear statement\" on what he considered an absurd law.\nHe spoke on Lesbos island in Greece, the main point of entry for refugees and economic migrants seeking a better life in Europe.\nChinese activist and artist Ai Weiwei assists refugees and migrants after their arrival on a dinghy from the Turkish coast to a beach near Mytilene port on the northeastern Greek island of Lesbos on Thursday, Jan. 28, 2016. Despite toughening European border controls, refugees and migrants have continued to travel to the Greek islands near the Turkish coast, at a rate of roughly 1,500 per day since the beginning of the year, braving the bad weather in dinghies and old wooden boats.(AP Photo/Mstyslav Chernov)\nAi has set up a studio there, and told The Associated Press that the project will last \"at least a year.\" The studio will produce several projects with refugee-related themes.\nHe said he wants to be \"part of the daily experience\" and rescue of thousands of refugees crossing the stormy Aegean Sea from Turkey to Lesbos.\nOn Thursday, he joined with NGO staff helping migrants who had just arrived at a beach in inflatable rubber boats, lending a hand and chatting to people heading to buses waiting to take them to a camp.\nHe also visited Lesbos last month and has said he expects to go there several times over the next year, or even beyond, if the crisis persists. About six to 10 artists, students of his in China and Germany, will be working at the studio.\n___\nThis story has been corrected to change the second reference to Ai.","url":"https://www.dailymail.co.uk/wires/ap/article-3421496/Ai-Weiwei-says-deep-anger-pull-works-Denmark.html"}
