{"authors":[],"date_download":"2018-10-30 21:28:28","date_modify":"2018-10-30 21:28:28","date_publish":"2018-07-04 17:35:00","description":"L.A.","filename":"data/vaneerConsumption/AJCPeachtreeRoadRacefinisherstellstoriesofwhytheyran.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/04/Images/PRR%20Ken%20main%20070518%20Peachtree%20photo%20HS36.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_the-wide-range-motiv_24e87bdece4e32a94884b9d5947aaa98__1540934908.html","title":"AJC Peachtree Road Race finishers tell stories of why they ran","title_page":"AJC Peachtree Road Race finishers tell their stories of why they ran","title_rss":"NULL","source_domain":"ajc.com","text":"L.A. Noel stood in the cool of a shade tree in Piedmont Park, surveying the stream of humanity flowing through from 10th Street into the park meadow. She wore a purple running top and purple shorts, and even her running shoes had purple accents, a sartorial choice that reflected more than fashion.\nIt also was the Atlanta resident’s reason for running Wednesday’s The Atlanta Journal-Constitution Peachtree Road Race.\n“I am a lupus warrior,” she said. “So every year, I wear purple to empower and encourage and strengthen people like me.”\nNoel was diagnosed in 2004 with lupus, a chronic autoimmune disease that can cause inflammation, swelling and damage throughout the body. For Noel, walking became difficult. At the time, asking her to run 6.2 miles might have seemed as impossible as asking her to fly to the moon. But her health improved, and she began to walk, then jog, then run. Wednesday’s Peachtree was her seventh. She finished in about 90 minutes, she said.\nLiving with lupus “was a struggle initially, but I’m a person of faith,” Noel said. “I’m blessed to be able to continue out here and start and finish.”\nNoel was one of about 60,000 to take part in the 49th running of the Peachtree, the world’s largest 10-kilometer road race and Atlanta’s beloved Independence Day tradition. From health to family to acquisition of the coveted finisher’s T-shirt, the motivations for participating were innumerable.\nK.C. Coll’s reason for being at the Peachtree was not health, but employment. The City of Atlanta police officer was assigned to keep watch over spectators and participants with fellow officer A. Bradshaw. Early on in the race, their favorite runner was a man who had spelled out “USA” in his chest hair.\nIt was an early wakeup call on a holiday, but they were OK with maintaining safety and order at the corner of Peachtree and Piedmont roads.\nAt the Peachtree, “people are usually giving us love and not the finger,” Officer Coll said over the din of a woman clanging multiple cowbells. “It’s quite lovely.”\nA few hundred yards down the course, Nicole Boolukos cheered on runners from beneath a tent gathered with family and friends. The canopy was fringed with race photos of her favorite runner, Betty Lindberg, who completed her 28th Peachtree on Wednesday. Lindberg, it bears mention, is 93 and was the oldest competitor in the field. She did her first at 64.\nWith Lindberg already having run through, Boolukos had time to brag on Lindberg, her grandmother. She can dead-lift 90 pounds and hold a plank for a minute and a half, Boolukos said, and that’s at the end of her training sessions. Her grandmother was the reason she was out at the Peachtree, but, for an Atlanta native and Buckhead resident, so was the lure of being part of an Atlanta tradition.\n“I’ll stay out till the end,” she said. “It’s not every day you can stand and hang out in the middle of Peachtree.”\nYou can hang out in the middle of Piedmont Park pretty much every day, but repose took on a different meaning Wednesday. As they sat on a sidewalk encircling the meadow, 14-year-old Miracle Johnson and her friend Jacole Brown (17) were asked why they ran. They pointed at the broad-shouldered man standing next to them, Rashard Sanders, their fingers and body language more accusatory than crediting. The Douglasville resident is an Atlanta police offer, and ran with Brown and Johnson, as well as 11-year-old Javaris Partridge through his involvement with the department’s police athletic league. Officers annually bring kids out to the race.\nBrown called the race “easy, somewhat.” The other two differed in their evaluation. Not a fan of the heat, Javaris said the race was “like somebody trying to kill me.” Johnson: “It was just like walking 100 miles.” Still, Johnson said she planned to run again.\nOther reasons?\n“Because I can,” said Stephanie Wilson of Atlanta, her seventh Peachtree in the bag. “Not everybody can, right?”\n“I’m not from this country, so it’s a celebration of being here for the past eight years,” said Navin Kulkarni, an Atlantan who grew up in India and knocked out his eighth consecutive Peachtree, with an eye on 10.\n“You know what?” Caroline Griffith of Riverdale asked. “I like to compete against myself. I’m 41 and I don’t ever want to say I can’t do it.”\nEven the elites had motivations beyond prize money.\nMen’s winner Bernard Lagat finished fifth last year and told race organizers that he would come back and win it this year. He didn’t race from March forward, choosing to focus his training on the Peachtree, driving 45 minutes once a week to do hill training in anticipation for the multiple uphill climbs.\n“I really wanted this,” Lagat said.\nLagat, from Tucson, Ariz., won in 28 minutes, 45 seconds. A Kenyan-born runner who became a naturalized U.S. citizen in 2004, Lagat won the race at the age of 43, a remarkable triumph for a masters runner. Stephanie Bruce of Flagstaff, Ariz., was the women’s winner in 32:21. As the race also doubled as the USA Track and Field 10K championship, Lagat and Bruce also were crowned national champions.\nAs the morning wound down, Jim Frost walked slowly out of the park, flanked by daughters Ashley Frost and Heather Hawkins. The elder Frost, 70, had just run his 29th Peachtree out of the past 31 years. Frost, an East Cobb resident, said he has run every step of all 29 Peachtrees.\n“This is his favorite day of the year,” Hawkins said.\nThe race is of such import in the Frost family that Ashley returned from her home in Zambia to accompany him. Frost’s favorite moment of his favorite day, he said, is running up Cardiac Hill in front of the Shepherd Center, for the validation it gives him.\n“It was good,” he said of the hill. “The key is to stay totally wet at every water break.”\nAs virtually every year, it was wise counsel. The heat was ever present, though it could have been worse. To try to beat the heat, the Atlanta Track Club moved the start of the race up by 30 minutes. Coupled with some cloud cover and temperatures that stayed in the high 70s and low 80s, the decision appeared to be a success. There were more than 30 cases last year that required participants be transported to a medical center. Speaking as the race course was being torn down, track club executive director Rich Kenah said final numbers weren’t yet available, but were “significantly less” than 2017.\n“It’s Atlanta in July, but I think the weather gods were as good to us as they could have been,” Kenah said.\nEven Kenah found purpose and reason in his Peachtree day beyond the fact that, as race director, his presence was mandatory. In his fifth year at the head of the track club, Kenah said that the opportunity to direct the Peachtree was a significant reason why he took the job. On Wednesday, Kenah helped start the race with Mayor Keisha Lance Bottoms and rapper Jeezy, both of whom also joined the field to run. Kenah ended it at the finish line, watching the tide of constituents sweep cross the finish line.\n“They’re happy to be part of something that’s bigger than themselves,” he said. “So, short answer, yes, it was a big part of why I wanted this responsibility and this position. But the satisfaction far exceeds anything I ever thought it would be.”","url":"https://www.ajc.com/sports/the-wide-range-motivations-for-ajc-peachtree-finishers/Tdz9QdHUXQ0ucJjLEwiDpO/"}
