{"authors":[],"date_download":"2018-10-30 20:53:13","date_modify":"2018-10-30 20:53:13","date_publish":"2018-07-13 16:10:00","description":"Lt. Gov.","filename":"data/vaneerConsumption/AJCWSBpollCagleKempareneckandneckinGOPraceforgovernor.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/05/23/Videos/4400355.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_0d6db5a470bce1caef8a9a241c410cb7__1540932793.html","title":"AJC/WSB poll: Cagle, Kemp are neck and neck in GOP race for governor","title_page":"AJC/WSB poll: Cagle, Kemp are neck and neck in GOP race for governor","title_rss":"NULL","source_domain":"ajc.com","text":"Lt. Gov. Casey Cagle and Secretary of State Brian Kemp are neck and neck in Georgia’s Republican race for governor less than two weeks ahead of the vote, according to an Atlanta Journal-Constitution/Channel 2 Action News poll released Friday.\nThe poll of likely voters in the July 24 GOP runoff showed Kemp with a lead of 44 percent to 41 percent over Cagle, within the margin of error of 3.5 percentage points.\nInteractive: Poll results\nPDF: View crosstabs\nThe poll offers only a snapshot of the race at this stage, and much could change with about 15 percent of voters still undecided.\nThe tight race is a troubling sign for Cagle, who has struggled to improve upon the 39 percent of the vote he earned in the May primary despite a significant fundraising advantage. The poll shows Kemp has built slight leads among men and older voters, while Cagle has the edge with younger voters.\nCagle has been dogged by a secretly made recording of him telling a former Republican opponent he supported “bad public policy” to undercut another rival, and many voters said trust-related issues were the driving force behind their choice for governor.\nOf Kemp’s supporters, roughly 15 percent said the main reason they’re backing him is because they see him as more trustworthy. About one-third say they’re voting for him because he shares their values.\nAbout one-fifth of Cagle’s supporters said they will vote for him because he’s the “right choice” to be governor. And 9 percent said they backed him over Kemp because he’s more likely to defeat Democrat Stacey Abrams in November.\nBoth candidates have played up their loyalty to President Donald Trump, and he remains a prominent factor in the race.\nLt. Gov. Casey Cagle and Secretary of State Brian Kemp emerged as the top finalists in Tuesday's election.\nAbout 21 percent of Republicans said their main reason for voting is to support the stronger ally to Trump. Voters who said they were most motivated by Trump were evenly split between Cagle and Kemp.\nThe poll was conducted July 5-12 by the University of Georgia’s School of Public and International Affairs, and 769 likely Republican runoff voters responded.","url":"https://www.ajc.com/news/state--regional-govt--politics/ajc-wsb-poll-cagle-kemp-are-neck-and-neck-gop-race-for-governor/N6SPzcm8S5HZr092FfHLIO/"}
