{"authors":[],"date_download":"2018-10-30 01:15:14","date_modify":"2018-10-30 01:15:14","date_publish":"2016-05-13 15:33:25","description":null,"filename":"data/vaneerConsumption/AJewishVoiceforPeaceJustAnotherHateGroup.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/05/Jewish_Voice_For_Peace_0.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862114.html","title":"A Jewish Voice for Peace — Just Another Hate Group","title_page":"A Jewish Voice for Peace -- Just Another Hate GroupThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Who is the group called “A Jewish Voice for Peace” and why does it hide its funders from the public?\nDon’t be fooled by the name. JVP is an organization of extremists masquerading as Jewish advocates seeking a just peace for all people in the Middle East. Using the language of human rights and claiming to be acting in accordance with Jewish values, JVP demonizes, defames, and delegitimizes Israel, labeling it an “occupier,” “apartheid” and “racist,” while embracing the global boycott, divestment and sanctions campaign (BDS) which would result in the destruction of the only Jewish homeland in the world.\nWith 9,000 dues-paying members and 60 chapters, JVP’s stated mission is to dilute support for Israel in order to end the Israeli “occupation” of the “West Bank,” Gaza and East Jerusalem, to resolve the Palestinian refugee problem and bring peace to the Middle East. JVP attempts to convince Jews that opposition to Israel is consistent with Jewish values, professing, “We work to build Jewish communities that reflect the understanding that being Jewish and Judaism are not synonymous with Zionism or support for Israel.” But JVP’s mission statement is a smokescreen, the old “bait and switch” — to lure volunteers by feigning devotion to Jewish values, human rights, and social justice and then to propagandize them into warriors in the global anti-Israel war of words as lethal as a war fought with bullets and bombs.\nThe only thing this “voice for peace” wants is the delegitimization of Israel. In its “Nakba Fact Sheet,” JVP characterizes the founding of Israel as a “catastrophe” and blames Israel exclusively for creating Palestinian refugees, ignoring the roles played by five attacking Arab armies and local Arab leaders advising them to leave.\nDuring the deadly, random Palestinian knifings of innocent Israeli civilians in 2015, JVP posted a Facebook statement referring to the attacks as “Palestinian popular resistance,” and praising “a new generation of Palestinians…rising up en-masse against Israel’s brutal, decades-old regime of occupation, settler colonialism and apartheid.” JVP uses the Palestinian Authority’s false argument of the threat to the Jerusalem Al-Aqsa mosque to validate murder.\nAlthough it accuses the American Jewish establishment of stifling dissent and McCarthyite actions, JVP itself has a history of attempting to shut down debate. It disrupted the Taglit Birthright reunion, joined with other anti-Jewish groups to disrupt a New York city council meeting discussing a Holocaust commemoration and participated in campaigns to “shut down AIPAC” and “skip the speech” — Prime Minister Netanyahu’s address to Congress. Brandeis University Prof. Ilan Troen explains, “If you’ve ever dealt with the JVP, they themselves are a semi-terrorist group, promoting the disruption of free speech and the inability of others to conduct public discourse.”\nIn response to the January 2015 Paris terror attacks, JVP merely expressed concern about Islamophobia, saying, “Muslims are at greatly heightened risk… in the context of pervasive, systemic and long-standing anti-Islam bigotry.” This “Jewish Voice for Peace,” despite its stated opposition to bigotry, never acknowledged that the murder of shoppers at the kosher market was an anti-Jewish act.\nThe Anti-Defamation League describes JVP as one of the 10 worst anti-Israel organizations in America: “While JVP’s activists try to portray themselves as Jewish critics of Israel, their ideology is nothing but a complete rejection of Israel.”\nIn February 2015, JVP acknowledged that they fully endorse and promote the global BDS campaign, joining other radical leftist groups in advocating for “ending the occupation of all Arab lands” — not just the territory captured in 1967 — and the “right of return” of millions of Arabs to Israel.\nBDS proponents acknowledge that their efforts will ultimately result in the dismantling of Israel as a sovereign Jewish state. Omar Barghouti, a BDS founder, stated in 2011, “BDS National Committee… sees JVP as an important ally in the U.S.” Barghouti admits, “Ending the occupation doesn’t mean anything if it doesn’t mean upending the Jewish state itself.”\nJVP partners with American Muslims for Palestine (AMP) which, according to recent congressional testimony, has at least seven individuals on its staff or working with it “who worked for or on behalf of organizations previously shut down or held civilly liable in the United States for providing financial support to Hamas.” , JVP supported an AMP campaign to post signs demonizing Israel as apartheid and in 2015 it joined AMP’s “No US Tax Dollars for Israel” rally in Washington, D.C.\nJVP has raised money for the International Solidarity Movement, linked to Hamas and Islamic Jihad. ISM members have hidden terrorists from the Israeli military, provided funding to Hamas, and participated in the Hamas propaganda effort in Gaza in 2014.\nJVP publicly associates with organizations having ties to U.S.-designated terrorist groups and yet won’t disclose its funders. Why?\nAccording to IRS 990s and audited financial statements, JVP reported 2014 total contributions/grants of $1,407,148. Since its founding in 1996, significant growth in funding has allowed JVP to become a player in the Israel delegitimization campaign.\nNGO-Monitor, a Jerusalem-based watchdog organization, has discovered 33 foundations and organizations that give money to JVP. This diligent work represents real progress in identifying contributors JVP refuses to disclose.\nAmong the major funders is the Rockefeller Brothers Fund (RBF) whose grant of $140,000 to JVP, together with grants to other virulent anti-Israel groups, runs counter to its mission of promoting “a more just, sustainable, and peaceful world.”\nAdditional funding is provided by 21 other private foundations including: Firedoll Foundation, Bonus Fund, Kaphan Foundation, Violet Jabara Charitable Trust and the Left Tilt Fund, all organizations that vigorously support anti-Israel groups.\nWhat other individuals and groups are underwriting JVP? Could there be funding from sources connected directly or indirectly to terrorist organizations? We don’t know.\nWhat we do know is that Jewish Voice for Peace is not a “voice for peace.” Its hatred for Israel is palpable and underlies the organization’s raison d’être — to defame, demonize, and criminalize Israel so that the world sees the Jewish state as JVP sees it — a pariah among nations.\nThere is and has always been a genuine Jewish voice seeking peace — the millions of Jewish voices in Israel who offered peace repeatedly in 1947, 2000, 2001, and 2008 and are willing to do so today. Where is the Palestinian voice for peace?\nWe do hear their voice — “From the river (Jordan) to the sea (Mediterranean), Palestine will be free.” That voice wants to ethnically cleanse the Middle East of the Jewish people.","url":"https://spectator.org/a-jewish-voice-for-peace-just-another-hate-group-2/"}
