{"authors":[],"date_download":"2018-10-30 19:58:57","date_modify":"2018-10-30 19:58:57","date_publish":"2017-05-01 17:30:00","description":"Warrants released Monday reveal new details in the shooting death of a man who was gunned down outside a DeKalb County hotel.","filename":"data/vaneerConsumption/AK47murdersuspectadmitsshootingmanonvideoinDeKalb.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/20/Images/Shooting%20Wesley%20suspect%20background_20170420185436611_7836860_ver1.0_640_360.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_cops-murder-susp_2a2f77a71b1a8d5ff6e629cf19cebec1__1540929537.html","title":"'AK-47 murder' suspect admits shooting man on video in DeKalb","title_page":"Cops: 'AK-47 murder' suspect admits shooting man on video in DeKalb","title_rss":"NULL","source_domain":"ajc.com","text":"Warrants released Monday reveal new details in the death of a man who was gunned down outside a DeKalb County hotel.\nJavian Nesby, 23, allegedly admitted to killing Jordan Morris, the documents say. The 22-year-old Decatur man was found dead April 12 with a bullet hole in his left cheek in the parking lot of Super Inn on Wesley Chapel Road.\nNesby “admitted he killed victim in retaliation for something victim did to defendant’s girlfriend,” the warrants say, not revealing specifics.\nMichael Lamar Grier, 33, who was arrested at Atlanta Technical College, is the alleged getaway driver, the documents say.\nBoth men are charged with murder.\nSecurity cameras at a gas station and the hotel captured different parts of the shooting.\nGrier is seen in a Kia sedan dropping Nesby at the gas station before Nesby walks to the parking lot and starts to chase the victim, the warrants say.\nThe shooting, which authorities have called the “AK-47 murder,” happened around 2:30 or 3 p.m. Video shows the shooter in sunlight sprinting after the victim and then shooting him several times, according to police.\nLike DeKalb County News Now on Facebook | Follow on Twitter and Instagram\nIn other DeKalb County news:","url":"https://www.ajc.com/news/local/cops-murder-suspect-admits-shooting-man-video-dekalb/Fq2WImGZaKy6yupWCk1mgI/"}
