{"authors":[],"date_download":"2018-10-22 22:23:57","date_modify":"2018-10-22 22:23:57","date_publish":"2014-06-09 22:10:36","description":"Sheriff's officials said the father was charged with murder in the shooting death of Raymond Earl Brooks, 59, a registered sex offender.","filename":"data/vaneerConsumption/AlabamaDadKilledManWhoMolestedHisDaughterPolice.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/497936/140609_raymond-earl-brooks_8f42d37dfa6dffb24663f10f4c2deca1.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_crime-courts_alabama-dad-killed-man-who-molested-his-daughter-police-n126766_1540247037.html","title":"Alabama Dad Killed Man Who Molested His Daughter: Police","title_page":"Alabama Dad Killed Man Who Molested His Daughter: Police","title_rss":"NULL","source_domain":"nbcnews.com","text":"The Associated Press isn't naming the suspect to protect his daughter's identity. The AP generally does not identify victims of sexual crimes.\nMoments before Brooks was slain on Sunday, a motorcycle rider believed to be the father opened fire outside a country store in the Berlin community when he saw a man who has been dating his stepdaughter, said Chief Deputy Max Bartlett.\nThe intended victim got away by running into the store and hiding, Bartlett said. Investigators don't know of any connection between Brooks and the man who escaped, Bartlett said. It wasn't immediately clear what sparked either shooting.\nThe father and Brooks \"obviously didn't have a whole lot of good blood between them,\" but it was unknown whether the shooting was directly linked to the sex abuse case, Bartlett said.\n\"It is odd. He apparently had a lot of stressors going on in his life,\" Bartlett said.\nCourt records were not immediately available to show whether the father had a defense lawyer. He was held in the county jail.\nDocuments show the suspect was a witness against Brooks in a sexual abuse case involving his daughter in 2001. Police said the girl was 8 at the time, but court records show she was 7.\nBrooks pleaded guilty to sexual abuse in 2002 and initially was sentenced to five years in prison but later received probation, records show. He finished paying $2,946 in restitution and costs in 2009.\nBarlett said Brooks was shot several times at the home of his parents, where he had been living, shortly after the shooting at the store. The father apparently rode his motorcycle straight to the house after the first shooting, Bartlett said, but the reason was unclear.\nThe man also was charged with attempted murder and shooting into an occupied building, Bartlett said.\n—The Associated Press","url":"https://www.nbcnews.com/news/crime-courts/alabama-dad-killed-man-who-molested-his-daughter-police-n126766"}
