{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 02:23:03","date_modify":"2018-10-23 02:23:03","date_publish":"2017-03-16 12:52:03","description":"A 25-year-old woman from Birmingham, Alabama, has been seen on security cameras making her escape from the trunk of a moving car after being\n'kidnapped'.","filename":"data/vaneerConsumption/Alabamakidnappedwomanescapesfromtrunkofmovingcar.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E54173D00000578-0-image-a-4_1489667851094.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320038_Alabama-kidnapped-woman-escapes-trunk-moving-car_1540261383.html","title":"Alabama kidnapped woman escapes from trunk of moving car","title_page":"Alabama kidnapped woman escapes from trunk of moving car | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The incredible moment a woman escaped from the trunk of a car while she was being 'kidnapped' has been captured on camera.\nThe 25-year-old woman, who has not been named, told police she was forced into the trunk of her own car after being approached near her apartment by a man with a gun about 10:30pm on Tuesday in Birmingham, Alabama.\nThe suspect allegedly demanded money from the woman, however when she did not hand any over the attacker took her cell phone and wallet instead.\nVideo of her daring escape was shot at the Gas Land petrol station, where the driver had briefly pulled in to stop.\nScroll down for video\nThe incredible moment a woman escaped from the trunk of a car (pictured) while she was allegedly being kidnapped has been captured on camera\nSecurity footage shows the driver walking inside the gas station and using an ATM, before returning to the kidnapped woman's black Nissan Altima.\nAs the car pulls out of the station, the trunk is seen being pushed open before the woman desperately flings herself out to safety.\nShe slams down onto the concrete, before quickly getting up and rushing inside the gas station.\nAfter getting inside, the 25-year-old frantically runs up to a worker, who then allows her behind the counter where she crouches down to hide.\nVideo started by showing the kidnapping suspect getting out of his alleged victim's car (left), before going inside a gas station to try to use an ATM (right)\nFootage then showed the car driving out of the gas station parking lot (left), and just seconds later the 25-year-old woman was seen jumping from the trunk (right)\nAnother staff member is then seen picking up a phone to call the police.\nLater in the footage the victim is seen hiding in what appears to be a storage room.\nThe gas station's owner, Yosef Alsabah, told Alabama.com he told the suspect to leave when he was having trouble with the ATM because he was trying to withdraw too much money.\n'He was not right... there was something going on with him,' Alsabah said.\n'He looked like he had a pistol in his pocket - I kept an eye on him.'\nThe 25-year-old woman was seen hitting the concrete (left) after jumping from the car, before getting up and running towards the gas station (right)\nAfter getting up off the ground (left), she charged to the gas station and raced through the door to safety (right)\nBirmingham Police released this image of the suspect in the shocking kidnapping\nHe then explained what happened after seeing the woman jump out of the trunk.\n'I got her inside and locked the door, then called the police,' Alsabah told the website.\nFootage showed that while the woman was hiding in the store room, she grabbed the gas station owner's shotgun to protect herself in case the 'attacker' came inside.\nBirmingham Police released an image of the suspect on Wednesday and asked people to help officers track him down.\nThe 25-year-old suffered minor injuries during her escape.\nThe woman then ran inside and spoke to a worker (left), who allowed her to hide behind the counter. Another staff member was then seen calling police (right)","url":"https://www.dailymail.co.uk/news/article-4320038/Alabama-kidnapped-woman-escapes-trunk-moving-car.html"}
