{"authors":["Associated Press","Dailymail.Com Reporter"],"date_download":"2018-10-22 21:44:59","date_modify":"2018-10-22 21:44:59","date_publish":"2017-04-26 02:40:18","description":"Alabama lawmakers have given their blessing to HB24, a bill that protects faith-based adoption organizations that refuse to place children in households with gay parents.","filename":"data/vaneerConsumption/Alabamafaithbaseadoptiongroupsdiscriminategaycouple.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3FA0208C00000578-0-image-a-15_1493216179042.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446040_Lawmakers-Faith-based-adoption-groups-spurn-gay-couples_1540244699.html","title":"Alabama faith base adoption groups discriminate gay couple","title_page":"Alabama faith base adoption groups discriminate gay couple | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Alabama lawmakers have given their blessing to HB24, a bill that protects faith-based adoption organizations that refuse to place children in households with gay parents.\nThe Alabama House of Representatives voted Tuesday to go along with the state Senate's change to the bill, which the Senate had been moved forward last week.\nThe House voted 87-6. The bill is now on its way to Alabama Governor Kay Ivey for her signature.\nState representatives Rich Wingo and Patricia Todd (at podiums left and right) debated the passage of HB24 at the Alabama State House on Tuesday. The bill protects faith-based adoption agencies that discriminate against gay couples based on religious reasons\nHB24, or the Child Placing Agency Inclusion Act, has been in the works since early February, according to Legiscan.\nThe legislation prohibits the state from refusing to license faith-based adoption groups that decline child placements to gay couples because of the agencies' religious beliefs.\nThe bill would only apply to agencies that do not accept state or federal funds, however.\nRepresentative Rich Wingo, the Republican sponsor of the bill, said it guarantees that faith-based agencies can operate without violating their religious beliefs.\nAlabama State Representative Rich Wingo (left) is the Republican sponsor of the HB24 bill. Representative Patricia Todd (right), a Democrat, argued against its passing on Tuesday\n'Around the country there are other states that have required faith-based agencies to place children in homes, foster or adoption, to place children in homes that go against their religious beliefs,' Rep. Wingo told AL.com.\n'These faith-based agencies have been forced to close their doors because they refuse to place children in homes that go against their faith.'\nAlthough he noted that faith-based adoption agency closures hadn't happened in Alabama yet, passing HB24 was necessary as a backup preventative measure, just in case the situation did arise.\nRepresentative Patricia Todd — the state's only openly gay lawmaker — called it blatant discrimination.\nRepresentative Patricia Todd, Alabama's only openly gay lawmaker, said bill is discriminatory\n'This bill obviously came about because same-sex marriage was approved,' Todd told AL.com. 'It's based in a stereotype. And it's wrong. And we shouldn't discriminate and I will always fight that.\n'When a faith-based organization decides to step into either adoption or child care, they should have to follow the same rules and regulations as every other agency,' she said.\nIn response, Wingo said, 'The bill simply says do not discriminate against us, the faith-based agencies. It's not discriminating against anybody else.'\nThe HB24 decision comes in the midst of 'The Daily Show's' week-long series of reports from Alabama — apparently the Comedy Central satire news show's least-watched market.\nWhile in Birmingham, Alabama, Daily Show correspondent Desi Lydic interviewed Todd for a segment exploring the state's religious values.\nThe interview was taped in March, but aired on Monday.\nDuring the interview, Todd told Lydic that, '100 percent,' religious views are 'immersed through everything in Alabama.'\nDespite this, Todd noted, 'We are the only Southern state that has not passed any anti-gay legislation since I've been in office. And I think it's harder to get up and argue anti-gay stuff when you have to look across the podium and argue with me.'","url":"https://www.dailymail.co.uk/news/article-4446040/Lawmakers-Faith-based-adoption-groups-spurn-gay-couples.html"}
