{"authors":["Harry Pearl For Daily Mail Australia"],"date_download":"2018-10-22 20:18:00","date_modify":"2018-10-22 20:18:00","date_publish":"2016-01-29 01:02:24","description":"Australian journalist Alanah Pearce, 22, receives on average one rape threat a week via her Facebook and YouTube with a troubling amount coming from young boys.","filename":"data/vaneerConsumption/AlanahPearceforwardsonlinetrollsmessagesontotheirparents.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/06/30B0012200000578-0-image-a-14_1454047381487.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420336_Australian-video-games-journalist-Alanah-Pearce-victim-rape-threats-online_1540239480.html","title":"Alanah Pearce forwards online trolls' messages on to their parents","title_page":"Alanah Pearce forwards online trolls' messages on to their parents | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She bans and ignore offenders but has now taken to\nA prominent Australian journalist who receives weekly rape threats online, as well as daily abuse, has taken to forwarding offensive messages to offenders' parents.\nAlanah Pearce, who is the Toys & Culture Editor at IGN Entertainment in San Francisco, said on average she receives one rape threat a week.\nMost come through Facebook and Youtube - and a troubling amount come from young boys.\nScroll down for video\nAlanah Pearce, who is the Toys & Culture Editor at IGN Entertainment in San Francisco, said on average she receives one rape threat a week through Facebook and YouTube\nSometimes, after publishing something that might be considered controversial, she'll get a flood of nasty messages.\n'Everyone I've managed to identify that has sent me a rape threat has been a male, and a surprising amount of them have been young boys, but I don't stop to ask them their age before banning or reporting their comments,' Ms Pearce, who is originally from Brisbane, told Daily Mail Australia.\nOften she'll ban and ignore online trolls but, if she can, she'll inform an authority figure.\nShe said it is important to give cyber-bullies real world consequences for their online actions.\n'For anyone who sends me any kind of threat on Facebook, I will go to their profile and try to find personal information,' she said.\n'For young boys I usually look for parents or family listed on their profile, and then send them a screenshot of the abuse their son has sent me.\nMost of the threats come through Facebook and Youtube with a troubling amount coming from young boys. While often she'll ban and ignore online trolls, she has taken to informing authority figures like a parent.\nThe 22-year-old from Brisbane said she has had a surprising amount of rape threats from young boys\nMs Pearce said she had to deal with online bullying at school and her biggest advice was to just ignore it\n'I've also contacted schools before if I've been unable to contact parents.\n'I think it's an effective response to online harassment because it gives real world consequences to online actions.'\nMs Pearce said while some parents have acted defensively - assuming she provoked a threat or that she was lying - others had taken strong action, including removing their child's online privileges and encouraging other parents in their networks to discuss appropriate online behaviour with their kids.\nAbout one in five Australians aged between eight and 17 experience cyber-bullying, according to a 2014 study commissioned by the Government.\nOnline bullying was most prominent among middle-school aged youth - aged between 10 and 15 years - and girls were most at risk, the report said.\nMs Pearce said victims of cyber-bullying should never respond directly to offenders, especially online\nMs Pearce said it is important to give cyber-bullies real world consequences for their online actions\nAustralian and international studies have found that cyber-bullying can cause significant harm to victims, including anxiety and depression.\nIt has also been linked to suicide like the tragic death of Victorian teen Jessica Cleland who took her own life on Easter Saturday last year after receiving Facebook messages from two teenage boys she considered friends saying that they hated her and that she was a 'f***ing sook'.\nMs Pearce, who said she had to deal with online bullying at school, said her biggest piece of advice for victims of cyber-bullying was to just ignore it.\n'If you have the option to give someone real-world consequences for their action you may be able to teach them not to do it again, but you should never respond to them directly, especially not online,' she said.\n'They want attention, so if you give it to them they're unlikely to go away.'","url":"https://www.dailymail.co.uk/news/article-3420336/Australian-video-games-journalist-Alanah-Pearce-victim-rape-threats-online.html"}
