{"authors":["Hannah Parry For Dailymail.Com"],"date_download":"2018-10-23 00:35:03","date_modify":"2018-10-23 00:35:03","date_publish":"2017-03-10 07:14:56","description":"Thaddeus Kalinoski, 40, would spend his days and nights in Las Vegas attending wild parties alongside celebrities and beautiful women - just like the movie character he impersonates.","filename":"data/vaneerConsumption/AlanfromTheHangoverimpersonatorleaveshisjob.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/07/3E2079AD00000578-0-image-a-2_1489129666950.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300110_Man-leaves-200k-job-impersonating-Alan-Hangover_1540254903.html","title":"Alan from The Hangover impersonator leaves his job","title_page":"Alan from The Hangover impersonator leaves his job | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The former hotel manager in Philadelphia earned $1,000 an appearance in Las Vegas after moving there to make a new life in 2011\nA former restaurant manager who has been living the high life earning $165,000 a year as the doppelganger of Alan from hit movie The Hangover says he's had to leave his job because the boozy lifestyle is killing him.\nThaddeus Kalinoski, 40, would spend his days and nights in Las Vegas attending wild parties alongside celebrities and beautiful women - just like the movie character he impersonates.\nHe soon got sucked into the drunken, drug-fueled parties, and found himself on a path to destruction.\nScroll down for video\nThaddeus Kalinoski, 40, (pictured center) would spend his days and nights in Las Vegas attending wild parties alongside celebrities and beautiful women - just like the movie character he impersonates\nThaddeus (left) was living the high life earning $165,000 a year as the doppelganger of Alan (right, played by Zach Galifianakis) from hit movie The Hangover says he's had to leave his job because the champagne lifestyle is killing him\n'I remember one night this caused me to blackout, falling into broken glass bottles, getting sliced open and I was robbed,' he told The Sun.\nOn another occasion he became so drunk he 'puked and defecated all over my costume in the Caesars valet lot and had to drive home naked.\n'I was under so much pressure to do parties and was often pushed into rooms with groups of people telling me I had to do drugs. It got really desperate.'\nIt was only after he hit rock bottom - and received a stern warning from his mum - that he finally decided it was time to turn his life around.\n'I suffered a real life Hangover and I just couldn't do it anymore,' he confessed.\n'I believe that life got so hectic I probably would've died if I continued down that path.\nLookalike: Thaddeus is the spitting image of Alan in the movie, down to the T-shirt - and the debauchery in Las Vegas\nExhausting: Thaddeus said his full-on lifestyle took a toll but threw himself into performing as Alan\nIn 2009 when the first film was released life for Thaddeus was a world away from the notorious Las Vegas strip.\nHe held down managerial jobs in high-end hotels and restaurants in Philadelphia and Baltimore, while married to housewife Claire.\nBut in just a few months, similarly to The Hangover's Alan, his life hit rock bottom.\nThe dedicated restaurant manager, who had worked for the Hyatt and Sheraton Groups, tried to save his crumbling marriage but his wife left him.\nI suffered a real life Hangover and I just couldn't do it anymore\n'It was just two hammer blows to my life. I really enjoyed my job and to walk away was a kick in the teeth as I invested so much time into making myself a success.\n'I had been in hospitality a long time and had prided myself on working in the service industry overseeing major events at top eateries.\n'But my long hours were already making things tough with my marriage. We drifted apart.'\nThaddeus faced a tough decision – keep his job or lose his wife.\n'I decided to put my wife first and spent several months trying to devote my time to her, doing odd jobs to pay the bills.\nSpot the difference: Alan - aka Thaddeus - poses for a selfie with Bradley Cooper who couldn't believe he was meeting another Zach\nLiving it up: The real Zach Galifianakis, Bradley Cooper and Ed Helms in the 2009 movie\n'But my sacrifice was not enough for her - she still walked out on me.'\nThe next few months were hard and Thaddeus piled on 20 pounds through too much eating and drinking.\n'Then one day after not shaving for several weeks I looked at myself in the mirror and thought 'wait a minute - you look like Alan', said Thaddeus.\n'People started telling me when I was out at night that I looked like him. So for kicks I decided to see if there was some money in doing this as a part time job to earn some extra cash. I moved to Atlantic City to see what people thought and I had some fun, but then me and my buddy went to Vegas for a weekend away - and it all changed.'\nThaddeus, who would go on to make more than $1,000 a night, said people would just come up to him, hand him drinks and want to party with the Alan look-a-like.\n'Girls were making out with me in cabs and nightclubs within seconds of meeting me and people were just so kind.\nHit with the ladies: 'Alan' parties at Hyde nightclub at the Bellagio Las Vegas\nParty Alan style: Thaddeus is available to help the atmosphere at bachelor - and bachelorette parties and shows how at the HydeNightclub at the Bellagio Hotel\nHe's so selfie-ish: The chance of a picture with 'Alan' is a big draw when he is at functions like this one at the Bellagio\nHe decided to extend his stay in Vegas and roll the dice.\n'I moved into Hooters Hotel and then just walked around the Strip and Casinos. It was like being the most famous man in Las Vegas - I couldn't believe the reactions I got.\n'I wasn't just like another lookalike on the street, but pretty much the Hangover character out and about having fun.'\nThaddeus invested everything into living and breathing the crazy 'Leader Of The Wolfpack'.\nBY 2011, he had tourists in stitches with his impressions of Alan and serving up lines like, 'It's not a purse, it's called a satchel. Indiana Jones wears one.'\nAside from buying costumes to look the part, Thaddeus even introduced a baby and monkey into his act. He and a pal built an animatronic version of both characters which he carries around Sin City.\nHis mimicry of Alan was so impressive that casting bosses hired him as a double in The Hangover III.\n'I was standing out on the strip and this woman came up to me and said: 'I have been looking for you all over town. I am a casting agent and we want you for the film.'\n'I was a little confused and asked 'which film' - she just smiled and said: 'I think you know what film.'\n'I was a little taken aback, and she said, 'The Hangover of course?'. It was a great feeling.'\nA few days later Thaddeus joined the movie's stars Bradley Cooper, Zach and Ed Helms on location at a gas station in Nevada.\nAccessorized: Thaddeus has an animatronic baby and monkey to reflect the script of the movies - and he has found company with a Mike Tyson lookalike to reflect the movie\nBefore: Thaddeus and his ex-wife Claire before they split. The end of his marriage prompted him to pile on weight - and become more and more like Galifianakis\n'Bradley Cooper looked at me and was just dumbfounded that I looked so much like his co-star. Ed Helms was really cool too. I loved him in The Office and he was generous to me, and kept laughing and confusing me for Zach,' he said.\nHe also met one of the original movie's stars - former World Boxing Champion Mike Tyson.\nThe doppelganger added: 'I have met loads of other celebrities out here, who have been really supportive. They love the act and always pose up.'\nBut things began to spiral when he started struggling to separate his life from his work.\nFrom hard partying with the stars to being welcomed into bachelor and bachelorette parties as a special weekend long guest, he would often wake up nursing many real life hangovers.\n'Every day I live out my life like I am in The Hangover with some of the adventures being as crazy as what people saw in the film,' he said in 2015.\n'I have had some of the craziest nights out partying with people, and have laughed non-stop about the whole process – it's the best thing that ever happened to me.'\nEndorsement: His uncanny resemblance has meant Thaddeus has met a series of celebrities - including Gene Simmons from Kiss in full make-up\nDubious taste: Alan gets close to a customer at The Hustler Club in Las Vegas.\nSometimes when Thaddeus got home he felt like he'd been in a 'war zone'.\n'My trousers are ripped, I have my t-shirt hanging off and I am covered in alcohol and sweat - not even my own,' he says.\nThaddeus says he tried to take months off the boozy lifestyle in the quieter winter months.\nAnd would always say no to drugs. But sex was not off the table.\n'I cannot lie, I have been approached by absolutely stunning women, who almost beg to sleep with me. It is simply unbelievable,' he explains.\n'I won't give numbers, but I have done okay for myself.","url":"https://www.dailymail.co.uk/news/article-4300110/Man-leaves-200k-job-impersonating-Alan-Hangover.html"}
