{"authors":["Benjamin Zhang"],"date_download":"2018-10-30 22:16:14","date_modify":"2018-10-30 22:16:14","date_publish":"2016-12-14 00:00:00","description":"Alaska Airlines has completed its $2.6 billion merger with Virgin America and is now the 5th largest airline in the US.","filename":"data/vaneerConsumption/AlaskaAirandVirginAmericahascompleted26billionmerger.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_alaska-airlines-virgin-america-merger-complete-2016-12_1540937774.html","title":"Alaska Air and Virgin America has completed $2.6 billion merger","title_page":"    Alaska Air and Virgin America has completed $2.6 billion merger - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Sir Richard Branson with Virgin America crew. Handout/Getty Images On Wednesday, Alaska Airlines announced that it has completed the acquisition of Virgin America for $2.6 billion.\nHowever, it is believed the total value of the deal, including Virgin's debt and aircraft-leasing obligations, could reach $4 billion.\n\"Alaska Airlines and Virgin America are different airlines, but we believe different works - and we're confident fliers will agree,\" Alaska Air Group CEO Brad Tilden said in a statement. \"The two airlines may look different, but our core customer and employee focus is very much the same.\"\nTogether, the newly merged carrier will form the fifth largest airline in the US with 40 million customers generating $7.4 billion in revenue so far this year.\nOnly American, Delta, United, and Southwest Airlines are larger.\nTogether, the new Seattle-based airline will operate a fleet of 286 aircraft on 1,187 daily flights. With Virgin America in the fold, Alaska Airlines will be able to bolster its position as a powerhouse West Coast rival for Southwest Airlines. In addition, Virgin's boutique product offering and award-winning service will provide Alaska access to a different set of clientele.\nAlaska Airlines crew with Boeing 737. AP It is unclear what will become of the Virgin America brand in the long-run, however Alaska Airlines confirmed on Wednesday that no immediate changes will be made to VA's current \"onboard product or experience\".\n\"We appreciate that there is great interest in the future of the Virgin America brand among customers and employees alike,\" Tilden said. \"This is a big decision and one that deserves months of thoughtful and thorough analysis. We plan to make a decision about the Virgin America brand early next year.\"\nWith the sale of Virgin America to Alaska, Sir Richard Branson and Virgin Group has divested its 25% stake in the airline. As a result, future use of the Virgin brand by Alaska Air Group will likely require a licensing agreement with Branson.\nVirgin America Airbus A319. Flickr/Eddie Maloney According to Tilden, beginning on December 19, Alaska Air and VA passengers will be able to earn reciprocal benefits across each others' networks.\nAlaska Air first announced the deal in April following a bidding war with JetBlue. The merger gained board approval from Virgin America in July followed by anti-trust approval from the Justice Department on December 6.\nAlaska Airlines and Virgin America expects to receive authorization from the Federal Aviation Administration to operate as a single airline in early 2018.","url":"https://www.businessinsider.com/alaska-airlines-virgin-america-merger-complete-2016-12"}
