{"authors":["Matt Hunter For Mailonline"],"date_download":"2018-10-23 01:53:32","date_modify":"2018-10-23 01:53:32","date_publish":"2016-01-29 16:01:43","description":"Chief executive of the Seattle-based airline, Brad Tilden, apologized for the 'insensitive reference' which provoked outrage on social media.","filename":"data/vaneerConsumption/AlaskaAirlinesMeetourEskimoadvertisingcampaignsparksaccusationsofracism.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B3E42B00000578-0-image-a-72_1454082433260.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422931_Alaska-Airlines-Meet-Eskimo-advertising-campaign-sparks-furious-reaction-accusations-racism-chief-executive-forced-apologize_1540259612.html","title":"Alaska Airlines' Meet our Eskimo advertising campaign sparks accusations of racism","title_page":"Alaska Airlines' Meet our Eskimo advertising campaign sparks accusations of racism | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Outrage on social media as company is accused of 'subtle\nAlaska Airlines has been accused of racism after an advert promoted the company with the catchphrase 'Meet our Eskimo'.\nChief executive of the Seattle-based airline, Brad Tilden, apologized for the 'insensitive reference' which provoked outrage on social media.\nOne user described the phrase as 'subtle racism' - with another claiming it was an 'appropriation and a slur'.\nThe phrase was used to draw attention to its freshly tweaked image of an unidentified parka-clad man that has graced the tails of Alaska Airlines airplanes for more than four decades.\n'Meet our Eskimo': The offending advert which has provoked many to express their anger with Alaska Airlines - the firm has used the image for decades\nCriticism has been drawn more at the sense of ownership that the phrase implies rather than the use of the word 'Eskimo'.\n'It was very condescending,' said Angela Cox, an Alaskan resident. 'My first thought was, \"You don't own an Eskimo.\" It just seemed wrong.'\nLatanya Odden was one of many who tweeted her displeasure with the company under the hashtag #NotYourEskimo.\n'I couldn't believe it,' said Odden, describing the phrase as 'subtle racism'.\n'It's one thing to say the iconic image represents a culture and a way of life you support.\n'It's another thing entirely to say this is ours… and what we're selling.'\nIn a letter to Alaska Airlines posted on her Facebook page, Alaskan resident Tiffany Zulkosky said she was 'deeply disappointed'.\n'Though it appears an attempt at cleverness, it comes across as appropriation and a slur,' she said.\nZulkosky invited Alaska Airlines to attend a racial equality summit next week organised by First Alaskans Institute. Zulkosky said she would love to see Tilden or other executives at the event.\nEskimo is a widely used term in Alaska, describing Inupiat and Yupik people.\nIn a statement, Mr Tilden said: 'We apologize and take full responsibility for this insensitive reference.\nThere has also been support for the airline from some in the community - one Instagram user added their voice to the debate and said: 'I support it 100%. I was born an Eskimo and same as my grandpa that was on the first issue of the Alaska airlines magazine'\n'We are immediately taking down this reference, and pledge that we will work to be both respectful and fully cognizant of the importance of this symbol to the native people of Alaska.\n'The Eskimo is a symbol of the uniqueness and beauty of Alaska and its people. As we refreshed our brand, we sought input early on from a number of native leaders in the state of Alaska to make sure we got the symbol right.\n'The airline is committed to working with the Alaska native community to ensure that our actions reflect our profound respect and admiration for the native people, and the respect we have for every Alaskan.\n'Alaska Airlines is grateful for its very long standing ties to the Alaska native community and will strive to strengthen and deepen them going forward.'\nSome, however backed the campaign and thanked the firm for celebrating Eskimo culture.\nOne Instagram user said: 'I support it 100%. I was born an Eskimo and same as my grandpa that was on the first issue of the Alaska airlines magazine.","url":"https://www.dailymail.co.uk/news/article-3422931/Alaska-Airlines-Meet-Eskimo-advertising-campaign-sparks-furious-reaction-accusations-racism-chief-executive-forced-apologize.html"}
