{"authors":[],"date_download":"2018-10-22 20:51:48","date_modify":"2018-10-22 20:51:48","date_publish":"2014-05-04 16:35:00","description":"As two state troopers struggled to arrest his father, a 19-year-old man armed himself with a rifle and shot them seven times, authorities say.","filename":"data/vaneerConsumption/AlaskaTeenShotTroopersasTheyStruggledWithDadCharges.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_18/419146/140504-troopers-hg-1215_dc4e262c8b73a3624901ff365dc8f404.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_alaska-teen-shot-troopers-they-struggled-dad-charges-n96701_1540241508.html","title":"Alaska Teen Shot Troopers as They Struggled With Dad: Charges","title_page":"Alaska Teen Shot Troopers as They Struggled With Dad: Charges","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nANCHORAGE, Alaska — As two state troopers struggled to arrest his father, a 19-year-old man armed himself with an assault rifle and shot them seven times, killing them outside his home in a remote Alaska village, authorities said in charges filed Saturday.\nNathanial Lee Kangas appeared in a Fairbanks court two days after Trooper Gabriel \"Gabe\" Rich and 45-year-old Sgt. Patrick \"Scott\" Johnson were shot to death. He was charged with two counts of first-degree murder and a count of third-degree assault. Bail was set at $2 million.\nAfter bail was set, the judge asked Kangas if he had anything to say regarding the bail.\nAfter a long pause, Kangas replied only, \"I'm sorry,\" the Fairbanks Daily News-Miner reported.\nKangas, wearing an orange jumpsuit, was escorted by officers into the court. Every seat was full, and the walls were lined with law enforcement officers of several agencies as Kangas faced his charges. Officers hugged and consoled each other at the hearing, the newspaper reported.\nKangas' mother, Judy, and younger brother, Albert, each gave brief apologies.\n\"I want to tell everybody, the families, from the bottom of my heart that I am sorry,\" Judy Kangas said as she choked back tears.\nThe slayings of Rich and Johnson on Thursday in the isolated community of Tanana underscored the challenges law enforcement faces in this huge state. Like many troopers assigned to patrol multiple villages, Rich and Johnson were not based in the interior community of 238 people. They worked out of the troopers' four-person rural service unit in Fairbanks 130 miles to the east, and they had to reach Tanana by plane.","url":"https://www.nbcnews.com/news/us-news/alaska-teen-shot-troopers-they-struggled-dad-charges-n96701"}
