{"authors":["Associated","Press Reporter"],"date_download":"2018-10-23 04:37:53","date_modify":"2018-10-23 04:37:53","date_publish":"2016-01-29 20:20:58","description":"Jeremy Beebe, 42, who failed to report to police to serve a 21-month sentence for felony charges this month, was found hiding in a complex tunnel system underneath a trailer.","filename":"data/vaneerConsumption/Alaskafugitiveontherunfordrugchargesisfoundhiddenintunnelsystem.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/30/03/30B655E200000578-0-image-a-4_1454125755673.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423422_Fugitive-elaborate-tunnel-trailer-park_1540269473.html","title":"Alaska fugitive on the run for drug charges is found hidden in tunnel system","title_page":"Alaska fugitive on the run for drug charges is found hidden in tunnel system | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Going underground: Jeremy Beebe in his mugshot\nA fugitive convicted on drug and theft charges has been arrested after authorities found him hiding this week in what they called an 'elaborate tunnel system' dug underneath a trailer home in Alaska.\nThe tunnels narrowed as officers walked further in, forcing them to get on their knees and then their stomachs.\nPolice in the city of Sitka say they eventually spotted Jeremy Beebe's foot sticking out of another hidden entrance, catching him after an officer pulled back the skirting around the trailer.\nPolice Lt. Lance Ewers said Beebe, 42, had failed to report to the police department on January 12 after he was sentenced to nearly two years in prison, the Sitka Sentinel reported.\nActing on a tip, officers staked out a trailer park Wednesday and saw Beebe heading in to one of the units.\nA woman who answered the door said Beebe was not there and that she didn’t know where he was.\nPolice then used a battering ram to get through a plywood door they found on the outside of the trailer, which led to a crawl space that was the entrance to the tunnel system.\nFound you: Police in Sitka, Alaska, uncovering the opening of a tunnel system under a trailer with the help of the property's landlord. Hidden in the tunnel was Jeremy Beebe, 42, a fugitive wanted on felony charges\nAs officers walked farther into the tunnel, it became tighter.\nUsing flashlights they saw Beebe, wearing a hoodie and facing the officers.\nBut he backed away until he was out of sight.\nThe officers then went around to the other side of the trailer and found another entrance, where they noticed Beebe's foot.\nHe was finally pulled out and arrested. Police say the incident occurred around 9.30pm.\nBeebe may now face additional charges of contempt of court, Ewers said.\nSitka Police Sgt. Walter Smith stands in the entryway of a tunneled space under a trailer in Vitskari Trailer Park in Sitka, Alaska, on Thursday, January 28, 2016. A man wanted on criminal warrants was hiding in there\nJude Pate, a public defender in Sitka assigned to Beebe's case, declined to comment when reached by The Associated Press on Thursday.\nBeebe was given a 21-month composite sentence on December 29 for several offenses committed in 2014.\nThe charges included theft in the fourth degree, criminal mischief in the fifth degree, and a felony misconduct involving a controlled substance in the fourth degree.","url":"https://www.dailymail.co.uk/news/article-3423422/Fugitive-elaborate-tunnel-trailer-park.html"}
