{"authors":["Associated Press"],"date_download":"2018-10-23 05:51:15","date_modify":"2018-10-23 05:51:15","date_publish":"2017-04-26 17:10:53","description":"CHAMPERY, Switzerland (AP) - Michael Albasini won his seventh career Tour of Romandie stage on Wednesday, and Fabio Felline of Italy retained the overall...","filename":"data/vaneerConsumption/AlbasiniwinsanotherRomandiestageFellineretainslead.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/17/wire-466441-1493223372-849_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4448454_Albasini-wins-Romandie-stage-Felline-retains-lead_1540273875.html","title":"Albasini wins another Romandie stage; Felline retains lead","title_page":"Albasini wins another Romandie stage; Felline retains lead | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"CHAMPERY, Switzerland (AP) - Michael Albasini won his seventh career Tour of Romandie stage on Wednesday, and Fabio Felline of Italy retained the overall lead.\nThe 36-year-old Swiss sprinted through rain and light fog on a mountain road in Champery after a 168-kilometer (105-mile) ride.\nDiego Ulissi of Italy was second and Jesus Herrada of Spain was third in the same time as Albasini. Two-time Romandie winner Chris Froome of Britain was fifth.\nMichael Albasini from Switzerland of team Orica-Scott raises his arms after crossing the finish line to win the first stage, a 173.3 km race between Aigle and Champery at the 71th Tour de Romandie UCI ProTour cycling race in Champery, Switzerland, Wednesday, April 26, 2017. (Laurent Gillieron/Keystone via AP)\nAlbasini has at least one stage win in the six-day Romandie event for four straight years, and used this victory to be ninth in the standings.\nFelline, who won Tuesday's prologue, leads Max Schachmann of Germany by eight seconds. Herrada is in third place.\nThursday's stage is a rolling 161-kilometer (100-mile) ride to Bulle.\nThe overall leader Fabio Felline, center in yellow, from Italy of team Trek-Segafredo, leads the pack in front of the villages of Saillon, behind, and Leytron, center, during the first stage, a 173.3 km race between Aigle and Champery at the 71th Tour de Romandie UCI ProTour cycling race in Leytron, Switzerland, Wednesday, April 26, 2017. (Jean-Christophe Bott/Keystone via AP)\nThe pack rides during the first stage, a 173.3 km race between Aigle and Champery at the 71th Tour de Romandie UCI ProTour cycling race in Vex, Switzerland, Wednesday, April 26, 2017. (Jean-Christophe Bott/Keystone via AP)\nChris Froome, second from left, from Britain of team Sky Procycling rides in middle of the pack during the first stage, a 173.3 km race between Aigle and Champery at the 71th Tour de Romandie UCI ProTour cycling race in Leytron, Switzerland, Wednesday, April 26, 2017. (Jean-Christophe Bott/Keystone via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-4448454/Albasini-wins-Romandie-stage-Felline-retains-lead.html"}
