{"authors":["Jonathan Spencer For Mailonline"],"date_download":"2018-10-23 05:11:59","date_modify":"2018-10-23 05:11:59","date_publish":"2017-03-10 15:15:12","description":"24-year-old Liverpool defender Alberto Moreno has enjoyed a break from his club duties with Liverpool by adding some unique tattoos to his already bizarre collection.","filename":"data/vaneerConsumption/AlbertoMorenoshowsoffbizarrenewanimaltattoos.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/15/3E23AF5200000578-0-image-a-30_1489160413673.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4301418_Alberto-Moreno-shows-bizarre-new-animal-tattoos_1540271519.html","title":"Alberto Moreno shows off bizarre new animal tattoos","title_page":"Alberto Moreno shows off bizarre new animal tattoos | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Liverpool defender Alberto Moreno has enjoyed a break from his Liverpool duties by adding some unique tattoos to his already bizarre collection.\nThe left back took to Instagram on Friday afternoon to post a photo of himself being inked, alongside some of his new peculiar body works.\nThe Spaniard captioned the social media post: 'Thanks @franco_tattoo to come to Liverpool again. It's always a pleasure to be in your hands.'\nAlberto Moreno showed off his new tattoos on Friday after enjoying an inking session\nThe Spaniard enjoyed a break from his club duties to add to his bizarre tattoo collection\nSome of his new tattoos include a pitbull landing a punch with boxing gloves on, a tiger wearing a bandana and a panda with a smoke pipe in its mouth and a top hat on its head.\nMoreno, 24, has been sporting some distinctive body art for a while now. In April last year, he uploaded a photo on Instagram of a giant chimpanzee head.\nThe tattoo does not depict your usual monkey, but rather a well groomed ape holding a gun, wearing a suit and tie and also donning headphones and mirrored sunglasses reflecting palm trees.\nMoreno was heavily inked before his latest session under the needle, with full sleeves on both his arms and further tattoos on his stomach and his left shin.\nMoreno previously got a tattoo of an ape holding up a gun, wearing a suit and tie\nHowever, Moreno's focus now turns back to his club duties as Liverpool take on Burnley at Anfield on Sunday in the Premier League as they look to record back-to-back top flight victories.\nJurgen Klopp's side beat Arsenal 3-1 in their last league game and they will be hoping to get their revenge on Burnley, who beat them 2-0 at Turf Moor in the reverse fixture earlier on in the season.\nHowever, Moreno is likely to be watching the top flight match from the bench as he has struggled to get minutes under his belt this season.\nThe full back has only made nine appearances so far this campaign for the Reds in the league, playing the full 90 minutes only twice.","url":"https://www.dailymail.co.uk/sport/football/article-4301418/Alberto-Moreno-shows-bizarre-new-animal-tattoos.html"}
