{"authors":["Belinda Cleary","Liam Quinn","Belinda Grant Geary For Daily Mail Australia"],"date_download":"2018-10-22 20:47:11","date_modify":"2018-10-22 20:47:11","date_publish":"2016-01-28 03:47:37","description":"Former AFL Player, Albert Proud has plead guilty to bashing his girlfriend Richelle Kadadi in November last year, after his attempted murder charge was dropped. He was refused bail.","filename":"data/vaneerConsumption/AlbertProudpleadsguiltytobashinghisgirlfriendRichelleKadadi.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/03/30A6374300000578-0-image-a-15_1453950148260.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420313_Albert-Proud-pleads-guilty-bashing-girlfriend-Richelle-Kadadi_1540241231.html","title":"Albert Proud pleads guilty to bashing his girlfriend Richelle Kadadi","title_page":"Albert Proud pleads guilty to bashing his girlfriend Richelle Kadadi | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Albert Proud will no longer face attempted murder charges after the alleged bashing of his then girlfriend Richelle Kadadi last year.\nProud, 27, allegedly beat his partner of three months in a Sunnyback home, 15-minutes from Brisbane's CBD after the pair had attended a friend’s wedding on Saturday, November 8.\nMs Kadadi was found by her newly-wed friends after the alleged assault, and taken to hospital for treatment to injuries to her face and head.\nScroll down for video\nAn attempted murder charge against Albert Proud (left) has been dropped, however he still faces two lesser charges for the alleged assault of his girlfriend Richelle Kadadi (right)\nProud plead guilty to grievous bodily harm and willful damage in his court appearance on Thursday\nThe ex-AFL player was refused bail because of concerns for Ms Kadadi's welfare\nMr Proud appeared before Brisbane's Holland Park Magistrates Court on Thursday where the attempted murder charge against him was dropped.\nThe ex-Brisbane Lion pleaded guilty for the two outstanding lesser charges of grievous bodily harm and willful damage before the court on the day.\nProud’s lawyer argued unsuccessfully for his client’s release from custody.\nThe lawyer said Proud would be able to look for treatment for alcohol abuse if he was released from custody.\nThe court decided that releasing Proud would put Ms Kadadi in danger.\nThe couple's relationship began in August, 2016, and was well-documented on social media\nThe mother of one was recovering in hospital from a brain hemorrhage for a month after the alleged assault\nProud has been in custody for more than two months, but appeared before the court for the first time on Thursday\nThe mother of one, who’s 35, suffered a brain haemorrhage during the alleged assault and was hospitalised at Princes Alexandra Hospital for a month after being injured.\nWhile in hospital Ms Kadadi met Ben Pleuger, 28 who was also being treated for a head injury, after he fell from a golf buggie.\nThe Darwin local also said meeting Ms Kadadi 'changed his life in the best way', in a particularly emotional comment.\nShe met Ben Pleuger (left) while in hospital, he was recovering from a head injury as well\nThe Brisbane woman had to wear a helmet after her hospitalisation to prevent further damage to her head\nIn a number of adorable pictures posted on social media, the 35-year-old is seen hugging Mr Pleuger, 28.\nAlong with the series of candid snaps, the duo shared an adorable exchange, with him referring to her as 'an amazing girl'.\nDespite only being in the same place for about three weeks, they were able to forge a tight bond that extended beyond their treatment.\nAlong with the series of candid snaps, the duo shared an adorable exchange, with him referring to her as 'an amazing girl'\nMs Kadadi's last night in the treatment centre was December 9, and almost exactly one month later it appeared the duo had rekindled their closeness away from the hospital, posing for pictures together and with friends on January 9.\nIn another photo, which Ms Kadadi posted on Instagram earlier this month, the two are seen having dinner together, with the 35-year-old wearing a helmet, which it is believed is a precaution after her surgery.\nIt comes after detectives last year said it was a miracle Ms Kadadi survived the attack she suffered.\nDetectives have said that it was a miracle Ms Kadadi survived the attack she suffered\nShe is pictured here with friends when she reunited with Pleuger after leaving hospital\nPleuger and Kadadi have been capture in many photos since\nSuzie Tafolo, one of Ms Kadadi's 'best friends', has launched the 'FUNDS 4 RISH' page, which is taking donations 'to help out the family during this time take care of the bills for Richelle and help with any expenses needed for her son'.\n'Richelle is a young single mum who became a victim to domestic violence at it's worse, leaving her still in hospital fighting with all she has to come home to her little son and family and friends,' the description on the page reads.\n'Given the the gravity of the situation, we think that a good way to help, would be to raise as much money as possible to give her the help she needs for things like her bills and living expenses and whatever else she needs.'\nThe page has raised more than $18,000 since it was launched two months ago.\nProud did not attend the last court sitting in relation to the case. His next court date is yet to be listed.\nPrior to the alleged assault Proud and Kadadi had been celebrating the marriage of their friends\nProud's lawyer argued his client should be granted bail so he could get help for alcohol abuse, this was dismissed","url":"https://www.dailymail.co.uk/news/article-3420313/Albert-Proud-pleads-guilty-bashing-girlfriend-Richelle-Kadadi.html"}
