{"authors":["Shannon Carlin"],"date_download":"2018-10-31 01:40:48","date_modify":"2018-10-31 01:40:48","date_publish":"2018-08-28 14:54:13","description":"Although the latest Batman movie isn't about Batman at all — it's about his arch nemesis the Joker — that doesn't mean that important characters in Batman's universe won't be featured. Despite initial reports that Alec Baldwin would be playing…","filename":"data/vaneerConsumption/AlecBaldwinWillNotBeTheBatmansDadInJoaquinPhoenixsJokerMovieDespiteInitialReportsUPDATE.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/28/f93f1ab3-eaa7-4ff1-9b0f-8ee353f32e35-getty-961220104.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_alec-baldwin-will-not-be-the-batmans-dad-in-joaquin-phoenixs-joker-movie-despite-initial-reports-update-10259545_1540950048.html","title":"Alec Baldwin Will Not Be The Batman's Dad In Joaquin Phoenix's 'Joker' Movie, Despite Initial Reports - UPDATE","title_page":"Alec Baldwin Will Not Be The Batman's Dad In Joaquin Phoenix's 'Joker' Movie, Despite Initial Reports — UPDATE","title_rss":"NULL","source_domain":"bustle.com","text":"Although the latest Batman movie isn't about Batman at all — it's about his arch nemesis the Joker — that doesn't mean that important characters in Batman's universe won't be featured. Despite initial reports that Alec Baldwin would be playing Batman's dad in the new Joker movie, news came out on Wednesday that the actor was no longer involved with the project. Baldwin also addressed the reports on Twitter, writing: \"Let me state, for the record, that I have NOT been hired to play a role in Todd Phillips' JOKER as some Donald Trump manque. That is not happening. Not. Happening.\" Baldwin's reps had no comment when asked about the actor's initial involvement in the film.\nEARLIER: Joaquin Phoenix's Joker movie — not to be confused with Jared Leto's Joker movie currently in development — is being billed as a darker and grittier stand-alone film focused on the Clown Prince of Crime's origin story. It's unclear exactly how Bruce Wayne's father will fit into the story, but THR reported that Baldwin's Thomas Wayne will share some similarities with Trump. Specifically, this version of Batman's dad \"paints Thomas Wayne as a cheesy and tanned businessman who is more in the mold of a 1980s Donald Trump.\"\nSome fans might be thinking, doesn't Baldwin already do that almost every week on Saturday Night Live? Well, on the weekly comedy sketch show, Baldwin has been playing a current version of Trump, and this report specifically pointed to a 1980s Donald Trump, meaning a Trump of over 30 years ago, so there is some room for him to play with his own take on the current POTUS. Especially since this isn't meant to be Trump, but a character inspired by him. But even still, there are fans who aren't all the interested in seeing another Trumpian character come to life on screen via Baldwin.\nSome fans couldn't stop rolling their eyes over this news or, as Scott Wampler, the news editor at Birth. Death. Movies, tweeted, \"rolls eyes so hard neck literally shatters in four places.\"\nAnother fan, @yodaspecies tweeted their concern that this Trump-like Thomas Wayne \"feels like a description made to create buzz, especially since is Alec Baldwin playing him.\" Twitter user @AlexProcopis42 felt that this description revealed something else about the movie. \"Alec Baldwin playing Thomas Wayne as a sleazy, Trump-esque billionaire means this film does not care about these characters,\" they wrote.\nWhile another Twitter user @TomSteffler just thinks this news is too 2018 to handle. \"Alec Baldwin is going to play a Trump-like Thomas Wayne in Todd Phillip’s Joker film,\" they wrote. \"2018 just wants to watch the world burn.\"\nAlec Baldwin's casting aside, the Joker film, directed by Todd Phillips (of The Hangover trilogy), is an interesting progression for the villain who has been portrayed by Jack Nicholson, Heath Ledger, and most recently Leto. Entertainment Weekly reported that the Joker \"centers around the iconic arch nemesis and is an original, standalone story not seen before on the big screen.\" The report went on to describe the film as \"a gritty character study\" and a \"cautionary tale.\" The darker spin will also star Robert De Niro, Zazie Beetz, and Marc Maron.\nIt's worth noting that Tim Burton's 1989 Batman, the Joker (Nicholson) was the man who murdered Bruce Wayne's parents. It could be that this time around, Baldwin's Thomas Wayne will share the same fate as his on screen predecessor. And, while it's too early to know what tragedy will befall the character this time around, or whether Baldwin's take on Batman's dad will be anything like his SNL Trump. What is clear though is that the Joker is not going to let any Waynes, Thomas or Bruce, steal his spotlight.","url":"https://www.bustle.com/p/alec-baldwin-will-not-be-the-batmans-dad-in-joaquin-phoenixs-joker-movie-despite-initial-reports-update-10259545"}
