{"authors":["Ryan Smith For Mailonline"],"date_download":"2018-10-23 00:53:01","date_modify":"2018-10-23 00:53:01","date_publish":"2017-03-16 10:27:24","description":"Last week, Sir Philip Green agreed to pay out £363million to plug the black hole in the BHS pension scheme, following several months of outcry and pressure.","filename":"data/vaneerConsumption/AleshaDixonjoinsSirPhilipGreenfor65thbirthday.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E53436400000578-0-image-a-67_1489659382531.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319488_Alesha-Dixon-joins-Sir-Philip-Green-65th-birthday_1540255981.html","title":"Alesha Dixon joins Sir Philip Green for 65th birthday","title_page":"Alesha Dixon joins Sir Philip Green for 65th birthday | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Last week, Sir Philip Green agreed to pay out £363million to plug the black hole in the BHS pension scheme, following several months of outcry and pressure.\nBut on Thursday, the fashion tycoon put his scandal to one side, as he was toasted by London's elite while celebrating his 65th birthday at China Tang restaurant.\nAlesha Dixon led the glamour, as she arrived hand-in-hand with her partner Azuka Ononye looking stunning in a silver silk minidress with a black sheer floral overlay.\nScroll down for video\nWe like to party: Alesha Dixon was spotted arriving at London's China Tang restaurant with her partner Azuka Ononye on Wednesday night for Sir Philip Green's 65th birthday party\nThe flattering number, which boasted a frilly chiffon hem and dramatic sleeves, allowed the 38-year-old beauty to show off her enviably toned legs.\nBritain's Got Talent judge Alesha donned a pair of nude strappy heels, while a pink leather handbag added an extra flourish of colour to her eye-catching ensemble.\nHer voluminous raven tresses were swept back in a sleek ponytail with a centre-parting, while a deep shade of pink was selected for her lipstick and eyeshadow.\nShe entered the upscale eatery holding hands with her handsome dancer beau, who looked dapper in a black velvet tuxedo jacket over a black shirt and navy trousers.\nWow: The Britain's Got Talent judge wowed in a silk minidress with a black sheer floral overlay\nThe glamorous couple, who have been together since 2012, are parents to three-year-old daughter Azura Sienna.\nLouise Redknapp was also in attendance at the bash, wearing a plunging black top with matching cropped trousers under a cream blazer with a sash belt.\nShe smiled as she walked beside her former footballer husband Jamie Redknapp, who cut a smart figure in a black suit and crisp white shirt.\nFollowing months of criticism - including calls for him to be stripped of his knighthood - Philip Green finally agreed to the BHS pensions payout.\nGuests: Louise Redknapp was also seen at the bash with her former footballer husband Jamie\nThe cash went some way to protect the retirement income of 19,000 ex-employees from the collapsed High Street chain.\nBHS failed a year after he sold the company to three-times bankrupt former racing driver Dominic Chappell – leaving a £571million pension deficit\nThe sale split BHS from the rest of his retail empire, which includes brands such as Topshop/Topman, Burton, Miss Selfridge, Wallis and Dorothy Perkins.\nThe health of these chains is unknown, but this week it was revealed he has agreed a deal to pump an extra £50million into the Arcadia pension fund to plug its deficit.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319488/Alesha-Dixon-joins-Sir-Philip-Green-65th-birthday.html"}
