{"authors":["Jabeen Waheed For Mailonline"],"date_download":"2018-10-23 02:07:51","date_modify":"2018-10-23 02:07:51","date_publish":"2017-03-10 11:01:19","description":"Alessandra Ambrosio put on a showstopping appearance as she attended the grand opening of Victoria's Secret Chengdu Store in China on Friday.","filename":"data/vaneerConsumption/AlessandraAmbrosiowearsfigurehuggingwhitedress.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E222CCF00000578-0-image-a-35_1489141234690.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300690_Alessandra-Ambrosio-wears-figure-hugging-white-dress_1540260471.html","title":"Alessandra Ambrosio wears figure-hugging white dress","title_page":"Alessandra Ambrosio wears figure-hugging white dress | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She walked in her first Victoria's Secret runway show eleven years ago.\nSo it's no surprise Alessandra Ambrosio put on a showstopping appearance as she attended the grand opening of the lingerie giant's Chengdu Store in China on Friday.\nThe 35-year-old supermodel worked her angles in a figure-hugging white dress, which drew emphasis to her enviably svelte frame.\nScroll down for video\nSpreading her wings! Alessandra Ambrosio, 35, put on a showstopping appearance as attended the grand opening of Victoria's Secret Chengdu Store in China on Friday\nThe sleeveless sophisticated number lined the contours of her physique, before falling a stylish midi-level.\nAlessandra's garment also boasted a high neckline, which was bedazzled in silver.\nThe Brazilian beauty boosted her already statuesque 5 ft 8 in height with a pair of open-toe strappy heels.\nThe mother-of-two's striking features where enhanced with expertly applied bronzer, mascara and glossy mauve lipstick.\nSexy lady: The supermodel worked her angles in a figure-hugging white dress, which drew emphasis to her enviably svelte frame\nFashionista: The sleeveless sophisticated number lined the contours of her physique, before falling a stylish midi-level\nHaving fun: Alessandra put on a fun and flirty display at the opening as she blew kisses and made heart signs with her hand\nShe accessorised simply with a silver bracelet and two large hoop earrings as she proved to be the perfect brand ambassador by showing off the products.\nAlessandra looked sensational as she posed up a storm with her fellow model Sui He as they joyfully cut a large bright pink ribbon.\nThey then proceeded to work their angles against a plethora of lingerie clad mannequins and large angel wings.\nEarlier this week, Alessandra was thrilled as she posed alongside her wax counterpart at Madame Tussauds in Shanghai.\nAngelic: Alessandra's garment also boasted a high neckline, which was bedazzled in silver\nGlam pals: She posed up a storm with Chinese model Sui He, who oozed elegance in a chic black dress\nDetails: She accessorised simply with a silver bracelet and two large hoop earrings as she proved to be the perfect brand ambassador\nAfter their successful London and Paris shows, the company announced this week that the Victoria's Secret Fashion Show will be held in China this fall, according to WWD.\nWhile the models are living it up, the brand has yet to announce any more details about the upcoming show, though it is likely to be held in November and televised in the US in December.\nIn 2016, Lady Gaga and The Weeknd both performed on the Paris runway, while the Angels, the Hadid sisters, and Kendall Jenner strutted their stuff.\nBra-vo! Alessandra and Sui He cheekily held up some racy lingerie\nCalm and collected: The striking stars were in high spirits as they flashed peace signs\nSelling the products: Alessandra and Sui proved to be the perfect brand ambassadors\nThe year before the girls were in London and walked to performances by Rihanna and The Weeknd.\nAmbrosio, who is engaged to Jamie Mazur, has always had a killer physique and the brunette beauty recently opened up about exercise and her body.\n'In my family, no one ever worked out,' she told Net-a-Porter.\n'It wasn't until I did my first Victoria's Secret show that I started exercising... now it's a healthy, normal part of my daily routine.'\nStanding tall: The Brazilian beauty boosted her already statuesque 5 ft 8 in height with a pair of open-toe strappy heels\nOpening night: Alessandra and Sui looked sensational as they joyfully cut a large bright pink ribbon\nLeggy lady: Sui showed off her trim legs in a pair of towering black and gold cuff heels\nShe also spoke honestly about the female body and how it changes after childbirth.\n'Your body will never go back to exactly what it was before pregnancy, whatever people tell you. It can't,' she continued.\nHowever, she did admit that that was no bad thing.\n'But I think I have a better body now than before I had kids. It's partly because I work out, whereas before I didn't, but also to do with the shape—it just looks more formed now and I feel better about it than I did.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300690/Alessandra-Ambrosio-wears-figure-hugging-white-dress.html"}
