{"authors":["Caitlin Cruz"],"date_download":"2018-10-31 00:01:54","date_modify":"2018-10-31 00:01:54","date_publish":"2018-10-28 21:35:09","description":"On Sunday, Democratic congressional candidate Alexandria Ocasio-Cortez criticized the Trump administration's response to the shooting at a Pittsburgh synagogue. \"Imagine if it was ISIS that sent bombs to US officials, started shooting in grocery…","filename":"data/vaneerConsumption/AlexandriaOcasioCortezCallsOutTrumpAdministrationOfficialsAfterThePittsburghSynagogueShooting.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/10/28/64a4acd9-511e-47ca-a117-a9cb61a9f8e4-getty-1009882628.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_alexandria-ocasio-cortez-calls-out-trump-administration-officials-after-the-pittsburgh-synagogue-shooting-13011379_1540944114.html","title":"Alexandria Ocasio-Cortez Calls Out Trump Administration Officials After The Pittsburgh Synagogue Shooting","title_page":"Alexandria Ocasio-Cortez Calls Out Trump Administration Officials After The Pittsburgh Synagogue Shooting","title_rss":"NULL","source_domain":"bustle.com","text":"On Sunday, Democratic congressional candidate Alexandria Ocasio-Cortez criticized the Trump administration's response to the shooting at a Pittsburgh synagogue. \"Imagine if it was ISIS that sent bombs to US officials, started shooting in grocery stores, and invading places of worship,\" Ocasio-Cortez tweeted. \"How do you think this administration would respond?\"\nOn Saturday, a 46-year-old man walked into a synagogue in Squirrel Hill, a historically Jewish neighborhood in Pittsburgh. He killed at least 11 people, one as old as 97, according to USA Today. The suspected shooter faces at least two hate crime charges and 27 others, according to CNN.\nAfter the shooting, President Donald Trump suggested that the synagogue should employ armed guards to keep worshippers safe. The shooting took place during a Shabbat service on Saturday morning. \"If there was an armed guard inside the temple, they would have been able to stop him,\" Trump told reporters on Saturday, according to CNN.\nAt a campaign event on Saturday, Trump said the shooting was \"anti-Semitic\" and \"pure evil,\" according to CNN. \"There must be no tolerance for anti-Semitism in America or for any form of religious or racial hatred or prejudice,\" Trump said, according to the news network.\nOcasio-Cortez asked her followers to consider why the response to similar attacks carried out by \"white supremacists\" is so different than those carried out by others.\nOcasio-Cortez wasn't the only Democratic politician to question how Republican lawmakers have responded to incidents of white supremacy. Democratic Pennsylvania Gov. Tom Wolf pushed back on Trump's dismissal of the idea that gun laws should be re-examined. \"Dangerous weapons are putting our citizens in harm’s way,\" Wolf said, according to The New York Times. We shouldn't accept \"this violence as normal.\"\nFormer President Barack Obama — one of the prominent Democrats who was sent a pipe bomb in the last week — also spoke out against the rise of anti-Semitic rhetoric. \"We grieve for the Americans murdered in Pittsburgh. All of us have to fight the rise of anti-Semitism and hateful rhetoric against those who look, love, or pray differently,\" Obama tweeted on Saturday.\nObama also called for a examination of American gun laws. \"And we have to stop making it so easy for those who want to harm the innocent to get their hands on a gun,\" Obama tweeted.\nHouse Minority Leader Nancy Pelosi echoed Obama's call to overhaul the nation's gun laws. \"But thoughts and prayers are not enough,\" Pelosi said in a statement, according to The New York Times. \"Congress must finally act on common sense, bipartisan gun violence prevention legislation.\"\nVice President Mike Pence downplayed any connection between Trump's rhetoric and attacks like those in Pittsburgh or the pipe bombs sent. \"Look, everyone has their own style, and frankly, people on both sides of the aisle use strong language about our political differences,\" Pence told NBC News. \"But I just don't think you can connect it to acts or threats of violence.\"\nPence said rhetoric was a part of the political process.\n\"The American people believe in the freedom of speech,\" Pence told NBC News. \"And throughout the history of this country we've always had vigorous debates and then we settle those debates in the ballot box. We don't settle them through acts or threats of violence like the pipe bombs we saw sent to the Obamas, the Clintons, to CNN and others.\"","url":"https://www.bustle.com/p/alexandria-ocasio-cortez-calls-out-trump-administration-officials-after-the-pittsburgh-synagogue-shooting-13011379"}
