{"authors":["Rebecca Davison For Mailonline"],"date_download":"2018-10-22 21:03:07","date_modify":"2018-10-22 21:03:07","date_publish":"2016-01-11 00:02:15","description":"The Welsh television presenter, 38, married New Zealander Charlie Thomson in a ceremony at Cardiff Castle.","filename":"data/vaneerConsumption/AlexJoneswillembracetheoutdoorsduringweddingvowstoCharlieThompson.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/10/19/2FFB784000000578-0-image-a-52_1452454638927.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3392901_Alex-Jones-said-embrace-outdoors-wedding-vows-Charlie-Thompson_1540242187.html","title":"Alex Jones will embrace the outdoors during wedding vows to Charlie Thompson","title_page":"Alex Jones will embrace the outdoors during wedding vows to Charlie Thompson | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The One Show's Alex Jones promised to 'embrace the outdoors, including camping', in her wedding vows when she married on New Year's Eve.\nThe Welsh television presenter, 38, married New Zealander Charlie Thomson in a ceremony at Cardiff Castle.\nTalking about her wedding, she told Hello! magazine: 'It was spectacular. Everyone says it's the best day of your life and it just exceeded my expectations. I enjoyed every single second.'\nScroll down for video\nAll about compromise: The One Show's Alex Jones promised to 'embrace the outdoors, including camping', in her wedding vows to Charlie Thompson when she married on New Year's Eve\nShe added: 'I'd told myself not to let it pass in a blur, because it really is quite overwhelming and nerve-racking. But I really did love it, seeing all my friends' faces.\n'And then once I held hands with Charlie, I thought, \"We're right\".'\nAlex looked incredible in her fairytale style wedding gown which had a full-skirted prom detail and traditional veil.\nSo happy: Talking about her wedding, she told Hello! magazine: 'It was spectacular. Everyone says it's the best day of your life and it just exceeded my expectations. I enjoyed every single second'\nRead the full article in Hello! out now\nInsurance broker Charlie said he couldn't stop smiling as his bride walked down the aisle. He said: 'Alex looked absolutely stunning.'\nDuring the ceremony the couple spoke in English and Welsh and their vows included a 'personal touch', reports the publication.\nThomson's vows included a promise to \"'stand by you, whatever the future holds, to cherish and care for you and always be there for you when you need my support',\nHe added: 'I promise not to take too long in the shower and to be on time.'\nAlex also made her own vows and said: 'I promise to try to develop patience and to embrace the outdoors and all it has to offer, including camping.'\nShe tweeted after the big day: 'Thank you so much for your messages of congratulations. I am one happy Mrs.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3392901/Alex-Jones-said-embrace-outdoors-wedding-vows-Charlie-Thompson.html"}
