{"authors":["Sara Malm For Mailonline","Sam Greenhill In Gothenburg","Sweden","For The Daily Mail"],"date_download":"2018-10-22 22:33:14","date_modify":"2018-10-22 22:33:14","date_publish":"2016-01-28 10:36:59","description":"The migrant centre in Molndal, Sweden, where a young asylum worker was murdered on Monday may face manslaughter charges. Alexandra Mezher had been working alone on a night shift.","filename":"data/vaneerConsumption/AlexandraMezhersasylumcentremayfacecorporatemanslaughtercharge.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A5EBD000000578-0-image-a-2_1453978919132.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420514_Migrant-centre-Swedish-refugee-worker-stabbed-death-working-night-shift-face-corporate-manslaughter-charge-murder_1540247594.html","title":"Alexandra Mezher's asylum centre may face corporate manslaughter charge","title_page":"Alexandra Mezher's asylum centre may face corporate manslaughter charge | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The child migrant centre where a young social worker was stabbed to death may face corporate manslaughter charges over her murder.\nAlexandra Mezher, 22, died after being knifed at a shelter for unaccompanied young asylum seekers in Molndal, Gothenburg.\nMiss Mezher was working alone on a night shift in the housing block, home to ten teenage asylum seekers, when she was attacked by a boy believed to be 15 years old and from Somalia.\nAlexandra Mezher (right, with her mother Chimene) , 22, died after being knifed at a shelter for unaccompanied young asylum seekers\nMiss Mezher's mother Chimene said 'orphans' at the centre (pictured) often lied about their age\nA boy is in police custody being held at a high security psychiatric unit being quizzed by murder detectives over the killing.\nProsecutors are also investigating where the migrant centre where Miss Mezher worked is responsible for her death, it has emerged.\nThe management company that runs the centre HVB Living Nordic may be charged with violating work environment law and involuntary manslaughter, Goteborgs Posten reports.\nIn addition to the police murder investigation, Sweden’s Work Environment Administration has launched a probe into whether HVB Living Nordic broke work environment law by letting Miss Mezher work alone.\nMiss Mezher’s employer is a private company which is paid by the local authority to provide housing and care for unaccompanied minors.\nIn 2014, Molndal received 276million SEK(£22.6m) to provide housing for unaccompanied minors – the most state funding per capita than any town or city in Sweden.\nHVB Living Nordic reported a profit earning £67,250 profit for the year.\nHer mother revealed yesterday she complained she was caring for 'big powerful guys' aged up to 24, at the centre despite it being for children aged 14-17.\nAlexandra's mother said her daughter (second from left) had been warned four hours before she started her last shift that a knife had been stolen from the kitchen, but nothing was apparently don\nShe said her daughter worked there alone on night shifts because she wanted to help 'mother' the supposed youngsters, some of whom in reality were grown men.\nIt came as police last night charged Youssaf Khaliif Nuur, a Somalian '15-year-old', with murder and attempted murder – but admitted they may not know his true identity.\nMrs Mezher, 42, said: 'Alexandra knew how to handle children including violent ones. But those she was working with were big powerful guys – she could see it in their eyes and their bodies.\n'A few were maybe under 18, but the rest were older, maybe 23 or 24.'\nShe said her psychology graduate daughter had been warned four hours before she started her last shift that a knife had been stolen from the kitchen, but nothing was apparently done.\nThe shelter was set up in Molndal, a suburb of Gothenburg, to house migrants aged 14 to 17. Some 4,000 arrived without their parents in the past year alone in Molndal, which has a population of just 60,000.\nMrs Mezher said: 'She said she had two from Somalia there, but never mentioned any trouble with them. Alexandra never said she was afraid of working there – I think she was protecting me, she did not want to scare me.\n'But a friend from the centre called her four or five hours before she started work that day to say a knife had been stolen from the kitchen. I heard her talking.\nAlexandra (right) is said to have earlier warned that she was caring for 'big powerful guys' aged up to 24\nFlowers and candles (pictured) were left outside the refuge centre in Molndal, near Gothenburg, where Alexandra was killed\nNo one was allowed to say anything to their bosses at that place, they were too frightened, so I don't know if the missing knife was reported.\n'The boss of the company has not even been here to see the family.'\nMother-of-four Mrs Mezher, who migrated from Lebanon 25 years ago, said: 'Immigration has destroyed Sweden, they are coming in more than the country can accept. The kids that are coming here are criminal.'\nShe later wept bitterly as she remembered her 'angel' daughter at a church memorial service attended by 100 mourners who brought pink and white roses, Miss Mezher's favourite flowers.\nStaff at the centre where the aid worker was stabbed in the back and thigh on Monday morning were allegedly ignored when they repeatedly warned a 'serious' incident would happen, it was claimed.\nA therapist at the shelter said: 'The management was not listening. All staff complained they were extremely understaffed and often had to work alone. We [said] it was only a matter of time before something serious happened.'\nAsylum centre inspectors recently wrote that supervisors had been warned 'several times' about cutbacks leading to staff being left alone, and Mrs Mezher yesterday vowed to sue those responsible.\nNational police chief Dan Eliasson sparked controversy by expressing sympathy for the alleged attacker, saying: 'Who knows what horrors he has been through?'\nAsylum centre inspectors recently wrote that supervisors had been warned 'several times' about cutbacks leading to staff being left alone (pictured, the psychiatric unit where murder suspect, 15, is being held)\nPatrick Sjogren, boss of HVB Living Nordic, the company that runs the centre, is a former wine company chairman also involved in internet poker.\nHe said: 'We follow all the rules. It is true, I have worked in other areas, but that does not make me less suited to working with unaccompanied refugee children. We have had several indications from (the inspectors) that we are doing it right.'\nLast night Swedish police named their suspect – who is due in court today – but added in a statement: 'The identity is not proven.' Meanwhile, national police chief Dan Eliasson sparked controversy by expressing sympathy for the alleged attacker, saying: 'Who knows what horrors he has been through?'\nHe said he was 'distressed' by the tragedy, but added: 'Under what circumstances has he grown up? What is the trauma he carries? This entire immigration crisis shows how unfair life is in many parts of the world.'\nn A Danish teenager who claims she was sexually assaulted near a centre for migrants has been told she faces a fine for using pepper spray on her attacker.","url":"https://www.dailymail.co.uk/news/article-3420514/Migrant-centre-Swedish-refugee-worker-stabbed-death-working-night-shift-face-corporate-manslaughter-charge-murder.html"}
