{"authors":["Matt Barlow For Mailonline"],"date_download":"2018-10-23 01:20:09","date_modify":"2018-10-23 01:20:09","date_publish":"2016-01-29 15:13:22","description":"MATT BARLOW: Guus Hiddink has rejected the idea that signing Alexandre Pato represents a risk for Chelsea. The Brazilian has completed his move to Stamford Bridge.","filename":"data/vaneerConsumption/AlexandrePatoisnotagambleforChelseasaysbossGuusHiddinkasstarcompletesStamfordBridgeloanmove.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30A1B7F600000578-0-image-a-4_1454079650075.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422945_Alexandre-Pato-not-gamble-Chelsea-says-boss-Guus-Hiddink-striker-closes-Stamford-Bridge-loan_1540257609.html","title":"Alexandre Pato is not a gamble for Chelsea, says boss Guus Hiddink as star completes Stamford Bridge loan move","title_page":"Alexandre Pato is not a gamble for Chelsea, says boss Guus Hiddink as star completes Stamford Bridge loan move | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Guus Hiddink has rejected the idea that signing Alexandre Pato represents a risk for Chelsea.\nPato was in London for a work permit hearing on Friday and completed his loan move from Corinthians.\nHiddink trusts the 26-year-old former AC Milan striker, who lost his way after such a promising start in Italy, has the appetite to revive his career having decided to come back to Europe.\nAlexandre Pato arrived in London this week to tie up a loan deal with Chelsea until the end of the season\nChelsea boss Guus Hiddink does not believe signing the Brazilian is a gamble for the Blues\n'It is a brave step,' said Chelsea's interim manager. 'He could've been playing in Brazil where there's more space. Here it's 90 minutes at high-tempo, less space and time. You must respect this step.\n'I've not spoken to him personally, but I've told people around him that I want to see desire. I think, when he didn't have this big desire, he would not have made this step. He would have played in Brazil and life would have gone on.\nHiddink confirmed on Friday that the club and the player are in the process of finalising paperwork\n'That's why it's good to see him here. It's not a gamble. To have him on loan is less of a risk for the club. We will have a good view of him, measure his physical fitness. I'm curious to see him on the pitch.\n'I will help him make that next step, but it is up to him. He has to do it.'\nPato expressed his happiness at signing for Chelsea when he arrived in London this week\nHiddink says defender Gary Cahill will not be leaving the club during the January transfer window\nHiddink gave 'the green light' to the deal because he needed more options up front, although he admits Pato must work on fitness levels after finishing the Brazilian season, on loan at Sao Paulo, in early December.\nChelsea strikers Loic Remy and Radamel Falcao have calf injuries, and either could depart before the transfer window shuts on Monday.\n'I don't think being injured has any bearing on whether he stays or goes,' said Hiddink, when asked about Remy, who is wanted by Newcastle and Leicester.\nLoic Remy looks set to leave the club with Leicester and Newcastle keen on completing a deal\nChinese club Jiangsu Suning, who paid £25million for Ramires, are interested in Falcao, who is on loan from Monaco. Patrick Bamford is off to Norwich on loan.\nDiego Costa will take the strain up front. 'It might be a big burden on him,' said Hiddink. 'That's why I'm saying: 'Hey guys, it's not just down to Diego to deliver the goals. You have to chip in as well'.'\nThe 69-year-old Dutchman insisted Gary Cahill would not be sold, and said Matt Miazga, a 20-year-old US centre-half close to joining for £3.5m from New York Red Bulls, will go into the first-team squad to provide cover.","url":"https://www.dailymail.co.uk/sport/football/article-3422945/Alexandre-Pato-not-gamble-Chelsea-says-boss-Guus-Hiddink-striker-closes-Stamford-Bridge-loan.html"}
