{"authors":["Dan Cain For Mailonline"],"date_download":"2018-10-23 01:20:22","date_modify":"2018-10-23 01:20:22","date_publish":"2016-01-29 15:10:03","description":"Alex Gerrard, 33, was on the Mersey beat on Friday as she hit her gym and went for a jog around the Allerton suburb with a pal.","filename":"data/vaneerConsumption/AlexGerrardshowcaseshershapelylimbsassheheadsoutinLiverpool.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/30B3077B00000578-0-image-a-11_1454079153192.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422934_Alex-Gerrard-showcases-shapely-limbs-spring-step-heads-jog-return-Liverpool_1540257622.html","title":"Alex Gerrard showcases her shapely limbs as she heads out in Liverpool","title_page":"Alex Gerrard showcases her shapely limbs as she heads out in Liverpool  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She splits her time between the sunny climes of Los Angeles and her home city of Liverpool.\nAnd Alex Gerrard, 33, was on the Mersey beat on Friday as she hit her gym and went for a jog around the Allerton suburb with a pal.\nThe model, who's married to Ex-Liverpool Football Club captain Steven, walked the short distance from her car to the gym in her sports gear and had a big smile on her face.\nScroll down for video\nWork it out: Alex Gerrard, 33, was on the Mersey beat on Friday as she hit her gym and went for a jog around the Allerton suburb with a pal\nKeeping things co-ordinated, the fitness fanatic dressed in a black and white striped vest top worn underneath a thin black hoody and a striped snood.\nShe matched it with a pair of black leggings which showcased her toned limbs and completed the ensemble with a pair of comfy running shoes.\nAs she walked she hung her black leather handbag over her right arm while clutching her phone.\nBling! Even on the move, clues of Alex's extravagant lifestyle could be seen with her huge rock glistening on her finger\nFitness fanatic: The model, who's married to Ex-Liverpool Football Club captain Steven, walked the short distance from her car to the gym in her sports gear and had a big smile on her face\nTypically glam: Keeping things co-ordinated, the fitness fanatic dressed in a black and white striped vest top worn underneath a thin black hoody and a striped snood\nHaving perfected the art of looking good while working up a sweat, Alex wore her hair pulled back in a ponytail and applied minimal make-up.\nOnce she'd ditched her belongings, she took off her hoody and set off on her jog at a brisk pace.\nHer ponytail bobbed as he moved with a light step. Even on the move, clues of Alex's extravagant lifestyle could be seen with her huge rock glistening on her finger.\nRun like the wind: Once she'd ditched her belongings, she took off her hoody and set off on her jog at a brisk pace\nCommitted: The WAG was spotted working on her physique in LA last weekend as she hit a SoulCycle class with a pal\nThe mother-of-three was recently pictured in LA hitting a SoulCycle class, before meeting her hubby for a romantic lunch.\nThe model looked typically svelte as she sauntered to the gym in a thin leopard-print coat, monochrome training top, Adidas leggings and matching black trainers.\nIt was clearly an intense session with Alex's cheeks appearing flushed as she re-emerged from the gym.\nHer friend had also tied her jumper around her waist suggesting the pair worked up quite a sweat on the bikes.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422934/Alex-Gerrard-showcases-shapely-limbs-spring-step-heads-jog-return-Liverpool.html"}
