{"authors":["Seth Millstein"],"date_download":"2018-10-31 01:48:44","date_modify":"2018-10-31 01:48:44","date_publish":"2018-09-13 22:13:42","description":"On Thursday, President Trump rejected the Puerto Rico government's conclusion that nearly 3,000 people died in the territory during Hurricane Maria, and falsely claimed that the death toll was artificially inflated \"by the Democrats in order to make…","filename":"data/vaneerConsumption/AlexandriaOcasioCortezsResponseToTrumpDenyingHurricaneMariaDeathsCutsDeep.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/077452d4-2b27-4695-aed4-f3896013f78a-screen-shot-2018-09-13-at-61155-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_alexandria-ocasio-cortezs-response-to-trump-denying-hurricane-maria-deaths-cuts-deep-11914051_1540950524.html","title":"Alexandria Ocasio-Cortez's Response To Trump Denying Hurricane Maria Deaths Cuts Deep","title_page":"Alexandria Ocasio-Cortez's Response To Trump Denying Hurricane Maria Deaths Cuts Deep","title_rss":"NULL","source_domain":"bustle.com","text":"On Thursday, President Trump rejected the Puerto Rico government's conclusion that nearly 3,000 people died in the territory during Hurricane Maria, and falsely claimed that the death toll was artificially inflated \"by the Democrats in order to make me look as bad as possible.\" Not long thereafter, New York congressional candidate Alexandria Ocasio-Cortez blasted Trump's Puerto Rico claim, and revealed that one of her family members died in Maria's wake.\n\"My own grandfather died in the aftermath of the storm,\" Ocasio-Cortez wrote on Twitter, quote-tweeting Trump. \"Uncounted. Thousands of Puerto Ricans have similar stories. They have lost children, friends, & family members.Instead of finger-pointing, INVEST in the Marshall Plan for Puerto Rico + just transition to renewable energy.\"\nA 28-year-old Democratic Socialist, Ocasio-Cortez made national headlines in June when, in an upset victory that few saw coming, she defeated 10-term incumbent Rep. Joe Crowley to win the Democratic nomination in New York's 14th congressional district. As the district is heavily Democratic, Ocasio-Cortez is expected to cruise to victory in November.\nAlthough Puerto Rican officials initially claimed that only 64 people died during Hurricane Maria in its aftermath, that number was viewed with widespread skepticism, and so the government commissioned independent researchers at George Washington University to conduct a formal study. In August, they released the results, which found that around 2,975 people died as a result of the hurricane. The Puerto Rican government subsequently adopted this as the official death toll; a CNN analysis arrived at similar numbers, while a Harvard University study put the death toll at 4,645.\nTrump denied all of this, however.\n\"3000 people did not die in the two hurricanes that hit Puerto Rico,\" Trump tweeted Thursday. \"When I left the Island, AFTER the storm had hit, they had anywhere from 6 to 18 deaths. As time went by it did not go up by much. Then, a long time later, they started to report really large numbers, like 3000.\"\nTrump also went on to accuse Democrats of falsifying the official numbers; there's no evidence to support this allegation, and Trump did not attempt to present any.\n\"This was done by the Democrats in order to make me look as bad as possible when I was successfully raising Billions of Dollars to help rebuild Puerto Rico,\" the president falsely claimed. \"If a person died for any reason, like old age, just add them onto the list. Bad politics. I love Puerto Rico!\"\nThe reaction from Republicans was mixed. Florida Gov. Rick Scott, normally a close Trump ally, rejected the president's claims, writing in a tweet that he's \"been to Puerto Rico 7 times & saw devastation firsthand,\" and confirming that he \"disagree[s] with @POTUS\" on the official numbers.\nRepublican Sen. Lindsey Graham offered a soft defense of Trump, however, claiming merely that the president didn't use \"the right words\" but agreeing that the official numbers should be questioned.\nTrump was widely criticized for his response to Hurricane Maria. Shortly after the storm hit, he criticized the Puerto Rican government for running up a \"massive debt\" and said that the island is in \"deep trouble\" not because of the hurricane, but because of the \"billions of dollars owed to Wall Street and the banks which, sadly, must be dealt with.\" He then personally attacked San Juan Mayor Carmen Yulín Cruz for displaying \"poor leadership\" and complained that relief workers in the territory \"want everything done for them.\"\nMore substantively, the administration withdrew a $4.9 billion loan Congress had allocated to Puerto Rico after discovering that the island already had a cash balance of 1.7 million. According to the catastrophe-modeling firm AIR Worldwide, Puerto Rico suffered around $70 billion in damages as a result of Maria.","url":"https://www.bustle.com/p/alexandria-ocasio-cortezs-response-to-trump-denying-hurricane-maria-deaths-cuts-deep-11914051"}
