{"authors":["Sunni Upal For Mailonline"],"date_download":"2018-10-23 00:30:10","date_modify":"2018-10-23 00:30:10","date_publish":"2016-01-11 09:53:42","description":"Alexis Sanchez will not be fit for Arsenal's trip to Liverpool on Wednesday as he continues his recovery from injury. The Chilean forward has not played since November at Norwich.","filename":"data/vaneerConsumption/AlexisSanchezwillmissLiverpoolclashsaysArseneWengerashetellsJurgenKlopptoadapttoEnglishfootball.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/09/2D823D1F00000578-0-image-a-23_1452505560150.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3393615_Alexis-Sanchez-miss-Arsenal-s-clash-Liverpool-Arsene-Wenger-says-striker-return-weekend_1540254610.html","title":"Alexis Sanchez will miss Liverpool clash, says Arsene Wenger as he tells Jurgen Klopp to adapt to English football","title_page":"Alexis Sanchez will miss Liverpool clash, says Arsene Wenger as he tells Jurgen Klopp to adapt to English football | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Alexis Sanchez will not be fit for Arsenal's trip to Liverpool on Wednesday as he continues his recovery from injury.\nThe Chilean forward has not played since limping off against Norwich in November, and Arsenal manager Arsene Wenger said the game at Anfield will be too soon for a Sanchez return.\nWenger added, though, that Sanchez may be back for Arsenal's trip to Stoke on Sunday.\n'It is too soon for Alexis Sanchez, maybe he will be fit for Sunday,' Wenger said at a press conference on Monday.\nWenger, meanwhile, has told Jurgen Klopp he must adapt to the traditions of English football after the Liverpool boss spoke out about his team's fixture pile-up.\nAlexis Sanchez will miss Arsenal's trip to Liverpool on Wednesday as he continues his recovery from injury\nSanchez has not played for Arsenal since limping off in a draw at Norwich in November\nThe Reds welcome Wenger's league-leading Arsenal to Anfield on Wednesday night after making 11 changes to their team for the 2-2 FA Cup third-round draw at Exeter on Friday night.\nKlopp is struggling with a chronic injury list as he looks to improve on a run of two wins from their last six Barclays Premier League games.\nLiverpool face a run of six games in 18 days now they have to negotiate a replay with Exeter, with Klopp saying the biggest difference between managing in England rather than Germany is the number of games.\nBut Wenger, now in his 20th season at Arsenal, reckons adjusting to the pressure of playing more games is something everyone who comes to manage in the Barclays Premier League is important.\n'I must say you get that from everybody who comes to England at the start because you have to adapt to the English style,' he said.\n'I was like that, and I'm still in favour of a winter break, but without losing the traditions of English football. That is play over Christmas, and maybe have a break in January.\nArsene Wenger told Jurgen Klopp he needs to adapt to English football and the number of fixtures\n'But I believe as well that we go a little bit overboard because today the English clubs are in a financial situation to have a squad of 25 top, top level players. It's not like it was 25 years ago, so we cannot always complain that we play too much because we have players who can rotate, players who want to play.\n'In every club now, when I look at the bench I am quite impressed with the players who are there and can play, so I don't believe that it's like we have 13 players who have to play every single game.'\nKlopp has introduced his successful 'gegenpressing' style at Anfield after it helped him to five major honours during his time in charge of Borussia Dortmund.\nKlopp has been outspoken at Liverpool's hectic schedule compared to what he saw in Germany\nLiverpool fielded a team of youngsters in the FA Cup third round at Exeter on Friday and drew 2-2\nThe physical exertion required to succeed with such a method of play has been highlighted by some as a reason for the number of injuries accumulating at Liverpool - a theory Wenger dismissed.\n'I don't think you can explain the injuries of the players by the intensity of the game,' he said.\n'First of all it's difficult for me to assess this situation because I don't know exactly what's happening. Every injury is an individual case.\n'We have been confronted with that as well and sometimes you are hit at a moment without doing much different to before, and you don't really know why.","url":"https://www.dailymail.co.uk/sport/football/article-3393615/Alexis-Sanchez-miss-Arsenal-s-clash-Liverpool-Arsene-Wenger-says-striker-return-weekend.html"}
