{"authors":["Kirspencer For Daily Mail Australia"],"date_download":"2018-10-22 23:30:43","date_modify":"2018-10-22 23:30:43","date_publish":"2017-03-16 06:59:09","description":"The girls donned flowing frocks for the occasion, with Alex looking happy and relaxed in the face of reports she and beau Richie Strahan may have parted ways.","filename":"data/vaneerConsumption/AlexNationsharescutedinnerdatewithGeorgiaLove.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/05/3E51F8AC00000578-0-image-a-95_1489641639325.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318824_Alex-Nation-shares-cute-dinner-date-Georgia-Love_1540251043.html","title":"Alex Nation shares cute dinner date with Georgia Love","title_page":"Alex Nation shares cute dinner date with Georgia Love | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They're the gorgeous girls who found love on Australia's hit reality shows The Bachelor and The Bachelorette.\nAnd on Wednesday Alex Nation, 25, and Georgia Love, 29 came together to swap stories over a cute dinner date in Melbourne.\nThe girls donned flowing frocks for the occasion, with Alex looking happy and relaxed in the face of reports she and beau Richie Strahan may have parted ways.\nWhere's Richie? On Wednesday, Alex Nation, 25, and Georgia Love, 29 enjoyed a dinner date in Melbourne amid rumours Alex has split with beau Richie Strahan\nDespite the cloudy skyline sprawling behind them, the girls dressed to impress in summery dresses.\nAlex opted for an off-the-shoulder pinstriped piece, with her striking blonde tresses straightened over the right side of her face.\nFormer Bachelorette Georgia chose a navy blue number, with her brunette locks laying in curls at her shoulder.\nThe two embraced in the photo, with Alex letting out a sly smile and Georgia radiantly beaming from a laugh.\nThey appeared to have shared a Japanese-style lunch, with Alex captioning the photo: 'When it comes to a cheeky pun, I can't keep up. Eating Japanes on the other hand... well, that's a different story!'\nNoticeably absent: The girls stepped out without thir respective partners, adding fuel to the rumours that Alex and Richie may have split\nNoticeably absent were their handsome beaus.\nAlex's followers were quick to pick up on his absence, with one fan asking 'Where's Ritchie'\nAnother weighed in: 'Are you and Richie still together?'\nIt comes after the Perth rope technician was seen flying solo in a recent post to Instagram, sitting in a convertible car without his leading lady by his side.\nThe pair don't appear to posted a picture together in weeks and were last seen in a reported fight in Perth that left Alex in tears in the street.\nHappier times: Alex and Richie seemed like the perfect couple until a very public argument in Perth\nMeanwhile, Georgia has put on a show of affection with her boyfriend Lee Elliot earlier this week, when the two stepped out at the Virgin Australia Melbourne Fashion Festival.\nAs a nod to their strong bond, the smitten couple posed right alongside a sign that read: 'Where Love Lives.'\nTV presenter Georgia, 29, dazzled in an oriental-print gown, that featured a high-neck and a multicoloured design.\nWhile Lee, 35, looked dapper in a grey blazer, dark-rimmed spectacles and black accessories.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318824/Alex-Nation-shares-cute-dinner-date-Georgia-Love.html"}
