{"authors":["Lauren Ingram For Daily Mail Australia"],"date_download":"2018-10-22 23:11:27","date_modify":"2018-10-22 23:11:27","date_publish":"2016-01-29 10:54:37","description":"An Australian man has launched a side-splitting 'rant' at discount retailer Kmart on their Facebook page because he says his fiancee buys too many of their products.","filename":"data/vaneerConsumption/AlexGaddhastakentoKmartsFacebookpagetorantatthem.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/10/30B1655E00000578-0-image-a-3_1454064583022.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3422218_Alex-Gadd-taken-Kmart-s-Facebook-page-rant-products-appealing-cheap-fiancee-resist-buying_1540249887.html","title":"Alex Gadd has taken to Kmart's Facebook page to rant at them","title_page":"Alex Gadd has taken to Kmart's Facebook page to rant at them | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An Australian man has launched a side-splitting 'rant' at discount retailer Kmart on their Facebook page because he says his fiancee buys too many of their products.\nAlex Gadd from Hobart, Tasmania, took to Kmart's page this week because he said that the chain's good value is putting a strain on his relationship.\n'Hey Kmart, I am a disgruntled fiancé .... I am sick of coming home at least once a week to a new candle holder, frame, pot or pot stand. Along with several other nice yet highly unnecessary items,' Alex wrote.\nScroll down for video\nAlex Gadd from Hobart took to Kmart's page to say his fiancee bought too many products from them\nDisgruntled fiance: Alex Gadd says Kmart's products are simply too good, and his fiancee buys too many of them\nHe then took aim at the brand's large range of designs, saying they were filling his house and spilling into his garage. 'I need to know how many more designs can possibly be released? A man can only take so much and I am at my limit .... (She even suggested putting a light shade in MY garage).'\nHe went on to say, very tongue in cheek, that he was sure that Kmart's executives as well as divorce lawyers would be benefiting from\n'I am sure the CEO's [sic] are rubbing there hands together along with all the divorce lawyers who would be getting a huge amount of business ever since you guys had a drastic change in the direction and target of your product line,' Alex wrote.\nAlex finished his post by lamenting that he was expecting a response from the company, but that their cheap products were putting a strain on his relationship and he just needed someone to listen.\nHit back: Kmart's Facebook page responded that they constantly have new products coming out, so Alex should invest in a blindfold\n'I guess I'm not expecting a response nor an answer.... As I understand my relationship issues are not of your concern . Simply a rant that goes unheard here at home . Your products are too appealing and too cheap for her to resist and as a result it's putting immense strain on my life . Thanks for listening,' Alex concluded.\nA couple of hours later, Kmart responded in an equally tongue-in-cheek fashion to Alex's post, advising him to invest in a blindfold.\n'Hi Alex, we're so sorry to hear that our highly appealing homewares and everyday low prices are driving a wedge between you and your fiancee,' Kmart wrote.\n'Installing one of our stunning lamps in your garage does seem potentially relationship-ending, and we're pleased to hear it hasn't yet come to this,' the company said.\nMeme-worthy: Kmart has a loyal following of fans on social media\n'Unfortunately, we do have new products coming out all the time and the likelihood of them arriving in your home seems high - it may be worth investing in some kind of blindfold before this happens. - Anna.'\nThe comedic rant has spread quickly, with more than 16,000 people liking Alex's thoughts and over 8,500 comments left on the Facebook post.\nKmart was praised for its response, with many fans glad they understood the hilarious nature of the original post.\nJoely Endacott commented 'Great response Kmart!' whilst fan Kallie Ryan said 'The sass level is high! Love you Kmart.'","url":"https://www.dailymail.co.uk/femail/article-3422218/Alex-Gadd-taken-Kmart-s-Facebook-page-rant-products-appealing-cheap-fiancee-resist-buying.html"}
