{"authors":["Nick Fagge In Gothenburg","Sweden","For Mailonline"],"date_download":"2018-10-23 00:31:11","date_modify":"2018-10-23 00:31:11","date_publish":"2016-01-28 14:33:25","description":"EXCLUSIVE - Swedish social worker Alexandra Mezher was killed as she tried to break up a knife fight at the migrant centre in Molndal, Gothenburg, where she worked, a police officer said.","filename":"data/vaneerConsumption/AlexandraMezhermurderedasshetriedtobreakupafightbetweentwoteens.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30AA8D8100000578-0-image-a-13_1453986840855.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420881_Swedish-social-worker-stabbed-thigh-tried-break-fight-two-teenage-migrants-Police-officer-reveals-shocking-new-details-killing_1540254671.html","title":"Alexandra Mezher murdered as she tried to break up a fight between two teens","title_page":"Alexandra Mezher murdered as she tried to break up a fight between two teens | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tragic Swedish social worker Alexandra Mezher was killed after she tried to break up a knife fight at the adolescent migrant centre where she worked, MailOnline can reveal.\nMiss Mezher, 22, intervened when Youssaf Khaliif Nuur allegedly launched an unprovoked attack on another resident at the juvenile asylum seeker hostel in Molndal, Gothenburg, on Monday morning.\nBut the psychology student suffered two fatal knife-wounds to the back and thigh and died from her injuries in hospital.\nKilled: Alezandra Mezher, 22, was stabbed to death when she stepped in to stop a fight at the adolescent migrant centre in Molndal, Gothenburg, where she worked\nArgument: A boy in police custody had allegedly attacked another person at the housing centre (pictured) and Miss Mezher was trying to break up the fight\n‘The murder started with an attack on another boy,’ source at Gothenburg Police told MailOnline today.\n‘There was an argument between the suspect and another resident at the hostel.\n‘I don’t know the reason for the argument between the two residents.\n‘But in some way this woman got between them. She was trying to break up the fight.\n‘Miss Mezher tried to separate them and told the suspect to stop but then he [allegedly] stabbed her.’\nThe source dismissed any suggestion that the killing had a sexual motive.\nHe added murder suspect Nuur, 15, had had complained of feeling ‘unwell’ the night before and had not slept at all in the hours before the alleged attack.\nIt has been suggested that Nuur has psychological issues and had a breakdown in the hours before the attack and complained of hearing voices in his head.\nThe source revealed: 'The knifeman may have had some kind of breakdown. He may have suffered some trauma previously in his life.'\nThe source said he was heard pacing around the his bedroom for most of the night before the attack at 8am on Monday.\nThe teenager is currently being held at a secure psychiatric hospital on the outskirts of Gothenburg.\nYoung: The 22-year-old psychology student, pictured at her university graduation in June last year, suffered two knife wounds to her back and thigh and died from her injuries in hospital\nTragedy: A police officer in Sweden has told MailOnline the psychology graduate (right) died trying to break up a fight between two migrants\nThe Gothenburg Police source told MailOnline: ‘There was no sexual motive in the murder.\n‘This Somali boy did not have a motive for the attack other than he was not feeling well.\n‘This lady tried to separate them and told him to stop but he stabbed her.\n‘The suspect had been up all night. He had said he was not feeling well the night before.’\nManagers of the child refugee centre should not have let Miss Mezher work the night shift on her own if they knew one of the residents was suffering a mental health breakdown, the Gothenburg Police source claimed.\nHe told MailOnline: ‘If the management of the centre knew that one of the residents was not [mentally] well should have got in extra staff to help her that night.\nNuur will appear at Gothenburg District Court this afternoon charged with one count of murder and one count of attempted murder.\nIt remains unclear whether proceedings will be held in public or in a closed court session due as the suspect is 15.\nCourt papers: Youssaf Khaliif Nuur, 15, will appear in court in Gothenburg today charged with murder and attempted murder\nLocked up: He is being held at the high security psychiatric clinic at Sahlgrenska University Hospital, Gothenburg. The facility is for patients with psychotic illnesses\nThe source, who has worked for Gothenburg Police for over 30 years, has detailed the ‘explosion in crime’ in the Swedish city since the country ‘threw open the doors’ to mass immigration.\nHe told MailOnline: ‘We have experienced an explosion in crime, particularly violent crime, since our politicians threw open the doors to immigrants from all over the world.\n‘I have worked in Gothenburg for more than three decades and I have never known anything like it.\n‘The city always had a bit of trouble, but it was usually amongst people who were drunk and knew each other.\n‘But now I will not let my children go into the city after 2pm and especially not at night.\n‘There are violent gangs roaming around the streets and the use of knives and other weapons have become normal, rather than a rarity as it used to be.\n‘There are 20 robberies in Gothenburg every day – usually with violence or the threat of violence.\n‘This week an 83-year-old lady had a gun put in her face when she was mugged on her way to play bingo. They got away with just 50 Kroner [about £4].\n‘In the summer there were mass shootings with lots of people killed, including a little girl.’\nHe added the city streets were now at the mercy of gangs of young men mainly from North Africa.\nThe source revealed: ‘In the past couple of months we have noticed a dramatic increase in street robbery. This is a new phenomenon.\nHard working: Psychology graduate Miss Mezher who was a Lebanese Christian whose parents were from Beirut, was today described by her mother Chiméne as an 'angel'\nCandles and floral tributes fill a table at a memorial service for Miss Mezher in her home town of Boras, some 40 miles from Gothenburg, on Wednesday\n‘They will do anything to get money – steal a person’s wallet, iPhone, jewellery. And then they will attack their victim and kick them half to death.\n‘Drug crime has gone through the roof. Every drug is available on the street nowadays, even in broad daylight.","url":"https://www.dailymail.co.uk/news/article-3420881/Swedish-social-worker-stabbed-thigh-tried-break-fight-two-teenage-migrants-Police-officer-reveals-shocking-new-details-killing.html"}
