{"authors":["Sami Mokbel For Mailonline","Dominic King For Mailonline","Laurie Whitwell For Mailonline","Jack Gaughan For Mailonline","Riath Al-Samarrai For Mailonline","Sam Cunningham For Mailonline","Craig Hope For Mailonline"],"date_download":"2018-10-22 23:05:06","date_modify":"2018-10-22 23:05:06","date_publish":"2016-01-29 10:42:07","description":"There are just a few days remaining of the January transfer window as club's prepare to get their last-minute deals done in time. Sportsmail reveals the deals which could be completed.","filename":"data/vaneerConsumption/AlexTeixeiratoLiverpoolRenatoSanchestoManchesterUnitedSaidoBerahinotoNewcastleWhoisyourclubplanningalastminutemoveforthisJanuary.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30B198B200000578-0-image-a-22_1454065748935.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422462_Alex-Teixeira-Liverpool-Renato-Sanches-Manchester-United-Saido-Berahino-Newcastle-club-planning-minute-January_1540249506.html","title":"Alex Teixeira to Liverpool? Renato Sanches to Manchester United? Saido Berahino to Newcastle? Who is your club planning a last-minute move for this January?","title_page":"Alex Teixeira to Liverpool? Renato Sanches to Manchester United? Saido Berahino to Newcastle? Who is your club planning a last-minute move for this January? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"There are just a few days remaining of the January transfer window as club's prepare to get their last-minute deals done in time.\nWith plenty of targets yet to be signed, who is your club looking to a make a late move for?\nHere, Sportsmail reveals the January deals that could be completed before the window slams shut.\nArsenal\nArsene Wenger, having captured midfielder Mohamed Elneny, is unlikely to do any more business. The Gunners will pursue a move for Leicester starlet Ben Chilwell before Monday night's deadline, but the likelihood of a successful deal is unlikely.\nSami Mokbel\nArsenal have signed Mohamed Elneny from Basle but are unlikely to do any more business this January\nAston Villa\nRemi Garde was counting down the days to January from the moment he became Villa manager but has not yet made a single signing. Wishing for an injection of fresh faces to give the campaign some impetus he is sure to show his frustration should the window close without change.\nA £4.9million move for Hadjuk Split goalkeeper Lovre Kalinic was nearly done but failed on work permit issues. Villa are trying for a second appeal but chances seem slim.\nGarde would like Mathieu Debuchy from Arsenal but a £1m loan fee is proving problematic. Loic Remy is aiming higher. A striker is desperately needed. Gabriel Agbonlahor could yet leave.\nLaurie Whitwell\nAston Villa hoped to sign Loic Remy to help them fight relegation but the Chelsea striker is aiming higher\nBournemouth\nAn impressive month. They were decisive and got their work done early, spending big to bring in the firepower of Lewis Grabban and Benik Afobe. The arrival of Juan Iturbe from Roma is also very promising.\nThe club claim they will have a quiet deadline day in terms of players coming in. They trimmed the fat by allowing Lee Tomlin and Yann Kermorgant to go.\nRiath Al-Samarrai\nBournemouth new boy Juan Iturbe was on the bench for the draw with Sunderland in the Premier League\nChelsea\nWith the captures of Alexandre Pato and Matt Miazga virtually over the line, Chelsea have completed the bulk of their January business.\nThe future of unsettled striker Loic Remy, however, will become a pertinent issue for the Blues between now and Monday's deadline.\nSami Mokbel\nAlexandre Pato touched down in London this week to boost Chelsea's attack for the second half of the season\nCrystal Palace\nAlan Pardew has gambled on Emmanuel Adebayor and most football fans are watching with intrigue how that is going to unfold. Crystal Palace now have a thoroughly solid squad throughout each department.\nAs a result of the Adebayor deal, until the end of the season, Dwight Gayle is one who could potentially be on his way out, if a Premier League side matches the club’s valuation. A striker was Pardew’s main target, so he will be relatively content.\nSam Cunningham\nCrystal Palace completed the signing of free agent Emmanuel Adebayor in the hope his goals will help\nEverton\nAfter changing his mind at the last minute on Sam Byram, who has ended up at West Ham, it is doubtful whether Roberto Martinez will enter the fray. He is not a fan of the January window and any addition to the squad would be on a short-term basis.\nThe main action at Goodison Park over the coming days will be to see whether Darron Gibson and Aidan McGeady can finalise moves away.\nDominic King\nEverton midfielder Darron Gibson, pictured in the FA Cup against Dagenham, could leave Goodison Park\nLeicester\nClaudio Ranieri struck early by sealing the signature of Demarai Gray from Birmingham for £3.75million, a bargain given his promise. Daniel Amartey has been brought in for £5m, which looks another shrewd acquisition.\nRanieri has allowed Andrej Kramaric to leave on loan and is eager for a top-end striker to compete with Jamie Vardy. Inter look to have hijacked a £10m move for Sampdoria striker Eder, while the agent of CSKA Moscow forward Ahmed Musa has claimed his client will stay in Russia as Leicester won’t pay the asking price. Graziano Pelle and Loic Remy are options.\nGiven Leicester’s title aspirations, they may push the boat out before deadline.\nLaurie Whitwell\nLeicester target Eder (right) in action for Sampdoria against Napoli midfielder Jorginho in Serie A on Sunday\nLiverpool\nA strange window so far. Jurgen Klopp had planned to make do with the squad he inherited but circumstances forced him to reconsider, prompting Steven Caulker's arrival on loan.\nMarko Grujic, a £5million signing from Red Star Belgrade, was always going to be loaned back to Serbia and there has never been an intention to sign Joel Matip this window.\nIt looks unlikely that they will do any business in the final four days but if they can find common ground with Shakthar Donetsk, Alex Teixeira would be the headline addition to the squad. Liverpool and Shakthar have their own valuations in mind and unless there is a meeting in the middle, the Brazilian will stay in Ukraine.\nDominic King\nLiverpool are yet to agree a deal for Shakhtar Donetsk's Alex Teixeira and a move may not be agreed in time\nManchester City\nAnthony Caceres landed from Australia but has gone straight out on loan to Melbourne City, with Manuel Pellegrini insistent that he's very happy with his squad unless a genuinely world-class player becomes available. How often does that happen in January?\nMeanwhile, Celtic are keen on signing City youngster Patrick Roberts but only if a long-term loan deal is on offer.\nJack Gaughan\nAnthony Caceres (left) is Manchester City's only January arrival and has been loaned out to Melbourne City\nManchester United\nLouis van Gaal has said that he wants a left back in the building after a very quiet window.\nAndreas Pereira is staying put despite a desire to go and get minutes elsewhere.\nBenfica midfielder Renato Sanches is a firm target. The 18-year-old has a buy-out clause of nearly £60million but United are negotiating hard. The Portuguese giants have put a high price on the teenager but are expected to sell for around half that sum, with add-ons.\nJack Gaughan\nBenfica midfielder Renato Sanches (left) is a firm target for Manchester United and could cost £60million\nNewcastle\nThey've spent nearly £30m on three midfielders and, while that investment is commendable, it does not address their obvious needs - namely, defenders and strikers. They badly need a goalscorer and, without one, you fear for their Premier League future. Saido Berahino remains their No 1 target, but Loic Remy is a likely alternative.\nCraig Hope\nWest Brom striker Saido Berahino is Newcastle's main transfer target having already signed three midfielders\nNorwich\nMuch like Newcastle and Bournemouth, Norwich have acted with purpose. Steven Naismith looks an excellent attacking signing and the new right back and centre back pairing of Ivo Pinto and Timm Klose ought to improve the defence.\nAlex Neil is still looking and is likely to move for a central midfielder.\nRiath Al-Samarrai\nNorwich new boy Steven Naismith celebrates with Wes Hoolahan during the Canaries' defeat by Liverpool\nSouthampton\nCharlie Austin at £4million is an absolute snip and has other managers pondering if they’ve made a mistake by missing out on such a bargain. Yes, he has injury concerns, but even if he could not play every match, the price is barely anything in modern football.\nThey’re unlikely to bring anyone else in, unless they prove as much value as the Austin deal. Crucially here, though, no-one will be leaving, unless there is an astronomical bid for Sadio Mane or Victor Wanyama.\nSam Cunningham\nSouthampton striker Charlie Austin celebrates netting the winning goal on his debut at Manchester United\nStoke\nMark Hughes is looking for a couple of signings but has struck a relaxed tone, insisting he would be happy to go with what he has. The Stoke manager is refusing to rush into panic buys.\nCharlie Adam’s torn calf muscle perhaps heightens the need for a central midfielder, and Porto’s Giannelli Imbula is top of the list. But the Portuguese club have placed a ridiculous price on his head. Only if a compromise can be agreed will that one come off.\nHughes would like a proven striker but may wait until summer, while Ryan Shawcross’s positive response to a back injury lessens the need for defensive reinforcements.\nLaurie Whitwell\nPorto's Giannelli Imbula (centre) is a target for Stoke as Mark Hughes looks to build for a solid finish\nSunderland\nSam Allardyce still craves a goalscorer, or at least someone who can create them. Former Hull striker Dame N'Doye is a gamble but the Black Cats need more than that if they're to escape relegation. Allardyce faces a race against time to land the marksman he so badly needs.\nCraig Hope\nSunderland boss Sam Allardyce will be hoping Dame N'Doye's goals keep the Black Cats up this season\nSwansea\nIt has been a hard slog but their desperation to land a striker will pay off imminently with the arrival of Alberto Paloschi from Chievo for £7.8m.\nFrancesco Guidolin also wants a midfielder, though the move for Jonathan de Guzman is all but dead, and Dwight Gayle of Crystal Palace remains a target.\nSelling Jonjo Shelvey has reduced their creativity and they will sell Bafetimbi Gomis if they get a good offer.\nRiath Al-Samarrai\nSwansea are set to sign Chievo striker Alberto Paloschi after agreeing a fee of £8m for the Serie A striker\nTottenham\nAs always Tottenham chairman Daniel Levy is holding out for a late transfer window bargain.\nMauricio Pochettino is after at least one striker to ease the burden on Harry Kane. Saido Berahino and Moussa Dembele are both on Tottenham's radar - but the successful completion of both propose transfers are far from certain.\nIt could be a busy Monday at White Hart Lane.\nSami Mokbel\nFulham forward Moussa Dembele is on Tottenham's radar and could leave the Championship club this month\nWatford\nThe biggest success of their window so far has been the retention of Odion Ighalo in the face of interest from bigger clubs. They are set to sign Mario Suarez from Fiorentina, which added to the completed deals for Nordin Amrabat from Malaga and and Costel Pantilimon will likely wrap up their January business.\nRiath Al-Samarrai\nWatford appear to have staved off interest in striker Odion Ighalo from top clubs around Europe this January\nWest Brom\nThe never-ending Saido Berahino saga looks like extending to summer, with West Brom chairman Jeremy Peace insisting the striker will not leave for less than £25million, but his suitors placing his value lower after a season on the sidelines. Tottenham are geared to make a late bid but Peace held firm last time and is prepared to do likewise again.\nTony Pulis is desperate for funds to reshape his squad, but has been told he can only buy after he sells. He retains an interest in Queen Park Rangers winger Matt Phillips, while Callum McManaman and Victor Anichebe are available. But little seems doing.\nLaurie Whitwell\nQPR winger Matt Phillips is wanted by West Brom but Tony Pulis has been told he must sell before he buys\nWest Ham\nSam Byram, the £4m signing from Leeds, made his debut against Manchester City after Carl Jenkinson was injured and slotted in nicely at right back. Given Jenkinson’s loan from Arsenal looks set to end due to that problem, he will prove a particular useful acquisition.\nWest Ham are edging towards getting the deal for Fenerbahce’s Emmanuel Emenike over the line. The clubs have been in talks for a while now. That will be a loan move, with a view to a permanent transfer in the summer.\nShould that fall through, they will look for alternatives, but, aside from injuries, they are well-stocked in attack, so not landing a forward would not be too much of an issue.\nSam Cunningham","url":"https://www.dailymail.co.uk/sport/football/article-3422462/Alex-Teixeira-Liverpool-Renato-Sanches-Manchester-United-Saido-Berahino-Newcastle-club-planning-minute-January.html"}
