{"authors":["Amanda Williams For Mailonline"],"date_download":"2018-10-23 02:02:25","date_modify":"2018-10-23 02:02:25","date_publish":"2016-01-11 13:37:36","description":"Alexander Economou, 36, from Chelsea, south west London, is accused of harassing David de Freitas for just under a year with letters, email and YouTube videos following the death of his daughter Eleanor.","filename":"data/vaneerConsumption/AlexanderEconomoudeniesharassingEleanordeFreitasfatherDavid.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300A85D600000578-0-image-a-2_1452521698807.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393918_Son-shipping-tycoon-accused-raping-socialite-later-killed-denies-harassing-father-year_1540260145.html","title":"Alexander Economou denies harassing Eleanor de Freitas' father David","title_page":"Alexander Economou denies harassing Eleanor de Freitas' father David | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"spent £200,000 bringing private prosecution, taken on by CPS, accusing Miss de Freitas of perverting course of justice\nAlexander Economou, 36, from Chelsea, is accused of harassing David de Freitas for just under a year with letters, email and YouTube videos\nThe son of a shipping magnate who brought a private prosecution against a woman who accused him of rape before killing herself has denied harassing her father for a year, a court heard today.\nAlexander Economou, 36, from Chelsea, is accused of harassing David de Freitas for just under a year with letters, email and YouTube videos following the death of his daughter Eleanor.\nThe 23-year-old trainee accountant, a brilliant former Durham University student, had accused Mr Economou of rape and was due to appear at Southwark Crown Court for allegedly perverting the course of justice.\nShe was found dead at her home in Fulham, London, three days before she was due to stand trial.\nMr Economou, the son of shipping magnate Angelo Economou allegedly raped Miss de Freitas, in December 2012 but the Crown Prosecution Service refused to prosecute due to insufficient evidence.\nHe then pursued a private prosecution against her for perverting the course of justice which was then taken up by the CPS.\nShe killed herself three days before she was due to stand trial and Economou is now suing her father for his comments in the media.\nToday Economou stood in the dock wearing stonewashed jeans, a blue check shirt and a navy jumper and spoke only to confirm his name, age and date of birth and to plead not guilty to one charge of harassing Mr de Freitas between November 5 2014 and October 2015.\nHe is alleged to have sent an email directly to Mr de Freitas - which his lawyer today claimed set out the evidence Mr Economou was intending to rely on in court - and a series of emails to him via his solicitor Harriet Wistrich.\nHe also uploaded voice recordings to YouTube, Vimeo and Liveleaks and maintained a website about the allegations against him.\nThe website is still online but the domain name has been changed.\nAs well as denying the charges, Economou claims they do not amount to criminal conduct and are defective as they are not particular enough.\nEconomou, 36, is accused of harassing David de Freitas for just under a year following the death of his daughter Eleanor. The 23-year-old trainee accountant, a brilliant former Durham University student, had accused Mr Economou of rape and was due to appear at Southwark Crown Court for allegedly perverting the course of justice. She killed herself three days before she was due to stand trial\nHis lawyer Gideon Cammerman said: 'The later selections of the alleged conduct do not amount to criminal conduct.\n'The charges are insufficiently particular as of the criminal procedure rules.\n'For those reasons it is said that the charge is defective.'\nEconomou was bailed on conditions that he does not to contact David de Freitas or Ms Wistrich, except in the presence or through solicitors, and not to publish anything about the case, save for in relation to the libel proceedings, until his next appearance at court.\nIn court, he and his lawyer Gideon Cammerman challenged the conditions by claiming it would prevent him from his right to rebut things said about him in the media.\nSpeaking directly to District Judge Elizabeth Roscoe when asked if he understood the bail conditions, Economou said: 'No, I don't understand.\n'I have a website that says David de Freitas is going to trial for libel.\n'It is very important that the website stays up as it says that I am suing him for libel.\n'It explains very clearly for the people, my friends, acquaintances, new friends, that google me every day.\n'It says that David de Freitas went to the press and said I was a rapist and I need to explain that I am not a rapist.'\nDistrict Judge Roscoe said the bail conditions would not force him to take down anything that was already in the public domain.\nShe said: 'If you were to take that material which is on a particular website and you were to then copy it and disseminate it on another website that would be publishing.'\nThe 36-year-old allegedly bombarded David de Freitas (left) with letters, email and YouTube videos following the death of his daughter Eleanor (pictured right)\nShe added: 'If you breach that you will be in breach of your bail.'\nMr Cammerman said that imposing a non-contact condition would not be fair as Mr de Freitas's lawyers had themselves requested face-to-face meetings with Mr Economou.\nHe added: 'Of course there was ongoing contact between Mr Economou and Mr de Freitas about his interviews with the national media and what was in them.'\nBut Judge Roscoe said that the condition would not prevent him from attending the required legal meetings in the presence of solicitors.\nMr Economou's father Angelo, 62, is a successful businessman of Greek origin who was born in Britain. He runs UK-registered firm Time and Tide Shipping, and lives in a £830,000 house in Chiddingfold, Surrey.\nAlexander Economou is the company secretary of his father's firm and a former director of a helicopter training school.\nThe court is looking for a date to have a one hour preliminary hearing to decide whether the charges need to be further particularised and whether some parts do not amount to criminal conduct.","url":"https://www.dailymail.co.uk/news/article-3393918/Son-shipping-tycoon-accused-raping-socialite-later-killed-denies-harassing-father-year.html"}
