{"authors":[],"date_download":"2018-10-30 20:04:31","date_modify":"2018-10-30 20:04:31","date_publish":"2016-10-02 23:42:23","description":"Falcons cornerback Robert Alford returned an interception 30-yards for a touchdown and ended the gam...","filename":"data/vaneerConsumption/AlfordbattledCollinstoreturn.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/02/Images/newsEngin.16173008_100316-falcons-photos-bs25.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_alford-battled-collins-return__1540929871.html","title":"Alford battled; Collins to return","title_page":"Alford battled; Collins to return","title_rss":"NULL","source_domain":"ajc.com","text":"Falcons cornerback Robert Alford returned an interception 30-yards for a touchdown and ended the game with another interception against the Panthers on Sunday.\nAlford had struggled earlier in the game in coverage. The Falcons are set to get back cornerback Jalen Collins on Monday after he served his four-game suspension for using performance enhancing drugs.\nCollins will get a chance to compete with Alford for the starting right cornerback spot.\n“I feel like we went out there, and we did what we were coached,” Alford said. “Towards the end, we just have to learn how to finish it. We let them get a little too close towards the end. It is just something that we have to work on and study film.”\nAlford finished with two tackles and three passes defensed.\n“We were pleased to see him come back and battle,” Falcons coach Dan Quinn said. “He has terrific ball skills. With the interception, it would’ve been OK with us if he took a knee and went down, but we came back.”\nOverall, Alford had a good day.\n“We put different guys to guard different players and he had a tough assignment at times,” Quinn said. “One long pass interference had was a foul for sure. We’ll go back and look at that tomorrow and see how we can adjust.”\nAlford credited the coaches for his key interception.\n“It is just a great play call by the coaches,” Alford said. “The defensive line got pressure, everyone else was back there in coverage on their man, the ball just happened to come my way, I made a play on it, got a block by Brian Poole, and just ran it in for a touchdown.”","url":"https://www.ajc.com/sports/football/alford-battled-collins-return/t2FC8PH4kQtVGK7e2Vb7MM/"}
