{"authors":["John Hayward"],"date_download":"2018-10-30 17:55:48","date_modify":"2018-10-30 17:55:48","date_publish":"2015-06-08 01:19:56","description":"ISIS has rampaged all the way from inner Libya to the Algerian border, prompting the Algerian military to raise its alert level.","filename":"data/vaneerConsumption/AlgeriaRaisesAlertLevelasISISPushesAgainstLibyanBorder.json","image_url":"https://media.breitbart.com/media/2015/05/isis-in-libya-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_06_07__1540922148.html","title":"Algeria Raises Alert Level as ISIS Pushes Against Libyan Border","title_page":"Algeria Raises Alert Level as ISIS Pushes Against Libyan Border | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"ISIS has rampaged all the way from inner Libya to the Algerian border, prompting the Algerian military to raise its alert level, moving tens of thousands of troops over the past few months to the thousand kilometers of desert it shares with Libya.\nMiddle East Monitor relays the words of an Algerian military source who spoke with the Turkish Anadolu news agency: “Algeria’s Chief of Staff of the People’s National Army, Admiral Ahmed Kaid Saleh, ordered all ground forces, the national gendarmerie, Special Forces and Air Force stationed in the border areas with Libya to increase their alert level.”\nThe source further asserted that Algerian troops have been given shoot-on-sight orders against any militants who try to cross the border, following the capture of the Libyan city of Sirte by ISIS-aligned forces. Officials from Algeria, Tunisia, and Egypt have scheduled a meeting to discuss the deteriorating situation in Libya.\nAlgeria is also dealing with a growing ISIS threat within its borders, following years of trouble from the Islamic State’s godfathers in al-Qaeda. In March, Algerian authorities found it necessary to evacuate a hundred Turkish workers from a roadway project near Algiers for 24 hours, in response to a credible threat from ISIS militants. An ISIS sect called the “Caliphate Soldiers,” splintered off from al-Qaeda, remains a menace after killing a French hostage last year.\nIn early May, the Middle East Monitor reported that Interpol has given the Algerian government a list of fifteen hundred ISIS operatives, from 33 different countries, who might be attempting to enter Algeria using forged passports.","url":"https://www.breitbart.com/national-security/2015/06/07/algeria-raises-alert-level-as-isis-pushes-against-libyan-border/"}
