{"authors":[],"date_download":"2018-10-22 21:42:05","date_modify":"2018-10-22 21:42:05","date_publish":"2014-05-08 00:13:31","description":"Alibaba Group Holdinghas struck one of its largest deals with a U.S. online retailer, agreeing to help Amazon.com rival Shoprunner sell to China.","filename":"data/vaneerConsumption/AlibabaShoprunnertoLaunchJointChinaService.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/425436/140507-alibaba-office-7a_5e75fa7de96f64d799aef67eeb1677d7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_business-news_alibaba-shoprunner-launch-joint-china-service-n99936_1540244525.html","title":"Alibaba, Shoprunner to Launch Joint China Service","title_page":"Alibaba, Shoprunner to Launch Joint China Service","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAlibaba Group Holding Ltd. has struck one of its largest deals with a U.S. online retailer, agreeing to help Amazon.com rival Shoprunner sell to China and handle delivery within the country.\nShoprunner, whose partners include Neiman Marcus and Nine West, will use Alibaba's domestic logistics infrastructure to launch its service in China later this year, Shoprunner Chief Strategy Officer Fiona Dias told Reuters in an interview Wednesday.\nAlibaba Group filed Tuesday for an initial public offering in the U.S.\nThe Alibaba and Shoprunner venture will be in addition to Web sites already operated by Alibaba, including Tmall and Taobao marketplaces.\nAlibaba owns 39 percent of Shoprunner, which launched four years ago and sells products from thousands of brands like American Eagle Outfitters and Calvin Klein. It offers members two-day shipping within the United States from a variety of stores.\nThe move would offer a way for U.S. corporations to tap the world's second largest economy, where many foreign retailers have stumbled in the past.\n\"The history of U.S. retailers going to China is one that's fraught with peril,\" Dias said in an interview. \"This is a very low cost way to do it that doesn't require them (U.S. retailers) to go to China to figure it out.\"\n-Reuters","url":"https://www.nbcnews.com/business/business-news/alibaba-shoprunner-launch-joint-china-service-n99936"}
