{"authors":[],"date_download":"2018-10-22 21:53:31","date_modify":"2018-10-22 21:53:31","date_publish":"2014-05-08 16:52:41","description":"\"It's about China surpassing the U.S. economy.\"","filename":"data/vaneerConsumption/AlibabasIPOIsaSignofChinasRisingEconomicMight.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/429576/140508-alibaba_1249_b0b3c1c2a44d12b94638e7e5a700d5b0.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_markets_alibabas-ipo-sign-chinas-rising-economic-might-n100486_1540245211.html","title":"Alibaba's IPO Is a Sign of China's Rising Economic Might","title_page":"Alibaba's IPO Is a Sign of China's Rising Economic Might","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAlibaba's initial public offering later this year will mark the end of an era and the beginning of a new regime on the global tech landscape.\nThe three Chinese Internet giants Baidu, Alibaba and Tencent—known as the BATs—are the big tech companies born out of the PC era, said David Chao, co-founder and general partner of Doll Capital Management (DCM). The e-commerce powerhouse Alibaba, which is the most profitable of the three, will be the last of the group to go public.\n\"In the future, when we look back at the event people will say that was the closure of the BAT era,\" said Chao. \"It's also a beginning. It's about China surpassing the U.S. economy. It is a beginning of realization that Chinese Internet companies are just as big and as valuable as U.S. ones.\"\n\"It's about China surpassing the U.S. economy. It is a beginning of realization that Chinese Internet companies are just as big and as valuable as U.S. ones.\"\nIn terms of both market cap, as well as in the number of users, Chinese companies have already equaled or surpassed the U.S., Chao said. And Alibaba, which has an estimated value of $150 billion to $200 billion, could be the largest tech IPO ever.\n\"It's a sign of the times,\" he said, where Chinese Internet companies compete \"on the same footing as U.S. companies.\"\nWhile this trend is new to many U.S. retail investors, venture capitalists have been pouring money into these companies for a decade at least, and have subsequently \"done really well,\" said Chao.\nDCM, for example, has invested in more than 50 Chinese companies over the last decade, with 11 of them going public, 10 in the U.S.\nAnother, Sequoia Capital, has been behind some of the big Chinese Internet IPOs, including software maker Qihoo 360, which went public on the NYSE in 2011; online discount retailer Vipshop Holdings, on the Nasdaq in 2012; and the mobile game developer Ourpalm, on the Shenzhen Stock Exchange in 2012.\n\"For Chinese entrepreneurs, it's almost like they don't even think to list in China. Their vision from the beginning is to go public and they dream to IPO on the NYSE or the Nasdaq,\" said Edith Yeung, head of marketing for mobile browser company Dolphin Browser and an angel investor.\nIn 2013 alone, there were eight Chinese companies that went public on a U.S. exchange. And so far this year there have already been four U.S.-listed Chinese IPOs, according to Renaissance Capital.\nLike gravity\nAlibaba's coming IPO is expected to be so large that it will, like gravity, push or pull others coming before or after.\n\"All the decent start-ups are going public before Alibaba because they know Alibaba will suck the well dry for awhile,\" Chao said. \"If Alibaba doesn't do well it will probably freeze the market for Chinese IPOs, at least for some time. But if it does good, more companies will rush to market.\"\nGiven the company is expected to fare well, it's likely that there will be a \"long line\" of Chinese companies all looking to hold IPOs after the tech giant's public market debut, Yeung said. But the shift in China's tech rise isn't just marked by the number of companies listing on U.S. exchanges. It's also signaled by the increase of Chinese investors taking big stakes in U.S. private companies.\nInvestments by Chinese investors in U.S. private businesses jumped more than 280 percent from 2007 to 2013. Big tech firms like Alibaba and Tencent have also made significant investments in private U.S companies. Combined, the two companies have invested almost $1.7 billion in disclosed funding to U.S. companies in at least 24 deals, according to CBInsights.\nAlibaba's latest stakes include a $250 million investment in the on-demand ride-sharing app Lyft, a $280 million investment in the messaging app Tangle and $15 million in the luxury e-commerce site 1stDibs.","url":"https://www.nbcnews.com/business/markets/alibabas-ipo-sign-chinas-rising-economic-might-n100486"}
