{"authors":[],"date_download":"2018-10-22 21:19:40","date_modify":"2018-10-22 21:19:40","date_publish":"2014-06-04 22:18:36","description":"As Alibaba prepares for its IPO, the Chinese e-commerce giant has been counseling employees on how to manage the avalanche of cash.","filename":"data/vaneerConsumption/AlibabaPrepsEmployeesfor40BillionWindfall.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/425436/140507-alibaba-office-7a_5e75fa7de96f64d799aef67eeb1677d7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_markets_alibaba-preps-employees-40-billion-windfall-n122926_1540243180.html","title":"Alibaba Preps Employees for $40 Billion Windfall","title_page":"Alibaba Preps Employees for $40 Billion Windfall","title_rss":"NULL","source_domain":"nbcnews.com","text":"The company, though, has been preparing employees for years on how to manage the avalanche of cash, warning them not to be carried away and splurge on material goods.\nWhile Alibaba Group Holding Ltd.'s co-founders Jack Ma and Joseph Tsai are already billionaires, many more paper millionaires could be minted once employees are free to sell shares some time after the IPO.\nCurrent and former Alibaba employees hold 26.7 percent of the company, having built up their holdings through stock options and other incentives awarded since 1999, according to securities filings, though these didn't detail the number of employee shareholders.\nThe IPO windfall — Alibaba could be worth $152 billion, according to the average from a Reuters survey of 25 analysts — will be larger than anything China has seen because of the depth of the group's employee ownership and the size of the company.\nNot just managers, but software engineers and staff from sales and marketing and related companies such as Alipay also stand to benefit from selling shares after the IPO.\nSome of the 20,000 employees have already had the opportunity to sell part of their stakes during previous Alibaba structured share sales through so called liquidity programs.\n\"The thinking was that if sudden wealth is like venom, giving small doses every now and then was a bit like anti-venom because your company isn't thrown into chaos,\" said a person familiar with Alibaba's incentive plans who was not authorized to speak publicly on the matter.\nAlibaba declined to comment.\n-Reuters","url":"https://www.nbcnews.com/business/markets/alibaba-preps-employees-40-billion-windfall-n122926"}
