{"authors":["Bobbie Whiteman For Dailymail.Com"],"date_download":"2018-10-23 04:37:15","date_modify":"2018-10-23 04:37:15","date_publish":"2016-01-29 20:15:30","description":"The 33-year-old actress, who was really on Wednesday's show to promote her new movie, How To Be Single, didn't manage to get any money out of the host, who asked his sidekick for the dosh.","filename":"data/vaneerConsumption/AlisonBrietriestopersuadeJimmyKimmeltobuyGirlScoutgoodies.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30B4554E00000578-0-image-a-26_1454088052289.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423183_Alison-Brie-goes-hard-sell-tries-persuade-Jimmy-Kimmel-buy-Girl-Scout-goodies_1540269435.html","title":"Alison Brie tries to persuade Jimmy Kimmel to buy Girl Scout goodies","title_page":"Alison Brie tries to persuade Jimmy Kimmel to buy Girl Scout goodies | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She was set on selling $2,000 of Girl Scout cookies.\nBut Alison Brie had her work cut out when she appeared onJimmy Kimmel Live on Wednesday evening at the late-night chat show host's Hollywood studio.\nThe 33-year-old actress looked chic in a little black dress with spaghetti string straps as she walked across the stage carrying a large black notepad.\nScroll down for video\nHere she comes: Alison Brie was on a mission when she turned up on Wednesday night's edition of Jimmy Kimmel Live!\nReady to take his cookie order, she launched right into the sale, announced that 'all the chat show hosts are buying them.'\nAnd she added: 'Ellen bought 400 boxes.'\nAlison invited her two Girl Scout 'daughters' on stage to notch up the guilt factor and twist Kimmel's arm.\nWhen he still seemed reluctant she told him to 'Just stop f******* around and buy the damn cookies.'\n'You've gotta have them': Carrying a black notepad, she launched straight into her pitch to sell the host 400 boxes of Girl Scout cookies\nExtra leverage: The 33-year-old brought on her Girl Scout 'daughters' to loosen Kimmel's wallet\nJimmy was taken back when he asked how much 400 boxes would cost and she said $2,000.\nHe claimed her only had a $5,000 note he couldn't split so he told the kids to get the money from his sidekick, Guillermo Rodriguez.\nThe girls frisked him for the money, took his wallet and one kicked him before she left the set, much to the amusement of the audience.\nHanding it off: Jimmy claimed he only had a $5,000 note he couldn't split, so he sent the girls to get the money from his side-kick, Guillermo Rodriguez\nSnatch and grab: The girls frisked poor Guillermo and took his wallet before Alison called them off as she left the studio\nAlison was on the show to talk about her new movie How To Be Single.\nAlso starring Dakota Johnson and Rebel Wilson, they play young women who need to learn how to be single in New York. The comedy hits theaters on February 12.\nAlison, however, is neither single nor a mother. She has been dating James Franco's younger brother Dave, 30, since 2012 and they got engaged in August.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423183/Alison-Brie-goes-hard-sell-tries-persuade-Jimmy-Kimmel-buy-Girl-Scout-goodies.html"}
