{"authors":["Susan Sheehan"],"date_download":"2018-10-21 03:30:37","date_modify":"2018-10-21 03:30:37","date_publish":"2018-07-20 03:39:20","description":"In “A Little Piece of Light,” Hylton tells a shocking tale of exploitation, crime and redemption.","filename":"data/vaneerConsumption/ALittlePieceofLightbyDonnaHyltonreviwed.json","image_url":"https://www.washingtonpost.com/resizer/YqXKZBf3Cr_MJ-5Awg3ph8sj_uo=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/YWEFO5ELMEI6RI2FUG7XQR5TOU.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_does-sexual-abuse-e_e2f8527f58b29ae74297d4ea5bdc72c9_f6048bb8-4bef-11e8-84a0-458a1aa9ac0a_story_1540092637.html","title":"'A Little Piece of Light' by Donna Hylton reviwed","title_page":"'A Little Piece of Light' by Donna Hylton reviwed - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Susan Sheehan is the author of “A Prison and a Prisoner” and “Is There No Place on Earth for Me?”, which won a Pulitzer Prize.\nDonna Hylton speaks at the Women's March on Washington in January 2017. (Theo Wargo/Getty Images)\nIn 1985, a Long Island real estate broker, Thomas Vigliarolo, was brutally killed. Seven people were arrested on charges of kidnapping and second-degree murder. One was Donna Hylton, 20, who was sentenced to 25 years to life for her participation in the crime, during which the 62-year-old victim was starved, burned and beaten over the course of more than two weeks. His body was later put in a footlocker to decompose.\nTen years into her prison sentence at the Bedford Hills Correctional Facility for Women, Hylton was interviewed by writer Jill Neimark for an article in Psychology Today. In it Hylton pointed to the years of abuse and neglect she had suffered, and played down her role in the kidnapping and murder of Vigliarolo, at one point saying, “Sometimes I think I dreamed the whole thing.”\nHylton was denied parole once, then released two years later, after serving almost 27 years. In 2012 she moved to Brooklyn, earned undergraduate and graduate degrees, and became an activist for judicial reform. Hylton was a speaker at the 2017 Women’s March in Washington. Now Hylton, with Kristine Gasbarre, has published a memoir, “A Little Piece of Light.” Subtitled “A Memoir of Hope, Prison, and a Life Unbound,” the book is a tale of abuse and crime that raises questions about whether sexual exploitation early in life justifies later misdeeds.\n[‘Jane Doe January’: A writer seeks truth and justice in her own rape case]\nThe memoir opens with a short account of Hylton’s early years in Port Antonio, Jamaica, and subsequent informal adoption, at age 7, by a childless middle-class Bronx couple, Daphne and Roy Hylton, who came “from families of great status in Jamaica.” Donna Hylton’s mother received cash from Roy. Living with Roy and Daphne, an icy psychiatric social worker, Donna excelled in school, even skipping grades. Within two years, though, she was molested by Roy Hylton in the walk-in closet he shared with Daphne. The sexual abuse took place for five years, and often daily, Hylton writes. The book’s title refers to a crack at the bottom of the closet door.\nThis was not the end of the abuse. When Hylton was in the eighth grade, she was raped by her math teacher while working as a live-in babysitter at his home. She then confided in a 25-year-old resident of her building named Alvin, who upon hearing her woes promised to save her. Shortly after whisking her away to Philadelphia, he raped her. “No matter where I turn for help or an escape, I can’t find anyone to trust,” Hylton observes. “Whatever part of me wasn’t broken is broken now. I’m ripped open in a way that I’ve never been before.”\nThe rapes continued and grew progressively more severe. Then at 15, Hylton became pregnant — and finally happy: “This child will be my light in the dark of winter, and for all the days of my life.” But shortly after Hylton’s daughter, Adrienne, was born, Alvin held a kitchen knife to Hylton’s face. Hylton finally left him, returning with her daughter to live with Daphne and Roy Hylton. A few months later, two men (one a minister of a nearby church) snatched Donna off the street, took her by cab to Harlem, locked her up and took turns raping her. After she was released, a friend suggested that Hylton seek help from the police; on the return ride from a medical center, a police detective raped her in his car.\n“In the span of a single week,” Hylton writes, “three different men have taken what little sense of self I had. . . . There will be no more trusting, no more fighting back — not only because I’m exhausted of all my strength, but because by now, at age sixteen, I understand: I’m nothing more than a body to be abused.”\nHylton tries to regain her footing but instead falls in with a group of women who, she tries to convince us, lure her into the crime that defined her later life.\nIt is the rare as-told-to book, or one created in collaboration with an author-for-hire, that is well-written, but “A Piece of Light” is filled with a superfluity of penny-dreadful prose. The title is fine, but after it is repeated and re-explained half a dozen times, the reader finds herself asking what editors are for.\nThe first two chapters of the book end with the rape by the detective. Chapters 3 and 4 recount, in a disorderly style, the grisly crime for which Hylton was imprisoned. Hylton places great emphasis on her kindness to the dying victim, which consists of proffering him Kool-Aid and chicken broth and placing a Pall Mall cigarette into his mouth. Her original motive for participating in the crime, she tells us, was to procure $1,500 for a portfolio of professional photographs to use in quest of a modeling career. She soon amends her motive, saying that she “said yes” to the crime “as a young single mom, struggling for money and thinking some extra cash would help me start a life for my daughter and me to have a home together.” Once in prison, she tells us that “very often, when a crime is committed, it’s because a marginalized person is really just looking for an opportunity to improve his or her life.” Really?\n[I was raped in an alley and everyone believed me. Here’s why that’s a problem.]\nSubsequent chapters chronicle Hylton’s years at Bedford in hit-and-run fashion. Early on, she did hard time, some of it in the segregated housing unit. Later she was befriended by some nuns who advocate for prisoners and by some of the high-profile women at Bedford, like Kathy Boudin of the Weather Underground, and values becoming “part of the ‘in’ crowd — finally.” Suffice it to say that “these women become the basis, the womb, from which my rebirth will come.” She promptly credits her relationship with one celebrity inmate as “the first torch in the darkness that will light the way to my redemption.” She became active in an AIDS counseling and education program and a domestic family violence program, took therapeutic writing workshops offered by Eve Ensler (who contributed a foreword to the memoir), earned a master’s degree, and was ordained as a Christian minister.\nAt book’s end, Hylton is working full-time as a community health advocate, while also assisting women in getting released from Bedford and giving speeches around the country. Even before Hylton turned in this book to her publisher, a movie based on her life was in development, starring Rosario Dawson, whom she met at Bedford when the actress participated in one of Ensler’s workshops. It’s quite a turnaround.\nHylton has paid a high price for her role in a horrific crime. It is easier to wish her well than it is to admire her memoir.","url":"https://www.washingtonpost.com/outlook/does-sexual-abuse-early-in-life-justify-later-misdeeds-the-case-of-donna-hylton/2018/07/19/f6048bb8-4bef-11e8-84a0-458a1aa9ac0a_story.html"}
