{"authors":["Associated Press"],"date_download":"2018-10-23 02:18:06","date_modify":"2018-10-23 02:18:06","date_publish":"2017-03-16 12:49:16","description":"MILAN (AP) - Italian flagship airline Alitalia presented Thursday a new business plan that includes 1 billion euros (dollars) in cost-cutting in a bid to...","filename":"data/vaneerConsumption/Alitaliaunveilssurvivalplanofdeepcutsbudgetflights.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320092_Alitalia-unveils-survival-plan-deep-cuts-budget-flights_1540261086.html","title":"Alitalia unveils survival plan of deep cuts, budget flights","title_page":"Alitalia unveils survival plan of deep cuts, budget flights | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MILAN (AP) - Italian flagship airline Alitalia presented Thursday a new business plan that includes 1 billion euros (dollars) in cost-cutting in a bid to compete with low-cost carriers.\nThe new plan comes nearly three years after Abu Dhabi carrier Etihad Airlines took a controlling stake in the long-troubled airline.\n\"We have a lot of work to do,\" Transport Minister Graziano Delrio said in Rome after a one-hour meeting with Alitalia CEO Cramer Ball.\nUnder the plan, Alitalia will introduce services common to budget carriers on flights of less than four hours, including charges for meals, priority boarding and preferred seating, while retaining the full-service model for longer-haul flights.\n\"Consumers' buying habits have been shaped by how low-cost carriers sell their products,\" Ball said in a statement after the plan was approved Wednesday night. \"The radical and necessary measures across the entire airline will secure our long-term sustainability.\"\nThe airline noted that budget carriers had captured nearly half of the Italian market, the highest share in Europe.\nThe plan envisions reaching profitability by 2019, including cutting operating and personnel costs by 1 billion euros while increasing revenues by 30 percent from 2.9 billion euros to 3.7 billion euros.\nCramer said he intended to meet with unions as soon as possible to discuss \"headcount related measures.\"\nThe airline also said it was in talks with suppliers, including in-flight catering and airports themselves, to renegotiate costs. It also plans to refit its narrow-haul plans with extra seats while reducing that fleet by 20 aircraft.\nThe board also approved a delegate from big Italian banks that own a stake in the airline as a new member. Luigi Gubitosi, a former head of RAI state television, will become executive chairman once shareholders approve funding for the new plan, the airline said. The move is expected to pave the way for the exit of Chairman Luca Cordero di Montezemolo.","url":"https://www.dailymail.co.uk/wires/ap/article-4320092/Alitalia-unveils-survival-plan-deep-cuts-budget-flights.html"}
