{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:55:31","date_modify":"2018-10-30 22:55:31","date_publish":"2015-07-25 08:00:00","description":"EL DORADO, Arkansas – On the east side of this small town, tucked away not far from the Louisiana border, sit two massive incinerators with a surprising","filename":"data/vaneerConsumption/AlittletowninArkansasanditsCaliforniaconnection.json","image_url":"https://calmatters.org/wp-content/uploads/arkansas_incinerator_-_clean.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940131.html","title":"A little town in Arkansas and its California connection","title_page":"A little town in Arkansas and its California connection | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"EL DORADO, Arkansas – On the east side of this small town, tucked away not far from the Louisiana border, sit two massive incinerators with a surprising link to a landmark environmental law in California.\nIt’s a place where old paint, leftover pesticides, seized cocaine, recalled hairspray, expired pharmaceuticals and many other hazardous chemicals come to die – the detritus of a society in which toxic substances are woven into daily life.\nA place where truckloads of chemical garbage arrive about 14 times each day, to be burned at more than 1800 degrees until nothing but a powdery ash remains.\nA place where facility manager Treasa Evans has worked for 31 years and feels blessed because “I kind of grew up with this facility.”\n“Everybody says hazardous, but it’s just waste, and we’re getting it out of the environment, “ Evans said, as she led a recent tour wearing a hard hat and a fire-retardant jacket, frequently shouting to be heard over the loud thrum emanating from the huge machines.\nWelcome to the Clean Harbors Environmental Services incineration plant, which as of now, a CALmatters analysis discovered, has generated almost one-third of the offset credits approved by the California Air Resources Board under the state’s cap and trade system. That’s more than any project in the country.\nCalifornia’s cap and trade system is designed to encourage companies in the state to reduce climate-warming pollution by requiring them to pay the government for emitting greenhouse gases. But it comes with an alternative: Instead of requiring businesses to pay for all their emissions, they can comply in part by supporting projects that offer an environmental benefit to offset the pollution they make in California. The state has approved more than 21 million of these “offset credits” for projects across the country that preserve forestland, capture methane from pigs and cows, and destroy chlorofluorocarbons – cooling gases that could otherwise deplete the ozone layer.\nIt is those gases, arriving in tanks after being sucked out of old air conditioning and refrigeration systems, that formed the unlikely bond between this industrial town in the Deep South and state policymakers in Sacramento.\nBut that long-distance relationship no longer exists. The facility stopped doing business with the state after the Air Resources Board invalidated a small batch of its credits for destroying chlorofluorocarbons.\n“It’s our position that they should never have invalidated any credits,” said Phillip Retallick, Clean Harbors’ senior vice president of regulatory affairs.\n“This was the first investigation of its kind by the ARB. And quite frankly I think they were flying blind because they didn’t have any precedent to go by.”\nThe conflict goes back to May 2014, when the federal Environmental Protection Agency announced a $581,236 fine against Clean Harbors “for improperly identifying and disposing of hazardous waste, improper storage of hazardous waste, and failure to comply with air emissions standards at its El Dorado, Ark. incineration facility.”\nClean Harbors had been selling brine that is a byproduct of its air emissions control system to oil companies who used it in drilling wells, Retallick said. Arkansas environmental regulators had approved of the arrangement, he said, but when federal authorities raised concerns, the company agreed to pay a fine without admitting any violations and stopped selling the brine.\nBut the episode raised hackles in Sacramento. The Air Resources Board launched an investigation that concluded last November and “determined that the Clean Harbors Facility was not operating in accordance with all local, state or national environmental and health safety regulations.” The board decided to invalidate some of the credits generated by Clean Harbors.\nBecause the Arkansas incinerator was responsible for so many offset credits, its departure from cap and trade has a big impact, said Jeff Cohen, a senior vice president at Eos, a San Francisco company that arranged many of the offset credits at Clean Harbors.\nInstead of chlorofluorocarbons from old air conditioners being shipped to Arkansas and destroyed, he said, many of them are now being re-used in leaky equipment.\n“They’re getting up into the atmosphere. So the immediate impact is an adverse impact on climate,” Cohen said. The other potential impact is financial, he added. Offset credits are cheaper than the pollution permits sold on the cap and trade market. So a loss of available credits could cause costs to go up for businesses that participate in cap and trade.\nOn the other hand, California’s air board is expanding the kinds of projects that can generate offset credits. Just last month (June), it added rice farms and Alaska forests to the list.\nBoard chair Mary Nichols said invalidating the Clean Harbors credits was the right thing to do.\n“Some people have argued… that California is too stringent and that our enforcement was too aggressive and too much of a burden. And of course there would be people who said, ‘Well, this just proves that you shouldn’t have offsets in the first place,’” Nichols said in an interview.\n“I think we’ve struck the balance correctly here.”\nShe said that Clean Harbors is a “reputable company” that made its own decision to drop out of California’s offset market.\n“They are not a dirty company by anybody’s stretch of the imagination,” Nichols said.\nA different image emerges from a file in the historic courthouse in the middle of El Dorado’s town square. A sign on the door warns visitors that concealed weapons are not allowed, and inside, an American flag hangs over an atrium with marble floors.\nDocuments here describe the day in December 2012 when a trailer full of pool chemicals combusted on the Clean Harbors property, causing a toxic cloud to drift from the plant to the surrounding community.\n“Local authorities called for an evacuation of portions of the eastern part of the City of El Dorado,” says a lawsuit filed by people who live and work near the plant.\n“Certain persons exposed to the chemicals… experienced symptoms of exposure including nose bleeds, coughing, difficulty breathing, dizziness, burning eyes, irritation of membranes and discomfort.”\nClean Harbors argues it’s not responsible, and has, in its own lawsuit, laid the blame on the company that delivered the pool chemicals that day.\nThe combined cases are awaiting trial in the county court.\nAcross the street from the courthouse sits the office of Robert Depper, the lawyer who is suing Clean Harbors.\n“Any time you’ve got a chemical plant in your area, you’re going to have a problem. Our community seems to find that risk to be acceptable, until it happens to them, and then they aren’t too happy about that,” said Depper, sitting behind a desk that has the scales of justice etched into its wood.\n“We need chemical companies to dispose of our waste, of course. But who wants them in their backyard?”\nNot Renea Gentle.\nShe and her husband Tommy have lived about two blocks from El Dorado’s toxic waste plant for nearly 40 years as it’s gone through multiple ownership changes. They raised four sons in a tidy brick house on a street where most homes are trailers resting on cement blocks.\n“We’re breathing this mess, whatever it is,” said Gentle, a retired auto parts factory worker.\nShe said she’s been evacuated from her home a few times when things have gone wrong at the plant, and suspects that her husband’s chronic sinus problems may be related to poor air quality.\nBack in central El Dorado, where churches, restaurants and shops line the streets around the courthouse, merchants said the town’s industrial nature is also its financial lifeblood. The hazardous waste plant, oil refineries and chemical producers “provide good-paying jobs for the people,” said Cathy Butler, manager of Jefferson Street Books.\n“And they do support the community.”\nBesides, she said, birdsong rings outside the windows of her house, and deer and rabbits pay frequent visits to her front yard.\n“If they’re healthy,” she said, “then I think we must be too.”","url":"https://calmatters.org/articles/little-town-in-arkansas-and-its-california-connection/"}
