{"authors":[],"date_download":"2018-10-22 21:23:30","date_modify":"2018-10-22 21:23:30","date_publish":"2016-01-28 07:25:39","description":"Al-Jazeera said on Thursday that a three-man news crew for the Qatar-based channel has been freed more than 10 days after being kidnapped in the flashpoint Y...","filename":"data/vaneerConsumption/AlJazeerasaysnewscrewkidnappedinYemenfreed.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g66r-2vdWmEltwXfba0ce28e63259040d-191_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420485_Al-Jazeera-says-news-crew-kidnapped-Yemen-freed_1540243410.html","title":"Al-Jazeera says news crew kidnapped in Yemen freed","title_page":"Al-Jazeera says news crew kidnapped in Yemen freed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Al-Jazeera says news crew kidnapped in Yemen freed\nAl-Jazeera said on Thursday that a three-man news crew for the Qatar-based channel has been freed more than 10 days after being kidnapped in the flashpoint Yemeni city of Taez.\nReporter Hamdi al-Bokari, cameraman Abdulaziz al-Sabri and driver Munir al-Subaie went missing on January 18 while covering the conflict between rebels and Gulf-backed forces loyal to President Abedrabbo Mansour Hadi.\nThe pan-Arab news channel said on its website early on Thursday morning that the three had been freed \"a short while ago\" after having been kidnapped by \"unknown gunmen\".\nYemeni tribesmen from the Popular Resistance Committees, supporting forces loyal to Yemen's Saudi-backed President Abedrabbo Mansour Hadi, hold a position on the outskirts of Taez, on January 26, 2016 ©Ahmad al-Basha (AFP/File)\nIn a message posted on his Facebook page, Bokari said he had been held by the Iran-backed Shiite Huthi rebels, under fire since March from a Saudi-led coalition, of which Qatar is a member.\n\"We heard them repeat 'Death to America',\" a slogan the Huthis and Iranian protesters commonly chant, he wrote, adding that he would release more details about the kidnapping in the coming days.\nThe city of Taez is held by loyalists of Yemen's internationally recognised government, but it has been besieged by the Iran-backed rebels for months.\nThe Huthis overran Sanaa more than a year ago, forcing Hadi's government to flee the Yemeni capital.","url":"https://www.dailymail.co.uk/wires/afp/article-3420485/Al-Jazeera-says-news-crew-kidnapped-Yemen-freed.html"}
