{"authors":["Chriss W. Street"],"date_download":"2018-10-30 18:15:56","date_modify":"2018-10-30 18:15:56","date_publish":"2015-11-06 13:40:30","description":"The annual WalletHub’s 2015 “Best & Worst Small Cities in America” found that all 20 of the worst small cities in America are in California.","filename":"data/vaneerConsumption/All20WorstSmallCitiesinAmericainCalifornia.json","image_url":"https://media.breitbart.com/media/2015/06/California-flag-Justin-Sullivan-Getty-1024x783.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_11_06__1540923356.html","title":"All 20 'Worst Small Cities in America' in California","title_page":"All 20 'Worst Small Cities in America' in California | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The annual WalletHub’s 2015 “Best & Worst Small Cities in America” found that all 20 of the worst small cities in America to live in are in California.\nEach year WalletHub publishes a list of the best small cities in America by measuring cities with population size of between 25,000 and 100,000 residents according to a scoring system of between 0 and 100 rating four factors: “1) Affordability, 2) Economic Health, 3) Education & Health and 4) Quality of Life.”\nIn addition, WalletHub compiles “22 relevant metrics” on each city.\nCalifornia seldom dominates a rating list for anything. But the not-so-Golden State managed to have the 22 lowest ranked towns of the 1,268 small cities in America. The bottom five are:\nLynwood, CA = ranked No. 1264 with a score 29; Compton, CA = ranked 1265 with a score of 28.63; Bell Gardens, CA = ranked is 1266 with a score of 27.76; Huntington Park, CA = ranked No. 1267 with a score of 27.59; and Bell, CA = ranked 1268 with a score of 26.78.\nIt should not be surprising that Bell, California won the booby prize for the worst small town in America, since its infamous former city manager Robert Rizzo was convicted on 69 counts in a corruption scheme that nearly bankrupted the small, blue-collar city. He is currently serving a 12-year prison term and has been ordered to make restitution of $8.8 million in a corruption scheme. Rizzo paid himself $800,000 a year in salary, twice the salary of the President of the United States. With benefits, his total compensation was $1.5 million a year in a city where a quarter of the population lives below the federal poverty line.\nWalletHub commented that “life in a small city demands some tradeoffs such as shorter business hours, a heavier reliance on cars and fewer dating opportunities.” A salary that will buy a comfortable standard of living in a smaller city will not go very far in metropolis.\nBut California manages to be the bottom dweller for both small and big cities. For the top 25 major metropolitan areas in 2013, the City of Los Angeles managed to achieve the crown as America’s Poorest Big City, according to an analysis by American Community Survey-based Census Bureau data.\nLos Angeles-Long Beach-Anaheim took the booby prize for having the highest poverty rate at 17.6%. California’s overall rate of poverty was also the top contender at 16.8%.","url":"https://www.breitbart.com/local/2015/11/06/20-worst-small-cities-america-california/"}
