{"authors":["Jewel Wicker"],"date_download":"2018-10-30 18:21:51","date_modify":"2018-10-30 18:21:51","date_publish":"2017-03-08 06:00:09","description":"Few deny the effortless flow of rapper 2 Chainz.","filename":"data/vaneerConsumption/AllblackorchestrastrivestowidenmusicchoicesofAfricanAmericans.json","image_url":"https://www.myajc.com/rf/image_large/Pub/p8/MyAJC/2017/03/07/Images/WPIMAGE_cmgajcartsculture_6016.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/myajc.com/blog_arts-culture_all-black_337dc80e47378eda1197750a0888a4d0__1540923711.html","title":"All-black orchestra strives to widen music choices of African-Americans","title_page":"All-black orchestra strives to widen music choices of African-Americans","title_rss":"NULL","source_domain":"ajc.com","text":"Few deny the effortless flow of rapper 2 Chainz. “Might buy a bowling alley. I got money out the gutter,” he raps with one leg propped on a barrier at Millennium Gate Museum.\nPretentious words, certainly. And 2 Chainz’s rhymes in Migos’ song, “Deadz,” don't represent anything novel. Yet, the video for the song has an element that fans rarely see in rap videos: a maestro dramatically instructing an orchestra—an all-black orchestra.\nThe orchestra’s appearance in the video signifies opulence, and Orchestra Noir says their participation is a way to reach young African-Americans, an audience who may not routinely frequent orchestra concert halls.\nOrchestra Noir is an all-black orchestra founded by Atlanta resident Jason Ikeem Rodgers less than a year ago. He’s the impeccably dressed maestro in the “Deadz” video by Migos, a popular Atlanta-based hip-hop group.\nRELATED VIDEO: \"Deadz\" — Migos featuring 2 Chainz (Warning: Video contains explicit language)\n+ × Orchestra Noir\nRodgers has worked with various orchestras in North America and Europe for years, receiving several awards for his work as a conductor, but the idea for Orchestra Noir didn’t come while he was on a stage. It came during date night.\nWhile attending an Emerging 100 of Atlanta event with his now-fiancée, Rodgers began to reflect on the black middle class in Atlanta.\n“I was really shocked because being from the projects [in North Philly] and growing up rough, there was a different demographic here,” he said. “It was at that moment that I said we need an orchestra here in Atlanta that reflects that demographic. We need an Orchestra Noir.”\nThe group’s website emphasizes they aren’t striving to be a traditional orchestra. Instead Orchestra Noir strives to raise \"the invisible curtain and [bring] classical music to diverse, younger audiences that is relevant and respectful of their community.”\n“In orchestral music, sometimes we forget the heritage that goes into it. We forget that you can play R&B [and] hip-hop with an orchestra,” Rodgers said.\nAppearing in the Migos’ latest video wasn’t only a smart branding and promotional move for the new orchestra. It was a way to fulfill their mission as a group in front of a mass audience.\nThe orchestra has come a long way since launching with 25 musicians last March during a performance at Studio No. 7, now nearly double in size.\n+ × Orchestra Noir\nA 44-piece orchestra will perform in concert alongside producer, songwriter, and Atlanta native Bryan-Michael Cox on March 31. Cox, who has nine Grammys for co-producing albums such as Usher’s “Confessions” and Mariah Carey’s “The Emancipation of Mimi,” said he was looking for a way to blend his work as a songwriter, producer and DJ when the orchestra approached him with the idea to collaborate on the show \"A Night at the Opera.\"\n“I think it’s going to be mind-blowing and powerful,” he said. The performance will have the snazzy, black-tie motif expected of an orchestral affair, yet will be held at Center Stage Theater to attract Atlanta's young music fans.\nVisit ticketmaster.com to purchase tickets for this event. A portion of the proceeds from the event will go towards fighting homelessness in Atlanta.\nMarch 31 at 8 p.m., $39-$109, Center Stage Theater, 1374 West Peachtree St., Atlanta. ticketmaster.com","url":"https://www.myajc.com/blog/arts-culture/all-black-orchestra-strives-widen-music-choices-african-americans/TjGXLBuTdd52zfkNLC8QTP/"}
