{"authors":[],"date_download":"2018-10-22 21:25:54","date_modify":"2018-10-22 21:25:54","date_publish":"2014-05-07 05:51:43","description":"Several alleged members of a major drug ring in suburban Philadelphia's Main Line appeared in court on Tuesday.","filename":"data/vaneerConsumption/AllChargesHeldforPrepSchoolDrugRingSuspects.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_all-charges-held-prep-school-drug-ring-suspects-n98916_1540243554.html","title":"All Charges Held for Prep School Drug Ring Suspects","title_page":"All Charges Held for Prep School Drug Ring Suspects","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBy NBCPhiladelphia.com\nSeveral alleged members of a major drug ring in suburban Philadelphia's Main Line appeared in court on Tuesday.\nWillow Orr, 22, Reid Cohen, 18, Daniel McRath, 18, Christian Euler, 23, and Domenic Curcio, 29 all waived their preliminary hearings and are set for a formal arraignment.\nThe five suspects, along with 20-year-old John Rosemann, 18-year-old Garrett Johnson, a 17-year-old Radnor High School student and a 17-year-old Lower Merion High School student, were the alleged \"sub-dealers\" for Neil Scott, 25, and Timothy Brooks, 18, in the drug ring. Mainline Media reports that Brooks and Johnson were also scheduled to appear in court on Tuesday but their hearings were pushed back to a later, unspecified date.\nRosemann is scheduled for his preliminary hearing on May 7. Scott already waived his preliminary hearing last month and is scheduled for a formal arraignment on June 4 in Norristown.\nLast month, the suspects were arrested for allegedly selling illicit substances in high schools and colleges.\nThe alleged operation was called the \"Main Line Take Over Project,\" according to Montgomery County District Attorney Risa Ferman.\nScott and Brooks employed \"sub-dealers\" at five Main Line high schools and three area colleges who would sell marijuana, hash oil, cocaine and MDMA, a drug commonly known as Ecstasy, Ferman said. Authorities confiscated drugs, cash and guns in a sweep related to the operation, which officials said had been running for the past couple of months, officials said.\n“This was not a game. These people were in business, they were in business to make money and they were going to do whatever they needed to do so that no one threatened their business,\" Ferman said.\nThe schools involved were the private Haverford School and public high schools Lower Merion High School and Harriton High School in Lower Merion Township, Pa., Conestoga High School in Tredyffrin Twp., Pa., Radnor High School in Radnor, Pa., as well as Gettysburg, Lafayette and Haverford colleges.\nFerman said both men, who are graduates of the prestigious all-boys preparatory school The Haverford School, worked together to \"create a [drug] monopoly to high school students in the area.\" Both men played lacrosse at the swanky Montgomery County private school and coached youth sports leagues, according to Ferman. The DA said Brooks and Scott exploited those relationships to help grow the criminal enterprise.\nAuthorities said Scott worked, at one time, at a legal marijuana dispensary in California and used those connections to garner his supply.\nThrough text messages obtained during the investigation, prosecutors said they learned Scott and Brooks ran the ring like a legitimate business. Scott allegedly coached Brooks, who would in turn supervise the \"sub-dealers\" inside the high schools.\n“The high school sub-dealers were encouraged to develop their business so that they could sell at least one pound of marijuana each week,” Ferman said. \"Brooks instructed the dealers to make sure that there was never a drought.\"\nJohn Nagl, headmaster for The Haverford School, said school officials were notified about an on-going investigation several weeks ago, but were asked not to interfere.\n\"We focus on developing boys with good character, despite our best efforts, sometimes boys make bad choices,\" he said. \"This was destructive and horrible. And we are deeply saddened.\"\nNagle said the school, which teaches 1,000 boys in a lower, middle and upper school, does not comment on current or former students. He said he did not know how many students may have purchased drugs through the ring.\n“The school is cooperating with the law enforcement investigation,\" he said.\nSpokespersons for the Lower Merion, Radnor and Tredyffrin/Easttown school districts said officials have been made aware of the allegations and that the safety of students is most important. All said they were unaware of the investigation, but will cooperate if asked.\nGettysburg College is conducting an internal investigation, a spokesman for that college said.\nNBC10.com also reached out to the other schools involved in the case, but so far we have not heard back.\nFerman said investigators learned about the \"Main Line Take Over Project\" through confidential informants and conducted a one-day round-up in February. In that operation, prosecutors said they confiscated 8 lbs. of marijuana, 3 grams of hash oil, 23 grams of cocaine, 11 grams of Ecstasy, $11,000 in cash, a loaded handgun, an AR-15 assault rifle and AR-15 style rifle. Most of the contraband came from Scott's Haverford apartment, authorities said.\nScott, who is being held on $1 million bail, covered his face and shouted expletives at reporters attempting to get comment following his arraignment last month. His attorney declined comment saying he had just gotten the case.\nBrook's attorney said the teen \"lost his way\" and is remorseful. His parents posted the $25,000 bail to release him from jail.","url":"https://www.nbcnews.com/news/us-news/all-charges-held-prep-school-drug-ring-suspects-n98916"}
