{"authors":[],"date_download":"2018-10-30 18:34:26","date_modify":"2018-10-30 18:34:26","date_publish":"2017-02-22 18:57:00","description":"Terique Hall faces a 22-count indictment in DeKalb County with charges including murder, rape, false imprisonment and assault.","filename":"data/vaneerConsumption/AllegedserialrapistsayshedidntmurderpregnantDeKalbwoman.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/MyAJC/2016/12/01/Images/photos.medleyphoto.12357293.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_alleged-serial-r_6ae9e52109ef18a27d66889402f53343__1540924466.html","title":"Alleged 'serial rapist' says he didn't murder pregnant DeKalb woman","title_page":"Alleged 'serial rapist' says he didn't murder pregnant DeKalb woman","title_rss":"NULL","source_domain":"ajc.com","text":"Terique Hall, the 24-year-old Atlantan accused of a series of sexual attacks and the murder of a pregnant woman, has pleaded not guilty.\nHall faces a 22-count indictment in DeKalb County with charges including murder, rape, false imprisonment and assault. He’s been accused of attacking four women in Fulton and DeKalb counties, with authorities alleging he bound and gagged the women after meeting them on backpage.com, a site known as a destination for finding prostitutes.\nThe DeKalb County District Attorney’s Office confirmed Wednesday he pleaded not guilty during an arraignment last week.\nThe charges are related to alleged crimes over an eight-day span in November, during which authorities have said he victimized three women in DeKalb, one in Tucker and two in the Lithonia area. He’s charged with two counts of rape in DeKalb. Authorities have said he was run off by the pimp of one woman when she screamed for help.\nAshley Mays, 20, died Nov. 18.\nProsecutor Dalia Racine said in a previous hearing that Hall, whom she called “serial rapist,” tried to video tape himself suffocating the hog-tied woman in her room at Quality Inn and Suites.\nShe was 4-months pregnant. The fetus died.\nHall, who was arrested after police released hotel security camera photos purporting to show him, has remained in the DeKalb jail without bond since late November.","url":"https://www.ajc.com/news/local/alleged-serial-rapist-says-didn-murder-pregnant-dekalb-woman/WGiNZXaJHSc3OHNR7qPO1H/"}
