{"authors":["Associated Press"],"date_download":"2018-10-23 02:50:15","date_modify":"2018-10-23 02:50:15","date_publish":"2016-01-29 17:33:47","description":"NEW YORK (AP) — Before book buyers get to read Julia Claiborne Johnson's debut novel, \"Be Frank With Me,\" they'll have a chance to hear it. On Friday, the au...","filename":"data/vaneerConsumption/AllearsDebutnovelcomesoutfirstinaudioedition.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:517ad81d3a9242cca26f038c6756c3a1-3bmscybNe842cce83474b584aa4c-61_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422915_All-ears-Debut-novel-comes-audio-edition_1540263015.html","title":"All ears: Debut novel comes out first in audio edition","title_page":"All ears: Debut novel comes out first in audio edition | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"All ears: Debut novel comes out first in audio edition\nNEW YORK (AP) — Before book buyers get to read Julia Claiborne Johnson's debut novel, \"Be Frank With Me,\" they'll have a chance to hear it.\nOn Friday, the audio edition of Johnson's comic saga of a famous writer's 9-year-old son became available through the audio seller and producer Audible Inc. four days before the hardcover and e-books go on sale. The early release, read by the popular audio narrator Tavia Gilbert, was a joint project of the Amazon.com-owned Audible and HarperCollins Publishers.\n\"Sometimes you don't know how well an audiobook is going to turn out until you listen to the final version,\" says Sean McManus, associate publisher of HarperAudio. \"When we heard Tavia's performance, we knew we had a great audiobook on our hands and an opportunity to do something different with a debut author.\"\nThis audio book cover image released by William Morrow shows, \"Be Frank With me,\" a novel by Julie Claiborne Johnson and voiced by Tavia Gilbert. On Friday, the audio edition of Johnson's comic saga of a famous writer's 9-year-old son became available on Amazon.com four days before the hardcover and e-books go on sale. The early release, read by the popular audio narrator Tavia Gilbert, was a joint project of the Amazon-owned audio seller and producer Audible.com and HarperCollins Publishers. (William Morrow via AP)\nAudio book revenues have been growing by double-digits over the past few years, with reasons cited including digital downloads that allow you to hear a book on your phone and the appeal of \"Serial\" and other podcasts that feed an appreciation for the spoken word.\nAnthony Goff, Hachette Book Group's audio publisher, said that a decade ago audiobooks often came out after the print edition. Now, simultaneous releases are the standard and advance releases for audio a growing possibility. Last summer, Stephen King's short story \"Drunken Fireworks\" came out months before it appeared in print in the collection \"The Bazaar of Bad Dreams.\" Jack Campbell's fantasy series \"The Pillars of Reality\" was first released in audio late in 2014, and in paper last May.\n\"Publishers pick their spots, and an early e-book release can be an effective thing to do,\" said Chris Lynch, president and publisher of Simon & Schuster Audio, which released King's audiobook.\n\"Doing it with a first-time author is an interesting experiment, because any time we've tried anything like that there's been a well-known author involved.\"\nAudio sales don't yet approach those for paper or even for e-books, which comprise around 25 percent of the overall market, but for some releases they have become substantial. In a blog post from last summer, children's author John Scalzi noted that some 40,000 copies of his novel \"Lock In\" had sold in audio, just under the combined numbers for the hardcover and e-book. Scalzi added that audio's growth was even affecting his writing style.\n\"Audio has its own audience, with its own sets of desires and expectations, and that's something you'll want to factor in as you create your work,\" Scalzi wrote. \"At this point, I absolutely give consideration to how my work sounds as well as reads. I'm starting to use substantially fewer dialogue tags ('he said,' 'she said'), as an example.\"\nIn a recent email interview, Johnson said she knew people who found it easier to listen a story than read it. They would ask her, sheepishly, about an audio edition for her novel as \"if they were second-class citizens.\"\n\"When I heard the audio version was coming out before the hardcover I thought, 'Nice. All you listeners, please step to the front of the line,'\" she told The Associated Press.\n\"Look, I prefer reading my books; but I grew up in the South where there's a real oral tradition, so I'm a big fan of listening. At family reunions — I go to one in Tennessee that's been going on for around 175 years now — people sit around telling stories late into the night.\"\nJohnson said she had imagined her book being read out loud, just not by her. She noted a passage in \"Be Frank With Me\" in which the title character is asked if he's been talking to his missing mother and he answers, \"Outside my head? No.\"\n\"That's how it was for me when my novel was still just ideas bouncing around inside my skull,\" Johnson wrote in her email. \"It was being read out loud, but just to me and nobody else. When my publishers asked if I wanted to read the audio book edition, I said no before they could finish the sentence.\"\n\"Tavia Gilbert nailed it,\" Johnson added. \"I may crib from her delivery when I have to read my book aloud myself.\"\n___\nOnline:\nhttp://www.audible.com\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3422915/All-ears-Debut-novel-comes-audio-edition.html"}
