{"authors":["Associated Press"],"date_download":"2018-10-22 23:53:00","date_modify":"2018-10-22 23:53:00","date_publish":"2017-04-26 08:45:44","description":"WASHINGTON (AP) - Not since John F. Kennedy appointed his brother Bobby to be attorney general and his brother-in-law as director of the Peace Corps has a...","filename":"data/vaneerConsumption/AllintheFamilyTrumpmixesfamilygoverningbusiness.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/15/wire-465951-1493218558-72_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446690_All-Family-Trumps-potent-mix-blood-business_1540252380.html","title":"All in the Family: Trump mixes family, governing, business","title_page":"All in the Family: Trump mixes family, governing, business | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"WASHINGTON (AP) - Not since John F. Kennedy appointed his brother Bobby to be attorney general and his brother-in-law as director of the Peace Corps has a president leaned so heavily on his family. Even Donald Trump's 5-year-old granddaughter Arabella has pitched in.\nAs the administration nears its 100-day mark, Trump has established a White House operation with such an unusual commingling of blood, business and government that it has surprised even his own family.\nIvanka Trump, who once said she'd stick to the role of daughter, now has a West Wing office and the title of assistant to the president after she discovered that \"having one foot in and one foot out wouldn't work.\" Her effort to walk a fine line has not always been easy. During an appearance Tuesday at a women's empowerment conference in Germany, she drew hisses and groans as she defended her father's track record.\nFILE - In this March 3, 2017, file photo, President Donald Trump and his family, daughter Ivanka Trump, her husband senior adviser Jared Kushner and their children Arabella Kushner and Joseph Kushner walk out of the Oval Office of the White House in Washington. Not since John F. Kennedy appointed his brother Bobby to be attorney general and his brother-in-law to head the Peace Corps has a president leaned as heavily on his family as has Donald Trump. (AP Photo/Pablo Martinez Monsivais, File)\nHer husband Jared Kushner is a senior adviser to the president with a bulging and growing portfolio that includes everything from brokering Mideast peace to restructuring the federal government.\nAnd there was the president's son Eric, in the unofficial role of spokesman, declaring his father would stand up to North Korea's provocations. In an interview, at the White House Easter egg roll no less, saying on behalf of the president: \"You don't want there to be death and destruction and turmoil around the world but, again, you have to have massive backbone when it comes to dealing with awful, awful dictators.\"\nAnother Trump son, Don Jr., enhanced his profile during the campaign and early months of his father's presidency to such an extent that there is speculation he'll make his own run for office. And he's leaving that door open, saying the New York governor's seat could be a tempting destination at some point.\nThe president's wife, Melania, meanwhile, has been a largely distant presence so far, remaining in New York for the most part while their 11-year-old son Barron finishes out the school year. But she is gradually spending more time in Washington and did give her husband a gentle nudge to put his hand on his heart during the playing of the national anthem at the Easter egg roll.\nLittle Arabella chimed in to the Trump team effort by charming Chinese President Xi Jinping by singing a tune in Mandarin during the leaders' recent meeting at Mar-a-Lago.\nThere are both pros and cons in staffing up from within one's own family, as Trump is learning.\nThe family dynamic has added extra intrigue to the jockeying between rival power centers that is typical in the early days of any White House. The more moderate contingent led by Kushner and Ivanka Trump appears to be ascendant in recent days over those allied with senior strategist Steve Bannon, the former media executive and radio host who's a favorite of conservatives.\nPrinceton historian Julian Zelizer says family members may be able to give a president a tough assessment that other staff members would shrink from providing, but they also can become \"so enmeshed in the identity of their family and protecting their father that they can't give honest advice or can't even see problems as they emerge.\"\nIvanka Trump has been criticized for not speaking out more forcefully when she disagrees with her father. But that doesn't necessarily mean she's not making her views heard.\n\"I would say not to conflate lack of public denouncement with silence,\" she said earlier this month.\nDuring her appearance this week in Berlin, she said she's still \"rather unfamiliar\" with her new role as first daughter and presidential adviser but hopes to bring advice and feedback \"back to both my father and the president - and hopefully that will bring about incremental, positive change.\"\nHer husband, meanwhile, has traveled to Iraq with the chairman of the Joint Chiefs of Staff and has been advising the president on relations with the Middle East, Canada and Mexico.\nThe extent of Ivanka Trump's sway with her father is suggested by Eric Trump's recent comment that she likely weighed in before the president decided to bomb Syria in retaliation for a chemical weapons attack. Eric Trump told London's Daily Telegraph: \"She has influence. I'm sure she said, 'Listen, this is horrible stuff.'\"\nThe blurry line between the Trump family's business interests and its government connections is another unusual complication of this presidency. Even with sons Don Jr. and Eric tasked with running the Trump businesses while Kushner and Ivanka Trump tend to government affairs, the continuing public-private overlap has generated lots of questions about conflicts of interest.\nThe separation between business and government is \"totally artificial,\" says Zelizer.\nEric Trump's admission to Forbes magazine in February that \"nepotism is kind of a factor of life\" in the Trump family didn't help dispel the impression of an insider's clan, although he stressed that \"if we didn't do a good job, if we weren't competent, believe me, we wouldn't be in this spot.\"\nFor all the questions about Trump's reliance on family, some see it as a net positive.\nThe value of having a son or daughter on the inside \"is honesty and love,\" says former George H.W. Bush administration staffer Doug Wead, author of books on presidential children and the 2016 campaign. \"They care if your shirt-tail is hanging out. If your hair is messed up, they'll tell you. When everybody else is trying to hide from you, they're going to let you know.\"\nThe power - and peril - of Kushner's place in Trump World is hinted at by Washington graybeard Henry Kissinger in a write-up for Time's list of 100 most influential people. Kissinger said Kushner's broad education and business background \"should help him make a success of his daunting role flying close to the sun.\"\n___\nFollow Nancy Benac on Twitter at: http://twitter.com/nbenac\nFILE - In this April 24, 2017, photo, President Donald Trump, accompanied by his daughter Ivanka Trump, talks via video conference with International Space Station Commander Peggy Whitson from the Oval Office of the White House in Washington. Not since John F. Kennedy appointed his brother Bobby to be attorney general and his brother-in-law to head the Peace Corps has a president leaned as heavily on his family as has Donald Trump. Ivanka Trump, who once said she'd stick to the role of daughter, now has a West Wing office and the title of assistant to the president after she discovered that \"having one foot in and one foot out wouldn't work.\" (AP Photo/Susan Walsh)\nFILE - In this April 3, 2017, file photo, Jared Kushner, right, U.S. President Donald Trump's son-in-law and senior adviser, receives a gift from Iraqi Defense Minister, Ifran al-Hayali, at the Ministry of Defense, Baghdad, Iraq. Not since John F. Kennedy appointed his brother Bobby to be attorney general and his brother-in-law as director of the Peace Corps has a president leaned so heavily on his family. Kushner is a senior adviser to the president with a bulging and growing portfolio that includes everything from brokering Mideast peace to restructuring the federal government. (AP Photo)","url":"https://www.dailymail.co.uk/wires/ap/article-4446690/All-Family-Trumps-potent-mix-blood-business.html"}
