{"authors":[],"date_download":"2018-10-30 20:32:13","date_modify":"2018-10-30 20:32:13","date_publish":"2015-11-18 16:51:23","description":"“To protect and to serve.” It can be easy for some to dismiss that noble police motto in this time of citizen versus cop.","filename":"data/vaneerConsumption/allinnightsworkfor.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/11/18/Images/photos.medleyphoto.8403401.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_deliver-baby-cat_f5c65a4a97ff6816ad8a955fd01f815c__1540931533.html","title":"all in night’s work for...","title_page":"Deliver a baby, catch a suspect: all in night’s work for...","title_rss":"NULL","source_domain":"ajc.com","text":"“To protect and to serve.”\nIt can be easy for some to dismiss that noble police motto in this time of citizen versus cop.\nBut a Brookhaven police lieutenant breathed some credence into those words Tuesday night when he helped deliver a baby and just minutes later helped capture a burglar.\nFor Lt. Jeff Vanaman, it was all in a night’s work.\nIn a post to the Brookhaven police Facebook page, the story was told of how Vanaman responded to a woman-in-labor call around 9:45 p.m. The lawman helped deliver Mateo Alexander Bibiano at home, ahead of the ambulance, and just in the nick of time.\nWrote Vanaman, in a separate post: “To … serve her during one of the most physically and mentally vulnerable moments of her life … I was the one who felt humbled to be there.”\nA half-hour later, Vanaman was part of a chase through the woods that nabbed a suspect in a Fulton County burglary.\nVanaman said it was about more than making an arrest, though.\n“It was.” he wrote, “about listening to a mother who described the fierce emotional internal vigor to defend her family when she came face to face through the glass of the back door with the man trying desperately to get into her home, and then getting to tell each of them that they no longer needed to fear this man on this night anymore.”\nAs one supporter posted to Facebook: “Delivering babies AND justice”","url":"https://www.ajc.com/news/local/deliver-baby-catch-suspect-all-night-work-for-brookhaven-cop/5XNpKIumNq2ucFOxQ0ThGI/"}
