{"authors":["Mallory Schlossberg"],"date_download":"2018-10-30 23:41:33","date_modify":"2018-10-30 23:41:33","date_publish":"2014-08-13 14:26:55","description":"It's the flying Marnie! But she's actually flying, not like, metaphorically flying high on her rampant emotions. Allison Williams posted a video of her first flying lesson for Peter Pan, and hell, it might make you want to take up flying lessons,…","filename":"data/vaneerConsumption/AllisonWilliamsFirstFlyingLessonForPeterPanIsActuallySweetSomberVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/0e16f3fa-b7cf-4a96-b4c8-82cd5201804f.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35584-allison-williams-first-flying-lesson-for-peter-pan-is-actually-sweet-somber-video_1540942893.html","title":"Allison Williams' First Flying Lesson For 'Peter Pan' Is Actually Sweet & Somber - VIDEO","title_page":"Allison Williams' First Flying Lesson For 'Peter Pan' Is Actually Sweet & Somber — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"It's the flying Marnie! But she's actually flying, not like, metaphorically flying high on her rampant emotions. Allison Williams posted a video of her first flying lesson for Peter Pan, and hell, it might make you want to take up flying lessons, too. Why not!?! If there's one thing I learned in Peter Pan, it's that I can be a child forever (with the potential for punishment) so I'm interpreting that as: \"Yes, I can buy a flying trapeze thing, and my punishment will be that I see a serious dip in my bank account and/or safety.\"\nBut let's dismiss the whole \"Yes! Woo hoo! It's Allison Williams getting ready for Peter Pan!\" vibe for a moment and focus on what her post is really about: Robin Williams. The Girls star wrote on Instagram:\nFirst day of flying lessons for Pan. Thinking about and missing a hero of mine who once did this and left big shoes to fill.\nShe's obviously talking about Robin Williams' performance in Hook.\nIt's sweet — and even a little somber – that her Instagram video reflects more than just her own excitement about her big, upcoming role. The fact that she's pausing to think about Robin Williams' passing (which shows a marked difference between Williams and her self-absorbed character on Girls) it's also further proof that Robin Williams had a tremendous impact on so many people in the entertainment industry, and that his spirit will continue to live on.\nPhoto:\nVideo:\nImage: aw/Instagram","url":"https://www.bustle.com/articles/35584-allison-williams-first-flying-lesson-for-peter-pan-is-actually-sweet-somber-video"}
