{"authors":["Jennifer Pearson For Dailymail.Com"],"date_download":"2018-10-23 01:13:40","date_modify":"2018-10-23 01:13:40","date_publish":"2016-01-28 15:30:40","description":"The 27-year-old posted a first look at the still-dampened 'do featuring a fringe of hair that stopped just short of her brows in a silly captioned Instagram that boasted she got 'banged'.","filename":"data/vaneerConsumption/AllisonWilliamsdisplaysfreshnewfringehaircutinfunnyInstagramsnap.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB305F00000578-0-image-a-4_1453993999331.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421141_Allison-Williams-displays-fresh-new-fringe-haircut-funny-snap-ditches-sweeping-curls_1540257220.html","title":"Allison Williams displays fresh new fringe haircut in funny Instagram snap","title_page":"Allison Williams displays fresh new fringe haircut in funny Instagram snap | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She stars on Girls so she's bound to have a quirky sense of humour.\nNewlywed Allison Williams was hankering for a change and got it early Thursday morning in the form of a fresh and snappy new haircut.\nThe 27-year-old posted a first look at the still-dampened 'do featuring a fringe of hair that stopped just short of her brows in a silly captioned Instagram that boasted she got 'banged' - by a pair of shears that is courtesy of hairstylist to the stars Chris McMillan.\n'Past my bedtime': Allison Williams shared a first look at her fresh new haircut courtesy of celebrity hairstylist Chris McMillan in a funny Instagram that read: 'It's 3:20 am and @mrchrismcmillan just banged me'\n'It's 3:20 am and @mrchrismcmillan just banged me ‼️ #PastMyBedtime,' Allison wrote alongside the selfie, including an emoji of a pair of scissors.\nIt's quite a departure from Allison's luxurious mass of side sweeping hair, a style that she's worn for years.\nAllison displayed the signature look while appearing on the Bachelor Live viewing party in Los Angeles on Monday.\nIn with the new, out with the old: The 27-year-old newlywed displayed long and luxurious locks during her Monday visit to Bachelor Live with The View's Michelle Collins\nTrademark: Allison posed with The Bachelor host Chris Harrison and showed off more of that trademark side sweeping 'do she's worn for years\nThe super fan, who exchanged vows with her fiance Ricky Van Veen, 35, on September 19 of last year, went on to say that she wouldn't be married if not for The Bachelor.\nWearing a form-fitting black dress with modest sweetheart neckline, Allison's hair framed her oval face nicely.\nObviously, she wanted to do something drastic with those strands and employed McMillan - who is responsible for Jennifer Aniston's now infamous 'Rachel' cut on Friends - to do the task.\nTake a long last look: The brunette flashed the peace sign - or were those scissors - as she waited in front of the elevator\nWhile she didn't mention the exact reason for the change, it might have something to do with her next role.\nAllison is set to star in the horror flick Get Out, currently in pre-production, for writer-director Jordan Peele.\nThe story follows a young African American man who joins his Caucasian girlfriend on a visit to her family's 'cursed' estate.\nJust married: Allison wed Ricky Van Veen on September 19 of last year after a yearlong engagement; the couple was pictured in 2014\nThe movie 'takes on the task of exploring race in America,' Peele said, according to Variety, and that's 'something that hasn’t really been done within the genre since Night Of The Living Dead 47 years ago. It’s long overdue.'\nIt will mark Allison's first starring role since NBC's Peter Pan Live! special in 2014.\nAllison currently portrays Hannah's best friend Marnie Michaels in HBO's hit series Girls, which will be ending after the sixth and final season.\n'It feels like the right time,' star and series creator Lena Dunham said this month in a statement.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421141/Allison-Williams-displays-fresh-new-fringe-haircut-funny-snap-ditches-sweeping-curls.html"}
