{"authors":[],"date_download":"2018-10-30 19:24:33","date_modify":"2018-10-30 19:24:33","date_publish":"2018-06-26 16:18:00","description":"New Hawks point guard Trae Young has a lot to work on before his rookie season.","filename":"data/vaneerConsumption/AllowhimtobeTraersqu.json","image_url":"https://www.ajc.com/rf/image_large/Pub/Web/AJC/Special%20Contents/Links/Images/765CC45D46E84AA5A866EE4162D25620.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_basketball_hawks-coa_6ba4230900dfff5ce98071f5d24d1c33__1540927473.html","title":"‘Allow him to be Trae&rsqu","title_page":"Plan for Young at summer league: ‘Allow him to be Trae&rsqu","title_rss":"NULL","source_domain":"ajc.com","text":"New Hawks point guard Trae Young has a lot to work on before his rookie season.\nYoung needs to get stronger. His defense needs a lot of work. The suspect shot selection Young showed late last season for Oklahoma isn’t likely to go over well with his Hawks teammates and coach Lloyd Pierce.\nBut Pierce said his philosophy is to wait until later to address Young’s shortcomings . For now, Pierce said he’ll let Young loose during summer league play beginning next week in Utah and let him showcase the talent that made him a star for the Sooners.\n“I think one of the mistakes I’ve seen in the past is you already know what you want to help (rookies) with and you go right to that immediately, so they are dealing with their failures as opposed to just addressing who they are,” Pierce said. “Let Trae play. Give him the ball. Let him play in pick-and-roll, let him find his teammates. He’s done that his entire career. Let him do that.\n» More: Hawks GM drafts ‘dribble, pass, shoot’ players\n“We will worry about some of the other stuff as the game occurs and teams are trying to exploit those things. But we have to see what we have and let him be comfortable. The first thing we can do is allow him to be Trae.”\nJudging by Young’s season at Oklahoma, that means he will dominate the ball for the Hawks during summer league play. No other player in college basketball last season carried a bigger offensive load than Young.\nAccording to Kenpom.com, Young led the NCAA last season with 38.5 percent possessions used (ending with a field-goal attempt, turnover or free-throw attempt). By comparison, Rockets point guard James Harden used 36.1 percent of his team’s possessions to lead the NBA.\nYoung’s open-court offensive style figures to be a good fit for summer league, where games tend to be less structured than real NBA competition. The rosters feature a mix of new draft picks, street free agents trying to earn roster spots and young NBA players with contracts for next season.\nYoung will get plenty of opportunities to run pick-and-rolls in summer league and show off his court vision, passing ability and deep shooting range. Young’s Hawks teammates will include second-year pro John Collins, a high-flying dunker who should be a prime target for his lobs on pick-and-rolls.\n“The way I play I think it fits the modern NBA game and the way it’s played: shooting 3’s, space the floor, attacking all the space,” Young said.\nAt the other end, Hawks summer league opponents are likely to force Young to defend a lot of pick-and-rolls and off-ball screens. That could be a challenge for Young because, in addition to his relatively slight build and average athleticism, he showed inconsistent focus and effort as a defender for the Sooners.\nPierce said that during the pre-draft process he emphasized to general manager Travis Schlenk and the team’s scouts that all incoming rookies need to improve their defense. He said that when opponents seek to exploit Young’s defense, the team’s schemes and concepts will help him.\nYoung said he plans to show he can play defense starting next week.\nThe Hawks introduced the three players they selected in last week's draft, including point guard Trae Young. The Hawks acquired Young, the No. 5 overall selection, in a trade with the Mavericks.\n“My main focus is proving that from Day One,” he said. “Growing up playing basketball, I’ve played for coaches where if I’m not playing defense I wouldn’t’ be playing. ... I have quick feet and I’m very cerebral so I can play defense. And I know coach Pierce is going to demand that out of me so I’ve got to get it going.”\nPierce said he’s not certain how often Young and Omari Spellman will play in summer league (Kevin Huerter, the team’s second draft pick in the first round, is out with a hand injury). The Hawks are scheduled to play three games in four days in Utah: July 2, 3 and 5. In the Las Vegas summer the Hawks have games on July 7, 8 and 10 followed by at least two more games in a tournament that follows preliminary play.\nYoung will be one of the biggest draws at the summer leagues, especially in Las Vegas. All 30 teams will have an entry in that event. The Hawks are scheduled to play their first two games in the Thomas and Mack Center, the larger of the two venues.\nLuka Doncic, the player the Hawks drafted at No. 3 before sending him to the Mavericks in a prearranged trade, won’t play in either summer league. The other three players picked in the top five are expected to play: Deandre Ayton (Suns), Marvin Bagley (Kings) and Jaren Jackson Jr. (Grizzlies).\nNext week Young will face his first scrutiny as a top NBA draft pick. But he’s already been a national story while becoming the first NCAA player to lead the nation in scoring and assists.\n“I think it benefits me because I’ve been through the ups and downs and I know how to handle things now,” Young said. “I know the NBA is a different level as far as the marketing and publicity, but I got a little piece of how to handle it in college. I’ve already been through it once.”","url":"https://www.ajc.com/sports/basketball/hawks-coach-pierce-summer-league-plan-for-young-allow-him-trae/PozmJmn64EIcKVpw4IywGL/"}
