{"authors":[],"date_download":"2018-10-30 00:50:27","date_modify":"2018-10-30 00:50:27","date_publish":"2014-08-13 15:39:36","description":"AllSides reflects the news as it is covered from a breadth of perspectives. That includes different perspectives on the same story as well as different opinions on what the day’s top stories are.","filename":"data/vaneerConsumption/AllSidesEditorialPhilosophy.json","image_url":"https://www.allsides.com/sites/default/files/logo-all-sides-20px_1.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/allsides.com/blog_allsides-editorial-philosophy_1540860627.html","title":"AllSides Editorial Philosophy","title_page":"AllSides Editorial Philosophy | AllSides","title_rss":"NULL","source_domain":"allsides.com","text":"Updated October 23, 2017 to reveal more of our own biases (no one is unbiased) as we work to provide a broad, balanced view of news and issues in the face of growing media bias, polarizing filter bubbles and an increasingly divided society. We also felt it was important to point out that we have a bias in favor of free speech and freedom of the press, although, as part of our commitment to providing all sides, we also cover perspectives that promote limiting both of these first amendment rights.\nAllSides reflects the news as it is covered from a breadth of perspectives. That includes different perspectives on the same story as well as different opinions on what the day’s top stories are. We also seek to provide context, revealing debate on the underlying issues and other helpful background.\nWe refrain from choosing the news ourselves; rather we seek to reflect the news as others are covering it. And your participation helps us achieve that.\nWe do however add some editorial bias of our own. We believe everyone is biased, including us, and that it is important to be transparent about your bias.\nWe give voice to perspectives often ignored. We don’t just show left, center and right, but also perspectives representing everything from Socialist to Libertarian, Blue-dog Democrat to Mainstream Republican, and Liberal to Social Conservative. (See the 8 distinct groups that Pew Research has identified.) So stories that might be missing entirely from leading news sites but are top headlines for a specific group will often appear on AllSides.\nWe give extra attention to news with contrasting coverage. We have seen mainstream coverage – of elections, terrorist acts, economics, occupy Wall Street, and conflict in the Middle East to name just a few – that differed so widely that it is hard to imagine they were reporting on the same event. We give these stories extra emphasis to be sure you have a full picture to understand what is really happening.\nWe highlight stories on polarization and media bias. AllSides aims to reduce dysfunctional polarization so we can work together and solve problems. Revealing bias and exposing people to different points of view helps achieve that aim. Raising awareness and understanding of polarization and bias supports this worthy cause.\nWe highlight free speech and civil discourse. We can not bridge divides and solve problems without listening to each other and sharing our thoughts. This requires a free flow of information and free speech so ideas (good and bad) are heard, and civil discourse so we can relate and empathize with each other.\nWe focus, at least for now, on political news. There are many other topics, like health, finance, parenting, ethics, and products to name just a few, which would benefit from exposing different perspectives and bias. We see the most urgent need and biggest opportunity for change in the political world so have started there.\nAllSides empowers people to be informed, understand and decide for themselves. Without exposure to different points of view, we can be manipulated into believing and acting in certain ways. When well informed, we are better equipped to solve our problems and build “a more perfect union”.\nOverall, AllSides News, Issues and Perspectives support the broader AllSides mission to \"free people from filter bubbles so they can better understand the world and each other.\" Our editorial philosophy helps us put this mission into daily practice.","url":"https://www.allsides.com/blog/allsides-editorial-philosophy"}
