{"authors":["Robin Hilton"],"date_download":"2018-10-22 20:10:15","date_modify":"2018-10-22 20:10:15","date_publish":"2015-08-07 00:00:00","description":"Our recurring puzzler for careful listeners, this week featuring a selection of fills handpicked by All Songs Considered co-host Robin Hilton. Hear the drum fill and match it to the song.","filename":"data/vaneerConsumption/AllSongsConsidered.json","image_url":"https://media.npr.org/assets/img/2015/08/07/gettyimages-85364458_wide-812cc786c0af02715690c8bd443e0edfb4bd255d.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_allsongs_2015_08_07_430351334_drum-fill-friday-for-aug-7_1540239015.html","title":"All Songs Considered","title_page":"Puzzler: Name That Drum Fill : All Songs Considered : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Drum Fill Friday, For Aug. 7\ntoggle caption Bob King/Redferns/Getty Images\nLook, we all have work to do. But it's Friday, and this drum fill puzzler isn't going to quiz itself. So put down whatever you're doing, put on your headphones and see how many of these fills you can match to the right song. I'd give this week's Drum Fill Friday three out of five for difficulty.\nGood luck, careful listeners, and as always, if you have a drummer or a fill you'd like to see featured in these weekly puzzlers, let us know in the comments section or via Twitter @allsongs, #drumfillfriday.","url":"https://www.npr.org/sections/allsongs/2015/08/07/430351334/drum-fill-friday-for-aug-7"}
lay DJ on this edition of All Songs Considered, and share some of the songs she loves by other artists who've influenced her over the years. It turns out she's a huge Pink Floyd fan, with a special fondness for R.E.M. and Bon Iver. We also play and talk about some of my favorite songs from SOAK's new record.\nYou can hear and download the full conversation with the link above, or scan a playlist of the songs we play in the episode, alongside personal stories from SOAK about each of them.","url":"https://www.npr.org/sections/allsongs/2015/07/14/422867822/guest-dj-soak"}
