{"authors":[],"date_download":"2018-10-22 21:22:11","date_modify":"2018-10-22 21:22:11","date_publish":"2017-03-03 00:00:00","description":"The technology has improved police conduct and led to a drop in certain types of cases. But the body cams have added many extra hours of work watching videos for police and public defenders.","filename":"data/vaneerConsumption/AllTechConsidered.json","image_url":"https://media.npr.org/assets/img/2017/03/02/gettyimages-149191836_wide-5949ec15c1ac0ad9ed8f29eb5492d96e02463b69.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=517930343_1540243331.html","title":"All Tech Considered","title_page":"New Orleans' Police Use Of Body Cameras Brings Benefits And New Burdens : All Tech Considered : NPR","title_rss":"NULL","source_domain":"npr.org","text":"DAVID GREENE, HOST:\nBody cameras have become routine in some police departments. In New Orleans, some say they've had a positive effect on law enforcement culture. But as NPR's Martin Kaste reports, they've also created new burdens.\nMARTIN KASTE, BYLINE: One place where they've really noticed the cameras' effect is the Orleans Public Defenders Office. Danny Engelberg is the chief of trials here, and he says he can plainly see how the cameras are changing the behavior of the cops.\nDANNY ENGELBERG: They can't get away with some of the practices they used to. I mean, we used to see busting into people's houses, going into people's cars, just coming up to people and searching them. And we just aren't seeing as much of that.\nKASTE: For instance, he says his office used to get a lot of dropsies. That's what he calls the cases in which a cop claims to have seen a defendant drop or toss away illegal drugs.\nENGELBERG: You know, there was really nothing you could do other than saying the police are making that up with those cases.\nKASTE: When the only record of an arrest was a written report, it was hard to verify the officer's version. But now that there's also video, Engelberg says dropsy cases are much rarer. So he's enthusiastic about the cameras, but he has to admit that, for his lawyers, they also come with a major downside.\nUNIDENTIFIED WOMAN: (Unintelligible).\nKASTE: His lawyers now have to spend hours every week watching videos. Stas Moroz is one of those young attorneys here, and he gets a lot of drug cases, which means a lot of time staring at his computer screen.\nSTAS MOROZ: It's like reality TV for police officers. Sometimes they're more entertaining than others. Sometimes they're like listening to music or chit-chatting or you can see police officers flirting with the witnesses.\nKASTE: But mostly the videos are tedious. That's because they include everything - the time it takes the cop to take statements, write reports and drive the defendants to jail. And Moroz can't afford to just fast-forward to the good stuff.\nMOROZ: Sometimes we're forced to, but that's not good practice. And I feel terrible about it because then I'll watch it the second or third go around maybe at a later stage in the case, and then I'll realize that I missed something significant.\nKASTE: He has to watch it all, he says - sometimes repeatedly - from the perspective of the cameras of each of the officers involved in an arrest. It's all hugely time-consuming, and that's especially difficult in an underfunded public defender's office, which has actually been sued by inmates who say they didn't get sufficient legal counsel. And it's not just the lawyers. Police supervisors have also now had to carve out time for watching videos.\nDANNY MURPHY: We mandate that they review any incident that results in a use of force, a misconduct complaint or any type of injury.\nKASTE: Danny Murphy is the deputy chief for compliance. He oversees the department's efforts to reform itself as part of a consent decree with the Justice Department. And he sees video supervision as a piece of that process.\nMURHPY: We also conduct random video reviews. It's great to have supervisors on scene, but there's also something special about being able to supervise through the video when the supervisor is not on scene.\nKASTE: Supervisors are supposed to watch 30 videos a month. They are allowed to skip to the good parts, but it's still a lot of time in a police department that's severely short-staffed and overburdened. The supervision via video may also be undermining officer morale. Cops feel nitpicked, says Donovan Livaccari. He's the lawyer for the local Fraternal Order of Police.\nDONOVAN LIVACCARI: It leads to a lot of Monday-morning quarterbacking, which I don't - I really don't think it's fair. You know, you're talking about somebody who's in the heat of a situation who's taking the actions that they think are best at the time versus somebody who's had the opportunity to review a video 20 times before making a judgment.\nKASTE: Still, New Orleans cops are getting pretty good about turning on the cameras when they're supposed to - nearly 100 percent of the time according to internal audits. But with that kind of compliance comes a sea of video and the realization that body cameras can do a lot of good. But they're definitely not an example of a new technology that saves people time. Martin Kaste, NPR News, New Orleans.\n(SOUNDBITE OF ST. SOUTH'S \"SLACKS\")\nCopyright © 2017 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=517930343"}
 to allow people to make their own purchase and allocation decisions, to make their own judgments about what's important and valuable to them,\" he says, adding that Comcast didn't pick $9.95 at random. \"When you look at even the lowest-income populations in America, they are making consumption decisions for lots of products in the $10-, $15-, $20-a-month category and we think that's the right way to approach this.\"\nCastro, too, doesn't see free home Internet across the board anytime soon. \"I don't see the government stepping in and fully subsidizing that right now,\" he says.\nLast year, the Obama administration requested $5 million for the ConnectHome initiative. Congress did not grant the request.","url":"https://www.npr.org/sections/alltechconsidered/2016/07/15/486161321/comcast-joins-huds-program-to-bring-discounted-internet-to-public-housing"}
