{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 21:06:39","date_modify":"2018-10-30 21:06:39","date_publish":"2015-06-10 17:14:49","description":"Former Israeli ambassador Michael Oren is set to release a new memoir June 23: Ally: My Journey Across the American-Israeli Divide. The book tells the story of Oren's four years (2009-13) as Israel's representative in Washington--and reveals just how hostile the Obama administration is towards Israel. Though he argues Obama is not anti-Israel, Oren notes that his administration did all it could to bully Israel into compliance with its hopelessly naïve new agenda in the Middle East. |","filename":"data/vaneerConsumption/AllyMichaelOrensMemoirtoExposeObamaAdministrationsAbuseofIsrael.json","image_url":"https://media.breitbart.com/media/2015/06/Michael-Oren-Tara-Todras-Associated-Press.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_10__1540933599.html","title":"'Ally': Michael Oren's Memoir to Expose Obama Administration's Abuse of Israel","title_page":"'Ally': Michael Oren's Memoir to Expose Obama Administration's Abuse of Israel | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Former Israeli ambassador Michael Oren is set to release a new memoir June 23: Ally: My Journey Across the American-Israeli Divide. The book tells the story of Oren’s four years (2009-13) as Israel’s representative in Washington–and reveals just how hostile the Obama administration is towards Israel. Though he argues Obama is not anti-Israel, Oren notes that his administration did all it could to bully Israel into compliance with its hopelessly naïve new agenda in the Middle East.\nBreitbart News was shown an uncorrected galley of the text, on the promise that we would not quote from it. Suffice to say that the Obama administration–and to a lesser extent Hillary Clinton, who was responsible for carrying out its foreign policy at the time–emerge looking ill-informed at best, thuggish at worst.\nIn one episode, State Department staffers cheer as a senior official slams Israel’s envoy. In another, Susan Rice does her best impression of a Chicago mobster, with an implied threat.\nOren is uniquely placed to chronicle the deterioration of relations between the two government–just as he was Israeli Prime Minister Benjamin Netanyahu’s best choice to limit the damage. An American Jew who became an Israeli citizen, Oren understands both countries and their cultures. A distinguished historian, he has a keen sense for detail, and his book weaves personal recollections and anecdotes into a detailed, even forensic, narrative of diplomatic disenchantment.\nOren encounters an administration stacked with left-wing professors and their students, who are attempting a perilous experiment in American foreign relations, and who treat Israel, at best, as their guinea pig. He begins to worry that many of Obama’s public gestures of support for Israel are also attempts to constrain Israel in a bear hug, preventing it from acting on its own. And he frets about an erosion of support for Israel among American Jews, urged along by left-wing J Street.\nAs a political observer, Oren’s instincts were misguided at first. He recalls his early admiration for Obama (if you thought Chris Matthews’s “tingle” and David Brooks’s “perfectly creased pant” were cringeworthy, wait until you read Oren’s description of Obama’s fingers).\nYet he soon realizes something is amiss, and belatedly turns to Obama’s memoirs to discover possible motives for Obama’s dangerous outlook (which many conservatives had warned America about for years).\nObama is now on his way out, and there is a vigorous attempt by some Democrats to rehabilitate Hillary Clinton as a pro-Israel alternative to the president. Oren’s book warns that regardless who wins in 2016, there is a cohort of staffers in Washington who were educated by sixties radicals and who took The Israel Lobby seriously as a critique of U.S. foreign policy.\nThey have a dim view of America, and an even darker view of Israel, that is impervious to the lessons of history.\nThis post has been updated.","url":"https://www.breitbart.com/politics/2015/06/10/ally-michael-orens-memoir-exposes-obama-administrations-abuse-of-israel/"}
