{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:10:17","date_modify":"2018-10-31 00:10:17","date_publish":"2016-01-06 08:00:00","description":"Lobbyists in Sacramento talk about the “inside game” and the “outside game.” The inside game is the one they play under the Capitol dome: testifying in","filename":"data/vaneerConsumption/Alobbyingruletocatchupwiththetimes.json","image_url":"https://calmatters.org/wp-content/uploads/jodiremke.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944617.html","title":"A lobbying rule to catch up with the times","title_page":"A lobbying rule to catch up with the times | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Lobbyists in Sacramento talk about the “inside game” and the “outside game.”\nThe inside game is the one they play under the Capitol dome: testifying in committee hearings, meeting with legislative staff, nabbing lawmakers in the hallway on the way to a crucial vote.\n“Other” lobbying is huge – and hard to track An excerpt from the Western States Petroleum Association’s lobbying report from the third quarter of 2015 shows the oil industry advocacy group spent more than $6 million in non-itemized “other payments to influence.”\nThe outside game is aimed at you. It tries to get ordinary Californians riled up about an issue so you’ll pressure lawmakers to do what the lobbyists want. Think of ad campaigns, noisy rallies, pleas to “call your legislator.”\nThese tactics have become a growing part of the way the biggest interest groups work to influence state officials as they adapted to the imposition of term limits in the 1990s, which changed the relationships between lobbyists and legislators.\n“It was a sense that we just didn’t have the relationships that we once did with (lawmakers),” said Jim Cassie, a longtime Sacramento lobbyist who retired in 2013. “So you had to find a way to influence them, and one way was to build a campaign. Now it’s just a way of life.”\nThe change in the lobbying game, however, hasn’t been reflected in California’s lobbying rules. Even though interest groups must file detailed reports about which lobbyists they hire, which bills they lobby on and how much they spend to entertain government officials, the growing “outside game” has gone largely unreported to the public. That’s because weak disclosure rules allow lobbying groups to report a huge amount of expenses under a catch-all “other” category that has created a cloud of secrecy around some lobbying efforts.\nNow the state’s political watchdog agency is poised to vote on a rule that would catch up with the times. It would require groups that lobby state government to publicly report who they’re paying – and how much – for publicity blitzes, consultants and other efforts to influence decisions that go beyond the narrow definition of lobbying.\n“The way they’re allowed to report now has blocked the goal behind disclosure,” said Jodi Remke, chair of the Fair Political Practices Commission, which is scheduled to vote on the rule Jan. 21.\n“The whole purpose of this is to make sure we can track whether there are improper influences over public officials. But if we don’t know who they’re paying to influence, how can we track it?”\nSpending on the vague “other” category has grown significantly among the 10 interest groups that spend the most on lobbying. In the first nine months of 2000, they attributed 46 percent of their $15.4 million in lobbying expenses to the “other” category. In 2015, that portion rose to 77 percent of the $37.7 million they spent on lobbying in the first nine months of the year.\nInterest groups can hide a lot in that “other” category. While they have to disclose the lobbyists they hire, the “other” category can include anonymous consultants, who are often well-connected former politicians.\nThey can also sponsor advertising campaigns that mask their funders. In 2014, for example, a group called the California Drivers Alliance launched a campaign asking people to sign a petition opposing the expansion of an environmental program that could raise the price of gas. One of the online videos described the group as a “coalition of small business owners, elected officials and working class families” without mentioning that it’s a project of the Western States Petroleum Association, the oil industry’s advocacy group.\nAn online link from the video did identify the affiliation between the California Drivers Alliance and the petroleum association. But that disclosure was not required, nor was any detail about the $4.8 million the group spent in “other” payments during the second half of 2014.\nMore recently, in 2015, here are some of the “outside games” played by groups that reported major spending in the “other” category:\nEnvironmental groups and the oil industry put on dueling ad campaigns as the Legislature weighed a proposal to combat climate change by slashing the amount of petroleum Californians consume.\nHospitals and health care worker unions aired television commercials and staged a massive rally in Sacramento arguing for the state to raise reimbursement for doctors who treat Medi-Cal patients.\nThe California School Board Association sought publicity on a bill to allow school districts to increase the amount of money they hold in reserves.\nThis campaign-style approach to lobbying wasn’t common in the 1970s, when Bob Stern helped write California’s Political Reform Act, the law that requires interest groups to disclose their lobbying activity. But he said he expected lobbying tactics would shift over time.\n“The big change… was the grassroots or astroturf lobbying urging citizens to contact their legislators,” Stern said.\n“It’s much more sophisticated and much more money is being spent now than 40 years ago. So it’s time to look at this…. And make sure you’re getting the information that is really important.”","url":"https://calmatters.org/articles/a-lobbying-rule-to-catch-up-with-the-times/"}
