{"authors":[],"date_download":"2018-10-30 01:11:25","date_modify":"2018-10-30 01:11:25","date_publish":"2016-08-31 00:19:32","description":null,"filename":"data/vaneerConsumption/AlongTrumpsRoadtoGreatness.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/08/Trump_at_plane_door_2015Dec16.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861885.html","title":"Along Trump’s Road to Greatness","title_page":"Along Trump’s Road to GreatnessThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Donald Trump can become one of the greatest Presidents in American history by accomplishing just a few urgent and obvious changes in law and policy that America so desperately needs. Trump h already promised to make precisely these changes, while Hillary has already promised to oppose them and do just the opposite.\nThis is the final segment of a five-part series on exactly what those urgently needed accomplishments and reforms are. Part One explained that the next President will likely appoint virtually half the Supreme Court, with the Scalia seat vacant, Justice Ginsburg age 83, Justice Kennedy age 80, and Justice Breyer age 78.\nConsequently, an urgent priority for the next President is to appoint high quality Justices who will apply the law as enacted, rather than make up the law as they would prefer it to be. Trump has already released a list of the legal minds representative of those he would choose as his Supreme Court nominees, who received high praise from Reagan conservatives, and would reliably enforce all constitutional rights.\nHillary Clinton, by sharp contrast, has already made clear that she would appoint liberal ideologues that would rule to further the liberal agenda, such as nullifying the Second Amendment. The next President will consequently determine the direction of the Supreme Court for a generation.\nPart Two discussed the urgent need for pro-growth tax reform with sharply lower rates that would establish the foundation for long overdue booming recovery, and the restoration of world leading American economic growth and broadly shared prosperity. Trump has recently proposed a new tax reform plan based on the proposal developed by Speaker Paul Ryan’s Tax Reform Task Force, led by Ways and Means Chairman Kevin Brady.\nThat plan would replace the current income tax code with just 3 rates, ranging from 12% to 33%, which would provide a tax cut for everyone, including the investment that is the foundation of new jobs and rising wages. Trump’s twist would cut the corporate tax rate from the current outdated, crippling, highest in the world to one of the lowest, at 15%. That same 15% would apply to smaller businesses, that create most of the new jobs.\nThat would add up to the major tax cut America needs to restore growth, but manageable counting the dynamic pro-growth effects, just as Reagan managed so effectively in the 1980s. But Hillary Clinton, by sharp contrast, has proposed instead yet another $1.3 trillion tax increase, that would only perpetuate America’s long-term stagnation, and ultimate decline.\nPart Three discussed the urgent need to repeal and replace Obamacare, which Trump has also already promised to do. Already available for that is the comprehensive Obamacare replacement plan developed by Speaker Ryan’s Health Reform Task Force, which now represents the House Republican Majority Obamacare replacement plan.\nThat plan is based on consumer choice of the health insurance preferred by each worker and his or her family, chosen by each in a competitive national market, rather than by the government through the individual and employer mandates (which would be repealed entirely). The incentives from market competition and innovative health insurance plans like Health Savings Accounts would deliver the reduced family health insurance costs originally promised for Obamacare, instead of the disabling cost increases Obamacare overregulation has perversely delivered.\nThose unmanageable Obamacare cost increases are driving health insurers from Obamacare altogether, and contributing to overall economic stagnation. Trump’s stated preferences for repealing Obamacare are consistent with the Ryan House Republican Majority Plan. But Hillary Clinton, by sharp contrast, would staunchly oppose any plan to repeal and replace Obamacare.\nPart Four discussed the urgent need to deregulate America’s energy producers, which now have the resources available to be the world’s number 1 producer of oil, of natural gas, and of coal, thanks to recent revolutionary technological breakthroughs. That would be an enormous breakthrough for economic recovery, jobs and rising wages.\nTrump’s America First Energy Plan is based precisely on such necessary deregulation to maximize energy production and prosperity. The resulting bounteous flow of reliable, low cost energy would promote an American manufacturing renaissance, which would be a wellspring of new high-paying jobs.\nBut Hillary Clinton, by sharp contrast, wants to take just the opposite course. She has promised to terminate all oil and natural gas production on federal lands and waterways, and drive the coal industry out of business, working towards the goal of eliminating fossil fuel production and use in America entirely. That would be another huge step towards longer term American stagnation, and ultimate decline towards the Third World for the former world leading superpower America has been.\nPresident Obama has also pursued overregulation through “executive overreach,” bypassing Congress’s legislative powers through Executive Orders not grounded in law enacted by Congress, and other means of ignoring Congress’s proper role under the Constitution. Trump has pledged to reverse those illegal Executive Orders, and other overreach.\nHillary has pledged to engage in those illegal activities even more. But if we are ever to reverse excessive anti-growth overregulation, we must restore constitutional order, and checks and balances.\nThese steps add up to an economic growth plan for long overdue booming economic recovery, and restored, world-leading, American economic growth. The sharply lower rates of tax reform would make American companies competitive again in the global marketplace, and restore incentives for the capital investment that is the foundation for new jobs and rising wages.\nInstead of capital flight fleeing America through corporate inversions and other measures, the restored incentives would promote waves of new capital flowing into the American economy from at home, and across the globe, just as happened under Reagan’s economic policies. The deregulation would slash crippling cost burdens, and liberate producers to maximize GDP, again as happened under Reagan.\nRepealing Obamacare would further reduce trillions in taxes, counterproductive regulations, and unnecessary government spending, which would create still more jobs and rising wages. That would follow Reagan’s economic growth strategy even more.\nThe result would be to stimulate the long overdue booming recovery from the 2008-2009 recession. The American historical record is the deeper the recession the stronger the recovery. Based on that metric, America should have come out of the recession in the summer of 2009 in an historic economic boom.\nBut to this day, over seven years later, that still has not happened. Instead, what we have gotten under Obama’s consistently anti-growth economic policies, the opposite of everything Reagan did, is the worst recovery from a recession since the Great Depression.\nFor Trump’s policies to finally restore the American economy to its historic, world leading, economic growth, would cement Trump’s place as one of the greatest Presidents in American history.","url":"https://spectator.org/trumps-road-to-greatness/"}
