{"authors":["Associated Press"],"date_download":"2018-10-23 00:35:38","date_modify":"2018-10-23 00:35:38","date_publish":"2017-03-10 07:24:07","description":"SEOUL, South Korea (AP) - In a nationally televised ruling watched by millions, South Korea's Constitutional Court said Friday that it was upholding the...","filename":"data/vaneerConsumption/AlookatConstitutionalCourtrulingonSKoreasleader.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/07/wire-194569-1489131262-205_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300194_A-look-Constitutional-Court-ruling-S-Koreas-leader_1540254938.html","title":"A look at Constitutional Court ruling on S.Korea's leader","title_page":"A look at Constitutional Court ruling on S.Korea's leader | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SEOUL, South Korea (AP) - In a nationally televised ruling watched by millions, South Korea's Constitutional Court said Friday that it was upholding the dismissal of impeached President Park Geun-hye because she \"gravely\" violated the law and constitution.\nMany of Park's alleged wrongdoings cited by the court as reasons for her dismissal are linked to her collusion with jailed confidante Choi Soon-sil to pressure companies to donate money to foundations they controlled and take other measures to benefit Choi.\nHere is the gist of the verdict that the court's eight-judge panel approved unanimously:\nSupporters of South Korean President Park Geun-hye are blocked by police buses as they march toward Constitutional Court after a rally opposing her impeachment in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed the impeached president from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Ahn Young-joon)\n__ Park abused her presidential post and authority for the benefits of Choi in violation of the constitution and other laws on public servants and their ethics codes.\n__ Park infringed upon the property rights of businesses and their corporate management rights.\n__ Park had a presidential adviser pass on many official documents with sensitive information to Choi in violation of a law that requires civil servants to keep official secrets.\n__ Park concealed Choi's inference in state affairs and denied and criticized speculation about Choi's actions.\n__ Park had initially promised to cooperate in an investigation, but she then refused to undergo questioning by prosecutors and let authorities search her presidential compound.\n__ Park's \"acts of violating the constitution and law are a betrayal of the public trust.\"\n__ \"The benefits of protecting the constitution that can be earned by dismissing the defendant are overwhelmingly big. Hereupon, in a unanimous decision by the court panel, we issue a verdict: We dismiss the defendant, President Park Geun-hye.\"\nA supporter of South Korean President Park Geun-hye holds up her portrait during a rally opposing her impeachment in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed the impeached president from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Ahn Young-joon)","url":"https://www.dailymail.co.uk/wires/ap/article-4300194/A-look-Constitutional-Court-ruling-S-Koreas-leader.html"}
