{"authors":["Associated Press"],"date_download":"2018-10-23 02:42:20","date_modify":"2018-10-23 02:42:20","date_publish":"2016-01-11 15:14:09","description":"LONDON (AP) — As Spain's Princess Cristina goes on trial on tax fraud charges alongside her Olympic handball champion husband, here is a look at some other E...","filename":"data/vaneerConsumption/AlookatEuropeanroyalswhohavebeencaughtupinscandal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:507f32fc76f94fb29d367fe9bb7e6da9-3WAQP5SaQH704788ebcf7e00af9c-433_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3392656_A-look-European-royals-caught-scandal_1540262540.html","title":"A look at European royals who have been caught up in scandal","title_page":"A look at European royals who have been caught up in scandal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A look at European royals who have been caught up in scandal\nLONDON (AP) — As Spain's Princess Cristina goes on trial on tax fraud charges alongside her Olympic handball champion husband, here is a look at some other European royals who have been caught up in controversy or claims of wrongdoing.\nPRINCE ERNST AUGUST OF HANOVER\nPrince Ernst August, the husband of Princess Caroline of Monaco and the patriarch of one of Europe's oldest ruling families, has had more than one run-in with the law. In 2004, he was convicted of beating up a hotel owner, and in 1999 he was fined for attacking a photographer.\nFILE- In this Wednesday, June 6, 2012 file photo, Britain's Prince Andrew leaves King Edward VII hospital in London after visiting his father Prince Philip. Britain¿s Prince Andrew, Queen Elizabeth II¿s second son, has for years been troubled by reports of his extravagant lifestyle and his friendship with several controversial figures, notably U.S. financier Jeffrey Epstein, a registered sex offender. Andrew stepped down from his role as a trade envoy in 2011 as questions mounted. (AP Photo/Sang Tan, File)\nIn 2000, a tabloid published a photograph allegedly showing the prince urinating on the Turkish Pavilion at the Expo 2000 fair in Hanover. The incident sparked a diplomatic tussle, with the Turkish Embassy in Berlin reportedly accusing the prince of \"insulting the Turkish people.\"\n___\nPRINCE ANDREW OF BRITAIN\nBritain's Prince Andrew, Queen Elizabeth II's second son, has for years been troubled by reports of his extravagant lifestyle and his friendship with several controversial figures, notably U.S. financier Jeffrey Epstein, a registered sex offender. Andrew stepped down from his role as a trade envoy in 2011 as questions mounted.\nIn 2015, Buckingham Palace had to publicly deny claims made in documents filed for a U.S. court case against Epstein that Andrew had sex with an underage woman on three occasions. While Andrew was named in the papers, he was never sued or charged and a judge later ordered the sensational allegations against him to be removed from the court record.\n___\nSARAH FERGUSON\nAndrew's former wife, the Duchess of York, is known for a long string of embarrassing misjudgments. In 2010 she was filmed apparently offering to sell access to Andrew for 500,000 pounds ($725,000) to an undercover tabloid reporter posing as a foreign businessman.\nFerguson, known as \"Fergie,\" said she suffered from financial hardship and apologized for what she called a serious lapse of judgment.\n___\nKING CARL XVI GUSTAF OF SWEDEN\nSwedish King Carl XVI Gustaf, who came to the throne in 1973, was plagued by claims in a 2010 book alleging he visited seedy strip clubs during foreign visits and had an extramarital affair with a Swedish singer in the 1990s. While critics said the allegations were poorly sourced, they nonetheless sparked a furious media reaction, with one leading newspaper urging the king to step down.\nThe king's initial rambling reaction didn't include any denial of the allegations, which was seen by many as a partial admission. The situation was aggravated by allegations that one of the king's friends had been in contact with a reputed gangland figure, who was a key source of the book, in an attempt to silence him with bribes.\n___\nPRINCESS METTE-MARIT OF NORWAY\nMette-Marit Tjessem Hoiby attracted widespread attention for her turbulent past when she married Norwegian Crown Prince Haakon in 2001. A one-time waitress, Hoiby had a son with a man who was reportedly sentenced to prison for cocaine possession. Local media also reported that she had attended parties where illegal drugs were used.\nAt a news conference before the wedding, Hoiby admitted to moving in circles where narcotics were common and apologized for her \"wild youth.\"\nFILE - In this Wednesday, May 26, 2010 file photo, Sarah Ferguson, Duchess of York, speaks at the Book Expo America in New York. Prince Andrew¿s former wife, the Duchess of York, is known for a long string of embarrassing misjudgments. In 2010 she was filmed apparently offering to sell access to Andrew for 500,000 pounds (£726,000) to an undercover tabloid reporter posing as a foreign businessman. (AP Photo/Seth Wenig, File)\nFILE - In this Wednesday, Oct. 7, 2015 file photo, Sweden's King Carl XVI Gustaf arrives for a welcome ceremony at the Presidential palace, in Vilnius, Lithuania. Sweden¿s King Carl XVI Gustaf, who came to the throne in 1973, was plagued by claims in a 2010 book alleging he visited seedy strip clubs during foreign visits and had an extra-marital affair with a Swedish singer in the 1990s. While critics said the allegations were poorly sourced, they nonetheless sparked a furious media reaction, with one leading newspaper urging the king to step down. (AP Photo/Mindaugas Kulbis, File)","url":"https://www.dailymail.co.uk/wires/ap/article-3392656/A-look-European-royals-caught-scandal.html"}
