{"authors":["Associated Press"],"date_download":"2018-10-22 23:00:37","date_modify":"2018-10-22 23:00:37","date_publish":"2017-03-16 05:29:15","description":"KANSAS CITY, Mo. (AP) - A look at the civil trial over the U.S. Army Corps' stewardship of the Missouri River and landowner claims that the agency's...","filename":"data/vaneerConsumption/AlookatatrialoverMissouriRiverflooding.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318914_A-look-trial-Missouri-River-flooding_1540249237.html","title":"A look at a trial over Missouri River flooding","title_page":"A look at a trial over Missouri River flooding | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"KANSAS CITY, Mo. (AP) - A look at the civil trial over the U.S. Army Corps' stewardship of the Missouri River and landowner claims that the agency's decisions have contributed to devastating floods.\nWHAT'S ALLEGED: Several hundred landowners named in the class-action lawsuit filed in 2014 allege in the U.S. Court of Federal Claims that the Army Corps has deemphasized flood control along the Missouri and put more emphasis on habitat restoration, leading to more flooding. The plaintiffs also insist the Corps unconstitutionally deprived them of their land, essentially taking it without compensation.\nTHE CORPS' STANCE: The federal government argues in court filings that authorities never promised to stop all flooding along the 2,341-mile-long Missouri, and that the Corps' providing habitat for endangered species didn't exacerbate the inundation six years ago. Officials have said the Corps balances flood control and an array of other potential uses of the river, including shipping, recreation and hydropower.\nTHE TRIAL: The trial began March 6 in Kansas City, Missouri, and will shift in late April to Washington, D.C., with no decision expected at least until summer, at the earliest.\nTHE JUDGE: The presiding judge - Nancy Firestone, a former federal prosecutor appointed to the claims court in 1998 - served in the late 1990s as a deputy assistant attorney general in the U.S. Department of Justice's environment and natural resources division after holding top positions in the Environmental Protection Agency, including as a judge of its environmental appeals board. She has Missouri connections, having gotten a bachelor's degree from St. Louis' Washington University and a law degree from the University of Missouri at Kansas City.","url":"https://www.dailymail.co.uk/wires/ap/article-4318914/A-look-trial-Missouri-River-flooding.html"}
