{"authors":[],"date_download":"2018-10-22 21:36:07","date_modify":"2018-10-22 21:36:07","date_publish":"2017-04-11 00:00:00","description":"George Hobica, editor-in-chief and founder of airfarewatchdog.com, says involuntary bumps aren't that common.","filename":"data/vaneerConsumption/ALookAtPassengerRightsAfterAirlinesViolentInvoluntaryBumpNPR.json","image_url":"https://media.npr.org/assets/img/2017/04/11/ap_954818491933_wide-4758c3cba88697b17880c4b5ad2153fdcac925c7.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=523450890_1540244167.html","title":"A Look At Passenger Rights After Airline's Violent 'Involuntary Bump' : NPR","title_page":"A Look At Passenger Rights After Airline's Violent 'Involuntary Bump' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ARI SHAPIRO, HOST:\nWe're going to take a closer look now at what rights passengers have when an airline needs a seat. We're joined now by George Hobica, founder of airfarewatchdog.com. Hi there.\nGEORGE HOBICA: Hi, Ari.\nSHAPIRO: How frequently do passengers get bumped from flights without volunteering?\nHOBICA: Well, fortunately involuntary bumping doesn't happen all that often. I think United only involuntarily bumped 3,000 or 4,000 passengers last year. Many hundreds of thousands of passengers accepted voluntary bumping vouchers, however.\nSHAPIRO: And what kind of compensation are passengers entitled to get when they're removed from a flight?\nHOBICA: For an involuntary bump, the maximum compensation - and it has to be paid in cash according to the DOT - is $1,350.\nSHAPIRO: DOT - the Department of Transportation.\nHOBICA: Yes. It's less depending on certain circumstances. In some cases, you're not even entitled to anything if they can get you to your destination close to the scheduled arrival time.\nSHAPIRO: You say that airlines are required to give cash. I've heard airlines offer vouchers. What explains that?\nHOBICA: Airlines do offer vouchers sometimes for involuntary bumps, but they have been fined by the DOT for doing so. For voluntary bumps, however, they are allowed to give vouchers. And the problem with vouchers is that they expire within one year. And most passengers only fly once a year, and they're ending up with these worthless vouchers.\nSHAPIRO: When somebody who doesn't want to give up their seat is chosen, how do airlines make that decision of who's going to be picked?\nHOBICA: I think every airline has a different set of criteria for picking who they are going to bump. It's usually never the first-class passenger. It's never the passenger with ultra-high status in the frequent flyer program. It's usually the passenger who buys their ticket at a cheap fare or who has no status in the program or who checks in at the last minute or sometimes who buys his ticket at the last minute.\nSHAPIRO: So being involuntarily bumped from a flight is one thing. Being physically forcibly removed from a flight against your will as was shown in this video seems like something else. What is an airline entitled to do there, and what are passengers' rights?\nHOBICA: Well, airlines are entitled to remove people from planes. They do it all the time - if you are improperly dressed, for example, if you're belligerent, if you're drunk. They say it in their contracts of carriage that basically we can deny service to anyone. It's like some restaurants have those signs; you know, we can deny service to anyone. Well, the airlines have that in their contract of carriage. Unfortunately the passengers' rights are not ironclad except what you'll see in the DOT website under the Fly Rights pages on that website. They're very limited.\nSHAPIRO: You refer to the contract. I don't think most people realize they're signing a contract every time they purchase an airplane ticket.\nHOBICA: You know, they're not exactly signing a contract, but by purchasing the ticket, they are agreeing to the terms of the contract. And anyone can google the term United Airlines contract of carriage or Delta contract of carriage, and you'll see what you're actually getting into. And there isn't a lot there. One thing that if they cancel your flight or if it's severely delayed, they will give you your money back even on a nonrefundable ticket.\nBut other than things like that, there are very few protections. If you travel to Europe or on a European airline, however, you have a different set of protections that the EU enforces. And actually they're much better than the protections we have in the United States.\nSHAPIRO: I actually found that to be true when I lived in London - that a flight was delayed, and I got cash back.\nHOBICA: You know, I always advise people, if you're flying anywhere - it doesn't have to be to Europe - fly on a European airline because if it's on Virgin Atlantic, for example, even if you buy the ticket on Delta, you actually have a set of protections under the EU rules that you would not have if you bought the ticket on Delta.\nSHAPIRO: That's George Hobica, founder of airfarewatchdog.com. Thanks a lot.\nHOBICA: Thank you, Ari.\n(SOUNDBITE OF SYNDICATE SOUND LABS SONG, \"NOBODY'S PERFECT\")\nCopyright © 2017 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=523450890"}
