{"authors":[],"date_download":"2018-10-30 18:00:11","date_modify":"2018-10-30 18:00:11","date_publish":"2018-09-10 23:17:00","description":"The Peach State may have a small coastline compared to its southeastern Atlantic Ocean-bordering neighbors but hurricanes have left their mark on Georgia throughout history.","filename":"data/vaneerConsumption/AlookatsomeofGeorgiasworsthurricanes.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/08/25/Images/davidpage.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_look-some-georgia-worst-hurricanes__1540922411.html","title":"A look at some of Georgia’s worst hurricanes","title_page":"What are some of Georgia's worst hurricanes?","title_rss":"NULL","source_domain":"ajc.com","text":"Georgia may not be Hurricane Florence’s main target, but as the monster storm nears the Atlantic coast the Peach State is preparing itself. According to Channel 2, Florence could reach the Southeast coast by Friday morning. On Monday, the National Hurricane Center classified the storm as a Category 4 hurricane with 130-mph winds. The latest projection has Florence making landfall along the coast of the Carolinas, slightly north of Georgia’s coast.\nAlthough Georgia’s 2,344 miles of coastline pales in comparison to many of her neighbors bordering the Atlantic Ocean, the state has seen its share of deadly hurricanes. While far from a complete list, here are some of the worst storms to impact Georgia since 1851. (Note: Hurricane naming didn’t begin until 1953.)\n1893 -- The “Sea Islands” hurricane\nThis Category 3 storm struck near Savannah on August 27, 1893, leaving around 1,000-2,000 people dead in its wake. Reports put winds around 120 m.p.h. during windfall. Total damage to Georgia and South Carolina, which was also hit, came to around $1 million.\n1896 -- The “Cedar Keys” hurricane\nFlorida suffered most when this Category 3 storm made landfall, but southeastern Georgia, Savannah and the Sea Islands were all severely impacted by high winds and heavy rain. 37 Georgians were killed.\n\"Cats, rats and rattlesnakes\" took refuge in a tree with one family that survived the great \"Georgia\" hurricane of 1898. (AJC Newspaper Archives)\n1898 -- The “Georgia” hurricane\nThe strongest hurricane on record in the state’s history made landfall on Cumberland Island October 2, killing at least 179. Damage was estimated at $1.5 million with Brunswick taking the brunt of the Category 4 storm’s impact, a 16-foot storm surge devastating the coastal city.\n1979 -- Hurricane David\nDavid hit Georgia on Sept. 4, bringing with it heavy surf and high winds. Savannah escaped major damage, but David’s storm surge was responsible for two deaths. At its peak, David was a Category 5 storm.\n>> AJC FLASHBACK PHOTOS: See how we covered Hurricane David back in 1979\n1990 -- Tropical Storm Marco\nEastern Georgia saw heavy rainfall as Marco moved through the region Oct. 12, forcing the evacuation of around 300 people in Augusta. The Savannah River city suffered mightily as Marco’s remnants moved through. Flooding left 450 homeless and five people drowned. Damage totaled $42 million in Georgia.\n1994 -- Tropical Storm Alberto\nStalling out over Georgia from July 5-8, Alberto resulted in flooding across the majority of the state, including south, central and north Georgia. The flooding is considered Georgia’s worst in history. 31 people died and around 471,000 acres of cropland were destroyed. Agricultural damage was estimated at $100 million and total damage from Alberto came to $750 million.\n1995 -- Hurricane Opal\nOn Oct. 4-5, West Georgia and the metro Atlanta area were hammered by rains and wind from Opal, downing over 4,000 trees in the Atlanta city limits and causing numerous power outages throughout the metro area. In extreme northeastern Georgia, Rabun County suffered $5 million in damage. 10 people were killed.\n2005 -- Hurricane Dennis\nDennis’ effects were felt throughout a wide swath of Georgia July 9-10, its rain bands flooding numerous counties in the state’s interior, including outer metro Atlanta areas. Douglas County recorded 10 inches of rainfall, which flooded several roads and destroyed a number of homes. Two people died and damage reached $24 million.\n2017 -- Hurricane Irma\nAs Irma headed north, Governor Nathan Deal ordered mandatory evacuations for all areas east of Interstate 95 on Sept. 6 and Atlanta found itself placed under its first-ever tropical storm warning. A total of 540,000 people on the Georgia coast were ordered to leave the area. Three people died in Georgia.\nSources: NOAA, Channel 2 WSB-TV, Weather Underground, ourgeorgiahistory.com\nVIDEO: More on Hurricane Florence","url":"https://www.ajc.com/news/local/look-some-georgia-worst-hurricanes/gheunOFELGoVeCWNe8fP7H/"}
