{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 21:19:16","date_modify":"2018-10-30 21:19:16","date_publish":"2018-09-12 17:40:56","description":"A long-awaited East Atlanta restaurant is opening its doors next week.","filename":"data/vaneerConsumption/AlookatthemenuforBansheeinEastAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/09/12/Images/banshee24.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_ch_17bdcedaeb98bd6799fb7a77ba06ca35__1540934356.html","title":"A look at the menu for Banshee in East Atlanta","title_page":"A look at the menu for Banshee in East Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"A long-awaited East Atlanta restaurant is opening its doors next week.\nBanshee, which will open for dinner Sept. 18, is from a team of former employees of Ford Fry restaurants and Wrecking Bar, including partner and general manager Peter Chvala, partner and executive chef Nolan Wynn and partner/bar managers Katie McDonald and Faielle Stocco.\nThe Paces Property restaurant will feature a 27-foot bar, as well as 1,000 square feet of outdoor patio space behind the eatery.\nBanshee’s dinner menu includes dishes such as butternut squash ravioli, pork tenderloin and pork cheek skewers, while brunch includes breakfast carbonara and omelet on a bagel from Emerald City Bagel down the street from the restaurant.\nThe cocktail list features drinks including Poppertunities, sparkling wine with either an Aperol and Grapefruit Popiscle or a St.Germain and Pineapple juice Popsicle; Gloria!, made with Pisco, Plum and Sage Shrub, Italicus and Sage; and Stately Hag made with Tequila, Strega, Cocchi Americano and Lemon.\nBanshee will be open from 5 p.m.-midnight Tuesday-Thursday; 5 p.m.-2 a.m. Friday-Saturday; and 11 a.m.-5 p.m. Sunday.\n﻿Scroll down to get a look at the menu at Banshee:\nThe dinner menu for Banshee\nBrunch menu at Banshee\nRELATED:\nMore intown Atlanta dining news\nMore new metro Atlanta restaurants\nGet a taste of the new fusion revolution with the 2018 AJC Spring Dining Guide: Global Mashup\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/check-out-the-menu-for-banshee-opening-next-week-east-atlanta/uK3GdUsxsN4AbjOQ4FIb8H/"}
