{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 23:21:40","date_modify":"2018-10-30 23:21:40","date_publish":"2018-06-20 16:17:36","description":"California’s legislature is on the cusp of approving a new plan for responding to — and trying to prevent — sexual harassment in its own ranks.","filename":"data/vaneerConsumption/AlookatthenewplantodetersexualharassmentinCaliforniasCapitol.json","image_url":"https://calmatters.org/wp-content/uploads/StateofState_011.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540941700.html","title":"A look at the new plan to deter sexual harassment in California's Capitol","title_page":"A look at the new plan to deter sexual harassment in California's Capitol","title_rss":"NULL","source_domain":"calmatters.org","text":"California’s legislature is on the cusp of approving a new plan for responding to—and trying to prevent—sexual harassment in its own ranks.\nIt takes many steps that are unusual for an institution whose internal workings have long been shrouded in secrecy and riven by rivalries between its two chambers. The policy unifies procedures for the Assembly and the Senate, creates a new unit with investigators trained in examining harassment claims, and establishes a panel of experts—such as employment lawyers and retired judges—to recommend punishment after investigations are complete. It also says the Legislature will make certain records public after a lawmaker or high-level staff member is found to have engaged in misconduct.\nBut the policy is remarkable also for what it doesn’t do.\nIt doesn’t recommend changing state law to require that documents about the Legislature’s harassment inquiries or findings be made public, instead leaving the practice up to the whims of future politicians who could opt to shield them. The investigative unit it creates isn’t as independent as some lawmakers have portrayed—it will report to the Legislature’s attorney, who is basically hired by lawmakers themselves.\nAnd the investigative procedure it lays out doesn’t cede legislative leaders’ ultimate authority over whether and how to punish wrongdoing.\n“When peers are policing peers, or lawmakers are policing lawmakers, that’s where we’ve seen conflicts of interest and cover-ups in the past,” said Pamela Lopez, a lobbyist who filed a complaint last year accusing then-Assemblyman Matt Dababneh of trapping her in a bathroom and making her watch him masturbate.\nShe praised the plan as a serious effort to improve conditions in the statehouse, but said she would “like to know more about (how) there would be transparency.”\nDababneh, a San Fernando Valley Democrat, denied the allegation but resigned shortly after Lopez went public with her story. It was one of a series of jarring allegations that emerged after hundreds of women in the fall signed an open letter saying the California Capitol is rife with harassment. Victims described being groped and propositioned, the Legislature launched numerous investigations and three lawmakers so far have resigned.\nIn the ensuing months, a panel of legislators has been crafting the plan to prevent and respond to harassment claims. They held several public hearings, consulted employment experts, surveyed employees and aired internal problems, such as inconsistent record-keeping.\nThe result is the new policy that will likely be approved next week by the Legislature’s joint rules committee. The lawmakers who drafted it call it an “aspirational policy” meant to push the Legislature toward a serious culture change.\n“With all the changes we are making across the spectrum of our policies, every single one is done with an eye toward culture change and making this a place of respect,” said Assemblywoman Laura Friedman, a Glendale Democrat who led the crafting.\nIt calls for an engaging new employee-training program that emphasizes the prohibition on retaliating against people who file complaints, asks employees to report the first instance of bad behavior so that managers can intervene early, and insists that complaints by investigated promptly. The new unit of investigators will collect documents and interview witnesses, and then turn the evidence over to the panel of experts to decide whether to substantiate a complaint and make a recommendation about punishment.\nAt that point, the politicians take over. The panel’s findings would be given to the leaders of the Senate or Assembly, who get to determine whether to impose the recommended discipline. This is the step that makes some victims and their advocates a little nervous.\n“People are looking for something that makes them feel secure in this process, that makes them feel like it has teeth and that it will be fair and equitable,” said Samantha Corbin, a lobbyist who organized the open letter this fall and launched an anti-harassment effort called We Said Enough.\n“They just don’t have that comfort yet.”\nHow much information becomes public is a sticking point. Friedman said the panel’s findings will be made public in any case where a legislator or high-ranking staff member is found to have violated the sexual harassment policy. But the type of discipline the panel recommends will not be publicly disclosed, she said.\nThe process provides more disclosure than the Legislature has practiced in the past—but it falls short of the disclosure lawmakers require of other branches of government.\nThe Legislature exempted itself decades ago from the law that requires state agencies and local governments to disclose information about misconduct investigations substantiated against high-level officials. Instead, it passed a different law governing the release of legislative records which is very limited and does not require releasing documents about misconduct investigations—even in substantiated cases.\nUnder pressure from reporters and a global movement to stop sexual harassment, legislative leaders began this year to release some records. But they rejected an attempt to change the law to require that such records be made public.\nBy using an in-house employment policy, legislative leaders can “make the rules now, they can change them in a month, they can change them in a year,” said Assemblyman Mark Stone, whose committee proposed the bill requiring public disclosure of the Legislature’s misconduct investigations.\nThe bill never got a hearing.\nStone said he hasn’t decided if he will bring the proposal back next year. Friedman said she hopes her colleagues won’t push for more aggressive legal changes, noting “we went through a very public process to get to this place.”","url":"https://calmatters.org/articles/what-the-new-plan-to-deter-capitol-sexual-harassment-really-addresses-and-avoids/"}
