{"authors":["Associated Press"],"date_download":"2018-10-22 20:42:41","date_modify":"2018-10-22 20:42:41","date_publish":"2016-01-28 02:53:54","description":"SANTA ANA, Calif. (AP) — A manhunt is continuing for three inmates who escaped from a jail in California last week by cutting through a grate, climbing throu...","filename":"data/vaneerConsumption/Alookattheescapeof3inmatesfromajailinCalifornia.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3419845_A-look-escape-3-inmates-jail-California_1540240961.html","title":"A look at the escape of 3 inmates from a jail in California","title_page":"A look at the escape of 3 inmates from a jail in California | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A look at the escape of 3 inmates from a jail in California\nSANTA ANA, Calif. (AP) — A manhunt is continuing for three inmates who escaped from a jail in California last week by cutting through a grate, climbing through plumbing tunnels and rappelling to the ground from the roof.\nHere's a look at the inmates and what happened at the Orange County jail:\nWHO ARE THE INMATES?\nHossein Nayeri, 37, Bac Duong, 43, and Jonathan Tieu, 20, were all awaiting trial on separate violent crimes.\nNayeri, who officials suspect was the mastermind of the escape based on his sophistication and history, is charged with kidnapping and torture in a 2012 attack on a marijuana dispensary owner to learn where he might have buried large sums of money.\nNayeri fled to Iran and was arrested by authorities in Prague on his way to visit family.\nDuong is charged with attempted murder in the November shooting of a man in Santa Ana. He has done several stints in federal prison for burglary and drug charges and is the subject of a 1998 deportation order that authorities have not carried out because Vietnam has not provided the required paperwork to take him back.\nTieu is charged with murder, attempted murder and other crimes in a 2011 gang shooting outside a pool hall in Garden Grove. He was 15 at the time of the shooting and was transferred to the men's jail when he turned 18.\nHOW DID THEY ESCAPE?\nSheriff's authorities say the inmates cut through a quarter-inch-thick grill on a dormitory wall in the Central Men's Jail in Santa Ana and got into plumbing tunnels before sawing through half-inch-thick steel bars.\nThat cutting required powerful tools that the men would not have had access to without some kind of help, and could not have been done with something made on the inside, officials said.\nThe men made their way behind walls to an unguarded area of a roof atop the four-story jail building, moved aside razor wire and rappelled to the ground using bed linen, authorities said.\nThe roof at the jail is commonly used for outdoor recreation. It was involved in prior escapes from the facility, which was built in 1968, said Lt. Jeff Hallock, a sheriff's department spokesman.\nDID THEY GET HELP?\nSheriff's officials say they strongly believe the men had help — that the sophisticated and physically difficult escape could not have occurred without it. Five people outside the jail were arrested Wednesday in the investigation of the escape, but it's not clear what role any may have played in the jailbreak.\nThere's not yet any indication that they had help inside the jail.\nTo carry out such an elaborate escape, the men likely were given blueprints or told how the bowels of the jail were laid out, said Kevin Tamez, a managing partner for MPM Group, a firm that consults on prison security, management and infrastructure.\nIt's unclear how jail officials didn't detect anything inside the dorm where the men were housed with about 60 other inmates. Hallock said the jail's policy is to do walk-throughs every hour, and more involved searches are done at random.\nHOW LONG HAVE THEY BEEN GONE?\nAuthorities said the men were last seen at a 5 a.m. head count on Friday. They were determined to be missing roughly 16 hours later at an evening head count.\nIn addition to those two counts, jail personnel check the number of inmates against jail records at three other points during the day, Hallock said. He said investigators have detected some problems with how counts were conducted in this instance.\nWHERE MIGHT THEY BE?\nSheriff's authorities said they believe at least two of the men, Tieu and Duong, may be hiding among Orange County's sizable Vietnamese community because of the men's ties to gangs. Officials have reached out for help from the Vietnamese community, among the nation's largest.","url":"https://www.dailymail.co.uk/wires/ap/article-3419845/A-look-escape-3-inmates-jail-California.html"}
