{"authors":[],"date_download":"2018-10-30 17:50:07","date_modify":"2018-10-30 17:50:07","date_publish":"2018-10-30 17:33:00","description":"Washington running back Adrian Peterson, a future Pro Football Hall of Famer, has the Falcons’...","filename":"data/vaneerConsumption/AlookaheadattheWashingtonRedskins.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/USAT_Sports/2018/08/24/Images/1090360002_fa364eea-eea1-4411-a9df-5d375a78943d-USATSI_11124138.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_look-ahead-the-washington-redskins__1540921807.html","title":"A look ahead at the Washington Redskins","title_page":"A look ahead at the Washington Redskins ","title_rss":"NULL","source_domain":"ajc.com","text":"Washington running back Adrian Peterson, a future Pro Football Hall of Famer, has the Falcons’ full attention this week.\nThe Falcons (3-4) return from their bye week and put their two-game winning streak on the line against the Redskins (5-2) at 1 p.m. Sunday at FedEx Field in Landover, Md.\nThe Redskins, who have a three-game winning streak, signed the 33-year old Peterson after expected starter Derrius Guice suffered a torn ACL in the exhibition season and backups Samaje Perine and Byron Marshall suffered leg injuries in the second game.\nPeterson has carried the offense and is averaging 4.6 yards per carry. He reached over 20 miles per hour on his 64-yard touchdown run last week flashing the speed of a youngster.\n“It doesn’t surprise me, but it’s impressive nonetheless,” Falcons coach Dan Quinn said.\nAfter 10 years, 11,747 yards and 97 rushing touchdowns with the Vikings, Peterson was not ready to retire. He had mixed results last season while playing for the Saints and Cardinals.\nHe was looking to play, but couldn’t find a team until the Redskins called and signed him for the veteran minimum.\nThe seven-time Pro Bowler is having a revival in the nation’s capital.\nPeterson rushed for 149 yards last week in the 20-13 win over the Giants on Sunday. He’s rushed for more than 97 yards in each of the past three games.\n“He’s still got a lot in the tank,” Falcons defensive end Vic Beasley said. “He’s definitely strong.”\nPeterson showed that he still has some speed on that long run against the Giants.\n“I think when you watch him play, you see his ability to jump-cut,” Quinn said. “We all see how big he is and how strong he is, but I think what makes him unique is, at that size where he can go full speed, jump cut to extend the plays.”\nThe Falcons’ run defense is ranked 13th in league and is giving up 112.7 yards per game.\n“I know exactly who Adrian is and how tough it can be playing against him,” Quinn said. “For us, tackling (will be key). Our leverage and our pursuit, those are the things that we are really looking to improve.”\nThe Falcons held Giants rookie running back Saquon Barkley to 43 yards on 14 carries in their last outing. Quinn contends that the communication on the defense has improved as he hears players talking more often and shouting out alerts and formations.\n“That’s music to my ears, that’s for sure,” Quinn said.\nThe Falcons are also concerned with quarterback Alex Smith. Smith has completed 144 of 228 passes (63.2 percent) for 1,561 yards, eight touchdowns and two interceptions. He has a passer rating of 91.3.\nQuinn respects Smith’s ability to extend plays.\n“He has the ability to be really accurate on the run,” Quinn said. “When the first play ends, he can really create and go. He’s an excellent competitor. For a long time, he’s been able to beat people with his arm and with his feet. He’s been in a bunch of systems. Plenty of experience. It’s a tough matchup.”\nThe Redskins have rebuilt their defense around rookie tackle Da’Ron Payne and second-year tackle Jonathan Allen. Payne was selected with the 13th overall pick in 2018 and Allen with the 17th overall pick in 2017. Also, defensive tackle Matt Ioannidis is playing well.\n“I was impressed with the stoutness of their inside three guys,” Quinn said. “Jonathan, I thought coming out, not only had the speed to play tackle, but he had the speed to play defensive end. He was that type of player. He certainly is somebody inside that you have to account for.”\nFormer Tampa Bay Buc Mason Foster is the Redskins middle linebacker. He has 64 tackles and three tackles for a loss.","url":"https://www.ajc.com/sports/football/look-ahead-the-washington-redskins/3wbw2YyxddMig7t0GqRsXM/"}
