{"authors":["Becky Freeth For Mailonline"],"date_download":"2018-10-23 04:14:12","date_modify":"2018-10-23 04:14:12","date_publish":"2017-04-26 15:57:12","description":"Seen planting a kiss on his 38-year-old girlfriend Lucila Sola off the Gulf Of Mexico, the Godfather actor seemed to be enjoying one of the best birthdays yet on Tuesday afternoon.","filename":"data/vaneerConsumption/AlPacinokissesLucilaSolainMexico.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3FA0388F00000578-0-image-a-106_1493217252454.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4448118_Al-Pacino-77-kisses-Lucila-Sola-38-Mexico_1540268052.html","title":"Al Pacino kisses Lucila Sola in Mexico","title_page":"Al Pacino kisses Lucila Sola in Mexico | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's helped him ring in seven birthdays - but Al Pacino's 77th looked especially blissful.\nSeen planting a kiss on his 38-year-old girlfriend Lucila Sola off the Gulf Of Mexico, the Godfather actor seemed to be enjoying one of the best birthdays yet.\nLatina lovely Lucila, 39 years his junior, was the picture of youth beside him in a white bikini that featured a cheeky thong cut from behind.\nScroll down for video\nKisses: Al Pacino, 77, and his girlfriend Lucila Sola, 38, were seen celebrating his birthday in Tulum, Mexico on Tuesday\nWhile she topped up her golden tan, he was more cautious about the sun in a full T-shirt and shorts outfit that he wore into the sea without a second thought.\nHer white bikini, which featured a scalloped edge and a halterneck top, served to showcase her perfect figure, and she shaded herself with a stylish beach hat.\nLater, as they enjoyed a romantic stroll on the sands, Lucila cloaked her figure in an elegant white cover up and opportunist Al leaned in for another kiss.\nCute twosome: Al and Lucila have been dating for around seven years - though he has never married\nHappy holidays: The duo were seen enjoying a romantic walk along the sands during their stay\nAl and his younger girlfriend have been in a happy relationship for almost a decade now.\nIn 2015, it was reported that a 'series of rows' had prompted the duo to go their separate ways, though representatives never confirmed the source's claims.\nThey were last seen together in July 2016 when they stepped out for dinner at Nobu restaurant in Malibu.\nThe Scarface star has never been married, but he shares custody of his 17-year-old twins Anton James and Olivia Rose with ex-partner Beverly D’Angelo.\nCute twosome: Al and Lucila (here in 2014) were reported to have split in 2015 but the claims were never confirmed\n'Never say never': Al said marriage with Lucila (here together in 2011) is entirely 'possible'\nAl also has a 27-year-old daughter, Julie Marie, with his ex and acting coach Jan Tarrant.\nThe actor previously said that having children changed his perspective on life, turning his focus off the big screen and onto real life.\n'Before I had my three, I’d walk around in my own head, not noticing anything.\n'Acting used to be everything; now, because of them, it’s just a small part,' he told The Guardian in 2015.\nFlashback: Al is famous for his roles in The Godfather and Scarface (pictured, with Michelle Pfeiffer)\nOn the subject of marriage with Lucila, Al last year admitted that he would 'never say never,' concluding, 'It's possible.'\nLucila is an Argentina actress, who has made cameos in Modern Family and TV series Bones.\nShe was previously married to actor Maximo Morrone, with whom she had two children Camila and Maximo Jr during their nine-year marriage, which ended in 2006.\nNow aged 18 and standing at 5ft 9in, Camila has gone on to carve out a career in modelling.\nCamila was featured on the Vogue US website last year as an 'Instagram breakout star' after becoming the latest Victoria’s Secret Pink recruit.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4448118/Al-Pacino-77-kisses-Lucila-Sola-38-Mexico.html"}
