{"authors":["Chris Kitching For Mailonline"],"date_download":"2018-10-23 03:23:24","date_modify":"2018-10-23 03:23:24","date_publish":"2016-01-11 16:00:27","description":"Footage that has gone viral on the internet shows the unfortunate duo caught in an icy blast at a ski resort in the Damuls-Mellau region of Austria.","filename":"data/vaneerConsumption/Alpsskierscaughtinblastfromsnowcannonafterchairliftstoppedinvideo.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/19/300CEAC900000578-0-image-a-3_1452541283421.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3394017_Alps-skiers-caught-blast-snow-cannon-chairlift-stopped_1540265004.html","title":"Alps skiers caught in blast from snow cannon after chairlift stopped in video","title_page":"Alps skiers caught in blast from snow cannon after chairlift stopped in video | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Two skiers became stranded in the worst possible spot when a chairlift came to a sudden halt at ski resort in the Alps.\nThis video shot by a fellow skier captured the moment the pair was caught in a man-made storm caused by a snow cannon.\nFootage that has gone viral on the internet shows the unfortunate duo, who had no escape, being blasted at a resort in the Austrian province of Vorarlberg.\nThe unfortunate duo had no escape while being blasted at a resort in the Austrian province of Vorarlberg\nThe video was shot in the Damuls-Mellau ski region, where the tourists were travelling on a two-seater chairlift up the mountain to get back on the slopes.\nUnfortunately for them, the lift stopped temporarily right next to the snow cannon.\nEyewitnesses speaking in German can be heard saying that they cannot believe what they are seeing as the hapless skiers unsuccessfully try to move out of the way of the man-made blizzard.\nOne witness shouted: ‘Look at that pair!’ and ‘They are soaking wet!’\nThe chairlift eventually began to move again and the pair moved out of the line of fire (right)\nAnother added: ‘And now it’s going on again!’\nThe eyewitnesses said that the tourists were stuck for over a minute in the icy blast.","url":"https://www.dailymail.co.uk/travel/travel_news/article-3394017/Alps-skiers-caught-blast-snow-cannon-chairlift-stopped.html"}
