{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:39:11","date_modify":"2018-10-30 20:39:11","date_publish":"2016-10-31 03:16:08","description":"Al-Qaeda in the Arabian Peninsula, in an article in Al Masra, says that America’s influence across the globe is waning.","filename":"data/vaneerConsumption/AlQaedaUSPresidentialCandidatesMiredinCriticismandFlaws.json","image_url":"https://media.breitbart.com/media/2016/10/wi/afp/20/87vb84.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_10_30__1540931951.html","title":"Al-Qaeda: U.S. Presidential Candidates ‘Mired in Criticism and Flaws’","title_page":"Al-Qaeda: U.S. Presidential Candidates ‘Mired in Criticism and Flaws’","title_rss":"NULL","source_domain":"breitbart.com","text":"Al-Qaeda in the Arabian Peninsula (AQAP), in an article contained in the new edition of its Arabic-language online propaganda magazine Al Masra, says that America’s influence across the globe is waning and criticizes the presidential nominees of both major U.S. parties, according to a translation by the Foreign Desk.\nAccording to the Yemen-based al-Qaeda branch, the emails WikiLeaks has published linked to Democratic presidential nominee Hillary Clinton expose her “deceptive politics and maneuvers to gain power,” causing her to “lose a large part of her popularity and the trust of the American people.”\nIn the article, which features a picture of Republican presidential nominee Donald Trump, the AQAP magazine author blasts both major candidates.\nThe author notes, “Some may wonder how the U.S. presidential campaign could only yield two candidates mired in criticism and flaws, and how the American establishment can only produce Hillary and Trump? Is this evidence of the beginning of the American decline?”\n“The answer will be confirmed by the outcome of the election. Without doubt, the future will be different from the past, where the star of the United States flashed and is now set to fade,” it adds.\nNo matter who wins, the American people will lose, argues the article.\nIf Clinton wins the election, “this will not unite the country again” because the United States is already divided and cannot face “growing challenges,” it claims, adding that if Trump loses, he would still have “succeeded in reducing the confidence of the American people in a democratic government.”\nThis is not the first time that the Yemen-based al-Qaeda branch offers its insights into the ongoing U.S. presidential race.\nIn March, Al Masra predicted how each candidate would deal with the Middle East and Muslims around the world, notes the Foreign Desk\nTrump, who is “famous for his-anti Muslim attitude,” would cause an increase in anti-U.S. sentiment from Muslims if elected president, the article argued, while Clinton would be “an extension of the policy of Obama and the Democrats in the region.”\nThe new article states that the United States is divided and unable to face “growing challenges.”\nAQAP has been described by U.S. officials as the most potent and dangerous wing of al-Qaeda. While a U.S.-backed coalition in Yemen led by Saudi Arabia has primarily focused on Iran-allied Shiite Houthi rebels, AQAP has flourished and is believed to control more territory than ever in its history.\nThe U.S. military has begun to target the group once again after it was forced out of the country in 2015 following the Houthi takeover of the Yemeni capital Sanaa.","url":"https://www.breitbart.com/national-security/2016/10/30/al-qaeda-u-s-presidential-candidates-mired-criticisms-flaws/"}
