{"authors":["Edwin Mora"],"date_download":"2018-10-30 17:52:34","date_modify":"2018-10-30 17:52:34","date_publish":"2017-03-09 04:40:00","description":"The Islamic State and al-Qaeda have recently published propaganda videos calling China's Uighur minority to attack the communist country.","filename":"data/vaneerConsumption/AlQaedaIslamicStateSetEyesonAttackingChina.json","image_url":"https://media.breitbart.com/media/2016/03/Uighur-men-praying-at-mosque-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_03_08__1540921954.html","title":"Al-Qaeda, Islamic State Set Eyes on Attacking China","title_page":"Al-Qaeda, Islamic State Set Eyes on Attacking China","title_rss":"NULL","source_domain":"breitbart.com","text":"The Islamic State (ISIS/ISIL) and its rival al-Qaeda have recently published propaganda videos explicitly calling on jihadists from China’s Uighur minority who have joined the terrorist groups to attack the communist country.\nDr. Uran Botobekov, an expert on political Islam, argues in an op-ed published by the Diplomat that Beijing should take the threats seriously.\n“It must be noted that these two groups [ISIS and al-Qaeda] have similar strategies of jihad against Beijing and anti-Chinese propaganda tactics,” notes Dr. Botobekov. “The main characters in both videos are Uyghur militants fighting under the auspices of ISIS and al-Qaeda in Syria and Iraq. Both videos feature calls to the Muslim world to wage jihad against the kafirs [non-believers] of China and to perform acts of revenge for the deaths of Uyghur Muslims in Xinjiang.”\nThe Chinese province of Xinjiang, which borders war-ravaged Afghanistan and volatile Pakistan-occupied Kashmir, is home to China’s largest concentration of Uyghurs, or Uighurs.\nChina’s communist government has acknowledged that jihadist groups, particularly the al-Qaeda affiliate known as the Turkistan Islamic Party (TIP), pose a “grave threat” to “security and stability of China and the region.”\nDuring a Chinese military parade on February 28 featuring 10,000 armed police officers, Chen Quanguo, the Communist Party’s secretary in China’s autonomous province of Xinjiang, urged Chinese authorities to “bury the corpses of terrorists and terror gangs in the vast sea of the people’s war,” reports the Shanghaiist.\nXinjiang, which borders war-ravaged Afghanistan and volatile Pakistan-occupied Kashmir, is home to China’s largest concentration of Uyghurs, or Uighurs.\nIn late February, ISIS and the al-Qaeda-linked TIP released propaganda videos featuring members of China’s Uyghur Muslim minority vowing to carry out attacks on Chinese soil.\n“Soon the black flag of Tawhid [Unity of Allah] will be hanging in the capital cities of the United States, Russia, and China,” declares a Chinese Uyghur jihadist in the ISIS video.\n“Oh, you Chinese, who do not understand what people say! We are the soldiers of Allah, will make you understand Islam with the tongues of our weapons. We will come to you to shed blood like rivers and avenge the oppressed,” he adds before savagely decapitating a prisoner dressed in red, a color traditionally associated with communism.\nChina has repeatedly denied allegations of religious persecution against its Uighur population, described as oppressed by Beijing in an assessment from the New America think-tank last year.\nThe recent threats against China come amid mounting pressure from U.S.-backed local forces fighting both ISIS and al-Qaeda in the Middle East.\nIn his Diplomat piece, Dr. Botobekov, notes, “The leaders of global jihadist movements are likely to want to relocate the center of the conflict area closer to China, Central Asia, and Afghanistan after the downfall of the Islamic State in the Middle East.”\nISIS is increasingly losing territory to U.S.-backed troops in Iraq and Syria.\nAlthough al-Qaeda is believed to be benefiting from the international community’s primary focus on its younger rival ISIS in the Middle East, the older terrorist group is also taking losses.\nDr. Botobekov writes:\nDespite significant losses on the battlefield, ISIS and al-Qaeda are intensifying propaganda activities in the virtual world. Last month, both groups released media targeting China specifically… The final days of February 2017 saw both ISIS and a group affiliated with al-Qaeda target China specifically. Given that both have carried out devastating terrorist attacks, it’s reasonable to say that Beijing needs to take the Islamists’ threats seriously.\nISIS and al-Qaeda have established official branches in Asia, particularly in Afghanistan — the Khorasan Province (IS-KP/ISIL-K) and the al-Qaeda in the Indian Subcontinent (AQIS), respectively.\nIn late February, ISIS released a propaganda video specifically targeting citizens of Central and Asia and China. Days later, the Turkestan Islamic Party published its own propaganda video targeting China.\n“Interestingly, the video prepared by ISIS takes aim both at China and at the TIP,” notes the op-ed.\nThe South China Morning Post reports that Beijing is planning to boost military spending to combat Uyghur jihadists in Xinjiang.","url":"https://www.breitbart.com/national-security/2017/03/08/al-qaeda-islamic-state-recruit-uighurs-china/"}
