{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 20:12:53","date_modify":"2018-10-30 20:12:53","date_publish":"2016-10-18 01:54:48","description":"The bloodshed in Chicago is at such a crisis level that 1000 more citizens have been shot already this year than at this same time last year.","filename":"data/vaneerConsumption/Already1000MorePeopleShotinChicagoThanThisTimeLastYear.json","image_url":"https://media.breitbart.com/media/2016/10/chicago-police-city-shootings-violence-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_10_17__1540930373.html","title":"Already 1,000 More People Shot in Chicago Than This Time Last Year","title_page":"Already 1,000 More People Shot in Chicago Than This Time Last Year | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The incredible bloodshed in Barack Obama’s hometown is at such a crisis level that one thousand more citizens have been shot already this year than at this same time last year.\nWith another forty shot and ten killed over this past weekend, the toll of bloodletting has reached 3,484 shooting victims. That is over one thousand victims more than the 2,441 people shot by the first weekend of October in 2015. The death toll is also nearly 200 higher, with 595 deaths compared to last year’s 409, an increase of 186 deaths, the Chicago Tribune reports.\nIn one shocking incident during the unseasonably warm weekend, fully seven people were shot in one attack. Wounded in the Garfield Park attack were two women in their twenties, two men in their twenties, and another two men in their thirties. Along with the large number of wounded, a seventh victim was killed in a drive-by shooting on the 3300 block of West Maypole Street.\nMore than fifteen people were killed each day during the October 14 to 16 weekend.\nMeanwhile, the Chicago City Council has taken action to help prevent the culture of death infesting its neighborhoods by alerting Amazon.com that it may not ship the pink toy pistols for the “Western Cowgirl Playset” to Chicago customers because it violates the city’s ban on “replica guns.”\nAmazon has told customers that the ensemble kit consisting of a pink western hat, a pink handled pistol in a pink holster, and a shiny plastic sheriff’s badge cannot be shipped to Chicago because of city ordinance §4-144-190 of the Chicago Municipal Code, Daily Caller reports.\nThe cowgirl playset is far from the only toy gun that Amazon won’t ship to Chicago for fear of violating the city’s ordinance, of course. But in a city infamous for having some of the strictest anti-gun laws in the country, the silliness of it all stands in stark contrast to the city council’s utter failure to actually address the lawlessness and bloodshed infesting their city.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com.","url":"https://www.breitbart.com/politics/2016/10/17/already-1000-people-shot-chicago-time-last-year/"}
