{"authors":["Kenneth Dickerman","Photo Editor","Barry Phipps"],"date_download":"2018-10-21 03:01:10","date_modify":"2018-10-21 03:01:10","date_publish":"2018-07-25 10:00:21","description":"Photographer Barry Phipps documents life in Iowa.","filename":"data/vaneerConsumption/AlthoughtakenrecentlythesephotosevokeanoldermorenostalgicIowa.json","image_url":"https://www.washingtonpost.com/resizer/dllAAisII9fl6UqkYuq5W4ogscQ=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ETG4WMSWTE37LBUWLI5SQSJCDQ.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_07_25__1540090870.html","title":"Although taken recently, these photos evoke an older, more nostalgic Iowa","title_page":"Although taken recently, these photos evoke an older, more nostalgic Iowa - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"A new book from University of Iowa Press showcases the work of photographer Barry Phipps. After living in Chicago for more than 20 years, Phipps and his wife relocated to Iowa City. Faced with new surroundings, Phipps began taking road trips, discovering his new home state. Over four years, Phipps ended up taking hundreds of rolls of film. Those photographs initially were self-published as a series called “Iowa Photographs.” As he continued taking road trips, Phipps eventually wondered how many of Iowa’s counties he had photographed. He realized that out of the 99 counties, he had photographed 76, so he resolved to head out on more trips to photograph the remaining 23. The result is his book ‘Between Gravity and What Cheer.’\nPhipps really had no concrete reason to go where he ended up. In an introduction, Phipps writes, “My trips were random and haphazard from a planning standpoint, and were often decided by heading toward the town with the most interesting name (What Cheer, Diagonal, Gravity) or by the way the chosen road would add to the look of my marked-up map (which became a sort of conceptual art piece in and of itself).”\nPhipps also muses in his introduction about how people may perceive the book. He notes photos taken in Iowa may lead people to think the book is about Iowa. But he wants it to be more than that. Of the book, Phipps said:\n“My intentions were to learn of my surroundings and to compose with color, line, texture, and form — an approach I learned while studying painting with Lester Goldman at the Kansas City Art Institute in the late 80s. I think of these photographs as extensions of paintings, with the added element of composing with subject matter that also signifies something culturally. I am an American who is fascinated by our culture. These images are, individually, an exercise in photographs made not of something, but composed from something. I see these as individual visual communications that, when combined into a linear collection through the pages of this book, read as a long mysterious sentence with images on facing pages suggesting connections that would not happen if presented alone.”\nPaging through the book, it does seem like the photos are not merely about what is happening in them. Among other things, Phipps’s photos of Iowa conjure up a vision of an America that is long gone but not forgotten. Here are a few of the photos from “Between Gravity and What Cheer.”\nIowa State Fair, Des Moines. (Barry Phipps)\nRed Oak. (Barry Phipps)\nIowa City. (Barry Phipps)\nCommunity garden, reclaimed flood zone, Cedar Rapids. (Barry Phipps)\nColumbus Junction. (Barry Phipps)\nSioux City. (Barry Phipps)\nIda Grove. (Barry Phipps)\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\nThousands entered the iPhone Photography Awards contest. These are the winners.\nInside a mostly faded culture on Norway’s border with Sweden\nHaunting images of life on the St. Lawrence River in Canada","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/07/25/although-taken-recently-these-photos-evoke-an-older-nostalgic-iowa/"}
