{"authors":["Euan Mclelland For Mailonline"],"date_download":"2018-10-23 03:52:13","date_modify":"2018-10-23 03:52:13","date_publish":"2016-01-11 16:54:39","description":"The Staffordshire-based attraction is preparing to open for the new season in March. But bosses have revealed it will close completely during quieter days mid-week after last year's crash.","filename":"data/vaneerConsumption/AltonTowerstocloseonquietweekdaysaftervisitornumbersplunged.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/18/300D8C6D00000578-0-image-a-34_1452538542367.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394072_Alton-Towers-close-completely-quiet-weekdays-visitor-numbers-plunged-following-horrific-Smiler-crash_1540266733.html","title":"Alton Towers to close on quiet weekdays after visitor numbers plunged","title_page":"Alton Towers to close on quiet weekdays after visitor numbers plunged | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Alton Towers bosses have been forced to close the park during the week after visitor numbers plummeted following last summer's horror Smiler crash.\nThe under-fire Staffordshire-based attraction is preparing to open for the new season in March.\nBut bosses have revealed the theme park - which axed 190 jobs last year - will close completely during quieter days mid-week.\nScroll down for video\nInjured: Leah Washington, 18, from Barnsley, South Yorkshire, and Vicky Balch, 20, from Leyland, Lancashire, both had to have a leg amputated following the crash at Alton Towers last year\nAlton Towers bosses have been forced to close the park during the week after visitor numbers plummeted following last summer's horror crash on the Smiler rollercoaster (pictured)\nRescuers had to build a special platform to be able to reach the victims in a four-and-a-half hour operation\nLeah Washington, 18, from Barnsley, South Yorkshire, and Vicky Balch (pictured), 20, from Leyland, Lancashire, both had to have a leg amputated after sustaining severe injuries\nVictims: Joe Pugh, left, and his girlfriend Leah Washington, right, were also hurt in the crash\nTwo women had to lose a leg and 14 others suffered serious injuries when the £18million Smiler rollercoaster smashed into a stationary cart while travelling at full speed.\nThe flagship ride has remained closed ever since the crash, which happened on June 2 last year.\nLast November an investigation by Merlin Entertainment, which runs the theme park, said it had been the result of human error.\nLeah Washington, 18, from Barnsley, South Yorkshire, and Vicky Balch, 20, from Leyland, Lancashire, both had to have a leg amputated after sustaining severe injuries.\nTheir respective boyfriends Joe Pugh, 18, also from Barnsley and Daniel Thorpe, 28, from Buxton, Derbyshire, were also badly hurt, along with another unnamed victim.\nBosses yesterday said the resort will close on less busy days for the first time in its history.\nStudent Leah Washington, 18, (second from left) had to have her left leg amputated after the crash, while her boyfriend Joe Pugh, 19 (centre right), saw both of his knees shattered. Dancer Vicky Balch, 20, (right) was forced to have her right leg amputated below the knee. Her friend Daniel Thorpe (left) was also injured\nThis graphic shows how the rollercoaster crash unfolded, demonstrating how the carriage carrying 16 passengers smashed into an empty 'test' carriage when a safety mechanism was manually overridden\nAn Alton Towers spokesman said: 'The park will be closed on a small number of days when guest visitation has historically been very low, which is mid-week during our quieter periods.\n'This action will also allow us to focus our efforts on those days when we know we will be busy.'\nHowever, the resort's annual jobs drive, which launched this month, will see the recruitment of more than 1,200 temporary staff.\nPaul Williams, Staffordshire University's head of business, said the decision to close on quieter days would be part of the park's business plan following last year's crash.\nHe said: 'Although Alton Towers continues to be one of Staffordshire's tourism success stories, it has been widely reported that 2015 was a particularly challenging year for the company and they are rightly looking to implement a comprehensive recovery plan in advance of the new season.\nWhen MailOnline visited the park in July, many of the rides - including the Oblivion - were relatively quiet\nThe usually popular Congo River Rapids water ride was so empty just after midday on July 31 that staff were forced to send around two carts in a row without any visitors\n'However, while the decision to not open the theme park on \"quiet days\" during the off-peak season is a key change, it is not uncommon in other service organisations.\n'I understand that this is a Merlin Group strategic decision rather than being unique to Alton Towers, with a number of its other theme parks and attractions also set to remain closed on days where demand from visitors is relatively lower.\n'This seems to make good business, operations and resort management sense.\n'I have no doubt that this year will see people returning to the resort and that the publicity will shift to focus on how Alton Towers is once again delivering a magical experience.'\nThe season will launch on Saturday, March 19.\nNew attractions will include a rollercoaster restaurant, which will see food do a loop-the-loop before being delivered to a table.","url":"https://www.dailymail.co.uk/news/article-3394072/Alton-Towers-close-completely-quiet-weekdays-visitor-numbers-plunged-following-horrific-Smiler-crash.html"}
