{"authors":["Associated Press"],"date_download":"2018-10-23 00:08:12","date_modify":"2018-10-23 00:08:12","date_publish":"2016-01-28 13:40:38","description":"RICHMOND, Va. (AP) — Altria's fourth-quarter revenue improved thanks partly to higher tobacco product pricing, and the company announced a plan to reduce cos...","filename":"data/vaneerConsumption/Altria4Qrevenueimprovesplansjobeliminations.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:84fc53ae7056bc363cd0a0357b563291-2vdWmEltwXfba0ce28e632935be9-696_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420966_Altria-4Q-revenue-improves-plans-job-eliminations_1540253292.html","title":"Altria 4Q revenue improves, plans job eliminations","title_page":"Altria 4Q revenue improves, plans job eliminations | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Altria 4Q revenue improves, plans job eliminations\nRICHMOND, Va. (AP) — Altria's fourth-quarter revenue improved thanks partly to higher tobacco product pricing, and the company announced a plan to reduce costs that includes job eliminations.\nThe owner of Philip Morris USA, the nation's largest cigarette maker, said Thursday that its productivity plan will trim spending on certain selling, general and administrative infrastructure and create a leaner company.\nIt expects about $300 million in annual savings by 2017's end. Restructuring charges are anticipated to be approximately $140 million, or 5 cents per share, with most of the charges expected to be recorded in 2016's first quarter. Altria said the charges include about $120 million in employee separation costs.\nFILE - In this July 17, 2015, file photo, store manager Stephanie Hunt poses for photos with a pack of Marlboro cigarettes, an Altria brand, at a Smoker Friendly shop in Pittsburgh. Altria reports quarterly financial results on Thursday, Jan. 28, 2016. (AP Photo/Gene J. Puskar, File)\nAltria earned $1.25 billion, or 64 cents per share, for the period ended Dec. 31. A year earlier the company earned $1.24 billion, or 63 cents per share.\nStripping out certain items, earnings were 67 cents per share.\nThe results missed Wall Street expectations. The average estimate of four analysts surveyed by Zacks Investment Research was for earnings of 68 cents per share.\nRevenue, excluding excise taxes, increased to $4.79 billion from $4.61 billion.\nCigarette shipment volume fell 2.6 percent, while cigar shipment volume climbed 6 percent.\nFor the year, Altria Group Inc. reported an adjusted profit of $2.80 per share. Revenue, excluding excise taxes, totaled $18.85 billion.\nGoing forward, the company anticipates a 2016 adjusted profit in a range of $3 to $3.05 per share. Analysts polled by FactSet expect $3.05 per share.\n_____\nElements of this story were generated by Automated Insights (http://automatedinsights.com/ap) using data from Zacks Investment Research. Access a Zacks stock report on MO at http://www.zacks.com/ap/MO\n_____","url":"https://www.dailymail.co.uk/wires/ap/article-3420966/Altria-4Q-revenue-improves-plans-job-eliminations.html"}
