{"authors":["Kipp Jones"],"date_download":"2018-10-30 22:10:55","date_modify":"2018-10-30 22:10:55","date_publish":"2015-03-07 19:16:11","description":"International human rights attorney Amal Clooney, wife of George Clooney, will lecture at Columbia Law School this spring as a visitor to the faculty and senior fellow with Columbia’s Human Rights Institute, the university reported Friday.","filename":"data/vaneerConsumption/AmalClooneytoTeachatColumbiaLawSchool.json","image_url":"https://media.breitbart.com/media/2015/01/Amal-clooney-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_03_07__1540937455.html","title":"Amal Clooney to Teach at Columbia Law School","title_page":"Amal Clooney to Teach at Columbia Law School","title_rss":"NULL","source_domain":"breitbart.com","text":"International human rights attorney Amal Clooney, wife of George Clooney, will lecture at Columbia Law School this spring as a visitor to the faculty and senior fellow with Columbia’s Human Rights Institute, the university reported Friday.\nClooney, who previously served as a senior adviser to former Secretary General of the United Nations Kofi Annan during his tenure as the U.N.’s envoy to Syria, and who also represented WikiLeaks founder Julian Assange, will be in New York for production of George’s upcoming film Money Monster.\nFormerly known as Amal Alamuddin, the Lebanese-born NYU alum told the school:\nIt is an honor to be invited as a visiting professor at Columbia Law School alongside such a distinguished faculty and talented student pool. I look forward to getting to know the next generation of human rights advocates studying here.\nThe university said in a statement: “We are privileged to have an international human rights practitioner of Amal Clooney’s stature join our faculty. Her extensive experience advocating before U.N. and regional human rights mechanisms complements our existing offerings and will enrich the experience of our students.”\nGeorge Clooney spoke this week of Amal’s absence from Monday’s SeriousFun Children’s Network Gala, a children’s camp founded by the late Paul Newman.\n“Since 1988 these camps have brought over a half a million sick kids and their families from over five . . . ” he paused, stumbling over the number, “from over 50 countries, 500 countries would be too many. There aren’t actually that many.”\n“My wife’s the smart one,” he added, reports Fox News.\nAmal Clooney has made a name for herself practicing high-profile international human rights law, and she faced a possible arrest in January, after she reportedly exposed flaws within Egypt’s criminal justice system.\nShe and Clooney tied the knot last year in Italy.","url":"https://www.breitbart.com/entertainment/2015/03/07/amal-clooney-to-join-faculty-at-columbia-law-school/"}
