{"authors":["Press Association"],"date_download":"2018-10-23 01:05:47","date_modify":"2018-10-23 01:05:47","date_publish":"2017-03-10 08:38:05","description":"The British-Lebanese human rights lawyer called for the UN to end its \"inaction\" and begin gathering evidence of international crimes.","filename":"data/vaneerConsumption/AmalClooneycallsonUNtobringIslamicStatetojusticeovergenocideinIraq.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/08/wire-194867-1489135089-734_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4300354_Amal-Clooney-calls-UN-bring-Islamic-State-justice-genocide-Iraq_1540256747.html","title":"Amal Clooney calls on UN to bring Islamic State to justice over genocide in Iraq","title_page":"Amal Clooney calls on UN to bring Islamic State to justice over genocide in Iraq | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Amal Clooney has urged the United Nations to stop the Islamic State terror group getting away with genocide by launching a UK-led investigation into the group’s atrocities in Iraq.\nThe British-Lebanese human rights lawyer called for the UN to end its “inaction” and begin gathering evidence to convict the militants of international crimes.\nMrs Clooney, who is married to actor George, said IS has declared to “destroy” the Yazidi ethnic group by committing murder, rape and forced conversions while also attacking Christians, and Shia and Sunni Muslims.\n“The UN was created as the world’s way of saying ‘never again’ to the genocide perpetrated by the Nazis,” she told the UN meeting on Thursday.\n“And yet here we are, 70 years later, discussing the UN’s inaction in the face of a genocide that we all know about, and that is ongoing.”\nA UN report last year concluded IS is committing war crimes by committing genocide against the Yazidis, but none of its militants have faced trial for international crimes.\n(Bebeto Matthews/AP)\nSome 3,200 women and children were being held captive by IS while thousands of men and boys were missing, the report published in June said.\nMrs Clooney, who is 39 and expecting twins, called for mass graves to be preserved and exhumed while witness evidence should be recorded.\nShe praised the UK’s “admirable” leadership and said the investigation has not been launched because Iraqi PM Haider al Abadi, who attended the hearing, has failed to write to the Security Council requesting an inquiry.\nAmal Clooney to UN member states: Don't let ISIS get away with genocide! Don't do too little too late in delivering justice. pic.twitter.com/OS8kjqeOZ7 — German Mission to UN (@GermanyUN) March 9, 2017\nMrs Clooney urged Mr al Abadi to give the go-ahead, but said the UN should push on if he does not.\nShe ended her speech saying: “Don’t let this be another Rwanda, where you regret doing too little, too late. Don’t let Isis get away with genocide.”\nMrs Clooney, a barrister at Doughty Street Chambers, appeared at the New York City meeting to represent IS victims including Nadia Murad, who is a Yazidi genocide survivor.\nMany thanks to #AmalClooney for her remarkable speech before the UN on behalf of victims of ISIS https://t.co/BNxgQwmtcy — Nadia Murad (@NadiaMuradBasee) March 9, 2017\nMs Murad told UN members: “I can’t understand why you are letting IS get away with it.”","url":"https://www.dailymail.co.uk/wires/pa/article-4300354/Amal-Clooney-calls-UN-bring-Islamic-State-justice-genocide-Iraq.html"}
