{"authors":["Monique Friedlander For Daily Mail Australia"],"date_download":"2018-10-22 22:50:35","date_modify":"2018-10-22 22:50:35","date_publish":"2017-04-26 05:56:03","description":"She has been a fixture on Australia's media landscape since the 80s.","filename":"data/vaneerConsumption/AmandaKellerLogiestaximistookherforSandraSully.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/05/3F9C6B8D00000578-0-image-a-16_1493182082563.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446370_Amanda-Keller-Logies-taxi-mistook-Sandra-Sully_1540248635.html","title":"Amanda Keller Logies taxi mistook her for Sandra Sully","title_page":"Amanda Keller Logies taxi mistook her for Sandra Sully | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She has been a fixture on Australia's media landscape since the 80s.\nBut it seems not everyone got the memo about The Living Room's iconic host Amanda Keller, 55, including a taxi driver who mistook her for fellow TV personality Sandra Sully over the weekend.\nDuring a segment on WSFM's Jonesy & Amanda show on Wednesday, Amanda detailed the awkward moment she was mistaken for the news presenter as she made her way home from the Logie Awards.\nMistaken identity! It seems not everyone got the memo about The Living Room's iconic host Amanda Keller, 55, including a taxi driver that confused her with fellow TV personality Sandra Sully over the weekend\nAmanda explained that she had hopped into a taxi she thought had been sent by Channel 10 to drive her home, but realised along the journey that she was being driven in the opposite direction.\nWhen she told the driver he was driving the wrong way, he said, 'Well, Sandra I was told…'- prompting Amanda to realise that he had mistaken her for Sandra Sully.\n'I said: 'I'm not Sandra Sully!' He thought I was Sandra Sully', Amanda recounted.\nDriving her up the wall? Amanda explained that she had hopped into a taxi she thought had been sent by Channel 10 to drive her home, but realised along the journey that she was being driven in the opposite direction\n'So then we had this really awkward moment where he had to phone the base and say, 'Can someone make sure Sandra Sully's picked up?'\nNot only was it awkward but it was annoying because I was still half-an-hour from home.\nMeanwhile, Amanda has been celebrating the long-term success of her award-winning program The Living Room, which is currently in its sixth season.\nCringe alert! When she told the driver he was driving the wrong way, he said, 'Well, Sandra I was told…'- prompting Amanda to realise that he had mistaken her for Sandra Sully\n'To be this age and busier than I've ever been in my career is extraordinary,' she told The Daily Telegraph last month.\nSpeaking candidly to the publication, Amanda admitted that despite her calm exterior, she struggles with bouts of anxiety- especially before red carpet events.\n'I’m more socially confident now than when I was younger. But I still have times, like the night before the Logies each year, where I have social anxiety,' she confessed.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446370/Amanda-Keller-Logies-taxi-mistook-Sandra-Sully.html"}
