{"authors":["Wolf Richter","Wolf Street"],"date_download":"2018-10-30 23:45:57","date_modify":"2018-10-30 23:45:57","date_publish":"2018-07-17 00:00:00","description":"Amazon currently owns about 49% market share in US e-commerce.","filename":"data/vaneerConsumption/Amazonisclosinginonowninghalfoftheecommercemarket.json","image_url":"https://amp.businessinsider.com/images/5b4cbb857439162b008b4acc-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_amazon-is-closing-in-on-owning-half-of-the-e-commerce-market-2018-7_1540943157.html","title":"Amazon is closing in on owning half of the e-commerce market","title_page":"    Amazon is closing in on owning half of the e-commerce market - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Amazon CEO Jeff Bezos David Ryder/Getty\nAmazon is a Goliath in very different sectors. One is the internet cloud, a booming business. Amazon Web Services has evolved into the single largest player offering cloud computing services to companies, governments, and individuals. As of the first quarter, AWS owns a 33% share of the cloud infrastructure market, ahead of Microsoft with a 13% share, and Google with a 6% share. Being the biggest kid on the block, it has become the shoo-in for a multi-year $10-billion Pentagon contract. That business is highly profitable.\nLess profitable are Amazon's e-commerce operations. But in terms of magnitude, Amazon totally rules. According to a report from eMarkter, cited by CNBC, Amazon's online sales in the US are expected to surge 30% in 2018 compared to a year earlier, to $258 billion. This would boost Amazon's share of US e-commerce sales of 49.1%!\nThe other combatants are fighting over the crumbs in terms of market share. The next nine largest e-commerce operations combined grab about 22% of the market:\neBay (EBAY): 6.6%\nApple ( AAPL): 3.9%\nWalmart ( WMT): 3.7%\nHome Depot ( HD): 1.5%\nBest Buy ( BBY) 1.3%\nQVC Group ( QVCA): 1.2%\nMacy's ( M): 1.2%\nCostco ( COST): 1.2%\nWayfair ( W): 1.1%\nThat leaves 29% of e-commerce for all the other retailers with online operations, from Bed Bath & Beyond (BBBY) to the tiniest home-office operations, millions of them.\nAmazon online sales fall into two categories: its \"direct sales\" and the sales from other sellers that use Amazon's platform and execution (\"Marketplace sales\"). Both are growing in leaps and bounds, but Marketplace sales are growing the fastest.\nIn 2018, Marketplace sales are expected to account for 68% of Amazon's e-commerce sales, and direct sales for 32%, according to eMarketer estimates.\nOverall, e-commerce sales in the US have soared 16% in the first quarter from a year ago and are on track to exceed $500 billion this year.\nBut some types of sales have resisted the move to the internet, largely because of the type of product that doesn't lend itself easily to online sales: gasoline, new and used vehicles, groceries, and beverages. Together they account for 51% of total brick-and-mortar sales.\nThe remaining 49% is under total attack from e-commerce, among them prominently department stores, whose sales have been wilting since 2001. This half of brick-and-mortar has already surrendered 22% of its sales to e-commerce.\nSince nearly half of e-commerce sales happen at Amazon, the share it has taken from all under-attack brick-and-mortar is over 10%. This is just one company, Amazon, against all under-attack retailers.\nNow Amazon is unhappy with these results because grocery and beverage sales are a huge business in the US that has steadfastly refused to move online, despite multiple efforts by all kinds of retailers, including Safeway starting two decades ago.\nAfter more or less unsuccessfully experimenting with its own online grocery operation, Amazon bought Whole Foods - not because Amazon wants to get into brick-and-mortar, but because Amazon wants to dominate grocery sales over the next two decades - and to do that, it has to persuade Americans to buy their groceries online, just like Americans are finally buying their shoes online, something they'd sworn they'd never do.\nBut that's how Amazon operates. And grocery sales in the US are just too big to let them slip away. It's going to be tough, and no one has succeeded yet in getting Americans to buy their groceries online, but Amazon is now committed.\nIt took Amazon a quarter century to grab this much market share, and it will continue to try to grab more. Amazon has shaken up US retail and is now totally dominant. It has the most formidable distribution system in the US. The \"Amazon effect\" has become a common expression - Amazon buys an online pharmacy, and the shares of CVS and Walgreens plunge. Everyone in retail is trembling when Amazon flares its nostrils. Walmart, trying to defend its turf after ignoring e-commerce for too many years, is belatedly lining up its immense firepower against Amazon, with mixed results, as Walmart's feeble 3.7% share of e-commerce sales show.\nAmazon is a book publisher. It's encroaching on the turf of TV, Netflix, and others with its video offerings. It has recently begun to invade online advertising with its Amazon Publisher Services \"Unified Ad Marketplace\" (it's trying to get me to sign up), and thereby it's invading the market where Google and Facebook totally dominate. Its Alexa and other \"smart\" internet-connected devices are populating homes and influencing all kinds of decisions that households make - not to speak of the data they send back. Amazon keeps expanding into new territories.\nThere are calls for the government to go after Amazon and break it up. But this is the internet, and trying to tar Amazon as a monopoly is like trying to nail Jell-O to the wall. Consumers like buying at Amazon, or else they wouldn't do it. Anything that Amazon sells can be bought elsewhere, and often for less.\nAnd yet, there is something disconcerting about one company becoming so dominant in so many ways. This is even more disconcerting when a handful of other companies totally dominate other areas that consumers deal with on a regular basis - but whatever it is that is disconcerting, for now, thanks to the internet, it's not lack of other competition.","url":"https://www.businessinsider.com/amazon-is-closing-in-on-owning-half-of-the-e-commerce-market-2018-7"}
