{"authors":[],"date_download":"2018-10-22 20:35:38","date_modify":"2018-10-22 20:35:38","date_publish":"2016-01-29 02:20:25","description":"US online giant Amazon reported profits doubled in the past quarter, as it attracted more customers with video and other services, but the results missed Wal...","filename":"data/vaneerConsumption/Amazondeliversbigprofitsbutsharesdive.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h5l4-4PuZeKVXE7cd9005b2c87638c68f-196_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421823_Amazon-delivers-big-profit-boost-misses-forecast_1540240538.html","title":"Amazon delivers big profits but shares dive","title_page":"Amazon delivers big profits but shares dive | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Amazon delivers big profits but shares dive\nUS online giant Amazon reported profits doubled in the past quarter, as it attracted more customers with video and other services, but the results missed Wall Street forecasts.\nAmazon shares dived more than 13 percent to $551 in after-hours trade on the results, which showed a fourth-quarter profit of $482 million, up from a $214 million profit a year earlier.\nThe results marked the third consecutive quarterly profit for the company, which is a heavyweight in online retail as well as cloud computing, and more recently streaming video.\nAmazon showed a fourth-quarter profit of $482 million, up from a $214 million profit a year earlier ©John MacDougall (AFP/File)\nOverall revenue jumped 22 percent from a year ago to $35.7 billion.\nAmazon was one of the \"clear winners\" in the battle for consumers' money during the year-end holiday season, according to Neil Saunders, chief of retail analysis firm Conlumino.\nBut while Amazon delivered \"stellar topline performance\" along with improving net income, its profitability \"is still painfully weak,\" Saunders said.\n\"This is a conscious decision by a company that uses a large chunk of its revenues to invest back into generating future growth,\" Saunders said.\n\"Clearly this is a strategy that is working, and it is one that is accepted by the market.\"\nHe gave the example of Amazon putting competitive pressure on traditional retail players such as Walmart.\nInvestors looking for big profits may be put off by Amazon investing heavily to build its businesses, from data centers for cloud services and shows for its streaming television service to developing drones to quickly deliver online purchases.\nAmazon, which earned a reputation for making little or no profit as it gained market share, managed an annual profit for 2015 of $596 million.\nRevenues were up 20 percent for the year, at $107 billion.\n- 'Like day one' -\n\"Twenty years ago I was driving the packages to the post office myself and hoping we might one day afford a forklift,\" said chief executive Jeff Bezos, who founded the company in 1994.\n\"This year, we pass $100 billion in annual sales and serve 300 million customers. And still, measured by the dynamism we see everywhere in the marketplace and by the ever-expanding opportunities we see to invent on behalf of customers, it feels every bit like day one.\"\nAmazon has made Bezos into one of the world's wealthiest individuals, with a fortune estimated at some $50 billion, and he has since created his own space company called Blue Origin and purchased The Washington Post newspaper.\nThe company has not offered details on its revenue from its Amazon Prime membership service, which offers free delivery and a variety of other services, or its own Kindle and Fire devices.\nBut it has broken down the finances from its cloud computing unit called Amazon Web Services: It took in $2.4 billion in revenue in the quarter and $7.9 billion for the year, accounting for an operating profit of $687 million in the quarter and $1.9 billion for the year.\nThe research firm Consumer Intelligence Research Partners estimates that Amazon Prime now has 54 million US members, spending on average about $1,100 per year -- much more than the $600 per year spent by non-members.\nAmazon offered no detailed numbers but said worldwide paid Prime memberships increased 51 percent last year.\nThose who subscribe get access to much of Amazon's video streaming library for free as well as music and other content.","url":"https://www.dailymail.co.uk/wires/afp/article-3421823/Amazon-delivers-big-profit-boost-misses-forecast.html"}
