{"authors":[],"date_download":"2018-10-22 22:40:20","date_modify":"2018-10-22 22:40:20","date_publish":"2014-06-10 19:31:46","description":"The move takes direct aim at consumer review sites Yelp and Angie's List as well as home improvement chains Home Depot and Lowe's,","filename":"data/vaneerConsumption/AmazonPlanstoLaunchLocalServicesMarketplaceThisYearReport.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2015_29/500156/140610-amazon-jsw-325p_8ad356ec484a3bd06727b45b090c5048.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_tech-news_amazon-plans-launch-local-services-marketplace-year-report-n127661_1540248020.html","title":"Amazon Plans to Launch Local Services Marketplace This Year: Report","title_page":"Amazon Plans to Launch Local Services Marketplace This Year: Report","title_rss":"NULL","source_domain":"nbcnews.com","text":"In recent months, Amazon has reached out directly to service providers as well as to several startups in Seattle and San Francisco that already connect service providers to customers through their own websites and mobile applications.\nAt least one of the startups contacted by Amazon focuses on home repair. Others offer a broader range of services that include massages and haircuts.\nThe company has been experimenting with ways to tie services to the products it sells. In one example, Amazon recently ran a test on its website offering installation services to users who bought Nest thermostats.\nA local services marketplace would extend Amazon's profitable role as a middleman for third-party vendors, which account for about 40 percent of Amazon's sales.\nThe quality of the local services would be backed by Amazon's \"A-to-z Guarantee,\" which the company uses to vouch for items sold by third-party sellers on its website.\nOffering local services on Amazon’s website has been a goal of Chief Executive Jeff Bezos for years. Bezos personally invested in Pro.com, a Seattle-based startup, founded by former Amazon executives, which helps customers find contractors, book appointments and estimate the cost of home repair and improvement projects.\n— Reuters","url":"https://www.nbcnews.com/tech/tech-news/amazon-plans-launch-local-services-marketplace-year-report-n127661"}
