{"authors":[],"date_download":"2018-10-30 01:01:03","date_modify":"2018-10-30 01:01:03","date_publish":"2018-09-13 00:53:07","description":"Every day now seems to bring more news of people being banned from social media, fired from their jobs, or even targeted for violence for expressing disagreement with liberals. Recent victims of this ongoing purge include Infowars host Alex Jones, White House speechwriter Darren Beattie and bestselling author David Horowitz. Evidence continues to accumulate that the billionaire Democrats who control companies like Twitter, Facebook and Google are pursuing a campaign to suppress or silence conservative voices.","filename":"data/vaneerConsumption/AmazonBansRooshHowLoveBecameHate.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/HeathLedger.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861263.html","title":"Amazon Bans Roosh: How Love Became ‘Hate’","title_page":"Amazon Bans Roosh: How Love Became ‘Hate’The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Every day now seems to bring more news of people being banned from social media, fired from their jobs, or even targeted for violence for expressing disagreement with liberals. Recent victims of this ongoing purge include Infowars host Alex Jones, White House speechwriter Darren Beattie and bestselling author David Horowitz. Evidence continues to accumulate that the billionaire Democrats who control companies like Twitter, Facebook and Google are pursuing a campaign to suppress or silence conservative voices.\nThe election of Donald Trump in 2016 seems to have inspired a climate of paranoia in Silicon Valley. Anyone suspected of dissenting from progressive orthodoxies could become the next target in this digital purge, where accusations of “hate” are used to justify the suppression of politically incorrect voices. However, the most remarkable — and perhaps the most ominous — example of how out-of-control the Left’s anti-free speech agenda has become involves a target who isn’t even involved in politics.\nDaryush Valizadeh, a/k/a “Roosh V,” is a legendary 39-year-old pickup artist (PUA) who became notorious for a series of books describing his libidinous forays in European countries (Bang Iceland, Bang Estonia, etc.). His popularity eventually made him a target of feminists, and the Southern Poverty Law Center actually declared Roosh’s website Return of Kings a “hate group.”All of this, you understand, because Roosh shares advice to help single guys learn how to “score” with women. Males who pursue heterosexual activity are now guilty of “misogyny” and “male supremacy,” according to the SPLC.\nCollege kids nowadays probably won’t believe this, but once upon time, even liberals approved of heterosexuality, which was a favorite activity of such notable Democrats as former President Bill Clinton and members of the Kennedy family. Unlike the late Sen. Edward M. Kennedy (D-Chappaquiddick), Daryush Valizadeh has never left a girl to die in the backseat of a submerged Oldsmobile, but times have changed and any man advocating heterosexuality in the 21st century risks being placed on the SPLC “hate list.”\nThe Left’s crusade to abolish heterosexuality reached frightening new extremes this week when Amazon banned Roosh’s books. Three of his books were banned on Friday, five more books were banned on Sunday and, on Monday, Amazon banned Roosh’s newly released book Game. Via email, Roosh was informed that “the subject matter of your book is in violation of our content guidelines.” His efforts to discover how he’d broken these guidelines proved futile. “I contacted them by phone when I first got the notice, but they stated that the team in charge of removing books doesn’t have phone support,” he told his readers at Return of Kings. “Through email, they told me they could not give me any details.”\nRoosh pointed out that Amazon sells many book titles full of graphic sexual content, e.g., the bestseller Fifty Shades of Gray: “Dozens of books that feature violent rape are not only available on Amazon, but are featured within lists on Amazon-owned Goodreads so shoppers can find them easier. There are hundreds of other pornographic books that depict sex in the most graphic way possible, with covers that are barely safe for work, and they are all still available.” The authors of those other books, however, are not included on the SPLC’s “hate list,” at least not yet. There is a certain randomness involved in the target selection process of the Left’s ongoing purge of politically incorrect dissidents. Roosh is the most successful (or at least, the best-known) of the entrepreneurial PUAs who used the Internet to create careers for themselves in the wake of the success of Neil Strauss’s 2005 bestseller, The Game: Penetrating the Secret Society of Pickup Artists. That book is still being sold on Amazon, and the SPLC has never accused Strauss of “hate,” so why was Roosh targeted by the Thought Police?\nThe answer is: It doesn’t matter.\nWe are living in an Orwellian dystopia. Democrat members of Congress advocate harassmentof their opponents, and Republican congressmen are targeted by assassins and GOP candidates are assaulted by knife-wielding lunatics, yet the so-called “mainstream” media insist that it is the Right, not the Left, which is dangerous. In this bizarre mirror-reverse world, atheists, homosexuals, violent anarchists and vehement man-hating feminists are free to say and do what they please, but a guy who tells other guys how to be successful with women is demonized like Emmanuel Goldstein in Nineteen Eighty-Four. Instead of free speech being suppressed by an all-powerful government, the enemies of freedom are gigantic multibillion-dollar Internet companies eager to appease swarming squadrons of social justice warriors (SJWs) who bombard them with complaints about alleged purveyors of “hate.”\nThe banning of Roosh’s books from Amazon inspired the Huffington Post to label him a “notorious rape apologist” and the Daily Beast branded Roosh a “pro-rape leader.” Of course, this is a dishonest smear, as the whole point of PUA strategy is to convince women to say “yes.” If advice in the art of romantic persuasion is now “hate” that must be suppressed, can’t Amazon’s policy now be described as objectively anti-heterosexual?\nWell, I can speak for no one else, but if the Left now proposes to take away my heterosexuality, they’ll have to pry it from my cold, dead hands.","url":"https://spectator.org/amazon-bans-roosh-how-love-became-hate/"}
