{"authors":["Ted Thornhill For Mailonline"],"date_download":"2018-10-22 23:46:50","date_modify":"2018-10-22 23:46:50","date_publish":"2017-04-26 08:31:11","description":"These amazing images were taken by award-winning photographer Will Burrard-Lucas, from Beaconsfield, who shot them in Namibia, South Africa, Zambia, Botswana and Uganda.","filename":"data/vaneerConsumption/AmazingphotoscaptureAfricasanimalsatduskanddawn.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/24/18/3F90861800000578-0-image-a-41_1493054023813.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-4441066_Amazing-photos-capture-Africa-s-animals-dusk-dawn_1540252010.html","title":"Amazing photos capture Africa's animals at dusk and dawn","title_page":"Amazing photos capture Africa's animals at dusk and dawn | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"That moment when the world moves from day to night and night to day is always bewitching.\nAnd when that moment is captured by a photographer with the skills of Will Burrard-Lucas, it's extra-magical.\nMailOnline Travel recently ran pictures from Burrard-Lucas that saw him crowned the winner of the Natural World category in the 2017 Sony World Photography Awards. Here he's allowed us to present another stunning animal series he shot called Backlit – beguiling pictures of creatures in Namibia, South Africa, Zambia, Botswana and Uganda caught at sunrise and sunset.\nWill Burrard-Lucas has allowed MailOnline Travel to run photographs from his stunning 'Backlit' collection\nThe images are breath-taking, with lions, hippos, meerkats, African wild dogs and more captured in golden halos of warm light\nBurrard-Lucas, 33, from Beaconsfield, explained the secrets to the backlit aesthetic\nThe images are breath-taking, with lions, hippos, meerkats, African hunting dogs and more captured in golden halos of warm light.\nThe most striking are perhaps the silhouette pictures, but all of them are bewitching.\nBurrard-Lucas, 33, from Beaconsfield, explained the secrets to producing a mesmerising backlit aesthetic.\nThis image of an African hunting dog is Burrard-Lucas's favourite from this collection. He said: 'One of the reasons these animals are so special to me is because they are so difficult to track down'\nA prowling lion is caught in silhouette in the Central Kalahari Game Reserve in Botswana\nBurrard-Lucas said: 'Generally, these backlit shots work best when the light is low and strong'\nLEARN FROM THE MASTER If you're keen to learn some of Burrard-Lucas’s photography secrets then sign up to his free online wildlife photography course. It covers mastering your camera's settings, post-processing for 'impactful but natural results', equipment recommendations for your budget and more. Plus, if you sign up, you get instant access to his ebook - Ten Things You Can Do Right Now To Improve Your Wildlife Photography.\nHe said: 'Backlit photographs are best taken at sunrise and sunset, when you get low, warm light. Backlit shots work best when you can line up your subject with the sun behind.\n'Therefore, I often find myself lying on the ground in order to get the angle right. You have two exposure options when shooting backlit. Firstly, you can choose to underexpose the subject so that you get a black silhouette with a beautiful orange sky behind. This works well when the shape of the subject forms a strong graphic silhouette.\n'The second option is to expose for the subject and let the background blowout. This creates a beautiful halo effect and a lovely sense of warmth.\n'Generally, these backlit shots work best when the light is low and strong. In Africa the light can sometimes get quite dim at sunrise and sunset as there is a lot of dust and smoke in the atmosphere.\n'Therefore, many of my favourite backlit shots were actually taken during the wet season, when rain had washed the air and you get much stronger light when the sun is low.'\nThe photographer revealed that the picture of the silhouetted African hunting dog is his favourite.\nHe said: 'One of the reasons these animals are so special to me is because they are so difficult to track down.\nHorsing around: A group of zebras in Serengeti National Park in Tanzania bathed in dusty light\nThis lion, perched on a rock in Kidepo Valley National park, makes for a truly majestic sight as he's silhouetted against the sun\nA cheetah in Liuwa Plain National Park stalks through long grass as the sun melts in the sky\nMudumu National Park in north-eastern Namibi was the setting for this sublime snap\n'It took more than ten years of travel to Africa before I was able to photograph them for the first time. Wild dogs are not just hard to find because they are endangered, they are also constantly on the move and have massive home ranges, so trying to find them is a bit like looking for a needle in a haystack.\n'To this day, I still get a thrill of excitement whenever I come across them.'\nBurrard-Lucas's speciality is using innovative devices such as 'BeetleCam' – a remote controlled buggy with a DSLR camera mounted on top - and high quality camera traps to photograph his subjects.\nAnd it was BeetleCam that took the picture of the African wild dog, 'to get a ground-level perspective as the sun was rising behind it'.\nBurrard-Lucas added: 'I aim to capture images of wildlife that are unlike anything that you might have seen before.'\nA Wildebeest stirs up dust in Kgalagadi Transfrontier Park in South Africa\nBlue wildebeest gaze around them in Liuwa Plain National Park, Zambia, as the sky turns orange and pink\nBurrard-Lucas's speciality is taking pictures using innovative devices such as 'BeetleCam' – a remote controlled buggy with a DSLR camera mounted on top - and high quality camera traps\nBurrard-Lucas said: 'I aim to capture images of wildlife that are unlike anything that you might have seen before.' This ostrich was snapped in Kgalagadi Transfrontier Park, South Africa\nMailOnline Travel recently ran pictures from Burrard-Lucas that saw him crowned the winner of the Natural World category in the 2017 Sony World Photography Awards\nIf you're keen to learn some of Burrard-Lucas’s photography secrets then sign up to his free online wildlife photography course","url":"https://www.dailymail.co.uk/travel/travel_news/article-4441066/Amazing-photos-capture-Africa-s-animals-dusk-dawn.html"}
