{"authors":[],"date_download":"2018-10-22 22:17:21","date_modify":"2018-10-22 22:17:21","date_publish":"2014-06-09 17:13:16","description":"It's like a reality show, except it features one of nature's most fearsome predators moving through the frozen Arctic.","filename":"data/vaneerConsumption/AmazingVideoCapturesPolarBearsPointofView.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/496976/polarbear_usgs_1_be82ce2ef30d28082342a99578f547ae.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_environment_amazing-video-captures-polar-bears-point-view-n126411_1540246641.html","title":"Amazing Video Captures Polar Bear's Point of View","title_page":"Amazing Video Captures Polar Bear's Point of View","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPolar bears nuzzle potential mates and play soccer with a frozen seal carcass in an amazing new video captured by collar cameras attached to the iconic animals.\nThis rare peek at Arctic life is part of an ongoing research project led by the U.S. Geological Survey that aims to track the health of Alaskan polar bears. The USGS said this is the first point-of-view video ever recorded from free-ranging polar bears.\n\"None of us have ever seen anything like this before,\" said Todd Atwood, leader of the polar bear research program at the USGS' Alaska Science Center in Anchorage. \"It's a 'gee-whiz' feeling, seeing through the eyes of a polar bear.\"\nThe collar cams also serve as fitness trackers for the polar bears: Each collar is equipped with an accelerometer, a device similar to the gadget in a fitness tracker that records a person's movement.\nWhen combined with video, scientists can decode the collar's movement data — whether the bears are eating, hunting, swimming or walking. The information will help researchers gauge how much energy the bears expend during their daily activities.\nBut the videos revealed more than the bears' calorie count. Some of the behaviors recorded on camera had never been seen before — for instance, one polar bear plunked its frozen seal carcass into the sea.\n\"These animals are hard to observe in a natural setting,\" Atwood told Live Science. \"This gives us a very unique insight into what they do on a daily basis.\"\nResearchers speculated that the seal-dipping bear might have been warming the icy seal to make it more palatable, or perhaps the bear was playing with its food as part of a mating ritual with a nearby male.\n- Becky Oskin, Live Science\nThis is a condensed version of an article that appeared in Live Science. Read the entire story here. Email Becky Oskin or follow her @beckyoskin. Follow us @livescience, Facebook & Google+.\nCopyright 2014 LiveScience, a TechMediaNetwork company. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","url":"https://www.nbcnews.com/science/environment/amazing-video-captures-polar-bears-point-view-n126411"}
