{"authors":["Joe Ciolli"],"date_download":"2018-10-30 22:47:04","date_modify":"2018-10-30 22:47:04","date_publish":"2018-07-29 00:00:00","description":"BI PRIME: If Amazon decides to enter the asset-management industry, it would be very well-positioned to succeed, Bernstein says. The firm outlines the advantages Amazon holds and discusses a blueprint that could help it achieve dominance.","filename":"data/vaneerConsumption/Amazonpositionedtodisruptassetmanagementblueprintforsuccess.json","image_url":"https://amp.businessinsider.com/images/5b5736d630fed437008b45f8-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_amazon-positioned-to-disrupt-asset-management-blueprint-for-success-2018-7_1540939624.html","title":"Amazon positioned to disrupt asset management, blueprint for success","title_page":"    Amazon positioned to disrupt asset management, blueprint for success - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Drew Angerer/Getty Images\nNothing strikes fear in an industry more than the prospect of Amazon entering the fray.\nIt's a dynamic that has played out on numerous occasions over the past year or so, with companies in industries as varied as healthcare and grocery stores taking large hits to their stock price from the mere prospect of Amazon disruption.\nSince Amazon was reported to be in talks with several large banks to launch a checking-account-like product, experts have been scrambling to assess the impact the company could have in the financial-services industry.\nAnd according to a note from the investment management and research house Bernstein, Amazon is ideally placed to disrupt asset management, a Wall Street business that has been under pressure lately to offer its services at lower fees. A handful of cash-rich mega-cap tech companies could make inroads, but Amazon poses the most realistic threat to the status quo, the note said.\nBefore we get into Bernstein's main reasons Amazon is the top choice, it's important to note just how the firm thinks it can best enter asset management.\nRather than directly entering the process of fund management and being responsible for returns, Amazon would be best off either (1) creating a so-called robo-adviser, or automated financial advisory service, or (2) using its distribution capabilities to simply act as an intermediary between clients and investment firms.\nIn its analysis, Bernstein assessed Amazon's potential to create a robo-adviser. Here are the advantages Bernstein says the company offers on that front:\n1) It already has customers\nThis addresses what Bernstein sees as the most difficult aspect of robo-advisory.\n\"It is highly likely that many of the prime targets for such an offering are already users of their product,\" Inigo Fraser-Jenkins, the firm's head of global quantitative and European equity strategy, wrote in a client note. \"This could be a major game-changer in the economics of robo-advice.\"\nFurther, Bernstein suggests a possible link between Amazon Prime membership and mutual-fund ownership, noting that roughly the same number of people are involved in each.\n\"Viewed through the lens of penetration by household wealth buckets, it seems highly likely that there is a very large overlap of current buyers of mutual funds and members of Amazon Prime,\" he said.\n2) It possesses a high degree of knowledge about end-clients and the experience of their buying decisions\n\"This could be very powerful both in terms of assessing which products the client might want to buy and also for inferring risk preferences in a way that could be more accurate than answering investment goal questionnaires,\" Fraser-Jenkins said.\nHe also notes that to the degree artificial intelligence starts to influence the practice of investing, Amazon's tech prowess could give it an easy leg up.\n3) More flexibility in affording lower fees\nThe diversified nature of a mega-cap company like Amazon affords it significant pricing power versus more focused competing businesses.\n\"Presumably if one of the big tech companies came to an asset manager and offered to distribute their products they could negotiate a significant discount,\" Fraser-Jenkins said.\nEffect on existing asset managers\nThe last point above leads into a broader discussion about the pressures being put on asset managers to cut fees. Put simply, the entry of a deep-pocketed competitor like Amazon could ratchet this tension even higher.\nEarlier this year, a blue paper released by Morgan Stanley and Oliver Wyman estimated that asset managers could eventually see half of their fees evaporate if their distribution were to shift to an \"Amazon-type marketplace\" in which funds can reach investors directly. And while it's admittedly a worst-case scenario, the sheer fact that the discussion is occurring should trouble anyone in the industry.\nFraser-Jenkins would seem to agree.\n\"We suspect that a move by 'Big Tech' into wealth management might directly or indirectly force asset management fees down further, so one conclusion we would draw is that in the case of such a move then asset managers should be prepared for a further fall in margins,\" he said.\nA blueprint for success\nJudging by the company's Chinese counterpart, Alibaba, the potential for Amazon in asset management seems significant.\nAnt Financial — Alibaba's fintech arm, which provides wealth-management services to users on the Alipay platform — has experienced immense success with its service called Yu'e Bao (which translates to \"Leftover Treasure\"). The money-market fund it offers — which is overseen by Tianhong Asset Management — has quickly become the world's largest, boasting $233 billion under management as of year-end 2017.\nA closer look at Ant also lends more credence to the idea that the traditional fee structure used by asset managers may soon be a relic of the past. For one, the service doesn't require an explicit upfront fee to use its service.\nInstead, pricing is agreed upon by Ant and the fund managers who operate through its platform. From there, Ant separates users into different groups based on factors like experience, then relays that information to fund managers. It then, in turn, charges them a fee for using the technology.\nBernstein argues that a similar structure makes a ton of sense for Amazon given the multiple advantages outlined above. In the end, Bernstein sees all of these factors as putting Amazon in the best position to achieve this sort of disruption in the US.\n\"The core learning points for other tech companies interested in this area are likely to be the ability to use knowledge of an already existing customer base to suggest investments and the use of existing (and trusted) payment systems as a gateway to broader financial intermediation,\" said Fraser-Jenkins.","url":"https://www.businessinsider.com/amazon-positioned-to-disrupt-asset-management-blueprint-for-success-2018-7"}
