{"authors":["Frank E. Lockwood"],"date_download":"2018-10-30 19:10:37","date_modify":"2018-10-30 19:10:37","date_publish":"2016-05-11 00:00:00","description":"At Cassandra Butts' memorial service Tuesday, President Barack Obama paid tribute to his law school classmate and longtime friend, omitting any mention of the ambassadorship that had been denied her.","filename":"data/vaneerConsumption/AmbassadornomineediesstillonSenCottonshold.json","image_url":"https://media.arkansasonline.com/img/photos/2016/05/11/resized_99263-congress-afghanistan-_jenk_80-21177_t600.JPG?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_jun_09_nominee-dies-still-on-hold-20160609-2__page=4_1540926637.html","title":"Ambassador nominee dies still on Sen. Cotton's 'hold'","title_page":"Ambassador nominee dies still on Sen. Cotton's 'hold'","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Sen. Tom Cotton, R-Ark., is shown in this Jan. 28, 2016 file photo. - Photo by AP / ALEX BRANDON\nWASHINGTON -- At Cassandra Butts' memorial service Tuesday, President Barack Obama paid tribute to his law school classmate and longtime friend, omitting any mention of the ambassadorship that had been denied her.\nBut others are lamenting that she spent her final days with her nomination in limbo, and they're blaming U.S. Sen. Tom Cotton for derailing her dream.\nThe Republican from Dardanelle had placed a \"hold\" on Butts' bid to be U.S. ambassador to the Bahamas, stalling it while he pushed the White House to punish Secret Service officials who had illegally snooped into a Republican congressman's private records.\nButts, 50, fell ill last month, dying without knowing that she had acute leukemia, The Washington Post reported.\nCotton spokesman Caroline Rabbitt said the hold was not related to Butts' fitness to serve as Ambassador Extraordinary and Plenipotentiary of the United States of America to the Commonwealth of the Bahamas.\n\"His purpose was to get the president's attention,\" she said in an interview.\n\"Senator Cotton had a great deal of respect for Ms. Butts and her career. He was unaware of any illness she may have had and his deepest sympathies are with her family and friends as they mourn her loss,\" she wrote in a subsequent email.\nThe senator had spoken with Department of Homeland Security Secretary Jeh Johnson about lifting the hold, but Cotton wanted the Secret Service agents' misconduct to be dealt with first, Rabbitt said.\nJohnson announced May 26 that more than 40 agency employees had been disciplined. Butts died on May 25.\nFrank Bruni, a New York Times columnist, wrote a June 6 opinion piece about the standoff, describing Butts as \"a pawn in [Washington's] power games and partisanship.\"\nButts, a former deputy White House counsel, had been nominated by Obama in February 2014. She spent the final 27 months of her life waiting for the Senate to decide her fate. Initially blocked by U.S. Sen. Ted Cruz, R-Texas, she found her path blocked by Cotton, beginning in October 2015.\nDescribing Cotton's role, Bruni portrayed the episode as another example of \"dysfunctional pettiness\" on Capitol Hill.\nDemocratic Party of Arkansas spokesman H.L. Moody called the maneuver \"politics as usual for Tom Cotton.\"\n\"Just holding up a nomination to get at the president -- that's not a good enough reason to keep good and capable people out of jobs that need to be filled,\" Moody said.\nUnder Senate rules, a single senator can block legislation or a presidential nomination by submitting \"a notice of intent to object\" to Senate leaders.\nAlthough the Senate majority leader isn't required to do so, he typically does prevent the matter from moving forward. Minor items are sometimes stalled for years.\nUntil recently, senators could place anonymous holds, killing legislation without facing the heat. These days, the names of senators placing long-term holds are published in the Congressional Record.\nEven though Butts is dead and now gone, Cotton's hold goes on. It was printed in Wednesday's edition of the Senate Executive Calendar, appearing on Page 23.\nThe deceased's name is sandwiched between two other unlucky picks: Brodi L. Fontenot of Louisiana, nominee to be chief financial officer to the Department of Treasury, and Jane Toshiko Nishida of Maryland, Obama's choice to be assistant administrator of the Environmental Protection Agency.\nU.S. Sen. Charles Grassley, R-Iowa, has blocked Fontenot since April 28, 2015.\nU.S. Sen. John Boozman, R-Ark., has been holding up Nishida's nomination since May 26.\nA spokesman for Grassley said the senator isn't questioning Fontenot's competence. His quarrel is with the Financial Crimes Enforcement Network of the Treasury Department. Grassley has raised questions about the enforcement network's hiring practices.\n\"He's just trying to get the emails about controversial hiring at FinCEN,\" the spokesman said.\n\"Sen. Grassley isn't opposed to Mr. Fontenot as assistant secretary,\" she added.\nSimilarly, Boozman isn't disputing Nishida's qualifications, abilities or fitness. But he's unhappy with others in the department.\n\"The senator placed a hold over concerns that the EPA has not provided adequate resources for the water quality modeling project in the Illinois River watershed in Arkansas,\" said Boozman spokesman Patrick Creamer.\nThe senator has been sharing those concerns with the EPA for at least five years and isn't satisfied with the response, Creamer added.\n\"Basically he is trying to get answers and actions out of them,\" Creamer said. \"Once we can receive those answers and assurances from the EPA, the senator said that he'd be happy to lift the hold and do what he can to facilitate the consideration of the nominee.\"\nA hold can send a wake-up call to agencies and get them to pay attention. \"A lot of times, senators will use the ability to place a hold on a nominee to force the agency to respond if they're being nonresponsive,\" he added.\nA White House official said she hopes Boozman will allow Nishida's nomination to proceed.\n\"Jane Toshiko Nishida is an eminently qualified candidate to be an assistant administrator of the Environmental Protection Agency, and would bring 30 years of experience to this critical role. We urge the Senate to act quickly to confirm her,\" she said.\nMetro on 06/09/2016","url":"https://www.arkansasonline.com/news/2016/jun/09/nominee-dies-still-on-hold-20160609-2/?page=4"}
