{"authors":["Ross Mcdonagh For Dailymail.Com"],"date_download":"2018-10-23 05:28:11","date_modify":"2018-10-23 05:28:11","date_publish":"2016-01-29 21:14:06","description":"Amber Rose will not become auntie to North West any time soon. The 32-year-old shot down rumours she is dating Scott Disick on Thursday, in an interview on the Allegedly podcast","filename":"data/vaneerConsumption/AmberRosedeniesdatingScottDisickafterfollowinghimonInstagram.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/21/30B53FD300000578-0-image-a-29_1454102030496.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423337_Amber-Rose-denies-dating-Scott-Disick-following-Instagram-two-days-Rob-Kardashian-Blac-Chyna-hook-up_1540272491.html","title":"Amber Rose denies dating Scott Disick after following him on Instagram","title_page":"Amber Rose denies dating Scott Disick after following him on Instagram | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Amber Rose has been hanging out in the same circles as Scott Disick lately. They even spent time together in Las Vegas.\nAnd the curvy model has also been following him on Instagram, which has invited speculation that the two may be more than friends.\nBut on Thursday the 32-year-old shot down rumours she is dating Kourtney Kardashian's ex. Speaking to Theo Von and Matthew Cole Weiss' Allegedly podcast, Amber said he was 'cool,' but they are not together.\nScroll down for video\nJust friends: Amber Rose denied dating Scott Disick on Thursday after following him on Instagram within two days of Rob Kardashian and Blac Chyna hook up\nLinked: Both Amber and Scott were mentioned in this Instagram photo at the airport\n'That is so not true,' she said. 'Ok, this is the thing with Scott, which is really unfortunate because I didn't want to be in that messy situation, I met him three times.\n'He's a really cool guy. I met him through mutual friends,' she continued. 'We've never hung out together alone or nothing like that. We're not close. I don't know him like that.'\nThe 'messy situation' she refers to is Rob Kardasian being connected to her best friend Blac Chyna, who also happens to by baby momma to Tyga, who's currently dating Rob's little sister Kylie Jenner.\nOn top of that, Amber herself just got involved in a very public feud with Rob's brother-in-law Kanye West - who she dated for two years - following his Twitter bust up with her baby daddy Wiz Khalifa.\nMixed up: She said it was really unfortunate her name got dragged into the 'messy situation' involving her best friend Blac Chyna\nShe claimed it was just coincidence she started following him on Instagram withing two days of Chyna and Rob's emerging as a couple.\n'I was like, you know, I'm very positive. I started following Khloe [Kardashian] on Instagram, and I was like let me follow Scott, too. He's a really nice guy.\nShe said that's when the rumour kicked off: 'Amber's dating Scott,,, and then Chyna's dating Rob so then that's why Amber follows Scott,' she scoffed.\nMessy: Rob Kardasian is now confirmed to be dating Chyna, who also happens to by baby momma to Tyga, who's currently dating Rob's little sister Kylie Jenner\n'I followed Scott two days before that. You guys just posted it after Chyna potsed Rob to make me look extra petty. And that really wasn't what happened,' she insisted. 'But no, i am not dating Scott. I don't really know him that well.'\n'It's f***ed up because when you try to be nice, you cant be nice - you're being petty,' she continued. 'But when you're being petty, it's like you're the queen of clapbacks... I don't even want to be known for that sh*t.'\nShe said that though she is 'technically single', she is dating and talking to guys, and thinks she may even have a valentine... but he is not a musician.\nMore mess: On top of that, Amber herself just got involved in a very public feud with Rob's brother-in-law Kanye West - who she dated for two years - following his Twitter bust up with her baby daddy Wiz Khalifa\nIt's war:Amber got involved when Kanye and Wiz started swinging handbags over Twitter\nClose to the bone: The models took it to a very personal level with her ex\n'I feel like I'm done with musicians because of the lifestyle- the late night studio sessions. I need something different,' she said.\n'I would possibly date an actor, maybe try an athlete. Listen, I would try a normal guy, if it's the right thing. They don't have to be famous. I'm all about chemistry and feelings. If it's chemistry then I'm just going to go with it.'\nShe said she is attracted to creative guys, and the reason she would be wary of dating someone non famous was they might steal stuff from her house or try sneak photos of her sleeping.\nConvoluted: If Chyna ever did marry Rob and Amber married Scott, they would both would both become aunties to Kanye's kids, while Rob and Kylie would both be step-parents to the same child","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423337/Amber-Rose-denies-dating-Scott-Disick-following-Instagram-two-days-Rob-Kardashian-Blac-Chyna-hook-up.html"}
