{"authors":["Becky Freeth For Mailonline","Shyam Dodge For Dailymail.Com"],"date_download":"2018-10-22 22:56:17","date_modify":"2018-10-22 22:56:17","date_publish":"2016-01-28 11:30:22","description":"Amber, 32, continued to provoke the US rapper, 38, with a crude slogan emblazoned on her top after shocking the internet with an explicit insight into their sex life during the spat.","filename":"data/vaneerConsumption/AmberRosehighlightsherincrediblecurvesinskintightleggingsandacheekysloganTeeafterexplosivepublicrowwithexKanyeWest.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A9AD8900000578-0-image-a-28_1453980035217.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420726_Amber-Rose-highlights-incredible-curves-skintight-leggings-cheeky-slogan-Tee-explosive-public-row-ex-Kanye-West_1540248977.html","title":"Amber Rose highlights her incredible curves in skintight leggings and a cheeky slogan Tee... after explosive public row with ex Kanye West","title_page":"Amber Rose highlights her incredible curves in skintight leggings and a cheeky slogan Tee... after explosive public row with ex Kanye West | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"After the he said, she said died down, Amber Rose certainly had the last word on Thursday.\nThe curvaceous blonde bombshell drew attention to her refined hourglass shape as she hit the gym the morning after igniting an explosive Twitter row with ex Kanye West.\nAmber, 32, continued to provoke the US rapper, 38, with a crude slogan emblazoned on her top after shocking the internet with an explicit insight into their sex life during the spat.\nScroll down for video\nHitting him back: Amber Rose had the last word on the Kanye West feud on Thursday when she hit the gym with her figure on show\nHer bright yellow top read, 'Make eye contact while eating a banana,' just hours after a short, shocking and sexually explicit tweet of hers caused a collective gasp across the Internet after appearing to expose Kanye's habits in the bedroom.\nIt read: 'Awww @kanyewest are u mad I'm not around to play in ur a*****e anymore?#FingersInTheBootyA**B**ch'.\nAmber was putting paid to his leaked song lyrics - the Waves album snipped that was thought to have sparked Wednesday's online retaliation - in which the rapper insinuated that she didn't look as good as she used to when they dated.\nThe star was boldly drawing attention to her toned shape in skintight boots; her clingy top tucked into her contrastingly tiny middle.\nIncredible curves: She peeped from beneath her cap, but definitely wasn't hoping to go unnoticed\nTake that: She put paid to Kanye's lyrics that appeared to suggest she didn't look as good as she used to when they dated\nGraphic: Amber fired off a very crude Tweet when an angry exchange erupted between her ex-husband Wiz Khalifa and Yeezus rapper Kanye\nKanye reignited his long war with his ex-girlfriend, not long after the lyrics leaked, when he dragged her name into a 30 tweet tirade against fellow rap artist Amber's ex-husband Wiz Khalifa, on Wednesday.\nThe latest chapter in this ugly battle of the exes began when Kanye launched an epic rant at Wiz, Amber's rapper ex-husband, and father of her son, Sebastian.\nInitially, Kanye, 38, referred to Amber as a 'stripper' and implied she was a gold digger by referencing lyrics to his hit song during an exchange with Wiz.\nKanye wrote: 'You let a stripper trap you,' referencing Amber and Wiz's soon two-year-old son Sebastian.\nNot playing clean: Initially, Kanye, 38, referred to Amber as a 'stripper' and implied she was a gold digger by referencing lyrics to his hit song during an exchange with Wiz (pictured last week arriving at LAX)\nHitting back: Amber, pictured at the Golden Globes on January 11, appeared to give an explicit insight into her love life with Kanye\nHe taunted afterwards: 'I know you mad every time you look at your child that this girl got you for 18 years.'\n'You wouldn’t have a child if it wasn’t for me.'\nKanye later deleted his tweets after Amber got involved with her crude missive and she later added: 'Lol Now u wanna delete ur tweets cuz Muva has arrived?'\nThe cause of the vitriolic exchange on Wednesday appears to have been that Wiz was upset over Kanye renaming his album Waves, which is a term in the hip-hop community in reference to the style of rapper Max B, who is currently in prison.\nThough the conflict may have also had something to do with a new leaked track from Kanye's upcoming seventh studio album, where he appeared to blast Amber's looks.\nVolatile: Kanye, here in June 2009 with Amber, has previously stated he only dated her because his now wife Kim Kardashian was not available\nThrowback: Amber, here in January 2010, was 25 when she first dating Kanye in 2008\nA snippet from the track, featured the lyrics: 'My ex said she gave me the best years of her life, I saw a recent picture of her, guess she was right.'\nAmber, now 32 and a mother-of-one, dated the U.S. artist between 2008 to 2010 and claimed to have broken up with him over his now-wife Kim Kardashian.\nIt's fair to say the relationship did not end amicably with Amber branding Kim, the mother of Kanye's two children, a 'homewrecker'.\nIn January 2012, Amber accused Kanye of cheating on her with Kim, who was then dating American footballer player Reggie Bush.\nShe told America's Star magazine: 'They were both cheating. They were both cheating on me and Reggie with each other.\n'She was sending pictures, and I was like, \"Kim, just stop. Don’t be that person.\"'\nMuva and the rapper! Amber dated Wiz on and off for five years, having their son Sebastian in 2013 and marrying later that year, pictured in August 2014 at the MTV VMAs; they split one month later\nKanye was bold about slamming his former girlfriend in 2015 when he said in an interview that he had to take '30 showers' after dating Amber.\nHe candidly confessed: 'If Kim had dated me when I wanted, there would be no Amber Rose.'\nThe rapper is said to have had his eye on Keeping Up With The Kardashians star Kim as early as 2008, naming her his 'girl of the week' in early blog posts which resurfaced in October 2014.\nHe added in the one-to-one: 'It's very hard for a woman to want to be with someone that's with Amber Rose. I had to take 30 showers before I got with Kim.'\nGoing to war: Kanye unleashed a stream of consciousness list of vitriol on Wednesday\nAt the time, Amber responded by tweeting: 'After all these years I never snitched on u and I don't plan on starting now. We once loved each other so I won't do u like that.'\n'I'll leave that up to the Kartrashians to humiliate u when they're done with u,' she added.\n'I'm always so quiet and just a cool fun girl,' she wrote. 'The funny thing is I'm all for a woman making something out of nothing.'\nKanye is said to have spotted Amber on a video shoot for Ludacris' 2008 single What Them Girls Like and they struck up a bond.\nAfter their relationship broke down, Amber dated Wiz on and off for five years, having their son Sebastian in 2013 and marrying later that year. The two then split in September 2014.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420726/Amber-Rose-highlights-incredible-curves-skintight-leggings-cheeky-slogan-Tee-explosive-public-row-ex-Kanye-West.html"}
