{"authors":["Chelsea White","Justin Enriquez For Dailymail.Com"],"date_download":"2018-10-23 02:15:42","date_modify":"2018-10-23 02:15:42","date_publish":"2016-01-28 17:05:53","description":"On Wednesday, the 32-year-old went on the Allegedly podcast , and made it clear - say all you want about her, but if you come after her little boy there will be hell to pay.","filename":"data/vaneerConsumption/AmberRosebrandsKanyeWestafkingclownafterherclaimstoownherson.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/17/30AC9A4300000578-0-image-a-22_1454001933476.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421324_Amber-Rose-brands-Kanye-West-f-king-clown-claims-son-epic-Twitter-rant-ex-Wiz-Khalifa_1540260942.html","title":"Amber Rose brands Kanye West a 'f**king clown' after her claims to 'own' her son","title_page":"Amber Rose brands Kanye West a 'f**king clown' after her claims to 'own' her son | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Don't mess with this Muva bear's little cub, because the claws will come out.\nAmber Rose has fired back again at ex Kanye West after the rapper made derogatory comments about her and her son Sebastian in an epic Twitter battle with her estranged husband Wiz Khalifa.\nOn Wednesday, the 32-year-old went on the Allegedly podcast, and made it clear - say all you want about her, but if you come after her little boy there will be hell to pay.\nScroll down for video\n'It shows what type of person he is!: Amber Rose (pictured last year) has fired back again at ex Kanye West on the Allegedly podcast after the rapper made derogatory comments about her and her son Sebastian in an epic Twitter battle with her estranged husband Wiz Khalifa\nMaking it clear: The model said about the rapper (seen here Wednesday), 'Listen don't talk about my kid, that's all I got to say, don't talk about my baby. I wouldn't have said anything if it was just between him and Wiz, that's two grown men hashing it out'\nWhile not out till Friday, TMZ obtained a snippet of the interview with Matt Cole Weiss and Theo Von and the star brings rationality - but keeps the cuss words - back into the fight.\nAmber, who refers to herself as Muva, said in the preview: 'I would never talk about kids in an argument, it just shows what type of person he is.'\nThe model - who dated Kanye for two years - said she would never speak about his children with Kim Kardashian North and Saint and was even willing to hold her tongue despite the star constantly referring to her in songs, even in his newest album.\n'Even him saying things about my son I still didn't say anything about his kids, they are innocent babies, you don't talk about a baby, ever, ever. That just shows how f**king ridiculous he is.\nSee more of the latest on Kanye West's Twitter feud with ex-girlfriend Amber Rose\nNot shocked: The 32-year-old (pictured earlier this month) said she was not shocked her ex thought it was alright to drag her child into a twitter fight as 'he is a f**king clown'\nTaking the high road: The model said she would never speak about his children with Kim Kardashian, North (pictured November) and Saint, and was even willing to hold her tongue despite the star constantly referring to her in songs, even in his newest album\nNever forget: The star (seen here last month) said children should never be used as targets, 'they are innocent babies, you don't talk about a baby, ever, ever'\n'The crazy thing is he came out with a song last week saying I had my son for a meal ticket and I didn't even say anything, I was just like ''he's a corn ball and I'm not saying s**t.''\n'Listen don't talk about my kid, that's all I got to say, don't talk about my baby. I wouldn't have said anything if it was just between him and Wiz, that's two grown men hashing it out.\n'Hashing it out that's their business, I would have kept it cute and minded my own business but don't bring in my baby that's so corny.'\n'F**k Kanye!': while Wiz did his best to stay calm and play nice on social media as his fellow rapper ranted on and on, he made sure to name check Kanye when he stepped out on stage in Argentina\nAsked if she was surprised Kanye decided to take his fight with Wiz to such a personal level and speak about her son - who turns three next month - Amber responded: 'No because I know him, I know he is a f**king clown, I know him.'\nAnd she certainly does because, as Amber reminded Kanye, they dated from 2008 till 2010.\n'He gets on the internet today and says ''a stripper trapped you Wiz'' but like you took me around the world, we dated for like two years but you're talking s**t about Wiz and my baby.'\nHistorical reminder: Amber pointed out that while Kanye attacked her and her estranged husband Wiz saying a he had been trapped by a stripper, Amber and the now Mr Kim Kardashian dated for two years (they are pictured together in New York back in March 2009)\nAsked where all the animosity comes from, with the host suggesting jealousy, the model said: 'I mean he still talks about me in songs, he still talks about me all day.'\nOne part of the Twitter war Amber, who has candidly admitted to once being a stripper way before Kanye used it to call her out for it, was not speaking about was her rather graphic response on Wednesday to her ex's comments.\nThe star avoided talking about her tweet: 'Are you mad I'm not around to play in ur a**hole?'\nRanted too: One part of the Twitter war Amber, who has candidly admitted to once being a stripper way before Kanye used it to call her out for it, was not speaking about was her rather graphic response on Wednesday to her ex's comments\nIt's war: The star also suggested she was the one winning the battle on social media with a hashtag, '#UrGettingBodiedByAStripperN***a' which means murdered\nThe star also suggested she was the one winning the battle on social media with a hashtag, '#UrGettingBodiedByAStripperN***a' which means murdered.\nShe tweeted: 'Lol @Kanyewest Now u wanna delete ur tweets cuz Muva has arrived?'\nThe tweets she is referring to are part of an epic tirade by the 38-year-old rapper at her son's father Wiz.\nWild, wild West: This all started after Kanye (seen here earlier this month) unleashed a tirade at Wiz (pictured 2014) on Twitter on Wednesday\nAnd while Wiz did his best to stay calm and play nice on social media as his fellow rapper ranted on and on, he made sure to name check Kanye when he stepped out on stage in Argentina.\nWiz kicked off his song Taylor Gang by saying: 'You just wanna write s**t up? You just wanna talk s**t on the internet, huh?'\nDiss: The feud began when Kanye announced he changed the name of his upcoming album to Waves, which Wiz took umbrage to as he felt it disrespected the legacy of rapper Max B, who was the founder of the Wave sound (seen here in undated image)\nThen in half way through the track, as capture in fan video by Nahu Marin, the 28-year-old yells: 'F**k Kanye!'\nThe feud began when Kanye announced he changed the name of his upcoming album to Waves, which Wiz took umbrage to as he felt it disrespected the legacy of rapper Max B, who was the founder of the Wave sound. He is currently serving 75 years in prison for a deadly armed robbery.\nWave and Wavy in Max B's world means influential or cool leading many to believe Kanye lifted the name on purpose - including Wiz\nKanye let Wiz's thoughts on the title initially slide but the See You again rapper then tweeted something with 'KK,' in it. Kanye thought he was talking about Kim Kardashian and unleashed - despite it actually being a reference to marijuana.\nIn true Kanye style, he came up with 17 reasons why Wiz needs to know his place including insulting Amber, claiming to 'own' their son Sebastian as well as accusing him of stealing his style from rapper and Kanye protege Kid Cudi.\nKanye did however, praise Wiz for his ability to rock skinny jeans whilst claiming to have blazed the fashion path for the slender rapper to do so.\nKanye's epic rant aimed at Wiz including strong words like: 'You let a stripper trap you.'\n'I know you mad every time you look at your child that this girl got you for 18 years [making reference to his big hit Gold Digger].\n'You wouldn’t have a child if it wasn’t for me. Your own Waves? I own your child!'\nBut he threw in a few compliments too in the bizarre outburst, saying: 'I think you dress cool I wish I was skinny and tall... Maybe I couldn’t be skinny and tall but I’ll settle for being the greatest artist of all time as a consolation.'\nEpic: The 38-year-old rapper went on an epic Twitter rant as he took aim at Amber, Wiz's child, his rapping style but not his skinny jeans\nBut then Kanye took the credit, noting: 'I am your OG and I will be respected as such. I made it so we could wear tight jeans.'\nIt seemed as if Kanye finally got the message as he deleted the string of tweets because it was all about 'positive energy.'\nAfter three hours, Wiz finally took to Twitter again but did not address any of Kanye's tweets but instead promoted his concert as he wrote: 'First show in Argentina is tonight. Meet and Greets at 7. I go on at 9.'\nRegret? After the string of tweets, Kanye posted much more positive messages and said he was sad about what had occurred\nClarification: Kanye did admit that everything involving 'KK' was a misunderstanding and that it was actually a reference to marijuana\nWhile Kanye backed down about Wiz, his focus on Amber remains. Their relationship has been up for discussion as a leaked track from his upcoming seventh studio album appeared to blast his ex by suggesting she doesn't look as good as she used to.\nA snippet from the track, features the lyrics: 'My ex said she gave me the best years of her life, I saw a recent picture of her, guess she was right.'\nIt's fair to say the relationship did not end amicably with Amber previously branding Kim, the mother of Kanye's two children, a 'homewrecker'.\nLow blow: Kanye wrote 'you own waves ??? I own your child !!!' about the couple's little boy, who is three next month (seen here last month)\nInteresting initials: Wiz mentioned 'KK' and it seemed to set Kanye off as he thought it was a reference to his wife Kim Kardashian\n'Don't take the wave': The 28-year-old rapper posted about the Wave movement on Tuesday night\nKanye slammed his former girlfriend in 2015 when he said in an interview that he had to take '30 showers' after dating Amber.\nHe added in the one-to-one: 'It's very hard for a woman to want to be with someone that's with Amber Rose. I had to take 30 showers before I got with Kim.'\nAmber and Wiz married in July 2013 but filed for divorce just over a year later in September 2014. They remain amicable.\nExplanation: Wiz did not respond very much during Kanye's epic rant but he did explain what 'kk' meant\nIgnoring: Several were waiting for the See You Again rapper's response but he decided not to acknowledge the posts as he opted to promote his concert in Argentina instead\nMeanwhile the man over whom the entire argument started - Max B - wasn't taking any sides.\nHis Twitter account posted on on Thursday: 'Im truly flattered by all the emulations. Thnks for the love&support. Lets stay positive.'\nHe finished it with a link to the petition to see him freed from prison.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421324/Amber-Rose-brands-Kanye-West-f-king-clown-claims-son-epic-Twitter-rant-ex-Wiz-Khalifa.html"}
