{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 03:02:31","date_modify":"2018-10-23 03:02:31","date_publish":"2016-01-11 15:28:52","description":"She is not known as one who covers up. On Sunday, Amber Rose shared several racy pictures on Instagram that featured the video model posing in several racy ways.","filename":"data/vaneerConsumption/AmberRosewearsskimpyleopardswimsuittoshowoffherimpressivecurves.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300B315C00000578-0-image-a-4_1452523865800.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393986_Amber-Rose-wears-skimpy-leopard-swimsuit-impressive-curves-gets-Eight-Ball_1540263751.html","title":"Amber Rose wears skimpy leopard swimsuit to show off her impressive curves","title_page":"Amber Rose wears skimpy leopard swimsuit to show off her impressive curves | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She is known for her killer curves.\nAnd on Sunday, Amber Rose showed them off in a racy photo shoot that she shared on her Instagram account.\nThe 32-year-old beauty wore a leopard print swimsuit to play a game of pool.\nScroll down for video\nIn one shot, the ex-wife of Wiz Khalifa laid down, abs curved up, on a pool table.\nPool balls scattered about, Amber placed a cue stick in between her pose.\nThe video model wore a pair of black, platform heels, hoop earrings and sunglasses.\nAnother shot features an up-close view of Amber, tattoos on full display.\nThe waist training spokesmodel pasted her tongue against the cue stick.\nHer right arm held the stick, while her left arm showcased her long nail manicure, hand placed on top of it.\nIn the final shot, cropped blonde sat up on the table, back arched to exaggerate her figure.\nFace turned towards the camera, Amber placed the cue stick behind her, appearing to shoot pool from a backwards stance.\nThe risque photos were taken by photographer Brendan Forbes.\nThe New York-based photographer has worked with Amber before, including Karrueche Tran and singer Cassie.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393986/Amber-Rose-wears-skimpy-leopard-swimsuit-impressive-curves-gets-Eight-Ball.html"}
