{"authors":[],"date_download":"2018-10-30 20:21:11","date_modify":"2018-10-30 20:21:11","date_publish":"2015-12-08 11:36:43","description":"An ambulance driver is being blamed for Tuesday’s predawn wreck that sent an Emory University bus careening through the front of a business in south DeKalb County and nearly a dozen people to the hospital.","filename":"data/vaneerConsumption/AmbulancedrivercitedincrashwithEmorybus.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/12/08/Images/photos.medleyphoto.8469876.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_traffic_ambulance-driver-cited-crash-with-emory-bus__1540930871.html","title":"Ambulance driver cited in crash with Emory bus","title_page":"Ambulance driver cited in crash with Emory bus","title_rss":"NULL","source_domain":"ajc.com","text":"An ambulance driver is being blamed for Tuesday’s predawn wreck that sent an Emory University bus careening through the front of a business in south DeKalb County and nearly a dozen people to the hospital.\nDeKalb fire Capt. Eric Jackson said the wreck, which happened about 6 a.m. at the intersection of Candler and Glenwood roads, involved the bus, a non-emergency transport ambulance and a private vehicle. The bus ended up nearly halfway into a tax preparation business.\nThere were 12 people on the bus, three in the ambulance and one in the car, according to Jackson.\nNine people from the bus were taken to Grady Memorial Hospital and Atlanta Medical Center, along with the patient who was being transported in the ambulance.\nWhile fire officials at the scene initially believed that one person was critically injured, “all injuries turned out to be minor,” according to DeKalb police Capt. S.R. Fore.\nAccording to Emory spokeswoman Elaine Justice, all eight taken to Grady were in good or stable condition Tuesday afternoon, and the two taken to Atlanta Medical Center were in good condition.\nFore said the driver of the ambulance, Lemonte Renard Weaver, was cited for a red light violation.\n“He went through the red light and struck the bus, forcing it into the building,” Fore told The Atlanta Journal-Constitution.\nWeaver told investigators he fell asleep at the wheel, Channel 2 Action News reported. In July 2014, Weaver was cited for street racing, but pleaded guilty the following October to a charge of driving too fast for conditions, according to DeKalb court records.\nJustice said the bus departed the school’s South DeKalb Park and Ride lot at the Gallery at South DeKalb Mall at 5:55 a.m. and made several stops before the wreck. Most of the passengers boarded the bus at the mall. Most of those on the bus were Emory employees, she said.\nThe intersection of Candler and Glenwood roads was closed for more than two hours and reopened to traffic about 8:30 a.m.\n— Staff writer Alexis Stevens contributed to this article.","url":"https://www.ajc.com/news/traffic/ambulance-driver-cited-crash-with-emory-bus/8ilSSq6wydrSzsrYGF6JWM/"}
