{"authors":["Amanda Aronczyk"],"date_download":"2018-10-22 21:25:34","date_modify":"2018-10-22 21:25:34","date_publish":"2016-06-01 00:00:00","description":"When Giselle decided to apply to medical school, people told her to hide the fact that she has struggled with anxiety, depression and a suicide attempt. She thinks it will help her be a better doctor.","filename":"data/vaneerConsumption/AMedStudentDecidesToBeUpfrontAboutHerMentalIssues.json","image_url":"https://media.npr.org/assets/img/2016/05/31/uw-3_wide-824b9ee753bb4b858f80f0dd8d11d3554b793d81.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2016_06_01_480173677_a-med-student-decides-to-be-upfront-about-her-mental-issues_1540243534.html","title":"A Med Student Decides To Be Upfront About Her Mental Issues","title_page":"Medical Student Says Her Mental Health Issues Will Make Her A Better Doctor : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"A Med Student Decides To Be Upfront About Her Mental Issues\nEnlarge this image toggle caption Amanda Aronczyk/WNYC Amanda Aronczyk/WNYC\nAt first Giselle wasn't sure what to put on her medical school application. She wanted to be a doctor, but she also wanted people to know about her own health: years of depression, anxiety and a suicide attempt. (We're using only her first name in this story, out of concern for her future career.)\n\"A lot of people were like, you don't say that at all,\" she said. \"Do not mention that you have any kind of weakness.\"\nGiselle remembers having her first intense suicidal thoughts when she was 10 years old. Her parents had split up and she had moved from the coast of Colombia to Chicago. She started having extreme mood swings and fighting with her mom.\nAnd then, when she was 16 years old, she tried to kill herself. \"Yeah, lots of pills.\"\nAfter her suicide attempt she began therapy and eventually started taking antidepressants. That worked extremely well. After finishing high school, she took an unconventional route. She went to Brazil to work with a women's community health group, worked as a research assistant for a doctor, and trained as a doula to assist women in labor. It was while working as a doula and witnessing what she saw as insensitive behavior from a doctor that she resolved her own career indecision: She would become a different kind of doctor.\nWhen she applied to medical school, she told them this whole story in her application. In the fall of 2014, she started at the University of Wisconsin School of Medicine and Public Health.\nGiselle picked Wisconsin in part because it offered unlimited free counseling for medical students. And her mentor, Dr. Christopher Hildebrand, says she has always been transparent about her struggles.\n\"She allowed me into her life right away,\" he says.\nBut medical school hasn't been easy for Giselle. She felt overwhelmed and failed an exam in her first few weeks. In her second semester she had a panic attack during a test. The school let her retake the tests, and she did well.\nBut then Giselle was called to committee, kind of a jury of medical school staff who intervene when a student is struggling with their work. She said there was a box of tissues and a room full of people in a semicircle.\nThe head of the committee asked Giselle if she could handle her issues and if she was cut out for the stressful life of a doctor.\n\"I walked away from that and I was just so furious, like I felt so hurt,\" she says. Ultimately, the committee was pleased with her improvement on the test scores, and she was not put on academic probation. The school agreed to allow Giselle to do her second-year coursework over two years.\nEnlarge this image toggle caption Amanda Aronczyk/WNYC Amanda Aronczyk/WNYC\nMedical schools struggle with finding the balance when it comes to mental health. Anxiety and stress are common. So when is it a health problem? But Giselle's mentor Hildebrand says she never uses her mental health as an excuse. In fact, he says, going through what she has struggled with could make her a better doctor in the long run.\n\"We need Giselles in medicine,\" he says. \"We need people who are unafraid to have the insight to talk about not only their own struggles in life, but how that relates to others.\"\nMedical training often involves numerous risk factors for mental illness, including lack of sleep, isolation and a lack of a support system. Physicians are at more risk for suicide than the general population. But despite this, mental health among medical students, interns and physicians often doesn't get the attention it deserves.\nThe University of Wisconsin medical school is trying to help students like Giselle with therapists and tutors. And Giselle uses those services. She is also adamant about being open about her mental health issues. One time she posted about it on Facebook:\n\"Dealing with academic administration is an awful part of med school. It's a medieval-like process of judgment and punishment to ask for help or find yourself struggling with all the exams,\" she wrote.\nThe school questioned whether her post was a good idea, Giselle says, but she thinks it helped other students open up about their own struggles.\n\"And I kind of just stumbled upon this role of being like, the person that speaks on behalf of the anxious and depressed.\"\nSharing Your Story WNYC and NPR recently asked listeners: Have you ever had a hard time talking openly about your mental health? We'll be posting some of these responses on Facebook throughout the series.\nFor more on WNYC's Only Human podcast series on mental health, check here. You can stay in touch with @OnlyHuman on Twitter and @Only Human on Facebook.","url":"https://www.npr.org/sections/health-shots/2016/06/01/480173677/a-med-student-decides-to-be-upfront-about-her-mental-issues"}
