{"authors":["Harriet Mallinson For Mailonline"],"date_download":"2018-10-22 23:05:25","date_modify":"2018-10-22 23:05:25","date_publish":"2016-01-29 10:51:37","description":"American toddler, Elliot was thought to be napping but in fact had raided her mum's make-up and smeared black eyeliner all over her face. Other funny videos also show what kids get up to when alone.","filename":"data/vaneerConsumption/AmericantoddlerElliotstealsmumsmakeupandsmearitalloverherself.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/10/30B16D4E00000578-0-image-a-5_1454064207160.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422354_American-toddler-Elliot-steals-mum-s-make-smear-face-body_1540249525.html","title":"American toddler Elliot steals mum's make-up and smear it all over herself","title_page":"American toddler Elliot steals mum's make-up and smear it all over herself | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Many similarly hilairous videos show what kids get up to when left alone\nblack creme eyeliner all over her face and body\nIt's a well known fact that many girls love to dress up as adults and borrow their mother's make-up, but one American girl took the transformation a bit too far.\nElliot's mother believed that her toddler was in the middle of a peaceful nap.\nHowever, in reality she was getting very busy rummaging through her mother's makeup kit. Instead of the usual act of plastering lipstick all over her mouth, Elliot had discovered some creme eyeliner.\nBeaut Queen:American toddler Elliot smeared the creme black eyeliner all over herself while her mum thought she was sleeping\nPerhaps she needs to watch her mother's make-up application more carefully as the toddler doesn't just rub the creme on her eyes but proceeds to smear it all over her face and body.\nNaked apart from a nappy Elliot's face is nearly completely covered with the black substance.\nShe holds her hands up, paw-like to the camera.\n'Did you get into my make up?' her mom asks\n'Yes...a little bit' the toddler admits, although she shows no embarrassment and being caught black-handed.\nThe black creme eyeliner is also streaked, dalmatian-like across her chest and arms.\nAdorably, Elliot emits little squeals of pleasure as the video ends.\nOn request the little girl shows her hands to the camera, the palms of which are nearly completely blackened.\nEverywhere: Perhaps she needs to watch her mother's make-up application more carefully as the toddler doesn't just rub the creme on her eyes but proceeds to smear it all over her face and body\nCaught black-handed: The black creme eyeliner is also streaked, dalmatian-like across her chest and arms. Adorably, Elliot emits little squeals of pleasure as the video ends. On request the little girl shows her hands to the camera, the palms of which are nearly completely blackened.\nThis is not the first video of a child wreaking havoc with their parent's things. Other examples include two brothers hiding in the shower after raiding the family's paint supply and covering themselves with it as well as a girl who decided to tell her dad she loved him...by scratching the message on his car with a screwdriver.\nOther howlers caught on camera include a little boy sitting innocently in the family fish tank, slurping up from the filter tube as if he was merrily drinking lemonade; there's also an image of a tot leaning in to lick the snout of a large pig and a child who's happy to eat from a dog bowl.\nShe loves her dad, let's hope he doesn't love his car; this image of a little girl brandishing a screwdriver has gone viral and sparked a series of similar photos from other exasperated parents\nPiggy kisses: This affectionate little fellow goes nose-to-snout while on a day out\nJust sitting here, drinking the fish tank...a little boy gets knee-deep in trouble when he sits in the family aquarium and starts to slurp from the filter\nI just wanted a stripey dog! A little boy gets creative while his pet lies still and enjoys the pen work R\nOne boy finds the temptation to use his pet dog as a drawing board too hard to resist and promptly colors in the sleeping mutt.\nThere could be an entire photo-series dedicated to kids and pens, for the mischief they get up when armed with a felt-tip seems to know no bounds: one girl is photographed next to her baby sister, who's sitting happily in her rocker with a face covered in pen marks.\nAnother offers a knowing look at the camera as his handiwork, dark blue lines on a light beige sofa, is captured on film.\nChampion of the marker pen! This little girl raises the offending pen aloft while her canvas - her baby sister - looks on bemused - and coloured in - in her rocker\nOne granddad looks stoney-faced as his granddaughter sticks a variety of stickers on his head - and doesn't stop until he's covered in the colorful motifs.\nA boy who happens upon a tin of white decorator's paint, and decides to have some fun with it.\nHe starts with the telly, liberally lathering the paint across it, before painting the cream sofa white and covering much of the wooden floor. A coffee table and nearby toy don't escape the white-wash either.\nToilets too, seem to be an area of fascination; one curious kid climbs into the basin and looks terrified as he realizes that he's not supposed to actually sit in it.\nA fellow pre-schooler decides that the hand basin is the perfect place for a nappy change while one little chap decides toilets make great places to store magazines, and stuffs a selection of them down the loo.","url":"https://www.dailymail.co.uk/news/article-3422354/American-toddler-Elliot-steals-mum-s-make-smear-face-body.html"}
