{"authors":[],"date_download":"2018-10-30 01:23:54","date_modify":"2018-10-30 01:23:54","date_publish":"2016-11-14 00:05:05","description":null,"filename":"data/vaneerConsumption/AmericanForeignPolicyShouldGotoAA.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/11/Secretary_Kerry_and_German_Foreign_Minister_Steinmeier_Speak_on_the_Terrace_12819638764.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862634.html","title":"American Foreign Policy Should Go to AA","title_page":"American Foreign Policy Should Go to AAThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Our lame-duck State Department continues to push for a stronger American response in Syria: creating and enforcing a no-fly zone; confronting strongman Bashar Assad in various ways; arming more rebels and hoping they don’t go to war with each other this time, as they did in the past; tiptoeing in with Special Forces or even putting a large number of American boots on the ground.\nThis pull toward greater involvement strikes some as insane, not just in the sense that it is a bad idea, but in the popular lexicographical sense of the word as well. Alcoholics Anonymous has long defined “insanity” to help millions of struggling meeting-going drunks as “doing the same thing over and over again and expecting different results.” My sense is that they’re onto something there.\nTelling yourself “just one more drink” is not the road you want to be on if you have serious impulse control problems. More often than not, it leads only to sirens and breathalyzers and ruin. Nudging folks to take mental stock by asking themselves “And how has that been working out for you?” is a public service.\nThe incredulity of so many foreign policy folks on Syria fits in that same category. In an abstract sense, it’s easy to appreciate the case to do something in Syria. You have a strongman at war with a good number of people in his own cobbled-together country, charges of atrocities, cities under siege, refugees streaming into Europe. Humanitarian sympathies will naturally incline people toward some sort of intervention.\nThe only problem is we’ve been here before, at least twice, recently. In both Iraq and Libya, Americans were warned of the humanitarian disaster that was unfolding and told that if only we intervened this could easily be set right.\nAnd then we did that and look what happened: mass civilian deaths, terrorism, sectarian divides and near anarchy that allowed ISIS and al-Qaeda to hunker down there for the duration, plenty of American blood and treasure spilled to no discernibly good end.\nThat so many educated people want to push us into Syria now, even given our recent disastrous experiences in the Middle East and North Africa, strikes me as a kind of insanity that really is hard to understand. Recent experience has shown how hard it is to surgically topple a strongman and not leave chaos, and thousands of bodies, including those of American soldiers, in the wake.\nSo the issue isn’t whether we ought to “do something” in Syria, but rather that we should first look at recent America experiences in the region and first answer the all important question, “How will it be any different this time around?”\nOne possible difference is, it could be worse this time — mixing the problems of humanitarian interventionism with, well, Russian roulette. Vladimir Putin has sided with Assad and against the rebels. If America decides to go in guns blazing, or bombs dropping, there is the real change we could get drawn into a larger, armed conflict with Russian forces.\nHere again, AA may be helpful. For decades the so-called “Serenity Prayer” has taught folks how to bring some perspective into their lives. Its insights might scale up to nations as well. It goes like this: “[Deity of choice], grant me the serenity to accept the things I cannot change, courage to change the things I can, and wisdom to know the difference.”\nJeremy Lott is a fellow at Defense Priorities.","url":"https://spectator.org/american-foreign-policy-should-go-to-aa/"}
