{"authors":[],"date_download":"2018-10-30 21:56:32","date_modify":"2018-10-30 21:56:32","date_publish":"2016-12-08 21:17:00","description":"Americus shooting","filename":"data/vaneerConsumption/Americusofficerdiesdayafterhisbestfriendwhotriedtosaveh.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/08/Images/newsEngin.17081456_officers-two.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_americus-of_205c53c0d7609a354f2f3b3944e55a53__1540936592.html","title":"Americus officer dies day after his best friend, who tried to save h","title_page":"Americus officer   dies day after his best friend, who tried to save h","title_rss":"NULL","source_domain":"ajc.com","text":"Already struck by gunshots, Americus police Officer Nicholas Smarr died Wednesday while performing CPR on his wounded friend, Georgia Southwestern State University Officer Jody Smith, according to Smarr’s uncle.\nJust over 24 hours later, Smith died at a Macon hospital, officials said.\nWe have word that GSW Officer Jody Smith has passed away. We offer our deepest condolences to his family. Stmnt: https://t.co/XcG91b6Ul2 — Georgia Southwestern (@GaSouthwestern) December 8, 2016\nRELATED: How Thursday’s events unfolded\nIn a Facebook post, Michael E. Waters gave details of the shooting incident that killed his nephew and Smith.\nMinquell Kennedy Lembrick, who police say was the shooter, was found dead Thursday in Americus from a self-inflicted gunshot.\nMinquell Kennedy Lembrick (Credit: Channel 2 Action News)\n“Nick received the domestic call around 9:30 a.m. and immediately went to the location,” the post read. “As Nick approached the front door and fellow officer (Jody) Smith headed to the back door, Nick noticed the front door was slightly opened, hearing commotion in the house, he called out and pushed the door open further.\nRELATED: Officers were friends, professional peers [...]\n“He immediately recognized the suspect and radioed it in,” Waters’ post continued. “At that time the suspect fled out the back door and Nick pursued through the house. As Nick came out the back door the suspect fired several shots critically wounding officer Smith, Nick returned fire while he was also shot and mortally wounded.\n“After firing a half dozen rounds at the suspect, Nick ran to his fellow officer and BEST friend, he rolled him from his face down position and performed CPR until he could no longer continue,” according to the post. “When other officers arrived at the scene, Nick Smarr was lying across his fallen comrade and best friend where he had succumbed to his injuries.”\nGBI spokeswoman Nelly Miles confirmed that Smarr returned fire with multiple shots, and that he then attempted to perform CPR on Smith.\nOur hearts are with Americus and Georgia Southwestern State University. — Governor Nathan Deal (@GovernorDeal) December 8, 2016\n“We have just received word that GSW Public Safety Officer Jody Smith has succumbed to his injuries and has passed away,\" interim Georgia Southwestern interim President Charles Patterson said. \"We offer our deepest condolences to his family during this very difficult time. Officer Smith was a bright, young and energetic officer, and he will be sorely missed.”\nA tip by someone who knew Lembrick led authorities to the suspect. That person is eligible for the $70,000 reward that was offered by law enforcement.\nAmericus police say they got a call alerting them to Lembrick's location. When they arrived they heard a gunshot..... pic.twitter.com/evsdjo1tLf — Richard Elliot (@RElliotWSB) December 8, 2016\nOn Wednesday, authorities said Lembrick shot Smarr and Smith after they responded to a domestic disturbance call at an apartment complex. The incident prompted Georgia Southwestern, which is near the shooting scene, to go into a lockdown.","url":"https://www.ajc.com/news/crime--law/americus-officer-dies-day-after-his-best-friend-who-tried-save-him/8gww5mn3B9qCBJvzMZskQP/"}
