{"authors":[],"date_download":"2018-10-30 00:50:44","date_modify":"2018-10-30 00:50:44","date_publish":"2017-04-25 00:04:30","description":null,"filename":"data/vaneerConsumption/AmericanWhiskeyTrailTourDay2.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/04/Kosar-Vendome-3.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860644.html","title":"American Whiskey Trail Tour, Day 2","title_page":"American Whiskey Trail Tour, Day 2The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"We all have heard the story: manufacturing is dying in America. All the good blue collar jobs are moving to Mexico and China. America’s middle-class employment has been hollowed out — the few get lucrative white collar jobs, and pretty much everyone else is stuck doing low-pay hourly work.\nThere is some truth to this glum picture. U.S. manufacturing employment is down since 2001. But all is not awful. Indeed, in at least one line of business we are seeing a resurgence in American manufacturing: drinks-making. The casual news reader might intuit this much, what with the reports of American liquor production and exports booming.\nBut I got to see it firsthand during my visit to Louisville, Kentucky. Vendome Copper and Brass Works has made stills since 1903. Prohibition was rough on the company; so too was the economic malaise of the 1970s, and the misguided 1980s shift in consumer taste to Wine Coolers and other treacly dreck. The company endured by diversifying — chemical and confectionary companies, for example, bought Vendome’s big metal tanks and distillation equipment. So did some brewers.\nThe last decade, however, has been gangbusters for the company, reports Vendome’s chief, Mike Sherman. “About 70 percent of our business is for the drinks business,” he reports. The company’s operation occupies an entire block in the Butcherville section of Louisville. Tens of thousands of pounds of stainless steel and copper sheets arrive at Vendome, where unionized craftsmen transform them into custom-made pot and column stills and fermentation systems. Customers include new craft distillers and mega-liquor companies alike. Many customers are domestic, but Vendome’s wares also sell overseas.\nSouth of downtown Louisville, the story is much the same at the Brown-Forman Cooperage. Unionized employees are working more than ever to assemble the barrels that give whiskey its lovely color and rich flavor. Two-story high towers of boards crowd the many-acre rickyard, and still more are piled in the main plant. In as little as an hour, the factory can turn the hewn wood into a 100-pound, 53-gallon barrel that is rolls from the shop floor to a dock where it is loaded on a truck headed for the distilleries that make Jack Daniel’s, Woodford Reserve, and Old Forester.\nIt is a remarkable thing to watch, and physically-demanding work, requiring sawing, hammering, iron-cutting and riveting, barrel-charring, and still more hammering. Brown-Forman’s demand for barrels for its drinks is so high that it has two plants in Alabama, two in Tennessee, and another in Ohio. It sources its white oak wood from 13 states.\nAnd that is the too-often-forgotten truth about the drinks business — it’s not just a hospitality industry, it is manufacturing. Turning seeds and water into that pretty amber liquid in the handsome bottle tipped over your glass requires a lot of muscle and sweat.\nSo if you want to help create more good blue-collar jobs in America, have a bourbon or another American-made drink.\nKevin R. Kosar is a senior fellow at R Street Institute and heads its alcohol policy reform program. He is the author of Moonshine: A Global History (2017) and Whiskey: A Global History (2010).","url":"https://spectator.org/american-whiskey-trail-tour-day-2/"}
