{"authors":[],"date_download":"2018-10-22 21:13:46","date_modify":"2018-10-22 21:13:46","date_publish":"2014-05-06 15:04:30","description":"‪\"I want a congressperson who still is willing to learn, who's still willing to ask questions and get advice,\" he says.","filename":"data/vaneerConsumption/AmericanIdolRunnerUpAikenFightsforFirstinNCRace.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/423456/140506-clay-aiken-brownie-lus-selfie-1121_dd65c629e77d488fe9c05d9190013b19.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_elections_american-idol-runner-aiken-fights-first-nc-race-n98201_1540242826.html","title":"'American Idol' Runner Up Aiken Fights for First in NC Race","title_page":"'American Idol' Runner Up Aiken Fights for First in NC Race ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nClay Aiken won millions of votes more than a decade ago as a contestant on “American Idol.\" Now he’s singing a different tune after a career shift into politics, fighting instead for support in Tuesday’s North Carolina primary.\n‪Aiken, 35, is running for Congress in his home state, asking Tar Heels to support him once again. With a difficult race against fellow Democrat Keith Crisco, he also risks ending up in the same place that he earned from \"American Idol\" viewers: runner up.\n‪“I've had an entertainment career that's lasted 11 years, longer than I ever dreamed it would,\" Aiken said in an interview with NBC News. \"And this, to me, was something that was more important than that at the end of the day.”\n‪Aiken said he spent several months weighing his decision to put his entertainment career on indefinite hold in order to run for the House seat representing North Carolina’s second congressional district. From the start, he recognized his turn to politics could put his relationship with fans at risk.\n‪“To go from a musical fan base that encompassed all ideological beliefs to a political career where you are appealing to just people on one end of the spectrum or middle to the end of the spectrum -- you alienate folks,\" he said.\nOn the campaign trail, the performer-turned-pol offers his background as a former special education teacher, his work as a UNICEF National Ambassador and his foundation for children with disabilities, “The National Inclusion Project.” He cites his brother’s military service in Iraq as a window into veterans’ affairs. And he's tapping into the nation's overall skepticism of Washington, arguing that voters want \"a congressperson who doesn't believe they know the answers to everything.\"\n‪\"I want a congressperson who still is willing to learn, who's still willing to ask questions and get advice,\" he said.\n‪But even his experience with the sometimes harsh tabloid world of entertainment didn't prepare him for the kinds of political hits he faced from his main rival. Crisco, a textile entrepreneur and former North Carolina commerce secretary, quickly branded Aiken as being undependable.\n‪In a TV ad and direct mail pieces, Crisco labeled Aiken “No Show Clay,\" charging that Aiken did not take seriously his 2006 appointment by George W. Bush to the “President's Committee for People with Intellectual Disabilities.”\n‪Aiken missed most of the meetings while performing on tour. Crisco, 70, says Aiken's absence was \"personal\" to him because he is responsible for a brother with autism.\nThe singer argues that officials knew that he would not be able to attend the meetings personally but would lend his name to the cause, and he says a representative participated in most of the meetings in his stead.\n‪“I really do have a passion for children with disabilities,\" he told NBC News. \"And I have done my best over the last 11 years to defend them and to advocate for them. I was a little resentful by the fact that my opponent in the primary would use that against me, to try to make it look like I had not worked on their behalf.”\n\"There are people who voted for me who have ownership in me, and I wanna make sure that I continue to deserve it from them.\"\nAiken's name recognition seems to be as much of a boon as burden to potential supporters. ‪After the three candidates spoke at the Carolina Preserve senior community last week -- Crisco, Aiken and licensed family counselor Antoinette Morris -- voters said that Aiken's fame could help him in Tuesday's election.\n“I think he can bring attention to the race because people know him and he has name recognition,\" said voter Mike Frishman. Ann Linder, another attendee, said that Aiken would likely get \"a popular vote\" but that she'd be choosing Crisco because of his political experience.\n‪It went unremarked-upon at the senior center, but Aiken may face another hurdle in this conservative part of the country -- he is openly gay and has a son.\n‪Asked if being a gay candidate still matters, Aiken doesn't shy away from acknowledging that some voters may take his sexual orientation into account, but not those \"in the middle of the field.\"\n“It will impact some people. I don't think those are the people who are in the middle of the field; they're standing in the corners too oftentimes, just like too many of the politicians in Washington,” he said. “It is not an issue that I'm running on. It is not one of the most important issues to people in this district.”\n‪Even if Aiken wins Tuesday night, he will face a tougher test in the general election. The top Democrat after Tuesday’s primary will be on the general election ballot against two term incumbent Rep. Renee Ellmers in November. The district is conservative and considered safe for Republicans.\nThat doesn’t worry the North Carolina star.\n‪\"I don't have any anxiety level about losing,\" Aiken said, adding that he didn't get into the race \"because I wanted to win something.\"\n‪His run for public office, he says, is an attempt to give something back to the home state that supported his music career and gave him a platform.\n‪\"There are people who voted for me who have ownership in me, and I wanna make sure that I continue to deserve it from them,\" he said. \"I'll work hard for that.”\nNBC's Carrie Dann contributed to this report.","url":"https://www.nbcnews.com/politics/elections/american-idol-runner-aiken-fights-first-nc-race-n98201"}
