{"authors":[],"date_download":"2018-10-22 21:10:46","date_modify":"2018-10-22 21:10:46","date_publish":"2014-05-06 12:30:04","description":"A new White House report says that the hard realities of a changing climate have \"moved firmly into the present.”","filename":"data/vaneerConsumption/AmericanDoomsdayWhiteHouseWarnsofClimateCatastrophes.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/422936/140506-climate-firefighter-jhc-0930_d9cac631d3709d399c5f37b6fc402041.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_environment_american-doomsday-white-house-warns-climate-catastrophes-n98011_1540242646.html","title":"American Doomsday: White House Warns of Climate Catastrophes","title_page":"American Doomsday: White House Warns of Climate Catastrophes","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nScorching temperatures, flooded cities, wildfires and changes in the growing season are just some of the hard realities of a changing climate that are beginning to hit Americans directly, says a new White House report.\n“Climate change, once considered an issue for a distant future, has moved firmly into the present,” the White House report released on Tuesday says.\nThe third National Climate Assessment, the result of four years of research by hundreds of leading scientists and experts, draws a dire picture of a future in which human activity has contributed directly to massive changes in weather. A 1,000-page draft version of the National Climate Assessment was issued last year, and the final version was approved on Tuesday.\n“I think this National Climate Assessment is the loudest and clearest alarm bell to date signaling the need to take urgent action to combat the threats to Americans from climate change,” John Holdren, assistant to the president for science and technology, said in a call with reporters.\nThe report moves climate change directly into American homes, citing models that show a potential for worsened rates of asthma, and higher pollen levels that may trigger allergies, among other effects.\n“Corn producers in Iowa, oyster growers in Washington State, and maple syrup producers in Vermont are all observing climate-related changes that are outside of recent experience,\" they wrote in the report.\n\"This National Climate Assessment concludes that the evidence of human-induced climate change continues to strengthen and that impacts are increasing across the country.\"\nThe changes could help fuel wildfires across the Southwest, lead to a lengthened growing season in the Midwest, and cause heat waves and coastal flooding in the Northeast, according to the report. Glaciers will shrink in Alaska even as drought leads to “increased competition for scarce water resources for people and ecosystems,” the report warns.\n“This National Climate Assessment concludes that the evidence of human-induced climate change continues to strengthen and that impacts are increasing across the country,” the report states.\nResearchers underscored the high temperatures experienced in recent years by Americans, including 2012, which was the hottest year the continental United States has yet had on record, according to the report. The report projects that temperatures will rise a further 2 to 4 degrees Fahrenheit in coming decades.\nAnd in scenarios reminiscent of Hurricane Sandy, heavy rain storms stand to slam America's transportation networks, flooding tunnels, washing across rail lines and overwhelming drainage systems for streets and tunnels.\n“Americans are noticing changes all around them,” the researchers wrote in the report. “Summers are longer and hotter, and extended periods of unusual heat last longer than any living American has ever experienced. Winters are generally shorter and warmer.”\nThe report drew a direct connection between human activities and the uptick in global temperatures over the past five decades, leading to erratic weather experienced across the country. Extreme weather events that have changed over that period include heatwaves that have swept the West while similar bursts of cold weather have become less frequent.\n\"Corn producers in Iowa, oyster growers in Washington State, and maple syrup producers in Vermont are all observing climate-related changes that are outside of experience.\"\n“Natural drivers of climate cannot explain the recent observed warming,” the report states. “Over the last five decades, natural factors (solar forcing and volcanoes) alone would actually have led to a slight cooling.”\nThe report comes after a series of other high-profile warnings on the pace and effects of climate change. The Intergovernmental Panel on Climate Change is releasing a series of global assessments. The American Association for the Advancement of Science, the National Academy of Sciences and the Royal Society have all issued their own reports or begun educational campaigns.\nThe White House’s report presents “actionable science” on how to deal with climate change and its effects, John Podesta, a counselor to President Obama, told NBC News’ Chuck Todd on Tuesday. The peer-reviewed report is the most comprehensive yet produced on the effects of climate change in the U.S., Podesta said.\nSome climate experts who spoke to NBC News in advance of the report’s release highlighted the need for quick action to mitigate the effects of climate change.\n“While President Obama has taken some important steps to address climate change at home, his administration is undermining that progress by ignoring the huge amounts of carbon pollution that would accompany the fossil fuel industry’s plan to export coal, liquefied natural gas and oil abroad,” said Gabe Wisniewski, Greenpeace USA's climate and energy campaign director, in an email. “Climate change is a global crisis which will only be made worse by extracting and exporting fossil fuels, whether it’s fracked gas from Appalachia, coal strip-mined from Montana, or oil drilled from the Arctic.”\n--- NBC News' John Roach and Alan Boyle contributed to this report.","url":"https://www.nbcnews.com/science/environment/american-doomsday-white-house-warns-climate-catastrophes-n98011"}
