{"authors":[],"date_download":"2018-10-30 00:50:37","date_modify":"2018-10-30 00:50:37","date_publish":"2017-04-24 00:26:37","description":null,"filename":"data/vaneerConsumption/AmericanWhiskeyTrailTourDay1.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/04/George_Washingtons_Distillery.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860637.html","title":"American Whiskey Trail Tour, Day 1","title_page":"American Whiskey Trail Tour, Day 1The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Where better to start a tour of the American Whiskey Trail than at Mount Vernon? George Washington often has been called the father of our grand nation — the prototype of this new man, the American.\nAppropriately, he owned a distillery that made whiskey. Washington got into the business at the end of his presidency. In 1797 he gave the thumbs-up to Scotsman James Anderson to build a distillery at his beloved Virginia home to produce high-quality hooch.\nAnd what a distilling operation it was. The mill powdered grain with millstones imported from Europe and marvelous wooden machinery that marvels the eye today. The distillery was 75 feet long by 30 feet wide, with five stills. Within a couple years, George’s booze barn was belching 10,500 gallons of rye whiskey and other spirits, and it was profitable.\nAlcoholic beverages were integral to the operation of Mount Vernon, as Dennis Pogue recounts in Founding Spirits George Washington and the Beginnings of the American Whiskey (Harbor Books, 2011). Laborers, artisans, and local merchants often were paid with home-brew or other dizzying beverages. Sick slaves and those giving birth were dosed with rum. The contract of Philip Bateman, Washington’s gardener, stipulated that he would receive “four Dollars at Christmas, with which he may be drunk 4 days and 4 nights.”\nYet, making whiskey was a venture for Washington — one of many new things he tried in his life. He had tried his hand at surveying, tobacco farming, the rum trade, along with other pursuits — like battling American Indians, the French, and Great Britain, and presiding over the constitutional convention and serving as the first U.S. president.\nAnd so it is today. America’s ranks of distillers have been stocked in recent years with arrivistes — newbies who want to make great liquor. In the dim, rough-hewn confines of Washington distillery, I met last night with nearly two dozen entrepreneurs who had lept into the spirits business. There was Bill Karlson, who after retiring from government contracting career partnered with his pal John O’Mara. Their KO Distilling makes Bare Knuckle wheated whiskey.\nJames Carpenter’s Reservoir Distillery used heavily charred barrels to finish its 100% rye whiskey, which recently sold out. Gareth Moore, meanwhile, is selling Virginia Highland Malt Whisky, a fruity, delightful tipple finished in port casks. And Sid Dilawri has Filibuster rye and bourbon, which he finishes in barrels that once held wine. Sid learned about drinks working in his family’s liquor store, then struck out on his own a couple years ago. He found an old apple-packing warehouse and turned it into a distillery.\nSomewhere George Washington is smiling, and lifting his cup to this new generation of enterprising drinks entrepreneurs, who are pouring their lives and fortunes into living the American dream.\nKevin R. Kosar is a senior fellow at R Street Institute and heads its alcohol policy reform program. He is the author of Moonshine: A Global History (2017) and Whiskey: A Global History (2010).","url":"https://spectator.org/american-whiskey-trail-tour-day-1/"}
