{"authors":[],"date_download":"2018-10-30 00:50:46","date_modify":"2018-10-30 00:50:46","date_publish":"2017-04-28 00:15:51","description":null,"filename":"data/vaneerConsumption/AmericanWhiskeyTrailTourDay5.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/04/Kosar-Dickel-tasting-room-and-shop-04-27-2017.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860646.html","title":"American Whiskey Trail Tour, Day 5","title_page":"American Whiskey Trail Tour, Day 5The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Don’t get me wrong — Jack Daniel’s is a very impressive company. Its sales growth over the past 40 years is mind-boggling. During the 1970 and 1980s, most American whiskeys saw their sales drop. They laid off workers and cut back on capital upgrades.\nBut not company the Jasper Newton Daniel started 150 years ago. It went gangbusters, helped in no small part by celebrities like Frank Sinatra and Michael Anthony of Van Halen, who guzzled it on stage. (Anthony even had an Old No. 7 electric guitar made.)\nAnd Daniel’s did itself a great favor by taking a rather fanatical attitude toward execution. If they were going to make a bazillions cases a year, they were going to keep quality high. It presently keeps three full timers on the payroll to do nothing more than burn wood into charcoal, which is used to filter the whiskey after it comes off the still. It continues to use a copper still, and gets its barrels from its parent company, Brown-Forman, and nobody else. A Jack Daniel’s microbiologist cultures the yeast it uses by the thousands of gallons, and the lactobacillus for its sour mash. To call the Jack Daniel’s distilling crew control freaks is both accurate and a high compliment. No wonder the stuff sells in 160 countries.\nYet, I long have had a very soft spot in my heart for George Dickel, which is sometimes called “that other Tennessee whiskey.” Way back in 2001, I decided to do a side-by-side tasting of Daniel’s and Dickel. I sure liked Jack Daniels No. 7, which was 86 proof back then. (It’s 80 proof now.) I liked George Dickel No. 12 a lot more.\nThe George Dickel distillery is a mere 7 miles from its hulking Lynchburg neighbor, but it feels a world apart. It is tucked in Cascade Hollow in Tullahoma, where cell phone coverage is spotty at best. Whereas 300,000 tourists flock to Jack Daniel’s annually, Dickel’s parking lot has room for maybe 20 cars.\nThe Cascade Creek winds through the property, and like other Tennessee waterways it does not lack for snakes. “Copperheads?” asked Brian Downing, a Dickel brand ambassador, when he saw me pointing toward three snakes writhing on a creek rock. Nope, just common water snakes enjoying the sunshine and doing their best to make more snakes.\nThere is a nice little tasting room with buck heads mounted on the wall, and a modest gift shop. Growing sales have inspired them to renovate the place a bit, but it remains utterly without pretense. The first employee I met, Michael, sported overalls, and we talked about hats and where to buy good ones. His mother worked at Dickel in the 1960s – the first to toil in the still house.\nDickel’s distillery is small — there are nine tanks for fermenting and one still system. They fill around 250 53-gallons barrels in a day, but they make whiskey only 4 days per week. The distillery looks much as it did when it opened in 1957. There are no computers — a cast iron scale is used to measure grains and a Dr. Strangelove era machine scrawls outs still instrument readings. The guys who make the whiskey have been around for years.\nAnd it works. I like each Dickel whiskey, which Tennesseans cussedly insist on spelling “whisky.” Dickel’s No. 8 brand black label is a solid everyday whiskey — much less sweet than JD’s No. 7 — and No. 12 is even more flavorful. Both are quite affordable for their quality. Dickel does shave some higher end hooch. It’s Barrel-Select goes for $45 and its Single Barrel runs twice that. These are whiskey-geek whiskies, boldly flavorful spirits that are best enjoyed neat and small savoring sips.\nThen there is the the ultra-rare Dickel 17-year old whiskey. It was an accident, Downing reports. Dickel mis-recorded a small number of its inventory when it was moving some barrels around. It marked the old barrels as just filled with liquor instead of just relocated on that date, and did not realize the error for a few years. That is the sort of thing that can happen when you run a distillery in an old-timey way.\nThis glorious goof is a Tennessee whisky unlike any other. It oozes dried fruit and nuts, and tastes like a cross between port and whiskey. It runs $75 for a half-sized bottle (375 ml), and was a serendipitous and delicious conclusion to my week on the American Whiskey Trail.\nRead more about Kevin’s travels down the Whiskey Trail here: Part 1, Part 2, Part 3, and Part 4.\nKevin R. Kosar is a senior fellow at R Street Institute and heads its alcohol policy reform program. He is the author of Moonshine: A Global History (2017) and Whiskey: A Global History (2010).","url":"https://spectator.org/american-whiskey-trail-tour-day-5/"}
