{"authors":["Anton Nilsson In New York","Lydia Willgress In London For Dailymail.Com"],"date_download":"2018-10-23 00:20:14","date_modify":"2018-10-23 00:20:14","date_publish":"2016-01-29 13:11:03","description":"For the second time in two days, an American Airlines flight was forced to make an emergency landing Friday after passengers and crew fell ill. The flight was bound for Miami from Rio de Janeiro","filename":"data/vaneerConsumption/AmericanAirlinesflightfromRiotoMiamimakesemergencylandinginBrasilia.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30B49B6C00000578-0-image-a-10_1454089603277.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422770_American-Airlines-flight-Rio-Miami-makes-emergency-landing-Brasilia-Second-flight-grounded-days-passengers-suffer-mystery-illness_1540254014.html","title":"American Airlines flight from Rio to Miami makes 'emergency landing' in Brasilia","title_page":"American Airlines flight from Rio to Miami makes 'emergency landing' in Brasilia | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"For the second time in two days, an American Airlines flight was forced to make an emergency landing Friday after passengers and crew fell ill.\nFlight 904, which left Rio de Janeiro at 10.16pm Thursday heading for Miami, was diverted to Brasilia after four people - including three members of staff - complained of lightheadedness, the airline confirmed in a statement to Daily Mail Online.\n'The aircraft landed safely at Brasilia at 12.37am and was met by paramedics who evaluated the passenger and crew members. None requested further medical attention,' an American Airlines spokesperson said.\n'Our maintenance team is currently inspecting the aircraft and performing a thorough maintenance check.'\nFile photo of a Boeing 777 operated by American Airlines, which has been forced to ground two planes in two days after passengers and crew fell ill onboard\nFlight AA904 was travelling from Rio de Janeiro to Miami around 11pm Thursday when it diverted to Brasilia (shown on map above)\nThe emergency landing happened the day after an American Airlines flight to Los Angeles was forced to return to London's Heathrow Airport after around 15 people on board fell ill.\nAlthough the two grounded flights involved air planes of similar models, airline officials said they 'do not want to speculate on whether [the two incidents] are linked' until investigations have been completed.\nOne passenger on the Miami-bound flight told Daily Mail Online she saw people 'pass out' from the mystery illness before the plane landed.\n'We are currently still in Brasilia where we made an emergency landing because crew members and passengers passed out and became unwell,' the woman wrote in an email.\n'It sounds exactly like what happened on the other flight with us not being allowed off the plane for two hours.\n'As you can imagine frustrating chaos followed and most people are stuck here for 48 hours. One of the crew said something about oven cleaner reacting badly.'\nAnother passenger, Xime Etchart, wrote on Twitter early Friday morning: 'Emergency landing in Brasilia from Rio to Miami. We're all still waiting for an update on when we are flying back...'\nA second American Airlines flight may have been forced to make an emergency landing after passengers became ill. Above, a passenger revealed on Twitter that she was forced to wait in Brasilia\nIn a second tweet, Etchart wrote she'd been stuck in Brasilia for six hours with 'no food, no room, no help at all.'\nThe Miami-bound Boeing 777, which carried 203 passengers and 14 crew members, was of a similar model to the one that was forced to divert back to London Heathrow following a 'medical emergency' on Wednesday.\nThe captain on the flight from London to Los Angeles made the decision to turn around after increasing numbers of people on-board became ill.\nA photo snapped by a passenger aboard Wednesday's Los Angeles-bound flight that made an emergency landing at Heathrow Airport","url":"https://www.dailymail.co.uk/news/article-3422770/American-Airlines-flight-Rio-Miami-makes-emergency-landing-Brasilia-Second-flight-grounded-days-passengers-suffer-mystery-illness.html"}
