{"authors":["Kalhan Rosenblatt For Dailymail.Com"],"date_download":"2018-10-23 04:26:56","date_modify":"2018-10-23 04:26:56","date_publish":"2016-01-29 20:08:29","description":"Two Americans have become the first-ever U.S. competitors to win the World Marathon Challenge, which has runners take on seven races in seven days on every continent.","filename":"data/vaneerConsumption/AmericansbecomethefirstfromUStowinWorldMarathonChallenge.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/20/30B50A1300000578-0-image-a-28_1454097751858.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423276_Americans-U-S-competitors-win-World-Marathon-Challenge_1540268816.html","title":"Americans become the first from U.S. to win World Marathon Challenge","title_page":"Americans become the first from U.S. to win World Marathon Challenge  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Two Americans have become the first-ever U.S. competitors to win the World Marathon Challenge, which has athletes run seven marathons on all seven continents in seven days.\nDaniel Cartica, 27, of Chicago, and Becca Pizzi, 35, of Belmont, Massachusetts, won the challenge on Friday in world-record time.\nPizzi finished the final race in just over four hours. Cartica finished the last race at just past three and a half hours.\nAmericans Becca Pizzi, 35, (left) and Daniel Cartica, 27, (right) won the World Marathon Challenge on Friday\nThe two ran seven marathons in seven days on all seven continents in world-record time to claim the victory\nPizzi was the first woman to cross the finish line in all seven races of the World Challenge Marathon\nAround the world in seven days: The challenge begins in Antarctica and ends in Sydney, Australia, with stops in Chile, Morocco, Dubai, Spain, and Miami, US\nThe grueling week-long race began in Antarctica on January 23 and ended January 29 in Sydney, Australia.\nCartica, a U.S. Marine Corps captain, and Pizzi, a day care center operator, finished with a marathon in Sydney.\nAlong with 13 others, Cartica and Pizzi began the challenge in Antarctica and on consecutive days ran the 26.2-mile distance in Chile, Miami, Spain, Morocco and the United Arab Emirates.\nIt took Pizzi (pictured) and Cartica 168 hours to travel 23,560 miles around the world to complete the races\nAustralia was the last stop on the list. The marathon began in Antarctica, which was Pizzi's favorite and least favorite stop of the trip\nCartica (left) had to hold off fellow American Calum Ramm to claim first place in the final stretch of the race\nThey now join a club more elite than those who have voyaged into space or scaled Mount Everest.\n'We just made history.\n'I believed in myself since the moment I signed up for it. I went for it and got it done. When you believe in yourself, anything is possible,' Pizzi said.\nIt took competitors 168 hours to complete the challenge and 59 of those were spent trying to recover aboard the charter flight that shuttled them 23,560 miles to all the continents.\nThe two Americans in the men's division were neck-and-neck during the final race, but Cartica, a U.S. Marine Corps captain, pulled away at the end and dedicated his win to those killed in Chattanooga last year\nPizzi had support on the sidelines as she neared the end of the seventh race in the World Marathon Challenge\nThe American champions now join a group more elite than those who have been to space or climbed Everest\nAlong the way, they had to cope with the extreme cold of Antarctica and the brutal heat of the Sahara desert, all while navigating the extremely different terrain.\nCartica who grew up in Poughkeepsie, New York, dedicated his run to the four Marines and sailor killed in July when a gunman attacked a U.S. Naval Reserve Center in Chattanooga, Tennessee.\nPizzi was the first woman across the finish line in all seven races.\nHer highs: 'Antarctica and running on glaciers,' she said","url":"https://www.dailymail.co.uk/news/article-3423276/Americans-U-S-competitors-win-World-Marathon-Challenge.html"}
