{"authors":["Associated Press"],"date_download":"2018-10-23 05:51:28","date_modify":"2018-10-23 05:51:28","date_publish":"2017-04-26 17:11:14","description":"They are young and old: a high school student who can't yet vote, a Vietnam vet who did so proudly. They hail from all corners of the United States and very...","filename":"data/vaneerConsumption/AmericansofferhopeprayerinassessingTrumps100days.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/22/wire-468017-1493240730-901_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4448458_Ill-praying-Americans-assess-Trumps-100-days_1540273888.html","title":"Americans offer hope, prayer in assessing Trump's 100 days","title_page":"Americans offer hope, prayer in assessing  Trump's 100 days | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They are young and old: a high school student who can't yet vote, a Vietnam vet who did so proudly. They hail from all corners of the United States and very different walks of life: a \"downhome boy\" from Kentucky, a third-generation Mexican-American from Texas, a stay-at-home mom in Pennsylvania, an Iranian immigrant in Los Angeles.\nSome oppose Donald Trump and all that he stands for, while others voted enthusiastically for him. Now, they are critiquing him.\nOne hundred days into Trump's presidency, The Associated Press returned to some of the everyday people interviewed these past months to ask them to write a letter to the president, evaluating the job he's done so far and looking ahead to the months to come.\nThis combination of 2016 and 2017 photos shows, top row from left, Alan Halsey, Rebecca Esparza, Laverne Jones Gore and Marjan Vayghan; middle row from left, James McDonald, Brooke Streech, Suliman Bandas and Rick Yearick; bottom row from left, Kate Young, Carolee Upshur, Amellia Sones and Ed Harry. One hundred days into Donald Trump's presidency, The Associated Press asked people from across the country to write a letter to the president. (AP Photo)\nOne supporter tells the president he \"might have fallen a little short\" - on Obamacare, in particular - but he signs off \"with hope.\" A refugee implores Trump to \"make America more friendly,\" but finds optimism in the president's reaction to this month's chemical attack in Syria: \"I hope this is a turning point.\" A Trump objector calls his biggest accomplishment \"waking up the public to fight.\" She offers this advice: \"Make decisions with your heart. It will give you wisdom.\"\n___\nFROM RURAL AMERICA, A SUPPORTER SEES HOPE IN TRUMP'S PRESIDENCY\nAlan Halsey, 31, is a self-described \"downhome boy\" from Campton, Kentucky, who along with his wife owns and operates The Swift Creek Courier, a weekly newspaper, and Halsey's Country Store, \"a small business that is a chunk of 1950 set down in 2017.\" He says he works seven days a week to try to provide for his family, but is struggling and tired of government regulation and red tape.\nHe wrote:\n\". I supported you quite strongly in the 2016 election, even to the point of hanging one of your signs on the front door of my business. I particularly related to your foreign policy of 'America First,' and your promise to bring business back to the United States. So far, I believe you're heading in the right direction on that front, and I find a glimmer of hope in the future of the American economy. .\n\"Overall, I think you might have fallen a little short on your first 100 days, but I don't put a lot of weight into a time frame that small. Provided you serve two terms, 100 days is about 4 percent of that. I still feel that something needs to be done with the Affordable Care Act, although I'm not certain exactly what. ... I know many ACA recipients that visit a doctor more than once a week, while those that purchase their own insurance wait until a visit to a doctor is imperative to their survival. There must be a middle to that scenario. ...\"\nHe signed his letter: \"With Hope.\"\n___\nCANCER SURVIVOR WORRIES OVER TRUMP'S PROPOSED BUDGET CUTS, BUT PRAYS FOR HIM\nRebecca Esparza, 45, is a freelance writer in Corpus Christi, Texas, who didn't vote for Trump. A cancer survivor, Esparza fears proposed budget cuts targeting the nation's premier medical research institution, the National Institutes of Health, will hurt Americans who battle illness.\nShe wrote:\n\". I cannot say I'm proud of your work so far. However, I have respect for the Office of the President, even if I disagree with your political aspirations. ... I could write a dissertation on the many ways I disagree with your political ideals. I'm a third-generation Mexican-American, born and raised in South Texas. Your disdain for Mexico, its descendants and immigrants in general troubles me. Your plan to dismantle the Affordable Care Act, leaving millions of Americans with no other health insurance options, leaves me anguished.\n\"But what distresses me most is your plan to cut nearly $6 billion in funding from the National Institutes of Health (NIH). On Thanksgiving Day in 2001, at age 30, I was diagnosed with ovarian cancer. ... Cancer research saved my life. ... The cuts you are proposing are disconcerting not only for cancer survivors, but for millions of Americans suffering from many types of chronic and rare diseases. ...\n\"I'll be praying for you, President Trump. ... I pray you will carefully consider how your decisions have life or death consequences for hard-working Americans.\"\nRead more about Esparza.\n___\nONE-TIME OBAMA VOTER FEELS PRIDE IN TRUMP'S WORK\nLaverne Jones Gore, 60, owns an executive leadership development company in Cleveland and voted for Trump after previously supporting Barack Obama. Gore calls herself a \"middle-class American who happens to be black\" and says she felt uncomfortable voicing her opinion during the Obama years, but Trump has \"made me proud to be an American again.\" Part of a military family - her deceased husband was a Marine and a son graduated from West Point - Gore's one hesitation these past 100 days is over Trump's airstrike in Syria.\nShe wrote:\n\". Mr. President you have absolutely met my expectations. I actually believe you have shown a strength that I had not given to you, and I am surprised by your willingness to meet head on the challenges and resistance within your governing bodies. I don't believe you have been afforded an opportunity to really show us what you have to offer in the form of leadership of our nation.\n\"I have no issue with you as it relates to 'Russians.' I personally believe most of it was contrived. I have no issue with you as it relates to immigration. I think the issues were in need of control. ... I have some reservations about your use of Twitter, but I understand the difficulty you have getting your intended message out.\n\"Yes, you surprised me with the Syria strike and I am not certain how I feel about another war or thought of war. I am still contemplating your action and observing the responses to come from the world theatre as they absorb your full intent.\"\n___\n'YOUR SIGNATURE CRUSHED MY FAMILY'\nMarjan Vayghan, 32, an artist and writer in Los Angeles, parses no words in her evaluation of Trump. An Iranian immigrant who came to the U.S. with her family in the 1990s, Vayghan's uncle was caught up in the chaos that erupted after Trump signed his first travel ban order in January. Ali Vayeghan was detained at the Los Angeles airport and put back on a plane back to Iran, even though he had an immigrant visa. He returned nearly a week later, after a federal judge blocked the order.\nShe wrote:\n\" ... We appreciate the greatness of our country and our freedoms, because we've consciously fled other places with the hopes of making a better life here. We've undergone 'extreme vetting' and left behind our loved ones for a chance to be free and follow our dreams.\n\"On January 27th, everything changed as your signature made my uncle disappear ... The following day I saw my father cry for the first time in my life. My mom got sick. I felt afraid and alone. My parents started plans with the expectation we were all about to be rounded up and sent to internment camps. Later that day, we realized our family wasn't alone in LAX. Countless people showed up, chanting supportive messages and singing songs of love like \"this land was made for you and me. ...\n\"As your executive orders crush the immigrants and native-born people of this country together, I have hope that the pressure will forge us into a stronger union. ... Seven days into this 'un-presidented' adventure, your signature crushed my family. The next day we were embraced by the country's love and support.\"\nRead more about Vayghan.\n___\nA BANKER IN COAL COUNTRY TELLS TRUMP TO 'PROVE THEM WRONG'\nJames McDonald, 57, of Tazewell, Virginia, is a Trump supporter who believes the president has \"brought integrity and honor back to the White House, our country and the way the world views our country.\" An assistant vice president at a bank in a small mining community, McDonald's priorities include reviving the economy and replacing the Affordable Care Act. He sums up his advice for Trump in three words: \"Jobs. Jobs. Jobs.\"\nHe wrote:\n\"The fact that you mean what you say and say what you mean is what we have needed in our president for the last eight years. This is one of the few elections that the way I voted was for what was in the best interest of my local community. The war on coal that was waged by the former administration devastated our area. ...\n\". Since the inauguration my only concern was the handling of the repeal and replace of the Affordable Health Care Act. I felt like you comprised too much, and came close to signing a bad bill. I commend you on your continued efforts to enact this change, however if it's not a good bill please don't compromise too much.\n\". Of course keeping America safe is your No. 1 priority, after that in my opinion it is putting people back to work. One quote from the Republican convention that was impressive was when Donald Trump Jr. said that 'when people tell him it can't be done, that guarantees that he gets it done.' They say you can't make America Great Again. Prove them wrong. ...\"\nRead more about McDonald.\n___\nA FINANCIAL PLANNER URGES TRUMP TO 'READ. LISTEN. LEARN. PREPARE.'\nBrooke Streech, 44, runs a nonprofit in Phoenix that provides financial planning and education for those who cannot afford an adviser. She voted for Hillary Clinton because she believes she was \"more qualified, smarter and cared more about people.\" The mother of two boys, 10 and 12, Streech urges Trump going forward to \"Read. Listen. Learn. Prepare. Work hard to understand the complex issues you are required to face.\"\nShe wrote:\n\"Your lack of experience and intelligence has certainly shown itself to be an issue so far in your presidency. It might be OK to go into office with your incredible ignorance if you were to surround yourself with smart and talented people. Unfortunately you have done the opposite. Your administration appears to be run less efficiently and with more chaos than any other in history.\n\". I would implore you to spend some time reflecting on how you get your information. Find advisers and spokespeople who are smart, good at what they do, and might disagree with you once in a while with the aim to create dialogue and make decisions with all of the information available. .\"\nRead more about Streech.\n___\nREFUGEE PRAYS GOD WILL GIVE THE PRESIDENT WISDOM\nSuliman Bandas, 37, is a refugee from Sudan who could not vote in the election because he is a legal permanent resident and not a citizen. He teaches English as a Second Language to other immigrants in Lincoln, Nebraska. He advises Trump to \"make America more friendly, beautiful and strong - by caring for others and defending the weak.\"\nHe wrote:\n\"I grew up in southern Sudan, which was engaged in a long civil war with the north. In 1986 my uncle ... took my father, a teacher, and other civilians in a helicopter to areas that needed aid. I watched from our backyard as that helicopter was shot down. ... In 2005, I was accepted to come to the U.S., a place where I can be safe and call home. ...\n\"In my job I help teach refugees, and every day they express to me their worries that this country may reject refugees in the months to come. I have heard you express concern about the Syrian people and I hope this is a turning point. Please, Mr. President, let America continue to treat refugees the same way God wanted them to be treated. That is what made America what it is - strong and different from any other country on the face of the planet. The Bible says: \"When a foreigner resides among you in your land, do not mistreat them. The foreigner residing among you must be treated as your native-born. ...\" (Leviticus 19:33-34) Dear Mr. President, may God guide you, give you wisdom and spirit of understanding in these very challenging moments.\"\nRead more about Bandas.\n___\nA KANSAN FEELS 'AMERICAN PRIDE AGAIN' OVER A LEADER WHO 'BELIEVES IN ALL OF US'\nRick Yearick, 50, is an ad salesman at the local paper in Liberal, Kansas. An avid Trump supporter, he praises the president for a number of things, including flexing his muscles with \"decisive action against those who perform badly on the world stage.\" He says the president's biggest failure so far is not successfully uniting Republicans behind him.\nHe wrote:\n\"Keep fighting for a secure America with your travel ban for those who seek to do us harm, building a wall to secure a sound immigration policy, and by serving Americans and not trying to be President of the World. ...\n\"I commend you on the selection of (Supreme Court Justice Neil Gorsuch) for his commitment to the Constitution rather than a revisionist who interprets it to fit their political needs. I am sure that given a chance at more appointments, you will do the same.\n\"I feel American pride again knowing that our president believes in all of us. For the past several years, I could not relate to the direction we were headed as we were divided and at each other's throats. Now, we are uniting behind the common man with the leadership of a president who honors us all. ...\"\nRead more about Yearick.\n___\n'LUCKILY, I DON'T HAVE TO FIGHT YOU ALONE'\nKate Young, 43, is a stay-at-home mother in West Chester, Pennsylvania, who says she couldn't sit idly by after Trump's election. So she and her neighbors began holding rallies every week to fight to keep the Affordable Care Act, which helped her family after her husband lost his job.\nShe wrote:\n\"... When you won the election, I worried that you would put business profits ahead of the environment, and that you would involve the United States in a new, possibly nuclear, war. Today, much sooner than I feared, both dire predictions have come true. Congress rolled back environmental protections ... You bombed Syria, and as I write this letter, the news reports that you dropped the 'Mother of all Bombs' on Afghanistan. Please don't go nuclear!\n\"Every Friday, starting January 20th, I rally with my neighbors in front of Congressman Ryan Costello's office. We fight to protect the Affordable Care Act. Claire's son needs the ACA to manage Type 1 diabetes. Lisa needed the ACA to cover prenatal care and delivery of a healthy baby after her husband left her, uninsured and 10 weeks pregnant. Dr. Jack's infant patients need the ACA to cover life-saving treatment and eliminate the lifetime caps that they otherwise might exceed before ever being discharged from the NICU. ...\n\"Luckily, I don't have to fight you alone. Most Americans did not vote for you. We won't stop holding you accountable for every infraction of American laws, values, or norms.\"\nRead more about Young.\n___\nINSURANCE AGENT SAYS TRUMP'S LOVE OF COUNTRY 'IS REFRESHINGLY OBVIOUS'\nCarolee Upshur, 60, a life insurance agent in Cleveland Heights, Ohio, says she voted for Trump because he seemed like the only candidate who \"had the backbone to withstand the attacks that would come as a result of any attempt to 'drain the swamp.'\" She encourages him to \"please move forward with the building of the wall, and do not compromise with the Republican establishment.\" As for any failure? \"Obamacare. He was elected to get rid of Obamacare.\"\nShe wrote:\n\"... I have been utterly amazed at your ability to accomplish anything in the environment as it exists in Washington. ... You jumped in feet first and set out to do everything you promised during your campaign. ...\n\"I applaud your move to curtail the illegal immigration and build the wall, and continue to be frustrated at the attempts of the progressives to use the judicial system to try and block your attempts to fulfill your duties as president. ... I was absolutely thrilled to see the decisiveness with which you acted in Syria and Afghanistan, which sent a strong message to the world that there 'is a new sheriff in town.' It is wonderful to have a 'man's man' leading this country from a position of love of country and peace through strength. ...\n\"Please know that I continue to pray for you daily, that God will hold your family together and protect you all.\"\n___\nLA TEEN: FOCUS ON HELPING PEOPLE, NOT MAKING MONEY\nAmellia Sones, 15, is a high school student in Los Angeles who was spurred to help organize a protest against Trump after his election. Sones says in her letter that even though she's not yet old enough to vote, she has opinions about the job Trump has done. For one, she worries the younger generation is watching him \"act inappropriately and out of line\" and will conclude that it's acceptable behavior.\nShe wrote:\n\". One major thing I do not like is putting a ban on immigrants from entering the United States. I know you were trying to keep terrorists from entering our country, but I do not believe banning immigrants from certain countries is an effective way of doing this. And, after all, the United States is called the melting pot of many nations. ...\n\"Your biggest failure (and there have already been so many) is NOT making an effort to bring our country together. To me, that's a big part of a president's job. ... I only ask that you start watching the way you speak and try listening to what your people are asking of you. Stop arguing with celebrities over Twitter and start acting like an actual president.\"\nRead more about Sones.\n___\nEX-DEMOCRAT CALLS TRUMP THE 'LAST CHANCE TO TURN OUR COUNTRY AROUND'\nEd Harry, 70, of Plymouth, Pennsylvania, is a retired union official and ex-Democratic activist who became a Trump voter. A Vietnam veteran who recalls being spit on and called a baby-killer, Harry encourages Trump to \"stay away from any wars.\" His biggest failure, he says, is \"not having his house in order; all the turmoil in the White House from the staff.\"\nHe wrote:\n\"I laughed when I heard you were running for president. I didn't think you had a chance. As the campaign went along, I found out that the Democrats, Republicans ... China, India, Mexico, all were opposed to you. At that moment I knew I had my candidate. .\n\"Considering all the opposition you have had against you, I think you deserve a C+ rating. You've accomplished quite a lot: Neil Gorsuch appointment ... get rid of a lot of Obama executive orders ... \"The WALL,\" or at least some immigration enforcement I would like to see take place this year. Finally, most of all, do NOT let the neocons or both political parties corrupt your administration. I do, in fact, believe YOU are OUR last chance to turn OUR COUNTRY around!!!\"\nRead more about Harry.\n___\n'MAKE DECISIONS WITH YOUR HEART. IT WILL GIVE YOU WISDOM'\nSusan McClain, 52, works in customer service for a tech company in Aurora, Colorado. She was a Clinton supporter, and says the greatest thing to come from Trump's presidency so far is \"waking up the public to fight ... and stand up for American lives, values, and aspirations.\" Still, she has some advice for the president as his term goes on: \"Make decisions with your heart. It will give you wisdom.\"\nShe wrote:\n\"Are you meeting my expectations so far? Sadly, yes. Your first 100 days as president was tragic for Americans and the globe. ... Regardless, I would like to thank you. As you rampaged all over America's values, we understood more deeply what we love and cherish. And, we woke up.\n\"In you, we see that wealth is not success.\n\"In you, we see that unchecked ego is dangerous.\n\"In you, we see the mighty power of words.\n\"In you, we see that winning must include all of us, not just the rich and powerful.\"\n___\nAssociated Press reporters Claire Galofaro, Carla K. Johnson, Errin Haines Whack, Amy Taxin, Matt Sedensky, Nicholas Riccardi and Michael Rubinkam contributed to this report.\nThis Nov. 2, 2016 photo shows Alan Halsey of Campton, Ky. One hundred days into Donald Trump's presidency, The Associated Press asked people from across the country to write a letter to the president. He wrote: \"... I supported you quite strongly in the 2016 election, even to the point of hanging one of your signs on the front door of my business. I particularly related to your foreign policy of 'America First,' and your promise to bring business back to the United States. So far, I believe you're heading in the right direction on that front, and I find a glimmer of hope in the future of the American economy. ... I still feel that something needs to be done with the Affordable Care Act, although I'm not certain exactly what. ... I know many ACA recipients that visit a doctor more than once a week, while those that purchase their own insurance wait until a visit to a doctor is imperative to their survival. There must be a middle to that scenario. ...\" (AP Photo/Claire Galofaro)\nFILE - This Thursday, July 14, 2016 file photo shows Rebecca Esparza, a two-time cancer survivor, at the Watergardens in Corpus Christi, Texas. One hundred days into Donald Trump's presidency, The Associated Press asked people from across the country to write a letter to the president. She wrote: \"... I cannot say I'm proud of your work so far. However, I have respect for the Office of the President, even if I disagree with your political aspirations. ... I'm a third-generation Mexican-American, born and raised in South Texas. Your disdain for Mexico, its descendants and immigrants in general troubles me. Your plan to dismantle the Affordable Care Act, leaving millions of Americans with no other health insurance options, leaves me anguished. But what distresses me most is your plan to cut nearly $6 billion in funding from the National Institutes of Health. ... Cancer research saved my life.\" (AP Photo/Eric Gay)\nThis April 24, 2017 photo shows Laverne Jones Gore, member of the Ohio Diversity Coalition, a pro-Donald Trump group, in Solon, Ohio. One hundred days into Trump's presidency, The Associated Press asked people from across the country to write a letter to the president. She wrote: \"... Mr. President you have absolutely met my expectations. I actually believe you have shown a strength that I had not given to you, and I am surprised by your willingness to meet head on the challenges and resistance within your governing bodies. I don't believe you have been afforded an opportunity to really show us what you have to offer in the form of leadership of our nation. ... Yes, you surprised me with the Syria strike and I am not certain how I feel about another war or thought of war. I am still contemplating your action and observing the responses to come from the world theatre as they absorb your full intent.\" (AP Photo/Dake Kong)\nFILE - In this Monday, Jan. 30, 2017 file photo, Marjan Vayghan talks with her father, Hossein, after an interview in Santa Monica, Calif. One hundred days into Donald Trump's presidency, The Associated Press asked people from across the country to write a letter to the president. She wrote: \" ... We appreciate the greatness of our country and our freedoms, because we've consciously fled other places with the hopes of making a better life here. We've undergone 'extreme vetting' and left behind our loved ones for a chance to be free and follow our dreams. ... On January 27th, everything changed as your signature made my uncle disappear ... The following day I saw my father cry for the first time in my life. My mom got sick. I felt afraid and alone. My parents started plans with the expectation we were all about to be rounded up and sent to internment camps. Later that day, we realized our family wasn't alone in LAX. Countless people showed up, chanting supportive messages and singing s\nThis April 22, 2017 photo shows James McDonald, 57, of Tazewell, Va. One hundred days into Donald Trump's presidency, The Associated Press asked people from across the country to write a letter to the president. He wrote: \"... Since the inauguration my only concern was the handling of the repeal and replace of the Affordable Health Care Act. I felt like you comprised too much, and came close to signing a bad bill. I commend you on your continued efforts to enact this change, however if it's not a good bill please don't compromise too much. ... Of course keeping America safe is your number one priority, after that in my opinion it is putting people back to work. One quote from the Republican Convention that was impressive was when Donald Trump Jr. said that 'when people tell him it can't be done, that guarantees that he gets it done.' They say you can't make America Great Again. Prove them wrong. ...\" (AP Photo/Claire Galofaro)\nFILE - This Wednesday, Nov. 23, 2016 photo, shows Brooke Streech, a financial planner, in Phoenix. One hundred days into Donald Trump's presidency, The Associated Press asked people from across the country to write a letter to the president. She wrote: \"Your lack of experience and intelligence has certainly shown itself to be an issue so far in your presidency. It might be OK to go into office with your incredible ignorance if you were to surround yourself with smart and talented people. Unfortunately you have done the opposite. Your administration appears to be run less efficiently and with more chaos than any other in history. ... I would implore you to spend some time reflecting on how you get your information. Find advisers and spokespeople who are smart, good at what they do, and might disagree with you once in a while with the aim to create dialogue and make decisions with all of the information available. ...\" (AP Photo/Ross D. Franklin)\nFILE - In this Wednesday, Jan. 4, 2017 file photo, Sudanese refugee Suliman Bandas, who teaches English as second language, speaks in his classroom in Lincoln, Neb. One hundred days into Donald Trump's presidency, The Associated Press asked people from across the country to write a letter to the president. He wrote: \"I grew up in southern Sudan, which was engaged in a long civil war with the north. In 1986 my uncle ... took my father, a teacher, and other civilians in a helicopter to areas that needed aid. I watched from our backyard as that helicopter was shot down. ... In 2005, I was accepted to come to the U.S., a place where I can be safe and call home. ... In my job I help teach refugees, and every day they express to me their worries that this country may reject refugees in the months to come. I have heard you express concern about the Syrian people and I hope this is a turning point. Please, Mr. President, let America continue to treat refugees the same way God wanted them to b\nThis April 24, 2017 shows Rick Yearick of Liberal, Kan. One hundred days into Donald Trump's presidency, The Associated Press asked people from across the country to write a letter to the president. He wrote: \"Keep fighting for a secure America with your travel ban for those who seek to do us harm, building a wall to secure a sound immigration policy, and by serving Americans and not trying to be President of the World. ... I commend you on the selection of (Supreme Court Justice Neil Gorsuch) for his commitment to the Constitution rather than a revisionist who interprets it to fit their political needs. I am sure that given a chance at more appointments, you will do the same. I feel American pride again knowing that our president believes in all of us. For the past several years, I could not relate to the direction we were headed as we were divided and at each other's throats. Now, we are uniting behind the common man with the leadership of a president who honors us all.\" (Earl Watt\nFILE - This Wednesday, Jan. 4, 2017 file photo shows Kate Young, a Democrat who voted for Hillary Clinton, in West Chester, Pa. One hundred days into Donald Trump's presidency, The Associated Press asked people from across the country to write a letter to the president. She wrote: \"... When you won the election, I worried that you would put business profits ahead of the environment, and that you would involve the United States in a new, possibly nuclear, war. Today, much sooner than I feared, both dire predictions have come true. Congress rolled back environmental protections ... You bombed Syria, and as I write this letter, the news reports that you dropped the `Mother of all Bombs' on Afghanistan. Please don't go nuclear! ... \"Luckily, I don't have to fight you alone. Most Americans did not vote for you. We won't stop holding you accountable for every infraction of American laws, values, or norms.\" (AP Photo/Matt Rourke)\nIn this April 21, 2017 photo, Carolee Upshur, member of Ohio Diversity Coalition, a pro-Trump group, poses for a photo in her office in Seven Hills, Ohio. One hundred days into Donald Trump's presidency, The Associated Press asked people from across the country to write a letter to the president. She wrote: \"... I have been utterly amazed at your ability to accomplish anything in the environment as it exists in Washington. ... You jumped in feet first and set out to do everything you promised during your campaign. ... I applaud your move to curtail the illegal immigration and build the wall, and continue to be frustrated at the attempts of the progressives to use the judicial system to try and block your attempts to fulfill your duties as president. ... I was absolutely thrilled to see the decisiveness with which you acted in Syria and Afghanistan, which sent a strong message to the world that there `is a new sheriff in town.\"' It is wonderful to have a `man's man' leading this countr\nFILE - In this Monday, Nov. 21, 2016 file photo, high school student Amellia Sones, who helped organize a Ventura Boulevard protest after the presidential election, poses with some of her signs at her home in Los Angeles. One hundred days into Donald Trump's presidency, The Associated Press asked people from across the country to write a letter to the president. She wrote: \"... One major thing I do not like is putting a ban on immigrants from entering the United States. I know you were trying to keep terrorists from entering our country, but I do not believe banning immigrants from certain countries is an effective way of doing this. And, after all, the United States is called the melting pot of many nations. ... Your biggest failure (and there have already been so many) is NOT making an effort to bring our country together. To me, that's a big part of a president's job. ... I only ask that you start watching the way you speak and try listening to what your people are asking of you. S\nFILE - In this Jan. 5, 2017 file photo, Ed Harry, a retired union leader and lifelong Democrat who switched to the GOP to vote for Donald Trump, eats breakfast in Plymouth, Pa. One hundred days into Donald Trump's presidency, The Associated Press asked people from across the country to write a letter to the president. He wrote: \"I laughed when I heard you were running for president. I didn't think you had a chance. As the campaign went along, I found out that the Democrats, Republicans ... China, India, Mexico, all were opposed to you. At that moment I knew I had my candidate. ... Considering all the opposition you have had against you, I think you deserve a C+ rating. You've accomplished quite a lot: Neil Gorsuch appointment ... get rid of a lot of Obama executive orders ... \"The WALL,\" or at least some immigration enforcement I would like to see take place this year. Finally, most of all, do NOT let the neocons or both political parties corrupt your administration. I do, in fact, b","url":"https://www.dailymail.co.uk/wires/ap/article-4448458/Ill-praying-Americans-assess-Trumps-100-days.html"}
