{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:33:11","date_modify":"2018-10-22 23:33:11","date_publish":"2016-01-11 06:26:36","description":"The 53-year-old actor wore a smart suit, paired with ornate wedge sandals, and also added some gold nail polish to his fingers and toes","filename":"data/vaneerConsumption/AmericanHorrorStorysDenisOHarepraisedforGoldenGlobesdresschoice.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/06/300578A300000578-0-image-a-49_1452493505194.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3393254_He-boss-American-Horror-Story-star-Denis-O-Hare-praised-breaking-gender-norms-wearing-sky-high-heels-Golden-Globes-red-carpet_1540251191.html","title":"American Horror Story's Denis O'Hare praised for Golden Globes dress choice","title_page":"American Horror Story's Denis O'Hare praised for Golden Globes dress choice | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Actor Denis O'Hare took a leaf out of his American Horror Story character's book when he hit the Golden Globes red carpet in a pair of chunky wedge heels.\nThe 53-year-old, who plays cross-dressing character Liz Taylor in the latest season of the hit FX series, strutted his stuff down carpet at the star-studded event in a houndstooth suit jacket, black tie and black trousers, finishing off his outfit with a pair of ornate gold heels.\nAs a finishing touch, the actor added gold nail polish to his fingers and toes, no doubt in honor of the glittering awards.\nScroll down for video\nMaking a statement: American Horror Story star Denis O'Hare donned a pair of high wedge sandals for his appearance on the Golden Globes red carpet\nYou are gold: The ornate sandals featured metallic detailing on the sides, simple black straps, and bright red soles; the 53-year-old also added matching gold nail polish to his toenails\nStanding tall: The actor looked more than comfortable in the heels, no doubt thanks to his time spent dressing up as cross-dressing bartender Liz Taylor in American Horror Story\nClearly eager to show off his metallic accessories, Denis took plenty of time to pose for the cameras, at one point kicking up his Christian Louboutin heels to reveal the bright red soles, which were almost the exact same color as the carpet he was walking down.\nSimilarly the actor made sure to hold up his hands so the waiting photographers could get a good shot of his manicure, which appears to have taken a great amount of effort to perfect - at least if Denis' Twitter account is anything to go by.\nDenis shared an image of himself preparing for the ceremony on social media, revealing that he was treating himself to a pre-Golden Globes pampering session.\nAlongside an image of himself dipping his toes into a foot spa, the actor simply wrote: 'Getting ready for the #GoldenGlobes.'\nTake a look! Clearly eager to show off his metallic accessories, Denis took plenty of time to pose for the cameras, at one point kicking up his Christian Louboutin heels to reveal the bright red soles\nHappy as can be! Denis joked around with photographers on the carpet, striking all manner of fun poses\nPow pow: At certain points, the actor looked as though he was taking part in a kung fu class\nIt's all in the details: The shoes featured beautiful gold detailing in an oriental-style design\nBut at the time, he gave away very little about his outfit, however fans were delighted when he hit the carpet, and made sure to take to Twitter to share their compliments.\n'Denis O'Hare rocking a suit and heels like a boss,' one person tweeted, while another added: 'I love that Denis O'Hare is wearing heels to the Golden Globes. Slay.'\nA third person said: 'Yes look at Denis O'Hare breaking gender norms and stunting the red carpet tonight in heels!'\nMeanwhile, other people took the chance to express their amazement and awe at how well Denis, who married his partner, fellow actor Hugo Redwood in 2011, was managing to walk in the shoes, with many noting that they struggle to last mere minutes in such sky-high heels, let along managing to walk so confidently in front of hundreds of cameras.\n'I can barely last an hour in heels so you do you Denis O'Hare,' commented one person. 'So impressed with Denis O'Hare rocking the heels with such confidence,' added another.\nIn character: Denis play cross-dressing bartender Liz Taylor in American Horror Story: Hotel\nPamper session: Prior to the awards, Denis took the time to make sure his feet were in perfect condition to show off in a pair of open-toe shoes\nCo-stars: Denis took some time to pose alongside his fellow American Horror Story stars, Golden Globe winner Lady Gaga and actor Cheyenne Jackson\nBest wishes: The actor also took to Twitter to offer his congratulations to Lady Gaga and American Horror Story creator Ryan Murphy\nBut wearing the chunky platforms will likely not have caused much of an issue for Denis, who has to wear all manner of flamboyant women's clothing for his role as cross-dressing bartender Liz Taylor in American Horror Story: Hotel.\nThe character, who was previously known as Nick Pryor, decides to live as a woman, opting to model his female identity after that of screen icon Elizabeth Taylor.\nAlthough Denis was not nominated for an individual award, he and his fellow American Horror Story stars were nominated as an ensemble for Best Television Limited Series or Motion Picture Made for Television, which was eventually won by Wolf Hall.\nDenis' co-star Lady Gaga had better luck however, scooping the gong for Best Performance by an Actress in a Leading Role in a Series, Limited Series or Motion Picture Made for Television.\nAnd Denis was quick to offer his congratulations to Lady Gaga, tweeting: 'Congrats to @ladygaga and [the show's creator] @MrRPMurphy and all of the @AHSFK family.'","url":"https://www.dailymail.co.uk/femail/article-3393254/He-boss-American-Horror-Story-star-Denis-O-Hare-praised-breaking-gender-norms-wearing-sky-high-heels-Golden-Globes-red-carpet.html"}
