{"authors":["Domenico Montanaro"],"date_download":"2018-10-23 05:17:22","date_modify":"2018-10-23 05:17:22","date_publish":"2015-04-02 00:00:00","description":"President Obama said \"solid majorities support a diplomatic resolution\" with Iran. That's true to an extent. When you scratch beneath the surface, it's more complicated.","filename":"data/vaneerConsumption/AmericansSupportIranTalksButDoubtTheyllPreventAWeapon.json","image_url":"https://media.npr.org/assets/img/2015/04/02/468391280_wide-f7a413be87a6606bd40399080450274093e71abd.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_itsallpolitics_2015_04_02_397106022_americans-support-iran-talks-but-doubt-theyll-prevent-a-weapon_1540271842.html","title":"Americans Support Iran Talks, But Doubt They'll Prevent A Weapon","title_page":"Americans Support Iran Talks, But Doubt They'll Prevent A Weapon : It's All Politics : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Americans Support Iran Talks, But Doubt They'll Prevent A Weapon\nEnlarge this image toggle caption Nicholas Kamm/AFP/Getty Images Nicholas Kamm/AFP/Getty Images\nEvery politician likes to tout what they believe the \"American People\" want.\nAs the debate over the Iran nuclear deal inevitably heads toward the meat grinder that is Congress, President Obama tried to preemptively frame that debate. And he claimed to have the \"American people\" on his side.\n\"If Congress kills this deal, not based on expert analysis and without offering any reasonable alternative, then it's the United States that will be blamed for the failure of diplomacy,\" Obama said during remarks at the White House unveiling the framework for the Iran deal. \"International unity will collapse, and the path to conflict will widen. The American people understand this, which is why solid majorities support a diplomatic resolution to the Iranian nuclear issue.\" (Bolding ours.)\nPolls, though, show a mixed bag on American public opinion regarding an Iran deal.\nFirst, to the larger picture of how Americans feel about this president's handling of foreign policy, a majority say they disapprove of the job he's doing.\nAt the same time, however, more Americans said they have confidence in Obama dealing with foreign policy than Republicans in Congress by a 47 to 39 percent margin, per a March CNN/ORC poll.\nSupport For Direct Negotiations\nTo whether \"solid majorities support a diplomatic resolution,\" as Obama said, several polls seem to support what the president said.\nAn ABC/Washington Post poll out Thursday found people in support of a deal by a 59 to 31 percent margin.\nA CNN/ORC poll from earlier this month found 68 percent in favor of direct diplomatic negotiations \"in an attempt to prevent Iran from developing a nuclear weapon.\" (Most also said they thought the Republican letter to Iran \"went too far.\")\nA Pew Research poll out this week found a lower number, but still a plurality of Americans in favor of direct negotiations by a 49 to 40 percent margin. (That's down from the 63 percent who approved of them in Obama's first year in office.)\nDoubts That A Deal Could Prevent Iran Getting A Nuclear Weapon\nOf course, wording and context is important.\nABC/Washington Post asked:\n\"Would you support or oppose an agreement in which the United States and other countries would some of their economic sanctions against Iran, in exchange for Iran restricting its nuclear program in a way that makes it harder for it to produce nuclear weapons?\" (Bolding again ours.)\nEven though a solid majority said they would be in favor of such a deal, an almost equal number of Americans (60 percent) said they doubt a deal \"would prevent Iran from developing nuclear weapons.\"\nSimilarly, an NBC News/Wall Street Journal poll last month found more than 7-in-10 said they thought a deal would \"not make a real difference in preventing Iran from producing nuclear weapons.\"\nOpinion Ready To Be Shaped\nInformation about the details of the Iran deal framework are still being parsed. But even before Thursday's announcement, most people said they knew very little about the negotiations. Pew found that 73 percent said they either knew \"a little\" or \"nothing at all\" about them.\nThat same poll also found that a strong majority (62 percent) wants Congress to \"have the final authority for approving any deal\" not President Obama.\nTranslation: Public opinion is not yet baked in, and, like in any political campaign, public opinion is ripe to be shaped.\nLet the talking points begin.","url":"https://www.npr.org/sections/itsallpolitics/2015/04/02/397106022/americans-support-iran-talks-but-doubt-theyll-prevent-a-weapon"}
