{"authors":["John Binder"],"date_download":"2018-10-30 19:10:41","date_modify":"2018-10-30 19:10:41","date_publish":"2018-06-28 23:13:36","description":"American workers thanked President Trump as a new Foxconn manufacturing plant broke ground in Wisconsin on Thursday.","filename":"data/vaneerConsumption/AmericanWorkersThankTrumpasManufacturingPlantBreaksGroundMeandMyFamilyAreGrateful.json","image_url":"https://media.breitbart.com/media/2018/06/Trump-Foxconn-AP-PhotoEvan-Vucci.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_06_28__1540926641.html","title":"American Workers Thank Trump as Manufacturing Plant Breaks Ground: 'Me and My Family Are Grateful'","title_page":"American Workers Thank Trump as Manufacturing Plant Breaks Ground: 'Me and My Family Are Grateful' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"American workers thanked President Trump as a new Foxconn manufacturing plant broke ground in Wisconsin on Thursday.\nDuring the groundbreaking ceremony, Trump welcomed three American workers onstage who will be working at the manufacturing plant or are working on building the facility. The workers thanked Trump and Foxconn for giving them new opportunities in the president’s “Hire American” economy.\n“I started in 2005 as an operating engineer and Hoffman Construction gave me my first job in a hall truck,” Celia Griffin, a mother of three told the crowd at the ceremony.\n“Me and my family are grateful and very pleased to be at home again,” Griffin said. “Thank you, everyone. Thank you.”\nDawn Wallace, a mother of three, says she re-entered the workforce after being a stay-at-home mom for years due to the job opportunities that have come to Wisconsin.\n“I would just like to thank Hoffman [Construction] for giving me the opportunity to start something new,” Wallace said. “What a perfect way than Foxconn. I was super excited when I heard it was coming in our area.”\nChris Coski, who is one of the project managers on the site, said he “appreciated the opportunity” to get to do a job that he says he’s been doing since he was a child.\n“Foxconn is probably one of the best things that’s ever happened to Hoffman Construction … and I appreciate the opportunity, President Trump,” Coski said. “Thank you very much.”\nTrump said Foxconn has already contracted more than 25 local Wisconsin construction companies to help build their main facility. Foxconn executives say they will build the factory with American made steel and concrete.\nEarlier this week, American workers at Harley-Davidson praised Trump’s fair trade policies, crediting the populist president for “just trying to save American industry,” as Breitbart News reported.\nJohn Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.","url":"https://www.breitbart.com/politics/2018/06/28/american-workers-thank-trump-as-manufacturing-plant-breaks-ground-me-and-my-family-are-grateful/"}
