{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 19:58:27","date_modify":"2018-10-30 19:58:27","date_publish":"2015-09-24 04:18:38","description":"American Airlines told a wounded Marine veteran his service dog would not be permitted to go with him aboard his flight home to Virginia.","filename":"data/vaneerConsumption/AmericanAirlinesTellsVeteranWithPTSDThatServiceDogNotAllowedonFlight.json","image_url":"https://media.breitbart.com/media/2015/09/veteran-jason-haag-with-service-dog-axel-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_09_23__1540929507.html","title":"American Airlines Tells Veteran With PTSD That Service Dog Not Allowed on Flight","title_page":"American Airlines Tells Veteran With PTSD That Service Dog Not Allowed on Flight","title_rss":"NULL","source_domain":"breitbart.com","text":"American Airlines courted criticism last weekend when airport ticket takers told a wounded Marine veteran with PTSD that his service dog would not be permitted to go with him aboard his flight home to Virginia.\nMarine Corps Capt. Jason Haag and his service dog Axel were trying to board an American Airlines flight in California on Sept. 20. The two were headed back to Virginia from the American Humane Association Hero Dog Awards where Axel had been awarded Service Dog of the Year. Airline employees, though, refused to allow Axel to accompany his master onto the plane.\nMarine Captain Haag and Axel came together after he was diagnosed with post-traumatic stress disorder (PTSD) in 2012.\nHaag served one tour of duty in Afghanistan and two in Iraq. He earned a Purple Heart after he was shot in the leg and an IED explosion left him with a traumatic brain injury.\nOnce he returned home, Capt. Haag turned to alcohol and began to go downhill quickly until he was diagnosed with PTSD. In 2012, Haag was introduced to Axel as a form of therapy and the new relationship changed the veteran’s life.\n“There’s no doubt in my mind that if it wasn’t for Axel, I’d be six feet underground now,” Haag told the Today show in 2014. “I’d have become a PTSD statistic.”\nDespite that history, as Haag tried to board his flight last weekend, airline employees told him that the dog was not permitted on the flight and that the airline requires a medical alert ID card to allow service dogs onto flights. However, the American Airlines website clearly says that service dogs are welcome and does not say ID cards are required.\n“It was extremely upsetting,” Haag told WJLA Channel 7 in Washington DC. “It was disrespectful. If I wasn’t as far along in my recovery from PTSD, this would have set me back years. It would have put me back in my basement where I was three years ago.”\n“What do I want? We’d love an apology,” Haag told the media.\nThe airline did apologize. American Airlines quickly issued a statement by airline spokesperson Victoria Lupica: “We apologize to both Captain Haag and his family for the confusion with the travel plans, yesterday. Thank you, Captain Haag, for your service to your country. We are extremely proud to fly you, Axel and your family.”","url":"https://www.breitbart.com/politics/2015/09/23/american-airlines-tells-vet-ptsd-service-dog-not-allowed-flight/"}
