{"authors":["Chris Pleasance For Dailymail.Com"],"date_download":"2018-10-23 03:25:10","date_modify":"2018-10-23 03:25:10","date_publish":"2016-01-28 18:53:27","description":"American Airlines Flight 1317 traveling to Miami International Airport from Chicago was just 500 feet off the ground when the pilot radioed police to report crossing paths with a drone yesterday.","filename":"data/vaneerConsumption/AmericanAirlinesflightcrossedpathswithadroneatMiamiairport.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/2ECD199C00000578-0-image-a-7_1454005985210.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421457_American-Airlines-flight-lucky-escape-crossing-paths-drone-just-seconds-landing-Miami-airport_1540265110.html","title":"American Airlines flight crossed paths with a drone at Miami airport","title_page":"American Airlines flight crossed paths with a drone at Miami airport | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An American Airlines plane on its final approach into Miami had a lucky escape after spotting a drone in its path just moments from touching down.\nAmerican Flight 1317 from Chicago was just 500 feet off the ground at Miami International Airport yesterday afternoon when the pilot radioed police on the ground.\n'Drone on final for American 1317, runway 9,' the pilot, who was carrying 113 passengers and six crew, told officers. 'It was about 500 feet. I saw a drone on final for runway 9, 1317.'\nAmerican Airlines Flight 1317 was just seconds from landing at Miami International Airport yesterday morning when the pilot radioed police on the ground to report a drone had crossed their path (file image)\nPolice said they conducted a search around Miami airport (pictured) in an attempt to find the drone pilot, but were unable to locate them\nFortunately the aircraft managed to avoid the remote-controlled drone and landed safely, the Miami Herald reports.\nHowever, had the device been sucked into the aircraft's jets it could have brought the plane down, similar to a 'bird-strike' - industry slang for animals getting caught in engines.\nPolice searched the area around the airport to try and locate the person controlling the drone, but were unable to find them.\nSenator Bill Nelson, of Florida, who is a member of the Senate Commerce Committee, which oversees the Federal Aviation Administration, said: 'Today’s incident is yet another example of the danger drones pose to the traveling public.\nAccording to the FAA there around around 25 near misses between drones and aircraft every month, which is why owners are now being forced to register the machines (file image)\n'Finding a way to implement the technology needed to prevent this kind of dangerous situation near our nation’s airports will be one of my top priorities as we begin work on a bill to reauthorize the FAA in the coming weeks.'\nFlying into no-go zones over airports is already forbidden by FAA regulations, as is flying above sports stadiums.\nAuthorities also began requiring users to register their craft before Christmas in an attempt to make users more responsible for their actions.\nAround 200,000 of the machines were reported to have been sold over the festive period.","url":"https://www.dailymail.co.uk/news/article-3421457/American-Airlines-flight-lucky-escape-crossing-paths-drone-just-seconds-landing-Miami-airport.html"}
