{"authors":["Associated Press"],"date_download":"2018-10-22 21:51:33","date_modify":"2018-10-22 21:51:33","date_publish":"2016-01-29 08:21:21","description":"SEOUL, South Korea (AP) — A Seoul court sentenced an American to 20 years in prison Friday for fatally stabbing a South Korean university student at a Seoul ...","filename":"data/vaneerConsumption/Americangets20yearsfor1997killinginSeoul.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422280_American-gets-20-years-1997-killing-Seoul_1540245093.html","title":"American gets 20 years for 1997 killing in Seoul","title_page":"American gets 20 years for 1997 killing in Seoul | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"American gets 20 years for 1997 killing in Seoul\nSEOUL, South Korea (AP) — A Seoul court sentenced an American to 20 years in prison Friday for fatally stabbing a South Korean university student at a Seoul Burger King restaurant in 1997.\nThe sentence by the Seoul Central District Court of Arthur Patterson, 36, from California, was the same that had been earlier requested by prosecutors. Patterson has one week to appeal, according to court spokesman Joon Young Maeng.\nPatterson was extradited to Seoul in September, 16 years after he fled to the U.S.\nPatterson's American friend, Edward Lee, who was with him at the time of the murder, was initially sentenced to life in prison for killing 22-year-old student Cho Choong-pil. But Lee was later acquitted due to lack of evidence.\nPatterson had originally received an 18-month term for destroying evidence and possessing a dangerous weapon. Patterson was the owner of the knife used in the killing, and he threw it down a drain afterward, according to South Korean media reports. He was later freed in a special amnesty and fled South Korea in 1999 while authorities launched a new investigation, according to South Korea's Justice Ministry.\nPatterson and Lee, both teenagers at the time, accused each other of killing Cho, who was found with multiple stab wounds in the Burger King bathroom and died on the way to a hospital. Cho was a stranger to both Americans.\nPatterson was in South Korea at the time of the killing because his father was a civilian employee working for the U.S. military.","url":"https://www.dailymail.co.uk/wires/ap/article-3422280/American-gets-20-years-1997-killing-Seoul.html"}
