{"authors":["Sarah Jones For Dailymail.Com"],"date_download":"2018-10-22 21:23:36","date_modify":"2018-10-22 21:23:36","date_publish":"2016-01-28 07:29:01","description":"'It's about to get really tough,' the 48-year-old country singer warned the contestants as they prepared to perform on stage on the opening night of American Idol's Hollywood Week","filename":"data/vaneerConsumption/AmericanIdoljudgesaxeseveralhopefulsduringHollywoodWeeksfirstnight.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/08/30A781B900000578-0-image-a-18_1453968447029.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420363_American-Idol-judges-axe-hopefuls-opening-night-Hollywood-Week-s-biggest-fan-makes-through_1540243416.html","title":"American Idol judges axe several hopefuls during Hollywood Week's first night","title_page":"American Idol judges axe several hopefuls during Hollywood Week's first night | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The opening night of American Idol's final ever Hollywood Week aired Wednesday.\nAnd judges Jennifer Lopez, Keith Urban and Harry Connick Jr. were not about to take it easy on the wide-eyed hopefuls.\n'It's about to get really tough,' the 48-year-old country singer warned the contestants as they prepared to perform on stage.\nCutting down: American Idol's Hollywood Week opening night aired Wednesday with judges Keith Urban, Jennifer Lopez and Harry Connick Jr.\nThe self-proclaimed world’s biggest American Idol fan led the way as the girls dominated the evening.\nMichelle Marie told the cameras she has spent her life dreaming of competing on the show and can name every single previous winner.\nAnd the excitable 16-year-old from Florida took her chance as she loudly secured her place on the next round of the show.\n‘This is my moment to shine and show America what I can do,’ she told the cameras before performing Dibs.\nSee more of the latest on American Idol updates as the judges axe several hopefuls\n'It's about to get really tough': Country singer Urban warned the contestants as they prepared to perform on stage\nTough on the talent: The Fox hit show's judges were not about to take it easy on the wide-eyed hopeful contestants for the final season\nAmbitious: Michelle Marie, 16, labeled herself as the world's biggest American Idol fan and told the cameras she has spent her life dreaming of competing on the show\nScream queen: After securing her place on the next round of the show she shouted her way around the venue in celebration\nAfter getting her good news Michelle screamed her way around the venue in celebration.\n‘I am thrilled - on a scale of one to ten - I am a million percent excited. I am going to the next round, woooooooh,’ she laughed.\nMichelle did not hold back, screaming, ‘This is crazy, this is crazy!’\nThe first episode of the final ever Hollywood Week saw the three judges watch the performers sing in lines of ten, before sending people through.\nHits and misses: The first episode of the final ever Hollywood Week saw the three judges watch the performers sing in lines of ten, before sending people through\nSuccessful spouse: Jordan Sasser, a 27-year-old worship leader from Raleigh, North Carolina got through to Hollywood Week despite his wife receiving a 'no' during their joint Atlanta audition\nJordan Sasser, a 27-year-old worship leader from Raleigh, North Carolina got through to Hollywood Week despite his wife receiving a 'no' during their joint Atlanta audition.\nThe singer said he was inspired to audition by Idol Kelly Clarkson and his performance of Shoulda Been Us was enough to see him through.\nDalton Rapattoni and Jaci Butler once competed against each other in a Battle of the Bands when they were just 11.\nPunky Dalton, 19, from Dallas, Texas, performed California Dreaming while green-haired Jaci, 19, from Roulette, Texas, took on Remember Me for Centuries.\nFormerly faced-off: Dalton Rapattoni and Jaci Butler once competed against each other in a Battle of the Bands when they were just 11\n'90s grunge style: Punky Dalton, 19, from Dallas, Texas, performed California Dreaming\nMane attraction: Green-haired Jaci, 19, from Roulette, Texas, took on Remember Me for Centuries\nThe performances were good enough to see Jordan, Dalton and Jaci all go through to the next round.\nJen Blosil, 23, from Brooklyn, whose brother gave her the nickname ‘J-Blo,' Thomas Stringfellow, 17, from Bentonville, Arkansas, and Olivia Rox,16, from Agoura Hills, California, all made it through from their line.\nThe show then flashed back to the San Francisco auditions where the judges praised all of the female talent that tried out.\nHair we go: Jen Blosil, 23, from Brooklyn, New York, whose brother gave her the nickname ‘J-Blo' made it through to the next round\nJ-Blo envies JLo! Blosil's brother nicknamed contestant Jen after Lopez's nickname 'JLo'\nCover girl: Jessica Cabral, 21, from Worcester, Massachusetts, performed her own version of Photograph\nJessica Cabral, 21, from Worcester, Massachusetts, performed her own version of Photograph while Harry recognized Melanie Tierce from her audition because she was so good he got up and walked off the set.\nMelanie, 21, from Murrieta, California, performed Invincible for her audition.\nSonika Vaid, 20, from Martha’s Vineyard, Massachusetts, was singled out by Harry in her Denver audition as a candidate to win the whole competition.\nGuitar girl: Melanie, 21, from Murrieta, California, performed Invincible for her audition\nTough break: Harry recognized Melanie from her audition because she was so good he got up and walked off the set but unfortunately she didn't make it to the next round\nShocker: ‘I think a lot of the contestants watching were a little surprised to see that Melanie Tierce is not going to go forward,’ Ryan Seacrest told the cameras\nStand out: Sonika Vaid, 20, from Martha’s Vineyard, Massachusetts, was singled out by Harry in her Denver audition as a candidate to win the whole competition as she indeed made it through the round\nSonika told the cameras she hoped she could stand out for the judges, and she had nothing to worry about as she was sent through along with Jessica Cabral.\n‘My whole body is shaking,’ Sonika told the cameras before she hugged her watching mother.\nBut it was surprisingly the end of the road for Melanie Tierce who did not make it through.\nMusician mom: La’Porsha Renae’s ten-month-old daughter was in the audience to watch her sing Roar, which Harry praised as ‘restrained'\nPowerful performance: La’Porsha, 22, from McComb, Mississippi, was sent through to the next round as she fought back tears of happiness\n‘I think a lot of the contestants watching were a little surprised to see that Melanie Tierce is not going to go forward,’ Ryan Seacrest told the cameras.\nAnd Melanie herself was surprised at her quick exit.\n‘It is hard not to be. When you go through this process your hopes are bound to rise a bit. Everything happens for a reason,’ she said glumly.\nLadies man: Harrison Cohen, 17, from New York City flirted with the women before he took to the stage with his guitar\nWing man: But first Cohen called his ‘foxy grandpa Al’ to tell him how pretty all the girls\nSingle mom La’Porsha Renae’s ten-month-old daughter was in the audience to watch her sing Roar, which Harry praised as ‘restrained.'\n‘Having my daughter here with me is keeping me determined and focused. It is very important for me to do well in this competition as I came through so much to get here and I want to show her that you can come out of the storm and there is a rainbow at the end if you do not give up,’ she told the cameras.\nLa’Porsha, 22, from McComb, Mississippi, was sent through to the next round as she fought back tears of happiness and got a hug from Ryan.\nSwag! Daniel Farmer, 25, from Memphis, Tennessee, who practiced his ‘sexy’ dance moves for Jennifer during his audition, impressed with Treasure\nCrooner: Manny Torres, 20, from Queens, New York, sang Can't Feel My Face by The Weeknd\nIn love with Lopez! Torres told the cameras that he and Jennifer had a connection because of their Puerto Rican heritage\nPraise: Apparently the flatterly worked because Daniel and Manny were given the nod to go through\n‘I am very excited to see my baby, she is all I have been thinking about,’ she told him.\nHarrison Cohen, 17, from New York City calls his ‘foxy grandpa Al’ to tell him how pretty all the girls are before taking to the stage with his guitar.\nDaniel Farmer, 25, from Memphis, Tennessee, who practiced his ‘sexy’ dance moves for Jennifer during his audition, impressed with Treasure.\nDay two: After making several cuts the judges headed into the second day of Hollywood Week\nManny Torres, 20, from Queens, New York, told the cameras that he and Jennifer had a connection because of their Puerto Rican heritage.\nDaniel and Manny were given the nod to go through but it was the end for Harrison who was sent home.\nLee Jean, 16, from Bluffton, South Carolina, and hairdresser Shelbie Z, 23, from Sumiton, Alabama, were the final featured contestants from day one to make it through.\nColorado cowgirl: Jeneve Rose Mitchell, 15, grew up off the grid without electricity in rural Crawford, Colorado\nYoung singer: She brought her cowboy hat and her cello with her for her performance of Boondocks, which impressed the judges enough to send her through\nBut it was not so good for cancer survivor Melany Huber, 17, from Livonia, Michigan, who did not get through.\nJeneve Rose Mitchell, 15, grew up off the grid without electricity in rural Crawford, Colorado.\nShe brought her cowboy hat and her cello with her for her performance of Boondocks, which impressed the judges enough to send her through.\nLucky break: Some of the already successful contestants toured Hollywood and got to see boy band One Direction soundcheck for their performance on Jimmy Kimmel’s late night talk show\n‘I hope its the best season yet': Late Night Talk Show host Jimmy Kimmel told Ryan Seacrest of the Final American Idol season\nSome of the already successful contestants toured Hollywood and got to see boy band One Direction soundcheck for their performance on Jimmy Kimmel’s late night talk show.\nJimmy met up with Ryan on the street and told him: ‘I hope its the best season yet.’\nGianna Isabel is daughter of 1980s pop star Brenda K. Starr, an old friend of Jennifer Lopez who attended the same dance school in New York.\nMomager: Gianna Isabel, 15, is daughter of 1980s pop star Brenda K. Starr, an old friend of Jennifer Lopez who attended the same dance school in New York\nDisagreement with her daughter: After clashing about Gianna's audition performance she sang One Night Only\nMixed reviews: But after moving Gianna between lines the judges her through\nAfter some disagreements about her audition performance, Gianna, 15, from Jackson, New Jersey, sang One Night Only.\nTristan McIntosh, 15, from Nashville, Tennessee, was surprised at her first audition by her military mom, Maj. Amy McIntosh, and her biggest supporter was on hand to cheer her on again.\nAfter moving Gianna between lines the judges sent both of the hopefuls through.\nTeen talent: Kyrsti Jewell, from Arcadia, California, had parents who are huge Idol fans and she was actually auditioning on her 16th birthday\nKyrsti Jewell, from Arcadia, California, has parents who are huge Idol fans and she was actually auditioning on her 16th birthday.\n‘I could not think of a better birthday present than getting a yes from the judges, that would be a dream come true,’ said Kyrsti who sang Rock Steady.\nBut she was left ‘crushed’ as she did not get through.\nBittersweet birthday: ‘I could not think of a better birthday present than getting a yes from the judges, that would be a dream come true,’ said Kyrsti but she was left ‘crushed’ as she did not get through\nTrent Harmon learned just before his audition that he suffering from mono and doctors advised him to rest or go home early.\n‘That was a crappy phone call to get 20 minutes before you sing. It sucks,’ a visibly sick Trent told the cameras.\n‘I am doing my best to maintain, my voice is getting weaker and weaker, I am freaking out, but I have just got to push through.’\nDisappointment: Trent Harmon learned just before his audition that he suffering from mono and doctors advised him to rest or go home early\nUnstoppable: But despite battling a fever and shakes he took to the stage for a performance of Sam Smith’s Lay Me Down\nBut despite battling a fever and shakes he took to the stage for a performance of Sam Smith’s Lay Me Down.\nPoh Scott dedicated her version of Stay to her sister, and Idol alum Shi.\nEmily Brooke was cut last season before the Top 24 and performed I Wish I Could Break Your Heart by Cassadee Pope.\nSlick songstress! Jennifer played a trick on the remaining hopefuls by sending through half of the line, leaving Trent thinking he had been cut\nLopez has the last laugh! But then the Idol judge screamed that they were going through\nJennifer played a trick on the remaining hopefuls by sending through half of the line, leaving Trent thinking he had been cut.\nBut she then screamed that they too were going through.\n‘I feel terrible, I did’t think I would be able to do it,’ said a relieved Trent.\nOn Thursday night Hollywood week will continue with the group round of the competition.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420363/American-Idol-judges-axe-hopefuls-opening-night-Hollywood-Week-s-biggest-fan-makes-through.html"}
