{"authors":[],"date_download":"2018-10-30 01:04:43","date_modify":"2018-10-30 01:04:43","date_publish":"2018-08-29 16:34:07","description":"Fast, with a good eye, a classic left-handed sweep, and equal facility from either wing, Adrian Mannarino is a tough competitor of the old school, whose dictum is “Be sure yours is the last ball to go over the net.”","filename":"data/vaneerConsumption/AmericanTakesFlightatUSOpen.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/2016_Citi_Open_Frances_Tiafoe_28270215622.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861483.html","title":"American Takes Flight at U.S. Open","title_page":"American Takes Flight at U.S. OpenThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Fast, with a good eye, a classic left-handed sweep, and equal facility from either wing, Adrian Mannarino is a tough competitor of the old school, whose dictum is “Be sure yours is the last ball to go over the net.”\nRené Lacoste, who subverted Bill Tilden’s dominance of the sport in the 1920s, was the proponent of this strategy and you cannot argue with success, until it fails. The French cohort he led took the Davis Cup from the Tilden-captained Americans at Philadelphia in 1926 and, with it, the sport, until the early ’30s, when a younger cohort, California’s Don Budge in particular, got its turn.\nWith all due respect for the changes that have taken place in tennis, Adrian Mannarino is a Lacostian. As a Frenchman, his game is classic, elegant — well-taught and well learned. (Lacoste himself did not play or move gracefully, why they called him the crocodile, but such, such are the ways of great teachers.) You can describe him as a counter-puncher to the degree that he fluently rises to the other man’s pace and speed and goes right in to the hardest hit balls. C’est bon, Lacoste would say to that. But keep them in the court!\nThat is the problem. He is up against a young American from College Park, Maryland, who hits with a power and velocity that momentarily makes the stands vibrate. He is fierce. He is of a different school altogether. You watch this kid, you think of the furiaof Connors, Gonzales, Sampras. Pow! And this is no sports-academy trained baseline power hitter, arguably the easiest players in tennis to beat because they are so predictable. He has a whole repertoire, though he is only 20.\nMannarino, who grew up in a Paris suburb near Charles de Gaulle airport but now lives on an island in the Mediterranean called Malta (year-round tennis), is well aware of this fierceness. The young American, who is faster, bigger, stronger, is relentless. He surprised him in the first set, 6-1, and he is dictating the pace of the second. You want to play like Lacoste, you cannot let that happen. Because what Budge et al. figured out, after the Lacoste experience, was that you got to put it where he can’t get it, and that means taking over the point.\nFrances Tiafoe, Marylander now resident of Florida (year-round tennis), has been doing just that. He places his serves well and they tend to kick up or out. The effect is to neutralize the return. The return of serve, you want to get it as deep as possible to prevent a follow up serve-and-one attack into open space where you ain’t, but if all you can do is block the ball in the nick of time and get it back over, you cain’t. Mannarino is well aware of the younger man’s tactic, and while it would be wrong to say he is wilting under it, he is not countering it, either.\nLacoste’s answer would be to just keep moving to the ball and get your racquet on it. Mannarino is fast, graceful, he does that, and when he does, he goes for the rally. His idea is to keep the ball going and gradually get it to Tiafoe’s backhand, which he recognizes as the Marylander’s weak link. Tiafoe has, forgive the term, a devastating forehand. It makes you think of Jack Sock with its whiplash and of Rafa Nadal with its deep heavy topspin. It is fearsome. But his backhand is unsteady, today at any rate. He nets it. He miscalculates and it goes slow or weak, opening chances for the other fellow to set up a winner.\nMannarino’s plan is to keep hitting the Tiafoe backhand. Keep the ball deep. He has good sweeping groundstrokes. He mixes them with adroit drop shots. But the rising star of American tennis is smart. He is not limited to serve and attack. His service game is more interesting for its targeting and spin than for its power, his aces are coming by stealth. And he knows how to slice and gently drop a shot over the net. He hits huge volleys. You want variety, Frances will give it to you. Beware of giving him any thing he can put away. He will pounce.\nDown a break, Mannarino’s classic Lacostian steady hand shakes a little, he hits long more than once. More than once, by Lacostian standards, is twice too much. But they stay on serve now. Tiafoe goes up 5-3 with one of his stealth aces, only 84 mph but somehow unseen up the middle. Mannarino compliments by imitation, ace to hold on the next game, so Tiafoe can serve it out at 5-4.\nWhich he does ruthlessly, though admittedly he benefits from a netted forehand at 30-0. A big ace closes the set.\nIt looks like a cruise. They are both playing well, but Tiafoe is making his game work and therefore stays the step, or break, ahead, and that is the way you win on the Tour. Everybody is so good, you get the one advantage and you keep it. There are uneven matchups of course. But even then, uneven is a way of saying. Earlier, at Ashe Stadium, Novak Djokovic actually had a hard time with Marton Fucsovics, who is from Nyiregyhaza, at least until the fourth set bagel. The Hungarian was exhausted. The Serb was too, but he held on more better. He wore ice around his neck during changeovers. They even took an ice bath together. Of course, this is not San Francisco, but under the ATP heat rules, players get a 10-minute break between sets after three sets. Under WTA rules, after two sets. You can do whatever you want except confer with your coach, which in this heat is probably the last thing on your mind. So Novak and Marton, fellow ex-captives of communism now free and happy, found a bathtub full of ice water and jumped in. Came out and Novak crushed Marton 6-0. Must remember that, ice baths. Though it did not work for the other guy.\nFrances and Adrian were sweating it out too but they did not get a break even though they went into a fourth set. The Frenchman stayed calm when he was broken, broke back and then broke again at 5-4 as the American seemed to lose his focus and make mistakes. I would have thought the heat rule might kick in here. On the benches of the Grandstand, people’s butts are uncomfortable. You can tell. But it is a fine match and no one wants to miss any of it just to go outside for a few minutes and find some shade to cool off the butt.\nTiafoe lost a gripping first-round match against John Isner two years ago when this stadium was inaugurated. It was the kind of match where you feel the loser was the winner and you know he will return; indeed the two Americans fell into each other’s arms at the end. And last year he lost in the first round against Roger Federer at Ashe Stadium, five sets, fantastic. Federer was deeply impressed. Tiafoe, only a teen, gave Isner and Federer chills. In the heat, Mannarino feels the chills.\nTiafoe goes all out. He knows now that he must concentrate on offense, but, and this is remarkable in a so young player who still has traces of arrogant adolescent recklessness, he is wise, mature beyond his years. His fierceness never lets up — except when he tells it to and goes for the soft hands, the slice, the tricky serve, the superb catch of a Mannarino crosscourt shot. He runs, he jumps, he moves like the lean all-muscle panther he resembles — until he stops and shouts and smiles, and then he is all human.\nMannarino never gives up. He is a tough guy too, but his smooth defense is not enough. Down a break early, he almost gets his chance at 3-2, but Tiafoe keeps his nerve — mental, mental — after blowing an ad with a double. He retrieves it with one of his shrewd slow serves, then holds on a netted backhand return, 4-2.\nStill the match stays tight. Two huge serves keep Mannarino in play, but Tiafoe is serving at 5-4. Mannarino tries it — tries to get inside his head with a brilliant crosscourt volley that must have shocked, but only to motivate. On a well-aimed return of serve to the Tiafoe backhand at 40-30, Mannarino moves toward the net against his opponent’s weak link. No way: when he reached, he grasped: Tiafoe hits a sensational cross court passing shot into the opposing corner, with that unreliable backhand of all things! Mannarino is so shocked he signals a challenge, but the old hawkeye confirms, the shot hit the line.\nAnd that’s the match. John Isner must be laughing. Frances Tiafoe certainly is, as are his parents and friends and everybody, even, I suspect, Adrian Mannarino and Robert Lacoste.\nIt’s hot all right, it’s the U.S. Open.","url":"https://spectator.org/american-takes-flight-at-u-s-open/"}
