{"authors":["John Hayward"],"date_download":"2018-10-30 19:33:52","date_modify":"2018-10-30 19:33:52","date_publish":"2016-03-16 18:49:39","description":"North Korea's Supreme Court has sentenced captive American student Otto Warmbier to 15 years of hard labor for \"hostile acts\" against the State, insisting he \"confessed to the serious offense.\"","filename":"data/vaneerConsumption/AmericanStudentSentencedto15YearsofHardLaborinNorthKorea.json","image_url":"https://media.breitbart.com/media/2016/03/afp_f7f13dc2bd7813503faccddf2d9d4aa07222c590-1-e1458154170768.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_03_16__1540928032.html","title":"American Student Sentenced to 15 Years of Hard Labor in North Korea","title_page":"American Student Sentenced to 15 Years of Hard Labor in North Korea","title_rss":"NULL","source_domain":"breitbart.com","text":"North Korea’s Supreme Court has sentenced captive American student Otto Warmbier to 15 years of hard labor for “hostile acts” against the State, insisting he “confessed to the serious offense.”\nAccording to the UK Daily Mail, Warmbier’s harsh sentence was handed down despite a meeting between former New Mexico governor Bill Richardson and diplomats from North Korea’s United Nations delegation in New York City.\n“I urged the humanitarian release of Otto, and they agreed to convey our request,” said Richardson, who has conducted a number of diplomatic missions to North Korea, including previous negotiations for the release of American prisoners.\nWarmbier’s “offense” involved pulling down a political banner from the hotel he was staying at while visiting North Korea on a tour organized by China-based Young Pioneer Tours.\n“I committed the crime of taking down a political slogan from the staff holding area of the Yanggakdo International Hotel,” he said in his televised, possibly coerced “confession,” as recalled by CNN.\n“I never, never should have allowed myself to be lured by the United States administration to commit a crime in this country,” he continued, sobbing as he read from what appeared to be a prepared statement. “I wish that the United States administration never manipulate people like myself in the future to commit crimes against foreign countries. I entirely beg you, the people and government of the DPRK, for your forgiveness. Please! I made the worst mistake of my life!”\nNorth Korean media stressed this last element of his confession when announcing Warmbier’s sentence, declaring him an agent of “the U.S. government’s hostile policy” towards the Communist state, policies that include enhanced U.N. sanctions against Pyongyang’s nuclear and missile programs, which dictator Kim Jong Un has defiantly vowed to continue.\nThe Daily Mail notes that Warmbier has also said he was offered a bounty by a member of a church group to steal the banner and bring it home as a trophy.\nThe BBC judges Warmbier’s 15-year sentence to be “high compared to those given to foreigners in the past,” possibly due to “particularly high tensions at the moment between North Korea and the U.S.”\n“North Korea’s sentencing of Otto Warmbier to 15 years hard labour for a college-style prank is outrageous and shocking,” declared Phil Robertson of Human Rights Watch. He called on North Korea to “recognize this student’s self-admitted mistake as a misdemeanor” and “release him on humanitarian grounds.”\nThe Washington Post notes that Warmbier was made to praise North Korea’s “humanitarian treatment of severe criminals like myself” in his carefully orchestrated “confession.”\nOtto Warmbier, 21, is a student at the University of Virginia. The Washington Post reports he was selected as an Echols Scholar, a “special four-year academic program for fewer than 250 students in each class.” Echols Scholars are hailed “intellectual risk-takers” who have demonstrated “academic excellence, intellectual leadership, and evidence of the ability to grapple with complex topics.”","url":"https://www.breitbart.com/national-security/2016/03/16/american-student-gets-15-years-of-hard-labor-in-north-korea/"}
