{"authors":["Robert Wilde"],"date_download":"2018-10-30 22:17:52","date_modify":"2018-10-30 22:17:52","date_publish":"2015-07-04 16:33:02","description":"Donald Trump asserted on Friday that the random murder of a woman Wednesday in San Francisco by an illegal immigrant reinforces the notion that America needs a border fence.","filename":"data/vaneerConsumption/AmericanPeopleDeserveaWall.json","image_url":"https://media.breitbart.com/media/2015/06/trump-announces-Getty-e1434550005738.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_04__1540937872.html","title":"‘American People Deserve a Wall’","title_page":"Trump: ‘American People Deserve a Wall’","title_rss":"NULL","source_domain":"breitbart.com","text":"Donald Trump asserted on Friday that the random murder of a woman Wednesday in San Francisco by an illegal immigrant reinforces the notion that America needs a border fence.\n“This senseless and totally preventable act of violence committed by an illegal immigrant is yet another example of why we must secure our border immediately,” the billionaire Presidential aspirant said in a statement.\nKathryn Steinle, 32, of Pleasanton, was gunned down Wednesday evening on Pier 14 near the Embarcadero and Mission Street in San Francisco’s South Beach neighborhood.\nTrump called the situation “absolutely disgraceful” and denigrated his fellow nominees for lacking the “guts to even talk about it.” He added, “The American people deserve a wall to protect our jobs, economy and our safety… I am the only candidate who would build it. I will make America great again!”\nNBC News reported that the Department of Homeland Security’s Immigration and Customs Enforcement agency identified Francisco Sanchez, with nearly a dozen aliases and a long criminal history, as the prime suspect for the fatal shooting.\nDHS acknowledged that illegal immigrant Sanchez had been deported to Mexico five times.\nTrump has been criticized by the main stream media, and other 2016 presidential hopefuls, for making candid remarks about immigrants who illegally cross over America’s southern border.\n“The U.S. has become a dumping ground for everybody else’s problems,” the construction tycoon asserted when he announced his candidacy in June. “And these aren’t the best and the finest. When Mexico sends its people, they’re not sending their best…they’re sending people that have lots of problems…they’re bringing drugs, they’re bringing crime. They’re rapists. And some, I assume, are good people.”","url":"https://www.breitbart.com/politics/2015/07/04/trump-san-franciscos-illegal-alien-murderer-proves-american-people-deserve-a-wall/"}
