{"authors":[],"date_download":"2018-10-30 00:50:42","date_modify":"2018-10-30 00:50:42","date_publish":"2017-04-26 00:07:59","description":null,"filename":"data/vaneerConsumption/AmericanWhiskeyTrailTourDay3.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/04/Jim-Beam-barrel-house-04-25-2017.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860642.html","title":"American Whiskey Trail Tour, Day 3","title_page":"American Whiskey Trail Tour, Day 3The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"It was difficult to feel anything but awe standing in front of the still at Jim Beam’s main distillery. It is six-stories tall, and 200 gallons of beer pour into the still each minute. The still pours forth 30 gallons a minute of 135 proof white dog — the water-clear liquid that gets watered down to a respectable potency and popped into charred barrels for aging.\nAbout 300 employees work at this facility in Clermont — but this is not the only Beam factory. There is another distillery in nearby Boston, Kentucky (also employing 300 folks), and a third distillery 75 minutes away in Frankfort. All told, Beam shipped eight-million cases of whiskey this past year, which includes its famed white label and all the other brands (Booker’s, Basil Hayden, Knob Creek, etc.). One Beam barrel house I visited holds 20,000 53-gallon barrels of bourbon. It is one of 70 Beam booze storage facilities.\nThese are boom times for American whiskey. Sales have increased from 13 million cases to nearly 22 million cases between 2001 and 2016. Jim Beam is the big dog in the drinks industry, producing more than 45 percent of all American whiskey.\nNot quite an hour from Beam, Maker’s Mark also is enjoying the skyrocketing demand. It bottled 1.9 million cases last year — 15 percent of which went overseas, according to company head Rob Samuels. It has 36 warehouses and expects to build another 1 or 2 storage facilities per year (at a cost of $5 million a piece) for the the foreseeable future.\nSo where is all this juice going? Most stays here in America, but exports are growing. In 2016, $3.1 billion in American whiskey was sold, and $970 million went overseas. The U.K. imported the most ($122 million), followed by Australia ($113 million), Spain ($103 Million), and Germany ($101 million), according to the Distilled Spirits Council of the United States. Beam already exports to 125 countries but is looking to ship more abroad. India, which has a robust appetite for Scotch, is being eyed as a market to develop. And, of course, China and its 1.2 billion inhabitants, most of whom are age 20 or older, are in American distillers’ sights.\nAll of that is good news for U.S. drinks makers. “Twenty or thirty years ago, you couldn’t give away a glass of American whiskey,” says Fred Noe, Jim Beam’s master distiller. “Now they are lining up for it.”\nKevin R. Kosar is a senior fellow at R Street Institute and heads its alcohol policy reform program. He is the author of Moonshine: A Global History (2017) and Whiskey: A Global History (2010).","url":"https://spectator.org/american-whiskey-trail-tour-day-3/"}
