{"authors":["Lucas Nolan"],"date_download":"2018-10-30 19:30:42","date_modify":"2018-10-30 19:30:42","date_publish":"2017-03-22 23:41:34","description":"American farmers have been using hacked firmware to avoid the harsh software restrictions imposed on tractors by manufacturer John Deere.","filename":"data/vaneerConsumption/AmericanFarmersHackTractorsUsingModifiedFirmware.json","image_url":"https://media.breitbart.com/media/2016/03/afp_7d3b597e98f92f2bc21e8c1cb128fffeff93a649.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2017_03_22__1540927842.html","title":"American Farmers Hack Tractors Using Modified Firmware","title_page":"American Farmers Hack Tractors Using Modified Firmware | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"American farmers have been using hacked firmware to avoid the harsh software restrictions imposed on tractors by manufacturer John Deere.\nMotherboard reports that in order to bypass the harsh restrictions placed on tractors by manufacturer John Deere, American farmers have begun replacing the native system firmware with hacked Ukrainian software that is traded online on invite-only forums. John Deere has placed limitations on some of their recent tractors which prevent “unauthorized repair” being performed on the vehicles. This is seen by many farmers as a possible threat to their livelihood if a tractor breaks down during use and an “authorized” repair agent is not available to fix it.\nDanny Kluthe, a hog farmer in Nebraska told his state legislature, “When crunch time comes and we break down, chances are we don’t have time to wait for a dealership employee to show up and fix it.” he continued, “Most all the new equipment [requires] a download [to fix].” Many farmers worry that in a worst-case scenario, John Deere could use the onboard systems to remotely disable their tractor.\nJohn Deere has protected themselves from prosecution in their most recent their most recent license agreement which prevents farmers from suing them for, “crop loss, lost profits, loss of goodwill, loss of use of equipment … arising from the performance or non-performance of any aspect of the software.” This agreement applies to anyone using the tractor that is not a representative of a John Deere dealership or authorized repair shop.\n“If a farmer bought the tractor, he should be able to do whatever he wants with it,” Kevin Kenney, a farmer and right-to-repair advocate in Nebraska, told Motherboard. “You want to replace a transmission and you take it to an independent mechanic—he can put in the new transmission but the tractor can’t drive out of the shop. Deere charges $230, plus $130 an hour for a technician to drive out and plug a connector into their USB port to authorize the part.”\nThis has resulted in cracked authentication software appearing across the internet. “There’s software out there a guy can get his hands on if he looks for it,” said a farmer and repair mechanic in Nebraska with knowledge of the cracked John Deere software. “I’m not a big business or anything, but let’s say you’ve got a guy here who has a tractor and something goes wrong with it—the nearest dealership is 40 miles away, but you’ve got me or a diesel shop a mile away. The only way we can fix things is illegally, which is what’s holding back free enterprise more than anything and hampers a farmer’s ability to get stuff done, too.”\nMotherboard successfully infiltrated one of the online John Deere cracking communities and listed the programs they saw being traded.\nJohn Deere Service Advisor: A diagnostic program used by John Deere technicians that recalibrate tractors and can diagnose broken parts. “It can program payloads into different controllers. It can calibrate injectors, turbo, engine hours and all kinds of fun stuff,” someone familiar with the software told me. John Deere Payload files: These are files that specifically program certain parts of the vehicle. There are files that can customize and fine-tune the performance of the chassis, engine, and cab, for instance.\nJohn Deere Electronic Data Link drivers: This is software that allows a computer to talk to the tractor. “The EDL is the required interface which allows the Service Advisor laptop to actually communicate with the tractor controllers,” the source told me.\n“If things could get better, [companies like John Deere] should be forced to freely distribute the same software dealers have,” said a reverse engineer who posts on the cracking forums “And stop locking down [Engine Control Module] reading functionality. They do this to force you to use their services, which they have a 100 percent monopoly on.”\nJohn Deere commented on the trend of modifying the system software of their machinery saying, “Software modifications increase the risk that equipment will not function as designed,” the company continued. “As a result, allowing unqualified individuals to modify equipment software can endanger machine performance, in addition to Deere customers, dealers and others, resulting in equipment that no longer complies with industry and safety/environmental regulations.”\nHowever many farmers worry that John Deere may fail to continue providing support for older tractor models, “What happens in 20 years when there’s a new tractor out and John Deere doesn’t want to fix these anymore?” a farmer using Ukrainian software told Motherboard. “Are we supposed to throw the tractor in the garbage, or what?”","url":"https://www.breitbart.com/tech/2017/03/22/american-farmers-hack-tractors-using-modified-firmware/"}
