{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 21:18:41","date_modify":"2018-10-22 21:18:41","date_publish":"2016-01-29 06:28:26","description":"J-Lo picked up on tensions in a girl group caused by the attitude and behavior of Eliz Camacho and did not waste any time cutting the wannabe down to size.","filename":"data/vaneerConsumption/AmericanIdolsJenniferLopezlecturescontestantingroupround.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/05/30AF10CA00000578-0-image-a-30_1454043856552.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422216_Jennifer-Lopez-lectures-contestant-importance-harmonious-relationships-group-round-American-Idol_1540243121.html","title":"American Idol's Jennifer Lopez lectures contestant in group round","title_page":"American Idol's Jennifer Lopez lectures contestant in group round | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jennifer Lopez put a diva American Idol contestant firmly in her place as she lectured on her on what it takes to have success in the music business.\nJ-Lo picked up on tensions in a girl group caused by the attitude and behavior of Eliz Camacho and did not waste any time cutting the wannabe down to size.\nJennifer warned her you do not go far if people did not like you as she sent Camacho, 24, home after the hopeful singer compared her fellow group members to her backing singers.\nScroll down for video\nHitting out: Jennifer Lopez put a American Idol contestant firmly in her place as she lectured on her on what it takes to have success in the music business\nNot happy: Eliz Camacho had a sour look on her face as JLo cut her down to size\nIt did not help her cause the one of them, Gianna Isabella, is the daughter of Jennifer’s old acquaintance, 1980s pop star Brenda K. Starr.\nCamacho’s behavior was immediately a problem for Gianna and Dana Ordway as she imposed the song ‘Hit Me Up Style’ on them for the Hollywood Week group round.\n‘It is me against the world. I see the group round like the solo round, just with back-up singers who are going to help me rock it,’ she told the cameras.\nTheir rehearsal was a disaster with Gianna telling the cameras she felt Eliz was trying to overpower everyone else.\n‘This is called a group round not an Eliz round,’ Gianna’s mom Brenda K. Starr told the cameras before telling the girls to pull together.\n‘This is called a group round not an Eliz round': The mother to one of the other girls in the group was not happy with how Eliz carried herself\nWhen asked how their preparation had gone by the judges Gianna laughed and told her it had been ‘a struggle.’\nTheir performance onstage was predictably a mess with Gianna forgetting some of her lyrics.\nThe tensions between the girls was obvious for all of the judges to see and Jennifer unleashed some some sharp words of criticism.\n‘I could tell there was obvious tension and you could feel it in the performance. This is all about collaboration. I would say my biggest strength in this business and the reason that I have been around this long as I have is that people like to work with me,’ said Jennifer pointedly.\nThe critique left Eliz pulling a sour face up on stage as she realized she may have a serious problem.\n‘If you don’t play well with others you won’t last very long. You may have a moment if you are super, super talented, but after a while people start rooting against you.’\nStar of the show? JLo singled out Eliz as she said: 'If you don’t play well with others you won’t last very long'\nMoving on: Dana Ordway (centre) and Gianna Isabella advanced to the next round but Eliz did not\nThree's a crowd: Keith Urban, Jennifer, and Harry Connick Jr intensely deliberated who continues on in the competition\nHarry told both Eliz and Dana that they had been out sung by 15-year-old Gianna.\n‘This stuff is not always and easy and it not always just about talent as you guys learned today,’ said Jennifer as she sent Dana and Gianna through and diva Eliz home.\n‘Eliz I am sorry it is the end of the road, thank you very much,’ said Jennifer coldly.\nPredictably Eliz did not take it lying down.\n‘Just watch the show and you will know who out sung who,’ she told the cameras afterwards.\n‘I am disappointed but I cannot just limit myself to American Idol, I am a singer, I am an actress and a model so I can’t put a cap on one thing and be like ‘That is it Eliz.’ That would not be fair to the other talents that I have.’\n'That would not be fair to the other talents that I have’: Eliz did not seem too upset about the eliminations as she bragged about her other talents\nThe second night of Hollywood Week shows kicked off with Harry Connick Jr, warning the contestants it was time to step up\n‘Y’all need to get real, this is a competition, what do you really want? You are performers this is what you do,’ Harry told them.\nIn chaotic scenes the remaining contestants formed groups and headed back to the hotel to work with the vocal coaches.\nAnd it did not take long for the drama to unfold.\nShelbie Z quickly ditched her group when they could not get their act together quickly enough and had a dispute over song choice.\n‘You have to mesh with the group for it to work otherwise you are going to bite each others heads off or stab and kill each other, and that is just not healthy at all,’ Shelbie told the cameras.\nPoh was the next one to cause drama as she ditched her group and slipped out of the hotel leaving her group in the lurch.\nPacking her bags: Poh ditched her group and slipped out of the hotel without informing her group\nProducers managed to get hold of her dad on the phone only for him to tell them that ‘She can’t do this’ leaving Dalton and Kassy to try and find another member or face disqualification.\nAfter a tense night of rehearsals the sun rose over Los Angeles and the groups faced the judges.\n‘There will be plenty of train wrecks but also plenty of sweet victories,’ Ryan Seacrest told the cameras as the groups all struggled in morning rehearsals.\nTeam Blue Eyes, made up of Kory Wheeler, Jenna Renae, Kelsie Watts and Jordan Sasser performed ‘Treasure’ by Bruno Mars.\nKory was cut at this stage last year and was anxious for the group to navigate their way successfully.\n‘I thought that was a great start to Group Day, as sometimes it can be a disaster, I was really happy with what you did,’ Jennifer Lopez told them.\nStellar: Kory Wheeler, Jenna Renae, Kelsie Watts and Jordan Sasser in a group called Blue Eyes opened up the show's performances as they all moved on in the competition\nImpressed: Keith Urban told them they had all shone individually and as a group\nHarry told them they had set a high bar for their effort and Keith told them they had all shone individually and as a group.\nThe judges asked Jenna and Jordan to step forward, but it was a fake out and all four members were sent through to the next round.\nMilk and Cookies, consisting of Jenn Blosil, Bri Ray, Lynnzee Fraye and Sara Sturm performed ‘Drag Me Down’ by One Direction.\n‘I enjoyed that, it was not perfect but i felt like you guys hung in there and did a good job,’ said Jennifer.\nKeith told them that he liked the song choice and Harry told them that they had taken risks and shown their talent.\nAnd he did not go for the fake out move and quickly told all four girls they were going through.\nIn harmony: Milk And Cookies, consisting of Jenn Blosil, Bri Ray, Lynnzee Fraye and Sara Sturm, performed One Direction hit Drag Me Down and they all advanced\nNext a group called ‘Ooh x2’ featuring Amelia Eisenhauer, Tristan McIntosh and Lee Jean were all sent through, along with a group featuring Avalon Young, and a trio including Jeneve Rose Mitchell were all sent through.\nThe group of Chynna Sherrod and Terrian then took on ’Rather Be’ by Clean Bandit.\nJennifer enjoyed the performance so much she turned to Harry and wistfully told him ‘I am going to miss Idol.’\n‘I got very emotional because you reminded me how much I love this job and how much I am going to really miss Idol,’ she told the contestants with tears in her eyes as Harry put his hand on her back.\n‘I just love it, I love this whole thing and what it does for singers and I love everything about it, it has been a joy for me to sit here and watch this for so many years, thank you.’\nUp next sick Trent Harmon, who is battling mono, became the first ever contestant to perform alone in the group stage on doctors orders.\n‘I don’t really know what is going to happen, it is odd sitting here by myself while everybody else is in groups,’ said Trent.\n‘There is really nothing to it but to rise to the occasion, I just hop my voice can meet me there.’\nOne is the lonliest number: For the first time in Idol history, Trent Harmon was allowed to perform by himself during the group round as he had been diagnosed with mono\nHe took to the stage and performed ‘Rather Be’ and it was clear his sickness was having an impact on his voice.\n‘It sounds better in mono,’ joked Harry.\nImpressed Keith told trent that he thought it was maybe his talent and not the sickness that was keeping other contestants away from him.\nJennifer brought up the kidney stones that Phillip Phillips suffered through in a previous season of the show as she told him that he was through.\n‘I did not expect to go through, I really didn’t,’ he told the cameras.\nSinging Out Loud took on ‘Undo It’ by Carrie Underwood after arguing for five hours over their eventual song choice.\nMichelle Marie, Ashley Lusk and Lindsey Carrier were joined late by Shelbie Z, who later branded Lindsey ‘bossy.’\nIn the end the judges liked the song choice for the group but only sent through Michelle, Ashley and Shelbie, with Lindsey going home.\n‘Don’t forget Lindsey,’ Keith urged them as the three hugged.\nBut it was not all good news as the likes of Elvie Shane, Ashley Lilinoe, Cameron Richard all went home, while Mackenzie Bourg, Kayla and Juno went through.\nSad moment: Michelle Marie, Ashley Lusk, and Shelbie Z celebrated as they advance in the competition but their group member Lindsey Carrier looked dejected as she didn't make the cut\nEnvy started out as a foursome but when Anatalia Villaranda was uncomfortable with the song choice her mom intervened and begged the group to pick a new song for her daughter.\nThe group refused and walked away leaving Anatalia on her own.\nAfter her earlier drama Poh quit her group Chicken Noodle Soup and left the show for good.\n‘I’m not ready. It is a big step in my life and I am not there yet, which is okay,’ she told the cameras as she packed.\nAnatalia’s mom Lea, recognized an opportunity and put her daughter together with Kassy Levels and Dalton Rapattoni.\n‘I thought they were my friends but for them to just throw me off to the curb, you don’t know who to trust,’ Anatolia told the cameras.\nAnd it was match made in heaven as Chicken Noodle Soup wowed the judges.\nKeith praised the group’s phrasing and lauded them for making the song their own.\nLonesome: Anatalia Villarandawas not comfortable with her group's song choice and was abandoned by her group\nWatching out: Her mother Lea was able to find a group for Anatalia after begging her old group to change the song\nIn sync: Anatalia linked up with Kassy Levels and Dalton Rapattoni and they all advanced\nSigh of relief: The trio were happy to talk to Ryan Seacrest after receiving the good news\n‘Whatever the drama was last night, I always believe that things happen for a reason, it was meant to be,’ said Jennifer who tried to fake out the group before sending them all through to the next round.\nEnvy’s group members Sonika Vaid, Stephany Negrete and Andrew Nazarbekian insisted they did not kick out Anatolia and that she quit.\nAfter a disastrous morning rehearsal and being compared to backing singers by coaches the group took to the stage.\nReady for their close-ups: Stephany Negrete (left) and Sonika Vaid (right) awaited their queue to hit the stage as they along with group member Andrew Nazarbekian moved on\nGood spirits: Stephany was certainly in a good mood as she talked to Ryan after advancing\nKeith told all three they could sing but that Stephany had been the only one to ‘perform on stage’ and said it seems like the first time Andrew had ever been on a stage.\n‘I will say this Andrew you have a ridiculous instrument, an amazing voice,’ Harry told him.\nIn the end all three got through to the next round.\nNext ‘Trick or Treat’ made up of Marcio Donaldson, Jon Klaasen, Kylle Thomasson and Kacye Haynes performed ‘Uptown Funk.’\n‘It is so nice to see people who can feel rhythm,’ Harry told them.\nBoys club: Marcio Donaldson, Jon Klaasen, Kylle Thomasson and Kacye Haynes peformed Uptown Funk\n‘It is so nice to see people who can feel rhythm' Harry Connick Jr gushed about the performance\nKeith told them they had all ‘been on’ and all four guys were sent through to the next round.\nThe group ‘Smooth Soul’ consisting of Joy Dove, Daniel Farmer and Lindita then performed ‘Domino’ by Jessie J.\nHarry told Joy he was ‘surprised’ that she had let Kosovan personal trainer Lindita outshine her on stage with her huge ad-libs.\n‘I am sorry but Jennifer Lopez is not going to go up on stage and let Keith and me outperform her,’ said Harry.\n‘I am surprised that with your personality you said she could finish and you backed down.’\nJoy and Lindita were sent through but it was the end of the line for Daniel.\nNext The Good Vibes group of Joe Dahman, Alesana Tolai, Olivia Thai and Jessica Paige did not impress the judges with only Jessica making it through.\n‘You look like your dog just died,’ said Harry calling it a joyless performance and ‘complacent.’\nTough times: The Good Vibes, consisting of Joe Dahman, Alesana Tolai, Olivia Thai and Jessica Paige, had a rough performance as Harry said: ‘You look like your dog just died’\nThe group Rebirth went through difficult preparation with La’Porsha Renae leaving and their song being changed.\nHarry complimented their fight and all three of Manny Torres, Malie Delgado and Christian Eason went through.\nHarry told them that it was great to see people ‘who give a you know what’ up on stage and praised their willingness to fight for a place in the competition.\nJennifer told them they had been one of the best groups of the day.\nThings were not so good for the group ‘Soul Cats ’ after their performance of Staying Alive.\nAll of the singers forgot lyrics and the judges tore into them for it.\n’Stand your ground and be a performer,’ said Harry as he hammered them for seeking lyric assistance from off stage.\nIn tune: Manny Torres, Malie Delgado and Christian Eason also advanced in the competition\nGushing: JLo complimented the trio as she said they were one of the best groups of the day\n‘You are on stage, act like you are on stage.’\nLaurel Wright and Marshall Cunningham went through and Drew Angus and John Arthur Greene went home.\nThe Sistahs consisted of La’Porsha, Marlena Johnson and Tonie Starr.\nThe group came together when Shelbie left Marlena and Tonie ‘high and dry’ and La’Porsha stepped in to help them out.\nDespite issues with Marlena remembering her lyrics the judges enjoyed them more than the Soul Cats and lived with the mistakes, sending al three women through.\n‘That’s how you forget words,’ laughed Keith.\nFin: The Sistahs, consisting of La’Porsha, Marlena Johnson and Tonie Starr, closed out the two-hour episode with a very strong performance\nIt's a celebration: The trio looked ecstatic as they moved on in the competition","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422216/Jennifer-Lopez-lectures-contestant-importance-harmonious-relationships-group-round-American-Idol.html"}
