{"authors":[],"date_download":"2018-10-30 00:50:40","date_modify":"2018-10-30 00:50:40","date_publish":"2017-04-27 08:18:14","description":null,"filename":"data/vaneerConsumption/AmericanWhiskeyTrailTourDay4.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/04/IMG_20170426_104654841.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860640.html","title":"American Whiskey Trail Tour, Day 4","title_page":"American Whiskey Trail Tour, Day 4The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Thirty years ago, most whiskey distilleries were lonely places — industrial factories in remote rural areas. For the most part, the proprietors of these places saw themselves as manufacturers, the first tier in the three-tier system. They made whiskey, which was then trucked away. Customers were far removed.\nSome, but not many, folks might drop by for a look around. “If we had 100 people come in a year, we were lucky,” says Eddie Russell master distiller at Wild Turkey. When folks showed up on the Lawrenceburg, Kentucky property, whoever was around the office would give them a tour of the property. Wild Turkey built a small visitor’s center in 1987. “Maybe 3,000 or 4,000 people a year would visited in those days,” says Russell.\nOh, how times have changed. Bourbon distilleries have become tourists destinations. Wild Turkey expects at least 85,000 bourbon tourists this year. Its gorgeous, new visitors center — which looks like a cross between a tobacco barn and a glass box—is 5,000 square feet. It opened in 2013, and features a gift shop, a history center, and a tasting room that overlooks a valley through which the Kentucky River runs.\nOver in Clermont, Jim Beam estimates 140,000 visitors this year, and Woodford Reserve expects the same number to come to its Labrot and Graham Distillery. Russell credits the Kentucky Bourbon Trail, a promotional program of the Kentucky Distillers Association, with stoking tourism.\nThe Kentucky legislature also has helped. It got rid of the old laws that forbade distilleries from selling their whiskeys to guests and letting anyone consume distillery products on the grounds.\nBut a not insignificant chunk of million visitors who come to Kentucky’s distilleries are food and drink industry people. During my visit to the Labrot and Graham Distillery, there were groups of bartenders from U.S. and Germany. The former had come to purchase Woodford barrels, whose whiskey would be drawn off, bottled, and sold only in their establishments. The Germans were there as part of a reality television program on top German mixologists.\nDistilleries have had to reconfigure their roads and parking lots to handle the tour buses. Both Beam and Wild Turkey run shuttle buses from their visitors centers that carry visitors to the still houses, barrel houses, and back again.\nMany distilleries now serve food. Woodford’s kitchen has a trained chef, and Bobby Flay and the late Julia Child have cooked there. Maker’s Mark recently expanded its restaurant, and installed a chef who has worked in some of the nation’s finest restaurants. The eatery serves high-end cocktails, made with the distillery’s bourbon, and southern fare (pulled pork, succotash, etc) with locally sourced ingredients.\nMaker’s Mark, it is worth noting, long has been a glaring exception to the rule.“My grandmother designed it to look like a Victorian village,” explains Rob Samuels, the company’s head. She wanted visitors to come and spend the day enjoying the lovely Loretto, Kentucky property, which has a lake and creek.\nTo lengthen and deepen the customer experience, Maker’s has begun offering guests “deep dives,” as Samuels put it. They can take a course in classic cocktail making, or spend time exploring how the corn, wheat, and barley are sources and prepped for whiskey-making, to name just two of the six possibilities.\nIt likely is only a matter of time before distilleries begin marketing packages, like golf and bourbon tasting sessions. Or, if the stars align for me, Maker’s will erect cabins and offer fishin’ and sippin’ trips.\nRead more about Kevin’s travels down the Whiskey Trail here: Part 1, Part 2, Part 3.\nKevin R. Kosar is a senior fellow at R Street Institute and heads its alcohol policy reform program. He is the author of Moonshine: A Global History (2017) and Whiskey: A Global History (2010).","url":"https://spectator.org/american-whiskey-trail-tour-day-4/"}
