{"authors":["Chris Kitching For Mailonline"],"date_download":"2018-10-23 01:20:12","date_modify":"2018-10-23 01:20:12","date_publish":"2016-01-29 15:13:38","description":"Some of the best airline amenity kits in the world boast elegant cases filled with pyjamas, beauty products from luxury designers, vouchers for high-end products or collectibles.","filename":"data/vaneerConsumption/AmericanAirlinesfirstclassamenitykitsincludedesignerlotionsandslippers.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/30B3230000000578-0-image-a-8_1454079493769.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3422396_Airline-class-amenity-kits-include-designer-lotions-slippers_1540257612.html","title":"American Airlines' first class amenity kits include designer lotions and slippers","title_page":"American Airlines' first class amenity kits include designer lotions and slippers | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"While economy class passengers are seated in rows of 10 and battling for elbow space, wonderful perks that they could only dream of are being lavished upon those in first class.\nThey range from meals prepared by on-board chefs to private rooms with beds, but frequent flyers are excited to add to their collection of plush amenity kits that are handed out before take-off.\nSome of the best in the world boast elegant cases filled with pyjamas, beauty products from luxury designers, vouchers for high-end products or collectibles.\nThis week, American Airlines unveiled its new kits which feature Cole Haan bags, 3LAB Skincare hand cream and lip balm, and foam headphone covers.\nEmirates teamed up with Bulgari on a set of 16 designer kit bags – leather for men and a satin finish for women – that are refreshed every six months. Each contains exclusive Bulgari products, including body lotions and signature fragrances.\nWhile most offer the same products, Royal Brunei Airlines is one of the few carriers to give its business class passengers a pair of comfortable slippers.\nScroll down for video\nAmerican Airlines\nAmerican Airlines' first class kit features products from Cole Haan, 3LAB Skincare, C.O. Bigelow Apothecaries and Clark’s Botanicals\nEmirates\nItalian designer Bulgari's fragrances and lotions are included in Emirates' designer kits. The men's kit comes in a leather bag\nBritish Airways\nBritish Airways' amenity kits for men come with Refinery products, including deodorant, shaving gel, vitalising moisturiser and eye gel\nFor women, British Airways provides a kit with Aromatherapy products, including hand lotion, renewing moisturiser and lip balm\nRoyal Brunei Airlines\nRoyal Brunei Airlines is one of the few airlines in the world to give its business class passengers a pair of comfortable slippers in flight\nUnited Airlines\nLast year, United Airlines began offering Cowshed Spa skin care products, the premium brand of London-based Soho House & Co.\nGaruda Indonesia\nGaruda Indonesia's first class passengers receive a bag filled with Agua de Loewe products, a dental set and a brush\nQatar Airways\nQatar Airways offers one of the most chic amenity kits in the sky, with the Giorgio Armani kit for women including a new fragrance\nIn addition to high-end beauty products, Qatar Airways gives its first class passengers pyjamas from Italian fashion house Missoni\nLufthansa\nLufthansa's Escada amenity kits feature a range of lotions, a dental care pack, hairbrush, socks, eye shades and ear plugs\nEtihad\nGulf carrier Etihad Airways' bags feature the patterns of Sadou, a colourful, centuries-old Abu Dhabi weaving craft, the airline said\nAll Nippon Airways\nPassengers who fly first class with All Nippon Airways receive a case with a basic care set of cosmetic products from The Ginza\nSwissair\nSwissair gives its first class passengers slippers, pyjamas, socks, an eye mask and La Prairie beauty products\nDelta Air Lines\nDelta Air Lines' amenity kits feature hard and soft cases made by Tumi, in addition to lotions, a dental care pack, tissues and eye masks\nAir France","url":"https://www.dailymail.co.uk/travel/travel_news/article-3422396/Airline-class-amenity-kits-include-designer-lotions-slippers.html"}
