{"authors":[],"date_download":"2018-10-30 01:03:47","date_modify":"2018-10-30 01:03:47","date_publish":"2018-07-26 00:05:44","description":null,"filename":"data/vaneerConsumption/AmericasNextCivilWarWillBeWorseThanOurLast.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/Custer4.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861427.html","title":"America’s Next Civil War Will Be Worse Than Our Last","title_page":"America’s Next Civil War Will Be Worse Than Our LastThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"In the summer of 1862, just weeks before the Battle of Sharpsburg (or Antietam) — the bloodiest single day of fighting in American history — Union Captain George Armstrong Custer attended the wedding of Confederate Captain John “Gimlet” Lea at Bassett Hall in Williamsburg, Virginia, as best man. The Union officer was dressed in blue, the Confederate officer in grey, and Custer being Custer spent the next two weeks flirting with the Southern belle cousin of the bride, even joining her in singing “Dixie.”\nAt one point she told him, “You ought to be in our army.”\n“What would you give me if I resigned my commission in the Northern army and joined the Southern?”\n“You are not in earnest, are you?”\nHe wasn’t, of course. Custer was nothing if not loyal, and he believed that he was bound to the Union by the oath he had sworn at West Point, whatever his affection for Southern officers and their ladies.\nSuch gallantry seems unthinkable today, when members of the Trump administration are hounded from restaurants and theatres, and Confederate officers like John Lea, if they are remembered at all, are considered precursors of the German National Socialists, and their once famous and respected commanders like Robert E. Lee, Stonewall Jackson, and Jeb Stuart have their statues toppled and banished from public squares, their names stripped from public schools, and their memories spat upon and disgraced.\nThe difference between the America of today and the America of what seems like just yesterday is that we once had a common culture. As recently as 1990, Ken Burns could make a Civil War documentary for PBS and let historian Shelby Foote wax eloquent on the martial prowess of Confederate General Nathan Bedford Forrest — something that now would likely get them both tarred, feathered, and Twitter-banned.\nYes, there were big differences between North and South a century and a half ago. The South was a slave-holding, free-trading, libertarian-leaning, conservative Christian, agricultural, aristocratic Sparta, while the North was a commercial, industrial, protectionist, Transcendentalist, social gospel, democratic Athens. But they held far more in common than separated them — beginning with the fact that, as Lincoln observed, “Both read the same Bible and pray to the same God.”\nIn the end, the war was fought over a single legal issue: whether the states that had freely ratified the Constitution to form the Union could freely leave the Union if they felt it no longer served their interests.\nOne need only compare the Confederate Constitution to the United States Constitution to see that the former bears a striking resemblance to the latter. And far from being a national socialist charter, the Confederate Constitution puts even more restraints on federal power and limits the president to one six-year term.\nThe great seal of the Confederacy bears the image of George Washington, many of whose relatives served with the Confederacy, including Lieutenant James B. Washington, a West Point classmate of Custer’s (the two had a famous picture taken together — Washington was a prisoner of war — a few weeks before Lea’s wedding).\nNorth and South venerated the Founders. They shared the same language, the same religion, and, in large part, the same general stock. Most of all, they shared what Jeff Sessions was recently rebuked for calling an “Anglo-American heritage” of liberty under law, stretching from the mists of medieval England — even before Magna Carta — to our own Bill of Rights.\nToday, however, our divisions are so deep and fundamental that Americans cannot even agree on what marriage is or what a man or a woman is (which is pretty darn fundamental).\nThe lunatic self-righteousness of the Left (and yes, I’m afraid one must point fingers here), where disagreement is bigotry to be prohibited by law or even condemned and prosecuted as treason, is a consuming, destructive fire that will not be easily quenched, and cannot be reached by cool waters of rational argument.\nSo what to do? We can start by trying to stop the Left’s war on America’s past, which is poisoning the well-spring of our national identity. If William McKinley, a Union officer turned president, could approve a Confederate memorial at Arlington Cemetery, it seems to me that we can at least be as understanding of our own history. Let us remember that President Dwight D. Eisenhower, who ordered the 101stAirborne Division to help desegregate Arkansas’s public schools, kept a portrait of Robert E. Lee in his office at the White House and admired him as a hero (as did, incidentally, George C. Marshall, whose anti-fascist bona fides are rather more profound than Antifa’s, I reckon).\nWe could also try to lighten the mood a little. I’ve conscripted Custer for this very purpose in a series of novels that imagine he survived the Battle of the Little Big Horn to become a gun-slinging Western do-gooder, riding under the pseudonym of Marshal Armstrong. There’s some real history in these books, but the point is to regain a rational, even if nostalgic, perspective on our past by eliciting laughter. America’s story is a glorious adventure — not a grim catalogue of irredeemable sins. The sinners-in-the-hands-of-an-angry-progressive-god sermonizing that comes at us in endless, stultifying repetition from the press, Hollywood, and academia — today’s hysterical, bug-eyed, Puritan witch-burners — is the acid-bath dissolving our culture and our nation.\nIf America is to come together again, it will do so only through the restoration of what Lincoln called our mystic chords of memory, a common culture that emerges from a shared and sympathetic understanding of our past — the sort of shared understanding that can bring a Union and a Confederate officer to a wedding, and former Union General George Armstrong Custer, alias Marshal Armstrong, to the rescue.\nHistorian and novelist H. W. Crocker III’s most recent book, Armstrong, publishes August 14 and is available for pre-order at Amazon and all good book shops.","url":"https://spectator.org/americas-next-civil-war-will-be-worse-than-our-last/"}
