{"authors":[],"date_download":"2018-10-30 14:29:34","date_modify":"2018-10-30 14:29:34","date_publish":"2015-01-26 00:00:00","description":null,"filename":"data/vaneerConsumption/AmericanSniperonthewaytobecominghighestdomesticgrossingwarfilmofalltime.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_01_emamerican_sniperem_on_the_way_to_becoming_highest_domestic_grossing_war_film_of_all_time_1540909774.html","title":"American Sniper on the way to becoming highest domestic grossing war film of all time","title_page":"American Sniper on the way to becoming highest domestic grossing war film of all time","title_rss":"NULL","source_domain":"americanthinker.com","text":"The Clint Eastwood-helmed feature is red-hot in the heartland, as well as the South, according to Deadline Hollywood :\nAmerican Sniper continued to smash box office records in its second week of showings, blowing through the $200-million domestic gross figure, and is set to pass Saving Private Ryan next week as the biggest domestic grossing war film of all time.\nFor Sniper, should it hold its estimate into tomorrow, this weekend would mark a mere 28-percent slip – the best second-week hold for a wide release ever for a film that debuted with more than $85M. Previous to this, the best big debuts to hold an audience were 2004’s Shrek 2 (down 33 percent in its second frame) and 2002’s Spider-Man (down 38 percent). American Sniper is marching toward $300M, a mark only six Warner Bros. films have passed. “Many exhibitors are hearing from their theater managers that the infrequent moviegoers who go only two to three times a year, are coming out to see this movie,” said Warner Bros. distribution chief Dan Fellman. “This a movie about patriotism, recognizing heroes, those who served; it’s about family. There are those who feel it’s anti-war movie. However, there are only 10 films in CinemaScore’s history that have done an A+ in every single category, and that’s telling, because no matter how one views American Sniper, everybody ends up in the same place.” After posting a solid Friday of $18.3M, American Sniper shot up 58 percent Saturday, with another $28.8M. The prediction is that it will fall off 40 percent Sunday, adding another $17.3M. Across the South and the heartland, American Sniper was playing strong: On Saturday, Atlanta and Jacksonville, Fla., both were up 63 percent, and Charlotte, N.C. was up 64 percent. But it wasn’t just in the South. Cleveland was up 73 percent and even D.C. was up 102 percent.\nGee...imagine that. A movie about patriotism setting box office records. Even leftists in Hollywood – where money is the only true ideology – are sitting up and taking notice.\nMeanwhile, the Johnny Depp vehicle Mortdecai tanked and opened in 14th place:\nLionsgate’s Mortdecai died as expected in ninth with $4.1M. Despite the bomb, Johnny Depp fans did in fact show up, according to exit polls for the R-rated comedy, evident in the films older-skewing female crowd (76% over the age of 25 and 52% female/48% male). As has always been the redeeming factor on Depp’s stateside bombs, foreign audiences will whisk Mortdecai out of box-office hell (while Alcon/WB’s Transcendence bombed worldwide, it made close to four times its domestic take of $23M with $80M abroad. Mortdecai‘s international pre-licensing strategy and financial partnership with Odd Lot mitigates Lionsgate’s exposure.\nPJ Media's David Swindle has an interesting take on the competing visions of masculinity between the metrosexual Depp and the manly-man Bradley Cooper, who plays Chris Kyle in Sniper. No contest.\nSniper's potential take goes far beyond the $300 million envisioned by observers, when you add in foreign and DVD sales:\nClint Eastwood's history-making movie jumped the $200 million mark on Sunday, putting it ahead of Michael Bay's Pearl Harbor, another WWII title, which topped out at $198.5 million domestically in 2001. American Sniper is distinct from those two film in being set during a modern-day conflict. Saving Private Ryan, released in 1998, earned $216.7 million domestically. Taking inflation into account, that would equal roughly $312 million in today's terms. But a record is a record, and the history-making Sniper will cross $216 million sometime this week for Warner Bros. and Village Roadshow. Films addressing recent conflicts have had a decidedly mixed track record, but American Sniper is benefiting from a massive turnout in America's heartland, as well as from its six Oscar nominations, including best picture and best actor for Bradley Cooper's performance as the late Chris Kyle, a Navy SEAL who fought in the second Iraq war. In celebrating Sniper's $200 million milestone, Warners domestic distribution chief Dan Fellman said that Eastwood \"created a gripping drama with a rare insight into the toll of war that has resonated with audiences in almost every demographic.\"\nThe American people are culturally disconnected from Hollywood. They hunger for films and TV shows that reflect their values, not those of the Hollywood left. It really is that simple. And if the moneymen in Hollywood who bankroll films that might please the liberals but few others are as smart as they claim to be, a lot more films like American Sniper will be made.","url":"https://www.americanthinker.com/blog/2015/01/emamerican_sniperem_on_the_way_to_becoming_highest_domestic_grossing_war_film_of_all_time.html"}
