{"authors":["Chris Weller"],"date_download":"2018-10-31 00:35:38","date_modify":"2018-10-31 00:35:38","date_publish":"2016-12-01 00:00:00","description":"A new report from the nonprofit Paid Leave for the United States finds none of the 60 largest corporations meet the minimum guidelines for leave.","filename":"data/vaneerConsumption/Americaslargestcompaniesdontmeetparentalleaverecommendations.json","image_url":"https://amp.businessinsider.com/images/53c53291ecad04c31a4aa684-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_americas-largest-companies-fail-parental-leave-2016-12_1540946138.html","title":"America's largest companies don't meet parental leave recommendations","title_page":"    America's largest companies don't meet parental leave recommendations - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Shutterstock/KieferPix None of the 60 largest US corporations, offer the suggested amount of parental leave set forth by the American Academy of Pediatrics, a new report finds.\nThe report was published by Paid Leave in the United States (PL+US), a nonprofit that advocates for mandatory federal leave policies in the US.\nAmerica is one of four countries around the world — and the only industrialized nation — that has no federal policy in place.\nOnly three states offer mandatory leave, including California, Rhode Island, and New Jersey, in addition to Washington D.C. In most cases, the responsibility of giving new parents time off is up to private businesses.\nBut none of the companies PL+US gathered data on offered the minimum six months of parental leave recommended by AAP president Dr. Bernard Dreyer. Only a handful — mostly consulting firms and banks — offered up to four months of leave.\nKatie Bethell, founder and executive director of PL+US, says the absence of public policy on the issue keeps it from hitting most corporations' radar.\n\"Companies comply with the law,\" Bethell tells Business Insider.\nIf Verizon has a location in Sweden, the branch needs to comply with Sweden's generous leave policy of 480 days split between both parents. No such law exists in the US, so Verizon has no direct incentive to match Sweden's or any other country's policy. Instead, it has chosen to offer new moms two weeks of paid leave and nothing for fathers.\nAnd so it goes with the companies on PL+US' list that offer as much leave as Verizon or even less. These include Lowe's, Darden Restaurants, Infosys Limited, and the various Yum! brands, which include KFC, Taco Bell, and Pizza Hut. According to PL+US, more than half of the top 60 companies either had no policy or refused to disclose their paid-leave policy.\nKeeping new parents in the cubicles might actually be the wrong approach if profit is the goal. Research has repeatedly found that strong parent leave policies benefit companies more in the long run than no or little leave. In general, companies with paid leave see less turnover and have happier, more productive employees.\n\"Paid maternity leave is good for mothers, families and business,\" YouTube CEO Susan Wojcicki wrote in a 2014 Wall Street Journal op-ed. \"America should have the good sense to join nearly every other country in providing it.\"\nBethell is optimistic that corporate America is moving in that direction.\nShe sees the rising generation of entrepreneurs as being more family-focused than generations prior. A growing number of large tech companies have started granting upward of 20 weeks or more to new parents, fathers included. In 2015, Netflix even began offering a full year.\n\"Smart, modern companies know that they need to have fantastic family leave benefits,\" she says. \"We see that already in the increase momentum in adopting policies.\"\nThat may be the biggest bright spot in the PL+US report: Of the 29 companies with leave policies, eight of them have expanded within the last year. The rest may be forced to follow suit, as President-elect Donald Trump has proposed a mandatory federal leave policy that would guarantee new mothers six weeks off.\nThe new policies would still put the US program far behind those of other industrialized countries, but it would at least mark a step forward on an issue that has stayed stagnant for so long.","url":"https://www.businessinsider.com/americas-largest-companies-fail-parental-leave-2016-12"}
