{"authors":["Leah Thomas"],"date_download":"2018-10-31 01:46:34","date_modify":"2018-10-31 01:46:34","date_publish":"2018-09-14 11:00:53","description":"American Vandal's Season 1 surprised audiences with how secretly smart the true crime parody was, and Season 2 has a surprise as well that is unrelated (or is it?) to the identity of the Turd Burglar. Although the show is made for laughs, this…","filename":"data/vaneerConsumption/AmericanVandalSeason2ActuallyContainsAReallySeriousMessageAboutFriendship.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/0b527841-839a-4c8d-94ba-a5e78d07cd86-av_202_1964942_r.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_american-vandal-season-2-actually-contains-a-really-serious-message-about-friendship-11906671_1540950394.html","title":"'American Vandal' Season 2 Actually Contains A Really Serious Message About Friendship","title_page":"'American Vandal' Season 2 Actually Contains A Really Serious Message About Friendship","title_rss":"NULL","source_domain":"bustle.com","text":"American Vandal's Season 1 surprised audiences with how secretly smart the true crime parody was, and Season 2 has a surprise as well that is unrelated (or is it?) to the identity of the Turd Burglar. Although the show is made for laughs, this season it's actually really, really sad and hits some darker notes as it unfolds. Yes, the series still tears apart media tropes in ways that would make any liberal arts major drool, and takes immature jokes with hilarious gravitas. However, at the center of the fecal mystery, American Vandal Season 2 is about a broken friendship and how we all need someone to connect with at the end of a sh*tty day. There are some spoilers for American Vandal Season 2 ahead.\nThe suspect that Season 1's teen documentarians Peter and Sam are called on to investigate in Season 2 is named Kevin McClain. Kevin is not a bro or a typical delinquent like Season 1's Dylan. He's the blissfully unaware dork whose classmates think his geeky persona is an elaborate act. He's the guy that, in junior year, has started hanging out with middle school kids. He's the one who cares a lot about tea. If you didn't know that kid, you may have been that kid.\nThe student that summons American Vandal to investigate the Turd Burglar is Chloé — and after a while Peter and Sam discover that Kevin and Chloé used to be friends. The student that turns Kevin in, Tanner, was also friends with Kevin and Chloé. Tanner and Kevin were in a band together and supposed to be best friends.\nUnderneath the pranks plaguing this Catholic school in the Pacific Northwest is the story of how Tanner and Chloé fell out with Kevin. If there weren't hurt feelings between Tanner and Kevin, he might not have been accused and forced to confess to the crimes. Chloé's guilt fuels her own desire to clear Kevin's name. Without spoiling the finale, it comes out that Kevin has been hiding his own loneliness after losing his friends as well.\nCourtesy of Netflix\nThe school wants to frame Kevin as the stereotypical bullied misunderstood loner who blames the world and takes his feelings out on others. Even though the reality is that Kevin is not vindictive and it's heartbreaking to see him try to keep a brave face — especially when he becomes further isolated from human connection under house arrest.\nIt's smart that this mystery, again and again, comes back to three friends unable to admit that they miss each other. So much of American Vandal Season 2 is about social media. \"Our existences are simultaneously experienced and curated,\" Peter says in the final episode. The content of the mysterious Turd Burglar's Instagram posts and the way they phrase their captions are a key part of the investigation. If Tanner, Kevin, and Chloé's past as friends wasn't at the center of the season, audiences would have nothing to root for other than the search for the truth.\nAmerican Vandal remains laugh out loud funny, but it's not a private school conspiracy that makes this show so compelling. It's how even though teenage friendships can be fleeting, they are also really intimate and essential to growing up. Even if they do get a little sh*tty sometimes.","url":"https://www.bustle.com/p/american-vandal-season-2-actually-contains-a-really-serious-message-about-friendship-11906671"}
