{"authors":[],"date_download":"2018-10-30 01:00:03","date_modify":"2018-10-30 01:00:03","date_publish":"2018-08-31 12:32:00","description":"What you have to do against Frances Tiafoe is stand your ground. He is going to hit hard, and then harder. But he has learned a lot of strategy since exploding out of the juniors, and he can do much besides aim for the lines if necessary — move to the net, endure the long rally, gently drop a sliced ball from the baseline.","filename":"data/vaneerConsumption/AmericanHopesHurtatUSOpen.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/1024px-Alex_de_Minaur_42785492191.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861203.html","title":"American Hopes Hurt at U.S. Open","title_page":"American Hopes Hurt at U.S. OpenThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"What you have to do against Frances Tiafoe is stand your ground. He is going to hit hard, and then harder. But he has learned a lot of strategy since exploding out of the juniors, and he can do much besides aim for the lines if necessary — move to the net, endure the long rally, gently drop a sliced ball from the baseline.\nHe showed this in his first round win. And he did it again for a while in his second round match against Australia’s Alex de Minaur, mixing things up to take the third set after dropping the first two. But the teenager from Sydney adjusted his own game and closed out convincingly.\nOn the young women’s side, Chicago’s (and now Atlanta’s) Taylor Townsend too showed how far she has already progressed. She was shrewd with her volleys, hit well down the lines, and stayed focused. She was playing against Jelena Ostapenko, who won at the French Open last year at 19 (Miss T. is 22) and who has an all-offense game like Camilia Giorgi’s but with a lot more visible emotion. Despite the frustration that comes from such a wildly one-dimensional game, she stayed on the plan. Hitting twice as many winners as the American, despite being error-prone, that did it.\nDe Minaur never ceded pace to Tiafoe. Slight as he is, he pounded back the tall American’s deep topspins. These worked for him, because his consistent counterpunching wore Tiafoe down while he patiently built winners with shots to the sidelines, or surprised at the net.\nThe packed stadium was partial, as it had been over on Court 5, but far more vociferously. It came close to sounding like the NY Mets bleachers at nearby Citi Field. De Minaur must have felt it; but for a teen, he has nerves of steel. Maybe it is his Spanish side — he grew up in Alicante. He came back from 2-5 in a thrilling third set, when you could practically smell the crowd smelling blood. Frances pulled it out, 7-5, forcing a fourth set.\nI must admit I was muttering “Hang on, mate,” Australia style, but I kept it down because fair-and-accurate and all that, plus the louts in front of me were visibly inebriated and I did not want a row while on the job. Both of these young players were playing terrific tennis, and while fan enthusiasm is welcome, you get this sense sometimes that it verges on sadism, as the crowd erupts in raucous shouts because of a lucky break by their favorite.\nSeveral of my pals at the courts at Fort Lincoln in Washington know the Tiafoe family and we have been following his progress with pleasure and expectations. The Tiafoe’s escaped from Sierra Leone years ago, when political gangsters fueled by blood diamonds laid waste to that little West African country. My own boy Josh happened to be there with the International Rescue Committee. He got out of Freetown on the last helicopter before the “Revolutionary United Front” killers overran it. They were eventually driven out and routed by an intervention of British marines.\nBut the Tiafoe’s had settled by then in College Park, Frances’ father working as a groundsman at the Junior Tennis Center there, the mother a nurse, the American-born twin boys doing well at DeMatha, one of the best high schools in the region. Frances has been improving steadily since getting into the pros in 2015, currently ranked 38. De Minaur is No. 43.\nDe Minaur did well at the Washington Open a few weeks ago; indeed I should say, by way of full disclosure, I undervalued his performance after he fell to Alexander Zverev in the final. He was exhausted after a strenuous semifinal against yet another rising young star, Andrey Rublev, and did not deploy his range and brains against the mighty Sascha, who is doing well here too. They could meet again in the quarters next week.\nDe Minaur out slugged Tiafoe from the baseline while attacking the net more successfully, and by the fourth set he also had conserved far more energy. The Marylander’s shots found the net and his volleys flew past the sidelines, his focus and stamina gone. There were some fantastic rallies, one lasting 38 shots, as both boys — 19, 20, call them youths, rather — dug deep. What really did it, though, was that de Minaur always knew what to hit back to keep Tiafoe off balance. He moved him wing to wing and caught him on his heels, stayed calm as the hot afternoon turned to evening.\nThe question is can you do this over many matches. That is the question in every tournament. You have to learn to deal with the competitive pressures and all. Tennis is remarkable in that you often find players doing very well very young, but unlike other such individual sports, gymnastics and swimming for example, they continue for a long time, getting always better. It still looks like the mighty vets are going deep here — Roger Federer, Novak Djokovic, Rafa Nadal. So far, they are cruising. Between them they hold this year’s Slams, so whachagonna do?\nThe Wimbledon title holder held off a rally by America’s Tennys Sandgren late last night, stopped it cold in the fourth set after the courteous Southerner (he is from Gallatin, Tenn.) held off a match point and took the third in the tiebreak. The current (and permanent?) owner of Roland-Garros ran over Vasek Pospisil, and the winner of the last two trophies at Melbourne, probably the most popular man in the neighborhood, handled a temperamental and mercurial Frenchman, Benoît Paire, in straight sets.\nFederer meets another oddball in the next round, Alex de Minaur’s compatriot Nick Kyrgios. Everyone agrees he is one of the most talented tennis players on the tour — including Federer, whom he has beaten. He appeared to be tanking in his last match, but the chair ump climbed down and had a chat with him, after which he rallied and won.\nIt was somewhat unusual, and the Frenchman whom Kyrgios beat was tortured by reporters afterwards about it. But he refused to complain, as they were obviously waiting for him to do. After going around the matter in circles two or three times Pierre-Hughes Herbert rejected all suggestions that Kyrgios had not out-played him. He said the ump is a great ump and whatever happened had nothing to do with who won, who lost. Class act.","url":"https://spectator.org/american-hopes-hurt-at-u-s-open/"}
