{"authors":["William Bigelow"],"date_download":"2018-10-30 18:45:08","date_modify":"2018-10-30 18:45:08","date_publish":"2015-02-18 02:04:00","description":"Americans who ignored the requirements to obtain health coverage will figure out the Obamacare penalty when they see their tax returns.","filename":"data/vaneerConsumption/AmericansNotEnrolledinObamacareMayGetaSurpriseatTaxTime.json","image_url":"https://media.breitbart.com/media/2015/02/last-chance-obamacare-website-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_02_17__1540925108.html","title":"Americans Not Enrolled in Obamacare May Get a Surprise at Tax Time","title_page":"Americans Not Enrolled in Obamacare May Get a Surprise at Tax Time | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Americans who don’t know that they will be penalized for ignoring the requirements to obtain health coverage may finally figure that out when they see the penalty on their tax returns.\nThe deadline for obtaining coverage was February 15, and the tax deadline is April 15. A Harris Poll found that almost half of Americans without health insurance were unaware there was a penalty.\nThe Obama administration, desperate to avoid more problems with Obamacare, is considering extending the deadline for Americans who simply didn’t realize they would have to pay a penalty until their tax returns showed it. The 2014 penalty for not getting coverage was $95, but that figure skyrocketed to $325 in 2015.\nCritics of an extension of the enrollment deadline argue that without a deadline, Americans would simply wait until they were ill to purchase coverage, thus costing individual markets and raising premiums for those who had coverage.\nBloomberg reported that Health and Human Services Secretary Sylvia Mathews Burwell said on Friday, “You’re going to hear from us, one way or another, within the next two weeks on whether that’s something that we would do.”\nThere are some exceptions to the February 15 deadline: Americans who started an application on HealthCare.gov but missed the deadline can finish the application by February 22 and avoid the penalty. Of the 13 states and District of Columbia that have their own health exchanges, all but one are giving an extension.\nSome supporters of Obamacare are urging the Obama administration to change the deadline to juxtapose more closely with the tax deadline, arguing that once Americans see their tax refunds, they will be more willing to enroll in Obamacare. But the administration has responded that future enrollment deadlines would be scheduled for mid-December.","url":"https://www.breitbart.com/politics/2015/02/17/americans-not-enrolled-in-obamacare-may-get-a-surprise-at-tax-time/"}
