{"authors":["Alanna Bennett"],"date_download":"2018-10-30 23:09:53","date_modify":"2018-10-30 23:09:53","date_publish":"2014-08-13 23:28:46","description":"*Stomps foot and whines* Is it October yet? I'mma need it to be October soon. Summer is way too sweaty for my tastes, for one — but really I just need American Horror Story : Freak Show to premiere, because my curiosity is raging. And they just…","filename":"data/vaneerConsumption/AmericanHorrorFreakShowCastsJyotiAmgeakaWorldsSmallestWoman.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/7/11/baf6e910-30de-40d8-8c06-ab987936c071-getty-456747728.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35700-american-horror-freak-show-casts-jyoti-amge-aka-worlds-smallest-woman_1540940993.html","title":"'American Horror: Freak Show' Casts Jyoti Amge aka \"World's Smallest Woman\"","title_page":"'American Horror: Freak Show' Casts Jyoti Amge aka \"World's Smallest Woman\"","title_rss":"NULL","source_domain":"bustle.com","text":"*Stomps foot and whines* Is it October yet? I'mma need it to be October soon. Summer is way too sweaty for my tastes, for one — but really I just need American Horror Story : Freak Show to premiere, because my curiosity is raging. And they just cast someone new: \"World's smallest woman\" Jyoti Amge.\nThe announcement of this most recent hire came out via — as usual — Ryan Murphy's twitter. The showtunner tweeted a picture of Amge with American Horror Story vet Jessica Lange, presumably on set together. \"Jessica and our newest cast member Jyoti Amge...the world's smallest woman,\" Murphy wrote.\nNews of Amge's casting comes after the announcement that legendary awesome lady Patti LuPone would be joining the show for a few episodes this season. Filming for the anthology show's fourth season is underway, and is also set to include American Horror Story regulars like Lange and Sarah Paulson, alongside AHS newbies like Michael Chiklis and Wes Bentley. It will be set in 1950s Florida at one of the last-functioning \"freak shows\" in the United States. Murphy promises the season will be less campy than Coven but less broody than Asylum.\nNow if only they'd release a teaser trailer.","url":"https://www.bustle.com/articles/35700-american-horror-freak-show-casts-jyoti-amge-aka-worlds-smallest-woman"}
