{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 22:23:35","date_modify":"2018-10-30 22:23:35","date_publish":"2016-12-14 00:00:00","description":null,"filename":"data/vaneerConsumption/AmexaddsnewMessengerpaymentfeature.json","image_url":"https://amp.businessinsider.com/images/58515ee2a1a45ef4008b5bcb-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_amex-adds-new-messenger-payment-feature-2016-12_1540938215.html","title":"Amex adds new Messenger payment feature","title_page":"    Amex adds new Messenger payment feature - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BII\nThis story was delivered to BI Intelligence \"Payments Briefing\" subscribers. To learn more and subscribe, please click here.\nAmerican Express introduced an \"Add a Card\" feature to its Amex Bot in Facebook Messenger, which will enable eligible US consumers to make purchases on the social media website.\nThese card members will be able to effortlessly make purchases in games and on shop sections of business pages and participate in Messenger commerce experiences. This added feature will help bolster Amex's chatbot offerings, which already includes giving users notifications about balances, benefits, and recent purchases.\nThe bot will keep Amex engaged with its consumers at their convenience.\nUsing a chatbot is aiding Amex in engaging customers. Amex can leverage its chatbot to bring engaging, interactive opportunities directly to where consumers already spend much of their time, rather than pushing those consumers to seek out an additional app — messaging apps are used nine times a day on average, significantly more then the average app, which is used twice daily, according to a study by Flurry Analytics.\nAmex is boosting its digital presence while reducing costs. Not only is deploying a chatbot often cheaper than building an app or employing customer service representatives, but it is also an opportunity to push custom offerings to consumers. Amex is already doing this by pushing recommendations and loyalty program information to users based on their purchase history.","url":"https://www.businessinsider.com/amex-adds-new-messenger-payment-feature-2016-12"}
