{"authors":["Associated Press"],"date_download":"2018-10-22 23:48:08","date_modify":"2018-10-22 23:48:08","date_publish":"2017-03-16 07:54:15","description":"MIAMI (AP) - Ron Rothstein still speaks with nothing but reverence for his longtime friend Chuck Daly, who won two NBA titles with Detroit on his way to...","filename":"data/vaneerConsumption/AmidHeatturnaroundSpoelstradrawingDalycomparisons.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/08/wire-227255-1489651469-629_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319172_Amid-Heat-turnaround-Spoelstra-drawing-Daly-comparisons_1540252088.html","title":"Amid Heat turnaround, Spoelstra drawing Daly comparisons","title_page":"Amid Heat turnaround, Spoelstra drawing Daly comparisons | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MIAMI (AP) - Ron Rothstein still speaks with nothing but reverence for his longtime friend Chuck Daly, who won two NBA titles with Detroit on his way to enshrinement in the Basketball Hall of Fame.\nThat's why this comparison is significant.\nWhen Rothstein sees what Erik Spoelstra has done in Miami this season, he's reminded of Daly.\nMiami Heat head coach Erik Spoelstra talks with a game official during the first half of an NBA basketball game against the Indiana Pacers, Sunday, March 12, 2017, in Indianapolis. (AP Photo/Doug McSchooler)\nSpoelstra has emerged again as a coach of the year candidate after engineering perhaps the surprise story in the league this season, a turnaround that has seen the Heat transform from having the 29th-best record in the 30-team NBA to one firmly in the postseason chase. The Heat (33-35) are tied with Detroit for eighth in the Eastern Conference, after wins in 22 of their last 27 games.\n\"The game is about the players, not about us,\" said Rothstein, whose long coaching resume includes stints as an assistant under Daly in Detroit and under Spoelstra in Miami. \"We're part of it, but it's about them. Chuck had a great ability to keep his ego in check and understand that players were more important than we were. That's not easy for a lot of coaches. It wasn't easy for me. But I see that in Spo.\"\nRothstein was the first Heat coach back in 1988 and has been part of the franchise for most of its history. He's been an assistant under Pat Riley, then had Spoelstra as his assistant during an interim-head-coach stint, and later worked on Spoelstra's staff. He's now part of the Heat broadcasting team, and knew if there was a way to fix this season Spoelstra would come up with the answer.\n\"He works harder than anyone I've known,\" Rothstein said.\nWhen the Heat hit the midpoint of the season at 11-30, barely ahead of only woebegone Brooklyn in the NBA standings, a common perception was that Miami would be best served by tanking and trying to get the best draft pick possible.\nSuch thinking never entered Spoelstra's mind.\nHe kept insisting that the Heat roster - which had so many injuries that the lineup, it seemed, was changing nightly - was finding its way. It sounded like coachspeak until Miami put together a 13-game winning streak, the longest in the NBA this season.\nAnd they haven't faded since.\n\"The locker room hasn't changed too much,\" Spoelstra said Wednesday night in a Facebook Live appearance for fans in the Philippines; he's a Filipino-American and the NBA is celebrating Filipino Heritage Week. \"This has been a great group. I really enjoy the guys in the locker room. Even when we were 11-30, guys were coming into work with the right attitude every day to try to get better.\"\nHis players say their attitude reflects his leadership.\n\"He's the Coach of the Year,\" Heat point guard Goran Dragic said. \"I think he should win it.\"\nSpoelstra has never liked talking about individual honors, not even coach of the month awards. There are far more pressing issues for him to deal with in a playoff chase, even one that hardly anyone would have figured Miami would be involved in a couple months ago.\n\"I've never seen anything like this before,\" Rothstein said. \"I've racked my memory to try to come up with something close, something similar, and I can't.\"","url":"https://www.dailymail.co.uk/wires/ap/article-4319172/Amid-Heat-turnaround-Spoelstra-drawing-Daly-comparisons.html"}
