{"authors":["Breitbart London"],"date_download":"2018-10-30 20:43:52","date_modify":"2018-10-30 20:43:52","date_publish":"2018-06-20 10:11:16","description":"BERLIN (AP) - Chancellor Angela Merkel's Bavarian allies responded skeptically Wednesday to the German leader's agreement to a future eurozone budget, | London / Europe","filename":"data/vaneerConsumption/AmidFractiousCoalitionMerkelDeputyResistsEurozoneJointBudgetPlan.json","image_url":"https://media.breitbart.com/media/2018/06/GettyImages-978716722-e1529489410912.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_06_20__1540932232.html","title":"Amid Fractious Coalition, Merkel Deputy Resists Eurozone Joint Budget Plan","title_page":"Amid Fractious Coalition, Merkel Deputy Resists Eurozone Joint Budget Plan | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"BERLIN (AP) – Chancellor Angela Merkel’s Bavarian allies responded skeptically Wednesday to the German leader’s agreement to a future eurozone budget, adding to a conflict over migration that has shaken the government.\nBavaria’s Christian Social Union party is locked in a dispute with Merkel over its demand that some migrants should be turned back at Germany’s borders. It has given her two weeks to reach agreement with European partners, with Interior Minister Horst Seehofer, the CSU’s leader, threatening to go ahead unilaterally if she doesn’t.\nMerkel discussed migration Tuesday with French President Emmanuel Macron, and the two leaders also advocated a eurozone budget of unspecified size that they hope will boost investment, ahead of a summit next week of the 28-nation bloc’s leaders.\nMacron and Merkel Agree Common Eurozone Budget, Tax Integration https://t.co/eC02CmOzBr — Breitbart London (@BreitbartLondon) June 19, 2018\nThe CSU is determined to show that it’s tough on migration ahead of an Oct. 14 state election in which it wants to keep down support for the nationalist, anti-migrant Alternative for Germany party. On Wednesday, Bavarian governor Markus Soeder and his Cabinet met in Linz, Austria, with Chancellor Sebastian Kurz, a leading hardliner on migration, and his ministers.\nSoeder also was keen to draw a tough line on the eurozone’s finances. He questioned “whether a eurozone budget can actually be the right way to stabilize the currency.” And he cautioned against making financial concessions to secure countries’ support in taking back rejected migrants.\n“The stability of the currency and the question of refugee policy are two different things,” he added. “They must not be mixed up with each other.”\n“We need a change to migration policy, strengthening the rule of law,” Soeder said. “And the stability of the currency is another thing – no compromises can be made on that.”\nSoeder said his party is calling for leaders of Germany’s governing coalition to meet over the eurozone budget idea. The CSU and Merkel’s Christian Democratic Union, which are conservative sister parties, govern with the center-left Social Democrats.","url":"https://www.breitbart.com/europe/2018/06/20/amid-fractious-coalition-merkel-deputy-resists-eurozone-joint-budget-plan/"}
