{"authors":[],"date_download":"2018-10-30 01:08:25","date_modify":"2018-10-30 01:08:25","date_publish":"2014-11-19 00:00:00","description":null,"filename":"data/vaneerConsumption/AMilitaryFamilyonVeteransDay.json","image_url":"https://www.americanthinker.com/images/bucket/2014-11/193402.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2014_11_a_military_family_on_veterans_day_1540861705.html","title":"A Military Family on Veteran's Day","title_page":"A Military Family on Veteran's Day","title_rss":"NULL","source_domain":"americanthinker.com","text":"A Military Family on Veteran's Day\nMany in the military have an “all in the family” mentality. Across the generations, they have passed down the importance of serving their country. Those who do serve in today’s all-volunteer military tend to come from military families, with the profession handed down from one generation to the next. Roughly 80 percent of young veterans have an immediate family member who served, according to the Pew Research Center. Veteran’s Day is a time for those living in the United States to reflect on how certain individuals stepped up and fought for their country’s principles and their fellow Americans. Sandra Brannan, the bestselling author of Solomon’s Whisper, wrote a dedication in the front of her book, “For everyone who has served in the military. Thank your for protecting my freedom of speech and so many other freedoms I enjoy as an American.” This can be exemplified with Sandra’s family in particular, who had someone from every generation serving from World War I through the War on Terror.\nHer grandfather, known as Pete, served during World War I. He enlisted in the Army, wanting to fight for his country. Unfortunately, during training, he was one of many who became infected by the influenza epidemic. Although he lost a kidney the family considers Pete one of the lucky ones, since by October 1918 some U.S. Army camps reported a death every hour. Many of those who were sent overseas had to endure the major flu outbreaks. Americans seem to forget that those who serve must battle not only the enemy outright but a hidden nemesis as well. Compare this to today where U.S. Army service people will be sent to West Africa to provide medical, logistical, and security support. Just as with Pete, Army Sergeant Anthony Maddox felt Ebola is “just like a hostile combatant on the battlefield, it can kill you. You know it’s there but you cannot see it.” Pete’s son Chuck counts his military service as his first career. Now, almost 89 years old, he reflects on his time in the military. Enlisting in the Army right out of high school in 1943, he was stationed in the Philippines, scheduled to be a part of the invasion of Japan. He wants people to understand that “it is not like today when only about one percent are serving. During World War II everybody joined and the whole country was behind that war. If you didn’t go you were looked down upon unless there was a real good reason. At age eighteen I was willing to give my life for my country. The difference between then and now is that today I am not sure the troops has a commander-in-chief that cares about and supports them.” Chuck’s daughter LaRece joined ROTC while attending the University of Wyoming in 1973. She said her father instilled in her the desire to serve, since those in the military have the feeling of wanting to give something back to their country. She noted that while taking walks her dad would have all his nine children sing “Jodies,” the songs soldiers sing as they march in formation. LaRece thinks that subconsciously those experiences influenced her to join ROTC where she became the first female cadet battalion commander in the U.S. After graduating, she became a transportation platoon leader in Germany for the Third Armored Division during the Cold War. She does not feel that being the only female platoon leader in the transportation company put her at a disadvantage. “I learned to handle the preconceptions. I never felt I was treated any differently. Respect had to be earned through hard work on my part just as with any other field: how I handled the challenges, how I treated people, and how I personally handled my job. I am very proud of my three years of active duty.” Having been on the forefront of females in the military she is glad that she was one of a few who laid the foundation for women to have gender equality in the armed forces, as evidenced with the ever-increasing numbers of women serving. LaRece met her husband Andi while both were in ROTC. He decided to make a career of it and had served for twenty-eight years, retiring in 2002 as a full Army colonel. He fought in the forgotten conflict, the Balkans War. For him, his military career can be summed up, “during that time period we were deployed to stop the genocide. It was horrific and many Americans do not have a clue what was happening over there. I am proud of the good we provided.” Joel, Sandra’s husband, enlisted as a Marine and was deployed to Vietnam from 1970 to 1971. Traditionally Americans have always shown great respect for those in uniform and have honored them as they come home. Unfortunately, this was not the case for those soldiers returning home from Vietnam. They were not portrayed as heroes but humiliated with accusations of baby killers and warmongers, spit upon, and in some instances physically attacked. Many were told not to wear their uniforms in public. Joel never experienced these attitudes but agreed that the sentiment of Americans was not warm or welcoming. These memories were brought back recently by a Canadian directive advising soldiers there not to wear their uniforms in public for their own security. He told American Thinker, “I think we all need to stand up for our beliefs and not be cowards. We need to learn from our past mistakes and understand that a minority of people should not change the way we live both emotionally and physically. I am proud I was a U.S. Marine and that I served my country while fighting in Vietnam. It is disappointing that everyone wants their freedoms and beliefs, but not a lot of people make the sacrifices necessary.” Erik, the son of Andi and LaRece, enlisted in the Marines after 9/11. He was deployed in Iraq for two tours of duty and encountered very intensive combat. He felt that both his parents being in the military instilled a sense “of wanting to be a part of something bigger than myself. We just had a modern day Pearl Harbor happen. Although we are respected and admired by Americans for serving there is still a disconnect. People do not understand that in real life, unlike the video games, combat soldiers, do not get a chance to restart if shot. People say they support us but they cannot envision the stresses of a military family. Veterans have to endure survivor’s guilt and PTSD. We have to cope with the differences between civilian and military life.” Everyone interviewed looks back on their years in the military with pride. They feel those years taught them how to control their emotions, patience, self-discipline, respect for others, how to be a leader, and love of country. Their experiences became special because of the bond formed with fellow soldiers whom they considered their brothers and sisters and would die for because it was no longer about “me” but was about the team. This November 11th people should take a moment to think about those who have served. From the days of the Founding Fathers to today, those in the military whether enlisted or drafted, made tremendous sacrifices for their fellow Americans. No matter how long they served they deserve respect and thanks. The author writes for American Thinker. She has done book reviews, author interviews, and has written a number of national security, political, and foreign policy articles.","url":"https://www.americanthinker.com/articles/2014/11/a_military_family_on_veterans_day.html"}
