{"authors":["Associated Press"],"date_download":"2018-10-22 21:24:22","date_modify":"2018-10-22 21:24:22","date_publish":"2016-01-28 07:37:45","description":"BURNS, Ore. (AP) — A day after eight members of an armed anti-government group were arrested, their jailed leader on Wednesday urged a handful of remaining m...","filename":"data/vaneerConsumption/AmmonBundyurgeslastrefugeoccupierstogohome.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:fc4912415bd34f5ebeacdd7715797b6f-2vdWmEltwXfba0ce28e6325ad3f4-979_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3418787_Arrests-Oregon-standoff-leaders-leaves-1-person-dead_1540243462.html","title":"Ammon Bundy urges last refuge occupiers to go home","title_page":"Ammon Bundy urges last refuge occupiers to go home | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ammon Bundy urges last refuge occupiers to go home\nBURNS, Ore. (AP) — A day after eight members of an armed anti-government group were arrested, their jailed leader on Wednesday urged a handful of remaining militants to abandon the Oregon wildlife refuge they have occupied for more than three weeks and where they are now surrounded by federal agents.\nAfter militant leader Ammon Bundy made his first court appearance in Portland on Wednesday, his attorney, Mike Arnold, read this statement from his client: \"Please stand down. Go home and hug your families. This fight is now in the courts.\"\nIt was unclear whether the remnant of Bundy's followers still holed up at the Malheur National Wildlife Refuge south of Burns was ready to heed his advice.\nHarney County Sheriff Dave Ward speaks at press conference at the Harney County Community Center in Burns, Ore., Thursday, Jan. 27, 2016. (Beth Nakamura/The Oregonian via AP)\nMeanwhile, details began to emerge about the confrontation Tuesday on a remote highway that resulted in the arrest of Bundy and other leading figures in the group of occupiers, and in the death of militant Robert Finicum.\nBundy followers gave conflicting accounts of how Finicum died. One said Finicum charged at FBI agents, who then shot him. A member of the Bundy family said Finicum did nothing to provoke the agents.\nAn Oregon man who says he witnessed the shootout says he heard about a half-dozen shots but didn't see anyone get hit, and that the shooting happened quickly — over maybe 12 or 15 seconds. Raymond Doherty told KOIN-TV (http://is.gd/AgNSdm) that he was about 100 feet back and couldn't see who specifically was shooting. But, he added, \"I saw them shooting at each other.\"\nThere was no immediate way to confirm the accounts. Authorities refused to release any details about the encounter or even to verify that it was Finicum who was killed.\nAlso on Wednesday, a federal judge in Portland unsealed a criminal complaint that said the armed group had explosives and night-vision goggles and that they were prepared to fight at the refuge or in the nearby town of Burns.\nSomeone told authorities about the equipment on Jan. 2, when the group took over Malheur National Wildlife Refuge, according to the document.\nBundy and the seven others are charged with felony counts of \"conspiracy to impede officers of the United States from their official duties through the use of force, intimidation, or threats.\"\nThe criminal complaint stresses that point. It states that the 16 employees at the wildlife refuge \"have been prevented from reporting to work because of threats of violence posed by the defendants and others occupying the property.\"\nFederal law officials and Harney County Sheriff Dave Ward held a news conference on Wednesday in which they called on the rest of the occupiers to go home. There is a huge law enforcement presence in the region, and the FBI has now set up checkpoints outside the refuge.\nFBI agent Greg Bretzing said people could leave through checkpoints \"where they will be identified.\" He did not say whether any of them face arrest. He said negotiators were available to talk if they have \"questions or concerns.\"\nBretzing also defended the FBI-led operation that resulted in the arrest of Bundy and other leaders, and in the death of Finicum. \"I will say that the armed occupiers were given ample opportunities to leave peacefully,\" he said.\nWard said multiple law-enforcement agencies put together \"the best tactical plan they could.\"\nBundy followers took to social media to offer conflicting accounts of Finicum's final moments.\nIn a video posted to Facebook, Mike McConnell said he was driving a vehicle carrying Ammon Bundy and another occupier, Brian Cavalier. He said Finicum was driving a truck and with him were Ryan Bundy — Ammon's brother — as well as three others.\nHe said the convoy was driving through a forest when they were stopped by agents in heavy-duty trucks. He said agents first pulled him out of the vehicle, followed by Ammon Bundy and Cavalier.\nWhen agents approached the truck driven by Filicum, he drove off with officers in pursuit. McConnell said he did not see what happened next, but he heard from others who were in that vehicle that they encountered a roadblock.\nThe truck got stuck in a snowbank, and Finicum got out and \"charged them. He went after them,\" McConnell said.\nRelatives of Ammon Bundy offered similar accounts, but they said Finicum did nothing to provoke FBI agents.\nBriana Bundy, a sister of Ammon Bundy, said he called his wife after his arrest. He said the group was stopped by state and federal officers.\nShe said people in the two vehicles complied with instructions to get out with their hands up.\n\"LaVoy shouted, 'Don't shoot. We're unarmed,' \" Briana Bundy said in an interview with The Associated Press. \"They began to fire on them. Ammon said it happened real fast.\"\n\"Ammon said, 'They murdered him in cold blood. We did everything they asked, and they murdered him. We complied with their demands,' \" she said.\nMcConnell had a different perspective.\n\"Any time someone takes off with a vehicle away from law enforcement after they've exercised a stop, it's typically considered an act of aggression, and foolish,\" he said in the Facebook video.\nMcConnell said he was questioned by authorities, and he believes he was not charged because he was not considered a leader of the group. Briana Bundy confirmed that McConnell was in the convoy on Tuesday.\nAmmon and Ryan Bundy are the sons of Nevada rancher Cliven Bundy, who was involved in a high-profile 2014 standoff with the government over grazing rights.\nThe group, which has included people from as far away as Michigan, calls itself Citizens for Constitutional Freedom It came to the frozen high desert of eastern Oregon to decry what it calls onerous federal land restrictions and to object to the prison sentences of two local ranchers convicted of setting fires.\n___\nPetty reported from Portland. Associated Press writers Ken Ritter in Las Vegas, Rebecca Boone in Boise, Idaho, and Martha Bellisle in Seattle contributed to this report.\nFBI Special Agent in Charge Greg Bretzing reacts as he speaks during a press conference at the Harney County Community Center, in Burns, Ore., Wednesday, Jan. 27, 2016. Bretzing was recounting the actions taken Tuesday night by police and federal authorities including the killing of one of the armed group occupying the Malheur National Wildlife Refuge. (Beth Nakamura/The Oregonian via AP)\nRancher Cliven Bundy stands along the road near his ranch after speaking with media Wednesday, Jan. 27, 2016, in Bunkerville, Nev. Cliven Bundy and his wife Carol Bundy was returning from a trip to visit the family of LaVoy Finicum, a 55-year-old rancher from Cain Beds, Ariz., who died Tuesday after law enforcement officers initiated a traffic stop near the Malheur National Wildlife Refuge. It's unclear what happened in the moments before his death. (AP Photo/John Locher)\nOregon State Police man a roadblock at the intersection of highways 395 and 20 outside of Burns, Ore., Wednesday morning, Jan. 27, 2016. Authorities were restricting access on Wednesday to the Malheur National Wildlife Refuge headquarters being occupied by an armed group after one of the occupiers was killed during a traffic stop and eight more, including the group's leader Ammon Bundy, were arrested. (Dave Killen/The Oregonian via AP) MAGS OUT; TV OUT; NO LOCAL INTERNET; THE MERCURY OUT; WILLAMETTE WEEK OUT; PAMPLIN MEDIA GROUP OUT; MANDATORY CREDIT\nHarney County Sheriff Dave Ward speaks at press conference at the Harney County Community Center in Burns, Ore., Thursday, Jan. 27, 2016. (Beth Nakamura/The Oregonian via AP)\nHarney County Sheriff Dave Ward speaks at press conference at the Harney County Community Center in Burns, Ore., Thursday, Jan. 27, 2016. (Beth Nakamura/The Oregonian via AP)\nPeople wait inside the Harney County Community Center before a news conference, Wednesday, Jan. 27, 2016, in Burns. Ore., regarding the standoff at the Malheur National Wildlife Refuge. Authorities Tuesday arrested the leaders of the armed group who had been occupying the refuge headquarters to protest federal land policies. (Thomas Boyd/The Oregonian via AP) MAGS OUT; TV OUT; NO LOCAL INTERNET; THE MERCURY OUT; WILLAMETTE WEEK OUT; PAMPLIN MEDIA GROUP OUT; MANDATORY CREDIT\nKim Rollins, 64, of Burns, stands outside the Harney County Community Center in Burns, Oregon, before the start of a news conference by officials Wednesday, Jan. 27, 2016. Authorities on Tuesday arrested the leaders of an armed group who had been occupying the Malheur National Wildlife Refuge headquarters to protest federal land policies. (AP Photo/Keith Ridler)\nPolice officers block the turnout to Sodhouse Lane, which is the main road leading to the Malheur National Wildlife Refuge headquarters, Wednesday, Jan. 27, 2016, near Burns, Ore. Authorities were restricting access on Wednesday to the Oregon refuge being occupied by an armed group after one of the occupiers was killed during a traffic stop and eight more, including the group's leader Ammon Bundy, were arrested. (Beth Nakamura/The Oregonian via AP) MAGS OUT; TV OUT; NO LOCAL INTERNET; THE MERCURY OUT; WILLAMETTE WEEK OUT; PAMPLIN MEDIA GROUP OUT; MANDATORY CREDIT\nLaw enforcement personnel block an access road to the Malheur National Wildlife Refuge, Wednesday, Jan. 27, 2016, near Burns, Ore. Authorities were restricting access on Wednesday to the Oregon refuge being occupied by an armed group after one of the occupiers was killed during a traffic stop and eight more, including the group's leader Ammon Bundy, were arrested. (Thomas Boyd/The Oregonian via AP) MAGS OUT; TV OUT; NO LOCAL INTERNET; THE MERCURY OUT; WILLAMETTE WEEK OUT; PAMPLIN MEDIA GROUP OUT; MANDATORY CREDIT","url":"https://www.dailymail.co.uk/wires/ap/article-3418787/Arrests-Oregon-standoff-leaders-leaves-1-person-dead.html"}
