{"authors":["Associated Press"],"date_download":"2018-10-22 21:55:50","date_modify":"2018-10-22 21:55:50","date_publish":"2016-01-29 08:21:44","description":"KAMPALA, Uganda (AP) — New satellite images, video footage and witness accounts show that dozens of people killed by Burundian security forces in December we...","filename":"data/vaneerConsumption/AmnestyInternational5PossiblemassgravesinBurundi.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422310_Amnesty-International-5-Possible-mass-graves-Burundi_1540245350.html","title":"Amnesty International: 5 Possible mass graves in Burundi","title_page":"Amnesty International: 5 Possible mass graves in Burundi | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Amnesty International: 5 Possible mass graves in Burundi\nKAMPALA, Uganda (AP) — New satellite images, video footage and witness accounts show that dozens of people killed by Burundian security forces in December were later buried in mass graves, Amnesty International said Friday.\nThe rights group reported there are five possible mass graves in the Buringa area, on the outskirts of the Burundian capital, Bujumbura.\n\"The imagery, dating from late December and early January, shows disturbed earth consistent with witness accounts. Witnesses told Amnesty International that the graves were dug on the afternoon of Dec. 11, in the immediate aftermath of the bloodiest day of Burundi's escalating crisis,\" the group said in a statement.\nWitnesses described how police and local officials scoured Nyakabiga and other neighborhoods in Bujumbura to retrieve the bodies of those who were killed and took them to undisclosed locations, according to Amnesty.\nEarlier this month, U.N. human rights chief Zeid Raad al-Hussein also called for an urgent investigation into the alleged existence of mass graves following the violence in December.\nZeid cited \"large-scale human rights violations,\" saying the \"increasing number of enforced disappearances, coupled with allegations of secret detention facilities and mass graves is extremely alarming.\"\nBurundi's government dismissed those allegations, saying they were based on false information supplied by the regime's opponents who fled into exile.\nGovernment spokesman Philippe Nzobonariba said the U.N. is free to go to Burundi and investigate the allegations, which he said were intended to portray Burundi as being a dangerous country.\nIn coordinated attacks, gunmen stormed three military installations in Burundi on Dec. 11. The next day, 28 people were found shot dead in three Bujumbura neighborhoods. An eyewitness told the AP some of the dead had their hands tied behind their backs. Another witness blamed government security forces, saying they went after the victims in door-to-door searches.","url":"https://www.dailymail.co.uk/wires/ap/article-3422310/Amnesty-International-5-Possible-mass-graves-Burundi.html"}
