{"authors":["Eve Troeh"],"date_download":"2018-10-22 21:20:09","date_modify":"2018-10-22 21:20:09","date_publish":"2016-08-27 00:00:00","description":"Myra Engrum works, cares for her son, has friends and is active in church. She's done things \"right.\" But for the second time in 11 years, she's picking up the pieces of her storm-ravaged life.","filename":"data/vaneerConsumption/AMomsLifeRebuiltAfterKatrinaWreckedByBatonRougeFloods.json","image_url":"https://media.npr.org/assets/img/2016/08/26/engrum-1_wide-897aa9cad6404fa75ab1a7cb7d002123305a7202.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_08_27_491487077_a-moms-life-rebuilt-after-katrina-wrecked-by-baton-rouge-floods_1540243209.html","title":"A Mom's Life, Rebuilt After Katrina, Wrecked By Baton Rouge Floods","title_page":"A Mom's Life, Rebuilt After Katrina, Wrecked By Baton Rouge Floods : NPR","title_rss":"NULL","source_domain":"npr.org","text":"A Mom's Life, Rebuilt After Katrina, Wrecked By Baton Rouge Floods\nEnlarge this image toggle caption Eve Troeh/Eve Troeh Eve Troeh/Eve Troeh\n\"It was wonderful to feel like I'd never have to be homeless again.\"\nMyra Engrum is sitting in a McDonald's in Louisiana, steeling herself for another day of mucking out her flooded home. The parking lot is full of construction trucks and cars with a insurance company logos. A lot of meetings are happening here.\n\"I had over four and a half feet of water in my home, on the inside and outside,\" she says. \"This is my first home that I ever purchased. I got the home right after Katrina.\"\nEngrum, like many of those who lost everything in the recent floods around Baton Rouge, La., is a veteran of disaster. She lost everything when Hurricane Katrina hit New Orleans 11 years ago, and like thousands of others moved north to rebuild her life, bringing along her pregnant daughter.\nHer daughter died soon after childbirth, and Myra Engrum became the baby's mother. Jeremiah is now ten; she's 61.\nThe two of them were in their small brick ranch house earlier this month when the flood came.\nAround the Nation Tens Of Thousands Struggle To Cope After Major Floods In Louisiana Tens Of Thousands Struggle To Cope After Major Floods In Louisiana Listen · 3:37 3:37\nThe 'Cajun Navy' Heads Out To Rescue Flooded Baton Rouge Residents The 'Cajun Navy' Heads Out To Rescue Flooded Baton Rouge Residents Download · 5:16 5:16\n\"I call him my hero,\" she says, \"because that Saturday, it was not raining. We were in the living room; he looked through the mail slot and said, 'Mommy there's water in the street.' \"\nThey drove out, just in time. That night, around midnight, Engrum sat in her car with her son in the dark, and something clicked. Her disaster experience from a decade ago kicked into gear.\n\"All of a sudden I said 'Jeremiah, do you have a tablet? '\" Engrum says. \" 'I need a tablet to write on, I've gotta make some notes.' \"\nHer son pulled a notebook from his backpack. Now it's on the McDonald's table, full of lists, phone numbers, names of FEMA reps and insurance agents.\n\"Because of my experience with Katrina, I knew that people were gonna be asking things like 'What did you lose in the house?' \" Engrum says.\nEnlarge this image toggle caption Eve Troeh/Eve Troeh Eve Troeh/Eve Troeh\nEventually she's ready to face the day, She heads out to her house on Acacia Street to meet her contractor, who says he's going to spend the day gutting her kitchen.\nEngrum had taken the precaution of buying flood insurance, but it only pays for home repairs. She couldn't afford the more expensive policy to cover contents — the kitchen appliances that are now piled in a mountain out front, for instance.\nThe list of things Engrum may have to pay for out of pocket is endless: \"Everything I owned — pots and pans, cabinets, you name it, mattresses, Jeremiah's camping stuff, his Boy Scouts uniform.\"\nEngrum won't let Jeremiah see the house — health officials want kids to stay away from moldy homes and slippery debris, and she worries it would be traumatic for him.For now, they're staying with one of Jeremiah's former teachers, an hour's drive away.\nEach day Engrum makes the trip to Baton Rouge to drop her son at day camp, while she deals with house stuff. Today, she stops in to check on him.\nIt's hard to tell if he understands the extent of what's been lost. He lists off the library books he had checked out when the water rose, and Engrum tells him they're gone. He says he hopes they'll be understanding about not getting them back.\nAs he runs off to return to day camp it starts to rain. Standing beneath the concrete overhang, Engrum starts to sing an old spiritual, \"Nobody Knows The Trouble I've Seen.\"\nIt feels like a momentary break from the huge tasks ahead — finding work and a place to live, providing a stable life for Jeremiah. She's starting all over again.\nShe's done it before, but that doesn't make it any easier.","url":"https://www.npr.org/2016/08/27/491487077/a-moms-life-rebuilt-after-katrina-wrecked-by-baton-rouge-floods"}
