{"authors":[],"date_download":"2018-10-22 21:38:58","date_modify":"2018-10-22 21:38:58","date_publish":"2016-10-09 00:00:00","description":"Mecklenburg County, N.C., is a blue spot in a red state. And a visit there reveals something national polls may leave unsaid: Many black voters are dissatisfied with their choices for president.","filename":"data/vaneerConsumption/AmongBlackVotersInCharlotteADifficultDecisionBetweenHillaryClintonDonaldTrumpNPR.json","image_url":"https://media.npr.org/assets/img/2016/10/08/img_7161_wide-ff7ce49d06bc6f2c10bba3e59f25e8d89b6ca3e8.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=497193482_1540244338.html","title":"Among Black Voters In Charlotte, A Difficult Decision Between Hillary Clinton, Donald Trump : NPR","title_page":"Among Black Voters In Charlotte, A Difficult Decision Between Hillary Clinton, Donald Trump : NPR","title_rss":"NULL","source_domain":"npr.org","text":"RACHEL MARTIN, HOST:\nThis is For The Record.\n(SOUNDBITE OF MUSIC)\nMARTIN: Over the course of this election season, we've been visiting Charlotte, N.C., in Mecklenburg County. It's a solidly blue county in a red state. There's a rapidly growing Hispanic population. Thirty percent of the residents are black. It has a booming tech center. It's a hub for banking, and it's in a swing state. In fact, North Carolina may be one of the most important states this election year.\nPresident Obama won the state in 2008 because black voters turned out in huge numbers. But he lost to Mitt Romney in 2012 by a slim margin. Polls now show Hillary Clinton and Donald Trump within a few percentage points of each other. One thing we know from 2008, Hillary Clinton's success in North Carolina this year depends on black voters. And so for our third visit, we decided to check in with some of them. For The Record today, the fight for North Carolina.\nUNIDENTIFIED WOMAN #1: Text Angelica (ph) to pull it from Facebook. So she can put it on Instagram or Twitter, right?\nMARTIN: We begin in a college classroom in Charlotte. Johnson C. Smith is an historically black university. And this should be a hotbed of Clinton support, especially considering Trump is polling so low among African-Americans. But when we talked with students and alumni in the school's politics club, Ayanna Perry told us Bernie Sanders was her first pick.\nAYANNA PERRY: When he dropped out of the presidential nomination for the Democratic Party, I was kind of like, I guess I'm with her. Like, I guess I'm with Hillary.\nMARTIN: And here's Jasmine Wright.\nJASMINE WRIGHT: I just feel bad for first-time voters or people who actually get a chance to go out and vote. I feel sorry for their decisions.\nMARTIN: Hillary Clinton knows she has some work to do here, which is why she's been sending surrogates to get students fired up. North Carolina is up for grabs, and the African-American vote is a crucial demographic, which is why Donald Trump is making a play for it in his own way.\n(SOUNDBITE OF ARCHIVED RECORDING)\nDONALD TRUMP: What do you have to lose? You're living in poverty. Your schools are no good. You have no jobs. Fifty-eight percent of your youth is unemployed. What the hell do you have to lose?\nMARTIN: I asked some of the students here what they thought of Donald Trump's comments.\nHAIJIRA ATTAH: I just felt like it was a complete slap in the face.\nMARTIN: This is Haijira Attah.\nATTAH: What do I have to lose? I have my dignity to lose. And it's not like you're offering a better approach to the issues that we are facing. And I feel like the only time he - I don't even really know what to say about Trump. It's just - what's even more sad for me is that there are actually people who believe in his racist commentary and his policies. And it's just - I feel like this election process was really a wake-up call to the racism that still is clearly here in America.\nMARTIN: And what about Hillary Clinton? Why are they so lukewarm on her? Student Ayanna Perry speaks up.\nPERRY: I kind of feel like I don't really like some of the ways - in her past, some of the stuff that she's done. And she hasn't really spoke up about it, whether like apologizing...\nMARTIN: Like what?\nPERRY: Her comment - was it '96? - super...\nUNIDENTIFIED WOMAN #2: Back in '96, yeah.\nPERRY: ...Super predators comment that she made.\nMARTIN: And that's something we end up hearing quite a few times down here, concern over the comments Hillary Clinton made back in 1996 while promoting her husband's crime bill.\n(SOUNDBITE OF ARCHIVED RECORDING)\nHILLARY CLINTON: We need to take these people on. They are often connected to big drug cartels. They are not just gangs of kids anymore. They are often the kinds of kids that are called super predators - no conscience, no empathy. We can talk about why they ended up that way, but first we have to bring them to heel.\nMARTIN: Hillary Clinton has since apologized for using the phrase super predator, but it has come back to haunt her in this election. Ayanna Perry says she'll still vote for Clinton but not with a lot of enthusiasm.\nPERRY: I feel like she's not really for my best interests. But because of the lesser of two evils, I feel like it's better to vote for her and not somebody who's far worse with - it comes to, like, immigration and, like, college debt and stuff like that.\nMARTIN: We spoke with 21-year-old communications major Angelica Grant a little later, and she agreed that the Democratic Party has taken the black vote for granted.\nANGELICA GRANT: I definitely do agree that African-Americans have been voting disproportionately for the Democratic Party for years and still haven't necessarily gotten the changes that we've been asking for over the years. But I don't think that that's enough for all the African-Americans to switch over to the Republican Party.\nMARTIN: Ty Turner Bond already made that switch.\nTY TURNER BOND: Every African-American does not think alike. Every African-American does not walk alike. So why should I vote alike?\nMARTIN: He works for a payroll company in Charlotte. And until 2012, he had spent years working in Democratic politics. He voted for Barack Obama in 2008, believed in him and the change he thought the first black president could bring. Today, Ty Turner Bond is disappointed.\nBOND: We had seven years of President Barack Obama who looks similar to me. But I haven't seen any changes.\nMARTIN: Bond talks about stagnant wages. He says Obamacare is a mess and doesn't really help him anyway. He says Democrats talk too much about social programs when they talk about African-Americans. He wants a bigger focus on economic opportunity. Bond voted for Mitt Romney in 2012. And in this election, he's voting for Donald Trump. I asked him why.\nBOND: He's focusing on strictly, 100 percent helping individuals who come out of prison create their own businesses.\nMARTIN: Where did you hear him talking about that?\nBOND: When we talked about this with his black diversity coordinator when it came to - what's her name? - Omarosa. And that one...\nMARTIN: She's - and she...\nBOND: Yeah.\nMARTIN: ...Volunteered that?\nBOND: Yeah. Yes, she did.\nMARTIN: She said that we want to put in place a plan...\nBOND: That's - yeah.\nMARTIN: ...To empower...\nBOND: African-American males to become entrepreneurs.\nMARTIN: ...African-American businessmen?\nBOND: Yeah. And that's...\nMARTIN: People who come out of prison?\nBOND: People who come out of prison. She said because at the end of the day, we got to make them people. They want better. When he's talking - she - that's when he talked about that African-American, you know, give us a chance. We want to show you another way. But one thing I told here is this with African-American. I don't care who the president is, until African-Americans want to do better for themselves, nobody can do it better for yourself. But you got to do better for yourself. And individuals like us have to step up. And so, again, I want to get that notion out of African-Americans', you know, minds that, what do you got - what you going to do for me?\nMARTIN: We should say there is no mention of any plan to help former prisoners start businesses on Trump's campaign website.\nHow do you think about his rhetoric? Has any of that bothered you?\nBOND: I do feel like it should be toned down just a little bit. But that doesn't persuade me not to vote for you, you know, because you've show me a history of success.\nMARTIN: And to Bond, that's more important than toeing the Democratic Party line just because that's what his friends and family expect.\nBOND: We have ceded our power to a party. And I believe honestly, for me now, I'm about capitalism, not just loyalty to the Republican Party but the conservative ideas. And conservative ideas are what brought us through the storms and going to lead us back to the sunshine.\nMARTIN: Supporting Donald Trump doesn't come without consequences, though.\nI'm Rachel Martin.\nKATRINA RODGERS: I'm Katrina.\nMARTIN: Nice to meet you.\nThis is Katrina Rodgers. Her dad is the senior pastor at the Antioch Road to Glory International Ministries church in Charlotte. Her family and her church have endorsed Donald Trump. The church does not have non-profit status, so it can take political positions.\nRODGERS: One day, we came down here and then we seen a group of individuals. They was tearing down - we had Trump signs in the front. They was tearing those down.\nMARTIN: Besides the vandalism, Katrina Rodgers tells us her church has lost a handful of members because of its support of Trump.\nRODGERS: There were about five parishioners that felt uncomfortable with our position, and we still have a good relationship with them. It was just, you know, I don't want to be anywhere near Trump. And we understand that. So that was a risk that we took, and we felt like it was worth that risk.\nMARTIN: Katrina Rodgers believes Trump will be good for the economy. She likes his positions on trade and re-evaluating NATO. And when it comes to Hillary Clinton, she, too, can't get past that super predator remark from 20 years ago.\nIt's not an issue for Shaun Corbett.\nSHAUN CORBETT: Hey.\nMARTIN: How's it going?\nCORBETT: Nice to meet you. Good morning.\nMARTIN: Nice to meet you.\nMARTIN: We met him at his barbershop northeast of Charlotte. He has run this business for six years and has used it as a sort of hub for all kinds of community service work.\nCORBETT: I sat with Hillary Clinton last, I think, Sunday.\nMARTIN: Did you, when she was here?\nCORBETT: Yeah. She came to Charlotte, and she had a meeting with some of - it was probably about six of us, some of the community leaders. And...\nMARTIN: What'd you think?\nCORBETT: I like her. She's cool. Like, she got a lot of fire in her. And the type of person that I am, anytime I go meet somebody, I try to do a little bit of research. And what people don't realize about her is - and what I found is that Hillary has been fighting for rights for women, black people, kids and all that since, like, the '70s.\nMARTIN: We've talked to quite a few people around Charlotte in the last couple of days, young people in particular who, if you bring up Hillary Clinton, they say, yeah, I'm going to vote for her. But I'm not excited about it because I can't shake the fact that in 1996, two years after her husband's crime bill passed, she talked about super predators in relationship to young African-American men. Is that something that sticks with you?\nCORBETT: Well, see, the thing is - man, I'm a convicted felon. I've been in prison. I don't want people to judge me just on that. So sometimes, we all say and do things, at that moment, might have been right or we thought were right. But in time, perceptions change. Thoughts change. People change. So who am I to hold one thing that one person said at one time against them when I don't want somebody to be barred from getting a job because they a felony. Or I don't want somebody to look at me as a convicted felon for something that I did in 1999 or I was a part of in 1999. So I have to look at people that if I can change, anyone can change. And I kind of just leave it at that.\nMARTIN: Early voting starts on October 20 at 10 sites in Mecklenburg County, N.C. That will be the first test to determine whether African-Americans are showing up at the polls in the numbers Hillary Clinton needs or if Donald Trump is able to make any inroads at all.\nUNIDENTIFIED WOMAN #1: Need everybody to come out. Meet at 11 o'clock; 11:15, you'll march to the polls.\nMARTIN: Meanwhile, students here Johnson C. Smith University are planning their own get-out-the-vote efforts. In the midst of all the focus here on early voting and November the 8, one alumni raises her hand. She wants to know if they're going to have any conversations about how to hold elected officials accountable. These students are already thinking about what happens in this country on November 9.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=497193482"}
