{"authors":[],"date_download":"2018-10-30 00:59:46","date_modify":"2018-10-30 00:59:46","date_publish":"2018-07-09 00:05:42","description":null,"filename":"data/vaneerConsumption/AmyConeyBarrettvsRuthBaderGinsburg.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/1024px-2018_Womens_March_in_Missoula_Montana_69.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861186.html","title":"Amy Coney Barrett vs. Ruth Bader Ginsburg…","title_page":"Amy Coney Barrett vs. Ruth Bader Ginsburg…The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"“Frankly,” said Ruth Bader Ginsburg in July 2009, “I had thought that at the time Roe was decided, there was concern about population growth and particularly growth in populations that we don’t want to have too many of. So that Roe was going to be then set up for Medicaid funding for abortion.”\nThe great added blessing of Roe: Not only could it give women the “right” to abortion, but it could open the way for the federal government, via Medicaid, to fund abortions of children in undesired populations.\nThat assessment by Ginsburg was provided in a July 7, 2009 piece in the New York Times Magazine, titled, “The Place of Women on the Court.” And for 25 years, succeeding a pro-life justice named Byron White, Ruth Bader Ginsburg has held the Planned Parenthood seat on the nation’s high court, where she has fought for the hopes and dreams of Margaret Sanger’s organization. In fact, she has done so in ways more in keeping with Sanger than liberals would care to admit.\nSanger wanted Planned Parenthood, whose clinics are disproportionately located near African-American neighborhoods, to achieve precisely what Ginsburg alluded to. There were certain populations that Sanger badly didn’t want too many of.\nThe passionate eugenicist wished to rid America of its “idiots” and “imbeciles” and “morons” as part of her crowning vision for “race improvement.” The Planned Parenthood matron lamented America’s “race of degenerates.” The nation’s landscape needed to be purged of its “human weeds” and “the dead weight of human waste.” Sanger shared the view of humanity held by another Supreme Court progressive icon, Justice Oliver Wendell Holmes, who declared that “three generations of imbeciles are enough.”\nMargaret Sanger maintained that “the most urgent problem today is how to limit and discourage the over-fertility of the mentally and physically defective.” Progressives today dare not speak of Sanger’s May 1926 speech to a rally of the women’s branch of the KKK in Silverlake, New Jersey, or of her work on the “Negro Project,” or of her December 10, 1939 letter to Dr. Clarence Gamble, stating (in a statement disputed by liberals): “We do not want word to go out that we want to exterminate the Negro population.”\nAmerica, according to Planned Parenthood’s founder, must limit these lamentable populations, and she was willing to take big steps to make that happen, including a special kind of segregation. In her 1922 book, The Pivot of Civilization, Sanger urged that “every feeble-minded girl or woman of the hereditary type, especially of the moron class, should be segregated during the reproductive period. Otherwise, she is almost certain to bear imbecile children, who in turn are just as certain to breed other defectives.” But even then, this surely wasn’t enough: “Segregation carried out for one or two generations would give us only partial control of the problem.” What to do then? Well, if a nudge wouldn’t work, then coercion would: “we prefer the policy of immediate sterilization, of making sure that parenthood is absolutely prohibited to the feeble-minded.”\nThese “defective delinquents” were a “menace.” America needed to “become fully cognizant of the burden of the imbecile upon the whole human race.” Funds should be made available, she counseled in 1922, “by hundreds of millions of dollars, to the care and segregation of men, women, and children who never should have been born.”\nHow grand it would be if Uncle Sam could fund the means to limit the reproduction of these unsavory populations.\nFast forward to the 1990s, the era of the Clintons. In 1992, Ron Weddington, one of the abortion attorneys in the Roe decision, fired off a letter to Bill Clinton urging sharper measures to limit the birth of America’s defectives: “[Y]ou can start immediately to eliminate the barely educated, unhealthy and poor segment of our country,” wrote Weddington. “The problem is that their numbers are not only replaced but increased by the birth of millions of babies to people who can’t afford to have babies.”\nFor an example of responsible reproduction, Ron Weddington pointed to Bill and Hillary. He told the president-elect:\nYou and Hillary are a perfect example. Could either of you have gone to law school and achieved anything close to what you have if you had three or four more children before you were 20? No! You waited until you were established in your 30s to have one child. That is what sensible people do.… It’s time to officially recognize that people are going to have sex and what we need to do as a nation is prevent as much disease and as many poor babies as possible. Condoms alone won’t do it. Depo-Provera, Norplant and the new birth control injection being developed in India are not a complete answer…. Even if we make birth control as ubiquitous as sneakers and junk food, there will still be unplanned pregnancies.\nThus, the ongoing need for abortion — lots and lots of it — to reduce the undesirables. Weddington personally had done his part, boasting to Clinton: “I was co-counsel in Roe v. Wade, [and] have sired zero children and one fetus, the abortion of which was recently recounted by my ex-wife in her book.… I had a vasectomy in 1969 and have never had one moment of regret.”\nRon and his wife, Sarah, divorced, bequeathing their gift to the world: zero-population growth (and one aborted baby) from their marriage.\nRon must have felt slighted when Planned Parenthood feted his wife (but not him) with its highest honor, its coveted Sanger Award — a grace also bestowed on Bill Clinton’s wife, Hillary Rodham Clinton.\nAnd most of all, Weddington must have been thrilled when Bill Clinton nominated Ruth Bader Ginsburg to the high court the next year. Ruth seemed to be channeling Ron as well as the ghost of Maggie Sanger when she preached the no-population-growth gospel to the New York Times in July 2009: we don’t want too many of them types.\nNow that’s the progressive spirit!\nAnd what of the pro-life spirit?\nWell, there are before President Donald Trump right now several excellent Supreme Court candidates who appear to be pro-life and represent the anti-Ruth Ginsburg view. Among them, one potential candidate embodies it more than any other on Trump’s list: Amy Coney Barrett.\nNot only is Barrett pro-life, but she has seven children. What would the likes of Ruth Bader Ginsburg — and Planned Parenthood and Ron Weddington and the New York Times — think of that from a woman on the Supreme Court?\nIt’s actually an interesting question, with perhaps a more complex answer. Because of Barrett’s education and social status, the likes of Sanger might not have targeted her and her children as defective morons. And as for Ginsburg, it might be pointed out that Barrett is not on Medicaid, and probably isn’t part of what Ginsburg had in mind when she spoke of “growth in populations that we don’t want to have too many of.”\nIf Donald Trump picks Amy Coney Barrett as his Supreme Court nominee, it would be maybe his boldest and most brilliant political-cultural move. It would make a vote for Trump in 2020 almost irresistible to Never Trumpers whose primary concern with Trump was moral-cultural. And if Trump picks Barrett, among the first people solicited for comments should be Barrett’s potential senior-most colleague on the high court. Justice Ginsburg should be asked if Barrett is among those who should have limited her reproduction.\nWhat do you say, Justice Ginsburg? It is a literal question of life vs. death.","url":"https://spectator.org/amy-coney-barrett-vs-ruth-bader-ginsburg/"}
