{"authors":["Becky Freeth For Mailonline"],"date_download":"2018-10-22 22:41:14","date_modify":"2018-10-22 22:41:14","date_publish":"2016-01-28 10:54:42","description":"Amy Childs and her cousin Harry Derbidge were a long way from their native Essex during their recent LA break. They spent time soaking up the sun - and taking selfies - on Venice Beach.","filename":"data/vaneerConsumption/AmyChildsjoinscousinHarryDerbidgeforfunintheLAsun.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/10/30A94B0200000578-0-image-a-64_1453977525755.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420682_Amy-Childs-shows-sizzling-bikini-body-black-joins-cousin-Harry-Derbidge-fun-LA-sun_1540248074.html","title":"Amy Childs joins cousin Harry Derbidge for fun in the LA sun","title_page":"Amy Childs joins cousin Harry Derbidge for fun in the LA sun | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Amy Childs and her cousin Harry Derbidge were a long way from their native Essex during their recent LA break.\nFor sizzling redhead Amy, ethereal and beach-ready was the name of the game as she settled into the relaxed vibes on Venice Beach.\nHer male counterpart was giving her a run for her money in the skimpy swimwear department though, and stayed faithful to his minimalistic beachwear habits in tiny, bright shorts.\nScroll down for video\nBeach vibes: Amy Childs (right) and her cousin Harry Derbidge soaked up the sun on Los Angeles' Venice Beach recently\nAmy cut a classic figure in a traditional black two-piece, showing off her trim middle and long legs with confidence.\nThough draping on a chic patterned cover-up, complete with boho babe fringing and wide, billowing sleeves, the former TOWIE star still seemed to tease an eyeful of her ample chest.\nHer fiery hair, though tousled with sea salt waves, was polished and glossy, hanging loose around her shoulders with her shades tipped on her nose for the ultimate Los Angeles look.\nMinimal swimwear: Harry was giving Amy some competition in the minimal swimwear department\nCute twosome: The cousins wrapped arms around each other as they soaked up the sun\nHarry, meanwhile, stuck to his faithful Essex roots and slicked back a long-on-top hairstyle, which was bleached to offset his natural, dark hue.\nThis time though, his beach bronze was no doubt real, thanks to the beaming sun on popular sand spot, Venice Beach.\nAmy and Harry wasted no time in capturing their idyllic day out with phones and digital cameras at the ready.\nHere she is! A proud Harry spun his cousin around to show off her effortless boho babe beach outfit\nThey turned the lens on themselves, capturing selfies with a Baywatch-style lookout tower in the backdrop.\nLater, an adoring Harry took the time to snap his beach babe companion as she used the lifeguard tower as a prop in her improvised shots.\nAmy recently admitted that selfies give her a 'confidence boost,' confessing in an interview with FEMAIL this month: 'I do love a selfie. I think they are great for a little confidence boost!'\n'But to be honest nothing makes me feel better about my body than training hard in the gym and eating well. I have really been fitness focused this year.'\nSelfie time: The duo were on hand with cameras and phones to capture the moment\nLA vibes: Harry faithfully volunteered to capture the star by a lifeguard lookout tower\nPoser: She used the Baywatch style tower as a prop in her impromptu beach shoot\nSo focused is the talented businesswoman that Amy has had little time for love, but her 'patience' may have brought her to new beau Jay Hector.\nAmy and Jay were spotted holding hands in London last week, hinting that things were looking up in the romance department after she ended things for good with Bradley Wright last October.\nOn love, Amy added: 'You just have to be patient and keep the faith. I have been unlucky in love many times yet keep strong as I know something better is always coming. I am a great believer in true love and I am a great romantic at heart.'\nCute twosome: Amy recently said that selfies give her a little confidence boost","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420682/Amy-Childs-shows-sizzling-bikini-body-black-joins-cousin-Harry-Derbidge-fun-LA-sun.html"}
