{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 18:42:27","date_modify":"2018-10-30 18:42:27","date_publish":"2017-03-24 00:23:58","description":"The 35-year-old 'Tranwreck' actress had been set to star in and rewrite Sony's upcoming film based on the popular Mattel doll.","filename":"data/vaneerConsumption/AmySchumerExitsBarbieMovie.json","image_url":"https://media.breitbart.com/media/2016/12/SchumerBarbie.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2017_03_23__1540924947.html","title":"Amy Schumer Exits 'Barbie' Movie","title_page":"Amy Schumer Exits 'Barbie' Movie","title_rss":"NULL","source_domain":"breitbart.com","text":"Amy Schumer has reportedly exited Sony’s live-action Barbie film due to scheduling conflicts\nAccording to the Hollywood Reporter, the 35-year-old Trainwreck star will no longer play the title role in Sony’s upcoming film based on the popular Mattel doll and will no longer write the screenplay.\n“Sadly, I’m no longer able to commit to Barbie due to scheduling conflicts,” Schumer said in a statement. “The film has so much promise, and Sony and Mattel have been great partners. I’m bummed, but look forward to seeing Barbie on the big screen.”\nSchumer had signed on to the project in December, with Deadline reporting that Sony chief Tom Rothman personally pitched the script to the actress. Schumer had reportedly completed a rewrite of the script before her exit.\n“We respect and support Amy’s decision,” a Sony spokesperson said in a statement. “We look forward to bringing Barbie to the world and sharing updates on casting and filmmakers soon.”\nSony is hoping to release Barbie on June 29, 2018, though the film does not currently have a director.\nThe Hollywood Reporter also reported Thursday that Schumer had signed on to star in the dramedy She Came to Me alongside Steve Carell and Nicole Kidman from writer-director Rebecca Miller and OddLot Entertainment.\nThe actress — perhaps best known for her Comedy Central series Inside Amy Schumer — is set to appear next in Snatched, a mother-daughter comedy co-starring Goldie Hawn due out for release May 12.\nSchumer made headlines this week when she took to Instagram to accuse Internet trolls of deliberately tanking the ratings of her Netflix stand-up comedy show, The Leather Special. The stand-up special was flooded with one-star reviews shortly after its release.\nFollow Daniel Nussbaum on Twitter: @dznussbaum","url":"https://www.breitbart.com/entertainment/2017/03/23/amy-schumer-exits-barbie-movie/"}
