{"authors":["Jerome Hudson"],"date_download":"2018-10-30 18:22:03","date_modify":"2018-10-30 18:22:03","date_publish":"2016-09-05 01:19:12","description":"Amy Schumer defended embattled Inside Amy Schumer writer Kurt Metzger, who mocked women who accused a fellow comedian of sexual assault.","filename":"data/vaneerConsumption/AmySchumerDefendsHerComedyShowWriterWhoMockedRapeAccusersHesNotBillCosby.json","image_url":"https://media.breitbart.com/media/2016/09/amy-schumer-book-good-morning-america-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_09_04__1540923723.html","title":"Amy Schumer Defends Her Comedy Show Writer Who Mocked Rape Accusers: ‘He’s Not Bill Cosby’","title_page":"Amy Schumer Defends Her Comedy Show Writer Who Mocked Rape Accusers: ‘He’s Not Bill Cosby’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Actress and comedian Amy Schumer defended embattled Inside Amy Schumer writer Kurt Metzger, who mocked and belittled women who accused fellow comedian Aaron Glaser of sexual assault.\n“Why are these women treating him like he raped someone?” she said of Metzger in an interview, published in Dunham’s “Lenny” newsletter Friday morning. “He’s not Bill Cosby; Kurt has never raped. What he was saying was horrific, and he was being a troll. He can be an Internet troll.”\nMetzger found himself at the center of controversy earlier this year after he posted a series of Facebook messages mocking the multiple women who accused Glaser of rape.\nSchumer, who has had to repeatedly address Metzger’s rants, said:\nFirst I was like, f*ck Kurt. It’s been years that he’s been doing this. He’s one of those guys, like a lot of the guys that I’m friends with, who are degenerates. Kurt was saying this awful stuff, and in previous years, I would be like, “You’ve got to shut up.” He’d be like, “All right.” Then it would kind of go away.\nSchumer continued: “This time, it was just so bad. But also, why are these women treating him like he raped someone? He’s not Bill Cosby; Kurt has never raped.”\nUpset about having to answer questions from the press about Metzger’s controversial comments, Schumer said, “The fact that I had to answer for it … I was like, ‘Ugh, why this week?’ I was like, if there’s scandals, can’t they be about me?”\nMetzger was a writer on Schumer’s Comedy Central show when he made his problematic remarks.\n“I do understand that [Kurt’s actions] would come back to me,” Schumer said:\nI can see myself thinking that if I heard somebody on someone’s staff was doing that. I’d be like, “I wonder how they are going to handle that.” I get it. I get it, and I wasn’t even resentful of the connection. I was resentful of the lack of trust. Like, “Have I earned any good will with you guys? Do you believe that I feel that rape victims should be shamed on the Internet?” Have I built up any sort of good will?\nChiming in on the subject, Dunham said, “I don’t think anyone should be a troll on the Internet, but I also get crazy about the idea of trigger warnings because a book isn’t what I have a problem with. What I have a problem with is actions in the world. I understand that art and public figures teach people how to behave, but I want to be outraged about what’s truly happening because it’s always happening.”\nIt is this same interview that made Dunham the subject of intense criticism on social media Friday over her attributing sexist comments to NFL player Odell Beckham Jr. she said he made while they were in attendance at the Met Gala earlier this year. The problem is, however, Beckham never made the comments because Dunham and Beckham did not interact with each other during the time the actress describes.\nFollow Jerome Hudson on Twitter @jeromeehudson.","url":"https://www.breitbart.com/entertainment/2016/09/04/amy-schumer-defends-comedy-show-writer-mocked-rape-accusers/"}
