{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 03:11:22","date_modify":"2018-10-23 03:11:22","date_publish":"2016-01-28 18:36:16","description":"It seems things are getting pretty serious between Amy Schumer and Ben Hanisch as the couple have become parents...to a pet dog - she posted a pic of the pair on Instagram on Wednesday.","filename":"data/vaneerConsumption/AmySchumerrevealsshehasadogwithboyfriendBenHanisch.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30A4B8D500000578-0-image-a-39_1454006154321.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421464_It-s-girl-Amy-Schumer-reveals-boyfriend-Ben-Hanisch-proud-parents-adorable-pet-pooch_1540264282.html","title":"Amy Schumer reveals she has a dog with boyfriend Ben Hanisch","title_page":"Amy Schumer reveals she has a dog with boyfriend Ben Hanisch | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They have been dating for a matter of months.\nBut it seems things are getting pretty serious between Amy Schumer and Ben Hanisch as the couple have become parents...to a pet dog.\nThe actress posted a photo of herself and her beau on Wednesday holding an adorable pooch.\n'It's a girl': Amy Schumer posted a photo of herself and her beau Ben Hanisch on Wednesday holding an adorable pooch\nShe captioned the shot: 'It's a girl.'\nThey both looked delighted as they cuddled the cutie.\nThe pair have been getting busy on social media recently - on Tuesday Ben, 29, posted a photo of them both in scrubs, apparently filming scenes for her Comedy Central series Inside Amy Schumer\n‘Yesterday’s surgery went very well,’ he wrote in the caption.\nSee more of the latest on Amy Schumer as she reveals she has a dog with her boyfriend\nCovered in blood: Amy, and boyfriend Ben were seen in this shot together dressed in scrubs in a photo he posted to Instagram on Tuesday\nHis day job is as a furniture designer.\nThe blonde comedienne wore blue scrubs while her furniture designer beau opted for green attire.\nThe 34-year-old actress had a huge grin across her face as she wore an eye patch over her left eye while an unlit cigar hung out of her mouth. A white medical face mask was draped around her neck.\nHanisch had a shocked expression while his face mask hung around his neck as well.\nThe couple was spotted out together on Thursday morning as Schumer bundled up in a winter coat but left her legs out in the cold to freeze.\nBrrraving the cold! The couple was spotted out together on Thursday morning as Schumer bundled up in a winter coat but left her legs out in the cold to freeze\nLeading lady: She hinted at a bit of cleavage in the black puffer coat as Hanisch followed behind, ever the gentleman\nLeggy display: The Trainwreck star donned a knee-length pencil skirt, which showed off her legs and she wore fashionable snow ankle boots for the outing\nShe hinted at a bit of cleavage in the black puffer coat as Hanisch followed behind, ever the gentleman.\nHer silky light locks were swept back into a high ponytail with a few whisps around her face for an added feminine touch.\nThe Trainwreck star donned a knee-length pencil skirt, which showed off her legs and she wore fashionable snow ankle boots for the outing.\nThe couple were also seen together on Wednesday morning as they appeared to be on a coffee run before heading to set in New York City.\nBen declared his devotion to the pretty blonde on Friday when he shared a black and white photo of her gazing out of an airplane window and the caption: 'When you find her, risk everything.'\nCoffee run: The couple were pictured together on Wednesday morning as they walked through the New York City snow","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421464/It-s-girl-Amy-Schumer-reveals-boyfriend-Ben-Hanisch-proud-parents-adorable-pet-pooch.html"}
