{"authors":["Becky Freeth For Mailonline"],"date_download":"2018-10-23 00:32:56","date_modify":"2018-10-23 00:32:56","date_publish":"2017-04-26 10:16:00","description":"Amy Schumer suffered a slight fall from grace on Tuesday night when she was left scratching her head as her invite to the 2017 gala seemed to get lost in the post because she was sitting at home.","filename":"data/vaneerConsumption/AmySchumermissesoutonTime100galainvite.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F9D73A900000578-0-image-a-64_1493196135939.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446738_Confused-Amy-Schumer-misses-Time-100-gala-invite_1540254776.html","title":"Amy Schumer misses out on Time 100 gala invite","title_page":"Amy Schumer misses out on Time 100 gala invite | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She was a guest of honour two years ago, invited as one of Time 100's 'most influential people'.\nBut Amy Schumer suffered a slight fall from grace on Tuesday night when she was left scratching her head as her invite to the 2017 gala seemed to get lost in the post.\nHer appearance in 2015 caused quite a stir - but for all the wrong reasons - when she hilariously fell down in front of red carpet royalty Kim Kardashian and Kanye West.\nScroll down for video\nConfused: Amy Schumer shared her confusion on Tuesday night as she missed out on an invite back to the TIME 100 Gala, two years after spectacularly showing up Kim Kardashian and Kanye West (pictured) with a red carpet fall\n'Little confused why I haven't been invited back to #time100gala,' she wrote, not-so subtly posting a flashback of the amusing prank on Instagram while sat at home, bemoaning her omission from the guest list.\nAmy's antics saw stone-faced Kim and Kanye blatantly side-step the drama, not even turning a blind eye to her dramatic fall.\nThe comedienne even had to pick herself up when Kim's now-dismissed bodyguard Pascal Duvier looked on and laughed.\nWho, me? Amy acted innocent on the night, playing the fool in front of the cameras\nLittle confused: She took to Instagram with a post joking about why she wasn't invited back\nFans will know that beefcake Pascal was dramatically dropped last year when he was absent from Kim's hotel room in Paris during the terrifying $11m jewellery heist.\nAt the time, Amy joked that she 'couldn't help herself' when she realised that Kim and Kanye were stealing her limelight.\nAfterwards, Amy insisted that Kim 'was' concerned for her welfare and claims to have heard her asking, 'Oh my god, does this girl need help?'\nThough unfortunately, at the very infancy of her comedy career, nobody seemed to know who Amy was.\nJoker: Amy picked herself back up, with no hand from Kim's now-dismissed bodyguard Pascal Duvier (left)\nThey're friends really: Amy and Kim proved they are still good friends, after all, as they posed inside the event\nShe told BBC chat show host Graham Norton months after: 'Journalists were looking past me to see if someone more important was behind me.\n'So all the reporters went crazy for Kim and Kanye and I've always thought falling over is the funniest thing, so I took a dive in front of them. I couldn't help myself.\n'They didn't crack a smile which confirms they had no idea who I was, which is a relief.'\nShe later went on to tell BBC Radio 1's Scott Mills: '[Kim and Kanye] knew I was an idiot and I completely respect their reaction.\nOopsie: Amy later insisted that Kim did ask if she was ok\n'This girl sucks': Amy said that she believed Kim and Kanye were thinking 'This girl sucks'\n'I don’t think they said anything. I think they looked at each other like, “Let’s get out of here. This girl sucks.\"'\nThis year, the prestigious event honoured actor Ryan Reynolds as Time's most influential.\nHer was there with gorgeous wife Blake Lively, and they kept company with Chrissy Teigen and other half John Legend.\nKim and Kanye were this time absent too, thanks to Kim's luxury girls' vacation in Mexico with sister Kourtney Kardashian.\nArm candy: Ryan Reynolds brought his beloved Blake Lively along to the Time 100 Gala where he was honored among the world's 'most influential'\nDouble date: They kept good company with John Legend (left) and his wife Chrissy Teigen","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446738/Confused-Amy-Schumer-misses-Time-100-gala-invite.html"}
