{"authors":[],"date_download":"2018-10-23 00:54:47","date_modify":"2018-10-23 00:54:47","date_publish":"2016-03-08 00:00:00","description":"At the height of her addiction to heroin, Tracey Helton Mitchell lived in an alley and sold her body. Now she works as an addiction specialist helping others. Her new memoir is The Big Fix.","filename":"data/vaneerConsumption/AnAddictNowCleanDiscussesNeedleExchangesAndHopeAfterHeroin.json","image_url":"https://media.npr.org/assets/img/2016/03/08/needles_wide-33602dcd8ef2ee9f2d3797780adcec7f656837ef.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2016_03_08_469585044_an-addict-now-sober-discusses-needle-exchanges-and-hope-after-heroin_1540256087.html","title":"An Addict, Now Clean, Discusses Needle Exchanges And 'Hope After Heroin'","title_page":"An Addict, Now Clean, Discusses Needle Exchanges And 'Hope After Heroin' : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"An Addict, Now Clean, Discusses Needle Exchanges And 'Hope After Heroin'\nWhen she was 17, Tracey Helton Mitchell was prescribed an opioid pain killer after getting her wisdom teeth extracted. The medicine helped her deal with the pain related to the extraction, but when the prescription ran out, her desire for its euphoric high remained. That's when she turned to heroin.\nAs a teenager, Mitchell imagined heroin to be glamorous, but she found it wasn't once she became an addict. She tells Fresh Air's Terry Gross that the drug ruined her health and her self-esteem. She lived in an alley, shot drugs into the bottom of her feet, sold her body for money and was jailed several times. She was also featured in a 1999 documentary about addicts called Black Tar Heroin.\nAt one of her lowest points, Mitchell says, \"I was having heart palpitations, because I was using stimulants, and I thought, 'They're going to pull me out of this hotel, I have no ID, my parents, my family ... will never know that I died and I'll just be a Jane Doe and this is how I'm going to expire in this place.' \"\nBut Mitchell didn't die from her addiction. Rather, with the help of the secular program LifeRing and other support groups and therapies, she eventually stopped using and became a certified addiction specialist. She has been clean for 18 years.\nIn her new memoir, The Big Fix, Mitchell writes about her addiction and her path to recovery, and also shares insights into today's heroin epidemic. When it comes to our current treatment system, Mitchell says we would do better to reach out to addicts as individuals, by recognizing each user's unique needs and motivations.\nOur current method of treatment is \"sort of a one-size-[fits]-all approach,\" she says. \"We need to have a variety of different kinds of treatment interventions that address people's needs.\"\nInterview Highlights\nOn what it's like to watch Black Tar Heroin now that she's clean\nIt can be painful to watch, especially when I think about my life now and I contrast that. ... My legs did look like I was dropped in a dumpster and picked out by rats. I had, I think, 34 or 36 abscesses. I have scars that have healed, but I had to have surgeries on some and in the summertime when everybody else is wearing shorts and stuff like that, I see those things — even right now sitting here at the table I can see one of the scars on my arms. It's a good thing in that it reminds me of where I was, but then it's also very challenging, because this documents a very unpleasant part of my life that can't be changed.\nOn why she agreed to be filmed\nI really believed that I was going to die, or be murdered. There was lots of evidence to make me feel that way, and I wanted it to be something that people would see after I was dead that showed that heroin was not the glamorous thing that I had thought it was when I was a teenager and had imagined it. I wasn't paid for the film; it was a huge inconvenience in my life, but I feel like it still is sort of my legacy to the world, because it's something that's watched today. Millions of people still watch it.\nOn black tar heroin in the '90s versus heroin today\nThere's still tar heroin. The heroin that most people get today is much, much stronger. We didn't have to worry about fentanyl — of us dropping dead from an overdose, because no one cut it with fentanyl. The thing that we really worried about was getting flesh-eating [bacteria, necrotizing fasciitis] ... or getting some kind of wound botulism or getting abscesses. There certainly were overdoses then. You could get arrested for overdosing and a lot of people were rolled out at the hospitals or left outside to die ... but there wasn't this culture of heroin where heroin is prevalent absolutely everywhere. It was more localized to big cities, more urban areas.\nOn 'hitting bottom'\nEnlarge this image toggle caption Michael Kerner Photography/Seal Press Michael Kerner Photography/Seal Press\nI don't believe in the concept of a bottom. I think that if the opposite of addiction is connection, that addicts or people who use drugs are really seeking out — they need some kind of connection with people. And I would say I've had a wide variety of bottoms, but I wasn't ready to stop until I started to believe that there was a possibility that I actually could stop and saw reasons for myself to stop, and my motivation is totally different.\nOn being ready to get clean\nOne of the myths about addiction is that you come to this incredible moment of clarity and that you decide that you're going to stop. And so over the course of my using I had various moments of clarity and I had various points where I had wanted to stop, but they were not always congruent with my opportunities.\nSo there [were] very few opportunities where I really could truly try to stop, but I would stop using for a few days, I'd try to kick on my own, I'd switch to different drugs, I'd move to different places. I tried different things to stop, but I wasn't completely ready, because all these different traumas had accumulated in my life, and I wasn't prepared to deal with the emotional consequences of all these different things. And that's what to me being off drugs meant — was that I would have to then figure out how I was going to fix all these things on my own. And it wasn't until I got an idea that maybe other people would help me, talking to my mother, knowing that I would have some kind of emotional support where I'd start seeing [that] maybe I don't have to totally do all of this on my own.\nOn needle exchange programs\nAt the time there was no needle exchange at all [in Cincinnati] and so you would use the same syringe over and over again and hopefully it didn't break off in your arm. Until the numbers wore off of it, you would sharpen it on a matchbook, and it was just horrible; it was like a rusty nail sticking in your arm.\nSo I came to San Francisco and they had needle exchanges, which was a revelation, because so many people in the country were suffering from HIV and AIDS, particularly AIDS, because there was no anti-retrovirals. ... So the syringe exchange people provided me education about my drug use. ...\nI've seen in my life so many examples of where not having a clean syringe never stopped anyone. I've seen people pick them up out of the gutters. Even here in San Francisco, where there's a lot of access, people break open sharps containers that they've stolen from hospitals because they needed a syringe and they don't have one. ... It doesn't stop people. All it does is spread a public health crisis.\nOn harm reduction and the argument that harm reduction enables users\nMy answer is, you can't get clean if you're dead, so there has to be harm reduction. We're not encouraging people to do anything, we're taking a look at their public health behaviors and then addressing what the particular needs are, so look at the cost of one syringe versus the cost of someone getting hepatitis C and having to take care of them for a lifetime.\nLook at the public health cost of various other medical conditions that a person can have. From not using sterile water or alcohol pads, someone having endocarditis or some other infection, so having a safe system for people to take care of themselves and treating addicts, users not just addicts, there's plenty of people who use who are not necessarily considered on the spectrum of drug addicts, treating people humanely and having them have access to public health services and the things that they need.\nOn coping with depression since becoming clean\nPart of the reason why I wanted to write The Big Fix is because I felt like there's no ... real education on long-term recovery about what really happens over time. So dealing with topics like untreated depression and anxiety and all the other kind of things that you go through when you take the drugs away, and then you have new issues, because before you use drugs, you didn't have all these guilty, shameful things that you ... now have to deal with, if you're a person like me and you get off drugs.\nSo I've had a very complicated relationship with my emotions in the past 18 years that I've been clean. I've dealt with very serious post-traumatic stress disorder, being very checked out and dissociative at various points, having to deal with the constant specter of depression, every once in a while having suicidal thoughts. And one of the things that I try to do is really normalize those feelings when people want to know what recovery is really like. It's like, some days you really feel crappy. You really have some things that are going on with you, and I think the prevalent idea is that you get clean and everything is supposed to be great. ... You can have a great life and still not feel all that great.","url":"https://www.npr.org/sections/health-shots/2016/03/08/469585044/an-addict-now-sober-discusses-needle-exchanges-and-hope-after-heroin"}
