{"authors":[],"date_download":"2018-10-22 22:59:15","date_modify":"2018-10-22 22:59:15","date_publish":"2014-06-10 18:21:30","description":"It should be the country's moment to shine. Instead, the spotlight is exposing major problems on the eve of the tournament.","filename":"data/vaneerConsumption/AnalysisBrazilScramblestoGetReadyasWorldCupLooms.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/501271/140611-brazil-sao-paulo-traffic-5a_65c2b6d5b0f2e4cc12e00ef176431609.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_world-cup_analysis-brazil-scrambles-get-ready-world-cup-looms-n127571_1540249155.html","title":"Analysis: Brazil Scrambles to Get Ready as World Cup Looms","title_page":"Analysis: Brazil Scrambles to Get Ready as World Cup Looms","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSAO PAULO, Brazil - Brazil playing host to the planet’s biggest single sporting tournament should be the country's moment to shine.\nInstead, the spotlight is exposing major problems on the eve of soccer's World Cup.\nBrazil will welcome the players and fans to unfinished airports, drive them past uncompleted transport systems, through streets that have been clogged with rioters protesting the cost of the tournament and into stadiums that have cost lives to build and haven’t all been finished.\nSign up for breaking news alerts from NBC News\nOpinion polls suggest more than half the country’s population wish their homeland had never been awarded the tournament and that six in 10 people believe hosting the cup will be bad for Brazil.\nSoccer’s world governing body, FIFA, isn’t impressed either. Its two top officials have described preparations as the worst ever and dealing with Brazilian authorities as “hell.”\nWhat went wrong? Brazil simply over-promised after it was chosen in 2007 and has now under-delivered.\nWorkers are still scrambling to finish five of the 12 stadiums that will play host to matches. The stadium in Brazil’s biggest city, Sao Paulo — which will stage the opening match on Thursday — was supposed to have been finished last December. It’s still being readied, and the planned roof won’t be finished on time. Temporary seats for 20,000 fans have now received safety clearance from firefighters; they have never been tested during a full game.\nThree workers died building the stadium. A worker was killed Monday in an accident on the prestigious monorail project in Sao Paulo, which was due to be done in time for the World Cup. In all, eight men have died building the 12 grounds.\nOrganizers have shelved much of the infrastructure they promised, from roads to a high-speed train between Sao Paulo and Rio de Janeiro. Just five of the 35 planned urban-mobility rail schemes are complete. Fans will use buses and taxis to get to city centers and games, not the promised metro lines.\nIn Natal, where the U.S. team will play its first game on Monday, half the infrastructure projects planned for the cup weren’t even started.\nBrazil’s president opened a new terminal at Sao Paulo airport to great fanfare this month, but it will handle only a fraction of the airlines originally scheduled to land there. The new airport terminal promised in Fortaleza has been delayed until 2017.\nThis is already the most expensive World Cup in history, estimated at $11.5 billion. The stadiums cost twice as much as the last two tournaments combined. Brazil now boasts 10 of the world’s 20 costliest soccer arenas, according to consultancy KPMG.\nWhy? Well, not because of their world-class facilities. Look for the answer instead in the millions suspected to have been skimmed off by developers, or the millions more that appear to have simply disappeared.\nThe costliest of these grounds is in Brasilia, a stadium that has cost $900 million, triple the original estimate, making it the second most expensive stadium in the world. It will be a white elephant in a month’s time, as the city doesn’t even have a professional major league team.","url":"https://www.nbcnews.com/storyline/world-cup/analysis-brazil-scrambles-get-ready-world-cup-looms-n127571"}
