{"authors":["Associated Press"],"date_download":"2018-10-22 22:03:12","date_modify":"2018-10-22 22:03:12","date_publish":"2016-01-29 08:43:52","description":"TOKYO (AP) — As North Korea awaits the United Nations' response to its purported first H-bomb test, Washington is believed to be floating measures that could...","filename":"data/vaneerConsumption/AnalysisUSfacesresistancefortoughsanctionsonNKorea.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:ec733d17ae2144289076615e98ec410a-4PuZeKVXE7cd9005b2c87673012e-276_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422303_Analysis-US-faces-resistance-tough-sanctions-NKorea_1540245792.html","title":"Analysis: US faces resistance for tough sanctions on NKorea","title_page":"Analysis: US faces resistance for tough sanctions on NKorea | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Analysis: US faces resistance for tough sanctions on NKorea\nTOKYO (AP) — As North Korea awaits the United Nations' response to its purported first H-bomb test, Washington is believed to be floating measures that could cause it some serious problems. They range from a ban on selling the North oil or buying its minerals to excluding banks doing business with it from accessing the dollar-based economy or even barring its flagship airline from entering other countries' airspace.\nAccording to some, such measures, if strictly implemented, could together be harsh enough to destabilize North Korea's ruling regime — and that's exactly why it would be a big surprise if they are on the U.N.'s final list.\nEvery major power in the region has good reason to want to keep North Korea from becoming a credible nuclear threat.\nFILE - In this Oct. 10, 2015, file photo, North Korean leader Kim Jong Un delivers remarks at a military parade in Pyongyang, North Korea. As North Korea awaits the United Nations¿ response to its purported first H-bomb test, Washington is believed to be floating measures that could cause it some serious problems. They range from a ban on selling the North oil or buying its minerals to excluding banks doing business with it from accessing the dollar-based economy or even barring its flagship airline from entering other countries¿ airspace. (AP Photo/Wong Maye-E, File)\nBut China, which would have to be fully on board to make such sanctions work, has deep misgivings about the wisdom of really tough moves. Russia, no fan of U.S. foreign policy initiatives, has been moving closer to, not farther away from, the regime in Pyongyang. Even South Korea, which arguably has the most to lose if its northern neighbor's nuclear program moves ahead unchecked, appears to be hesitant about taking drastic measures, such as shutting down its lucrative joint venture industrial zone with Pyongyang just north of the Demilitarized Zone.\nThe reason is straightforward.\nApart from the more hard-line thinkers in Washington, virtually no one wants to have to deal with what might happen if concerted international action were to actually destabilize Kim Jong Un's regime, however strongly they may feel about its human rights record, authoritarian government and militantly defiant attitude toward Washington, Tokyo, Seoul and anyone else it sees as a threat.\nU.S. Secretary of State John Kerry ran into that wall this week during talks in Beijing with Chinese Foreign Minister Wang Yi. After meeting for more than four hours Wednesday, Kerry expressed his frustration with what the United States sees as China's failure to do more rein in Pyongyang, noting that \"more significant and impactful sanctions were put in place against Iran, which did not have a nuclear weapon than against North Korea, which does.\"\n\"All nations, particularly those who seek a global leadership role, or have a global leadership role, have a responsibility to deal with this threat,\" Kerry said.\nIn response, Wang said China, which is North Korea's most important ally, chief trading partner and a key source of economic assistance, agreed on the need for a new U.N. resolution. But he suggested Beijing would not support new penalties even though it condemned the Jan. 6 test.\n\"Sanctions are not an end in themselves,\" Wang said bluntly. \"The new resolution should not provoke new tension in the situation, still less destabilize the Korean Peninsula.\"\nThe gap between Washington and Beijing was evident in a particularly angry editorial Tuesday by China's official Xinhua news agency, which — using an almost verbatim version of Pyongyang's own take on the issue — put the blame on \"Uncle Sam's uncompromising hostility, manifested in its unceasing defaming, sanctions, isolation and provocation of the DPRK.\"\nIt said the key to resolving tensions with North Korea, officially called the Democratic People's Republic of Korea, lies with the U.S. giving up its \"antagonistic approach wrought from a Cold War mentality.\"\nSo far, sanctions have included bans on weapon sales, dealing with blacklisted individuals or enterprises and other targeted measures. But they have clearly failed to achieve their main purpose — to denuclearize the North.\nThough its economy has been battered, North Korea has nuclear weapons and has now enshrined in its constitution its right to maintain and develop them. The North says they are an indispensable part of its national defense strategy. No country with the possible exception of South Africa that has gone as far down the road as the North to becoming a nuclear power has ever turned back.\nEven so, despite a plethora of sanctions and resolutions that have been thrown at North Korea since its first nuclear test in 2006, Kerry is correct in suggesting that far more action could be taken through sanctions and an enhanced effort to ensure they are strictly enforced by punishing North Korea's \"enablers\" — who are mostly seen as Chinese businesses, state enterprises and entrepreneurs.\nUnilaterally, the U.S. Congress is already moving in that direction.\nLegislation recently passed by the House of Representatives targets any country, business or individual that materially contributes to North Korea's nuclear and ballistic missile development, exports luxury goods to North Korea or engages with Pyongyang in money laundering, the manufacture of counterfeit goods or narcotics trafficking.\nThe Senate Foreign Relations Committee on Thursday approved its own version of the legislation, adding a measure that would target the North's minerals and precious metal exports, a major source of income for Pyongyang and one that Chinese interests are heavily involved in. It is expected to be taken up by the full Senate in the second week of February.\nThe support for tougher measures against North Korea straddles the usually bitter partisan divide in Washington, and there is eagerness in both chambers of Congress to put legislation on President Barack Obama's desk for signature.\n\"We must cut off Kim Jong Un's access to the money he needs to fund his nuclear weapons and ballistic missile programs,\" said Rep. Ed Royce, the Republican chairman of House Committee on Foreign Affairs and a sponsor of the sanctions legislation.\nThe bills reflect a shift in focus in Washington toward what is known as the \"weaponization of finance,\" shutting businesses that deal with the North out of the U.S. financial system and in effect making it impossible for them to make transactions in U.S. dollars.\nWashington has tried that before.\nIn 2005, the U.S. imposed sanctions against a Macau-based bank, Banco Delta Asia, which held about $25 million in North Korean funds. The move was aimed at cutting of funds for North Korea's top leadership, but created a ripple effect in the global financial system amid uncertainty over what dealings might cause banks trouble. It was later lifted to facilitate nuclear talks.\nDoing so more emphatically could have a dramatic impact not only on Kim Jong Un's pocketbook but also on Chinese banking and business interests. And if done as an end run around the U.N. they could push Beijing and Washington into a more adversarial position, making coordinated implementation all the more unlikely.\n\"If major players in the Chinese financial system are exposed to U.S. sanctions, people have to consider what happens to the U.S., Chinese and global economies,\" Joseph DeThomas, a professor of international affairs at Pennsylvania State University and former U.S. deputy assistant secretary of state for non-proliferation, wrote in a recent op-ed for 38 North, an influential website focusing on North Korea issues.\n\"'Regime threatening sanctions' are very blunt and powerful instruments,\" he wrote. \"They are final cards to be played before diplomacy ends and other bloodier means are employed to solve problems. It may not be wrong to let others know that such a card could be played, but it would be wise not to play it frivolously.\"\n___\nTalmadge has been AP's Pyongyang bureau chief since 2013. AP writers Christopher Bodeen in Beijing and Matthew Pennington in Washington contributed to this report.","url":"https://www.dailymail.co.uk/wires/ap/article-3422303/Analysis-US-faces-resistance-tough-sanctions-NKorea.html"}
