{"authors":["Associated Press"],"date_download":"2018-10-22 20:58:57","date_modify":"2018-10-22 20:58:57","date_publish":"2016-01-28 05:35:34","description":"PHILADELPHIA (AP) — More white Americans now share the view, long held by minorities, that racism is a national problem and should be confronted, according t...","filename":"data/vaneerConsumption/Analysisofracialpollingshowswhitesmoreawareofracism.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:d1a7d4970bcf49139025cf8b4c414aa6-4vVdYopwYQ7f641721b07a926e8c-105_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420113_Analysis-racial-polling-shows-whites-aware-racism_1540241937.html","title":"Analysis of racial polling shows whites more aware of racism","title_page":"Analysis of racial polling shows whites more aware of racism | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Analysis of racial polling shows whites more aware of racism\nPHILADELPHIA (AP) — More white Americans now share the view, long held by minorities, that racism is a national problem and should be confronted, according to an analysis of recent public opinion polling.\nThe review, compiled by the W.K. Kellogg Foundation in conjunction with the Northeastern University School of Journalism, concludes that a majority of Americans across racial groups think more should be done to end racism. To that end, the foundation announced Thursday that it is launching a \"Truth, Racial Healing and Transformation Commission\" to discuss solutions for ending systemic inequality based on race.\nMedia coverage, combined with technology, has helped to make a powerful case for racial bias being more of an abiding pattern than a snapshot of any given moment in time, said Jonathan Kaufman, director of Northeastern's journalism school.\nFILE - In this Nov. 4, 2008 file photo, President-elect Barack Obama and his family wave to supporters as they arrive for his election night party at Grant Park in Chicago. More white Americans now share the view, long held by minorities, that racism is a national problem and should be confronted, according to an analysis of recent public opinion polling. W.K. Kellogg Foundation analysis, obtained by The Associated Press, notes that since President Barack Obama's election in 2008, polls have shown an overall decrease in the number of people who believe race relations are \"very or fairly good.\"(AP Photo/Alex Brandon)\n\"When whites see injustice, they're human, and they understand what it's like to be afraid,\" Kaufman said. \"I think that cuts through people's prejudices and makes them think twice.\"\nKellogg's analysis, obtained by The Associated Press, notes that since President Barack Obama's election in 2008, polls have shown an overall decrease in the number of people who believe race relations are \"very or fairly good.\" In January 2009, a Wall Street Journal/NBC poll showed 79 percent of whites, 76 percent of blacks and 64 percent of Hispanics held that view. The same poll seven years later showed 33 percent of whites, 26 percent of blacks and 38 percent of Hispanics felt the same way. A similar Gallup poll showed a 10-point drop for blacks and 35-point drop for whites on the state of race relations between 2008 and 2015.\nThe increased use of technology in documenting racial incidences — such as in the killings of unarmed black males by police — has helped drive new attitudes among whites about the realities of racism in America, researchers found.\nNew York Times/CBS polling in 1995 showed only 15 percent of whites believed the criminal justice system was biased against blacks, compared to 51 percent of blacks. By 2015, that number had risen to 44 percent of whites and 77 percent of blacks. Polls from CNN/Kaiser Family Foundation and Gallup showed an increase in the number of whites who believe the criminal justice system is biased against black people.\nAn Associated Press-NORC Center for Public Affairs Research poll conducted in July 2015 found that 47 percent of whites said police sometimes treat minority groups more roughly — compared to 81 percent of blacks who felt the same way — and 52 percent of whites think police treat all races and ethnic groups equally. In the same poll, 45 percent of whites said poor relations between police and the public they serve is a major reason for police violence against civilians, compared to 73 percent of blacks.\nThe Kellogg Foundation, one of the country's largest philanthropic organizations, was started by the breakfast cereal pioneer in 1930. In recent years, the foundation has focused on efforts to promote racial equity and has committed $300 million a year to advocate groups to address racial disparities for children of color.\nKellogg is committing $35 million over seven years to the commission, which is based on other such efforts implemented in countries like South Africa after the end of apartheid and on a local level in the U.S. It is the first such national initiative since President Bill Clinton commissioned a national conversation on race in 1997.\n\"We're seeing an unprecedented moment in time where the human will is in a place ... for an opportunity for greater shared learning and understanding of one another, a space to create conversation and action,\" said Kellogg president and chief executive officer La June Montgomery Tabron.\nOver the next four to six months, more than 70 partner organizations will discuss the commission's design and create working groups focused on issues like employment, health, segregation and housing, Tabron said.\nKellogg's analysis was done taking comparative polling data over the past two decades from CNN/Kaiser Family Foundation; PBS NewsHouse and Marist College's Institute for Public Opinion; The New York Times/CBS; The Wall Street Journal/NBC News; The Pew Research Center and Gallup. Poll questions were not identical, but researchers considered them similar enough to draw conclusions and identify trends.\n_____\nAP-NORC poll: http://www.apnorc.org/PDFs/Police%20Violence/Issue%20Brief_PoliceFinal.pdf\n_____","url":"https://www.dailymail.co.uk/wires/ap/article-3420113/Analysis-racial-polling-shows-whites-aware-racism.html"}
