{"authors":["Breitbart News"],"date_download":"2018-10-30 20:53:00","date_modify":"2018-10-30 20:53:00","date_publish":"2015-04-05 19:41:41","description":"The high-octane \"Furious 7\" peeled out of the gates in its opening weekend, picking up a stunning $143.6 million from 4,004 locations to easily top the domestic box office, according to Rentrak estimates Sunday. |","filename":"data/vaneerConsumption/AnalystFurious7CouldAchieveSeriesFirstBillionDollarBoxOfficeHaul.json","image_url":"https://media.breitbart.com/media/2015/04/furious7-trailer.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_04_05__1540932780.html","title":"Analyst: 'Furious 7' Could Achieve Series' First Billion-Dollar Box Office Haul","title_page":"Analyst: 'Furious 7' Could Achieve Series' First Billion-Dollar Box Office Haul | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"LOS ANGELES (AP) — The high-octane “Furious 7” peeled out of the gates in its opening weekend, picking up a stunning $143.6 million from 4,004 locations to easily top the domestic box office, according to Rentrak estimates Sunday.\nThe expectation-shattering sum is a studio and franchise best for the homegrown car-obsessed series, which has continued to grow over the past few films.\n“Furious 7,” now the ninth-biggest opening of all time, also unseats previous April record-holder “Captain America: The Winter Soldier,” which opened to $95 million on the same weekend last year.\nWhile the “Fast and Furious” films have grown in popularity over the past three films, the mega-opening for “Furious 7” was also at least partially tied to audience interest in star Paul Walker, who died in a car crash in Nov. 2013 before the film was completed.\nProduction on “Furious 7” was halted while the filmmakers and Universal decided whether or not to proceed with the film. The team ultimately decided to delay the release from its originally scheduled July 2014 date.\n“It probably created some curiosity, but, at the same time, (the film) fits in so well with the overall continuing saga of the `Fast and Furious’ franchise,” Nick Carpou, Universal’s president of domestic distribution, said of Walker.\n“It’s a motivator, but it’s not by any means the prime motivator the see the movie,” he added.\nThere is also a sense that massive openings like “Furious 7” point to the creeping of summer blockbuster season, which seems to be starting earlier and earlier as studios try to stake their claim on prime dates.\nBut for Carpou, in a 52-week-a-year release strategy, the demarcation of a summer blockbuster is almost irrelevant when it comes to getting audiences to turn out in droves for a film.\n“It’s that corny old adage that if you build it, they will come,” he said, adding that the impressive February debut of “Fifty Shades of Grey” helps prove his point.\nPaul Dergarabedian, Senior Media Analyst for box office firm Rentrak, thinks that this is a liberating trend for studios who once clamored for the first weekend in May release date.\n“Studios are finding tremendous value in putting their movies in non-traditional corridors,” he said.\nAs the most ambitious release in Universal’s history, “Furious 7” opened on 10,005 screens internationally as well, picking up $240.4 million from 63 territories for a $384 million worldwide debut – a 48 percent increase over “Fast & Furious 6.”\nThe film will also debut in Russia, Poland, Japan, and China in the coming weeks.\nHoldovers populated the rest of the top spots with DreamWorks Animation’s “Home” earning $27.4 to take a distant second place. “Get Hard” brought in an estimated $12.9 million, while “Cinderella” and “The Divergent Series: Insurgent” rounded out the top five with $10.3 million and $10 million, respectively.\nBut it’s all about “Furious 7” for the next few weeks. The film has the roads to itself until Disney and Marvel’s “The Avengers: Age of Ultron” hits theaters on May 1.\n“This could be the first in the franchise to flirt with the billion dollar mark,” Dergarabedian said.\nEstimated ticket sales for Friday through Sunday at U.S. and Canadian theaters, according to Rentrak. Where available, the latest international numbers for Friday through Sunday are also included. Final domestic figures will be released Monday.\n1. “Furious 7,” $143.6 million ($240.4 million international).\n2. “Home,” $27.4 million ($20.7 million international).\n3. “Get Hard,” $12.9 million ($2.6 million international).\n4. “Cinderella,” $10.3 million ($24.3 million international).\n5. “The Divergent Series: Insurgent,” $10 million ($15.5 million international).\n6. “It Follows,” $2.5 million.\n7. “Woman in Gold,” $2 million.\n8. “Kingsman: The Secret Service,” $1.7 million ($20 million international).\n9. “Do You Believe,” $1.5 million.\n10. “The Second Best Exotic Marigold Hotel,” $1 million ($3 million international).\n—\nEstimated ticket sales for Friday through Sunday at international theaters (excluding the U.S. and Canada), according to Rentrak:\n1. “Furious 7,” $240.4 million.\n2. “Cinderella,” $24.3 million.\n3. “Wolf Warriors,” $22 million.\n4. “Home,” $20.7 million.\n5. “Kingsman: The Secret Service,” $20 million.\n6. “Let’s Get Married,” $16 million.\n7. “The Divergent Series: Insurgent,” $15.5 million.\n8. “The SpongeBob Movie: Sponge Out of Water,” $5.8 million.\n9. “Twenty,” $5.3 million.\n10. “Focus,” $4.9 million.\n—\nUniversal and Focus are owned by NBC Universal, a unit of Comcast Corp.; Sony, Columbia, Sony Screen Gems and Sony Pictures Classics are units of Sony Corp.; Paramount is owned by Viacom Inc.; Disney, Pixar and Marvel are owned by The Walt Disney Co.; Miramax is owned by Filmyard Holdings LLC; 20th Century Fox and Fox Searchlight are owned by 21st Century Fox; Warner Bros. and New Line are units of Time Warner Inc.; MGM is owned by a group of former creditors including Highland Capital, Anchorage Advisors and Carl Icahn; Lionsgate is owned by Lions Gate Entertainment Corp.; IFC is owned by AMC Networks Inc.; Rogue is owned by Relativity Media LLC.\n—\nFollow AP Film Writer Lindsey Bahr on Twitter at: www.twitter.com/ldbahr","url":"https://www.breitbart.com/entertainment/2015/04/05/analyst-furious-7-could-achieve-series-first-billion-dollar-box-office-haul/"}
