{"authors":["Lauren Sharkey"],"date_download":"2018-10-31 01:51:30","date_modify":"2018-10-31 01:51:30","date_publish":"2018-08-27 16:41:25","description":"The world of beauty gets weirder by the day. But one of the most bizarre 'trends' to come to light has to be that of the ant manicure. Yes, that's exactly what it sounds like. Dreamed up by Russian salon Nail Sunny, the set of false nails has caused…","filename":"data/vaneerConsumption/AnAntManicureNowExistsPeopleArentExactlyHappyAboutIt.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/6723970b-2218-4b79-ac78-a2f3da9da21a-screen-shot-2018-08-27-at-162528.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_ant-manicure-now-exists-people-arent-exactly-happy-about-it-10245495_1540950690.html","title":"An Ant Manicure Now Exists & People Aren't Exactly Happy About It","title_page":"An Ant Manicure Now Exists & People Aren't Exactly Happy About It","title_rss":"NULL","source_domain":"bustle.com","text":"The world of beauty gets weirder by the day. But one of the most bizarre 'trends' to come to light has to be that of the ant manicure. Yes, that's exactly what it sounds like. Dreamed up by Russian salon Nail Sunny, the set of false nails has caused a predictable stir online.\nThe Moscow-based salon posted a video on Instagram, showing off its latest creation. In it, nail technicians stressed that \"no animals were harmed\" and that the ants were able to breathe despite being trapped in a plastic nail.\nSo how do you even get live ants into a set of acrylics? Well, it's simple. First, a normal set of false nails is applied, followed by a plastic layer which creates a sort of opening at one end. The unsuspecting ants are then found on the ground (where else?), grabbed via tweezers, and inserted into the nail which is then sealed shut using a small section of plastic.\nAs you can clearly see, the ants are forced to move up and down the nail but can apparently still breathe. Obviously, the fact that the animals haven't been physically harmed doesn't mean that they haven't been mentally harmed. I can't imagine that it's particularly nice for an ant to find itself stuck inside a tiny space with no way out.\nMy sentiments were echoed by a lot of Instagram commenters. \"No animals were harmed??? Harm doesn’t equal death. They look really stressed and honestly the nails don’t look cool at all,\" one critic wrote. \"This is disgusting. Taking intelligent little beings and trapping them inside a nail for Instagram likes? Truly pathetic,\" said another.\nSome people took a slightly different stance, reminding others that the human race doesn't mind squashing ants on a daily basis. That may well be true but it still doesn't make it OK to use living creatures for superficial beauty purposes.\nTwitter was similarly disapproving. Although some people made jokes about the manicure, the general consensus was that ants don't belong in your nails. Full stop.\nThis isn't the first time that Nail Sunny's manicures have drawn attention to the salon. Those creepy baby feet nails? Those were designed by Nail Sunny. Coffee-inspired talons? Nail Sunny. Acrylics in the shape of Kylie Jenner holding baby Stormi? You guessed it. Nail Sunny.\nAside from the above truly wacky designs, the Russian salon can be commended for its other innovative nail art. If you're a fan of bananas, high heels, or hot dogs, you're in luck. Nail Sunny can have the entire trio on your nails with no problem.\nI have a few questions for the people working at this truly unique salon. One: Who comes up with these ideas? Do you pick random words out of a box or is it all the work of one creative individual? Two: Do people actually ask for nails like these? Or does Nail Sunny literally pay customers to have such weird things on their hands? And three: How the hell do you do it?\nI've contacted the salon for comment but am yet to hear back. But I really really really need answers.","url":"https://www.bustle.com/p/ant-manicure-now-exists-people-arent-exactly-happy-about-it-10245495"}
