{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 21:01:08","date_modify":"2018-10-30 21:01:08","date_publish":"2018-07-23 14:48:12","description":"A large boulder from the Western Wall was dislodged from the ancient structure on Monday, tumbling down onto an egalitarian prayer platform.","filename":"data/vaneerConsumption/AncientBoulderDislodgesfromWesternWallCrashesPrayerPlatform.json","image_url":"https://media.breitbart.com/media/2018/07/western-wall.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2018_07_23__1540933268.html","title":"Ancient Boulder Dislodges from Western Wall, Crashes Prayer Platform","title_page":"Ancient Boulder Dislodges from Western Wall, Crashes Prayer Platform | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Times of Israel reports: A large boulder from the Western Wall was dislodged from the ancient structure on Monday morning, tumbling down onto an egalitarian prayer platform.\nThere were no injuries in the incident near Robinson’s Arch, south of the main prayer plaza, but the rock landed very close to a female worshiper.\nשֶׁגְּמָלַנִו כָּל טוּב. אסון כבר נמנע הבוקר בעזרת ישראל. אבן ניתקה מהכותל והתרסקה על מרפסת התפילה (הקטנה). אנשי רשות העתיקות מטפלים באירוע. עד להודעה חדשה המרפסת תיסגר, רחבת עזרת ישראל תפעל כרגיל. זהו אות השכמה-יש לבדוק את הכותל כולו,על שני חלקיו,כדי שחלילה לא יהיה אסון בעתיד. pic.twitter.com/UslGD0ubew — Yizhar Hess יזהר הס (@yizhar_hess) July 23, 2018\n“I didn’t hear or feel anything until it landed right at my feet, ” said Daniella Goldberg, 79. She said she was praying at the site, as she does regularly, when suddenly the boulder crashed down. She told Hadashot TV news she “tried not to let the incident distract me from my prayers” and refused to be drawn on whether divine providence had spared her. “May we all be blessed,” she said.\nRead more here.","url":"https://www.breitbart.com/middle-east/2018/07/23/ancient-boulder-dislodges-from-western-wall-crashes-prayer-platform/"}
