{"authors":["Tom Murphy"],"date_download":"2018-10-30 21:26:19","date_modify":"2018-10-30 21:26:19","date_publish":"2017-03-01 00:00:00","description":"Arkansas Razorbacks Coach Mike Anderson talked up his team's NCAA Tournament credentials Wednesday night after a 78-65 loss left his team 6-3 in SEC road games.","filename":"data/vaneerConsumption/AndersonsaysHogsintop64.json","image_url":"https://media.arkansasonline.com/img/photos/2017/03/01/AP17061092430835_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_mar_02_anderson-says-hogs-in-top-64-20170302__page=1_1540934779.html","title":"Anderson says Hogs in 'top 64'","title_page":"Anderson says Hogs in 'top 64'","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Arkansas coach Mike Anderson signals to his team during the second half of an NCAA college basketball game against Florida in Gainesville, Fla., Wednesday, March 1, 2017. Florida won 78-65. (AP Photo/Ron Irby)\nGAINESVILLE, Fla. -- Arkansas Razorbacks Coach Mike Anderson talked up his team's NCAA Tournament credentials Wednesday night after a 78-65 loss left his team 6-3 in SEC road games.\n\"We're certainly one of the top 64 teams in the country,\" Anderson said.\nThe University of Arkansas at Fayetteville is projected to be in the NCAA Tournament field by virtually all national analysts. The Razorbacks (22-8, 11-6), who had a five-game winning streak snapped by the Gators, will wrap up the regular season Saturday, then have a double bye before their first game at the SEC Tournament in Nashville, Tenn., on March 10.\n\"I think we put ourselves in a pretty good position,\" Anderson said. \"You look at 22 wins, and in conference play you're 11-6 in the SEC.\n\"Our league is really good. People can say it's under-rated, but I don't think it's under-rated anymore. I think people are seeing that. On any given night. You see Vanderbilt at Kentucky. Vanderbilt came to our place [and won]. Our league is good.\"\nStreak sustained\nArkansas' losing streak at Florida's O'Connell Center reached 12 games stretching across 22 seasons after Wednesday's loss to the Gators.\nThe Razorbacks' last victory at Florida came in a 94-85 decision Feb. 28, 1995. Arkansas won its first two games at the O'Connell Center before the Gators commenced their 12-game winning streak.\nArkansas Coach Mike Anderson dropped to 0-4 at Florida. It is the only SEC venue at which Anderson does not have a victory in his six seasons.\nFlorida and Kentucky are the only SEC teams in the past six seasons to score road victories at all 13 opposing SEC schools.\nFlorida Coach Mike White improved to 4-0 against Arkansas.\nQuick start\nFlorida got off to a roaring start, making 6 of 8 shots and building a 14-8 lead at the first media timeout at 15:40.\nArkansas had not registered a defensive stop, and the Gators had made a pair of three-pointers -- by Canyon Barry and KeVaughn Allen (North Little Rock) -- and four layups.\nThe Razorbacks were shooting 4 of 9 at that point.\nGator bites\nThe Florida men's and women's basketball teams both beat Arkansas on Wednesday. The Florida women eliminated Arkansas from the SEC Tournament in Greenville, S.C., 71-61 in the afternoon game.\nGranny game\nArkansas had back-to-back road games that featured links to the underhand \"Granny\" shot. On Saturday at Auburn, a student made three shots in 30 seconds, capped by a half-court underhand shot that hit nothing but net, for which he won tuition for a semester.\nFlorida guard Canyon Barry is the most well-known current practitioner of the granny shot on free throws, following in the footsteps of his famous father, Rick. Barry made a Florida-record 42 consecutive free throws this season and entered Wednesday ranked No. 14 in the nation and No. 1 in the SEC with 89.9 percent shooting from the line. He went 1 of 2 against the Hogs.\nNew look\nFlorida's home facility, now called Exactech Arena at the O'Connell Center, underwent a $64.5 million renovation during the offseason, with the flashiest new features being a $2 million video board hanging over center court and four video boards in the corners that totaled $1.5 million.\nThe refurbished arena was unveiled Dec. 21 for the Gators' 94-71 victory over the University of Arkansas at Little Rock.\nThe entrance to the 36-year-old building was redone and there are upgrades throughout, including a Courtside Club, which features private dining and a bar for fans willing to pay $12,500 for a season ticket.\nThe renovations reduced capacity from 11,538 to 10,133.\nSenior night\nThe Gators paid tribute to four seniors prior to tipoff: Kasey Hill, Justin Leon, Canyon Barry and Schuyler Rimmer.\nLeon, a 6-8 forward who was a junior college All-American at Shawnee (Ill.) College, is originally from Conway.\nHill, a 6-1 guard who came in as a McDonald's All-American, is the only one of the quartet to play all four seasons with the Gators.\nTip-ins\n• Arkansas center Moses Kingsley had made 21 consecutive free throws before he missed against the Gators and finished 5 of 8 from the line.\n• Florida guard KeVaughn Allen was helped off the floor early in the second half after converting a tough driving layup against Kingsley. Allen was treated for cramps and returned a few minutes later.\n• Florida football Coach Jim McElwain turned 55 on Wednesday, and he was recognized for it during a break late in the first half. The Gators' mascot gave McElwain a cake \"sandwich\" with a candle in it, and McElwain blew it out. The scene was captured on the video boards.\nSports on 03/02/2017","url":"https://www.arkansasonline.com/news/2017/mar/02/anderson-says-hogs-in-top-64-20170302/?page=1"}
