{"authors":["Joe Strange For Mailonline"],"date_download":"2018-10-22 23:25:13","date_modify":"2018-10-22 23:25:13","date_publish":"2017-04-26 07:35:54","description":"Ander Herrera has admitted that a Europa League clash at Old Trafford in 2012 left him convinced that he would join Manchester United at some point in his career.","filename":"data/vaneerConsumption/AnderHerrerarevealshewantedManUtdmovefortwoyears.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/07/3F9CD37D00000578-0-image-a-10_1493187155045.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4446516_Ander-Herrera-reveals-wanted-Man-Utd-two-years_1540250713.html","title":"Ander Herrera reveals he wanted Man Utd move for two years","title_page":"Ander Herrera reveals he wanted Man Utd move for two years | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ander Herrera has admitted that a visit to Old Trafford in 2012 left him convinced that he would join Manchester United at some point in his career.\nThe midfielder signed for United in a £29million deal in the summer of 2014 - more than two years after he helped Athletic Bilbao to a 3-2 win at the Theatre of Dreams in the Europa League.\nAnd Herrera has revealed how that match - and the atmosphere at United's stadium - left a lasting impression on him as he returned to Spain.\nAnder Herrera revealed that he wanted to join Manchester United two years before his move\nHerrera challenges Burnley's Ashley Barnes during last Sunday's 2-0 victory at Turf Moor\nHERRERA IN 2016-17 Appearances: 26 Goals: 1 Assists: 6 Chances created: 35 Pass accuracy: 88% Premier League statistics only\n'We were all so happy, we were coming to the biggest stadium in England,' he told Unscriptd.\n'The most historic stadium in front of the fans that have seen the best football, a lot of titles a lot of great players.\n'I remember I saw the rest of the stadium and I thought - I didn't say to anyone - \"it must be good to play in front of these fans every weekend\".\n'And then I played a fantastic game, maybe one of the best in my career and we beat United 3-2 at Old Trafford.\n'That day I realised one day that was going to happen, I was going to put the red shirt on and enjoy Old Trafford.'\nHerrera chases down Wayne Rooney during Athletic Bilbao's 3-2 win at Old Trafford in 2012\nHerrera gets instructions from United manager Jose Mourinho during a game against Hull\nHerrera has gone on to establish himself as a key player under manager Jose Mourinho, while becoming a popular figure among the United faithful too.\nAnd he admits that pulling on the club's famous kit for the first time during pre-season gave him an 'amazing' feeling.\nHe added: 'And then the next time I played in Old Trafford was already with a red badge playing for United as a United player.\n'I remember it was a pre-season game, friendly game against Valencia, a Spanish side, and the feelings were amazing. I was already a United player.\n'After a long summer, waiting for that moment, that moment came and I was playing for United so it was fantastic.'","url":"https://www.dailymail.co.uk/sport/football/article-4446516/Ander-Herrera-reveals-wanted-Man-Utd-two-years.html"}
