{"authors":["Lucy Mae Beers For Daily Mail Australia"],"date_download":"2018-10-22 21:27:31","date_modify":"2018-10-22 21:27:31","date_publish":"2017-04-26 01:54:36","description":"Coalition MP Andrew Laming has called for the Australian national anthem to be amended to include more of the country's values, humour and multiculturalism.","filename":"data/vaneerConsumption/AndrewLamingcallsfornewnationalanthemverse.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F9B54E300000578-0-image-a-19_1493165896356.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4445844_Andrew-Laming-calls-new-national-anthem-verse_1540243651.html","title":"Andrew Laming calls for new national anthem verse","title_page":"Andrew Laming calls for new national anthem verse | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Coalition MP has called for the Australian national anthem to be amended to include more of the country's values, humour and multiculturalism.\nA day after Anzac Day, Turnbull government MP Andrew Laming said the second verse of Advance Australia Fair is too similar to the first and should focus on 'natural attributes' and 'values'.\n'I think that the only way national anthems can distinguish themselves is through their values, and I do feel our current second verse has pretty much the same message as the first verse,' the Brisbane MP told The Sydney Morning Herald.\nBut his Queensland LNP colleague George Chistensen did not agree, saying the anthem 'is fine as it is, along with the flag'.\nA day after Anzac Day, Turnbull government MP Andrew Laming (pictured) said the second verse of Advance Australia Fair is too similar to the first\nHis Queensland LNP colleague George Chistensen did not agree, saying the anthem 'is fine as it is, along with the flag'.\nMr Laming said new lyrics should discuss how Australia is a 'young nation' with many backgrounds.\nThis comes days after Prime Minister Malcolm Turnbull unveiled plans to put 'Australian values' at the heart of tougher requirements to gain citizenship.\n'We're defined by commitment to common values, political values, the rule of law, democracy, freedom, mutual respect, equality for men and women,' he said.\n'These fundamental values are what make us Australian. Our citizenship process should reflect that.\nMr Laming said new lyrics should discuss how Australia is a 'young nation' with many backgrounds\nThis comes days after Prime Minister Malcolm Turnbull unveiled plans to put 'Australian values' at the heart of tougher requirements to gain citizenship\n'So today we are announcing changes to strengthen citizenship, to make for a stronger Australia, stronger citizenship, stronger citizens.'\nThe new requirements include competent English, belief in gender equality and a four-year qualification period.\nCandidates for citizenship will be required to be permanent residents for four years against the current one-year period.\nThey will also need to demonstrate a job record and how they have integrated into the local community.\nThe new requirements include competent English, belief in gender equality and a four-year qualification period","url":"https://www.dailymail.co.uk/news/article-4445844/Andrew-Laming-calls-new-national-anthem-verse.html"}
