{"authors":["Tom Huizenga","András Schiff"],"date_download":"2018-10-22 21:48:31","date_modify":"2018-10-22 21:48:31","date_publish":"2015-05-12 00:00:00","description":"Twenty years ago, András Schiff hated the fortepiano — but now he's had a change of heart. Hear a track from his new album, in which he plays Schubert on an instrument from 1820.","filename":"data/vaneerConsumption/AndrsSchiffsConfessionalSchubert.json","image_url":"https://media.npr.org/assets/img/2015/05/08/SWL_schiff_wide-a2a2d5b82a894786463e10ed4196a1990c579859.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_deceptivecadence_2015_05_12_405206186_andr-s-schiffs-confessional-schubert_1540244911.html","title":"András Schiff's Confessional Schubert","title_page":"András Schiff's Confessional Schubert : Deceptive Cadence : NPR","title_rss":"NULL","source_domain":"npr.org","text":"András Schiff's Confessional Schubert\nEnlarge this image toggle caption Nadia F. Romanini/ECM Records Nadia F. Romanini/ECM Records\nTwenty years ago, pianist András Schiff did not hide his disdain for the fortepiano — the smaller, quieter precursor to the modern grand piano. In the liner notes of five separate Schubert albums Schiff released in the early 1990s, he wrote: \"Schubert's piano music has luckily not been discovered yet by specialists playing copies of Graf fortepianos.\"\nAnd with that Schiff landed a double blow. Players of fortepianos were merely \"specialists\" — and they were clearly misguided in performing Schubert's music on the very type of instrument the composer knew firsthand.\nWhat a difference a couple of decades makes.\nSchiff is now about to release a double Schubert album (June 2) and guess what type of keyboard he's graduated to? It's a fortepiano from the very time and place Schubert was composing his piano music, a refurbished instrument built by Franz Brodmann in Vienna around 1820. (Schiff actually owns the fortepiano, which he's loaned to the Beethoven House in Bonn, Germany.)\nThis time, Schiff's liner notes are titled \"Confessions of a Convert.\" With a contrite heart, he writes, \"Today it's evident that my initial views were wrong and prejudiced.\" He goes on to praise the \"transparency and natural equilibrium\" of the fortepiano, noting that the softest passages are beautifully realized with the instrument's \"secret weapon,\" the moderator, a device that pushes a thin layer of cloth between the strings and the hammers.\nMy initial views were wrong and prejudiced.\nYou can hear what he's talking about in the Impromptu in A-flat, Op. 142, No. 2. The instrument all but whispers Schubert's beguiling melody, a wistful tune set in a gentle dance rhythm. The central section, by turns rippling and stormy, teems with texture and color, from the buzzing bottom end to muted pastels in the upper register.\nWhen it comes to Schubert, Schiff hasn't totally abandoned the modern piano. (Hear his recent Carnegie Hall concert.) But for this project, one of today's most thoughtful classical artists has had a profound change of heart.","url":"https://www.npr.org/sections/deceptivecadence/2015/05/12/405206186/andr-s-schiffs-confessional-schubert"}
