{"authors":["Andrew Bullock For Mailonline"],"date_download":"2018-10-23 04:24:16","date_modify":"2018-10-23 04:24:16","date_publish":"2017-03-10 14:37:29","description":"Andrea McLean wore Cher's infamous black sequined leotard and enormous black curly wig on Loose Women.","filename":"data/vaneerConsumption/AndreaMcLeanhostsLooseWomeninaChercostume.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/15/3E23AAFE00000578-0-image-a-41_1489160123336.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4301362_Andrea-McLean-hosts-Loose-Women-raunchy-Cher-costume_1540268656.html","title":"Andrea McLean hosts Loose Women in a Cher costume","title_page":"Andrea McLean hosts Loose Women in a Cher costume | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It was 70s and 80s day on Loose Women on Friday afternoon - and the panel donned their finest flashback regalia for the occasion.\nChanneling the likes of Abba and Dolly Parton were Kaye Adams and Linda Robson, while Martine McCutcheon threw on a Cindi Lauper-inspired ensemble.\nBut the show was somewhat stolen by 47-yer-old Andrea McLean, who looked phenomenal in a sexy Cher outfit.\nScroll down for video\nSensational: It was 70s and 80s day on Loose Women on Friday afternoon - but the show was somewhat stolen by 47-yer-old Andrea McLean, who looked phenomenal in a sexy Cher outfit\nAgeless? Cher first wore the enormous black curly wig in 1989 (R) on her If Only I Could Turn Back Time tour in Long Beach, CA, and she looked flawless when she donned it yet again on tour 25 years later (L)\nThe TV anchor wore Cher's infamous black sequined leotard and enormous black curly wig - in the image of the one she wore nearly 30 years ago to open her aptly named Dressed To Kill tour.\nShe slung a black leather jacket around her and displayed her long, lean legs for all to behold, in fishnet tights and black boots.\nThis sent daytime pulses racing, with several viewers taking to Twitter to explain how mesmerised they were by Andrea.\nGoing for it: The TV anchor wore Cher's infamous black sequined leotard and enormous black curly wig\nFoxy lady: She slung a black leather jacket around her and displayed her long, lean legs for all to behold, in fishnet tights and black boots\nTwitter titter: Fans took to the social media site to rave about Andrea's look\n'OMG Andrea dressed as Cher is the best' someone remarked, leading a string of excitable tweeters off.\n'Christ, @andrea_mclean as Cher on #loosewomen. You're determined to tease teenage boys & old men alike. I nearly choked on my Steak & Ale Pie!' a second person typed.\n'#loosewomen Blimey Andrea!!!! Looking sexy today. Old men will be having a coronary,' joked a third.\nAmazing: Several viewers taking to Twitter to explain how mesmerised they were by Andrea, with one writing: 'Blimey Andrea!!!! Looking sexy today'\nHot stuff: 'OMG Andrea dressed as Cher is the best' someone remarked, leading a string of excitable tweeters off\nA fourth person wrote: '#LooseWomen @andrea_mclean looks hot as Cher. She has a fantastic figure. Loving the show,' followed by a fifth who typed: 'Holy s**t how amazing does @andrea_mclean look!!! Hawt diggedy dawg! #loosewomen!'\nSure to praise the others too, someone posted: 'Wow, you all look great but Andrea's figure though #LooseWomen!'\nNot everyone was quite so kind, with a couple of embittered remarks being posted such as: 'Can someone explain what was Andrea was thinking when she decided that outfit was acceptable? Don't need to see your vagina #LooseWomen.'\nEnvy-inducing: Another commented that she had a 'fantastic figure'\nNot a fan: Not everyone was quite so kind, with a couple of remarks being posted such as: 'Can someone explain what was Andrea was thinking when she decided that outfit was acceptable?'\nFollowing suit: Channeling the likes of Abba and Dolly Parton were Kaye Adams and Linda Robson, while Martine McCutcheon threw on a Cindi Lauper-inspired ensemble\n'#loosewomen Anyone else find it funny how Andrea is all \"glammed up\" and all the others are taking the p**s out themselves. Very obvious,' came another stroppy tweet.\n'#LooseWomen Andrea doing a lot of posing today,' came another jealousy-fuelled remark.\nPaddy McGuinness was appearing on the show too - and was also notably wowed by Andrea, informing the presenter that 'he needed to have a word with himself'.\nStriking: Martine sported a wild, colourful afro wig and Cyndi's trademark beaded jewellery, while Kaye opted for a classic blonde wig (R)","url":"https://www.dailymail.co.uk/tvshowbiz/article-4301362/Andrea-McLean-hosts-Loose-Women-raunchy-Cher-costume.html"}
