{"authors":["Press Association"],"date_download":"2018-10-22 23:28:20","date_modify":"2018-10-22 23:28:20","date_publish":"2016-01-28 12:22:37","description":"Andros Townsend has completed his move to Newcastle from Tottenham after signing and five-and-a-half-year deal, the club has confirmed. The 24-year-old Engla...","filename":"data/vaneerConsumption/Androstownsendcompletesnewcastleswitch.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-ce4fe1f8-2de9-4667-ab85-6b2aa2c89fd4-2vdWmEltwXfba0ce28e632881524-816_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3419664_Andros-Townsend-completes-Newcastle-switch_1540250900.html","title":"Andros townsend completes newcastle switch","title_page":"Andros townsend completes newcastle switch | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Andros Townsend completes Newcastle switch\nAndros Townsend has completed his move to Newcastle from Tottenham after signing and five-and-a-half-year deal, the club has confirmed.\nThe 24-year-old England international has joined the Magpies for an undisclosed fee, understood to be £12million, and becomes head coach Steve McClaren's third capture this month, taking the club's total January investment to in the region of £29million.\nHis arrival at St James' Park was confirmed in a club statement which said: \"Newcastle United have completed the signing of England international winger Andros Townsend from Tottenham Hotspur.\nAndros Townsend has joined Newcastle\n\"The 24-year-old arrives at St James' Park for an undisclosed fee and has signed a five-and-a-half-year deal with the Magpies. He will wear the number 25 shirt.\"\nTownsend put pen to paper on Wednesday evening after passing a medical and agreeing personal terms, in the process ending a 16-year stay at Tottenham which had soured in recent months.\nHis first opportunity to play for his new club will come at Everton next Wednesday evening, and he could make his home debut in what will be a crucial clash with West Brom three days later.\nTownsend said: \"I'm delighted to be here. Newcastle United is a fantastic club with great fans, a great stadium and great tradition.\n\"As soon as I heard Newcastle were interested in me, there was only one place I wanted to go so I can't wait to get started.\"\nTownsend's arrival represents another boost for under-pressure McClaren, who has been desperate to add proven Barclays Premier League quality to his squad to assist in the fight for top-flight survival.\nThe winger, who joined Spurs as an eight-year-old, joins former Swansea midfielder Jonjo Shelvey in fulfilling that brief, and now faces the task of reviving his career on Tyneside, no doubt with one eye on the Euro 2016 finals.\nMcClaren said: \"Bringing Andros to the club is a great signing. He is a very good talent who is a current England international and should be one for years to come, too.\n\"Andros is a winger with an old-fashioned style. He can play on the right or the left, is two-footed, quick, very direct and loves taking on defenders and crossing the ball.\n\"He feels he has a lot to prove and I can't wait to see him do that in a Newcastle shirt.\"\nNewcastle currently sit inside the bottom three, two points from safety with just 15 games to play and facing a battle to preserve their top-flight status.\nMcClaren will hope his latest acquisition can help to add both supply and goals to his team, but the hunt for striking reinforcement is ongoing with Saido Berahino, Loic Remy and Bafetimbi Gomis among the men in the Magpies' sights, although time is running out fast.","url":"https://www.dailymail.co.uk/wires/pa/article-3419664/Andros-Townsend-completes-Newcastle-switch.html"}
