{"authors":["Ben Grounds For Mailonline"],"date_download":"2018-10-23 01:57:24","date_modify":"2018-10-23 01:57:24","date_publish":"2016-01-11 13:26:38","description":"Everton's interest in Dynamo Kiev's winger Andriy Yarmolenko has resurfaced this transfer window. Here, Sportsmail provides the rundown on what the Blues would be getting with their money.","filename":"data/vaneerConsumption/AndriyYarmolenkoscoutingreportAllyouneedtoknowaboutEvertontarget.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/10/0CA5772F00000514-0-image-a-3_1452509681036.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3393714_Andriy-Yarmolenko-scouting-report-need-know-Dynamo-Kiev-ace-wanted-Everton-scouted-Barcelona_1540259844.html","title":"Andriy Yarmolenko scouting report: All you need to know about Everton target","title_page":"Andriy Yarmolenko scouting report: All you need to know about Everton target | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Everton's interest in Dynamo Kiev's winger Andriy Yarmolenko has resurfaced this transfer window, with Toffees manager Roberto Martinez preparing a £21million bid for the Ukrainian international.\nThe 26-year-old has been linked with a move to the Premier League in recent times, with Everton ready to firm up their admiration for the player fearing his valuation will rise after the European Championship finals next summer.\nHere, Sportsmail provides the rundown on what Evertonians would be getting with their money should Yarmolenko make the move to Merseyside.\nDynamo Kiev's winger Andriy Yarmolenko impressed Roberto Martinez in the Europa League tie last season\nThe 26-year-old signed a new contract with the Ukrainian club recently but it hasn't detracted admirers\nWhy does Martinez want to sign him so much?\nOne of the key reasons the Everton manager wants to bring the talented Ukrainian to Goodison Park is to provide his youthful attack with added experience at the highest level.\nYarmolenko would bring pedigree to the dressing room having added to his Champions League appearances with Kiev this season, but most importantly he would emphatically answer calls among Evertonians for a player who naturally plays on the left.\nWhilst Steven Pienaar made his first start at Goodison since December 2014 in the FA Cup third-round victory over Dagenham & Redbridge, the telepathic relationship the 33-year-old enjoyed earlier on in his Toffees career with left-back Leighton Baines is unlikely to cause so many problems.\nArouna Kone has been shoehorned into the side at times on the left, but the Ivorian is much better suited down the middle as an understudy to Romelu Lukaku. Yarmolenko would provide better balance, with Gerard Deulofeu or Kevin Mirallas' pace and penetration on the other flank.\nYarmolenko was described early on in his career as the 'new Sheva' in reference to Andriy Shevchenko (left)\nHow has his career progressed so far?\nThe two-footed winger, who is equally adept through the middle, joined Kiev's youth academy aged 13 but he returned to the city of Chernihiv – the northern Ukraine city of his upbringing – after struggling with the demands of training.\nAfter recovering his confidence with a handful of appearances for local team FC Desna Chernihiv, Dynamo rekindled their interest in him, and he eventually signed a five-year contract with the Ukrainian giants in December 2006.\nAfter impressing for the club's second string, Dynamo-2, the man named Ukrainian Footballer of the Year in the past two seasons scored on his first-team debut in May 2008, and he has gone on to net 76 goals in 187 league appearances.\nHis rise to prominence with Kiev coincided with Yarmolenko earning his first senior cap with Ukraine in a World Cup qualifier against Andorra in September 2009. The most recent of his 22 goals in 55 appearances for the national team helped Ukraine seal their place at Euro 2016, as Slovenia were beaten 3-1 on aggregate in the play-offs.\nYarmolenko played against England in a 2014 World Cup qualifier and could move to the Premier League\nYARMOLENKO SEASON STATS Dynamo Kiev: 22 appearances, 13 goals, eight assists Ukraine: 6 appearances, 3 goals\nWho else is interested?\nHaving featured in the Ukrainian Premier League for the best part of a decade, Yarmolenko may now feel ready for a new challenge.\nEverton would be seeing off stiff competition should they pull off the deal, with it previously reported that La Liga giants Barcelona had scouted the 26-year-old flyer as a potential replacement for Pedro.\nAfter the Spain international moved to Stamford Bridge in a £22m move last summer, there were reports in the Spanish media that Luis Enrique would look to Yarmolenko to fill the void at the Nou Camp once the transfer embargo on the club was lifted.\nArsenal and Chelsea have also kept tabs on the free-scoring wide forward, with former Blues manager Jose Mourinho spotted on a scouting mission earlier this season when Ukraine faced Spain in a Euro 2016 qualifier.\nWhat sort of player is he?\nWhile Kiev managed to brush aside Portuguese side Porto to qualify behind Chelsea for the Champions League knock-out stages, Yarmolenko played a modest role in their success.\nThe worry for the club's last-16 opponents Manchester City is that - provided he remains at Kiev - he will be hungry to improve on two goals from five games in this season's competition when Manuel Pellegrini's side travel for the first leg in February.\nYarmolenko is noted for being gifted in possession with an excellent physique, shot and speed, which were on display when Everton suffered a heavy 5-2 defeat at the Olympic Stadium last March.\nIt was Yarmolenko's moment of individual brilliance which opened the scoring that night - running at the Blues defence before cutting inside and unleashing a venomous 25-yard strike beyond the motionless Tim Howard - that made Martinez stand up and take note.\nToffees midfielder James McCarthy had his hands full with Yarmolenko during the Europa League second leg\nWhat have people said about him?\nAt 26, Yarmolenko is no secret to those within the game but he caught the eye of former Dynamo president Yozhef Sabo from a young age, with him being described as having 'all the makings to become a top-level player.'\nKiev manager Sergei Rebrov admits the transfer of Yarmolenko may be out of his hands should an extortionate bid come in for his star player.\nRebrov has said: 'He's a very high-level footballer. I can see his progress and teams are interested in him but it all depends on his relationship with the president. I don't want to sell him, but at the end of the day, it's all about the relationship with the president.'\nAfter being spotted in Ukraine, Mourinho tried to play down speculation of a move saying: 'Of course I wasn't looking at [other] players. We cannot make a collection of wingers.'\nThe Ukraine international will be happy to leave Kiev if the club benefit from a big offer this January window\nWhat are the chances of a deal actually being reached?\nThe possibility of Yarmolenko arriving on Merseyside in the next 21 days still remains an outside bet given he signed a new five-year deal with Kiev only this term that could keep him in Ukraine until 2020.\nBut the player himself acknowledges that should a sizeable bid be received, he will be on his way. 'I know that if Dynamo get really worthy offers we'll find an option that satisfies everyone. I want the club to get good compensation for me.'\nMartinez would appear to be making space for his £21m arrival with both Aiden McGeady and Steven Naismith kept out of his FA Cup squad to not affect their valuation, with the latter the subject of an £8m bid from Norwich.","url":"https://www.dailymail.co.uk/sport/football/article-3393714/Andriy-Yarmolenko-scouting-report-need-know-Dynamo-Kiev-ace-wanted-Everton-scouted-Barcelona.html"}
