{"authors":["Tammy Hughes For The Daily Mail"],"date_download":"2018-10-22 21:19:28","date_modify":"2018-10-22 21:19:28","date_publish":"2017-04-26 01:33:06","description":"Andrew Marr, Jenni Murray and Monty Don will speak at the Chalke Valley History Festival, sponsored by the Daily Mail, in Broad Chalke, Wiltshire. The event takes place from June 26 to July 2.","filename":"data/vaneerConsumption/AndrewMarrtospeakatChalkeValleyfestival.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/370B921000000578-0-image-a-33_1493166641006.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4445996_Chalke-Valley-festival-Andrew-Marr-Jenni-Murray_1540243168.html","title":"Andrew Marr to speak at Chalke Valley festival","title_page":"Andrew Marr to speak at Chalke Valley festival | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Andrew Marr will appear at the country’s only dedicated history festival this summer alongside Women’s Hour presenter Dame Jenni Murray and gardening guru Monty Don.\nMarr will speak about modern Britain, with its idealism, hopes, achievements, failures and obsession with celebrity.\nHis vivid overview of political history from 1945 to present will be part of a week of talks and historical re-enactments at the Chalke Valley History Festival, sponsored by the Daily Mail.\nDame Jenni Murray (left) will speak about the history of Britain through the achievements of 21 women at the event, while Andrew Marr (right) will speak about modern Britain\nKnown for its spectacular re-enactments, the festival this year commemorates the 100th anniversary of the First World War battles of Vimy Ridge, Arras and Passchendaele. Above shows a re-enactment at last year's event\nDame Jenni will speak about the history of Britain through the achievements of 21 women, including queens, artists, writers, scientists and activists, whose actions revolutionised the world.\nMeanwhile Don, a columnist for the Mail’s Weekend magazine, will discuss the history of British gardens.\nSome of the country’s most revered historians, politicians, musicians and journalists will address the festival, which has a new venue at Church Bottom, Broad Chalke, in Wiltshire, and runs from June 26 to July 2.\nHow you can join in To find out more about the Chalke Valley History Festival, which runs from June 26 to July 2, and to purchase tickets, visit www.cvhf.org.uk. Tickets, which go on sale today, can also be bought by calling 01722 781133. Friends of the festival will have access to a separate Friends car park, ticket offers and newsletters and priority seating. To find out more visit www.cvhf.org.uk\nAmong them will be First World War historian Lyn MacDonald, award-winning lyricist Sir Tim Rice, former leader of the opposition Harriet Harman and ex-foreign secretary Sir Malcolm Rifkind.\nThe origins of the terms ‘genocide’ and ‘crimes against humanity’ will be discussed by historian and law professor Philippe Sands, while photojournalist Don McCullin will be in conversation with Max Hastings.\nThe festival will also see talks from Miroslaw Obstarczyk, one of the curators of the Auschwitz museum, and Niklas Frank, Hitler’s godson, as well as Second World War veterans and Knight’s Cross winners Hugo Broch and Gunter Halm.\nKnown for its spectacular re-enactments, the festival this year commemorates the 100th anniversary of the First World War battles of Vimy Ridge, Arras and Passchendaele.\nThere will be a major immersive experience where ‘recruits’ can take part in a training camp similar to those used by those training for war. Festival-goers can also visit a new trench experience where they enter as a fly-on-the-wall spectator as historians enact scenarios from 1917.\nLast year, actors recreated a typical military advance in around 1944 at the Chalke Valley History Festival\nThis year’s festival will also commemorate the 500th anniversary of the Reformation and the 200th anniversary of the death of Jane Austen.\nAt the end of the week there will be a Blitz-themed party with live music from the Bombshell Belles, while air displays will take place on July 1 and 2 with some of the most beautiful aircraft from the Second World War.\nJames Holland, co-chairman of the festival, said: ‘We’ve got another very broad programme both in terms of talks and discussions as well as a vast array of living history at our exciting new venue in one of the most beautiful corners of England.\n‘Celebrated academics and household names will be sharing the spotlight with incredible historic aircraft and some of the very best living historians in the country. It’s a salivating prospect.’","url":"https://www.dailymail.co.uk/news/article-4445996/Chalke-Valley-festival-Andrew-Marr-Jenni-Murray.html"}
