{"authors":["Craig Hope For Mailonline"],"date_download":"2018-10-23 00:55:22","date_modify":"2018-10-23 00:55:22","date_publish":"2016-01-28 15:02:28","description":"Townsend believes he can win a place at Euro 2016 by leading Newcastle to safety – and has vowed to rediscover the form which saw him 'set the world alight' with Spurs and England.","filename":"data/vaneerConsumption/AndrosTownsendvowswinaplacebackinRoyHodgsonsEnglandsquadatNewcastle.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB0B8000000578-0-image-a-71_1453993344255.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3421111_Andros-Townsend-vows-rediscover-form-saw-set-world-alight-Newcastle-United-win-place-Roy-Hodgson-s-England-squad_1540256122.html","title":"Andros Townsend vows win a place back in Roy Hodgson's England squad at Newcastle","title_page":"Andros Townsend vows win a place back in Roy Hodgson's England squad at Newcastle | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Andros Townsend says he will prove a ‘bargain’ at £12million by helping Newcastle United escape relegation and then winning a place at Euro 2016.\nThe 24-year-old was frozen out of the first-team picture under Mauricio Pochettino at Spurs and has not played a full Premier League game for two years.\nTownsend insists his old boss was wrong to cast him aside and has hit back those who believe the Magpies have paid over the odds for a player who has made just 22 top-flight starts in his entire career.\nAndros Townsend (right) runs on the pitch during drills at The Newcastle United Training Centre on Thursday\nTownsend feels he can win a place at Euro 2016 by leading Newcastle United to Premier League safety\nThe 24-year-old signing from Tottenham Hotspur warms up between cones (left) and looks on (right)\n‘Off course, £12m is a lot of money. But if I can reach my potential and play to the ability I know I have, then I am sure as quickly as people are saying it is a lot of money, they will be saying it is a bargain,’ said the winger, whose arrival at third-from-bottom Newcastle takes the club's spending to £80m under Steve McClaren.\n‘I am the same player and the same person that broke on the scene a few years ago and was tipped as a big England prospect. I was an integral part for club and country.\n‘But I have got a point to prove now, haven't I? I have not played consistently in a long time.\n‘The last time I played nine or 10 Premier League games in a row, I was playing for Spurs, playing for England and kind of setting the world alight, so I can't wait to get a run of games and hopefully get back to that level I was at a few years ago.’\nTownsend has said: 'Roy Hodgson has always had faith in my ability and included me in squads'\nSteve McClaren also expects Townsend to revive his England career whilst playing for Newcastle\nTownsend announced himself on the big stage by scoring on his England debut and helping Roy Hodgson’s side qualify for the World Cup in 2014, a tournament he missed through injury.\nBut Pochettino’s arrival at White Hart Lane saw opportunities limited and his last Premier League appearance was in October.\n‘He (Pochettino) has had no problem with me on a personal level,’ said Townsend. ‘He made his decision professionally, which obviously I do not agree with, but Tottenham are flying high, so I can't really argue with him.’\nAt international level, however, Hodgson has regularly included Townsend, who hopes to add to his 10 caps before this summer's Euros.\nTownsend said: 'As soon as I heard Newcastle were interested in me, there was only one place I wanted to go'\nNewcastle made their interest in Townsend known in November but it has taken two months to agree the deal\n‘Roy Hodgson has always had faith in my ability and every time he has put me on the pitch I have repaid that faith,’ he said.\n‘For now, I need to focus solely on getting back to playing Premier League football and helping Newcastle get out of the relegation zone.\n‘If I can do that and score a few goals along the way, hopefully the England stuff will come off the back of that.’ And Townsend has set himself the lofty target of emulating former Newcastle and Spurs wideman David Ginola.\n‘I have always said he was my favourite player to watch growing up - so no pressure there!’ laughed Townsend.\n‘But I have confidence in my ability and will hopefully go out and excite the crowd.’","url":"https://www.dailymail.co.uk/sport/football/article-3421111/Andros-Townsend-vows-rediscover-form-saw-set-world-alight-Newcastle-United-win-place-Roy-Hodgson-s-England-squad.html"}
