{"authors":["Mehreen Kasana"],"date_download":"2018-10-31 01:39:06","date_modify":"2018-10-31 01:39:06","date_publish":"2018-08-29 21:49:36","description":"Talk about grace. Soon after Florida GOP gubernatorial candidate Ron DeSantis warned voters not to “monkey this up” by voting for his black Democratic opponent, Andrew Gillum, the Democratic candidate, responded to DeSantis with a message of…","filename":"data/vaneerConsumption/AndrewGillumRespondsToRonDeSantisMonkeyRemarkInTheMostFittingWay.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/29/d4358a03-bef6-4cb8-96fb-db68874e8753-steve-cannonapshutterstock.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_andrew-gillum-responds-to-ron-desantis-monkey-remark-in-the-most-fitting-way-11193892_1540949946.html","title":"Andrew Gillum Responds To Ron DeSantis' \"Monkey\" Remark In The Most Fitting Way","title_page":"Andrew Gillum Responds To Ron DeSantis' \"Monkey\" Remark In The Most Fitting Way","title_rss":"NULL","source_domain":"bustle.com","text":"Talk about grace. Soon after Florida GOP gubernatorial candidate Ron DeSantis warned voters not to “monkey this up” by voting for his black Democratic opponent, Andrew Gillum, the Democratic candidate, responded to DeSantis with a message of unity.\nWhile speaking to CNN’s John Berman on New Day on Wednesday, a resolute-looking Gillum said:\nDonald Trump and Ron DeSantis are both scraping from the bottom of the barrel. I believe that Florida and its rich diversity are going to be looking for a governor who’s going to bring us together. Not divide us. Not misogynists. Not racists. Not bigots.\nWhile speaking on Fox News earlier that day about his Republican primary victory, DeSantis had said, \"The last thing we need to do is to monkey this up by trying to embrace a socialist agenda with huge tax increases and bankrupting the state.\" Such an \"agenda\" would not \"be good for Florida,\" according to the Republican. Condemnation for DeSantis' remarks was swift, including resounding criticism from Florida Democratic Party chairwoman Terrie Rizzo. In a statement, Rizzo said, \"It's disgusting that Ron DeSantis is launching his general election campaign with racist dog whistles.\"\nGillum, who is the Tallahassee mayor, responded to DeSantis shortly after claiming a stunning victory in the Democratic primary against former Rep. Gwen Graham. Gillum said Floridians were \"going to be looking for a governor who is going to appeal to our higher aspirations as a state.\" Voters, Gillum added, wanted a governor \"who's going to talk about what it means to build a Florida that makes room for all of us and not just some of us.\"\nThe progressive Democrat went on to add, \"DeSantis can do the bidding of big business and big lobbyists and Donald Trump and his divisive rhetoric. I'm going to be here to do the business of the people of the state of Florida. That's the job of the governor of this state.\"\nHere's a clip of Gillum's response.\nDeSantis' campaign communications director, Stephen Lawson, attempted to clarify the Republican's comments in a statement to CNN. \"Ron DeSantis was obviously talking about Florida not making the wrong decision to embrace the socialist policies that Andrew Gillum espouses. To characterize it as anything else is absurd,\" Lawson said.\nBut by then, DeSantis had already sparked solid criticism for his remarks. Not only did Rizzo call him out for the \"monkey this up\" comment, so did Democratic Governors Association Deputy Communications Director David Turner. In a statement, Turner said, \"On the first day of the general election, Ron DeSantis showed Floridians who he really is. Resorting to dog whistle politics within hours of winning the GOP nomination shows a desperate candidate who will stoop to new lows in order to court and give voice to fringe elements of society.\"\n\"Floridians want a leader,\" Turner said, \"who will bring them together; Ron DeSantis has shown that he would only divide Florida.\"\nNeilson Barnard/Getty Images Entertainment/Getty Images\nSoon after he shared his views, Fox News also attempted to step away from DeSantis by releasing a clarification statement, according to CNN. A spokesperson for the network told CNN, \"We do not condone this language and wanted to make our viewers aware that he has since clarified his statement.\"\nIt is not known whether DeSantis' comments were a case of deliberately incendiary rhetoric or just a terribly unfortunate gaffe. But what is clear is that the day after his primary election win has not been a good one.","url":"https://www.bustle.com/p/andrew-gillum-responds-to-ron-desantis-monkey-remark-in-the-most-fitting-way-11193892"}
