{"authors":["Jonathan Spencer For Mailonline"],"date_download":"2018-10-23 02:01:21","date_modify":"2018-10-23 02:01:21","date_publish":"2017-03-10 10:44:09","description":"Charismatic 28-year-old English golfer Andrew 'Beef' Johnston has been living up to his appearance off the golf course by sampling different burgers in the United States.","filename":"data/vaneerConsumption/AndrewBeefJohnstonenjoysMeatMountainatArbys.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E2216D600000578-0-image-a-57_1489140168988.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_golf_article-4300472_Andrew-Beef-Johnston-enjoys-Meat-Mountain-Arby-s_1540260081.html","title":"Andrew 'Beef' Johnston enjoys 'Meat Mountain' at Arby's","title_page":"Andrew 'Beef' Johnston enjoys 'Meat Mountain' at Arby's | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Andrew 'Beef' Johnston has been living up to his appearance off the golf course by sampling different burgers in the United States.\nThe charismatic golfer took to Instagram recently to post a photo of himself looking excited by the thought of eating a giant burger in front of him.\nWhat does the burger consist of you ask? Well the 'Meat Mountain', which looks pretty intimidating, is made up of pepper bacon, roast beef, cheddar cheese, angus beef, smoked brisket, corned beef, pit smoked ham, swiss cheese, roast turkey, chicken tenders and a star cut bun.\nAndrew Johnston took to Instagram to let his fans know that he will be at Arby's on Friday\nArby's 'Meat Mountain' is the biggest sandwich the US fast-food restaurant has ever sold\nWHAT IS IN THE MEAT MOUNTAIN? Pepper Bacon, Roast Beef, Cheddar Cheese, Angus Beef, Smoked Brisket, Corned Beef, Pit Smoked Ham, Swiss Cheese, Roast Turkey, Chicken Tenders, Star Cut Bun Calories - 1,030 How much does it cost? $10.00\nJohnston captioned the post: 'I'm gonna be at @arbys 30263 us highway 19 n. Clearwater. Tomo at 5 pm. Come say hi. Have some food, pics or anything signed.'\nThe 28-year-old has already inked a sponsorship deal with Arby's, which is also famous for their beef.\nJohnston, who has won over many fans for his unique and and entertaining behaviour on the golf course, is clearly partial to a burger.\nSticking to his appearance on and off the golf course, Johnston let his huge following know in December that he was challenged by a fellow professional athlete to a triathlon of beer, beef and birdies and that he has no intention of allowing the idea to disappear into the long grass.\nJohnston has a large following of golf fans for his unique behaviour on and off the course\n'It's for real,' he told Sportsmail in December last year. 'I was sent a message on Twitter from Steven Bowditch (a two-time winner on the PGA Tour), challenging me to this thing. He wants to team up with Boo Weekley (a former top-50 player) and told me to pick a partner if I was man enough.\n'The idea would be some kind of mixture of eating, drinking and golf — beer, beef and birdies. Well, fine. I can handle that.\n'Thing is, we all want it to actually happen, maybe sometime around next Christmas when we aren't in tournaments, giving whatever money comes from it to charity. We want to make this workable.\n'They told me to pick a partner so I've gone big — big JD. John Daly. He accepted. Now that's coming at them. I think we can hold our own.'\nThe 28-year-old charismatic golfer has signed a sponsorship deal with Arby's","url":"https://www.dailymail.co.uk/sport/golf/article-4300472/Andrew-Beef-Johnston-enjoys-Meat-Mountain-Arby-s.html"}
