{"authors":[],"date_download":"2018-10-21 02:47:09","date_modify":"2018-10-21 02:47:09","date_publish":"2018-08-06 19:03:15","description":"Drea spent this summer as our video intern. She quickly impressed editors with her versatility—covering breaking stories on immigration and doing a lovely feature on an elderly beauty pageant.","filename":"data/vaneerConsumption/AndreaCornejojoinsVideo.json","image_url":"https://www.washingtonpost.com/resizer/ZIwdtFReqPMJh15-SBE1si-PDjE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/K745CI4HXM5QBLJKZWU3RUL5MU.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_08_06__1540090029.html","title":"Andrea Cornejo joins Video","title_page":"Andrea Cornejo joins Video - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Announcement from Editorial Video Director Micah Gelman, Deputy Video Director Phoebe Connelly, and Universal News Desk Senior Producer Deirdra O’Regan:\nWe are pleased to announce Andrea Cornejo will join The Post as the Morning Mix video editor. Drea spent this summer as our video intern. She quickly impressed editors with her versatility—covering breaking stories on immigration and doing a lovely feature on an elderly beauty pageant.\nAndrea Cornejo is a native of Guayaquil, Ecuador. She worked as a visual journalist for The Gainesville Sun while earning a B.S. in journalism from the University of Florida and interned for the Las Vegas Review-Journal for the spring of 2018.\nHer work has earned a number of awards, including Multimedia Story of the Year for the Hearst Journalism Awards Championship, first place in Enterprise News and General News for the National Hearst Journalism Awards Program, and Student Video Photographer of the Year for The White House News Photographers Association. She also participated in the Eddie Adams Workshop as well as The Mountain Workshops.\nIn her brief career, she has told a story of a family’s struggle to provide fresh water for their children in Cuba, documented the life of a Syrian refugee in Berlin and explored the topics of gender fluidity in a small village in the Dominican Republic. Drea will spend a few weeks training before transitioning to the Morning Mix team later this summer.","url":"https://www.washingtonpost.com/pr/wp/2018/08/06/andrea-cornejo-joins-video/"}
