{"authors":["Tom Bassam For Mailonline"],"date_download":"2018-10-22 21:52:54","date_modify":"2018-10-22 21:52:54","date_publish":"2017-03-10 00:02:56","description":"The 'Rostock Gorilla' took the final opportunity for sprinters at this year's Paris-Nice, with the race headed for the mountains as it nears its conclusion. Greipel was delighted with timing in the final straight.","filename":"data/vaneerConsumption/AndreGreipelwinsParisNicestagefivesprintfinish.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/23/3E1D37F700000578-0-image-a-7_1489103991258.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_othersports_article-4299488_Andre-Greipel-wins-Paris-Nice-stage-five-sprint-finish_1540245174.html","title":"Andre Greipel wins Paris-Nice stage five sprint finish","title_page":"Andre Greipel wins Paris-Nice stage five sprint finish | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"German Andre Greipel timed his effort to perfection to win the fifth stage of Paris-Nice ahead of a high quality bunch sprint.\nThe Lotto Soudal rider accelerated from 50m out to round Lotto NL Jumbo's Dylan Groenewegen whilst holding off FDJ's Arnaud Demare.\nThe 'Rostock Gorilla' took the final opportunity for sprinters at this year's Paris-Nice, with the race headed for the mountains as it nears its conclusion. Hitting the front with the finish line in sight, Greipel was delighted with timing.\nGerman Andre Greipel timed his effort to perfection to win the fifth stage of Paris-Nice\nThe German accelerated from 50m out to beat Dylan Groenewegen and Arnaud Demare\n'I went just on the right time, I am so relieved that I've finally won a stage in this Paris-Nice,' he said.\n'I was really disappointed on Tuesday. I made a big mistake and that's why I was really angry at myself. We wanted to do it better today.\n'We had to time it right. Together with the team, I had a really good position for the sprint and I will say that the finish suited me well with it being slightly uphill.'\nQuick Step Floors' Julian Alaphilippe will carry the pressure of a young Frenchman leading the race into its final stages as he retained the yellow jersey with a safe finish in the bunch.\nJulian Alaphilippe will carry the pressure of a Frenchman leading the race into its final stages\nAlaphilippe remains 33 seconds ahead of French countryman Tony Gallopin, with Gorka Izaguirre of Spain 47secs back in third spot with three stages of climbing ahead. Team Sky's Sergio Henao remains fourth.\nHis overall lead will be under threat in Friday's sixth stage, a hilly 193.5-km trek between Aubagne and Fayence.\nThere are three more category 1 climbs on Saturday, and two more on Sunday before a downhill finish to Nice.","url":"https://www.dailymail.co.uk/sport/othersports/article-4299488/Andre-Greipel-wins-Paris-Nice-stage-five-sprint-finish.html"}
