{"authors":[],"date_download":"2018-10-22 21:32:21","date_modify":"2018-10-22 21:32:21","date_publish":"2014-05-07 16:11:31","description":"\"Payroll doesn't mean everything. If that was the case, the Yankees would win every year.\"","filename":"data/vaneerConsumption/AndrewMcCutchenPayrollIsntEverythingforTeams.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/better_careers_andrew-mccutchen-payroll-isn-t-everything-teams-n99386_1540243941.html","title":"Andrew McCutchen: 'Payroll Isn't Everything' for Teams","title_page":"Andrew McCutchen: 'Payroll Isn't Everything' for Teams","title_rss":"NULL","source_domain":"nbcnews.com","text":"Get the Better newsletter.\nThree-time All-Star center fielder Andrew McCutchen has become the new face of small market baseball, and he doesn't think being on a team with one of the lowest payrolls in the Major Leagues is holding him or his team back.\n\"Payroll doesn't mean everything. If that was the case, the Yankees would win every year,\" McCutchen told CNBC.\nThe 27-year-old outfielder, who was named 2013 National League Most Valuable Player, led the Pirates last season to their first winning season and playoff berth in 21 years.\n\"It's about finding the right guys—not necessarily the most expensive,\" said McCutchen.\nThe Pirates' payroll for the start of the 2014 season ranked 27th out of 30 teams, according to Forbes. The Pirates spent just $78 million, compared with the top payroll teams like the Dodgers and Yankees, which spent almost triple that amount.\n\"You don't have to spend a lot of money to think that you are going to make a difference,\" said McCutchen, who was drafted by the Pirates in 2005 and made his MLB debut in 2009.\nIn 2012, McCutchen signed a six-year; $51.5 million contact with the Pirates at a value that many believe makes him underpaid.\n\"You think about it (making more money) but at the same time I could be making no money, so it could go both ways,\" he said. \"It was about being in Pittsburgh and playing baseball. The deal was fair and I was really happy with it.\"","url":"https://www.nbcnews.com/better/careers/andrew-mccutchen-payroll-isn-t-everything-teams-n99386"}
