{"authors":["Press Association"],"date_download":"2018-10-23 00:36:42","date_modify":"2018-10-23 00:36:42","date_publish":"2016-01-28 14:37:06","description":"Newcastle new boy Andros Townsend is desperate to make up for lost time after ending his Tottenham nightmare. The 24-year-old clinched a £12million switch to...","filename":"data/vaneerConsumption/Androstownsendhaspointtoproveafterswappingspursfornewcastle.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-db4b64ae-1a9d-4165-8238-01d10bdecca7-2vdWmEltwXfba0ce28e63299e68c-294_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3421063_Andros-Townsend-point-prove-swapping-Spurs-Newcastle_1540255002.html","title":"Andros townsend has \"point to prove\" after swapping spurs for newcastle","title_page":"Andros townsend has \"point to prove\" after swapping spurs for newcastle | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Andros Townsend has \"point to prove\" after swapping Spurs for Newcastle\nNewcastle new boy Andros Townsend is desperate to make up for lost time after ending his Tottenham nightmare.\nThe 24-year-old clinched a £12million switch to St James' Park on Wednesday evening and is relishing the opportunity to get his career back on track after falling out of favour at White Hart Lane.\nTownsend said: \"I have got a point to prove now, haven't I? I think my last [full] 90 minutes in the Premier League was just under two years ago, so I have not played consistently in a long time.\nAndros Townsend is eager for a return to regular football\n\"The last time I played nine or 10 Premier League games in a row, I was playing for Spurs, playing for England and kind of setting the world alight, so I can't wait to get a run of games and consistency going and hopefully get back to that level I was at a few years ago.\"\nTownsend became the third man to answer Magpies head coach Steve McClaren's call to arms this month after Jonjo Shelvey and Henri Saivet, and insisted the club's lowly Barclays Premier League position - they are currently languishing inside the relegation zone - was never a concern after witnessing their 2-1 win at Spurs on December 13.\nHe said: \"I watched the game Newcastle played at White Hart Lane. At the time, Tottenham had been on an unbeaten run, but Newcastle were the better team, they had great quality. The subs made the difference, which showed their strength in depth, and in the meantime they have added Shelvey and Saivet.\n\"I have confidence we have the ability in the dressing room to stay up. I am surprised at their position, but it is a crazy season, anyone can beat anyone. Hopefully now the manager has brought in the players that he wants, we can climb the table.\"\nTownsend will hope his move will enable him to persuade England boss Roy Hodgson that he has a role to play at this summer's Euro 2016 finals, although that will not be his main motivation in the weeks and moths ahead.\nHe said: \"Roy Hodgson has always had faith in my ability and included me in squads. Every time he has put me on the pitch, I have re-paid that faith.\n\"I have always said I need to take baby steps. I have not played in the Premier League for a couple of months now. I need to focus solely on Newcastle and getting back to playing Premier League football and helping Newcastle get out of the relegation zone and to Premier League survival.","url":"https://www.dailymail.co.uk/wires/pa/article-3421063/Andros-Townsend-point-prove-swapping-Spurs-Newcastle.html"}
