{"authors":["Baz Bamigboye For The Daily Mail"],"date_download":"2018-10-22 20:27:08","date_modify":"2018-10-22 20:27:08","date_publish":"2016-01-29 01:37:37","description":"BAZ BAMIGBOYE: Top Broadway actor Andy Karl has won the coveted ‘Bill Murray’ role in a new, musical version of the beloved comedy film Groundhog Day, which will run at the Old Vic.","filename":"data/vaneerConsumption/AndyKarltoplayBillMurrayroleinGroundhogDaymusicalBAZBAMIGBOYEwrites.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/30AD995600000578-0-image-a-35_1454031040418.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422073_BAZ-BAMIGBOYE-s-Groundhog-Day-musical_1540240028.html","title":"Andy Karl to play Bill Murray role in Groundhog Day musical, BAZ BAMIGBOYE writes","title_page":"Andy Karl to play Bill Murray role in Groundhog Day musical, BAZ BAMIGBOYE writes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A top Broadway actor has won the coveted ‘Bill Murray’ role in a new, musical version of the beloved comedy film Groundhog Day.\nThe show will star Andy Karl as the grouchy weatherman stuck in his own time warp in the small Pennsylvania town of Punxsutawney, where he’s gone to cover the quaint local tradition where a bashful rodent ‘predicts’ how long winter will last.\nIn the 1993 movie, directed by Harold Ramis, sourpuss Phil Connors wakes to Sonny and Cher’s I’ve Got You Babe blaring out of the clock radio at the same time, on the same day, day after day after day.\nBAZ BAMIGBOYE: Top Broadway actor Andy Karl (pictured left) has won the coveted ‘Bill Murray’ (right) role in a new, musical version of the beloved comedy film Groundhog Day, which will run at the Old Vic\n‘What if there is no tomorrow?’ Connors wonders in mounting panic. ‘There wasn’t one today.’\nKarl is a big name in New York, having played the title role in the musical Rocky, for which he received a Tony nomination. And he was in the musicals Legally Blonde and 9-5 on Broadway.\nI saw Legally Blonde; and last year watched him give a hilarious turn in On The Twentieth Century, in which he appeared with Kristin Chenoweth.\nHe won the Groundhog Day lead after auditioning on both sides of the Atlantic. In London, he tried out for Matthew Warchus, who will direct the show at the Old Vic (where he’s artistic director) in July.\nAnd, over in New York, he saw producer Scott Rudin, who will move the show to Broadway in March next year, and Danny Rubin, who has adapted his film screenplay for the stage.\nKarl also met and worked extensively with Tim Minchin, who created the music and lyrics, and with choreographer Peter Darling.\nThe creative team of Warchus, Minchin and Darling — plus designer Rob Howell, and executive producer Andre Ptaszynski — have collaborated before, on the Royal Shakespeare Company musical Matilda, which is still playing in London and New York and has become an acclaimed, money-making hit with many overseas productions.\nThe film didn’t win any Oscars, yet it has become one of the most popular romcoms of all-time\nGroundhog Day has had three workshops, but Karl didn’t participate in any of them. Several people, though, have told me that his series of auditions were ‘stunning’.\n‘It’s a role that has a big shadow over it, because of Bill Murray. But Karl captured the darkness, bleakness and humour of it,’ someone who witnessed his auditions, told me.\nEssentially , Groundhog Day will be ‘trying out’ at the Old Vic, where it will run for just ten weeks. But if Warchus and his colleagues can get it right, it could reap long-term rewards in the form of royalties for the London theatre. And if it does work, Karl’s will become a name I won’t have to explain again.\nThe film didn’t win any Oscars, yet it has become one of the most popular romcoms of all-time. Rehearsals will begin in London in early May. The part of the weatherman’s love interest (Andie MacDowell in the film) and other roles are still being cast.\nI finally caught up with Daniel Evans’s production of Showboat, which has now finished its run at Sheffield’s Crucible. And I was struck that a show, written nine decades ago can still resonate.\nAs I wrote here a couple of months back, there are strong rumours that David Ian will transfer the musical, which stars Michael Xavier, Gina Beck, Rebecca Trehearn, Emmanuel Kojo, Lucy Briers, Allan Corduner, Sandra Marvin, Alex Young and Danny Collins (the most amazing dancer I’ve seen in ages) to the New London Theatre in April for a healthy run until January 2017. (Not all of the cast will be available to make the move, alas.)\nNothing can be confirmed until producer Ian sorts out rights issues with the heirs of Jerome Kern and Oscar Hammerstein II.\nBut let’s hope it happens, because it’s a glorious piece of theatre that breaks your heart one minute, and fills it with joy the next.\nSPALL'S ROCKING ON\nRafe Spall heads to Los Angeles in March to film Cameron Crowe’s TV drama series Roadies, about a major rock tour — though you don’t see the band.\n‘You only see the people that work back stage,’ said Spall, who plays a British guy sent by the record label to ‘crack some skulls’ because the rockers are spending too much money (echoes of Crowe’s film Almost Famous, although unlike that one, this is set in the present).\nImogen Poots also stars.\nSpall plays an American in the excellent comedy drama The Big Short, which is set during the financial crash in the U.S. in 2008.\nThe film’s giving The Revenant and Spotlight a run for their money in the Oscar awards race for best picture.\nRafe Spall heads to Los Angeles in March to film Cameron Crowe’s TV drama series Roadies, about a major rock tour — though you don’t see the band\nWATCH OUT FOR...\nSharon D. Clarke, who is superb in director Dominic Cooke’s production of August Wilson’s play Ma Rainey’s Black Bottom. At the electrifying first preview on Wednesday at the National Theatre’s Lyttelton stage, Clarke led a cast that included O-T Fagbenle (an absolute revelation), Lucian Msamati, Clint Dyer, Giles Terra, Finbar Lynch, Stuart McQuarrie, Tamara Lawrance and Tunji Lucas, along with John Paul Connolly.\nIt’s set in jazz-age Chicago and concerns a jealous diva and the exploitation of black musicians. And it’s all pretty damn brilliant.\nMatt Corner, who will portray Frankie Valli in the long-running hit Jersey Boys from March 15 — around about the time the show celebrates its eighth birthday. Simon Bailey, Declan Egan and Matt Hunt also star at the Piccadilly Theatre.\nDavid Hare, who has written a new play called The Red Barn. It’s based on Simenon’s novel La Main. Award-winning Robert Icke will direct this year at the National Theatre.\nAdrian Lester and Charlotte Lucas, who star in the West End debut of Lolita Chakrabarti’s vital play Red Velvet, in which Lester portrays 19th-century actor Ira Aldridge. It explores how Aldridge was denigrated by critics when he took over from Edmund Kean to play Othello. Director Indhu Rubasingham and Chakrabarti have delved deeper into the text since the play ran at the Tricycle Theatre in North London and St Ann’s Warehouse in Brooklyn. It’s now a rare exploration of race and culture and the most important piece of theatre in London. It’s running at the Garrick as part of the Kenneth Branagh season.\nAdrian Lester (left) in Red Velvet and O-T Fagbenle (an absolute revelation) in Ma Rainey’s Black Bottom\nGina McKee and William Postlethwaite, who star in Florian Zeller’s early play The Mother, which has transferred from the Theatre Royal, Bath, to the Tricycle, where it opened this week to tremendous notices (although my esteemed colleague Quentin Letts was unmoved). Tickets have been flying out the door. Now the play is extending by a week, until March 12. A new batch of tickets will be available from 10am this morning.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422073/BAZ-BAMIGBOYE-s-Groundhog-Day-musical.html"}
