{"authors":["Press Association"],"date_download":"2018-10-23 00:15:37","date_modify":"2018-10-23 00:15:37","date_publish":"2017-04-26 09:44:09","description":"The former Labour health secretary said victims were used as \"guinea pigs\".","filename":"data/vaneerConsumption/AndyBurnhamurgesinquiryintocontaminatedbloodscandalcriminalcoverup.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/09/wire-464095-1493196252-404_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4446796_Andy-Burnham-urges-inquiry-contaminated-blood-scandal-criminal-cover-up_1540253737.html","title":"Andy Burnham urges inquiry into contaminated blood scandal `criminal cover-up´","title_page":"Andy Burnham urges inquiry into contaminated blood scandal `criminal cover-up´ | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A “criminal cover-up on an industrial scale” orchestrated over the NHS contaminated blood scandal should be subject to a Hillsborough-style inquiry, Andy Burnham has said.\nHundreds of deaths have been linked to the scandal in which haemophiliacs and others were infected with hepatitis C and HIV from blood products during the 1970s and 1980s.\nThe former Labour health secretary said victims were used as “guinea pigs” and subjected to “slurs and smears” via falsified medical records. Others had tests carried out without their knowledge or consent, with the results withheld “for decades in some cases” even when they revealed positive results.\nHeading to Westminster to give my last speech in the House. Will try to advance the cause of justice for victims of contaminated blood. 1/2 — Andy Burnham (@AndyBurnhamGM) April 25, 2017\nI believe they are victims of a criminal cover-up on an industrial scale. Will present shocking new evidence to substantiate. Time for truth — Andy Burnham (@AndyBurnhamGM) April 25, 2017\nMr Burnham said it had also been suggested that the withholding of results led to infections being passed on to people living with the victims. Speaking in the Commons on Tuesday, Mr Burnham said he would pass his information to the police if the next government does not launch a public inquiry before the summer recess.\nHe told MPs: “I want to refocus everybody on giving victims what they never had – the truth. From what I know I believe this scandal amounts to a criminal cover-up on an industrial scale.”\nMr Burnham, who is standing down as an MP and is favourite to be elected mayor of Greater Manchester next month, said he had been given “direct evidence” of attempts to hide “criminal acts”. He cited three cases including that of Ken Bullock, who died in 1998, and whose widow said his diagnosis of hepatitis had been changed to being a clinical alcoholic in 1983.\nAndy Burnham is standing down as an MP\nMr Bullock’s medical notes, read to the Commons, had changed and appeared to show any mention of blood products stopped “very suddenly”, with hospital records then referring only to “alcoholic damage to the liver”. The moderate drinker was possibly refused a liver transplant based on his falsified medical records saying he was an alcoholic, Mr Burnham said.\nHe said there is a “very disturbing echo” with Hillsborough, in that victims of negligence by the state were “suddenly the victims of smears perpetrated by those working on behalf of public bodies, particularly smears related to alcohol, to suggest the disease that afflicted Mr Bullock’s liver was self-inflicted”.\nThe MP highlighted a 1975 letter from Stanford University’s medical centre to the then UK government-owned blood products laboratory that warned of blood products coming on to the market “from skid row derelicts”. Another letter sent in 1982 from the Oxford Haemophilia Centre to all haemophilia centre directors in England raised concerns about the effectiveness of testing blood for “infectivity” on chimpanzees.\nMr Burnham was asked to submit his evidence to Jeremy Hunt\nCommenting on the letter, Mr Burnham said: “In other words, let’s find out if there’s ‘infectivity’, in their words, in these products by using patients as guinea pigs.”\nHealth minister Nicola Blackwood resisted calls for a fresh inquiry, highlighting the previous release of thousands of government papers, two official reviews and statements to the Commons. However, Ms Blackwood did ask Mr Burnham to submit his dossier of evidence to Health Secretary Jeremy Hunt, and refer any allegations of criminality to the police.","url":"https://www.dailymail.co.uk/wires/pa/article-4446796/Andy-Burnham-urges-inquiry-contaminated-blood-scandal-criminal-cover-up.html"}
