{"authors":["Stuart Fraser For Mailonline"],"date_download":"2018-10-23 00:20:42","date_modify":"2018-10-23 00:20:42","date_publish":"2016-01-29 13:15:36","description":"STUART FRASER IN MELBOURNE: So here we are once again. After a tumultuous five-set battle with big-serving Canadian Milos Raonic, Andy Murray finds himself in a fifth Australian Open final.","filename":"data/vaneerConsumption/AndyMurrayreadyforGroundhogDayaftersettingupfourthAustralianOpenfinalwithNovakDjokovicbutcanhewinit.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B1A9CF00000578-0-image-a-9_1454071953707.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_tennis_article-3422772_Andy-Murray-ready-Groundhog-Day-setting-fourth-Australian-Open-final-Novak-Djokovic-win-it_1540254042.html","title":"Andy Murray ready for Groundhog Day after setting up fourth Australian Open final with Novak Djokovic... but can he win it?","title_page":"Andy Murray ready for Groundhog Day after setting up fourth Australian Open final with Novak Djokovic... but can he win it? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"So here we are once again. After a tumultuous five-set battle with big-serving Canadian Milos Raonic, Andy Murray finds himself in a fifth Australian Open final and a fourth against world No 1 Novak Djokovic.\nBut here is a statistic that perfectly sums up the contrasting fortunes in Melbourne of the current best two players in the world.\nBefore this year, Djokovic had reached five finals here and won all of them. Murray, on the other hand, has contested four finals and lost on each occasion.\nAndy Murray and Novak Djokovic feature in our mocked-up Groundhog Day poster as they prepare to meet in the Australian Open final\nHollywood A-lister Bill Murray starred in the 1993 film 'Groundhog Day', in which he repeats the same day again and again\nMurray celebrates after beating Milos Raonic in a five-set thriller to reach the fifth Australian Open final of his career\nBritish No 1 Murray plays a forehand shot during his comeback victory against Raonic in the semi-finals of the Australian Open\nMurray shakes hands with Raonic after coming from behind to defeat the Canadian 4-6, 7-5, 6-7, 6-4, 6-2 on Friday evening\nANDY MURRAY'S MURRAY'S RECORD VS NOVAK DJOKOVIC AT THE AUSTRALIAN OPEN FINAL 2011: Lost 6–4, 6–2, 6–3 Murray won just nine games in his second Australian Open final as Djokovic blew him away in straight sets to win the second title of his career. 2013: Lost 6–7 (2–7), 7–6 (7–3), 6–3, 6–2 Murray took the first set on a tie-break but a falling feather put him off at a crucial point and Djokovic stormed back to win in four sets. 2015: Lost 7–6 (7–5), 6–7 (4–7), 6–3, 6–0 Murray broke early in the third set with the match poised at one set apiece, but he then lost 12 of 13 games as Djokovic again pipped him to the title.\nSo Sunday is Murray’s very own version of Groundhog Day. Bill Murray may have played Phil Connors, the weatherman stuck in a time loop, in the 1993 film, but it’s his Scottish namesake Andy starring in the Melbourne version.\nMurray’s first final Down Under was in 2010 when he came up against a scintillating performance by Roger Federer, the Swiss winning his 16th Grand Slam title with 6-3, 6-4, 7-6 victory in just one hour and 51 minutes.\nThis being Murray’s second defeat in the final of a Grand Slam, he was reduced to tears on the stage during his runner-up speech, coming out with the memorable line: ‘I can cry like Roger, it’s just a shame I can’t play like him.'\nMurray embraces Djokovic after being defeated in straight sets in the 2011 Australian Open final in Melbourne\nMurray celebrates after sealing victory against Raonic on Saturday - and how he matches up with final opponent Novak Djokovic\nMurray finished as runner-up for the second time in 2011 after losing his first Australian Open final to Roger Federer the previous year\nWATCHING THE FINAL Tennis fans in the UK will be able to watch Murray face Djokovic live - but only on Eurosport. The BBC gave up the rights to the Australian Open last year, meaning the match will not be available on terrestrial TV. And with the final scheduled to start around 8am on Sunday morning, it's unlikely you'll be able to visit your local pub to see it.\nMurray returned to Melbourne the following year and took on Djokovic for the first time in an Australian Open final.\nThe outcome, however, was much the same as the previous year against Federer, Murray this time winning just nine games in a 6-4, 6-2, 6-3 defeat.\nHopes were high ahead of the 2013 final with Murray overcoming his Grand Slam hoodoo the previous summer with a five-set win against Djokovic in the final of the US Open final.\nMany felt that victory at Flushing Meadows would be the key which opened the door to many more Grand Slam titles for Murray.\nBut once again Murray left Melbourne as the beaten man. Coming up against Djokovic once again, Murray at least overcame one hurdle by claiming the opening set, the first time he had won a set in an Australian Open final.\nDjokovic and Murray shake hands after the Serb came from a set down to defeat the British No 1 in four sets in the 2013 final\nMurray looks enviously towards Djokovic as the world No 1 holds the fourth Australian Open trophy of his career in 2013\nGROUNDHOG DAY Bill Murray starred in the 1993 comedy, which told the story of Phil Connors, a Pittsburgh weatherman who goes to cover the annual Groundhog Day event in Punxsutawney. Connors finds himself repeating the same day again and again, and he is unable to break out of the time loop and continue with his life. After failing to kill himself, Connors decides to use his predicament to help others, save lives and teach himself skills including how to play the piano to speak French. He eventually returns to his normal life after falling in love with news producer Rita Hanson, played by Andie MacDowell.\nBut a feather – yes, a feather - floating down onto the court caused him to lose his concentration and Djokovic came back to win 6-7, 7-6, 6-3, 6-2.\nThe 2015 final against Djokovic was perhaps the most frustrating of all. At one set all, Murray was 2-0 up in the third set before suffering a meltdown and losing 12 of the next 13 games in a 7-6, 6-7, 6-3, 6-0 defeat.\nThe collapse led to a blast from former Wimbledon champion Pat Cash, saying Murray ‘needs a good, hard look in the mirror and to get his head together’.\nSo, for the fourth time in six years, Murray and Djokovic meet once again on Sunday in the championship match in Melbourne and there is plenty of history at stake.\nA Djokovic win would see him equal Roy Emerson’s record of six Australian Open defeats. It would also see Murray become the first player in the Open Era (1968 onwards ) to lose five finals at the same Grand Slam.\nIn the film Groundhog Day, Phil Connors eventually breaks free from the time loop and wakes up on February 3 beside his love interest Rita Hansen for the first time.\nWe now await to see if Murray can do the same and wake up this Monday, February 1, beside the Norman Brookes Challenge Cup.\nDjokovic and Murray, who will meet in their fourth Australian Open final against each other on Sunday, shake hands on February 1, 2015","url":"https://www.dailymail.co.uk/sport/tennis/article-3422772/Andy-Murray-ready-Groundhog-Day-setting-fourth-Australian-Open-final-Novak-Djokovic-win-it.html"}
