{"authors":["Reuters Reporter"],"date_download":"2018-10-22 23:38:56","date_modify":"2018-10-22 23:38:56","date_publish":"2016-01-11 06:55:29","description":"Having lost to Novak Djokovic in last year's final and in the 2011 and 2013 title-deciders, world No 2 Andy Murray is under no illusions as to the scale of the task of winning the Australian Open.","filename":"data/vaneerConsumption/AndyMurrayrevealsAustralianOpensuccessisnowhisNo1careergoal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/06/3005748400000578-0-image-a-57_1452495264095.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_tennis_article-3393466_Andy-Murray-hopes-Novak-Djokovic-day-aims-Australian-Open-success_1540251536.html","title":"Andy Murray reveals Australian Open success is now his No 1 career goal","title_page":"Andy Murray reveals Australian Open success is now his No 1 career goal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Finally clinching an elusive Australian Open crown is Andy Murray's No 1 goal for the new year but he concedes that his hopes of success at Melbourne Park may rest on champion Novak Djokovic having an off-day.\nWorld No 1 Djokovic holds three of the four grand slam crowns after a dominant 2015 and started the new season with a bang last week, thrashing Rafael Nadal in straight sets to win the Qatar Open.\nAn awed Nadal described Djokovic's performance in the Qatar final as 'perfection' and the highlights reel has been sober viewing for the Serb's top rivals warming up in Australia.\nAndy Murray was put through his paces by coach Amelie Mauresmo during a practice session\nMurray wipes his forehead as he takes a breather from the session ahead of the Australian Open\nThe world No 2 puts on a heart-rate monitor during the session as his fitness is closely monitored\nMurray trains with his top off as he gets used to the temperature in Australia ahead of the tournament\nHaving lost to Djokovic in last year's final at Melbourne Park and in the 2011 and 2013 title-deciders, world No 2 Murray was under few illusions as to the scale of the task.\n'My No 1 goal is to try and win here,' Murray, who also lost a fourth Melbourne Park final to Roger Federer in 2010, told reporters in Melbourne on Monday.\n'It'd mean a lot because of how may times I've been close.\n'You just have to keep trying to learn, watch his matches, try to see if there's any weaknesses there that you can capitalise on.\n'Maybe he has a drop-off, it's very difficult to maintain that level for such a long period.\n'That's all you can do.'\nWorld No 3 Federer, who lost to Djokovic in last year's Wimbledon and US Open finals, was also impressed by his obliteration of 14-times grand slam champion Nadal in Doha.\n'To some extent it's surprising for sure,' the 34-year-old told reporters after losing the Brisbane International final to Milos Raonic on Sunday.\n'Maybe not so much because he's been on a roll for a while now.\n'Of course, he is the favourite for the Australian Open. Plus he's played well there historically.'\nThe Australian Open starts on January 18.\nMurray takes a brief water break as he talks tactics with his coaching team\nMurray is hoping he can catch Novak Djokovic on a off-day in order to beat the world No 1 in Australia","url":"https://www.dailymail.co.uk/sport/tennis/article-3393466/Andy-Murray-hopes-Novak-Djokovic-day-aims-Australian-Open-success.html"}
