{"authors":["Jenny Awford For Daily Mail Australia"],"date_download":"2018-10-22 22:49:35","date_modify":"2018-10-22 22:49:35","date_publish":"2016-01-29 10:12:35","description":"Andy Murray, whose wife Kim Sears is due to give birth in the next few weeks, will now face Novak Djokovic after winning a four-hour Australian Open semi-final against Milos Raonic.","filename":"data/vaneerConsumption/AndyMurraywinsAustralianOpensemifinalagainstMilosRaonic.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30B269D400000578-0-image-a-42_1454074202222.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422492_Danielle-Knudson-shows-support-boyfriend-Milos-Raonic_1540248575.html","title":"Andy Murray wins Australian Open semi-final against Milos Raonic","title_page":"Andy Murray wins Australian Open semi-final against Milos Raonic | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Scot revealed he has been ready 'lots of baby books' to prepare\nHis wife Kim Sears is due to give birth to their first child in next few weeks\nAndy Murray revealed he has been reading 'lots of baby books' to prepare for the upcoming birth of his first child after storming to the Australian Open final.\nThe Scot, whose wife Kim Sears is due to give birth in the next few weeks, will now face Novak Djokovic after winning a four-hour semi-final against Milos Raonic.\nHe battled to victory in the tense five-set game which saw his opponent plagued by a groin injury - but Kim was nowhere to be seen in the Rod Laver arena as she is believed to be at home in the UK.\nWhen asked in his post-match interview about whether he was ready to be a father, Murray said: 'I mean, I hope so. I'm gonna find out pretty soon.'\nAndy Murray has stormed to victory against Milos Raonic in a tense Australian Open semi-final\nThe Scot will now face Novak Djokovic after winning a four-hour semi-final against Milos Raonic\nMurray's wife Kim Sears (pictured) is due to give birth to the couple's first child in the next few weeks\nThe World Number Two said he hopes he will 'learn on the way' and adapt when they welcome their first child.\n'I've been reading a lot of books and trying to learn but I think obviously when the baby comes you need to be able to just sort of adapt,' he said.\n'I don't think books or any classes or anything will make you a great parent. I will just try and learn on the way and obvious leap with the support of my wife we will try our best to be good parents.'\nHis upcoming match against Djokovic will be Murray's ninth Grand Slam final and he will be sharing the limelight with his brother Jamie, who has reached the doubles final.\n'I never expected to be doing this. Neither of our parents would have expected us to be here so both of us being in a slam final at the same time is pretty incredible,' Murray said.\n'Hopefully he can get the win tomorrow. He was in the final at the US Open and Wimbledon. This is the third one in a row, I hope he can win.'\nRaonic took an early lead in the match and dominated with his explosive serve to win the first set 6-4.\nRaonic was seen limping on the court with a groin injury and had to be treated at the change of ends\nThe Canadian became frustrated in the later stages of the match and was seen smashing his racquet\nDanielle Knudson earlier showed her support for tennis star boyfriend Milos Raonic with an Instagram post\nThe British Number One saw off the semi-final in style, serving his way through the final game without allowing his opponent to win a single point.\nIt took a slight injury to the Canadian to hand Murray the advantage after Raonic had battled into a 2-1 lead.\nBut he was still made to fight hard in the semi-final before coming through 4-6, 7-5, 6-7, 6-4, 6-2 in just over four hours.\n'He definitely slowed down in the fifth set for sure, which was unfortunate for him,' Murray said during his post-match interview.\n'It would have obviously been nice to play a more competitive fifth set because he was struggling with his movement and his serve a little bit.'\nMilos Raonic's model girlfriend Danielle Knudson earlier showed her support by donning an identical outfit to mimic the tennis star.\nThe Guess model posted an image of her wearing the Canadian's sports kit and trainers while striking a copycat pose on Instagram ahead of Friday night's clash.\nBut she was not spotted in the stands of the Rod Laver arena for the tense match - which saw Murray get into a heated debate with the umpire after getting frustrated at the lateness of a line call.\nThe World Number Two said he hopes he will 'learn on the way' and adapt when they welcome their first child\nMurray put on an athletic display throughout the tense match and delighted the packed crowd with some spectacular shots\nMurray got into a heated debate with the umpire after getting frustrated at the lateness of a line call\nThe number 13 seed appears to have been plagued with a groin injury since the fourth set\nThe Scot was heard saying: 'You said in a clear and timely manner, in my opinion that is not in a clear and timely manner.'\nAnd later at the change of ends, the World Number Two told the umpire: 'I hope you're consistent with that through the match now.\n'I hope you are consistent with it. Because to me when you are serving you have to challenge immediately. You can't just take 10 seconds and then go, 'oh yeah'.'\nRaonic took an early lead in the match and dominated with his explosive serve to win the first set 6-4.\nHis serve has proved to be his most dangerous asset and he delivered one 233km/h service to kick off the eighth game of the set.\nMurray took almost an hour to claim his first set of the match, beating the number 13 seed 7-5 in the second.\nHis wife, Kim Sears, was also not seen in the stands as she is expecting the couple's first child in February.\nRaonic's model girlfriend Danielle is believed to have flown to New York for work commitments after spending the past two weeks cheering him on from the sidelines.\nThe World Number Two was seen trying to rile himself up when he lost the first set to the Canadian\nThe Scot was heard saying: 'You said in a clear and timely manner, in my opinion that is not in a clear and timely manner'\nAnd later at the change of ends, the World Number Two told the umpire: 'I hope you're consistent with that through the match now\nMurray soon put the exchange behind him and upped his game to win the second set\nA number of fans were heard chanting for the British Number One at the Rod Laver Arena\nShe took to Instagram ahead of the semi-final in an almost identical outfit to her boyfriend.\n'Now I Look The Part, I Just Need To Work On My Game,' she captioned the picture.\n'This Is Your Year @mraonic , Keep Killing It #fly #Boss #twins #TeamMilos #bestfriend #love #tennis #fun #Australia #AusOpen #melbourne #teamcanada #canadians.'\nKnudson, who has done extensive work with the Guess clothing line, shot to prominence 18 months ago when she caught the attention of pop star Justin Bieber.\nThe singer called her 'stunning' and shared one of her modelling photos on his own Instagram account.\nThe World Number Two took almost an hour to claim his first set of the match, downing Raonic 7-5 in the second\nThousands of spectators packed into the Rod Laver Arena for the semi-final on Friday night\nRaonic took out the first set of the semi-final against Andy Murray, defeating the number two seed 6-4\nRaonic won three of the his first four meetings with Murray, but the Scot has claimed the last two.\nThe British Number One also won the only Grand Slam match between them at the 2012 US Open.\nSpeaking about his development following the win over Wawrinka, Raonic told reporters: 'I think it was more you have these guys, these Grand Slam champions, guys that have been playing great, and to beat one of them for the first time at a Slam, doesn't matter if that was on Court 15 or whichever court.\n'It has a very concrete sort of message to the work I'm putting in and how I'm going about things.'\nKnudson has been a regular court-side supporter for Raonic during the Australian Open in Melbourne\nThe Canadian supermodel was called 'stunning' by pop singer Justin Bieber in the summer of 2014\nKnudson and Raonic pose for a photo together while enjoying a beach holiday last month\nRaonic won three of the his first four meetings with Murray, but the Scot has claimed the last two","url":"https://www.dailymail.co.uk/news/article-3422492/Danielle-Knudson-shows-support-boyfriend-Milos-Raonic.html"}
