{"authors":["John Mcgarry For The Scottish Daily Mail"],"date_download":"2018-10-22 20:18:44","date_modify":"2018-10-22 20:18:44","date_publish":"2016-01-28 00:54:16","description":"Mark Warburton revealed that officials told him Andy Halliday’s gesture at Cappielow on Monday could have incited ‘a riot or trouble’. The Rangers midfielder was shown a second yellow card.","filename":"data/vaneerConsumption/AndyHallidaysgestureatMortoncouldhaveincitedariotclaimofficials.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/00/30926AFC00000578-0-image-a-9_1453942413223.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3420212_Andy-Halliday-s-gesture-Morton-incited-riot-claim-officials_1540239524.html","title":"Andy Halliday's gesture at Morton could have incited a riot, claim officials","title_page":"Andy Halliday's gesture at Morton could have incited a riot, claim officials  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"His second yellow card was for the manner of his celebration\nAndy Halliday was sent off for Rangers against Greenock Morton\nMark Warburton revealed that officials told him Andy Halliday's gesture at Cappielow on Monday could have incited 'a riot or trouble'.\nThe Rangers midfielder was shown a second yellow card after celebrating Barrie McKay's clinching goal in the Championship clash to retain their five-point lead at the top of the table.\nDespite his side's clinical display, the major talking point of the game became the circumstance of Halliday's sending off — for which there are no grounds for appeal.\nAndy Halliday celebrated Rangers second goal by gesturing towards the Morton fans\nWarburton expressed his deep frustration at referee Barry Cook's decision and will ask the SFA for clarification over the call.\n'The explanation was that Andy made a gesture that could incite a riot or trouble with the Morton fans,' he told Rangers TV. 'I think that if a player runs up to a set of fans and makes a gesture in front of them in an intimidating manner, then I understand absolutely that the last thing anyone wants to see is any fan trouble or anyone hurt.\n'It's in the middle of the pitch and he's walking back in front of the Rangers fans.\n'I will aim to seek some clarity and an explanation, but I think everyone in football knows that if we start to go down that route in football then we would be booking and sending players off every time there is a game played.'\nHalliday will sit out Saturday's clash with title rivals Falkirk as a result of Cook's decision — a fact the Rangers manager finds hard to rationalise.\nHalliday was shown a second yellow card after celebrating Rangers' goal against Morton\n'I just find the whole process and decision frustrating beyond belief,' Warburton added.\n'We will lose an important player in an important game in front of a packed Ibrox and we have got to look and ask ourselves: Is that right?\n'I watched the game when I got home on TV and you see them talking about the goal, talking about the great finish and the one-two, then you see Andy Halliday looking bemused.\n'He can't work out what has gone on. Look at our bench, we get no dialogue and that's not a good enough process.\n'Look at the core point, a player has been awarded a second yellow, been booked, for celebrating a goal. I understand that if your shirt comes off you are booked. He literally raised his hand in a clenched fist in terms of saying: 'We've scored a second goal', a big goal in front of the fans.","url":"https://www.dailymail.co.uk/sport/football/article-3420212/Andy-Halliday-s-gesture-Morton-incited-riot-claim-officials.html"}
