{"authors":["Lucy Thackray For Daily Mail Australia"],"date_download":"2018-10-22 23:44:15","date_modify":"2018-10-22 23:44:15","date_publish":"2016-01-11 07:13:08","description":"Andy Murray and his wife Kim Sears are due to welcome their first child next month, pictured the Scot is seen stretching during a training session in Melbourne ahead of the Australian Open.","filename":"data/vaneerConsumption/AndyMurraysayshellalwaysputfamilyfirstashepreparesforAustralianOpen2016.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/07/3005B85100000578-0-image-a-23_1452496221601.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393479_Andy-Murray-reveals-family-prepares-Australian-Open_1540251855.html","title":"Andy Murray says he'll always put family first as he prepares for Australian Open 2016","title_page":"Andy Murray says he'll always put family first as he prepares for Australian Open 2016 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Andy Murray has revealed that his baby will become his number one priority over tennis as he gears up to battle for his first ever Australian Open win.\nThe Scot, 28, and his wife Kim Sears are due to welcome their first child next month and despite the huge career goals he still has ahead of him, Murray said tennis will be taking a backseat.\n'A lot of people have asked how (the baby) will affect my career. Number one is that the baby obviously becomes the priority and tennis is my second priority,' Murray told media on Monday.\n'I'm looking forward to it, it's exciting. It's going to be a big challenge but hopefully I can be a good dad.'\nAndy Murray has revealed that his baby will become his number one priority over tennis as he gears up to try and claim his first ever Australian Open win\nHe was seen carrying out an intense stretching routine in 35C degree during a training session on the tennis courts on the rooftop at Melbourne's Crown Casino\nThe baby will join the World Number Two on tour and far from being a distraction, Murray believes it may actually help improve his game.\n'A lot of players now have families. Novak had a child last year, Roger travels with four children - he's got two sets of twins - so a lot of players are travelling and they have a family which seems to be affecting them in a very positive way,' Murray said.\n'I'm actually not nervous, a few weeks ago I was but now I'm quite excited. It's only four and a half, five weeks away so as soon as I'm back from here (Australia) I have that to look forward to.\nMurray says he's also been 'getting in practice' with his coach Amelie Mauresmo's five month old son who travels with them on the circuit.\nMurray married Kim Sears in the tennis player's hometown of Dunblane in April last year and they announced the news of the pregnancy to friends and family four months later\nThe Scot and his wife are due to welcome their first child next month, pictured is Kim at the Davis Cup final in Ghent, Belgium, in November 2015\nHe was seen carrying out an intense stretching routine in 35C degree during a training session on the tennis courts on the rooftop at Melbourne's Crown Casino.\nThe tennis champion is incredibly close to being the best player in the world, with his impressive number two ranking.\nBut the Scot admitted that his main goal isn't to assume the top spot, but rather to finally win his first ever Australian Open.\n'I would love to try to get to number one but my main goal is to try and win here,' Murray said.\nThe 28-year-old has been runner up in Australia four times but is yet to triumph at the Melbourne Grand Slam.\nThis comes despite his record breaking achievements, including being the first British man to win Wimdbledon in 77 years and claiming the Davis Cup for Great Britain two months ago for the first time in 79 years.\nMurray revealed his main goal isn't to assume the world number one ranking, top spot, but rather to finally win his first ever Australian Open\nWhile sweltering through a training sessions, Murray showcased his top of the range Under Armour clothing which uses NASA technology to combat the heat\nMurray admits he's pulling out all stops, changing his training by incorporating 10 days in Dubai to give himself his best chance at winning the Australian Open, which starts on January 18\nThe baby will join the World Number Two on tour and far from being a distraction, Murray believes it may actually help improve his game\n'I love playing here and I've played some of my best tennis here. I just unfortunately haven't been able to win in the finals, I've just not managed to get over the final hurdle,' Murray said.\n'Hopefully this year if I keep working hard and keep giving myself opportunities hopefully one day I'll be able to win.'\nMurray admits he's pulling out all stops, changing his training by incorporating 10 days in Dubai and using the best possible technologies to give himself his best chance at winning the Australian Open, which starts on January 18.\nWhile sweltering through a training session, Murray showcased his top of the range Under Armour clothing which uses NASA technology to combat the heat.\n'I've got here (a week) earlier than I ever have before,' said Murray.\nThe tennis champion is incredibly close to being the best player in the world, with his impressive number two ranking\nBut the Scot admitted that his main goal isn't to assume the top spot, but rather to finally win his first ever Australian Open\n'I arrived here two weeks ago... So by the time the Open starts I'll have been here three weeks. Hopefully that helps me acclimatise and get over the jet lag.'\n'In Perth it is was 43 degrees on one day of training and 40 on another. When you are playing in these condition you want products to perform as well. I'm doing everything I can to win the Open but it's going to be tough.'\nMurray says it's crucial to use the most sophisticated technologies when training and competing due to the incredibly close competition between the top seeds - and even underdogs like Australian Nick Kyrgios who managed to defeat the Scot in three sets last week at Perth's Hopman Cup.\nA heat wave predicted to hit Melbourne will only make the challenge harder.\n'When you're in intense conditions it's extremely tough. You need to stay hydrated, sunscreen, iced towels through the match. I try take on as much food as I can before the match. You need anything you can to give you an extra edge when it's 49 degrees.'\n'To win, you need the best clothing, stats, data, video analysis. So much goes into being an athlete now,' Murray said.","url":"https://www.dailymail.co.uk/news/article-3393479/Andy-Murray-reveals-family-prepares-Australian-Open.html"}
