{"authors":["Kieran Gill For The Daily Mail"],"date_download":"2018-10-23 03:47:09","date_modify":"2018-10-23 03:47:09","date_publish":"2016-01-29 19:00:59","description":"KIERAN GILL: Viewers will not be able to watch Andy Murray’s Australian Open final against Novak Djokovic live on free-to-air television after the BBC cut their coverage of the first Grand Slam of the year.","filename":"data/vaneerConsumption/AndyMurraysbidforAustralianOpenglorywillnotbetelevisedliveonBBCfollowing35mofbudgetcutsbytheCorporation.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/18/30B28BDE00000578-0-image-a-4_1454093241964.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_tennis_article-3423265_Andy-Murray-s-bid-Australian-Open-glory-not-televised-live-BBC-following-35m-budget-cuts-Corporation_1540266429.html","title":"Andy Murray's bid for Australian Open glory will not be televised live on BBC following £35m of budget cuts by the Corporation","title_page":"Andy Murray's bid for Australian Open glory will not be televised live on BBC following £35m of budget cuts by the Corporation  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Viewers will not be able to watch Andy Murray’s Australian Open final against Novak Djokovic live on free-to-air television after the BBC cut their coverage of the first Grand Slam of the year.\nNo live action from Melbourne will be shown on the BBC after the Australian Open became the latest victim of £35million of cuts the Corporation is making to its sports budget.\nThe BBC have prioritised events such as Wimbledon and Barclays Premier League highlights on Match of the Day at the expense of Formula One, live coverage of the Open Golf Championship, darts and snooker. Red button services are also facing the axe, while the BBC has lost control of the rights to the Olympic Games from 2022 onwards after being outbid by US broadcaster Discovery.\nAndy Murray waves to the crowd following his 4-6, 7-5, 6-7, 6-4, 6-2 victory against Milos Raonic\nRaonic got off to a good start winning the first set 6-4 - but was pegged back in the second set\nMurray was frustrated with his form as he lost the first set of the semi-final\nMurray’s finals against Djokovic in 2013 and 2015 pulled in five million and four million viewers respectively on the BBC, but this year’s event will be broadcast exclusively by Eurosport.\nViewers can watch Countryfile on BBC Two or a repeat of Saturday night’s FA Cup highlights on BBC One while last year’s Sports Personality of the Year winner starts his bid for victory in Melbourne.\nIt leaves the BBC with radio and text commentary, as well as a highlights show presented by Sue Barker from the UK on Sunday afternoon.\nMurray had to come back from a set down but looked strong in the second set\nMurray's army of fans were once again out in force to support the World No 2\nRaonic caused an upset earlier in the tournament when he beat former champion Stan Wawrinka\nMurray and Raonic shake hands after their five set semi-final match\nEurosport previously sub-contracted coverage to the BBC for the semi-finals and finals, and recently renewed their exclusive rights to screen the Australian Open through until 2021.\nThe move made Wimbledon the last remaining Grand Slam tournament that will have live matches shown by the BBC.\nMary Pope, the chairwoman of the British Association of Tennis Supporters, said: ‘It is definitely disappointing. The Davis Cup final, which was shown live on the BBC, generated such a lot of interest and attracted non-tennis fans so it is an opportunity missed by the BBC.\nMurray will take on his old foe Novak Djokovic (pictured) in the the final in Melbourne on Sunday\n‘It has been fantastic to have so much success with Andy [Murray], Jo [Konta] and Jamie Murray in the men’s doubles as well so it is particularly unfortunate. Only those people with access to Eurosport will be able to watch the final live so the numbers will significantly lower.\n‘As the BBC are showing highlights, it is surprising that they have not changed their plans and decided to show the final live on the red button at least. The red button is ideal to show tennis where the length of matches cannot easily be predicted and is available to all.’","url":"https://www.dailymail.co.uk/sport/tennis/article-3423265/Andy-Murray-s-bid-Australian-Open-glory-not-televised-live-BBC-following-35m-budget-cuts-Corporation.html"}
