{"authors":["Mike Dickson For Mailonline"],"date_download":"2018-10-23 00:03:00","date_modify":"2018-10-23 00:03:00","date_publish":"2016-01-29 12:47:10","description":"MIKE DICKSON IN MELBOURNE: The Australian Open title has proved devilishly elusive for Andy Murray but he will get a fifth shot at claiming one after a gruelling battle to defeat Milos Raonic.","filename":"data/vaneerConsumption/AndyMurraythroughtohisfifthAustralianOpenfinalafterfivesetepicwithMilosRaonicandoldfoeNovakDjokovicawaits.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30B28D2200000578-0-image-a-60_1454073540080.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_tennis_article-3422530_Andy-Murray-fifth-Australian-Open-final-five-set-epic-Milos-Raonic-old-foe-Novak-Djokovic-awaits_1540252980.html","title":"Andy Murray through to his fifth Australian Open final after five set epic with Milos Raonic... and old foe Novak Djokovic awaits","title_page":"Andy Murray through to his fifth Australian Open final after five set epic with Milos Raonic... and old foe Novak Djokovic awaits | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Australian Open title has proved devilishly elusive for Andy Murray but he will get a fifth shot at claiming one after a gruelling battle to defeat Milos Raonic.\nMurray, refusing to go quietly and, taking advantage of the Canadian's deteriorating physical state, was made to fight hard in the semi-final before coming through 4-6, 7-5, 6-7, 6-4, 6-2 just over four hours.\nHe now meets Novak Djokovic for the fourth time in a final here, and will somehow have to turn round a record that has seen him lose ten of their last eleven encounters. Brother Jamie plays the doubles final on Saturday night local time.\nAndy Murray celebrates booking his place in the Australian Open final after a five set win over Milos Raonic\nRaonic got off to a good start winning the first set 6-4 - but was pegged back in the second set\nMurray was frustrated with his form as he lost the first set of the semi-final\nMurray's coach Amelie Mauresmo and trainer Matt Little cheer their man on to victory\nMURRAY'S RECORD VS DJOKOVIC AT AUSTRALIAN OPEN FINAL 2011: Lost 6–4, 6–2, 6–3 Murray won just nine games in his second Australian Open final as Djokovic blew him away in straight sets to win the second title of his career. 2013: Lost 6–7 (2–7), 7–6 (7–3), 6–3, 6–2 Murray took the first set on a tie-break but a falling feather put him off at a crucial point and Djokovic stormed back to win in four sets. 2015: Lost 7–6 (7–5), 6–7 (4–7), 6–3, 6–0 Murray broke early in the third set with the match poised at one set apiece, but he then lost 12 of 13 games as Djokovic again pipped him to the title.\nBar a difficult fourth round against Gilles Simon the singles world No 1 has been in irresistible form and had the pleasure of sitting back, relaxing and watching Murray toil.\nIt was comfortable enough in the end, but with the finish close to midnight Murray has to recover from this huge tussle against the Canadian. Underpinned by his huge serve, was good value for his two sets to one lead before physical problems set in, although he was never totally incapacitated.\nMen's tennis has waited a long time for a new name to conjure with around the very top of the game, and might just have found one in Raonic.\nThe big Canadian, already the conqueror of Stan Wawrinka, was producing a further career-best performance and was thwarted by an apparent injury to his lower back on the right side that developed after the third set. Staying healthy has been a problem all his career.\nOn a cool night in Melbourne Raonic walked out for his second Grand Slam semi-final looking as well-groomed as ever while Murray seemed like he had just risen from his bed.\nMurray has recently stamped out his habit of starting slowly, or so it appeared until now. In this match he played a terrible first game, including a double fault, to be broken to love. Three break points in the next game went begging and that settled the Canadian, who in the sixth game banged down a service winner at 145 miles per hour.\nThe Canadian was also assured in the rallies – while being something of a lumpy mover he is definitely more than just a power merchant.\nMurray had to come back from a set down but looked strong in the second set\nMurray's army of fans were once again out in force to support the World No 2\nThe British fans were making themselves heard as they cheered Murray on to victory\nMurray looked a lot better in the second set and broke Raonic's serve to win it 7-5\nWATCHING THE FINAL Tennis fans in the UK will be able to watch Murray face Djokovic live - but only on Eurosport. The BBC gave up the rights to the Australian Open last year, meaning the match will not be available on terrestrial TV. And with the final scheduled to start around 8am on Sunday morning, it's unlikely you'll be able to visit your local pub to see it. But don't worry, you can follow all the action right here on MailOnline.\nAs often happens, Murray began to read his opponent's serve better in the second set, but he could not convert a break point in the second game or the sixth game. The latter was a missed cross court backhand into the net – the kind of shot that is his bread and butter.\nHe was constantly gnawing away at the Raonic serve and adding to the pressure, which finally told at 6-5. Murray got to deuce and then took advantage of two relatively weak serves. On the second one he drilled it back at the advancing Raonic, whose backhand volley thumped into the net.\nBoth players dominated on serve until the latter part of the third set, when Murray began to slip and needed to save a break point at 5-5, which he did when Raonic netted off a backhand, his less reliable side.\nThe Rod Laver Arena was packed for the second semi-final between Murray and Raonic\nRaonic caused an upset earlier in the tournament when he beat former champion Stan Wawrinka\nThere could be no arguing about the tiebreak. Raonic served potently throughout, although an overhead putaway at 4-2 was surely much closer than he intended and it shaved the line. His inside out forehand was outstanding, as it was in the whole match, and he deservedly took it 7-4.\nRaonic went off for some physio attention to his lower back after the third game, and came back fired up, although Murray was, too. 'Do your frigging job,' Raonic yelled at umpire Jake Garner after he failed to overrule an errant call off a Murray backhand.\nWhen Murray, getting to grips with the serve coming at his body, broke him for 4-3 it was the first time Raonic had been broken to love since last summer's Wimbledon.\nMurray plays a backhand return in his semi-final clash with Raonic as he made it to his fifth final\nMurray gestures as he argues with the chair umpire Jake Garner about a Raonic challenge\nMurray hits a shot during his semi-final match against Raonic as he bids to face Djokovic in another final\nMurray plays a return close to his body as he lost the third set narrowly on a tie break\nBy now Raonic started to feel his lower back or hip on the right side and there was some grimacing going on from the Canadian.\nDespite that he had a break point at 3-4 and two more at 4-5, while Murray missed a set point with a wide backhand that would have allowed him to serve first in the decider.\nAt the end of the set Raonic smashed his racket into the ground. He knew his chance had gone, although he kept running to the end.\nRaonic was ahead again after taking a tight third set on a tie-break\nMurray appeared to get stronger as the match went on and went through in five sets\nRaonic struggled in the fifth set and was unable to compete with Murray as he lost the set 6-2\nMurray is at full stretch to return a shot against Raonic as he won in five sets\nMurray and Raonic shake hands after their five set semi-final match\nMurray celebrates making it through to his fifth Australian Open final - fourth against Djokovic\nRaonic sits on his bench looking completely dejected after losing to Murray in five sets\nMurray waves to the crowd as he leaves the court after winning his five set match\nMurray signs autographs for the fans after his semi-final win over Raonic\nMurray emphasised afterwards how Raonic had made life difficult: 'It was tough because he played well in the third set, in the tiebreak he didn't miss one first serve. He obviously has one of the best serves in tennis. It's frustrating when you don't have much say in the points.\n'I was able to get a much better read on his serve and that was they key. He definitely slowed down in the fifth set which was unfortunate for him.'\nOn facing his nemesis Djokovic he said: 'When you are playing against the best in the world, you can't afford to do anything poorly. I need to execute my game plan well, not have any lapses in concentration. We've played a bunch of times here and hopefully this time can be a different result.'","url":"https://www.dailymail.co.uk/sport/tennis/article-3422530/Andy-Murray-fifth-Australian-Open-final-five-set-epic-Milos-Raonic-old-foe-Novak-Djokovic-awaits.html"}
