{"authors":["Press Association"],"date_download":"2018-10-23 01:35:54","date_modify":"2018-10-23 01:35:54","date_publish":"2016-01-29 15:37:13","description":"Former SAS sergeant Andy McNab has hailed the role of Land Rover Defenders in the British military after the last one rolled off the production line. He said...","filename":"data/vaneerConsumption/Andymcnabcelebrateslandroverasfinaldefenderrollsoffproductionline.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-2ebd735f-86d3-449f-85a1-4f02520a67de-3bmscybNe842cce83474b575ec81-382_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3422781_Andy-McNab-hails-military-workhorse-final-Land-Rover-Defender-produced_1540258554.html","title":"Andy mcnab celebrates land rover as final defender rolls off production line","title_page":"Andy mcnab celebrates land rover as final defender rolls off production line | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Andy McNab celebrates Land Rover as final Defender rolls off production line\nFormer SAS sergeant Andy McNab has hailed the role of Land Rover Defenders in the British military after the last one rolled off the production line.\nHe said Land Rovers have been \"synonymous\" with the Armed Forces because they act as a \"huge weapons platform\".\nCurrent and former workers at the Jaguar Land Rover (JLR) plant in Solihull, West Midlands, cheered as the final Defender was presented, with its lights flashing and horn blaring.\nThe last Land Rover Defender coming off the production line at Solihull (Jaguar Land Rover/PA)\nJLR used the occasion to announce the launch of a heritage restoration programme for what is one of the most-loved and long-lived road vehicles.\nMore than two million of the 4x4s have been built over the past 68 years.\nA team of experts will restore a number of early Land Rovers at the Solihull plant, with the first ones going on sale in July.\nThe scheme will also ensure spare parts are made available to enable existing owners to keep their cars on the road.\nMotoring experts said production was ended because of difficulties in meeting modern safety and emissions standards.\nMcNab, now a successful author, recently bought his own Defender after learning that no more new ones would be made.\n\"I got one at the end of last year because of this,\" he told the Press Association.\n\"I love them. I learned to drive in one. They've always been there because it's been the main vehicle for the military since about the Fifties.\"\nHe described Defenders as \"t he basic workhorse\" and compared them favourably to the US Army's equivalent.\n\"The American Humvee is a great machine but it's so wide and cumbersome,\" he explained.\n\"The larger machines can't get into areas as quickly as Land Rovers, it's as simple as that. They're fantastic.\"\nDefenders are a favourite with the Queen and have featured in a number of films such as James Bond movie Skyfall and Edge Of Tomorrow starring Tom Cruise.\nThe vehicle , which was exported all around the world, represented the continuation of the very first Land Rover which arrived on the scene in April 1948 and was modelled on the wartime Jeeps.\nJLR chief executive Dr Ralf Speth told the gathering of workers in Solihull that the vehicle is \"the origin of our legendary capability\".\nHe said: \"(It is) a vehicle that makes the world a better place, often in some of the most extreme circumstances.\n\"There will always be a special place in our hearts for Defender, among all our employees, but this is not the end. We have a glorious past to champion and a wonderful future to look forward to.\"\nJim Holder, editorial director of magazines Autocar and What Car?, said Defenders \"appeal to every level of society\".\nHe told the Press Association: \"It's a classless vehicle. Anyone can drive it. You might be a farmer trying to get over the muddiest field or it might be the Queen driving around Windsor. Neither would surprise you if you saw it.\"\nMr Holder believes JLR made the decision to cease production of Defenders because \"regulations have finally caught up with it\".\nHe said: \"They haven't been able to update crash safety or the engine emissions quick enough.\n\"The world has overtaken it to a point where they can no longer keep on the right side of emissions and safety laws.\"\nJLR is working on a replacement vehicle for the Defender, but Mr Holder claimed it will be a \"massive challenge\" to match the status of the original.\nStaff applauded as the last Defender rolled off the production line at Solihull (Jaguar Land Rover/PA)\nProduction has ended of the Land Rover Defender marque (Jaguar Land Rover/PA)\nFile photo dated 29/01/00 of Queen Elizabeth II driving herself in a Land Rover Defender 110 to the stables on the Sandringham Estate in Norfolk, as one of the most-loved and long-lived road vehicles, and a favourite with the Queen, will cease production when the last Land Rover Defender will be produced by Jaguar Land Rover (JLR) at Solihull in the West Midlands on Friday.\nFile photo dated 03/08/57 of Queen Elizabeth II riding in a Land Rover with the Duke of Edinburgh, through the World Scout Jubilee Jamboree camp in Sutton Park, Warwickshire, as one of the most-loved and long-lived road vehicles, and a favourite with the Queen, will cease production when the last Land Rover Defender will be produced by Jaguar Land Rover (JLR) at Solihull in the West Midlands on Friday.\nFile photo dated 19/10/06 of Royal Marines using a Land Rover during a live firing demonstration at Salisbury Plain, Wiltshire, as one of the most-loved and long-lived road vehicles, and a favourite with the Queen, will cease production when the last Land Rover Defender will be produced by Jaguar Land Rover (JLR) at Solihull in the West Midlands on Friday.\nFile photo dated 19/08/09 of members of The 40th Regiment The Royal Artillery in a snatch Land Rover during a patrol in Lashkar Gah, Afghanistan, as one of the most-loved and long-lived road vehicles, and a favourite with the Queen, will cease production when the last Land Rover Defender will be produced by Jaguar Land Rover (JLR) at Solihull in the West Midlands on Friday.\nFile photo dated 01/04/13 of a PSNI Land Rover Defender under attack, as one of the most-loved and long-lived road vehicles, and a favourite with the Queen, will cease production when the last Land Rover Defender will be produced by Jaguar Land Rover (JLR) at Solihull in the West Midlands on Friday.\nFile photo dated 03/04/66 of the Marquess of Bath, backed by an armed warden, watching a lion at his \"game reserve\" at his ancestral Wiltshire home in Longleat. One of the most-loved and long-lived road vehicles, and a favourite with the Queen, will cease production when the last Land Rover Defender will be produced by Jaguar Land Rover (JLR) at Solihull in the West Midlands on Friday.\nA Land Rover Defender during the press launch for the cars of Spectre joining the Bond in Motion exhibition at the London Film Museum in London.\nFile photo dated 30/11/96 of members of the Royal Archers escorting the Army Land Rover carrying the Stone Of Destiny across Edinburgh Castle Esplanade, as one of the most-loved and long-lived road vehicles, and a favourite with the Queen, will cease production when the last Land Rover Defender will be produced by Jaguar Land Rover (JLR) at Solihull in the West Midlands on Friday.\nFile photo dated 12/04/63 of an Automobile Association Land Rover in a blizzard helping another motorist in difficulties, as one of the most-loved and long-lived road vehicles, and a favourite with the Queen, will cease production when the last Land Rover Defender will be produced by Jaguar Land Rover (JLR) at Solihull in the West Midlands on Friday.","url":"https://www.dailymail.co.uk/wires/pa/article-3422781/Andy-McNab-hails-military-workhorse-final-Land-Rover-Defender-produced.html"}
