{"authors":[],"date_download":"2018-10-23 05:35:29","date_modify":"2018-10-23 05:35:29","date_publish":"2015-05-26 00:00:00","description":"In his memoir Do No Harm, Henry Marsh confesses to the uncertainties he's dealt with as a surgeon, revisits his triumphs and failures and reflects on the enigmas of the brain and consciousness.","filename":"data/vaneerConsumption/ANeurosurgeonReflectsOnTheAweAndMysteryOfTheBrain.json","image_url":"https://media.npr.org/assets/img/2015/05/26/do-no-harm_wide-fcb2f9a33aea31d85f1052a66c762eb056cf7a33.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=409719011_1540272929.html","title":"A Neurosurgeon Reflects On The 'Awe And Mystery' Of The Brain","title_page":"A Neurosurgeon Reflects On The 'Awe And Mystery' Of The Brain : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"TERRY GROSS, HOST:\nThis is FRESH AIR. I'm Terry Gross. My guest has opened heads, cut into brains and performed the most delicate and risky surgeries on the part of the body that controls everything - breathing, movement, memory, consciousness. In his work as a neurosurgeon, Dr. Henry Marsh has fixed aneurysms and spinal problems, but now he mostly operates on brain tumors.\nIn his new memoir, \"Do No Harm,\" Dr. Marsh discusses some of his most challenging cases - the triumphs and failures - and confesses to the fears and uncertainties he's dealt with. He explains the surgical instruments he uses and how procedures have changed since he started practicing. And he reflects on the state of his profession and the mysteries of the brain and consciousness.\nMarsh has been a consulting neurosurgeon at Atkinson Morley's Saint George's Hospital in London since 1987. He was the subject of the Emmy Award-winning 2007 documentary \"The English Surgeon,\" which followed him in Ukraine, trying to help patients and improve conditions at a rundown hospital.\nDr. Henry Marsh, welcome to FRESH AIR. The first thing I'd like you to do, since the book is so well-written, is to read the opening paragraph. I don't think you could put this description of an aspect of brain surgery any better than you did in this paragraph, so why don't you just read it for us?\nHENRY MARSH: I often have to cut into the brain, and it is something I hate doing. With a pair of diathermy forceps, I coagulate the beautiful and intricate red blood vessels that lie on the brain's shining surface. I cut into it with a small scalpel and make a hole through which I push with a fine sucker. As the brain has the consistency of jelly, the sucker is the brain surgeon's principal tool.\nI look down my operating microscope, feeling my way downwards through the soft white substance of the brain, searching for the tumor. The idea that my sucker is moving through thought itself, through emotion and reason - that memories dreams and reflections should consist of jelly - is simply too strange to understand. All I can see in front of me is matter. Yet I know that if I stray into the wrong area, into what neurosurgeons call eloquent brain, I'll be faced by a damaged and disabled patient when I go around to the recovery ward after the operation to see what I've achieved.\nGROSS: That's Henry Marsh reading from the opening of his new memoir \"Do No Harm: Stories Of Life, Death And Brain Surgery.\" I just have to ask you - how much do you think about, when you're doing brain surgery, that you're actually cutting through the memories, dreams and reflections - the consciousness of the person who you're operating on?\nMARSH: You don't, but you do worry about how the patient will be as a person afterwards. So you don't - I mean, surgery of this sort - 'cause most brain surgery is dangerous - is very exciting. You're concentrating very hard. But what makes it exciting is, of course, your anxiety of if the patient's going to be all right afterwards.\nGROSS: You mention, in the reading you just to did, the sucker, which is a tool that you use. What is it?\nMARSH: Well, it's a microscopic vacuum cleaner. If you're actually operating on the substance of the brain itself, you don't sort of cut it or stitch it or burn it. You simply run this very thin metal tube. The internal damage is about two millimeters through the substance of the part of the brain you're operating on.\nGROSS: Wait, so you use the sucker to get deeper in or to suck it out? Or...\nMARSH: Well, it depends on what you're doing. But, I mean, with some - it depends - it depends on the type of operation. With some operations, you're removing tumors or operating on blood vessels outside the brain, so you're trying not to damage the brain. But with other operations, you actually have to make an opening in the brain to remove either part of the brain if, say, it's causing epilepsy or if a tumor's actually within the substance of the brain itself. And then the main instrument you use is a miniature, microscopic vacuum cleaner.\nGROSS: You mostly operate on brain tumors, and you describe the different consistencies of brain tumors and that some are stuck to the brain and some can be cored out easily.\nMARSH: Yes.\nGROSS: Give us an example of a kind of common problem you run into when trying to remove a brain tumor.\nMARSH: Well, it depends. There are - brain tumors are either cancerous or noncancerous. The cancerous ones are usually actually growing within the brain itself. They are, in a sense, part of the brain or were part of the brain and are now growing out of control. And with these tumors, you don't have a clear boundary between the tumor and the brain. And you can never remove all of the tumor because the tumor's actually invading. Because of the substance of the brain is soft, it doesn't form a barrier against the tumor. So you have an area where the tumor's tangled up with the brain itself, which is why so many cancerous brain tumors cannot be cured. We can only prolong life, but we can't actually get rid of the tumor completely.\nBut then there are a different set of tumors which are called brain tumors, but they're really tumors of the lining of the skull - the meninges, which are called meningiomas - oma is a medical suffix from the Greek for a tumor - or of the nerves where they come off the brain. And these are tumors that don't actually grow into the brain, but squeeze the brain, press into - press on to the brain. And then you hope to remove a tumor completely. But the problem with those tumors is that often, the nerves for the head and eyes can be stuck to the tumor, or the major blood vessels that come up beneath the brain to take blood to the brain can be stuck to the tumor. And then there is a risk of serious injury and damage if you damage the arteries or the nerves. And that can be quite delicate dissection to separate the tumor off.\nGROSS: And as you point out, a quarter of the blood pumped by the heart goes to the brain, so you have to deal...\nMARSH: The brain's a mass of blood vessels. Thinking is a very energy-intensive process. And in fact, most brain activity goes on at an unconscious level we're not really aware of. And it burns up energy, and therefore, the brain is a mass of small blood vessels. And a large part of brain surgery is trying to stop bleeding or deal with it if it occurs. And some brain tumors can be very, very bloody with lots of blood vessels in the tumor itself.\nGROSS: So some tumors are made up of blood vessels. I mean, that must be really hard.\nMARSH: They can be, virtually. Yes. Yes, they're the tumor's called hemangioblastomas - almost just solid blood vessels.\nGROSS: If you're just joining us, my guest is neurosurgeon Dr. Henry Marsh, who's written a new memoir called \"Do No Harm: Stories Of Life, Death And Brain Surgery.\" So you describe in the book a little bit what you have to do when you're opening up the head for surgery. And one of the things you have to do for some surgeries is drill a hole in the skull. And it's just, you know, for someone who's never had brain surgery and certainly never performed it, it's just so hard to imagine having a hole drilled in your head, a hole that leaves blood and dust that has to be cleaned up.\nMARSH: Yes, it's very - it's very physical, isn't it? But, I mean, if you have a - if you have a serious medical problem and you trust the doctor, in my experience, most people put up with it. They're frightened, but they know that the alternative is worse. The difficulties are - there's this old myth. It isn't brain surgery. Brain surgery's incredibly difficult and delicate and exquisite. In fact, in many ways other branches - some other branches of surgery, such as eye surgery, for instance, which I've had myself for retinal detachments, in many ways, is more exquisite. The instruments are finer and more delicate.\nBut what is, I think, peculiar about brain surgery is it's so dangerous because a very small area of damage to the brain can cause catastrophic disability for the patient. You can damage the - you can nick the liver, you can remove bits of the lung, you can remove bits of the heart, and the organ goes on working. But with the brain, although some areas that can suffer some damage without terrible consequences for the patient, in general terms, it's very dangerous, which means the decision-making is very important. And in, as I write in my book, in my experience over the years, when things have gone wrong, it's not because of a - one sort of cut the wrong blood vessel or dropped an instrument or something like that. The - if a mistake's made, the mistake's from decision-making - a decision whether to operate or when to operate.\nGROSS: You write in your book that you're in love (laughter) with your microscope. It's this, like, super powerful microscope that weighs a quarter of a ton.\nMARSH: It's an operating - a counterbalanced operating microscope, which all modern brain surgery's done with. And they have (unintelligible) looking through - looking through a pair of really good binoculars or a telescope. In a sense, things look more real through the binoculars than without. And it is immensely exciting, I find, working down a - down a microscope. It magnifies about eight or 10 times - not a huge amount, but with very, very bright lights, so you can see things in - with fantastic clarity. And as of any instrument or tool you use a lot, it ends up being like an extension of your own hands, in some ways.\nGROSS: You also use tools that you compare to a GPS system.\nMARSH: Well, that's called computer navigation. And it's a way of locating abnormalities - the medical word is lesions - within the brain because, again, one of the many ways in which brain surgery is different from surgery elsewhere is you can't - you can't explore the brain. I mean, if you - if you do an abdominal operation, you actually put your hands - nowadays, a lot of it's done visually, laparoscopically, but when I trained many years ago in abdominal surgery, you actually put your hands into the patient's abdomen and feel around. You feel for the abnormality.\nYou clearly can't do that with the brain. And why brain surgery was very limited until the modern era - well, we didn't do brain scans. And it wasn't - it wasn't exactly guesswork as to where to go, but it was very difficult. And now with so-called computer navigation, it's not a real-time method, but it's a way you can see on the brain scan done just before the operation where you are with your instruments in the patient's brain. And there's an even more up-to-date version of that called intraoperative MRI, where you do the - do the operation inside the brain scanner, although, in fact, that's probably only useful for a small, small proportion of operations.\nGROSS: If you're just joining us, my guest is neurosurgeon Dr. Henry Marsh, who's written a new memoir called \"Do No Harm.\" Let's take a short break, then we'll talk some more. This is FRESH AIR.\n(SOUNDBITE OF MUSIC)\nGROSS: This is FRESH AIR. And if you're just joining us, my guest is neurosurgeon Dr. Henry Marsh. He's written a new memoir called \"Do No Harm.\" The brain does not experience pain even though it communicates pain. It registers pain.\nMARSH: Well, it creates pain. Pain is, it's - a lot of what we think is real and obvious in fact is what it could call an illusion in a way. If I've got pain in my hand, the pain is not actually in the hand. The pain is in my brain created - my brain creates a three-dimensional model of the world, and it associates the nerve impulses coming from the pain receptors in my hand with pain in the hand. Then it creates this illusion that the pain's actually in the hand itself when it isn't. The more you look into neuroscience, the more strange and sort of confusing it becomes.\nGROSS: Usually, or at least often when you perform brain surgery, the patient is just under a local anesthetic because...\nMARSH: Well, for certain sorts of tumor. When tumor's called low-grade gliomas, which are tumors of the brain itself which grow very slowly and which look very much like brain tissue, and you want to try to remove as much of a tumor as possible. But given that the tumor looks like the brain, and if you're operating near what we call eloquent brain, that is brain where if it's damaged the patient suffers serious troubles such as paralysis or inability to speak, something like that, it can be very helpful to have the patient awake, talking or moving the relevant limbs, as you remove the tumor to make sure you're not doing any harm. And I was one of the first people to do this in this country many years ago, and it was considered rather eccentric at the time; but in fact, it's now the standard way of operating on these tumors and is practiced everywhere, and patients on the whole tolerate it very well. The idea sounds outlandish, but I've very rarely had - in fact, only two or three times out of hundreds of operations have I found patients couldn't cope with it.\nGROSS: Can you explain why it is that pain, as you put it, is created by the brain, and yet when you're performing surgery, you can do that with just a local anesthetic because...\nMARSH: Well, because the brain has no - the pain - the brain has no pain receptors in it. Pain is produced by stimulation of peripheral nerves in the body, which then send electrical signals to the brain, and the brain then will interpret that particular pattern of nerve signals as a painful experience. The brain itself has no pain receptors, so it can't feel anything. If a brain felt pain, you'd have to have another brain somewhere registering the pain in the first brain so infinite regression.\nGROSS: That's an interesting thought (laughter). So sometimes your patients watch their brain surgery on a video monitor because...\nMARSH: Yes.\nGROSS: ...They're actually awake.\nMARSH: I have a camera attached to the microscope, and so - mainly so the other medical staff and nurses can see the operation, see what I'm seeing on a television screen, but it means the patient can as well if they wish. And I will ask my patients do you want to see your own brain (laughter)? And some of them say yes and some say no. And if they say yes, I'll say, well, you're now going to be one of the few members of the human race who has ever actually seen their own brain, and it's a strange, strange thing to experience. I've actually had - been operating on the visual areas of the brain with the patient awake - at the back of the brain. I've had some of my patients - the visual cortex looking at itself on a television screen.\nGROSS: Wow.\nMARSH: And you feel that somehow there should be a philosophical equivalent of acoustic feedback.\nGROSS: (Laughter).\nMARSH: Something should explode or give way. It's just so weird, but of course it doesn't.\nGROSS: Do patients who you're trying to keep awake ever pass out because of what they're seeing on the video monitor?\nMARSH: No, no, no, no, but it is one of the various themes of the book, which is this extraordinary fact which is very hard to come to terms with. It is a fact for all people who work with the brain that thinking and feeling is a physical process. It doesn't feel like it. You know, my thoughts don't feel like electric chemistry, but that is what they are. And I find it quite a consoling thought that our modern scientific view of the world which has explained so much - we can't even begin to explain how consciousness, how sensation arises out of electric chemistry, but, the fact of the matter, it does. So just as we all accept the mystery of the Big Bang and the universe and the cosmos around us, actually as being a huge mystery and rather extraordinary, we're all sitting on an equally great mystery within ourselves, each of us in this microcosm of our own consciousness, and I find that quite nice - quite a nice thought.\nGROSS: Let me quote something you write in the book. You write (reading) neuroscience tells us that it's highly improbable that we have souls...\nMARSH: Yes.\nGROSS: (Reading) ...As everything we think and feel is no more or less than the electrochemical chatter of our nerve cells. So does the work that you do as a neurosurgeon increase or diminish your sense of the mystery of consciousness?\nMARSH: It increases it. It increases it. It's become more, I mean, it's something I took for granted when I was younger, and when I was a medical student. I found the neurophysiology and the neuroanatomy the most interesting part of my studies, although it took a while before the penny dropped and I fell off my donkey and decided I was going to become a neurosurgeon. But in a sense, this sense of awe and mystery, for some reason, has got greater as I've got older. I'm not quite sure why. Maybe because many of us, as we get older, we start thinking more about, you know, the fact our life is going to come to an end, and we become a bit more religious and philosophical. And if you don't have a conventional religious belief, as I don't, I think, you know, in a way, thinking about the mystery of one's own consciousness and the universe is a sort of compensation for that in some ways.\nGROSS: The operation that you're performing at the beginning of the book - and this is the operation you start to describe in the reading that you did at the beginning of our interview - you're performing - you're trying to remove a tumor from the pineal gland of your patient. And you're lucky with this one because the tumor comes out easily and it's benign; but you're very nervous, as you describe it, during this procedure because you just recently performed surgery removing a tumor...\nMARSH: Which had gone very badly.\nGROSS: Yes, from the cervical spine - spinal cord of a woman, and she was left paralyzed on one side of her body.\nMARSH: Yes, yes.\nGROSS: You fear that you removed too much of the tumor and that's what damaged her spinal cord. And you confess to several times when you felt responsible for a spinal or brain damage as a result of a surgery, and I'm interested in why you wanted to share that. You've even given a lecture called, like, the 10 worst mistakes I've ever made.\nMARSH: Well, something like that. I'm a great believer that doctors and patients should, in a sense, be equals. I mean, especially as we give advice. I've always hated sort of paternalistic condescending doctors, and I'm all for patients making demands and patient's rights, but it's a two-way process. And I think patients in the modern world where, certainly in England you can't open the newspapers without reading about the latest medical scandal and incompetent doctors, now its incompetent nurses. The public need to understand that medicine actually is often a very uncertain process. It's not like going to a car dealer and buying a car or getting things fixed. It's very uncertain. It's very difficult, and there's a lot of talk in this country, as there is in the states, about duty of candor and guilt-free culture and transparency. And I thought, well, I'm going to write a book, which is based on the diary I've kept all my life, which shows what it's really like, you know, with no holes-barred, both the good things and the bad things. And again, some of my operations are great triumphs and tremendous, but they're only triumphs because there are also disasters. If all operations were easy and safe and straightforward, there'd be nothing very special about them. So although one can accuse me frightening the public, I think on the whole if you - as a patient, if you go and see a doctor and you could only choose one quality, I think most of us would go for honesty (laughter) because if you see an honest doctor, if he knows what should be done, he'll tell you. If he thinks somebody else can do it better than he can, he can tell you, and I think honesty is in a sense a more important quality than steady hands or nerves of steel or heart of a lion, all the old cliched ideas of what surgeons should be like.\nGROSS: My guest is neurosurgeon Henry Marsh. His new memoir is called \"Do No Harm.\" After we take a short break, he'll talk about what it was like for him as a parent when his son had a brain tumor and what he learned as a doctor from that terrifying experience. I'm Terry Gross, and this is FRESH AIR.\n(SOUNDBITE OF MUSIC)\nGROSS: This is FRESH AIR. I'm Terry Gross back with neurosurgeon Henry Marsh, author of the new memoir \"Do No Harm\" about his life as a neurosurgeon. He writes about the complexities of operating on the part of the body that controls movement, breathing, memory and consciousness. He's performed many spinal cord surgeries and repaired many aneurysms, but now he mostly operates on brain tumors.\nIf there is damage caused by surgery to the brain or the spinal cord, the brain and the spinal cord rarely heal unlike, say, your skin or muscles.\nMARSH: They can heal to a certain extent, but you're quite right. The problem is the capacity for recovery is much more limited. You can take out half somebody's liver and you can remove a whole kidney or bits of a kidney and function continues more or less all right. But the brain is not the same. It's infinitely complex and very, very delicate. So although - if people have suffered a stroke or a head injury or a difficult operation, a lot of recovery will occur. It doesn't always get better and can be quite limited.\nGROSS: In confessing to some mistakes you made, you paraphrase a French surgeon who once described the cemetery that all surgeons carry within themselves. You feel like you carry around that cemetery?\nMARSH: Yes, I think so. I think all surgeons do and - if you're honest. And the longer you've been in practice, the bigger the cemetery. I had a very, very large surgical practice. I haven't retired fully yet. I was operating last week, in fact. And as the years go by, you accumulate more problems because it's the nature of the work. It is intrinsically dangerous. I have little time for people talking about aiming for zero harm in medicine. I think it's nonsense. Yes, we should try to - clearly we want to minimize harm. We should never be complacent about bad results, but they're going to happen. It's the nature of the work.\nGROSS: One of the procedures you've had to perform a lot over the years is dealing with an aneurysm. First, describe what an aneurysm is for anyone who doesn't know.\nMARSH: An aneurysm is a blowout on one of the arteries, not usually in the brain but immediately underneath the brain, where the major arteries go into the brain to take blood. If you imagine the inner tube of a bicycle tire, if there's a weak patch and you blow the tire up hard, that weak patch will start to bulge out like a little blister and then become a balloon, and then one day, it will burst. And a very similar process happens if people have a weakness in, usually, a branch point of one of the arteries. We don't know why it happens, but it does. And when these aneurysms occur, which can occur in young people, usually it's in middle-aged people and older, people get a - they develop a catastrophic headache. It's like a bomb going off in the head. And, in fact, about 15 percent of people drop dead when the aneurysm bursts. But those who don't, can survive, but there's a high risk of another hemorrhage occurring. Like having had one earthquake has a risk of a major aftershock. And, in fact, a second hemorrhage is even more dangerous than the first.\nSo when I went into neurosurgery, the way we prevented a second hemorrhage happening was to open the patient's head, and then with a microscope, you put a miniature - the aneurysm's often usually sort of less than a centimeter in size. They're very small. And it's very delicate, very exquisite, rather dangerous surgery because if the aneurysm bursts while you're trying to clip it, that is usually a catastrophic result. And while seeing an aneurysm operation when I was a young doctor in training, that made - I fell in love with it. I thought, I can't imagine anything more exciting. And that's why I became a brain surgeon. The slight irony is that in the last 10 to 15 years, aneurysm surgery has been made almost completely redundant by what are called endovascular radiological methods, where you treat the aneurysm without an operation but from inside the blood vessel using a long catheter and a wire fed up the major arteries in the groin to get into the brain, which is great for patients because on the whole it's a much more benign, less unpleasant experience than an operation. But it's kind of taken away from neurosurgeons one of the things they most like doing.\nGROSS: Before you became a brain surgeon, your son had a brain tumor.\nMARSH: Yes.\nGROSS: How old was he?\nMARSH: He was three months old.\nGROSS: What was the problem?\nMARSH: He developed acute hydrocephalus and became unwell.\nGROSS: Is that a swelling of the brain?\nMARSH: Well, yeah. Well, it does - there was swelling of the fontanelle, which you - how you diagnose raised pressure in a baby, the hole at the front of the skull. And he had a tumor right in the middle of his brain, which was causing - trapping the cerebrospinal fluid, so he had acute hydrocephalus, and he was desperately ill. I was an intern. In England, we call it a houseman, a junior doctor, at the time, doing general surgery. I had never seen any neurosurgeries as a trainee actually, I was a medical student. And I - although it was a very trauma - he survived. He was all right. He's alive and well many years later, thank goodness, due to the surgeon who treated him. It didn't, at the time, make me feel I particularly wanted to be a brain surgeon myself 'cause I knew very little about it. And I still think it was seeing an aneurysm operation a year later which is when I knew that's what I always wanted to do without realizing it. But I dare say that my son's illness had something to do with it in some way.\nGROSS: What was the procedure that was performed?\nMARSH: It's called a transcallosal approach. They split, to a limited extent, the two halves of the brain and then removed the tumor in the middle. It was a very rare tumor called - a benign tumor - called a choroid plexus papilloma of the third ventricle, which is very unusual. I don't know what sort of doctor I'd have been if I hadn't had that experience. I ended up doing pediatric brain surgery myself for many years. But I think having been at the receiving end - not as a patient, but as a very anxious parent - was an invaluable experience. All relatives are very anxious, particularly relative - parents of children. And having been one myself, I think it helped me cope with it 'cause it's actually very stressful. Anxiety rubs off. And doctors don't like anxious patients and anxious families 'cause it makes us anxious. It's - you know, human beings are like that. But I - I'd like to think I'd have been a kind of sympathetic doctor if I hadn't had that experience. One of the rather sad things about health care is that most health care is doled out by fit, healthy, young people - doctors and nurses - who actually have very little personal experience of what it's really like to be a patient or to be ill or to be in fear for your life. And it's a common observation that when doctors themselves fall ill, they say, well, actually I never quite realized what it was like, and they become better doctors as a result. But there's no way around this problem, I guess. I think doctors are like wine - like red wine - get better with age - at least I hope so.\nGROSS: Your son almost died.\nMARSH: Yes.\nGROSS: What happened?\nMARSH: Well, he was admitted to hospital on a Friday afternoon and went into a coma. And the senior doctor wasn't there at the time. And I think the junior doctors didn't quite realize what was going on. Maybe I overreacted 'cause I didn't know much about brain surgery. I knew very little about brain's pressure in babies at the time, but it was very frightening. And to see him getting steadily worse, and people saying, oh, well, it's all right. But eventually, the senior surgeon did turn up and everything was sorted out, thank goodness. But he gave me some insight as to how incredibly frightening and worrying it is (laughter) to be a relative.\nGROSS: It must have given you some insight, too, into the confusion that people have when a loved one is in a coma.\nMARSH: Yes.\nGROSS: Like on the one hand, they're totally unresponsive. On the other hand, you think - or maybe you want to think or maybe you truly believe that if you talk that they will hear it, that if you're there that they will know it.\nMARSH: Yeah.\nGROSS: And you don't know if you're deluding yourself or if it's true.\nMARSH: That's right. There's no easy way of knowing. And with these poor people in the so-called persistent vegetative state, which happens most typically after severe head injuries that people survive, it's more comforting, certainly, for the doctors just to say, well, the person's totally unaware. There's nobody at home, so to speak. But in Leuven in Belgium, somebody's been doing research, putting these patients into brain - functional brain scanners that show, to some extent, brain activity. And some of these people who lie there with their eyes open but in a sort of total coma, unresponsive, do seem to have some kind of cerebral activity, but what it means, we don't know. But for the family, it is a nightmare 'cause you have somebody who's in a sense not dead but nor are they alive. And it's a peculiar problem to modern medicine - the idea that medicine can do harm in many ways. It could have sort of collateral damage. One accepts the inevitability of friendly fire in war, although obviously soldiers try to avoid it. But in a sense, you get the same problem in modern medicine. If you treat people with various severe head injuries, a few people might make a good recovery. But many people would survive, left very disabled, who would otherwise have died. And it's terrible for the family, absolutely terrible.\nGROSS: Is it terrible for the physician? Has that happened to you?\nMARSH: The long-term patients - well, it has happened to me 'cause I once created - I put a patient into PVS with an operation I did.\nGROSS: Tell us about it.\nMARSH: Well, the answer is yes. That was a very large, difficult tumor at the base of the brain. I'd only been a senior doctor for three or four years. I wasn't terribly keen to operate 'cause I knew it was going to be dangerous. The family wanted something to be done. They went to see a very senior neurosurgeon in central London, who I think was about to retire. And he rang me up and said, this is a young man's operation. You ought to do it. So I thought, great. Well, if the most senior neurosurgeon in London says I should do it, I will do it. And I did it, and it took many, many hours. And right at the end, I caused catastrophic damage in the last little bit. In retrospect, I should have left that last little bit of tumor behind, but I didn't. And the patient was in a coma afterwards and remained in a coma. And eventually, I lost - the patient went elsewhere to a nursing home. But then by chance, 10 years later, I went to see another patient with a long-term problem in a nursing home, and there was my patient from many years earlier, still in persistent vegetative state. And that was a pretty shocking experience. But again, that is the nature of the work. I may be - maybe I'm less competent and more hopeless than other neurosurgeons. I don't think I am, but I think this is the nature of the work. And I think on the whole, probably - hopefully I'm achieving more good by writing like this about these problems rather than continuing with the pretense, everything is perfect and nothing ever hurts.\nGROSS: If you're just joining us, my guest is neurosurgeon Henry Marsh who's written a new memoir called \"Do No Harm.\" Let's take a short break, then we'll talk some more. This is FRESH AIR.\n(SOUNDBITE OF MUSIC)\nGROSS: This is FRESH AIR. And if you're just joining us, my guest is neurosurgeon Dr. Henry Marsh who's written a new memoir called \"Do No Harm: Stories Of Life, Death And Brain Surgery.\"\nAre there times when you'd like to see the patient die because you think that if they live...\nMARSH: Oh, yes. Oh, yes.\nGROSS: They will be so incapacitated?\nMARSH: Yes, yes.\nGROSS: So...\nMARSH: Yes, there - I think there are many things worse than death when it comes to brain damage.\nGROSS: So what comes into play legally and ethically for you if you think this patient should be allowed to die?\nMARSH: The - I've never had a problem in my practice of that nature. The problem - first of all, if - I should say, if somebody's brain dead, which is a different state - if the brain has died, you can either - you can - there are fairly clear cut ways of diagnosing that. If somebody's on a breathing machine, on life-support machine and there's no cerebral activity, we know the heart will stop within the next few days, usually. So discontinuing treatment is only shortening the inevitable.\nThe problems arise with people in persistent coma. If you treat a severe head injury - the phrase is aggressively - you tied - in the past, all these patients died. They died usually from pneumonia 'cause they couldn't - they were in a coma. They couldn't cope with their own secretions, and they'd get pneumonia in the lungs. And now, all that is treated acutely so they survive. And some of these patients, months or even years later, the family will say, well, actually, we wish they hadn't. Although, at the time, of course, they probably once said, everything must be done; we must hope.\nAnd then it puts the doctors in a difficult position because I was never entirely certain. You see somebody with a bad head injury and a bad looking brain scan, you're pretty sure they're going to be left very disabled if they survive, but you're not absolutely certain. And the way to illustrate the difficulty is - when I'm on call for emergencies, I will be telephoned by the hospital by my juniors who do the emergency surgery 'cause it's technically very simple most of the time. And they'll be - I'll be sent a brain scan over the Internet. And let's say somebody shows a big head injury, big blood clot in the brain where if we don't operate, the patient will almost certainly die, and if we do operate, we'll probably save the patient's life. But they may or may not be left very disabled.\nNow, if I, like Nero at the Roman games - if I say thumbs-up, operate, I get back to sleep. If I say thumbs-down, don't operate; the patient's better off dead, I don't get back to sleep 'cause I'm worried I might be wrong. And there is this built-in ratchet. It's always easier to treat than not to treat. Not to treat means you expose yourself to anxiety and doubt, and you also actually have to have a much longer, more difficult and painful and honest conversation with the family, which is often very difficult at 2 o'clock in the morning in the context of an acute emergency.\nSo there's no question of the fact that modern treatments of strokes and head injuries does generate quite a large population of profoundly disabled people. And I suppose the view, as well, is justified by the fact that we have a few good results. But I do wonder sometimes.\nGROSS: In your memoir, you attribute the end of your first marriage, which lasted, I think, about 25 years...\nMARSH: Twenty-seven years, yeah.\nGROSS: ...Twenty-seven years - in part to your profession not only because neurosurgery kept you so busy and preoccupied but also because of the arrogance that came along with it.\nMARSH: I think the sense of self-importance, yes. I think so. I mean, it's hard to know. There were other factors as well. But I mean, it was a lot - it was 20 years ago now. The world is a rather different place. But I mean, for all the years of our marriage, my work always came first. And that, I think, was not helpful.\nGROSS: But what...\nMARSH: It was good for my patients (laughter).\nGROSS: Can you talk about that self - that sense of self-importance?\nMARSH: Well, just if you're dealing - if you spend the whole day dealing with life-and-death issues, it makes you impatient of other things. It makes you impatient of bureaucracy at work. It makes you impatient of domestic problems because you're in a permanent state of often anxiety, arousal, you know, patients, life and death. It's like soldiers in battle. Everything else seems rather trivial by comparison.\nGROSS: When you think and feel, are you also thinking about what your brain is doing 'cause you look at brains all the time?\nMARSH: Well, I do wonder. And one never knows. But you know, if one's in a bad mood, one might attribute it to having had an argument with somebody or worrying about something. But for all one knows, it might be also due to some neurochemical doing something for some reason. I mean, the brain is much more complicated than we even can begin to understand.\nAnd there's this famous experiment done by the Californian Libet in the 1980s - long time ago - where he put EEG electrodes on people's brains - heads, and - while they're awake, through the - on the skin - and you can record a certain amount of electrical activity in the brain. And in particular, he recorded activity in the movement areas of the brain. And then he equipped people with a little - I think they just had to press a little button and just press the button when they made a conscious decision to press that button - just to press the button.\nAnd what he showed - and the experiment's been repeated many times; it's definitely true - is that the decision - the conscious decision to press the button was preceded by activity in the movement area of the brain. (Laughter). And nobody, really, has been able to quite explain that - as though consciousness occurs after the brain has decided to do something. It's very mysterious.\nGROSS: Dr. Marsh, thank you so much for talking with us.\nMARSH: Thank you. Thank you very much.\nGROSS: Henry Marsh is the author of the new memoir \"Do No Harm: Stories Of Life, Death And Brain Surgery.\" If you want to catch up on FRESH AIR interviews you missed, including the edition with comic Marc Maron interviewing me, check out our podcast. Coming up, Lloyd Schwartz reviews a massive collection of CDs celebrating the early days of hi-fi. This is FRESH AIR.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=409719011"}
