{"authors":["Matthew Debord"],"date_download":"2018-10-31 00:04:00","date_modify":"2018-10-31 00:04:00","date_publish":"2016-12-05 00:00:00","description":"Is another cash for clunkers justified? Not to boost sales, but perhaps for another reason, according the Morgan Stanley lead auto analyst Adam Jonas.","filename":"data/vaneerConsumption/AnewCashforClunkerscouldbeontheway.json","image_url":"https://amp.businessinsider.com/images/560ab0e8bd86ef14008bdcc2-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_new-cash-for-clunkers-program-car-safety-2016-12_1540944240.html","title":"A new Cash for Clunkers could be on the way","title_page":"    New Cash for Clunkers program to meet safety standards - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Send low-tech cars to the junkyard? Wikimedia Commons \"Cash for clunkers\" was a $3-billion program authorized and financed by Congress in 2009 that pulled the US auto industry out of a death spiral.\nConsumers had a cash incentive to get rid of an older, gas-guzzling vehicle and buy or lease a new, more fuel-efficient car.\nThe pace of sales after the financial crisis has dipped to an alarming 10 million on an annual basis, so cash for clunkers (the official name was the Car Allowance Rebate System, or CARS) got auto sales moving again.\nFast forward to late 2016 and the US auto market could be on the verge of setting another record for sales, bettering 2015's total of 17.5 million vehicles.\nIs another cash for clunkers justified? Not to boost sales, but perhaps for another reason, according the Morgan Stanley's lead auto analyst Adam Jonas.\n\"[W]e believe a step-change vehicle safety brought about by ADAS/automatic emergency braking (AEB) could, according to a growing amount of data from suppliers and national insurance institutes, potentially reduce the chances of a vehicle causing a vehicle-to-vehicle or vehicle-to-pedestrian crash in cities and on highways by as much as 50% or more,\" he wrote in a research survey the state of the auto investment sector.\nCash for clunkers caused a temporary spike in auto sales. FRED/Business Insider\n\"We expect these technologies will be standard equipment on nearly all new cars on sale in the US within 4 years at a cost of less than 1% of the price of a vehicle (e.g. $4 per month additional on a monthly payment),\" he added.\n\"While this may be very good for new car demand, it would create an income inequality problem for consumers who cannot get access to credit to purchase new and far safer vehicles.[Our emphasis]\nIn Jonas's thinking, the \"income inequality problem is threefold\":\nLower income consumers left in more dangerous used cars These consumers face rising auto ... insurance premiums Consumers will confront greater negative equity from a degradation in the residual value of their car\nThe solution is a new cash-for-clunker program, designed to replace less-safe vehicles with more safe ones. It wouldn't makes sense to take the fuel-economy approach with a CARS-like effort in 2016-2017 because now the most popular and most profitable vehicles aren't optimally fuel-efficient: they're SUVs and pickup trucks, with sales driven by relatively cheap gas.\nThe technology available in cars and trucks today does make them safer, so Jonas and his team are wise to suggest a new cash for clunkers as a good move to alleviate a critical problem for an evolving auto space: people who have less means can't obtain the safer technologies that wealthier buyers can.\nThis is obviously bad. If a new cash for clunkers could fix it, then it's a program that's worth seriously considering.","url":"https://www.businessinsider.com/new-cash-for-clunkers-program-car-safety-2016-12"}
