{"authors":["Mika Doyle"],"date_download":"2018-10-31 01:51:25","date_modify":"2018-10-31 01:51:25","date_publish":"2018-08-27 17:01:45","description":"This past year has seen a major surge in plastic straw bans. Versions of the policy, which limits or outright bans the use of single-use plastic straws in public establishments, have been passed or proposed across the country, including in New York,…","filename":"data/vaneerConsumption/ANewStrawBanSurveyShowsHowPeopleReallyFeelAboutThePolicy.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/32734d9a-6699-4e95-8911-d7357a50a007-getty-980583366.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_a-new-straw-ban-survey-shows-how-people-really-feel-about-the-policy-10247558_1540950685.html","title":"A New Straw Ban Survey Shows How People Really Feel About The Policy","title_page":"A New Straw Ban Survey Shows How People Really Feel About The Policy","title_rss":"NULL","source_domain":"bustle.com","text":"This past year has seen a major surge in plastic straw bans. Versions of the policy, which limits or outright bans the use of single-use plastic straws in public establishments, have been passed or proposed across the country, including in New York, San Francisco, and Portland, Oregon, reports The Wall Street Journal. Some businesses have even jumped on the ban-bandwagon without government prompting, says The Wall Street Journal, including giants like Starbucks, Hyatt Hotels, and Disney, which all said they planned to phase out single-use plastic straws last month. In response to the buzz around the bans, BuzzFeed has published the results of a survey that shows how people really feel about the policy. Spoiler alert: not as positive as you might think.\nBuzzFeed worked with market research firm Ipsos to conduct the survey, which asked 2,000 American adults about their feelings on the bans. BuzzFeed says it's the first survey to address the straw bans. The survey found that most people don’t want the government to implement plastic straw bans, but they are cool with cutting back on their own. Most of the respondents (79 percent) strongly support businesses using biodegradable straws, but 75 percent also think businesses should offer plastic straws by request. But only 48 percent think local governments should implement outright bans on plastic straws, BuzzFeed reports.\nSean Gallup/Getty Images News/Getty Images\n“There really is broad support for straws upon request,” George Leonard, chief scientist of the Ocean Conservancy, which leads a global beach cleanup program that once found more than 600,000 straws and stirrers globally on a single day, told BuzzFeed. “It’s a no-brainer for the private sector to get behind.”\nThe survey results suggest the public isn't as behind straw bans as one might think, a finding that also backs up what the disabled community's been saying about these bans. According to NPR, although there are reusable alternatives to plastic straws, they aren’t always conducive to the specific needs of people with mobility challenges. Paper and biodegradable straws fall apart too easily or can be bitten through if a person has limited jaw control; silicone straws are not flexible and cannot be bent or positioned; reusable straws need to be washed, and not all people with disabilities are able to do that; and metal straws conduct heat and cold and can cause injury, NPR reports. Furthermore, plastic straw bans (or even straws-upon-request policies) put the responsibility of obtaining these accessibility tools on disabled people, which impedes access.\n\"Disabled people have to find ways to navigate through the world because they know it was not made for us,\" Lei Wiley-Mydske, an autism activist, told NPR. \"If someone says, 'This does not work for me,' it's because they've tried everything else.\"\nDavid McNew/Getty Images News/Getty Images\nThe reality is that, even though one-third to two-thirds of the trash the Environmental Protection Agency catalogs on beaches comes from single-use plastics, plastic straws aren't on the top of that list. And the widely-cited estimation that people in the United States use 500 million straws a day has been soundly debunked. New estimates show that people are using around 170 to 390 million straws a day in the U.S., BuzzFeed reports.\nThe EPA says the best way to make an impact on plastic waste in the oceans is to reduce the overall waste we produce — and that doesn’t stop with refusing the plastic straw if you don’t need it. Recycle whenever possible, reuse containers, bring your own silverware to work instead of using disposables, and do your best to reduce the trash you put into landfills. And it doesn't hurt to put a little pressure on legislators and major corporations that do the most damage to the environment, as long as these policy changes don't disproportionately harm any communities. If we all make an effort to reduce our waste overall, we can make a major impact on the environment.","url":"https://www.bustle.com/p/a-new-straw-ban-survey-shows-how-people-really-feel-about-the-policy-10247558"}
