{"authors":["Melissa Ragsdale"],"date_download":"2018-10-31 01:41:08","date_modify":"2018-10-31 01:41:08","date_publish":"2018-09-14 20:05:52","description":"Poetry can be found in everything — the light, the air, the sounds of the city around you. Now, visitors to Manhattan's Riverside Park will have the chance to explore poetry in a whole new way, thanks to \"Viewfinding\" – a large-scale public…","filename":"data/vaneerConsumption/ANewPublicArtDisplayInNYCFeaturesTheWorksOf26LGBTQPoetsHeresAPeekAtThePoems.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/5/bf5b0ad2-7ebe-4aa9-8217-085b2c435e92-img_8125-copy.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_a-new-public-art-display-in-nyc-features-the-works-of-26-lgbtq-poets-heres-a-peek-at-the-poems-11619716_1540950068.html","title":"A New Public Art Display In NYC Features The Works Of 26 LGBTQ Poets - Here's A Peek At The Poems","title_page":"A New Public Art Display In NYC Features The Works Of 26 LGBTQ Poets — Here's A Peek At The Poems","title_rss":"NULL","source_domain":"bustle.com","text":"Poetry can be found in everything — the light, the air, the sounds of the city around you. Now, visitors to Manhattan's Riverside Park will have the chance to explore poetry in a whole new way, thanks to \"Viewfinding\" – a large-scale public sculpture created by Brooklyn-based artist Sarah E. Brook that features the work of 26 LGBTQ poets. The sculpture will be up until August 2019, and there will also be a reading by the featured poets at the sculpture site on September 22 at 2 p.m. ET.\n\"Part of what I am aiming to do in the sculpture... is to create these invitations for viewers to seek alignment, and seek their own resonant positions relative to the work and to the landscape,\" Brook tells Bustle. \"For me, the process of positioning myself in a way that allows me to align certain colors or certain structures in a piece with certain elements of the landscape or the light is a very, very, very grounding and affirming process, and feels related to taking resonant expressions of identity and experiences of embodied identity, particularly related to queer and gender identity. So, 'Viewfinding' refers to kind of that process... Like, me seeking my own view, my own position, relative to this work.\"\n\"Part of what I am aiming to do in the sculpture... is to create these invitations for viewers to seek alignment...\"\nBuilt from reclaimed lumber and cast-acrylic panels, the sculpture stands next to the Hudson River (near 67th Street) and interacts with the sun as it moves across the sky. Twenty-six original, very short \"distilled\" poems are engraved on panels mounted to the structure’s bench. \"The bench looks a little bit to me like a river,\" says Brook. \"There is a movement to the shape of it and to the alignment of it, and the pieces will be attached to the bench in sort of a progression, and it will be another invitation for viewers to move into and move along the piece\".\nSarah E. Brook\nThe featured poems were found mostly through an open call, along with a few invitations. The pieces are all around 15 words each, and are written by both prominent names and new voices — including Alena Singleton, Alicia Mountain, Angela Chaidez Vincent, Briana Silberberg, CAConrad, Carol Mirakove, Charles Theonia, Eduardo Martinez-Leyva, Eloise Dowd, Freesia McKee, Jen Currin, Jordan Bonner, Joy Ladin, Kevin McLellan, Lesléa Newman, Maura Pellettieri, Melanie Hope, Paul Cunningham, Philip Matthews, Rachel Rose, Sam Sax, Saretta Morgan, Sossity Chiricuzio,Tegan Giesel, Tim Jones-Yelvington, and Timothy Liu.\nPoetry has always inspired Brook in her visual art practice. \"There's this particular energy of [poetry], for me, that is kind of simultaneously distilling and expanding,\" says Brook. \"The relationship between something very particular and very distilled and very universal and expansive feels present to me in poetry. I love the notion of that, because I feel like it really relates visually to what I'm trying to accomplish with my work.\"\nSarah E. Brook\nQueer voices being featured in a public space like this is an important marker for LGBTQ visibility. \"A lot of the feedback that I got from people who applied... was 'I wish I had seen something like this when I was younger,'\" Brook says. \"That's something that I can really relate to. Seeing yourself represented, seeing what is possible, seeing that all of the parts of you perhaps can be celebrated and not hated and made visible and made beautiful, made into works of art — it means a lot.\"\nIf you're in NYC this month, you definitely want to check out this cool sculpture. But until you're able to get down to Riverside Park, here are a few samples of the featured poems to give you a taste of this fascinating work of art.\n1 \"I wanted to recognize the shadow I cast, /to cast more light than shadow.\" Sarah E. Brook — Joy Ladin\n2 \"Our very teeth. Silent/for years beside the river/of everything we’ve ever said.\" Sarah E. Brook — Angela Chaidez Vincent\n3 \"all of our heroes /are alive & in love\" Sarah E. Brook — Carol Mirakove\n4 \"The most beautiful fireworks,/By definition,/Mean that something carefully planned/is destroyed,/Broken open.\" Sarah E. Brook — Alena Singleton","url":"https://www.bustle.com/p/a-new-public-art-display-in-nyc-features-the-works-of-26-lgbtq-poets-heres-a-peek-at-the-poems-11619716"}
