{"authors":["Meghan Demaria"],"date_download":"2018-10-31 01:39:35","date_modify":"2018-10-31 01:39:35","date_publish":"2018-08-30 23:56:05","description":"One of American Horror Story's most controversial couples might be making an appearance in Season 8, if Ryan Murphy's latest Instagram is any indication. The AHS creator shared a photo of Taissa Farmiga and Evan Peters dressed up as their Murder…","filename":"data/vaneerConsumption/ANewAHSApocalypsePhotoHintsThatThisMurderHouseRomanceIsStillGoingStrong.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/30/bb19a561-55ab-41cb-acc0-75869994afb8-screen-shot-2018-08-30-at-53910-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_a-new-ahs-apocalypse-photo-hints-that-this-murder-house-romance-is-still-going-strong-11464844_1540949975.html","title":"A New 'AHS: Apocalypse' Photo Hints That This 'Murder House' Romance Is Still Going Strong","title_page":"A New 'AHS: Apocalypse' Photo Hints That This 'Murder House' Romance Is Still Going Strong","title_rss":"NULL","source_domain":"bustle.com","text":"One of American Horror Story's most controversial couples might be making an appearance in Season 8, if Ryan Murphy's latest Instagram is any indication. The AHS creator shared a photo of Taissa Farmiga and Evan Peters dressed up as their Murder House characters, hinting that Violet and Tate might still be together in AHS: Apocalypse.\nThe picture shows the two actors sitting on a bench inside the murder house itself. It's hard to place the specific stained glass art behind them is from, but the house was full of stained glass. Plus, ghosts in the AHS universe can't leave the place they died, and both Violet and Tate died inside the building. If the photo weren't enough, Murphy's caption raises plenty of questions, too. \"Tate and Violet. Together forever? AHS: Apocalypse, FX Sept 12,\" Murphy captioned the photo.\nMurphy revealed earlier this week that Peters would be reprising his role as Tate Langdon. He posted a photo of Peters in costume as Tate, captioning the image \"Tate. Happy to be home.\" The photo suggests that Peters will be playing at least two roles in the Murder House/Coven crossover season, too. Murphy revealed in April that Peters will be playing a hairstylist in AHS: Apocalypse, and Tate definitely doesn't seem like a hairdresser. Entertainment Weekly also reported earlier this month that Farmiga will also play two roles in the new AHS season: Violet and her Coven character Zoe.\nBack in the show's first season, Violet and Tate didn't exactly meet in a traditional way. (Which makes sense, considering the fact that he was a ghost, while she was, at that point, still a living human.) Tate decided to go to Violet's father, Ben's, home office for psychiatric counseling. It wasn't a secret that Ben wasn't a fan of Tate, which likely drew the rebellious Violet to Tate even more. It looks like Ben and Tate will be interacting again in the new season, though — Dylan McDermott posted a photo of himself and Peters on set.\nStill, if Violet and Tate are together in the new season, it would be pretty cringe-worthy. When Violet started falling for Tate, she had no idea he'd killed his classmates, or even that he was a ghost. At first, Tate just seemed like an outsider, the way Violet felt in her new school and town.\nBut as the first AHS season progressed, Tate showed just how evil he really was. Tate continued causing trouble after his death. He raped Violet's mom, Vivien, becoming the father to a baby some fans believe is the antichrist. Murder House ended with a young Michael killing his nanny, and it doesn't sound like he's gotten less evil since then. Cody Fern will play the adult Michael in AHS: Apocalypse, which can't be good news if he really is the so-called antichrist.\nAfter finding out all that Tate had done, Violet seemed skeptical of her former crush. But their relationship wasn't exactly defined, so it's definitely possible that after years of haunting the same house, the two are on better terms. Still, it would be more than a bit distressing to see them back together, considering Tate's past.","url":"https://www.bustle.com/p/a-new-ahs-apocalypse-photo-hints-that-this-murder-house-romance-is-still-going-strong-11464844"}
