{"authors":["Naomi Lewin"],"date_download":"2018-10-23 01:08:37","date_modify":"2018-10-23 01:08:37","date_publish":"2016-06-18 00:00:00","description":"Fellow Travelers is based on Thomas Mallon's historical novel of the same name. It takes place during the McCarthy 1950s, when intense scrutiny fell not only on suspected communists but gays as well.","filename":"data/vaneerConsumption/ANewOperaIlluminatesTheLavenderScareALittleExploredEraInGayHistory.json","image_url":"https://media.npr.org/assets/img/2016/06/16/ft-bench-best_wide-fd26340503755cf6341e75218d2abcf5994424b7.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_deceptivecadence_2016_06_18_482307467_a-new-opera-illuminates-the-lavender-scare-a-little-explored-era-in-queer-histor_1540256917.html","title":"A New Opera Illuminates The 'Lavender Scare,' A Little-Explored Era In Gay History","title_page":"A New Opera Illuminates The 'Lavender Scare,' A Little-Explored Era In Gay History : Deceptive Cadence : NPR","title_rss":"NULL","source_domain":"npr.org","text":"A New Opera Illuminates The 'Lavender Scare,' A Little-Explored Era In Gay History\nEnlarge this image toggle caption Philip Groshong/Cincinnati Opera Philip Groshong/Cincinnati Opera\nIn the 1950s, as members of Congress were rooting out suspected communists in government and Hollywood, they broadened their search to include homosexuals and lesbians, under the theory that closeted gays could be more easily blackmailed into revealing government secrets. That crusade, dubbed the \"lavender scare,\" is at the center of Fellow Travelers, a new stage production that received its world premiere last night at Cincinnati Opera.\nThe show is based on a historical novel of the same name, written by Thomas Mallon. Mallon defies stererotyping: He's devoutly Catholic, fiercely conservative, and gay. And he shares those traits with Timothy Laughlin, one of the two main characters in his book.\n\"The anticommunism that he has, which is fervent and real, and the Catholicism that he has, which is fervent and real, I never saw as being hopelessly incompatible with his sexual desires and orientation,\" Mallon says.\nMallon, who lives in Washington, D.C., draws on the city's history for his books — from Lincoln's assassination to Watergate.\nDuring the McCarthy era, anything connected with homosexuality could lead to scandal. Mallon points to the example of Lester Hunt, a real-life senator from Wyoming who committed suicide in his office after the arrest of his son for allegedly soliciting gay sex in Lafayette Square. (Author Alan Drury took pieces of the Lester Hunt story and used them in his Pulitzer Prize-winning novel Advise and Consent.)\nThe main characters in Fellow Travelers — both the novel and the opera — work for the government at a time when even the suspicion that they might be gay called for a lie detector test.\nThe opera was developed as part of a new works program at Cincinnati Opera. The creative team includes three gay men in their 30s: director Kevin Newbury, librettist Greg Pierce and composer Gregory Spears, who says he and his colleagues were drawn to the personalities in Mallon's novel.\n\"It was hard for me to understand what it would have been like to be fighting Communism and to be Catholic and to also be gay in 1950s D.C., and so I was intrigued by the characters,\" Spears says.\nThe story's two protagonists are gay men who have to hide their love. One of them winds up marrying a woman to advance his career. To convey the emotions of a time when gay love was \"forbidden\" love, Spears went back even further for inspiration: to troubadour music from the Middle Ages, which, he says, is \"music that really is about unrequited love, courtly love, impossible love.\"\nYouTube\nThe consequences of being found out were real. Thousands of people lost their jobs, and restrictions on hiring gays in government remained in place into the 1990s. Jamie Shoemaker, a linguist with the National Security Administration, says his record was spotless when, one day, he was called to a meeting.\n\"The first thing they said is, 'We understand you're leading a gay lifestyle,'\nhe says. \"And I said, well, I didn't think I was leading it, but I did admit that I was gay.\"\nShoemaker's security badge was taken away, and he was assigned make-work. But he fought back.\n\"I talked to them a lot about how dangerous this is, to have this secret community among them — probably 10 percent of the workforce — hiding. And I heard from them that about 50 percent of the hierarchy agreed with me, that this was a big battle behind the scenes,\" Shoemaker says.\nAfter enlisting the help of Frank Kameny, the astronomer who turned activist after being fired from his government job for being gay, Shoemaker was reinstated. His story made the front page of the Washington Post in 1980. Others weren't as fortunate, and composer Gregory Spears says Fellow Travelers serves to remind the world of their stories.\n\"So much of gay history — it's not even that it's forgotten, it's that it was never recorded, in a certain way, and it was forgotten before it was remembered,\" Spears says. \"I think that it's really everyone's responsibility, but particularly my generation's responsibility, to make sure that we make art and books that continue to bring that history to the surface.\"","url":"https://www.npr.org/sections/deceptivecadence/2016/06/18/482307467/a-new-opera-illuminates-the-lavender-scare-a-little-explored-era-in-queer-histor"}
