{"authors":[],"date_download":"2018-10-30 00:59:00","date_modify":"2018-10-30 00:59:00","date_publish":"2016-08-21 00:25:39","description":null,"filename":"data/vaneerConsumption/ANewBirthofSlavery.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/08/Victor_Meirelles_-_Aboli----o_da_Escravatura.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861140.html","title":"A New Birth of Slavery","title_page":"A New Birth of SlaveryThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Someone posted one of those memes on Facebook recently. A picture with a quotation. I didn’t write it down verbatim, and I don’t remember the name of the person quoted, because, to be perfectly honest, I have no wish to give him publicity. (Also, Facebook memes are generally wrong.) But I thought the quotation was as elegant an exercise in question-begging as I’ve ever seen.\nThe gist of the thing was this: “You tell me the Bible is the Word of God. But the Bible never says that owning slaves is a sin. If the Bible can’t get that question right — the easiest question in the world — why should I believe what it says about anything else?”\nNote how the author manipulates the pea among the shells: “Slavery is the easiest question in the world.” That proposition slides right past us, comfortable inhabitants of the 21st century that we are. It’s self-evident, after all. Axiomatic.\nBut it wouldn’t have been axiomatic for most people throughout human history. In accusing the Judeo-Christian Bible of being strangely neutral on slavery, the author of the quotation conveniently overlooks the fact that every other scripture — every other religion and philosophy in human history — got the question wrong too. That’s an interesting consistency if we’re talking about “the easiest question in the world.”\nIn fact, the real question — the actual historical anomaly — is why, after everybody else had got the question wrong from the beginning of time, the Christians suddenly figured the answer out, and abolished slavery. Nobody else did that. Not the Egyptians. Not the Chinese. Not the Aztecs or the ancient Greeks. I understand the Greek Epicureans rejected slavery, but one of the distinctions of the Epicureans is that they never tried to build a civilization.\nAnd building a civilization is the precise nub of the historical problem.\nBecause when you study history with a view to this particular issue, one thing becomes uncomfortably clear. Everybody kept slaves, but civilized people kept them more. In fact, generally speaking, the higher the civilization, the more slave-intensive it was.\nLove Egyptian antiquities (I know the pyramids were built by free people, but there are plenty of other antiquities)? Thank slaves. Love Greek philosophy and drama? Slaves again. Roman poetry? Slaves.\nIn the old days — by which I mean all times everywhere, until about the 19th century — slaves were the only labor-saving convenience available. If you want to do science, or write poetry, or carve statues, you can’t waste time cooking for yourself, making your own clothes, raising your own crops, and caring for your own livestock. You need somebody to do that for you, and you need it done cheap. That’s where slaves come in. Slaves carried rocks and tilled the soil, so their masters could contemplate the heavens.\nUntil James Watt and the Industrial Revolution. Beginning with the steam engine, society began to figure out ways to get the scut work done by non-human mechanical servants. And in the unprecedented leisure introduced by this technological progress, people began to think a thought they’d never dared frame before — “You know, this slavery thing — it’s not really consistent with the Golden Rule.”\nAnd that insight began to undermine slavery as a social institution.\nBut we’re done with all that now, aren’t we? Ask any of your neighbors whether slavery will ever make a comeback, and they’ll probably tell you, “We’ve outgrown all that. We’ve evolved as a species.”\nFrankly I’m not so sure.\nThere’s a powerful movement in the world today that aims to reverse the very historical development that killed slavery — the Industrial Revolution. The Green movement views pristine nature as the greatest good, and industry as the abomination of desolation. They put great hope in “sustainable technology” to replace fossil fuels, but what if (as seems likely) that technology proves inadequate to the task of sustaining our standard of living?\nWhy wouldn’t they bring some kind of slavery back? People are the problem, after all, in their view. Too many of them around, and they demand energy-intensive comforts. Why not make people pay the price?\nI even see a plausible, though speculative, means they might adopt.\nThere’s already a class of human being which enjoys no legal protection whatever. Non-persons. An untapped resource for the Green technocrat of the future.\nThose people are the unborn. For generations, Science Fiction writers have speculated about the coming of the android, the humanizing of the machine. I think it more likely that humans will be mechanized.\nSoon, I expect, the technology will be available to harvest fetuses at an early stage, through some kind of surgical extraction. Potentially a fairly minor procedure. These fetuses could be brought to term in artificial wombs, surgically or chemically altered to make them stupid and docile, and then exploited as labor. This would even be marketed as a victory for the Pro-Life movement, since the babies would be allowed to live (after a fashion) rather than being “wasted.”\nPro-Lifers, I’m pretty sure, won’t like the program. And journalists and intellectuals will excoriate them for their “hypocrisy.”\nAfter all, we are constantly told that we have to open our minds to different kinds of morality proceeding from diverse cultures.\nAnd let’s face it — abolitionism was an idea we got mostly from dead white males. Enlightened Third World cultures around the globe still embrace slavery with enthusiasm. What could be more culturally diverse — that is to say, enlightened — than to reinstate it in the West?","url":"https://spectator.org/a-new-birth-of-slavery/"}
