{"authors":["Lia Beck"],"date_download":"2018-10-31 01:45:30","date_modify":"2018-10-31 01:45:30","date_publish":"2018-09-06 17:11:36","description":"Charmed fans have the reboot to get excited about, and now they can get much more excited about checking their mail, too. A Charmed subscription box called Charmed: Box of Shadows will launch in October, and it will be full of surprises related to…","filename":"data/vaneerConsumption/ANewCharmedSubscriptionBoxInWillFeatureATonOfFanWorthyGoods.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/0d432b71-4256-4983-b0b5-f0ea53410aec-screen-shot-2018-09-06-at-105756-am.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_a-new-charmed-subscription-box-in-will-feature-a-ton-of-fan-worthy-goods-11773642_1540950330.html","title":"A New 'Charmed' Subscription Box In Will Feature A Ton Of Fan-Worthy Goods","title_page":"A New 'Charmed' Subscription Box In Will Feature A Ton Of Fan-Worthy Goods","title_rss":"NULL","source_domain":"bustle.com","text":"Charmed fans have the reboot to get excited about, and now they can get much more excited about checking their mail, too. A Charmed subscription box called Charmed: Box of Shadows will launch in October, and it will be full of surprises related to and inspired by the show. Since the reboot also premieres in October, fans will be able to check out the new series in Halliwell sisters style.\nThe launch, which is a partnership between FanMail and CBS, is in honor of the 20th anniversary of Charmed. The show premiered on October 7, 1998. The boxes will contain \"apparel, accessories, collectibles, jewelry, home goods and more\" and each box will also \"include exclusive licensed items that aren't available on any other plane of existence.\" The boxes will be themed, too. The first box's theme is \"Charmed: 20 Years\", and centered around the anniversary itself. The boxes will be sent out four times a year in January, April, July, and October.\nIf you're interested, there are two ways to subscribe: With the quarterly plan a subscriber's credit card is charged $49.99 right before the box goes out. With the annual plan, each box costs $44.99, but subscribers are charged for four boxes at once. There are also a couple of added bonuses, especially for anyone who subscribes quickly:\nAs part of the launch, the first 100 subscribers to Charmed: Box of Shadows will receive an exclusive enamel \"I Am A Charmed One\" pin, along with a copy of a rare exclusive Charmed comic book. In addition, all who subscribe will be entered into a drawing for a Charmed prize pack that includes action figures, trading cards, comic books and an 8x10 autograph by a Charmed cast member.\nCharmed: Box of Shadows\nThe Box of Shadows site notes that if extra past boxes are available, they will be sold on the site to those without a subscription, but no guarantees can be made as to whether any will be available. The first box will ship in late October.\nFanMail has been sending out subscription boxes for three years now. The service was started by two young women who wanted to create something \"for lady geeks by lady geeks\", while also supporting small businesses. According to their site, \"FanMail has supported more than 100 different small businesses run by women/non-binary/gender non-conforming folx. We’ve created more than 200 unique fandom items and shipped thousands of boxes to fangirls around the world.\"\nWhile the new Charmed boxes are for a specific show, the usual FanMail boxes are themed, but feature items tied to an assortment of movies, TV shows, and books. For example, the October 2017 \"Witch Please\" box included surprises related to Kiki's Delivery Service, Sabrina the Teenage Witch, Harry Potter, and Hocus Pocus.\nTV Guide on YouTube\nFor those who are only interested in Charmed, though, you can order your boxes starting now. You can also get ready to watch the reboot, which will premiere on The CW on October 14. The new series will be about the Vera sisters, who are played by Melonie Diaz, Madeleine Mantock, and Sarah Jeffery. The reboot news was divisive, but if you are looking for more Charmed in your life (besides re-watching the original series on Netflix), the reboot and the new subscription boxes are two major ways to get just that.","url":"https://www.bustle.com/p/a-new-charmed-subscription-box-in-will-feature-a-ton-of-fan-worthy-goods-11773642"}
