{"authors":["Sara Malm For Mailonline"],"date_download":"2018-10-23 01:47:04","date_modify":"2018-10-23 01:47:04","date_publish":"2016-01-28 16:13:24","description":"German psychiatrist Hans-Joachim Maaz said in an analysis that Mrs Merkel is so determined not to admit that she was wrong about her migration policy that she has 'lost touch with reality'.","filename":"data/vaneerConsumption/AngelaMerkelshowingsignsofamentalbreakdownandnarcissism.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30A9017700000578-0-image-a-13_1453997068017.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421220_Angela-Merkel-showing-signs-mental-breakdown-narcissism-stubborn-refusal-reverse-migrant-policy-warns-celebrated-German-psychiatrist_1540259224.html","title":"Angela Merkel 'showing signs of a mental breakdown' and 'narcissism'","title_page":"Angela Merkel 'showing signs of a mental breakdown' and 'narcissism' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"For more of the latest on Angela Merkel visit www.dailymail.co.uk/merkel\nPredicts a 'mental breakdown' if she sticks to her guns on migrants\nAngela Merkel is a 'narcissist' whose refusal to curb immigration may be a sign of a 'mental breakdown, according to a celebrated German psychiatrist.\nThe German Chancellor has been heavily criticized over her 'open border' policy, which resulted in 1.1million refugees and migrants entering Germany last year.\nGerman psychiatrist Hans-Joachim Maaz said in an analysis that Mrs Merkel is so determined not to admit that she was wrong about her migration policy that she has 'lost touch with reality'.\nAnalysed: German psychiatrist and psychoanalstst Hans-Joachim Maaz has branded Angela Merker an 'overachiever' and a 'narcissist' with an 'artificially inflated self-image'\nHe describes her as a typical overachiever, who often go to great lengths to please others in order to get validation of their worth from others, as their self esteem is so low.\nOver-achievers feed off success and praise, and struggle to take criticism, which Dr Maaz claims fits for Mr Merkel, Breitbart reports.\nHe says the decision to open Germany's border was an emotional one, adding that the praise she has been given worldwide for her humanitarian act has fed her narcissism.\nHe says it has led to her suffering from an 'artificially inflated self-image', and now her refusal to admit that her 'great humanitarian gesture' was a wrong move may hurt Germany.\nDr Maaz concludes that if Mrs Merkel continues to follow the behavioural patterns of the classic overachiever, 'a psychological or psychosomatic collapse is imminent.'\nHappy days? Mrs Merkel laughs next to Minister of Economic Affairs Minister Sigmar Gabriel, at the Bundestag in Berlin, Germany\nDr Maaz said in his analysis that Mrs Merkel is so determined not to admit that she was wrong about her migration policy that she has 'lost touch with reality'\nGermany's open border policy allowed an unprecedented 1.1 million migrants and refugees to enter the country last year, what its leaders described as an act of historic generosity towards refugees.\nWhen hundreds of thousands of migrants were arriving in the European Union last year on the shores of Italy and Greece, Germany made a bold decision: all refugees from the civil war in Syria would be welcome, regardless of where or how they entered the EU.\nChancellor Angela Merkel said Germany was a rich country that could afford to do its part to take in some of the world's most vulnerable people fleeing war.\n'If Europe fails on the question of refugees ... then it won't be the Europe we wish for,' said Merkel in August.\nBut refugees were not the only people who arrived. In addition to thousands of families fleeing Syria and other war zones, Germany also let in hundreds of thousands of people from other countries with no valid claim for asylum.\nGermany's open border policy allowed an unprecedented 1.1 million migrants and refugees to enter the country last year (pictured are refugees in Berlin on Thursday)\nThe behaviour of the groups has been starkly different. The Syrian refugees intentionally welcomed by Merkel have so far proven overwhelmingly law abiding.\nAccording to a police report from North Rhine-Westphalia, the western German state that includes Cologne, earlier this month, only 0.5 percent of Syrian migrants in the city were caught committing crimes within a year.\nBy contrast, among migrants from North Africa, as many as 40 percent were caught committing crimes within a year, the report says.\nVirtually none of the North Africans arriving in Germany have proven to be genuine refugees: last year Germany granted some form of protection to just 0.19 percent of Tunisian migrants, 3.74 percent of Moroccans and 1.6 percent of Algerians.","url":"https://www.dailymail.co.uk/news/article-3421220/Angela-Merkel-showing-signs-mental-breakdown-narcissism-stubborn-refusal-reverse-migrant-policy-warns-celebrated-German-psychiatrist.html"}
