{"authors":[],"date_download":"2018-10-22 22:31:44","date_modify":"2018-10-22 22:31:44","date_publish":"2014-06-10 10:49:20","description":"The actor and campaigner opened the Global Summit to End Sexual Violence in Conflict in London.","filename":"data/vaneerConsumption/AngelinaJolieUrgesEndtoWarZoneRapeatLondonSummit.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/498501/140610-jolie-sexual-violence-6a_d6c2f17adecff1620045489407a65e98.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_angelina-jolie-urges-end-war-zone-rape-london-summit-n127126_1540247504.html","title":"Angelina Jolie Urges End to War-Zone Rape at London Summit","title_page":"Angelina Jolie Urges End to War-Zone Rape at London Summit","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"War zone rape has nothing to do with sex and everything to do with power,\" added Jolie, who in addition to her Hollywood persona is a special envoy of the UN High Commissioner for Refugees (UNHCR). \"We need to shatter that culture of impunity and make justice not the exception but the norm for these crimes.\n\"This evil will continue to ruin the lives of millions of people unless we make this summit a turning point - and we can.\"\nThe four-day summit is drawing more than 1,000 experts and activists, and dozens of religious leaders, NGOs and political leaders from 117 countries at London's ExCeL center.\n\"This will be the greatest concentration of efforts and discussion and decision ever seen in combating sexual violence and conflict,\" Hague said.\nHe added that the conference would agree on an international protocol that would \"set standards internationally for the documentation and investigation of these crimes\" and help countries \"change their laws, train their armies, and to push their prosecutors to take the necessary action.\"\nJolie and the British government convened the conference after working together on the issue for around two years.\nHague was due to chair a meeting later Tuesday focused on the Nigerian Islamist sect Boko Haram, and the international protocol was due to be launched Wednesday.\nThe summit has garnered significant attention on social media, and as the event was due to start Pope Francis tweeted a message a support using the associated hashtag, #timetoact.\n- Alexander Smith","url":"https://www.nbcnews.com/news/world/angelina-jolie-urges-end-war-zone-rape-london-summit-n127126"}
