{"authors":[],"date_download":"2018-10-23 03:53:28","date_modify":"2018-10-23 03:53:28","date_publish":"2016-01-28 19:41:06","description":"A campaign by a rightwing Israeli NGO branding artists linked to leftwing groups hostile \"moles\" was denounced Thursday by politicians across the political s...","filename":"data/vaneerConsumption/AngeratcampaignagainstleftistIsraeliartists.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h2sv-2vdWmEltwXfba0ce28e632c31065-427_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421571_Anger-campaign-against-leftist-Israeli-artists_1540266808.html","title":"Anger at campaign against leftist Israeli artists","title_page":"Anger at campaign against leftist Israeli artists | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Anger at campaign against leftist Israeli artists\nA campaign by a rightwing Israeli NGO branding artists linked to leftwing groups hostile \"moles\" was denounced Thursday by politicians across the political spectrum as \"fascist\" and \"despicable\".\nIm Tirtzu put images of four prominent Israeli cultural figures on its Facebook page on Wednesday, alleging their support of various \"fifth column\" leftwing organisations.\nThe group also accused dozens more artists and intellectuals of disloyalty.\nWriter David Grossman is one of four prominent Isreali cultural figures who was branded a \"mole\" by the rightwing group Im Tirtzu ©Hector Guerrero (AFP/File)\nIts campaign, titled \"moles in culture,\" follows a video it released in December lambasting Israeli human rights activists whose groups receive foreign funding and saying they should be called \"foreign agents\".\n\"Our cultural world is controlled by many moles planted by the New Israel Fund and its organisations,\" Im Tirtzu wrote on Wednesday, referring to a US-based foundation that funds Israeli groups active in the fields of civil rights, religious freedom and social justice.\nThe cultural establishment and artists in Israel \"conduct themselves like a political junta that does everything it can to preserve its power and influence,\" it said.\nThe Facebook post shows authors Amos Oz and David Grossman, actress Gila Almagor and playwright Yehoshua Sobol. It said Sobol \"stood proudly\" in the \"battle against the culture minister.\"\nHowever Culture Minister Miri Regev, a member of Prime Minister Benjamin Netanyahu's ruling Likud party, herself spoke out against Im Tirtzu's campaign.\n\"Alongside the public's right to know, we must refrain from statements that could lead to incitement and violence. Hurting any person because of their political opinions is wrong,\" she wrote on Facebook.\n-'Fascist, ugly and dangerous'-\nLikud MP Benny Begin, son of late prime minister Menachem Begin, called the Im Tirtzu offensive a \"new level of ugly\".\n\"There's an attempt here to plant in the public's mind the term 'moles' as a synonym for 'traitors',\" he said on public radio.\n\"Seeking out, locating and marking supposed traitors is an old fascist trait, both ugly and dangerous,\" he added.\nIsaac Herzog, head of the opposition Labour party, said that \"McCarthyism is making a despicable attempt to take over Israel\" but \"the Israeli McCarthyism and the lowlifes leading it will disappear, like they did from the United States.\"\nThe Association for Civil Rights in Israel said Im Tirtzu's attack on artists and intellectuals came after it had previously targeted academics and human rights activists.\n\"The infamous Senator Joseph McCarthy is a cultural hero in the eyes of Im Tirtzu,\" ACRI said in a statement. \"But the real cultural heroes are human rights activists, intellectuals and artists who stand up to protect human rights and are not deterred from fighting against human rights violations.\"\nMcCarthyism refers to allegations of treason or subversion without proof, and was coined after the former US senator's anti-communist witch-hunts from the late 1940s to the 1950s.\nIm Tirtzu's latest broadside coincides with a row over a bill proposed by Justice Minister Ayelet Shaked targeting leftwing NGOs that the United States has warned could have \"chilling\" repercussions.\nThe bill demands that NGOs receiving more than half of their funding from foreign governments declare it in all their official reports, while their representatives should wear a special badge during visits to parliament.\nAnd Education Minister Naftali Bennett, who leads Shaked's far-right Jewish Home party, has ordered a number of changes in the school curriculum which have alarmed the left.\nBoth minsters criticised Im Tirtzu's crusade, with Bennett calling it \"embarrassing, unnecessary and degrading\" in a tweet, and Shaked telling army radio that \"artists with leftwing opinions shouldn't be considered 'moles' or demonised.\"","url":"https://www.dailymail.co.uk/wires/afp/article-3421571/Anger-campaign-against-leftist-Israeli-artists.html"}
