{"authors":[],"date_download":"2018-10-22 22:03:43","date_modify":"2018-10-22 22:03:43","date_publish":"2014-06-06 12:25:08","description":"A major global summit, co-hosted by Angelina Jolie, aims to stop rape and sexual assault being used as a tactic of war.","filename":"data/vaneerConsumption/AngelinaJolieUKtoHostSummittoEndSexualViolenceinWar.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/492451/140606-jolie-sexual-violence-jsw-1144a_fccd0c174ab859ffefbdf0678b942090.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_angelina-jolie-u-k-host-summit-end-sexual-violence-war-n124321_1540245823.html","title":"Angelina Jolie, U.K. to Host Summit to End Sexual Violence in War","title_page":"Angelina Jolie, U.K. to Host Summit to End Sexual Violence in War","title_rss":"NULL","source_domain":"nbcnews.com","text":"Delegates will be reminded that the problem is not limited to tribal conflict or in areas with limited education.\nThe scale of the violence is staggering.\nIn the space of just three years, up to 60,000 women were raped in the former Yugoslavia’s conflict of the early 1990s, according to United Nations estimates.\nIn Syria, more than 38,000 people appealed to the U.N. Nations Population Fund for help after sexual assault or other gender-based violence during 2013, the agency said.\nU.N. agencies estimate that more than 60,000 women were raped during the civil war in Sierra Leone (1991-2002), more than 40,000 in Liberia (1989-2003), between 100,000 and 250,000 in Rwanda during the three months of genocide in 1994 and at least 200,000 in the Democratic Republic of the Congo since 1998.\n“It is a problem in almost every war — whether the conflict is based on ethnicity or religion, it’s always there for one reason or another,” said Lauren Wolfe, director of Women Under Siege, a journalism project at the Women's Media Center on sexualized violence in conflict, and an advisory committee member for the International Campaign to Stop Rape & Gender Violence in Conflict.\n“In Syria, rape is present because it is an effective tool. It is culturally so powerful, an easy way to make a statement … to humiliate your enemy in a culture where the purity of women is so sanctified.”\nWhile most of the attacks are against women, men and children are not immune to the violence.\nA U.N. survey in eastern Congo found that 15 percent of male respondents had been victims of sexual violence in the conflict. Wolfe’s innovative crowdsourcing project documenting war zone sex attacks in Syria has counted almost 90 incidents against men and boys.\nA recent UNICEF report said approximately 1,100 rapes are reported each month in Congo, with an average of 36 women and girls raped every day.\n“Horrifyingly, on a visit to the DRC last year, the special representative on sexual violence in conflict found that children as young as six months old have been victims of rape by armed groups,” the report said.\n\"Children as young as six months old have been victims of rape\"\nWolfe believes the problem is getting neither better nor worse, but is an endemic and under-reported feature of war right through history.\nIn the American Civil War, military courts prosecuted at least 450 cases involving sexual crimes, according to recent research by Crystal N. Feimster, an assistant professor at Yale.\nLittle has changed because there is “often no incentive for anyone to report sexual violence,” Wolfe said. “Most victims cannot expect support or to see a prosecution. The most likely outcome would be stigma, even within families.”\nAnother difficulty in quantifying cases is that the victims are often the only witness.\n“When it comes to sexualized violence in Syria, 20 percent of the female victims are dead,” Wolfe added.\nFor those who survive such atrocities around the world, there is often no help. A lucky few can get assistance from peacekeepers or non-profits such as CARE International, which helped Josephine in the DRC and shared her story with NBC News.\nIts current campaign aims to shift global attitudes to women, teaching boys and young men to challenge stereotypes surrounding what it means to “be a man.”\nIn an opinion article in London's Sunday Times, Hague outlined two of the practical steps that the summit hopes to achieve in light of cases such as Josephine's.\n\"We will ask countries to bring their laws on rape and sexual violence into line with international standards,\" Hague wrote. \"We will call for all soldiers and peacekeepers to be trained to understand and prevent war-zone sexual violence.\n\"Simple measures, from installing lighting in refugee camps to accompanying women collecting firewood, can dramatically reduce the number of attacks, and we want these basic protections to become universal.\"","url":"https://www.nbcnews.com/news/world/angelina-jolie-u-k-host-summit-end-sexual-violence-war-n124321"}
