{"authors":["Emily Sheridan","Hugo Gye For Mailonline"],"date_download":"2018-10-23 00:24:35","date_modify":"2018-10-23 00:24:35","date_publish":"2016-01-11 09:39:57","description":"Following the passing of the 69-year-old star on Sunday, the TV show's bosses have confirmed they will be informing Angie of the news away from the cameras.","filename":"data/vaneerConsumption/AngieBowiedecidestostayinCelebrityBigBrotherhouseafterDavidsdeath.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/09/3006D8EC00000578-0-image-a-34_1452505112279.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393590_David-Bowie-s-death-leaves-ex-wife-Angie-s-future-Celebrity-Big-Brother-doubt_1540254275.html","title":"Angie Bowie decides to stay in Celebrity Big Brother house after David's death","title_page":"Angie Bowie decides to stay in Celebrity Big Brother house after David's death | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Angie Bowie has decided to remain in the Celebrity Big Brother house after being informed of the death of her ex-husband David.\nTV bosses confirmed the mother-of-two's representatives spoke to her off-camera on Monday to tell her of the singer's passing as she continued to be cut off from the outside world on the show.\nThe American former model, 66, has been appearing on the Channel 5 reality show since last Tuesday and has been making headlines with her claims about her failed marriage to the legendary singer.\nA statement from Channel 5 read: 'Following the very sad news of David Bowie's death, we can now confirm that Angie Bowie has been informed off camera by her representatives.\nScroll down for video\nUnaware: Angie Bowie on Sunday night's episode of Celebrity Big Brother before the death of her ex-husband was announced\nStaying put: Big Brother announced on their official Twitter feed that the mother-of-two had decided to remain in the house\n'She has taken the decision to continue in the programme. The decision to remain in the house is entirely her choice, and she has been given the option to leave at any time if she changes her mind.\n'Appropriate support will be available to Angie at any time if needed.'\nFollowing the passing of the 69-year-old star on Sunday, the TV show's bosses have confirmed they will be informing Angie of the news away from the cameras as soon as possible.\nThe sad turn of events had earlier prompted viewers to speculate if Angie will end up leaving the CBB house.\nDavid's death would make many of Angie's recent stories about their relationship inappropriate as she hasn't held back with her negative opinion of her ex-husband on the show.\nEarlier on Monday, viewers of the show took to Twitter to wonder if Channel 5 bosses would tell Angie the sad news.\nThe way they were: Angie and her late ex-husband David Bowie in London in 1974\nOne Twitter user Jordon Lee wrote: 'I hope Channel 5 tell Angie Bowie off camera and don't use someone's death for ratings.'\nWhile another, brainyant tweeted: 'Angie Bowie will be waking up to some very bad news this morning. #DavidBowie #CBB2016.'\nDescribing their divorce in an episode of the reality show last week, Angie admitted she hadn't seen David for around 40 years.\nShe said: 'I go to great lengths to avoid him.\nPassing of a legend: The 69-year-old died on Sunday following an 18 month battle with cancer\n'Did you think I was going to be polite, to be nice, so that people like me? No. It was terrible when we broke up, it was awful.'\nPop legend David's death on Sunday following an 18 month battle with cancer was announced on his official Facebook page on Monday morning.\nA spokesman for the singer said: 'David Bowie died peacefully surrounded by his family after a courageous 18-month battle with cancer.\nLots of questions: Fans would be wondering if Angie Bowie would be told, or even leave the Celebrity Big Brother house following the news\n'While many of you will share in this loss, we ask that you respect the family’s privacy during their time of grief.'\nAngie and David were married from 1970 and 1980, which produced a son Zowie, who later changed his name to Duncan.\nDuncan, an award-winning film-maker and screenwriter, has been estranged from his mother since he was 13.\nLast week, Angie told CBB housemate David Gest that her son 'hates me', while accusing her ex David of causing the rift.\nDevastated: David and Angela's son Duncan Jones, pictured with his father in 2009, is understandably grief-stricken\nAngie, who also has a daughter Stacia with punk musician Drew Blood, said: 'I don’t see him at all, he doesn’t like me. But my daughter likes me.\n'I guess David told him not to [talk to me]. It does seem odd.'\nIn a 2011 interview, Duncan told the Mail On Sunday's Live magazine: 'We stopped communicating when I was 13 and it was the right choice then and I’m convinced it’s still the right choice now,’ he tells me firmly.\n‘She’s a woman who didn’t have a very positive effect on my upbringing so I think it was the right move.'\nFollowing Monday's announcement, their son Duncan posted a childhood photo with his dad, admitting he was devastated by his death.\nTribute: David's son Duncan posted a sweet baby photo of himself with his father in the early 1970s\nShock announcement: The singer's death was announced on his official Facebook page on Monday morning\nHe wrote: 'Very sorry and sad to say it's true. I'll be offline for a while. Love to all.'\nUnfortunately, Duncan is no stranger to cancer after his wife Rodene Ronquillo Jones battled the disease between 2012-2013.\nShe was given the all clear from breast cancer in 2013 after undergoing a double mastectomy.\nIt has now emerged that David was gravely ill during the recording and release of his latest album Blackstar - which was released last week - as well as the making of its two music videos.\nHis final video, Lazarus, was released last week and featured haunting footage of the singer confined to a hospital bed with his eyes covered by a bandage.\nHe was seen in public for the last time in December, attending the premiere in New York of a musical based on his songs, also called Lazarus.\nIn happier times: Angie with David and her mother Helena following their March 1970 wedding at Bromley Registry Office in Kent","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393590/David-Bowie-s-death-leaves-ex-wife-Angie-s-future-Celebrity-Big-Brother-doubt.html"}
