{"authors":["Associated Press"],"date_download":"2018-10-23 04:59:47","date_modify":"2018-10-23 04:59:47","date_publish":"2016-01-11 18:06:03","description":"LONDON (AP) — Archbishop of Canterbury Justin Welby said Monday he hoped this week's meeting of world Anglican leaders could avoid a split over homosexuality...","filename":"data/vaneerConsumption/Anglicanleaderhopesmeetingcanavoidhomosexualitysplit.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:d448eb76377d4fc8a0a6a315bc563dd3-48qEJGFphM8d437f0aaf927c7f9c-523_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3394063_Archbishop-Canterbury-pushes-reconciliation_1540270787.html","title":"Anglican leader hopes meeting can avoid homosexuality split","title_page":"Anglican leader hopes meeting can avoid homosexuality split | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Anglican leader hopes meeting can avoid homosexuality split\nLONDON (AP) — Archbishop of Canterbury Justin Welby said Monday he hoped this week's meeting of world Anglican leaders could avoid a split over homosexuality in the worldwide fellowship and lead to \"finding ways to disagree well.\"\nHowever, Welby said there's little he can do if some of the 38 leaders quit the meeting in Canterbury. Welby is the spiritual head of the 85-million-member Anglican Communion but, unlike a pope, he has no authority to force a compromise.\n\"Certainly I want reconciliation, but reconciliation doesn't always mean agreement — in fact it very seldom does. It means finding ways to disagree well and that's what we've got to do this week,\" Welby told the BBC. \"There's nothing I can do if people decide that they want to leave the room. It won't split the communion.\"\nFILE - In this Sunday, Oct. 20, 2013 file photo, the Archbishop of Canterbury Justin Welby conducts a service at the All Saints Cathedral in Nairobi, Kenya. Archbishop of Canterbury Justin Welby said Monday, Jan. 11, 2016 he hoped this week¿s summit of world Anglican leaders could avoid a split over homosexuality in the worldwide fellowship and lead to ``finding ways to disagree well.¿¿ (AP Photo/Ben Curtis, File)\nThe communion, a fellowship rooted in the Church of England, has been fracturing for decades over gay relationships and women's ordination, among other issues. The rifts blew wide open in 2003 when the Episcopal Church, the Anglican body in the United States, consecrated the first openly gay bishop, Gene Robinson, in New Hampshire. The most vocal outrage over Robinson's election came from Africa, home to some of the fastest-growing churches in the communion and the deepest opposition to gay relationships as a violation of Scripture.\nOver a series of world meetings, leaders of the national churches, called primates, have debated whether they should remain one world fellowship given their differences. In 2009, Anglican national leaders in Nigeria, Kenya, Uganda and other church provinces helped create the Anglican Church in North America, as a conservative alternative to the U.S. Episcopal Church. Welby invited the leader of the conservative North American body to participate in the Canterbury assembly.\nArchbishop Stanley Ntagali, head of the Anglican Church of Uganda, said in a statement last week that he and many other conservative archbishops would walk out of the gathering \"if godly order is not restored.\"\nMeanwhile, more than 100 Anglican clergy and lay people sent a letter urging the primates to repent of discrimination against gays and lesbians in the church and \"to be prophetic in your action and Christ-like in your love\" toward gays at the Canterbury meeting. The top U.S. Episcopal legislative body voted last year to authorize gay marriages in their churches, and the Anglican Church of Canada is scheduled to vote on a similar authorization this July. Anglicans in Brazil, South Africa and some other countries have also expressed openness to accepting same-sex relationships.\nA news conference has been scheduled for Friday at the end of the meeting, when church leaders are expected to issue a document explaining what they've decided.\nEven if a walkout occurs in the middle of the summit, Welby said, \"the church is a family and you remain a family even if you go your separate ways.\"\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3394063/Archbishop-Canterbury-pushes-reconciliation.html"}
