{"authors":[],"date_download":"2018-10-22 22:10:08","date_modify":"2018-10-22 22:10:08","date_publish":"2016-01-28 10:05:56","description":"For half an hour, the passenger boat sat stranded off the coast of Angola's seaside capital Luanda. Streams of rubbish clogged its engine as it attempted to ...","filename":"data/vaneerConsumption/Angolaschaoticcapitalchokesundermountainsoftrash.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g5gw-4vVdYopwYQ7f641721b07ab91d8f-125_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420667_Angolas-chaotic-capital-chokes-mountains-trash_1540246208.html","title":"Angola's chaotic capital chokes under mountains of trash","title_page":"Angola's chaotic capital chokes under mountains of trash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Angola's chaotic capital chokes under mountains of trash\nFor half an hour, the passenger boat sat stranded off the coast of Angola's seaside capital Luanda.\nStreams of rubbish clogged its engine as it attempted to enter the port of a city sinking under the weight of several months of uncollected trash that blocks traffic and exasperates residents.\n\"Look at this traffic jam, it's because of the bins overflowing onto the road,\" said motorist Joao Mampuya, 52.\nAngolans living in Luanda complain that several months worth of uncollected trash is blocking roads in the African city\n\"The rubbish is taking up one of the two lanes and it's been there so long.\"\nThe sprawling city, home to 6.5 million people, has become an open-air dumping site.\nLuanda has for years been a chaotic urban mess. It figures among the world's most expensive cities and the overwhelming majority of residents live in squalid shantytowns with no sanitation or electricity.\nThe company responsible for removing the trash says it has not been paid by the local authorities, as the country -- the second largest oil producer in Africa -- buckles under the collapse of the oil price.\nRenowned independent journalist Rafael Marques de Morais questioned the company's management.\n\"Did the money disappear? Did they hire incompetent operators? Are the local governments not working? What about the central government?\" he wrote in a local independent paper.\nWhatever the answer, the rubbish continues piling up all over the city, filling up sidewalks outside both luxurious mansions and the shacks of the slums.\nDuring the rainy season, the streets become flooded, forming stinking, black rivers that carry the decaying waste into stagnant ponds.\n- Health risks -\nThe residents have grown used to throwing their trash in gutters and on sidewalks, drains and ditches, and sometimes setting the stinking mounds on fire.\nThey vent their frustrations online, posting selfies in front of rubbish piles several metres high or on trash-covered railway tracks that have caused many trains to be delays.\nBut since January 11, there's been a new man in charge after the appointment of General Higino Carneiro as governor -- with the specific mandate of cleaning up Luanda's streets.\nHis arrival -- as a member of the ruling Popular Movement for the Liberation of Angola (MPLA) -- comes a year before a presidential election, in which President Jose Eduardo dos Santos -- in power since 1979 -- is expected to retain office.\nDuring his first official visit to some Luanda suburbs last week, Carneiro announced the creation of an urban \"command post\" in charge of fighting the pollution problem.\n\"We can't go on like this, or we will be forced to declare a health state of emergency,\" he said.\nThe governor believes that without action, epidemics could run rampant in the city. Huge billboards promoting sanitation have been put up across town, warning against cholera.\nSince his appointment, \"men in green (uniforms)\" -- municipal employees, private workers and even volunteers -- have been working day and night tackling the rotting mounds.\nThe task ahead of them is enormous. Residents are complaining of rats, cockroaches and flies proliferating around the heaps.\n\"With the accumulation of the bins, I fear for my baby because the rats are pouring into my home,\" said one domestic worker.\nThe situation seems to be slowly improving, but residents are holding back praise for a real, long-term results –- particularly in the neglected slums.\nAs one resident said, \"The trash comes back faster than its removed.\"\nAngolans walk past a pile of uncollected garbage in Luanda, on January 20, 2016","url":"https://www.dailymail.co.uk/wires/afp/article-3420667/Angolas-chaotic-capital-chokes-mountains-trash.html"}
