{"authors":[],"date_download":"2018-10-30 18:45:53","date_modify":"2018-10-30 18:45:53","date_publish":"2016-10-11 21:32:00","description":"Throughout Cobb County, I'm talking from Marietta to Smyrna to Kennesaw and back, there's plenty for hipsters to do in Cobb.","filename":"data/vaneerConsumption/AnhonesttogoodnesshipstersguidetoCobbCounty.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/11/02/Images/053115%20Denver%20BG30.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_honest-goodness-hipster-guide-cobb-county__1540925153.html","title":"An honest-to-goodness hipster's guide to Cobb County","title_page":"An honest-to-goodness hipster's guide to Cobb County","title_rss":"NULL","source_domain":"ajc.com","text":"You can scoff. It's cool. You may not think PBR cans and beards and fancy coffee when you conjure up Cobb County in your mind.\nIf not, that means you need this guide even more.\nOh, and if you don't know what a hipster is, try this: Who is that one person who Instagrams lattes with designs on top who has walked into a record store four times wearing the same just-ripped jeans?\nThat person is a hipster.\nSo grab your totally non-ironic Outkast snapback and find out where to be a cool kid in Cobb.\nCoffee\nThe best way to start anything is with coffee.\nRev Coffee in Smyrna is where you want to go to get a cup of joe, yo. The coffee shop — which has \"Brewin' in the burbs\" splattered across its homepage — opened in 2010.\nAnd don't forget about Cool Beans Coffee Roasters in Marietta with its special creations named \"8-Ball\" and \"Ponch Via\" for you to try.\nFood and Drink\nLet's not act like food isn't the most important thing. I've been eating like my life depended on it ever since I was born. And I know you don't like chains, so here are some options.\nKorean barbecue in Cobb? Yeah, it's a thing. Heirloom Market BBQ exists, and the county is a better place for it. Gochujang sloppy joes and kimchi slaw can be had there, so that's all you need to know.\nLike \"Atlanta Restaurant Scene\" on Facebook for more cooking demos.\nSmush together two homes from the 1880s, add a barbecue along with beer garden of 59 taps and you get The Nest Kennesaw.\nFormer \"Food Network Star\" finalist Justin Balmes is not playing around at Two Birds Taphouse in Marietta with Pork Loin Schnitzel and white-cheddar pimento cheese with roasted chilies, apple and griddled bread.\nYou also can't go wrong with up-and-coming chef Andre Gomez at his Porch Light Latin Kitchen in Smyrna. Citrus-brined beer can chicken and a Smyrna Old Fashioned? I want to go to there.\nChef Andre Gomez’s “can can” Puerto Rican pork chop at Porch Light. ((Mia Yakel)) (Mia Yakel)\nMuss and Turner's is a Cumberland Parkway standout with dishes including mushroom casareccia with a Dutch cheese you've probably never heard of. Oh, and there's this burger \"sheathed in white cheddar and topped with a roasted poblano and cilantro aioli\" if you're into that sort of thing.\nBut I haven't been forthcoming. There's something else going on at M&T's: There's a speakeasy-themed booze joint named Eleanor's in the back.\nEleanor's is disguised behind what looks like a metal walk-in cooler door at Muss & Turner's. (Becky Stein photo)\nAnd now that we're talking about alcohol (finally) you must belly up to the bar at Johnnie MacCracken's Celtic Firehouse Pub. It regularly has music on Fridays and 70 taps to pick from always.\nSo now that we've determined you like beer, check out Red Hare Brewing in Marietta. Sure, you can get its pale ales in EAV or O4W, but how are you going to win its cornhole tournament if not in Cobb?\nAnthony Crane (right) and Doug Gross with the band Wrong Way perform at Red Hare Brewery in Marietta during the company's third anniversary party on Saturday, August 23, 2014. JONATHAN PHILLIPS / SPECIAL (Jonathan Phillips)\nDon't forget about Southern Sky Brewing Company in Kennesaw with everything from English porters to pink ales all year. Nor should you ignore Burnt Hickory Brewing, which has been around since 2011. And there's the newbies Dry County Brewing Company.\nIf you're looking to keep it more fruity, stop by Treehorn Cider in Marietta. And if you're into the growler game, check out Schoolhouse Beer in Marietta and the Stout Brothers in Smyrna.\nAnd because you're already in Smyrna, stop by the county's only rooftop bar Creatwood Tavern and enjoy one of the 12 rotating local taps on the rooftop patio.\nThe Great Outdoors\nAfter eating all that food and drinking all those drinks, you may need to go for a walk or bike ride.\nSilver Comet Trail is 61.5 miles of paved walkway great for everything from people to bicycles to horses. It starts at the Mavell Road Trailhead in Smyrna and ends at the Georgia-Alabama line near the Esom Hill Trailhead.\nThe Noonday Creek Trail opened in September 2014 and stretches for seven miles from Town Center to Bells Ferry Road Northeast just east of Town Center. Plans have it reaching Woodstock one day.\nPictures of Noonday Creek Trail by Marty Sewell courtesy of Cobb County Department of Transportation.\nThe Kennesaw Mountain National Battlefield Park spans nearly 3,000 acres and is perfect to get lost in with a picnic basket.\nYour Vinyl Habit\nSwing by Sweet Melissa Records in Marietta Square seven days a week. HINT: The dollar bin and new arrivals are updated every Friday.\nThrifting\nFind yourself that 80s Coca-Cola T-shirt or those perfect ripped jeans or, the holy grail, that 1996 Atlanta Olympics sweater all the cool kids somehow have.\nHow? Plan the ultimate Goodwill adventure that weaves throughout Cobb County.\nYou can swing by Ecologie Resale & Vintage in Kennesaw. If you want to see what the store is about, just check out its Instagram.\nGoodbye\nThere's enough here to get a hipster to shake off that suburban malaise and go have a hot drink, a cold drink, a big meal, a walk, a listen or a thrifty nirvana moment.\nNo matter what you do, don't say Cobb County isn't cool.\nIf there's something I missed, I'm sure you hipsters will let me know before everyone else does. To do so, email me at ben.brasch@ajc.com or tweet me.","url":"https://www.ajc.com/news/local/honest-goodness-hipster-guide-cobb-county/7sExfnqumCLHTaGskIyENI/"}
