{"authors":["Madhuri Sathish"],"date_download":"2018-10-31 01:48:34","date_modify":"2018-10-31 01:48:34","date_publish":"2018-09-14 00:17:20","description":"By Thursday evening, the center of Hurricane Florence was within 150 miles of both Wilmington, North Carolina and Myrtle Beach, South Carolina. Although the storm has weakened to a Category 2 storm, it has already started to generate flooding in…","filename":"data/vaneerConsumption/AnimalRescuesBracingForHurricaneFlorenceHaveGottenAHugeResponseFromFosterFamilies.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/13/d6f79ace-a5f0-45ee-8c79-83df09f467e1-getty-1032700824.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_animal-rescues-bracing-for-hurricane-florence-have-gotten-a-huge-response-from-foster-families-11915692_1540950514.html","title":"Animal Rescues Bracing For Hurricane Florence Have Gotten A Huge Response From Foster Families","title_page":"Animal Rescues Bracing For Hurricane Florence Have Gotten A Huge Response From Foster Families","title_rss":"NULL","source_domain":"bustle.com","text":"By Thursday evening, the center of Hurricane Florence was within 150 miles of both Wilmington, North Carolina and Myrtle Beach, South Carolina. Although the storm has weakened to a Category 2 storm, it has already started to generate flooding in North Carolina, as well as hurricane-force winds that are expected to grow in strength. But people are not the only ones in danger from the storm — animals are, too, and residents in the area have been rushing to foster pets before Florence hits.\nAccording to BuzzFeed, pet shelters along the East Coast have been unable to evacuate because they are responsible for the lives of numerous animals. The manager of one animal shelter in Pender County, North Carolina told The Washington Post that staff members are \"begging for assistance\" and \"avoiding euthanasia at all costs,\" but are worried that they will eventually have to \"make space\" if the shelter hits capacity.\nAs a result, North Carolina residents like Ali Standish have been stepping up to encourage others in the region to adopt pets so that they are not in harm's way when the storm hits. On Wednesday, Standish tweeted a photo of people standing in line to pick up foster dogs from animal rescue nonprofit Saving Grace so that coastal shelters could evacuate; that photo quickly accumulated thousands of likes and retweets, and encouraged others to foster pets.\nIn addition to reposting Standish's tweet, Saving Grace has been posting pictures and descriptions of dogs that need to be fostered on its official Facebook page. Standish is far from the only person who has been engaged in animal rescue efforts ahead of the storm, however. In Wilmington, North Carolina, Kevin Raffee and his wife Julie Lamacchia — who is the president of the Humane Society in nearby Burgaw — rescued nearly 20 dogs and cats from being euthanized.\n“For us, animals are more important than things,” Lamacchia, told The Washington Post. “Things can be replaced — anything can be replaced — but you can never replace a life, whether it’s a person or an animal.”\nMeanwhile, in Florence, South Carolina, a group called Lucky Dog Animal Rescue was able to pick up dozens of dogs and cats and transport them north to Washington, D.C.. They hit some snags on the way — notably when the van they were using to transport the animals broke down — but 50 volunteers from Looney’s K9 Rescue Transport in Lexington, South Carolina responded to Lucky Dog's call for help, and were able to help get all of the animals up to D.C. Now, these cats and dogs are being taken in by foster families in the D.C. area:\nAs The Washington Post pointed out, animal shelters frequently fill up ahead of major storms because people quickly evacuate affected regions and are unable to foster any animals. Many animals are also abandoned as people evacuate, although in the aftermath of Hurricane Katrina, one poll found that 44 percent of people who did not evacuate declined to do so because they didn't want to leave their pets behind.","url":"https://www.bustle.com/p/animal-rescues-bracing-for-hurricane-florence-have-gotten-a-huge-response-from-foster-families-11915692"}
