{"authors":[],"date_download":"2018-10-30 18:30:29","date_modify":"2018-10-30 18:30:29","date_publish":"2017-03-07 16:24:00","description":"“I ain’t running,” Doris Payne said in a phone interview after missing court in DeKalb County.","filename":"data/vaneerConsumption/Aninterviewwith86yearoldinternationaljewelthiefDorisPayne.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/CmgSharedContent/2017/03/07/Images/photos.medleyphoto.13447506.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_interview-with-y_297b49c5704c79daacaad56c1b5968cb__1540924229.html","title":"An interview with 86-year-old international jewel thief Doris Payne","title_page":"An interview with 86-year-old international jewel thief Doris Payne","title_rss":"NULL","source_domain":"ajc.com","text":"Doris Payne, the international jewel thief who's stolen about $2 million worth over the last six decades, says she tried to do right this time.\nThe 86-year-old faces a bench warrant after missing a court date in DeKalb County on Monday. She told The Atlanta Journal-Constitution she wasn’t able to go because of health issues.\n“I ain’t runnin’,” she said in a phone interview. “Medically, I was not able to go.”\nShe’s been dealing with severe pain, trouble with balance and draining tests related to a lump in her neck.\n“It might be cancerous. It may not,” she said.\nPayne’s hearing was related to a theft charge from a December arrest at Perimeter Mall. She said she’s tried to get paperwork to show her condition, but it hasn’t come through yet.\nLast month, she was deemed too ill to stand trial by the judge presiding over a Fulton County case stemming from a missing set of Christian Dior earrings at Phipps Plaza.\nPayne has been open about her habits of theft, which she detailed in a documentary called, “The Life and Crimes of Doris Payne.”\nShe isn’t afraid of court.\n“I’ve never in my life been late for court,” she told the AJC. “I assure you everything was done that could be done.”\nShe has much experience standing before judges.\nOver the decades, she has developed a pattern of short sentences, getting out for good behavior and then stealing again.\nShe’s said she didn’t feel bad for the theft, only for getting caught and having to face the challenges of perpetual arrest.\nHer current condition is a new challenge, one that’s kept her down recently, with sometimes intense pain that makes her feel like she’s dying, and confusion over what the cause might be.\nDoctors are so far “baffled” by the lump’s behavior.\nShe’s baffled how the pain comes and goes. But she said the fact that it dissipates often gives her hope that it isn’t cancer.\n“I ain’t cryin’,” she said. “I'm just doing the best I can.”","url":"https://www.ajc.com/news/local/interview-with-year-old-international-jewel-thief-doris-payne/Lxhtk7t0jImagkeM91wsML/"}
