{"authors":["Cindy Tran For Daily Mail Australia"],"date_download":"2018-10-23 02:54:43","date_modify":"2018-10-23 02:54:43","date_publish":"2016-01-11 15:20:36","description":"The incredible creation is the work of bodypainter Anke Catesby, from Brisbane, Australia, who spent three hours painstakingly turning model Tara Mills into the musical instrument.","filename":"data/vaneerConsumption/AnkeCatesbytransformmodelTaraMillsintoacellousingnothingbutpaint.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/300A32AE00000578-0-image-a-69_1452515915161.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394094_Anke-Catesby-transform-model-Tara-Mills-curvaceous-cello-using-paint_1540263283.html","title":"Anke Catesby transform model Tara Mills into a cello using nothing but paint","title_page":"Anke Catesby transform model Tara Mills into a cello using nothing but paint | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A naked woman has been transformed into a curvaceous cello using nothing but paint.\nThe incredible illusion is the work of body painter Anke Catesby, from Brisbane, Australia, who spent three hours painstakingly turning model Tara Mills into the musical instrument.\nThe amateur artist felt inspired to morph her friends into her cello creation after noticing the striking similarities between the instrument and a woman's body while looking at black and white photos.\nAnd with a flick of a paintbrush, the stunning result uses the curves of Tara's back to create the shape of the instrument while Jo Sparrow's hands are seen 'playing' the instrument.\nBody painter Anke Catesby used the curves of model Tara Mill's back to create the shape of a cello while Jo Sparrow's hands are seen 'playing' the instrument\n'It is quite ironic that I didn't put the two together until very recently,' the 47-year-old said.\n'I was researching some black and white photography for a painting idea I had when I came across a photo of a couple of nudes posed in such a way that reminded me of someone playing a cello.\n'The lighting was so dramatic, you could just about hear the classical music jump off the page. I knew straight away that I had to paint a literal translation of my impression.'\nShe took the concept to her photographer husband Simon, who helped turn the innovative idea into a breathtaking masterpiece.\n'I asked if he could create the lighting effect that I was picturing in my head,' she said.\n'It was very much a joint project where his expertise and mine came together to create this one shot project.'\nThe keen amateur artist felt inspired to morph her friends into her cello creation after noticing the similarity between the instrument and a woman's body while looking at black and white photographs\nThe talented 47-year-old artist spent three hours painstakingly turning the model into the musical instrument\nThe 47-year-old said the eye-catching display took about three hours to complete.\n'The painting didn't take long at all - it took me two hours to do the model's hair then paint the cello. The photo shoot was also quick - with a few changes in lighting it took about an hour,' she said.\n'I love it the result - we have a copy hanging in our lounge room. There is pride in creating a pleasing image.\n'There is also a feeling of validation. We created exactly what we pictured, which is great motivation for future projects.'\nThe talented artist gave up a career in hospitality to pursue a full-time role in body painting about three years ago after her husband brought some leftover body paint home from work.\n'I've loved body art for a very long time, since my late teens, but I've always painted or drawn on paper and canvas,' she said.\n'My husband has been involved with the local body painting community for some years. It wasn't until late 2012, when he brought some body paint back from a shoot that I got the urge to give it a go.\n'I talked a girlfriend into letting me turn her into a vase - it wasn't perfect, but I loved painting on human skin and couldn't wait to do more.\nMs Catesby gave up a career in hospitality to pursue a full-time role in body painting about three years ago\nShe was persuaded to enter a body painting competition - the Australian Body Art Carnivale - by her husband in May 2013.\nAnd much to her surprise she won the top prize, and hasn't looked back since.\n'I had just wanted to go to look, but my husband said that I wouldn't be able to enjoy all the behind the scenes stuff unless I entered, so I did,' she said.\n'My design won first prize in its category, and people's choice award. I've not stopped painting people since.\nShe added: 'It's very important to me that body painting be seen as an art, not a party gag.\n'There is a real beauty in this very temporary art.","url":"https://www.dailymail.co.uk/news/article-3394094/Anke-Catesby-transform-model-Tara-Mills-curvaceous-cello-using-paint.html"}
