{"authors":["Unity Blott For Mailonline"],"date_download":"2018-10-23 01:48:34","date_modify":"2018-10-23 01:48:34","date_publish":"2017-04-26 12:27:23","description":"The editor said US Vogue was keen to feature 'women in all different walks of life', gushing: 'A woman is prime minister in Britain, which is our great ally, for the first time since Margaret Thatcher.'","filename":"data/vaneerConsumption/AnnaWintouronpickingTheresaMaytostarinUSVogue.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9F50F400000578-0-image-a-9_1493205974100.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4446646_Anna-Wintour-picking-Theresa-star-Vogue_1540259314.html","title":"Anna Wintour on picking Theresa May to star in US Vogue","title_page":"Anna Wintour on picking Theresa May to star in US Vogue | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Politics and fashion collided when Theresa May made a surprise appearance on the pages of US Vogue earlier this year.\nAnd now the editor-in-chief has revealed that the Prime Minister was a 'natural fit' for the fashion bible as part of its mission to keep its readers up-to-date with current affairs.\nThe doyenne of fashion said Vogue wanted to feature 'women in all different walks of life' throughout 2017 - its 125th anniversary year - gushing: 'A woman is prime minister in Britain, which is our great ally, for the first time since Margaret Thatcher.'\nScroll down for video\nUS Vogue's editor-in-chief Anna Wintour, pictured in her office, has spoken about her decision to feature Theresa May in the magazine, saying the PM was a 'natural choice'\nIn a new interview with Business of Fashion, Wintour, 67, said: 'We know that our readers are interested in politics, we know they’re interested in women, we know they’re interested in the world, so of course, she was a natural fit for us.'\nShe also revealed there had been false rumours that the PM would star on the magazine's front cover, adding: 'That was never part of the discussion, and I don’t know where that came from. I was concerned that they might be disappointed.'\nLondon-born Wintour, who has headed up the US edition of the fashion bible for almost 30 years, also spoke about of how they are coping with seismic changes in the media and political landscape.\nUS Vogue, which has been in circulation since 1982, is facing huge challenges in an industry where audiences are quickly migrating from print to digital.\nMrs May (pictured leaving Downing Street this week) was featured in US Vogue earlier this year when she spoke about her marriage, home life, and relationship with President Trump\nWintour, who has headed up the US edition of the fashion bible for almost 30 years, also spoke about of how they are coping with seismic changes in the media and political landscape\n'The opportunities are thrilling, they’re daunting too at times, but they’re also thrilling,' Wintour admitted.\nAnna Wintour is featured in The Business of Fashion's America special edition\nThe legendary editor, pictured in her signature sunglasses on the cover of the bi-annual magazine's America issue, was quizzed on a number of topics including politics and President Trump.\nChoosing her words carefully - and hinting that she would consider featuring Melania on the cover one day - she said: 'I think we have to respect the Office of the President of the United States of America and I think we also need to respect different points of view.'\nShe also spoke of the magazine's bid to feature more diversity in its pages, saying: 'I think fashion, and I count us within that too, has been guilty of being too narrow minded, and thank god that’s changing. I think it’s wonderful.'\nShe was asked about Vogue's 'Diversity' issue in February - featuring a line-up of models of different shapes and sizes, including plus-size icon Ashley Graham - which led to accusations of editing.\n'It wasn't Photoshopped,' Wintour insisted, adding what she wasn't bothered by the social media storm.\n'If you worry about every little tiny criticism, you won’t get up in the morning. It just comes with the territory.'","url":"https://www.dailymail.co.uk/femail/article-4446646/Anna-Wintour-picking-Theresa-star-Vogue.html"}
