{"authors":["Tanya Ghahremani"],"date_download":"2018-10-30 23:55:08","date_modify":"2018-10-30 23:55:08","date_publish":"2014-08-12 21:20:14","description":"In weird celebrity couples I never thought I would be writing about news: Apparently, Anna Kendrick might be dating Alfie Allen. A.K.A., singer Lily Allen's younger brother and the subject of her 2006 single \"Alfie,\" which was literally about how he…","filename":"data/vaneerConsumption/AnnaKendrickAlfieAllenMightBeDatingItsSuchaWeirdThought.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/40396620-bbd4-4ccd-9fee-2c1cdc6ef01f.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35518-anna-kendrick-alfie-allen-might-be-dating-its-such-a-weird-thought_1540943708.html","title":"Anna Kendrick & Alfie Allen Might Be Dating & It's Such a Weird Thought","title_page":"Anna Kendrick & Alfie Allen Might Be Dating & It's Such a Weird Thought","title_rss":"NULL","source_domain":"bustle.com","text":"In weird celebrity couples I never thought I would be writing about news: Apparently, Anna Kendrick might be dating Alfie Allen. A.K.A., singer Lily Allen's younger brother and the subject of her 2006 single \"Alfie,\" which was literally about how he needs to stop smoking weed and get a job...turned the star of HBO's Game of Thrones. So, y'know. He got that job.\nAccording to reports, rumors of Kendrick and Allen's relationship began surfacing when the two were spotted together at sushi restaurant SushiSamba in Las Vegas. Apparently, the two requested \"a dark table\" together and shared drinks.\nAs weird as the thought of Kendrick dating Theon Greyjoy is, I can't help but wonder: Does this mean that Kendrick, who is a self-proclaimed Game of Thrones nerd, can finally guest star on the show as...I don't know, someone awesome? She can teach Daenerys the \"Cups\" song! Now that sounds like quality television.\nAnyway, it's worth noting at this point that the two being exclusive is not confirmed, so it's possible they were just hanging out as buddies and requested the dark table because they didn't want, well, exactly this happening. Or maybe it was a business meeting about an upcoming Game of Thrones role!\nI CAN DREAM, OK?\nImage: cillianhelps/Tumblr","url":"https://www.bustle.com/articles/35518-anna-kendrick-alfie-allen-might-be-dating-its-such-a-weird-thought"}
