{"authors":["Laura Rosenfeld"],"date_download":"2018-10-30 23:00:27","date_modify":"2018-10-30 23:00:27","date_publish":"2014-08-14 14:38:33","description":"The cheap bridesmaids dresses have been purchased. The wrestling-themed wedding shower has been thrown. The bologna family picnic has been enjoyed by all (except those watching at home). It's about time for another Here Comes Honey Boo Boo wedding,…","filename":"data/vaneerConsumption/AnnaChickadeeMichaelsHereComesHoneyBooBooWeddingWasSurprisinglyElegant.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/e24b81aa-f8d9-4f64-ac66-d64ef3e35929.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35718-anna-chickadee-michaels-here-comes-honey-boo-boo-wedding-was-surprisingly-elegant_1540940427.html","title":"Anna \"Chickadee\" & Michael's 'Here Comes Honey Boo Boo' Wedding Was Surprisingly Elegant","title_page":"Anna \"Chickadee\" & Michael's 'Here Comes Honey Boo Boo' Wedding Was Surprisingly Elegant","title_rss":"NULL","source_domain":"bustle.com","text":"The cheap bridesmaids dresses have been purchased. The wrestling-themed wedding shower has been thrown. The bologna family picnic has been enjoyed by all (except those watching at home). It's about time for another Here Comes Honey Boo Boo wedding, don't you think? In Thursday night's season finale, we finally get to see our little Anna \"Chickadee\" Shannon wed boyfriend Michael Caldwell. It's simply beautimous, isn't it?\nAfter the redneck-erific commitment ceremony that Mama June Shannon and Mike \"Sugar Bear\" Thompson had last year, complete with a barbecue-catered reception and hunting attire doubling as formal wear, I was hesitant to see the details of Anna and Michael's wedding at first. Michael did propose with the words \"Marry Me\" spelled out in pepperonis on a pizza, after all. Okay, scratch that. That was actually pretty awesome. The Here Comes Honey Boo Boo clan is also famous (or infamous, depending on how you look at it) for throwing some pretty outrageous parties that verge on... okay, that have completely gone down the tacky rabbit hole to the point of no return. Surely they would throw their most over-the-top bash yet for the oldest daughter's wedding.\nIt turns out that was not the case, my friends. Anna actually had quite the elegant affair for her wedding to Michael. Here's what we know about the nuptials that will be fully revealed on Thursday night's finale.\nAnna tied the knot in an outdoor wedding with about 80 guests on May 3. She wore a simple long, white wedding gown, which was a far, far cry from what her mother wore at her ceremony a year ago. Michael wore a tan three-piece suit with a turquoise tie that matched the wedding's color scheme. Anna's 2-year-old daughter Kaitlyn joined the couple as they walked down the aisle.\nOf course, Honey Boo Boo herself had to take center stage still. Alana Thompson was the flower girl at the wedding and instead of wearing a vibrant multi-colored dress as she did at her mom and dad's ceremony, she wore a subdued white eyelet dress with turquoise tulle peeking out from the bottom of the skirt. But didn't she know you're not supposed to wear white to a wedding?\nAll in all, the event was like something out of a rustic wedding Pinterest board, as People points out. The guests sat on bales of hay next to tree stumps lining the aisles and topped with turquoise-painted mason jars. It was so DIY, it made you want to just get out your glue gun and decoupage supplies stat.\nMama June's sister Joanne Shannon baked the all-important wedding cake, which had three tiers, each with a different white and turquoise pattern and flavor, chocolate, vanilla, or strawberry. If you recall, Joanne works at The Cake Box Bakery in Griffin, Georgia, where Mama June worked for a hot second earlier this season. By the looks of how pretty the cake ended up being, it doesn't look like Mama June had any hand in making it.\nOnce the wedding was all said and done, Anna and Michael moved four hours away from the family to Alabama. When she announced it to the Here Comes Honey Boo Boo kin during last Thursday's episode, everyone was emotional over the news. But it seems like she's now got a good thing going with Michael, who has fit right in with her family and as a father to Kaitlyn, Anna's child from a previous relationship.\nNow go, Chickadee. Spread your wings and fly away.","url":"https://www.bustle.com/articles/35718-anna-chickadee-michaels-here-comes-honey-boo-boo-wedding-was-surprisingly-elegant"}
