{"authors":[],"date_download":"2018-10-22 20:28:57","date_modify":"2018-10-22 20:28:57","date_publish":"2014-06-01 22:44:15","description":"Ann B. Davis, the beloved housekeeper on the Brady Bunch, died Sunday morning after suffering a hematoma.","filename":"data/vaneerConsumption/AnnBDavisHousekeeperAliceonTheBradyBunchDiesat88.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_22/480456/140601-ann-b-davis-1835_27ad6ce3c2415164d87d20b4a7a9c34d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/pop-culture_tv_ann-b-davis-housekeeper-alice-brady-bunch-dies-88-n119871_1540240137.html","title":"Ann B. Davis, Housekeeper Alice on 'The Brady Bunch,' Dies at 88","title_page":"Ann B. Davis, Housekeeper Alice on 'The Brady Bunch,' Dies at 88","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAnn B. Davis, who played the lovable housekeeper Alice on \"The Brady Bunch,\" died Sunday morning. She was 88.\nHer agent, Robert Malcolm, said that she fell in the bathroom and became comatose. She died at about 8:30 a.m. Sunday at a hospital in San Antonio, where she had lived with a minister friend and his wife.\nDavis hadn't worked in several years, Malcolm said, and she had been using a walker. He last spoke with her on her birthday, May 3.\n\"She was a really nice, a really lovely woman,\" Malcolm said.\nSlideshow: See Ann B. Davis' Career in Pictures\nDavis, who won two Emmys for her role as a quick-witted secretary on the 1950s sitcom “The Bob Cummings Show,” achieved her greatest success as the Brady family’s wise-cracking but devoted housekeeper Alice Nelson.\nIn her blue and white maid's uniform, Davis' character cleaned up all manner of messes, and and she was a source of stability for the family.\n\"I'm shocked and saddened! I've lost a wonderful friend and colleague,\" said Florence Henderson, who played Carol Brady, in a statement Sunday.\nDavis was born Ann Bradford Davis in 1926, in Schenectady, New York, and grew up in Erie, Pennsylvania.\nDavis appeared in several Brady reunion films and spin-off series, including the 1988 television reunion movie “A Very Brady Christmas.” The popular sitcom debuted in 1969 and aired for five seasons.\nAfter \"The Brady Bunch\" ended, Davis led a quiet religious life, affiliating herself with a group led by Frey. \"I was born again,\" she told The Associated Press in 1993. \"It happens to Episcopalians. Sometimes it doesn't hit you till you're 47 years old.\"\n—Tim Stelloh and Daniel Arkin, with the Associated Press","url":"https://www.nbcnews.com/pop-culture/tv/ann-b-davis-housekeeper-alice-brady-bunch-dies-88-n119871"}
