{"authors":[],"date_download":"2018-10-22 22:42:32","date_modify":"2018-10-22 22:42:32","date_publish":"2014-05-12 13:50:17","description":"After NBC News' Ann Curry broke her leg in a hiking accident, some Boy Scouts improvised a stretcher and got her to safety.","filename":"data/vaneerConsumption/AnnCurryThanksScoutsforRescueAfterHikingAccident.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_20/436161/140512-ann-curry-jsw-1022a_f6a32b3ca90b94bb053a203a3236bc54.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_ann-curry-thanks-scouts-rescue-after-hiking-accident-n103041_1540248152.html","title":"Ann Curry Thanks Scouts for Rescue After Hiking Accident","title_page":"Ann Curry Thanks Scouts for Rescue After Hiking Accident","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nWhen Ann Curry broke her leg hiking and couldn’t make her way down a steep, rocky trail, the Boy Scouts of Troop 368 were prepared.\nThe troop was hiking in Harriman State Park in New York in April when they encountered Curry, the globetrotting NBC News national and international correspondent, who was sitting on the trail with one leg out and was in pain.\n“She told us to keep going, but the guys refused,” the troop leader, Rick Jurgens, told Scouting magazine.\nThe troop fitted her leg with a splint, then improvised a stretcher using sticks and a tarp. One of the scouts even tested it out.\nCurry posted her thanks on Twitter:\nShe wrote in a thank-you letter to Troop 368, based in Berkeley Heights, N.J., that the leg was so severely broken it will take up to three months to heal.\n“I feel enormously lucky you came along at just the right moment, and were so willing to help a stranger in need,” she wrote.","url":"https://www.nbcnews.com/news/us-news/ann-curry-thanks-scouts-rescue-after-hiking-accident-n103041"}
