{"authors":["Ann Coulter"],"date_download":"2018-10-30 19:24:20","date_modify":"2018-10-30 19:24:20","date_publish":"2016-05-11 22:54:22","description":"Ann Coulter writes: \"Hillary knew what her husband was doing and yet, over and over again, she helped him cover it up and destroy the women.\"","filename":"data/vaneerConsumption/AnnCoulterEveryRapeVictimDeservestoBeHeardExceptbyHillaryClinton.json","image_url":"https://media.breitbart.com/media/2016/01/coulter-headshot-640x480.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2016_05_11__1540927460.html","title":"Ann Coulter: Every Rape Victim Deserves to Be Heard - Except by Hillary Clinton","title_page":"Ann Coulter: Every Rape Victim Deserves to Be Heard — Except by Hillary Clinton | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In a campaign built on lies, it should not be a surprise that the central theme of Hillary’s campaign is the biggest lie of all.\nSomeday, it will be the subject for a graduate thesis whether reporters who were in diapers when Bill Clinton was president simply don’t know the truth or, in their zeal to see Hillary elected, are obscuring the truth.\nThe media portray Bill Clinton as a lovable scamp, a good ol’ Southern boy who just liked to have sex in the back of his pickup. In fact, according to numerous independent accounts, he was a sexual abuser and, the overwhelming evidence shows, a violent rapist.\nWhile we would normally extend our sympathy to his wife, Hillary has forfeited those claims by actively conspiring with him to cover up his sexual assaults and smear the victims, showing absolutely no compunction about destroying women whose stories she knew to be true.\nBecause Donald Trump is reminding people about Hillary’s brutal rise to power, liberals denounce him for using the “sex scandals of the 1990s” against her. But recall that it was Hillary who used the “sex scandals of the 1990s” to launch her entire political career.\nA few weeks ago, Trump stirred up feminists by questioning whether Clinton is the most qualified woman who’s ever walked the planet, by saying, “Frankly, if Hillary Clinton were a man, I don’t think she’d get 5 percent of the vote.”\nOf course this is true. Trump wasn’t talking about Sen. Dianne Feinstein. He wasn’t talking about Sens. Claire McCaskill or Elizabeth Warren. Those women climbed the political ladder on their own. Can you even name any of their husbands?\nBy contrast, Hillary got her positions by virtue of being married to the president, who cheated on her. She played the victim, and suddenly the rest of the world owed her.\nBeing married to the president did not make for an auspicious beginning to Hillary’s career in politics. She was a grumpy, unpopular first lady, was given control of a health care task force, did a terrible job, and was going absolutely nowhere, when her husband — the president — got caught fooling around with a White House intern, and then committed felony obstruction of justice to cover it up.\nHillary parlayed being the wronged wife into a Senate seat from New York, which was basically an appointed position (she ran against a little-known Republican congressman in a state where Democrats outnumber Republicans 2-to-1); and secretary of state, an actual appointed position.\nThis isn’t about private affairs, the internal dynamic of the Clintons’ marriage or a wronged wife. No one cares about the Clintons’ marriage, least of all the Clintons. In addition to being vastly too byzantine to unravel, Bill’s philandering might affect what we think of him as a husband and father, but it doesn’t reflect one iota on Hillary Clinton.\nBut to say Hillary is an innocent victim would be incorrect. The overwhelming evidence is that her husband committed repeated predatory sexual acts, in some cases violently, Hillary knew that, and she helped him by muddying up his accusers.\nThe media worked hand-in-glove with the Clintons’ enablers, Betsy Wright and (future objective journalist) George Stephanopoulos, to conceal Bill’s “bimbo eruptions” — as the campaign called them — as long as they could. But when Paula Jones sued President Clinton for sexual harassment under the Civil Rights Act of 1964, his treatment of other women became relevant evidence in her case.\nThat’s when the floodgates opened.\nJones alleged that, when she was an employee of the state of Arkansas, Governor Clinton had state troopers bring her to his hotel room, where he proceeded to drop his pants and tell her to “kiss it” — then warned her that he knew her boss.\nEither voluntarily or by legal compulsion, a slew of women attested to sexual encounters with Bill Clinton — Juanita Broaddrick, Kathleen Willey, Gennifer Flowers, Dolly Kyle Browning, Elizabeth Ward Gracen, Sally Perdue, Monica Lewinsky, and several dozen cocktail waitresses along the interstate corridor between Little Rock and Washington. Many more told their stories, but said they were afraid to use their names.\nHighly credible women who don’t know one another have given convincing accounts of Clinton’s unwanted sexual attentions, from groping, to flashing to violent rape. Juanita Broaddrick’s rape allegation convinced NBC News. It also convinced congressmen, who read her testimony, that they should reverse their positions and vote to impeach Clinton.\nHillary knew what her husband was doing and yet, over and over again, she helped him cover it up and destroy the women, portraying them as stalkers, blackmailers and loons. As one of Bill’s mistresses, former Miss Arkansas Sally Perdue, told the Daily Mail (U.K.), Hillary has a “vengeful, spiteful ugliness … And she’s championing women’s causes?”\nThis patron saint of victims made it her business to inflict more harm on Bill’s marks, specific examples of which will be covered in a future column.\nUntil then, know that when journalists talk about Bill Clinton’s “sexual peccadilloes” and refer to Hillary as a “victim,” that’s not remotely what it was. He was a sexual predator and she was his willing co-conspirator.\nCOPYRIGHT 2016 ANN COULTER\nDISTRIBUTED BY UNIVERSAL UCLICK","url":"https://www.breitbart.com/the-media/2016/05/11/ann-coulter-every-rape-victim-deserves-heard-except-hillary-clinton/"}
