{"authors":["John Binder"],"date_download":"2018-10-30 20:57:54","date_modify":"2018-10-30 20:57:54","date_publish":"2018-08-30 00:07:26","description":"New York Times best-selling author Ann Coulter says she just wants President Trump to \"destroy the media.\"","filename":"data/vaneerConsumption/AnnCoulterIWantTrumptoDestroytheMediaifNothingElse.json","image_url":"https://media.breitbart.com/media/2018/06/ann-coulter-flickr-13.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2018_08_29__1540933074.html","title":"Ann Coulter: I Want Trump to 'Destroy the Media' if Nothing Else","title_page":"Exclusive - Ann Coulter: I Want Trump to 'Destroy the Media' if Nothing Else","title_rss":"NULL","source_domain":"breitbart.com","text":"New York Times best-selling author and populist conservative columnist Ann Coulter says she just wants President Trump to “destroy the media” – even if nothing else is accomplished by his administration.\nIn an exclusive interview on SiriusXM Patriot’s Breitbart News Sunday, Coulter told Breitbart News’s Deputy Political Editor Amanda House that she wants Trump to continue to “destroy” the establishment media, specifically exposing its distaste that the president tweeted about the killing of white farmers occurring in South Africa.\nCoulter said:\nThe more I look at some of the things that Trump is doing, okay maybe he’s never going to act like a president… But I just want him there to destroy things. I want him to destroy the swamp. I want him to destroy the media. And I … want him to expose where the Democratic Party is going with [things like] their chant ‘No borders, no wall, no USA at all,’ [with] Governor Cuomo saying America was never great, [with] New York Times hiring Sarah Jeong who just tweets hatred and venom towards white men. And now with the South Africa tweet, the media is angry because they want the genocide of white farmers to go through. It’s stunning how Trump really brings out the best of them. And this constant exposure, this constant taunting of them. As much as I wish someone would tap Trump on the shoulder every morning and remind him ‘You’re president. You’re not limited to tweeting. You have lots of powers at your disposal. How about you do some of the stuff you ran on.’ As much as it annoys me that he doesn’t seem to realize he is president, the destruction he is wreaking, maybe we need to destroy before we can rebuild. [Emphasis added]\nListen to Coulter’s full interview here:\nLast week, Trump posted online that he had instructed Secretary of State Mike Pompeo to monitor the situation in South Africa where the government is proposing a new land reform policy of “expropriation without compensation,” and farm murders reportedly take place at a disproportionate rate.\nIn a statement following Trump’s tweet, the radical South African politician Julius Malema said the country is looking to take land from white farmers, Breitbart News reported.\nCoulter has previously said that if Trump does not build a wall along the U.S.-Mexico border and temporarily halt immigration to the country — where more than 1.5 million foreign nationals are admitted every year — the U.S. will become South Africa “in one generation.”\n“This is it. This is it. In one generation this country is going to be South Africa,” Coulter said. “We had this one chance to save it and we were betrayed.”\nCoulter’s latest book, Resistance is Futile! How the Trump-Hating Left Lost Its Collective Mind, out now on Amazon, dives into the problems with our establishment media and political left’s lies that are repeatedly told about the Trump White House.\nBreitbart News Sunday is broadcast live on SiriusXM Patriot Channel 125 from 7:00 p.m. to 10 p.m. eastern.\nJohn Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.","url":"https://www.breitbart.com/the-media/2018/08/29/exclusive-ann-coulter-i-want-trump-to-destroy-the-media-if-nothing-else/"}
