{"authors":["Maya Rodale"],"date_download":"2018-10-30 22:33:43","date_modify":"2018-10-30 22:33:43","date_publish":"2014-08-15 11:30:03","description":"It takes a special romance to make a million girls fall in love with a man named Gilbert. But Lucy Maude Montgomery accomplishes it with the love story between Anne Shirley and Gilbert Blythe in the Anne of Green Gables series. She's one of…","filename":"data/vaneerConsumption/AnneofGreenGablesTaughtMeEverythingINeedtoKnowAboutRelationships.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/0a2a45a0-9b42-4397-bca8-cacd2f71b3dc.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_32383-anne-of-green-gables-taught-me-everything-i-need-to-know-about-relationships_1540938823.html","title":"'Anne of Green Gables' Taught Me Everything I Need to Know About Relationships","title_page":"'Anne of Green Gables' Taught Me Everything I Need to Know About Relationships","title_rss":"NULL","source_domain":"bustle.com","text":"It takes a special romance to make a million girls fall in love with a man named Gilbert. But Lucy Maude Montgomery accomplishes it with the love story between Anne Shirley and Gilbert Blythe in the Anne of Green Gables series. She's one of childhood literature's most beloved female characters. He's one of the most dreamy heroes in literature. Their romance taught me everything I needed to know about relationships.\nEver since the skinny, red-headed orphan debuted in 1908, she has won the hearts of everyone she encounters, from the inhabitants of Avonlea and the dreamy Gilbert, to readers all around the world. With her wild imagination, quick temper, obsession with puffed sleeves, and kindness to everyone, she's every girl's fictional best friend. No one loves Anne more than Gilbert. This handsome, smart, mischievous boy fancied her from the moment she slammed her slate on his head. He stayed true to her as he grew into the perfect hero and patiently waited for her to realize it. Anne and Gilbert's romance is plagued with a terrible first impression, grudges held for years, a fierce rivalry, friendship, competing suitors, long separations, rejected proposals and near-death experiences. It is also quite possibly one of the Greatest Love Stories Of All Time. *fans self*\nFrom calling her \"Carrots\" to their happily-ever-after, here are some essential love lessons from Anne and Gilbert's epic romance:\n1. Don't take shit from boys\nDid the cute boy call you names? Tease you on the playground? Tug your braids and call you \"Carrots\"? When Gilbert does just that, Anne's response is swift and sure: cursing him out and slamming her slate on his head. It's awesome. It's also the beginning of a beautiful romance.\n2. Do not speak of Boys Who Don't Deserve it\nHe might be the cutest boy in school, popular and universally adored, but he is also the original He Who Shall Not Be Named after the Carrots/Slate incident. Whenever “Gil—” comes up in conversation, Anne is careful not to mention him by name, but instead refer to “a boy.” She focuses on her own life and friendships rather than grumble and complain about that awful Gilbert Blythe.\n3. Feel ALL the feelings and feel them intensely\nAnne doesn't just get sad she sinks into the“depths of despair.” Gilbert hurts her feelings “excrutiatingly” (italics Anne's). She frequently uses the word tragical. She also feels total joy at Octobers, new days with no mistakes, and a dress with puffed sleeves. (Fashion FTW.) There's always a temptation to be cool and not get too excited about boys, or dates, or other life stuff with the rationale that if we don't revel in the highs, the inevitable lows won't hurt. Take a page from Anne's book and feel EVERYTHING.\n4. Find someone who challenges you\nAnne and Gilbert's rivalry is legendary in Avonlea, especially when it comes to academics. Too often we can feel pressure to dumb ourselves down for guys just to stroke their ego, but Anne will have none of that. At first she goes all out just to best Gilbert, who is just as competitive with her. But eventually it becomes about “the proud consciousness of a well-won victory over a worthy foeman” and the rivalry between them makes them both better.\n5. It's OK to sometimes let Yourself Be Rescued\nI know, it goes against the grain of the modern woman. But if you are on a sinking boat on Barry's Pond/The Lake of Shining Waters and your nemesis comes along to give you a hand . . . take it. Gilbert proves himself a gentleman here when he offers to help Anne even though she's had nothing but scorn for him. Anne accepts his help but sticks to her guns . . . but it's the beginning of the end of her grudge against him.\n6. Ignoring someone is the fastest way to his heart\nNeither tugging her braids, calling her \"Carrots,' nor rescuing her from a possible drowning got Gilbert into Anne's good graces. When she makes it clear they can never ever be friends, he tries a different approach: totally ignoring her, and it totally works. “Anne found it was not pleasant to to be ignored . . . deep down in her wayward, feminine little heart she knew that she did care.”\n7. Sometimes you have to apologize\nAnne's reluctant apology to the busybody Mrs. Lynde is hysterical for its over-the-top declarations: “I could never express all my sorrow, no, not if I used up a whole dictionary.” But it's her long overdue apology to Gilbert that's the sweetest: “What a stubborn little goose I was,” she says, finally opening the door for their friendship and eventual romance.\n8. Forget about your ideal suitor\nAnne and Diana have firm ideas about their ideal suitor, who must be “tall and distinguished looking, with melancholy, inscrutable eyes and a melting, sympathetic voice.” By this definition, Gilbert Blythe is not her ideal suitor even though he's her soulmate. When trying to not to settle, make sure you don't overlook what's really important: “I don't want sunbursts or marble halls,”Anne eventually says to Gilbert. “I just want you.” Even if he doesn't have melancholy, inscrutable eyes.\n9. Falling in love isn't always how you imagine it . . . but it's still glorious\nSometimes we have ideas about love at first sight, expectations of lightening bolts and fireworks when we meet The One, and we want the “pomp and blare” of romance. But sometimes it take years to realize that “perhaps ... love unfolded naturally out of a beautiful friendship,” and it turns out your soulmate was right there all along.\nImages: Tumblr (11)","url":"https://www.bustle.com/articles/32383-anne-of-green-gables-taught-me-everything-i-need-to-know-about-relationships"}
