{"authors":[],"date_download":"2018-10-21 03:05:40","date_modify":"2018-10-21 03:05:40","date_publish":"2018-06-20 20:10:58","description":"Residential properties sold recently in Howard and Anne Arundel counties.","filename":"data/vaneerConsumption/AnneArundelCountyandHowardCountyhomesales.json","image_url":"https://www.washingtonpost.com/resizer/2CjPNwqvXHPS_2RpuRTKY-p3eVo=/1484x0/www.washingtonpost.com/pb/resources/img/twp-social-share.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/local_anne-arundel-county-a_b0947ddf6f57c83393b57f45ce161de4_416ed466-6b29-11e8-bf8c-f9ed2e672adf_story_1540091140.html","title":"Anne Arundel County and Howard County home sales","title_page":"Anne Arundel County and Howard County home sales - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Anne Arundel County\nThese sales data recorded by the Maryland Department of Assessments and Taxation were provided by Black Knight Inc. For information about other residential real estate transactions, visit washingtonpost.com/homesales.\nANNAPOLIS AREA\nBoxwood Rd., 43-Nils M. Reuter to Macklin C. and Zolia Cano, $250,000.\nChatham Lane, 231-Bank of New York Mellon and Bank of New York to David Reid, $260,000.\nChesapeake Harbour Dr., 2192-Arnold and Sarah Anne Vestal to Alex M. Chehansky and Grace C. Sterritt, $870,000.\nForest Hills Ave., 933-Leslie and Justin Sean Brady to Heather A. McCgair, $279,900.\nHolly Dr., 422-Daniel W. and Melissa Pohl to Edward James and Jessica A. Littleton, $415,000.\nLake Heron Dr., 1115, No. 1B-David F. and Toni Lynn Cofer to Lynn Powers, $235,000.\nNarragansett Ave., 3402-Helen Darlene Pisani to James P. Yoke, $710,000.\nPresident St., 1127-RB Realty Corp. to Patrick C. and Felice A. Willis, $162,500.\nRockway Ave., 3427-Brenda J. Davis and Frances J. Taylor to James E. Hendrson, $187,500.\nSevern Ave., 111-Sally P. Cohen to Suzanne G. and Allen M. Tubis, $730,000.\nSilverwood Cir., 24, No. 10-Aliceteen M. Mangum to Douglas R. and Sandra L. Soucy, $125,000.\nVan Buren St., 1106-Linda Bloom Ambrose to Susan K. Donaldson, $310,000.\nWoods Dr., 195-Steve D. Austin to Hugo Daniel Lemus, $275,000.\nANNAPOLIS-BROAD CREEK AREA\nBoom Ct., 1009-Edward D. and Beverly E. Eanes to Ronald D. and Barbara A. Wells, $400,000.\nCarriage Hill Pkwy., 1052-Mark R. and Tracy S. Pimpo to Benjamin Norman and Analise Devoe Shea, $620,000.\nCourse Dr. W., 2541-Gilbert P. Gozalez to Charles Donald Mullkin, $450,000.\nFairfax Rd., 1947-Inga H. Mendale and Elizabeth Huckenpoehler to Christopher Galbraith, $385,000.\nKimberwicke Pl., 1843-John K. Crouse to Rory M. and Amanda B. Quiller, $565,000.\nLeftwich Lane, 549-Brookfield Admiral Square Corp. to Leslie Ann Tomaselli, $385,180.\nLeftwich Lane, 565-Brookfield Admirals Squares to Cahrlyn Cassady and Randall Avers, $398,960.\nMonticello Ave., 98-Harold and Mary A. Quayle to Croom Lawrence, $644,000.\nPerry Landing Ct., 900-Frederick R. Franke Jr. and Alvey and Elfreide Boyle Alvey to Barbara J. Morris, $399,900.\nSamuel Chase Way, 530-Kosal and Mary Grace Pang to Kevin D. Caldwell and Jessica A. Howard, $385,000.\nSimms Dr., 111-Stephen J. Heise to Douglas Nutter and Lisa Grube, $349,000.\nTudo Ct., 2518-William C. Lambors to Judith A. Wiest, $280,000.\nWoodlawn Ave., 120-Thomas and John R. Rayhart to Sarah E. Evans, $430,000.\nARNOLD AREA\nBlakiston Ct., 1009-Shannan L. Newcomb and Michael Zeller to Kurtis Bradley and Andraya Walther, $477,000.\nComanche Rd., 1569-Richard S. and Alyssa Czyzewski to Nicole and Patrick James Donegan, $749,000.\nGrindstone Dr., 306-Agnes E. McEneaney to Phillip A. and Deanna L. White, $645,600.\nMatch Point Dr., 758-Leslie Watson to Anthony M. Barnett and Brittnay L. Kemmer, $226,000.\nRaintree Dr., 288-Judy M. and Johan F. Wardell to Kelsey A. and Jasson G. Miller, $460,000.\nTalon Ct., 612-Nicole D. and Megan D. Beddia to Sabina M. and Donald R. Lilley, $345,000.\nBROOKLYN AREA\nArundel Rd. W., 210-Mehboob T. Chhagan to Barbara A. Zermo, $220,000.\nCherry Bark Lane, 768-Steven M. Goirrick Jr. to Matilda and Arthur Decker, $270,000.\nEdgevale Rd. W., 234-313 Washington Ave. Corp. to Dione N. Johnson, $135,000.\nRedmond St., 5812-Lenora C. Ferrin to Jonathan and Jocelyn Miden, $209,500.\nCAPE ST. CLAIRE-SANDY POINT STATE PARK AREA\nBroadneck Pl., 1505, No. 2-203-Karen B. Madsen and Karen M. Callaghan to Ronald J. Wagner, $290,000.\nDeep Creek View, 516-Shawn Eaton to Kyle M. and Ashleigh Franks, $450,000.\nLake Claire Dr., 1048-Paul Keller to Dennis R. and Kristin Myers, $416,500.\nRevell Downs Dr., 1620-Leslie S. Caffey to Russell Philip and Alenice Monteiro Carlton, $250,000.\nSnow Goose Lane, 606-Karen L. and Karen I. Geiser to Diane Y. Temple Mcready, $415,000.\nWinchester Rd., 1515-Christine Braathen to Stephen S. Johnson and Christina S. Han, $812,500.\nCHURCHTON AREA\nExeter St., 5527-Charles A. Garland and Merinda S. Grill to Emily Christine Rasp, $297,500.\nCROFTON AREA\nAmbling Cir., 2568-Stuart D. Cotterill and Rose Taylor to Jose J. Sanchez Jienez and Betty M. Farjardo Sanchez, $280,000.\nChainbridge Ct., 2108-Carolina Y. Estill to Richard M. and Heather Carman, $545,000.\nGaffney Ct., 1720-David C. Mahan to David D. Winder, $279,500.\nKnights Bridge Turn, 1424-Richard J. Trauo and Beth S. Schlein to Pricila H. and Mairan M. Teodoro, $430,000.\nQueens Ct. E., 1862-Paul A. and Donna R. Filosa to Heather Brown and Joseph Heverly, $457,980.\nSharwood Pl., 1857-Ingrid M. Savingnac to Theda Y. Rose, $274,900.\nThornbury Ct., 1433-David E. and Sharon G. Moul to Hirenkumar T. Jethva, $390,000.\nCROWNSVILLE AREA\nAlgonquin Rd., 1244-Davenport and Nell B. West to David N. and Julia F. Lauver, $785,000.\nEddy Rd., 729-Harry H. and Janice Ann Crowe to Jacob Lars and Danielle S. Livoni, $295,000.\nKyle Rd., 452-Bank of America to James M. and Sharon G. Doulgas, $179,000.\nSevernview Dr., 1175-Jeffrey A. and Laura R. Ferguson to Amy Hasenei and Eric Eisenbeiser, $380,000.\nCURTIS BAY AREA\nCox Cove Ct., 1346-Michele L. Moore to Matthew S. Bates, $250,000.\nLighthouse Ct., 1509-Steven R. Rigg to Jocelyn M. Cox, $259,000.\nWaterway Ct., 1359-James P. Murgne to George C. and Lisa Karin McDowell, $326,000.\nDAVIDSONVILLE AREA\nMaiden Creek Ct., 2907-Glenn J. and Donna M. Randall to John E. and Bernice L. Sanders, $990,000.\nDUNKIRK AREA\nGreenridge Dr., 340-John H. McNish and Pamela A. Butler to Scott A. and Kourtney E. Walker, $425,000.\nEDGEWATER AREA\nCambridge Rd., 1603-A&T Builders Inc. to Tiffany A. Navas and Brett D. Baseley, $390,000.\nChesapeake Dr., 1705-Jason M. Snyder to Virginia Marie Atkinson, $299,900.\nEvelyn Gingell Ave., 3609-Michael Stephen and Rebecca Oliver to Jonathan R. Albers and Elizabeth R. Chisolm, $325,000.\nHighland Dr., 517-Dennis Richard and Bandy Pruitt Taylor to Dixie L. Roberts, $240,000.\nLoch Haven Dr., 3550-David and Katrina Coker to Michele N. Montesano, $419,900.\nOverhill Dr., 530-Eugene D. and Patricia D. Juba to Michael A. and Amanda E. Reilly, $1.18 million.\nSolomons Island Rd., 2657-Barry Ferguson Saunders and Alexander Dee Esposito to Erica Hall Houser, $360,000.\nTwo Rivers Dr., 92-Jeannie M. and Michael R. Tesh to Robin A. and Christopher J. Gergamini, $390,000.\n10th Ave., 3611-Stephen R. and Joni I. Carmen to Tracy L. Hall, $409,500.\nGAMBRILLS AREA\nJacob Way, 2226-NVR Inc. to Lamont E. and Kristie L. Blakely, $813,575.\nSymphony Lane, 2465-Kevin and Suzanne Davis to Marcus and Gwendolyn Johnson, $550,000.\nWinfields Lane, 1529-Millard Copley Jr. and Svetalna Pavlosvskaya to Oladiji O. and Umoke Omisore, $635,000.\nGLEN BURNIE AREA\nGatewood Ct., 423-Jennifer A. Johnson and Kenneth Lee Wayne Johnson Jr. to Jesse and Leah Joseph, $170,000.\nHyde Park Dr., 754-Art Homes Corp. to Chad E. and Michelle P. Morral, $309,000.\nLincoln Ave., 104-James Robert Walker and Carol Anne Walker to Mengshi Wu, $214,900.\nMilton Ave., 505-Wills Real Estate Investment Corp. to Neil Anthony Kavades, $275,000.\nPhirne Rd. W., 393-Karen F. Kruemmel and Karen F. McLaughlin to Maria Martinez De Cid, $270,000.\nWimmer Rd., 522-Brady and Brooks Huttinger to Carly Hynson, $232,000.\nFifth Ave. SE, 415-Christopher Austin to Darian Darrel George, $197,500.\nGLEN BURNIE-MARLEY CREEK AREA\nBlue Water Ct., 304, No. 201-Robert F. Bailey and Patricia A. Bailey to Isabella M. Rowlett, $152,550.\nChester Cir., 8-Derrick A. Hammel to Louis and Sallynn H. Schmitz, $195,000.\nDorchester Rd., 133-Shawn Honcock to Jocob S. Miller, $268,500.\nGlenside Way, 813-Raymond P. Hodge and Michelle Antoinette Vigil Hodge to David Kiser and Devon Snedden, $345,000.\nHeritage Crossing, 6947-Jonathan James Taylor and Kimberly Anne Louise Taylor to Andrew E. and Moranima Landestoy, $440,000.\nIngrahm Dr., 7016-Suzanne Redding to Tawanna L. Williams, $300,000.\nMargate Dr., 203-Robynn D. Squires to Orville Bradford, $329,888.\nPalm Tree Cir., 904-RMG Investments Inc. to Bernadette C. and James K. Vesper, $305,000.\nWren Way, 2707-Geoffrey I. and Ashley M. Ward to Nestor S. Melgar, $242,900.\nHANOVER AREA\nAmber Crest Rd., 2714-Fernando Sepulveda and Sandra M. Cadavid to Jin Hyuk Park, $375,000.\nFieldstone Ct., 1717-Stoney R. Corp. to Scott Anthony Horras, $365,000.\nKidwell Ct., 7704-Thomas J. Laughlin to Agata E. Toplewska, $210,000.\nPritchards Lane, 1505-Josh W. McCallister and G. Michael Dufour to Andrew P. Francis and Monika F. Orthner, $545,000.\nTerraview Ct., 7728-Robert Watson Fason to Dante M. Monakil, $415,000.\nJESSUP AREA\nDowning Lane, 2708-Calatlantic Group Inc. to Melissa R. Murphy, $331,142.\nLAUREL AREA\nCrooked Tree Lane, 8536-Betty Kelly Jackson to Xiomara Olmeda, $380,000.\nFloating Leaf Lane, 3553, No. D104-John Garland and Michael Tidwell to Ryan Langley, $222,000.\nLyndhurst St., 8322-John Daniel and Katelyn Elizabeth Jackman to Samuel David Hunter, $365,000.\nShannons Aly., 8101-Option 1 Properties Corp. to Chandra Brown, $375,000.\nLINTHICUM HEIGHTS AREA\nCheddington Rd., 324-Susan Masciarelli and Bernard H. Sensibaugh to Matthew David and Carly Elizabeth Schreiner, $215,000.\nFairmount Rd., 539-Thomas A. and Georgia Lupica to John Charles and Melissa Suzanne Riddle, $400,000.\nLynvue Rd., 921-Mary Teresa Power and William R. Nicholson to Megan Elaine and Kenneth M. Bruce, $244,900.\nWooddale Rd., 700-John Stegemerten Sr. to Thomas R. Dignan, $280,000.\nMILLERSVILLE AREA\nAnna Lane, 809-Tracy and Devin Kenney to Lee S. and Patricia A. Ferrell, $399,000.\nCaracle Ct., 629-Francine L. and William J. Cairns to Jerry K. and Janice M. Shirlen, $395,000.\nTanager Dr., 1170-Doman O. and Kathleen K. Mearthur to Michael J. and Kathryn L. Hickey, $550,000.\nNORTH BEACH AREA\nBirch Ave., 812-Holfand Point Enterprises Corp. to Matthew W. and Jessica B. Pruett, $439,000.\nODENTON AREA\nBluffs Island Ct., 1709-John T. Myers to Joseph S. Schwab, $284,900.\nChessington Dr., 318, No. 9-Thomas Sand to Kevin Y. Zhang, $314,000.\nCommissary Cir., 2262-Joanne Cho to Brandon J. and Janee Davids, $302,000.\nDragon Fly Way, 2699-Classic Group Corp. to Charles Ernest Block Jr., $584,222.\nFluttering Leaf Trail, 8612, No. 401-Myunghee and Nicholas C. Willis to William R. and Kathleen J. Witterschein, $228,750.\nGatehouse Lane, 304I, No. 304I-Bina Jackson to Lillian Rollins, $165,000.\nKirbys Landing Ct., 207-Lisette Monique Taylor and Milton S. Taylor to Ramez W. Habib and Christine Ibrahim, $260,000.\nLions Gate Lane, 650-Bridget J. Pickett to Ashley Sinclair, $253,000.\nRainy Spring Ct., 2676-Russell A. and Carolyn Roder to Jennifer M. Ayala Cortez and Rosa D. Ayala, $277,000.\nSt. Michaels Cir., 262-Terre K. and Ivelin Stefanova to Joshua R. and Enola J. Biranbaum, $309,900.\nThornbrook Ct., 2724-David P. and Lisa J. Ash to Dominic Dorian Zottoli, $329,500.\nOWENSVILLE (WEST RIVER) AREA\nAllen Ave., 1036-Darrin M. Sita to Eric S. Medlin and Olivia L. Lohmeyer, $333,000.\nPASADENA-ROCK CREEK AREA\nBeach Ave., 304-FPS Property Corp. to Dean Allen, $326,500.\nCarroll Rd., 126-Joanne M. and Denis P. Dement to Avery Gable, $260,000.\nCentral Ave., 7757-Jackqueline S. Hobbs and Susan I. Lobaugh to Michael A. Markey, $219,000.\nCokesbury Ct., 3512-Dante and Adwoa Winder to William R. Metzer, $377,000.\nDruid Hill Ave., 915-Residential Value Corp. to Jack Sunshing and Jillian R. Walters, $365,000.\nLong Point Rd., 1523-Dominick J. and Shannon S. Milazzo to David E. Ark and Dennis Paul Stern, $365,000.\nMayford Ave., 7832-Hogar Community Reinvestment Corp. to Kristin West and Garrett Goralski, $262,500.\nMilburn Cir., 46-Scott and Dana Simms to Cynthia Ahn Hannon, $410,000.\nPepperbox Lane, 7900-Zachary J. Moore to Jessica M. Warf, $310,000.\nRose Crown Cir., 2946-James Robert Brinn and Josephine Prinn to Charles Richter Jr., $245,000.\nSahalee Ct., 8936-HSBC Bank to Elizabeth Jacob, $705,000.\nSilver Cir., 4-Robert P. Death and Mary F. Death to Taylor and Michelle Morin, $249,900.\nWard Rd., 4006-Francis W. Giles VI and Megan L. Giles to Austin V. Meirick and Allison M. Caines, $370,000.\n207th St., 802-Art Homes Corp. to Derick W. Samuelson and Ciara N. Booth, $309,000.\nRIVA AREA\nBreckenridge Way, 3222-Christopher J. and Robin A. Bergamini to Moise Devillier Jr., $700,000.\nSEVERN AREA\nAndorick Dr., 7945-James Joseph McIntyre III to Matthew and Keyyseha Lee Barber, $419,900.\nCanyon Oak Dr., 8312-Toll MD Vill Partnership to Patrick G. and Cherie M. Brown, $683,593.\nColdwater Reserve Crossing, 1540-Jeffrey and Jennifer Wall to David W. and Sharmaine L. Hornsby, $625,500.\nDurness Ct., 8210-Department of Housing and Urban Development to Lich Tran, $67,500.\nGolden Pine Cir., 7837-Richard and Ellen L. Jones to Jonathan E. Munnik, $400,000.\nHollow Ct., 8122-Dan Ryan Builders Mid Atlantic Corp. to Todd and Kristen Heller, $311,439.\nLasalle Pl., 1784-Reuben D. and Rodine Goldsberry to Carmen V. Garcia and Harold Benton Bob, $422,900.\nNorth Ave., 7884-Diana M. Brooke to Frederick J. Flanagan, $260,000.\nSunhaven Way, 7876-U.S. Home Corp. and Lennar Corp. to Saramma and Bobby J. Abraham, $570,000.\nSEVERNA PARK AREA\nBoone Trail, 58-Ruth T. Anderson to Michael B. and Melissa A. McGurk, $725,000.\nCedar Rd., 47-Dorothy G. Johnson to Bryan Shayne and Melissa Kathleen Koslosky, $540,000.\nCypress Rd., 606-Jeffrey C. and Regina L. Biuk to Cjhristopher M. and Sarah Mildred Bochenek, $525,000.\nGiddings Ave., 110-Sedgley M. Claire to Michelle Passmore, $410,000.\nHucknall Ct., 415-Cartus Corp. to Justin and Lindsay Massar Short, $469,900.\nLakeview Cir., 522-Scott Swahl and Nancy Fratus to John C. Moore, $755,000.\nOak Landing Ct., 276-Robert W. and Elaine C. Cook to Michael Robert and Megan S. Achatz, $1.39 million.\nSt. Andrews Rd., 28-Bank of New York Mellon and Bank of New York to Jefferey and Dena Terra, $499,000.\nWeybridge Cir., 701-Betty Jean and Richard Hood Harryman to Brendan N. and Kathryn Putke, $422,000.\nSHADY SIDE AREA\nCedar Ave., 1705-1705 Cedar Avenue Corp. to Brandi Cheyenne, Steven Michael and Jenna Marie Wiley, $407,000.\nHoward County\nThese sales data recorded by the Maryland Department of Assessments and Taxation were provided by Black Knight Inc. For information about other residential real estate transactions, visit washingtonpost.com/homesales.\nCENTENNIAL-BENSON AREA\nBuckskin Lake Dr., 4200-Gregory and Carol Brown to Shivakumar Naravanan and Sanjivani Kolge, $775,000.\nEvergreen Way, 3110-James R. Ronney and John L. Rooney and Audrey M. Roone to Asha Kumar Marakath, $417,500.\nGolf Island Rd., 2609-Thomas L. and Lori A. Wilson to Michelle Trabosh, $850,400.\nLindera Ct., 5044-NVR Inc. to Mendus and Detty Chelapurath, $1.53 million.\nOld Ellicott Cir., 10551, No. 74-Irving N. Mehu to Simon W. Seo, $469,000.\nPebble Beach Dr., 3022-John A.D. Amato and Barbara F.D. Amato to David L. and Darcy K. McKenzie, $577,500.\nSplendid View, 9614-David A. and Theresa G. Fitton to Anthony G. and Andrea Veronica Hastings, $500,000.\nView Top Rd., 3896-Dennis F. and Nancy L. Kritzmacher to Mark and Julie Recene, $575,000.\nCLARKSVILLE AREA\nJamesway Ct., 5421-Elizabeth Alice Coastes and Elizabeth A. Becraft to Scott, Liesi A. and Liesi A. Freinberg, $795,000.\nRiver Hill Overlook Dr., 6304-Young and Terry Choi to Sundararajah Nathikudi and Rekharani Mudumbi, $985,000.\nWestern Sea Run, 5745-Michelle Rose Taylor to Sangjae Lee and Jion Park, $628,000.\nWolverton Ct., 7200-Alan Brian and Carol Carey to Khawaja Omair Husain and Mehreen Zaman Khan, $935,000.\nCOLUMBIA (EAST) AREA\nCarved Stone, 7217-Kaneene Livingston and Kaneene M. Armstead to Kennisha Firstley, $302,000.\nDelphinium Ct., 5465-Thomas J. and Barbara R. Mongello to Trevor D. and Rachel M. Swan, $429,900.\nFlicker Pl., 9005-Steven Bryant and Mary Brown to Eric D. Teyes and Erminia L. Colata, $325,000.\nGoose Landing Cir., 8827-Fei Xie and Fei Wen to Jiaqi Gong and Lina Zhao, $347,000.\nHoneycomb Gate, 6114-Evangeline H. Hawthorne to Asha Kiran Karri, $340,000.\nLark Brown Rd., 8408-Lark Brown Holdings Corp. to Nestor R. and Leticia O. Benavides, $457,000.\nMorning Calm Way, 6115-Dale L. and Jody T. Franklin to Christine L. Borges and George Lawson Hauprfunhere, $565,000.\nPushcart Way, 9822-Sergio A. Ramos and Maghann M. Casey to Tamieca A. McCloud and Tania Lee Tavares, $475,000.\nShining Oceans Way, 8905, No. 9-Sharon Vollmerhausen to Gordon and Sharon Fuller, $467,000.\nThunder Hill Rd., 5860, No. B4-Matthew Charles Lyon and Huang Ching Man Lyon to Kyrylo Kravchenko, $103,000.\nWhite Peach Pl., 6418-Burton J. and Joan W. Alexander to Gustavo Adolfa Gaviria Galvez and Lyda Eugenia Holguin Palacios, $427,000.\nCOLUMBIA (WEST) AREA\nAshton Park Ct., 6208-William and Alison Wagner to Michael F. and Kathleen O. Wittlif, $521,000.\nBright Passage, 11765-Denise Svenson to Joseph R. and Laura Shaw, $395,000.\nCloudburst Hill, 5009-Jamienguyen to Lillian M. Shepherd, $388,000.\nCottonwood Way, 10717-Robert J. and Theresa A. Cornish to H. and Kumkum A. Rahman, $450,000.\nEliots Oak Rd., 5380-Dena Engineering Corp. to Brian Edward Simon, $300,000.\nFaulkner Ridge Cir., 10466, No. 7-Stephen D. Leedy to Jessica E. Leedy, $180,000.\nHigh Beam Ct., 10628-Michael F. Broom to Wei Shi, $300,000.\nLightfoot Path, 5213-Robert S. Becker to Robert P. Michel, $345,000.\nMorning Time Lane, 6324-Michael J. and Dalene A. Radcliffe to Bryan J. and Lili Garrard, $605,000.\nPowder Run, 11264, No. A-26-8-Marian Ruth Kavanagh and Marian Ruth Scheinholtz to Kimberly Marie Hudock, $187,500.\nSilent Dell Lane, 6984-James Albert Shelton and Paul Elizabeth Shelton to Donald E. and Melanie A. Lewis, $550,000.\nSummer Sunrise Dr., 6405-Thomas David and Kelly Smith Singer to Tyler J. and Nicholas R. Grossi, $690,000.\nTriangle Dr., 6106-Pavel A. Obgolz to Alonda L. Woodley and Byron T. Vaughan, $505,000.\nWhitewasher Way, 10370-Elizabeth A. Duvall and Kna Elizabeth Duvall Goldstein to Justin and Rachel Gilpin, $464,000.\nCOOKSVILLE AREA\nFox Creek Ct., 14313-Thomas Gregory and Deanna Lynn Talbott to Ugandhar Rao and Vinula Vemulapalli, $980,000.\nDAYTON AREA\nPoint Breeze Dr., 13812-Castleberry at Ten Oaks Corp. to Michael W. and Margaret F. Decampo, $530,000.\nELKRIDGE AREA\nBluff Point Lane, 7677-Philip M. and Krsiti Comeau to Qing Guan and Lin Deng, $262,000.\nDagny Way, 7733-Beazer Homes Corp. to Raghuveer Kolanu, $454,717.\nDeep Falls Way, 7138, No. 153-Wells Fargo Bank to Mohan Reddy and Roopa Abbavaram, $226,000.\nGreen Field Rd., 6335, No. 1703-Victoria A. Boettcher and Victoria Lewis to Matthew Slappo, $180,000.\nHillrise Ct., 8014-Janis L. and Daniel L. Goulette to Aisha B. Rivera Margarin, $305,000.\nManchester Way, 6231-Rebecca Mulhollem to Casey Rivest, $345,000.\nOak Grove Way, 7003, No. 96-Vinay Kumar and Rupa Sameera Vuyyuru to Ammar Nizar Bulbul, $335,000.\nOwen Kellogg Ct., 7707-Beazer Homes Corp. to Wayne Q. and Evelyn D. Williams, $423,450.\nRoland Ct., 8008-Fitzgeald and Bernadelt Campbell to Dong Lyul and Myung Suk Kim, $535,000.\nSandpiper Ct., 6239, No. 4-Kristen M. Wagner and Kristen Marie Schmanke to Kevin M. Gough, $209,900.\nWild Honey Way, 7428-Nima and Sarah Khazaeli to Anver S. and Saleem M. Khan, $337,000.\nELLICOTT CITY AREA\nAutumn Harvest, 8574-National Transfer Services Corp. to Xuefang Cao and Yu Zhao, $550,000.\nBonnybridge Pl., 3826-Saeed and Asia Malik to Mark M. Kabue, $339,500.\nCarson Ct., 5217-Wilmington Trust to James and Melissa Gorman, $691,000.\nEdgewood Rd., 3152-Sirel Mouchntaf to Rick Joseph Migliore, $490,000.\nGawain Dr., 4744-Michael Wintrode to Paul Y. and Jill A. Lee, $430,000.\nHickory High Ct., 8125, No. R-Kathleen Kerry Burbank and Jonathan Burbank to Margaret J. and Paul J. Chambers, $307,000.\nKensington Gardens, 2520, No. 302-Cornelious O. and Mary E. Wyehe to Zenoba S. Stephens, $304,000.\nManahan Dr., 8740-Zhengrong and Qiu C. Wu to Cuiying Zheng and Xiaoyu Wu, $340,000.\nNottingham Way, 8014-Tyrell William and Valerie Nelle Fawcett to Kenneth Harrison and Jessica M. Izzi, $490,000.\nQuiet Shade Lane, 7508-Rebecca T. and Damon B. Boughamer to Matthew Plough, $535,000.\nStonehouse Dr., 8789-Richard T. and Marsha L. Byas to Gregory Godson, $455,000.\nWestminster Rd., 2780, No. 61-Frank D. and Bonita Meyer to Andrea J. and Donald W. McDowell, $525,000.\nFULTON AREA\nElmwood Rd., 7711-Joseph V. and Molly E. Pitcher to Christopher M. and Robin J. Murray, $761,000.\nIager Blvd., 11401-Chin Woo and Chong Hun An to James and Danielle Tobin, $530,000.\nTawes St., 8917-Edward Park and Jihyun Shin to Wayne and Amy H. Xu, $585,000.\nGLENELG AREA\nBold Ruler Ct., 3704-Tommy R. and Lori L. Best to Diego M. De Sanude and Kariun De Sanude, $933,000.\nGLENWOOD AREA\nWillow Birch Dr., 3602-James B. Waller to Michael K. Hantke, $1.2 million.\nHANOVER AREA\nHolly Marie Rd., 6407-Live Fearless in Christ Corp. to Ashenafi Ayehu Zeleke and Bezuhan Derbew Abawa, $439,900.\nHIGHLAND AREA\nIsle Of Mann Way, 13141-John H. and Sung H. Kim to Ali Darwish, $645,000.\nJESSUP AREA\nJoshua Grayson Dr., 7209-Leon A. and Sabrina B. Beresford to Lisa C. Beresford, $399,000.\nSharewood Dr., 7747-Susan Finamore to Raymond E. Hess, $250,000.\nKINGS CONTRIVANCE VILLAGE AREA\nBalmy Dew Way, 7110-Jessica B. and Jason D. Hummel to Jeremiah D. Hess, $323,000.\nClocktower Lane, 9627-Alynn M. Albert to Yuri Ishida, $324,900.\nSkyrock Ct., 8932-John G. and Michelle L. Wiland to James Robert and Angela L. Jackson, $306,801.\nWeather Worn Way, 7607, No. C-Marjoir I. Jurd to Jack R. Coleman, $145,000.\nMARRIOTTSVILLE AREA\nJohn Gravel Rd., 2241, No. 4-NVR Inc. to George and Katherine Allmon, $311,855.\nSCAGGSVILLE-LAUREL AREA\nBoundless Shade Terr., 9608-Charles and Joanna Campbell to Anthony Gomes, $500,000.\nCharmed Days, 8461-Rachel J. and Morey N. Kogul to Joseph H. and Sonya Park, $425,000.\nDonnan Castle Ct., 9601-Dakha and Tusharkumar Patel to William A. Quade III, $328,000.\nHarding Rd., 10646-Dorothy A. and Gary Grauel to Kelly A. Werle, $251,000.\nIce Crystal Dr., 8420, No. E-Carol Pohlman to Deporres and Leisia Brightful, $280,000.\nLilac Park Dr., 9100, No. 19-David C. Wajsgras to Janette S. Hall, $229,900.\nMoonshine Hollow, 9070, No. N-Sheila Cooke to Bao H. Vuong, My Ngoc Nguyen and Minh Hoang Bui, $140,000.\nRedbridge Ct., 9221-Brian N. Lounsbury to Quang Ngoc Kein, Hanh Thi My Kein and Quoc Vinh Kein, $251,000.\nSewall Ave., 9220-Kaushikbhai D. and Mayaben K. Patel to Olayoyin O. Adekola, $459,900.\nTumbleweed Run, 9120, No. E-Debra W. Fitzgerald to John and Elizabeth Karley, $135,001.\nWEST FRIENDSHIP AREA\nRoute 144, 13605-Christopher Oscar Esposito and Molly Hannah Fredette to Matthew and Raquel Schaffner, $545,000.\nWOODSTOCK AREA\nChambers Ct., 11100, No. A-Paul B. and Barbara A. Kalafos to John A. McColgan, Patricia J. McColgan, Amy M. Page and Thomas Page, $300,000.\nRed Dahlia Dr., 10736-Mendis and Detty M. Chelapurath to Kevin Bin Zhang and Diane Bihui Xu, $750,000.","url":"https://www.washingtonpost.com/local/anne-arundel-county-and-howard-county-home-sales/2018/06/19/416ed466-6b29-11e8-bf8c-f9ed2e672adf_story.html"}
