{"authors":[],"date_download":"2018-10-30 14:33:34","date_modify":"2018-10-30 14:33:34","date_publish":"2015-03-24 00:00:00","description":null,"filename":"data/vaneerConsumption/AnObamaEPAruleconservativescansupport.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_03_an_obama_epa_rule_conservatives_can_support_comments_1540910014.html","title":"An Obama EPA rule conservatives can support","title_page":"Blog: An Obama EPA rule conservatives can support","title_rss":"NULL","source_domain":"americanthinker.com","text":"In general, I oppose nearly all environmental initiatives of the Obama administration and even those of the George W. Bush administration, which was hardly conservative in such matters, either. Fuel economy standards made cars lighter and more dangerous to survive during a crash. The Endangered Species Act is used like a club to deprive people of their private property rights. The EPA has become empowered to investigate pools and puddles in people's backyards and prevent development. Utilities are facing tremendous pressure to conform to expensive new regulations to protect against imaginary global warming. But there is one thing the Obama administration is doing I agree with. Twenty-five years in the making, a new nationwide rule is set to take effect this spring that will sharply restrict coal and oil-fired power plants from releasing mercury, arsenic and other hazardous pollutants into the air and, eventually, into rivers and lakes. But the... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/03/an_obama_epa_rule_conservatives_can_support_comments.html"}
 say it may be \"the most costly rule\" ever adopted under the Clean Air Act. Supporters of the new toxics rule say it is vital to ensuring public health. Mercury is highly toxic and builds up in the food chain[.]\nThis is correct. Mercury and arsenic are among the most toxic chemicals there are.\nThe new standards will force about a 90% reduction in emissions of mercury and other toxic metals and gases. In their appeal, lawyers for the coal industry and the Republican states say the EPA ignored the $10-billion-a-year compliance cost, which would include refurbishing or closing old power plants.\nThis looks like an expensive, costly rule. But for once, it may be worth it. We're not talking about protecting some snail or iguana. We're not talking about something completely imaginary, like global warming. We're talking about what environmentalism used to mean: protection of our lives.\nI think, for once, the EPA is doing the right thing. I'll praise almost anyone who does the right thing. If the socialist president of France stands up to a bad deal with Iran, I'll praise him. If Rand Paul finally decides that libertarianism means cutting government spending, and not just the budget for the Drug Enforcement Administration, I'll praise him. And if Rick Perry can remember the names of the three government departments he says he wants to eliminate, I'll praise him, too (last time he ran for president, that question stumped him).\nHeavy metals are among the most dangerous forms of pollution, and we should limit their aerosolizing as much as we can. Just as we eliminated lead from gasoline, we should work to eliminate their production at factories and powerplants as much as can reasonably be accomplished.","url":"https://www.americanthinker.com/blog/2015/03/an_obama_epa_rule_conservatives_can_support.html"}
