{"authors":["Rob Schmitz","Clay Masters"],"date_download":"2018-10-23 05:30:31","date_modify":"2018-10-23 05:30:31","date_publish":"2017-01-18 00:00:00","description":"Donald Trump chose Iowa Gov. Terry Branstad as ambassador to Beijing because of old ties with President Xi Jinping and Iowa's history of trade with China. Branstad will have a tough job.","filename":"data/vaneerConsumption/AnOldFriendOfChinaPreparesToBridgeDifferencesAtAFraughtTime.json","image_url":"https://media.npr.org/assets/img/2017/01/17/ap_151180339864_wide-231809ce9d682150e51dfaae2e08e4ae3265a153.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_parallels_2017_01_18_510249254_an-old-friend-of-china-prepares-to-bridge-differences-at-a-fraught-time_1540272631.html","title":"An 'Old Friend Of China' Prepares To Bridge Differences At A Fraught Time","title_page":"An 'Old Friend Of China' Prepares To Bridge Differences At A Fraught Time : Parallels : NPR","title_rss":"NULL","source_domain":"npr.org","text":"An 'Old Friend Of China' Prepares To Bridge Differences At A Fraught Time\nEnlarge this image toggle caption Andy Wong/AP Andy Wong/AP\nTwo days before the election, Donald Trump stood before a large crowd in Sioux City, Iowa, and called onstage the longest-serving governor in U.S. history.\n\"I think there's nobody knows more about trade than him,\" Trump said of Iowa Gov. Terry Branstad. \"Boy, you would be our prime candidate to take care of China.\"\nBranstad's relationship with China goes back to 1985, when he was in his first term as governor and a young agricultural official from Hebei Province named Xi Jinping visited Iowa. The two hit it off. In the ensuing years, Branstad and Xi kept in touch, as the latter slowly ascended to China's top leadership position and Branstad was elected back into the governor's office in 2011, managing billions of dollars worth of the state's pork, soybean and other exports to China.\n\"I had told Donald Trump on several occasions, 'Don't say anything bad about China when you're in Iowa,'\" Branstad says, sitting in his Des Moines office. \"We have a great relationship there.\"\nIn Muscatine, 150 miles east of the capital, Sarah Lande looks at photos on the wall from Xi Jinping's 1985 visit to her town as she walks through what's now dubbed the Sino-U.S. Friendship House. It's a modest, 1960s brick split-foyer house where the Chinese president stayed, sleeping in the bedroom of a young Star Trek fan.\nEnlarge this image toggle caption Clay Masters/Iowa Public Radio Clay Masters/Iowa Public Radio\nTwo Muscatine residents have purchased the house and hope to make it an attraction for Chinese tourists. It's already open to the public. Lande was part of the group that organized Xi's first trip. She says Xi had read Mark Twain and fell in love with the Mississippi River, which borders Muscatine.\n\"And we found him jolly,\" she recalls. \"A great smile.\"\nLande says Xi did not get a royal treatment in Iowa. \"One of the reasons we had homestays,\" she says, was because \"everybody was a volunteer. People in the home, the potluck dinner ... I think that really appealed to him.\"\nSince then, Xi and Branstad have visited each other several times. Branstand keeps several tokens of their friendship, including artwork and photos, on display in his office.\nBranstad says he knows promoting Iowa to China is a vastly different job than being an ambassador between the two largest economies in the world. He's hopeful he can find areas of cooperation.\nBranstad was a big supporter of the Trans-Pacific Partnership, a 12-nation trade deal backed by President Obama, but Trump has called it a disaster, promising to back out of it.\n\"Maybe it can be renegotiated and China could be included,\" says Branstad. \"That's something I think should be looked at. Or the other thing to do would be bilateral agreements, like we've done with South Korea.\"\nBefore he tackles that, though, Branstad will need to negotiate what has become a very tense relationship between Washington and Beijing.\nThe most recent spat began in early December, when Trump took a call from the president of Taiwan, an island with its own government, but which Beijing considers part of China. In response, China lodged a formal protest with the United States.\nFive days later, Trump's appointment of Branstad as ambassador prompted the hint of a smile from a Chinese foreign ministry spokesman, who called the Iowa governor \"an old friend of China.\"\n\"This is a common quote in China, which signifies that this is somebody that China feels that they can trust,\" says Ken Jarrett, a former U.S. diplomat in China who now heads the American Chamber of Commerce in Shanghai.\nEnlarge this image toggle caption Clay Masters/Iowa Public Radio Clay Masters/Iowa Public Radio\nBranstad's 30-plus-year relationship with Xi is important, Jarrett says, but as he starts his diplomatic post in Beijing, the more important relationship will be the one Branstad has with his new boss.\nThe challenge, Jarrett says, will be interpreting Trump to the Chinese.\n\"Everyone is still in the stage of trying to understand how to interpret [Trump's] tweets. This is not easy for Americans to do and is even more difficult for the Chinese to do,\" Jarrett says.\nBranstad will also have to navigate what has become a complicated \"frenemy\" relationship between the world's two largest economies.\n\"He's going to have, of course, major challenges, because the relations between the two countries right now are somewhat tense,\" says Beijing-based lawyer Lester Ross.\nDiplomatic landmines abound: China's encroachment into the South and East China Seas. Cybersecurity. North Korean nukes. And now that China's economy is in trouble, the Communist Party is tightening control over its people, their access to information and exposure to foreign influence.\n\"China has absorbed and embarked upon a fiercely security-conscious policy mix, under which foreign influence is regarded suspiciously no matter where it emanates from, no matter what its contents are,\" says Ross.\nIn short, there may be no more challenging time than now to be U.S. ambassador to China. And, says Peking University professor Zha Daojiong, the role of the U.S. ambassador has never been more confusing to China's leadership.\n\"What kind of role is he here to play?\" asks Zha. \"Is he here to represent a voice from the administration? Or is he going to be functioning as a bridge of sorts?\"\nAmerican ambassadors to China in the 1980s and 1990s were descendants of missionaries in Asia, so-called \"old China hands\" with the ability to see China through the lens of history, philosophy and civilization. Then, around the turn of the century, a more politically savvy batch of top diplomats arrived with close connections to Washington.\nZha misses the old days. \"Time has come for the ambassadorship to function as a bridge between the different voices of both societies,\" he says.\nWhen asked to pass on advice for Branstad, Ross, a 30-year China veteran, doesn't skip a beat. \"Be prepared to work hard. Be prepared to travel the country to make a physical presence across the country and to accommodate and welcome Chinese cultural influence. Try to make a broad, popular impression on the Chinese people.\"\nIn other words, be the face of America to the Chinese people — something best done in person, not on Twitter.","url":"https://www.npr.org/sections/parallels/2017/01/18/510249254/an-old-friend-of-china-prepares-to-bridge-differences-at-a-fraught-time"}
