{"authors":["Lana Shadwick"],"date_download":"2018-10-30 19:43:25","date_modify":"2018-10-30 19:43:25","date_publish":"2015-08-07 10:21:30","description":"A YouTube video message purportedly by the group Anonymous has issued a threatening warning for the Waller County Sheriff’s Department.","filename":"data/vaneerConsumption/AnonymoustoProtestSaturdayin35USCitiesThreatenCopsNoMercyforMurderers.json","image_url":"https://media.breitbart.com/media/2015/08/Anonymous-Sandra-Bland-Protest.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_08_07__1540928605.html","title":"Anonymous to Protest Saturday in 35 US Cities — Threaten Cops, ‘No Mercy for Murderers’","title_page":"Anonymous to Protest Saturday in 35 US Cities -- Threaten Cops, 'No Mercy for Murderers'","title_rss":"NULL","source_domain":"breitbart.com","text":"A YouTube video message purportedly by the group Anonymous has issued a warning for U.S. police chiefs, Waller County police, and in particular, the Waller County Sheriff’s Department. In a threatening demand, the group told the Waller Sheriff’s Office, “We all know where you live. No mercy for murderers.” The group plans protests in 35 cities throughout the U.S. on Saturday, August 8th.\nThey pledge on August 8th to “rage against the corrupted system that killed Sandra Bland and continues to commit injustice across this country.” The group demands that Texas DPS trooper Brian Encinia, who stopped and arrested Bland in her car be arrested, and that “each police chief in each protesting city re-attest their pledge to the crowd to protect and serve their citizens.”\nThe video was uploaded to the YouTube account of the “AnonIntelGroup.”\nIn a computer-generated voice, the tape demands and warns:\nTo the citizens of the United States, we are Anonymous. Our blood burns with rage for the murder of Sandra Bland and the subsequent cover-up by Waller County police and the sheriff’s department. As a collected body, we are distraught and angered by the careless response of politicians and the peddling of illegitimate and doctored evidence by the media. In short, Sandra Bland was murdered and we are all furious. It is time we take our anger to the streets. On August 8th, we rage against the corrupted system that killed Sandra Bland and continues to commit injustice across this country. We demand that Brian Encinia be arrested without delay and that each police chief in each protesting city re-attest their pledge to the crowd to protect and serve their citizens. We also demand that all evidence and footage pertaining to Sandra Bland be handed over to the public. Dates, times, and appropriate locations have been posted at the description below. We will continue to protest every night until these demands are met. To the Waller County Sheriff’s Department, this is a message directed to you. If you do not comply with our demands, we will answer with our wrath. All of your secrets will be leaked. We all know where you live. No mercy for murderers. We are Anonymous. On August 8th – Expect Us.\nThe dates, times and locations posted on the YouTube video site states that “Operation Rage for Sandra: National Day of Rage,” will be held at the Waller County Sheriff’s Department on Calvit Street in Hempstead, Texas, at 6:00 p.m.\nDates, times and locations for 34 cities in the United States are also posted on the site.\nProtests are also scheduled on August 8th in: Phoenix, Tuscon, Little Rock, San Francisco, Oakland, Los Angeles, Denver, Washington DC, Atlanta, Tampa, Orlando, Miami, Chicago, Des Moines, New Orleans, Baltimore, Boston, Detroit, Lansing, Ann Arbor, Minneapolis, St. Louis, Carson City, Manhattan, Newark, Durham, Columbus, Cleveland, Portland, Philadelphia, Pittsburgh, Nashville, Memphis, Austin, Salt Lake City, Seattle, and Milwaukee.\n“We are Anonymous. On August 8th – Expect Us!” – #RageForSandra states the post on the YouTube page where the video appears.\nSandra Bland is the woman who was arrested in Waller County, Texas, after an altercation with a Texas Department of Public Safety trooper. The case has received national attention and there have been calls for investigations after she was found dead after 3 days in jail, as reported by Breitbart Texas and Breitbart News. An autopsy ruled she committed suicide. Breitbart Texas was there when the Texas House Committee on County Affairs held a hearing in the Texas state Capitol last week to investigate.\nMs. Bland’s death has been the source of outrage in Texas and in the nation and the arresting officer has been criticized for his handling of Bland. The black woman was outwardly outraged when she was stopped and allegedly kicked the officer. Prior to her arrest, Officer Brian Encinia was holding a stun gun when he told her, “I’ll light you up.” Although Bland cursed at the officer and refused to abide by his instructions, her responsibility for her behavior has largely not been criticized.\nAnonymous describes the group as “the digital collective hacker.” They are alleging that they have pointed to discrepancies in official reports by law enforcement about Bland’s death and believe that the young woman was murdered.\nAn image commonly associated with the group is a man without a head because it represents a leaderless organization which is also anonymous. The movement started as an online “organization.”\nAnonymous took credit for hacking a Cleveland city website after a 12-year-old boy was shot by police.\nThey have also claimed credit for the posting online of police officer’s names, addresses, and even the names and details about their children’s schools. This is called “doxxing.” Los Angeles Police Department officers were the victims of doxxing after a homeless man was shot and killed on Skid Row. Skid Row is an area in downtown Los Angeles.\nThe meme (defined as the culture, or system of behavior that is passed from one individual to another by nongenetic means) is the same as that, or mimics that, associated with the Occupy movement.\nAs reported by Breitbart News’ William Bigelow, Andrew Breitbart’s Occupy Unmasked, directed and written by Stephen K. Bannon, and produced by Citizens United, opened in September 2012. Bigelow described it as “a labor of love for Andrew, who appears throughout the film, acting as its narrarator. Taking down the Occupy movement was Andrew’s last true passion project.”\nBigelow wrote that Occupy Unmasked shows that “the top-down coordination of the Occupy Wall Street movement relied on a leftist leadership willing to mold a conglomeration of the naive and the criminal into a potent political force. Occupy Unmasked features Andrew delving into the roots of the Occupy movement, and uncovering the coordination between the Obama administration, its allies in the media, and Occupy.” He wrote that the movement “morphed from a ridiculous camp-out movement into a dangerous political force, wielded by the Obama administration and the media as the counter-Tea Party, even as it smashed windows, burned property, and assaulted police.”\nWe will be watching on August 8th.\nLana Shadwick is a contributing writer and legal analyst for Breitbart Texas. She has served in Texas as a prosecutor and criminal court judge. Follow her on Twitter @LanaShadwick2","url":"https://www.breitbart.com/border/2015/08/07/anonymous-to-texas-sheriff-we-all-know-where-you-live-no-mercy-for-murderers/"}
