{"authors":[],"date_download":"2018-10-30 23:00:42","date_modify":"2018-10-30 23:00:42","date_publish":"2014-08-14 13:32:39","description":"After several cautious tweets Thursday morning, hacktivist group Anonymous named the Ferguson cop it believes killed Mike Brown. The group has been threatening to release sensitive information about the police department since protests erupted in…","filename":"data/vaneerConsumption/AnonymousNamesFergusonCopItBelievesKilledMikeBrown.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/c90a07e2-5dcf-4799-9b5e-19aa3343b596.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35740-anonymous-names-ferguson-cop-it-believes-killed-mike-brown_1540940442.html","title":"Anonymous Names Ferguson Cop It Believes Killed Mike Brown","title_page":"Anonymous Names Ferguson Cop It Believes Killed Mike Brown","title_rss":"NULL","source_domain":"bustle.com","text":"After several cautious tweets Thursday morning, hacktivist group Anonymous named the Ferguson cop it believes killed Mike Brown. The group has been threatening to release sensitive information about the police department since protests erupted in the St. Louis suburb this weekend. As it turns out, they were incorrect; on Friday, Ferguson police finally named the officer in question.\nEarly Thursday morning, one of the group's affiliated Twitter accounts tweeted that the group had secured the involved officer's name, but was taking the time to verify his identity. The group added in a follow-up tweet: \"We don't want to be responsible for someone's life being screwed over.\"\nThen, two hours later, the group tweeted the name of the officer they say shot the unarmed teenager. The group threatened to release photos, the address, and documents about the officer if the St. Louis County Police Department does not respond. Stills of a now inactive Facebook page allegedly belonging to the officer, hidden under an alias, have already emerged.\nAnonymous' leak comes a day after the Ferguson police department announced that it would not release the officer's name. Initially, the department said that it would release the name on Tuesday, but pushed back the date citing safety issues. In Wednesday's about-face, the department decided not to release the information at all.","url":"https://www.bustle.com/articles/35740-anonymous-names-ferguson-cop-it-believes-killed-mike-brown"}
