{"authors":[],"date_download":"2018-10-30 00:51:57","date_modify":"2018-10-30 00:51:57","date_publish":"2018-08-21 00:05:48","description":"The Catholic Church has partially addressed these sacrilegious issues, but the Church can only regain the moral high ground by making it clear that child abuse will not be tolerated, and that wrong-doers will be prosecuted.","filename":"data/vaneerConsumption/AnOpenLettertotheCatholicBishops.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/1024px-thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860717.html","title":"An Open Letter to the Catholic Bishops","title_page":"An Open Letter to the Catholic BishopsThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"One of the most important responsibilities of our society is to nurture, teach, and protect our children. We are failing our children at many levels, especially because we are not protecting our youth from pedophiles and predators.\nLast week, a Pennsylvania grand jury reported that several hundred Catholics priests might be predators. The Catholic Church is losing the moral high ground by failing to recognize and report on these offenders.\nIndividuals who commit crimes are not real priests; they are criminals who have no place in the Catholic Church. If proven guilty, they must face criminal justice.\nThese issues could have been resolved in 2002, when the church appointed a lay-independent commission. The commission’s chairman was Governor Frank Keating (former Oklahoma governor), a highly competent executive and former FBI agent. He was the right man at the right time to expose wrongdoers and refer them to the prosecutors.\nKeating began with an open mind, but quickly realized that some of the accusations were true and that the bishops covered them up. It also became evident that the bishops did not have the moral courage to permanently resolve the crisis and expose the predators. As he resigned from the commission, Governor Keating’s comments provided a deep insight into his concern.\nThe church, he said in the letter, is a ”home to Christ’s people.”\n”It is not a criminal enterprise,” Mr. Keating said. ”It does not condone and cover up criminal activity. It does not follow a code of silence. My remarks, which some bishops found offensive, were deadly accurate. I make no apology.”\nSixteen years later, here in 2018, these issues linger, and they will not be resolved, until the church resolutely commits to exposing offenders and permanently eliminates predators from the ranks of its priests.\nThis will require some bishops and priests to resign or be terminated to cleanse and purify the church. It also requires the church to be forthcoming, turning over the information it has to authorities.\nCardinal Wuerl, Archbishop of Washington, D.C., is named in the grand jury’s report because he purportedly protected and transferred abusing priests and concealed information from authorities, when the priests were reported to law enforcement.\nEven if Cardinal Wuerl is not culpable, it is obvious that he did not lead with moral conviction and failed to resolve these crimes. It is now time for Cardinal Wuerl to resign or to be fired by Pope Francis.\nAll bishops, priests, and administrators who failed to resolve these crimes in their jurisdiction or those who committed these crimes must now resign or be fired. It is the responsibility of the Catholic Church to provide moral leadership and allow the judicial system to punish criminals.\nThe Catholic Church has partially addressed these sacrilegious and criminal issues, but the Church can only regain the moral high ground by making it clear that child abuse will not be tolerated, and that wrong-doers will be prosecuted. We cannot change the past, but we can learn — and ensure the protection and nurturing of all children as our highest priority.","url":"https://spectator.org/an-open-letter-to-the-catholic-bishops/"}
