{"authors":[],"date_download":"2018-10-30 21:14:18","date_modify":"2018-10-30 21:14:18","date_publish":"2014-11-27 10:28:21","description":"Dear Sheelah Kolhatkar: Yesterday, my attention was drawn to your extraordinary profile of video game critic Anita Sarkeesian, which is to be a cover |","filename":"data/vaneerConsumption/AnOpenLettertoBloombergsSheelahKolhatkarontheDelicateMatterofAnitaSarkeesian.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2014_11_27__1540934058.html","title":"An Open Letter to Bloomberg's Sheelah Kolhatkar, on the Delicate Matter of Anita Sarkeesian","title_page":"An Open Letter to Bloomberg's Sheelah Kolhatkar, on the Delicate Matter of Anita Sarkeesian | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Dear Sheelah Kolhatkar: Yesterday, my attention was drawn to your extraordinary profile of video game critic Anita Sarkeesian, which is to be a cover story in Bloomberg Businessweek. On Twitter I intemperately called it a “grotesquely shoddy work of credulous, ridiculous fangirlism.” On reflection, I conclude I did not go far enough.\nSince you have failed to perform a basic survey of the literature surrounding the GamerGate controversy, or, worse, purposefully elected to exclude it from your reporting, and since you have placed your critical faculties on ice in the manner the “listen and believe” feminists are always so insistent on—largely, it turns out, because their claims don’t stack up—allow me to sketch out the real reasons Sarkeesian is controversial in the video games industry, and, to fill in the blanks in your writing, to explain why her ideas are so universally loathed among gamers.\nYour piece is long, detailed and evidently the result of some effort. So it deserves to be addressed in detail. Allum Bokhari, a brilliant British writer who has written very even-handedly about the concerns of the consumer revolt known as GamerGate, which your piece ably demonstrates the validity and necessity of, has been kind enough to share with me some of his notes about Sarkeesian’s videos, which I am leaning on heavily in what follows.\nSarkeesian believes that there are “ideas of toxic masculinity in our culture.” Her producer, Jonathan McIntosh also believes in the “toxic masculinity” idea and also says that ideas of toxic masculinity “permeate our media landscape”. Central to the idea of “toxic masculinity” is the idea that cultural products such as video games “normalise” social ills, such as violence, misogyny and racism. It’s no surprise to see McIntosh supporting junk science that ties videogames to violence—a discredited myth.\nThese arguments are identical to those made by the family-values wing of the conservative right. In fact, the arguments by feminists may be even more extreme. Sarkeesian is often compared to the conservative anti-game crusader Jack Thompson, but he only ever wanted to restrict the sale of violent video games to children. He did not argue that the content of games should be changed and believed adults should have the full range of options available to them.\nSarkeesian, however, believes in an old social-science myth, long since debunked, that culture creates behaviour. This idea is on its way out in academia, having been mortally crippled by the “cognitive revolution” epitomised by the works Steven Pinker, Jonathan Haidt and Daniel Kahneman, which emphasises the innate drivers of human behaviour.\nCultural studies is rightly mocked as a junk degree. But its adherents continue to proselytise, taking the puritanical view that culture is dangerous and ought to be controlled. The majority, however, see games as entertainment—sometimes transgressive, but not something that will make you go out and kill.\nNot that you’d know that from the outlandish rhetoric employed by feminist critics like Sarkeesian and McIntosh, who repeatedly misrepresent scientific consensus to produce bizarre and offensive claims about racism, violence, “sociological damage” and “patriarchal masculinity.”\nSarkeesian, like many of her followers, believes gamers create an environment in which “women are excluded”. But the facts tell a different story. GamerGate, lazily stereotyped by the media as the highest expression of misogyny in gaming, successfully green lit a female developer’s game on the Steam marketplace via a Twitter campaign while opponents of GamerGate want to boycott her, just because she has “the wrong opinions.” GamerGate has also contributed over $20,000 to the Fine Young Capitalists, a feminist movement.\nFeminists say they want to help women, but it’s always someone else—in the gaming world, usually a man—who gets their wallet out to do it.\nIn reality, it’s not women that some gamers have a problem with: it’s people like Sarkeesian and McIntosh. They have claimed hatred of them and people like them is tantamount to hatred of women. But it isn’t. People don’t hate Anita Sarkeesian because she’s a woman: they hate her because they see her as a disingenuous, divisive, sociopathic opportunist.\nProminent feminists and feminist journalists have offered compelling critiques of Sarkeesian’s work. Much of what is erroneously characterised as “abuse” is in fact merely robust criticism of Sarkeesian’s ideas—ideas she refuses to debate. Sarkeesian, uniquely in the sphere of public intellectuals, refuses to subject her pontifications to critique. She censors comments not because they are insulting or distasteful but because they reveal structural weaknesses in her arguments. This is not the manner of an academic, aspirant or otherwise, worth listening to.\nIt is in this respect that her professorial aspirations, and those of her writer and producer, reach dizzying heights of absurdity, beyond even those of her laugh-a-minute Master’s thesis. Universities are places of learning and debate, but Sarkeesian is a broadcaster, not an interlocutor. So radically anxious is she about the substance of her arguments and so vulnerable is she to accusations of sensational cherry-picking, she has not accepted a single invitation to debate her theories.\nAnd those theories desperately need examination, not only because they relate to an $80 billion industry but because, underneath the freshman-level social studies rhetoric, they are based on fringe, outmoded theoretical foundations. Perhaps that’s why veteran journalist Cathy Young says: “The fact that Sarkeesian has emerged as the leading voice in such criticism right now ensures that it’s going to be propaganda, not analysis.”\nTo give just one example of Sarkeesian’s underhand method of argument, consider the following. A central plank of Sarkeesian’s criticism is that women appear as window dressing and as “damsels in distress,” there to be saved by men. She says that this loss of agency in video games is somehow damaging to women in the real world.\nBut her examples do not support this claim. She says that when male protagonists are imprisoned or endangered, they have to escape themselves, whereas females must always be rescued by a male. Yet her example, drawn from Metal Gear Solid, is flagrantly dishonest.\nAt around the 18-minute mark in “Damsel in Distress: Part 1”, she shows Metal Gear Solid protagonist Solid Snake escaping by using ketchup as fake blood. But what she omits to say is that a female character is also imprisoned earlier in the game. That female character escapes in a much feistier manner: by beating up a guard. This is a classic, deliberate example of lying by omission, and such dishonest manoeuvres are a constant feature of Sarkeesian’s videos.\nAlmost every example she gives falls apart under the microscope. This ten-minute video by popular YouTuber Thunderf00t, which is nearing half a million views, shows how Sarkeesian utterly misrepresents the game Hitman Absolution in order to make ideological arguments that are simply not backed up by the evidence. Practically every academic citation she deploys turns out to be a sleight of hand.\nPerhaps we shouldn’t be surprised. Sarkeesian has a habit of clutching at straws: she once, hilariously, condemned file-sharing and piracy culture as too male-dominated, and—get this!—declared several classic Christmas songs to be “misogynistic.” This variety of desperate grasping for controversial material is the bonkers modus operandi of the sort of intersectional third-wave claptrap that has put the public, women especially, off the idea of feminism entirely.\nIs it any wonder hardcore gamers and GamerGate supporters, who are, despite what the feminists claim, overwhelmingly male, looking on at these dishonest summaries of the hobby they love, which in many cases has been a precious escape for them from quotidian troubles, have been driven to colourful language when describing Anita Sarkeesian and her particular brand of misandry?\nDetailed written critiques have been published by viewers of Sarkeesian’s videos, unpicking the claims she makes and casting doubt on her abilities as a serious cultural commentator. They are often long-winded, and sometimes not as convincing as the views of professional academics such as the American Enterprise Institute’s Christina Hoff Sommers, who speaks with authority and persuasiveness about how hopelessly out of date Sarkeesian’s intellectual bedrock is.\nBut they exist, and they are worthy of serious consideration, as, most certainly, are Sommers’s. You may not have been aware of their existence when you published your cloying paean to Sarkeesian’s strength, courage and indefatigability; you are now. It may have been outside the scope of your piece, which lazily focused on the alleged abuse some women in the video games industry say they have received, ignoring the real objectives of the movement, but it would have been professional to include at least some indication that Sarkeesian’s views are appreciated only by a radical fringe, and that there are serious ethical questions surrounding her videos that lead some to question her motives. That might have gone some way, might it not, to explaining for the benefit of your readers why she has attracted so much criticism.\nWhat about the claim, hinted at but left unexplored in your profile, that Sarkeesian repeats games over and over again in order to garner damning footage utterly unrepresentative of most gamers’ experiences? If you have an understanding of how disingenuous a method of research this is, you give no indication of it in your writing.\nNor do you acknowledge, investigate or adjudicate on the widespread claims that much of what material in her videos is not manufactured in this disreputable manner is ripped off from others. I’m reminded of that old witticism, sometimes attributed to Samuel Johnson: “Your manuscript is both good and original. But the part that is good is not original, and the part that is original is not good.”\nAnd then there is Sarkeesian herself. Coupled with thoroughgoing and ambitious demolitions of her theoretical frameworks and methods, critics have pointed to Sarkeesian’s own history as an opportunist and vacuous self-promoter and, in the words of one prominent GamerGate supporter, “multi-level marketing scammer,” as reason to be sceptical of her sincerity. The following video, which shows Sarkeesian extolling the virtues of multi-level marketing has garnered nearly 55,000 views on YouTube.\nYou did not see fit to mention this, or any claim like it, in your piece. And there are further, worse allegations, about which no reporter who did their homework properly could possibly have been ignorant, that Sarkeesian worked for some time for a man of dubious credentials who sold seminars in which he called women “sluts” and explained how to bed them by using neuro-linguistic programming to skirt around consent. No great crime in itself, you may think, but hardly congruent with her abrupt discovery of radical feminism, and perhaps worthy of a question to the woman herself. Don’t you think?\nThen, of course, there is the peculiar claim, which you repeat uncritically in your coverage, that Sarkeesian has been a gamer since she was a small girl. Now, there can be no doubt that Ms. Sarkeesian these days possesses a sizeable library of titles and perhaps even a few games consoles, as you breathlessly recount—as though you were surprised by the fact that a professional critic of video games plays video games.\nBut another widely-shared YouTube video suggests that Sarkeesian only began to identify as a video game enthusiast when it promised her commercial advantage. Despite claiming, in an op-ed for the New York Times, that she had begged for a Game Boy for Christmas in the early 1990s, as recently as 2010 she was telling audiences that she was “not a video gamer.”\nA thousand little obfuscations, absurdities, suspicions, hints and inconsistencies have painted a picture to gamers of someone utterly untrustworthy, quite apart from the slapdash—or just plain mendacious—academic methods she uses to push her ideology, aided and abetted by a low-rent west-coast games press anxious to advertise its moral virtue.\nThere is a sense in which your piece assists GamerGate, in that it solidifies opposition to lazy, ideologically motivated coverage from the media which takes the easy route through the GamerGate controversy, instead of addressing the movement’s concerns and examining the claims by women who in many cases cannot be believed as far as they can be thrown.\nBut there is no sense in which your sloppily researched hagiography can be said to contribute meaningfully to the literature of this complex and confusing controversy. Having provided the context you denied to your readers, let’s examine in more detail some of the specific claims you make (or, rather, reprint in your own words from your interviews with Sarkeesian). An exhaustive list of solecisms would take me several days to assemble, so riddled with mischaracterisations is your work; I’ll settle for some of the more egregious errors. Again, I am indebted to Allum Bokhari for much of the referencing and detail.\nFirstly, you claim that GamerGate was primarily concerned with developer Zoe Quinn’s sex life as a way of undermining its claim to be a consumer revolt demanding better quality journalism and rejecting spurious feminist critique. You are wrong. In early videos, GamerGaters themselves made it clear: “I’m not putting these names out there because I think it’s wrong she cheated in a relationship, I’m putting them out there because It’s important to show how corrupt gaming journalism has become.”\nIn fact, GamerGate has been relatively uninterested in Zoe Quinn, but has been outraged on behalf of her many victims, including Wizardchan, for which GamerGate successfully secured an apology after Quinn manipulated The Escapist into publishing unsubstantiated smears about them. Or consider The Fine Young Capitalists, a feminist group who faced doxxing, blacklisting and hacking attacks from supporters of Quinn after “getting on her bad side.”\nYou cast aside entirely the media ethics considerations of GamerGate, despite the fact that The Escapist, Kotaku and Polygon have all changed their editorial policies as a result of concerns brought to light by GamerGate supporters. This is in my experience in journalism quite an unprecedented, industry-wide acknowledgment of systemic failure.\nYou also neglect to mention that the majority of what GamerGate supporters are up to, emailing advertisers and complaining about inaccuracies in coverage, happens behind the scenes. GamerGate is an iceberg whose below-surface volume is an order of magnitude larger than the Twitter nonsense upon which you have relied and to which feminists point when attempting to smear the movement as an orgiastic outburst of woman-hating. You’d know that, of course, if you’d taken the time to speak to a single GamerGate supporter. Evidently, you did not.\nYour article repeats without further inquiry the claim that Jonathan McIntosh has not received the same level of abuse as Sarkeesian, in an attempt to show that women are the subject of unique and uniquely voluminous negative communications online. If we for a moment define abuse as merely disobliging messages, that simply is not true: a hashtag devoted solely to mocking McIntosh gained close to 30,000 tweets in a month.\nMen are almost twice as likely to receive Twitter abuse as women, according to Demos. According to Pew, they are also more likely to be physically threatened or experience sustained abuse. Yet regardless of mounting evidence from well-respected think tanks that women receive no more harassment online than men do, the media continues to report on this narrative to the exclusion of all else.\nInstead of offering a challenging portrait of a woman beholden to the ugly misandry of modern third-wave feminism at the centre of perhaps the most remarkable new front in the culture wars to have emerged in the last few decades, you have fallen back on a ready-made story of persecution and victimhood without considering even the most basic contextual information and without reference to readily available statistical data.\nYou repeat at length the absurd claims from a supposed threatener of Sarkeesian at the start of your story, but fail to state the obvious: that it is an ostentatious and transparent fake and Utah state police declared that there was no credible threat. Murderers do not announce themselves in this fashion. None ever has. Not a single threat made to a feminist activist via social media has ever been credible or ever amounted to violence, although there have been several prosecutions for threatening language in the UK.\nNor do the victims of death or rape threats, if genuinely in fear of their lives, execute press tours and elicit public sympathy and even, mind-bogglingly, financial donations off the back of the impotent rage of a few sad lunatics on the internet. Imagine if you, or I, professional journalists who receive (I am speculating in your case) dozens of such threats a year, were to take to the pages of the New York Times and hysterically demand attention and financial support from strangers every time we received an email or tweet from a nutcase, or every time our personal information was published on the internet.\nImagine if all journalists did it. Imagine if politicians did it. Uniquely in public life, we treat some of the most robust, articulate, resilient, obnoxious and well-resourced people in society—professional middle-class feminist agitators—as vulnerable children, because that is how they disreputably and dishonestly portray themselves for competitive advantage. In doing so, we demean the majority of women to whom such swooning and screeching is distasteful and patronising to their sex.\nYou correctly note in your profile that it was only thanks to her militant and calculated dissemination via the sympathetic gaming press of threats she says were made against her that Sarkeesian raised the extraordinary sum of $158,922 on her Kickstarter page. Quite where the money has gone, no one knows: she has released only a handful of videos since and is already now asking for additional, ongoing monthly stipends from viewers.\nNever in the history of public life has abuse been so professionally advantageous or financially lucrative—an observation that tells its own story. But Sarkeesian acts without humanity or shame: she lost no time in leveraging a tragedy to her own political benefit recently when she leapt to Twitter to blame “toxic masculinity” less than a day after a tragic school shooting.\nIf you are a controversial public figure, you are going to receive threats. I am one; I do. Jack Thompson received death and rape threats on a regular basis. Prominent atheists constantly receive threats. Well-known YouTuber TotalBiscuit, who isn’t overtly political, says he receives them on a monthly basis. Most of these threats aren’t serious, and the FBI has confirmed there was never any serious danger to Sarkeesian in Utah: in fact, she chose to cancel her talk to make a political statement about that state’s concealed carry laws.\nThe response of most people, famous or otherwise, is to ignore trolls. They are just words on the internet. People like Sarkeesian, who drone on constantly about online harassment, aren’t doing so because they really feel threatened. If that were the case, they wouldn’t, as Brianna Wu did, advertise their precise location less than 48 hours after receiving a death threat. They are doing so because they have an agenda.\nWhenever feminist groups have partnered with social media organisations, their censorship targets have been critics of feminism and not abusers. Their overarching aim is to press for government regulation of the internet, perhaps even targeting anonymity itself. That’s because anonymity is a place where cultural hegemony is challenged. With their media connections and celebrity support, social justice warriors are the cultural hegemony, regardless of how much they claim to be oppressed victims.\nYour piece fails to mention that not a single arrest or prosecution has been brought as a result of alleged threats in which the GamerGate movement has been implicated—without, I should point out, a shred of evidence linking any GamerGate supporter to any threat. And it fails to acknowledge that radical far-left pseudo-academic feminist troublemakers use threats as currency online in a perverted sort of Olympics, showing off to one another and begging for funds with each round of new insults that, in many cases, observers suspect they have sent to themselves.\nFinally, and perhaps most depressingly predictably, your piece fails entirely to mention that GamerGate supporters, in contrast to the unverifiable empty threats apparently made on social media to women in gaming such as Sarkeesian, Zoe Quinn and Brianna Wu, have been the subject of genuinely malicious and dark disruption to their lives, and had just cause to feel physically imperilled, thanks to the odious behaviour of feminists and their supporters.\nMerely for reporting on GamerGate in a sympathetic manner, I have received three unpleasant packages in the mail to my home address. One contained a syringe filled with unknown liquid. Another contained a dead animal, which I later identified as a field mouse. Other GamerGate supporters have had the emergency services sent to their home addresses in a foul practice known as swatting. Many of us have been doxxed, our private addresses and telephone numbers shared on forums and on message boards. We have declined to widely publicise these threats because, firstly, it is strongly counter to police advice, and, secondly, it’s a dirt-cheap debate tactic.\nYet imagine the uproar if Sarkeesian, Quinn or Wu had experienced anything remotely so unsettling, and how loudly they would have squealed about it. The internet would have come to a standstill. Yet no reporter has seen fit to cover these threats because GamerGate supporters and even journalists sympathetic to their cause are considered fair game. I cannot believe you were unaware of at least some of these facts before filing your story, thus I am compelled to call out your grotesque double standards.\nCBC producers recently refused to run an interview with pro-GamerGate game developer Jennifer Dawe because they wanted to pursue the harassment narrative—a narrative that has no basis in reality, and is purely a tool of political opportunists. This pattern has been repeated throughout the press, and has found tired, formulaic expression in your own cover story.\nAnita Sarkeesian is not a brave warrior for women, fearlessly paving the way for a theoretical future that is less “misogynistic” and “sexist.” Nor is she a delicate wallflower in need of close protection. She is an intellectually dishonest professional malcontent, who has misrepresented criticism and rejection of her work in order to garner pity and sympathy—and for financial gain. Worse, she is a bully with an extremist ideological agenda who picks on some of the most marginalised and misunderstood people in society.\nNowhere is this better or more simply illustrated than in the difference between her theory and practice: women in video games must, for Sarkeesian, be strong, independent heroines who rescue themselves from dragons, rapists and all manner of supernatural perils; while, in the real world, even a social media message is enough to have a feminist agitator crying foul and appealing for support from the police, the FBI and the media, each of them classic expressions of male power. “Damsels in distress” are only acceptable, it seems, when the damsel in question is an authoritarian feminist pot-stirrer.\nIt would behove journalists writing in an organ as esteemed as yours to acknowledge some of these considerations before publishing such gushing prose tributes, and to recognise, too, that the other individuals you uncritically report as having received death and rape threats—Zoe Quinn and Brianna Wu—have long, chequered histories of deception, manipulation and trolling, facts that you could perfectly easily have uncovered with the most cursory examination of the material in front of you.\nNeedless to say: I have cancelled my subscription.\nYours,\nMilo Yiannopoulos","url":"https://www.breitbart.com/europe/2014/11/27/an-open-letter-to-bloomberg-s-sheelah-kolhatkar-on-the-delicate-matter-of-anita-sarkeesian/"}
