{"authors":[],"date_download":"2018-10-30 01:23:43","date_modify":"2018-10-30 01:23:43","date_publish":"2016-06-09 05:00:37","description":null,"filename":"data/vaneerConsumption/AnOpenMindAnOpenLettertoMyNeoconservativeFriends.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/06/Iraqi_military_men_riding_on_tank.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862623.html","title":"An Open Mind, An Open Letter - to My Neoconservative Friends","title_page":"An Open Mind, An Open Letter — to My Neoconservative FriendsThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Dear Neoconservative Friends,\nI won’t name names, because 1) we actually are friends, 2) you know who you are, and 3) that isn’t the point of this exercise. The idea is to try to change your minds about something very big and to convince anyone else who wants to listen in.\nLet’s start with Iraq. I got that wrong and you had something to do with it. As you know, I didn’t argue for the war. Instead I said I could see both sides and we’d see how this works out. It seemed like a bad idea to me at the time but you guys and gals were smart and confident and had been right before, so I decided to give you the benefit of the doubt. Would my friends really steer me wrong on this one?\nIt turns out yes, and not a few of you are still trying to square the Iraqi circle in various ways. You argue that Bush had it won and Obama lost the peace. You can’t actually believe that, or the other rationalizations you’re offering up for why this wasn’t a complete disaster. You’re too intelligent. It would be far better, for you and for the country, to just say, “We got Iraq wrong, OK!”\nNow, I understand why you don’t want to do that. Apologies in politics work differently than apologies between friends and family. In affairs of state, it’s not enough to say that you were wrong, you also have to make concessions to critics. In this case, you would have to say that Iraq was a bad idea, full stop, and we shouldn’t have invaded.\nIt’s clear that you don’t want to make that sort of concession. When I suggested it a few years back for GOP presidential candidates, a neoconservative editor and acquaintance took issue with that publicly because “political parties are networks” and some people in the GOP “network” helped to make the wrong call on Iraq. Seriously, that was an argument that he made — networking!\nI am not saying that most of you are being this silly about Iraq, just stubborn. And boy do I understand stubbornness. It’s one of my defining qualities. Just ask my wife. But if a virtue is something that is always good, then stubbornness is not a virtue. And it is not serving you well here.\nLet me explain why you should not be so stubborn by listing a few other things many of you have gotten wrong, post Iraq. You were wrong to back the Arab Spring’s toppling of governments, wrong to back the overthrow of Libya’s strongman and to agitate for the overthrow of Syria’s strongman, wrong to support more troops in Afghanistan.\nYou’re also wrong when you say that our military has been “hollowed out.” Spending fell a bit as we no longer had troops in Iraq, but now the struggle against ISIS is changing that. America spends more than the next seven highest rolling nations spend on defense — more than China, Saudi Arabia, Russia, Britain, India, France and Japan — not separately but combined.\nAmerican forces aren’t “hollowed out.” They are stretched too thin by overcommitments that you helped pile on them. The remedy is not to build them back up to Cold War levels to take on a bunch of Bronze Age fanatics but to pull back, retrench, rethink the scope of our commitments in light of America’s concrete interests.\nYou may disagree with any of the above points but bear in mind that in the minds of a majority of Americans you start at a distinct disadvantage, having got a recent war that cost trillions of dollars (wit medical costs for the tens of thousands wounded factored in) so badly wrong and thereby helped to destabilize an entire region of the world. As long as you embrace that albatross, I don’t see this going well for you.\nThe thing that’s so bizarre to me about your stubbornness about Iraq and more Middle East meddling is that it cuts against insights I gleaned from your own publications and initiatives.\nTake the notion that Islam is a “religion of peace,” which is official U.S. government policy. I learned, from neoconservative sources among others, to be skeptical of that notion. A historical survey shows that Islam is a religion that is capable of peace certainly, but it’s a whole lot more complicated.\nThat is especially true when you look at the boiling cauldron that is modern Middle Eastern politics, with the Sunni-Shia rift, and half a dozen other ethno-religious fissures, front-and-center. Why is it a good idea to pull America into ever-deeper involvement with something that we have so much difficulty even understanding?\nAnd I learned a thing or two about how America ought to deal with strongmen rulers from reading an article titled “Dictatorships and Double Standards,” not in Dissent or the Nation but in the neoconservative flagship journal Commentary.\nIn the 1979 article, future U.N. ambassador and American Spectator board member Jeane Kirkpatrick showed folly of the Jimmy Carter administration’s pursuit of its human rights agenda above all else. “The U.S. has never tried so hard and failed so utterly to make and keep friends in the Third World,” she mocked. Kirkpatrick went on to make the case, with some rigor, that America ought to be willing to work with autocracies in pursuit of our broader foreign policy goals.\nWhen Obama took a similar line against Middle Eastern strongmen who weren’t named Saddam Hussein, I assumed you would be skeptical of this essentially Carterite foreign policy, especially since you were so gung-ho about the “war on terror” which at its best is really a war against jihadism.\nNo luck, however. Too many of you decided that if you were in for the Iraq penny, you were also in for the pound of Middle Eastern upheaval. That hasn’t worked out very well, and you must know it. You can chalk this up to Obama’s “weakness” and “indecision” until you’re red in the face, but he’s dropped an awful lot of bombs and made many of the same calls you would have made.\nIt seems to me that Iraq really is the key to all of this. The original wrong call has tied you down logically and emotionally. You feel obliged, bound even, to make many more bad decisions because of it. You think it’s a Gordian knot, but really you’re holding it together. As your friend, let me suggest that it’s time to let it go.","url":"https://spectator.org/an-open-mind-an-open-letter-to-my-neoconservative-friends/"}
