{"authors":["Unity Blott For Mailonline"],"date_download":"2018-10-22 22:26:14","date_modify":"2018-10-22 22:26:14","date_publish":"2016-01-28 10:24:19","description":"Student Joss Walde, 23, from Guildford, Surrey, was diagnosed with anorexia nervosa at just 16, and she became so ill she was forced to drop out of sixth form. She is now on the road to recovery.","filename":"data/vaneerConsumption/AnorexicJossWaldenweighedunder4stafterdietingtolookperfectforprom.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/10/30A9240300000578-0-image-a-2_1453976626490.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3418878_Anorexic-student-weighed-four-stone-dieted-look-perfect-prom_1540247174.html","title":"Anorexic Joss Walden weighed under 4st after dieting to look 'perfect' for prom","title_page":"Anorexic Joss Walden weighed under 4st after dieting to look 'perfect' for prom | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A 23-year-old woman has revealed how she recovered from a five-year battle with an eating disorder that saw her weight plummet to less than four stone.\nStudent Joss Walden, from Guildford, Surrey, was diagnosed with anorexia nervosa at just 16, and she soon became so ill that she was forced to drop out of sixth form.\nHer eating disorder began in January 2008, when she decided to lose weight for her Year 11 prom and embarked on a diet that soon spiralled out of control.\nScroll down for video\nStudent Joss Walde, from Guildford, Surrey, was diagnosed with anorexia nervosa at just 16, and she soon became so ill that she was forced to drop out of sixth form - pictured after her diagnosis in 2008\nJoss, right, took part in the Tough Mudder race in Winchester in 2015, raising £1,000 for charity with her friends\n'My heart slowed down and my breathing was poor': Joss, pictured during her recovery, was pulled out of sixth form and put on bed rest as she had become so ill that her breathing and heart were at risk\nAs her weight dropped dramatically, she was forced to put her dreams of going to university on hold in a battle to save her life.\nJoss told FEMAIL: 'I was always one of the curvier ones in my group of friends. In 2008 I had my Year 11 prom coming up and I wanted to be the perfect Barbie and get a date.\n'It started as a diet cutting out cheese, chocolate and crisps but it soon became an obsession. It became all about perfection and it got out of hand.'\nAfter her diagnosis in September that year, Joss recalls her parents saying they felt like they were slowly losing their once bubbly, extroverted daughter.\nThey took on the role of full-time carers, checking on Joss each night for fear that her heart might give out. At the time, she was surviving on just 500 calories a day and saw her weight fluctuate between 3st and 3st 7lbs.\nJoss said: ‘Following my diagnosis I was removed from completing my A-levels and placed on strict bed rest.\nJoss, pictured on a family holiday in Spain in 2010. She had just left her second in-patient unit\nJoss Waldon, 23, from Surrey, pictured before her 2014 charity skydive. She battled with an eating disorder for five years that saw her weight plummet to less than 4st, with her surviving on just 500 calories a day\nJoss, pictured at her lowest point, in January 2012 before being admitted to an adult inpatient ward\n'My heart had slowed down and my breathing was very poor. Each attempt to re-feed and recover at home proved unsuccessful’. But she still thought that she was 'big'.\nOver the course of the next five years, Joss stayed at three different residential inpatient units for up to eight months at a time.\nIn an attempt to try and move forward with her life, she signed up to university course but quickly had to drop out due to the amount of time spent in and out of hospital.\n‘Doctors said my prognosis was poor and I was even told it was highly unlikely that I would ever conceive,' Joss recalled.\n'Physically my body began to struggle. Muscle wastage contributed to me having problems with my knee which meant that even a small country walk felt too much.’\nBut four years after her diagnosis Joss was no better. She said: 'I was the most ill I had ever been; both physically and mentally.\n‘In 2012 I was admitted to my first adult eating disorder ward and I hated it! The memory of the NG feeding tube haunts me to this day whilst the rest of my admission there remains a bit of a blur.\n'When I was finally discharged, I remember reflecting on the last few years of my life – the doctor’s appointments, religiously measuring myself, missing social occasions and relationships breaking down – and thinking, \"I don’t want this to be the rest of my life\".'\nIt was then that Jess decided to change. Slowly she began eating and exercising more, although she still found it difficult.\n‘I would often over eat and then compensate for this by working extremely hard in the gym,' Joss said.\n'Subsequently this would result in more over eating and more obsessive gym work. Rather than tools for punishment I now see food and exercise as building blocks to achieve strength and good health.’\nIn 2013, Joss restarted university in Surrey and took part in a charity skydive for eating disorder charity b-eat, raising £700.\nJoss, pictured in Disneyland Paris, left, and before a university Christmas meal, right, both in December 2015 after her recovery. The 23-year-old says that she no longer weighs herself\nJoss was still struggling with body dysmorphia, but it was signing up to her first obstacle course race in 2015 that pushed her recovery and self-confidence by allowing her to eat properly while staying healthy through training.\nNow Joss is preparing to take on her next obstacle course race, Toughest, which will involve 8km of tough terrain and 40 different obstacles.\nShe said: 'I am a big tom boy at heart and I love having a goal to work towards when I am training. Really it’s a medical miracle I am here today.\nJoss - taking part in the Tough Mudder race - says that while she doesn't weigh herself, she no longer obsesses over her size and weight\nJoss before her 2014 charity skydive, where she raised £700 for the eating disorder charity b-eat\n‘I love the feeling of building strength. I am now a lover of the new ‘strong not skinny’ motivators and OCR [obstacle course racing] women on Instagram.\nJoss, who is 5ft 2in, says that while she no longer weighs herself, she is probably around 7st now.\n'Strength training encouraged me to eat more and to enjoy what I was doing. Rather than being in unvarying fear and constant cycles of guilt/shame and over exercising, I now love that I can feel myself getting stronger.\n‘I think anyone who manages to beat anorexia, or any eating disorder, is pretty thick-skinned.\nJoss, who is now studying for a degree in psychology, said: ‘I hope to inspire others with my story and promote \"strong not skinny\" as a way of life.\n'I think a lot of recovery is to do with growing up and learning to take responsibility for yourself. It’s about disproving your faulty and anxious thoughts by acting against them’.\nFor more information visit eating disorder charity Beat at b-eat.co.uk","url":"https://www.dailymail.co.uk/femail/article-3418878/Anorexic-student-weighed-four-stone-dieted-look-perfect-prom.html"}
