{"authors":["John Nolte"],"date_download":"2018-10-30 20:04:16","date_modify":"2018-10-30 20:04:16","date_publish":"2015-02-07 17:52:07","description":"Completely separate from the 2003 Iraq helicopter incident Brian Williams confessed to lying about this week, thanks to a Twitter user who alerted Ace Of Spades, we now have a 2007 video of Williams claiming he was involved in a hairy wartime incident involving a different helicopter during a different war. |","filename":"data/vaneerConsumption/AnotherWilliamsChopperTaleNBCAnchorClaimsHezbollahRocketsBuzzedHisHelicopterDuringIsraelWar.json","image_url":"https://media.breitbart.com/media/2015/02/Williams23.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_02_07__1540929856.html","title":"Another Williams Chopper Tale! NBC Anchor Claims Hezbollah Rockets Buzzed His Helicopter During Israel War","title_page":"Another Williams Chopper Tale! NBC Anchor Claims Hezbollah Rockets Buzzed His Helicopter During Israel War | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Completely separate from the 2003 Iraq helicopter incident Brian Williams confessed to lying about this week, thanks to a Twitter user who alerted Ace Of Spades, we now have a 2007 video of Williams claiming he was involved in a hairy wartime incident involving a different helicopter during a different war. According to the NBC Nightly News anchor, during “the war with Hezballah in Israel, a few years back … there were Katyusha rockets passing just beneath the helicopter I was riding in.”\n—\n—\nIt gets me to thinking, I’ve been very lucky the way my life has turned out, I’ve been very lucky to have survived a few things that I’ve been involved in, at a perception a few minutes ago, I was remembering something I tend to forget, the war with Hezballah in Israel, a few years back, where there were Katuyshka rockets passing just beneath the helicopter I was riding in. A few years before that, you go back to Iraq, and I looked down the tube of an RPG that had been fired at us and it hit the chopper in front of ours.\nNote that when relating the helicopter story about Iraq, Williams hasn’t yet placed himself in the helicopter shot down by the RPG. He merely claims that he “looked down the tube of an RPG that had been fired at us and it hit the chopper in front of ours.”\nHe’s claiming a close call — that the RPG was meant for his chopper but hit the one in front of him. It wouldn’t be long, though, before he was claiming it was his chopper that was hit and forced to land.\nNevertheless, numerous military witnesses say that Williams wasn’t even close enough to see the chopper get shot down. He was 30 minutes to an hour behind the incident.\nOf the Katyusha story, Hot Air’s Ed Morrissey asks the key question, “Has anyone checked out the Katyusha rockets story, which sounds rather similar to Williams’ false story in Iraq? It’s entirely possible that it happened just as Williams relates here, but … has anyone verified it?”\nWhether the story is true or not, the problem for NBC News is that his stolen valor lie regarding Iraq has cast a legitimate shadow over everything the face of their news division says — whether it’s a separate chopper incident, tales from Katrina, or a simple story about saving a puppy.\nADDED: Jeryl Bier appears to have found the report in question. Neither the video or written report reference anything close to rockets passing “just beneath” his chopper. Nor does Williams reference anything about being lucky to be alive.\nJohn Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/the-media/2015/02/07/brian-williams-over-israel-rockets-passed-just-beneath-the-helicopter-i-was-riding-in/"}
