{"authors":[],"date_download":"2018-10-30 01:07:38","date_modify":"2018-10-30 01:07:38","date_publish":"2018-08-28 00:05:00","description":"Over the weekend, a young writer who has written for National Review and in this particular case, the Spectator, UK (not to be confused with our publication The American Spectator), wrote a take-down of another young woman new to the conservative movement, Candace Owens. I don't know Candace any more than I know her vituperative essayist. I mention Candace, and not the author of the hit piece, because I'll be defending the former and hope that the woman who wrote the piece reconsiders her position.","filename":"data/vaneerConsumption/ANoteAboutGriftersandCandaceOwens.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/CandaceOwens.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861658.html","title":"A Note About Grifters and Candace Owens","title_page":"A Note About Grifters and Candace OwensThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Over the weekend, a young writer who has written for National Review and in this particular case, the Spectator, UK (not to be confused with our publication The American Spectator), wrote a take-down of another young woman new to the conservative movement, Candace Owens. I don’t know Candace any more than I know her vituperative essayist. I mention Candace, and not the author of the hit piece, because I’ll be defending the former and hope that the woman who wrote the piece reconsiders her position.\nCandace Owens received some measure of media fame recently when the rap star and Mr. Kardashian, Kanye West, positively mentioned her. In terms of changing hearts and minds, Kanye has done more to move the needle than a year of conservative op-ed’s published by all center-right publications combined.\nThere are a couple movements bubbling up under the political surface: one triggered by Canadian psychologist Jordan Peterson, the other triggered by Kanye West and by extension, Candace Owens.\nI love the way Candace Owens thinks — KANYE WEST (@kanyewest) April 21, 2018\nThe theme of both movements is personal responsibility, a decidedly conservative value. Jordan Peterson encourages (mostly) young men (and women) to stand up straight, change their corner of the world, and create a life before becoming a world-critic. Kanye, Will Smith, and some other black artists have embraced “love” and moving positively in the world rather than with rancor and blame. Kanye, in particular, bristled at the hypocrisy of black people who loved Trump before he was elected (he was among them) who now have no use for him once he was elected as a Republican. Kanye’s recent artistic work rejects being boxed in ideologically. He extols freedom.\nKanye was watching videos online. He found Candace Owens. He liked what he heard. He liked it enough that he tweeted about it.\nLet’s pause for a moment and consider how young people consume news and ideas. YouTube videos are the natural home for a new generation — that and Snapchat and Instagram. A liberal mom reacted with alarm that her uber-liberal son had heard about Jordan Peterson online and watched all his classes and views via video (this writer did the same thing long before she read the author’s book or attended his lecture). He was learning something he had never heard at university. Guys like Ben Shapiro, Steven Crowder, and Milo Yiannopoulos (Milo has been widely de-platformed) share ideas that college kids are unlikely to hear. Crowder has a meme-tastic video series called “Change My Mind” where he asks college students to change his mind on some topic and then gives the conservative answer.\nEnter Candace Owens, the Communications Director for Turning point USA, a conservative advocacy group. Candace is new to the right. There’s a nice backgrounder by another liberal apostate, Dave Rubin, here:\nShe woke up when she became a victim of liberals and the only one who defended her accurately in the media was the “alt-right, racist Breitbart.” This was in the Spring of 2016. Candace has been a self-described conservative for two years. But what does “conservative” mean? What does she mean?\nBack when the Tea Party started, I had the interesting good fortune to sit in on the first Houston Tea Party planning meeting. It was run by three women and a local pastor. Two of the aforementioned people were black. They were new to right-leaning politics and radicalized by Obama’s socialist stances. Their ideology wasn’t fully developed. They just felt, on a visceral level, that what was being done by the government of Obama, and Bush before him, with bank bailouts and bailouts in general was wrong. They didn’t want their taxes to go help some dummy bankers. Beyond that, their ideas were amorphous. Over time, they educated themselves and became more grounded ideologically, but their transition from left to right started emotionally.\nOften, the transition from one way of thinking to another doesn’t happen because someone using logic persuades a person to believe something new. Rather, a betrayal, offense, or gut feeling compels a person to consider a point of view that he or she never entertained. Donald Trump kick-started that phenomenon with many people as Sarah Palin and the Tea Party did before him. It should concern leftists who are confident that they’ll never lose black voters that Trump’s approval rating continues to rise. Once a critical mass of people start doubting….\nCandace Owens is not shy. She’s outspoken. She’s still figuring out what she believes, by her own admission. And she has effectively influenced other influencers to open their point of view to consider conservatism. This is a huge shift in a politically correct culture.\nSo why should Candace shut up? Why does a young journalism graduate commentate on another fledgling conservative’s activities?\nThe Tea Party wasn’t warmly welcomed to the conservative cause. It was dismissed as stupid and ineffective and not “truly conservative.” It was filled with grifters, was the accusation. And it’s partly true. There were some bad actors. But as it turns out, some supposedly trustworthy conservatives in D.C. are teaming up with lefties and looking more like grifters themselves — albeit with lovely creases in their pants.\nIt’s time someone define conservative. By Beltway standards of grifting, Candace Owen’s views, in their current form, are mainline conservative, whatever that means these days.\nAnd she’s actually doing something. (Yes, talking to people like Kanye is doing something.) Like the Tea Party who got Tim Scott, Allen West, Ted Cruz, Marco Rubio, Ron Johnson, Mike Lee, Rand Paul, and a host of House Republicans like Mia Love elected in huge wave elections, Candace Owens seeks to bring fresh constituencies to the conservative movement. There’s a question of whether she’s sincere and whether she’ll succeed, but why shouldn’t she be encouraged to try? And on what authority does one try to stop her?\nThe conservative movement is big enough to include more newbies. They should be welcomed.","url":"https://spectator.org/note-about-grifters-candace-owens/"}
