{"authors":["Breitbart News"],"date_download":"2018-10-30 19:05:58","date_modify":"2018-10-30 19:05:58","date_publish":"2016-04-03 21:43:32","description":"A second case of Ebola has been confirmed in Liberia months after the country had been declared free from transmissions.","filename":"data/vaneerConsumption/AnotherEbolaOutbreakLiberiaConfirmsSecondCaseSinceCountryDeclaredClearofVirus.json","image_url":"https://media.breitbart.com/media/2016/04/wi/afp_f0ddf30a6c04c4df4a39c3251782da71464313f7-e1459719800435.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_04_03__1540926358.html","title":"Another Ebola Outbreak? Liberia Confirms Second Case Since Country Declared Clear of Virus","title_page":"Another Ebola Outbreak? Liberia Confirms Second Case Since Country Declared Clear of Virus | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"MONROVIA, Liberia (AP) — A second case of Ebola has been confirmed in Liberia months after the country had been declared free from transmissions, health officials said Sunday.\nThe 5-year-old son of the 30-year-old woman who died Thursday from Ebola has been taken to a treatment center in Monrovia, said Deputy Health Minister Tolbert Nyenswah. Authorities are now checking everyone the woman was in contact with and 10 health care workers from the hospital where the woman died are under observation.\nThere are strong indications the woman came from Guinea when the border was closed, Nyenswah said. The woman, who died on arrival at a hospital Thursday, travelled with three of her children.\n“We are investigating in both Guinea and Liberia how she entered,” he said. “But knowing the porous border we are not surprised; she entered Liberia before getting sick or manifesting signs and symptoms.”\nThe new cases are a setback for Liberia, which had been declared free from transmissions for a third time on Jan. 14. Liberia was first declared free of the disease in May, but new cases emerged twice, forcing officials to reset the clock in a nation where more than 4,800 people have died from the deadly virus.\nThe World Health Organization has said Ebola is no longer an international health emergency, but flare-ups, at decreasing frequency, are expected.\nFlare-ups have also occurred in Sierra Leone and in Guinea.\nIn the case of Guinea, the flare-up came just months after the outbreak was declared over. WHO said there have been eight cases of Ebola and seven deaths in Guinea since late February. There are no known cases in Sierra Leone.\nEbola is spread through direct contact with the bodily fluids of victims or corpses.\nEbola has killed more than 11,300 people, mostly in West Africa, since December 2013.","url":"https://www.breitbart.com/national-security/2016/04/03/another-outbreak-liberia-confirms-second-case-ebola/"}
