{"authors":[],"date_download":"2018-10-30 17:55:24","date_modify":"2018-10-30 17:55:24","date_publish":"2018-07-10 19:35:00","description":"Atlanta police arrested a man they said breached the secured perimeter at Hartsfield-Jackson Interna...","filename":"data/vaneerConsumption/Anothermanarrestedafterbreachingairportperimeterpolicesay.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/07/10/Videos/4435648.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_just-anothe_2bef4203c7e31639d22fed13504dd43a__1540922124.html","title":"Another man arrested after breaching airport perimeter, police say","title_page":"Another man arrested after breaching airport perimeter, police say","title_rss":"NULL","source_domain":"ajc.com","text":"Atlanta police arrested a man they said breached the secured perimeter at Hartsfield-Jackson International Airport early Tuesday — the second such case in two weeks.\nE’Donis Trevel Andrews, 22, of College Park, was walking within the secured area just before 2 a.m. He had minor cuts on his body and appeared to be under the influence of alcohol, according to a news release by Atlanta police spokesman Jarius Daugherty.\nAndrews didn’t say how or why he was within the secured area, Daugherty said. He faces a charge of criminal trespassing.\nHe was taken to the Clayton County jail, according to jail records. A bond amount hasn’t been set.\nAnother man was arrested two weeks ago for jumping a perimeter fence, jumping on the wing of a Delta aircraft and banging on the window, police said.\nRELATED: Fence jumpers raise security concerns\n“Since the breach in June, we have been reviewing perimeter security,” Daugherty said in the release. “We will be making strong recommendations very soon to further fortify the fencing around the airport.”\nIn other news:","url":"https://www.ajc.com/news/crime--law/just-another-man-arrested-after-breaching-airport-perimeter-police-say/4MaYvYcuLSVlX30bTnql8O/"}
