{"authors":["Awr Hawkins"],"date_download":"2018-10-30 17:53:53","date_modify":"2018-10-30 17:53:53","date_publish":"2018-06-28 06:04:07","description":"With news of Supreme Court Justice Anthony Kennedy's retirement, pro-gun voters took a deep breath and understood a more secure Second Amendment could lie ahead.","filename":"data/vaneerConsumption/AnotherTrumpJusticeMeansaMoreSecureSecondAmendment.json","image_url":"https://media.breitbart.com/media/2017/10/u-s-supreme-court-american-flag-wash-dc-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_06_27__1540922033.html","title":"Another Trump Justice Means a More Secure Second Amendment","title_page":"Another Trump Justice Means a More Secure Second Amendment | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"With news of Supreme Court Justice Anthony Kennedy’s retirement, pro-gun voters took a deep breath and understood a more secure Second Amendment could lie ahead.\nAfter all, President Donald Trump gets another Supreme Court pick, and he has already made clear that his pick will be made from a list of accomplished individuals who are Constitutional originalists, i.e, individuals who approach the Constitution like Antonin Scalia and Neil Gorsuch.\nScalia’s brilliant and originalist mind was on display in the seminal Supreme Court ruling, District of Columbia v. Heller (2008), and Gorsuch’s similar mind was seen from the very start of Senate confirmation hearings.\nBreitbart News reported that Sen. Dianne Feinstein (D-CA) used the opening day of the Gorsuch confirmation hearings to talk up an “assault weapons” ban and her desire to get commonly owned semi-automatic rifles out of the hands of private citizens. The next day, she tried to get Gorsuch to voice support for the gun controls, but he demurred, saying:\nHeller makes clear that we judges are to apply. The question is whether it’s a gun in common use, for self-defense–and that may be subject to reasonable regulation. That’s the test as I understand it. There’s lots of ongoing litigation about which weapons qualify under those standards. And I can’t pre-judge that litigation sitting here.\nDuring an October 9, 2016, presidential debate, Trump told the American people what he wanted to do regarding the Supreme Court. He said, “I am looking to appoint judges very much in the mold of Justice Scalia. … People that will respect the constitution of the United States. And I think that this is so important–also, the Second Amendment which is totally under siege by people like Hillary Clinton.”\nTrump made clear that his Supreme Court picks will “respect the Second Amendment and what it stands for, and what it represents.”\nAnd now Trump gets another opportunity to choose a justice in the mold Scalia and Gorsuch, saving the Second Amendment from “people like Hillary Clinton” and making gun rights more secure in the process.\nAWR Hawkins is an award-winning Second Amendment columnist for Breitbart News, the host of the Breitbart podcast Bullets with AWR Hawkins, and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange.","url":"https://www.breitbart.com/politics/2018/06/27/another-trump-justice-a-secure-second-amendment/"}
