{"authors":["James Delingpole"],"date_download":"2018-10-30 20:28:20","date_modify":"2018-10-30 20:28:20","date_publish":"2018-08-24 18:44:23","description":"Malcolm Turnbull has been ousted as Australia's Prime Minister and replaced by his former treasurer Scott Morrison.","filename":"data/vaneerConsumption/AnotherGreenieBitestheDustAussiePMForcedoutbyClimatePolicy.json","image_url":"https://media.breitbart.com/media/2018/08/malcolm-turnbull.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_08_24__1540931300.html","title":"Another Greenie Bites the Dust. Aussie PM Forced out by Climate Policy","title_page":"Another Greenie Bites the Dust. Aussie PM Forced out by Climate Policy","title_rss":"NULL","source_domain":"breitbart.com","text":"Malcolm Turnbull has been ousted as Australia’s Prime Minister and replaced by his former treasurer Scott Morrison.\nIt follows a week of turmoil in Australia’s Coalition government over the carbon dioxide emissions reduction scheme – known as the National Energy Guarantee (NEG) – which the fanatically Turnbull was trying to foist on a country largely dependent on fossil fuel.\nThough Turnbull is a member of the Liberal party – Australia’s conservatives – his politics are very much at the squishier end of the spectrum. An arch-globalist, nicknamed the Honourable Member for Goldman Sachs (where he was a partner), Turnbull is fairly typical of the centrist, ideology-free conservatives who have tended to make the running in western politics in recent years. Indeed, when he first entered politics he seriously considered representing Australia’s Labor party (the socialists) rather than the Liberal party (the conservatives).\nTurnbull did not get off to a good start with Donald Trump. Shortly after the President’s inauguration, the two had a sticky phone conversation in which Trump refused to go along with a plan previously agreed with Obama whereby the U.S. was supposed to accept from Australia up to 2,000 economic migrants (mostly from Iran, Pakistan and Afghanistan). Trump described it as a “bad deal.” Turnbull subsequently was caught in a leaked tape mocking Trump and his mannerisms and mocking his alleged ties to Russia.\nLike former UK prime minister David Cameron, Turnbull is a great supporter of the UN’s green agenda. This has now been his undoing.\nAs Australia’s Institute of Public Affairs noted, Turnbull’s National Energy Guarantee (NEG) was an extremely bad deal for Australia.\nIt would have weakened Australia’s economy (which is built on fossil fuels such as coal, now exported in increasingly large quantities to China); it pretended to be a “market based solution”, whereas in fact it simply compelled energy retailers to use a greater proportion of wind and solar (on pain of large fines) and demanded billions of taxpayers’ money to be spent on green schemes and bureaucracies; it put carbon emissions reductions before the needs of all those consumers and businesses which have already suffered greatly from Australia’s rocketing electricity prices and sporadic blackouts (caused by its drive for renewables).\nGreen energy has been a disaster for parts of Australia, notably in the state of South Australia which was brought to its knees by the policies of its environmentalist Labor government. Its drive towards 40 percent renewables led to blackouts and brownouts across the state, which hammered industry and smaller consumers alike. Eventually, the government was booted out by disgusted voters.\nBut just because Turnbull has now gone doesn’t mean the problem has gone away. Just like in the UK and in parts of the GOP, there are still many politicians wearing the conservative label who are happy to go along with the green energy regulation scam.\nAs JoNova comments:\nMost of the [Liberal] party is too afraid to even talk about how much warming humans may be causing lest they be called a “denier” for doubting that it is not exactly the same as an unaudited, unelected and unaccountable foreign committee says. The nation can’t even have a sensible public discussion on climate change.\nAustralia remains committed to the Paris Climate Treaty; it remains committed to a swingeing carbon emissions reduction target of 26 percent below 2005 levels by 2030; and Turnbull’s replacement – his own preferred successor – Scott Morrison is not known to be a climate sceptic; also he has a reputation for being more about spin than substance.\nMorrison is Australia’s seventh prime minister in 11 years.\nDon’t bank on this turnover rate being slowed any time soon.","url":"https://www.breitbart.com/politics/2018/08/24/another-greenie-bites-the-dust-aussie-pm-forced-out-by-climate-policy/"}
