{"authors":["Kelli Serio"],"date_download":"2018-10-30 20:53:21","date_modify":"2018-10-30 20:53:21","date_publish":"2014-11-17 14:55:00","description":"More allegations of rape have hit comedian Bill Cosby, as another woman has come forward, this time stating the events took place more than 40-years-ago.\"","filename":"data/vaneerConsumption/AnotherWomanComesForwardwithRapeAllegationsAgainstBillCosby.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Hollywood/2014/11/17/Cosby-Grizzly-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2014_11_17__1540932801.html","title":"Another Woman Comes Forward with Rape Allegations Against Bill Cosby","title_page":"Another Woman Comes Forward with Rape Allegations Against Bill Cosby | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"More allegations of rape have hit comedian Bill Cosby, as another woman has come forward, this time stating the events took place more than 40-years-ago.\nJoan Tarshis posted an essay on Hollywood Elsewhere, via the Hollywood Reporter, alleging that Cosby drugged and raped her on two separate occasions in 1969, when she was just 19-years-old.\nTarshis, a former actress, music industry publicist, and journalist, wrote that Cosby, whom she met through mutual friends, would routinely invite her to his room on the Universal lot where the taping of The Bill Cosby Show took place.\nAccording to her, the comedian would offer her food and drinks, and although Cosby never drank alcohol in front of her, he would often pour her Bloody Marys.\nIn regards to the first instance of alleged sexual assault, Tarshis recounted an evening when Cosby invited her to his room to discuss material for his show. That is when he reportedly made her one of his Bloody Mary drinks.\nShe goes on to claim that she lost consciousness in the midst of discussing a scene with the comedian, and that she remembers coming to on his couch, unclothed. Tarshis wrote:\nThrough the haze, I thought I was being clever when I told him I had an infection, and he would catch it, and his wife would know he had sex with someone. But he just found another orifice to use. I was sickened by what was happening to me and shocked that this man I had idolized was now raping me.\nHer stated reason for failing to report the first instance of alleged rape rests on feelings of guilt. She wrote that the second incident, in which Cosby reportedly drugged and raped her, occurred after he asked her mother if she could come to a show with him.\nTarshis stated that she felt uncomfortable turning down the invite and also feared telling her mother about the previous rape. Relating to the second alleged incident, she wrote: “I remember thinking, ‘You old sh*t, I guess you got me this time, but it’s the last time you’ll ever see me.'”\nIn 2005, a woman named Andrea Constand filed a lawsuit against Cosby, claiming that he drugged and raped her in a Philadelphia mansion, one year prior.\nA lawsuit obtained by The Smoking Gun reads that Constand’s accusations against Cosby subsequently caused several other women to come forward with similar allegations. Most of the women are referred to as “Jane Does” in the document.\nCBS News reported that prosecutors dropped the charges against Cosby in February, 2005 due to a lack of sufficient and credible evidence.\nComedian Hannibal Buress accused Cosby of rape during a stand up gig in Philadelphia last month, and Cosby has been under fire since. He continues to deny all allegations.\nAnother alleged victim named Barbara Bowman wrote in a Washington Post op-ed last week that Cosby sexually assaulted her in the 1980s. Through writing, Bowman emphasized the fact that it took a male comedian to accuse Cosby of rape for the allegations to resurface.\n“Why wasn’t I believed?” she asked. “Why didn’t I get the same reaction of shock and revulsion when I originally reported it?”\nBowman also cast a negative light on the nature of the entertainment industry, claiming that her situation was not unique, as the industry is rife with men who use their power to victimize young women.\n“Even when their victims speak out, the industry and the public turn blind eyes; these men’s celebrity, careers, and public adulation continue to thrive. Even now, Cosby has a new comedy special coming out on Netflix, and NBC is set to give him a new sitcom,” said Bowman.\nCosby’s legal representative released a statement over the weekend on behalf of his client which read:\nOver the last several weeks, decade-old, discredited allegations against Mr. Cosby have resurfaced. The fact that they are being repeated does not make them true. Mr. Cosby does not intend to dignify these allegations with any comment. He would like to thank all his fans for the outpouring of support and assure them that, at age 77, he is doing his best work. There will be no further statement from Mr. Cosby or any of his representatives.\nMoreover, Cosby reportedly refused to answer questions pertaining to the allegations of rape during an NPR interview recently, and his name disappeared from the talent roster for Late Night With David Letterman last week.","url":"https://www.breitbart.com/entertainment/2014/11/17/another-woman-comes-forward-with-rape-allegations-against-bill-cosby/"}
