{"authors":[],"date_download":"2018-10-30 01:13:44","date_modify":"2018-10-30 01:13:44","date_publish":"2015-10-17 00:00:00","description":null,"filename":"data/vaneerConsumption/AnotherObamaFailureOceansStillRising.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2015_10_another_obama_failure_oceans_still_rising_1540862024.html","title":"Another Obama Failure: Oceans Still Rising","title_page":"Another Obama Failure: Oceans Still Rising","title_rss":"NULL","source_domain":"americanthinker.com","text":"The journey will be difficult. The road will be long. I face this challenge with profound humility, and knowledge of my own limitations. But I also face it with limitless faith in the capacity of the American people. Because if we are willing to work for it, and fight for it, and believe in it, then I am absolutely certain that generations from now, we will be able to look back and tell our children that this was the moment when we began to provide care for the sick and good jobs to the jobless; this was the moment when the rise of the oceans began to slow and our planet began to heal; this was the moment when we ended a war and secured our nation and restored our image as the last, best hope on earth.\nA little over seven years ago, when then Senator Barack Hussein Obama (D-IL) won the Minnesota presidential primary election thus clinching his nomination as the Democratic candidate, he famously predicted and promised\nThat was then, this is now. So what are the results for \"this was the moment\" with the present generation? Basically this generation isn't doing well at all at \"this moment\" or any moment of his presidency.\nLet's start with his most outrageous promise that was to occur under his messianic stewardship, \"the rise of the oceans began to slow.\" Whoops! A few days ago we learned\nthe oceans are still rising, endangering cities and areas home to over 20 million Americans. The culturally-rich cities of New Orleans and Miami are predicted to be completely submerged underwater by the year 2100, according to new research published in the Proceedings of the National Academy of Sciences. The study is accompanied by an interactive map from Climate Central, which demonstrates the impact of rising sea levels among the nation's coastal cities in accordance with various carbon emissions scenarios.\nFor more of their gloomy predictions read the whole thing.\nOh, what those darned carbon emissions can do in 85 years. What will we tell our children, the generations to come? We will tell them that Obama increased carbon emissions by flying all over the country -- the world really -- to hobnob with his one per cent friends so now the oceans are rising.\nWell, at least Obama is providing care for the sick as he promised, isn't he? Not really. But it is expensive. And will become more expensive. Very expensive.\nObamacare's many double-digit price hikes for next year Insurers have asked for double-digit rate increases for nearly 1 out of every 3 Obamacare plans that will be sold on HealthCare.gov for 2016 coverage, according to a new analysis. And in three states -- Delaware, South Dakota and West Virginia -- every plan sold on HealthCare.gov is asking for 10 percent or more hikes in the prices of their premiums for next year, AgileHealthInsurance.com said in its report.\nAnd the good jobs for the jobless? If Obama considers forced, unwanted early retirement or the imposed leisure and poverty of joblessness as a good job he nailed it as labor force participation continues to drop according to Goldman Sachs economists.\nGoldman Sachs economists have turned more pessimistic on the outlook for the U.S. labor-force participation rate, which is already at its lowest level since 1977. Just 62.4 percent of civilian, noninstitutionalized Americans ages 16 and older worked or looked for work in September, compared with 66 percent in December 2007, the start of the last recession. Economists, commentators, and even Federal Reserve researchers have spilled a lot of ink debating whether the participation decline is a short-term, \"cyclical\" aftershock of the economic downturn, or if it signals a more permanent, \"structural\" shift in the economy. Goldman economists are coming around to the latter idea. Workforce participation among older workers is picking up more slowly than the economists had initially projected, and discouraged workers entering the workforce are providing less of a boost, according to an Oct. 10 research note.\nSo what about Obama's promise to \"end a war and secure our nation\"? Umm, he may have ended a war by pulling out our troops prematurely but in doing so helped encourage other vicious, brutal and deadly wars which are raging all over the Middle East. And Russia, weak Russia! is fighting Obama's red lines against \"the JV team\", bringing death and chaos to civilians. Russia's Putin doesn't care. Apparently, Obama doesn't either.\nAs for securing our nation, Obama wants to provide refuge in this country to these anti-American terrorists and their families. Meanwhile, domestic security isn't doing well either.\nMurder Rates Rising Sharply in Many U.S. Cities MILWAUKEE — Cities across the nation are seeing a startling rise in murders after years of declines, and few places have witnessed a shift as precipitous as this city. With the summer not yet over, 104 people have been killed this year — after 86 homicides in all of 2014.\nAs Daniel Pipes sums up the situation. Obama:\nConceives of his role being to reach out to enemies, reduce America’s cowboy ways, make it one of the pack, and render the world a safer place. But he is also the president on whose watch we find not security but anarchy and despotism throughout the world. Reduced American influence has led to revolutions in Tunisia and Egypt, renewed civil wars in Iraq and Afghanistan, conflagrations in Libya, Yemen, and Syria, Russian military intervention, and unfathomable future troubles from a nuclear Iran. In other words, Obama’s policy is purposeful but the consequences are not.\nBut at least he \"restored our image as the last, best hope on earth\" right? Hmmm, not so fast.\nIn Iran, ‘death to America’ doesn’t mean what you think \"Death to America\" expresses the anger many Iranians feel about U.S. policy toward Iran, said Foad Izadi, an assistant professor of world studies at the University of Tehran. Iranians remember that the U.S. overthrew the legitimate government of Mohammad Mossadegh in 1953 and supported the dictatorial Shah who followed. The slogan \"means death to American foreign policy,\" said Izadi. Iranians \"have problems with the American government, not the American people.\" In fact, he said, Iranians are friendly to Americans. \"When you walk around town, and people see you're an American, everyone wants to take care of you.\"\nBy \"take care of you\" they mean throwing you into their notorious prisons, leaving you to rot for months until found guilty, at best.\nAnd future generations will laugh at Obama's early statement, \"I face this challenge with profound humility, and knowledge of my own limitations\" knowing their problems result in large part because of his lack of humility and erroneously believing his knowledge on everything was limitless.\nThe White House takes pride in the fact that Obama’s PDB is “not briefed to him” -- because, they say, he is “among the most sophisticated consumers of intelligence on the planet.” That hubris brings to mind this revealing quote from a September 2008 New York Times profile of Obama: “I think that I’m a better speechwriter than my speechwriters,” Mr. Obama told Patrick Gaspard, his political director, at the start of the 2008 campaign, according to The New Yorker. “I know more about policies on any particular issue than my policy directors. And I’ll tell you right now that I’m going to think I’m a better political director than my political director.”\nSo it should come as no surprise that apparently Barack Obama thinks he’s a better intelligence briefer than his intelligence briefers.\nBut he was inadvertently correct on one prediction. When future generations, undo his mistakes \"The journey will be difficult. The road will be long.\" will be a guideline.","url":"https://www.americanthinker.com/articles/2015/10/another_obama_failure_oceans_still_rising.html"}
