{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:09:34","date_modify":"2018-10-31 00:09:34","date_publish":"2015-10-28 08:00:00","description":"Politics is a team sport in Sacramento. After new folks are elected to the Legislature, their Democratic or Republican “teams” typically do everything","filename":"data/vaneerConsumption/Anoutsiderinaninsidergame.json","image_url":"https://calmatters.org/wp-content/uploads/patti_lopez_Wi6j6Ij.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944574.html","title":"An outsider in an insider game","title_page":"An outsider in an insider game | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Politics is a team sport in Sacramento.\nAfter new folks are elected to the Legislature, their Democratic or Republican “teams” typically do everything possible to keep them in the game. The camaraderie is strongest when legislators face tough re-elections – their colleagues walk precincts and their political parties spend big money to buoy the campaigns.\nWhich is why the case of Assemblywoman Patty Lopez is so strange. The Democrat from San Fernando faces a difficult re-election next year against a well-connected opponent who’s raised 40 times as much money as she has. Yet she appears unlikely to benefit from the support of her team.\n“I feel that my party hasn’t done enough to support her,” said Assemblywoman Cristina Garcia (D-Bell Gardens), who is vice-chair of the Legislature’s women’s caucus.\nA Mexican immigrant with little formal education, a heavy accent and a campaign operation she said she funded by selling tamales, Lopez shocked Sacramento’s political establishment last year when she won her seat. She ousted an incumbent, Democrat Raul Bocanegra, who had powerful allies, a master’s degree and a campaign war chest of more than $1 million. Her approach was so outside the norm that Lopez – a Democrat – campaigned alongside a Republican.\n“Patty Lopez got elected because she had an unusual groundswell of grassroots support from people who often don’t engage in politics but were attracted to the fact that she was one of them, she wasn’t a politician,” said Eric Bauman, chair of the Los Angeles County Democratic Party. “She was really an outsider.”\nWhen Lopez arrived in Sacramento, hackles were up. Would she vote like a Democrat? Could she get any bills passed? Could she make allies in an institution dominated by political machines?\nNow that her first year in the Legislature is behind her, the record is clear that Lopez has been a reliably liberal vote. She voted in favor of legislation backed by environmentalists, labor unions and abortion-rights groups. She introduced 13 bills, five of which were sent to Gov. Jerry Brown. He signed all but one.\nHer legislation wasn’t lofty. One Lopez bill requires landlords to allow tenants to hang clotheslines. She wanted to protect common laundry methods in her community; the legislature’s analysis said it would reduce climate change. Another bill requires child-care workers to be trained to report child abuse. A third conserves habitat for monarch butterflies – a species Lopez said immigrants view as symbolic of “a hope to a better life.”\nIn voting with her caucus and passing a few bills, Lopez did what she was supposed to do as a team player. But the evidence suggests the team won’t help with her re-election next year.\nLopez has reported $8,350 in donations for next year’s campaign – a paltry sum for any legislator, but especially one who is running against a serious opponent. She faces a re-match against Bocanegra, the former assemblyman she ousted, and he’s raised more than $365,000.\n“I respect my colleagues and the system that’s been in place but people get tired of (politicians) raising money for their campaigns,” Lopez said.\nLopez’s reports don’t list any donations from her colleagues in the Legislature – though she says she’s received two checks from fellow lawmakers that will be included in the next report. Bocanegra’s donors include six current and former legislators, including two former assembly speakers.\nOne of them, Sen. Bob Hertzberg – a Democrat whose district overlaps with Lopez’s – said her victory was “a complete fluke.” He believes Republicans voted for her because she campaigned alongside his Republican opponent, Ricardo Benitez, and that Democrats voted for her by mistake because her name came before Bocanegra’s on the ballot.\n“I talked to a tremendous number of people in the community,” Hertzberg said. “I heard the stories about those mistakes.”\nThe state’s political watchdog is investigating complaints that Lopez did not properly report her work history and campaign contributions. But the biggest question about Lopez’s longevity in the Legislature is whether she’ll get the endorsement of the California Democratic Party in February, allowing her caucus to spend big money on her campaign. She didn’t get it last time and doesn’t expect it this time.\nBocanegra has received the party endorsement in the past and feels like he’s “in a good spot” to get it again, said his campaign consultant Pat Dennis.\nIf that happens, “there may not be a precedent for what we’ll have to decide,” said Assemblyman Anthony Rendon (D-Lakewood), who will take over as speaker next year. “If the party rules preclude us from providing her with financial assistance, then we’d have to adhere to those.”\nSo why would the party not endorse an incumbent with a loyal voting record, especially when the number of Democratic women lawmakers is on the decline? Several factors are likely at play. Lopez ousted an incumbent with many friends in the Legislature. She was never active in party politics. She ran an unprofessional campaign with mismanaged financial reports and close proximity to a Republican.\n“It’s nice to have an outsider in Sacramento,” said Lea-Ann Tratten, political director for the Consumer Attorneys of California, one of the few interest groups that have donated to Lopez.\n“It’s refreshing. And frankly I think we need more of that. But that’s not how Sacramento works, it’s very much an insider game.”","url":"https://calmatters.org/articles/an-outsider-in-an-insider-game/"}
