{"authors":["Danny Gallagher For Mailonline"],"date_download":"2018-10-23 02:00:33","date_modify":"2018-10-23 02:00:33","date_publish":"2017-04-26 12:55:28","description":"Anthony Joshua and Wladimir Klitschko will do battle for a personalised 'super champion' belt when they go head to head at Wembley Stadium on Saturday.","filename":"data/vaneerConsumption/AnthonyJoshuavsWladimirKlitschkofightTheWBAbelt.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9F670500000578-0-image-a-41_1493206701725.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_boxing_article-4447484_Anthony-Joshua-vs-Wladimir-Klitschko-fight-WBA-belt_1540260033.html","title":"Anthony Joshua vs Wladimir Klitschko fight: The WBA belt","title_page":"Anthony Joshua vs Wladimir Klitschko fight: The WBA belt | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Anthony Joshua and Wladimir Klitschko will do battle for a personalised 'super champion' belt when they go head to head at Wembley Stadium on Saturday.\nThe two titans are set to do battle in their heavyweight unification clash in front of a British boxing record crowd attendance.\nAnd the victor will proudly hold aloft the WBA title bearing the engraved faces of both fighters, as a memento to mark the historic occasion.\nAnthony Joshua and Wladmir Klitschko will do battle for a personalised WBA title belt\nThe WBA have decided to mark the blockbuster showdown with the commemorative belt, depicting both men on opposing sides stood with arms folded in preparation for battle.\nThe belt shows off both heavyweight titans, with a bedazzled golden trim finished off with a glistening crown on top.\nJoshua's promoter Eddie Hearn and Klitschko's manager Bernd Boente had already made it clear in the build up to the fight how important the addition of the WBA title was in negotiations.\nThe belt features the engraved Anthony Joshua, stood arms folded ready for battle\nKlitschko features on the opposing side of what is a dazzling belt with added crown details\nBoth fighters were keen on holding two world titles, meaning the WBA honour played a pivotal role in securing the fight.\n'I wanted this fight to be a unification fight, multiple fights on the line, and we got all of those things,' Hearn told Sky Sports.\n'Once the approval came from the WBA, that was the final thing to get it over the line,' he added.\nThe personalised belt has been specially created by designer and fabricator of championship boxing belts Sartonk.\nRevealed by the WBA, the belt was billed as a 'super champion' and soon became an instant hit on social media with fans complementing the design and aesthetic.\nIt was also recently revealed by Sportsmail that Joshua will have the option of triggering an immediate rematch with Klitschko if he is beaten in their Wembley showdown - but the Ukrainian legend does not have the same clause.","url":"https://www.dailymail.co.uk/sport/boxing/article-4447484/Anthony-Joshua-vs-Wladimir-Klitschko-fight-WBA-belt.html"}
