{"authors":["Tom Farmery For Mailonline"],"date_download":"2018-10-23 02:47:07","date_modify":"2018-10-23 02:47:07","date_publish":"2017-04-29 19:30:55","description":"Anthony Joshua retained his IBF world heavyweight title for the third time at Wembley on Saturday when he beat Wladimir Klitschko. Relive the action with TOM FARMERY and JEFF POWELL.","filename":"data/vaneerConsumption/AnthonyJoshuavsWladimirKlitschkoLIVEFIGHTREACTION.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/29/23/3FC1514100000578-0-image-a-16_1493506175300.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_boxing_article-4458728_Anthony-Joshua-v-Wladimir-Klitschko-fight-LIVE-BOXING_1540262827.html","title":"Anthony Joshua vs Wladimir Klitschko LIVE FIGHT REACTION!","title_page":"Anthony Joshua vs Wladimir Klitschko LIVE FIGHT REACTION! | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"JEFF POWELL'S SCORECARD JOSHUA ROUND KLITSCHKO 10 1 9 10 2 9 10 3 9 9 4 10 10 5 8 8 6 10 9 7 10 9 8 10 10 9 10 9 10 10 94 TOTAL 95\nAnthony Joshua came back from a darkening place in Wembley Stadium into the dazzling light of heavyweight greatness as he ended the Klitschko heavyweight era.\nAlready the people's hero in this, his homeland the young British lion gained a whole new planet of admirers as he stopped the legendary Wladimir Klitschko in the 11th round of an epic world heavyweight title war.\nBoth these heavyweight giants went down from sledgehammer punchers in the first half of a brutal battle between two men steeped in mutual respect, Klitschko in the fifth round, Joshua hitting the deck even harder in the sixth.\nThen, just as the dream of adding the WBA world title to his IBF belt, appeared to be subsiding into fatigue under the fists of Klitschko's expertise, Joshua went for broke and seized stunning victory from the claws of the old champion's left jab and whiplash right.\nA right uppercut from hell halted Klitschko's clever approach to victory in the penultimate round. He rose but the 14-years younger man who had looked exhausted for some time took an energy charge from that success and dropped him again with vicious left hook.\nRead Jeff Powell's full report here.","url":"https://www.dailymail.co.uk/sport/boxing/article-4458728/Anthony-Joshua-v-Wladimir-Klitschko-fight-LIVE-BOXING.html"}
