{"authors":["Spencer Morgan For Mailonline"],"date_download":"2018-10-23 02:45:31","date_modify":"2018-10-23 02:45:31","date_publish":"2017-04-26 14:05:25","description":"Wladimir Klitschko has arrived in London ahead of his highly-anticipated heavyweight title fight with Anthony Joshua at Wembley Stadium on Saturday night.","filename":"data/vaneerConsumption/AnthonyJoshuanewsWaldimirKlitschkotouchesdown.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/14/3F9FBB5500000578-0-image-a-122_1493211724608.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_boxinglink_article-4447744_Anthony-Joshua-news-Waldimir-Klitschko-touches-down_1540262731.html","title":"Anthony Joshua news: Waldimir Klitschko touches down","title_page":"Anthony Joshua news: Waldimir Klitschko touches down | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Wladimir Klitschko has arrived in London ahead of his heavyweight title fight with Anthony Joshua on Saturday night.\nThe Ukranian was pictured stepping off a private jet at London's Biggin Hill Airport on Wednesday afternoon.\nThe two-time champion looked in good spirits as he waved to the cameras before making his way into the terminal.\nWladimir Klitschko steps off a private jet a London's Biggin Hill airport on Wednesday\nThe Ukranian and Anthony Joshua will take part in open workouts later in the day\nKlitschko looked in high spirits as he smiled and waved at the cameras on his way inside\nTeam Klitschko is on the finish line. My public workout today at 8:10 pm (GET) live here on Facebook, press conference tomorrow, weigh in on Friday and then it’s time to let my hands go. Fight live on http://bit.ly/2pRQgKs. #obsessed #JoshuaKlitschko A post shared by Wladimir Klitschko (@klitschko_official) on Apr 26, 2017 at 7:01am PDT\nKlitschko is aiming to become a three-time world heavyweight champion in his first return to the ring since losing his crown to Tyson Fury in November 2015.\nHe will step in the ring with undefeated Joshua in front of a British boxing record crowd attendance with the WBA and IBF belts on the line.\nAnd in what is another unique twist, it has been announced that the pair will being doing battle for a personalised 'super champion' belt.\nThe victor of the most highly-anticipated heavyweight bout in recent times will proudly hold aloft the WBA title bearing the engraved faces of both fighters, as a memento to mark the historic occasion.\nThe WBA have decided to mark the blockbuster showdown with the commemorative belt, depicting both men on opposing sides stood with arms folded in preparation for battle.\nThe belt shows off both heavyweight titans, with a bedazzled golden trim finished off with a glistening crown on top.","url":"https://www.dailymail.co.uk/sport/boxinglink/article-4447744/Anthony-Joshua-news-Waldimir-Klitschko-touches-down.html"}
