{"authors":["Eddie Hearn For The Daily Mail"],"date_download":"2018-10-22 23:36:10","date_modify":"2018-10-22 23:36:10","date_publish":"2017-04-26 08:09:23","description":"EDDIE HEARN WRITES EXCLUSIVELY FOR SPORTSMAIL: Here we go. The moment of truth. I can't lie – every morning since Monday I have been waking up with butterflies in my stomach about this.","filename":"data/vaneerConsumption/AnthonyJoshuaiscalmaheadofWladimirKlitschkofight.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/08/3F6C02D600000578-0-image-a-16_1493190532910.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_boxing_article-4446474_Anthony-Joshua-calm-ahead-Wladimir-Klitschko-fight_1540251370.html","title":"Anthony Joshua is calm ahead of Wladimir Klitschko fight","title_page":"Anthony Joshua is calm ahead of Wladimir Klitschko fight | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Here we go. The moment of truth. I can't lie – every morning since Monday I have been waking up with butterflies in my stomach about this one.\nEver since we signed Anthony Joshua and set off down this road, everything has been gearing towards this moment. We are just 18 fights in to this journey and this has come way before we expected but it's here and the whole country is poised for the biggest fight in our history.\nFrankly, who knows how it is going to go. It is such a big fight, such a massive occasion, there is no telling what is going to happen next. Is it too soon for Joshua? Is it a step too far for Wladimir? It's the kind of dilemma that great fights are made of.\nAnthony Joshua is in relaxed mood ahead of his huge fight with Wladimir Klitschko at Wembley\nIBF world heavyweight champion Joshua trains in Sheffield ahead of Saturday's blockbuster\nWhat I wonder about is the pressure. There is so much on Joshua's shoulders. Everyone is talking about this fight – it really is everywhere.\nI don't know if he is feeling it or not. He gives nothing away. Nothing. He is so calm, almost too calm. He is so calm that I get worried because it is almost inhuman to be that calm before such a massive fight. But then I don't worry too much because this guy is just different to other fighters.\nI was talking to him on FaceTime the other night while he was having a massage. We were talking for about half an hour and I just wanted to get a glimpse of whether he was feeling it. Nothing.\nHis preparation gives him the belief and he is completely in control of his mind. I do wonder if it will stay that way as the week progresses. I am certain in my own mind that Klitschko is going to try to rattle him. He has already tried to play mind games to an extent.\nKlitschko works with his trainer Johnathon Banks in Austria as he prepares for Saturday's fight\nKlitschko's team (L-R): David Williams – chef; Klitschko; Banks – head trainer; Aldo Vetere – physio; James Ali Bashir - assistant trainer\nI almost think, as well, that part of the respect talk from Klitschko has been a way to get inside Joshua's mind.\nThe last thing I want is Joshua to show too much respect in the ring, to be so respectful that he doesn't jump in there and try to take him out with a brutal knockout, because I do think that a fight on the back foot with a slower pace goes into Klitschko's hands.\nLike I said, I wonder if Klitschko is trying to build that respect further to try to determine the pace of the fight.\nMaybe he is, maybe he isn't. At the very least, I want Joshua to get at Klitschko in the first six rounds. I want to see it over in the first half of the fight.\nJoshua knocked out Eric Molina in his last fight at Manchester Arena in December 2016\nJoshua and Klitschko will go head-to-head in front of 90,000 fight fans at Wembley Stadium\nHe needs to do what he has done through his career to do that, which is to go in there, wait for the weakness and then pounce with all that aggression and go for the brutal KO. It is what he does best.\nIf it is a longer fight you have to wonder if that suits Klitschko. My gut instinct is that Klitschko will try to box Joshua like Tyson Fury boxed him. I think he will jab and counter punch and try to frustrate Joshua into mistakes over the course of a longer fight.\nIf he takes Joshua into the trenches, who knows what will happen.\nKlitschko could try to box like Tyson Fury, who took his heavyweight titles from him in 2015\nTony Bellew was interesting on the subject the other night. He was saying Joshua has a lot of big event experience but not a lot of big fight experience. He has been the star of the show, but he hasn't been cut, he hasn't been knocked down, he hasn't been to the late rounds of a fight. He has never faced a crisis in a professional fight.\nThese points are all relevant and we have to see how the chips fall. My hunch is that Joshua can get to him in the first half of the fight but it really is a 50-50.\nI think we are heading for a special night.\nThe undercard offers some great matches. Luke Campbell and Darleys Perez are fighting for the top spot in the WBA lightweight rankings and a likely shot at Jorge Linares.\nWe have seen from Linares' trips to the UK that he is a devastating talent, a real problem. But I really believe Luke's style can cause him problems. I look forward to finding out, but he faces his toughest fight to get there.\nLuke Campbell will take on Darleys Perez for the top spot in the WBA lightweight rankings\nWe also have the return of Katie Taylor against Nina Meinke for the WBA Inter-Continental lightweight title in a world title eliminator. Meinke is unbeaten and trained by the former world champion Sven Ottke. It's the first big test for Katie and I think you will see a high-level battle between the two.\nWe also have Joe Cordina, Lawrence Okolie and Josh Kelly on the card. There are eight Olympians on this card and these new additions really are the future of the game.\nKatie Taylor will continue her professional career against the unbeaten Nina Meinke\nOne fight I am really looking forward to is Scott Quigg against Viorel Simion. I've always loved working with Scott because of his incredible commitment to the sport.\nThat has extended to relocating to LA to work with Freddie Roach and his clash with Simion will be his first fight under the new arrangement.\nThey are fighting an eliminator for the IBF world featherweight title and with the uncertainty over mandatory Jonathan Barros, it's likely that the winner will get a shot at Lee Selby next.\nWe all want to see that.\nScott Quigg could earn a shot at Lee Selby if he defeats Viorel Simion on Saturday evening\nI just want to thank the UK fight fans for all the support. Saturday marks a special night for boxing with plenty riding on it.\nWithout your support of this great sport, nights like this just wouldn't be possible. Enjoy the show.","url":"https://www.dailymail.co.uk/sport/boxing/article-4446474/Anthony-Joshua-calm-ahead-Wladimir-Klitschko-fight.html"}
