{"authors":["Matt Maltfor Mailonline"],"date_download":"2018-10-23 02:17:30","date_modify":"2018-10-23 02:17:30","date_publish":"2017-04-26 13:17:33","description":"MATT MALTBY - INTERVIEW: Frank Bruno expects Anthony Joshua to forget about the razzmatazz and sold-out Wembley crowd in order to do the business on Wladimir Klitschko.","filename":"data/vaneerConsumption/AnthonyJoshuahasspeedpoweronsidesaysFrankBruno.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9EE8BA00000578-0-image-a-11_1493208963515.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_boxing_article-4439876_Anthony-Joshua-speed-power-says-Frank-Bruno_1540261050.html","title":"Anthony Joshua has speed & power on side, says Frank Bruno","title_page":"Anthony Joshua has speed & power on side, says Frank Bruno | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Frank Bruno expects Anthony Joshua to forget about the razzmatazz and sold-out Wembley crowd this Saturday in order to do the business on Wladimir Klitschko.\nJoshua's IBF heavyweight crown, as well as the vacant WBA and IBO titles, are up for grabs when the two meet in their highly-anticipated showdown this weekend.\nKlitschko, who went unbeaten for 11 years before losing to Tyson Fury in 2015, is expected to pose the biggest threat of Joshua's career, with the British favourite undefeated in 18 professional fights and yet to be truly tested in the ring.\nFrank Bruno, pictured with his son Franklin, is looking forward to Saturday's fight at Wembley\nBruno has teamed up with TalkTalkTV to teach the nation how to 'goggle box' from their sofas\nDespite all the pressure being on Joshua, who will fight in front of a 90,000 sell-out crowd, Bruno — the legendary British heavyweight boxer who once held the WBC belt — says Joshua has all the ingredients to retain his 100 per cent record.\nSpeaking to Sportsmail, he said: 'Joshua has youth, strength, speed and power on his side — and only time will tell.\n'This Saturday you will see if Klitschko has still got it to mess him [Joshua] around, trick him and make the fight to his pace.\n'It's a massive crowd, of course, but Joshua isn't fighting the crowd, he is fighting Klitschko.\n'So when the bell goes there will be one person in front of him. He'll be nervous, obviously, and the adrenaline will be pumping.\n'But once the bell goes, and all the razzmatazz and the national anthems are done with, it's just a boxing ring you know.'\nJoshua vs Klitschko has been billed as a 90,000 sell-out at Wembley Stadium this weekend\nJoshua easily overcame Eric Molina in his last bout to retain his unbeaten professional record\nBruno knows what it takes to fight at Wembley, having fought twice at the old venue during his 45-fight career which came to an end when Mike Tyson took the WBC belt off him in Las Vegas over 21 years ago.\nHe famously became heavyweight champion of the world, at a fourth attempt, one fight before his retirement when he defeated Oliver McCall at the iconic stadium.\nJoshua defends his IBF title and hopes to win the WBA belt recently head by Tyson Fury\nThe British boxer has been working hard in the gym as he prepares for this London bout\nBRUNO TEAMS UP WITH TALKTALK TV Ahead of Joshua vs Klitschko, Bruno has been recruited by TalkTalk TV to teach the nation a new type of boxing. The former WBC and European heavyweight champion is joined by his son Franklin in a new tutorial video to teach the nation how to 'goggle box' when they watch the biggest fight in recent memory from a different corner – their armchairs. Frank's tips include: · Don't hide your passion – 'If you're watching the fight you'll get emotionally involve – unless you're boring and don't have any feelings' · Pick a corner – 'Sports can get very personal. For this fight, Anthony Joshua has a very good chance, he's got youth on his side' · Cool down with your favourite TV shows – ' I like watching a little bit of the Great British Bake Off, sometimes it gives you ideas for you being in the kitchen'\nAnd the Hammersmith-born former fighter is no doubt that Joshua, 27, can achieve similar success this weekend — though he expects his 41-year-old Ukrainian rival to be no pushover.\nBruno added: 'I think youth will overcome age. He may have a couple of rocky patches here and there.\n'Klitschko knows him, he knows Klitschko — they've sparred together.\n'Experience is what he [Klitschko] has got and if he can bring that into the ring to nullify the inexperience of Joshua you never know what may happen.\n'But I can't see it. It will be a test for him [Klitschko].\nHe's 41 but he's a very fit 41-year-old, and a very intelligent man who will be on his game as well.\n'He won't want to go out and mug himself off, he probably hasn't got too many fights left — so he might put in a good performance and give Joshua the test he needs.'\nAnd a test is what the majority of the boxing fraternity are hoping for this weekend.\nBruno became heavyweight champion of the world when he beat Oliver McCall at Wembley\nBruno parades his WBC belt won after an epic battle with McCall at famous stadium in 1995\nApart from in the early rounds of his had-fought win over rival Dillian Whyte, Joshua has come through his bouts relatively unscathed.\nAnd Bruno, who went 21 fights unbeaten before his first loss, suggested perhaps a defeat could be on the horizon for the Watford-born bruiser.\nHe added: 'Sometimes in life you have to get a defeat, you can't always win. His career has been successful so far but sometimes if you lose, you lose.\n'You have to dust yourself down and go back to the drawing board, go back in the gym, work hard not to get another defeat.'\nJoshua's only test in professional career came against Dillian Whyte — but he still secured win\nKlitschko went unbeaten for 11 years before falling to a shock defeat by Fury in 2015\nTo celebrate the fact that TalkTalk TV customers can enjoy the Anthony Joshua vs Wladimir Klitschko fight for Britain's lowest price of just £17.95, Frank Bruno has been recruited to teach the nation a new type of boxing: goggle boxing.","url":"https://www.dailymail.co.uk/sport/boxing/article-4439876/Anthony-Joshua-speed-power-says-Frank-Bruno.html"}
