{"authors":["Rohan Banerjee For Mailonline"],"date_download":"2018-10-23 01:02:33","date_modify":"2018-10-23 01:02:33","date_publish":"2016-01-28 15:15:23","description":"Heavyweight boxing's rising star Anthony Joshua took time out of his busy training schedule with a cheeky trip to Nando's and shared a picture of his sizable meal with followers of his Instagram account.","filename":"data/vaneerConsumption/AnthonyJoshuastopsoffforcheekyNandosmealasheavyweighttakessometimeoff.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AC529800000578-0-image-a-64_1453999860042.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_boxing_article-3421084_Anthony-Joshua-stops-cheeky-Nando-s-meal-heavyweight-star-takes-time-busy-training-schedule_1540256553.html","title":"Anthony Joshua stops off for cheeky Nando's meal as heavyweight takes some time off","title_page":"Anthony Joshua stops off for cheeky Nando's meal as heavyweight takes some time off | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He has won all 15 of his professional bouts so far by knockout\nJoshua could soon be in line for an IBF world title shot\nThe heavyweight boxer ordered half a chicken and five sides\nHeavyweight boxing's rising star Anthony Joshua took time out of his busy training schedule with a cheeky trip to Nando's and shared a picture of his sizable meal with followers of his Instagram account.\nThe 26-year-old, who has won all 15 of his professional bouts so far by knockout, had clearly been working up a sweat and captioned the snap: 'First session down and need a refuel #StayHungry.'\nJoshua ordered half a chicken with five sides - two portions of salad - one mixed leaf and one quinoa- as well as three bowls of creamy potato mash.\nHeavyweight boxer Anthony Joshua tucks into a meal at Nando's while taking a break from training\nRising star Joshua, 26, has won all 15 of his professional fights so far by knockout\nBut he'll have no problem burning it off as he follows the strict training regime of a fighter.\nJoshua has swiftly risen through the heavyweight rankings and could soon secure a shot at the IBF world title belt which is currently being held by Charles Martin.\nTyson Fury was stripped of the title within days of beating Wladimir Klitschko in November as he was unable to face his mandatory challenger due to a rematch clause with the Ukrainian.\nJOSHUA'S HEAVYWEIGHT MEAL: (Individual prices) Half a chicken - £7.10 Mixed Leaf salad - £4.25 Quinoa salad - £6.95 Creamy potato mash - £4.25 (With meal deal) Half a chicken + 2 reg sides - £10.10 + extra sides - £15.45 Total - £25.55\nSubsequently, Martin faced Vyacheslav Glazkov earlier this month, winning the crown when his opponent suffered a serious knee injury in the third round.\nThat result will see Erkan Teper and Joshua installed as the highest ranked challengers but the former is serving a drugs ban until the summer of 2017.\nJoshua's promoter Eddie Hearn is still finalising plans for Joshua's first scheduled fight of the year at London's O2 Arena in April.\nHearn told Sky Sports: 'We have opportunities everywhere and a list of fighters calling AJ out longer than my arm. Stay tuned for next week's announcement.'\nAmong the list of possible opponents for Joshua are fellow Brit Dereck Chisora and New Zealand's Joseph Parker.\nJoshua lands a punch on Dillian Whyte (left) during their Commonwealth heavyweight title bout","url":"https://www.dailymail.co.uk/sport/boxing/article-3421084/Anthony-Joshua-stops-cheeky-Nando-s-meal-heavyweight-star-takes-time-busy-training-schedule.html"}
