{"authors":["Matthew Smith For Mailonline"],"date_download":"2018-10-23 00:47:02","date_modify":"2018-10-23 00:47:02","date_publish":"2017-03-16 10:15:50","description":"The countdown has begun in earnest ahead of the biggest fight of Anthony Joshua's professional career, and he is preparing by any means necessary, including needles in his side.","filename":"data/vaneerConsumption/AnthonyJoshuavWladimirKlitschkoBritgetsacupuncture.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E53474D00000578-0-image-a-24_1489658979209.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_boxing_article-4319446_Anthony-Joshua-v-Wladimir-Klitschko-Brit-gets-acupuncture_1540255622.html","title":"Anthony Joshua v Wladimir Klitschko: Brit gets acupuncture","title_page":"Anthony Joshua v Wladimir Klitschko: Brit gets acupuncture | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The countdown has begun in earnest ahead of the biggest fight of Anthony Joshua's professional career and he is preparing by any means necessary.\nThe Watford-born heavyweight posted a video to social media of him undergoing acupuncture treatment as he trains to fight Wladimir Klitschko.\nIt is not the first time the boxer has undergone the treatment - he previously revealed, before fighting Eric Molina in his last bout, that he had 950 needles inserted into his body.\nScroll down for video\nBoxer Anthony Joshua posted a video of himself getting acupuncture as part of training\nJoshua is preparing for a heavyweight clash with Wladimir Klischko on April 29\nKlitschko paid tribute to his physio, Rob Madden, for giving him the treatment\nWHAT EXACTLY IS ACUPUNCTURE? According to the NHS website, acupuncture - derived from ancient Chinese medicine - involves fine needles inserted in certain places in the body for 'therapeutic purposes'. The needles stimulate sensory nerves under the skin and in the muscles, producing pain-relieving endorphins. Acupuncture is used to relieve headaches and joint pain.\nThe 24-year-old said at the time: 'It was 98 days in camp, 392 organic meals, 28 physio sessions, 210 protein shakes, 42 strength sessions and 98 fish oils. I had acupuncture, that is 950 needles in my body.\n'There were 660 rounds of sparring and 210 miles of running. I weigh 249lb. That's the biggest and strongest I've been, and I will do it until my body cannot physically do it.'\nJoshua gave a shout out to his physio, Rob Madden, in the video, which sees Madden inserting the needles into the fighter's side.\nHe captioned the video: 'Still up working, thanks to @robmaddenpt for putting up with me. Real G.'\nJoshua will make the third defence of his IBF heavyweight belt on April 29 in front of 90,000 people at Wembley stadium.","url":"https://www.dailymail.co.uk/sport/boxing/article-4319446/Anthony-Joshua-v-Wladimir-Klitschko-Brit-gets-acupuncture.html"}
