{"authors":["William Bigelow"],"date_download":"2018-10-30 20:52:36","date_modify":"2018-10-30 20:52:36","date_publish":"2014-07-09 13:24:00","description":"In San Francisco on Tuesday, 300 anti-Israel protesters allegedly threatened 30 peaceful, pro-Israel demonstrators, and called a third intifada and the destruction of the Jewish State.","filename":"data/vaneerConsumption/AntiIsraelProtestersThreatenProIsraelDemonstratorsinSF.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-California/2014/07/09/Protest-Youtube.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2014_07_09__1540932756.html","title":"Anti-Israel Protesters Threaten Pro-Israel Demonstrators in SF","title_page":"Anti-Israel Protesters Threaten Pro-Israel Demonstrators in SF | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In San Francisco on Tuesday, 300 anti-Israel protesters allegedly threatened 30 peaceful, pro-Israel demonstrators, and called a third intifada and the destruction of the Jewish State.\nOne female protester screamed at the Jews videoing the event, “Take a picture. Take a fucking poster picture. You see us? You see all of us? There’s fucking ten of you. How many are there of all of us?…Take it, bitch. Take it…”\nOne of the pro-Israel demonstrators asked a police officer, “Officer, these guys are openly threatening us. You’re not going to say anything about it?”\nThe young woman leading the demonstration led the crowd in screaming, “Free, free Palestine,” “Long live Palestine,” and “Long live the intifada,” referring to the prior waves of Arab violence that occurred in 1987-1990 and 2000-2005.\nThe 1987 intifada was supposedly triggered by a car accident in Gaza in which four Palestinian laborers were killed in a collision with an Israeli truck. In the Palestinian community, rumors started that the deaths were intentional and in revenge for the stabbing of Shlomo Sakal two days earlier in Gaza’s central market.\nThe second intifada was supposedly triggered by opposition leader Ariel Sharon’s visit to the Temple Mount, where the ancient Jewish Temple stood, and soon turned into a series of horrific suicide bombings against Israel. There has been evidence released since then that Yasser Arafat had planned the third intifada before Sharon’s visit, however.","url":"https://www.breitbart.com/local/2014/07/09/Anti-Israel-Protesters-Threaten-Jews-in-SF/"}
