{"authors":[],"date_download":"2018-10-22 23:04:09","date_modify":"2018-10-22 23:04:09","date_publish":"2014-05-13 15:49:49","description":"The “ADL Global 100” report released Tuesday offers a glimpse of the anti-Semitic attitudes that exist across the planet.","filename":"data/vaneerConsumption/AntiSemitismInfectsOneinFourPeopleGlobalSurveyFinds.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_20/439411/140513-auschwitz-1337_926399b6ddff1a704d82abb8e4834b69.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_religion_anti-semitism-infects-one-four-people-global-survey-finds-n104271_1540249449.html","title":"Anti-Semitism 'Infects' One in Four People, Global Survey Finds","title_page":"Anti-Semitism 'Infects' One in Four People, Global Survey Finds","title_rss":"NULL","source_domain":"nbcnews.com","text":"Researchers said they wanted to test perceptions and stereotypes of Jews and see to what extent the negative attitudes persist globally. Respondents were asked whether they agree with 11 such stereotypes, including that Jews have too much power in the business world; Jews think they’re better than other groups; Jews only care about their own kind; and Jews talk too much about the Holocaust.\n“Nearly 70 years after the end of World War II, awareness of the Holocaust is alarmingly low in many parts of the world,” according to the report. Among other findings:\n• Just 38 percent of those who live in the Middle East/North Africa region say they've heard of the Holocaust, and of that number, 63 percent don’t believe it actually happened or think it was exaggerated — the highest concentration in the world.\n• Nine percent of Americans surveyed harbor at least six of the 11 anti-Semitic views. About 31 percent of respondents believe Jews “are more loyal to Israel” than the U.S.\n•The area with the most pervasive anti-Jewish sentiment is the West Bank and Gaza at 93 percent; Laos in Southeast Asia has the lowest number, at 0.2 percent.\n“We can now identify hotspots, as well as countries and regions of the world where hatred of Jews is essentially nonexistent,” said Abraham Foxman, national director of the Anti-Defamation League.\nThe survey’s margin of error was 4.4 percent for most countries and 3.2 percent for the larger countries.\n— Erik Ortiz","url":"https://www.nbcnews.com/news/religion/anti-semitism-infects-one-four-people-global-survey-finds-n104271"}
