{"authors":["Nuzha Nuseibeh"],"date_download":"2018-10-30 23:04:45","date_modify":"2018-10-30 23:04:45","date_publish":"2014-08-14 12:25:26","description":"If you've ever heard of Texas Values, you'll know some of what the organization stands for: \"religious liberty,\" \"marriage and family,\" \"life.\" In other words, it is vehemently opposed to choice, gay marriage and the LGBT community in general. Its…","filename":"data/vaneerConsumption/AntiGayActivistJonathanSaenzsWifeLeftHimForAWomanBecauseIrony.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/d23ebc4b-058f-4ee5-8030-51761678e40d.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35734-anti-gay-activist-jonathan-saenzs-wife-left-him-for-a-woman-because-irony_1540940685.html","title":"Anti-Gay Activist Jonathan Saenz's Wife Left Him For A Woman, Because Irony","title_page":"Anti-Gay Activist Jonathan Saenz's Wife Left Him For A Woman, Because Irony","title_rss":"NULL","source_domain":"bustle.com","text":"If you've ever heard of Texas Values, you'll know some of what the organization stands for: \"religious liberty,\" \"marriage and family,\" \"life.\" In other words, it is vehemently opposed to choice, gay marriage and the LGBT community in general. Its president, Jonathan Saenz, has made a name for himself fighting marriage equality and non-discrimination laws (as well as evolution, apparently). It turns out, though, that it likely all comes down to an old story of love and betrayal: Saenz's wife left him for another woman.\nYou might have previously come across Saenz, perhaps vocally supporting Arizona's SB 1062 (the law that legalized LGBT discrimination on the basis of religious freedom), or touting the merits of gay conversion therapy. Or maybe you've seen him dismissing evolution as nothing more than \"left-wing ideology\" or spouting that old homophobic myth: Gay marriage will lead to \"polygamy and polyandry.\" In short, you'd know him as your basic, right-wing, gay-hating, pro-life activist.\nExcept, maybe not. Maybe it's not just standard homophobia. Maybe all this hatred comes from somewhere personal, a deep hurt or sense of betrayal. According to the Lone Star Q, court documents reveal that Saenz's then-wife served him with divorce papers as far back as 2011, six months before he took on the role of Texas Values president. She'd left him for another woman, it turns out, a teacher who worked at the same school that she did.\nSaenz did not take the news well. According to the Huffington Post, first, the anti-gay activist demanded that the court refuse to grant the divorce. He then asked that his wife undergo a psych evaluation (he'd get to choose the psychologist, of course). When she refused, he demanded that she face the consequences: jail, or at the very least, a fine. He tried to make sure that his wife's alleged girlfriend — Ercimin Paredes — was barred from seeing or being around his kids. It didn't work, ultimately.\nTexas Values on YouTube\n\"My heart breaks for you if you are currently choosing to live a sinful sexual lifestyle while also trying to convince others that it is also okay to live a sinful lifestyle without making any efforts to change or resist sin and temptation. You can make a decision today to 'go and sin no more.' It's not too late. It's never too late,\" Saenz said previously.\nYou've got to wonder: Who exactly is he talking to, there?","url":"https://www.bustle.com/articles/35734-anti-gay-activist-jonathan-saenzs-wife-left-him-for-a-woman-because-irony"}
