{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 21:10:46","date_modify":"2018-10-30 21:10:46","date_publish":"2015-03-07 16:58:39","description":"Anti-Israel culture is blamed for anti-Semitism at UCLA, as Rachel Beyda was rejected by members of the student council allegedly for her faith.","filename":"data/vaneerConsumption/AntiIsraelCultureatUCLABlamedforAntiSemitism.json","image_url":"https://media.breitbart.com/media/2015/03/Rachel_Beyda-Youtube.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_03_07__1540933846.html","title":"Anti-Israel Culture at UCLA Blamed for Anti-Semitism","title_page":"Anti-Israel Culture at UCLA Blamed for Anti-Semitism | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A recent meeting at UCLA to nominate a Jewish sophomore to the student council’s Judicial Board, is the latest incident to shine a light on a culture of apparent antisemitism at UCLA. Staunch anti-Israel rhetoric has pervaded the University of California school system for sometime.\nBefore Rachel Beyda was accepted unanimously to serve on the board, she was rejected by four of 14 members, allegedly based solely on her religious affiliation: Judaism.\n“The overall culture of targeting Israel led to targeting Jewish students,” Natalie Charney, student president of the UCLA chapter of Hillel, said to The New York Times. The issue stemmed from a question Fabienne Roth, a member of the Undergraduate Students Association Council, asked during Beyda’s confirmation hearing.\n“Given that you are a Jewish student and very active in the Jewish community, how do you see yourself being able to maintain an unbiased view?” asked Fabienne Roth, according to the Times. Beyda’s incident arrives on the heels of a vote at UCLA, which sought to divest the UC school system from American companies that do business with Israel–in what is better known as BDS (Boycott, Divestment, Sanctions). The resolution also called for divestment from the United States of America.\nFollowing Roth’s question, Beyda was sent out of the room as a 40-minute discussion and debate ensued about whether her faith and affiliation with Jewish organizations, including her sorority and involvement with Hillel, would translate into bias from her when dealing with sensitive issues on the board. A faculty member ultimately determined that her religious affiliation was not a conflict of interest, but not before it exposed to the entire campus of 29,600 students how poorly Jews have been treated over the past few years, which has been exasperated as of late.\nIn an email to the Times on Thursday, Roth apologized profusely for the manner in which Beyda and her fellow council members were treated: “I have already apologized profusely for what happened during our council meeting and I deeply regret how I phrased my questions to Rachel,” she said.\nBut the incident gave a voice to a situation which has pervaded the UC school system for years. “We don’t like to wave the flag of anti-Semitism, but this is different. This is bigotry. This is discriminating against someone because of their identity,” Rabbi Aaron Lerner, the incoming executive director of the Hillel chapter at UCLA told the Times about the situation regarding Beyda’s confirmation.\nBeyda’s roommate Rachel Frenklak told the Times that the incident had nothing to do with Israel and was staunchly anti-Semitic in nature, that her roommate was targeted strictly because she is Jewish, and that “there has to be recognition that there is anti-Semitism on the campus, and it manifested itself first with the anti-Israel stuff.”\nAs for Ms. Beyda, she opted to keep her voice neutral regarding the perceived anti-Semitism geared towards her. When asked by the Times for a response to the incident, she had this to say: “As a member of the Judicial Board, I do not feel it is appropriate for me to comment on the actions of UCLA’s elected student government.”\nFollow Adelle Nazarian on Twitter @AdelleNaz.","url":"https://www.breitbart.com/local/2015/03/07/anti-israel-culture-at-ucla-blamed-for-anti-semitism/"}
