{"authors":["Carrie Kahn"],"date_download":"2018-10-23 05:46:53","date_modify":"2018-10-23 05:46:53","date_publish":"2017-04-01 00:00:00","description":"Activists outfitted a subway seat with a nude male torso with prominent genitalia. They videotaped men's offended reactions, and hope to make them more sensitive to the many women who are accosted.","filename":"data/vaneerConsumption/AntiHarassmentCampaignStartlesMexicoCitySubwayRiders.json","image_url":"https://media.npr.org/assets/img/2017/03/31/experimento-asiento-still_wide-33dba07c938201fcae4d79403c2386286624c869.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2017_04_01_521863660_anti-harassment-campaign-startles-mexico-city-subway-riders_1540273613.html","title":"Anti-Harassment Campaign Startles Mexico City Subway Riders","title_page":"Subway Harassment: Mexico Activists Hope Explicit Seat Educates Men : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Anti-Harassment Campaign Startles Mexico City Subway Riders\nEnlarge this image toggle caption Mitsumasa Kiido/Screenshot by NPR Mitsumasa Kiido/Screenshot by NPR\nActivists in Mexico are taking aim at male riders of the capital city's packed public transit system. They are hoping that a new, provocative campaign that includes a good dose of shock and shame will change men's behavior toward female transit customers.\nActivists outfitted a subway car with nude male torso on a single seat back and prominent genitalia where riders would sit. Above the unusual bench a sign reads \"for men only.\" They recorded men's startled reactions, especially after sitting down; the online video has more than 800 million hits to date. Be aware, this video contains a subway seat that you may find offensive.\nMitsumasa Kiido via YouTube\nIn a national survey conducted last year, 9 out of 10 women said they had felt unsafe riding the country's public transportation. In Mexico City, seven out of 10 female passengers responded in a recent survey that they had been harassed on buses and subways.\nMexican officials and a United Nation's women's group teamed up for the provocative public awareness effort. Yeliz Osman, a program coordinator with Mexico's UN Women's office told the New York Times, \"We wanted to target men because on a global level, the majority of programs talking about sexual violence or sexual harassment always target women and girls. We wanted to change that because we don't think that women are the problem.\"\nIn fact, a city campaign last year sparked much criticism and derision from activists after authorities handed out whistles for women to blow when accosted. Many complained that campaign put more burden on female victims than on male perpetrators.\nThis time around activists hope men get the message.\nTo drive the point home, they placed a plaque on the floor in front of the anatomically explicit seat, which read, \"It's uncomfortable to sit here but not as uncomfortable as the sexual violence women suffer every day in their commute.\"","url":"https://www.npr.org/sections/thetwo-way/2017/04/01/521863660/anti-harassment-campaign-startles-mexico-city-subway-riders"}
