{"authors":[],"date_download":"2018-10-30 01:10:07","date_modify":"2018-10-30 01:10:07","date_publish":"2018-06-22 00:05:17","description":null,"filename":"data/vaneerConsumption/AntifaDoxxes1600ICEAgents.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/06/1024px-Antinazi-antifa-graffiti.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861807.html","title":"Antifa Doxxes 1,600 ICE Agents","title_page":"Antifa Doxxes 1,600 ICE AgentsThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The hyper-violent left-wingers of Antifa are now targeting employees of U.S. Customs and Immigration Enforcement (ICE) by publishing their personal information online as part of their escalating war against the Trump administration.\nThis invasion of privacy took place as about a dozen Antifa allies from the neo-communist group Democratic Socialists of America (DSA) harassed Department of Homeland Security (DHS) Secretary Kirstjen Nielsen into abandoning her dinner Tuesday evening at Washington’s MXDC Cocina Mexicana restaurant, the Washington Post reports. The disrupters shouted “shame!” and “end family separation!” at Nielsen, who left the eatery without acknowledging the demonstrators. DHS is ICE’s parent agency.\nAntifa are the self-styled anti-fascists who embrace fascist tactics and have regained prominence in the post-Obama era for assaulting conservatives and members of the so-called alt-right. These modern-day domestic terrorists trace their roots back to Nazi Germany where they opposed the Sturmabteilung (SA), or Nazi storm troopers, but copied their tactics, using their fists to shut down political opponents and break up meetings and rallies. The anarchists and communists of the Antifa movement are notorious for promiscuously labeling those they target as “fascists,” Nazis, and racists.\nThe odious Antifa-embraced practice of maliciously putting personal information on the Internet is called “doxxing.”\nDoxxing is making public a person’s private information such as a home address, place of employment, date of birth and schools, telephone number, or Social Security Number online for the world to see. It can be considered an act of terrorism because the objective is not merely to shame the doxxing victim but also to intimidate. It is an open invitation to left-wingers to harass and physically target the doxxing victim.\nOn June 19, the Twitter account for Anti-Fascist Action Nebraska (@antifa_ne) published a tweet that listed the names of close to 1,600 ICE agents as well as other personal information. “Some enterprising hero archived the ICE employees listed on linkedin,” the tweet stated.\nAccording to a Daily Caller report, a Twitter user known as Sam Lavigne put together the list of the ICE agents’ identities, titles, and locations. He tweeted that he “scraped LinkedIn for people that work for ICE.”\nLavigne also tweeted a photo of ICE Chief Technology Officer David Larrimore enjoying Father’s Day. “Nothing wrong with doxxing people who operate concentration camps[,]” Pierce Nichols (@nocleverhandle) commented on Twitter.\nLavigne is an academic. An online bio statesthat he “is currently an Adjunct Professor at ITP/NYU, The New School, and the School for Poetic Computation, a 2016/2017 Magic Grant fellow at the Brown Institute at Columbia University, and is Special Projects editor at the New Inquiry Magazine.” Lavigne said he launched his database of ICE officers to protest what he called ICE’s “inhumane” efforts at the border.\n“As ICE continues to ramp up its inhumane surveillance and detention efforts, I believe it’s important to document what’s happening, and by whom, in any way we can.”\n“I’ve downloaded and made available the profiles of (almost) everyone on LinkedIn who works for ICE, 1,595 people in total. While I don’t have a precise idea of what should be done with this data set, I leave it here with the hope that researchers, journalists, and activists will find it useful,” Lavigne wrote in a post on Medium.\nAs the Daily Caller reported:\nThe Medium post spread to r/ChapoTrapHouse on Reddit, a subgroup for a podcast made up of far-left activists who encourage doxxing those who they deem Nazis and alt-right. Some users appear to consider ICE and National Security Agency employees Nazis. One reddit user said “Dox more Nazis” on the thread. […] “Doxxing ICE agents is good and moral,” another user wrote on the Reddit post. Lavigne also tweeted a screenshot of the personal Twitter account of ICE’s chief technology officer the day after Father’s Day, which included a picture of the official with his son.\nDoxxing has been a tool of the Left for years.\nElon University computer science professor Megan Squire doxxes those associated with groups the Antifa movement deems enemies. Squire does not appear to have been involved in this doxxing action against ICE, but she seems quite comfortable with Antifa’s use of violence against targets.\n“They were a level of mad about racism and fascism that I was glad to see,” she told Wired after she first learned about Antifa “They were definitely not quiet rainbow peace people.”\nAntifa activists have used their own bodies to obstruct immigration law enforcement. In February about 70 activists surrounded an ICE van that was attempting to enter the Metropolitan Detention Center in Los Angeles. The anarchists chanted “no more deportations,” “Trump and Pence must go,” “f–k ICE,” as well as slogans in the Spanish language.\nAs The American Spectator previously reported, left-wingers are using smartphone apps to sabotage immigration enforcement.\nUnited We Dream, a nonprofit funded by America-hating gazillionaire George Soros through his Open Society Foundations (OSF), sponsors the Notifica app. The app helps illegal aliens to continue violating America’s immigration laws.\nPromotional material states, “Notifica can help you prepare for an encounter with ICE or police officers and quickly inform your network if you worry you may be detained.” Notifica can also blast out mass-alerts about law enforcement activity to help illegal aliens remain at large.\nGive it a few weeks. Innovative Antifa activists are bound to come up with new ways to use technology to undermine the rule of law.\nMatthew Vadum is senior vice president at Capital Research Center, an investigative think tank in Washington, D.C.","url":"https://spectator.org/antifa-doxxes-1600-ice-agents/"}
