{"authors":["Australian Associated Press"],"date_download":"2018-10-23 05:50:53","date_modify":"2018-10-23 05:50:53","date_publish":"2017-04-26 17:07:21","description":"An anti-Islam extremist accused of plotting Melbourne bomb attacks has won an appeal against a separate conviction. Phillip Galea however will remain in custody.","filename":"data/vaneerConsumption/AntiIslamextremistaccusedofterrorplotstillremanded.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/17/3FA0BDEB00000578-0-image-a-60_1493222529130.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448318_Anti-Islam-extremist-accused-terror-plot-remanded_1540273853.html","title":"Anti-Islam extremist accused of terror plot still remanded","title_page":"Anti-Islam extremist accused of terror plot still remanded | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An anti-Islam extremist accused of plotting Melbourne bomb attacks has won an appeal against a separate conviction.\nProsecutors did not fight the appeal by Phillip Michael Galea, 32, in the Victorian County Court on Wednesday over his June 2016 breach of bail conviction.\nIn a quick hearing, the charge was set aside by Judge Mark Taft.\nGalea left the dock with a wide grin, but he remains in custody.\nPhillip Michael Galea remains in custody despite winning an appeal against a separate conviction\nThe right-wing crusader is on remand charged with collecting or making documents to prepare for terrorist acts between November 2015 and early August 2016.\nGalea is also charged with doing acts in preparation for a terrorist act between September 2015 and early August 2016.\nHe will reappear in the Melbourne Magistrates' Court sitting in the County Court on those charges on Friday.\nInvestigators have told previous court hearings Galea has been linked to extremist groups Reclaim Australia, United Patriots Front, Patriots Defence League Australia, the True Blue Crew and also a 'neo-Nazi, self-confessed militant group' called Combat 18.","url":"https://www.dailymail.co.uk/news/article-4448318/Anti-Islam-extremist-accused-terror-plot-remanded.html"}
