{"authors":["Clemence Michallon For Dailymail.Com"],"date_download":"2018-10-23 03:28:20","date_modify":"2018-10-23 03:28:20","date_publish":"2017-04-26 14:53:18","description":"The Anti-Agency, which began four years ago in the UK, has launched its New York branch, eager to represent personalities deemed to strong for the roster of a classic modeling company.","filename":"data/vaneerConsumption/AntifashionmodelagencylaunchesinNewYork.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/25/21/3F98DF0500000578-0-image-a-76_1493153374739.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4441734_Anti-fashion-model-agency-launches-New-York_1540265300.html","title":"'Anti'-fashion model agency launches in New York","title_page":"'Anti'-fashion model agency launches in New York | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A New York City modeling agency is defying fashion stereotypes, one arresting beauty at a time.\nThe Anti-Agency, which began four years ago in the UK, has launched its New York City branch, eager to represent personalities deemed to strong for the roster of a classic modeling company.\nOn its catalog of models are gender-bending fashion fans, a punk musician, and a member of one of New York City's best-known all-female skating crew The Skate Kitchen.\nDifferent: The Anti-Agency, which has launched its New York City branch, is eager to represent strong personality - such as Kabrina from skating crew The Skate Kitchen\nCasting: The agency doesn't impose restrictions on model's appearances and focuses on their personalities. Pictured is social media maven and body-confident ambassador Chloe, 16\nBrains: Ariel, who plays in a punk band, studies French at the Sorbonne college in Paris, dreams of starting her own anarchist zine, and has a non gender-conformist fashion style\nFounders Lucy Greene and Pandora Lennard started the Anti-Agency to give a chance to potential models who didn't fit traditional agencies' strict criteria - or were reluctant to enter the fashion industry through a mainstream house.\n'We were working in the industry and knew several girls who were unique and gorgeous creatives,' Greene told the DailyMail.com.\n'They didn't want to join conventional model agencies for various reasons… either because they didn't want to be pigeon holed as models and subsequently not taken seriously in their creative careers or because they were far too big flamboyant characters to be told what to do or how to be in terms of weight, hair, clothes etc.'\nWith a fascination for 'diverse, smart and outspoken' characters, Greene and Lennard assembled twenty models and created an agency to represent them.\n'We felt it was important for these talents to be used in campaigns and become positive role models - people of substance!' Greene added.\nStory: As part of its roster, the Ant-Agency has recruited Tierra, an avid poet and the founder of a zine dedicated to gender queer, intersectional and transgender artists\nHistory: Four years ago, the Anti-Agency began in the UK, and it is now recruiting talents on the other side of the Atlantic, such as LA-based music video director Autumn\nBusy: Many of the agency's models also have other activities on the side, such as Alvina, a fashion student who also works as a jewelry designer\nThe agency, which describes itself as the 'enfant terrible of street casting', looks for character in its recruits - and insists on not putting any restrictions on their physical appearances.\n'Most agencies have very strict requirements for models,' Lennard said. 'These are usually height and weight restrictions and restrictions put on models in terms of what they are allowed to wear, change in their appearance or express on their social networks. Our casting is more about breaking the mold and celebrating people for who they are instead of trying to fit them into pre-existing standard.'\nMost people on the Anti-Agency's rosters have another job in addition to their modeling duties, and took on this new function to help their careers and support themselves financially as they develop.\n'For us the best people are the ones we find at exhibitions, gigs, shops we love- they’re the person in the room you can’t take your eyes off and want to know more about,' Lennard said.\n'We do use social media to cast some people but we’re not fans of being famous for nothing. There has to be substance there and if that’s expressed online then great.'\nTalented: Mecca, one of the personalities represented by the Anti-Agency, studied at The Alvin Ailey school of dance and walked for Kanye West's Yeezy Season 4\nCareer: Stylist Shawn has worked with Oliver Rizzo and Hedie Slimane and her professional path has taken her on the other side of the lens as well\nActivist: Humanitarian Indira is currently majoring in Psychology and literature, and has also recently started her own environmental organisation\nAs part of its roster, the Ant-Agency has recruited Tierra, an avid poet and the founder of a zine dedicated to gender queer, intersectional and transgender artists.\nAlso included is Kabrina, a member of The Skate Kitchen, a group of six female skaters based in New York City that once earned praise from Pharrell Williams for being 'opinionated, unique, introspective, multi-talented young women that like to speak their minds'.\nMeanwhile, model Ariel, who studies French at the Paris-based Sorbonne college, plays in a punk band while dreaming of creating an anarchist zine and nourishing an interest in gender theory and cultivating a non-gender-conformist fashion sense.\nIn four years of pushing the boundaries of traditional modeling ventures, the Anti-Agency has worked with household names such as Marc Jacobs, Gucci, Calvin Klein and Asos.\n'We have definitely noticed our vision becoming more mainstream which is fantastic to see,' Lennard said.\n'Normal agencies who would never normally take on models like ours are starting to and as a result there has definitely been an increase in diversity in the way models look and are perceived in fashion.'\nSelective: The agency, which describes itself as the 'enfant terrible of street casting', looks for character in its recruits - and insists on not putting restrictions on their physical appearances\nProjects: Model and eco-activist Bria, whose sister Indira is also represented by the agency, seeks to promote sustainability in fashion and is currently working on her own fashion label\nEmpowered: Lee, described by the agency as 'all natural' and 'voluptuous', doubles as a mixed media artist and a feminist activist with a strong online presence\nLennard acknowledged that the industry is 'still very slow to change', but believes there is a demand for new, unusual, diverse faces.\n'Sometimes we do find it hard to convince brands that this is where the future lies, that this is what people want to see in campaigns and runways,' Lennard added.\n'But essentially casting is a long process. It comes down to casting directors, the stylists of the shows, creative directors of the brands, what the public demand and what the press portray as popular.\n'It isn’t any one persons fault that casting is as rigid as it is- we’re all responsible in making these changes happen. If the public and the press demand change then there will be change. That’s why it’s so important for companies like ours to keep campaigning for diversity in all forms and for the press and public to show their support.'","url":"https://www.dailymail.co.uk/femail/article-4441734/Anti-fashion-model-agency-launches-New-York.html"}
