{"authors":["Penny Starr"],"date_download":"2018-10-30 21:23:33","date_modify":"2018-10-30 21:23:33","date_publish":"2018-07-13 21:01:36","description":"Ivanka Trump and Jared Kusher's neighbors protested at their D.C. home in opposition to President Donald Trump's immigration policy.","filename":"data/vaneerConsumption/AntiTrumpOpenBordersNeighborsProtestatKushnersDCHome.json","image_url":"https://media.breitbart.com/media/2018/07/Jared-Ivanka-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_13__1540934613.html","title":"Anti-Trump Open Borders Neighbors Protest at Kushner’s D.C. Home","title_page":"Anti-Trump Open Borders Neighbors Protest at Kushner’s D.C. Home |","title_rss":"NULL","source_domain":"breitbart.com","text":"Ivanka Trump was not at home, but her husband Jared Kushner was allegedly at the couple’s Washington, DC, residence on Wednesday night when a couple dozen of their neighbors in the wealthy Kalorama neighborhood lit candles and held signs to protest President Donald Trump’s “Zero Tolerance” policy at the U.S.-Mexico border.\nThe protesters, who held signs that ironically read, ‘Love Thy Neighbor,’ told the U.K. Daily Mail — which was given an “exclusive” heads up on the protest — they oppose federal law enforcement agencies enforcing immigration law that leads to the arrest of adults entering the U.S. illegally and forces separation from any children they brought with them while their cases are litigated.\nThe Mail reported:\nThe wealthy Kalorama neighborhood, in the historically Democratic DC area, counts many prominent politicians and government officials among its residents. It was even home to the Obamas’ post-presidency digs. But this is the first time that homeowners have felt so strongly about an issue that they have taken to protesting outside one of their neighbor’s front doors, according to Riley Temple, 69, who lives just a couple of blocks away from Jared and Ivanka.\n“This is a first,” Temple, a retired lawyer and teacher told DailyMail.com. ‘”These were all Kalorama neighbors.”\n“Under normal circumstances, we would never protest outside a home,” Temple said. “But these are not normal circumstances.”\n‘We shattered the custom because they have shattered civility,” Temple said, calling the Trump administration’s enforcing federal law “crimes against humanity.”\nTemple said he and the other neighbors felt “forced to act.”\nProtesters also confronted Ivanka while she was visiting a school in Syracuse, New York on Monday, according to the Mail.\nThose protesters shouted “Shame!” and “What about the children?” the Mail reported.\nBreitbart News has reported on members of Trump’s administration and cabinet being harassed and threatened – behavior encouraged by some leftists, including Rep. Maxine Waters (D-CA), who has told people to confront them whenever and wherever they can.\nDepartment of Homeland Security Secretary Kirstjen Nelson was harassed while dining at a restaurant in Washington, DC, and White House Press Secretary Sarah Sanders and her guests were denied service at a restaurant in rural Virginia.\nFormer Environmental Protection Agency Administrator (EPA) Scott Pruitt was also harassed while dining in D.C.\nFollow @PennyStarrDC on Twitter","url":"https://www.breitbart.com/politics/2018/07/13/anti-trump-open-borders-neighbors-protest-at-kushners-d-c-home/"}
