{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 21:15:55","date_modify":"2018-10-30 21:15:55","date_publish":"2014-08-08 19:07:33","description":"In just one week in July, eight separate synagogues were attacked in France. According to French organization Crif, one of them, located outside of Paris, |","filename":"data/vaneerConsumption/AntiSemitisminAustraliaWesternNationsReachingFeverPitch.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Government/2014/04/02/burning-star-of-david-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2014_08_08__1540934155.html","title":"Anti-Semitism in Australia, Western Nations Reaching Fever Pitch","title_page":"Anti-Semitism in Australia, Western Nations Reaching Fever Pitch | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In just one week in July, eight separate synagogues were attacked in France. According to French organization Crif, one of them, located outside of Paris, was firebombed by a 400-person riot. Crif also documented that a kosher supermarket and kosher pharmacy were destroyed in Kristallnacht-like fashion. Crowds could be heard chanting “Slit Jews’ Throats” and Death to Jews.”\nA Jewish leader in Germany told The Guardian:\nThese are the worst times since the Nazi era. On the streets, you hear things like “the Jews should be gassed,” “the Jews should be burned” – we haven’t had that in Germany for decades. Anyone saying those slogans isn’t criticizing Israel’s policies, it’s just pure hatred against Jews: nothing else. And it’s not just a German phenomenon. It’s an outbreak of hatred against Jews so intense that it’s very clear indeed.\nIn late July, a German synagogue that was was rebuilt after being destroyed during the reign of Nazi Germany was again attacked by anti-Semitic rioters. A new report published out of Berlin’s Technical University showcased that Germany has been “falling back on old stereotypes.” German residents have more frequently been using anti-Semitic phrases, describing Jews as “usurers” (money lenders who charge interest), “child murderers,” and part of the “global conspiracy.”\nAustralia’s Jewish community is also under attack. Recently, a group of teenagers stormed a Sydney bus full of Jewish children and levelled insults and threats at the adolescents. The mother of one of the kids on the bus told news.com.au that her daughter said about the incident, “They’re threatening to slit our throats; they’re chanting ‘Palestine’ and they’re going crazy about Palestine – ‘must kill the Jews’ and ‘heil Hitler.'”\n“The Jewish community is scared that this will continually escalate, as it is around the world, to a more dangerous time,” said Australia Jewish News’s Joshua Levi. “What we’re seeing in this last month is scary. Sometimes I’ll pay cash instead of credit card because I don’t want people to see my surname. That’s not something you should have to do in Australia.”\nIn the UK, British police have documented over 100 unique anti-Jewish incidents since Israel’s conflict with Hamas began in July.\nThis week in Rome, Italy, Jewish shops were vandalized with signs reading, “Jews your end is near” and “Torch the synagogues.” Separately, A Muslim Imam had to be deported from Italy because he often cited Koranic verses that entailed praising the killing of Jews.","url":"https://www.breitbart.com/national-security/2014/08/08/nti-semitism-in-australia-western-nations-reaching-fever-pitch/"}
