{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 18:35:46","date_modify":"2018-10-30 18:35:46","date_publish":"2015-03-20 14:19:39","description":"This weekend, two staunchly opposing groups, Stand With Us and J-Street, will hold conferences on opposite coasts, setting opposing agendas for U.S.-relations at a time when those relations are in danger of taking a turn for the worse. |","filename":"data/vaneerConsumption/AntiBDSConferenceDebutsinCaliforniaasJStreetGathersinDC.json","image_url":"https://media.breitbart.com/media/2015/01/israel-boy-flag-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_20__1540924546.html","title":"Anti-BDS Conference Debuts in California as J Street Gathers in D.C.","title_page":"Anti-BDS Conference Debuts in California as J Street Gathers in D.C. | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"This weekend, two staunchly opposing groups, Stand With Us and J Street, will hold conferences on opposite coasts, setting opposing agendas for U.S.-relations at a time when those relations are in danger of taking a turn for the worse.\nIn Washington, D.C. left-wing, George Soros-funded and purportedly “pro-Israel” lobby group J Street will hold its fifth annual conference, replete with criticism of Israel’s government and newly-reelected Prime Minister Benjamin Netanyahu.\nIn Los Angeles, California, the Stand With Us organization will hold its first anti-BDS (boycott, divestment, sanctions) conference, designed to train activists in resisting some of the same tactics and ideas that J Street will feature.\nJ Street does not endorse BDS but has given BDS advocates a platform at previous conferences to express their views. J Street’s President Jeremy Ben-Ami had attempted to shut down Netanyahu’s address to Congress earlier this month.\nJ Street’s conference lineup includes Former Secretary of State James A. Baker III, who also happens to be advising presidential candidate Jeb Bush on foreign policy, and who has an anti-Israel record. Also speaking at J Street will be Palestinian chief negotiator Saeb Erekat, who called Israel’s counter-terrorism operations in Jenin in 2002 a “massacre.” Obama’s White House Chief of Staff Denis McDonough will also be present.\nStand With Us’s keynote speaker will be former Harvard Law School professor and world-renowned defense attorney Alan Dershowitz ,who is a staunch defender of Israel. Regarding left-wing Democrats’ recent boycott of Bibi’s speech, Dershowitz said “as a liberal Democrat who twice campaigned for President Barack Obama, I am appalled.”\nPalestinian human rights activist Bassem Eid, who is openly anti-BDS, will also be featured at the Stand With Us conference.\nFollow Adelle Nazarian on Twitter @AdelleNaz","url":"https://www.breitbart.com/national-security/2015/03/20/anti-bds-conference-debuts-in-california-as-j-street-gathers-in-d-c/"}
