{"authors":["Frances Martel"],"date_download":"2018-10-30 19:30:13","date_modify":"2018-10-30 19:30:13","date_publish":"2015-01-20 17:22:41","description":"Protests formed outside the presidential palace in Buenos Aires as law enforcement ruled the death of prosecutor Alberto Nisman a suicide.","filename":"data/vaneerConsumption/AntiGovernmentProsecutorsSuicideTriggersProtestsinArgentina.json","image_url":"https://media.breitbart.com/media/2015/01/Alberto-Nisman-protests-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_01_20__1540927813.html","title":"Anti-Government Prosecutor's 'Suicide' Triggers Protests in Argentina","title_page":"Anti-Government Prosecutor's 'Suicide' Triggers Protests in Argentina | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Protests attracted thousands of people in front of the presidential palace in Buenos Aires, Argentina, Monday night as law enforcement moved to rule the death of controversial prosecutor Alberto Nisman a suicide.\nWhile solid figures for the size of the crowds have not yet surfaced in the media, the BBC estimates that “thousands” took to the streets nationwide, calling for the government to fully investigate Nisman’s death. Protesters held signs reading, “Yo soy Nisman”–a play on the wildly popular “Je Suis Charlie” slogan used to protest Islamist violence in the aftermath of the Charlie Hebdo murders. Protesters also banged pots and pans in front of the palace and shouted, “We are not afraid.” The use of the Charlie Hebdo slogan implies that, at least among some elements of those dissatisfied with the investigation so far, there is a belief that Nisman, like those killed in Paris, is the victim of Islamist violence–meaning that the Iranian government or Islamist terrorism responsible for the original bombing Nisman was investigating was also responsible for his death in some way.\nInfobae reports that protesters also flooded the Plaza de Mayo, an iconic protest spot in Argentina for which its most famous human rights group, the Madres de la Plaza de Mayo, is named.\nCada vez somos más. No dejen de venir para mostrar q no pueden con nosotros #TodosSomosNisman #19E #BastaDeImpunidad pic.twitter.com/Z9j8ZZRq6p — Guadalupe Vazquez (@guadavazquez) January 19, 2015\nEn Tucumán como en muchos puntos de Argentina la gente protestó con la consigan #TodosSomosNisman Foto @IsaiasCisnero pic.twitter.com/xSvfOdUu8P — José Inesta (@JoseInesta) January 20, 2015\nA sign that reads “I am Nisman” during a protest sparked by the death of special prosecutor Alberto Nisman (AP) pic.twitter.com/3ivIt6UGns — Betül (@BlackBetush) January 20, 2015\nNisman was found dead in his home Sunday night, lying beside a gun, just hours before testifying before the Argentine Congress on the matter of the 1994 bombing of a Jewish center in Buenos Aires. Nisman had argued for years that the unresolved crime was committed by the Iranian government or associates thereof. He also asserted that the Argentine government had, for more than a decade, refused to bring the guilty terrorists to justice to maintain friendly relations with the government of Iran. He had told friends and media alike on multiple occasions that he believed making the case against Iran would jeopardize his life. While he can no longer testify, he leaves behind a 300-page report detailing his case, which he submitted to the government Wednesday.\nAuthorities have deemed the death a suicide, while also noting that the gun was not Nisman’s, but a colleague’s, and that Nisman himself did not have gun powder on his hands, making it more difficult to establish that he pulled the trigger on himself. President Fernández herself called the death a “suicide (?)” and argued that she, too, had “questions” about the manner in which he died.","url":"https://www.breitbart.com/national-security/2015/01/20/anti-government-prosecutors-suicide-triggers-protests-in-argentina/"}
