{"authors":[],"date_download":"2018-10-30 14:31:04","date_modify":"2018-10-30 14:31:04","date_publish":"2015-07-27 00:00:00","description":null,"filename":"data/vaneerConsumption/Antibullyingclassesacoverforgayadvocacy.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_07_antibullying_classes_a_cover_for_gay_advocacy__1540909864.html","title":"'Anti-bullying classes' a cover for gay advocacy","title_page":"'Anti-bullying classes' a cover for gay advocacy","title_rss":"NULL","source_domain":"americanthinker.com","text":"The latest example of this can be seen at a middle school classroom in Iowa:\nThe gay rights movement has been very subversive in our schools. They claim they want kids to be taught tolerance toward gay kids, so they won't be bullied. But that's not what these tolerance and \"anti-bullying\" classes are really teaching. They are actually advocacy classes aimed at teaching a physically unhealthy lifestyle.\nThe Iowa Governors Conference on LGBTQ Youth claims to be the largest homosexual youth conference in the nation, but contrary to popular opinion, its purpose is not fostering understanding in the schools or preventing bullying. “Get that idea out of your head right now,” one attendee of the April 3 event told The FAMILY LEADER. “There were only two sessions [among more than 20] that had anything to do with bullying. It’s a conference teaching kids how to: how to be confidently homosexual, how to pleasure their gay partners -- one session even taught transsexual girls how to sew fake testicles into their underwear in order to pass themselves off as boys.”\n(This one confuses me – you can't see the outlines of men's testicles in pants, can you?)\nOne session taught how to properly use “binders” to reduce the visibility of a girl’s breasts and discussed hormone treatments for delaying puberty, assuring kids the drugs were safe. Our observer also reported on the day’s final speaker, a drag performer named Coco Peru, who delivered an expletive-laden presentation filled with song and a startling piece of advice for the hundreds of high school students bused in from around the state. Peru’s performance included a song with the lyrics, “People suck. They don’t give a f— about you. People thrive on smashing our pride to the ground. People that suck, f— you.” One presenter told students who asked whether anal sex hurt that, as a lesbian, it really depended on how big the device is that their partner straps on. “My daughter went to listen to the comedian, Sam Killermann, thinking it would at least be funny... But instead, Killermann explained how pleasurable it is for gay couples to eat each other’s behinds and how to use different flavors of [oils] to make it taste better.\nWho sponsors this awful workshop? Well, it's the \"Governor's conference,\" and the governor of Iowa is Terry Bransted, a Republican. Other sponsors were OfficeDepot, the owners of T.J. Maxx and Marshalls & Homegoods, the University of Iowa, and the Episcopal Diocese of Iowa, among others.\nThese Republicans and big companies don't seem uncomfortable promoting this because it's under the radar. But just as Planned Parenthood's gruesome selling of baby body parts is getting some corporate sponsors to disassociate from them, I think the same could be done here. Please feel free to link to this article on your blogs, and contact these companies directly (as well as the Iowa governor's office, if you're in Iowa) and ask if this reflects the values they're trying to sponsor.\nThis article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/07/antibullying_classes_a_cover_for_gay_advocacy_.html"}
