{"authors":["Bob Price"],"date_download":"2018-10-30 20:18:11","date_modify":"2018-10-30 20:18:11","date_publish":"2016-11-16 14:36:13","description":"A state senator has filed a bill to “eliminate Sanctuary Cities in the State of Texas” and force local governments to uphold the rule of law.","filename":"data/vaneerConsumption/AntiSanctuaryCityBillFiledbyTexasStateSenator.json","image_url":"https://media.breitbart.com/media/2016/11/Charles-Perry.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_11_16__1540930691.html","title":"Anti-Sanctuary City Bill Filed by Texas State Senator","title_page":"Anti-Sanctuary City Bill Filed by Texas State Senator","title_rss":"NULL","source_domain":"breitbart.com","text":"A Texas state senator has filed a bill to “eliminate Sanctuary Cities in the State of Texas.” The bill will require local governments and law enforcement agencies uphold current immigration laws.\nThe filing of SB 4 by Senator Charles Perry (R-Lubbock) on Tuesday follows the announcement by Texas Lt. Governor Dan Patrick that ending sanctuary cities in Texas would be a priority for the 85th Legislative Session which begins in January 2017.\n“No city in Texas should be allowed to ignore the law,” Governor Patrick stated. “We will end this practice once and for all this session.”\n“By electing a Republican president and Republican majorities in Congress, the American people made it clear that solving our illegal immigration crisis must be a priority,” Senator Charles Perry said in a statement obtained by Breitbart Texas. “That starts by eliminating sanctuary cities, securing our border, and enforcing the immigration laws we currently have on the books. We cannot sit idly by and allow local policies to undercut efforts made at the federal and state level.”\nThe five key provisions of Perry’s SB 4 were discussed by the senator’s staff with Breitbart Texas. Those provisions are:\nMunicipalities are forced to comply with immigration detainers; Municipalities cannot prohibit or discourage officers from inquiring about immigration status during a lawful stop; State grants will be withheld if the Attorney of Texas finds an entity is in violation of law; The immigration status must be recorded in a person’s case file; and The bill protects witnesses and victims of crimes if they are here illegally.\nTexas has tried for several sessions to pass legislation to ban sanctuary practices by officials in Texas. Senator Perry submitted SB 185 in the 84th Legislative Session in 2015. Not long after that, a previously-deported criminal alien in the sanctuary city of San Francisco, California, allegedly shot and killed Kate Steinle. In September, then GOP presidential candidate Donald Trump pledged to pass “Kate’s Law” to end sanctuary cities across America, Breitbart reported.\nThe issue may come to a head quickly in the state’s capital county, Travis, where Sheriff-elect Sally Hernandez has pledged to remove Immigration and Customs Enforcement agents from the county jail.\n“I just don’t think you solve the criminal justice process by deporting them,” Hernandez told The Texas Tribune during a sit-down interview in her office this week. “We talk about being progressive. I believe we need to lead the way.”\nShortly after her statement, Breitbart Texas reported on a 5-time deported criminal alien who returned to Austin to begin an alleged series of assaults and rapes of women in the capital region.\nThe previously-deported criminal alien has reportedly admitted to picking up prostitutes and beating them out of anger. ICE officials have placed yet another immigration detainer on the suspect.\n“There’s bad, really bad people, who want to do us real harm who are coming at us from all different directions north, south, east and west,” Immigration specialist Thomas Esparza, Jr. told FOX 7. ICE officials had asked that Nicondemo Coria-Gonzales be prosecuted for criminal re-entry after his fourth deportation. The U.S. Attorney for the Western District of Texas declined to prosecute the man setting up his return to Texas and the assaults on these unfortunate women, Breitbart Texas reported.\nDallas County Sheriff Lupe Valdez also pledged to disregard immigration detainers from ICE on a case-by-case basis in October, Breitbart Texas reported. This prompted Texas Governor Greg Abbott to fire off a letter to the sheriff stating that her sanctuary city-like policies would “no longer be tolerated in Texas.”\n“’Sanctuary City’ policies like those promoted by your recent decision to implement your own case-by-case immigrant detention plan will no longer be tolerated in Texas,” Abbott began in his letter. “Your decision to not fully honor U.S. Immigration & Customs Enforcement’s (ICE) requests to detain criminal immigrants poses a serious danger to Texans. These detainers provide ICE with the critical notice and time it needs to take incarcerated immigrants into federal custody.”\nAbbott responded and issued the following called for the following legislative actions:\nPassing laws that prohibit any policy or action that promotes sanctuary to people in this state illegally;\nEnacting laws that make it illegal for a Sheriff’s Department to not honor a federal immigration detainer request;\nEvaluating the extent to which local taxpayers should foot the bill for local decisions that increase costs for Texas’ health and education systems; and\nAmending the Tort Claims Act to ensure counties are fully financially responsible for the actions of any illegal immigrants who are released because the county’s Sheriff failed to honor an ICE detainer request.\nAbbott followed up by issuing an order to strip law enforcement state grant funding to law enforcement agencies who declined to honor ICE detainers:\nI am establishing new standards for Sheriff’s Departments that seek grants from the Governor’s Criminal Justice Division (CJD),” Governor Abbott wrote in a statement obtained by Breitbart Texas. “Beginning now, all CJD grant awards will require that Sheriff’s Departments fully honor ICE’s detention requests for criminal immigrants. Any applicant that cannot certify that their office will honor all ICE detainers for criminal immigrants will be ineligible for CJD funding. Further, any applicant that certifies full compliance with ICE detainer requests—but subsequently fails to honor an ICE detainer—will be subject to claw-back provisions and must refund the full amount of their CJD grant award.\nSenator Perry’s SB 185 passed out of committee in the Senate but never received a vote on the floor.\nBreitbart Texas reached out to Governor Abbott’s office about the potential of a sanctuary city law passing out of the 85th Legislative Session. Spokesman John Wittman told Breitbart Texas, “Governor Abbott looks forward to signing a bill this session that bans sanctuary cities in Texas.”\n“Banning sanctuary city policies will help prevent criminal aliens from being put back on our streets,” continued Perry. “I have no doubt that with the help of my colleagues in the Texas Legislature, we will pass this bill.”\nBob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX.\nTexas Senate Bill 4 by Senator Charles Perry (R-Lubbock) by Bob Price on Scribd","url":"https://www.breitbart.com/border/2016/11/16/anti-sanctuary-city-bill-filed-texas-state-senator/"}
