{"authors":["Associated Press"],"date_download":"2018-10-23 01:15:47","date_modify":"2018-10-23 01:15:47","date_publish":"2017-04-26 11:35:24","description":"LONDON (AP) - Businesswoman Gina Miller, who took the British government to court in a successful bid to win Parliament a vote on Brexit, launched a campaign...","filename":"data/vaneerConsumption/AntiBrexitadvocatelaunchestacticalUKvotingcampaign.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/12/wire-464931-1493206866-839_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447158_Anti-Brexit-entrepreneur-launches-tactical-voting-campaign_1540257347.html","title":"Anti-Brexit advocate launches tactical UK voting campaign","title_page":"Anti-Brexit advocate launches tactical UK voting campaign | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"LONDON (AP) - Businesswoman Gina Miller, who took the British government to court in a successful bid to win Parliament a vote on Brexit, launched a campaign Wednesday to back pro-EU candidates at the ballot box.\nMiller has raised 300,000 pounds ($385,000) in a week through crowd-funding for a campaign to support tactical voting in Britain's June 8 general election.\nHer group, Best for Britain, says it will fund candidates from any party who promise to keep \"all options open\" for Britain's exit from the European Union and are willing to vote against a bad deal.\nEntrepreneur Gina Miller answers a journalist's question as she launches the \"Best for Britain\" campaign for tactical voting with campaign director Eloise Todd, for the upcoming British general election at the Institute of Contemporary Arts in London, Wednesday, April 26, 2017. Miller, an entrepreneur, became the face of the lawsuit which demanded that Britain's Prime Minister Theresa May's government get parliamentary approval before triggering Brexit. (AP Photo/Matt Dunham)\nMiller, 51, backed the losing \"remain\" side in last year's EU membership referendum, but the group says it is not trying to overturn the result - just to ensure that Britain gets the best possible future relationship with the bloc.\nBritish Prime Minister Theresa May called an early election last week, urging voters to give her Conservative party a big majority to strengthen her hand in EU exit negotiations.\nAll 650 seats in Parliament are now up for re-election. The Conservatives are hoping to increase their 330 seat tally - and the main opposition Labour Party is battling to hang onto its current 229 seats.\nSupporters of the EU fear May's insistence that Britain must leave the bloc's single market in order to control the country's immigration will severely damage the British economy.\nMiller, a financial entrepreneur, was the lead plaintiff in a Supreme Court case demanding that May's government get parliamentary approval before triggering Brexit. The court agreed that May needed Parliament's approval - which was granted in March.\nThe court case made Miller one of the best-known foes of Brexit, and brought her online abuse and harassment. A 50-year-old aristocrat, Rhodri Colwyn Philipps, has been charged with making racially aggravated threats against the Guyana-born Miller.\n\"The abuse hasn't died down,\" Miller said. \"Several people have tried to destroy me in every way - my reputation, my safety, whatever.\"\n\"But at the same time I have a huge sense of responsibility\" to those who supported her campaign, she said. \"I have decided to embrace the idea that people think I have something to offer.\"\nEntrepreneur Gina Miller answers a journalist's question as she launches the \"Best for Britain\" campaign for tactical voting with campaign director Eloise Todd, for the upcoming British general election at the Institute of Contemporary Arts in London, Wednesday, April 26, 2017. Miller, an entrepreneur, became the face of the lawsuit which demanded that Britain's Prime Minister Theresa May's government get parliamentary approval before triggering Brexit. (AP Photo/Matt Dunham)\nEntrepreneur Gina Miller listens to a journalist's question as she launches the \"Best for Britain\" campaign for tactical voting with campaign director Eloise Todd, for the upcoming British general election at the Institute of Contemporary Arts in London, Wednesday, April 26, 2017. Miller, an entrepreneur, became the face of the lawsuit which demanded that Britain's Prime Minister Theresa May's government get parliamentary approval before triggering Brexit. (AP Photo/Matt Dunham)\nEntrepreneur Gina Miller speaks at the launch for the \"Best for Britain\" campaign for tactical voting with campaign director Eloise Todd, for the upcoming British general election at the Institute of Contemporary Arts in London, Wednesday, April 26, 2017. Miller, an entrepreneur, became the face of the lawsuit which demanded that Britain's Prime Minister Theresa May's government get parliamentary approval before triggering Brexit. (AP Photo/Matt Dunham)\nEntrepreneur Gina Miller, left, speaks at the launch for the \"Best for Britain\" campaign for tactical voting with campaign director Eloise Todd, right, for the upcoming British general election at the Institute of Contemporary Arts in London, Wednesday, April 26, 2017. Miller, an entrepreneur, became the face of the lawsuit which demanded that Britain's Prime Minister Theresa May's government get parliamentary approval before triggering Brexit. (AP Photo/Matt Dunham)","url":"https://www.dailymail.co.uk/wires/ap/article-4447158/Anti-Brexit-entrepreneur-launches-tactical-voting-campaign.html"}
