{"authors":[],"date_download":"2018-10-21 02:47:43","date_modify":"2018-10-21 02:47:43","date_publish":"2018-07-20 22:19:36","description":"She is best known as the reporter who, as the New Times said, “staked out Motel 6 late at night, warding off creeps and getting motel staff to confirm what had become routine to them, sending lists of guests' names” to ICE.","filename":"data/vaneerConsumption/AntoniaFarzanjoinsMorningMix.json","image_url":"https://www.washingtonpost.com/resizer/Ra4ByBKpz34zVuHXbFEl1TJdXII=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3V4XIQR7GYYU7GRNLGIQ4EXRYM.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_07_20__1540090063.html","title":"Antonia Farzan joins Morning Mix","title_page":"Antonia Farzan joins Morning Mix - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Announcement from Morning Mix Editor Fred Barbash:\nWe are pleased to introduce the newest addition to the Morning Mix Team, Antonia Noori Farzan. Antonia joins us from the Phoenix New Times, where she dazzled at writing narrative features, particularly focusing on the grittier side of life in Arizona.\nShe is best known as the reporter who, as the New Times said, “staked out Motel 6 late at night, warding off creeps and getting motel staff to confirm what had become routine to them, sending lists of guests’ names” to ICE. She shared a Polk Award for the stories about how ICE agents would show up every few weeks to arrest undocumented motel guests. Antonia has also written powerfully about police shootings of Native Americans, who, as she reported, “are statistically more likely to be killed by police than any other group.”\nBefore working for the Phoenix New Times, Antonia wrote for the New Times Broward-Palm Beach in Florida. She attended Columbia Journalism School and received an undergraduate degree from Hamilton College. She received a Pulitzer traveling fellowship upon graduating from Columbia. She enjoys cross-country road trips and hanging out with her cat, Sage.\nAntonia starts Monday.","url":"https://www.washingtonpost.com/pr/wp/2018/07/20/antonia-farzan-joins-morning-mix/"}
