{"authors":["Abhijit Majumder"],"date_download":"2018-10-22 20:07:35","date_modify":"2018-10-22 20:07:35","date_publish":"2016-01-28 00:16:37","description":"INTERVIEW: It's 31 years since the angry old man of Saaransh exploded onto the big screen - and his career has now reached a new milestone. But Anupam Kher is no less of a rebel after all this time.","filename":"data/vaneerConsumption/AnupamKherhitsbackatcriticsafterpickingupthePadmaBhushan.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/27/22/30A44C9500000578-0-image-a-12_1453932632685.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/indiahome_indianews_article-3419777_Anupam-Kher-hits-critics-picking-Padma-Bhushan_1540238855.html","title":"Anupam Kher hits back at critics after picking up the Padma Bhushan","title_page":"Anupam Kher hits back at critics after picking up the Padma Bhushan | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's 31 years since the angry, old man of Saaransh exploded onto the big screen - and his career has now reached a new milestone.\nAnupam Kher, who was just 28 when he played the rebellious, angry headmaster, is no less of a rebel after all this time.\nThe actor, who led the charge against those who said intolerance was rising in India, spoke to Mail Today on Wednesday in an exclusive interview after receiving the Padma Bhushan on Republic Day.\nAnupam Kher, who played the unforgettable headmaster in Saaransh, will be honoured with the Padma Bhushan this year\nDid he get the award - as some alleged, particularly on social media - because he is close to the ruling BJP?\n'That means in the last 67 years, whoever got it must have got it because of their proximity to governments. It includes Amitabh Bachchan, Kamal Haasan, Shivaji Ganesan. Can one nullify their work? These great performers are the reason why we became actors,' Kher said.\n'If I had got an award for dancing, painting or singing, one could understand the criticism. I am one of the finest actors of this country. I have great sympathy for this lot [his critics and trolls]. They have no life.'\nOn whether his campaign against the intolerant India narrative would have a professional backlash, he said: 'The backlash could be subtle. Some may not want to work with me. That’s all right. I came to Mumbai with Rs 37 in my pocket. I’ve risen from the gutter, and not taken favours. You can’t demolish a self-made man.'\nHe said he didn’t fear being overlooked for jobs either. 'If I go to the streets playing a dugdugi, people will throng.'\nHe hit back at critics who said the honour was related to his relationship with the ruling BJP\nKher made it clear that he would not accept government positions.\n'No, I will not. They did offer me one or two positions. They offered me NFDC chairmanship. I declined. Taking up a post is an obligation. But an honour, anytime,' he said.\n'When I agreed to head the Censor Board, I thought it was offered because of my capability. I didn’t realise it was a political position which was taken away when the Congress came to power.'\nOn intolerance, Kher took a sharp jibe at some of his co-actors.\n'Today, all those who said India was intolerant are saying \"I never said that\". That’s because the country has not accepted that statement.'\nHe stressed the importance of speaking up, even if it risked damaging popularity.\nHe said: 'Why should I be made to feel self-conscious about putting a teeka or wearing gerua as a Hindu in this country? Why shouldn’t 26 years of Kashmiri Pandits’ exile be the theme of my talks?'\nKher said no party, including the BJP, did much for the Pandits.\n'But I would like to give this government five years,' he commented.\nHe describes, laughing, how he changed his voice when he got a call from an unknown number during the Jaipur Literary Festival while travelling in a bus with actor Abhishek Bachchan.\n'When he said he was from the home ministry, I said: \"This is Anupam Kher speaking\". He broke the award news to me and asked: \"Kya aap isko sweekar karte hain [do you accept the award]?\" I said, \"Main bus mein leyt ke sweekar karta hoon [I accept it rolling on the bus floor]\".'\nKher, arguably the first to tell his own story on stage, had got a Padma Shri in 2004.\n'This country has allowed me to be what I am. My father was a clerk in the forest department. He got Rs 90 a month and with 14 in the family to support. I went to a municipal school.'\nThe star has made 419 films during his illustrious career and has now been honoured with the Padma Bhushan\nIn Class V, Kher acted in his first play. 'It was a disaster', he said. 'I didn’t get an award. My father plucked a bunch of yellow flowers in Shimla and told me: \"This is your award\".'\nAfter a three-year course at National School of Drama and teaching theatre in Lucknow, Kher arrived in Mumbai on June 3, 1981.\n'I was on the streets on Mumbai, looking for work, compromising with my dignity, sleeping on railway platforms sometimes. But those yellow flowers my father brought every time I failed kept me going.'\nHe recalled his first rented house in Mumbai. 'My landlady was a washerwoman. I shared a small room with four others; she and her children slept in the kitchen.\n'Ironically, my address was Anupam Kher, 2/15 Kherwadi, Kher Nagar, Kher Road.'\nThen came the fateful role in Saaransh. 'For that, I didn’t get a National Award. Again my father landed up, this time with a woollen muffler made by my mother. He was this magic box, and he created this amazing feeling.'\nSo, when 31 years and 419 films later he got the Padma Bhushan, he wished his father was there.\n'Every time I get something, I think about that small town where I lived.'\nDoes he see himself in active politics?\n'If you are saying all these moves…March for India etc…are a precursor, they are not. The day I want to join politics, I’ll announce it from the top of the world,' he said. '","url":"https://www.dailymail.co.uk/indiahome/indianews/article-3419777/Anupam-Kher-hits-critics-picking-Padma-Bhushan.html"}
