{"authors":[],"date_download":"2018-10-23 02:42:12","date_modify":"2018-10-23 02:42:12","date_publish":"2016-01-11 15:12:08","description":"Any share listing of state-owned Saudi Aramco, the world's largest crude producer, will take time, the company's chairman told The Wall Street Journal in an ...","filename":"data/vaneerConsumption/AnySaudiAramcosharelistingwilltaketimechairman.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z9qt-48qEJGFphM8d437f0aaf9262e380-82_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3394084_Any-Saudi-Aramco-share-listing-time-chairman_1540262532.html","title":"Any Saudi Aramco share listing will take time: chairman","title_page":"Any Saudi Aramco share listing will take time: chairman | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Any Saudi Aramco share listing will take time: chairman\nAny share listing of state-owned Saudi Aramco, the world's largest crude producer, will take time, the company's chairman told The Wall Street Journal in an interview published Monday.\nKhalid al-Falih also said the potential sale of shares could include listing at least part of Aramco's crude extraction operations.\n\"There is no plan that is concrete at this stage to do the listing. There are studies ongoing. Serious consideration,\" Falih told The Journal.\nSaudi Aramco manages crude reserves that exceed 261 billion barrels ©Hassan Ammar (AFP/File)\nHis comments came after Aramco said Friday it \"has been studying various options to allow broad public participation in its equity\".\nThe move would be part of economic reforms by the kingdom coping with a collapse in global oil prices.\nDeputy Crown Prince Mohammed bin Salman first revealed that a share offer was under review, in an interview Thursday with The Economist.\nFalih told The Journal Saudi Aramco is considering listing \"the main company, and obviously the main company, will include upstream,\" or the exploration and production sectors.\nAramco manages crude reserves that exceed 261 billion barrels.\nThe company might also list refining and petrochemical units, The Journal said.\n\"Many of these assets are also with other joint venture partners so we have to go through the process of reviewing the legal agreements between us and our partners,\" said Falih, who is also health minister.\n\"It will take time.\"\nAny listing would primarily occur on the Saudi exchange, \"but I would not exclude at this stage international listings given the potential size,\" Falih told The Journal.\nA public listing by Saudi Aramco would make it the first major state-owned oil firm in the Gulf to be floated on markets.","url":"https://www.dailymail.co.uk/wires/afp/article-3394084/Any-Saudi-Aramco-share-listing-time-chairman.html"}
