{"authors":[],"date_download":"2018-10-30 01:12:12","date_modify":"2018-10-30 01:12:12","date_publish":"2016-11-08 00:00:00","description":null,"filename":"data/vaneerConsumption/Anythingtogetthesepeopletoshutupandleave.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_11_anything_to_get_these_people_to_shut_up_and_leave_1540861932.html","title":"Anything to get these people to shut up and leave!","title_page":"Anything to get these people to shut up and leave!","title_rss":"NULL","source_domain":"americanthinker.com","text":"OK, granted, this is a tough presidential election with two rather difficult choices from the main parties, while the alternatives from the minor parties aren't that appealing, either. What to do? What to do? Luckily, several non-great celebrities are helping us make the choice easier by promising to help fulfill Donald Trump (R)'s slogan, Make America Great Again!, by planning to emigrate should he win. Knowing that their departures would greatly improve America's quality of life could tilt undecided voters toward Trump just to see them go.\nAmong the better known entertainment figures who have promised to join her and whose promised absence would improve the country's diversity and democracy:\nChelsea Handler. The funny lady (sic) would move to Spain. “I did buy a house in another country just in case, so all of these people that threaten to leave the country and then don't, I will leave the country,” she reportedly said on “Live with Kelly and Michael” in May. (snip) Amy Schumer. The comedian might become neighbors with Handler. “I will need to learn to speak Spanish because I will move to Spain or somewhere ... it's beyond my comprehension if Trump won. It's too crazy,” she told BBC Newsnight in September. (snip) Barbra Streisand. The singer might opt to live Down Under. “He has no facts. I don't know, I can't believe it. I'm either coming to your country [Australia], if you'll let me in, or Canada,” she reportedly told Australian journalist Michael Usher in August.\nSweetening the pull toward voting for Trump, Lena Dunham and Whoopi Goldberg have also promised to split should he be elected.\nStill not convinced to vote for Trump? Wait: here is another one who promises to leave who will definitely steer your hand.\nRev. Al Sharpton. The activist has promised to book a plane ticket, as well. “If Donald Trump is the nominee … I’m also reserving my ticket to get out of here if he wins. Only because he’d probably have me deported anyhow,” he said at a Center for American Progress event in February.\nYeah, I know. Sharpton is still here despite his professed promises, and of course, Trump hasn't deported him. But maybe Trump's election will be the shove to get him to go.\nBut wait...there's more! Some are promising to save the planet for us by traveling to other worlds!\nJon Stewart. The political satirist would also select something out of this world. “I would consider getting in a rocket and going to another planet, because clearly this planet's gone bonkers,” he told reporters in September 2015. (snip) Cher. Forget another country — the singer has said she'd pick a different planet if the Republican wins. “IF HE WERE TO BE ELECTED, IM MOVING TO JUPITER >:|” she tweeted in June 2015.\nAnd all these hoped for exiles will get their news from George Stephanopoulos, former president Bill Clinton (D)'s puppet, now an objective reporter at ABC (yeah, I know), according to his wife.\nAli Wentworth would rather go down under with husband George Stephanopoulos: “If Trump wins, we’ll start looking at real estate in Sydney, Australia. No crime, no guns.\"\nSure, these big talkers and even bigger, um, evaders of truth probably won't put their bodies where their big mouths are, but we can always remind them of their words, indicating their lack of acceptance of diversity, pluralism, and multiculturalism, no matter what they utter indicating their lack of faith in this great country, which has given them so much for the so little they have handed out.\nLet's send them the names of our favorite travel agents now.","url":"https://www.americanthinker.com/blog/2016/11/anything_to_get_these_people_to_shut_up_and_leave.html"}
