{"authors":["David Scutt","Business Insider Australia"],"date_download":"2018-10-30 22:52:55","date_modify":"2018-10-30 22:52:55","date_publish":"2018-07-27 00:00:00","description":"Speculation is mounting that the Bank of Japan (BoJ) will tweak monetary policy settings, potentially as soon as next week.","filename":"data/vaneerConsumption/ANZBankonoptionsfortheBankofJapan.json","image_url":"https://amp.businessinsider.com/images/5b5ac997dce2e91b008b4655-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_anz-bank-on-options-for-the-bank-of-japan-2018-7_1540939975.html","title":"ANZ Bank on options for the Bank of Japan","title_page":"    ANZ Bank on options for the Bank of Japan - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BOJ Governor Kuroda attends a financial and monetary committee session at the Lower House of the parliament in Tokyo Thomson Reuters\nJapan's economy contracted in the March quarter. There are signs its manufacturing sector is starting to weaken, especially parts aligned to export markets, and inflation is weak, moving further away from the Bank of Japan's (BoJ) 2% target in June.\nYet, despite that myriad of underwhelming economic readings, speculation is mounting the BoJ may tweak monetary policy settings to allow for a rise in Japanese government bond (JGB) yields, potentially leading to renewed strength in the Japanese yen.\nSome think this change could happen as soon as next week, making this the first BoJ meeting in several years where there's likely to be some interest.\n\"For the first time in a while, the upcoming BoJ meeting will be a market event, with speculation of a policy tweak rising after the emergence of a number of news stories,\" says Tom Kenny, Senior Economist at ANZ Bank.\n\"The publication of these stories late last week resulted in the Japanese yen, financial market volatility and Japanese Government Bond (JGB) yields all rising… reflecting speculation that the change in policy may result in a steeper yield curve, which would represent a 'tightening' of policy.\"\nWith benchmark 10-year JGB yields currently sitting at 0.087% — above the 0% level the BoJ targets as part of its Quantitative and Qualitative Easing (QQE) with Yield Curve Control (YCC) policy framework — there's clearly a bit of speculation around that the BoJ will tweak its current settings.\nFor clarity purposes, QQE with YCC is simply buying enough Japanese government bonds to keep interest rates out to 10-years at around 0%.\nSome think it will allow 10-year JGB yields to trade in a wider range, albeit the BoJ has an implicit, rather than explicit, tolerance to movements at present, while others think it will adjust its YCC program so that rather than targeting 10-year yields, it will use asset purchases to suppress bond yields at the shorter-end of the curve, potentially at five-years.\nSome even think the BoJ could lift its 10-year JGB yield target from 0% in an attempt to steepen the shape of the yield curve to help encourage lending and promote more attractive margins for banks.\nThere are a number of other potential tweaks being speculated upon, including changes to BoJ purchases of Japanese stock ETFs and interest rates offered for reserve balances placed at the BoJ by lenders.\nEverything and anything appears to be on the table when it comes to what the BoJ may do.\nHowever, Kenny thinks there's an option available to the BoJ that nobody appears to be considering: do absolutely nothing.\nOn a balance of probability, that's exactly what he thinks will happen, ascribing a greater than 90% chance the BoJ will leave policy exactly the same.\nHere's the scenarios he thinks could occur, along with the probability of each occurring:\n1. Additional easing - flatter yield curve (<5%).\nOne Board member, Mr Kataoka, has in recent meetings been voting for additional easing, arguing for a lowering of the 10-year yield target. In addition, the relatively newly appointed reflationist leaning Deputy Governor, Wakatabe, has indicated on a number of occasions that the BoJ could consider further easing, if required. The recent drift down in inflation could be such a situation.\nHowever, as we said above, we think the majority of the Board would regard the recent easing in inflation as temporary. Specifically, recent weakness is owing to supply-side developments not deficient demand. We regard the probability of further easing as extremely low.\n2. Tightening - steeper yield curve (<5%).\nThe BoJ, concerned about the adverse side effects of overly easy policy, could look to steepen the yield curve. There are a number of options for achieving this:\n1. Raise the 10-year yield limit\n2. Allow a wider trading band around zero (currently informally viewed as about ±10bp)\n3. Shorten the duration of its longer-dated target under YCC to five years, and allow the 10-year rate to be market determined.\nA steepening of the yield curve seems highly unlikely given the BoJ will lower its inflation forecasts. To raise real yields now would be counter to everything Governor Kuroda has done during his tenure to get inflation back to 2%. Higher real yields run the risk of boosting the JPY, which would put further downward pressure on inflation. Moreover, as we noted earlier, we do not think there is a consensus view that the current policy stance is unsustainable.\nWe regard the probability of a steepening in the yield curve as very low.\n3. Maintain current policy stance (>90%)\nIn this scenario, the BoJ would continue with YCC as its primary policy tool, with the current targets for short- and long-term rates left unchanged. It could, of course, make some language tweaks, such as changing its forward guidance on its asset purchases and/or introducing forward guidance on its YCC.\nKenny says that within the last option, there's a chance the BoJ may drop its arbitrary pledge to buy 800 trillion yen worth of JGBs per annum given the bank has not come close to asset purchases of this magnitude.\nHe also says the BoJ may consider introducing a forward guidance around yield curve control, suggesting it could allow for steepening of the yield curve when certain inflation targets are met. However, he thinks that's only a low possibility at this point.\nSo why does Kenny, as opposed to so many others, think the BoJ will make no major changes to policy, if any at all?\nThis chart has the answer.\nANZ Bank\nInflation is nowhere near the BoJ's 2% target, and moving away based off underlying price measures.\nKenny says this will likely see the BoJ lower its inflation forecasts — again — and ensure that policy settings will be kept extremely loose.\n\"We don't expect any change, given that the Bank is set to downgrade its inflation view,\" he says.\n\"Moreover, any policy tweak could be misinterpreted as a step toward normalisation, a signal the BoJ would be reluctant to send now with inflation far from target.\"\nThe BoJ will make its policy decision on Tuesday, July 31.\nIf Kenny is right, be prepared for disappointment if you're expecting market fireworks.","url":"https://www.businessinsider.com/anz-bank-on-options-for-the-bank-of-japan-2018-7"}
