{"authors":["Khaleda Rahman For Daily Mail Australia"],"date_download":"2018-10-22 23:19:15","date_modify":"2018-10-22 23:19:15","date_publish":"2017-04-26 07:17:42","description":"Mr Coates wrote in an email that the woman 'should get out in the real world' as he wasn't running a 'sheltered workshop.'","filename":"data/vaneerConsumption/AOCchiefaccusedofslammingstafferwithcancer.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/06/3F9CBF5700000578-0-image-a-37_1493186130551.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446354_AOC-chief-accused-slamming-staffer-cancer_1540250355.html","title":"AOC chief accused of slamming staffer with cancer","title_page":"AOC chief accused of slamming staffer with cancer | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Australian Olympic Committee chief John Coates is accused of slamming the performance of a female staffer who was battling cancer, internal emails have revealed.\nMr Coates wrote in an email that the woman 'should get out in the real world' as he wasn't running a 'sheltered workshop', Fairfax Media reports.\nThe employee in question had been undergoing chemotherapy for months – and rarely missed a day's work, according to her then-boss, Fiona de Jong.\nAnd Mr Coates was aware of her illness because he had sent her flowers when she was in hospital, Ms de Jong revealed.\nAustralian Olympic Committee chief John Coates (above) is accused of slamming the performance of a female staffer who was battling cancer\nThe exchange appears to have been prompted when the woman – who worked as a solicitor - highlighted a mistake in the AOC Constitution that may have needed to be changed.\nIt was brought to Mr Coates' attention by chief financial officer Sue O'Donnell and he replied with a scathing note to six people – including much of the AOC's senior management.\n'After [the woman's] stuff-ups in taking and loosing [six[ uniform measurements, she'd be wise to worry about improving her general performance in the Sports Department before venturing again into the area of drafting in which she has previously shown herself incapable,' he wrote.\nThe woman then immediately drafted a resignation letter, but it was Ms de Jong who tried to prevent her from leaving.\nShe wrote to Mr Coates saying the woman had been upset by the 'public manner' in which he had reprimanded her - and that she was the only person qualified to help select the team for the Olympics in Rio de Janeiro.\nThe employee in question had been undergoing chemotherapy for months – and Mr Coates knew, her then-boss, Fiona de Jong (pictured) revealed. Ms de Jong has lodged a formal complaint alleging AOC media directore Mike Tancred threatened her after she quit her job\nBut Mr Coates replied: 'Do not hold back on accepting [her] resignation on my account. We have spoken about her poor performance on a number of occasions.'\nIn a subsequent email, which was also sent to senior managers, he wrote: [The woman] is a solicitor, hardly a junior member of staff.\n'If she's offended, it's probably time for her to get out in the real world. Ours is not a sheltered workshop. Kind regards, John.'\nThe woman resigned shortly afterwards.\nThe emails, from January last year, were included in a letter sent by ex-AOC chief executive Ms de Jong to the AOC board on Wednesday ahead of a meeting to discuss allegations of bullying in the organisation.\nShe outlined 12 different complaints of formal and informal bullying at the AOC between 2004 and 2016.\nIt came as AOC media director Mike Tancred stood down from his role despite denying bullying allegations against him.\nAOC media director Mike Tancred (pictured) stood down from his role despite denying bullying allegations against him by ex-AOC chief Fiona de Jong\nTancred will stand down until the resolution of a complaint made against him by Ms de Jong.\nShe lodged a formal complaint alleging Tancred threatened her after she quit her job last year.\n'He said 'Fiona, withdraw the complaint or I will bury you',' de Jong told Fairfax Media, adding the long-time media director was 'abusive and threatening to me and would have affected my family life'.\nTancred on Wednesday rejected de Jong's claims.\n'I deny all the allegations made against me,' he told AAP.\n'I have made no comment to any of the allegations because I am bound by a confidentially agreement which I signed.\n'Ms de Jong also signed that agreement but breached it over the weekend.'\nOlympic hockey gold medallist Danni Roche is challenging Coates for the AOC presidency\nSeveral former AOC staffers have also alleged harassment from Tancred while working at the organisation.\nThe latest is a former staffer who said she was harangued by Tancred for taking two days off work during the Beijing Olympics.\nHe said she had told him she had a stomach bug when she had actually miscarried her baby.\nTancred, who said those claims were not subject to the confidentiality agreement, denied the allegation.\n'I was contacted by one of my staff to tell me (the woman) was in hospital,' he told AAP.\n'I contacted her immediately and offered to fly her straight home to Australia.\n'We also had an email exchange where she told me she had a stomach bug and would be returning to work the next day. There was no mention of a miscarriage.'\nTancred said on return to Australia after the Beijing Games, he 'noticed the (woman's) work suffered'.\n'I met with her, asked if there was a problem because she was a great worker and a valued member of the team,' he said.\n'It was then that she said she had lost a baby in Beijing.\n'This was the first I had heard of it. I was distressed. I would never had sent (the woman) to Beijing if I had known she was pregnant.\n'I did everything I could to assist and support her in Beijing without knowing the seriousness of her condition.'\nTancred told the AOC of his decision to stand down ahead of the crisis meeting of the executive board on Wednesday evening.\nThe move comes amid an increasingly bitter contest for the AOC presidency, with incumbent Mr Coates facing a challenge for the first time since taking the role 27 years ago.\nOlympic hockey gold medallist Danni Roche is challenging Coates with a vote to be held on May 6 at the AOC's annual general meeting.\nBut he's been plagued by the allegations of bullying in the AOC – as well as Ms de Long blasting the delay in dealing with her complaint, which was lodged in December.\nIn a letter to the sports federations voting in the election, Mr Coates said: 'There is no place for bullying and I reject the suggestion of a culture of 'bullying' or lack of action in response to allegations of it.'","url":"https://www.dailymail.co.uk/news/article-4446354/AOC-chief-accused-slamming-staffer-cancer.html"}
