{"authors":["Ruth Goldstein The Baltimore Sun"],"date_download":"2018-10-30 14:15:25","date_modify":"2018-10-30 14:15:25","date_publish":"2018-10-30 02:52:00","description":"Last year I had a panhandling epiphany. Until then, I was one of those people who actively avoided panhandlers. Not only that, but I disparaged my friends who gave them money. Suckers!","filename":"data/vaneerConsumption/Apanhandlingepiphany.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30_a-panhandling-epiphany-20181030__page=1_1540908925.html","title":"A panhandling epiphany","title_page":"A panhandling epiphany","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Last year I had a panhandling epiphany. Until then, I was one of those people who actively avoided panhandlers. Not only that, but I disparaged my friends who gave them money. Suckers!\nOver years of studious practice I had honed my avoidance techniques. I escaped eye contact whenever possible. (Like a toddler, I had the magical belief that if I didn't see them, maybe they wouldn't see me.)\nSo it was serendipitous when the chavurah I belong to decided to have a program about panhandling. For those who aren't familiar, a chavurah is a small Jewish fellowship group that assembles to share communal experiences, usually without the benefit of a rabbi or a permanent location. Our group meets twice a month at different members' homes, we eat (mandatory), and usually have a program or speaker.\nThat day changed my thinking permanently. One of our members gave an introduction about the Jewish perspective on charity. Then an experienced social worker talked about her homeless clients, almost all of whom suffer from mental illness, alcoholism or drug addiction. Virtually without exception, she said, these are the panhandlers we see on the street.\nIn the social worker's opinion, if someone is on the street asking for money, it's because they need it. It doesn't matter if it's for a cup of coffee or a fix--they need it, and they don't have any other way to get it, no judgment necessary. So if you can spare it, you should give it.\nIt was as if a light bulb exploded in my head. Was it that simple? Is giving a dollar to a street person really any different than writing a check to organized philanthropy? Ultimately, I realized, it's just a matter of scale.\nSo now I always keep a few dollar bills in my glove compartment. I make eye contact when I see someone in need on the street. I try to exchange a few meaningful words or pleasantries. Some folks I know carry water, or candy bars, or even sandwiches, in lieu of money.\nI almost always get an appreciative response that is way out of proportion to the dollar I give. Last weekend I passed the squeegee kids. I didn't want my windshield cleaned, so I waved off the kid on my side with a dollar in my hand and the admonition to stay safe (the Jewish mother in me is never far away). As the one on the passenger side walked down the narrow lane between the cars, he reached out his squeegee and traced a heart on my windshield.\nAll people want to be seen. I've learned that it's much less about the dollar I give, and more about acknowledging our shared humanity. When I see the stranger, they also see me.\nEditorial on 10/30/2018","url":"https://www.arkansasonline.com/news/2018/oct/30/a-panhandling-epiphany-20181030/?page=1"}
