{"authors":["Associated Press"],"date_download":"2018-10-23 01:44:23","date_modify":"2018-10-23 01:44:23","date_publish":"2017-03-10 10:14:07","description":"SEOUL, South Korea (AP) - This was not supposed to happen in South Korea. It was too divided, too corrupt, too much in thrall to the rich and powerful who'd...","filename":"data/vaneerConsumption/APAnalysisSouthKoreansstunnedbyleadersrapidouster.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/22/wire-198349-1489184967-535_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300672_AP-Analysis-Upending-status-quo-shakes-South-Korea_1540259063.html","title":"AP Analysis: South Koreans stunned by leader's rapid ouster","title_page":"AP Analysis: South Koreans stunned by leader's rapid ouster | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SEOUL, South Korea (AP) - This was not supposed to happen in South Korea. It was too divided, too corrupt, too much in thrall to the rich and powerful who'd always had their way.\nFour months ago, the idea that the country's leader, along with the cream of South Korean business and politics, would be knocked from command after sustained, massive, peaceful protests would have been ludicrous.\nNow Park Geun-hye, thanks to a court ruling Friday, is no longer president and may very well face criminal extortion and other charges. The head of the country's biggest company, Samsung, sits in jail, when he's not in a courtroom facing trial for bribery and embezzlement linked to the corruption scandal that felled Park. And a Who's Who of once untouchables languishes behind bars waiting for their day in court.\nProtesters open a bottle of champagne to celebrate during a rally calling for impeachment of President Park Geun-hye near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed the impeached president from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Lee Jin-man)\nThis swift upending of the status quo has so shaken the country's foundations that it has left people here a bit stunned.\nNow comes the hard part.\nSouth Koreans will look to take their peaceful revolution - and the genuine sense of empowerment that many of the average citizens who took to the streets in protest, week after week, now feel at their accomplishment - and turn it into lasting progress.\nAmong the first of the many big, uneasy questions that linger over this enterprise: What happens next?\nIn the short term, at least, the answer is more politics, and of the lightning-quick variety. Half a dozen or so candidates will now scramble, over the next two months, for a shot at becoming the next president of South Korea. Elections will likely come May 9.\nThe current smart money is on a liberal - Moon Jae-in, who lost to Park in 2012 and who now leads in early polls - but conservatives, though in disarray and currently viewed as toxic by many South Koreans of all political stripes, still have strong bastions of support in the country's south, if a charismatic candidate arises.\nThe qualities of the next leader will help answer another fundamental question: Will the confidence that many won from South Korea's version of \"people power\" last?\nSouth Korea is no stranger to rapid, intense change. The country whiplashed from Japan's colonization to total war in the 1950s, to an economic \"miracle\" of rebuilding supported by a brutal dictatorship, to one of the world's most successful democracies.\nJust below the surface have always lurked deep social and political divisions - between conservative and liberal, rich and poor, men and women. The entrenched elite often seemed to just chug along, untouched. If they did topple from power or privilege, it was because of violent change, when the streets filled with tear gas and riots, not, as in past months, singing, smiling families of all social classes and political backgrounds.\nPark's fall may have shattered that pattern.\nAmong the changes: an energized citizenry who can now point to concrete proof that they can make a real difference when they're united, and an eagerness among civic groups to build on their ability to turn popular anger into peaceful protests that actually worked.\nThere's no guarantee that any of this will last.\n\"Now is a critical transition moment,\" said John Delury, an Asia expert at Yonsei University in Seoul. \"Starting tomorrow, the question is, where does all this energy go? The unifying factor was a focus on getting rid of a problem. Now, they have to figure out, how do you turn that energy into something more constructive than destructive?\"\nIf Moon, the leading liberal candidate, wins the presidency, one big change could be North Korea.\nMoon was an aide in the 2000s to late liberal President Roh Moo-hyun who pursued the so-called Sunshine Policy. This rapprochement effort with the North included big trade and cultural exchanges, and was criticized, and later scrapped, by conservatives because Pyongyang was simultaneously expanding its nuclear weapons and missiles programs.\nMoon as president would push for more dialogue with the North and would likely reopen an industrial park in the North that was jointly run by the Koreas before Park closed it last year following a nuclear test and long-range rocket launch by Pyongyang.\nThe reaction to this possible new approach from conservatives in Japan and the United States, and, indeed, from the numerous South Koreans who distrust Pyongyang, will be just one of many unknowns that will play out as South Korea enters this new political realm.\nWhoever leads will have an unusually strong mandate in what has typically been a starkly divided country.\nFor this momentum to last, South Koreans may have to resist a natural urge to relax, to bask.\nOne conservative newspaper, the Herald Business, likened what South Koreans have just gone through to the chaos at the end of World War II, when the Korean Peninsula was liberated from Japanese rule and then divided by U.S. and Soviet forces.\nThe paper suggested in a Friday editorial that people should \"calmly return to their daily lives.\"\nThe next months will see if a newly inspired public, fresh off of flooding the nation's streets until their leaders acted, embrace that advice.\n___\nFoster Klug, AP's Seoul bureau chief, has covered the Koreas since 2005. Follow him at www.twitter.com/apklug\nSupporters of South Korean President Park Geun-hye cry during a rally opposing her impeachment near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed impeached President Park Geun-hye from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Ahn Young-joon)","url":"https://www.dailymail.co.uk/wires/ap/article-4300672/AP-Analysis-Upending-status-quo-shakes-South-Korea.html"}
