{"authors":["Joseph D. Lyons"],"date_download":"2018-10-31 00:01:48","date_modify":"2018-10-31 00:01:48","date_publish":"2018-10-28 19:36:23","description":"It's not just the Parkland student survivors who are making their voices heard ahead of the midterms to protest gun control measures — it's the parents of those killed, too. Manuel Oliver, a Parkland father, printed a 3D sculpture of his son to…","filename":"data/vaneerConsumption/AParklandDadPrintedA3DSculptureOfHisSonToProtest3DPrintedGuns.json","image_url":"https://imgix.bustle.com/uploads/image/2018/10/28/b71de447-890b-45fe-85b5-ebf140d68cb2-wedemand.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_a-parkland-dad-printed-a-3d-sculpture-of-his-son-to-protest-3d-printed-guns-13010780_1540944108.html","title":"A Parkland Dad Printed A 3D Sculpture Of His Son To Protest 3D-Printed Guns","title_page":"A Parkland Dad Printed A 3D Sculpture Of His Son To Protest 3D-Printed Guns","title_rss":"NULL","source_domain":"bustle.com","text":"It's not just the Parkland student survivors who are making their voices heard ahead of the midterms to protest gun control measures — it's the parents of those killed, too. Manuel Oliver, a Parkland father, printed a 3D sculpture of his son to protest 3D-printed guns potentially becoming legal and he put the sculpture in Times Square.\nThe 3D version of his son Joaquin Oliver, called \"Guac\" by his friends, is being hailed by Oliver as the first \"3D-printed activist,\" ABC News reported. Oliver unveiled the statue — which is styled wearing the same clothes Joaquin wore on the day that he died — last week. It also has other details that are commemorative of the real-life Joaquin.\n\"Joaquin belongs to a new generation of dead kids and that generation of dead kids is growing and growing and growing every single day,” Oliver said in Times Square, caught on video by Now This news. \"And Guac is back to let you understand what happens when we let these laws get out of our hands.\"\nOliver and his wife Patricia started a non-profit after their son's death called Change the Ref, which works to empower young people throughout the country. They have also done other art installations to draw awareness to the need for gun safety, including a mural outside the National Rifle Association convention in May showing President Trump dressed as the ringleader of a circus.\nThe sculpture comes in response to a move by gun access group Defense Distributed to sue to allow plans for printing 3D guns to be distributed online. Oliver explained why this angered him in a video he uploaded to YouTube before unveiling the sculpture. \"So I'm trying to bring some kind of conscious laws to here and​ these guys are trying to expand the crazy gun laws,\" Oliver said. \"We need to find a way to hit it in their faces.\"\n\"What we're doing is we're having a 3D-printed activist,\" Oliver continued, \"which happens to be Joaquin.... This is going to be printed in 3D just the same way the guns are printed. We're going to use the same system to fight them back.\"\nFor the time being, the plans for 3D guns are still not allowed online. A federal judge found that the Defense Distributed plan to release the information online could cause \"irreparable harm\" and placed a restraining order on the initial agreement to release them — the case is still working its way through the courts.\nThe unveiling was emotional for Oliver. \"This is the first time since February that I can see an image of my son standing next to me,\" he said at the event, ABC News reported. \"Not a good feeling, but the idea here is to make it a powerful moment for the rest of you.\"\nChange the Ref on YouTube\nThe power for those watching was the goal all along. \"Of course, this guy’s not replacing my son. Of course not,\" Oliver told Now This News of the Joaquin sculpture. \"But part of the story is to share those painful moments with the rest of the people.\"\nOliver is also clear about the art installation project being the right path for him — even if others try to pressure politicians in other ways. \"You won’t see me in line in Washington D.C. waiting to talk to a legislator to try to tell him what’s going on with my family,” he added in the video. “I’d rather do this.\"","url":"https://www.bustle.com/p/a-parkland-dad-printed-a-3d-sculpture-of-his-son-to-protest-3d-printed-guns-13010780"}
