{"authors":["Kipp Jones"],"date_download":"2018-10-30 19:22:56","date_modify":"2018-10-30 19:22:56","date_publish":"2015-07-07 03:18:57","description":"According to court documents obtained by the AP, Bill Cosby admitted that he bought sedatives with the intent of giving them to young women.","filename":"data/vaneerConsumption/APBillCosbyAdmittedHeBoughtDrugsIntendedforSexwithYoungWomen.json","image_url":"https://media.breitbart.com/media/2015/05/ap_bill-cosby_ap-photo-1024x753.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_07_06__1540927376.html","title":"AP: Bill Cosby Admitted He Bought Drugs Intended for Sex with Young Women","title_page":"AP: Bill Cosby Admitted He Bought Drugs Intended for Sex with Young Women | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"According to court documents obtained by the Associated Press, Bill Cosby admitted in a 2005 deposition that he previously purchased powerful sedatives with the intent of giving them to young women he wished to have sex with.\nFormer Temple University employee Andrea Constand accused the TV icon of drugging and sexually assaulting her a decade ago inside his Pennsylvania home, but the comedian settled the suit under confidential terms in 2006.\nThe AP had been in court in Philadelphia seeking to have documents from the deposition made public, which is something attorneys for Cosby had fought on the grounds they might embarrass him.\nDespite objections from Cosby’s legal team, the documents were released Monday and reveal, during testimony in the 2005 sexual assault suit, Cosby admitted to receiving seven Quaalude prescriptions during the 1970s.\nOn Sept. 29, 2005, attorneys for Constand asked Cosby why he still had the pills two decades later, after they had been made illegal, but the 77-year-old didn’t answer the question after an objection from his attorney.\nDolores M. Troiani, who was representing the plaintiff, then asked: “When you got the Quaaludes, was it in your mind that you were going to use these Quaaludes for young women that you wanted to have sex with?”\nCosby reportedly then answered, “Yes.”\nThe comedian also admitted to giving Quaaludes to at least one woman, and “others,” and two of those women testified in the case they knowingly took the drug from Cosby.\nSince last fall, Cosby has been accused of drugging and/or sexually assaulting dozens of women but has never been criminally charged and has maintained his innocence.","url":"https://www.breitbart.com/entertainment/2015/07/06/bill-cosby-admitted-he-bought-drugs-intended-for-sex-with-young-women/"}
