{"authors":[],"date_download":"2018-10-30 01:25:19","date_modify":"2018-10-30 01:25:19","date_publish":"2016-12-05 00:05:49","description":null,"filename":"data/vaneerConsumption/APerfectTimetoExpandEducationSavingsAccounts.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/12/9991637396_f7814d7bee_z.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862719.html","title":"A Perfect Time to Expand Education Savings Accounts","title_page":"A Perfect Time to Expand Education Savings AccountsThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Back on St. Patrick’s Day, Sen. John McCain (R-AZ) introduced the Native American Education Opportunity Act, which would set up education savings accounts (ESAs) for children attending Bureau of Indian Education (BIE) schools in states where ESAs are available for other students. Because BIE schools are federally funded, Native American children attending them in Arizona, for example, are not eligible for the state’s ESA program.\nSince making it through the Senate Committee on Indian Affairs in early September, it has languished in the Senate, where it has been waiting for consideration for more than three months. Now that last month’s election has guaranteed school-choice-supporting Republicans will have control of both houses of Congress and the White House, the bill truly deserves a full vote. Let’s remember too that November was Native American Indian Heritage Month. The time to act is past due.\nBIE schools educate only 8 percent of the country’s Indian children — which amounts to about 42,000 students attending 183 schools on 64 reservations located in 23 states — but public education, in general, has been consistently failing these kids. According to the latest National Indian Education Study undertaken by the National Center for Education Statistics, on average, Indian fourth graders score 16 percentage points lower and Indian eighth graders 19 percentage points lower in mathematics on the National Assessment of Educational Progress, better known as the Nation’s Report Card, compared to non-Indian students. Reading scores are no better; fourth graders score 19 percentage points lower and eighth graders 13 percentage points lower.\nSadly, there are no signs of improvement. These scores have been virtually stagnant (and in some cases, they have been worse) since 2005.\nDespite these dismal results, the NAEP scores for Indian students in public schools were much higher than their BIE peers. In reading, fourth graders scored 22 percentage points higher than their BIE counterparts. Eighth graders scored 19 percentage points higher. Math scores were also higher for non-BIE students in both fourth and eighth grade; they scored 14 percentage points higher and 12 percentage points higher, respectively.\nAstoundingly, BIE schools are not only failing children, they are doing so with a big price tag. They spend $15,000 per student on average, which is roughly $4,300 above the national average.\n“You cannot make an argument that the BIE schools have not failed. There’s study after study, story after story about the terrible conditions that exist in BIE schools,” McCain said in August. “There’s no measurement that would indicate that BIE schools are doing anything but failing.”\nESAs give parents the option to use state education funds that would have otherwise gone toward sending their children to a traditional public school. These funds can be used to help pay for tuition and fees at a private school or to purchase textbooks, online education programs, or private tutoring services.\nOpponents of ESAs argue the programs drain money from public schools, negatively impacting the students left behind, while also increasing racial segregation at private and public schools. The evidence, however, simply does not back up these assertions.\nIn May 2016, what was then the Friedman Foundation for Educational Choice (now EdChoice) released a report examining 100 empirical studies on school choice programs. Eighteen of these studies used random assignment to measure outcomes, referred to in academia as the “gold standard.” According to the report, “Students who apply for a voucher enter randomized lotteries to determine who will receive the voucher and who will remain in a public school; this allows researchers to track very similar ‘treatment’ and ‘control’ groups, just like in medical trials.”\nOf the 18 gold standard studies, 14 show education choice improved student outcomes. Only two studies — both conducted on Louisiana’s much-discussed voucher program — show negative outcomes, which the author says is largely due to private schools being “scared away” by “an expectation of hostile future action from regulators.” (Subsequently, a third study showing negative outcomes for voucher recipients, this time in Ohio, has been released.)\nThirty-three of the studies examined in the report weighed the effect education choice has had on outcomes for children still in public schools, and overwhelmingly they found that education choice improved outcomes for public school students. Only one of the studies reported negative outcomes for public school students as a result of school choice programs.\nTwenty-five of the 28 studies measuring the fiscal impact of school choice policies found the studied programs save taxpayer money; the other three found the studies to be revenue neutral. Not a single empirical study found school choice programs have had a “negative fiscal impact.”\nNine of the 10 studies looking into school choice programs’ effect on racial segregation found school choice helps to integrate schools by moving students out of schools that tend to be more highly segregated. Not one empirical study examined by EdChoice found school choice programs increased segregation.\nThe overwhelming majority of the available empirical evidence makes it clear educational choice offers families equal access to high-quality schools that meet widely diverse needs and desires. They also are able to accomplish this at a lower cost and while simultaneously benefiting public school students. ESAs can give all Indian parents currently stuck with BIE a greater opportunity to meet their child’s unique education needs. The goal should be to allow every parent to choose, require every school to compete, and give every child an opportunity to attend a quality school. There has been no better time to act than now.","url":"https://spectator.org/native-american-indian-heritage-month-the-perfect-time-to-act-on-mccains-esa-bill/"}
