{"authors":["Associated Press"],"date_download":"2018-10-23 00:17:19","date_modify":"2018-10-23 00:17:19","date_publish":"2017-03-10 06:29:30","description":"SEOUL, South Korea (AP) - After months of a political scandal that has crippled South Korea, President Park Geun-hye on Friday was stripped of her powers by...","filename":"data/vaneerConsumption/APExplainsWhatsbehindousterofSouthKoreanleader.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/07/wire-194499-1489129756-317_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300104_AP-Explains-Whats-ouster-South-Korean-leader_1540253839.html","title":"AP Explains: What's behind ouster of South Korean leader","title_page":"AP Explains: What's behind ouster of South Korean leader | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SEOUL, South Korea (AP) - After months of a political scandal that has crippled South Korea, President Park Geun-hye on Friday was stripped of her powers by the Constitutional Court.\nAllegations that Park's long-time friend and daughter of a cult leader with no official role in the administration pulled government strings from the shadows has united many in a state of boiling rage. Other players who were caught in the widening scandal include Park's advisers and the Samsung heir. Here's a breakdown:\n___\nProtesters take a selfie after the Constitutional Court's verdict during a rally calling for impeachment of President Park Geun-hye near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed impeached President Park Geun-hye from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Lee Jin-man)\nTIES THAT BIND\nAt the center of the tempest is Choi Soon-sil, also known as Choi Seo-won, who is sometimes compared to Rasputin, the Russian mystic who gained power in the early 20th century through his influence over the tsar. Park and Choi met in the 1970s, around the time Park was acting as first lady. Her mother was killed during a 1974 assassination attempt on her father, military strongman Park Chung-hee. Choi's father, a shadowy figure named Choi Tae-min, was a Buddhist monk, a religious cult leader and a Christian pastor at different times. He emerged as the younger Park's mentor. Park became president of New Spirit, a patriotic group set up by Choi's father, and Choi Soon-sil was reportedly head of the group's college unit - the two women are seen talking at a New Spirit event in a 1979 government video. Rumors swirled that New Spirit allowed the Choi clan to build a fortune by using their connection to the Park family to collect bribes.\nIn 1990, Park resigned as chairman of a separate foundation over suspicions that she allowed the Choi family to manipulate it for personal gain. Choi Soon-sil, whose ex-husband is a former close aide of Park's, reportedly built a fortune during the 1980s and 1990s through real estate investments in affluent neighborhoods in southern Seoul.\n___\nSTACKS OF PRESIDENTIAL REPORTS\nAfter weeks of speculation, Park acknowledged in 2016 that Choi had edited some presidential speeches and helped with \"public relations.\" A raft of media stories, however, portrays a much deeper involvement. The liberal Hankyoreh newspaper, for instance, citing a former Choi associate, reported that a senior presidential aide gave thick stacks of government draft reports to Choi on a daily basis. Choi then allegedly discussed the issues with her friends and sent back recommendations to the president. The newspaper reported that Choi made recommendations about the last remaining symbol of inter-Korean cooperation, the jointly run Kaesong factory park in North Korea that was eventually shut down. Choi is also said to have used her relationship with Park to win special favors for Choi's daughter and to pressure businesses to contribute money to two nonprofit foundations that Choi helped create and that she then looted for her own use.\n___\nSAMSUNG CONNECTION\nAccording to prosecutors, Lee Jae-yong, the de-facto Samsung boss, used Samsung corporate funds to buy expensive horses for Choi's daughter. He also allegedly gave or promised 43.3 billion won ($38 million) to four entities controlled by Choi. Investigators say the money was given to obtain government backing for a contentious merger of two Samsung companies in 2015 that served as a key step in passing corporate control to Lee from his ailing father. Lee has denied the allegations, but was arrested last month on charges including bribery.\n___\nLINKS TO A DICTATOR\nThe scandal struck a deep chord in a country that has only recently emerged into a vibrant, rich democracy after decades of colonization, war, poverty, dictatorship and deep-seated corruption. There is outrage that someone with Choi's colorful past might have not only exploited her ties to Park for massive financial gain and favor but also made important state decisions. Part of the anger is linked to the legacy of Park's dictator father. Revered by many for rebuilding from the rubble of war, critics say Park Chung-hee engineered his economic turnaround while committing massive human rights abuses and allowing widespread corruption by his friends.\n___\nAssociated Press writer Kim Tong-hyung contributed to this report.\nProtesters react after hearing the Constitutional Court's verdict during a rally calling for impeachment of President Park Geun-hye near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed impeached President Park Geun-hye from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Lee Jin-man)\nSupporters of South Korean President Park Geun-hye shout during a rally opposing her impeachment near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed impeached President Park Geun-hye from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Ahn Young-joon)","url":"https://www.dailymail.co.uk/wires/ap/article-4300104/AP-Explains-Whats-ouster-South-Korean-leader.html"}
