{"authors":["Laurel Rosenhall"],"date_download":"2018-10-30 22:51:25","date_modify":"2018-10-30 22:51:25","date_publish":"2016-03-30 08:00:00","description":"Can a Democrat cross environmentalists and labor unions and still keep her seat in the California Legislature? Assemblywoman Cheryl Brown (D-San","filename":"data/vaneerConsumption/ApivotalraceforCaliforniaDemocrats.json","image_url":"https://calmatters.org/wp-content/uploads/Cheryl_Brown_AP_crop.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939885.html","title":"A pivotal race for California Democrats","title_page":"A pivotal race for California Democrats | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Can a Democrat cross environmentalists and labor unions and still keep her seat in the California Legislature?\nAssemblywoman Cheryl Brown (D-San Bernardino) is putting that question to the test.\nAfter two terms in the statehouse, Brown is facing a challenge from the left as she runs for re-election. Environmentalists and union leaders unhappy with Brown’s voting record have thrown their support behind another Democrat, attorney Eloise Gomez Reyes.\nThe Democrat-on-Democrat battle is significant beyond the boundaries of their Inland Empire district. It reflects tensions that can arise from longer term-limits as well as ongoing power struggles in the Capitol: labor vs. business, environmentalists vs. oil companies, progressive Democrats vs. moderates. And it reveals an attempt by the political left to knock down the mounting clout business-friendly Democrats hold in Sacramento.\n“There is no race in the state that is going to draw more attention or have more significance than the campaign against Cheryl Brown,” said David Townsend, a Sacramento political consultant who supports Brown and is closely tied with the caucus of moderate Democrats.\nThough Brown has the powerful endorsement of the California Democratic Party – which comes with the potential for huge financial support – Reyes backers appear ready for a fight. They recently filed an ethics complaint against Brown that is being investigated by the state’s political watchdog. A campaign of big spending from both sides is likely to follow as interest groups vie to influence the direction of the Democratic-controlled Legislature.\n“We never dreamed (Brown) would be as anti-environment as she is turning out to be,” said Reyes supporter Penny Newman, executive director of the Center for Community Action and Environmental Justice. “She clearly has picked a side.”\nBrown and her fellow business-friendly Democrats wielded power last year by siding with the oil industry in opposing key elements of Gov. Jerry Brown’s climate-change agenda for California. They stripped a provision from one bill that would have cut vehicle petroleum use in half by 2030. And they killed another that sought to drastically reduce greenhouse gas emissions by 2050.\nThis bloc of Democrats has also opposed legislation backed by labor unions. In 2013, Brown helped defeat a bill aimed at Wal-Mart that would have made large employers pay a penalty if their workers earn so little money that they qualify for public health care. She voted against a bill to protect grocery workers’ jobs for 90 days after a store is bought by another company.\nAssembly Speaker Anthony Rendon (D-Paramount) called Brown “a good Democrat” and said he will soon travel to San Bernardino to help her campaign.\n“We are prepared to spend whatever we need to run a winning campaign,” Rendon said.\nThe two Democrats are working hard to knock each other out in the open primary where Republican Aissa Sanchez will also be on the ballot.\n“There’s a lot of people outside of our community who have decided they don’t like what I do,” said Brown, 72. “I vote my district and our district is a little different. … It’s more of a moderate district.”\nThe solidly Democratic region has little public transportation, Brown said, so residents rely on their cars to get to work. And some of the bills backed by labor unions would have hurt small businesses, she said. Brown calls her position pragmatic, but Reyes supporters say she is influenced by campaign support from the business community.\nThe oil and gas industry helps fund Townsend’s PAC that backs moderate Democrats. It’s also poured more than $73,000 into Brown’s campaigns over the last five years.\n“When your decision-making is clouded by the funds you receive, that’s a problem,” Reyes said.\n“So long as we keep saying it’s a poor community, we can’t afford to clean up the air because we need jobs that require lots of gas – as long as we keep saying that, we are keeping our community down.”\nReyes, 60, ran unsuccessfully for Congress in 2014. Her Assembly campaign is supported by the United Food and Commercial Workers union, which provided about 12 percent of the $126,000 she raised in 2015. She’s also received many donations from lawyers and law firms.\nOne Reyes supporter said Brown’s business-friendly voting record prompted him to research her financial ties and file a complaint with the Fair Political Practices Commission, which has decided to open an investigation.\n“She’s been absent, abstaining or voting against the core issues of the Democratic Party she claims to be a member of,” said Timothy Prince, vice president of the San Bernardino Democratic Luncheon Club.\nHis complaint stems from the Brown family’s longtime ownership a publishing company that produces the Black Voice News. Brown has listed businesses that advertise in the paper — including the California Lottery — as sources of income on her financial disclosure reports. By voting for a 2013 bill that was financially beneficial to the Lottery as she was receiving income from it, the complaint alleges Brown engaged in a conflict of interest.\nBrown has since transferred the publishing company to her daughter, but Prince said the Lottery case points to larger problems.\n“She and her daughter have received advertising revenue from a half-dozen corporations with business before the Legislature,” Prince said. “They know they’re buying influence.”\nBrown dismissed the complaint as a laughable dig by her political rivals.\n“That is far fetched,” Brown said. “But they are going to do all the things they do.”","url":"https://calmatters.org/articles/a-pivotal-race-for-california-democrats/"}
