{"authors":["Associated Press"],"date_download":"2018-10-22 23:55:48","date_modify":"2018-10-22 23:55:48","date_publish":"2017-03-10 05:09:26","description":"Trump transition knew Flynn might register as foreign agentWASHINGTON (AP) - President Donald Trump's transition team learned before the inauguration that...","filename":"data/vaneerConsumption/APNewsinBriefat904pmEST.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300048_AP-News-Brief-12-04-m-EST_1540252548.html","title":"AP News in Brief at 9:04 p.m. EST","title_page":"AP News in Brief at 9:04 p.m. EST | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Trump transition knew Flynn might register as foreign agent\nWASHINGTON (AP) - President Donald Trump's transition team learned before the inauguration that incoming National Security Adviser Michael Flynn might register with the government as a foreign agent, White House officials acknowledged Friday.\nThe disclosure suggests that Trump transition lawyers did not view Flynn's lobbying work for a Turkish businessman as a liability for an official who serves as the president's closest adviser on security and international affairs. It also raises new questions about whether Trump's transition team, and later his White House lawyers, fully vetted Flynn.\nFlynn's registration this week with the Justice Department disclosed lobbying by him and his firm that may have benefited the government of Turkey.\nTrump fired Flynn last month on other grounds - that he misled Vice President Mike Pence and other White House officials about his conversations with Russia's ambassador to the U.S. Flynn's registration comes amid intense scrutiny over his and other Trump associates' potential contacts with Russia. The FBI is investigating, as are House and Senate intelligence committees.\nFlynn registered with the Justice Department on Tuesday, citing $530,000 worth of lobbying. His work on behalf of a company owned by Turkish businessman Ekim Alptekin occurred at the same time he was advising Trump's presidential campaign.\n___\nGOP plan less generous than Obamacare for older Americans\nWASHINGTON (AP) - Republicans hate \"Obamacare,\" so House GOP leaders freak out whenever their health care bill is compared to President Barack Obama's law. But one reason some conservatives are branding the bill \"Obamacare Lite\" comes down to the tax credits to help consumers buy insurance.\nBoth tax credits target people who don't get health insurance from their employer or from the government. They are both available to people even if they don't make enough money to owe any federal income tax. And they are both entitlement programs - if you meet the criteria, you are entitled to the benefit.\nBut there are significant differences in the size and reach of the tax credits.\nThe Obamacare tax credits are designed to limit the share of income that people have to spend on health insurance.\nThe GOP tax credits are simpler, but consumers might still have to pay a large share of their income to obtain health insurance.\n___\nHouse GOP health bill would cut women's services\nWASHINGTON (AP) - Women seeking abortions and some basic health services, including prenatal care, contraception and cancer screenings, would face restrictions and struggle to pay for some of that medical care under the House Republicans' proposed bill.\nThe legislation, which would replace much of former President Barack Obama's health law, was approved by two House committees on Thursday. Republicans are hoping to move quickly to pass it, despite unified opposition from Democrats, criticism from some conservatives who don't think it goes far enough and several health groups who fear millions of Americans would lose coverage and benefits.\nThe bill would prohibit for a year any funding to Planned Parenthood, a major provider of women's health services, restrict abortion access in covered plans on the health exchange and scale back Medicaid services used by many low-income women, among other changes.\nWashington Sen. Patty Murray, the top Democrat on the Health, Labor, Education and Pensions Committee, said the legislation is a \"slap in the face\" to women. She said it would shift more decisions to insurance companies.\n\"You buy it thinking you will be covered, but there is no guarantee,\" Murray said.\n___\nCredibility of Congress' Russia probes still in question\nWASHINGTON (AP) - As congressional investigations into Russia's interference in the 2016 election are ramping up, so is the political division, raising questions about whether lawmakers' work will be viewed as credible.\nThe House this week scheduled its first public hearing, which some swiftly dismissed as political theater. Even as lawmakers began to review classified information at CIA's headquarters, Democrats continued to call for an independent panel and special prosecutor.\nThe dynamic underscored the escalating concerns about whether the Republican-led investigations will have the funding, focus and, perhaps most importantly, bipartisan buy-in to produce findings that are broadly accepted and definitive.\n\"To be honest, we don't know yet,\" said Rep. Adam Schiff, the ranking Democrat on the House intelligence committee, which is conducting a probe in the House. \"I can't say for certain whether that will be possible. I can only say it is very much in the national interest that we do so. Because we cannot allow this to become another Benghazi committee.\"\nBoth Republicans and Democrats have their examples of misguided or failed investigations. For Democrats the cautionary tale is the years-long probe into the 2012 attack on the U.S. diplomatic compound in Benghazi, Libya. Congress spent millions on the effort and the Benghazi committee held four public hearings. But Democrats consistently dismissed it as a political witch hunt aimed at Hillary Clinton.\n___\nTravel ban challenge puts Hawaii's few Muslims in spotlight\nHONOLULU (AP) - Hawaii has 5,000 or so Muslims- less than 1 percent of the state's population- who are finding themselves thrust into an international spotlight after the state's top lawyer launched a challenge to President Donald Trump's revised travel ban, saying it contradicts the islands' welcoming culture that values diversity.\nNamed as a plaintiff in the federal lawsuit fighting the ban is Ismail Elshikh, the imam of the island of Oahu's only mosque - a converted plantation-style house in a hilly Honolulu neighborhood a few miles from Waikiki beach where Muslims who gather in the prayer room know they're facing Mecca when the view of iconic Diamond Head is at their backs.\nElshikh's mother-in-law is a Syrian living in Syria who won't be able to visit her relatives in Hawaii because of the ban, and that will deprive the rights of Elshikh, his wife and their children as U.S. citizens, said Hawaii Attorney General Doug Chin.\nIt was difficult for the shy and reserved Elshikh to make the decision to join the lawsuit and he is not speaking publicly because of legal reasons and fears for his security in a state that has seen a rise in threats to Muslims that started just before Trump was elected, said Hakim Ouansafi, who is the president of the Muslim Association of Hawaii.\n\"It took some thinking. It took some convincing,\" Ouansafi said.\n___\nA robust February jobs report points to resilient US economy\nWASHINGTON (AP) - U.S. employers added a robust 235,000 jobs in February and raised pay at a brisk pace - signs that a resilient economy has given many companies the confidence to hire in anticipation of solid growth ahead.\nWith the unemployment rate dipping to a low 4.7 percent from 4.8 percent, the job market appears to be fundamentally healthy or nearly so.\nFriday's employment report from the government showed that more people began looking for jobs last month, an encouraging sign that they've grown confident about their prospects. Hiring was strong enough to absorb those new job seekers as well as some of the previously unemployed.\nThe picture of an economy on solid footing nearly eight years after the Great Recession ended has made it all but certain that the Federal Reserve will raise interest rates next week and signal the likelihood of additional rate hikes ahead.\nFebruary's jobs report was the first to cover a full month under President Donald Trump. During the presidential campaign, Trump had cast doubt on the validity of the government's jobs data, calling the unemployment rate a \"hoax.\"\n___\nUN says world faces largest humanitarian crisis since 1945\nUNITED NATIONS (AP) - The world faces the largest humanitarian crisis since the United Nations was founded in 1945 with more than 20 million people in four countries facing starvation and famine, the U.N. humanitarian chief said Friday.\nStephen O'Brien told the U.N. Security Council that \"without collective and coordinated global efforts, people will simply starve to death\" and \"many more will suffer and die from disease.\"\nHe urged an immediate injection of funds for Yemen, South Sudan, Somalia and northeast Nigeria plus safe and unimpeded access for humanitarian aid \"to avert a catastrophe.\"\n\"To be precise,\" O'Brien said, \"we need $4.4 billion by July.\"\nWithout a major infusion of money, he said, children will be stunted by severe malnutrition and won't be able to go to school, gains in economic development will be reversed and \"livelihoods, futures and hope will be lost.\"\n___\n3rd protester dies as S. Korea braces for more rallies\nSEOUL, South Korea (AP) - South Korean police on Saturday braced for more violence between opponents and supporters of ousted President Park Geun-hye, who was stripped of her powers by the Constitutional Court over a corruption scandal that has plunged the country into a political turmoil.\nThree people died and dozens were injured in clashes between police and Park's supporters after the ruling Friday, according to police, which detained seven protesters for questioning.\nThe Seoul Metropolitan Police Agency was planning to deploy nearly 20,000 officers and hundreds of buses to separate the two crowds, whose passionate rallies have divided the streets near the presidential palace in the past several weekends as the scandal worsened.\nThe court's decision capped a stunning fall for the country's first female leader. Park rode a wave of lingering conservative nostalgia for her late dictator father to victory in 2012, only to see her presidency crumble as millions of furious protesters filled the nation's streets.\nThe ruling allows possible criminal proceedings against the 65-year-old Park - prosecutors have already named her a criminal suspect - and makes her South Korea's first democratically elected leader to be removed from office since democracy replaced dictatorship in the late 1980s.\n___\nAP Analysis: South Koreans stunned by leader's rapid ouster\nSEOUL, South Korea (AP) - This was not supposed to happen in South Korea. It was too divided, too corrupt, too much in thrall to the rich and powerful who'd always had their way.\nFour months ago, the idea that the country's leader, along with the cream of South Korean business and politics, would be knocked from command after sustained, massive, peaceful protests would have been ludicrous.\nNow Park Geun-hye, thanks to a court ruling Friday, is no longer president and may very well face criminal extortion and other charges. The head of the country's biggest company, Samsung, sits in jail, when he's not in a courtroom facing trial for bribery and embezzlement linked to the corruption scandal that felled Park. And a Who's Who of once untouchables languishes behind bars waiting for their day in court.\nThis swift upending of the status quo has so shaken the country's foundations that it has left people here a bit stunned.\nNow comes the hard part.\n___\nTop Marine asks women to 'trust us' in nude-photo inquiry\nWASHINGTON (AP) - Fewer than 10 women victims have come forward so far in the investigation into nude photos of female service members that were posted online without their permission, the top Marine general said Friday. He pleaded with female Marines to \"trust us\" and reach out to make complaints or seek help.\n\"I need their help,\" said Gen. Robert Neller, the Marine commandant. \"I'm going to ask them to trust us. I understand why that might be a bit of a reach for them right now. But I can't fix this. ... The only way there is going to be accountability in this is somebody comes forward and tells us what happened to them.\"\nFormer and current female Marines have said their photographs and those of women in other services were shared on social media without their consent. The other military services say that they are now looking into the matter to see if their service members are involved, but they say so far no other victims have come forward.\nNude photographs of female Marines and other women were shared on the Facebook page \"Marines United,\" and the accompanying posts included obscene and threatening comments.\nThe Naval Criminal Investigative Service launched an investigation into the matter and is urging victims of the photo-sharing to come forward. NCIS says it has received numerous tips.","url":"https://www.dailymail.co.uk/wires/ap/article-4300048/AP-News-Brief-12-04-m-EST.html"}
