{"authors":["Associated Press"],"date_download":"2018-10-22 22:36:33","date_modify":"2018-10-22 22:36:33","date_publish":"2017-04-26 05:05:21","description":"Trump considers action on NAFTA ahead of 100-day markWASHINGTON (AP) - The Trump administration is considering a draft executive order to withdraw the U.S....","filename":"data/vaneerConsumption/APNewsinBriefat1104pmEDT.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446282_AP-News-Brief-12-04-m-EDT_1540247793.html","title":"AP News in Brief at 11:04 p.m. EDT","title_page":"AP News in Brief at 11:04 p.m. EDT | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Trump considers action on NAFTA ahead of 100-day mark\nWASHINGTON (AP) - The Trump administration is considering a draft executive order to withdraw the U.S. from the North American Free Trade Agreement with Mexico and Canada - though administration officials caution it's just one of a number of options currently being discussed by the president and his staff.\nSenior White House officials have been discussing steps that can be taken to start the process of renegotiating or withdrawing from NAFTA before the end of President Donald Trump's first 100 days in office, according to a person familiar with the president's thinking. Trump railed against the decades-old trade deal during his campaign, describing it as a \"disaster.\"\nBut the person, along with an administration official, who spoke on the condition of anonymity in order to discuss internal deliberations, said a number of options remain on the table, and discussions are ongoing about the best way to proceed.\nWhite House Press Secretary Sean Spicer declined to comment on the order, which was first reported by Politico.\n\"The president has made addressing the problems of NAFTA a priority throughout the campaign, and once the president makes a decision about how he wants to address that, we'll let you know,\" he said.\n___\nTrump team softens war talk, vows other pressure on NKorea\nWASHINGTON (AP) - The Trump administration told lawmakers Wednesday it will apply economic and diplomatic pressure on North Korea to dismantle its nuclear weapons program, as an extraordinary White House briefing served to tamp down talk of military action against an unpredictable and increasingly dangerous U.S. adversary.\nPresident Donald Trump welcomed Republican and Democratic senators before his secretary of state, defense secretary, top general and national intelligence director conducted a classified briefing. The same team also met with House members in the Capitol to outline the North's escalating nuclear capabilities and U.S. response options to what they called an \"urgent national security threat.\"\nAfter weeks of unusually blunt military threats, the joint statement by the agency chiefs said Trump's approach \"aims to pressure North Korea into dismantling its nuclear, ballistic missile and proliferation programs by tightening economic sanctions and pursuing diplomatic measures with our allies and regional partners.\" It made no specific mention of military options, though it said the U.S. would defend itself and friends.\nThe unprecedented meeting in a building adjacent to the White House reflected the increased American alarm over North Korea's progress in developing a nuclear-tipped missile that could strike the U.S. mainland. A flurry of military activity, by North Korea and the U.S. and its partners on and around the divided Korean Peninsula, has added to the world's sense of alert.\nWhile tensions have increased since Trump took office, they've escalated dramatically in recent weeks as American and other intelligence agencies suggested the North was readying for a possible nuclear test. Although such an explosion hasn't yet occurred, Trump has sent high-powered U.S. military vessels and an aircraft carrier to the region in a show of force, while the North conducted large-scale, live-fire artillery drills, witnessed by national leader Kim Jong Un, earlier this week.\n___\n10 Things to Know for Thursday\nYour daily look at late-breaking news, upcoming events and the stories that will be talked about Thursday:\n1. WHAT'S IN TRUMP TAX PLAN\nPresident Donald Trump proposes dramatic tax cuts for U.S. businesses and individuals, outlining an overhaul his administration promises will spur economic growth while simplifying the tax code's tangle of rules.\n2. HOW US IS HANDLING NORTH KOREA\nThe Trump administration tells lawmakers it will apply economic and diplomatic pressure on North Korea to dismantle its nuclear weapons program, tamping down talk of military action.\n___\nTrump tax cut: Huge, vague and likely mild boost for economy\nWASHINGTON (AP) - President Donald Trump's team boasted Wednesday that its tax-cut plan would lighten Americans' financial burdens, ignite economic growth and vastly simplify tax filing.\nYet the proposal so far remains short of vital details, including how it would be paid for. And based on the few specifics spelled out so far, most experts suggest that it would add little to growth while swelling the budget deficit and potentially handing large windfalls to wealthier taxpayers.\nTrump's plan would replace the current seven income tax brackets with three, and the top bracket would drop from 39.6 percent to 35 percent. It would also slash the corporate rate from 35 percent all the way to 15 percent, a boon to most companies even though many don't pay the full tax now. With tax credits and other loopholes, most corporations pay closer to 20 percent, according to calculations by JPMorgan.\nPerhaps the most contentious plank would enable taxpayers with business income - including those wealthy enough to pay the top tax rate - to instead pay the new 15 percent corporate rate. That's because Trump would apply the corporate rate to \"pass through\" businesses. Pass-throughs include partnerships such as law firms and hedge funds as well as most small businesses - from the local florist to the family-owned restaurant on Main Street.\nWhat's more, some privately held large companies - including Trump's own real estate empire - are structured as pass-throughs and would benefit, too.\n___\nJury sentences ambush killer to death in Pennsylvania\nMILFORD, Pa. (AP) - A bell tolled the fate of a gunman after a jury on Wednesday condemned him to die for shooting two Pennsylvania troopers at their barracks in a late-night ambush, killing one and leaving a second with devastating injuries.\nEric Frein, 33, was sentenced by a jury to death by lethal injection a week after his conviction on charges including murder of a law enforcement officer and terrorism.\nProsecutors said Frein was hoping to start an uprising against the government when he opened fire with a rifle on the Blooming Grove barracks in the Pocono Mountains in 2014. Cpl. Bryon Dickson II, a Marine veteran and married father of two, was killed in the late-night ambush, and Trooper Alex Douglass was critically wounded.\nFrein showed no emotion as the decision was read, while someone on the police side of the gallery shouted \"Yes!\" The injured trooper couldn't stop smiling.\nDefense lawyer Bill Ruzzo told reporters he was disappointed by the sentence, and surprised the jury failed to find a single mitigating circumstance that would point to a life sentence.\n___\nAmericans offer hope, prayer in assessing Trump's 100 days\nThey are young and old: a high school student who can't yet vote, a Vietnam vet who did so proudly. They hail from all corners of the United States and very different walks of life: a \"downhome boy\" from Kentucky, a third-generation Mexican-American from Texas, a stay-at-home mom in Pennsylvania, an Iranian immigrant in Los Angeles.\nSome oppose Donald Trump and all that he stands for, while others voted enthusiastically for him. Now, they are critiquing him.\nOne hundred days into Trump's presidency, The Associated Press returned to some of the everyday people interviewed these past months to ask them to write a letter to the president, evaluating the job he's done so far and looking ahead to the months to come.\nOne supporter tells the president he \"might have fallen a little short\" - on Obamacare, in particular - but he signs off \"with hope.\" A refugee implores Trump to \"make America more friendly,\" but finds optimism in the president's reaction to this month's chemical attack in Syria: \"I hope this is a turning point.\" A Trump objector calls his biggest accomplishment \"waking up the public to fight.\" She offers this advice: \"Make decisions with your heart. It will give you wisdom.\"\n___\n___\nHere's what could be next for Trump's sanctuary cities order\nSAN FRANCISCO (AP) - President Donald Trump is lashing out at a judge's ruling blocking his attempt to strip funds from \"sanctuary cities\" that don't cooperate with U.S. immigration authorities, calling it \"ridiculous\" and vowing to go to the U.S. Supreme Court.\nIt was the third Trump executive order on immigration to be thwarted by the federal courts.\nHere is a look at Tuesday's ruling and what lies ahead:\n___\nWHAT DID THE FEDERAL JUDGE SAY ABOUT THE SANCTUARY CITIES ORDER?\n___\nNew US office seeks to aid victims of crimes by immigrants\nWASHINGTON (AP) - Stymied on his top immigration initiatives, President Donald Trump is making good on one plan that critics denounce as fearmongering and misleading: opening an office for victims of crimes committed by immigrants, although studies show immigrants are less likely to commit crimes than native-born citizens.\nHomeland Security Secretary John Kelly on Wednesday opened the office dubbed the Victims of Immigrant Crime Engagement, or VOICE. He said it will be used to keep victims informed of the immigration proceedings of suspects and generally walk them through the complicated and often drawn-out immigration court process. The office will be staffed by Immigration and Customs Enforcement employees.\nKelly focused his brief remarks on immigrant criminals in the country illegally, saying they never should have been in the United States and able to carry out crimes. But the ICE officials will also aid victims of crimes attributed to immigrants living in the United States legally, a group that could include permanent residents.\nThe Trump administration has frequently highlighted crimes committed by immigrants in the country illegally and the cases receive widespread attention in pro-Trump news outlets, often more than comparable crimes committed by U.S. citizens. But the administration has not provided statistics about the crimes or countered studies indicating that immigrants are less likely than native-born Americans to commit crimes.\nWhen asked how many crimes have been attributed to immigrants, Homeland Security spokesman David Lapan said \"too many.\"\n___\nWitnesses reflect on LA's Rodney King riot 25 years later\nLOS ANGELES (AP) - Dee Young remembers April 29, 1992, the way most Americans of a certain age recall Sept. 11 - it's indelibly etched in his memory as the day his world and that of thousands of others changed forever.\nThe 27-year-old tow-truck driver had stopped for a hamburger at a popular South Los Angeles fast-food joint that afternoon when he saw hordes of shouting, angry people carrying armloads of booze from a liquor store next door.\nHe soon learned he was witnessing the beginning of one of the worst race riots in American history, and it was unfolding in the neighborhood where he rode bikes and flew kites during a childhood he remembers as idyllic.\nThe violence erupted after four white police officers were acquitted of assault and other charges in the beating of black motorist Rodney King, which was captured on video the year before. The footage showed officers repeatedly striking, kicking and using a stun gun on King, even after he was on the ground.\nAlthough the uprising seemed to catch the nation and the Los Angeles Police Department by surprise, longtime residents say tensions had been building in South Los Angeles for years and the King verdict was just the tipping point.\n___\nIndia blocks social media in Kashmir in wake of abuse videos\nSRINAGAR, India (AP) - India has ordered internet service providers in Indian-controlled Kashmir to block Facebook, Twitter and 20 other social media sites and online applications for one month, after several videos and photos depicting alleged abuses of Kashmiris by Indian security forces sparked outrage and fueled protests.\nThe government said the restrictions ordered Wednesday were made \"in the interest of maintenance of public order.\" But Pranesh Prakash, policy director for the Indian advocacy group the Center for Internet and Society, called it a \"blow to freedom of speech\" and \"legally unprecedented in India.\"\n\"It not only violates the Indian constitution but also violates international law,\" he said.\nThe government has often halted internet service in the region in the past in an attempt to prevent anti-India demonstrations from being organized. But this is the first time authorities have shut down social media following the circulation of videos of alleged abuse by Indian soldiers.\nSeveral recent clips, captured in the days surrounding a violence-plagued local election April 9, have proven to be especially powerful and have helped to intensify anti-India protests.","url":"https://www.dailymail.co.uk/wires/ap/article-4446282/AP-News-Brief-12-04-m-EDT.html"}
