{"authors":["Kerri Jarema"],"date_download":"2018-10-31 01:43:10","date_modify":"2018-10-31 01:43:10","date_publish":"2018-08-27 22:00:52","description":"It might be nearing September, but summer never has to end for the bibliophile who lands the coveted job at Philip Blackwell's new bookstore at the Soneva Fushi resort in the Maldives. That's right, a bookshop will soon be opening on the remote…","filename":"data/vaneerConsumption/APopUpBookstoreIsOpeningInTheMaldivesOneOfYourFellowBookLoversCouldBeRunningTheShow.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/437c8bd5-2b51-4d44-ace3-9acde2287208-shutterstock_541460146.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_a-pop-up-bookstore-is-opening-in-the-maldives-one-of-your-fellow-book-lovers-could-be-running-the-show-10245315_1540950190.html","title":"A Pop-Up Bookstore Is Opening In The Maldives & One Of Your Fellow Book-Lovers Could Be Running The Show","title_page":"A Pop-Up Bookstore Is Opening In The Maldives & One Of Your Fellow Book-Lovers Could Be Running The Show","title_rss":"NULL","source_domain":"bustle.com","text":"It might be nearing September, but summer never has to end for the bibliophile who lands the coveted job at Philip Blackwell's new bookstore at the Soneva Fushi resort in the Maldives. That's right, a bookshop will soon be opening on the remote island, and one lucky book-lover is going to get to help run the entire operation. It might sound too good to be true, but the store is just the latest in a string of operations being opened up around the world by lifelong bookseller Philip Blackwell. Blackwell's bookshop, which was founded in Oxford in 1879, has been run by the Blackwell family ever since. But when Philip Blackwell left the business in 2006, he knew he didn't want to leave the book world behind for good. That led to him starting up his Ultimate Library Project in 2007.\nThe project — which was initially inspired by Blackwell's own travels as a bibliophile, and his struggles to find high quality books at the hotels he stayed in — is committed to helping build up bespoke book collections for hotels like the Soneva Fushi. And it's so far been a success, with Blackwell now running more than 250 projects around the world, including more than 30 luxury hotels and resorts. For every hotel library supplied, the company also helps donate a library to a local institution that can benefit those who live in the area.\nFor the Maldives project, Ultimate Library have teamed up with the 5-star luxury resort and Phaidon Press, a leading global publisher of the creative arts, to open the first pop-up bookshop there. According Blackwell, the collection will focus in on illustrated art, design, style, and cookery tomes, as well as explorations of the Indian ocean, marine life and natural environment. But the \"barefoot bookseller\" who gets to call the island home will not only be selling books, though.\nWhile the job description simply calls for someone who will \"have a passion for books and the ability to engage guests of all ages\" there will be a bit more to the position than just a passion for reading. The bookseller will also be tasked with running a blog detailing all of their island adventures, which will be for a three-month placement starting in Nov. 2018. The bookseller will also be asked to give out book recommendations, run storytimes for their children, and generally live that exhilarating desert island life we've all fantasized about on at least one groggy Monday morning. But you may have to learn to enjoy the sunshine and feeling of living in paradise, because the pay is apparently... not great. In a statement made to The Guardian, Philip Blackwell said, \"The pay is derisory but the fringe benefits, unparalleled.\" (Bustle reached out to Blackwell to inquire about future opportunities and the benefits, but hadn't heard back as of publication.)\nApplications for the position have already been closed, so if you didn't get your resume in, you'll just have to wait for Blackwell's next big project. But, for book-lovers everywhere who want to live vicariously through one of their own, keep an eye out for the barefoot bookseller's blog come Nov. 2018, when the shop is scheduled to be opened. Just try not to cry your eyes out at the gorgeous landscapes and well-stocked shelves, and obligatory drinks with little umbrellas in them.","url":"https://www.bustle.com/p/a-pop-up-bookstore-is-opening-in-the-maldives-one-of-your-fellow-book-lovers-could-be-running-the-show-10245315"}
