{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 19:44:51","date_modify":"2018-10-30 19:44:51","date_publish":"2015-02-04 18:43:37","description":"The purported deal would offer the U.S. only 20% of what it wants, and would seem to confirm reports from Israeli sources last week that Iran will receive 80% of what it wants. Once, the U.S. had agreed that a bad deal would be worse than none. |","filename":"data/vaneerConsumption/AppeasementUSMayGet20ofWhatItWantsinIranNuclearDeal.json","image_url":"https://media.breitbart.com/media/2015/01/hassan-rouhani-flag-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_04__1540928691.html","title":"Appeasement: U.S. May Get 20% of What It Wants in Iran Nuclear Deal","title_page":"Appeasement: U.S. May Get 20% of What It Wants in Iran Nuclear Deal | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Associated Press reported Wednesday that Iran may keep most of its 10,000 (known) nuclear centrifuges running in the nuclear deal that is emerging with the U.S. and five other world powers, on the condition it slows enrichment down.\nThe U.S. initially sought to reduce Iran’s centrifuge array to 2,000. Then American negotiators offered 4,500. Iran refused to compromise on the number of centrifuges. Existing UN Security Council resolutions ban any Iranian enrichment at all.\nThe purported deal would offer the U.S. only 20% of what it wants, and would seem to confirm reports from Israeli sources last week that Iran will receive 80% of what it wants. Once, the U.S. had agreed that a bad deal would be worse than none.\nIsraeli Prime Minister Benjamin Netanyahu, who will address Congress next month but will not be invited to the White House, called the interim deal that took effect over a year ago a “historic mistake,” and is expected to repeat that argument.\nIt is unclear what the U.S. has gained from the negotiations, and the Obama administration appears to want a deal at any price. President Barack Obama appears to be offering Iran status as a “regional power” as part of what he has called a “new equilibrium.”\nWhile talks have continued, Iran has not only expanded its nuclear program–contrary to President Obama’s claims–but has also expanded its regional presence, operating near Israel’s border and gaining strategic control of the Mandeb Strait.\nSenior Editor-at-Large Joel B. Pollak edits Breitbart California and is the author of the new ebook, Wacko Birds: The Fall (and Rise) of the Tea Party, available for Amazon Kindle.\nFollow Joel on Twitter: @joelpollak","url":"https://www.breitbart.com/national-security/2015/02/04/appeasement-u-s-may-get-20-of-what-it-wants-in-iran-nuclear-deal/"}
