{"authors":["Liam Deacon"],"date_download":"2018-10-30 18:26:31","date_modify":"2018-10-30 18:26:31","date_publish":"2018-07-18 17:05:06","description":"Judges have delayed a decision on an appeal by activist Tommy Robinson against a conviction for contempt of court.","filename":"data/vaneerConsumption/AppealAgainstPrejudicedTommyRobinsonJailingDelayed.json","image_url":"https://media.breitbart.com/media/2018/05/Screen-Shot-2018-05-30-at-13.20.18.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_07_18__1540923991.html","title":"Appeal Against 'Prejudiced' Tommy Robinson Jailing Delayed","title_page":"Appeal Against 'Prejudiced' Tommy Robinson Jailing Delayed","title_rss":"NULL","source_domain":"breitbart.com","text":"Senior British Judges have delayed a decision on an appeal by activist Tommy Robinson against a conviction for contempt of court, with his lawyers arguing there have been procedural “deficiencies” giving rise to “prejudice”.\nThe Court of Appeal is now expected to reveal a judgement on the independent journalist and street organiser’s imprisonment by the end of July. The case sparked huge public interest earlier this year after information about the case was wiped from the British media and reporting banned on the orders of a judge.\nRobinson was jailed in May after admitting contempt of court by filming outside Leeds Crown Court during a trial. Reporting on the case of an alleged rape gang had also been restricted.\nThe activist was hit with 13-months in jail for contempt of court, and had been brought before judges and jailed within 24 hours of his arrest.\nUKIP leader Gerard Batten has defended Mr Robinson, claiming the law was harshly and unfairly applied to him. Ahead of the appeal ruling, on Wednesday morning, he tweeted:\n“He has written and told me the basis of his appeal but asked me not to reveal it before the hearing. It’s uncertain if the Judge will give his verdict today but as soon as I know I will tweet what news there is.”\nTommy Robinson latest. Outside the High Court with Ezra Levant of Rebel Media. The Court said they will deliver their judgement on his appeal by the end of July. The initial indications are optimistic for his release. Three Judges considering the submission of lawyers. We’ll see pic.twitter.com/Ivjkd9Vwtk — Gerard Batten MEP (@GerardBattenMEP) July 18, 2018\nDuring the hearing, Mr. Robinson’s representative, Jeremy Dein QC, said the sentence handed to him in the city of Leeds was “manifestly excessive” and claimed his client was being kept in conditions of virtual solitary confinement at Onley prison, according to The Guardian.\nSimply communicating with Robinson had been difficult as it took so long for him to be brought out from his cell, he added. He demanded the case was quashed and called for Robinson to be released on the grounds that he had already served seven weeks in jail.\nFurthermore, which parts of the contempt laws Mr Robinson had broken were not revealed, Dein said. “The proceedings were unnecessarily and unjustifiably rushed. They were conducted in haste.”\nHe also explained that his client had offered to have the live stream deleted when in court. “He did not act with impertinent defiance.”","url":"https://www.breitbart.com/europe/2018/07/18/appeal-against-prejudice-tommy-robinson-jailing-delayed-remains-prison/"}
