{"authors":["Associated Press"],"date_download":"2018-10-23 03:11:33","date_modify":"2018-10-23 03:11:33","date_publish":"2016-01-29 17:56:37","description":"WASHINGTON (AP) — A federal appeals court on Friday gave new life to a lawsuit by a group of Holocaust survivors seeking damages from Hungary for its role in...","filename":"data/vaneerConsumption/AppealscourtrevivesHolocaustsuitagainstHungary.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423055_Appeals-court-revives-Holocaust-suit-against-Hungary_1540264293.html","title":"Appeals court revives Holocaust suit against Hungary","title_page":"Appeals court revives Holocaust suit against Hungary | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Appeals court revives Holocaust suit against Hungary\nWASHINGTON (AP) — A federal appeals court on Friday gave new life to a lawsuit by a group of Holocaust survivors seeking damages from Hungary for its role in the deaths of more than 500,000 Jews during World War II.\nThe ruling by the U.S. Court of Appeals for the District of Columbia Circuit said a 1947 peace treaty between the Allied powers and Hungary does not give Hungarian officials immunity from the lawsuit. A federal judge had dismissed the case in 2014, saying it would conflict with the treaty's terms.\nThe lawsuit filed by 14 survivors, including four living in the United States, accuses the Hungarian government and its national railway of collaborating with the Nazis to transport Jews to death camps and seize their property.\nThe case now returns to the lower court, which still must consider whether the case can move forward before the survivors exhaust their legal options in Hungary.\nIn a similar lawsuit against Hungary filed in Chicago, a federal appeals court there ruled last year that survivors and heirs must first pursue legal action in Hungarian courts.\nWriting for the court in Washington, Judge Sri Srinivasan rejected Hungary's arguments that the peace treaty offers the only means for Holocaust victims to seek compensation for property taken during the war.\nSrinivasan also rejected the government's claims that the case raised political questions that should not be resolved in the courts.\n\"The wartime wrongs inflicted upon Hungarian Jews by the Hungarian government are unspeakable and undeniable,\" Srinivasan said. He said federal law allows the victims to pursue claims \"involving the taking of the plaintiffs' property in the commission of genocide against Hungarian Jews.\"\nThe survivors filed the lawsuit in 2010 with the goal of pursuing a class-action case against Hungary and its railway on behalf of all Hungarian Holocaust survivors and family members of Holocaust victims. The railroad played a key role in the genocide, transporting more than 400,000 Hungarian Jews to the Auschwitz death camp in Poland over a period of two months in 1944.","url":"https://www.dailymail.co.uk/wires/ap/article-3423055/Appeals-court-revives-Holocaust-suit-against-Hungary.html"}
