{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 20:10:54","date_modify":"2018-10-30 20:10:54","date_publish":"2015-05-30 17:35:18","description":"A federal appeals court has ruled that Idaho’s law banning abortions past the fifth month of pregnancy is unconstitutional.","filename":"data/vaneerConsumption/AppealsCourtIdaho20WeekAbortionPainLawUnconstitutional.json","image_url":"https://media.breitbart.com/media/2015/05/baby-22-weeks-AP-PhotoLoyola-University-Medical-Center-A.-Hayashi.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_30__1540930254.html","title":"Appeals Court: Idaho 20-Week Abortion Pain Law Unconstitutional","title_page":"Appeals Court: Idaho 20-Week Abortion Pain Law Unconstitutional | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A federal appeals court has ruled that Idaho’s law banning abortions past the fifth month of pregnancy is unconstitutional.\nThe Hill reports the 9th Circuit Court of Appeals claimed Idaho’s law violates the Supreme Court’s ruling in 1992 in Planned Parenthood v. Casey, which affirmed the earlier Roe v. Wade decision, and said unborn babies may be aborted up to the point at which they are viable outside their mother’s wombs.\n“Because [Idaho’s law] places an arbitrary time limit on when women can obtain abortions, the statute is unconstitutional,” Judge Harry Pregerson wrote for the majority of the three-judge panel.\n“Two [judges] were appointees of Democratic presidents and one of a Republican president,” notes The Hill.\nAs Breitbart News reported, the U.S. House of Representatives passed a similar measure earlier in May. The Pain-Capable Unborn Child Protection Act passed by a vote of 242-184 on the second anniversary of the murder conviction of abortionist Kermit Gosnell, who was charged with killing infants who survived abortion procedures and with the negligent death of one of his abortion patients.\nThe House bill passed as a recent study was published in the New England Journal of Medicine that found more very premature babies are surviving outside the womb with fewer health problems due to medical advances.\nAccording to Marjorie Dannenfelser, president of the pro-life Susan B. Anthony List, the Pain-Capable bill “to protect the most innocent among us is an opportunity for clarity heading into the 2016 elections. Protecting pain-capable babies and mothers at risk during a late-term abortion is a winning issue and one that has unified the entire Republican presidential field.”\nThe United States is one of only seven nations that allow elective abortions after 20 weeks post-fertilization.\nAs The Hill reports, the 9th Circuit also struck down the 20-week abortion ban in Arizona in 2013.","url":"https://www.breitbart.com/politics/2015/05/30/appeals-court-idaho-20-week-abortion-pain-law-unconstitutional/"}
