{"authors":["Associated Press"],"date_download":"2018-10-23 02:28:34","date_modify":"2018-10-23 02:28:34","date_publish":"2017-03-16 12:59:33","description":"LONDON (AP) - England's national rugby team has a chance to post a winning streak that merits comparison with some of the most memorable in sports.If the...","filename":"data/vaneerConsumption/APPHOTOSMemorablewinningstreaksinsportshistory.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/12/wire-228435-1489669176-556_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320146_AP-PHOTOS-Memorable-winning-streaks-sports-history_1540261714.html","title":"AP PHOTOS: Memorable winning streaks in sports history","title_page":"AP PHOTOS: Memorable winning streaks in sports history | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"LONDON (AP) - England's national rugby team has a chance to post a winning streak that merits comparison with some of the most memorable in sports.\nIf the team beats Ireland on Saturday in Dublin in the Six Nations, it will set a record of 19 straight wins for a top-ranked side. That will be one better than New Zealand, which won the most recent World Cup in 2015 during a record-breaking 18-match winning run.\nHere are a few momentous winning streaks over the past century with accompanying photos from The Associated Press archive:\nFILE - In this November 1928 file photo, Johnny Weissmuller is shown competing in an international swimming tournament at the Tamagawa pool on the outskirts of Tokyo. In an amateur career spanning eight years he never lost a race. England's rugby team will be seeking to post its own record winning streak by beating Ireland on Saturday, March 18, 2017 to become the first team at rugby's highest level to win 19 matches in a row. (AP Photo, File)\n___\nBEFORE TARZAN\nJohnny Weissmuller may be better known as Tarzan. But before he launched his trademark yell, Weissmuller was the greatest swimmer in the world. For eight years from 1921, he didn't lose a race, setting countless records and winning five Olympic gold medals. No one stood a chance in the jungle - or in the pool.\n___\nTHE REAL ROCKY\nRocky Marciano's achievements in the heavyweight division will take something special to be matched. Between 1947 and 1955, he won all 49 of his fights. For those who saw him and his brute force up close, especially when he knocked out former champ Joe Louis, there have been few fighters like \"The Brockton Blockbuster.\"\n___\nBOXING'S LONGEST\nMarciano's unbeaten record may be the most memorable streak in boxing history, but it's not the longest. That honor goes to Mexican fighter Julio Cesar Chavez, who in the 13 years after turning pro in 1980 didn't lose a fight - 87 of them across three weight divisions. The run ended when he drew with American rival Pernell Whitaker in a fight in Texas.\n___\nSPAIN SHINES\nFor decades, the Spain's national soccer team was one of the sport's great underachievers. Then, the 2008 European Championship happened and Spain won its first major tournament in 44 years. After its quarterfinal victory over Italy on penalties, Spain embarked on a run of 15 straight wins, a record for a national team that ended when the United States beat the team in June 2009. Spain recovered just fine, however, going on to win the World Cup in 2010 and Euro 2012.\n___\nWRESTLING'S 'RUSSIAN BEAR'\nAlexander Karelin was as dominant a figure in Greco-Roman wrestling as anyone in any sport. For 13 years, the Russian super-heavyweight was unbeaten and was expected to win his fourth gold medal at the 2000 Olympics in Sydney. His loss to American wrestler Rulon Gardner for the gold medal ranks as one of sport's greatest shocks.\n___\nDOMINANT DECADE\nTwo-time Olympic champion Edwin Moses won 122 consecutive 400-meter hurdle races for a decade from 1977, one of the most memorable streaks in track and field. His loss in Spain to American teammate Danny Harris was a sign of things to come - he took bronze at the 1988 Seoul Olympics.\n___\nCRICKETING DOUBLE\nAt the turn of the millennium, Australia was embarking on a period of dominance in cricket. The team, which had a raft of top-notch batsmen and two of the greatest bowlers in history in spinner Shane Warne and fast bowler Glenn McGrath, turned in a record run of 16 straight test match victories between October 1999 and March 2001. The team was so good that it matched that winning streak later in the decade.\n___\nSKIING SUPREMO\nIngemar Stenmark is considered the greatest gate skier of all time, his high-point the double gold at the 1980 Lake Placid Olympics. That was no real surprise given that Stenmark was seemingly unbeatable at the time, particularly in the giant slalom. His gold medal run was part of a 16-race winning streak in giant salmon events in which he competed.\n___\nKING OF CLAY\nThere is little doubt that Rafael Nadal is the greatest clay-court player in tennis history with his record nine French Open titles. But he also went on an 81-match winning streak early in his career- the longest on a single surface in the Open era. Roger Federer brought the run to an end at the 2007 Hamburg Masters, but Nadal got his revenge in the French Open final soon after.\n___\nNEAR-FAULTLESS\nMartina Navratilova won a record 74 straight matches from February until December 1984. After winning the French Open, Wimbledon and U.S. Open, Navratilova appeared destined to complete the Grand Slam at the Australian Open, then played on her favorite surface - grass. But Navratilova lost to Helena Sukova Czechoslovakia in the semifinals.\nFILE - In this Saturday, Oct. 31, 2015 file photo, New Zealand's captain Richie McCaw holds the Rugby world cup trophy aloft after his team's final victory over Australia at Twickenham in London. The victory formed part of New Zealand's record 18-match winning streak at the highest level, a mark that England hopes to overtake on Saturday, March 18, 2017 when it plays Ireland. (AP Photo/Tim Ireland, File)\nFILE - In this June 17, 1954 file photo, heavyweight champion Rocky Marciano strikes challenger Ezzard Charles with a right uppercut in their title bout at Yankee Stadium, New York. Marciano ended his career with a perfect 49-0 record. England's rugby team will be seeking to post its own record winning streak by beating Ireland on Saturday, March 18, 2017 to become the first team at rugby's highest level to win 19 matches in a row. (AP Photo, File)\nFILE - In this Saturday, May 13, 1989 file photo, Julio Cesar Chavez lands a left jab to the chin of Roger Mayweather during their WBC light-welterweight title match at the Forum in Inglewood, California. Chavez's victory in the bout was part of a record 87-fight winning streak. England's rugby team will be seeking to post its own record winning streak by beating Ireland on Saturday, March 18, 2017 to become the first team at rugby's highest level to win 19 matches in a row. (AP Photo/Bob Galbraith, File)\nFILE - In this Sunday, June 29, 2008 file photo, the Spanish team celebrates with the trophy after winning the Euro 2008 final against Germany in Vienna. Spain's victory was part of a record 15-match winning streak for a national side. England's rugby team will be seeking to post its own record winning streak by beating Ireland on Saturday, March 18, 2017 to become the first team at rugby's highest level to win 19 matches in a row. (AP Photo/Bernat Armangue, File)\nFILE - In this Tuesday, July 23, 1996 file photo, Russia's Alexander Karelin, top, holds down Greece's Panayiotis Poikilidis during their 130 kg Olympic Greco-Roman wrestling semi-final match in Atlanta. Karelin's victory formed part of a remarkable 13-year winning streak. England's rugby team will be seeking to post its own record winning streak by beating Ireland on Saturday, March 18, 2017 to become the first team at rugby's highest level to win 19 matches in a row. (AP Photo/Michael Probst, File)\nFILE - This is a Monday, Aug. 8, 1983 file photo of U.S. 400-m-hurdle world record holder Edwin Moses during the semifinal in Helsinki, at the World Track and Field Championships. His victory was part of a record 122-race winning streak. England's rugby team will be seeking to post its own record winning streak by beating Ireland on Saturday, March 18, 2017 to become the first team at rugby's highest level to win 19 matches in a row. (AP Photo/Lennox McLendon, File)\nFILE - In this Sunday June 11, 2006 file photo, Spain's Rafael Nadal falls on the clay as he defeats Switzerland's Roger Federer in the men's final of the French Open tennis tournament in Paris. His victory was part of a record 81-game winning streak on clay. England's rugby team will be seeking to post its own record winning streak by beating Ireland on Saturday, March 18, 2017 to become the first team at rugby's highest level to win 19 matches in a row. (AP Photo/Francois Mori, File)\nFILE - In this June 1984 file photo, Martina Navratilova stretches to reach the ball during a singles' match at Wimbledon in London. Navratilova won a record 74 straight matches in 1984, including 13 straight tournaments. England's rugby team will be seeking to post its own record winning streak by beating Ireland on Saturday, March 18, 2017 to become the first team at rugby's highest level to win 19 matches in a row. (AP Photo/Adam Stoltman, File)","url":"https://www.dailymail.co.uk/wires/ap/article-4320146/AP-PHOTOS-Memorable-winning-streaks-sports-history.html"}
