{"authors":["Associated Press"],"date_download":"2018-10-22 22:22:17","date_modify":"2018-10-22 22:22:17","date_publish":"2017-03-16 03:29:14","description":"KUALA LUMPUR, Malaysia (AP) - A teddy bear. A Bible. A photo of a beloved mother who died years ago.Refugees live for years out of suitcases in poverty, many...","filename":"data/vaneerConsumption/APPHOTOSRefugeesandtheirmostpreciouspossessions.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/03/wire-226151-1489634962-587_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318758_AP-PHOTOS-Refugees-precious-possessions_1540246937.html","title":"AP PHOTOS: Refugees and their most precious possessions","title_page":"AP PHOTOS: Refugees and their most precious possessions | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"KUALA LUMPUR, Malaysia (AP) - A teddy bear. A Bible. A photo of a beloved mother who died years ago.\nRefugees live for years out of suitcases in poverty, many envisioning their future in America. They own very little and will bring even less, but everyone has at least one precious item that they were planning to bring to the place they call their \"fatherland.\"\nThe odds of that happening just dropped precipitously.\nIn this Saturday, March 11, 2017, photo, Burmese Christian refugee Sarah,10, poses for a photograph with her favorite teddy bear in Kuala Lumpur, Malaysia. \"I'd like to take them all, she said. \"This is my favorite bear. This is the bear I would take,\" she said. Refugees live for years out of suitcases, many envisioning their future in America. They own very little and will bring even less, but everyone has at least one precious item that they were planning to bring to the place they call their \"fatherland.\" (AP Photo/Joshua Paul)\nPresident Donald Trump's travel ban \"to keep the bad dudes out\" aims to stop people from six Muslim countries from entering to the U.S. this year and suspends refugees from arriving for 120 days. But the executive order also includes a sweeping 55 percent reduction in refugee visas overall, from a planned 110,000 to 50,000 this year. This means, across the board, 60,000 refugee visas would not be issued after all. Trump's executive order had been set to take effect Thursday, but a federal judge put it on hold hours before it was to take effect.\nAn Associated Press analysis of 10 years of refugee data finds the most impacted group are persecuted Burmese refugees, thousands of whom are persecuted in their home country because of their religion, brought to them decades ago by American missionaries. They're Christians.\nIn this Saturday, March 11, 2017, photo, a 13-year-old Burmese Christian refugee explains one of her favorite drawings during an interview in Kuala Lumpur, Malaysia. \"I will bring my sketch pad. I want to be a doctor, and an artist,\" she said. Refugees live for years out of suitcases, many envisioning their future in America. They own very little and will bring even less, but everyone has at least one precious item that they were planning to bring to the place they call their \"fatherland.\" (AP Photo/Joshua Paul)\nIn this Saturday, March 11, 2017, photo, a Burmese Christian refugee places a framed photo of her late mother on a table during an interview in Kuala Lumpur, Malaysia. \"I will bring this photograph of my mother with me,\" she said. Refugees live for years out of suitcases, many envisioning their future in America. They own very little and will bring even less, but everyone has at least one precious item that they were planning to bring to the place they call their \"fatherland.\" (AP Photo/Joshua Paul)\nIn this Saturday, March 11, 2017, photo, Tin, a Burmese Christian refugee, leafs through her Bible to share her favorite scripture during an interview in Kuala Lumpur, Malaysia. \"As refugees we have nothing,\" Tin said. \"But everywhere I go I will bring my Bible, nothing else.\" Refugees live for years out of suitcases, many envisioning their future in America. They own very little and will bring even less, but everyone has at least one precious item that they were planning to bring to the place they call their \"fatherland.\" (AP Photo/Joshua Paul)\nIn this Saturday, March 11, 2017, photo, a 16-year-old Burmese Christian refugee holds her mathematics book in her during an interview in Kuala Lumpur, Malaysia. \"My ambition is to be an engineer, so i will bring this mathematics book,\" she said. Refugees live for years out of suitcases, many envisioning their future in America. They own very little and will bring even less, but everyone has at least one precious item that they were planning to bring to the place they call their \"fatherland.\" (AP Photo/Joshua Paul)\nIn this Saturday, March 11, 2017, photo, a mobile phone shows the English translation the favorite Bible scripture of Tin, a Burmese Christian refugee, during an interview in Kuala Lumpur, Malaysia. Refugees live for years out of suitcases, many envisioning their future in America. They own very little and will bring even less, but everyone has at least one precious item that they were planning to bring to the place they call their \"fatherland.\" (AP Photo/Joshua Paul)","url":"https://www.dailymail.co.uk/wires/ap/article-4318758/AP-PHOTOS-Refugees-precious-possessions.html"}
