{"authors":["Associated Press"],"date_download":"2018-10-23 00:51:46","date_modify":"2018-10-23 00:51:46","date_publish":"2017-04-26 10:50:23","description":"PRIPYAT, Ukraine (AP) - A bulletin board in the Ukrainian town of Pripyat still bears an edition of the Sovietsky Patriot newspaper, dated three days before...","filename":"data/vaneerConsumption/APPhotosChernobylsghosttowndrawsdaringvisitors.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/16/wire-466165-1493220665-235_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447036_AP-Photos-Chernobyls-ghost-town-draws-daring-visitors_1540255906.html","title":"AP Photos: Chernobyl's ghost town draws daring visitors","title_page":"AP Photos: Chernobyl's ghost town draws daring visitors | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"PRIPYAT, Ukraine (AP) - A bulletin board in the Ukrainian town of Pripyat still bears an edition of the Sovietsky Patriot newspaper, dated three days before the nuclear explosion that turned the city into one of the world's most baleful ghost towns.\nOnce home to some 50,000 people whose lives were connected to the Chernobyl nuclear power plant, Pripyat was hastily evacuated one day after a reactor at the plant 3 kilometers (2 miles) away exploded on April 26, 1986. The explosion and the subsequent fire spewed a radioactive plume over much of northern Europe.\nOnce a model Soviet workers' town - neat high-rise apartment buildings and streets converging on a plaza that housed a hotel and a cultural center - Pripyat is now a model of technology gone catastrophically wrong. As such, it's become a tourist destination, alluring to those whose bucket-list includes a taste of danger.\nThis photo taken Wednesday, April 5, 2017, shows a gymnasium in a school in the deserted town of Pripyat, some 3 kilometers (1.86 miles) from the Chernobyl nuclear power plant Ukraine. Once home to some 50,000 people whose lives were connected to the Chernobyl nuclear power plant, Pripyat was hastily evacuated one day after a reactor at the plant 3 kilometers (2 miles away) exploded on April 26, 1986. The explosion and the subsequent fire spewed a radioactive plume over much of northern Europe. (AP Photo/Efrem Lukatsky)\nTourist companies offer day trips to Pripyat and the area around the plant, where radiation levels have receded enough to make brief visits tolerable. The levels are still high enough that no one is allowed to reside permanently within a 30-kilometer (18-mile radius) of the plant.\nEvery year, nature takes back a little more of Pripyat. The buildings' roofs sprout small trees, their floors and walls deteriorate slowly from rain, snow and changing temperatures.\nMost of the buildings are in such decay that visitors are advised not to enter them, a caution that many ignore.\nThis photo taken Wednesday, April 5, 2017, shows a central square in the deserted town of Pripyat, some 3 kilometers (1.86 miles) from the Chernobyl nuclear power plant Ukraine. Once home to some 50,000 people whose lives were connected to the Chernobyl nuclear power plant, Pripyat was hastily evacuated one day after a reactor at the plant 3 kilometers (2 miles away) exploded on April 26, 1986. The explosion and the subsequent fire spewed a radioactive plume over much of northern Europe. (AP Photo/Efrem Lukatsky)\nIn this photo taken Wednesday, April 5, 2017, an edition of the newspaper Sovetsky Patriot, dated three days before the nuclear explosion, is attached to a bulletin board in a house of culture in the deserted town of Pripyat, some 3 kilometers (1.86 miles) from the Chernobyl nuclear power plant Ukraine. Once home to some 50,000 people whose lives were connected to the Chernobyl nuclear power plant, Pripyat was hastily evacuated one day after a reactor at the plant 3 kilometers (2 miles away) exploded on April 26, 1986. The explosion and the subsequent fire spewed a radioactive plume over much of northern Europe. (AP Photo/Efrem Lukatsky)\nPeople lay flowers to honor the memory of the victims of the Chernobyl disaster in Kiev, Ukraine, Wednesday, April 26, 2017. Ukraine marked the 31st anniversary of the Chernobyl nuclear power plant explosion. (AP Photo/Sergei Chuzavkov)\nUkrainians light candles at the memorial to the victims of the Chernobyl nuclear disaster, in Kiev, Ukraine, Wednesday, April 26, 2017. Ukraine marked the 31st anniversary of the Chernobyl nuclear power plant explosion. (AP Photo/Sergei Chuzavkov)\nIn this photo taken Wednesday, April 5, 2017, a radioactivity sign stands in the ground, outside Chernobyl, Ukraine. April 26 marks the 31st anniversary of the Chernobyl nuclear disaster. A reactor at the Chernobyl nuclear power plant exploded on April 26, 1986, leading to an explosion and the subsequent fire spewed a radioactive plume over much of northern Europe. (AP Photo/Efrem Lukatsky)\nIn this photo taken Wednesday, April 5, 2017, journalists take a selfie in front of the monument of Soviet state founder Vladimir Lenin in Chernobyl, Ukraine. April 26 marks the 31st anniversary of the Chernobyl nuclear disaster. A reactor at the Chernobyl nuclear power plant exploded on April 26, 1986, leading to an explosion and the subsequent fire spewed a radioactive plume over much of northern Europe. (AP Photo/Efrem Lukatsky)\nIn this photo taken Wednesday, April 5, 2017, a decrepit piano stands in a school in the deserted town of Pripyat, some 3 kilometers (1.86 miles) from the Chernobyl nuclear power plant Ukraine. Once home to some 50,000 people whose lives were connected to the Chernobyl nuclear power plant, Pripyat was hastily evacuated one day after a reactor at the plant 3 kilometers (2 miles away) exploded on April 26, 1986. The explosion and the subsequent fire spewed a radioactive plume over much of northern Europe. (AP Photo/Efrem Lukatsky)\nIn this photo taken Wednesday, April 5, 2017, a broken clock hangs on a wall in a school in the deserted town of Pripyat, some 3 kilometers (1.86 miles) from the Chernobyl nuclear power plant Ukraine. Once home to some 50,000 people whose lives were connected to the Chernobyl nuclear power plant, Pripyat was hastily evacuated one day after a reactor at the plant 3 kilometers (2 miles away) exploded on April 26, 1986. The explosion and the subsequent fire spewed a radioactive plume over much of northern Europe. (AP Photo/Efrem Lukatsky)\nIn this photo taken Wednesday, April 5, 2017, a bulletin board with pictures of Soviet state founder Vladimir Lenin hangs on a wall in a school in the deserted town of Pripyat, some 3 kilometers (1.86 miles) from the Chernobyl nuclear power plant Ukraine. Once home to some 50,000 people whose lives were connected to the Chernobyl nuclear power plant, Pripyat was hastily evacuated one day after a reactor at the plant 3 kilometers (2 miles away) exploded on April 26, 1986. The explosion and the subsequent fire spewed a radioactive plume over much of northern Europe. (AP Photo/Efrem Lukatsky)\nThis photo taken Wednesday, April 5, 2017, shows a room in a dilapidated building, part of a school in the deserted town of Pripyat, some 3 kilometers (1.86 miles) from the Chernobyl nuclear power plant Ukraine. Once home to some 50,000 people whose lives were connected to the Chernobyl nuclear power plant, Pripyat was hastily evacuated one day after a reactor at the plant 3 kilometers (2 miles away) exploded on April 26, 1986. The explosion and the subsequent fire spewed a radioactive plume over much of northern Europe. (AP Photo/Efrem Lukatsky)\nIn this photo taken Wednesday, April 5, 2017, small trees grow on a balcony in the deserted town of Pripyat, some 3 kilometers (1.86 miles) from the Chernobyl nuclear power plant Ukraine. Once home to some 50,000 people whose lives were connected to the Chernobyl nuclear power plant, Pripyat was hastily evacuated one day after a reactor at the plant 3 kilometers (2 miles away) exploded on April 26, 1986. The explosion and the subsequent fire spewed a radioactive plume over much of northern Europe. (AP Photo/Efrem Lukatsky)","url":"https://www.dailymail.co.uk/wires/ap/article-4447036/AP-Photos-Chernobyls-ghost-town-draws-daring-visitors.html"}
