{"authors":["Lucas Nolan"],"date_download":"2018-10-30 18:23:13","date_modify":"2018-10-30 18:23:13","date_publish":"2018-08-09 16:14:14","description":"Apple has issued a statement defending its decision to allow the Infowars app to remain in its App store, despite banning the same content from its podcast directory.","filename":"data/vaneerConsumption/AppleWillKeepInfowarsAppwithSameContentasPodcastsBannedfromiTunes.json","image_url":"https://media.breitbart.com/media/2018/03/wi/ap/27/2fh60s_apple-education-49654-tim-cook-apple-ceo-tim-cook-watches-demonstration-e1523660859693.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2018_08_09__1540923793.html","title":"Apple Will Keep Infowars App - with Same Content as Podcasts Banned from iTunes","title_page":"Apple Will Keep Infowars App - with Same Content as Podcasts Banned from iTunes | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Apple has issued a statement defending its decision to allow the Infowars app to remain in its App store, despite banning the same content from its podcast directory.\nIn a surprising statement, Apple has defended its decision not to remove the Infowars app from the platform’s app store. The Infowars app, which allows users to livestream videos and podcasts from the website, is apparently allowed to remain in the store despite Apple removing all Infowars podcasts from its podcast directory. Apple believes that the Infowars podcasts violated their community standards related to “hate speech” stating: “We believe in representing a wide range of views, so long as people are respectful to those with differing opinions.”\nHowever, the Infowars iOS app continues to remain available in the app store. BuzzFeed News questioned Apple about this odd contradiction, to which Apple stated:\nWe strongly support all points of view being represented on the App Store, as long as the apps are respectful to users with differing opinions, and follow our clear guidelines, ensuring the App Store is a safe marketplace for all. We continue to monitor apps for violations of our guidelines and if we find content that violates our guidelines and is harmful to users we will remove those apps from the store as we have done previously.\nAfter being banned from Facebook, YouTube, Spotify, Apple podcasts, LinkedIn and even Pinterest, Infowars has appeared to receive a surge in popularity. The InfoWars app is the fourth most popular app in the Apple app store at the moment:\nWell, the bans were great for Infowars app downloads. It’s the No. 4 news app in Apple’s App Store today, ranking above all mainstream news organizations. (And yes, Apple and Google deleted some Infowars content but kept their apps available.) pic.twitter.com/NrJf0IIbnd — Jack Nicas (@jacknicas) August 7, 2018\nInfowars host Alex Jones has claimed that since the social media purge of most Infowars accounts, the site has received approximately 5.6 million new subscribers over the course of 48 hours. Apple’s decision not to remove InfoWars from its app store as they have yet to catch the app in the act of breaking their terms of service is an odd one given that the company still refuses to list the app of the free speech-centered social media platform Gab in their store.","url":"https://www.breitbart.com/tech/2018/08/09/apple-will-keep-infowars-app-with-same-content-as-podcasts-banned-from-itunes/"}
