{"authors":["John Hayward"],"date_download":"2018-10-30 20:05:57","date_modify":"2018-10-30 20:05:57","date_publish":"2015-12-18 17:05:50","description":"Apple CEO Tim Cook reiterated his stance in favor of unbreakable encrypted communication for consumers.","filename":"data/vaneerConsumption/AppleCEOTimCookDefendsPhoneEncryptionAgainstSecurityConcerns.json","image_url":"https://media.breitbart.com/media/2015/12/iphone-fingerprint-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2015_12_18__1540929957.html","title":"Apple CEO Tim Cook Defends Phone Encryption Against Security Concerns","title_page":"Apple CEO Tim Cook Defends Phone Encryption Against Security Concerns | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In a segment from this Sunday’s 60 Minutes interview broadcast on Friday’s edition of CBS This Morning, Apple CEO Tim Cook reiterated his stance in favor of unbreakable encrypted communication for consumers, dismissing concerns that terrorists and criminals can use such systems to evade law enforcement.\nCook said talking about a tradeoff between privacy and security is “only a simplistic view” because “we can have both,” as reported by Computerworld.\nCook said Apple would continue to comply with proper search warrants, but emphasized that Apple itself cannot break the encryption it provides to iPhone customers, because the decryption keys are stored on the phones themselves. There is no “master key” anywhere that could unlock all of those communications.\nHe provided health information and “intimate conversations with families” as examples of innocuous communication that consumers could rightfully expect to shield from government snooping. He remains opposed to granting investigators “back door” access to private communications.\n“The reality is that a ‘back door’ is for everybody, good and bad,” said Cook, which rather neatly sums up the concerns of both encryption supporters and critics. As Computerworld notes, there are proposals to legally require computer companies to create such back doors, decrypting communications in response to court orders, and officials such as FBI Director James Comey have worried about terrorists taking advantage of unbreakable encryption… although Comey also felt the government should “tell industry how to operate their systems.”\nCook’s position in the CBS interview is nothing new. “Like many of you, we at Apple reject the idea that our customers should have to make tradeoffs between privacy and security,” he said when accepting a corporate leadership award at an event hosted by EPIC, a nonprofit dedicated to privacy and civil liberties issues, in June. “We can, and we must provide both in equal measure. We believe that people have a fundamental right to privacy. The American people demand it, the Constitution demands it, morality demands it.”\nOn that occasion, Cook described the push against encryption as an “attack on our civil liberties,” conducted by politicians and government officials “hoping to undermine the ability of ordinary citizens to encrypt their data.” He found this attack on encryption technology to be “incredibly dangerous.”\nAt the Wall Street Journal’s technology conference in October, Cook said, “I don’t know a way to protect people without encrypting,” and insisted “you can’t have a backdoor that’s only for the good guys.”\nWhen the British government sought to require tech companies to provide an encryption back door to intelligence and law-enforcement agencies, Cook brought up the recent history of major hacking attacks against government agencies in his response.\n“To protect people who use any products, you have to encrypt. You can just look around and see all the data breaches that are going on. These things are becoming more frequent,” he said in a November interview with the UK Telegraph. “They can not only result in privacy breaches but also security issues. We believe very strongly in end to end encryption and no back doors. We don’t think people want us to read their messages. We don’t feel we have the right to read their emails.”\nCook also noted in his Telegraph interview that encryption is no longer a service offered only by giant companies like Apple. “It’s not the case that encryption is a rare thing that only two or three rich companies own and you can regulate them in some way. Encryption is widely available,” he explained. “It may make someone feel good for a moment but it’s not really of benefit. If you halt or weaken encryption, the people that you hurt are not the folks that want to do bad things. It’s the good people. The other people know where to go.”\nThe problem, in a nutshell, is that law enforcement has never before contended with widely-available communication systems that cannot be cracked — not even by the companies providing them, not even in response to the most carefully-worded, precisely-targeted, eminently justified court order. It’s a technological genie that can never really be put back into the bottle, since as Cook pointed out, there are too many small operations scattered around the world which can provide it.\nOn the other hand, the big players make encryption widely available — so widely that people who don’t really understand what encryption means are inadvertently using it. Cook is certainly correct that tech-savvy terrorists and gangsters can find ways to communicate on the vast and wild Internet, beyond the investigative or legislative reach of any given national government, but encryption for the masses means even the clumsiest crooks and killers can evade surveillance with ease.\nThere are good reasons why decent people may want to protect their communications from all prying eyes, including both the State and mega-corporations; Cook has cited data harvesting by companies in Apple’s league as a reason customers like the idea of encryption that not even the service provider can break.\nHis most debatable assertion is that the trade-off between liberty and security is “simplistic.” That might understate the cost of taking a bold stand in either direction.","url":"https://www.breitbart.com/tech/2015/12/18/apple-ceo-tim-cook-defends-phone-encryption-security-concerns/"}
