{"authors":["Victoria Woollaston For Mailonline"],"date_download":"2018-10-23 01:13:46","date_modify":"2018-10-23 01:13:46","date_publish":"2016-01-28 15:29:56","description":"The plugs are designed for use in Argentina, Australia, Brazil, Continental Europe, New Zealand and South Korea. They were shipped with Mac and iOS devices between 2003 and 2015.","filename":"data/vaneerConsumption/ApplerecallscertainplugsshippedwithMacsandiPhonesoverelectricshock.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB3C0100000578-0-image-a-31_1453994949465.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3421148_Apple-recalls-adapters-electric-shock-risk-Customers-advised-return-certain-plugs-shipped-Macs-iPhones_1540257226.html","title":"Apple recalls certain plugs shipped with Macs and iPhones over electric shock","title_page":"Apple recalls certain plugs shipped with Macs and iPhones over electric shock | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Apple today announced a recall of its two-pronged wall plug adapters after reports they can cause an electric shock when touched.\nThe firm said that the adapters have been known to break and create a risk of shock, but this is 'very rare' and there have only been 12 incidents reported worldwide.\nThe plugs are designed for use in Argentina, Australia, Brazil, Continental Europe, New Zealand and South Korea.\nApple has said that the adapters (pictured) have been known to break and create a risk of shock, but this is 'very rare' and there have only been 12 incidents reported worldwide. The plugs are designed for use in Argentina, Australia, Brazil, Continental Europe, New Zealand and South Korea\nThey were shipped with Mac and iOS devices between 2003 and 2015 and were also included in the Apple World Travel Adapter Kit.\n'Because customer safety is the company's top priority, Apple is asking customers to stop using affected plug adapters' the firm explained.\nEXCHANGING YOUR ADAPTER Customers will need to verify their Mac, iPad, iPhone or iPod serial number as part of the exchange process. Once the serial number has been obtained, customers can exchange their adapters at their local Apple store or an authorised Apple service provider. Request a replacement via Apple's support website, or by contacting Apple Support.\nAn affected two-prong plug adapter has either four or five characters, or no characters on the inside slot where it attaches to the main power adapter.\nCustomers will need to verify their Mac, iPad, iPhone or iPod serial number as part of the exchange process.\nThis can be obtained by syncing the device with iTunes.\nAlternatively, customers who use a Mac can obtain the serial number from the About This Mac menu.\nCustomers using an iPhone, iPad, iPod touch or iPod can find the number in Settings, General and About on an iPhone, iPad, iPod touch, or iPod.\nOnce the serial number has been obtained, customers can exchange their adapters at their local Apple store or an authorised Apple service provider.\nCustomers will need to verify their Mac, iPad, iPhone or iPod serial number as part of the exchange process. They can then request a replacement online or via an Apple Store. The recall does not affect any other Apple AC wall plug adapters designed for Canada, China, Hong Kong, Japan, United Kingdom or US\nRequest a replacement via Apple's support website, or by contacting Apple Support.\nThe website also has more information about how to identify an affected adapter.","url":"https://www.dailymail.co.uk/sciencetech/article-3421148/Apple-recalls-adapters-electric-shock-risk-Customers-advised-return-certain-plugs-shipped-Macs-iPhones.html"}
