{"authors":["Victoria Woollaston For Mailonline"],"date_download":"2018-10-23 00:24:15","date_modify":"2018-10-23 00:24:15","date_publish":"2016-01-11 09:42:49","description":"Apple's boss Tim Cook announced Apple Music (pictured) hit the 6.5 million mark in October, meaning it has gained an average of around 42,000 paying customers every day since.","filename":"data/vaneerConsumption/AppleMusicnowhas10millionpayingusers.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/09/3006E77100000578-0-image-a-6_1452505339661.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3393607_Apple-Music-hitting-right-note-Reports-claim-service-10-million-paying-customers_1540254255.html","title":"Apple Music now has 10 million paying users","title_page":"Apple Music now has 10 million paying users | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"In just six months, Apple's music streaming service has reportedly accrued more than 10 million paying subscribers.\nIt hit the 6.5 million users mark in October, meaning it has gained an average of around 42,000 paying customers every day since.\nTo put this into perspective, it took major rival Spotify six years to reach this milestone, but the site now has 20 million paying subscribers.\nScroll down for video\nIn just six months, Apple's music streaming service (pictured across its devices) has reportedly accrued more than 10 million paying subscribers. It hit the 6.5 million user mark in October, meaning it has gained an average of around 42,000 paying customers every day since\nThe latest Apple figures were reported in the FT, although the firm has yet to confirm the number.\nIt comes less than two months after Apple boss Tim Cook announced the service netted more than 6.5 million paid users in its first four months.\nSpeaking at a technology conference organised by The Wall Street Journal in Laguna Beach in October, Cook said that an additional 8.5 million people are participating in a free trial of the Apple Music service.\nAPPLE KILLS OFF BEATS MUSIC The sharp increase in users of Apple Music in recent months may be due to the fact the tech giant recently killed off Beats Music. Beats Music was set up by rapper Dr. Dre and Jimmy Iovine, and Apple bought the brand in 2014. The California-based tech giant pulled the plug out the service Music on 30 November when all subscriptions to the service were cancelled. Apple has been encouraging subscribers to move their profiles to its own music subscription service ever since.\nAt the time, this gave the service more than 15 million users in total, which Cook described as a successful debut.\nApple launched the Music streaming service and its Beats One radio station at the end of June.\nIt lets iPhone, iPad and iPod touch owners test the service with a 90-day free trial, which elapsed for the first users at the start of October.\nApple describes its the app as 'All the ways you love music. All in one place.'\nIt consists of three main features - a music service so users can stream songs, a global 24-hour radio station called Beats One and a social network for artists to share information with fans.\nIt also has a smart prediction service to recommend tracks.\nThe sharp increase in recent months may be due to the fact Apple recently killed off Beats Music.\nThe sharp increase in users of Apple Music in recent months may be due to the fact the tech giant recently killed off Beats Music (pictured). The tech giant pulled the plug on the service on 30 November when all subscriptions to the service were cancelled. It has been encouraging people to switch to Apple Music since\nHOW THE STREAMING SERVICES COMPARE Service Cost Apple Music Apple Music will cost $9.99 a month or $14.99 for a family plan (up to six family members) - both with a three-month free trial Tidal $9.95-a-month for standard sound quality and $19.99-a-month for 'lossless high fidelity sound quality' (£9.99 and £19.99 in the UK)\nSpotify Free level with adverts, Premium $9.99-a-month service (£9.99 in the UK) Beats Music $9.99-a-month or $99 per year Pandora $4.99-a-month for Pandora's ad-free internet radio service Deezer Free with adverts, $9.99-a-month for Premium+ (£9.99 in the UK) Rdio Free with adverts, Rdio Unlimited costs $9.99 (£9.99 in the UK) and US users can also get Rdio Select for $3.99 a month with limited downloads\nBeats Music was set up by rapper Dr. Dre and Jimmy Iovine, and Apple bought the brand in 2014.\nThe California-based tech giant pulled the plug out the service Music on 30 November when all subscriptions to the service were cancelled.\nApple has been encouraging subscribers to move their profiles to its own music subscription service ever since.\nTo put this into perspective, it took major rival Spotify (pictured) six years to reach the same milestone, but it now has 20 million paying subscribers according to recent official figures","url":"https://www.dailymail.co.uk/sciencetech/article-3393607/Apple-Music-hitting-right-note-Reports-claim-service-10-million-paying-customers.html"}
