{"authors":["Alina Selyukh"],"date_download":"2018-10-22 21:21:50","date_modify":"2018-10-22 21:21:50","date_publish":"2017-01-05 00:00:00","description":"Apple says it has \"been informed\" that the app violated local regulations. It's the latest in a long history of media restrictions in China, but also of tech companies getting involved in the efforts.","filename":"data/vaneerConsumption/ApplePullsTheNewYorkTimesFromItsAppStoreInChina.json","image_url":"https://media.npr.org/assets/img/2017/01/05/gettyimages-631008404_wide-37eda66c1679a2c47946511ed3b6333443340326.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2017_01_05_508352372_apple-pulls-the-new-york-times-from-its-app-store-in-china_1540243310.html","title":"Apple Pulls 'The New York Times' From Its App Store In China","title_page":"Apple Pulls 'The New York Times' From Its App Store In China : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Apple Pulls 'The New York Times' From Its App Store In China\nEnlarge this image toggle caption Fred Dufour/AFP/Getty Images Fred Dufour/AFP/Getty Images\nCiting local regulations, Apple has removed The New York Times news app from its app store in China. The incident is the latest in the long history of media restrictions in the country, but also in the ongoing pattern of tech companies getting involved in the efforts.\nThe New York Times reports that Apple removed both its English-language and Chinese-language apps from the app store in China on Dec. 23, though other prominent publications such as The Wall Street Journal and The Financial Times as well as the Times' crossword puzzle and virtual-reality apps remain available.\nAlong with other websites, the Times has faced restrictions for years. The site has been subject of blocks since 2012, when the newspaper reported on the wealth amassed by the family of the then-prime minister.\nApple did not explain Thursday what distinguished the Times from other outlets. Spokesman Fred Sainz shared a statement:\n\"For some time now the New York Times app has not been permitted to display content to most users in China and we have been informed that the app is in violation of local regulations. As a result, the app must be taken down off the China App Store. When this situation changes, the App Store will once again offer the New York Times app for download in China.\"\nSainz did not elaborate on what legal standard was applied to warrant the removal of the news app, but the Times suggested it was under 2016 regulations issued for mobile apps:\n\"The regulations say apps cannot 'engage in activities prohibited by laws and regulations such as endangering national security, disrupting social order and violating the legitimate rights and interests of others.' The cyberspace administration says on its website that apps also cannot publish 'prohibited information.\"\nOver the years, numerous publications have faced blackouts in China, including Bloomberg, Time and The Economist. Users in China sometimes use software to circumvent the government's firewall to surf the Web and access blocked sites.\nFor tech companies, China is a massive, lucrative market and a major manufacturing hub, but operations there are tricky. Sites such as Facebook, Twitter and Google have been restricted. Apple's own iBooks and iTunes Movies were blocked, as well, not long after they were introduced.\nFor Apple, China is a key production location and sales market. But iPhone sales have slumped there in recent years. In May, Apple invested $1 billion in Chinese ride-hailing app Didi Chuxing.\nThe company has, in the past, removed other media apps from its App Store, but none as prominent as The Times, according to the newspaper. And it's far from the first time that a tech company cooperated with the Chinese government to suppress content, as the industry generally complies with local regulations around the world.\nIn 2016, The New York Times reported that Facebook quietly developed software that could prevent posts from appearing in people's news feeds in specific parts of China, going further than the typical practice by U.S. Internet companies to block certain content after it's posted.\nThe newspaper also reported, just last month, on \"a hidden bounty of perks, tax breaks and subsidies in China that supports the world's biggest iPhone factory\" — billions of dollars' worth of incentives at the heart of Apple's phone production.\nIn 2014, the radio program Marketplace reported on LinkedIn censoring posts from its members that were deemed sensitive by China's government. In 2010, Google altered how users in China could access the site as it faced possible loss of license to operate in the country.\nPerhaps the most notorious case dates back to early 2000s, when Chinese authorities arrested and imprisoned dissidents, including a Chinese journalist, based on evidence provided by Yahoo.\nYahoo settled a lawsuit by the dissidents' families in 2007. In 2005, Yahoo bought what later became its most valuable asset: a stake in a Chinese e-commerce site Alibaba.","url":"https://www.npr.org/sections/thetwo-way/2017/01/05/508352372/apple-pulls-the-new-york-times-from-its-app-store-in-china"}
