{"authors":["Viknesh Vijayenthiran","Motor Authority"],"date_download":"2018-10-31 00:03:56","date_modify":"2018-10-31 00:03:56","date_publish":"2016-12-05 00:00:00","description":"Clues that Apple might be developing self-driving car technology has emerged in a letter sent by the tech giant to NHTSA.","filename":"data/vaneerConsumption/AppleisurgingtheUSgovernmenttospeedupselfdrivingcars.json","image_url":"https://amp.businessinsider.com/images/568fe7fde6183e591e8b7cf3-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_apple-is-urging-the-us-government-to-speed-up-self-driving-cars-2016-12_1540944236.html","title":"Apple is urging the US government to speed up self-driving cars","title_page":"    Apple is urging the US government to speed up self-driving cars - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Samantha Lee/Business Insider Clues that Apple might be developing self-driving car technology has emerged in a letter sent by the tech giant to the National Highway Traffic Safety Administration.\nThe letter, obtained by The Wall Street Journal, was sent by Apple's head of product integrity Steve Kenner and included feedback on proposed guidelines for self-driving cars.\nSpecifically, there was a paragraph stating that Apple \"is investing heavily in the study of machine learning and automation and is excited about the potential of automated systems in many areas, including transportation.\"\nThere have been rumors of Apple developing self-driving car technology for years and until recently it was thought that Apple would use the technology for its own car. The thinking changed in October when reports emerged claiming Apple had abandoned plans to launch its own car and would instead focus on self-driving technology. The reports were backed up by the downsizing of staff working on Apple's car project, code-named Project Titan.\nThe government is in the process of establishing rules for the safe testing and deployment of autonomous cars. In September, it presented initial guidelines that included a 15-point design and development checklist, targeted primarily at automakers.\nIn its letter to NHTSA, Apple called on the government to accelerate the establishment of rules for self-driving cars and to work with groups outside the United States to harmonize the \"approach to automated vehicles.\" Apple also asked the government to be more flexible regarding the rules, in order to foster innovation in a technology the tech giant sees as \"life-saving.\"","url":"https://www.businessinsider.com/apple-is-urging-the-us-government-to-speed-up-self-driving-cars-2016-12"}
