{"authors":[],"date_download":"2018-10-22 20:52:20","date_modify":"2018-10-22 20:52:20","date_publish":"2014-06-03 13:27:43","description":"Apple will bring features to iPhones and iPads that match Android in some ways, and some that go beyond Google’s OS. Here's what's still needed.","filename":"data/vaneerConsumption/AppleiOS85FeaturesThatAreStillMissing.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/483881/140603-apple-ios-8-mn-945_4df97093071a6d0298db832ffa0c12f3.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_gadgets_apple-ios-8-5-features-are-still-missing-n121161_1540241540.html","title":"Apple iOS 8: 5 Features That Are Still Missing","title_page":"Apple iOS 8: 5 Features That Are Still Missing","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nWhen it launches this fall, Apple’s iOS 8 will bring a mix of features to iPhones and iPads that match Android in some ways, as well as some that go beyond Google’s OS. On the catch-up front, there’s predictive typing, widgets (inside Notification Center), more sharing options for content, and the ability to swap out your keyboard for third-party options. Also, iCloud Drive appears to be an attempt to mirror the success of Google Drive.\nAmong iOS 8's more original innovations are Family Sharing, which enables up to six family members enjoy iTunes, iBooks and App Store purchases. We especially like the Ask to Buy feature, which lets parents approve their children’s purchases from their own devices. The new Health app also has potential, as it will sync with third-party apps and give you a single dashboard of your vital metrics, one that could be shared with your doctor for more expedient care.\nHowever, iOS 8 falls short in some areas. Here are 5 features that are still missing from Apple’s platform — ones we hope that will arrive in subsequent updates.\nParental controls\nApple deserves credit for placing an emphasis on families with Family Sharing. Not only can you share iTunes purchases among multiple family members, iOS 8 will provide a shared family photo stream, a calendar and the ability to locate family members. Unfortunately, it doesn’t seem as though as Apple has beefed up its parental controls.\nMORE: 10 Tips Every iPhone Owner Should Know\nWhile you can still restrict certain apps and block content based on age rating, iOS 8 doesn’t let you set time limits for overall device usage. Amazon FreeTime feature for Kindle devices has done this for years, and the company recently added educational goals (such as reading for 30 minutes) to unlock rewards. Meanwhile, Samsung offers a special Kids Mode for its Galaxy S5, which provides a kid-friendly environment with only the apps you approve.\nTransit Directions in Maps\nAt this point this feature should be a given in iOS, but it’s not. In order to get transit directions in the Apple Maps app, today you need to go through a third party like Google Maps. This takes you to another app, which is far from a seamless experience. Heading up to the launch of iOS 8, some believed that Apple would remedy this issue, but it seems that iPhone and iPad users will have to wait even longer.\nBeefed Up Control Center\nAlthough iOS 8 makes welcome enhancements to Notification Center by streamlining the interface and adding widgets, it looks like Control Center may be left out in the cold. It’s not that we don’t like the feature; you can adjust everything from volume and brightness and toggle multiple settings just by swiping up from the bottom of the screen. However, unlike the Galaxy S5, you can’t customize your quick settings, nor can you long press on an option (like Wi-Fi) to further tweak your settings.","url":"https://www.nbcnews.com/tech/gadgets/apple-ios-8-5-features-are-still-missing-n121161"}
