{"authors":["Sarah Griffiths For Mailonline"],"date_download":"2018-10-22 23:16:49","date_modify":"2018-10-22 23:16:49","date_publish":"2016-01-28 12:01:25","description":"Rumours suggest the Cupertino firm's iPad Air 3 will have a rear-facing LED flash so users can take better photos in low light, as well as better speaker grills for improved audio.","filename":"data/vaneerConsumption/ApplesiPadAir3couldlaunchinMARCH.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30AA2D3500000578-0-image-a-21_1453986146345.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3420761_Apple-s-iPad-Air-3-launch-MARCH-Firm-expected-debut-revamped-9-7-inch-tablet-4-inch-phone-Watch-straps_1540250209.html","title":"Apple's iPad Air 3 could launch in MARCH","title_page":"Apple's iPad Air 3 could launch in MARCH | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"expected to debut new iPhone 5se and new Watch straps\nApple is gearing up to reveal the latest version of its iPad Air as well as new Apple Watch models at an event rumoured for mid March.\nThe revamped tablet will likely be called iPad Air 3 and feature a 9.7-inch screen, much smaller than the firm's latest 12.9-inch iPad Pro.\nThe Cupertino-based company is also expected to reveal a new 4-inch iPhone, dubbed the iPhone 5se sometime during the week of 14 March.\nApple will reveal the latest version of its iPad Air and new Apple Watch models in mid Match, rumours suggest. The new device will likely be called the iPad Air 3 and feature a 9.7-inch screen, like the iPad Air 2, which was unveiled by Apple boss Tim Cook (pictured) in October 2014\nIt would be the first revamp to the iPad Air since October 2014, 9to5Mac noted, while the iPad mini got a boost last autumn along with the unveiling of the iPad Pro.\nRumours suggest the iPad Air 3 will have a rear-facing LED flash so users can take better photos in low light, as well as better speaker grills for improved audio.\nIt's possible the tablet will also work with the Apple Pencil, which was originally intended to work with the iPad Pro.\nThe super-sized tablet launched in November and has a 12.9-inch screen with 5.9 million pixels. It weighs just 1.57lbs (712 grams) and is 0.3 inches (6.9mm) thick.\nThe Cupertino-based company is also expected to reveal a new four-inch iPhone, dubbed the iPhone 5se (rumoured to be shown right, along an iPhone 5) sometime during the week of March 14\nApple will hope its Air revamp will make people want to buy a new iPad, as sales of the tablet have fallen by almost a quarter over the course of a year.\nAPPLE IN FIGURES Apple now has $216 billion (£151 billiion) in cash Sold 74.8 million iPhones in the three months ending 26 December. First-quarter net profit rose 1.9 percent to $18.36 billion (£12.85 billion). Rise in iPhone shipments was the smallest since the second fiscal quarter of 2013. iPad sales were $16.12 million (£11.26 million) down 21% year-over-year. Mac sales down 3% year-over-year.\nApple is also testing a version of iOS with a Classroom app that could boost sales of its tablets to schools.\nEarlier this week, Apple announced a first-quarter net profit rise of 1.9 percent to $18.36 billion, (£12.85 billion) while revenue increased 1.7 percent to $75.87 billion (£53.02 billion).\nWhile both were records for the company, the figures fell short of analyst expectations.\nIt reported lower-than-expected iPhone sales in the latest quarter, its slowest-ever growth in shipments, as the company began to feel the effects of economic softness in the critical Chinese market.\nSo a new, highly desirable handset would help the situation.\nAs a result, Apple is set to reveal the iPhone 5se, which is predicted to boast a faster A9 processor, M9 chip, more storage, better cameras and a NFC chip so users will be able to buy goods using Apple Pay.\nThe handset will likely have softer edges like the iPhone 6 and it is hoped it will halt ailing iPhone sales.\nApple said on Tuesday it sold 74.8 million iPhones in the three months ending 26 December, the first full quarter of sales of the iPhone 6S and 6S Plus.\nApple is also expected to show off a new range of watch bands, including a black version of the Milanese Loop (pictured), a new colours for Hermes straps and another line of bands made from a new material\nThis rise in iPhone shipments was the smallest since the second fiscal quarter of 2013.\nApple is additionally expected to show off a new range of watch bands, including a black version of the Milanese Loop, a new colours for Hermes straps and another line of bands made from a new material at the March event.\nThe tech giant's boss Tim Cook said the Apple Watch sold particularly well in December - possibly because people bought the devices as Christmas presents.\nHe said of the company's earnings: 'Our team delivered Apple's biggest quarter ever, thanks to the world's most innovative products and all-time record sales of iPhone, Apple Watch and Apple TV.'\nIt's believed Apple will release an operating system update soon after the event, which could include Night Shift to improve people's sleep, for the new handset and iPad Air 3.","url":"https://www.dailymail.co.uk/sciencetech/article-3420761/Apple-s-iPad-Air-3-launch-MARCH-Firm-expected-debut-revamped-9-7-inch-tablet-4-inch-phone-Watch-straps.html"}
