{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 23:53:18","date_modify":"2018-10-30 23:53:18","date_publish":"2016-12-05 00:00:00","description":null,"filename":"data/vaneerConsumption/ApplePayhelpsbankspushservices.json","image_url":"https://amp.businessinsider.com/images/583f1d3be02ba7e5008b6dcc-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_apple-pay-helps-banks-push-services-2016-12_1540943598.html","title":"Apple Pay helps banks push services","title_page":"    Apple Pay helps banks push services - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Payments Briefing\" subscribers. To learn more and subscribe, please click here.\nANZ, one of four major Australian banks, has seen a \"higher propensity\" for users of Apple Pay to adopt other bank services, like mortgages, according to The Sydney Morning Herald.\nThat provides considerable benefits to ANZ, but ultimately could present Apple with a solid use case to onboard more banking partners to Apple Pay in Australia amidst an ongoing fight with major players in the country.\nANZ will likely continue to benefit from their partnership.\nANZ saw a near-immediate positive response from its partnership with Apple Pay.Demand for deposit accounts \"skyrocketed\" almost immediately. Since then, 20% of the bank's customers have reportedly uploaded their payment information into the service, according to The Australian.\nAdditional engagement from ANZ's Apple Pay users could make the service a worthwhile investment. Mobile banking users have lower attrition rates and often consume more banking products on average. ANZ's observation indicates that the impact of Apple Pay could be similar. In addition, the services that users are seeking are likely among banks' most lucrative. The revenue that comes in from increased engagement with those offerings could help make up for the fee that banks reportedly pay Apple on a per-transaction basis when users pay with the wallet.","url":"https://www.businessinsider.com/apple-pay-helps-banks-push-services-2016-12"}
