{"authors":[],"date_download":"2018-10-22 22:52:04","date_modify":"2018-10-22 22:52:04","date_publish":"2014-05-12 22:30:41","description":"A new app under development at MIT lets you and another person share everything — but the catch is that person is a total stranger worlds away.","filename":"data/vaneerConsumption/AppLetsYouShareYourLifeWithSomeoneYoullNeverMeet.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_20/437536/show_42be57c51608b36bfde6aeb55d54d6c1.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_social-media_app-lets-you-share-your-life-someone-youll-never-meet-n103651_1540248724.html","title":"App Lets You Share Your Life With Someone You'll Never Meet","title_page":"App Lets You Share Your Life With Someone You'll Never Meet","title_rss":"NULL","source_domain":"nbcnews.com","text":"The app uses GPS data to find where you are, and will also hook into social apps like Foursquare and Instagram. But it only shows the other person a general idea of these things; check into your favorite cafe in the morning and your stranger will see \"Coffee\" overlaid on an image of some nearby coffee shop, perhaps taken from Google Street View. Hop in the car to drive down to the beach in L.A. and the app will say \"Driving,\" perhaps with a view of the Malibu boardwalk.\nIt's made to provoke wonder, curiosity and perhaps empathy between strangers. \"What's he doing up so early?\" \"I wonder what she's getting a tattoo of?\" \"Checking in at the hospital? I hope everyone's OK!\"\nAt the end of 20 days, you'll be able to send a single short message, but after that it's all done. And for the privacy-conscious, don't worry — the app doesn't keep any of the information and doesn't show you ads based on your location or anything.\nThe iPhone app isn't out quite yet — first, they need to get enough people to make the whole thing worthwhile. If it sounds interesting to you, you can sign up to take part as soon as things get underway.","url":"https://www.nbcnews.com/tech/social-media/app-lets-you-share-your-life-someone-youll-never-meet-n103651"}
