{"authors":[],"date_download":"2018-10-22 22:05:48","date_modify":"2018-10-22 22:05:48","date_publish":"2014-05-08 22:31:34","description":"Apple is close to buying headphone maker Beats Electronics for $3.2 billion, the Financial Times reported.","filename":"data/vaneerConsumption/AppleClosetoBuyingHeadphoneMakerBeatsElectronicsReport.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_17/396281/140423-140423-apple-1644_b5194b43e53964ea83fd8c6d9f14b038.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_business-news_apple-close-buying-headphone-maker-beats-electronics-report-n100841_1540245948.html","title":"Apple Close to Buying Headphone Maker Beats Electronics: Report","title_page":"Apple Close to Buying Headphone Maker Beats Electronics: Report","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"This is really puzzling,\" said Forrester analyst James McQuivey. \"You buy companies today to get technologies that no one else … or customers that no one has.\"\n\"They must have something hidden … under the hood.\"\nApple-watchers have speculated that the company that upended the music industry — and today is the single largest seller of tunes — was contemplating a Spotify-like on-demand music service to go with its recently launched iRadio service and iTunes store.\nApple's Chief Executive Tim Cook met with Iovine, the Beats CEO, last year on a potential partnership involving Beats' planned music-streaming service, Reuters reported in March, citing sources.\nDre — who guided the careers of a string of rap artists such as Eminem and 50 Cent — compared his company with Apple in 2011.\n\"We're trying to eventually be second to Apple. And I don't think that's a bad position,\" Dre told The Fader music website.\nApple and Beats Electronics were not immediately available for comment on the report, which was also carried in the New York Times and Wall Street Journal.\nBeats Electronics received a $500 million investment from Carlyle Group in September that valued the company at over $1 billion.\nBeats also bought back in September a 24.84 percent stake held by Taiwan smartphone maker HTC Corp.\n-Reuters","url":"https://www.nbcnews.com/business/business-news/apple-close-buying-headphone-maker-beats-electronics-report-n100841"}
