{"authors":["Mark Prigg For Dailymail.Com"],"date_download":"2018-10-23 02:33:06","date_modify":"2018-10-23 02:33:06","date_publish":"2016-01-29 17:09:32","description":"The system would not require users to place the handset on a 'mat', but instead would be able to work over longer distances. According to Bloomberg, it could be implemented in 2017.","filename":"data/vaneerConsumption/AppledevelopingwirelessiPhonechargingthatworksuptoametreaway.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/2213FB5400000578-0-image-a-8_1454087193388.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3423163_You-ll-never-need-plug-iPhone-Apple-developing-wireless-charging-works-metre-away_1540261986.html","title":"Apple developing wireless iPhone charging that works up to a metre away","title_page":"Apple developing wireless iPhone charging that works up to a metre away | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Apple is developing a radical wireless charging system for the iPhone, it has been claimed.\nThe system would not require users to place the handset on a 'mat', but instead would be able to work over longer distances.\nAccording to Bloomberg, the system could be implemented in 2017.\nScroll down for video\nThe system would not require users to place the handset on a 'mat', but instead would be able to work over longer distances. According to Bloomberg, it could be implemented in 2017.\nWHY WOULD APPLE DITCH THE HEADPHONE JACK? Getting rid of the headphone jack would help Apple shrink the iPhone 7's thickness considerably. Its latest smartphone, the Phone 6s, is 7.1 mm (0.27) thick but removing the 3.5mm jack could drop this by a further by one mm (0.04 in). Such a shift would also mean larger, stereo headphones using an internal battery would be able to draw power directly from the iPhone - or other devices, if the change is enforced across the Apple board. Elsewhere, Lightning-based headphones would experience less 'crosstalk', or signal interference.\n'Apple is exploring cutting-edge technologies that would allow iPhones and iPads to be powered from further away than the charging mats used with current smartphones, the people said, asking not to be identified as the details are private,' it claims.\n'The iPhone maker is looking to overcome technical barriers including loss of power over distance with a decision on implementing the technology still being assessed, they said.'\nApple has previously made a patent application for a system to use an iMac personal computer as a hub for wirelessly recharging at a distance of about 1 meter using a technique called near-field magnetic resonance.\nApple currently uses a similar technique, called induction, to charge its Watch.\nThe wireless charging is just one of several radical new technologies Apple is expected to introduce.\n'Apple is working with its longtime audio chip partner Cirrus Logic to adapt the audio chipset in the iPhone to work with the Lightning port, according to our source,' Fast Company says.\nApple is also believed to be developing a more expensive pair of noise-canceling, Lightning-connected, earphones or headphones, possibly under its Beats brand, the site claims.\nApple is expected to include an adapter with the handset to use older regular 3.5mm headphones.\nIt is the latest in a long claims have emerged that Apple is set to kill off the headphone socket.\nApple currently uses a similar technique, called induction, to charge its Watch.\nIn order to shrink the thickness of a future handset, Apple is rumoured to be looking at ways to get rid of the standard 3.5mm headphone port.\nNow, more reports suggest the yet-to-be-announced iPhone 7 will feature a single, multipurpose lightning port that will double up as a headphone port as well as charger.\nThere are rumoured plans to do away with the headphone jack, but now, developments for the iPhone 7 could be taking an even bigger leap – Li-Fi.\nA Twitter user has revealed an image to show that the company may be testing Li-Fi technology for the iPhone 7, which would mean data transmission runs on visible light waves, instead of radio.\nLi-Fi is reportedly 100 times faster than Wi-Fi, and would be significantly more secure.\nThis new wireless system hit speeds of 224 gigabits per second in the lab, and has the potential to revolutionize internet usage. The Li-Fi technology uses visible light between 400 and 800 terahertz (THz), and transmits messages through binary code\nThe post tweeted by user @kyoufujibaya, ‘Li-Fi testing is already imminent. May appear in the next iPhone 7 according to iOS code in iOS 9.1 firmware’\nThe post tweeted by user @kyoufujibaya, according to The Huffington Post, reads, ‘Li-Fi testing is already imminent. May appear in the next iPhone 7 according to iOS code in iOS 9.1 firmware.’\nIn an image accompanying the tweet, the developer highlights where the code says, ‘LiFi Capability,’ indicating that this suggests Li-Fi testing plans for the next wave of iPhones.\nScientists have taken to the streets in recent years to test the capabilities of Li-Fi, and it's recently undergone testing in offices and industrial environments in Tallinn, Estonia.\nThis new wireless system hit speeds of 224 gigabits per second in the lab, and has the potential to revolutionize internet usage.\nHarald Haas from the University of Edinburgh, Scotland invented Li-Fi in 2011.\nHaas demonstrated that he could transmit more data than a cellular tower by flickering light from a single LED, according to ScienceAlert.\nThe system works in a similar way to Morse code, using visible light communication (VLC), but operates at speeds that are too high to be detected by the naked eye.\nThe Li-Fi technology uses visible light between 400 and 800 terahertz (THz), and transmits messages through binary code, giving it in-lab speeds fast enough to download 18 movies of 1.5 GB each second.\n'We are doing a few pilot projects within different industries where we can utilise the VLC (visible light communication) technology,' Deepak Solanki, CEO of Estonian tech company, Velmenni, told IBTimes, UK.\nA FASTER, MORE SECURE WI-FI Lab tests have shown that Li-Fi can hit speeds 100 times faster than current Wi-Fi systems. Speed is not the only advantage of Li-Fi. The system uses visible light communication between 400 and 800 terahertz to transmit messages in binary code. Visible light cannot pass through walls, making Li-Fi a much more secure system, and less susceptible to interference. While the system seems promising, it won't likely replace Wi-Fi entirely, at least not anytime soon. Instead, researchers are now looking to retrofit devices with Li-Fi to use the two wireless systems together to optimize speed and security.\n'Currently we have designed a smart lighting solution for an industrial environment where the data communications is done through light.\n'We are also doing a pilot project with a private client where we are setting up a Li-Fi network to access the Internet in their office space.'\nSince the light can't travel through walls, Li-Fi could also be a more secure option down the line, and suffer from less interference from other devices.\nThe system works in a similar way to Morse code, using visible light communication (VLC), but operates at speeds that are too high to be detected by the naked eye. Since the light can't travel through walls, Li-Fi could also be a more secure option down the line, and suffer from less interference from other devices\nThe system isn't likely to replace Wi-Fi entirely in the years to come, and ripping out the existing infrastructure isn't feasible.\nBut the two could be used in partnership to create faster and safer networks.\nInstead, researchers are working on retrofitting current devices to be Li-Fi compatible.\nPureLifi, a company created by Haas and his team, is offering a 'plug-and-play- application for secure wireless access, ScienceAlert says.\nA French tech company called Oledcomm is also working with Li-Fi, and is installing its own system in local hospitals.","url":"https://www.dailymail.co.uk/sciencetech/article-3423163/You-ll-never-need-plug-iPhone-Apple-developing-wireless-charging-works-metre-away.html"}
