{"authors":["Lauren Barbato"],"date_download":"2018-10-30 22:46:22","date_modify":"2018-10-30 22:46:22","date_publish":"2014-08-14 19:15:01","description":"I hope you like your chicken nuggets with a side of plastic: Food company Applegate recalled its frozen chicken nuggets because plastic pieces were reportedly found in the meat. The company recalled more than 15,000 pounds of the chicken nuggets,…","filename":"data/vaneerConsumption/ApplegateRecallsChickenNuggetsBecauseTheyWereFullOfPlastic.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/9e889fd3-4fb2-4967-9adf-251cdb5e89da.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35787-applegate-recalls-chicken-nuggets-because-they-were-full-of-plastic_1540939582.html","title":"Applegate Recalls Chicken Nuggets, Because They Were Full Of Plastic","title_page":"Applegate Recalls Chicken Nuggets, Because They Were Full Of Plastic","title_rss":"NULL","source_domain":"bustle.com","text":"I hope you like your chicken nuggets with a side of plastic: Food company Applegate recalled its frozen chicken nuggets because plastic pieces were reportedly found in the meat. The company recalled more than 15,000 pounds of the chicken nuggets, produced at a Perdue Farms plant and commonly sold at retailers like Whole Foods and Target, after receiving calls and reports from consumers. So far, these are the only Applegate chicken items affected.\nPerdue recalled the roughly 15,000 pounds — equivalent to 30,000 8-ounce boxes — of Applegate natural chicken nuggets on Aug. 8. The affected packages were reportedly produced after Feb. 5, 2014, and had a \"Best before\" date of Feb. 5, 2015. These chicken nuggets were shipped to retailers nationwide, and may still be lingering in people's freezers, according to the U.S. Department of Agriculture's Food Safety and Inspection Service. So, please be careful if you bought one of these frozen dinners recently.\nThe USDA said on its website:\nApplegate worked closely with the USDA Food Safety and Inspection Service and in the interest of our customers, we decided to voluntarily remove the affected product from store shelves while the USDA deliberated about issuing a recall. The USDA convened its recall committee on August 12 and decided to issue a recall statement.\nAlthough the company found out about the plastic bits hiding inside the chicken nuggets from angry customers calling to complain, there have been no reports of illness or injury. However, FSIS added that people \"concerned about an injury or illness from consumption of these products should contact a healthcare provider.\"\nIt seems like chicken goods have been having a tough time this summer. In addition to the Applegate chicken nuggets, FSIS cracked down on a breaded chicken product produced by VU Foods, LLC, a Missouri-based company. The agency issued a warning in late July advising consumers to avoid the breaded chicken products — which include chicken tenders, nuggets and boneless breast meat — because they were \"unfit for human consumption.\"\nFSIS wanted the VU Foods to recall the products, but the company refused, leading to the agency's alert. \"The products were considered for recall because they were produced without inspection,\" the agency said in a statement.\nCertain types of chicken aren't the only grocery items to be recalled recently. McCormick & Co. Inc. voluntarily recalled its ground oregano spice on Thursday due to possible salmonella contamination. According to The Baltimore Sun, the recall affects the company's .75 ounce Ground Oregano bottle, which was shipped to Maryland and about 40 other states.\nThe company was reportedly alerted to the possible salmonella contamination through the FDA, which was conducting a routine testing. The FDA said no injuries or illnesses have been reported.\nImages: Getty Images (2), Reedy's Barbershop/Twitter\nCorrection: An earlier version of this post specified that Apple was owned by Perdue. We regret this error.","url":"https://www.bustle.com/articles/35787-applegate-recalls-chicken-nuggets-because-they-were-full-of-plastic"}
