{"authors":["Martin Robinson Uk Chief Reporter For Mailonline"],"date_download":"2018-10-22 23:51:46","date_modify":"2018-10-22 23:51:46","date_publish":"2016-01-28 13:10:56","description":"Chief financial officer Luca Maestri said it should not pay another penny in tax if its 'sweetheart' tax deal with Ireland breaches EU law.","filename":"data/vaneerConsumption/ApplewarneditmayhavetopaybackbillionsinEUtaxes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30AA844700000578-0-image-a-73_1453986486580.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420936_Apple-warned-pay-billions-EU-taxes-defiant-finance-boss-tells-Brussels-owe-nothing_1540252306.html","title":"Apple warned it may have to pay back billions in EU taxes","title_page":"Apple warned it may have to pay back billions in EU taxes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Chief financial officer Luca Maestri said it should not pay another penny in tax if its 'sweetheart' tax deal with Ireland breaches EU law\nApple today dismissed claims it could owe billions by saying it expected to pay back 'zero' in back-taxes.\nChief financial officer Luca Maestri said it should not pay another penny in tax if its 'sweetheart' tax deal with Ireland breaches EU law.\nThe tech giant believes it and others like Google have been badly treated over its ploy to send its money to Ireland for its beneficial tax rate, saying it is legal.\nMr Maestri said the only 'fair' result would be not to penalise Apple.\nThe EU's competition commissioner Margrethe Vestager said today the rates offered to big companies were 'unfair' and could amount to illegal state aid.\nIf her probe finds against them Apple may have to pay billions more in back-taxes, but a defiant Mr Maestri told the Financial Times: 'My estimate is zero. I mean, if there is a fair outcome of the investigation, it should be zero'.\nHe added that the row was between the European Commission and Ireland, not them.\nYesterday it emerged that Apple made enough money in just two hours to pay its entire UK corporate tax bill.\nThe California-based technology giant raked in record profits of £12.9billion on its worldwide operations in the last three months.\nThis was equivalent to £5.9million an hour – meaning it could cover the £11.8million UK tax bill it paid last year in just 120 minutes.\nThe figures from Apple will fuel anger over the tax arrangements of big multinational technology firms, such as Google and Facebook.\nApple, whose tax affairs in Europe are being investigated by Brussels, has also been criticised in its homeland amid claims it is holding vast sums in offshore tax havens to avoid taxes in the US.\nProfits: Apple made enough money in just two hours to pay its entire UK corporate tax bill, it has emerged\nA former senior adviser to David Cameron yesterday warned that many firms appear to operate 'above the law', while campaigners said faith in the tax system is at 'an all-time low'.\nThe comments came as the Prime Minister was forced to defend the deal that HM Revenue and Customs struck with Google, which will see it pay just £130million to cover a decade of back taxes in Britain.\nGeorge Osborne declared the agreement with Google a 'victory' but it was dismissed as 'derisory' by critics. And in a further embarrassment to Mr Osborne, Apple has lavished the Chancellor with gadgets worth thousands of pounds in the past five years.\nThe corporate might of Apple was underlined as it reported global sales of £53.3billion for the three months to December 26, 2015. The incredible haul resulted in profits of £12.9billion – reinforcing its status as the world's biggest company. Apple did not reveal how it performed in Britain.\nBut separate filings show Apple raked in £37.5billion of profits worldwide in the 12 months to September 2015, and accountants estimate that the UK accounted for around £2billion of those.\nThis would have resulted it a UK corporation tax bill of around £400million – but Apple in fact paid just £11.8million of tax in Britain last year.\nThis is because the company funnels its vast sales in Britain and in much of Europe through Ireland to whittle down its tax bills. Corporation tax in the Irish Republic is just 12.5 per cent compared with 20 per cent in Britain.\nThe figures from Apple will fuel anger over the tax arrangements of big multinational technology firms, such as Google and Facebook\nGoogle has agreed to pay just £130million in taxes dating back to 2005. The amount was branded 'derisory' in light of the fact that the firm racked up sales of £4.5billion in Britain in 2014 alone\nApple has two UK divisions – Apple UK Limited and Apple Retail UK Limited – which are registered as service companies and are paid a fee to handle items sold in Britain. They then declare a profit on this and pay tax.\nHowever Steve Hilton, former senior strategy adviser to Mr Cameron, said: 'There is a growing sense that companies that are so big and so dominant – not just in the marketplace but in the way they relate to governments, their lobbying efforts and so on – that they really are above the law.' Meanwhile Dia Chakravarty, political director at the TaxPayers' Alliance, said: 'With people's faith in the tax system at an all-time low, the need to make [the tax code] more simple is more pressing than ever. It is high time our politicians actually took action to make this happen rather than just posturing and playing to the gallery.'\nApple has lavished the Chancellor with gadgets worth £2,886 in the past five years. This included an iPad 2, iPad 3, and two iPhone 6 handsets plus cases. The Treasury has an upper limit of £140 on gifts to its ministers, meaning in each instance the freebies from Apple were recorded as being 'retained by the department'.\nApple declined to comment but chief executive Tim Cook insisted last month that 'Apple pays every tax dollar we owe'.","url":"https://www.dailymail.co.uk/news/article-3420936/Apple-warned-pay-billions-EU-taxes-defiant-finance-boss-tells-Brussels-owe-nothing.html"}
