{"authors":["Bill Chappell"],"date_download":"2018-10-22 21:20:19","date_modify":"2018-10-22 21:20:19","date_publish":"2016-04-22 00:00:00","description":"The closure was reportedly ordered by censors last week. According to local media, it comes just as a controversial — and banned — film is being released on Apple's Hong Kong iTunes service.","filename":"data/vaneerConsumption/ApplesMoviesAndBooksServicesAreClosedInChina.json","image_url":"https://media.npr.org/assets/img/2016/04/22/gettyimages-522756230_wide-776cc072402c3f84b350f920bade30cf83fcce0a.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_04_22_475240876_apple-s-movies-and-books-services-are-closed-in-china_1540243219.html","title":"Apple's Movies And Books Services Are Closed In China","title_page":"Apple's Movies And Books Services Are Closed In China : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Apple's Movies And Books Services Are Closed In China\nEnlarge this image toggle caption VCG via Getty Image VCG via Getty Image\nIt only opened around six months ago — and now comes word that Apple's iTunes Movies store in China is closed at least temporarily, along with its iBooks Store. The company has issued a statement saying that it hopes to reopen the movie and book services soon.\nThe closure was reportedly ordered by the Chinese government last week; according to local media, it comes just as a controversial Hong Kong film that's been censored in China is being released on Apple's Hong Kong iTunes service.\nChinese content regulator SAPPRFT — the State Administration of Press, Publication, Radio, Film and Television — ordered the Apple services shut down last week, according to The New York Times, which cites \"two people who spoke on the condition of anonymity.\"\nAs NPR's Anthony Kuhn reports from Beijing, \"China is a major source of revenue for Apple, but selling smartphones and computers in China is easier than movies and music, which is subject to government controls and censorship, and plagued by piracy.\"\nNews of the closure comes months after SAPPRFT banned the Hong Kong Film Awards show from being aired in China, and after Chinese news reports about the show had been stripped of any mention of the film that won, The South China Morning Post reports.\nThe newspaper notes that the film, Ten Years, won despite being banned in China. Summarizing its plot, the Morning Post says, \"The dystopian film imagines Hong Kong in 2025 with language police, mini Red Guards, radical protest and social alienation rife.\"\nOn its website, the SAPPRFT agency doesn't make any mention of the Apple services' closure.","url":"https://www.npr.org/sections/thetwo-way/2016/04/22/475240876/apple-s-movies-and-books-services-are-closed-in-china"}
