{"authors":[],"date_download":"2018-10-22 20:43:31","date_modify":"2018-10-22 20:43:31","date_publish":"2014-06-02 16:55:56","description":"Some of the novelties were focused on keeping up with fleet-footed startups rather than reshaping the field.","filename":"data/vaneerConsumption/AppleUnveilsiOS8andPlaysCatchUpWithCompetitorsatWWDC.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/482001/140602-apple-wwdc-tim-cook-1317_4789c537520c19501e6857933d27911d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_gadgets_apple-unveils-ios-8-plays-catch-up-competitors-wwdc-n120391_1540241011.html","title":"Apple Unveils iOS 8 and Plays Catch-Up With Competitors at WWDC","title_page":"Apple Unveils iOS 8 and Plays Catch-Up With Competitors at WWDC","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nApple packed dozens of upgrades and product announcements into its developer conference in San Francisco on Monday -- but some of the novelties seemed more focused on keeping up with competitors than reshaping the field.\nThe company's Worldwide Developers Conference is a hotly anticipated annual event. At this year's show Apple revealed forays into hot tech fields like smart homes, expected updates to its two operating systems and features that play catch-up with popular apps not created by Apple.\nThe buzzy\nFirst, the new and different: HomeKit, Apple's answer to the hot \"smart\" home field, is meant to be a remote control for your home.\nIt takes the smart fridge, smart lights and other devices made by different manufacturers -- and lets you control them all through a single app, instead of disparate systems.\n\"Everything is in these silos,\" Apple's Craig Federighi said at the event. \"We thought we could bring some rationality to this space.\"\nKeeping in line with the \"Kit\" conceit, Apple also announced a HealthKit app that bundles all of the data from various fitness and health trackers into a single place. Users can also give doctors at certain health facilities access to the data, if they choose.\nThe expected\nBeyond those two apps designed to capitalize on big trends in tech, Apple unveiled a long list of other new products during the two-hour keynote speech on Monday.\nThat includes the two expected updates for Apple operating systems: iOS 8 for phones and tablets, and OS X Yosemite for Macs (a revamp that's iOS-like in design and creates a more uniform experience across various Apple devices).\nThe very familiar\nApple launched several new features and design revamps in iOS 8 and Yosemite -- but some of those reveals drew comparisons to popular apps from non-Apple developers.\nMessages that go poof: Texting is no longer about simply exchanging words. The announcement that most obviously recalled another service came during Apple's demonstration of its iMessage texting app: Messages that self-destruct after a few minutes. Sound familiar? Just like the buzzy Snapchat, iMessage in iOS 8 will let users send photo, video or voice messages and set them to disappear after a short time.\nTexting is no longer about simply exchanging words. The announcement that most obviously recalled another service came during Apple's demonstration of its iMessage texting app: Messages that self-destruct after a few minutes. Sound familiar? Just like the buzzy Snapchat, iMessage in iOS 8 will let users send photo, video or voice messages and set them to disappear after a short time. Ignore your annoyingly chatty friends: Snapchat wasn't the only startup affected by the iMessage news. In iOS 8 users will also be able to create and send a voice or video message, and share their location. For those long and unwieldy group chats, users can add or drop people, mute notifications or leave the conversation. Those new features call to mind WhatsApp, the messaging service Facebook bought for $16 billion in February. WhatsApp and its ilk -- China's WeChat and Japan's KakaoTalk, as well as Kik, Line and many more -- have made messaging a super-hot tech field this year. Apple clearly wants in, and Whatsapp's founder didn't seem too pleased about how the company plans to do it.\n\"To the cloud!\": Apple's new iCloud Drive stores documents in the cloud, making them accessible across devices. iCloud Drive also works with Windows, and Apple is now selling 20 gigabytes of storage for 99 cents a month. That's cheap enough to threaten rivals including Dropbox, Box and Google Drive.\nApple's new iCloud Drive stores documents in the cloud, making them accessible across devices. iCloud Drive also works with Windows, and Apple is now selling 20 gigabytes of storage for 99 cents a month. That's cheap enough to threaten rivals including Dropbox, Box and Google Drive. \"That was ... 'awesome'? 'epic'? 'lame'?\": QuickType is Apple's new predictive text feature, which suggests words and phrases as users type. Android fans will recognize this one.\nQuickType is Apple's new predictive text feature, which suggests words and phrases as users type. Android fans will recognize this one. Scribble on your emailed images: Apple's upgraded Mail app now comes with a \"Markup\" feature, which lets users edit images right in the draft of an email. Draw on the image, write notes or include other scribblings, similar to that of the popular app Skitch.\nApple's upgraded Mail app now comes with a \"Markup\" feature, which lets users edit images right in the draft of an email. Draw on the image, write notes or include other scribblings, similar to that of the popular app Skitch. \"OK Google\": Apple's Siri was the original voice assistant, but Google Now and Microsoft's Cortana want a piece of the field. In iOS 8, Siri is now hands-free. Say \"Hey Siri\" to activate the voice assistant without touching the phone -- much like Google's \"OK Google\" voice search in the Chrome browser and \"OK Glass\" command for its smart glasses.\nThe third-party app developers in that list may not have been pleased with Apple's announcements, but for the rest, the company is making its platform a bit more inclusive.\nAll developers can now use Touch ID, which uses a fingerprint for login instead of a password, and create widgets that live in the notification center of Apple devices. Apple has even opened up iOS to third-party keyboards, which the company had previously shunned.\nOn its face, those are relatively small moves. But in an ecosystem as controlled as Apple's, it's like throwing open the door to a welcome party.","url":"https://www.nbcnews.com/tech/gadgets/apple-unveils-ios-8-plays-catch-up-competitors-wwdc-n120391"}
