{"authors":[],"date_download":"2018-10-22 23:02:04","date_modify":"2018-10-22 23:02:04","date_publish":"2014-06-11 00:00:00","description":"A former banking executive turned crafting entrepreneur shares the apps that help keep her adventurous and off the radar.","filename":"data/vaneerConsumption/AppsILiveByCraftingInnovatorNicoleShariatFarb.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/503221/140611-nicole-shariat-farb-1610_f283a47e0e2a80dfd86558d3fcb6c8fa.nbcnews-fp-1200-630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/feature_maria-shriver_apps-i-live-crafting-innovator-nicole-shariat-farb-n128821_1540249324.html","title":"Apps I Live By: Crafting Innovator Nicole Shariat Farb","title_page":"Apps I Live By: Crafting Innovator Nicole Shariat Farb - NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"Nicole Shariat Farb Courtesy Darby Smart\nAfter wasting a ton of money on a failed “Thank You” note project for her wedding, Nicole Shariat Farb, then an executive at Goldman Sachs, saw an opportunity. She left her high-profile investment banking career and launched Darby Smart in June 2013, a company that delivers do-it-yourself (DIY) design projects to crafters big and small. Within a year of launching, Farb has raised over $7 million dollars and has partnered with over 2000 designers to create affordable and, more importantly, doable DIY projects for a range of craft consumers, tapping into a $29 billion industry. From “rock chic” bracelets to homemade gin kits, Darby Smart is a far cry from the crafting stores of old.\nHere, the start-up pioneer shares the apps that help her monitor her fitness, listen to new albums, and get inspired.\nTo Keep Track: Strava\nI was a go-to-treadmill gal until I found Strava. I love running outside now because this app helps me track my run and look at how other people have done on the same route. I can look at my pace compared to all the others that have done this run before me. It’s incredibly cool to have data like that.\nTo Explore: Hotel Tonight\nIn my personal life, I’m an anti-planner. I don't want to know what's going to happen until I'm in the moment. It's why I’m obsessed with Hotel Tonight. I can wake up on Saturday morning, drive a few hours outside of San Francisco and book a hotel the day of. It helps me discover new places and keep some randomness in my world that I enjoy.\nTo Protect: CyberDust\nI grew up on Facebook so I grew used to having life stored for all to see, which makes you think, “Do I want to post this?” So, I've become increasingly appreciative of apps, like CyberDust that let me share off-the-record! It makes me feel less guarded so that I can share those not-so-flattering photos with my best friends!\nTo Discover: Rdio\nI need sound to work, so I have music on all the time. I love Rdio because you can play an entire album instead of individual songs. It's terrific for discovery because you can see the albums your savvy music friends are listening to.\nTo Inspire: Houzz\nHouzz is my home for inspiration. I love browsing the rooms and seeing the way people, all over the world, have designed a space. I get tons of ideas, and in many cases I think, “I can totally DIY that new pillow or rug I’m seeing.” It keeps me fresh.\nFor more information and inspiration visit MariaShriver.com","url":"https://www.nbcnews.com/feature/maria-shriver/apps-i-live-crafting-innovator-nicole-shariat-farb-n128821"}
