{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 22:50:46","date_modify":"2018-10-22 22:50:46","date_publish":"2017-04-26 06:00:49","description":"There is an 18 year age difference. But even an age gap that large is no boundary for love, according to April Love Geary.","filename":"data/vaneerConsumption/AprilLoveGearydefendsagegapwithRobinThicke.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/05/3F9C546800000578-0-image-a-50_1493182687932.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446380_April-Love-Geary-defends-age-gap-Robin-Thicke_1540248646.html","title":"April Love Geary defends age gap with Robin Thicke","title_page":"April Love Geary defends age gap with Robin Thicke | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"There is an 18 year age difference.\nBut even an age gap that large is no boundary for love, according to April Love Geary.\nThe 22-year-old defended her relationship with 40-year-old Robin Thicke with a touching Instagram post on Tuesday from their holiday in the Maldives.\nThere is an 18 year age difference: But even an age gap that large is no boundary for love, according to April Love Geary, who defended her relationship with 40-year-old Robin Thicke with a touching Instagram post on Tuesday from their holiday in the Maldives\nApril wrote: 'We're out here LIVING while most of y'all are still bothered by an age gap'.\nJust the day before she took to Instagram to show off her phenomenal figure in a topless snap on Monday, cheekily shielding her breasts with a pair of coconuts.\nApril beamed as she protected her modesty with the exotic fruit in the racy picture while flaunting her phenomenal, toned and sculpted figure.\nA lovely pair of coconuts: April shared a saucy topless snap on Monday with the model protecting her modesty with a pair of coconuts while on a romantic getaway to the Maldives with pop star boyfriend, Robin\nShe sported tiny yellow bikini bottoms, which were secured with flirty side ties in bows on her hips.\nHer legs looked impossibly long and lean in the holiday photograph and her tummy was flat with well-defined abs.\nThis is not the first time the model has shared her envy-inducing sun-drenched getaway with her 112,000 Instagram followers.\nLoving life: April flaunted her enviable abs and cleavage in a minuscule black bikini, earlier this week\n'I had abs before eating pasta all week': Despite the tiny bikini top flaunting her cleavage and gym-honed stomach, the model couldn't help but cheekily reference her lack of abs\nOn Sunday she once again slipped her slender frame into yet another saucy bikini and treated fans to plenty of pics.\nThe model set temperatures soaring in the minuscule black bikini - before sharing some cosy snaps with her boyfriend Robin.\nApril looked in high spirits as she effortlessly swung from the circular straw seat on the beach, sitting at an angle to exhibit her fine bronzed form.\nThe tiny bikini top cupped her cleavage, while the bottoms rested high on her hips - allowing her to showcase her long, lean legs.\n'He looks ten times better than me': Proving that wasn't a one woman show, April also included her beau Robin in on her titillating display\nIn love: In another dinnertime snap she gushed, 'I honestly don't know who I love more.... Robin or fried rice. I'm torn'\nIn one snap, she captioned the picture with a smiley emoji - while in another she referenced her lack of abs.\n'I had abs before eating chicken nuggets & pasta every night for a week,' the photogenic star captioned the snap, which ironically displayed her looking completely in-shape.\nProving she wasn't a one woman show, April also included her beau Robin in her titillating display.\nSizzling: April also set pulses racing in a skimpy red string bikini on a yacht\n'Babe look!' She shared another snap of her in the same angle as she arched her back slightly to place more emphasis on her bottom\nDespite their huge age gap, the pair proved very much in love as they cosied up for a nice selfie snap.\n'♥️ Even tho he looks 10 times better than me in this pic,' April titled the snap, while in another dinnertime image she gushed: 'I honestly don't know who I love more.... Robin or fried rice. I'm torn.'\nThe model set pulses racing in a skimpy red string bikini earlier in the week, while enjoying a day trip on a luxury yacht.\n'All legs': The star flaunted her sculpted torso in a heavily patterned bikini as she expertly arched out one leg while tousling her locks with her other hand\nBottoms up! She switched it up to flaunt her perky bottom from a low angle\nApril's scarlet number flaunted her cleavage while the barely-there matching bottoms exhibited her pert derriere to perfection.\nKnowing her angles well, the photogenic beauty flaunted her topped up tan as she stared sexily over her shoulder to the camera.\nOozing body confidence, April shared another snap of her in the same angle as she arched her back slightly to place more emphasis on her bottom.\n'My Sexy Island Papi': She also shared a shirtless snap of her beau Robin - who is seventeen years her senior\nWith one hand on her mane and the other pointing out into the ocean, April cheekily captioned it: 'Babe look! There's the rest of my bathing suit bottom!'\nAnd the saucy Instagram display didn't end there as she flaunted her sculpted torso in a heavily patterned bikini as she expertly arched out one leg while tousling her locks with her other hand.\n'All legs' she captioned the stunning snap, before she went on to sizzle in front of some trees.\nWith her honed figure oiled up, April oozed sex appeal as she placed focus on her enviable tum - before switching it up and flaunting her perky bottom from a low angle.\nBabe ahoy! April showed off her flawless physique while standing thigh-deep in the azure blue Indian Ocean waters\nIt's a bum deal: Another shot finds April flashing her undeniably pert bottom after turning her back to the camera, her eyes still shielded by sunglasses as she throws a glance over her shoulder\nCome into my room: Robin's romantic endeavors also extended to their lavish hotel suite\nDon't mind us: Robin and April have been blissfully loved-up during their break\nApril began dating Robin, 40, just over two years following his split from wife Paula Patton.\nLast month, the twosome were spotted grabbing dinner at Catch LA one day after Robin's 40th birthday.\nRobin was previously married to actress Paula Patton; the former lovebirds were childhood sweethearts.\nWatch out: April had a word of warning for her much older boyfriend, writing ‘If Robin messes up… Dude in the white shirt is mine!’\nBuns out! April previously showed off her very tanned derriere in a series of racy Instagram photos last Sunday\nCooling off: Robin's stunning girlfriend enjoyed a sunbathing session in a very skimpy bikini during the break with her singer beau, before heading to the pool to ease her sun birn\nThey met when he was just 14 and she was 15; they married in 2005 before divorcing in 2015.\nRobin and Paula have a seven-year-old son together named Julian.\nThe exes are said to be 'close' to reaching a formal custodial agreement, after months of heated discussions and court visits.\nJust the two of us: The loved-up beauty also posed for a sweet snap with her man, with Robin showing off his tanned physique in swim shorts as she slipped into another colourful bikini\nBeach beauty: April, 22, looked gorgeous in her peach ad white bikini for another day in paradise\nSitting pretty: April showed off her tanned curves as she settled in for a drink at the bar\nIn love: April began dating Robin, 40, (pictured here together in March) just over two years following his split from wife Paula Patton","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446380/April-Love-Geary-defends-age-gap-Robin-Thicke.html"}
