{"authors":["Jon Hamilton"],"date_download":"2018-10-22 23:11:51","date_modify":"2018-10-22 23:11:51","date_publish":"2016-06-23 00:00:00","description":"In mice, monkeys and people, exercise releases a protein called cathepsin B. And as blood and brain levels of this protein rise, memory gets better. But the protein has a dark side, too.","filename":"data/vaneerConsumption/AProteinThatMovesFromMuscleToBrainMayTieExerciseToMemory.json","image_url":"https://media.npr.org/assets/img/2016/06/23/runningandmemory_wide-9c9384a54f7bfe34760a52f252c435aeaeec9435.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2016_06_23_483245084_a-protein-that-moves-from-muscle-to-brain-may-tie-exercise-to-memory_1540249911.html","title":"A Protein That Moves From Muscle To Brain May Tie Exercise To Memory","title_page":"Cathepsin B, A Protein With A Dark Side, Links Memory And Exercise : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"A Protein That Moves From Muscle To Brain May Tie Exercise To Memory\nEnlarge this image toggle caption Monalyn Gracia/Corbis/VCG/Getty Images Monalyn Gracia/Corbis/VCG/Getty Images\nResearchers have identified a substance in muscles that helps explain the connection between a fit body and a sharp mind.\nWhen muscles work, they release a protein that appears to generate new cells and connections in a part of the brain that is critical to memory, a team reports Thursday in the journal Cell Metabolism.\nThe finding \"provides another piece to the puzzle,\" says Henriette van Praag, an author of the study and an investigator in brain science at the National Institute on Aging. Previous research, she says, had revealed factors in the brain itself that responded to exercise.\nThe discovery came after van Praag and a team of researchers decided to \"cast a wide net\" in searching for factors that could explain the well-known link between fitness and memory.\nThey began by looking for substances produced by muscle cells in response to exercise. That search turned up cathepsin B, a protein best known for its association with cell death and some diseases.\nExperiments showed that blood levels of cathepsin B rose in mice that spent a lot of time on their exercise wheels. What's more, as levels of the protein rose, the mice did better on a memory test in which they had to swim to a platform hidden just beneath the surface of a small pool.\nThe team also found evidence that, in mice, cathepsin B was causing the growth of new cells and connections in the hippocampus, an area of the brain that is central to memory.\nBut the researchers needed to know whether the substance worked the same way in other species. So they tested monkeys, and found that exercise did, indeed, raise circulating levels of cathepsin in the blood.\nNext, they studied 43 people who hadn't been getting much exercise.\n\"The people were university students that were couch potatoes — they didn't exercise much,\" says Dr. Emrah Duzel, a neurologist and team member from the German Center for Neurodegenerative Diseases.\nHalf the students remained sedentary. The other half began a regimen of tough treadmill workouts several times a week.\n\"Within four months, we really made them fit,\" Duzel says.\nAnd, just like mice, the students who exercised saw their cathepsin B levels rise as their fitness improved. They also got better at a memory task: reproducing a geometric pattern they'd seen several minutes earlier.\nBut the clincher was the link between memory improvement and cathepsin levels, Duzel says.\n\"Those individuals that showed the largest gains in memory also were those that had the largest increase in cathepsin,\" he says.\nOf course, cathepsin is probably just one of several factors linking exercise and brain function, van Praag says.\n\"I don't think we have fully explained how exercise improves memory,\" she says, \"but I think we've made a significant step forward.\"\nAlso, cathepsin has a dark side. It's produced by tumor cells and has been linked to the brain plaques associated with Alzheimer's. So, trying to artificially raise levels might not be a good idea, van Praag says.\nHowever, van Praag says she's trying to keep her own cathepsin levels up naturally by jogging — when she can.\n\"It takes a lot of time and effort to do all this research,\" she says. \"So sometimes the exercise regimen suffers a little bit.\"","url":"https://www.npr.org/sections/health-shots/2016/06/23/483245084/a-protein-that-moves-from-muscle-to-brain-may-tie-exercise-to-memory"}
