{"authors":[],"date_download":"2018-10-30 18:41:17","date_modify":"2018-10-30 18:41:17","date_publish":"2018-06-21 16:03:00","description":"The school district has not yet said how much it will recommend lowering the millage rate, which is currently 21.74 mills.","filename":"data/vaneerConsumption/APStorecommenddroppingmillagerateasFultonpropertyvaluesrise.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/06/21/Images/cropped%20ApS%20headquarters.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_aps-of_3157b06ac45f42b76af03778551fcfac__1540924877.html","title":"APS to recommend dropping millage rate as Fulton property values rise","title_page":"APS to recommend dropping millage rate as Fulton property values rise","title_rss":"NULL","source_domain":"ajc.com","text":"Atlanta Public Schools probably will drop the school property tax rate because the district now expects an even bigger increase in property values on which it collects taxes.\nMany Fulton County homeowners have seen big property value hikes this year after values were frozen last year at 2016 levels, and the jump means they’re bracing for tax bills to go up, too.\nThat’s prompted some taxpayers to ask the Atlanta school district for relief.\nThe Atlanta school board approved an $818 million general fund budget earlier this month that assumed keeping the millage rate at the current 21.74 mills. Under that budget, the district anticipated receiving $597.4 million in local revenue, about 90 percent of which comes from Fulton County taxes.\nBut updated revenue projections show it actually would receive $634.9 million in local revenue — a 16 percent increase over last year’s budgeted revenue — if it were to maintain the millage rate.\nSuperintendent Meria Carstarphen said Thursday she will recommend the school board lower that tax rate. Other metro Atlanta school districts also are in the midst of tax rate discussions.\nAPS has not said how much it might reduce the millage rate. That’s a conversation board members will have when the budget commission meets at 2 p.m. Friday at the district’s headquarters, 130 Trinity Ave. SW. The district will hold public hearings in the coming weeks before the board finalizes the rate, a vote that could take place July 23.\nThe owner of a $250,000 home (with an assessed value of $100,000) would pay about $1,522 in Atlanta school taxes if the millage rate remains at 21.74. If the district lowers it by one mil that homeowner would save $70, and the district’s tax billings would be reduced by about $31 million.\nAPS officials don’t plan to roll the tax rate back so far that the district would not receive any additional money from inflation and reassessment increases.\nAPS can’t do that because it needs to backfill after a decade of Fulton County assessments that have not kept up with rising property values, Carstarphen wrote. District officials said APS has lost out on millions of tax dollars because of that. Last year’s property value freeze led to cash-flow problems for APS, prompting budget cuts and other money-saving measures.\nIn addition to reducing the tax rate, the district could add money to its fund balance, which it has dipped into in recent years; restore some expenditures that had been cut; and “plan for future stability” or some combination of those options, Carstarphen wrote.\n“The point is that we have to correct a little of the past and be more thoughtful about future pressures,” she wrote.\nVoters in November will have a chance to approve a measure that would increase the homestead exemption for Atlanta school property taxpayers for three years, beginning in 2019. If approved, that will cost the district about $25 million annually.\nOther metro Atlanta school districts also are studying their millage rates.\nFulton County’s school board plans to give final approval on June 28 to a $1.05 billion budget but has not received a recommendation about changing the millage rate of 18.546, as it awaits information about Fulton County's tax digest. The budget, tentatively approved earlier this month, is an increase of 3.6 percent over the previous year’s.\nGwinnett County Public Schools will hold yet-unscheduled public hearings this summer before the school board gives final approval to the millage rate. The district tentatively set a total millage rate of 21.75 mills —19.8 mill for maintenance and operation and 1.95 mills for debt service. That’s a reduction of .10-mills for the debt service millage rate.\nDeKalb County schools will hold a final hearing on its proposed $1.092 billion budget Monday, June 26, at 7 p.m., at 1701 Mountain Industrial Boulevard. The tentatively adopted millage rate is 23.28, a reduction from 23.38. But because of increasing property values, homeowners can expect to pay about 9 percent more in property taxes.\nClayton County’s $690 million budget plan envisions raising the county’s millage rate from 19.095 mills to 20 mills — the most allowed by the state. It also includes a 50 percent cut in operational costs such as contractual services and supplies at the district’s central offices.\nCobb County school officials said last month the district plans to hold its millage rate at 18.9 mills.","url":"https://www.ajc.com/news/local-education/aps-officials-recommend-millage-rate-reduction/vaI8RHomJ4V5IRRCyUFoyM/"}
