{"authors":[],"date_download":"2018-10-23 05:37:27","date_modify":"2018-10-23 05:37:27","date_publish":"2015-06-02 00:00:00","description":"Poet and publisher Jonathan Galassi knows just about everyone in his industry, and a lot of them turn up in his debut novel, Muse. Lynn Neary talks to Galassi about the writing (and publishing) life.","filename":"data/vaneerConsumption/APublishingInsiderTurnsThePageOnABygoneWorldInMuse.json","image_url":"https://media.npr.org/assets/img/2015/06/02/muse_wide-d6d20f9bd8f088f17af4e500f2c89d20dba5bca8.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=411478350_1540273047.html","title":"A Publishing Insider Turns The Page On A Bygone World In 'Muse'","title_page":"A Publishing Insider Turns The Page On A Bygone World In 'Muse' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"AUDIE CORNISH, HOST:\nOver his long career in publishing, Jonathan Galassi has worked with some great novelists - Alice McDermott, Jonathan Franzen and Marilynne Robinson, to name a few. Now the head of one of the world's biggest publishing houses has written his own novel. It's called \"Muse.\" Not surprisingly, it's all about publishers, editors, writers and poets as NPR's Lynn Neary reports.\nLYNN NEARY, BYLINE: When he took the plunge into fiction, Jonathan Galassi followed that age-old advice - write about what you know. And Galassi knows publishing. But the world he creates in \"Muse\" isn't the world of e-books and Amazon, self-publishing and the Twitterverse. It's a world that was already fading when he started working at Farrar, Strous and Giroux back in the 1980s.\nJONATHAN GALASSI: I think I wanted to draw a picture, a somewhat satirical one perhaps, but a very loving one of a way of doing this business that is really part of the past now.\nNEARY: The book, says Galassi, is something of an elegy for those bygone days, and his affection is evident from the opening paragraph.\nGALASSI: (Reading) This is a love story. It's about the good old days, when men were men and women were women and books were books, with glued or even sewn bindings, cloth or paper covers, with beautiful or not-so-beautiful jackets and a musty, dusty, wonderful smell; when books furnished many a room, and their contents, the magic words, their poetry and prose, were liquor, perfume, sex and glory to their devotees.\nNEARY: The hero of Galassi's tale is Paul Dukach, a young man whose path to publishing begins in his hometown bookstore and leads to the upper ranks of a prestigious literary publishing house. There, Dukach comes under the influence of two publishing rivals, literary lions whose love of books is matched only by their hatred of each other.\nGALASSI: Paul has a lot in common with me. He's not the same person. He's younger. He comes from a different place. But he had the same situation I did, of working for a very gifted, cantankerous old grandee and also being close to another man who was his boss's rival. So that situation of being in between two powerful people is something that was familiar to me, (laughter) yes.\nNEARY: Many of Galassi's characters are based on real people, and publishing insiders will no doubt find themselves trying to figure out who's who in this fictional literary galaxy. But that's not the only inside joke in the novel. Galassi's also a poet and translator of Italian poetry, and it is a poet, Ida Perkins, who is at the center of his book. She is both Paul Dukach's muse and the object of the fierce rivalry between his mentors. Galassi slyly elevates her to a place in the culture beyond anything any real poet is ever likely to experience.\nGALASSI: It's a little bit surreal, maybe, to have this poet be the focus of people's passions and desires and covetousness, but why not? It's a kind of revenge, you know, that you can have it your way. That's one thing about fiction - you can make the world be the way you think it should be.\nNEARY: Galassi hasn't just created a fictional poet. He has also written an entire collection of poems within the novel in her name, including this one.\nGALASSI: (Reading) Across the pond, something falling at the boathouse, someone diving in the glimmer. I can see him. I can see her as the sun sets in the water. Then I lose her as I lose him, incandescent summer shimmer.\nNEARY: Galassi the poet takes over for Galassi the novelist at this point in the book, but this old publishing hand doesn't think anyone should take his fictional poetry too seriously.\nGALASSI: In the book, she's presented as the great poet of her time, so, obviously, I can't write the great poems of her time. First of all, I don't have that amazing talent that I've given to her. So what I did was I've tried to write poems that kind of gave some sort of plausibility to this, but, again, they're supposed to be taken with a grain of salt.\nNEARY: Galassi may not want readers to take these poems too seriously, but he can't hide just how much he loved creating this fictional poet, right down to ending the book with a detailed bibliography of her life's work.\nGALASSI: And that was so much fun for me (laughter). It may be more fun for me than everyone else, but I don't care (laughter). It's so great. I just loved it.\nNEARY: Though he's come late to novel writing, now that Jonathan Galassi has gotten a taste of it, he's ready for more and is already working on his second novel. Lynn Neary, NPR News, Washington.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=411478350"}
