{"authors":[],"date_download":"2018-10-30 14:30:47","date_modify":"2018-10-30 14:30:47","date_publish":"2014-12-06 00:00:00","description":null,"filename":"data/vaneerConsumption/AQleaderwantedbyUSinconnectionwithNYCsubwayplotkilledbyPakistan.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_12_aq_leader_wanted_by_us_in_connection_with_nyc_subway_plot_killed_by_pakistan_comments_1540909847.html","title":"AQ leader wanted by US in connection with NYC subway plot killed by Pakistan","title_page":"Blog: AQ leader wanted by US in connection with NYC subway plot killed by Pakistan","title_rss":"NULL","source_domain":"americanthinker.com","text":"The Pakistani military announced that a top al-Qaeda operative was killed by government forces in a firefight early Saturday.. Adnan Shukrijumah, a Saudi national, was wanted in the US in connection with a plot to blow up the New York city subway in 2009. Adnan Shukrijumah was considered a senior leader in the terrorist group, holding a position that was once occupied by 9/11 planner Khalid Sheikh Mohammed. NBC News: Adnan el Shukrijumah, who was indicted in July 2010 for his alleged role in planned terror attacks in the U.S. and Britain, was killed along with two others in a pre-dawn raid, the military told NBC News. Shukrijumah, 39, was in charge of al Qaida's global operations - a position once held by Sept. 11 mastermind Khalid Sheikh Mohammed - and was on the FBI's \"most wanted\" list with a $5 million reward for his capture. He studied at a community college in Florida but when the FBI showed up to arrest him as a material witness to a terrorism... (Read Full Post)","url":"https://www.americanthinker.com/blog/2014/12/aq_leader_wanted_by_us_in_connection_with_nyc_subway_plot_killed_by_pakistan_comments.html"}
a plot to blow themselves up at rush hour, according to testimony in federal court.\nA senior Pakistan military official, who asked not to be identified, said Shukrijumah's killing, in Shinwarsak, South Waziristan, was a \"huge loss\" to the terror network.\nLocal residents in Shinwarsak and its adjoining villages said a large of number of Pakistani troops had encircled the area early Saturday and told villagers to stay home till further orders.\n\"The entire area was kept under curfew and all schools remained close today. Besides the ground forces, two helicopter gunships took part in the offensive and pounded suspected hideouts of the militants,\" said local tribesman, Dildar Wazir on phone.","url":"https://www.americanthinker.com/blog/2014/12/aq_leader_wanted_by_us_in_connection_with_nyc_subway_plot_killed_by_pakistan.html"}
