{"authors":[],"date_download":"2018-10-30 14:32:48","date_modify":"2018-10-30 14:32:48","date_publish":"2015-06-19 00:00:00","description":null,"filename":"data/vaneerConsumption/AquestionforNancyPelosiwhoisabetterkisserObamaorBoehner.json","image_url":"https://www.americanthinker.com/images/bucket/2015-06/194848.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_06_a_question_for_nancy_pelosi_who_is_a_better_kisser_obama_or_boehner_comments_1540909968.html","title":"A question for Nancy Pelosi: who is a better kisser, Obama or Boehner?","title_page":"Blog: A question for Nancy Pelosi: who is a better kisser, Obama or Boehner?","title_rss":"NULL","source_domain":"americanthinker.com","text":"Nancy Pelosi is a real kissing bug. She's been seen kissing both Obama... ...and John Boehner. But the question is, which does she like better? She's looking mighty satisfied in the first photo, where Obama is busy working his way to her lips. Note how her eyelids are drooping; she looks as though she's zoned out, like a kitten knocked out by catnip, or a puppy having her belly rubbed. Now look at the photo with Boehner. Note specifically the hand on the right side. Looks like a claw, doesn't it? It looks like I PhotoShopped it in from a Star Trek episode. And yet it is actually Nancy Pelosi's real claw/hand. The only question is, what is she trying to do – to push him away, or get a better grip? Is the kiss so terrible that she is trying to push him off on Steny Hoyer, or is she so much in the grips of passion that she's clenching his shoulder? We might have a better answer to... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/06/a_question_for_nancy_pelosi_who_is_a_better_kisser_obama_or_boehner_comments.html"}
heir lives?\nThis article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/06/a_question_for_nancy_pelosi_who_is_a_better_kisser_obama_or_boehner.html"}
