{"authors":["Ali Waked"],"date_download":"2018-10-30 21:09:44","date_modify":"2018-10-30 21:09:44","date_publish":"2015-11-26 21:39:08","description":"Arab reporters based in the Middle East have taken to Facebook in order to criticize Palestinian media outlets.","filename":"data/vaneerConsumption/ArabReportersBlastPalestinianMediaIncitement.json","image_url":"https://media.breitbart.com/media/2015/11/Screen-Shot-2015-11-19-at-5.32.57-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_11_26__1540933784.html","title":"Arab Reporters Blast Palestinian Media Incitement","title_page":"Arab Reporters Blast Palestinian Media Incitement","title_rss":"NULL","source_domain":"breitbart.com","text":"JAFFA, Israel – Arab reporters based in the Middle East have taken to Facebook in order to criticize Palestinian media outlets for inciting untrained youngsters to risk their lives by carrying out anti-Israel terrorist attacks.\nThe tipping point came on Tuesday when two teenage Palestinian girls were shot after they stabbed a 70-year-old Palestinian man outside a central Jerusalem market. The man was apparently mistaken for an Israeli.\nThe girls, likely incited by a constant stream of Palestinian propaganda, clearly believed they could successfully carry out an attack using nothing but a pair of scissors.\nAfter seeing the images of the two young, scissor-wielding Palestinian girls, Arab journalists expressed their outrage, largely blaming the media outlets associated with the Hamas and the Islamic Jihad terrorist organizations, although Palestinian Authority television has also been leading an anti-Israel incitement campaign.\nThe Palestinian radio journalist Alla Adin Tawil posted on Facebook: “To the Channels ‘Palestine Today,’ ‘Al Quds,’ and ‘Al Aqsa’ and all those who were around them, be afraid of Allah. Enough.”\nMohammad Adam, a reporter for Al Quds newspaper, commented on his Facebook account: “You, the media of the resistance, be afraid of Allah when you deal with our sons and our daughters.”\nKifah Zboun, Ramallah correspondent for the Saudi-owned, London-based Asharq al-Awsat daily, opined on the social media network: “There are people who enjoy when other people die. Oh yeah, they like to watch. For them the question is not believing in their value of martyrdom or their value of liberation or resistance. Glory and mercy to our martyrs and patience to their beloved ones and shame to the liars.”\nBreitbart Jerusalem has repeatedly documented the anti-Israel incitement regularly broadcast by the Palestinian Authority’s own media outlets, which seem to be trying to outdo the Jew-hatred spewed by the Hamas and Islamic Jihad television networks.","url":"https://www.breitbart.com/the-media/2015/11/26/arab-reporters-call-palestinian-media-incitement-enough/"}
