{"authors":[],"date_download":"2018-10-30 18:57:44","date_modify":"2018-10-30 18:57:44","date_publish":"2016-05-29 07:37:05","description":"Arab League chief Nabil al-Arabi blasted Israel as a bastion of \"fascism and racial discrimination\" at a meeting of Arab foreign ministers.","filename":"data/vaneerConsumption/ArabLeagueChiefDenouncesIsraelAtPeaceTalksMeeting.json","image_url":"https://media.breitbart.com/media/2016/05/Nabil-al-Arabi.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_05_29__1540925864.html","title":"Arab League Chief Denounces Israel At Peace Talks Meeting","title_page":"Arab League Chief Denounces Israel At Peace Talks Meeting","title_rss":"NULL","source_domain":"breitbart.com","text":"Arab League chief Nabil al-Arabi (pictured) blasted Israel as a bastion of “fascism and racial discrimination” on Saturday at a meeting of Arab foreign ministers that backed France’s Middle East peace initiative.\nThe Arab ministers at the end of the meeting adopted a resolution backing “the French initiative and all Arab and international efforts” for peace talks between Israel and Palestinians.\nIn his speech to the ministers, Arabi, who has been a vocal critic of Israel, said the country “has truly become today the last bastion of fascism, colonialism and racial discrimination in the world”.\nPalestinian Authority president Mahmud Abbas has rejected an Israeli offer for direct negotiations instead of the French multilateral peace initiative, which Israel has turned down.\nOn Saturday, he blamed Israel for stalling the talks.\n“We tried hard with the Israeli government to implement signed treaties and respect our and their commitments, but they refused,” he said.\nThe French initiative involves holding a meeting of foreign ministers from a range of countries, including US Secretary of State John Kerry, on June 3, but without the Israelis and Palestinians present.\nAn international conference would then be held in the autumn, with the Israelis and Palestinians in attendance. The goal is an eventual relaunch of negotiations that would lead to a Palestinian state.\nNegotiations between the Israelis and Palestinians have been at a standstill since a US-led initiative collapsed in April 2014.\nAn upsurge in violence since October has killed 205 Palestinians and 28 Israelis. Most of the Palestinians killed were carrying out knife, gun or car-ramming attacks, Israeli authorities say.\nThe unrest has steadily declined in recent weeks.\nMany analysts say that Palestinian frustration with Israeli occupation and settlement building in the West Bank, the complete lack of progress in peace efforts and their own fractured leadership have fed the recent unrest.\nIsrael says incitement by Palestinian leaders and media is a main cause of the violence.","url":"https://www.breitbart.com/middle-east/2016/05/29/arab-league-chief-denounces-israel-peace-talks-meeting/"}
