{"authors":["Virginia Hale"],"date_download":"2018-10-30 20:30:40","date_modify":"2018-10-30 20:30:40","date_publish":"2016-11-16 17:30:00","description":"A translator has revealed that Muslim migrants believe “Germany should be Islamised”, and loathe their hosts, according to a new report.","filename":"data/vaneerConsumption/ArabicTranslatorMuslimMigrantsSecretlyHateChristiansSeektoOutbreedThem.json","image_url":"https://media.breitbart.com/media/2016/11/GERMANY-EUROPE-MIGRANTS.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_11_16__1540931440.html","title":"Arabic Translator: Muslim Migrants Secretly Hate Christians, Seek to Outbreed Them","title_page":"Arabic Translator: Muslim Migrants Secretly Hate Christians, Seek to Outbreed Them | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A translator who has lived in Germany since the 1990s has revealed that Muslim migrants believe “Germany should be Islamised”, and loathe their hosts, according to a new report.\nWorking with asylum seekers in migrant centres, the 39 year old translator says she learnt that Muslims seek to “destroy” Christians, through having more children, and preach hatred towards people of other faiths.\nCatholic website Kath.net, which has been looking into reports that Christians are discriminated against in German refugee camps, arranged a meeting with the Eritrean after being contacted by a German politician aware of the Catholic news agency’s work.\nGrateful for the “open-minded reception and support” she was given by Germany after arriving as a refugee in 1991, the woman began to volunteer in asylum centres five years ago to “give something back”.\nA Christian but presumed to be Muslim by migrants and other staff volunteering and working at the shelters, the translator of Arabic immediately discovered “Christians are oppressed, intimidated and harassed by Muslim refugees. This is normal.”\nThe woman has worked in several migrant centres and discloses that their security staff and other translators, who are almost all Muslim, are part of the problem.\n“They have mostly grown up here, are well-educated and are professionals, and they give a first impression of having a cosmopolitan outlook”, she says.\nHowever this changes as soon as they are “among themselves”, the translator says. When migrant centre staff believe non-Muslims are out of earshot, “they then show their true face and how they want Germany to be Islamised. They despise our country and our values”.\nHorrified by what she heard, but curious to learn more, she chose to continue concealing her religion and decided to check out study sessions in nearby mosques.\n“Pure hatred against non-believers is preached, and children are brought here from an early age here in Germany. It’s very similar in asylum housing, where Muslim boys refuse to play with Christians”, she informs the Catholic news agency.\nAttempts to mediate, where the translator would say “You’re a Muslim, he’s a Christian. What difference does it make?” typically garner responses like “I don’t play with Christians. My parents hate them too”, she reports.\nThe Eritrean was also shocked by attitudes shown by the migrants when she brings up the topic of contraception methods with the women, who often have several children young.\n“Some women told me ‘We will multiply our numbers. We must have more children than the Christians because it’s the only way we can destroy them here”, she recalls.\nWhen the translator objected to this sentiment, and pointed out that it’s Christians who are helping them, she says she was told that defending Christians is a sin.\nSince May 743 Christians have been subjected to attacks in Germany’s asylum system, with the vast majority of perpetrators being Muslim according to a report released last month.\n416 of the victims reported having been physically assaulted, 44 sexually assaulted and 314 said they have received death threats. In addition, the perpetrators in 205 of the cases were guards at asylum homes — individuals who are paid to protect the migrants in their care.","url":"https://www.breitbart.com/europe/2016/11/16/translator-migrants-hate-christians/"}
