{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:37:35","date_modify":"2018-10-30 20:37:35","date_publish":"2015-11-09 23:45:23","description":"Arab allies have largely abandoned the U.S.-led air campaign against ISIS in Iraq and Syria as America gets ready to escalate airstrikes.","filename":"data/vaneerConsumption/ArabAlliesVanishFromAntiISISAirWar.json","image_url":"https://media.breitbart.com/media/2014/12/US-Airstrikes-Ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_11_09__1540931855.html","title":"Arab Allies Vanish From Anti-ISIS Air War","title_page":"NYT: Arab Allies Vanish From Anti-ISIS Air War","title_rss":"NULL","source_domain":"breitbart.com","text":"Arab allies have largely abandoned the U.S.-led air campaign against the Islamic State (ISIS/ISIL) in Iraq and Syria as America gets ready to escalate airstrikes against the jihadist group, reports The New York Times (NYT).\nWestern allies such as Australia and France have also limited their role in the offensive against ISIS, noted the Times:\nThe Obama administration heralded the Arab air forces flying side by side with American fighter jets in the campaign’s early days as an important show of solidarity against the Islamic State, also known as ISIS or Daesh.Top commanders like Gen. Lloyd J. Austin III, who oversees operations in Syria and Iraq, still laud the Arab countries’ contributions to the fight. But as the United States enters a critical phase of the war in Syria, ordering Special Operations troops to support rebel forces and sending two dozen attack planes to Turkey, the air campaign has evolved into a largely American effort… Administration officials had sought to avoid the appearance of another American-dominated war, even as most leaders in the Persian Gulf seem more preoccupied with supporting rebels fighting the government of President Bashar al-Assad of Syria. Now, some of those officials note with resignation, the Arab partners have quietly left the United States to run the bulk of the air war in Syria — not the first time Washington has found allies wanting.\nSaudi Arabia and the United Arab Emirates have reportedly shifted the focus of their military air assets on their battle against the Iranian-backed Houthi rebels in Yemen. Jordan has followed suit, reacting to the brutal execution of one of its pilots by ISIS and in a show of solidarity with their Saudi ally.\nThe last time warplanes from Bahrain hit a target in Syria was in February, the Times learned from coalition officials. Although it is still flying patrols over Syria, Qatar’s role in the anti-ISIS air war has been modest.\n“They’ve all been busy doing other things, Yemen being the primary draw,” said U.S. Air Force Lt. Gen. Charles Q. Brown Jr., who leads the air campaign from a $60 million command center located in a sprawling base in Qatar, referring to the Arab allies.\nThe commander did note that “those allies still fly periodic missions in Syria and allow American jets to use their bases,” reports the Times.\nCiting information obtained from allied officials last week, NYT reveals that “the United Arab Emirates last carried out strikes in Syria in March; Jordan in August; and Saudi Arabia in September.”\nNevertheless, the Arab allies insist they are still playing a pivotal military role in the offensive, even if it is less active.\n“Jordan’s commitment to this fight is unwavering,” Dana Zureikat Daoud, a spokeswoman for the Jordanian Embassy in Washington, told the Times.\n“We remain an active partner and contributor to the international coalition, and continue to conduct airstrikes against Daesh targets,” she added, using the acronym for ISIS’s original name in Arabic.\nWestern allies, such as France and Australia, have also limited their engagement against the terrorist group, which still controls large swathes of Iraq and Syria and has expanded to Libya and Afghanistan, among other places.\nFrance and Australia “have conducted a smattering of strikes in Syria, but have reserved most of their firepower for Islamic State targets in Iraq,” reports the Times.\n“Canada’s new prime minister, Justin Trudeau, has promised to fulfill his campaign pledge to end Ottawa’s role in the air campaign altogether,” it adds. “And none of the Western allies appear eager to join the United States in basing warplanes at Incirlik air base in Turkey, a move that would make it easier to increase strikes against militants in northern Syria and Iraq.”\nThe U.S. has vowed to intensify the air war against ISIS in Syria.","url":"https://www.breitbart.com/national-security/2015/11/09/nyt-arab-allies-vanish-anti-isis-air-war/"}
