{"authors":["Deborah Danan"],"date_download":"2018-10-30 19:40:43","date_modify":"2018-10-30 19:40:43","date_publish":"2016-11-19 15:39:23","description":"TEL AVIV – Eleven Arab nations warned outgoing UN Secretary-General Ban Ki-moon that “expansionist” and “sponsor of terrorism” Iran has only intensified its policy of “aggression in the region and the continuation of support for terrorist groups” since the nuclear deal.    | Israel / Middle East","filename":"data/vaneerConsumption/ArabNationsIransSponsorshipOfTerrorismHasOnlyWorsenedSinceNuclearDeal.json","image_url":"https://media.breitbart.com/media/2016/09/rouhani.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_11_19__1540928443.html","title":"Arab Nations: Iran's Sponsorship Of Terrorism Has Only Worsened Since Nuclear Deal","title_page":"Arab Nations: Iran's Sponsorship Of Terrorism Has Only Worsened Since Nuclear Deal | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Eleven Arab nations warned outgoing UN Secretary-General Ban Ki-moon that “expansionist” and “sponsor of terrorism” Iran has only intensified its policy of “aggression in the region and the continuation of support for terrorist groups” since the nuclear deal.\n“It is with a deep sense of frustration that we note that the Islamic Republic of Iran, with its expansionist regional policies, flagrant violations of the principle of sovereignty and constant interference in the internal affairs of Arab States, continues to play a negative role in causing tension and instability in our region,” a letter to Ban — signed by the UN envoys of Bahrain, Egypt, Jordan, Kuwait, Morocco, Oman, Qatar, Saudi Arabia, Sudan, United Arab Emirates and Yemen — said.\nThe Arab ambassadors further expressed “concerted alarm” at “the export of its revolution to other countries.”\n“We stress that the Islamic Republic of Iran is a state sponsor of terrorism in our region, from Hezbollah in Lebanon and Syria, to Houthis in Yemen and terrorist groups and cells in the Kingdom of Bahrain, Iraq, the Kingdom of Saudi Arabia, Kuwait and elsewhere,” the letter stated.\n“Unfortunately, since the signing of the nuclear deal, we have seen nothing but increased Iranian aggression in the region and the continuation of support for terrorist groups,” the letter said.\n“We remain firm in our resolve that any interference by the Islamic Republic of Iran in the domestic affairs of Arab states is unacceptable and must be confronted,” the letter stated. “[T]he only way forward is for the Islamic Republic of Iran to comprehensively change its foreign policies and end hostilities, thus paving the way for the region to enter a new era of stability and development.”\nUN Watch, a Geneva-based monitoring NGO, praised the letter as “important.”\n“Iran likes to dismiss all criticism of its human rights violations and brutality at home and abroad as part of a Western plot, but that’s hard to sustain when the accusers are all Muslim governments, including recent allies of Iran like Sudan,” UN Watch Executive Director Hillel Neuer said in a statement.\nFor its part, Iran responded to the Arab nations’ claims, calling them “unfounded,” Iran’s state-owned Press TV reported.\n“It is ridiculous that those regimes who themselves are the nurturers and exporters of extremism and Takfiri dogma to Iraq, Syria and other countries are now accusing Iran of supporting terrorism,” Iranian ambassador to the UN Gholam-Ali Khoshroo wrote in a letter to UN chief Ban.\nSaudi Arabia has condemned Iran’s military support of Lebanese terror group Hezbollah which has joined the Assad regime in Syria.\nThe Kingdom launched a coalition to support Yemen in its fight against the Iran-backed Houthi rebels who have taken control of the country’s capital.\nIn his UN General Assembly speech in September, Prime Minister Benjamin Netanyahu said that many states in the region are recognizing that Israel is not their enemy.\nRather, he said, they realize “that Israel is their ally. Our common enemies are ISIS and Iran. Our common goals are security, prosperity and peace. I believe that in the years ahead we will work together to achieve these goals.”","url":"https://www.breitbart.com/middle-east/2016/11/19/arab-nations-to-un-sec-gen-irans-sponsor-terrorism-has-only-worsened-since-nuclear-deal/"}
