{"authors":["Carly Stern For Dailymail.Com"],"date_download":"2018-10-23 04:58:00","date_modify":"2018-10-23 04:58:00","date_publish":"2017-03-16 16:08:44","description":"Rabbi Jim Mirel, Reverend Chris Schuller (an Episcopal Priest), and a self-identified atheist named Carlos Dillard star in a video that was filmed in Washington, where marijuana is legal.","filename":"data/vaneerConsumption/Arabbipriestandatheistsmokeweedtogetheroncutcom.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E55074D00000578-0-image-a-2_1489676613373.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4320650_A-rabbi-priest-atheist-smoke-weed-together_1540270680.html","title":"A rabbi, priest and atheist smoke weed together on cut.com","title_page":"A rabbi, priest and atheist smoke weed together on cut.com | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Many a joke has begun with a rabbi, a priest, and an atheist walking into a bar, but in a real-life scenario featuring the unlikely trio, there's no punchline — just lots of marijuana.\nThe two holy men and single non-believer agreed to smoke together in a new video for Cut.com, which captures them lighting up and discussing spirituality while high.\nThe trio gets along marvelously while discussing religion, the existence of god, and what scripture says about Mary — Jane, that is.\nScroll down for video\nNot a joke set-up: A rabbi, a priest, and an atheist smoke marijuana in a new video\nThe subjects: Rabbi Jim Mirel, Reverend Chris Schuller (an Episcopal Priest), and a self-identified atheist named Carlos Dillard star\nNot the first time: The priest and rabbi say they haven't smoked in years, while Carlos smoked earlier that day\nThe clip appears to have been filmed in Washington State, where recreational marijuana is legal.\nRabbi Jim Mirel, Reverend Chris Schuller (an Episcopal Priest), and a man named Carlos Dillard — who characterizes himself as an atheist, but whose views in the video appear to be agnostic — sit down to smoke together.\nBoth the rabbi and priest admit they've tried marijuana before, though neither has smoke in years. Carlos, meanwhile, says the last time he smoked was about an hour earlier.\nBefore partaking, the priest adds that 'most people who identify as Christian are probably not to down on smoking marijuana', but 'notes that there's no biblical precedent' allowing or prohibiting it.\nAll OK: The video appears to have been filmed in Washington, where recreational use is legal\nIn the bible: Rabbi Mirel notes that some scholars believe the anointing oil in the Book of Exodus had hemp oil in it\nLater, after smoking, Rabbi Mirel says that from his own biblical studies, he believes — as some other scholars do — that there are many instances of people being high in the bible.\n'The anointing oil, as found in the Book of Exodus, had some qualities that would elevate the person, and there is a theory that one of those was oil from a hemp plant,' he says.\n'Historically, many people who've had mystical experiences, I think it's very likely they were under the influence of some mind-altering substance.'\nWhen they first begin to smoke, the group uses a bong — and Reverend Schuller requires some help from Carlos. After the first hit, they switch to joints. Carlos says with a smile: 'This is cool, I'm smokin' with some priests, and a rabbi. Check off my bucket list.'\nSerious: At one point, Reverend Schuller blesses Carlos in honor of Ash Wednesday\nComing together: The rabbi also offers prayers to both Carlos and the priest\nThe conversation between the three men becomes retrospective, with Carlos explaining that he grew up 'really religious'. Though he no longer is, he adds that 'no one can deny that someone brilliant did this', indicating he is spiritual or agnostic, but not actually an atheist.\nThat's when the debate begins. When Reverend Schuller says all stories and religious boil down to the same things, Carlos chimes in to say 'there's no story', and that scientific discoveries have eliminated the need for religion.\n'Religion... was pretty much astrology. It was a way of humans understanding,' he says, rattling off a list of questions that he things disprove the existence of a god.\nCarlos and Rabbi Mirel then find common group, agreeing on belief that there is life on other planets.\nNo problems here: Everyone seems to believe that marijuana should be legal\nWise words: 'God made dirt, dirt don't hurt,' says Carlos. 'God made weed. Weed don't make you bleed'\nWhen asked about the legality of weed, the men also seem to agree. Reverend Schuller said he would like to see marijuana laws similar to those governing alcohol, while Rabbi Mirel says if people have a positive experience with it, that's a good thing.\n'God made dirt, dirt don't hurt,' says Carlos, to the laughs of the others. 'God made weed. Weed don't make you bleed.'\nToward the end of the clip, the priest notes that it Ash Wednesday, and Carlos allows him to put a cross of ash on his forehead. He then returns the favor.\nThe rabbi contributes his own blessings in Hebrew before the group takes a last hit apiece.","url":"https://www.dailymail.co.uk/femail/article-4320650/A-rabbi-priest-atheist-smoke-weed-together.html"}
