{"authors":["Deborah Danan"],"date_download":"2018-10-30 19:38:27","date_modify":"2018-10-30 19:38:27","date_publish":"2017-02-25 13:26:47","description":"TEL AVIV – An Arab NATO must be formed to confront Iran and its alliance with Iraq and Syria, a leading Saudi journalist said on Tuesday.","filename":"data/vaneerConsumption/ArabNATOMustBeFormedToConfrontIran.json","image_url":"https://media.breitbart.com/media/2016/01/Rouhani-fists-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_02_25__1540928307.html","title":"Arab NATO Must Be Formed To Confront Iran","title_page":"Saudi Journalist: Arab NATO Must Be Formed To Confront Iran","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – An Arab version of NATO must be formed to confront Iran and its alliance with Iraq and Syria, a leading Saudi journalist wrote on Tuesday.\nAbdul Rahman Al-Rashed, whose past roles include editor-in-chief of London-based Arab daily Asharq al-Awsat and general manager of Al Arabiya News Channel, wrote articles in both those publications this week calling for the Arab world, and in particular Saudi Arabia, the UAE, Egypt and Jordan, to “establish a joint military power to confront Iran’s expansion.”\nAl-Rashed further criticized the claim that President Donald Trump’s declarations against the Iran agreement strengthen the radicals there, the Middle East Media Research Institute (MEMRI) reported, citing the articles in their original Arabic. Al-Rashed argued that Iran’s belligerence since the nuclear deal was signed, not least its current funding of four wars, proves that former President Barack Obama’s relaxed policy only encouraged Tehran to escalate its aggression.\nThe ayatollahs and radicals in Iran, Al-Rashed asserted, have been in control of the country since the Islamic Revolution, and its more moderate politicians are puppets used to coax the West into leniency.\nPresident Hassan Rouhani and his FM Zarif both represented the moderates and they succeeded [in] winning over the administration of former president Barack Obama. They also managed to convince the administration that lifting sanctions and encouraging Iran’s openness were in the interest of moderate figures, the region and the whole world. Once again, evidence suggested this assumption was wrong. [The] Iranian leadership became more aggressive than ever and for the first time since the establishment of the Islamic Republic, the regime dared to expand its military activity outside its borders. It is currently participating in and funding four wars outside of Iran. All of this was possible due to the nuclear deal that paved the way for better relations, trade and activity and kept silent over Iran’s threats to the region.\nAl-Rashed added that “Things will keep on getting worse unless a strict international position against Iran’s adventures is taken and unless Iran is forced to end the chaos it is funding in the region and the world.”\n“The nature of the regime in Tehran is religious with a revolutionary ideology. It has a political agenda that has not changed much since it attacked the American embassy in Tehran and held diplomats hostage [in 1979],” Al-Rashed wrote.\n“The only change that happened is that its financial and military situations improved a lot thanks to the nuclear deal it signed with the West,” he concluded.\nIn the second article published in Al-Arabiya, Al-Rashed noted that Iran exploited the region’s political vacuum formed in the years since the Iraq war. He also reiterated the Islamic Republic’s exploitation of the Obama administration’s policies, not least of all its nuclear agreement, to expand its hegemony in Iraq, Syria and Yemen.\nAl-Rashed advised, “Military cooperation, under any umbrella, is a good idea and a necessary step, especially if expanded beyond [military cooperation]. Establishing an alliance to confront Iran is an essential balance to respond to its military alliance that includes Iraq and Syria.”","url":"https://www.breitbart.com/middle-east/2017/02/25/leading-saudi-journalist-arab-nato-must-formed-confront-iran/"}
