{"authors":["Cristina Arreola"],"date_download":"2018-10-31 01:42:36","date_modify":"2018-10-31 01:42:36","date_publish":"2018-09-14 16:27:53","description":"Look, I get it: The next Avengers movie doesn't come out until next year, the world is a mess, and you probably just want to settle in with a kickass superhero story that transports you to a different world for a little while. Well, do I have good…","filename":"data/vaneerConsumption/ArchenemiesByMarissaMeyerIsASuperheroStoryWithATwistYouCanStartReadingNow.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/b8438fab-bf24-4c2c-b60c-ca81f29e5f94-archenemiesmarissameyer2.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_archenemies-by-marissa-meyer-is-a-superhero-story-with-a-twist-you-can-start-reading-now-11911790_1540950156.html","title":"'Archenemies' By Marissa Meyer Is A Superhero Story With A Twist - & You Can Start Reading Now","title_page":"'Archenemies' By Marissa Meyer Is A Superhero Story With A Twist — & You Can Start Reading Now","title_rss":"NULL","source_domain":"bustle.com","text":"Look, I get it: The next Avengers movie doesn't come out until next year, the world is a mess, and you probably just want to settle in with a kickass superhero story that transports you to a different world for a little while. Well, do I have good news for you — the second book in Marissa Meyer's Renegades series, Archenemies, comes out in November, and Bustle has an exclusive first look at the trailer and chapter one below.\nHere's a quick refresher: In Renegades, Marissa Meyer introduced readers to a world where The Renegades, a group of humans with extraordinary abilities, established peace in a land marked by destruction and chaos. But not everyone loves The Renegades — Nova included. They let her down when she needed them the most, and she wants payback. The only complication is Adrian, the Renegade she meets on her mission of vengeance.\nIn Archenemies, Nova struggles to balance her growing feelings for Adrian with her double life: She's now a member of The Renegades, working alongside Adrian, but she's also joined The Anarchists, a group of villains determined to destroy The Renegades. What she doesn't know is that Adrian has a few secrets of his own.\nArchenemies doesn't hit bookstores until Nov. 6, 2018, but you can sneak a peek at the trailer:\nFierce Reads on YouTube\nWell, if that didn't give you major CW superhero series vibes, the excerpt below certainly will. Start reading from Archenemies, available for pre-order now:\nArchenemies by Marissa Meyer, $18, Amazon\nChapter One\nAdrian crouched on the rooftop, peering at the delivery entrance behind Gatlon City Hospital. It was early morning— the sun hadn’t risen yet, though hints of light were turning the sky from charcoal gray to pale violet. The dimness made it difficult to see anything ten stories below, beyond a couple of vans and a supply truck.\n“I have eyes on the getaway vehicle,” said Nova, who was watching the quiet streets through a pair of binoculars.\n“Where?” he asked, leaning toward her. “How can you tell?”\n“That van on the corner.” She swiveled her view from the vehicle to the hospital door and back. “Nondescript, blacked-out windows, engine still running even though it’s been parked since we got here.”\nAdrian sought out the van. Steam was rising from its exhaust pipe in great white clouds. “Is there anyone inside?”\n“One, in the driver’s seat. Could be more, but I can’t see into the back.”\nAdrian lifted his wrist toward his mouth, speaking into his communication band. “Sketch to Smokescreen and Red Assassin. Suspected getaway vehicle is parked at Seventy-Ninth and Fletcher Way. Set your stations to the south and east escape routes. Still waiting on internal recon from Monarch.”\n“Roger that,” Oscar’s voice crackled back at him. “We’re on the move.”\nAdrian tapped his fingers against the rooftop ledge, wishing the back entrance to the hospital had better lighting. There were six street lamps, but three of them were burned out. Shouldn’t someone have taken care of those?\n“Can I see?” he asked.\nNova held the binoculars out of his reach. “Get your own pair.”\nThough he wanted to be irritated with the response, he couldn’t help a twitch of a smile. It was fair enough, he supposed, as Nova had spent twenty minutes that morning explaining to Oscar all of the modifications she’d made to this particular pair of generic binoculars. They now sported autofocus and stabilization functionality, motion targeting, night vision, a video recorder, and computerized lenses that could display GPS coordinates and weather forecasts. And because that evidently wasn’t impressive enough, she’d also added software that combined targeted facial recognition with the Renegades’ prodigy database.\nEvidently, she’d been working on them for months.\nThough he wanted to be irritated with the response, he couldn’t help a twitch of a smile. It was fair enough, he supposed, as Nova had spent twenty minutes that morning explaining to Oscar all of the modifications she’d made to this particular pair of generic binoculars.\n“Fine, I will get my own,” he said, pulling his fine-tip marker from the sleeve of his Renegade uniform. He started to sketch a pair of binoculars onto the side of a metal utility box. “Maybe I’ll give mine X-ray vision.”\nNova’s jaw tensed. “Were you always such a one-upper?”\nHe beamed. “I’m only kidding. I would need at least some basic knowledge of how X-ray vision works. But I’m definitely giving them that motion-targeting feature you talked about. And ergonomic handholds. And maybe a flashlight . . .” He finished his sketch and capped his marker. Pressing his fingers against the metal surface, he pulled the drawing from the utility box, transforming it into a functional, three-dimensional reality.\nKneeling beside Nova again, he adjusted the width of his new binoculars and peered toward the street. The van hadn’t moved.\n“There’s Danna,” said Nova.\nAdrian swiveled his view toward the delivery bay, but the doors were still closed. “Where—”\n“Third story.”\nHe readjusted and saw the swarm of Monarch butterflies pouring out of an open window. In the darkness, they looked more like a colony of bats silhouetted against the building. The butterflies converged over the hospital’s parking garage and morphed into the figure of Danna.\nThe communication band buzzed. “They’re heading out now,” came Danna’s voice. “Six altogether.”\n“Seven with the driver,” Nova corrected, as the van pulled forward. It turned the corner and came to a stop in front of the delivery doors. Seconds later, those doors were thrown open and six figures came pouring out of the hospital, loaded down with enormous black bags.\n“Citizen status?” asked Adrian.\n“All clear,” replied Danna.\n“Roger. Okay, team, we are cleared to engage. Danna, stay on—”\n“Sketch!” said Nova, startling him. “There’s a prodigy.”\nHe blinked over at her. “What?”\n“That woman—the one with the nose ring. She’s showing up on the database. Alias . . . Hawthorn?”\nHe racked his brain, but the name wasn’t familiar. “Never heard of her.” Adrian watched through his binoculars again as the figures threw their haul into the van. The woman with the nose ring was the last to climb in. “What’s her power?”\n“Evidently she has . . . thorn-covered extremities?” Nova shot him a baffled look.\nShrugging, Adrian spoke into his wristband again. “High alert, team. The targets have a prodigy with them. Stay with your assignments, but proceed with caution. Insomnia and I will—” A bang startled Adrian and he turned to see that Nova was already gone. He lurched to his feet and peered over the side of the building. The sound had been Nova landing on the first level of the apartment’s fire escape. “. . . take the north post,” he muttered.\nTires squealed. The van lurched away from the hospital. Adrian raised his wrist, adrenaline coursing through his body as he waited to see which direction . . .\nThe van took the first left.\n“Smokescreen, you’re up!” he yelled.\nTossing aside the binoculars, Adrian raced after Nova. Overhead, Danna swarmed again and chased after the van.\nTires squealed. The van lurched away from the hospital. Adrian raised his wrist, adrenaline coursing through his body as he waited to see which direction . . .\nNova was halfway down the street by the time Adrian dropped down from the fire escape, his boots pounding on the pavement. He raced after her, his long legs giving him some advantage, though he was still trailing behind when Nova jutted her finger to the right. “You head that way!” she yelled, taking off in the opposite direction.\nA block away, he heard the screech of tires again, this time accompanied by the slamming of brakes. A cloud of thick white fog could be seen rising over the roof of an office building.\nOscar’s voice came through the wristband. “They’re reversing— heading north on Bridgewater.”\nAdrian turned the corner and saw red taillights blazing toward him. He reached for a piece of white chalk in his sleeve, pocketed beside the marker. Crouching down, he drew a hasty nail strip on the asphalt. He finished the illustration as the smell of burning rubber invaded his nostrils. If the driver could see him in the rearview mirror, he showed no sign of slowing down.\nAdrian tugged on the drawing. The four-inch spikes emerged from the ground, and he lunged out of the way seconds before the van blurred past him.\nThe tires blew with a series of deafening pops. From behind the blackened windows, Adrian could hear the occupants of the van cursing and arguing with one another as the deflated wheels dragged to a stop.\nThe cloud of butterflies swirled overhead and Danna dropped down onto the roof of the van. “Quick thinking, Sketch.”\nAdrian stood, still gripping the chalk. His other hand reached for the Renegade-issued handcuffs clipped to his belt. “You are under arrest,” he called. “Come out slowly with your hands up.”\nThe door clunked open, parting just wide enough for a hand to emerge, fingers spread in supplication.\n“Slowly,” Adrian repeated.\nThere was a hesitation, and then the door was thrown open the rest of the way. Adrian spotted the barrel of a gun moments before a volley of bullets started to pepper the building behind him. He yelped and dived behind a bus stop, throwing his arms over his head. Glass shattered and bullets pinged against stone.\nSomeone shouted. The gunfire stopped.\nThe rest of the van doors were flung open in unison—driver, passenger, and the two at the back.\nAll seven criminals emerged, scattering in different directions.\nThe driver bolted for a side street, but Danna was on him instantly: a cyclone of golden wings one minute, and the next, a zealous superhero, clamping one arm around the man’s throat and throwing him to the ground.\nA woman from the passenger seat sprinted south on Bridgewater and vaulted over the strip of nails, but she hadn’t gone half a block before she was struck in the face by an arrow of black smoke. She dropped to her knees, choking. Still struggling to breathe, she offered little resistance as Oscar emerged from behind a parked car and clamped cuffs around her wrists.\nThree more thieves rushed through the van’s back doors, each weighed down with their bulging plastic bags. None of them saw the thin wire strung across the length of the road. Their ankles caught, one after the other, sending them crashing into a heap on the asphalt. One bag flopped open, spilling dozens of small white pill bottles into the gutter. Skipping out from behind a mailbox, Ruby made quick work of binding the three, then went to retrieve the red hook at the end of her wire.\nThe last two criminals emerged from the side door. The woman with the nose ring—Hawthorn, according to Nova’s binoculars— was gripping the automatic rifle in one hand and a black garbage bag in the other. She was followed by a man with two more bags flung over his shoulder.\nNone of them saw the thin wire strung across the length of the road. Their ankles caught, one after the other, sending them crashing into a heap on the asphalt.\nAdrian was still crouched behind the bus stop when the two shot past him into a narrow alley. He sprang to his feet but hadn’t gone two steps before something whistled past him and he saw a glint of red from the corner of his eye.\nRuby’s spiked bloodstone sliced through the bag over the woman’s shoulder, cutting a narrow slit into its side. But her wire was too short. The woman was just out of reach. The gem rebounded, clattering to the concrete. A single plastic bottle tumbled from the tear in the bag.\nGrowling, Ruby reeled the wire back in and began to swing it overhead like a lasso as she charged forward, preparing for another throw.\nThe woman stopped suddenly and turned to face them, aiming the gun. She released another round of bullets. Adrian threw himself at Ruby. She cried out in pain as they both tumbled behind a dumpster.\nThe gunfire stopped as soon as they were under cover. The criminals’ footsteps clomped away from them.\n“Are you all right?” said Adrian, though the answer was obvious. Ruby’s face was contorted, both hands gripping her thigh.\n“Fine,” she said through gritted teeth. “Stop them!”\nSomething crashed down the alley—the ear-splitting noise of breaking glass and crunching metal. Adrian poked his head around the dumpster to see a destroyed air-conditioning unit on the pavement. He scanned the roof of the surrounding apartments just as a second unit was hurled down at the thieves. It smashed onto the ground steps in front of the woman, who let out a strangled cry and opened fire again.\nNova ducked back. The bullets burst across the top of the building, marring it with a series of tiny craters.\nAdrian didn’t stop to think as he stepped out from behind the dumpster, out from Ruby’s view, and raised his arm. Even beneath the dark gray sleeve of his uniform, he could see his skin start to glow as the narrow cylinder he’d once tattooed onto his flesh sprouted along the length of his forearm.\nHe fired.\nThe concussion beam struck Hawthorn between her shoulder blades, launching her over one of the smashed air-conditioning units. The rifle clattered against the nearest wall.\nEven beneath the dark gray sleeve of his uniform, he could see his skin start to glow as the narrow cylinder he’d once tattooed onto his flesh sprouted along the length of his forearm.\nAdrian studied the roof line, heart pounding. “Insomnia?” he yelled, hoping his panic didn’t show in his voice. “Are you—”\nHawthorn let out a guttural scream and pushed herself up onto all fours. Her accomplice stumbled a few steps away, still gripping his two bags of stolen hospital drugs. He shook his head. “Rein it in, Hawthorn,” he said. “Let’s just get out of here.”\nIgnoring him, the woman turned toward Adrian and snarled.\nAs he watched, a series of limbs sprouted upward from her back, not far from where his beam had struck her. Six appendages, each one a dozen feet long and scattered with sharp barbs. They reminded Adrian of octopus legs, if octopus legs had been covered in vicious-looking thorns.\nAdrian took a step back. When Nova had mentioned thorn covered extremities, he’d pictured unusually sharp fingernails. Whoever put the database together really needed to work on being more specific.\nHawthorn’s accomplice cursed. “I’m out of here!” he yelled, and took off running again.\nIgnoring him, Hawthorn reached her tentacles toward the nearest fire escape and hauled her body upward, as quick and graceful as a spider. When she was still a platform down from the top, she reached one tentacle up and over the side.\nNova cried out. Adrian’s lungs expelled a horrified breath as he watched the woman haul Nova off the roof. She held her aloft for a second, then threw Nova down.\nOn instinct, Adrian launched himself upward. He didn’t think about using the springs on his feet—the others weren’t supposed to know about his tattoos—but there was no time to question it. He intercepted Nova’s body before she struck the building on the other side of the alley, and they both crashed down on top of the dumpster.\nPanting, Adrian pulled back to inspect Nova, still in his arms. There was something warm and sticky on her back, and his hand was red when he pulled it away.\n“I’m fine,” Nova grunted, and she looked more angry than hurt. “Just scratched up by those thorns. I hope they aren’t poisonous.” She sat up and spoke into her communicator band, informing the rest of the team what they were up against.\nAdrian scanned the building, afraid that another attack was imminent, but Hawthorn wasn’t coming after them. As he stared, she used her tentacles to swing from the fire escape to a drain pipe, then slid back down to the alley. Two of her tentacles stretched out, snatching up the dropped bag and the single pill bottle that had fallen from it, before chasing after her accomplice.\n“I’m going after her,” said Nova. She slipped over the side of the dumpster, her boots thudding on the ground.\n“You’re hurt!” said Adrian, landing beside her.\nRuby stumbled out from the shadows. She was limping, but where there had been blood before, now a series of jagged red crystals had burst like stalagmites across her open wound. “I’m going after her too,” she said, snarling.\nNova spun away from them both, but Adrian grabbed her arm and held her back.\n“Sketch! Let me go!”\n“Two seconds!” he yelled back, pulling out his marker. He used it to draw a quick cut into the blood-soaked fabric of her uniform, revealing the wound on her lower back, not far from her spine. More a puncture than a scratch.\nRuby stumbled out from the shadows. She was limping, but where there had been blood before, now a series of jagged red crystals had burst like stalagmites across her open wound.\n“Adrian! They’re getting away!”\nIgnoring her, he drew a series of crisscrossing bandages over the wound. “There,” he said, capping the marker as the bandages knitted together over her flesh. “Now at least you won’t bleed to death.”\nShe grumbled something, exasperated.\nThey took off running together, though it soon became clear that Ruby wasn’t going to be able to keep up. While Nova sprinted forward, Adrian grabbed Ruby’s shoulder, stopping her. “We’ll handle the prodigy. You head back, make sure the others are secured.”\nRuby was about to argue when Danna’s voice crackled over their communicator bands. “I have eyes on Hawthorn and the male suspect. They’re doubling back toward the hospital, heading east on Eighty-Second. Probably going for the river.”\nRuby fixed a stern look on Adrian. “Don’t let them get away.”\nHe didn’t bother to respond. Turning, he sprinted down a narrow side street. Maybe he could cut them off. Had Nova gone back to the main road, or would she make her way to a rooftop and track them from above?\nWhen he was sure Ruby was out of sight, he used the tattooed springs on the soles of his feet to launch himself forward, covering the distance ten times as fast as he could by running. Reaching the end of the alley, he spotted both criminals as they barreled around the next corner.\nHe ran after them and turned the corner at the same time Nova did, coming from the other direction. She stumbled in surprise when she saw him. “That was fast,” she panted.\nThey kept pace with each other, sprinting side by side. The criminals were a block ahead. Every once in a while Adrian spotted another pill bottle from the slit in Hawthorn’s bag, rolling off toward a gutter. It made an easy path to follow.\nAhead, the road ended in a T, and Adrian saw the two criminals start to split up. They intended to separate—and to drive Adrian and Nova apart.\n“I’ll take Hawthorn,” said Adrian. “No,” said Nova, pulling a wide-barreled gun from her tool belt. Without slowing, she aimed and fired. The bolt of energy struck the man just as he was heading for the next street. It sent him flying through the window of a small café. Shards of glass rained around him as he tumbled over a table and disappeared from view. One of the garbage bags caught on the broken window, sending a flood of plastic bottles across the sidewalk.\n“You get him,” said Nova. “I’ll take Hawthorn.”\nAdrian huffed. “Now who’s a one-upper?”\nThough Hawthorn hesitated when her cohort was blown through the window, she didn’t stop. If anything, she ran faster, using both her legs and the six tentacles to skitter down the street.\nAdrian hadn’t fully made up his mind whether to apprehend the man or stay with Nova when a scream brought them both skidding to a stop. Adrian’s attention swiveled toward the shattered window of the café. It wasn’t the window, though, but the front door that burst open, crashing so hard against the side of the building that the closed sign fell to the sidewalk.\nThe man emerged. He had abandoned the garbage bags and instead had one arm wrapped around the throat of a teenage girl wearing a checkered apron. His other hand was pressing a gun to the side of her head.\nFrom ARCHENEMIES © 2018 by Tomi Marissa Meyer. Reprinted by permission of Feiwel & Friends, an imprint of Macmillan Children’s Publishing Group, a division of Holtzbrink Publishing Holdings Limited Partnership. All rights reserved.","url":"https://www.bustle.com/p/archenemies-by-marissa-meyer-is-a-superhero-story-with-a-twist-you-can-start-reading-now-11911790"}
