{"authors":["Press Association"],"date_download":"2018-10-23 02:02:44","date_modify":"2018-10-23 02:02:44","date_publish":"2016-01-11 13:38:23","description":"The Archbishop of Canterbury has admitted he is powerless to stop church leaders walking out of talks aimed a healing splits in the Anglican Communion over h...","filename":"data/vaneerConsumption/Archbishopofcanterburyunabletostopchurchleadersquittingsplittalks.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-1be56417-95a4-470f-989f-260cc7114e75-56CX32zFKLb7123928b84cf404c3-539_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3393748_Archbishop-Canterbury-unable-stop-church-leaders-quitting-split-talks_1540260164.html","title":"Archbishop of canterbury 'unable to stop church leaders quitting split talks'","title_page":"Archbishop of canterbury 'unable to stop church leaders quitting split talks' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Archbishop of Canterbury 'unable to stop church leaders quitting split talks'\nThe Archbishop of Canterbury has admitted he is powerless to stop church leaders walking out of talks aimed a healing splits in the Anglican Communion over homosexuality.\nAfrican representatives at the meeting in Canterbury are poised to pull out of the discussions sparking fears of a permanent schism.\nThe Most Rev Justin Welby said he hoped to achieve \"reconciliation\" at the gathering of Anglican primates over the course of this week.\nThe Archbishop of Canterbury hopes to achieve reconciliation at a gathering of Anglican primates\n\"Certainly I want reconciliation. Reconciliation doesn't always mean agreement, in fact it very seldom does. It means finding ways of disagreeing well,\" he told BBC Radio 4's Today programme:\n\"There is nothing I can do if people decide to leave the room. It won't split the communion.\"\nAnglicans across the world have been divided since the liberal Episcopal Church in America consecrated Canon Gene Robinson, who is gay, as bishop of New Hampshire in 2003.\nThe archbishop said: \"The Church is a family and you remain a family even if you go your separate ways.\"\nHe added: \"A schism would not be a disaster, God is bigger than our failures, but it would be a failure. It would not be good if the Church is unable to set an example to the world of showing how we can love one another and disagree profoundly because we are brought together by Jesus Christ not be our own choice.\"\nMr Welby, who has called for countries to welcome refugees, said the wave of sex crimes in t he German city of Cologne called for \"clear-eyed\" handling.\n\"It shows that the process of welcoming and being hospitable is a really complicated one that has to be thought through and dealt with in a sophisticated and highly intelligent way and with a very clear-eyed view about people who, as Angela Merkel has said, come and don't keep the rules.\"","url":"https://www.dailymail.co.uk/wires/pa/article-3393748/Archbishop-Canterbury-unable-stop-church-leaders-quitting-split-talks.html"}
