{"authors":["Associated Press"],"date_download":"2018-10-23 03:51:47","date_modify":"2018-10-23 03:51:47","date_publish":"2016-01-11 16:51:57","description":"NEW YORK (AP) — Arch Coal, which has been hurt by the weakening demand for coal, filed for Chapter 11 bankruptcy protection Monday. The coal industry is stru...","filename":"data/vaneerConsumption/ArchCoalfilesforChapter11bankruptcyprotection.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393893_Arch-Coal-files-Chapter-11-bankruptcy-protection_1540266707.html","title":"Arch Coal files for Chapter 11 bankruptcy protection","title_page":"Arch Coal files for Chapter 11 bankruptcy protection | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Arch Coal files for Chapter 11 bankruptcy protection\nNEW YORK (AP) — Arch Coal, which has been hurt by the weakening demand for coal, filed for Chapter 11 bankruptcy protection Monday.\nThe coal industry is struggling as electric power companies shift to using natural gas, which costs less than coal and produces less pollution. Other coal companies have filed for bankruptcy protection recently, including Alpha Natural Resources Inc. and Patriot Coal Corp. Arch Coal warned late last year that it may file for bankruptcy protection.\nFilling for Chapter 11 bankruptcy protection allows companies to reorganize their debt while they keep their business operating.\nArch Coal Inc. said its mines will remain open and its employees should not be affected by the bankruptcy process. It said employees will continue to be paid and their benefits, including health care and retirement plans, will also continue.\nThe company said it reached a deal with its lenders to reduce its debt by more than $4.5 billion. In filings with a bankruptcy court, the St. Louis-based company says it has $6.5 billion in debt and $5.8 billion in assets.","url":"https://www.dailymail.co.uk/wires/ap/article-3393893/Arch-Coal-files-Chapter-11-bankruptcy-protection.html"}
