{"authors":[],"date_download":"2018-10-22 21:04:33","date_modify":"2018-10-22 21:04:33","date_publish":"2014-06-03 17:15:21","description":"They may not meet the legal definition, but the surge in children arriving alone at the U.S. border are seen by some as this country's refugee crisis.","filename":"data/vaneerConsumption/AreBorderChildrenaRefugeeCrisisfortheUS.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/484911/20140603-girls-border-crossed-sl-1451_cec25134cb8d15ab1147cc2c928ae723.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_are-border-children-refugee-crisis-u-s-n121441_1540242273.html","title":"Are Border Children a Refugee Crisis for the U.S.?","title_page":"Are Border Children a Refugee Crisis for the U.S.?","title_rss":"NULL","source_domain":"nbcnews.com","text":"Americans are accustomed to seeing reports of refugees swamping the borders of countries abroad - Syrians fleeing to Turkey, Sudanese streaming to South Sudan. But they aren’t accustomed to seeing such flights of humanity on their doorstep.\nThe escalating numbers of young children arriving alone at the U.S. border with Mexico, many of them younger than 13, prompted the president to declare a humanitarian crisis on Monday.\nThe issue has brought to light a divide; those who believe in stronger immigration enforcement blame the president and consider the arrivals an immigration enforcement problem. Groups who work with children who have crossed the border alone say the nation is experiencing its own refugee crisis as children flee violence in their home countries.\n“If this was happening in any other part of the world, the United States would be telling the receiving countries they have an obligation to protect the arriving migrants. We’ve done that to much poorer countries who have seen much poorer people,” said one advocate.\nWendy Young is president of Kids In Need of Defense, a group started by Angelina Jolie and Microsoft that assists immigrant and refugee children. Young said the key difference is that in this case the children are being forced to leave their home countries. Not all children fall into the situation of being refugees, but refugee crises abroad often are a mixed population too, Young said.\n“I give the administration credit for identifying this as a humanitarian crisis. It gives them a lot of latitude to triage an emergency response,” said Young. But in coming days and weeks the response will need to become more sophisticated because many of the kids have been forced to leave home and many won’t be able to return.\nRefugee carries a specific definition in immigration law as someone who has a founded fear of persecution based on race, religion, nationality, political opinion or membership in a particular social group. Many of the kids would fit in the latter category, Young said.\nMichelle Brané, of the Women’s Refugee Commission, said she hopes the president declaring the children's arrivals a humanitarian crisis reminds people of the nation’s responsibility.\nIn a U.N. report on refugees, 38 percent of the Mexican children interviewed said they were being recruited and exploited by human smugglers.\n“If this was happening in any other part of the world, the United States would be telling the receiving countries they have an obligation to protect the arriving migrants. We’ve done that to much poorer countries who have seen much poorer people,” said Brané, the commission’s director of migrant rights and justice program.\nRecent reports have documented some of the harrowing journeys of the children and life threatening encounters.\n\"We had kids tell us really awful, awful traumatizing stories. One girl told us of opening her door and finding a chopped up body in a plastic bag as a warning from a gang,\" said Brané, whose group first reported on unaccompanied children in 2009.\nThe rise in apprehensions of children crossing the border illegally and alone is happening as overall border apprehensions have increased only slightly and remain at historic lows, according to Customs and Border Protection.\nFrom Oct. 1 to May 31st of the 2014 fiscal year, 47,017 children had been apprehended at the Southwest border, up from 24,493 in fiscal year 2013, CBP data shows. Most of the children are entering the Rio Grande Valley of South Texas.","url":"https://www.nbcnews.com/news/latino/are-border-children-refugee-crisis-u-s-n121441"}
