{"authors":["Mika Doyle"],"date_download":"2018-10-31 01:41:55","date_modify":"2018-10-31 01:41:55","date_publish":"2018-09-14 18:35:24","description":"All these labels on everything from plastic water bottles to food containers to that cute coffee tumbler at your local café tout that they’re “BPA-free.” But are BPA-free plastics healthier? Well, not necessarily according to a new study published…","filename":"data/vaneerConsumption/AreBPAFreePlasticsHealthierNotNecessarilyANewStudySays.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/582f87c3-3bc6-43f5-8f57-74391d5f8096-fotolia_201528771_subscription_monthly_m.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_are-bpa-free-plastics-healthier-not-necessarily-a-new-study-says-11923187_1540950115.html","title":"Are BPA-Free Plastics Healthier? Not Necessarily, A New Study Says","title_page":"Are BPA-Free Plastics Healthier? Not Necessarily, A New Study Says","title_rss":"NULL","source_domain":"bustle.com","text":"All these labels on everything from plastic water bottles to food containers to that cute coffee tumbler at your local café tout that they’re “BPA-free.” But are BPA-free plastics healthier? Well, not necessarily according to a new study published in Current Biology, Gizmodo reports. According to researchers, it turns out those BPA-free plastics can still leak out chemicals when they’re heated or damaged — just like plastics that do contain BPA, says Gizmodo. That means going BPA-free might not be as healthy as we once thought it was.\nSo what does all this BPA and BPA-free stuff mean, anyway? According to Vox, most food containers are made using polycarbonate plastics, and some have bioactive chemicals like bisphenol A (BPA) and phthalates. And when we say most food containers, we’re talking like pretty much everything — drink bottles, the linings of aluminum cans, food wrappings, plastic wrap, yogurt containers, coffee pods, you name it. Those chemicals like BPA, says Vox, can leak into the foods and drinks they’re holding, especially if those containers are heated or damaged. According to Gizmodo, that means an estimated 93 percent of Americans have BPA in their systems.\nAccording to The Guardian, BPA mimics the hormone estrogen and can mess with our body's endocrine system, which is responsible for regulating things like metabolism, growth, sexual function, and sleep. But because animal studies have used higher doses of BPA than humans receive in the real world, it’s difficult for researchers to determine the real effects BPA is having on human bodies, the Guardian reports.\nJack Taylor/Getty Images News/Getty Images\nHowever, according to Vox, even though humans are exposed to BPA from “many sources simultaneously” and it’s “tricky to measure their health impact,” Vox says “there’s compelling evidence that their ‘endocrine disrupting’ capabilities have a range of disturbing health effects.” However, it should be noted that the FDA released a study in February that conflicts with what advocates are saying, NPR reports, finding even at high doses that BPA only had minimal effects.\nRegardless of how much damage it actually does, it probably makes sense to take the BPA out of the plastic equation either way, right? But the new study published in Current Biology shows that BPA-free plastics can also leak the same hormone-disrupting chemicals as BPA-containing plastics. So how do you avoid these chemicals when plastics are, like, everywhere? Sometimes you can’t avoid plastics, like when you purchase certain items at the grocery store. But when it comes to how you store and package items in your own home, there are lots of plastic alternatives that can help you reduce the amount of plastic you use in your daily life.\nsebra/Fotolia\nReusable grocery store bags are probably the most obvious option, which most stores now sell near the register. But did you know there are also reusable produce bags that can replace those plastic ones at the grocery store? You can also swap plastic wrap for reusable food wraps and plastic sandwich bags for reusable silicone bags. Glass storage containers can replace plastic ones, and stainless steel water bottles are a plastic water bottle alternative — plus they keep your drink colder longer.\nBPA or BPA-free, maybe reducing the plastic we use in our daily lives will help us get a better handle on how plastic truly is affecting our bodies. Plus, it couldn't our carbon footprint to use a little less plastic every now and then.","url":"https://www.bustle.com/p/are-bpa-free-plastics-healthier-not-necessarily-a-new-study-says-11923187"}
