{"authors":["Richard Gray For Mailonline"],"date_download":"2018-10-23 01:45:47","date_modify":"2018-10-23 01:45:47","date_publish":"2016-01-11 12:56:43","description":"Research conducted by traffic psychologists at the University of Bath has raised important questions about the safety of cycle helmets. They found those wearing helmets increase risk taking by 30 per cent.","filename":"data/vaneerConsumption/ArecyclehelmetsreallysafePeopletakegreaterriskswearingthem.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/0FE50C0800000514-0-image-a-17_1452515703353.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3393812_Are-cycle-helmets-really-safe-People-risks-wearing-head-gear-increases-chance-accident_1540259147.html","title":"Are cycle helmets really safe? People take greater risks wearing them","title_page":"Are cycle helmets really safe? People take greater risks wearing them | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Cycle helmets are promoted as a way of reducing injury if someone is knocked off their bike, but new research suggests they may be increasing the risk of accidents in the first place.\nPsychologists have discovered that people wearing cycle helmets tend to take more risks than they would if they did not have one protecting their head.\nThis suggests much of the protective edge provided by a helmet may be lost by making cyclists more likely to have an accident in the first place.\nCyclists who wear helmets take greater risks than they do if they are wearing non-protective headgear, such as a baseball cap. Psychologists said this may be because wearing a helmet 'primes' the cyclists concept of safety to make them think they can take more chances without risking harm (stock image of cyclists pictured)\nThe research follows concerns raised by leading neuroscientists who have warned they are seeing increasing numbers of severe head injuries in cyclists.\nRecent research also found that motorists drive up to three inches closer to cyclists who wear helmets because they are seen as being less vulnerable.\nTaken together, the findings suggest cycle helmets may cause changes in behaviour that increase the risk of accidents.\nIn the latest study, scientists tested how 80 cyclists would behave in a series of experiments while wearing a cycle helmet or a baseball cap.\nThey found the participants were willing to push the boundaries of what they thought could do by up to 30 per cent when wearing the helmets.\nMOTORISTS GET CLOSER TO CYCLISTS WEARING HELMETS Drivers pass closer to cyclists wearing helmets when overtaking than those who have nothing on their head, increasing the risk of a collision, research recently found. Dr Ian Walker, a psychologist at the University of Bath, used a bicycle fitted with a computer and an ultrasonic distance sensor to record data from over 2,500 overtaking motorists. He found drivers twice as likely to get closer to the bike when he was wearing a helmet. Drivers passed an average of three inches closer when he was wearing a helment than when he was not. Dr Walker was struck himself twice during the experiment - by a bus and a truck. On both occasions he was wearing a helmet. He said: 'This study shows that when drivers overtake a cyclist, the margin for error they leave is affected by the cyclist's appearance. 'By leaving the cyclist less room, drivers reduce the safety margin that cyclists need to deal with obstacles in the road, such as drain covers and potholes, as well as the margin for error in their own judgements. 'We know helmets are useful in low-speed falls, and so definitely good for children, but whether they offer any real protection to somebody struck by a car is very controversial.'\nWriting in the journal Psychological Science, Dr Tim Gamble and his colleague Dr Ian Walker, both traffic psychologists at the University of Bath, said: 'Humans adapt their risk-taking behaviour on the basis of perceptions of safety.\n'In a controlled study in which a helmet, compared with a baseball cap, was used as the head mount for an eye tracker, participants scored significantly higher on laboratory measures of both risk taking and sensation seeking.\n'The results suggest that unconscious activation of safety-related concepts primes globally increased risk propensity.'\nThe researchers gave the participants a cap or a helmet that they claimed was fitted with equipment for an eye-tracking experiment.\nThey were asked to inflate a balloon on a computer screen as high as they felt possible without popping it.\nThe more inflated the balloon, the higher their reward.\nThe researchers found those wearing helmets inflated their balloons on average 30 per cent more than those wearing baseball caps.\nThis, the researchers said, could mean cyclists also take more risks when on the road when wearing a helmet.\nIf this turns out to be the case, it would mean cycle safety campaigns will need to find ways of addressing the issue.\nThere has been a growing push for cyclists to wear bike helmets in recent years as rising numbers of people on bicycles share the roads with more and more cars.\nA study conducted for the Department of Transport in the UK showed helmets could reduce cyclist fatalities by between 10 and 16 per cent.\nAnother study, conducted two years ago in American Football players, showed helmets could reduce the risk of brain injury by 20 per cent.\nCycling safety lessons (pictured) tend to promote wearing cycle helmets, but the new research suggests this can have a counteractive effect as it makes cyclists more likely to take risks\nA previous study found that motorists also tend to pass far closer to cyclists wearing a helmet (stock image pictured). Taken together, the findings suggest cycle helmets may cause changes in behaviour that increase the risk of accidents but other research has suggested they can cut fatalities by up to 16 per cent\nBut in 2014, Henry Marsh, a neuroscientist who worked at St George's Hospital in Tooting, London at the time, said bike helmets were 'too flimsy' to be beneficial.\nHe said: 'In the countries where bike helmets are compulsory there has been no reduction in bike injuries whatsoever.\n'I see lots of people in bike accidents and these flimsy little helmets don't help.'\nHowever, Olympic Gold medallist James Cracknell has said he owes his life to the cycle helmet he was wearing when he was hit by a petrol tanker while cycling in 2010.","url":"https://www.dailymail.co.uk/sciencetech/article-3393812/Are-cycle-helmets-really-safe-People-risks-wearing-head-gear-increases-chance-accident.html"}
