{"authors":["Jessica Calefati","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 23:10:01","date_modify":"2018-10-30 23:10:01","date_publish":"2017-02-22 08:24:26","description":"The $300 state grant Devon Graves got his senior year at Cal Poly Pomona was only enough for gas and groceries—it didn’t make his $20,000 in student loans","filename":"data/vaneerConsumption/AreCaliforniasjeopardizedMiddleClassScholarshipsworthsaving.json","image_url":"https://calmatters.org/wp-content/uploads/MIDDLE_CLASS_SCHOLARSHIP_PHOTO_1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540941001.html","title":"Are California's jeopardized Middle Class Scholarships worth saving?","title_page":"Are California's jeopardized Middle Class Scholarships worth saving? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"The $300 state grant Devon Graves got his senior year at Cal Poly Pomona was only enough for gas and groceries—it didn’t make his $20,000 in student loans any easier to manage. Still, it meant a lot to the teen from Murrieta, a commuter town on the edge of Riverside County.\n“This award was a symbol of the state’s support for my education, and that symbolism meant more to me than the amount,” said Graves, who didn’t qualify for any other financial aid before becoming one of the first recipients of a taxpayer-funded Middle Class Scholarship in 2014.\nHis parents were like many others—too cash-strapped to cover his tuition by writing a check, and too well-off to get one of the more generous grants reserved for the poor. Health problems prevented his mother from working and forced his family of five to rely on his father’s sheriff’s deputy salary, but even that hardship failed to open doors to extra help.\nNow, with the state’s financial fortunes beginning to worsen, Democratic Gov. Jerry Brown has proposed axing the financial aid program for nearly 50,000 students to save money and help close a nearly $2 billion budget gap—even as the University of California and California State University systems prepare to hike tuition for the first time in six years. Under Brown’s plan, current recipients would continue receiving grants.\nDemocratic Assembly Speaker Anthony Rendon of Paramount criticized the governor for turning his back on middle class families and vowed to “keep college affordable” by protecting the program, which was championed by one of his predecessors. But some college-access advocates and even a top university administrator say it isn’t working as designed.\nFewer students qualify for the awards than the state first projected, and many of those who do get relatively small checks under program rules that offer less to applicants whose families make more.\nAnd because there’s no income floor written into the law, a third of scholarship recipients come from low-income families making less than $80,000—even though the program was designed to help middle-income families making $80,000 to $150,000 annually who don’t qualify for much other relief.\nIt’s those disadvantaged students whom the program wasn’t intended to serve who have the greatest need, get the largest checks and would be most harmed if it disappears.\n“We’re pro funding for students of all income levels,” said Dean Kulju, CSU’s director of student financial aid services and programs, “but the Middle Class Scholarship program isn’t hitting its target.”\nFormer Assembly Speaker John Perez first pitched the financial aid program for middle class families in 2012 as an antidote to recession-era budget cuts that led UC and CSU tuition to almost double in four years. By closing a $1 billion corporate tax loophole, Perez estimated the state could reduce college fees by two-thirds for close to 200,000 families.\n“Too many families are getting squeezed out of higher education,” Perez said at the time.\nBut the legislation died on the last day of the 2012 legislative session, and later that fall, voters passed Proposition 39, which closed the same loophole and instead steered the resulting savings to solar energy projects. Lacking another way to fund the scholarships, Perez worked with Brown to craft a program with smaller awards whose costs would be phased in over four years and paid for out of the state’s general fund.\nThat scholarship program is now in its third year. It costs the state $74 million to administer, far less than what Perez first projected, and offers awards valued at up to a maximum of 30 percent of tuition—$3,690 for UC students and $1,644 for CSU students. If the program is around next year, it will begin covering up to 40 percent of recipients’ tuition.\nStill, data collected by the state shows the average value of awards distributed so far this year—$1,107 for UC students and $799 for CSU students—to be far lower than those ceilings because many recipients come from wealthier families who qualify only for small awards.\n“It’s hard to argue the program has helped with access,” said CSU’s Kulju, who noted that students aren’t notified of their awards until July, well after most enrollment deadlines. “It hasn’t been as efficient or effective as one would like.”\nH.D. Palmer, a spokesman for Brown’s Department of Finance, wouldn’t say why the governor chose to target the program to help close the budget gap, or whether he doubts its effectiveness. He stressed, however, that Brown’s proposed budget preserves other higher education commitments, such as promises to increase funding to UC and CSU campuses and maintain the Cal Grant program for needy students.\nThe Institute for College Access and Success, a nonprofit advocacy group, has opposed California’s financial aid program for middle-income families since its inception, arguing that the state should direct all public resources to the neediest students.\nIts vice president, Debbie Cochrane, said she wouldn’t mind seeing the state dismantle the program so long as it uses the savings to help expand Cal Grant scholarships. That program only has enough funding to help 25,000 students annually, turning away another 300,000 applicants each year whose grades and family income qualify them to receive the support.\n“We should not be cutting money from financial aid,” Cochrane said. “However, where we spend the money we have matters.”\nSince 2001, poor California students who apply for a Cal Grant straight out of high school have been entitled to a full ride.\nBut students who wait a year or more to enroll forfeit that right and instead must compete against thousands of other deserving applicants for assistance. The California Student Aid Commission found that some low-income Middle Class Scholarship recipients are students who sought, but failed to win, one of those competitive Cal Grants.\nIn an interview, Rendon said he won’t stand to see the program “thrown out,” although he’s open to a “mid-course correction” that re-shapes its application criteria. “The Legislature is often criticized for not doing enough to help middle class families,” Rendon said. “Protecting this program is one of the Assembly’s top priorities.”\nDemocratic Senate President Pro Tem Kevin de León of Los Angeles, who proposed eliminating the program in 2014 to fend off the last round of tuition increases, declined to comment on Brown’s proposal.\nAs for Devon Graves, he’s now a 23-year-old UCLA graduate student studying higher education administration and financial aid. He said Brown’s threats to eliminate the program are “concerning.”\n“I understand the governor is worried about balancing the budget,” said Graves. But the state must not forget “the promise it made to middle class students and families when it created this program and come up with a budget plan that supports them.”","url":"https://calmatters.org/articles/californias-jeopardized-middle-class-scholarships-worth-saving/"}
