{"authors":[],"date_download":"2018-10-30 14:10:49","date_modify":"2018-10-30 14:10:49","date_publish":"2016-11-07 13:42:47","description":"Secretary of State Brian Kemp says Georgia is ready for Tuesday's presidential election and that voting will be secure and accurate.","filename":"data/vaneerConsumption/Arecord238MpeoplevotedearlyasGaprepsforElectionDay.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/11/07/Images/newsEngin.16715824_IMG_0436.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_34d851f99c019ec050fc975ac1171d9c__1540908649.html","title":"A record 2.38M people voted early as Ga. preps for Election Day","title_page":"Georgia Secretary of State Brian Kemp is ready for Election 2016","title_rss":"NULL","source_domain":"ajc.com","text":"Georgia Secretary of State Brian Kemp has kicked off a statewide tour Monday to tout the state’s readiness for Tuesday’s presidential Election Day, saying voters should have confidence that their ballots will be handled accurately and securely.\nSome 2.38 million voters have already cast their ballots during the state’s early voting period, which ended Friday. Those numbers set a new record in Georgia, surpassing the state’s previous early voting record of 2.1 million set during the 2008 presidential election.\n“We prepared and we’re ready,” Kemp said at a morning press conference at Peachtree-DeKalb Airport. “I’m very confident we’re going to have a good election.”\nA vast majority of those voters had a relatively smooth experience, save for waiting in line at some metro Atlanta polling locations for more than three hours on some early voting days. That experience, however, may actually help officials on Election Day. Fulton County, for example, expects to have fewer voters on Election Day than it did during early voting, likely easing lines on Tuesday and giving officials what they hope is some breathing room as polls close and they work to get overall vote counts into the state.\nRussell Lewis, chief investigator with the Secretary of State’s Office, said the office has opened 25 cases in total related to complaints during early voting — on par with the 2012 presidential election, he said. No widespread problems have been reported.\nThe state had previously announced they were investigating complaints from a handful of voters who said they had trouble casting ballots because machines were “flipping” their presidential choices. One such malfunction in Bryan County caused officials to remove a voting machine due to what officials said was likely a calibration issue involving the touchscreen. All the voters reporting problems indicated that they were able to correct the problem and properly record their votes.","url":"https://www.ajc.com/news/state--regional-govt--politics/record-38m-people-voted-early-preps-for-election-day/5maptyYEWTUn3FadDrUz9M/"}
