{"authors":["Meghan Demaria"],"date_download":"2018-10-31 01:43:16","date_modify":"2018-10-31 01:43:16","date_publish":"2018-09-14 15:48:49","description":"This former celebrity couple was seen together again, but fans probably shouldn't get their hopes up just yet. Drew Barrymore and Justin Long were seen together in New York, People reported on Thursday, but that doesn't necessarily mean they're back…","filename":"data/vaneerConsumption/AreDrewBarrymoreJustinLongBackTogetherTheExesHaveBeenSpottedTogetherRecently.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/cb6d623f-8861-4790-bfa7-d4d8b4df49d2-getty-103568711.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_are-drew-barrymore-justin-long-back-together-the-exes-have-been-spotted-together-recently-11918105_1540950196.html","title":"Are Drew Barrymore & Justin Long Back Together? The Exes Have Been Spotted Together Recently","title_page":"Are Drew Barrymore & Justin Long Back Together? The Exes Have Been Spotted Together Recently","title_rss":"NULL","source_domain":"bustle.com","text":"This former celebrity couple was seen together again, but fans probably shouldn't get their hopes up just yet. Drew Barrymore and Justin Long were seen together in New York, People reported on Thursday, but that doesn't necessarily mean they're back together. The exes and former costars have apparently stayed friends over time, so their outing might not have been a romantic one, despite rumors saying otherwise. (Bustle reached out to reps for Long and Barrymore for comment, but didn't receive an immediate response.\nAccording to Page Six, Barrymore and Long were seen at the Lowell Hotel in Manhattan on Monday. An unnamed source told the outlet that the two of them \"left together\" and seemed to be more than friends. \"It was like they were together and trying to look like they weren't,\" the source told Page Six.\nIf the two of them were rekindling a romance, the setting would be fitting, though. In their 2010 romantic comedy Going the Distance, the actors' characters, Garrett and Erin, fall in love in New York City, before entering a long distance relationship when Erin goes back to California. (It wasn't their first movie together, though — Barrymore and Long also costarred in He's Just Not That Into You, but their characters weren't connected romantically.)\nIan Gavan/Getty Images Entertainment/Getty Images\nAs People pointed out, Barrymore and Long dated from 2007 to 2010, after meeting on the He's Just Not That Into You set. Even though their relationship didn't work out, both People and E! News have reported that the two actors stayed friends after their breakup.\nSince their breakup, the two actors have moved on to other relationships. Long was linked to Kate Mara in 2012, and Long and Amanda Seyfried dated for two years before their split in 2015. Most recently, People notes, Long dated CHVRCHES singer Lauren Mayberry, though it's not clear exactly when they broke up.\nMeanwhile, Barrymore and Will Kopelman split in 2016 after almost four years of marriage. The actor and art consultant got married in June 2012 and have two daughters together, Olive and Frankie. Kopelman and Barrymore announced their split in April 2016, and the divorce was finalized that August.\nAnd while Page Six's source seemed to hint that Barrymore and Long's recent time together was romantic in nature, another source suggested to E! News that the two are just friends — at least for now. \"They are both single and they are spending time together,\" the source claimed to E! News. \"That's all it is for now.\"\nWhatever the actors' relationship status is, fans probably wouldn't mind another project from the two of them, especially if they've stayed friends after all this time. This probably wasn't a work meeting, but I'd love to think they were discussing how a sequel to Going the Distance could work. Or, you know, planning a new rom-com entirely. They clearly have on-screen chemistry, regardless of whether they're reconnecting in real life. And if the two actors do decide to give their relationship another try, fans will probably be on board with that, too.","url":"https://www.bustle.com/p/are-drew-barrymore-justin-long-back-together-the-exes-have-been-spotted-together-recently-11918105"}
