{"authors":["Amita Sharma","Dan Morain","Byrhonda Lyons"],"date_download":"2018-10-30 22:38:12","date_modify":"2018-10-30 22:38:12","date_publish":"2018-07-30 19:25:18","description":"California's birth rate has dipped below the national average—and experts say the state's soaring housing costs are crimping its fertility.","filename":"data/vaneerConsumption/ArehousingcoststoblamefortheplummetingCaliforniabirthrate.json","image_url":"https://calmatters.org/wp-content/uploads/FERTILITY-RATE-Photo-e1533005527382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939092.html","title":"Are housing costs to blame for the plummeting California birth rate?","title_page":"Are housing costs to blame for the plummeting California birth rate? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Angela George always imagined she’d have two children by the age of 30. But when the 28-year-old nurse and her husband, Tacito, a Marine, learned last year she was pregnant with their first child, they were thrilled and they were petrified.\n“We didn’t plan it,” she said. “We were like, `Oh my, what are we going to do?’ We were thinking how are we going to care for the baby financially? How are we going to afford daycare?”\nFinancial burdens, compounded by the high cost of housing, has knocked down the state’s fertility rate, according to experts. It is changing the shape of families, the potential tax base and labor force as people struggle to achieve the California dream.\n“We don’t have enough kids,” said Dowell Myers, a professor of urban planning and demography at the University of Southern California. “The birth rate is actually below replacement level, only 1.76 per woman. You need 2.1 to break even. We used to have 3.0 in the good old days.”\nHe said the consequences are far reaching.\n“Those kids are important for all of us because they are our future taxpayers and homebuyers,” Myers said. “If you don’t have those kids, who’s going to buy my house? Who’s going to pay the taxes to support me in my old age?”\nThe United States’ fertility rate is also dropping. It is at 1.82 per woman based on 2016 data from the Centers for Disease Control and Prevention. But Myers said California’s has dipped more.\n“The major factor that makes California different is housing prices,” Myers said. “There’s really not much else that is different.”\nIn fact, the National Bureau of Economic Research contends there’s a direct link between housing costs and birth rates. A recent study by the nonprofit, nonpartisan group estimated that a $10,000 increase in home prices results in a 2.4 percent decline in fertility rates among people who do not own homes. But the study also suggested that same home price increase was accompanied by a 0.8 percent increase in fertility rates among homeowners.\nOverall, Myers said there is too much pressure on people to meet most of life’s expectations between the ages of 25 and 35. They must launch their careers, pay off explosive student loans, meet a mate, pay an astronomical price for a home that usually requires two-incomes to handle a mortgage and property taxes.\n“And you want them to have kids too?” he asked. “Now you’re asking too much. Something has to go. And what gets put off and delayed is the kids.”\nAs soon as George found out she was having a baby, she and her husband stepped up their search for a house.\n“For us, we just felt like we had to have a home for him,” George said.\nThey wanted to buy a home in San Diego County’s Oceanside, close to their jobs but prices were out of reach. They found a house about an hour away in Murrieta in Riverside County, where George said homes were $200,000 cheaper.\n“That created a longer commute for me and my husband, again another stressor,” she said.\nYet another one is the cost of day care which she said will eat up more than half of her paycheck. “Childcare from zero to five in Southern California is as high as your rent,” said Anthony Ferreira, a San Diego financial planner with WorthPoint.\nThe United States Department of Agriculture has put the cost of raising a child from birth until age 18 in the United States at $233,610. But Ferreira estimated the costs are more in some parts of the state, especially Southern California and San Francisco Bay Area.\n“Because of the cost of housing, the cost of food, the cost of gas, the cost of everything here is so much higher,” he said.\nHe said his clients typically ask questions about child rearing costs post birth.\n“Most people, if they have decided to have a child, they’re not coming to me and saying run the numbers and tell me if I can afford to have a child or not because they want to have a child,” he said. “So really they come to me after the fact and they say we’ve had a child, how do we pay for it?”\nHe advises them to save for children and their college early. “You can actually create a 529 plan for a child that hasn’t even been born yet,” Ferreira said. “But the biggest thing is come up with a budget and stick to it and do that plan. And over 15 or 20 years, you can get there.”\nMyers, the USC demographer, believes California must also do its part to motivate people to have children by funding childcare.\nBecause the state’s birth rate is so low, children today potentially are more valuable when it comes to contributing to the economy, tax base and labor force, he believes. And, he argues, the state should invest in the children to ensure they attain a college degrees and future success.\n“One thing the National Academy of Science report found that’s pretty startling is that once these kids get to be age 40, they are paying way more tax dollars if they have a higher education,” Myers said.\nAngela George gave birth to a baby boy named Mateo 10 weeks ago. She said she still wants a second child but having two children in daycare would amount to a second mortgage.\n“We’re really thinking we should just have one,” George said. “It breaks my heart. It really does.”","url":"https://calmatters.org/articles/low-california-birth-rate-housing-costs/"}
