{"authors":["Lindsay Denninger"],"date_download":"2018-10-31 01:47:33","date_modify":"2018-10-31 01:47:33","date_publish":"2018-08-27 18:38:16","description":"Love is patient, kind, and when you’re on a reality television dating show with the sole purpose of becoming famous on Instagram, it can be amazingly fleeting, too. This season of Bachelor In Paradise seems to have far fewer settled couples than…","filename":"data/vaneerConsumption/AreKevinAstridStillTogetherAfterBachelorInParadiseTheyCouldBeHeadedForTrouble.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/24/70b0d0ec-71fe-4383-83b7-4c2c46c3725f-149577_2299.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_are-kevin-astrid-still-together-after-bachelor-in-paradise-they-could-be-headed-for-trouble-10237854_1540950453.html","title":"Are Kevin & Astrid Still Together After 'Bachelor In Paradise'? They Could Be Headed For Trouble","title_page":"Are Kevin & Astrid Still Together After 'Bachelor In Paradise'? They Could Be Headed For Trouble","title_rss":"NULL","source_domain":"bustle.com","text":"Love is patient, kind, and when you’re on a reality television dating show with the sole purpose of becoming famous on Instagram, it can be amazingly fleeting, too. This season of Bachelor In Paradise seems to have far fewer settled couples than seasons past, but one of those couples — Kevin Wendt and Astrid Loch — is on pretty solid footing. But are Kevin and Astrid still together after Bachelor In Paradise? Will they make it past the day bed stage of their relationship, ever?\nKevin’s no stranger to a Bachelor spinoff. He was on the Canadian version of The Bachelorette, but in Winter 2018, he appeared on The Bachelor Winter Games, where he went home post-games with Ashley Iaconetti. Their relationship didn’t last that long, though — they broke up in March 2018, and now, Ashley is engaged to fellow Bachelor Nation person Jared Haibon. Kevin, though, is alone and lonely… until now. Although Astrid was a sleeper on Nick’s season of The Bachelor, she and Kevin have been on since the first episodes this season.\nAstrid wasn’t Kevin’s first pick – he hung out with Krystal (of Arie’s season of The Bachelor) for a bit before becoming enamored with Astrid. Because filming for Bachelor In Paradise lasts a few weeks, being a couple for a few days means you’ve hit your golden anniversary. Astrid and Kevin are very cute together, even if they are responsible for one of the most heinous things I’ve ever seen on television — their “sausage kiss.” It was more than I — and every other Bachelor Nation viewer — ever needed to see.\nWhile their romance is working in Paradise now, the real world has far fewer margaritas and bathing suits. These two have some distance issues going for them, too. Astrid lives in Florida and Kevin is in Ontario, where he’s a firefighter and they both seem pretty rooted in their lives. Astrid’s Instagram has not a mention of Kevin for weeks — it’s mostly about her friends, instead, including Kendall, who is also on Bachelor In Paradise with her.\nKevin has pics with plenty of his Bachelor In Paradise pals, too, but he does post snaps of him and Astrid. Does this signal that these two are together and can’t reveal anything before the finale airs? Astrid and Kevin could be together in the present day, but there’s really no way of knowing until ABC lets the curtain fall and Neil Lane come out with his big, sparkling rings.\nThe preview for the Aug. 27 episode of Bachelor In Paradise shows trouble in, well, Paradise, though — Kevin thinks Astrid should see other people to make sure she’s into him. \"I'm really enjoying these past seven days with you. I feel like seven days could turn into 70 years, except I kind of want you to go on a date with another guy,\" he said, according to Entertainment Tonight. \"Every guy that comes in here knows there's a big 'X' across you, like, 'She's taken.' It doesn't really push my boundaries. Like, in the real world, babe, especially after something like this show, we're both going to be pushed that way, because that's how it is.\" Deep, right?\nKevin’s thoughts make sense in a away — he wants Astrid to miss him and choose him and not default to him — but his execution is pretty poor. Astrid can’t stop crying, and it seems to be a big ol' mess. Let’s hope Kevin and Astrid make it through this storm and go the distance. Or at least until the finale.","url":"https://www.bustle.com/p/are-kevin-astrid-still-together-after-bachelor-in-paradise-they-could-be-headed-for-trouble-10237854"}
