{"authors":["Parry Ernsberger"],"date_download":"2018-10-31 01:38:35","date_modify":"2018-10-31 01:38:35","date_publish":"2018-08-28 19:24:01","description":"If you have yet to watch Netflix's new rom-com, To All The Boys I've Loved Before, stop what you're doing and re-evaluate your priorities. You'll laugh, you'll cry, you'll swoon over Peter Kavinsky, and then you'll probably ask yourself, \"Hold up.…","filename":"data/vaneerConsumption/AreNoahCentineoLanaCondorDatingToAllTheBoysFansCantStopShippingThem.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/c7818bd6-0e7c-4d3e-886d-2a90106f1a40-67dbd779-2f8__c-4586-95f2-aa7bc16cab5d-getty-1017921724.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_are-noah-centineo-lana-condor-dating-to-all-the-boys-fans-cant-stop-shipping-them-10778688_1540949915.html","title":"Are Noah Centineo & Lana Condor Dating? 'To All The Boys' Fans Can’t Stop Shipping Them","title_page":"Are Noah Centineo & Lana Condor Dating? 'To All The Boys' Fans Can’t Stop Shipping Them","title_rss":"NULL","source_domain":"bustle.com","text":"If you have yet to watch Netflix's new rom-com, To All The Boys I've Loved Before, stop what you're doing and re-evaluate your priorities. You'll laugh, you'll cry, you'll swoon over Peter Kavinsky, and then you'll probably ask yourself, \"Hold up. Are Noah Centineo and Lana Condor dating in real life?\"\nThe on-screen chemistry between the stars that play Kavinsky and Lara Jean is definitely there, and they're pretty precious together during off-screen interviews, too. Not only that, but they're all over each other's social media pages, both in pictures and in the comments.\nFans have been 'shipping them hard ever since the film came out, but, alas — Condor has been dating someone else for the last three years. *Sigh* The truth hurts. If it's any consolation, though, she and her boyfriend, fellow actor Anthony De La Torre, are also very, very cute together. (Side note: That also means that Centineo is probably still single. Just sayin'.)\nOn Aug. 12, Us Weekly asked Condor if De La Torre ever makes romantic gestures, to which she replied,\n\"He writes me love letters, actually! He’s done that since we started dating and I keep them all. We try to keep the spark alive!\"\nSee? Told you. Very, very cute. Also, how serendipitous that he started writing her love letters three years ago ... and now she's in a hit movie about writing love letters herself. That's kind of wild, right?\nWriting romantic letters isn't the only thing that makes De La Torre sound like a great boyfriend. Condor told Us Weekly that he's been a real champ about watching her make out with other guys on screen, supporting her acting career in the process.\n\"It’s definitely been weird for him,\" she admitted, \"but he’s very supportive. As actors, it’s been a learning curve as to how to navigate that world when we have romantic costars. If anything, if a girl flirts with him, I’m like, 'Get it! He’s cute!'\"\nAww, how cool is that? Sounds like their relationship is pretty solid. Sorry, Condor/Centineo 'shippers. That's probably not going to happen any time soon.\nIt's easy to see why fans assumed they're more than just good friends. It seems like they have a super friendly relationship, and got so comfortable with each other while filming To All The Boys, that they took a sweet little nap together in between takes.\nFun fact: Remember seeing the photo on Lara Jean's lock screen in the movie? The one where she and Peter are snuggled up and asleep? Well, as it turns out, that photo was of their aforementioned sweet little off-screen nap.\nIn a recent interview, the TATBILB director, Susan Johnson, told Entertainment Tonight,\n\"The two of them were in the green room on set at the high school location, in the area where we put the actors. They actually were sleeping on the couch in that room like that, so we just stood over them and took that picture and it's so friggin' cute. So yeah, we just borrowed it from our crew member.\"\nFans should totally keep 'shipping Condor and Centineo anyway, though. No, not romantically — more like, friend-shipping. They've clearly got a super tight bond, and it's important to encourage the idea that guys and girls can have purely platonic relationships. So yeah, Condor and Centineo forever.","url":"https://www.bustle.com/p/are-noah-centineo-lana-condor-dating-to-all-the-boys-fans-cant-stop-shipping-them-10778688"}
