{"authors":["Savannah O'Leary"],"date_download":"2018-10-30 22:31:29","date_modify":"2018-10-30 22:31:29","date_publish":"2014-08-15 13:49:39","description":"Everyone has contemplated the horror of germs in public pools at least once, before deciding that it's one of those things you'd rather not contemplate. Pools are like massive bathtubs you share with hundreds of strangers. You bathe with toddlers…","filename":"data/vaneerConsumption/ArePublicPoolsCleanLetsJustSaySwimmingIntheOceanMayBeaSaferBet.json","image_url":"https://imgix.bustle.com/uploads/image/2018/3/11/4dacb431-8943-4b09-845e-09978d437b19-fotolia_144124256_subscription_monthly_m.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35807-are-public-pools-clean-lets-just-say-swimming-in-the-ocean-may-be-a-safer-bet_1540938689.html","title":"Are Public Pools Clean? Let's Just Say Swimming In the Ocean May Be a Safer Bet","title_page":"Are Public Pools Clean? Let's Just Say Swimming In the Ocean May Be a Safer Bet","title_rss":"NULL","source_domain":"bustle.com","text":"Everyone has contemplated the horror of germs in public pools at least once, before deciding that it's one of those things you'd rather not contemplate. Pools are like massive bathtubs you share with hundreds of strangers. You bathe with toddlers whose potty training progress you doubt, pubescent teens whose pubescent tendencies involve all sorts of offensive fluids... even the most unassuming, hygienic senior could possess some wildly infectious waterborne disease. In the pool, the possibilities for health-related catastrophes are endless.\nThough most of us would rather not know, Policy Mic has shared the truth about pools and the germs they carry. Thanks a lot, guys! First of all, it’s important to recognize that the reassuring, chemical smell you associate with chlorine actually has nothing to do with protecting you. In fact, a healthy pool shouldn’t smell at all. That pungent smell is actually the result of leftover germs, which survive even after the chlorine has neutralized as much grub as it can. These leftover germs result in 10,000 illnesses a year — affecting your skin, intestinal tract, ears and eyes. Those of us who swallow the water expose ourselves to even more crippling conditions, including diarrhea.\nOne in every five swimmers pees in the pool. That is likely never to change. The human species is a disappointing one, in that sense. But there is something we can do to ensure that we take better care of our pools, and ourselves. A quick shower prior to entering the pool gets rid of most surface germs, makeup, urine and feces, according to a 2012 study in Water Research. That would help decrease the excess germs that manage to survive the chlorine's wrath.\nCurrently, 7 out of 10 swimmers don't shower before swimming. Considering this reality, I am bewildered that the public health department has not made these rinses mandatory.\nUntil then, you can find me in the ocean. Head over to Mic for more infographics and videos on just how filthy your public pool is.\nImage: Fotolia","url":"https://www.bustle.com/articles/35807-are-public-pools-clean-lets-just-say-swimming-in-the-ocean-may-be-a-safer-bet"}
