{"authors":[],"date_download":"2018-10-22 21:33:00","date_modify":"2018-10-22 21:33:00","date_publish":"2014-06-05 18:54:51","description":"\"My story is: I'm innocent and from February 3rd, 1995, until the present day, I've been lingering in here, waiting for this mistake to be corrected.\"","filename":"data/vaneerConsumption/AReportersNotebookABronxTale.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/490431/slepian_gate_9c43417eb0081a93107a6306b5e64a83.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/dateline_reporters-notebook-bronx-tale-n123801_1540243980.html","title":"A Reporter's Notebook: 'A Bronx Tale'","title_page":"A Reporter's Notebook: 'A Bronx Tale'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nCould this really be happening again? How many more are there?\nIt was June 2012, and I was at the Sing Sing Correctional Facility in Ossining, New York, yet again. This time, I was at the maximum security prison to visit Eric Glisson, a convicted murderer.\nI’d been coming to Sing Sing for more than a decade, primarily working on stories and meeting inmates who insist they are innocent.\nAfter several security checks, a pat down and a walk through a steel-gate maze, a corrections officer escorted me into the housing gallery.\nOnce inside, it’s clear why they call Sing Sing “The Big House.” We walked down a long, cement hallway – the length of two football fields – lined with 6x9 foot cells. Above us, there were three more identical tiers full of inmates. In total, Sing Sing is home to more than 1,500 inmates.\nWhen I arrived at his cell, camera in hand, Eric was standing, gripping the metal poles that cage him. It was his 18th year behind bars.\nHe was surprised to see me. Rarely did a civilian come down to the housing units where the inmates lived, much less a television producer with a camera.\nBut Eric was ready and eager to share what he’d been through.\n\"My story is: I'm innocent. And from February 3rd, 1995, until the present day, I've been lingering in here, waiting for this mistake to be corrected,\" he said.","url":"https://www.nbcnews.com/dateline/reporters-notebook-bronx-tale-n123801"}
