{"authors":[],"date_download":"2018-10-31 00:07:31","date_modify":"2018-10-31 00:07:31","date_publish":"2016-11-29 00:00:00","description":"California faces a $240 billion unfunded pension liability. But retired state workers who receive pensions say they are tired of drawing public blame.","filename":"data/vaneerConsumption/ArePublicPensionBenefitsExcessiveStateWorkersSayNo.json","image_url":"https://www.capradio.org/media/7965099/BobbiEstrada112816P.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/capradio.org/articles_2016_11_28__1540944451.html","title":"Are Public Pension Benefits Excessive? State Workers Say 'No'","title_page":"\r\n        Are Public Pension Benefits Excessive? State Workers Say 'No' - capradio.org\r\n    ","title_rss":"NULL","source_domain":"calmatters.org","text":"Bobbi Estrada is tired of people blaming pensioners like her for the state’s debt.\nSam Harnett | Capital Public Radio\nCalifornia faces a $240 billion unfunded pension liability. But retired state workers who receive pensions say the public blame they receive is unfair.\nBobbi Estrada is tired of the story about the six-figure pensioner.\nIt goes like this. There’s a state retiree who’s living the life of luxury—retiring young, going on cruises, eating caviar; while private sector workers toil on into dotage, paying for the pensioner with their tax dollars.\nEstrada says, “I wants people to know the truth. That we are real people,” and that very few pensioners bring in anywhere close to six figures per year.\nEstrada has worked for the state her entire adult life. She started as a general clerk at the Board of Equalization when she was 19. Over the years she worked up to a manager position.\nEstrada was a single parent and says she needed the stability of a public sector career. For four decades she worked various state jobs. All those years paid off. As a retiree, she says she now gets around $60,000 a year.\nEstrada is bringing in that much because she worked so long in the public system. Public pensions are calculated using a formula that takes into account years of service, age at retirement, and final compensation. Essentially, the more years you work and the higher your pay, the bigger your pension. The pension pays out for life and you get cost of living adjustments as the years go by.\nNow, Estrada’s retirement may seem pretty nice, but it’s not six figures, and it’s also much higher than the average state pension. CalPERS, the agency that manages a majority of state pensions, says the average worker gets a pension of around $31,000 a year.\nUnlike Estrada, many pensioners did not spend their whole careers in the public sector. According to CalPERS, its public sector workers puts in about 20 years on average before retiring. That means they have much smaller pensions than Estrada.\nFor those like Patricia Arian, who split their time roughly in half between a state and a private job, retirement can get tricky.\nFor years, Arian ran a photography business out of her San Francisco apartment.\nIn her mid-forties, Arian says she found her calling: teaching third grade.\nArian is in her sixties now. She’s passionate about her work, but says she’d need to put in another twelve years to get a pension that would sustain her. She doesn’t think the school wouldn’t want her for twelve more years she says.\nArian also cannot count on what she paid into social security as a photographer. Because of The Windfall Elimination Provision, public workers lose much of their social security.\nThere is a sliding scale based on how many years a person works in the private sector. If you work less than twenty years, you only get 40 percent ofwhat you paid into social security. Arain says the loss of social security means she will have to find another way to make money after she retires.\n“I won’t be able to stop working,” Arian says, “I'll have to bring money in somehow. And we rent. So if we were to get evicted that would be a real hardship.”\nThe social security reduction confounds those who split have their time between public and private jobs. Jeff Steeno falls into that category. He used to drive a taxi and now teaches middle school.\n“I just don't understand it,” says Jeff Steeno, “It's like some weird Kafka kind of novel.”\nSteeno loves teaching middle school kids, but he has only done it for fifteen years. That means if he retires now, he will receive about a $1,600-a-month pension. That is more than the average national social security retirement payout of around $1,350, but not enough to live on in San Francisco he says. (That average number, by the way, is a little complex. You can read more about how it is calculated and what it means here.)\nTo make ends meet, Steeno is considering renting out a room. He also has vague plans for starting a business. “I make this really good coffee,” Steeno says, “It's called CWB, coffee with benefits. It has a bunch of super herbs in it.”\nThat’s not exactly the champagne and caviar of a six-figure retiree. But here’s the thing, six-figure retirees are pretty rare.\nCalSTRS, which manages pensions for public school teachers, says only around 3.5 percent of its retirees gets six figures. CalPERS quotes a similar rate. According to CalPERS, most of the people pulling in six figures are the odd police officer, firefighter, or upper level bureaucrat.\nSteeno is far from the six-figure crowd. But he is not glum about his future. Steeno plans to get a little three-wheeled cart and to sell his coffee for $5 a cup. Between that and renting out a room, Steeno says he’ll probably get by.","url":"http://www.capradio.org/articles/2016/11/28/are-pension-benefits-excessive-state-pensioners-say-no/"}
