{"authors":["Lindsay Denninger"],"date_download":"2018-10-31 01:47:57","date_modify":"2018-10-31 01:47:57","date_publish":"2018-09-11 15:45:24","description":"It's the end of Bachelor In Paradise, and the established couples will soon have to make their decision — do they stay, or do they go (together)? Shushanna and Robby were late additions to this season, but still, they managed to hang out enough…","filename":"data/vaneerConsumption/AreShushannaRobbyDatingAfterBachelorInParadiseTheyWereImmediatelyDrawnToEachOther.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/9/c1f386dc-aecd-4c7f-a4f4-3f07531804e4-149580_5844.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_are-shushanna-robby-dating-after-bachelor-in-paradise-they-were-immediately-drawn-to-each-other-11848340_1540950477.html","title":"Are Shushanna & Robby Dating After 'Bachelor In Paradise'? They Were Immediately Drawn To Each Other","title_page":"Are Shushanna & Robby Dating After 'Bachelor In Paradise'? They Were Immediately Drawn To Each Other","title_rss":"NULL","source_domain":"bustle.com","text":"It's the end of Bachelor In Paradise, and the established couples will soon have to make their decision — do they stay, or do they go (together)? Shushanna and Robby were late additions to this season, but still, they managed to hang out enough times to, in the world of reality television, make them a couple. But are Shushanna and Robby still dating after Bachelor In Paradise? They weren't together long enough for their relationship to have made an impact.\nThe problem with showing up late to a season of Bachelor In Paradise is that there's really no time to make a lasting connection. Paradise only films for a handful of weeks at a time, anyway, so even if you're on the show on day one, it's probably still difficult to know if you want to get engaged to a person after that long. In Bachelor Nation, it's plenty of time, but in the real world? Pass. Robby Hayes was the runner-up on JoJo's season of The Bachelorette (he lost to Jordan Rodgers, which still probably stings). Shushanna was on Ben Higgins' season oh-so-many years ago. What brings these two together? Well, they're both visually stunning, and they both need more Instagram sponsorships. What could go wrong?\nSeriously, though, Bachelor In Paradise was not going well for Shushanna when Robby showed up. Shushanna was convinced that Kamil was into her, and so, even though Kamil told her that he didn't want to date her and that he was with Annaliese (Annaliese told her to leave them alone, too), Shushanna said, \"Opposite day!\" and just stared at Kamil across any camera shot they were in. Kamil even made a joke about her being a witch because he thinks she put a hex on him. The witch thing was kind of mean, but seriously, Shushanna — Kamil is so not interested.\nWhich is why it was good that Robby came to take away some of that attention. He and Shushanna had a decent first date, but because it all fell so close to the end of the season, it's questionable as to whether it lasted. Shushanna's Instagram is private, so you can't see what she's up to. Human thirst trap Robby's Instagram is the opposite of private, but all of the pictures are promoting his brands and his abs — no mentions of Shushanna or any enduring love story.\nAnd you know what? That's 100 percent fine, because adults don't expect other adults to fall madly in love after knowing someone for 10 days. Bachelor In Paradise is good for quick flings and a fun thing to watch on television, but the long-lasting relationship are truly few and far between. Hey — as long as Robby and Shushanna had fun together during their time on the sunny, sandy beaches of Pacific-coast Mexico, who are we to judge? There's always another season of Bachelor In Paradise to watch and always more contestants who are trying — sometimes poorly — to fall in love.","url":"https://www.bustle.com/p/are-shushanna-robby-dating-after-bachelor-in-paradise-they-were-immediately-drawn-to-each-other-11848340"}
