{"authors":["Bianca London For Mailonline"],"date_download":"2018-10-22 23:59:21","date_modify":"2018-10-22 23:59:21","date_publish":"2017-03-16 08:30:50","description":"Student living once meant staying in a cramped bedroom but now students are living the life of luxury in accommodation complete with grand pianos, DJ booths and luxurious dining rooms.","filename":"data/vaneerConsumption/ArethesethemostluxuriousstudentdigsEVER.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/15/17/3E4E37EB00000578-0-image-a-30_1489597561401.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4317068_Are-luxurious-student-digs-EVER_1540252761.html","title":"Are these the most luxurious student digs EVER?","title_page":"Are these the most luxurious student digs EVER? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Whilst student accommodation is usually synonymous with grubby carpets and communal toilets, when money is no object, in-house nightclubs, banquet rooms and even slides are de rigueur for university students.\nStudent living once meant staying in a cramped bedroom in old halls of residence but now students are living the life of luxury in accommodation complete with grand pianos, DJ booths and luxurious dining rooms.\nMystudenthalls.com has rounded up the swankiest student accommodation from around the UK - and it will make you green with envy.\nForget eating your microwave meal on your lap, Eclipse in Cardiff comes with its own resident party room, which is kitted out with plush seating and dazzling chandeliers for the cost of £137 per week\nTrue Glasgow West End is designed for big kids with a giant 15ft slide, festival space, and bookable dining rooms for when family or friends visit. From £150 a week, it also includes a number of gym classes and personal training and includes all of your bedding\nYou don’t even need to leave your building to go out clubbing if you live in Eclipse in Cardiff, which has its own party room and costs £137 per week to live in\nFor fancy dinner parties, Woodside House in Glasgow has a swanky dining room and kitchen complete with plush light fittings - it costs £169 per week\nFancy a film night? The in-house cinema at ViBe Student Living by CRM Students in Kingston-upon-Thames will be just the ticket. The plush accomdation starts at £185 per week\nIt’s summer all year round at this Glasgow accommodation, which has astro turf and deck chairs indoors\nIf you're looking to get into the hustle and bustle of London life, you'll love the seating area at this accommodation in London, which has a tube theme\nNova in Nottingham is a music lover’s paradise with its grand piano. The swanky setting rivals a show home and will set students back £134 per week\nAt John Bell House in Belfast you can stay in the iconic old Metropolitan College Building. The stained-glass windows are touted as the perfect backdrop for selfies. Living here starts at £124 per week","url":"https://www.dailymail.co.uk/femail/article-4317068/Are-luxurious-student-digs-EVER.html"}
