{"authors":["Angelica Florio"],"date_download":"2018-10-31 01:40:57","date_modify":"2018-10-31 01:40:57","date_publish":"2018-09-14 20:39:27","description":"Viewers ofWhite Boy Rick probably might not believe the sequence of events the unfolds before their eyes if not for the title card that states \"based on a true story\" at the beginning of the movie. The gangster/cop film that hit theaters Sept. 14…","filename":"data/vaneerConsumption/AreTheCurryBrothersOfWhiteBoyRickBasedOnRealPeopleTheCrimeMovieStrivesForAccuracy.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/d6e9bad9-1cb7-4286-bdab-944ba43152d7-screen-shot-2018-09-14-at-41833-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_are-the-curry-brothers-of-white-boy-rick-based-on-real-people-the-crime-movie-strives-for-accuracy-11924667_1540950057.html","title":"Are The Curry Brothers Of 'White Boy Rick' Based On Real People? The Crime Movie Strives For Accuracy","title_page":"Are The Curry Brothers Of 'White Boy Rick' Based On Real People? The Crime Movie Strives For Accuracy","title_rss":"NULL","source_domain":"bustle.com","text":"Viewers ofWhite Boy Rick probably might not believe the sequence of events the unfolds before their eyes if not for the title card that states \"based on a true story\" at the beginning of the movie. The gangster/cop film that hit theaters Sept. 14 has so much drama and so many surprises that it seems totally unrealistic at times, but that's what makes it so intriguing. Not only is Richard Wershe Jr., aka \"White Boy Rick\" (Richie Merritt) taken from reality, but even the most unbelievable characters from White Boy Rick like the Curry Bros are based on real people.\nTwo of the Curry brothers, Johnny and Leonard (played by Jonathan Majors and YG, respectively) have significant roles in White Boy Rick because they really were leaders of a hugely important drug gang that the FBI had targeted in their investigation. The movie's inclusion of a third Curry brother, Ruddell \"Boo\" Curry (RJ Cyler) is also accurate, though as the youngest he didn't face as harsh a punishment as Johnny, or \"Lil Man,\" and Leo, or \"Big Man.\"\nIn real life and the movie,Wershe Jr. was hired as an FBI informant at age 14 to help police arrest the Curry brothers. It's also true that Wershe ended up getting romantically involved with Johnny's wife, Cathy Volsan Curry, as the Daily Beast reports.\nSony Pictures Entertainment on YouTube\nThe relationship between Wershe Jr. and Cathy proves how deeply enmeshed the juvenile informant became during his time spent rubbing shoulders with big time drug dealers like the Curry brothers. Even though Wershe Jr. helped police to arrest the Curry brothers, he remained entangled with the drug dealers of Detroit, and he (ironically) ended up facing more jail time than Johnny and Leo.\nMichigan news site M Live reports that Johnny and Leonard got out of jail over 10 years ago, while Wershe Jr. is still serving time for getting busted by police with 17 pounds of cocaine at the age of 18. That amount of cocaine, at the time, led to a mandatory life sentence. Since the law has changed since Wershe Jr.'s arrest, he now faces parole hearings, but the Curry brothers still play a big part in determining his future.\nRecently, Wershe Jr.'s attorney noted the fact that his client helped facilitate the arrest of the Curry brothers during a parole hearing. M Live reported that the attorney, Ralph Musilli, spoke about how important Wershe Jr.'s work as an informant was, specifically when it came to the Curry brothers.\nWhite Boy Rick starts as a thrilling undercover cop story but the movie ends on a somewhat somber note. If it weren't for the actions of Wershe's Jr. father, Richard J. Wershe Sr. (Matthew McConaughey), who encouraged his work with the FBI, he could have had a more typical childhood. Instead, he ended up entangled with the Curry brothers, and now he faces harsher punishment than those whom he'd set out to help discipline. Knowing that the film is a true story makes it all the more thrilling, but all the more disappointing, too.","url":"https://www.bustle.com/p/are-the-curry-brothers-of-white-boy-rick-based-on-real-people-the-crime-movie-strives-for-accuracy-11924667"}
