{"authors":["Cheyenne Macdonald For Dailymail.Com"],"date_download":"2018-10-23 03:25:19","date_modify":"2018-10-23 03:25:19","date_publish":"2016-01-28 18:55:27","description":"Alien hunters are abuzz with theories after the sighting of what they claim is a UFO passing over Colima Volcano in Mexico. UFO Sightings Daily speculates the craft caused eruption.","filename":"data/vaneerConsumption/AreUFOsresponsibleforaMexicanvolcaniceruption.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30AC4DEE00000578-0-image-a-14_1454006954898.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3421463_Are-UFO-s-responsible-Mexican-volcanic-eruption-Conspiracy-theorists-claim-transporter-craft-spotted-overhead_1540265119.html","title":"Are UFO's responsible for a Mexican volcanic eruption?","title_page":"Are UFO's responsible for a Mexican volcanic eruption? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Other viewers have speculated it knew about eruption, and was '\nAlien hunters are abuzz with theories after the sighting of what they claim is a UFO passing over a volcano in Mexico.\nUFO Sightings Daily even speculates that the craft was the cause of the eruption shown in the January 3 footage of the Colima Volcano.\nThe website reports that the alleged UFO was likely transporting 'someone or something' into a base beneath the volcano.\nScroll down for video\nAlien hunters are abuzz with theories after the sighting of what they claim is a UFO passing over a volcano in Mexico. UFO Sightings Daily even speculates that the craft was the cause of the eruption shown in the January 3 footage of the Colima Volcano\nIn the grainy, black-and-white video, a volcano can be seen as it begins to erupt, spewing out white light into the dark sky.\nAbout 5-seconds into the footage, a flying object appears from the right side of the shot, travelling right in the line of the eruption.\nThe volcano continues to go up in lava and smoke for the next few seconds, and the 'UFO' flies behind the outburst, passing through to the other side.\nThen, the object flies out of view, and the volcano continues to sizzle for another few seconds before erupting a second time.\nAccording to Scott Waring, editor of UFO Sightings Daily, the video has captured the moment a UFO 'transports' someone to an underground base.\nIn the grainy, black-and-white video, a volcano can be seen as it begins to erupt, spewing out white light into the dark sky. About 5-seconds into the footage, a flying object appears from the right side of the shot, travelling right in the line of the eruption\nThe volcano continues to go up in lava and smoke for the next few seconds, and the 'UFO' flies behind the outburst, passing through to the other side. Then, the object flies out of view, and the volcano continues to sizzle for another few seconds before erupting a second time\n'This long UFO was caught over Colima Volcano on Jan 3. The UFO passes over and through the lava shot up from the mouth of the volcano,' Waring wrote.\n'As it gets above the mouth, there is a bust of light and all goes black. The UFO then flies away.\n'I believe that as the UFO went over the mouth, it transported someone or something to or from the underground base below the volcano.'\nViewers were intrigued, with the original video, posted on Youtube by user Miblt Channel, gaining 14,847 views.\nOther alien hunters had theories of their own.\n'Wow. As if it had a preconceived notion of the arruption [sic]. I think it leans towards refuelling as opposed to the underground base theory,' one user commented on the UFO Sightings Daily post.\nAccording to Scott Waring, editor of UFO Sightings Daily, the video has captured the moment a UFO 'transports' someone to an underground base. Viewers were intrigued, with the original video, posted on Youtube by user Miblt Channel , gaining 14,847 views\nOne conspiracy theorist suggested that visiting aliens might even be envious of flashy Earth technology, and drag-racing cars that are the 'ufo's of earth.'\n'remember mr. waring, the ufos like planet earth because no matter how fancy the aliens are, there are no 56 Packard Caribbean's on mars 'not much of their stuff is as bizarre as that earth automobile,' the anonymous user comments, quoted as written.\n'they probably wonder about racing cars tooo, those dragsters at night, look at that light show of those NHRA ddragsters. that's the ufo's of earth, not spaceships!! the aliens know about the drag strip in phoenix thatds why they showed themselves as ''phoenix lights. aliens like some earth people but maybe not others.'","url":"https://www.dailymail.co.uk/sciencetech/article-3421463/Are-UFO-s-responsible-Mexican-volcanic-eruption-Conspiracy-theorists-claim-transporter-craft-spotted-overhead.html"}
