{"authors":["Arielle Dachille"],"date_download":"2018-10-30 23:41:34","date_modify":"2018-10-30 23:41:34","date_publish":"2014-08-13 14:08:46","description":"Which couple stands out as the great love story of MTV's Jersey Shore? It wasn't Jionni and Snooki. Nope, not Roger and JWoww, either. Not even the roller coaster of Sammi Sweetheart and Ronnie nabs this title. The stand-out tale of love conquering…","filename":"data/vaneerConsumption/AreVinnyPaulyDfromJerseyShoreStillFriendsTheirBromanceMightBeinTrouble.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/565a8464-c2e9-431a-aea7-4d894828c2da.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35525-are-vinny-pauly-d-from-jersey-shore-still-friends-their-bromance-might-be-in-trouble_1540942894.html","title":"Are Vinny & Pauly D from 'Jersey Shore' Still Friends? Their Bromance Might Be in Trouble","title_page":"Are Vinny & Pauly D from 'Jersey Shore' Still Friends? Their Bromance Might Be in Trouble","title_rss":"NULL","source_domain":"bustle.com","text":"Which couple stands out as the great love story of MTV's Jersey Shore? It wasn't Jionni and Snooki. Nope, not Roger and JWoww, either. Not even the roller coaster of Sammi Sweetheart and Ronnie nabs this title. The stand-out tale of love conquering all at the Jersey Shore was told through the epic bromance of Pauly D and Vinny Guadagnino. Wanna talk besties? From GTL-ing, to confessionals, to creeping, to grabbing food at Rivoli's, the pair did everything together during the run of the MTV show. They were like Lucy and Ethel, Laverne and Shirley, or maybe, just maybe Romeo and Juliet. Dare we ask, are Pauly D and Vinny from Jersey Shore still friends? Obviously, they must still be two orange peas in a creatine-infused pod, right? Welp, that may not be the case...\nYou'll remember that on the show, Vinny and Pauly D were the resident pranksters. A shared sense of humor was the glue that bonded these two together. That and, well, they were living in the same home. Their dynamic was akin to the kind you have with certain roommates, where you're so simpatico that you literally can't get enough of the person. The same stories, jokes, and insiders never fail to break you into collective laughter. Neither of you have significant others, so you bring them to family functions, sparking rumors throughout the clan that you're actually dating. This is the stuff of the Pauly D and Vinny bromance...\nStessy Cocerez on YouTube\nSo, if Sam and Ron are still together, you'd think that these two had more than a fighting chance. In the years since the Shore has wrapped, it would appear that the two are still friends, although they're not as close as they once were. After all, they had their own separate projects to devote their energies to. Both landed their own spinoffs with MTV post-Seaside. Pauly had his How To Make it in America-style reality show The Pauly D Project and Vinny had his talk show The Show With Vinny. In 2012, Vinny even appeared on the Pauly D project. Pauly did an interview with ABC News back in March of 2012, saying that \"My friend Vinny, I can't go too long without seeing him.\" All together now: DAWWWW!\nSo much love right there. I hope it still exists! After doing a little bit of Instagram stalking, I'm just a smidge worried. Vinny is an avid Instagrammer, and the last picture he posted of himself with DJ Pauly D is all the way back from May of 2013. Furthermore, it's a freakin' Jersey Shore promo shot, so it's not even like the two of them were hanging out. Shenanigans, I call upon you Vinny... shenanigans!!\nPauly's last picture with Vinny was taken all the way back in December of 2012. Um, guys... this is not OK for the bromance.\nThere must be a way to explain this. Every time they hang out, they just have too much fun together to take pictures. Well, it would appear that the two of them haven't necessarily been hanging out all the time, but they're supportive of each other. In Nov. of 2013, it came to light that Pauly D had a 5-month-old baby girl with a one-night-stand, according to Us Weekly. Vinny told the Daily Mail in a separate occasion that he thought Pauly would be a bang-up father, and that \"if he ever needs me to babysit, I'm here.\" Alright, so that's what friends do for each other, right? Drink milkshakes, babysit each others kids, and invite each other on their respective reality shows...\nTrue, friends babysit for each other especially as they get older and life happens. However, it may mean less goofing-off time, which was like friend oxygen for this pair. While I can easily say that the duo is no longer joined at the hip like they once were, it looks like their friendship is probably one more of \"here for you when you need them\" rather than constant hangout-fest.\nImage: Vinny Guadagnino, DJ Pauly D/ Instagram; Giphy (2)","url":"https://www.bustle.com/articles/35525-are-vinny-pauly-d-from-jersey-shore-still-friends-their-bromance-might-be-in-trouble"}
