{"authors":["Ryan Fiske"],"date_download":"2018-10-30 20:44:18","date_modify":"2018-10-30 20:44:18","date_publish":"2016-05-24 17:43:15","description":"A vote to Leave is a vote for independence. A vote to Remain isn't a vote for the status quo, but integration into a European Superstate.","filename":"data/vaneerConsumption/AreWeBritishOrAreWeEUropeanACaseForBrexit.json","image_url":"https://media.breitbart.com/media/2016/05/EU-flag-and-Union-flag.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_05_24__1540932258.html","title":"Are We British Or Are We EUropean? A Case For Brexit","title_page":"Are We British Or Are We EUropean? A Case For Brexit | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A vote to Leave the European Union (EU) is about more than immigration or the economy, but independence. The alternative — a vote to Remain — is not a vote for the status quo, but eventual integration into a European Superstate.\nSo far, the referendum campaign has talked a great deal about the economy and immigration. It has been politicians arguing back and forth over numbers and statistics which mean little or less to many people.\nThere have been so many contradictory claims and counter claims about whether or not people will be better or worse off after Brexit, and many people haven’t yet decided who to believe. But there is a reason to vote Leave which doesn’t require a leap of faith on facts and figures.\nThe referendum vote is not just a vote on economic issues or on immigration; it goes much deeper than this. The question is who we are as a people: are we British or are we EUropean?\nDavid Cameron has stopped talking about his pitiful renegotiation so-called “deal,” but it is important to take one key thing from it: he abandoned the United Kingdom’s veto on further integration of the Eurozone countries.\nWhilst this is overlooked it is highly important, as it clears the way for the Eurozone to accelerate its moves towards being a single EUropean Superstate. This is not some distant dream which cannot be achieved in our lifetimes. This is the political reality of what is happening now. The EU has a roadmap of its future progress called the “Five Presidents’ Report.”\nThis document is crystal clear about the direction in which the EU is heading: continuing centralisation of power in the EU and away from member states.\nThey aim to achieve full fiscal union for the Eurozone by 2025 – meaning Member States will lose the ability to decide how much their governments will be able to spend, the EU will instead decide this for them.\nThis will be followed by a push for full political union, effectively turning the Eurozone into one country. In addition to this, there is talk of “encouragement” to non-Eurozone member states to join when they are “ready.” This clearly suggests that there is an expectation of all EU states, including the United Kingdom if we do not leave the EU, eventually joining a single country called Europe.\nA country called Europe is certainly not something most Britons want to be part of. It is also not something Britons are being offered.\nThe Remain campaign are continually promoting the idea that staying in the EU will be a continuation of the present with no changes; this is clearly a complete fallacy. Whatever the result of the referendum there will be changes.\nIf we Leave we have the control over what happens. If we Remain, our future is unclear.\nThe only thing which is certain is that after a vote to Remain there will be further integration of Britain into the EU and more loss of our sovereignty. There are already plans for a European army which Britain would be a part of, and legislation is currently being held back on the EU determining even more legislation on issues such employment and industry.\nWhile further integration is worrying, the most troubling part of the whole European project is the repeated and continuing attempts to create a “European identity.”\nThese range from the creation of “Europe Day” which has replaced Armistice Day as a Bank Holiday within the European institutions, to the quite ridiculous “Captain Euro” cartoons specifically aimed at children, making them believe being part of the EU is the only solution to many issues.\nThere has also been an increasing focus on indoctrinating children into a EUropean identity. Already, there is a great deal of EU propaganda in our schools, with colourful cartoon books having been distributed to primary schools for several years, all of which promote the EU. Last month legislation was even passed in the European Parliament called “Learning EU at School”!\nTo be frank, the proposals the EU is planning are frightening. They propose to massively integrate the EU into the daily education of our children, with textbooks being rewritten to give more prominence to the EU and for children to be taught the “values on which EU integration is based.”\nThis is clearly the indoctrination of our children into being pro-EU and to have feelings of being “EUropean.” But this is not just an attempt to foster feelings of Europe; its explicit aim is to “take an active interest in EUropean Integration” and “to overcome Euroscepticism.”\nThis is an attempt to ensure our children grow up feeling more EUropean than they do British, in order to make British integration into the EU assured and to destroy any latent notions of having an independent British identity.\nAll this makes the choice simple: if you want a Britain which is not only independent, but a Great Britain which still exists and is proud of retaining its own sense of national identity, your vote must be for Leave.\nIf Britain remains in the EU, there will be continual efforts to destroy our sense of British identity and to fully integrate Britain into the EUropean Superstate they are building.\nTo protect our British identity, we must vote to Get Britain Out of the EU as soon as possible.\nRyan Fiske is a Research Executive for Get Britain Out","url":"https://www.breitbart.com/europe/2016/05/24/british-european-case-brexit/"}
