{"authors":["Jessica Boddy"],"date_download":"2018-10-22 23:07:11","date_modify":"2018-10-22 23:07:11","date_publish":"2017-02-06 00:00:00","description":"Fleece jackets and pullovers have transformed our experience of the outdoors. But the little, tiny synthetic fibers that fleece is made of could also be ending up in our diets.","filename":"data/vaneerConsumption/AreWeEatingOurFleeceJacketsMicrofibersAreMigratingIntoFieldAndFood.json","image_url":"https://media.npr.org/assets/img/2017/02/06/fleece-jackets_wide-7d558ff0ca8535172278b2f210173c9e41f3f3cc.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thesalt_2017_02_06_511843443_are-we-eating-our-fleece-jackets-microfibers-are-migrating-into-field-and-food_1540249631.html","title":"Are We Eating Our Fleece Jackets? Microfibers Are Migrating Into Field And Food","title_page":"Are We Eating Our Fleece Jackets? Microfibers Are Migrating Into Field And Food : The Salt : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Are We Eating Our Fleece Jackets? Microfibers Are Migrating Into Field And Food\nEnlarge this image toggle caption emholk/iStockphoto/Getty Images emholk/iStockphoto/Getty Images\nThe innovation of synthetic fleece has allowed many outdoor enthusiasts to hike with warmth and comfort. But what many of these fleece-wearing nature lovers don't know is that each wash of their jackets and pullovers releases thousands of microscopic plastic fibers, or microfibers, into the environment — from their favorite national park to agricultural lands to waters with fish that make it back onto our plates.\nThis has scientists wondering: Are we eating our sweaters' synthetic microfibers?\nProbably, says Chelsea Rochman, an ecologist and evolutionary biologist at the University of Toronto, St. George. \"Microfibers seem to be one of the most common plastic debris items in animals and environmental samples,\" Rochman says.\nIn fact, peer-reviewed studies have shown that these synthetic microfibers — a type of plastic smaller than a millimeter in length and made up of various synthetic polymers — have popped up in table salt in China, in arctic waters and in fish caught off the coast of California. These tiny fibers make up 85 percent of human debris on shorelines across the globe, according to a 2011 study. They're basically inescapable. So it's not unlikely they're finding their way into the human diet, especially in seafood.\nIn an effort to increase transparency and minimize pollution from their products, California-based clothing company Patagonia, popular for its microfiber-containing vests, pullovers and jackets, has started to partner with research groups to get to the bottom of how these fibers might be affecting both wildlife and human health.\nLast year, the company worked with a research group led by Patricia Holden, a professor of environmental microbiology at the University of California, Santa Barbara, on a study to quantify microfiber release in washing machines. The group ran both name-brand and off-brand polyester fleece jackets through the wash without detergent to get a handle on the mass of microfibers shed each time.\nThe results, published in September of last year in Environmental Science and Technology, were eye-opening. Each wash of a jacket shed microfibers up to 2 grams. (For reference, a paperclip weighs 1.5 grams.) Also, each fleece jacket released seven times more fibers when washed in a top-load washing machine versus a front-load.\nThe dryer traps extra fuzz in the lint filter, says Holden. \"But in the washer, [the microfibers are] carried down the drain.\" From there, they end up in wastewater treatment plants, where many fibers can't be filtered out and are released into the environment. Holden notes that this is just one pathway microfibers take into the environment. There could be additional pathways that scientists have yet to understand, she says.\nAnd then there is the larger question: Are these tiny synthetic fibers harmful to humans and wildlife?\nThe answer is still fuzzy. Some research indicates certain wildlife might be affected: Two studies showed that ingesting microfibers leads to increased mortality in water fleas and makes common crabs eat less food overall. But it's unclear what effects, if any, they have on you and me.\nSo the question for us is: Do we choose to eat seafood, knowing that we'll probably get a few microfibers woven in? Or do we quit seafood altogether on the chance that they could have adverse health effects?\n\"I have no doubt that every time I eat oysters and mussels I eat at least one microfiber,\" says Rochman, who studies microplastics in marine habitats and continues to indulge in seafood. \"I see dust in the air and we inhale that. The question is, at what point does it become a problem? Here, the benefits outweigh the costs.\"\nGregg Treinish, founder and executive director of the nonprofit Adventure Scientists, has a different take. \"If you're eating fish, you're eating plastic,\" Treinish says. \"There's no proven causal relationship with health issues, but I don't want to spend the next 50 years eating it and then learn I shouldn't have been.\"\nHolden, Rochman, Treinish and others all agree that we don't understand everything about how microfibers traverse ecosystems and what they do inside human and wildlife bodies. But to minimize pollution in the first place, there are short-term solutions we can adopt.\nTreinish rigged his washing machine with a filter designed for septic systems, hoping to catch some microfibers before they escape into the waterways. So far, he has filled two Nalgene water bottles with the filtrate. He continues to use the filter.\nAnd he suggests a simpler solution: Just wash your fleece less often. \"Obviously I'll wash my jacket if a kid throws up on it,\" Treinish says, \"but not if I just wore it once. It's important what individuals do. I hope that doesn't get lost.\"","url":"https://www.npr.org/sections/thesalt/2017/02/06/511843443/are-we-eating-our-fleece-jackets-microfibers-are-migrating-into-field-and-food"}
