{"authors":["Steve Doughty Social Affairs Correspondent For The Daily Mail"],"date_download":"2018-10-22 20:16:17","date_modify":"2018-10-22 20:16:17","date_publish":"2016-01-28 00:43:24","description":"Children’s Commissioner for England, Anne Longfield, is asking children as young as 13 to describe their gender. The list is part of a campaign to ‘find out how gender matters to young people’.","filename":"data/vaneerConsumption/Areyougenderfluiddemigirlorintersex.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/00/30A4EEE700000578-0-image-a-6_1453941545531.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420203_Are-gender-fluid-demi-girl-intersex_1540239377.html","title":"Are you gender fluid, demi-girl or intersex?","title_page":"Are you gender fluid, demi-girl or intersex? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Children’s Commissioner for England, Anne Longfield, is asking children as young as 13 to describe their gender. The list is part of a campaign to ‘find out how gender matters to young people’\nChildren as young as 13 have been invited to describe their gender as any one of 25 different options in a Government-backed survey.\nThe choices put before teenagers in research for the Children’s Commissioner for England include ‘gender fluid’, ‘demi-girl’ and ‘tri-gender’.\nThe list of alternatives is being offered to children as part of a campaign to ‘find out how gender matters to young people’.\nYoungsters are also asked whether they feel safe using single-sex toilets, and if their school should have unisex ones instead.\nOther questions include whether their school should have just one unisex uniform.\nThe research, described by one of its authors as ‘committed to feminist methodologies’, was condemned by critics who said it was biased and politically motivated.\nYesterday Children’s Commissioner Anne Longfield withdrew the survey after the Daily Mail asked her office about it.\nA spokesman said the version that had been distributed was ‘a draft’ and had not been cleared by the Commissioner. A new version will be prepared with some questions withdrawn.\nThe survey was designed at a time of deepening controversy over gender politics, amid claims by activists that everyone should be free to choose their own sex.\nEarlier this month the Commons’ women and equalities committee, led by former culture secretary Maria Miller, said anyone over 16 should have the automatic right to change their legal gender. The committee’s report also claimed that 650,000 Britons – around one in 100 – are ‘likely to be gender incongruent to some degree’.\nThe research for the Children’s Commissioner involves 13 to 18-year-olds. It was commissioned by her £2.9million-a-year organisation, which is sponsored by the Department for Education.\nIt asks youngsters whether they agree that ‘people should be free to choose their gender’. Teenagers are then given 25 options to describe their own gender, choosing as many as they want. Those under 16 are advised that they might wish to consult their parents, but are not told to do so.\nThe list of alternatives is being offered to children as part of a campaign to ‘find out how gender matters to young people’. Celebrities who identify as something other than male or female include the cookery writer Jack Monroe, 27, (pictured) who has used the term ‘non-binary’\nCelebrities who identify as something other than male or female include the cookery writer Jack Monroe, 27, who has used the term ‘non-binary’.\nThe research began in May at Lancaster, Cardiff and Brighton Universities, who are working with UCL’s Institute of Education.\nCritics last night accused the research of ‘exploiting’ teenagers for political ends. Author and family researcher Patricia Morgan said: ‘It is obviously biased. It amounts to the exploitation of children for the purposes of gender pressure groups.’ Simon Calvert, of the Christian Institute, added that the survey could be ‘profoundly confusing’ for children, adding: ‘There aren’t 25 genders. There are two sexes.","url":"https://www.dailymail.co.uk/news/article-3420203/Are-gender-fluid-demi-girl-intersex.html"}
