{"authors":[],"date_download":"2018-10-30 19:47:42","date_modify":"2018-10-30 19:47:42","date_publish":"2018-07-31 09:00:00","description":"Is it possible to age without becoming, well, old?","filename":"data/vaneerConsumption/Areyouaginggracefullytoo.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/31/Images/newsEngin.22636420_Slater-SLIDER-3-702x336.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_getting-old-and-loving-how-about-you__1540928862.html","title":"Are you aging gracefully, too?","title_page":"Are you aging gracefully, too?","title_rss":"NULL","source_domain":"ajc.com","text":"Reading about Lyn Slater, the Fordham University professor and Instagram idol the other day, I couldn’t help thinking, “You go, girl.”\nIf you missed it, Slater, 64, was featured in a New York Times piece about a certain group of women — all on Instagram — who are determined not to age.\nNot that she’s out and about in hot pants or Botoxing to fend against the natural process of aging, but as the writer put it, she and the others are by no means “feeling pressed to close up shop.”\nIn fact, Slater has amassed hundreds of thousands of Instagram followers who admire posts of her looking fabulous in frayed jeans and such on Accidental Icon.\n“I flaunt it,” she was quoted saying. “I’m not 20. I don’t want to be 20, but I’m really freaking cool.”\nDoesn’t that just make your heart smile? Does mine ‘cause, really, most days I feel the same way.\n>> RELATED: Aging in Atlanta\nAnd at 60, I’d like to think I’m in that chorus of like-minded women in their 70s and 80s, who, the writer says, are eschewing long-held notions of how “old” looks, feels, and in some instances, acts.\nTina Turner during the “TINA: The Tina Turner Musical” photocall at Aldwych Theatre last year in London. She is 78 and fabulous. EAMONN M. MCCORMACK / GETTY IMAGES (Eamonn M. McCormack/Getty Images)\nI was never what you might call a wild child, smoking pot and burning my bra, but on my way to this decade, I’ve had a lotta fun and even taken a few risks here or there.\nAnd I did it, always, looking my best. In heels. And my best dress.\nWhen you’re 15 and your mother suddenly dies at age 43, then your father at 51, aging looks different. It’s no longer a curse, something to hide or be ashamed of; it’s a blessing, something you look forward to.\nIn just a few months, I will celebrate my 61st birthday, which by the way, is always reserved for a weekend with my three surviving sisters and lots of cake and icing.\nHeck, I might even put on a little Marvin Gaye and do my version of dancing.\nI can’t say the same for my hunk of a husband, but I’ve long embraced the E-word because, well, I’ve earned it.\nYou don’t make it into the elderly demographic without a few scrapes, scars and stretch marks.\n>> RELATED: Here’s why women outlive men even in the harshest conditions, study says\nWhen I was born in 1957, the life expectancy for a woman was 72. Now it’s 81. African-American like me? Drop that by about five years.\nBlack might not crack, but like everything else, it will most certainly die.\nSo, yeah, 61? Good to see you.\nFor the record, I will never be an old lady either. Computer illiterate. Crabby. Grieving for my younger self doesn’t describe me now and they never will. I’ve made my peace with those bodily changes that come with aging — weight gain, sagging boobs and a butt that has given way to gravity.\nRather than seeing them as negatives, they are the price I paid for what are by far my greatest accomplishments, my two daughters, and I wouldn’t think twice about making that payment again.\nBesides, I’ve never felt better, more at peace, or more sure of myself.\nAnd I will in no way buy into that other long-held stereotype that once you grow old, your best days are behind you and that you can no longer fully realize your dreams.\nEach week, Gracie Bonds Staples will bring you a perspective on life in the Atlanta area. Life with Gracie runs online Tuesday, Thursday and alternating Fridays. (The Atlanta Journal-Constitution)\nI can assure you I won’t take up skydiving. I’m too much of a scaredy-cat for that. But having a good belly laugh while doing the boogie-woogie somewhere I’ve never been and rocking babies in a hospital nursery, something I did for years before starting my workday while in Texas, is definitely me. If it’s simple and isn’t my kind of scary, I’m planning on going to my grave as grateful and giddy for this life as I can be.\n>> RELATED: Boomers are changing the senior center model\nSociologists say that who we are in our 60s, 70s and 80s is pretty close to who we were when we were young.\nMy parents’ untimely death has long influenced how I’ve lived my life. As a result, I try to eat healthy, I make it a point to get eight hours of sleep, and as often as I can get my heart pumping without fear.\nI try not to worry, and I never ever, compare myself to other people. I don’t covet what they do, where they go, what they spend their money on or not, no matter what I see on Facebook.\nInternet personality and Instagram star Helen Ruth Van Winkle is known as “Baddiewinkle.” GETTY IMAGES (The Atlanta Journal-Constitution)\nWhen I tell people I’m 60, the comeback inevitably is “Oh, you’re still young” or “Oh, you’re just a baby.” Compared to an 80-year-old, I suppose I am. Sometimes I even feel like a baby and don’t mind being treated that way.\nBut alas, I still must get up, dress myself, and go off to work.\nSeriously, I like it that I’m growing older. I just don’t want it to ever dictate how I live and certainly how I look and what I wear.\nI guess I’m a little like Slater in that regard. Hardly a day goes by when my husband doesn’t ask me what I’m going to do with the clothes in my closet when I retire, and I tell him, I’m going to wear them.\nI liked high heels and dresses when I was in my 20s. I like them now, and I’m pretty sure I will like them when I turn 80.\nWill I slay like Slater? Well, I’ll let others be the judge of that.\nFind Gracie on Facebook (www.facebook.com/graciestaplesajc/) and Twitter (@GStaples_AJC) or email her at gstaples@ajc.com.","url":"https://www.ajc.com/lifestyles/getting-old-and-loving-how-about-you/AvqleOBYcuSG7AHHwTAlVO/"}
