{"authors":["Frances Martel"],"date_download":"2018-10-30 19:29:09","date_modify":"2018-10-30 19:29:09","date_publish":"2015-03-20 16:14:08","description":"Chief of staff to Argentine President Cristina Fernández de Kirchner accused slain prosecutor Alberto Nisman of using public funds to hire prostitutes.","filename":"data/vaneerConsumption/ArgentineOfficialSlainProsecutoronIranCaseWasScoundrelwithProstituteProblem.json","image_url":"https://media.breitbart.com/media/2015/02/size_810_16_9_alberto-nisman.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_20__1540927749.html","title":"Argentine Official: Slain Prosecutor on Iran Case Was 'Scoundrel' with Prostitute Problem","title_page":"Argentine Official: Slain Prosecutor on Iran Case Was 'Scoundrel' with Prostitute Problem | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The chief of staff to Argentine President Cristina Fernández de Kirchner accused slain prosecutor Alberto Nisman of using public funds to issue friends no-show jobs, buy “expensive champagne,” and hire prostitutes. Nisman died the day before formally accusing the President and other high-ranking officials of conspiring to protect Iranian terrorists for lower oil prices from the Islamic Republic.\nAnibal Fernández, President Fernández de Kirchner’s (no relation) chief of staff, claimed during a question and answer session with the press that Nisman “was given a lot of money” as the head of the investigation into the 1994 bombing for the Argentine Israeli Mutual Association (AMIA), “and he spent it on young women and ñoquis [Argentine slang for an employee who gets paid without working].”\n“This licentious lifestyle was very costly. Who paid for this troupe of workers who did not work Like when he went to Cancun with a secretary ñoqui and a known prostitute? His salary could not have covered all that,” Fernández added.\nThe Times of Israel notes that Fernández also called Nisman a “scoundrel” and a “wretch.”\nThe accusations of illicit behavior followed claims by Diego Lagomarsino–Nisman’s former employee who, having lent Nisman the gun with which he was allegedly killed, is a prime suspect in the case–that he had to provide Nisman kickbacks on his salary.\nNisman was found dead of a gunshot wound to the head on January 18. On January 19, he was to present a nearly 300-page report to the Argentine legislature, in which he accused Fernández de Kirchner, Foreign Minister Héctor Timerman, and others within the Argentine government of striking a deal with the Iranian government whereby Argentina would lobby Interpol to remove a number of Hezbollah-linked terrorists from its wanted list in exchange from lower oil prices. The terrorists are those believed to be responsible for the 1994 AMIA bombing, which killed 85 people and remains the deadliest terrorist attack in the history of Argentina. No one has been arrested in relation to the attack.\nOn Thursday, the Israeli government honored Nisman at an act commemorating another attack on Argentina’s Jewish community: the 23rd anniversary of the bombing of the Israeli embassy in Buenos Aires. Israeli Minister of Agriculture and Rural Development Yair Shamir, speaking at the commemoration, asserted that Nisman “paid with his life for the intent of reaching the truth.”\n“Iran continues to sow terror and the world continues to appease this snake’s nest,” Shamir said of Iran at the event, asserting that “these crimes must be investigated so that their despicable perpetrators are condemned [by courts].”\nAnibal Fernández was also in attendance at the commemoration. The crowd received him with loud boos, largely in response to his posthumous attacks on Nisman. Fernández blamed the booing on opposition leaders organizing a disturbance and denied accusations of anti-Semitism from the crowd by stating, “If there is something that I am in my life is [being] not against anything, I always hold positions in favour.”\nPresident Fernández de Kirchner declined an invitation to commemorate the anniversary of the bombing, meeting with some of the victims’ relatives of the bombing on March 17, the actual date of the anniversary. (The event at the embassy was postponed due to the Israeli election.) “I apologized through the Secretary General to the Presidency and told the people that were with me [meaning survivors of the bombing and family members of the victims] that, in fact, for me, there was only one date for the homage: March 17,” she wrote on her blog.","url":"https://www.breitbart.com/national-security/2015/03/20/argentine-official-slain-prosecutor-on-iran-case-was-scoundrel-with-prostitute-problem/"}
