{"authors":["Frances Martel"],"date_download":"2018-10-30 19:30:06","date_modify":"2018-10-30 19:30:06","date_publish":"2015-01-22 16:16:41","description":"President Cristina Fernández de Kircher states Alberto Nisman's death was \"not a suicide,\" but the work of those helping him build the case.","filename":"data/vaneerConsumption/ArgentinePresidentPensRamblingBlogClaimingInnocenceinProsecutorsMurder.json","image_url":"https://media.breitbart.com/media/2015/01/Alberto-Nisman-protest-signs-ap.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_01_22__1540927806.html","title":"Argentine President Pens Rambling Blog Claiming Innocence in Prosecutor's Murder","title_page":"Argentine President Pens Rambling Blog Claiming Innocence in Prosecutor's Murder | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Top Argentine officials have stated that they believe prosecutor Alberto Nisman was duped into believing the Iranian government had anything to do with the deadliest terrorist attack in the nation’s history–this as President Cristina Fernández de Kircher asserts on her blog that Nisman’s death was “not a suicide,” but the work of people helping Nisman build the case.\nIn a long letter on her personal blog, President Cristina Fernández de Kirchner asserts that Nisman was killed by a mysterious coterie of individuals helping Nisman build his case. Nisman, a high-level prosecutor, was found shot to death on Sunday night, hours before his scheduled testimony to the Argentine Congress to present his case that Argentina’s government had covered up Iran’s role in the bombing of a Jewish center in 1994 to secure trade deals with the OPEC nation. Law enforcement authorities tentatively deemed the death a “suicide,” though they later discovered that Nisman did not have gunpowder on his hands, which diminishes the likelihood that he handled the weapon.\n“Today, I have no proof, but I have no doubts,” writes President Kirchner, insisting that his death was not timed to precede his testimony before Congress, but that “they had to bring him back urgently into the country to exploit the international frenzy provoked by the terrorist acts occurring in France.” She lists a series of questions as proof for her theory:\nWhy would someone who, as a prosecutor, enjoys an excellent quality of life, commit suicide? But also, why would he borrow a weapon to commit suicide when the prosecutor had two weapons registered to his name in RENAR [the national gun registry]?\nMost of the rest of her letter is dedicated to debunking Nisman’s accusations against her administration and other Argentine executives. While shielding Nisman himself from her criticism by claiming that he “never knew that those he accused of being intelligence agents never were any such thing” or that his claims against the Iranian government were, in her opinion, unfounded, she nonetheless argues against the 300-page report Nisman completed the Wednesday before his death.\nShe takes the conspiracy one step further, however, arguing that “they” who had been conspiring against the government had not ever planned to use Nisman’s evidence against her, but instead to use Nisman’s very death to implicate the Argentine government: “The true operation against the government was the death of the prosecutor after accusing the Presidency, her Chancellor, and the Secretary General of covering up for the Iranians accused of perpetrating the AMIA terrorist attack.”\nShe writes dramatically: “They used him alive and they needed him dead,” keeping the definition of “they” intentionally ambiguous.\nThe only “they” the Argentine government appears to be is Antonio Stiusso, a former intelligence agent whom Nisman used as a source. The government alleges that Stiusso fed Nisman false information, though they have yet to raise any evidence as to why. State intelligence fired Stiusso in December.\nHer letter follows comments from other high-level officials who echo her sentiment that Nisman took a fall for some undetermined international conspiracy. “They sold him on a connection that did not exist,” Anibal Fernández, chief of staff, told reporters. He answered affirmatively to a reporter describing Nisman as “totally naive.”\nThe government’s pivot towards simultaneously promoting a conspiracy surrounding Nisman’s death while taking themselves–the main suspects–out of the frame of the conspiracy follows days of unrest in Argentina. In the immediate aftermath of Nisman’s death, thousands of Argentines took to the streets to call upon the government to investigate the case fully, holding signs reading “Yo Soy Nisman,” modeled after the “Je Suis Charlie” signs seen in Paris in the aftermath of the jihadist massacre at the headquarters of satirical magazine Charlie Hebdo. Such protests indicated at least some openness on the part of the public in believing that Nisman, like those killed at Charlie Hebdo, was the victim of Islamist terrorism for daring to speak up against the injustices perpetrated by an Islamist organization (in Nisman’s case, the government of Iran).","url":"https://www.breitbart.com/national-security/2015/01/22/argentinas-president-i-dont-have-proof-but-anti-iran-collaborators-killed-terrorism-prosecutor/"}
