{"authors":[],"date_download":"2018-10-30 21:20:18","date_modify":"2018-10-30 21:20:18","date_publish":"2018-08-23 21:05:00","description":"Singers in R&B, gospel, pop, country and opera are performing at Aretha Franklin’s funeral...","filename":"data/vaneerConsumption/ArianaGrandeStevieWonderJenniferHudsonothersperformingatAr.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/08/13/Videos/4459901.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_fantasia-fait_11bfe8bd2a6e29c64f5db854be3cc08a__1540934418.html","title":"Ariana Grande, Stevie Wonder, Jennifer Hudson, others performing at Ar","title_page":"Ariana Grande, Stevie Wonder, Jennifer Hudson, others performing at Ar","title_rss":"NULL","source_domain":"ajc.com","text":"Singers in R&B, gospel, pop, country and opera are performing at Aretha Franklin’s funeral Aug. 31.\nThe Detroit News reported that the late Queen of Soul’s longtime publicist Gwendolyn Quinn confirmed the list of names of performers at Greater Grace Temple in Detroit. Franklin died of advanced pancreatic cancer Aug. 16.\n>> Read more trending news\nStevie Wonder, Faith Hill, Ron Isley, Chaka Khan, Fantasia, Jennifer Hudson, Yolanda Adams, Shirley Caesar, The Clark Sisters, Jennifer Holliday, Tasha Cobbs, Marvin Sapp, The Williams Brothers, Vanessa Bell Armstrong, classical artist Audrey DuBois Harris, soprano Alice McAllister Tillman, Franklin’s son Edward Franklin, the Aretha Franklin Orchestra and the Aretha Franklin Celebration Choir will perform at the private celebration of life.\nRelated: Aretha Franklin’s funeral will be four-day event, include three days of viewings\nQuinn confirmed to CNN Tuesday that Ariana Grande, who did a tribute to Franklin on “The Tonight Show Starring Jimmy Fallon” the day of Franklin’s death, had been added to the list.\nThe Rev. Jasper Williams Jr., pastor of Salem Baptist Church in Atlanta, will deliver the eulogy. He did the same at the funeral for Franklin’s father, the Rev. C.L. Franklin, in 1984, The Detroit News reported.\nRelated: Aretha Franklin funeral: Where to watch\nDetroit Free Press reported that Bishop Charles H. Ellis III of Greater Grace Temple, will officiate at the service and the Rev. Robert Smith Jr., of New Bethel Baptist Church in Detroit, will be the co-officiant.\nOnly family, friends and invited guests are able to attend the funeral, which will be at 10 a.m. Fans and members of the public can attend three viewings in Detroit: Aug. 28 and Aug. 29 at the Charles H. Wright Museum of African American History from 9 a.m. to 9 p.m. and Aug. 30 at New Bethel Baptist Church from noon to 4 p.m.","url":"https://www.ajc.com/entertainment/fantasia-faith-hill-jennifer-hudson-others-performing-aretha-franklin-funeral/9MZZOonw6HtczQ0yHV0vYL/"}
