{"authors":["Jamie Primeau"],"date_download":"2018-10-30 22:38:49","date_modify":"2018-10-30 22:38:49","date_publish":"2014-08-14 21:13:42","description":"If the rumors are true, Ariana Grande and Big Sean may very well be Hollywood's cutest new couple. While some are excited about this new potential relationship (because hello, how precious is their new song \"Best Mistake?\"), not everyone is a fan —…","filename":"data/vaneerConsumption/ArianaGrandeBigSeanNayaRiveraMayHaveBeeninaLoveTriangleLetsFigureThisOut.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/733c9634-8441-4a8c-88f7-97e882e17a48.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35833-ariana-grande-big-sean-naya-rivera-may-have-been-in-a-love-triangle-lets_1540939129.html","title":"Ariana Grande, Big Sean, & Naya Rivera May Have Been in a Love Triangle - Let’s Figure This Out","title_page":"Ariana Grande, Big Sean, & Naya Rivera May Have Been in a Love Triangle — Let’s Figure This Out","title_rss":"NULL","source_domain":"bustle.com","text":"If the rumors are true, Ariana Grande and Big Sean may very well be Hollywood's cutest new couple. While some are excited about this new potential relationship (because hello, how precious is their new song \"Best Mistake?\"), not everyone is a fan — especially Big Sean's ex-fiancé. Reportedly, Naya Rivera is jealous of Big Sean and Ariana Grande's new relationship. Perez Hilton reports that this is Rivera's \"worst nightmare\" and sources say,\nNaya feels like this is proof that she was right all along and Sean was hooking up with Ariana. She doesn’t want him back, but it’s still a huge wound and she’s hurt and she’s angry.\nApparently Rivera was always suspicious of how close the two were, but he insisted that Ari was like a little sister (which, if this is true, it's a bit strange he's dating his little sis). Anyway, the jealousy was reportedly a huge reason why Rivera and Sean called off their engagement in April. Not long after that, Rivera got married... to someone else. Remember in July when out of nowhere she married Ryan Dorsey? Speaking of which, shouldn't she still be in the honeymoon stage and not obsessing over her ex?\nWhile I hope it isn't true that Grande was the reason their engagement ended, you really never know. For that reason, let's weigh the options and see if these rumors have any weight.\nAriana & Big Sean Were Together While He Was With Naya\nOn Grande's first album, she and Big Sean sang \"Right There\" together. So the two have been friends musically for a while now. And a song title like \"Best Mistake\" could mean cheating with Ari was his best mistake, right? It sounds awful, but you never know. Do we really want to dismiss Rivera's feelings entirely and assume she made up the jealousy in her head? Let's give the girl some credit. There must've been some kind of spark if they're together now.\nIt's A New Relationship (If They're Even Dating)\nFirst of all, no one has confirmed that the pair is actually together. Sure, they've been seen together a lot, but until it's confirmed, no one knows for sure. Plus, she was dating Jai Brooks two minutes ago (OK, more like two weeks ago). I doubt Ari would be juggling both guys at once. Since she was dating Brooks for the second time in early May, the timing doesn't make sense. If anything, maybe their friendship flourished recently when Big Sean was super supportive as Grande's been dealing with the loss of her grandfather.\nConclusion: Either way, let's leave this possible love triangle in the past. Rivera should be enjoying her new marriage, and if Grande and Sean are together, that's great news. If not, that's cool too — at least they make catchy songs together. Now excuse me while I go listen to \"Best Mistake.\"\nYouTube\nImages: Getty Images, WiffleGif, Teen.com","url":"https://www.bustle.com/articles/35833-ariana-grande-big-sean-naya-rivera-may-have-been-in-a-love-triangle-lets"}
