{"authors":["Rachel Simon"],"date_download":"2018-10-30 22:24:38","date_modify":"2018-10-30 22:24:38","date_publish":"2014-08-15 18:39:33","description":"Despite her fame, not much is actually known about Ariana Grande, the 21-year-old singer whose songs \"Problem\" and \"Bang Bang\" are currently taking over the radio. Sure, everyone knows that she started on Broadway, and did that Nickelodeon show, and…","filename":"data/vaneerConsumption/ArianaGrandeCouldveBeenaSerialKillerButShesaKillerBossInstead.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/2c157416-5c39-4c5b-a0c8-dc7e406be3d4.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35951-ariana-grande-couldve-been-a-serial-killer-but-shes-a-killer-boss-instead_1540938278.html","title":"Ariana Grande Could've Been a Serial Killer But She's a Killer Boss, Instead","title_page":"Ariana Grande Could've Been a Serial Killer But She's a Killer Boss, Instead","title_rss":"NULL","source_domain":"bustle.com","text":"Despite her fame, not much is actually known about Ariana Grande, the 21-year-old singer whose songs \"Problem\" and \"Bang Bang\" are currently taking over the radio. Sure, everyone knows that she started on Broadway, and did that Nickelodeon show, and has a sibling on Big Brother, but as for her personality, what she's actually like? Few people have any real clue. So it was a huge surprise to read Grande's new Billboard cover story, in which she reveals more about herself than anyone previously knew — including a few things that might come as a big surprise to anyone who thought of the singer as just a quiet, sweet girl whose only real quirk is that ponytail she never stops wearing.\n\"I think people see me as a little cutesy thing,\" she said in the interview, \"but I’m literally the most sardonic person you’ve ever met.\"\nSo, Grande fans, prepare yourself accordingly: this is a whole new side of the singer that no one's ever seen. Hopefully, it's not the last time she chooses to open up; it's great to see the normally reserved star get a chance to show the world her real self, and for that self to be as cool as hers apparently is. The five most awesome things Grande revealed in the interview:\nHer Creepy Childhood\nJoe Corrigan/Getty Images Entertainment/Getty Images\n\"For my fifth birthday party we had a Jaws theme and all my friends left crying. I mean, I still am that way. But when I was little it was more concerning,\" the singer said, adding that when she was a toddler, her mother truly thought she would grow up to become a serial killer. Grande also called herself \"dark and deranged,' saying that she often imitated Freddy Krueger and was a \"very weird little girl.\" Creepy? Yes. Awesome? Definitely.\nHer Thoughts on Being a Child of Divorce\nAlthough Grande's parents split when she was a child, she still feels like she's caught \"in the middle.\" Plenty of other children of divorce, famous or not, can surely relate, and appreciate her honesty about something so personal.\nHer Pride in Her Beliefs\nJason Merritt/Getty Images Entertainment/Getty Images\nGrande has never made her belief in Kabbalah, the Madonna-loved faith recognized by its red string bracelets, a secret, but rarely has she opened up about why the religion matters to her as much as she did in this interview. The singer said that Kabbalah helps her be strong and self-reliant, as well as navigate an \"egocentric\" world filled with self-promotion. Most major stars shy away from discussing religion, especially ones as controversial as Kabbalah, but Grande's refusal to do so makes it clear she finds nothing wrong with standing up for what she believes in.\nHer Commitment to Working For What She Wants\nCalling herself a \"micromanaging workhorse,\" Grande is proud of her lifelong ambition and strong work ethic, and she should be. She's come a huge way in just a few short years, and it's clear that her unwavering commitment to getting what she wanted, career-wise, was a major factor.\nHer Willingness to Take Charge of her Career\nAdam Bettcher/Getty Images Entertainment/Getty Images\nIn the interview, Billboard spoke to Republic Records chairman/CEO Monte Lipman, who recalled how Grande had no qualms about being her own boss. After recording \"The Way,\" her first major hit, she told Lipman, \"I just made a record that is a smash.\" And when it came to filming the video? Grande knew exactly what she wanted.\n\"It’s got 100 million views, and at the end of the day, that was her,\" Lipman said.","url":"https://www.bustle.com/articles/35951-ariana-grande-couldve-been-a-serial-killer-but-shes-a-killer-boss-instead"}
