{"authors":["Nina Bradley"],"date_download":"2018-10-31 01:46:54","date_modify":"2018-10-31 01:46:54","date_publish":"2018-09-06 15:25:23","description":"More than a year after the tragic bombing at her Manchester concert, Ariana Grande returned to the U.K., proving once again that she's not going to allow hate to stop her from spreading love to her loyal fanbase around the world. As Billboard…","filename":"data/vaneerConsumption/ArianaGrandesFirstUKConcertSinceTheManchesterBenefitProvesShesNotLettingHateWin.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/6/a34199e5-c188-4f17-a766-e387d4b82364-getty-966528980.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_ariana-grandes-first-uk-concert-since-the-manchester-benefit-proves-shes-not-letting-hate-win-11771990_1540950414.html","title":"Ariana Grande’s First U.K. Concert Since The Manchester Benefit Proves She’s Not Letting Hate Win","title_page":"Ariana Grande’s First U.K. Concert Since The Manchester Benefit Proves She’s Not Letting Hate Win","title_rss":"NULL","source_domain":"bustle.com","text":"More than a year after the tragic bombing at her Manchester concert, Ariana Grande returned to the U.K., proving once again that she's not going to allow hate to stop her from spreading love to her loyal fanbase around the world. As Billboard reported, the Wednesday, Sept. 4 show marked Grande's first U.K. performance since the One Love Manchester benefit concert on June 4, 2017, where she performed \"Be Alright\" just two weeks after the terrorist attack.\nShortly after the tragedy, Grande pledged to not allow hate to control her, sharing a statement which, in part, read:\n“We will not quit or operate in fear. We won’t let this divide us. We won’t let hate win.”\nProving that sentiment, Grande made her triumphant return in front of an intimate crowd at London’s KOKO as part of Capital FM’s Up Close series, according to MTV U.K., and she performed some of the biggest hits from her past recordings. Billboard noted that she opened the show with 10 tracks from her new project, Sweetener, and then performed a few songs from her first album, Yours Truly. Grande later sung an a cappella rendition of \"One Last Time\" from My Everything, which NME revealed received a huge reaction, prompting the crowd join in on a sing-along.\nGrande appeared to be basking in the glory of her return to England, and according to Billboard, was seemingly not ready to finish performing, telling the audience: \"Somebody's going to have to give me the hook.\"\nAfter closing the show, Grande took to Twitter to express her gratitude for such an amazing experience, writing: \"omg london i love u that was so special thank u sm,\"\nThe night was certainly a huge moment for the singer, who has been extremely open about her issues with anxiety and post traumatic stress disorder following the tragedy at her Manchester U.K. concert in 2017.\nAccording to People, back in June, Grande revealed her PTSD diagnosis and shared that she was initially apprehensive about sharing her struggles with the public, given the fact that 22 people lost their lives in the horrific event, which occurred on May 22, 2017. She explained,\n“It’s hard to talk about because so many people have suffered such severe, tremendous loss. But, yeah, it’s a real thing. I know those families and my fans, and everyone there experienced a tremendous amount of it as well. Time is the biggest thing. I feel like I shouldn’t even be talking about my own experience — like I shouldn’t even say anything.”\nRich Polk/Getty Images Entertainment/Getty Images\nWhen speaking toVogue U.K. for the July 2018 issue, Grande revealed that she's always dealt with feelings of anxiety and said that the disorder began affecting her more severely as time went on. She shared,\n\"My anxiety has anxiety… I've always had anxiety. I've never really spoken about it because I thought everyone had it, but when I got home from tour it was the most severe I think it's ever been.\"\nA month prior, she also took to social media to detail just how extreme the struggle has been for her. In a May 2018 tweet discussing the background of the lyrics to her song \"Breathin,\" she shared,\n\"i felt like i was floating for like 3 months last year & not in a nice way. like i outside my body? was v scary and i couldn’t breathe well. so it’s ab that. & lots of voices in my head singin.\"\nAs Grande continues to overcome her issues, it's great to see that she refuses to let fear and hate of the Manchester bombing control her life.","url":"https://www.bustle.com/p/ariana-grandes-first-uk-concert-since-the-manchester-benefit-proves-shes-not-letting-hate-win-11771990"}
