{"authors":["Jamie Primeau"],"date_download":"2018-10-31 01:41:14","date_modify":"2018-10-31 01:41:14","date_publish":"2018-09-14 19:48:37","description":"Exactly a week since news broke of his tragic passing, Ariana Grande shared a video tribute to Mac Miller on Instagram on Friday, Sept. 14. The caption is absolutely heartbreaking, while also highlighting just how much the 26-year-old rapper meant…","filename":"data/vaneerConsumption/ArianaGrandesMacMillerVideoIncludesAVeryMovingMessageToTheLateRapper.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/7f9b2c6e-ad2d-4842-9301-f66995e534d5-314b48fe-d177-42__a6-8169-058e3d847e19-getty-692630146.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_ariana-grandes-mac-miller-video-includes-a-very-moving-message-to-the-late-rapper-11926410_1540950074.html","title":"Ariana Grande's Mac Miller Video Includes A Very Moving Message To The Late Rapper","title_page":"Ariana Grande's Mac Miller Video Includes A Very Moving Message To The Late Rapper","title_rss":"NULL","source_domain":"bustle.com","text":"Exactly a week since news broke of his tragic passing, Ariana Grande shared a video tribute to Mac Miller on Instagram on Friday, Sept. 14. The caption is absolutely heartbreaking, while also highlighting just how much the 26-year-old rapper meant to Grande. Over the weekend, she shared a black-and-white photo of Miller on Instagram, but she hadn't written anything in the caption, since understandably, she was likely still gathering her thoughts over such a major loss.\nAlong with a video of Miller smiling and joking around, Grande wrote in the new post:\n\"i adored you from the day i met you when i was nineteen and i always will. i can’t believe you aren’t here anymore. i really can’t wrap my head around it. we talked about this. so many times. i’m so mad, i’m so sad i don’t know what to do. you were my dearest friend. for so long. above anything else. i’m so sorry i couldn’t fix or take your pain away. i really wanted to. the kindest, sweetest soul with demons he never deserved. i hope you’re okay now. rest.\"\nIt's nearly impossible to read that paragraph and not be devastated. But by watching the accompanying video, you can see firsthand the joy these two brought into each other's lives, and that may at least bring some comfort.\nAs a brief recap, Grande and Miller collaborated on her song \"The Way\" in 2013. They later dated for nearly two years, publicly announcing their split in May of this year. At the time, Grande wrote in a post on her Instagram Story:\n\"This is one of my best friends in the whole world and favorite people on the planet. I respect and adore him endlessly and am grateful to have him in my life in any form, at all times regardless of how our relationship changes or what the universe holds for each of us!\"\nThat same sentiment is echoed in her new IG post, where she refers to the late artist as her \"dearest friend. for so long. above anything else.\"\nJust two days before Grande posted her message, her brother Frankie wrote about Miller's impact on his life — specifically how he played a role in his own sobriety. In a lengthy message, Frankie noted that not only was Miller \"a good friend and was wonderful to my sister,\" but he was also \"the reason I went to the rehabilitation center where I was detoxed safely from all of the drugs alcohol and medications I was taking, when I couldn’t imagine living without them.\"\nFrankie's message continued:\n\"It was the place where I found the community of support that showed me that living life without drugs was a possibility and I would never have discovered that if it weren’t for Malcolm. I remember when I would get 30, 60, 90 days clean and Malcom would be there with a gift and a card and words of encouragement... telling me that he knew how hard getting sober is and how impressed he was that I was succeeding.\"\nIn interviews and lyrics, Mac Miller had been open about his struggles, and that's something Grande's new post appears to reference as well, where she writes, \"i’m so sorry i couldn’t fix or take your pain away. i really wanted to. the kindest, sweetest soul with demons he never deserved.\"\nGetty Images/Getty Images Entertainment/Getty Images\nLast Friday, TMZ initially reported Miller's death was the result of an apparent overdose, although this has yet to be confirmed. (Bustle previously reached out to Miller's reps for comment, but did not receive an immediate response. Bustle also reached out to the Los Angeles Police Department.)\nIn a statement released to E! News, Miller's family asked for privacy in what's undeniably a difficult time:\n\"Malcolm McCormick, known and adored by fans as Mac Miller, has tragically passed away at the age of 26. He was a bright light in this world for his family, friends and fans. Thank you for your prayers. Please respect our privacy. There are no further details as to the cause of his death at this time.\"\nWhen news of Miller's passing first broke, Grande unfairly received a slew of online hate, where people tried to blame her for a tragedy that she in no way caused. As her latest Instagram makes clear, Miller meant so much to her, and she definitely deserves some major compassion and support right now above all else.\nIf you or someone you know is seeking help for substance use, call the SAMHSA National Helpline at 1-800-662-HELP(4357).","url":"https://www.bustle.com/p/ariana-grandes-mac-miller-video-includes-a-very-moving-message-to-the-late-rapper-11926410"}
