{"authors":["Kenya Foy"],"date_download":"2018-10-30 23:52:07","date_modify":"2018-10-30 23:52:07","date_publish":"2014-08-12 22:44:46","description":"Life for Ariana Grande has been somewhat of an emotional rollercoaster as of late. She's still dealing with the loss of her grandfather but at the same time, she's releasing some new music that like her previous songs, appears to be headed back to…","filename":"data/vaneerConsumption/ArianaGrandeJustWentThroughaBreakupHereare5WaysFrankieCanHelpHerThroughIt.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/e477fdde-8960-47ff-8e1d-064e1e124870.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35520-ariana-grande-just-went-through-a-breakup-here-are-5-ways-frankie-can-help-her_1540943527.html","title":"Ariana Grande Just Went Through a Breakup & Here are 5 Ways Frankie Can Help Her Through It","title_page":"Ariana Grande Just Went Through a Breakup & Here are 5 Ways Frankie Can Help Her Through It","title_rss":"NULL","source_domain":"bustle.com","text":"Life for Ariana Grande has been somewhat of an emotional rollercoaster as of late. She's still dealing with the loss of her grandfather but at the same time, she's releasing some new music that like her previous songs, appears to be headed back to the top of the charts. Grande's romantic life hasn't been spared from the up and down pattern either. The \"Problem\" singer recently ended her relationship with her boyfriend Jai Brooks, but now rumor has it that Ariana Grande and rapper Big Sean are a hot new item.\nRumors aside, all of Grande's personal and professional obstacles must be compounded by the stress of recovering from a breakup. Most people who experience a romantic parting of the ways can hardly remember to bathe, or struggle to climb out of bed every day, let alone releasing new music and showing up to the Kids' Choice Awards. However, Grande has a huge advantage in her bond with her brother Frankie, who can definitely help her with matters of the heart. Aside from coddling his baby sis while reassuring her that it's perfectly fine to \"drop that zero and get with a hero,\" there are other ways that Frankie can help Ariana navigate the aftermath of a breakup.\nHere are five ways Ariana and Frankie Grande can work together to help her move on to the next:\nWrite a song together and perform an interpretive dance\nThis would exert a lot of energy, but in a healthy way that's much more productive than incessant bawling, emotional eating and shopping. No, scratch that—what the hell am I thinking? Shopping is always productive.\nChange Ariana's hair\nI'm not sure what it is, but there's something about a new haircut that manages to magically alleviate a great deal of breakup stress. C'mon Ariana. Let that ponytail go.\nCelebrate!\nThis may sound a bit harsh because even though Grande reportedly ended things with her ex-boyfriend Jai Brooks for a pretty legitimate reason, breaking up still sucks. Also, it's probably a little more draining seeing as how this is the couple's second split. Grande probably won't feel much like celebrating, but in this case, the key to recuperating is to fake it 'til you make it.\nFocus on Frankie's problems\nSince misery loves company, Frankie could help his lil' sis take the focus off her breakup by helping him deal with Big Brother backlash. And judging by Ariana coming to Frankie's defense on Instagram, this plan has already been successfully set in motion.\nCompile a list of other dating prospects for Ariana\nOK, so the media is toying around with the idea of Ariana dating Big Sean, but Frankie is most certainly aware that his sister is a hot commodity who must keep her options open.Images:grandelegacy, aprincewithoutacrown,imjdbanonTumblr (3); Giphy (2)","url":"https://www.bustle.com/articles/35520-ariana-grande-just-went-through-a-breakup-here-are-5-ways-frankie-can-help-her"}
