{"authors":["Kenya Foy"],"date_download":"2018-10-30 23:57:21","date_modify":"2018-10-30 23:57:21","date_publish":"2014-08-12 20:59:45","description":"Pop princess Ariana Grande may be in the middle of celebrating the fact that her new single \"Best Mistake\" featuring Big Sean nabbed the top spot on the Billboard + Twitter Trending 140 chart a little more than 24 hours after its release, but she…","filename":"data/vaneerConsumption/ArianaGrandeBeautifullyDefendsBrotherFrankieAgainstDisgustingHomophobicSlurs.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/eb00e9dc-91e8-427f-8217-9d77069aae0c.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35492-ariana-grande-beautifully-defends-brother-frankie-against-disgusting-homophobic-slurs_1540943841.html","title":"Ariana Grande Beautifully Defends Brother Frankie Against Disgusting Homophobic Slurs","title_page":"Ariana Grande Beautifully Defends Brother Frankie Against Disgusting Homophobic Slurs","title_rss":"NULL","source_domain":"bustle.com","text":"Pop princess Ariana Grande may be in the middle of celebrating the fact that her new single \"Best Mistake\" featuring Big Sean nabbed the top spot on the Billboard + Twitter Trending 140 chart a little more than 24 hours after its release, but she wasn't about to allow her moment of joy to be ruined by someone who left a rude comment on Instagram in which they referred to her beloved big brother Frankie as \"that homo.\" Fortunately, those disgusting words were no match for the singer, who delivered the best response ever. E! Online reports that Grande didn't hold back while defending her brother, and even took the opportunity to address his decision to reveal his true identity on Big Brother .\"That ‘homo' is the fiercest, most incredible, funniest, most intelligent, kind hearted and most LOVED person on the face of the planet!\" Grande reportedly posted. She continued by writing, \"he also cleaned up his game and told the truth to everybody in the house WHICH by the way, nobody else on the show has done. so i don't give a flying f--k if or when he comes home!!! he is incredible and i am SO proud!!!! oh and also ‘that homo' gets more ass than you'll ever get in your life. k miss thing?\"\nWell, alrighty then! Frankie should definitely consider himself lucky to have a sister who can deal with homophobic online attacks in such a manner. It's quite refreshing to know that Grande doesn't allow her nice girl image to keep her from standing up for what's right, specifically when it comes to speaking out against unwarranted, malicious insults against her family. Seeing Grande's more feisty attitude will not only garner more respect, but it'll also add to the ever-expanding list of reasons why Ariana and Frankie Grande's relationship is one to be admired. Image: Giphy","url":"https://www.bustle.com/articles/35492-ariana-grande-beautifully-defends-brother-frankie-against-disgusting-homophobic-slurs"}
