{"authors":["Kadeen Griffiths"],"date_download":"2018-10-30 23:44:22","date_modify":"2018-10-30 23:44:22","date_publish":"2014-08-13 13:18:24","description":"Get your boobie bombs racked and loaded (get it?) for Ariana Grande's latest music video. If you don't get the joke, then watch the video and then come back here. If you've been wondering how Ariana Grande was going to top the \"Problem\" music video,…","filename":"data/vaneerConsumption/ArianaGrandesBreakFreeVideoShowsaFuturisticWorldinWhichBoobRocketsAreaRealThingVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/282365cb-a68b-4967-bc35-454e784cfa3a.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35572-ariana-grandes-break-free-video-shows-a-futuristic-world-in-which-boob-rockets-are-a-real_1540943062.html","title":"Ariana Grande's \"Break Free\" Video Shows a Futuristic World in Which Boob Rockets Are a Real Thing - VIDEO","title_page":"Ariana Grande's \"Break Free\" Video Shows a Futuristic World in Which Boob Rockets Are a Real Thing — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Get your boobie bombs racked and loaded (get it?) for Ariana Grande's latest music video. If you don't get the joke, then watch the video and then come back here. If you've been wondering how Ariana Grande was going to top the \"Problem\" music video, or even just feeling that \"Break Free\" featuring Zedd was a disappointing follow-up to \"Problem\", then prepare to have your concerns completely blown out of the water. Having watched Ariana Grande's music video for \"Break Free\", I'm still not completely sure what I just watched. It's the most bizarre prelude to the most bizarre intergalactic dance party that I've ever seen. It was also completely amazing.\n\"Prepare yourself to attempt to conceive an inconceivable outer space adventure,\" says the Star Wars-esque scrolling text at the start of the video. \"Brace yourself for something so fantastically fantastical you'll soil yourself from intergalactic excitement.\" Thus are we warned from the onset that this video isn't even going to pretend to take itself seriously and you shouldn't take it seriously either. You know why? Because Grande pulls a Britney Spears and launches rockets from her boobs, then she parties with adorable aliens on a space ship.\n\"Break Free\" isn't scientifically accurate, uniformly cohesive, or even bothering to go for a solid plot line. It's just four minutes of pure, unfiltered fun and you can tell during every second of the video that Grande was having a lot of fun with all of it. Her beloved go-go boots even make another appearance, having apparently become the fashion accessory of the future that all intergalactic warriors need to complete their ass-kicking ensembles.\nWhether you actually care for the song or not, \"Break Free\" has one of those music videos that you can watch purely for the entertainment value and general hilarity of the whole thing. You've never seen an intergalactic dance party like this before. Watch the video below.\nArianaGrandeVevo on YouTube\nImage: YouTube; my-chemical-wifi/Tumblr","url":"https://www.bustle.com/articles/35572-ariana-grandes-break-free-video-shows-a-futuristic-world-in-which-boob-rockets-are-a-real"}
