{"authors":["Alex Kritselis"],"date_download":"2018-10-30 22:24:40","date_modify":"2018-10-30 22:24:40","date_publish":"2014-08-15 18:19:01","description":"Here's something a little unexpected and potentially awesome for your Friday: Ariana Grande's new song \"Break Your Heart Right Back\" is about a man cheating on a woman with another man. Now that's a storyline you certainly haven't heard too often…","filename":"data/vaneerConsumption/ArianaGrandesBreakYourHeartRightBackIsAboutaManCheatingWithAnotherManItCouldBeaTrueStory.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/be3a1154-0a15-4eac-abe2-3cf3b210aa9e.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35944-ariana-grandes-break-your-heart-right-back-is-about-a-man-cheating-with-another-man_1540938280.html","title":"Ariana Grande's \"Break Your Heart Right Back\" Is About a Man Cheating With Another Man & It Could Be a True Story","title_page":"Ariana Grande's \"Break Your Heart Right Back\" Is About a Man Cheating With Another Man & It Could Be a True Story","title_rss":"NULL","source_domain":"bustle.com","text":"Here's something a little unexpected and potentially awesome for your Friday: Ariana Grande's new song \"Break Your Heart Right Back\" is about a man cheating on a woman with another man. Now that's a storyline you certainly haven't heard too often (or maybe, like, ever) in pop music! How intriguing.\n\"Break Your Heart Right Back,\" which Billboard reports features rapper Childish Gambino, will appear on Grande's upcoming sophomore album, My Everything. According to The Huffington Post, Grande said of the song in a recent interview:\nIt’s one of my favorites on the album and it’s really funny because I believe it has happened to me. I’m not 100 percent positive but I’m 99.9 percent positive ... I would rather he cheats on me with a guy than with a girl any day! If I found out my boyfriend was gay, I would be like \"OK!\" I’d be so relieved.\nI can't say that I know many people who would be \"relieved\" that their partners had cheated on them, regardless of whom it was with, but what can I say? Grande's a unique lady. Additionally, did one of Grande's recent exes cheat on her with another guy? ... Was it her on again, off again boyfriend, Jai Brooks?\nOn Thursday, shortly after Grande's comments started spreading around the 'net, Brooks tweeted:\nWelp, thanks for clearing that up! It looks like someone's feeling a little bit insecure. Just kidding, it's not my place to speculate about someone else's sexuality. (But seriously, Brooks is coming off as a little insecure here, right?) Grande could've also been talking about The Wanted's Nathan Sykes... but you guys, stop trying to make me speculate about someone else's sexuality! I just won't do it.\nJason Merritt/Getty Images Entertainment/Getty Images\nI must say, I'm pretty excited to hear \"Break Your Heart Right Back.\" According to Attitude, the song samples Diana Ross' iconic gay anthem, \"I'm Coming Out\" — which sounds deliciously campy. (I actually think that it samples \"I'm Coming Out\" by way of sampling P. Diddy's 1997 hit, \"Mo Money Mo Problems,\" but same difference.) On Thursday, Grande shared two snippets of the track on Instagram.\nI'm also very interested to hear Childish Gambino's contribution to the track. History tells us that when a pop song tells a tale of guy/girl romance, and there's both a guy and a girl on the track (especially a male rapper and a female singer), they typically play the parts of the lovers in the story — which means that Childish Gambino could be rapping about cheating on Grande with another dude. I'm racking my brain here, but I can't think of another rapper in the music industry today who would be down to take on that role. That's pretty cool! (Well, cheating is never cool, but you know what I mean.)\nBob Levey/Getty Images Entertainment/Getty Images\nGrande's new album, My Everything, is out on Aug. 25, which means that we're only 10 short days away from hearing \"Break Your Heart Right Back\" in full! I can't wait.\nImages: JaiBrooks1/Twitter; Getty Images (2)","url":"https://www.bustle.com/articles/35944-ariana-grandes-break-your-heart-right-back-is-about-a-man-cheating-with-another-man"}
