{"authors":["Brittany Valadez For Dailymail.Com"],"date_download":"2018-10-23 03:39:18","date_modify":"2018-10-23 03:39:18","date_publish":"2016-01-28 19:09:53","description":"Modern Family starlet Ariel Winter, 18, couldn't wait for the arrival of her big day, having shared the clip around the time the clock stroke midnight on Thursday. She has been a star for over a decade.","filename":"data/vaneerConsumption/ArielWintercelebratesbecominganadultbypostingmessageonInstagram.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/19/30AC86DF00000578-0-image-a-16_1454008170313.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421376_Ariel-Winter-celebrates-adult-posting-message-Instagram-one-minute-midnight_1540265958.html","title":"Ariel Winter celebrates becoming an adult by posting message on Instagram","title_page":"Ariel Winter celebrates becoming an adult by posting message on Instagram | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Actress Ariel Winter turned 18-years-old on Thursday.\nAnd to celebrate, the Modern Family star posted a boomerang video on Instagram one minute after midnight.\nThe beauty, who had on no makeup and wore her hair wet, looked excited as she put her hand up to her lips.\nScroll down for video\n'18!': To celebrate her milestone birthday, Ariel Winter shared a cheeky video on Instagram on Thursday\nAriel, who also voices the lead for Sofia The First, wore a boxing print T-shirt and a pendant necklace.\nThe talented starlet, who plays smart teenager Alex Dunphy on the comedic series, showed off her black-manicured fingers as she filmed herself in a bathroom mirror.\nAlready a grown-up: In an interview with People, Ariel, pictured on January 23, opened up in regards to her then-impending adulthood, citing she has 'kind of been in adulthood for a little bit now'\nIn an interview with People, Ariel said she has 'kind of been in adulthood for a little bit now.'\nIndeed, the actress has been part of the entertainment industry since she was just a preschooler.\n'I was put in the industry when I was 4. I love what I do, but I don't know if it's a choice I would have made on my own,' she revealed.\n'People criticize you at an extremely young age. There's a lot of rejection. I heard no thousands of times. That was hard to cope with,' she added.\nMajor milestones: While being in the spotlight, the actress, pictured on November 14, 2015, has already experienced two significant events that most people her age have never faced. She did so all within the same year\nWhile being in the spotlight, the actress has already experienced two significant events that most people her age have never faced. She did so all within the same year.\nIn May of 2015, Ariel became legally emancipated from her mother, Shenelle Gray, after it was ruled that she emotionally abused her daughter.\nThen, in June, the starlet underwent a breast reduction surgery, and now feels 'comfortable' in her own skin.\n'It was an instant weight lifted off my chest - both literally and figuratively. There's a confidence you find when you finally feel right in your body.' she revealed to People, in a separate interview.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421376/Ariel-Winter-celebrates-adult-posting-message-Instagram-one-minute-midnight.html"}
