{"authors":[],"date_download":"2018-10-22 21:13:23","date_modify":"2018-10-22 21:13:23","date_publish":"2014-05-06 14:12:32","description":"The young girl who one of Ariel Castro's hostages gave birth to while in captivity altered his mindset on keeping his victims locked inside his house.","filename":"data/vaneerConsumption/ArielCastroLovedDaughterWantedtoGetCaughtLawyerSays.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/423666/140506-ariel-castro-house-jsw-1153a_6ab05258b531145927938f36449433d5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_ariel-castro-loved-daughter-wanted-get-caught-lawyer-says-n98126_1540242803.html","title":"Ariel Castro Loved Daughter, Wanted to Get Caught, Lawyer Says","title_page":"Ariel Castro Loved Daughter, Wanted to Get Caught, Lawyer Says","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAriel Castro's desire for his young daughter to live a normal life ate at him so much that he eventually eased up on the three women he held captive for a decade, hoping they and the girl would escape his house of horrors, his attorney said.\nBut he didn't have the \"courage\" to just go to police and surrender, attorney Craig Weintraub told NBC affiliate WKYC in Cleveland in an exclusive interview.\nWeintraub spoke to WKYC almost exactly one year to the day after Amanda Berry, Michelle Knight and Gina DeJesus were rescued from Castro's Cleveland house. The daughter that Berry had given birth to while being held, 6 years old at the time, was also saved on May 6, 2013.\nCastro became attached to the little girl, and as she grew older, he realized she needed to live outside the confines of the home, Weintraub said. Six months to a year before the women escaped, Castro told Berry he knew the end was coming.\n\"It wasn't going well any longer. His daughter was at an age that she should not be in the house anymore. She needed to be in school and be in a normal environment, and she needed friends,\" Weintraub said.\nSo Castro intentionally became \"much more negligent in the house about locking the door,\" he said.\nOver the years, Castro would barricade the women in rooms upstairs when he had company over, tying them up in chains, Knight told NBC News in interviews that aired this week. He would play mind games with the women, sometimes leaving their doors open but coming in frequently to make sure they didn't try to escape, she said.\nBut his love for the girl was so strong that he dismissed thoughts of killing the women because of how it might affect his daughter, Weintraub said.","url":"https://www.nbcnews.com/news/us-news/ariel-castro-loved-daughter-wanted-get-caught-lawyer-says-n98126"}
