{"authors":[],"date_download":"2018-10-30 01:20:31","date_modify":"2018-10-30 01:20:31","date_publish":"2014-06-13 22:19:00","description":null,"filename":"data/vaneerConsumption/AriFleischersTrollingClinic.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/themes/amspec-v1/_img/favicon.ico?v=2","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862431.html","title":"Ari Fleischer's Trolling Clinic","title_page":"Ari Fleischer's Trolling ClinicThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Ari Fleischer is giving a clinic in trolling right now. Alarmed by President Obama’s absolutely inane Rose Garden address (ostensibly about Iraq, but actually about nothing) the former Bush spox took to the Twitters to call out O’s inaction.\nFirst he tweeted: “Regardless of what anyone thinks of going to Iraq in 2002, it’s a tragedy that the successes of the 2007 surge have been lost and abandoned.”\nThen: “We don’t need ground forces, but when America withdraws, the vacuum gets filled by Iran, Muslim Brotherhood, AQ, or Russia. How are we safer?”\nThen: “Can someone tell me what the difference is between Pres O’s foreign policy and Ron Paul’s? They are the same, but O won’t admit it.”\nFinally: “Summary: We did nothing in Syria. We’ll do nothing next in Iraq.”\nFleischer is willfully off-target. Let’s consider his statements from the top.\nFirst, you can’t shrug off the fact that al Qaeda wasn’t even in Iraq until the United States invaded on false pretense. The 2007 surge was a finger in the dam.\nSecond, the Bush administration should have known that removing the largest regional counterbalance to Iran would increase Tehran’s influence in a Shia-majority state, particularly in a nascent, neighboring democracy. But that’s almost beside his point because it sounds like he’s arguing for an American military presence, always and everywhere.\nThird, if you’re making wholesale parallels between Ron Paul and President Obama’s foreign policy priorities, you’re just stirring the #derp.\nFinally, America is currently the leading arms distributor on Syria’s northern and southern fronts, according to the chief-of-staff of the Free Syrian Army’s Supreme Military Council. He went on to state that our present haphazard allocation of weapons could elevate warlords, worthy of Somalia or Afghanistan. Considered in context, “nothing” sounds a lot nicer.","url":"https://spectator.org/59632_ari-fleischers-trolling-clinic/"}
