{"authors":[],"date_download":"2018-10-22 22:10:02","date_modify":"2018-10-22 22:10:02","date_publish":"2014-06-08 23:01:31","description":"A convicted serial killer who committed suicide in an Arizona prison last year was likely hoarding antidepressants from a fellow inmate.","filename":"data/vaneerConsumption/ArizonaSerialKillerSavedPillsBeforeSuicide.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/495521/140608-dale-hausner-jms-1833_a887a55f037297c1fa9411908d9cd26b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_arizona-serial-killer-saved-pills-suicide-n125796_1540246202.html","title":"Arizona Serial Killer Saved Pills Before Suicide","title_page":"Arizona Serial Killer Saved Pills Before Suicide","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA convicted serial killer who committed suicide in an Arizona prison last year was likely hoarding antidepressants from a fellow inmate in the months before his death, a state prison investigation said.\nFindings in an Arizona Department of Corrections report released Friday indicate another inmate gave 40-year-old Dale Hausner several amitriptyline pills a week over a two-month period at a Florence prison.\nAccording to the documents, the unidentified inmate told the Inspector General's Office that Hausner said he was having trouble sleeping. So, the inmate initially gave Hausner nine pills before giving out four or five each week.\nThe inmate told officials he had medications to give because prison nurses didn't always watch him take what was a daily dosage. He would save any he didn't feel like taking.\nWhile the inmate recalled talking with Hausner about the idea of stockpiling pills to commit suicide, the inmate said he thought Hausner was taking them as he received them.","url":"https://www.nbcnews.com/news/us-news/arizona-serial-killer-saved-pills-suicide-n125796"}
