{"authors":["Michelle Moons"],"date_download":"2018-10-30 21:41:27","date_modify":"2018-10-30 21:41:27","date_publish":"2016-03-21 03:31:32","description":"Arizona Rep. Matt Salmon endorsed “warrior” Sen. Ted Cruz for president just two days before a tight presidential primary in Salmon’s home state. |","filename":"data/vaneerConsumption/ArizonaRepSalmonEndorsesWarriorForSmallerGovernmentTedCruz.json","image_url":"https://media.breitbart.com/media/2015/01/matt-salmon-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_03_20__1540935687.html","title":"Arizona Rep. Salmon Endorses ‘Warrior For Smaller Government' Ted Cruz","title_page":"Arizona Rep. Salmon Endorses ‘Warrior For Smaller Government' Ted Cruz | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Arizona Rep. Matt Salmon endorsed “warrior” Sen. Ted Cruz for president just two days before a tight presidential primary in Salmon’s home state.\nSalmon called the 2016 election “one of the most important of our time.”\nThe future of our country, our security, and our way of life hang in the balance. We need a president that understands the myriad of global security challenges we face from ISIS to Iranian aggression to Russian and Chinese expansionism. Our next president must recognize, embrace, and empower the many Americans who have been left behind while the Obama Administration focused on growing government by sacrificing the middle class. Our next president must be a warrior for smaller government, more freedom, opportunity for all Americans, and a conviction that life, no matter how nascent, must be protected and celebrated. Ted Cruz is such a warrior. He will fight to keep the American Dream alive, grow our economy for all Americans, and keep us safe here at home. I am proud to endorse him for President of the United States.\nCruz said of Salmon, “Matt is a strong, principled conservative.”\nHe has consistently fought for issues that are of the utmost importance to conservatives. He has stood up against Washington’s burdensome regulations, fought to repeal Obamacare, and protect our First Amendment liberties. He has spent his career fighting for the people of Arizona and all Americans. I am thrilled to have his support and look forward to having his help coalescing conservatives around our campaign.\nCruz and Donald Trump are locked in a tight race in Arizona ahead of the Tuesday primary contest. Early voting has been marked as favoring frontrunner Trump while more recent data suggests Cruz may win favor in day of voting.\nArizona boasts 58 delegates up for grabs. Utah voters will also make a decision in the republican presidential primary on Tuesday where Cruz has been favored. Utah offers up 40 delegates.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/politics/2016/03/20/holdholdhold-arizona-rep-salmon-endorses-warrior-for-smaller-government-ted-cruz/"}
