{"authors":["Awr Hawkins"],"date_download":"2018-10-30 18:14:58","date_modify":"2018-10-30 18:14:58","date_publish":"2015-05-19 17:09:39","description":"With a $1 billion budget deficit, Arizona lawmakers set a \"lifetime limit\" on welfare benefits at 12 months.","filename":"data/vaneerConsumption/ArizonaSetsWelfareLifetimeLimitof12MonthstoAddressBudgetDeficit.json","image_url":"https://media.breitbart.com/media/2015/05/Bread-Welfare-Arizona-AP-PhotoRoss-D.-Franklin.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_19__1540923298.html","title":"Arizona Sets Welfare 'Lifetime Limit' of 12 Months to Address Budget Deficit","title_page":"Arizona Sets Welfare 'Lifetime Limit' of 12 Months to Address Budget Deficit | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"With a $1 billion budget deficit, Arizona lawmakers set a “lifetime limit” on welfare benefits at 12 months.\nAs a result, “The Arizona Department of Economic Security will drop at least 1,600 families” from their rolls on July 1, 2016. The savings to the state will be approximately $4 million.\nThe Associated Press reports that most states have a five year limit on benefits, while “thirteen states limit it to two years or less.”\nThe AP spoke to 23-year-old Jessica Lopez about the lawmakers’ decision. She never finished high school, gave birth to a son “while living in a domestic violence shelter,” and previously received “$133 per month for about a year.” Lopez said: “We’re all human. Everybody has problems. Everybody is different. When people ask for help, we should be able to get it without having to be looked at wrong.”\nThe welfare cuts are part of an broader effort to limit expenditures and keep Governor Doug Ducey’s (R) promise to pass no new taxes. In addition to the welfare cuts, Arizona lawmakers want “anyone getting Medicaid to have a job.”\nState senator Kelli Ward (R-Lake Havasu City) explained that the cuts are not simply a fiscal decision, but a part of a push to encourage welfare beneficiaries to get back on their feet. Ward said: “I tell my kids all the time that the decisions we make have rewards or consequences, and if I don’t ever let them face those consequences, they can’t get back on the path to rewards. As a society, we are encouraging people at times to make poor decisions and then we reward them.”\nFollow AWR Hawkins on Twitter @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/05/19/arizona-sets-welfare-lifetime-limit-of-12-months-to-address-budget-deficit/"}
