{"authors":[],"date_download":"2018-10-22 22:17:08","date_modify":"2018-10-22 22:17:08","date_publish":"2014-06-07 04:37:48","description":"Arizona said it will rush federal supplies to a holding center housing migrant children — among the thousands being sent to the state.","filename":"data/vaneerConsumption/ArizonatoFedsStopShippingImmigrantsfromTexas.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/494126/140607-immigrants-ga-0031_6133125f00e78fb2eea8dc0928ea0b0a.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_immigration-border-crisis_arizona-feds-stop-shipping-immigrants-texas-n125116_1540246628.html","title":"Arizona to Feds: Stop Shipping Immigrants from Texas","title_page":"Arizona to Feds: Stop Shipping Immigrants from Texas","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nArizona officials are rushing federal supplies to a makeshift holding center that's housing hundreds of migrant children and is running low on the basics.\nGov. Jan Brewer's spokesman, Andrew Wilder, said Friday that conditions at the holding center are so dire that federal officials asked the state to immediately ship the medical supplies to the center in Nogales.\nA Homeland Security Department official told The Associated Press that about 700 children slept on plastic cots Friday and about 2,000 mattresses have been ordered. Portable toilets and showers have been brought to the holding center — a warehouse that has not been used for detention in years.\nThe official, who spoke on condition of anonymity because there was no authorization to discuss the matter publicly, the number of children at the warehouse was expected to double to around 1,400. The warehouse has a capacity of about 1,500.","url":"https://www.nbcnews.com/storyline/immigration-border-crisis/arizona-feds-stop-shipping-immigrants-texas-n125116"}
