{"authors":["Kelly Mclaughlin For Dailymail.Com"],"date_download":"2018-10-22 20:20:28","date_modify":"2018-10-22 20:20:28","date_publish":"2016-01-29 01:14:16","description":"Ryder Temarantz's mother Andrea said in December, she noticed a 'white glow' in her son's eye when she took a picture using a flash. In January, Ryder was diagnosed with retinoblastoma.","filename":"data/vaneerConsumption/Arizonamothersayscameraflashdetectstumorinherbabyseye.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/30AE4EA400000578-0-image-a-40_1454030610976.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422030_Arizona-mother-says-camera-flash-detects-tumor-four-month-old-baby-s-eye_1540239628.html","title":"Arizona mother says camera flash detects tumor in her baby's eye","title_page":"Arizona mother says camera flash detects tumor in her baby's eye | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A camera's flash helped save the life of a four-month-old boy in Arizona.\nRyder Temarantz's mother Andrea said that beginning in December, she noticed a 'white glow' in her son's left eye whenever she took a picture using a flash.\nAndrea Temarantz thought it was just a 'bad camera phone', but when the glow showed up in Ryder's eye in a photo taken on a DSLR she got for Christmas from a cousin, she decided ask a doctor about the condition. The boy was then diagnosed with retinoblastoma on January 5.\nA four-month-old Arizona boy's life was saved after his mother noticed a 'white glow' (pictured) in her son's eye when she took photos of him\nThe white glow in Ryder Temarantaz's eye ended up being retinoblastoma, which he was diagnosed with on January 5. Above he is pictured in hospital\nRetinoblastoma is an eye cancer that starts in the retina - or the back of the eye - and is most common in children. Ryder (pictured in hospital) is now prepping to undergo three to six rounds of chemosurgery\n'It looks almost like a flashlight in his eye. A tiny flashlight,' Temarantz told 12News of her son, who has Down syndrome. '150 (pictures) a day. Out of 145, his eye was glowing.'\nRetinoblastoma is an eye cancer that starts in the retina - or the back of the eye - and is most common in children.\nA white tumor mass in the back of Ryder's eye was producing the 'glow' seen in many photos as it reflected lights from camera flashes, mother-of-two Temarantz told ABC.\nThe Temarantz decided earlier this year to take Ryder to Memorial Sloan Kettering Cancer Center in New York City, which has the world's largest team of physicians dedicated to patients with retinoblastoma.\nThere, it was discovered that the tumor in Ryder's left eye had not spread to any other critical organs, like his brain, Dr David H Abramson, chief of the Ophthalmic Oncology Service at Memorial Sloan Kettering, told ABC.\n'Worldwide, 50 per cent of the children who had retinoblastoma last year died,' Abramson said. 'It's one of those cancers that can be fatal if not detected early, so it's great that his mom noticed it early and got it checked out.'\nRyder is now prepping to undergo three to six rounds of ophthalmic artery chemosurgery, Abramson said.\nRyder, who has Down syndrome, is the youngest son of Andrea and Joe Temarantz. They also have another son (pictured all together at Christmas)\nA mass was found behind Ryder's left eye, which can be seen in the bottom picture on the left, compared to his right eye, which is pictured top right\nA six-foot-long catheter, which is as thin as angel hair pasta, will be threaded into a blood vessel of Ryder's groin, Abramson said.\nIt will then go through the belly, into the chest and neck and then put through 'the one little blood vessel of the human eye to deliver high concentration and dosage of chemotherapy directly to the tumor'.\nWHAT IS RETINOBLASTOMA? Retinoblastoma is an eye cancer that starts in the retina - or the back of the eye - and is most common in children. It can occur in one or both eyes In early stages, the cancer has little symptoms, other than a 'white glow' that shows up when light is held up to the eye Treatments include chemotherapy, radiation, and laser therapy Source: Mayo Clinic\nBecause of the severe side effects of regular chemotherapy, the procedure is considered a better option for young patients.\nYoung Ryder has a 99 per cent chance of recovering from the cancer. He will also likely still have some vision in his left eye.\nDespite the struggles, Ryder is 'active and alert like nothing ever happened to him,' Temarantz said.\nAnd above all, 'Ryder is the happiest baby you'd ever meet', Temarantz told 12News.\nShe said that if the family had waited to bring up the white glow, that the cancer 'could've spread to his brain', and that she has advice for fellow parents.\n'Take a lot of pictures of your kids and leave the flash on,' she told 12 News. 'If you see it (glow) once. Take more'\nThe Temarantz family has set up a Fundrazr page for the public to follow Ryder's story and journey to recovery online.\nRyder is now prepping to undergo three to six rounds of ophthalmic artery chemosurgery, which is considered a better option for young patients than regular chemotherapy","url":"https://www.dailymail.co.uk/news/article-3422030/Arizona-mother-says-camera-flash-detects-tumor-four-month-old-baby-s-eye.html"}
