{"authors":["Alexandra Klausner For Dailymail.Com"],"date_download":"2018-10-23 02:43:51","date_modify":"2018-10-23 02:43:51","date_publish":"2016-01-29 17:23:03","description":"Arizona Department of Transportation worker Gil Estrada rescued a puppy stranded on State Route 51 on January 25 after spotting her on his camera used to check road conditions.","filename":"data/vaneerConsumption/Arizonatransportationworkersrescueapuppystrandedonabusyhighway.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30B44C5600000578-0-image-a-14_1454087645119.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423135_She-s-ruff-week-Transportation-workers-rescue-puppy-stranded-busy-highway_1540262631.html","title":"Arizona transportation workers rescue a puppy stranded on a busy highway","title_page":"Arizona transportation workers rescue a puppy stranded on a busy highway | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A puppy cheated death last week when it was stranded in the center lane of a busy Arizona road for over an hour.\nLuckily for the dog, Arizona Department of Transportation worker (ADOT) Gil Estrada spotted the canine on camera on State Route 51 while checking on the condition of the road on January 25.\nEstrada was miles away but hopped in his car as soon as he saw the animal in danger and came to her rescue, according to KPNX.\nRescued: A puppy cheated death last week when it was stranded in the center lane of a busy Arizona highway for over an hour\nCaught on cam: Luckily for the dog, Arizona Department of Transportation worker (ADOT) Gil Estrada spotted the canine on camera on State Route 51 while checking on the condition of the road on January 25.\n'She was lucky, and she was brave, too,' Estrada said.\n'She knew that she was in peril if she moved anywhere, and she just stayed there,' he said.\n'I was just happy to go out there and pick her up,' he added.\nEstrada, who didn't know if the pooch was the biting type, patiently approached the dog and brought her back to the control center.\nEstrada decided to call the dog Dottie after ADOT since he does not know who the dog belongs to.\nOne of Estrada's co-workers took the dog home overnight before handing her over to the Arizona Equine Rescue Organization.\nBoth ADOT and the organization are looking for her owner.\n'Since we don't know her name, we'll call her Dottie, as a shout out to the ADOT employees who rescued her. No AERO funds will be used in the housing and care for Dottie of course since she is outside our mission, but we are so glad to be able to help,' the organization said on Facebook.\nIf the dog's owners are not found, she will be put up for adoption.\nSafe: One of Estrada's co-workers took the dog home overnight before handing her over to the Arizona Equine Rescue Organization","url":"https://www.dailymail.co.uk/news/article-3423135/She-s-ruff-week-Transportation-workers-rescue-puppy-stranded-busy-highway.html"}
