{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 21:43:17","date_modify":"2018-10-30 21:43:17","date_publish":"2015-02-19 19:11:52","description":"An AZ state House education committee agreed to ditch Common Core and block AZ's state Board of Education's ability to adopt new standards.","filename":"data/vaneerConsumption/ArizonaHouseEducationCommitteeVotestoDumpCommonCore.json","image_url":"https://media.breitbart.com/media/2015/02/this-weeks-common-core-standards-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_02_19__1540935797.html","title":"Arizona House Education Committee Votes to Dump Common Core","title_page":"Arizona House Education Committee Votes to Dump Common Core | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Several months after Arizona voters elected a state schools superintendent who ran on an anti-Common Core platform, a state House education committee has approved a measure to ditch the Common Core standards and block the state Board of Education’s ability to adopt new standards.\nAs the Associated Press reports, state House Bill 2190, introduced by Rep. Mark Finchem (R), was approved 5-2 along party lines on Wednesday after hours of testimony by both supporters and opponents of the Common Core standards.\nLast year, a similar measure failed in the state legislature, while former Gov. Jan Brewer (R) also vetoed a bill that would limit the state’s ability to adopt any standards mandated by the federal government. As opposition to the Common Core standards increased, Brewer herself issued an executive order that essentially “rebranded” the same controversial standards with a new name – Arizona’s College and Career Ready Standards.\nThe bill approved by the House committee would end the state’s participation in Common Core and establish a committee to study alternative standards for the state. Key to the measure, however, is a provision that bars the state Board of Education from adopting new standards without the approval of the committee and the state legislature.\n“Arizona among other states was promised higher education standards than the previous AIMS standards,” Finchem said. “In fact, we’ve been handed lower standards through federal intervention and through a constitutionally protected state government manner.”\nSupporters of the Common Core standards include the education community, the Chamber of Commerce and Industry, and other business organizations.\n“Spending time and money on this sort of proposal when we have seen that the current standards are working is not wise,” said Garrick Taylor, the Chamber’s lobbyist. “Pulling the plug on standards that have been implemented for four years and that the business community, teachers, and parents believe are working is not the answer.”\n“It’s with great credit I think that the anti-Common Core movement is so powerful because we don’t have the money,” teacher Brad McQueen of Tucson said, however. “We just got Diane Douglas elected, and she’s the only one speaking for us, and she’s being treated like a pariah on the non-elected state Board of Education.”\nAs Breitbart News reported Saturday, a recent flare-up of the divisions between opponents of the Common Core standards and establishment politicians and special interest lobbyists who support the nationalized initiative received much media attention. Douglas recently abruptly fired two Arizona State Board of Education administrators who were reportedly continuing work on the state’s new standardized assessment, known as AzMERIT, which is aligned to the rebranded Common Core standards.\nHowever, Gov. Doug Ducey (R) – who also ran against the Common Core standards during his recent campaign – said Douglas acted illegally. Subsequently, Douglas backed off from the battle, stating she would prefer to work with the governor than waste taxpayer funds on a lawsuit.\n“I do not wish to spend precious tax dollars litigating who is responsible for the various operations or the staff of the Board of Education,” Douglas said, according to ktar.com. “Our focus needs to be on educating children and not disputing poorly written statutes.”\nNevertheless, Douglas’ questioning of where Ducey actually stands on the controversial standards was bolstered by his appointments to his new education subcommittee – individuals who support the Common Core. Douglas additionally charged that, despite stating he was an opponent of Common Core, Ducey “refused to take calls or meetings with me personally since his swearing in.”\nIn his column at the Arizona Daily Star, Tim Steller observed that “Arizona’s ruling class” used the opportunity to make Douglas an “object of mockery.”\n“The basic message coming from Ducey’s camp: That lady is crazy,” writes Steller, and provides these examples:\nLisa Graham Keegan, the architect of Arizona’s school-choice movement and a key Ducey adviser, called her approach “erratic” on KPNX TV in Phoenix. Glenn Hamer, CEO of the Arizona Chamber of Commerce and Industry, told [T]he New York Times her behavior was “bizarre and outrageous and offensive.”\nKeegan, who supported Douglas’ challenger in the superintendent’s race, referred to Douglas as someone who was “promoting a sort of paranoia.” Ducey’s education team, Steller points out, includes not only Keegan, but also Matthew Ladner, an associate of Jeb Bush, and Erik Twist, a top-level administrator at Great Hearts Academies, which operates charter schools.\nSteller – who admits he does not agree with all of Douglas’ concerns about Common Core – nevertheless continues:\nDucey built an impressively broad coalition of supporters to win the Republican nomination. But now the various Republican factions are pressing him to follow through on his commitments to them. Douglas is essentially demanding that Ducey show whether his loyalties really lie with the populist tea-party faction that she came from, or the corporate conservative faction that bankrolled his victory.\n“She was speaking for a lot of Republicans who feel the same way and think he might be gravitating too much toward the corporate side,” David Berman, a senior research fellow at the Morrison Institute at Arizona State University, also told Steller. “I think there’s a little bit of tension there, and it’s surfaced.”\n“There should be little doubt that if Ducey must align with any faction, it will be the corporate faction,” Steller says. “It’s the Michael Bidwill/Goldwater Institute/Paradise Valley faction — the people who think they should have been ruling all along and finally, finally are getting their overdue chance.”\n“It’s no wonder people like Diane Douglas bristle at them: She’s not of that elite,” he concludes. “She’s throwing accusations at the wall and finding a few of them stick. No wonder she’s being mocked.”","url":"https://www.breitbart.com/politics/2015/02/19/arizona-house-education-committee-votes-to-dump-common-core/"}
