{"authors":["Northwest Arkansas Democrat-Gazette"],"date_download":"2018-10-30 17:51:32","date_modify":"2018-10-30 17:51:32","date_publish":"2018-10-30 00:00:00","description":"BENTONVILLE — An Arkansas man is accused of raping a 16-year-old girl.","filename":"data/vaneerConsumption/Arkansasmanaccusedofrapingteengirlwhileshesufferedseizure.json","image_url":"https://media.arkansasonline.com/img/photos/2018/10/30/Screen_Shot_2018-10-30_at_9.37.49_AM_t600.png?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30_arkansas-m_b106ea34605e5d026638efeddfe193eb__page=1_1540921892.html","title":"Arkansas man accused of raping teen girl while she suffered seizure","title_page":"Arkansas man accused of raping teen girl while she suffered seizure","title_rss":"NULL","source_domain":"arkansasonline.com","text":"BENTONVILLE — An Arkansas man is accused of raping a 16-year-old girl.\nColton James Keith, 18, was being held Monday in the Benton County Jail with bail set at $15,000.\nThe Benton County sheriff's office received a report Oct. 12 indicating a 16-year-old girl was raped while having a seizure, according to a probable cause affidavit.\nThe girl was interviewed at the Children's Advocacy Center of Benton County where she explained she suffers from post-traumatic stress disorder and stress triggers seizures, according to court documents.\nThe teen said she went to lie down and tried to tell Keith a seizure was coming on and the next thing she remembered was waking up with Keith on top of her, according to the affidavit.\nThe girl's mother said when her daughter has a seizure it can last up to 30 minutes and she appears to be sleeping.\nThe mother told Keith in a text message what he did was wrong and he raped the girl because she was unconscious and couldn't consent, according to the affidavit. Keith apologized and asked the mother not to press charges and told her she could have someone beat him, according to the affidavit.\nKeith's arraignment is scheduled for Dec. 3 in Circuit Judge Robin Green's court.","url":"https://www.arkansasonline.com/news/2018/oct/30/arkansas-man-accused-raping-teen-girl-while-she-su/?page=1"}
