{"authors":["Arkansasonline Staff","Wire Reports"],"date_download":"2018-10-30 18:36:15","date_modify":"2018-10-30 18:36:15","date_publish":"2017-02-27 00:00:00","description":"LITTLE ROCK — Lawyers for the state of Arkansas are telling a federal court that delaying eight executions beyond April 30 would have the same effect as canceling them altogether.","filename":"data/vaneerConsumption/Arkansassaysithasnosourcefordrugifinmatesdelayexecutionsgovernorreviewingcases.json","image_url":"https://media.arkansasonline.com/img/photos/2017/02/27/Screen_Shot_2017-02-27_at_2.34.13_PM_t600.png?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_apr_03_arkansas-s_b95ed28fb02271119acff9719b61fabf__page=1_1540924575.html","title":"Arkansas says it has no source for drug if inmates delay executions; governor reviewing cases","title_page":"Arkansas says it has no source for drug if inmates delay executions; governor reviewing cases","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Executions have been set for (top row, from left) Kenneth Williams, Jack Jones Jr., Marcel Williams, Bruce Earl Ward, and (bottom row, from left) Don Davis, Stacey Johnson, Jason McGehee and Ledell Lee.\nLITTLE ROCK — Lawyers for the state of Arkansas are telling a federal court that delaying eight executions beyond April 30 would have the same effect as canceling them altogether.\nArkansas recently replaced an outdated potassium chloride supply, but in court papers Monday said it has no source for midazolam after its current stock expires at the end of the month.\nTo meet the deadline, Gov. Asa Hutchinson has scheduled eight executions in an 11-day period beginning April 17. No state has executed that many people in so short a time since the U.S. Supreme Court reauthorized the death penalty in 1976.\nArkansas has not executed a prisoner since 2005 because of legal challenges and drug shortages.\nThe inmates say the state is denying them sufficient time to bring meaningful clemency requests.\nAhead of the scheduled executions, Hutchinson on Monday said he continues to review legal briefs for the inmates.\n“I’m taking those one at a time to make sure that each gets the individual attention that is appropriate,” the governor told reporters.\nHutchinson said it is also important to “balance the conversation,” taking into consideration the victims of the crimes.\nWhen asked whether clemency is still possible for any of the eight death-row inmates, the governor said he will look through recommendations and will make a decision at a later date.\n“These cases have all been through over 10 to 15 years of review in the courts. There’s not really any question of guilt in these cases,” Hutchinson said. “The significance and horrendous nature of the crimes are the reasons that jury gave that penalty.”\nThe inmates — Bruce Ward, Don Davis, Ledell Lee, Marcel Williams, Kenneth Williams, Stacey Johnson, Jack Jones and Jason McGehee — are set to die over a span starting April 17 and ending April 27.\nRead Tuesday's Arkansas Democrat-Gazette for full details.","url":"https://www.arkansasonline.com/news/2017/apr/03/arkansas-says-it-has-no-source-drug-if-inmates-del/?page=1"}
