{"authors":["Hot Springs Sentinel-Record"],"date_download":"2018-10-30 17:51:48","date_modify":"2018-10-30 17:51:48","date_publish":"2018-10-30 00:00:00","description":"The first of two men charged with two counts of first-degree murder in the 2016 deaths of an adult and teen in separate shootings pleaded guilty Monday and was sentenced to 40 years in prison.","filename":"data/vaneerConsumption/Arkansasmanpleadsguiltytofatalshootingsofadultteenin2016.json","image_url":"https://media.arkansasonline.com/img/photos/2018/10/30/Screen_Shot_2018-10-30_at_9.56.17_AM_t600.png?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30_arkansas-m_39f84b49453096e308d97ae0640dccc0__page=1_1540921908.html","title":"Arkansas man pleads guilty to fatal shootings of adult, teen in 2016","title_page":"Arkansas man pleads guilty to fatal shootings of adult, teen in 2016","title_rss":"NULL","source_domain":"arkansasonline.com","text":"The first of two men charged with two counts of first-degree murder in the 2016 deaths of an adult and teen in separate shootings pleaded guilty Monday and was sentenced to 40 years in prison.\nAnthony James Camden, 25, of Hot Springs, who was set to stand trial Thursday in Garland County Circuit Court, pleaded guilty to both murder counts and was sentenced to 40 years in prison on each. He also pleaded guilty to three counts of attempted first-degree murder and one count of first-degree battery and was sentenced to 15 years on each. All sentences will run concurrently.\nCamden's alleged accomplice, Stephon Tyrone Harris, 22, who remains in custody in lieu of $500,000 bond, is set to stand trial on the same charges on Jan. 28, 2019. Camden has agreed to testify against Harris.\nCamden and Harris were each originally charged with first-degree murder in the shooting death of Tyler Donaldson, 23, at 311 Lacey St. on the evening of Sept. 8, 2016. Four other people were struck by gunshots that night, which resulted in the additional charges of attempted murder and first-degree battery.\nThe two were later each charged with a second count of first-degree murder for the death of Colby Wilder, 17, whose body was found the next day in a ditch alongside a driveway in the 4000 block of Spring Street.","url":"https://www.arkansasonline.com/news/2018/oct/30/arkansas-man-pleads-guilty-fatal-shootings-adult-t/?page=1"}
