{"authors":["Brandon Riddle"],"date_download":"2018-10-30 21:19:20","date_modify":"2018-10-30 21:19:20","date_publish":"2017-02-27 00:00:00","description":"The Arkansas Supreme Court on Tuesday granted a request for an emergency stay, keeping confidential information about a drug planned for use in the executions of eight death-row inmates this month.","filename":"data/vaneerConsumption/ArkansasSupremeCourtgrantsemergencystaykeepsexecutiondruginfosecret.json","image_url":"https://media.arkansasonline.com/img/photos/2017/02/27/Screen_Shot_2017-02-27_at_2.34.13_PM_t600.png?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_apr_04__1540934360.html","title":"Arkansas Supreme Court grants emergency stay, keeps execution drug info secret","title_page":"Arkansas Supreme Court grants emergency stay, keeps execution drug info secret","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Executions have been set for (top row, from left) Kenneth Williams, Jack Jones Jr., Marcel Williams, Bruce Earl Ward, and (bottom row, from left) Don Davis, Stacey Johnson, Jason McGehee and Ledell Lee.\nThe Arkansas Supreme Court on Tuesday granted a request for an emergency stay, keeping confidential information about a drug planned for use in the executions of eight death-row inmates this month.\nAttorney General Leslie Rutledge’s office said in a statement that it was pleased with the court’s action to stay a lower court ruling.\n“Arkansas law requires the Department of Correction to keep confidential all information that may lead to the identification of those who test, sell or supply the drug or drugs used in the execution process,” Rutledge spokesman Judd Deere said.\nThe state Department of Correction, represented by Rutledge, had sought an emergency stay after Pulaski County Circuit Judge Wendell Griffen’s order last week telling state officials to hand over records related to 100 vials of potassium chloride.\nLittle Rock attorney Steven Shults, arguing that the department had violated the Arkansas Freedom of Information Act by withholding such information, filed a lawsuit seeking the records.\nRead Wednesday’s Arkansas Democrat-Gazette for full details.","url":"https://www.arkansasonline.com/news/2017/apr/04/arkansas-supreme-court-grants-emergency-stay-sourc/"}
