{"authors":["Arkansas Democrat-Gazette"],"date_download":"2018-10-30 22:22:07","date_modify":"2018-10-30 22:22:07","date_publish":"2018-10-30 02:48:00","description":"The Arkansas Times will become a glossy monthly magazine next year, shifting from the weekly newspaper format it has published since 1992.","filename":"data/vaneerConsumption/ArkansasTimestoshiftfromweeklynewspapertomonthlymagazine.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30_arkansas-t_b4962fad7be9daad13094c733749a8dc__page=1_1540938127.html","title":"Arkansas Times to shift from weekly newspaper to monthly magazine","title_page":"Arkansas Times to shift from weekly newspaper to monthly magazine","title_rss":"NULL","source_domain":"arkansasonline.com","text":"The Arkansas Times will become a glossy monthly magazine next year, shifting from the weekly newspaper format it has published since 1992.\nThe first magazine is slated to be published on Jan. 31, followed by a relaunch of the publication's website, arktimes.com, in February. The weekly newspaper will be published through the end of this year.\nAlan Leveritt, Times publisher and founder, noted in a statement that the Little Rock-based publication began as a glossy magazine in 1974 and became a weekly newspaper in 1992.\n\"When the Times went weekly in 1992, the internet didn't exist. At the time, the increase in frequency enabled us to better report news as well as cover upcoming cultural events,\" Leveritt said, noting the website now allows for immediate publishing.\nThe magazine will be distributed for free at locations in central Arkansas and Hot Springs.\nLindsey Millar, editor of the Times, said humor will be a \"chief value\" of the new magazine.\n“We’ll be pretty, but with a bit of grit,\" he said in the statement. \"News and politics will remain our primary focus online, but in print those will get equal footing with culture, food, travel and world-class feature writing.”","url":"https://www.arkansasonline.com/news/2018/oct/30/arkansas-times-shift-weekly-newspaper-monthly-maga/?page=1"}
