{"authors":[],"date_download":"2018-10-22 22:22:46","date_modify":"2018-10-22 22:22:46","date_publish":"2014-05-09 11:13:45","description":"Ruling is second in a southern state to strike down law prohibiting same-sex marriage as unconstitutional.","filename":"data/vaneerConsumption/ArkansasJudgeStrikesDownBanonSameSexMarriage.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/433366/140509-chris-piazza-judge-1842_e38004b7f9e66117ed7464e9f752edf9.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_arkansas-judge-strikes-down-ban-same-sex-marriage-n101161_1540246966.html","title":"Arkansas Judge Strikes Down Ban on Same-Sex Marriage","title_page":"Arkansas Judge Strikes Down Ban on Same-Sex Marriage","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAn Arkansas judge on Friday declared the state's ban on same-sex marriage unconstitutional, the second such ruling in the South.\nThough certain to be appealed, Friday's decision is a victory for 21 gay and lesbian couples who challenged an Arkansas constitutional amendment, adopted by 75 percent of voters in 2004, stating that \"marriage consists only of the union of one man and one woman.\"\nReferring to the US Supreme Court's decision in Loving v Virginia, the 1967 ruling that invalidated bans on inter-racial marriage, Pulaski County Circuit Court Judge Chris Piazza said, \"It has been over forty years since Mildred Loving was given the right to marry the person of her choice. The hatred and fears have long since vanished and she and her husband lived full lives together; so it will be for the same-sex couples.\n\"It is time to let that beacon of freedom shine brighter on all our brothers and sisters. We will be stronger for it,\" he wrote.\nFour years ago, Judge Piazza ruled that a state ban on adoptions by unmarried couples violated a right to privacy, a ruling that was affirmed by the Arkansas Supreme Court.\nThe state's Democratic attorney general, Dustin McDaniel, has said he will continue to defend the marriage provision in court even though he believes same-sex couples should be allowed to marry.\n\"I do support marriage equality, and I do believe Arkansans should have the right to be equal in the eyes of the law,\" he said last week at a meeting of editors organized by the Associated Press.\nIn February a federal judge struck down a gay marriage ban in Virginia, the first ruling of its kind in the South. The same month, a federal judge in Kentucky ordered that state to recognize same-sex marriages legally performed elsewhere. In March, a federal judge in Tennessee ordered the state to recognize the marriages of three same-sex couples who were married out of state. All those rulings are on hold while they're appealed.\nJudges in Michigan, Ohio, Oklahoma, Texas, and Utah have also declared all or part of state bans unconstitutional. Those rulings are on appeal as well.\nA total of 17 states now permit same-sex marriage, while 33 ban it – 29 of them, including Arkansas, by constitutional amendment. Lawsuits challenging the bans are pending in all but four of the 33 states – Alaska, Montana, and North and South Dakota.","url":"https://www.nbcnews.com/news/us-news/arkansas-judge-strikes-down-ban-same-sex-marriage-n101161"}
