{"authors":["Sarah D. Wire"],"date_download":"2018-10-30 18:07:04","date_modify":"2018-10-30 18:07:04","date_publish":"2014-10-20 00:00:00","description":"WASHINGTON -- People often ask if D.C. Washington is using a stage name when he performs in Washington, D.C., but that makes the McGehee native laugh.","filename":"data/vaneerConsumption/Arkansanisaregularsingingthenationalanthem.json","image_url":"https://media.arkansasonline.com/img/photos/2014/10/20/resized_99265-dc-washington-1_6-18912_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2014_oct_20__1540922824.html","title":"Arkansan is a regular singing the national anthem","title_page":"Arkansan is a regular singing the national anthem","title_rss":"NULL","source_domain":"arkansasonline.com","text":"WASHINGTON -- People often ask if D.C. Washington is using a stage name when he performs in Washington, D.C., but that makes the McGehee native laugh.\n\"That's what my mama called me and so that's what everybody else gets to call me,\" he said. \"When people hear my name they always think I grew up in D.C. I tell them, no, I'm from Arkansas and darn proud of it.\"\nOver the last decade, Dwight Clyde Washington, 59, has become a familiar face at Washington Redskins football games and Washington Nationals baseball games for his version of the national anthem. Washington is a defense contractor by day and lives in Woodbridge, Va.\nMedia outlets such as National Public Radio and The Washington Post have recorded interviews with him, and YouTube videos of him performing have been viewed thousands of times.\nBefore Sunday's game between the Redskins and the Tennessee Titans, Washington joked with the men carrying the microphone and other equipment as he waited for the team to charge onto the field amid cheers and fireworks.\n\"I don't know the players. I tend to stay away from the players because I'm there to sing the anthem; I'm not there to bother anybody,\" he said. \"It's a big honor. I'm a volunteer but I feel part of the organization.\"\nWashington said being in front of such a large crowd does not faze him. \"I see maybe 20 people and that's about it. The rest of them don't matter,\" he said.\nWith scantily clad cheerleaders behind him, video cameras feet away and a line of top-tier athletes with their hands upon their hearts, Washington belted out the familiar words as the crowd of thousands cheered and sang along.\nThe audio pumped from the field to the entire stadium bounces back to his ears a second or two after he sings, but Washington said that no longer bothers him.\n\"The first time I did it about eight or nine years ago, it was a little dissettling, but it's OK now. You just keep singing, forget about what's going on out there and just keep going,\" he said.\nHe compared it to being at church. The tenor also performs with the church choir at Immanuel Bible Church in Springfield, Va.\nThe team doesn't pay him to sing, but he gets tickets to stay and watch the game, he said. On Sunday, he couldn't stay to see who won (the Redskins did, 19-17) because he had to rush across the capital city to the Washington National Cathedral for a concert with the Cathedral Choral Society.\nThe 140 purple-robed singers, accompanied by an orchestra, soothed a decidedly calmer crowd with an afternoon concert in the cavernous cathedral, performing music by Franz Shubert, Robert Schumann and Johannes Brahms.\nSeveral concert attendees said they have heard Washington perform the national anthem at stadiums before.\nWashington started singing the national anthem for the Redskins about nine years ago after giving an audition CD to a friend in his church who works for the team.\nWhen the Nationals came to town in 2005, he started performing for them as well. He said he sings the anthem at a baseball game about once a month and for the Redskins once a year.\n\"Ask any of my friends who follow my Facebook page. I don't do a lot on Facebook except talk about the Nationals,\" Washington said.\nHe said he is still amazed by performing for the Redskins at FedEx Field and for the Nationals at Nationals Park and Robert F. Kennedy Memorial Stadium, where both teams have previously played.\n\"I'm a boy from the Delta in Arkansas. The notion that you can stand out at FedEx Field, or RFK or Nats Park and do something like sing the national anthem for a major league team, that's pretty fun. I don't take myself too seriously, though; I'm still a country boy from Arkansas and darn proud of it, too,\" Washington said.\nWashington grew up in McGehee and earned a bachelor's degree in music education from the University of Central Arkansas in Conway, where he met his wife.\nWashington said 22 years in the Army took him to the nation's capital. While in the Army he lived in Texas, Greece, Saudi Arabia, Turkey and Indiana before going to the Washington area.\nHe retired as a lieutenant colonel in 2000. He said his church inspired him to stay on the East Coast.\n\"I came here kicking and screaming because I never wanted to come to this area, but when we retired it was just a no-brainer to stay because my church is a great church. We enjoy being there and enjoy serving there and the people there. It's like family,\" he said.\nWashington is still connected to Arkansas, even though he doesn't get home as often as he'd like. His sister lives in Fayetteville and his brother lives in Little Rock. His son, Andrew Washington, is a senior at the University of Arkansas, studying criminology.\n\"I'm glad I grew up there; I'm glad I grew up in McGehee. It's a very small town but it's a small town with great values, and Arkansas has some great values,\" he said.\nWashington said that while he doesn't have a list of places he wants to sing, one day it would be nice to sing the national anthem at a Razorback game.\n\"That would be fun. My son's tried to get me all the way down there, but to fly all that way for just a game is a lot,\" Washington said.\nHis other two children have stayed on the East Coast. Washington said watching Dad sing at games isn't the thrill it was at first.\n\"The very first time we were here, they were excited about it. Now they see it as routine; I do it so often, no big deal,\" he said.\nMetro on 10/20/2014","url":"https://www.arkansasonline.com/news/2014/oct/20/arkansan-is-a-regular-singing-the-natio/"}
