{"authors":["John Moritz"],"date_download":"2018-10-30 14:14:58","date_modify":"2018-10-30 14:14:58","date_publish":"2018-10-30 04:30:00","description":"The Arkansas Family Council released a letter Monday signed by former Gov. Mike Huckabee, the Rev. Ronnie Floyd of Springdale and more than 100 other church and local leaders opposed to Issue 4, a proposed ballot measure to expand casino gambling.","filename":"data/vaneerConsumption/Arkansascasinobidopposedbyfaithgroup.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30_casino-bid-opposed-by-faith-group-20181-1__page=1_1540908898.html","title":"Arkansas casino bid opposed by faith group","title_page":"Arkansas casino bid opposed by faith group","title_rss":"NULL","source_domain":"arkansasonline.com","text":"The Arkansas Family Council released a letter Monday signed by former Gov. Mike Huckabee, the Rev. Ronnie Floyd of Springdale and more than 100 other church and local leaders opposed to Issue 4, a proposed ballot measure to expand casino gambling.\nThe letter included signatories from each of the four counties that could see increased gambling operations under Issue 4: Crittenden, Garland, Pope and Jefferson. Huckabee now lives in Florida.\n\"Casino gambling is tied to crime, bankruptcy, domestic violence, divorce, and suicide,\" the letter states. \"Countless children have gone hungry and been neglected, living in poverty, because of a parent's gambling addiction.\"\nState Rep. Vivian Flowers, D-Pine Bluff, also joined the faith leaders in calling for an electoral defeat of the measure. She questioned its touted economic benefits, which she said were subject to a \"crash after the boom.\"\nThe letter also included signatures from state Rep. Mike Holcomb, R-Pine Bluff; former state Rep. Donnie Copeland, R-North Little Rock, and William \"Dubs\" Byers, a pastor and member of the state Board of Corrections.\nIf passed by voters on Nov. 6, Issue 4 -- a proposed constitutional amendment -- would allow the state to issue as many as four casino licenses. Two are earmarked to expand gambling operations at the Oaklawn and Southland racetracks in Hot Springs and West Memphis, respectively, while the other two licenses would go to build new casinos in Jefferson and Pope counties.\nA University of Arkansas at Little Rock study funded by Driving Arkansas Forward, a committee supporting the measure, estimated that the economic impact of Issue 4 could be as many as 6,000 new jobs and $39 million more a year in local and state government revenue. The study has been cited in television ads encouraging voters to support the measure.\nIn response to the Family Council's news conference, Driving Arkansas Forward issued a statement again pointing to the casinos' purported economic benefits, which the group said are now going to casinos in Mississippi and Oklahoma.\nThe group also provided the testimony of West Memphis Police Chief Donald Oakes, who rebutted the claims that gambling was tied to increases in crime.\n\"The [Southland] casino does just the opposite for us because it brings in jobs,\" Oakes said. \"It allows the families to support themselves.\"\nOakes added that in 26 years on the police force, he has never responded to a suicide that he believed was a result of gambling at Southland.\nBackers of the amendment also won two crucial Arkansas Supreme Court decision in lawsuits challenging Issue 4's qualifications for the ballot. The decisions ensured that voters statewide would get to decide the issue in November.\n\"This is certainly still an uphill [fight] for our side,\" Family Council President Jerry Cox said.\nA ballot committee set up by the Family Council earlier this year to oppose Issue 4 reported no finances earlier this month. However, the Family Council's connections among the state's churches have proved influential in elections.\nLarry Page, the executive director of the Arkansas Faith and Ethics Council, a separate faith-based organization, said church leaders would be key in building grassroots opposition to the measure.\n\"If we don't hold our base and bring it to the polls in a comprehensive way, we're really hurting,\" Paige said. \"The other side ... they're going to vastly outspend anything we can do.\"\nIn its most recent campaign finance report, Driving Arkansas Forward reported having raised and spent more than $4 million to support Issue 4. The It's Our Turn Committee, another group backing Issue 4, reported raising $50,000 from Delaware North, the owners of Southland Racing and Gaming.\nA group opposing Issue 4, Citizens for A Better Pope County, reported raising a smaller sum, $16,755, and spending $5,752.\nMetro on 10/30/2018","url":"https://www.arkansasonline.com/news/2018/oct/30/casino-bid-opposed-by-faith-group-20181-1/?page=1"}
