{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 19:36:15","date_modify":"2018-10-30 19:36:15","date_publish":"2015-12-18 02:37:46","description":"Movie theaters across the country are bracing for large holiday crowds this weekend by adding additional security measures — including armed guards and metal detection checks — as \"Star Wars: The Force Awakens\" rolls out on more than 4,000 screens nationwide amidst lingering fears of terror attacks.","filename":"data/vaneerConsumption/ArmedGuardsAddedforStarWarsScreeningsAfterTerrorWarning.json","image_url":"https://media.breitbart.com/media/2015/12/Star-Wars-Darth-Vader-Stormtroopers-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_12_17__1540928175.html","title":"Armed Guards Added for 'Star Wars' Screenings After Terror Warning","title_page":"Theaters on Alert: Armed Guards Added for 'Star Wars' Screenings After Terror Warning","title_rss":"NULL","source_domain":"breitbart.com","text":"Movie theaters across the country are bracing for large holiday crowds this weekend by adding additional security measures — including armed guards and metal detection checks — as Star Wars: The Force Awakens rolls out on more than 4,000 screens nationwide.\nAccording to Deadline, movie exhibitors are on high alert following two suspicious incidents at theaters in California and Arizona in recent days. Those incidents, coupled with renewed fears in the wake of high-profile terror attacks in San Bernardino, California, and Paris, France, in recent weeks, has caused theaters across the country to increase security measures through the holidays.\n“We’ve hired security at every location to be safe,” an exhibitor who wished to remain anonymous told Deadline. “We will have five (guards) posted and reserve the right to check (customers’) bags. We will not let anyone walk in with a backpack or anything larger than a purse, and whatever they are carrying will be checked.”\nThe National Association of Theatre Owners (NATO) reportedly issued an advisory Thursday to major movie exhibitors warning them of two suspicious incidents that recently occurred at theaters in Arizona and California.\nIn an incident Wednesday night, two men in their 20s who were “Middle Eastern in appearance” and “spoke with a heavy foreign accent” entered a theater inside a mall in Tempe, Arizona, without tickets, and one of the men began recording video of the theater with his cellphone “in one slow swooping motion,” according to documentation of the incident obtained by Deadline. When asked what they were doing by theater security, the men replied they had “just wanted to see the restaurant,” pointing to the concession stand, and then exited the theater to a patio, where both men made phone calls.\nIn a separate incident last week, a man reportedly drove up to a theater in Southern California and began asking suspicious questions including, “When are the most people here?” and “How crowded is it going to be this weekend?” before driving off in a car with no license plates. A second man reportedly drove up to the theater and asked similar questions, before again driving off in a car with no plates.\nA theater security expert and NATO declined to name the specific theaters.\nSome of the nation’s largest theater chains announced this week that fake “blasters” or gun-shaped toys would not be allowed in theaters, along with masks and face paint.\n“In short, bring your lightsaber, turn it off during the movie, and leave the blaster and Darth Vader mask at home,” AMC Theaters said in a statement.\nMost theaters are expecting record crowds this weekend for the rollout of the new Star Wars film. The Force Awakens has already broken Fandango’s record for most tickets sold for any film’s entire theatrical run in the ticketing site’s history, an absurdly impressive feat considering the film had not yet opened when it broke the record.","url":"https://www.breitbart.com/entertainment/2015/12/17/theaters-alert-armed-guards-added-star-wars-screenings-terror-warning/"}
