{"authors":["Allan Hall For Mailonline"],"date_download":"2018-10-23 00:59:23","date_modify":"2018-10-23 00:59:23","date_publish":"2017-03-16 10:44:12","description":"The standoff is taking place at the Sparkasse bank in the old industrial city of Duisburg, near to the Dutch border.","filename":"data/vaneerConsumption/ArmedrobbertakestwohostagesatGermanbank.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E53882800000578-0-image-a-5_1489661023182.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319612_Armed-robber-takes-two-hostages-German-bank_1540256363.html","title":"Armed robber takes two hostages at German bank","title_page":"Armed robber takes two hostages at German bank | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Police have stormed a bank in Germany and freed a chained-up hostage after an armed robbery this morning.\nThe male employee had been held captive for more than three hours, but police say the gunman who was holding him had vanished.\nA female employee of the bank was earlier freed shortly after 11am after being held hostage.\nPolice officers surrounded the bank after an armed robber took two staff members hostage this morning\nUnits of elite SEK police commandos are at the scene in Dorfstrasse, in the city's Rumeln district\nA gunman who held up the bank in the old industrial city of Duisburg on this morning was believed to still be inside when the building was raided.\nAfter police stormed the bank and freed the hostage there was no sign of the robber.\nEarlier police had arrested two men drinking coffee in a bakery cafe near the bank. It is understood they are linked to the robbery attempt.\nNoises were heard from within the vault before the bank opened for business at 9am, indicating that the armed robber had been on the premises all night\nArmed police were called to the scene this morning after staff were held up by a gunman\nBut it is a mystery how one woman was released from inside the bank when no gunman was discovered. Whether he escaped undetected by the police is unclear.\nThe standoff took place at the Sparkasse bank where units of elite SEK police commandos ringed the building at the scene in Dorfstrasse, in the city's Rumeln district.\n'A woman has been freed, a man remains a hostage inside,' said a police spokesman after the woman walked free.\nA police helicopter was deployed and streets around the bank cordoned off when heavily armed police moved in.\nOne report said that staff heard noises from within the vault before the bank opened for business at 9am, indicating that the armed robber had been on the premises all night.","url":"https://www.dailymail.co.uk/news/article-4319612/Armed-robber-takes-two-hostages-German-bank.html"}
