{"authors":[],"date_download":"2018-10-30 01:26:24","date_modify":"2018-10-30 01:26:24","date_publish":"2015-10-13 08:00:00","description":null,"filename":"data/vaneerConsumption/ArmedEPAAgentsTheTruthIsWayOutThere.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/10/Mulder.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862784.html","title":"Armed EPA Agents? The Truth Is Way Out There","title_page":"Armed EPA Agents? The Truth Is Way Out ThereThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Fox Mulder and Dana Scully, the FBI agents on Fox’s The X-Files, have been known to draw weapons on aliens, poltergeists, and phantoms. But they have an excuse — they’re fictional characters in a network TV drama, coming back on-the-air soon after a long hiatus. Not so the Environmental Protection Agency’s (EPAs) own, real-life agents. They are packing pistols and even heavier firepower to catch the nation’s contributors to global warming and other, mythical phenomena. Truth is stranger than science fiction in today’s Washington, D.C., and the truth is way out there.\nAccording to a report released last week by a watchdog group called Open the Books, the EPA has spent millions of dollars recently on guns, ammo, body armor, camouflage equipment, and even night-vision goggles to arm its agents in the war on polluters.\nThe Illinois-based investigative group examined thousands of checks totaling more than $93 billion from 2000 to 2014 by the EPA, and its auditors indicate that about $75 million is authorized each year for “criminal enforcement” of America’s clean air and water laws. This includes cash for a cadre of 200 “special agents” that engage in SWAT-style ops.\n“We were shocked ourselves to find these kinds of pervasive expenditures at an agency that is supposed to be involved in clean air and clean water,” said Open the Books’ founder, Adam Andrzejewski, a former candidate for governor of Illinois. “Some of these weapons are for full-scale military operations.”\nSome of these military operations have been reported in the media. Two years ago, the EPA was involved in an armed raid at a small town in Alaska where miners were accused of polluting local waters, as Fox News reported that EPA “armed agents in full body armor participated.”\nThe EPA’s own website describes the activities and mission of the criminal enforcement division as “investigating cases, collecting evidence, conducting forensic analyses and providing legal guidance to assist in the prosecution of criminal conduct that threatens people’s health and the environment.”\nDon’t blame President Obama for this alone. The EPA was first given police powers in 1988 during the Reagan era. These days, EPA also conducts joint projects with the Department of Homeland Security as it engages in what a media report calls “environmental crime-fighting.”\n“For more than 30 years,” according to the EPA website, “there has been broad, bipartisan agreement about the importance of an armed, fully-equipped team of EPA agents working with state and federal partners to uphold the law and protect Americans.”\nBut that’s not all that the Open the Books investigators found. Backing up these armed environmental crusaders are scores of highly paid lawyers and other professionals.\nThe report showed that seven of 10 EPA workers earn more than $100,000 a year, and EPA’s $8 billion budget also finances the salaries of 1,000 attorneys, making the agency one of the biggest law firms in the U.S.\nThe EPA is hardly going solo in this armed adventure against America, however. The agency has collaborated with the U.S. Department of Homeland Security, and a recent report by the U.S. Department of Justice indicates that more than 40 federal agencies, with 100,000 officers, carry guns and make arrests.\nHow far will EPA agents go to enforce the law as they interpret it? The Sixth Circuit Court of Appeals on Friday issued a temporary stay on the Environmental Protection Agency’s new Clean Water Rule that regulates “waters of the U.S.” The court decided the EPA’’s Rule that originally became effective on August 28, 2015 requires “further judicial analysis.” The new Clean Water Rule defined navigable waters to include tributaries and wetlands, and even puddles caused by rainstorms. The rule defines which waterways would be protected by the Clean Water Act of 1972. A total of 18 states are challenging the new rule. Perhaps the new water rules will be enforced at gunpoint by armed agents if President Obama and EPA Administrator Gina McCarthy decide that “environmental justice” requires it.","url":"https://spectator.org/64333_armed-epa-agents-truth-way-out-there/"}
