{"authors":["Katie French","Abe Hawken For Mailonline"],"date_download":"2018-10-23 04:16:23","date_modify":"2018-10-23 04:16:23","date_publish":"2017-03-10 14:24:53","description":"This is the moment a 40-year-old man was arrested by armed police after he allegedly held a 48-year-old woman hostage inside his flat during a 10 hour stand-off in New Parks, Leicester.","filename":"data/vaneerConsumption/ArmedpolicesurroundLeicesterflatduetoarmedman.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/18/3E247AF700000578-0-image-a-17_1489171894384.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301424_Armed-police-surround-Leicester-flat-armed-man_1540268183.html","title":"Armed police surround Leicester flat due to 'armed' man","title_page":"Armed police surround Leicester flat due to 'armed' man | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the moment a man was arrested by armed police after he allegedly held a 48-year-old woman hostage inside his flat during a 10 hour stand-off.\nThe man, 40, was believed to have a shotgun on him and barricaded himself inside the property on Friday morning.\nArmed police were locked in a dramatic stand-off and emergency services were on the scene in New Parks, Leicester, since 7am after receiving a concerned call.\nOfficers with guns and wearing gas masks were seen combing the area while a police helicopter circled above.\nScroll down for video\nThe 40-year-old man was arrested following the 10 hour stand-off in Leicester on Friday\nArmed police arrived at the scene after the force received a concerned phone call at 7am\nSpecialist officers wearing gas masks (left and right) attended the scene and had automatic guns\nLeicestershire Police said a 40-year-old man had been arrested on suspicion of firearms offences.\nThe woman who was found inside the flat was unharmed and is now helping officers with their enquiries as a witness.\nThe situation was eventually resolved after trained negotiators talked to the homeowner.\nA force spokesperson said: 'We regret the inconvenience that this incident has undoubtedly caused local people, but I am extremely grateful for their patience and understanding.\n'Public safety, and that of our officers, has been of paramount importance throughout this 10 hour operation and I am pleased that it has been resolved peacefully.'\nReports indicated that the man had barricaded himself inside a flat in New Parks, Leicester\nPolice were locked in a stand off-with a man who was believed to be armed on Friday morning\nEmergency services rushed to the scene in Leicester after police received a phone call\nNeighbours suggested the occupant had a shotgun and refused to leave the flat for several hours.\nPaul Norman, 52, said: 'There is a bloke in the flat next door with a shotgun. He has been there for two hours.\n'He won't come out of the house.\n'The road is all taped off. Police are everywhere.\n'I had to go out this morning but police told me to go back in the house.'\nResidents were told not to leave their homes during the siege\nAnother resident Teigan-Gabrielle Jane, 18, added: 'I heard a dog barking this morning and I went outside and it was a police sniffer dog.\n'Then my dad's friend rang us and asked how come there were police everywhere.\n'When my dad went outside to put the bin out the police told him he wasn't allowed to leave the house.\n'I was meant to be at work at 10am but they only let me out at 10.45am.\n'We were just stuck in there and there were two police with big guns in our back garden. I've been a bit on edge.\n'I'm told there's someone inside with a shotgun and the police can't go in in case they get shot.'\nLocal resident Catherine White, 97, said she was 'frightened to death'.\nShe added: 'I noticed when I went to the shop earlier that something was going on but I didn't know what it was.\n'It seems to have got worse. Why would someone have a gun?\n'I hope he doesn't come around here.\n'It's bad enough living down this road, there's always carry-on. I'm frightened to death.'\nTina James, 54, added: 'I just came to use the Post Office and I saw the police everywhere.\n'This sort of thing happens quite a lot lately, it's getting regular and it does make me very anxious and nervous sometimes.'\nResidents said they were terrified due to the incident which went on for around 10 hours\nKeith Woolley, 71, was visiting his 91-year-old mother who lives in a bungalow near to the scene of the incident.\nHe said: 'Things like this happen all the while, it's everywhere.\n'If it's not a siege it's stabbings.\n'My mam lives here in the bungalow and said it was happening at 7am this morning, they had blocked off the road.\n'I don't think it bothers her anymore when this happens.'","url":"https://www.dailymail.co.uk/news/article-4301424/Armed-police-surround-Leicester-flat-armed-man.html"}
