{"authors":["Lana Shadwick"],"date_download":"2018-10-30 19:43:20","date_modify":"2018-10-30 19:43:20","date_publish":"2016-08-10 13:29:06","description":"Texas gun rights activists are converging on the Waller County, Texas, courthouse to protest what they are calling the \"tyrannical\" actions of the district attorney there.","filename":"data/vaneerConsumption/ArmedProtestPlannedAfterTexasCountyTargetsOpenCarryActivist.json","image_url":"https://media.breitbart.com/media/2016/07/Screen-Shot-2016-07-19-at-12.28.24-PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_08_10__1540928600.html","title":"Armed Protest Planned After Texas County Targets Open Carry Activist","title_page":"Armed Protest Planned After Texas County Targets Open Carry Activist","title_rss":"NULL","source_domain":"breitbart.com","text":"HOUSTON, Texas — Texas gun rights activists are converging on the Waller County, Texas, courthouse to protest what they are calling the “tyrannical” actions of the district attorney there. The D.A. sued the founder of Texas Carry, a gun rights organization that sent notices to 76 government entities complaining that officials are violating the law by excluding licensed to carry (LTC) holders. The Second Amendment activists will be engaging in an “open carry protest.”\nThe Waller County lawsuit seeks a judicial declaration that the Waller County courthouse is legally off-limits to LTC holders who are carrying. Gun rights activists say they will be open-carrying at the courthouse in Hempstead on Friday, August 12th for the protest.\nWaller County D.A. Elton Mathis told Breitbart Texas, “Waller County welcomes peaceful protests and individuals exercising their First and Second Amendment rights.”\nOpen Carry Texas founder C.J. Grisham says, “The actions by District Attorney Elton Mathis must not go unchallenged. He needs to understand that the people will not stand for his bullying and abuse of government against a citizen of this state. His bold action, if not challenged, could send ripples through the state and encourage even more such attempts by anti-gun officials intent on silencing the voices of gun owners defending our right to keep and bear arms.”\nThe lawsuit filed by the Waller County D.A. states that the issue is whether signs posted at courthouses citing Texas Penal Code § 46.03(a)(3) (which prohibits an individual from entering a courthouse carrying a prohibited weapon or firearm), violates section 411.209 of the Government Code. The petition states that a related question is whether this Penal Code section “prohibits an individual from carrying firearms and other weapons throughout the entire building in which a court or court office is located or only in an actual courtroom or court office.”\nAs reported by Breitbart Texas, Terry Holcomb, Sr., founder and executive director of Texas Carry, was sued by Waller County on July 6th.\n“What we have before us is a local government that has decided it will use fear and bully tactics to try and teach the citizens a lesson. This is a baseless suit without merit, and Waller County is trying to intimidate the people by bringing this ridiculous suit,” he told Breitbart Texas. Holcomb lives in San Jacinto County, Texas.\nThe Texas Carry founder said at the time, “in the filing, Waller County is complaining that Mr. Holcomb simply notified them that he believed they were in violation of Government Code 411.209 due to the posting of signs that notified an LTC holder that they were committing a felony by entering the Waller County Courthouse.” He added, “This is an unprecedented move by a local government since the law calls for them to address the complaint with the Texas Attorney General.”\nIn a statement obtained by Breitbart Texas from the organizer of the protest, Open Carry Texas President C.J. Grisham said, “Unfortunately, Waller County doesn’t want to play by the rules. Not only are they refusing to remove their illegal signs or work with the AG to come to a legal resolution, but they’ve decided to take the unprecedented step of suing citizens who dare to file their grievances as set forth in the law.”\nGrisham exclaims, “They aren’t just suing us, but seeking over $100,000 in damages at the same time!! These are the kinds of tyrannical policies we expect from King George III or Santa Anna, not a government entity in the Lone Star State.” Waller County District Attorney Mathis told Breitbart Texas, “Despite the misinformation being put in the media,we are not suing Terry Holcomb for $100,000.”\nD.A. Mathis added, “Holcomb claims we are violating his Second Amendment rights and we voluntarily took that matter to court to be decided, where it should be. All Texans should welcome this resolution. Firearms should not be allowed in Texas courthouses except when specifically allowed by law.”\nMathis says that the Texas legislature has not approved “the sweeping interpretation of the law as advanced by Terry Holcomb.” He said, “Until we are told otherwise by a judge or a court of appeals, we will continue to enforce the laws of Texas in a common sense manner that best protects the people of this great state.”\nGrisham told Breitbart Texas that “Open Carry Texas and Texas Carry have led the way in aggressively filing complaints against these cities, counties, boards, commissions and other government agencies that have posted these illegal signs. We have had many of these signs successfully removed and the AG has provided notice for many more.”\nSection 411.209 prohibits state agencies and political subdivisions from wrongfully excluding handgun license holders from property owned or leased by the government. The law prohibits a governmental entity from providing notice by a communication described in Texas Penal Code § 30.06, or by any sign expressly referring to that law or to a concealed handgun license, that a license holder carrying a handgun is prohibited from entering or remaining on a premises or other place owned or leased by the governmental entity unless the license holder is prohibited from carrying a handgun on the premises or other place by Texas Penal Code §§ 46.03 or 46.035. A state agency or political subdivision is liable for civil penalties, fees, and costs if it has been found to be in violation of this law.\nBreitbart Texas reported in April 2016 that the Texas Attorney General was taking actions against local governments who were illegally or improperly posting signs prohibiting licensed Texans from carrying handguns. The article details the process in which a citizen can notify a local government and give them three days to remove an improper or illegal 30.06 sign.\nDuring the 2015 session of the Texas Legislature, Senate Bill 273 was passed to provide private citizens a pathway to file complaints against city and county governments that unlawfully place 30.06 signs and interfere with the rights of licensed Texans to carry.\nLana Shadwick is a contributing writer and legal analyst for Breitbart Texas. She has served as a prosecutor and associate judge in Texas. Follow her on Twitter @LanaShadwick2.","url":"https://www.breitbart.com/border/2016/08/10/open-carry-protest-planned-government-targeting-texas-advocate/"}
