{"authors":["Ildefonso Ortiz","Brandon Darby"],"date_download":"2018-10-30 17:50:30","date_modify":"2018-10-30 17:50:30","date_publish":"2018-10-30 16:58:02","description":"Mexican authorities arrested two Hondurans who allegedly shot at federal police officers escorting the migrant caravan across Chiapas.","filename":"data/vaneerConsumption/ArmedMigrantsinCaravanOpenedFireonMexicanCopsSayAuthorities.json","image_url":"https://media.breitbart.com/media/2018/10/d9fd3d_central-american-migrant-caravan-53832-central-american-migrants-try.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2018_10_30__1540921830.html","title":"Armed Migrants in Caravan Opened Fire on Mexican Cops, Say Authorities","title_page":"Armed Migrants in Caravan Opened Fire on Mexican Cops, Say Authorities","title_rss":"NULL","source_domain":"breitbart.com","text":"Mexican authorities arrested two Hondurans who allegedly shot at federal police officers escorting the migrant caravan across the southern state of Chiapas. The attack follows shortly after government warnings about Molotov cocktail attacks around a second caravan near the border with Guatemala.\nThe attack took place near Ignacio Zaragoza, Chiapas, when members of Mexico’s Federal Police were escorting the migrant caravan as part of “Operativo Caminante” or “Operation Walker” across the southern border state. According to Mexico’s Interior Secretariat, two men identified only as 22-year-old “Jerson” and 17-year-old “Carlos” spotted the group of police officers guarding the caravan and began firing at them.\nThe attackers’ pistol jammed, allowing police officers to arrest them without any injuries. Federal authorities seized a .380 caliber Glock with nine rounds still in the magazine.\nThe attack came soon after Mexican authorities issued a warning about migrants in Guatemala who were preparing Molotov cocktails and acquiring firearms to use against police officers in their attempts to break through the border to Mexico. Over the weekend, several clashes occurred where migrants threw rocks and used various makeshift weapons against border security forces.\nIldefonso Ortiz is an award-winning journalist with Breitbart Texas. He co-founded the Cartel Chronicles project with Brandon Darby and Stephen K. Bannon. You can follow him on Twitter and on Facebook . He can be contacted at Iortiz@breitbart.com .\nBrandon Darby is the managing director and editor-in-chief of Breitbart Texas. He co-founded the Cartel Chronicles project with Ildefonso Ortiz and Stephen K. Bannon. Follow him on Twitter and Facebook . He can be contacted at bdarby@breitbart.com .\nTony Aranda and “J.M. Martinez” from the Cartel Chronicles project contributed to this report.","url":"https://www.breitbart.com/border/2018/10/30/armed-migrants-in-caravan-opened-fire-on-mexican-cops-say-authorities/"}
