{"authors":["Associated Press","Jordan Gass-Poore For Dailymail.Com"],"date_download":"2018-10-22 23:25:52","date_modify":"2018-10-22 23:25:52","date_publish":"2017-03-16 06:49:16","description":"US Army soldiers trained at the first jungle school the military branch has established in decades, designed to train for exercises and potential combat in Asia and the Pacific.","filename":"data/vaneerConsumption/ArmytrainssoldiersforjunglewarfareinHawaii.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/17/04/3E5A1A6700000578-0-image-a-32_1489725943323.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319028_US-soldiers-train-jungle-warfare-Hawaii-rainforest_1540250752.html","title":"Army trains soldiers for jungle warfare in Hawaii","title_page":"Army trains soldiers for jungle warfare in Hawaii | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US Army soldiers trained at the first jungle school the military branch has established in decades, designed to train for exercises and potential combat on terrain that looks more like the Pacific than arid Afghanistan and Middle East deserts.\nThe Army set up the school as its footprint was shrinking in Iraq and Afghanistan after more than a decade of war there, said Brigadier General Stephen Michael, deputy commander of the 25th Infantry Division.\n'The jungle school gives us that focus, it reinforces that we're in the Pacific,' said Michael. 'If you're in the 25th, you understand you got to fight in the tough environment of the Pacific.'\nScroll down for video\nA soldier from the U.S. Army's 25th Infantry Division 1st Stryker Brigade Combat Team crosses a stream with a rope during jungle warfare training at Schofield Barracks, Hawaii, on March 1\nThe Army has set up a jungle training course amid a renewed focus on Asia and the Pacific after more than a decade of war in Iraq and Afghanistan\nThe Army closed its jungle training school in Panama in 1999 when the US returned land there\nEver since the turn of the 20th century, the Army has fought in tropical rain forests, including in Vietnam.\nYet the Army gave up its jungle training school in Panama in 1999 when the US returned land there to the Panamanian government.\nJungle training continued to lose priority in the aftermath of the September 11 attacks as the Army focused on preparing soldiers to fight in Afghanistan and Iraq.\nNow, surviving and fighting in tropical rain forests has captured the Army's interest again.\nIn 2013, it set up a jungle school at Schofield Barracks, a sprawling Army post near Waikiki.\nIts dense woods have a stream soldiers can practice crossing and cliffs for rappelling.\nIn 2013, the US established a jungle school at Schofield Barracks in Waikiki\nSoldiers are attending courses in Hawaii to prepare for upcoming exercises in Asia\nThe Army sent soldiers to military jungle schools in Brazil and other tropical spots to reacquire long-lost skills, with instructors-in-training pouring over old Army jungle manuals.\n'We had to relearn everything,' said Staff Sergeant Ascencion Lopez, who was one of the first instructors at the school.\nWhat's also had to be tweaked: uniforms, how the soldiers carry gear, and developing the mental stamina to persevere in such a challenging environment.\nOne day recently, Lopez watched soldiers from the 1st Stryker Brigade Combat Team in Fort Wainwright, Alaska, practice using a rope and pulley to cross a stream.\nThe soldiers were attending the course to get ready for upcoming exercises in Malaysia, Thailand and other countries in the region.\nLopez tells soldiers to keep a dry change of clothes to wear at night and to pay special attention to drying out their feet.\nThat’s because feet won’t heal if they’re continually wet. A small cut will become infected and the skin will die.\n'The minute your feet go, you’re done. You’re not going to be able to function in the jungle,' Lopez said.\nThe Army sent soldiers to military jungle schools in Brazil and other tropical spots to reacquire long-lost skills, with instructors-in-training pouring over old Army jungle manuals\nSoldiers are warned to pay special attention to drying out their feet because they won't heal if they're continually wet. A small cut can become infected and the skin will die\nSoldiers must also develop the mental stamina to persevere in a place where they’re constantly wet, thick vegetation can hide the enemy and deadly animals may be lurking. (Though soldiers are spared threatening animals in Hawaii as the state has no snakes and the only native land mammal is a small, rare bat.)\n'Soldiers that aren’t as mentally tough - they’re either going to find their toughness or they won’t. But the jungle doesn’t care either way,' said Staff Sergeant Michael Johnson, another instructor.\nThe jungle school is an outgrowth of former President Obama's \"pivot\" to Asia and the Pacific.\nIt's unclear whether President Trump will keep a similar emphasis.\nThe Army is training in the jungle so it will be ready before a crisis demands it, said Brian Price, a professor in diplomacy and military studies at Hawaii Pacific University.\n'The Army has to train to fight everywhere - jungles, deserts, mountains and fair climates as well. This is kind of the missing piece of all that,' Price said.","url":"https://www.dailymail.co.uk/news/article-4319028/US-soldiers-train-jungle-warfare-Hawaii-rainforest.html"}
