{"authors":["Mike Larkin For Dailymail.Com"],"date_download":"2018-10-22 23:49:46","date_modify":"2018-10-22 23:49:46","date_publish":"2017-03-10 04:44:16","description":"He presided over a disastrous drop in ratings. But that seemed the furthest thing from former Celebrity Apprentice host Arnold Schwarzenegger's mind as as he cheerfully waved at fans in LA","filename":"data/vaneerConsumption/ArnoldSchwarzeneggerheadsforlunchafterquittingshow.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/03/3E1FBA7E00000578-0-image-a-68_1489117035297.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299836_Arnold-Schwarzenegger-wave-Celebrity-Apprentice-exit_1540252186.html","title":"Arnold Schwarzenegger heads for lunch after quitting show","title_page":"Arnold Schwarzenegger heads for lunch after quitting show | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He presided over a disastrous drop in ratings.\nBut that seemed the furthest thing from former Celebrity Apprentice host Arnold Schwarzenegger's mind as he cheerfully waved at fans after lunching in Los Angeles on Thursday.\nThe star certainly did not give the impression that President Donald Trump's claims he was fired for being such a hopeless fit for the hit show were accurate - but then again fans of his high brow movies will surely affirm that he is a world class actor.\nMaking waves: Former Celebrity Apprentice host Arnold Schwarzenegger waved at fans after lunching in Los Angeles on Thursday\nThe 69-year-old ex Governor Of California seemed to be revelling in the attention as he caused fellow diners to gawk in awe as he left a trendy eatery, and showcased his bodybuilders physique in T-shirts, shorts and trainers.\nAs a former politician caught up in more than his fair share of sex scandals over the years, Arnold seemed the perfect man to host the new Celebrity Apprentice, but announced he was not be back in a statement last Friday.\nThe president found a gap in his schedule to attack his replacement on the showing the early hours of Saturday morning following the announcement of his shock departure..\nDonald tweeted: 'Arnold Schwarzenegger isn't voluntarily leaving the Apprentice, he was fired by his bad (pathetic) ratings, not by me. Sad end to great show.'\nCausing a stir: A fellow diner could not believe her eyes when she saw the famed thespian striding past\nObviously no longer in politics: For Arnold would have surely snatched the opportunity to kiss the gawking fan's baby\nLoving it: Arnold wore a smug grin on his face as he lapped up the attention\nWhen asked about the supposed leader of the free world's attack, Arnold fired back 'When asked about the leader of the free world's attack, Arnold fired back 'I think he's in love with me.'\nHe also washed his hands of all blame for his failure, insisting it was the divisive antics of the show's former host that had caused sponsors and viewers to desert the show in droves.\nPlaying his Trump card, he said: ''When people found out that Trump was still involved as executive producer and was still receiving money from the show, then half the people [started] boycotting it.'\nThe opening episode got 4.95 million viewers, and its finale pulled in just 3.5 million - both getting less than the last Trump-helmed episode of the show, which received 6.1 million viewers.\nSocking it to them: He completed his sporty look with socks\nBrains and brawn: The muscleman added a dash of geek chic to his look by hooking his glasses to his T-shirt\nAnd it's goodbye from him: The former Governor Of California's secret service agent bodyguard prepared to slam the door behind him\nOverall the season had an average viewership of 4.9 million, considerably less than the previous season's 7.6 million.\nThe Donald famously used a presidential prayer breakfast as a platform to mock his rival before his exit.\nHe said: 'They hired a big, big movie star, Arnold Schwarzenegger to take my place, and we know how that turned out.'\n'The ratings went right down the tubes. It's been a total disaster. And [producer] Mark [Burnett] will never, ever bet against Trump again. And I want to just pray for Arnold, if we can, for those ratings.'\nThe Terminator star fired back in a social media video, saying: 'Hey Donald I have a great idea, why don't we switch jobs?\nQuit: Arnold announced he was leaving the Celebrity Apprentice last Friday","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299836/Arnold-Schwarzenegger-wave-Celebrity-Apprentice-exit.html"}
