{"authors":["Associated Press"],"date_download":"2018-10-23 04:15:36","date_modify":"2018-10-23 04:15:36","date_publish":"2017-03-10 14:24:11","description":"WASHINGTON (AP) - U.S. employers added a robust 235,000 jobs in February and raised pay at a brisk pace - signs that a resilient economy has given many...","filename":"data/vaneerConsumption/ArobustFebruaryjobsreportpointstoresilientUSeconomy.json","image_url":"https://i.dailymail.co.uk/1/2017/03/11/12/wire-201061-1489235410-620_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4301462_US-adds-robust-235K-jobs-making-Fed-rate-hike-sure_1540268136.html","title":"A robust February jobs report points to resilient US economy","title_page":"A robust February jobs report points to resilient US economy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"WASHINGTON (AP) - U.S. employers added a robust 235,000 jobs in February and raised pay at a brisk pace - signs that a resilient economy has given many companies the confidence to hire in anticipation of solid growth ahead.\nWith the unemployment rate dipping to a low 4.7 percent from 4.8 percent, the job market appears to be fundamentally healthy or nearly so.\nFriday's employment report from the government showed that more people began looking for jobs last month, an encouraging sign that they've grown confident about their prospects. Hiring was strong enough to absorb those new job seekers as well as some of the previously unemployed.\nJob seeker Kiana Cupit works on her resume during a resumes writing class at the Texas Workforce Solutions office in Dallas, Friday, March 10, 2017. U.S. employers added a robust 235,000 jobs in February and raised pay at a healthy pace, making it all but certain that the Federal Reserve will raise short-term interest rates next week. (AP Photo/LM Otero)\nThe picture of an economy on solid footing nearly eight years after the Great Recession ended has made it all but certain that the Federal Reserve will raise interest rates next week and signal the likelihood of additional rate hikes ahead.\nFebruary's jobs report was the first to cover a full month under President Donald Trump. During the presidential campaign, Trump had cast doubt on the validity of the government's jobs data, calling the unemployment rate a \"hoax.\"\nBut just minutes after the report was released at 8:30 a.m. Eastern time, Trump retweeted a news report touting the job growth.\nLater in the day, his spokesman, Sean Spicer, quoted Trump as saying of the jobs reports: \"They may have been phony in the past, but they are very real now,\" a comment that incited laughter, including from Spicer himself, during a press briefing.\nEconomists were mainly encouraged by the employment data.\n\"It's hard to find much to dislike in the February jobs report,\" said Michael Feroli, an economist at JPMorgan Chase, said.\nAbout a quarter of the job gains occurred in construction, which added 58,000 jobs, the most in a decade. Unseasonably warm weather likely inflated that figure, economists said. Last month was the second-warmest February since 1895, according to the Commerce Department.\nSome economists cautioned that last month's outsized job gains might be hard to sustain. If warm weather did help elevate construction hiring in February, for example, it might also have the effect of subtracting from job growth that would normally occur in early spring.\n\"There will probably be some weather payback in March,\" Ted Wieseman, an economist at Morgan Stanley, said in an email.\nMining, which includes oil and gas drilling, added 7,700 jobs last month, the most in nearly three years. Energy companies have increased drilling in response to higher oil prices, reversing nearly two years of job losses. Oil prices have dropped this week, though.\nAnd as unemployment declines, hiring typically slows as the pool of available workers shrinks. Many small businesses are complaining that they cannot find workers with the qualifications they need. This trend could weigh on hiring in coming months.\nStock prices fluctuated throughout the day Friday, and the Dow Jones industrial average closed up a modest 44 points.\nThe February jobs data likely provided the final piece of evidence the Fed needed to raise rates after its next policy meeting Wednesday. It would be the Fed's third rate hike in 15 months. The Fed's inclination to tighten borrowing rates reflects how far the economy has come since the central bank cut its benchmark short-term rate to zero in 2008 and kept it there for seven years to support a fragile economy.\nIn December, Fed policymakers had forecast that they would raise rates three times this year. Those increases could lead eventually to higher loan rates for homes and cars as the economy further solidifies its gains. Economists said Friday's hiring data increases the probability of additional rate hikes.\n\"There are few factors more important to consumers than jobs,\" said Russell Price, an economist at Ameriprise Financial. \"Overall, consumers are in great shape to support an accelerated pace of economic growth.\"\nAverage hourly pay rose 2.8 percent year over year in February, a decent gain though slightly below historical averages. In a healthy economy, wages typically rise at a roughly 3.5 percent annual pace.\nThough most of the job market's scars from the Great Recession have healed, some have still not. The number of part-time workers who would prefer a full-time job but can't find it remains nearly 25 percent above its level before the recession began in 2007.\nThat's a big reason why an alternate measure of unemployment, which includes those involuntary part-time workers as well as people who have stopped job-hunting, was 9.2 percent last month. That is well below its peak but is still higher than before the recession.\nStill, business confidence has risen since the presidential election, possibly in anticipation of tax cuts and deregulation from the Trump administration. A survey by the National Federation of Independent Business found small business optimism at a 12-year high in January.\nVicki Holt, CEO of Proto Labs, which makes parts for automakers, medical device and aerospace companies, says her clients' outlook has brightened.\n\"Our customer base is really excited about the general climate and support for manufacturing from the administration,\" Holt said. \"And that helps us.\"\nThe United States is also benefiting from steadier economies overseas. Growth is picking up or stabilizing in most European countries as well as in China and Japan.\nRecent pay growth in the United States partly reflects higher minimum wages that took effect at the start of the year in 19 states, economists said. In addition, steady job gains tend to raise pay as employers compete for workers.\nUnemployed Air Force veteran Thom Brownell, left, takes a break from online job seeking and gets some encouragement from Steve Bridges at the Texas Workforce Solutions office in Dallas, Friday, March 10, 2017. U.S. employers added a robust 235,000 jobs in February and raised pay at a healthy pace, making it all but certain that the Federal Reserve will raise short-term interest rates next week. Friday's jobs report from the government made clear that the economy remains on solid footing nearly eight years after the Great Recession ended. (AP Photo/LM Otero)\nAir Force veteran Thom Brownell uses a computer to search for a job at the Texas Workforce Solutions office in Dallas, Friday, March 10, 2017. U.S. employers added a robust 235,000 jobs in February and raised pay at a healthy pace, making it all but certain that the Federal Reserve will raise short-term interest rates next week. Friday's jobs report from the government made clear that the economy remains on solid footing nearly eight years after the Great Recession ended. (AP Photo/LM Otero)\nJob seekers look at their respective computer screens during a resume writing class at the Texas Workforce Solutions office in Dallas, Friday, March 10, 2017. U.S. employers added a robust 235,000 jobs in February and raised pay at a healthy pace, making it all but certain that the Federal Reserve will raise short-term interest rates the following week. (AP Photo/LM Otero)","url":"https://www.dailymail.co.uk/wires/ap/article-4301462/US-adds-robust-235K-jobs-making-Fed-rate-hike-sure.html"}
