{"authors":["Associated Press"],"date_download":"2018-10-23 02:47:58","date_modify":"2018-10-23 02:47:58","date_publish":"2016-01-11 15:14:47","description":"BEVERLY HILLS, Calif. (AP) — The action doesn't stop during commercial breaks at the Golden Globes. More than 125 stars from TV and film, along with studio h...","filename":"data/vaneerConsumption/AroundupofGoldenGlobesmomentsyoudidntseeonTV.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:41e346ce9f254bd6afe165e12643fe6c-3WAQP5SaQH704788ebcf7e00bc29-863_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3394044_A-roundup-Golden-Globes-moments-didnt-TV_1540262878.html","title":"A roundup of Golden Globes moments you didn't see on TV","title_page":"A roundup of Golden Globes moments you didn't see on TV | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A roundup of Golden Globes moments you didn't see on TV\nBEVERLY HILLS, Calif. (AP) — The action doesn't stop during commercial breaks at the Golden Globes.\nMore than 125 stars from TV and film, along with studio heads and network chiefs, shared tables in close quarters inside the Beverly Hilton's International Ballroom during Sunday's broadcast. And every time the show would break away, new Hollywood constellations would form.\nHere's a look at some of the celebrity moments you didn't see on TV:\nQuentin Tarantino arrives at The Weinstein Company and Netflix Golden Globes afterparty on Sunday, Jan. 10, 2016, at the Beverly Hilton Hotel in Beverly Hills, Calif. (Photo by Chris Pizzello/Invision/AP)\n— Will Smith and Jada Pinkett Smith giving parenting advice to Dwayne Johnson and girlfriend Lauren Hashian, who recently had a baby girl.\n— \"Orange is the New Black\" creator Jenji Kohan posing for a photo while flipping the bird.\n— Alejandro Inarritu and Quentin Tarantino having an animated conversation about filmmaking.\n— Kevin Hart joking with Andy Samberg and Olivia Wilde. Hart later left holding his wife's purse in one hand and her hand in the other.\n— Brian Grazer inviting Ryan Murphy to sit at his table.\n— Jon Hamm shaking hands with Damian Lewis after his win for the PBS series \"Wolf Hall.\"\n— Katy Perry bonding with Kate Winslet and her husband.\n— Julia Louis-Dreyfus congratulating Mark Ruffalo with a kiss on the cheek. \"I love 'Spotlight',\" she told him. \"You killed it.\"\n— Golden Globe winner Lady Gaga and Jane Fonda having a mutual-admiration moment on their way to the after-parties. \"I can't believe this is happening!\" Gaga said.","url":"https://www.dailymail.co.uk/wires/ap/article-3394044/A-roundup-Golden-Globes-moments-didnt-TV.html"}
