{"authors":[],"date_download":"2018-10-30 18:19:14","date_modify":"2018-10-30 18:19:14","date_publish":"2014-05-21 04:00:00","description":"The 2014-15 Ferst Presents series imports a world of talent to Georgia Tech’s Ferst Center for the Arts.","filename":"data/vaneerConsumption/ArrayofglobaltalentcomingtoFerstCenter.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/MyAJC/2014/05/21/Images/photos.medleyphoto.5276082.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_array-global-talent-coming-ferst-center__1540923554.html","title":"Array of global talent coming to Ferst Center","title_page":"Array of global talent coming to Ferst Center","title_rss":"NULL","source_domain":"ajc.com","text":"The 2014-15 Ferst Presents series imports a world of talent to Georgia Tech’s Ferst Center for the Arts. The 23rd season ranges from Hawaiian ukulele ace Jake Shimabukuro to Atlanta jazz guitarist Earl Klugh (in his second of three years as an artist in residence) and the National Acrobats of China to choreographer and 2013 MacArthur “genius grant” winner Kyle Abraham and his New York dance troupe.\nThe lineup:\nJazz: Robert Glasper Experiment (Sept. 26), Preservation Hall Jazz Band with Allen Toussaint (Nov. 7), “A Charlie Brown Christmas” with David Benoit (Dec. 5), Diane Schuur (Jan. 30, 2015), Earl Klugh: “Jazz and the Movies” (April 18)\nTheater and dance: HMS Pinafore by New York Gilbert and Sullivan Players (Sept. 12), Kyle Abraham / Abraham.In.Motion (Nov. 14), Jonah Bokaer (Feb. 20, 2015)\nMore music: “A Rockapella Christmas” (Dec. 12), Arlo Guthrie (Jan. 31, 2015), Natalie MacMaster and Donnell Leahy (March 7, 2015), Jake Shimabukuro (March 28, 2015)\nFun: National Acrobats of China (Oct. 12), Mummenschanz (Feb. 15, 2015)\nFree concert series: Montana Skies (Sept. 11, outdoor show in the Ferst’s amphitheater), Sybarite 5 (Oct. 9), The Honeycutters (April 2, 2015, amphitheater)\nTickets: Five-show packages (at 15 percent off individual ticket prices) are on sale; single tickets go on sale Aug. 12. Information: 404-894-9600, www.ferstcenter.org.\nTHEATER\nVoices carry in Outfit’s 2014-15 season\nTheatrical Outfit has built its estimable track record around “stories that stir the soul.” Its 2014-15 season, its 38th, is poised to continue that tradition, featuring the celebrated voices of Athol Fugard and John Patrick Shanley as well as that of Decatur-bred, San Francisco-based playwright Lauren Gunderson.\nThe lineup:\nAug. 21-Sept. 7: “The Savannah Disputation” by Evan Smith. Two Roman Catholic sisters forget Southern charm when a peppy Evangelical Christian comes to their door in this 2009 dramatic comedy.\nOct. 9-26: Fugard’s “My Children! My Africa!” a three-character thriller set in segregated South Africa in which a humane black teacher tries to convince a favorite student that education, not violence, is the answer to the nation’s problems. Part of Africa Atlanta 2014.\nDec. 4-21: “The Gifts of the Magi” by Mark St. Germain, music by Randy Courts. The musical about a penniless husband and wife in 19th century New York is based on two O. Henry stories.\nDec. 22-23: Truman Capote’s “A Christmas Memory,” adapted and performed by executive artistic director Tom Key.\nFeb. 12-March 1, 2015: Gunderson’s “Silent Sky,” regional premiere of a period romance about American astronomer Henrietta Leavitt (1868-1921).\nApril 9-26, 2015: Shanley’s “Storefront Church,” the final part of the Pulitzer Prize winner’s “Doubt” trilogy. The relationship between spiritual experience and social action comes into question when the mortgage crisis forces a Bronx borough president to confront an unorthodox minister.\nSubscription packages (which do not include “Gifts of the Magi” or “Christmas Memory”), $80-$150: 1-877-725-8849, www.ticketalternative.com. Single tickets go on sale July 1.\nCLASSICAL MUSIC\nBell joins ASO for Atlanta, Athens concerts\nIf they aren’t already, violin virtuoso Joshua Bell and the Atlanta Symphony Orchestra should easily be on the same frequency by next week. That’s because Bell is not only performing Brahms’ Violin Concerto with the ASO in Atlanta three times, May 29-31, but then joining the orchestra and maestro Robert Spano again for the same work in Athens on June 1.\nThe latter concert, at at UGA Performing Arts Center’s Hodgson Concert Hall, was added when Bell’s solo performance there was snowed out on Feb. 11.\n“We are extremely fortunate to have been able to arrange for this performance on such short notice,” Performing Arts Center Director George C. Forman said. “The first workable solo recital date with Joshua Bell would not have been until two years from now.”\nIt’s also good news for composer Charles Zoll, whose “Asimov at Star’s End” will be performed in Athens after its world premiere in Atlanta. Zoll was the winner of the 2012 Rapido! Composition Competition, an Atlanta Chamber Players program that promotes the creation of new works for chamber ensembles and orchestras.\nTickets for the 8 p.m. May 29-30 and 7:30 p.m. May 31 performances in Symphony Hall are $24-$75. 1280 Peachtree St., Atlanta. 404-733-5000, aso.org.\nSeats for the UGA concert at 3 p.m. June 1 are $49-$69. 230 River Road, Athens. 1-888-289-8497, pac.uga.edu.\nARTS\nGarcia to lead Woodruff campaign\nPaul Garcia, chairman of the board of directors of Global Payments Inc., will chair the Woodruff Arts Center’s 2014-15 Annual Campaign. The fund-raising initiative supports the center’s arts and education programming.\nContinuing through May, the 2013-14 Annual Campaign, under the leadership of SunTrust Banks chairman and CEO William Rogers, has the highest fiscal goal in its history, $9.5 million. To donate: 404-733-4267.\n12 chosen for Walthall Artist Fellowship\nWonderRoot has selected 12 metro artists for the 2014-15 Walthall Artist Fellowship, a professional development program for creatives at pivotal career stages.\nPicked to partcipate after a highly competitive selection process were Steven Anderson, Namwon Choi, Molly Freeman, Sean Hilton, Casey Lynch, Romy Maloon, Masud Olufani, Erin Palovick, MaryGrace Phillips, Stephanie Pharr, Lucha Rodriguez and P. Seth Thompson.\nInformation: www.wonderroot.org.","url":"https://www.ajc.com/entertainment/array-global-talent-coming-ferst-center/RiDRb5soic9Ms93mLECpzH/"}
