{"authors":[],"date_download":"2018-10-22 21:43:39","date_modify":"2018-10-22 21:43:39","date_publish":"2016-01-28 08:50:26","description":"The leader of an anti-government siege at a US wildlife refuge until his arrest in an operation that left one protester dead urged the remaining armed occupi...","filename":"data/vaneerConsumption/ArrestedOregonprotestleadertellsholdoutstogohome.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g52x-2vdWmEltwXfba0ce28e63264bfe8-112_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420231_Arrested-Oregon-protest-leader-tells-occupiers-home-attorney_1540244619.html","title":"Arrested Oregon protest leader tells holdouts to go home","title_page":"Arrested Oregon protest leader tells holdouts to go home | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Arrested Oregon protest leader tells holdouts to go home\nThe leader of an anti-government siege at a US wildlife refuge until his arrest in an operation that left one protester dead urged the remaining armed occupiers to go home.\nEight people including Ammon Bundy were arrested and one of his group shot dead late Tuesday following a three-week standoff in the northwestern US state involving ranchers angry over federal land management policies.\nSpeaking through his attorney, Bundy on Wednesday appealed to the handful of armed supporters still holed up in the remote area.\nEight people including Ammon Bundy (C) were taken into custody and one of his group killed in a dramatic twist to the tense three-week standoff in Oregon ©Rob Kerr (AFP/File)\n\"To those remaining at the refuge, I love you. Let us take this fight from here,\" read a statement issued via Bundy's attorney Michael Arnold.\n\"Please stand down. Go home and hug your families. This fight is ours for now in the courts.\"\nBundy paid tribute to the dead supporter as his \"beloved friend\" Robert \"LaVoy\" Finicum, an Arizona rancher who became de facto spokesman for the motley protest movement.\n\"LaVoy is one of the greatest men and greatest patriots I have ever seen,\" Bundy said. \"I mourn for him and his family.\n\"Right now I am asking the federal government to allow the people at the refuge to go home without being prosecuted.\"\nAuthorities have blocked the access road leading into the Malheur National Wildlife Refuge and the occupiers are free to leave, but will be identified as they do so, Greg Bretzing, head of the FBI's Portland office, said.\n\"We will continue to look for safe, peaceful procedures on how to bring this to a peaceful conclusion,\" he added.\nLast week, some 30 people, including women and children, were at the site, but it was unclear how many remain.\n- 'Kill them' -\nLocal authorities and the FBI also called on the remaining occupiers to end the fight.\n\"It's time for everybody in this illegal occupation to move on. There doesn't have to be bloodshed in our community,\" Harney County Sheriff David Ward told reporters.\nIn a livestream that has been broadcasting from the protest site, an armed man was seen urging supporters to join them and to kill any law enforcement officer who tried to prevent their entry.\n\"There are no laws in this United States now! This is a free-for-all Armageddon!\" the man yelled into the camera. \"(If) they stop you from getting here, kill them!\"\nWard held a news conference earlier Wednesday at which he appealed for the protesters to leave, and voiced distress that a police attempt to peacefully resolve the crisis ended in bloodshed.\n\"It didn't have to happen,\" he said.\nWard said some of the protesters came to his office the night before with \"ultimatums that I couldn't meet.\" He did not elaborate.\nThe FBI said it and local authorities then devised a plan to arrest members of the group as they drove on a highway, reportedly headed to a meeting with local people.\nPolice stopped them on the way but one man died of a gunshot wound during the operation, Bretzing said. Five others including Bundy were arrested at the scene.\nThe Oregonian reported that shots were fired when two men -- including Bundy's 43-year-old brother Ryan -- disobeyed orders when agents stopped the two cars they were travelling in and resisted arrest.\nThe FBI and Oregon state police later Tuesday arrested two other men in Burns, the town nearest to the refuge. An eighth person surrendered to police in Arizona, officials said.\nOn Wednesday afternoon three other occupiers surrendered and were arrested as they left the refuge, the FBI said in a statement.\n- 'Force, intimidation, threats' -\nThe Bundy brothers are the sons of Cliven Bundy, 69, a vitriolic anti-government activist who in 2014 engaged in an armed standoff with federal authorities over unpaid cattle grazing fees at his Nevada ranch.\nBundy and the others face a federal felony charge \"of conspiracy to impede officers of the United States from discharging their official duties through the use of force, intimidation, or threats,\" the FBI said.\nThe gunmen took over the wildlife refuge on January 2 to protest at the jailing of two local ranchers, Dwight Hammond and his son Steven, who were convicted of arson.\nTheir demands soon grew to include calls for the government to turn over area federal land to local ranchers. In Oregon, nearly 53 percent of the land is federally owned.\nThe Hammonds distanced themselves from the movement and voluntarily began their scheduled prison sentences after the occupation began.\nSeveral community members, notably the Oregon Cattlemen's Association, expressed sympathy for the Hammonds but condemned the takeover.\nIn a series of tweets, Oregon Governor Kate Brown acknowledged the trauma to local residents: \"Please know I am doing everything in my power to restore normal life to Harney County.\"\nOregon standoff\nAmmon Bundy paid tribute to the member of his group who was killed, who was not formally identified, as his \"beloved friend\" Robert \"LaVoy\" Finicum, pictured ©Rob Kerr (AFP/File)\nAn AirLife medical transport helicopter lifts-off from St. Charles Medical Center in Bend,Oregon on January 26, 2016 en route to Burns, Oregon ©Rob Kerr (AFP/File)","url":"https://www.dailymail.co.uk/wires/afp/article-3420231/Arrested-Oregon-protest-leader-tells-occupiers-home-attorney.html"}
