{"authors":[],"date_download":"2018-10-22 21:45:26","date_modify":"2018-10-22 21:45:26","date_publish":"2014-06-06 13:45:30","description":"The Naval Medical Center Portsmouth in Portsmouth went into lockdown after the 9 a.m. stabbing near the hospital.","filename":"data/vaneerConsumption/ArrestinStabbingatVirginiaNavalBase.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_crime-courts_arrest-stabbing-virginia-naval-base-n124426_1540244726.html","title":"Arrest in Stabbing at Virginia Naval Base","title_page":"Arrest in Stabbing at Virginia Naval Base","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA sailor suspected of stabbing another at a Virginia naval base was arrested Friday after an eight-hour manhunt, authorities said.\nWilbur Harwell, 26, an active-duty 3rd class petty officer, was apprehended at 5 p.m. near the Virginia Beach waterfront. He allegedly stabbed Justin D. Powell, 25, a second-class petty officer, at the Navy exchange near the Naval Medical Center Portsmouth in Portsmouth, Virginia, at around 8:30 a.m.\nThe crime prompted the medical facility to enter a lockdown state.\nPolice caught up to Hartwell by tracking his cell phone, NBC affiliate WAVY.com reported.\nThe victim was transported with critical injuries to the hospital, where he underwent surgery, officials said at a news conference. WAVY.com, quoting a family member, said he had been stabbed eight times.\nAll staff and patients were told to shelter in place and an alert was sent out to staff, WAVY.com reported. The order was lifted at about 5:30 p.m., according to its Facebook page.\n— Elizabeth Chuck","url":"https://www.nbcnews.com/news/crime-courts/arrest-stabbing-virginia-naval-base-n124426"}
