{"authors":["Ben Nagle For Mailonline"],"date_download":"2018-10-23 02:47:03","date_modify":"2018-10-23 02:47:03","date_publish":"2017-03-10 12:01:41","description":"Regardless of the result on Saturday evening, Lincoln will make history this weekend. Ahead of their FA Cup quarter-final tie at Premier League giants Arsenal, Sportsmail compares the two teams...","filename":"data/vaneerConsumption/ArsenalvsLincolnFACuptaleofthetape.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/3E22F43B00000578-0-image-a-36_1489151657662.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4300760_Arsenal-vs-Lincoln-FA-Cup-tale-tape_1540262823.html","title":"Arsenal vs Lincoln, FA Cup tale of the tape","title_page":"Arsenal vs Lincoln, FA Cup tale of the tape | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Regardless of the result on Saturday evening, Lincoln will make history this weekend. The first non-League team to play in the quarter-finals of the FA Cup since 1914.\nThe Red Imps travel to the Emirates to face the millionaire might of Arsenal, who themselves are in something of a crisis.\nHere, Sportsmail compares the two sides...\nLincoln's players celebrate after being Burnley to secure their place in the FA cup last eight\nArsenal beat Lincoln's fellow non-Leaguers Sutton at Gander Green Lane in the fifth round\nManagerial History\nLincoln have had 14 managers in the time Arsene Wenger has been at Arsenal, but that's not to say the Premier League side have the upper hand.\nWenger moved to Arsenal in 1996 and is now the club's longest-serving and most successful manager, having steered the Gunners to three Premier League titles and six FA Cups during his tenure.\nThat said, he is currently enduring his most difficult spell in the Emirates dug-out, with supporters protesting for him to leave the club.\nArsene Wenger has been at Arsenal since 1996 - Lincoln have had 14 managers in that time\nA 10-2 aggregate drubbing by Bayern Munich in the Champions League has tipped many over the edge, and it's unclear whether Wenger will be at the club next season.\nAt Lincoln, it's fair to say the fans are more than happy with current pairing Danny and Nicky Cowley.\nMain man Danny was still working as a full-time PE teacher when he guided Braintree Town to the National League play-offs last season, but subsequently gave up his second job when he moved to Lincoln.\nThey are flying in the National League too, and heading towards the club's most successful ever season.\nLincoln supporters will be more than happy with their current management duo at Sincil Bank\nTrophy Haul\nLet's be clear, there's really no comparison between the two sides in terms of major trophies won. Arsenal have 13 league titles, 12 FA Cups and two League Cups in their trophy cabinet, as well as the European Cup Winners' Cup and the Fairs Cup.\nLincoln, meanwhile, hold the record for spending most seasons in the Football League without reaching the top flight. Their biggest honour remains three Third Division North titles between 1931 and 1951.\nThat said... if they can beat Arsenal on Sunday, they're just 180 minutes away from winning the FA Cup. They can't, can they?\nArsenal clearly have the upper hand in terms of trophies - here, they lift the 2014/15 FA Cup\nMoney Men\nArsenal have something of a reputation for not splashing the cash on new signings as much as their rivals at the top of the Premier League.\nFans have been calling out for a new star striker for years, and while teams like Manchester United shell out on £89million man Paul Pogba, there has been no-one of that ilk through the door at the Emirates.\nLet's be clear though: Arsenal do spend. Last summer alone, £96m was paid out on incoming players, the most of which on £34m midfielder Granit Xhaka. The club's record signing, £42.5million Mesut Ozil, is expected to line up at the weekend.\nIn contrast Lincoln spent no money on new players in the summer, and their record transfer fee remains the £75,000 paid for both Dean Walling and Tony Battersby in 1997 and 1998 respectively. This is perhaps where the gulf in class is most obvious.\nMesut Ozil is just one example of the gulf in finances - he cost Arsenal a whopping £42.5m\nRecent Form\nLincoln maintained their lead at the top of the National League on Tuesday with a thumping 4-0 win away to Cowley's old club Braintree. It kept the Red Imps six points clear of Forest Green and Tranmere, and extended their unbeaten run in all competitions to 10 games.\nOn the same night Arsenal slumped to a 5-1 Champions League defeat to Bayern Munich, crashing out 10-2 on aggregate and heaping more pressure on Wenger, whose contract expires in the summer.\nNow could this be where the tables turn? A statistic in Lincoln's favour, for sure. It goes one of two ways on Saturday. Either Arsenal turn up wanting to make amends for their European debacle, starting a strong XI to blow their opponents away.\nOr, on the other hand, their slump continues, Lincoln are up for it and somehow the non-League side leave the Emirates with a draw or even a slender victory.\nLincoln's recent form has been impressive; they are currently unbeaten in 10 matches\nIf Barca can do that surely we can beat Arsenal 👀 — Sean Raggett (@SeanRaggett) March 8, 2017\nSeason at a glance Live tables\nFixtures\nScores Premier League\nPremier League\nChampionship\nLeague One\nLeague Two\nScottish Premiership\nScottish Div 1\nScottish Div 2\nScottish Div 3\nLigue 1\nSerie A\nLa Liga\nBundesliga\nLeague Standings\nAs previously mentioned, Lincoln's impressive FA Cup run has not impacted their league form at all, and they are running away with it in the National League.\nSurely heading for League Two next season, the Cowley brothers have worked wonders at Sincil Bank.\nThey currently sit six points clear of Forest Green Rovers and have won six and drawn two of their last 10 games.\nTheir second-placed rivals face a tough trip to fourth-placed Dagenham & Redbridge at the weekend, meaning if results go their way Lincoln could have the chance to move nine points clear if they win their game in hand.\nArsenal, meanwhile, have slipped out of the top four in the Premier League - albeit perhaps temporarily, given their game in hand - and are in a poor run of form.\nThey have lost three of their last four, and face the prospect of finishing outside the top four for the first time since 1996.\nMatt Rhead is the one to watch for the Red Imps; the big striker has 13 league goals this term\nStar men\nArsenal's star man surely has to be Alexis Sanchez. Putting to one side the fact he may not be in a red and white shirt next season, against Lincoln he is the one to watch.\nThe Chilean has scored 20 goals in all competitions so far this season, and it may be a case of 'enjoy him while you can' for those supporting the home side on Saturday.\nLincoln's top scorer, meanwhile, is Matthew Rhead - he's netted 13 times in the National League this season.\nTheo Robinson was the FA Cup star with five goals in the competition this season, but his move to Southend in January put an end to that run.\nRed Imps fans will be hoping to see Rhead net his first Cup goal of the campaign... and if he can't, it's likely to be down to Nathan Arnold.\nAlexis Sanchez may not be an Arsenal player next season, but for now he is still at the Emirates\nHungry For Success\nThe Emirates Stadium provides two private members-only dining restaurants, plus three further matchday restaurants for platinum members, as well as a separate executive box menu, and four corner bars on club level.\nMeanwhile, to mark their run to the last eight, a Lincoln business has produced a limited-edition cheese pack. The selection, curated by The Cheese Society, includes 'ones from Lincolnshire, imp-related cheeses and any that celebrate the colour red'.","url":"https://www.dailymail.co.uk/sport/football/article-4300760/Arsenal-vs-Lincoln-FA-Cup-tale-tape.html"}
