{"authors":["Jonathan Spencer For Mailonline"],"date_download":"2018-10-23 02:12:45","date_modify":"2018-10-23 02:12:45","date_publish":"2017-03-16 12:38:49","description":"Kylian Mbappe, who only made his debut last season and has already been dubbed the new Thierry Henry, has impressed hugely this campaign for Leonardo Jardim's side.","filename":"data/vaneerConsumption/ArsenalandRealMadridtargetKylianMbappeNOTforsale.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E4EE50200000578-0-image-a-44_1489666908202.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319936_Arsenal-Real-Madrid-target-Kylian-Mbappe-NOT-sale_1540260765.html","title":"Arsenal and Real Madrid target Kylian Mbappe NOT for sale","title_page":"Arsenal and Real Madrid target Kylian Mbappe NOT for sale | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Monaco appear very determined to keep hold of wonderkid Kylian Mbappe, who has attracted interest from both Arsenal and Real Madrid.\nThe 18-year-old French forward, who only made his debut last season and has already been dubbed the new Thierry Henry, has impressed hugely this campaign for Leonardo Jardim's side.\nMbappe caused Manchester City a host of problems on Wednesday night as Monaco edged past Pep Guardiola's side to progress to the last-eight of the Champions League.\nKylian Mbappe played a key role in Monaco knocking Manchester City out of Europe\nMonaco were 5-3 behind going into the second leg at the Stade Louis II but Mbappe opened the scoring and was a constant threat throughout as the Ligue 1 leaders marched on to the next round, winning 3-1 on the night.\nThe thrilling nature of Monaco's progression in the Champions League and their fluid attacking play will only boost Mbappe's stock as one of the most exciting players around.\nBut Monaco's vice-president Vadim Vasilyev, insists there is no desire to sell Mbappe for a huge sum of money.\nMonaco's vice-president Vadim Vasilyev (centre) says Mbappe is the club's DNA\n'Our intention is to keep Kylian Mbappe,' Vasilyev told RTL.\n'Mbappe is a product of our youth academy. He is our DNA. I am very proud.\n'We have a real team. The first half was excellent – the sort of performance that the very top teams make.'\nAfter their impressive comeback against City, Mbappe and his Monaco team-mates will find out who they draw in the Champions League last-eight on Friday at 11am.","url":"https://www.dailymail.co.uk/sport/football/article-4319936/Arsenal-Real-Madrid-target-Kylian-Mbappe-NOT-sale.html"}
