{"authors":["Matt Barlow For Mailonline"],"date_download":"2018-10-23 01:10:22","date_modify":"2018-10-23 01:10:22","date_publish":"2017-03-16 10:53:01","description":"Arsene Wenger has told Barcelona to abandon all hope they still have of signing Hector Bellerin. Barcelona have been locked in an increasingly desperate search for an attacking right-back.","filename":"data/vaneerConsumption/ArsenalWILLkeepHectorBellerininsistsArseneWenger.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E2B947700000578-0-image-a-76_1489661287142.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319660_Arsenal-Hector-Bellerin-insists-Arsene-Wenger_1540257022.html","title":"Arsenal WILL keep Hector Bellerin, insists Arsene Wenger","title_page":"Arsenal WILL keep Hector Bellerin, insists Arsene Wenger | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Arsene Wenger has told Barcelona to abandon all hope they still have of signing Hector Bellerin.\nBarcelona have been locked in an increasingly desperate search for an attacking right back since Dani Alves moved to Juventus last year.\nThey initially identified Bellerin as their top target and the front pages of Catalan sports newspapers this week have been dominated by reports of a revived £35million swoop for the Arsenal starlet.\nArsene Wenger (right) dismissed speculation linking Hector Bellerin with a move to Barcelona\nThe 21-year-old Spain international was born in Barcelona and started his career in the youth ranks at the Nou Camp but he signed a new Arsenal contract in November.\nIt ties him to north London until 2022 at more than £100,000 a week.\n'We have just extended the contract,' said Wenger. 'He has an unbelievable number of years to go. It's very difficult to take these things seriously.'\nThe right back has been subject of interest from the Catalan side since Dani Alves' departure\nArsenal return to Premier League action at West Bromwich Albion on Saturday.\nWenger has Mohamed Elneny back in contention after an ankle injury. Alex Oxlade-Chamberlain could also be involved despite being replaced during the first half of the FA Cup quarter-final against Lincoln on Saturday with a slight hamstring problem.\n'It is vital of course,' said the Arsenal boss, when asked about the importance of finishing in the top four and securing a place in next season's Champions League.\nBellerin signed a contract extension with Arsenal taking his deal to 2022\n'We are in a position where we cannot waste points. You can never afford to lose anyway but it's a tough game. West Brom is always difficult.\n'They have big experience and are well organised and physically strong and very efficient on set-pieces.\n'They score a lot from set-pieces. They have a very balanced team, equipped to deal with the Premier League.'","url":"https://www.dailymail.co.uk/sport/football/article-4319660/Arsenal-Hector-Bellerin-insists-Arsene-Wenger.html"}
