{"authors":["Mark Mann-Bryans","Press Association Sport"],"date_download":"2018-10-23 03:37:39","date_modify":"2018-10-23 03:37:39","date_publish":"2017-03-10 13:11:45","description":"Arsenal captain Per Mertesacker admits Lincoln demand respect for their FA Cup exploits this season as the pair meet on Saturday for a place in the semi-finals.","filename":"data/vaneerConsumption/ArsenalmustrespectLincolnsaysPerMertesacker.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/3DEB488800000578-0-image-a-51_1489150983819.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4301198_Per-Mertesacker-says-Arsenal-respect-Lincoln_1540265859.html","title":"Arsenal must respect Lincoln, says Per Mertesacker","title_page":"Arsenal must respect Lincoln, says Per Mertesacker | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Arsenal captain Per Mertesacker admits Lincoln demand respect for their FA Cup exploits this season as the pair meet on Saturday for a place in the semi-finals.\nThe Gunners host the Vanarama National League leaders and go into the match as heavy favourites, despite a recent run of poor form.\nManager Arsene Wenger has come in for criticism and another protest march against his continued leadership of the team has been scheduled by supporters ahead of kick-off.\nArsenal captain Per Mertesacker has warned his team-mates to be on their guard when they play Lincoln City in the quarter-final of the FA Cup\nMertesacker with under-fire manager Arsene Wenger in a press conference this week\nThe Gunners should be wary of non-league Lincoln, seen celebrating their winner at Burnley\nA run of five defeats in seven games has left the FA Cup as the only realistic trophy Arsenal can win this season.\nBut Lincoln travel to the Emirates Stadium full of confidence after upsetting the odds to win at Burnley in the previous round.\nDanny Cowley's side also saw off Championship opposition in the shape of Ipswich and Brighton to become the first non-league team in 103 years to reach the last eight.\nMertesacker knows that makes for a difficult tie after the 12-time FA Cup winners beat another non-league side, Sutton, in the last round.\n'That's what the cup's about, that's the beauty of it,' he said.\nArsenal have already faced one non-league side in the their Cup run - beating Sutton 2-0\nManager Arsene Wenger pictured in the dug-out at Sutton United's Gander Green Lane\nArsenal fixtures Premier League unless stated Saturday Lincoln City (H) FA Cup Quarter-finals March 18 West Bromwich (A) April 2 Manchester City (H) April 5 West Ham United (H) April 10 Crystal Palace (A) April 17 Middlesbrough (A)\n'They were all buzzing to meet us at Sutton. They gave us a good reception, both their players and fans. This time we know our home ground better and we are excited to play in front of our home crowd on the way to Wembley.\n'But the way they went to Burnley and won, in that fashion, that needs to be respected. We cannot underestimate any side in any league in this country, and that's what I've learned. When I played in the German cup, it was the same.'\nWenger is under fire following the drop in form and has yet to decide whether he will extend his stay at the Emirates Stadium beyond the end of the current season.\nLincoln could make it a week to forget for the 67-year-old after losses to Liverpool and Bayern Munich left Arsenal with the FA Cup as the only genuine silverware still on offer.\nAnd Wenger admits his side, as overwhelming favourites, will have to deal with the pressure against the Imps.\nLincoln manager Danny Cowley (right) and his assistant and brother Nicky pose with the Cup\nThe Lincoln players train at Sincil Bank ahead of their visit to Arsenal in the FA Cup\n'The FA Cup is the next game, and of course when you've had a disappointment like we had in the last game it's important to respond,' he said.\n'We are favourites, but when you are at a big club, you are favourites 90 per cent of the time, and you have to deal with that.\n'It's the next game and in the next game, people expect us to win, so there's a pressure there of course.'\nDespite that pressure, Wenger is likely to make a number of changes to his side which means Mertesacker could make his first Arsenal appearance of the season having overcome a serious knee injury.\nDanny Welbeck and Alex Iwobi will not feature due to illness and there are question marks over whether Mesut Ozil will be involved as the German World Cup winner is also suffering from a sickness bug.","url":"https://www.dailymail.co.uk/sport/football/article-4301198/Per-Mertesacker-says-Arsenal-respect-Lincoln.html"}
