{"authors":["Matt Barlow For Mailonline"],"date_download":"2018-10-23 00:42:18","date_modify":"2018-10-23 00:42:18","date_publish":"2016-01-11 10:20:58","description":"Arsene Wenger is predicting one of the busiest January transfer windows on recordArsenal hope to make their first new signing this week, by completing the transfer of Mohamed Elneny.","filename":"data/vaneerConsumption/ArseneWengerconfirmsElnenyiscloseinlatestArsenaltransfernews.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/3007D8E300000578-0-image-a-6_1452510972353.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3393659_Arsenal-close-signing-Mohamed-Elneny-confirms-Arsene-Wenger-predicts-active-January-transfer-windows-ever_1540255338.html","title":"Arsene Wenger confirms Elneny is close in latest Arsenal transfer news","title_page":"Arsene Wenger confirms Elneny is close in latest Arsenal transfer news | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Arsene Wenger is predicting one of the busiest January transfer windows on record as clubs scramble to enhance their status in the top flight.\nThe Barclays Premier League is wide open at the top and the bottom and Wenger expects this will encourage greater levels of spending.\nArsenal hope to make their first new signing this week, by completing the transfer of Mohamed Elneny from Basle.\nArsenal hope to tie up the signing of Basle midfielder Mohamed Elneny (right) this week\nArsene Wenger said that he expects January to be one of the most active transfer windows ever\n'I expect movement and we are positive that this week it can happen,' Wenger said. 'The situation can be sorted out. There are work permit problems and special paperwork, a visa, we hope we can finalise it this week. As long as it's not definitely signed you have to be cautious but I'm optimistic.\nThe Arsenal boss added: 'I believe many clubs will be active. My prediction is that it could be one of the most active January transfer windows that we've seen. For the media, it could be good news.\n'The clubs down in the table have to do something. The clubs at the top I'm sure will be active.\n'It's down to the financial power and inflation could exist after the season. The anticipation to do business now could be important.\n'Everyone feels the responsibility to do something. The teams who fear to go down will feel under pressure not to accept the situation. It can make a difference sometimes. There are teams who have responded well in January.'\nBournemouth completed a club record signing for Wolves striker Benik Afobe (left) this week","url":"https://www.dailymail.co.uk/sport/football/article-3393659/Arsenal-close-signing-Mohamed-Elneny-confirms-Arsene-Wenger-predicts-active-January-transfer-windows-ever.html"}
