{"authors":["Jack Bezants For Mailonline"],"date_download":"2018-10-23 00:28:10","date_modify":"2018-10-23 00:28:10","date_publish":"2017-03-16 09:50:47","description":"Arsene Wenger accepts another top four finish for Arsenal is not enough to silence the fans who are demanding he leaves.","filename":"data/vaneerConsumption/ArseneWengerlatestArsenalbossHITSOUTatcritics.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E534DD500000578-0-image-a-27_1489658588206.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319440_Arsene-Wenger-latest-Arsenal-boss-HITS-critics_1540254490.html","title":"Arsene Wenger latest: Arsenal boss HITS OUT at critics","title_page":"Arsene Wenger latest: Arsenal boss HITS OUT at critics | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Arsene Wenger accepts another top-four finish for Arsenal is not enough to silence the fans who are demanding he leaves.\nThe Gunners are fifth in the Premier League, five points behind Liverpool in fourth but with two games in hand, and have also reached the semi-final of the FA Cup.\nChampions League qualification is the priority for Wenger, who refused to discuss the protests against him before Arsenal beat Lincoln 5-0 in the FA Cup on Saturday.\nArsene Wenger believes another top-four finish at Arsenal will not silence his critics\nWenger refused to discuss the fans demanding that he leaves his post as manager\nSome fans have become disgruntled with Arsenal failing to compete for major honours\n'Our job is to do as well as we can, to get in the Champions League next season,' Wenger said at a press conference on Thursday. 'We have a tough job, six or seven teams fighting for the places.\n'We are in the semi-final of the FA Cup, we have an opportunity to do that. Success is basically to take the maximum out the potential of a team. What is that? We'll see.\n'Nothing is good enough anymore anyway, so you try to do as well as you can.'\nWhen asked about the Arsenal fans who have protested against him, Wenger said: 'I have nothing to say about that. We have talked enough about that. We have press conferences about that.'\nArsenal travel to West Brom for Saturday's early kick-off in the Premier League and Wenger admitted his side cannot afford to lose at The Hawthorns.\nArsenal reached the semi-final of the FA Cup last Saturday by beating Lincoln 5-0\nBut for Wenger, the ultimate priority is qualifying for next season's Champions League\n'You can never afford to lose,' Wenger said. 'It is true it is a tough game, West Brom is traditionally a tough game but for us it is an opportunity to come back closer again to the position that is much closer to Chelsea.\n'They have a big experience, well organised and very strong and efficient at set pieces.'","url":"https://www.dailymail.co.uk/sport/football/article-4319440/Arsene-Wenger-latest-Arsenal-boss-HITS-critics.html"}
