{"authors":["Alex Martin For Mailonline"],"date_download":"2018-10-23 00:46:46","date_modify":"2018-10-23 00:46:46","date_publish":"2017-03-16 10:15:05","description":"Alex Oxlade-Chamberalin looked in relaxed mood as he hung out with British wrapper Wretch 32 on Wednesday evening. The Arsenal star posed for a photo with the '6 Words' singer on Instagram.","filename":"data/vaneerConsumption/ArsenalstarAlexOxladeChamberlainchillswithWretch32.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E53146F00000578-0-image-a-10_1489658843066.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319406_Arsenal-star-Alex-Oxlade-Chamberlain-chills-Wretch-32_1540255606.html","title":"Arsenal star Alex Oxlade-Chamberlain chills with Wretch 32","title_page":"Arsenal star Alex Oxlade-Chamberlain chills with Wretch 32 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Alex Oxlade-Chamberalin looked in relaxed mood as he hung out with British wrapper Wretch 32 on Wednesday evening.\nThe Arsenal star posed for a photo with the '6 Words' singer and posted it to his 1.8million followers on Instagram.\nBorn and raised in Tottenham, Wretch 32 is a renowned Arsenal fan, previously admitting he chose the red side of north London because of an affinity with legendary striker Ian Wright.\nArsenal star Alex Oxlade-Chamberlain poses with British wrapper Wretch 32 on Wednesday\nAnd while Oxlade-Chamberlain has got a long way to go before he is held in the same regard as their former top goalscorer, the pair look as though they have struck up a good friendship.\nThe 23-year-old may have been sporting a wide smile with Wretch 32, but he faces the much serious business of a fitness test ahead of Arsenal's crunch clash against West Brom on Saturday.\nOxlade-Chamberlain, starting ahead of Mesut Ozil in the No 10 role against Lincoln, saw his night ended prematurely with a hamstring strain. Arsene Wenger, speaking on Thursday morning, confirmed he is a doubt for the game at the Hawthorns.\nThe Arsenal winger is consoled by Hector Bellerin as he walks off the Emirates pitch vs Lincoln\nThere is, however, a much bigger question hanging over the England international's head with regards to his long-term future at the Emirates Stadium. This summer will see him enter the final 12 months of his contract and there is some doubt over whether he will sign a new one.\nA number of Premier League clubs would be willing to take the midfielder off of Arsenal's hands and Wenger would no doubt be reluctant to lose him to one of their Premier League rivals.\nReports suggest that Oxlade-Chamberlain is frustrated with his lack of development but, speaking earlier this month, Wenger urged him to stay with the Gunners and insisted he can reach his potential at the club.\nOxlade-Chamberlain was substituted for Mesut Ozil after suffering a hamstring injury\nThe 23-year-old walks straight down the Emirates tunnel to receive treatment on his injury\nAsked about Oxlade-Chamberlain wanting to leave, Wenger said: 'I don't know. I am surprised by that.\n'I believe he has been developed well, has been given his chance. But when you are somewhere you have to want to be there first.\n'After, the only thing I can say is personally I rate him highly. I showed that in the way I kept faith in him when he was injured.\n'I personally wish he stays at the club, he is a very promising player who has developed very well who looks to have the values we rate.'","url":"https://www.dailymail.co.uk/sport/football/article-4319406/Arsenal-star-Alex-Oxlade-Chamberlain-chills-Wretch-32.html"}
