{"authors":["Kieran Gill For Mailonline"],"date_download":"2018-10-23 02:24:05","date_modify":"2018-10-23 02:24:05","date_publish":"2017-03-10 11:31:00","description":"KIERAN GILL: As each day passes, Arsene Wenger’s contract, which runs out this summer, gets closer to its end and it remains to be seen whether the Arsenal manager will stay or go.","filename":"data/vaneerConsumption/ArsenalmanagercandidatesWhocanreplaceArseneWenger.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E229B9500000578-0-image-a-108_1489147173066.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4300910_Arsenal-manager-candidates-replace-Arsene-Wenger_1540261445.html","title":"Arsenal manager candidates: Who can replace Arsene Wenger?","title_page":"Arsenal manager candidates: Who can replace Arsene Wenger? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"As each day passes, Arsene Wenger’s contract gets closer to its end and it remains to be seen whether the Arsenal manager will stay or go.\nThe north London club’s board will be considering their options in a bid to avoid being left in the lurch if the 67-year-old does decide to call it a day.\nHere, Sportsmail has taken a look at the contenders to the replace Wenger in the summer, should Arsenal need to.\nArsene Wenger's contract is running out in the summer and he may leave the Emirates\nWHO DO THE STATS BACK? Bookmaker bwin have produced statistical analysis of every managerial appointment across Europe’s top clubs in the last decade – and predict Max Allegri is the right man for Arsenal. Their data suggests Thomas Tuchel should be eliminated from the running for a limited professional career, while Eddie Howe and Diego Simeone miss out for not being foreign or from Europe respectively. Joachim Low and Roberto Mancini are passed on for not being in their 40s, while Frank de Boer and Thierry Henry’s national team links do them do favours. Meanwhile, Patrick Vieira’s Premier League experience is judged to mean little in the selection, leaving Allegri as the candidate.\nMASSIMILIANO ALLEGRI (AGE 49, JUVENTUS MANAGER)\nThe favourite. Currently in charge of Juventus, who are eight points clear at the top of Serie A.\nAllegri has never managed outside of Italy – but neither had his Juve predecessor Antonio Conte. Chelsea have reaped the rewards and Arsenal could too.\nAmid the talk of Arsenal and Allegri, some pundits in Italy have said they consider the 49-year-old a better tactician than Conte.\nAllegri has been crowned an Italian champion once with AC Milan and twice with Juventus, though a third is on its way. Once he completes the hat-trick of titles at Juve, Allegri may wish to test himself in the Premier League like Conte.\nLast summer he said: ‘I would certainly like to work abroad – we will see in two years when I am out of contract.’\nThat time could come this summer if Wenger leaves, with Allegri understood to be top of Arsenal’s wishlist.\nBOOKMAKERS’ ODDS: 13/8\nSPORTSMAIL’S LIKELIHOOD RATING: 8/10\nMassimiliano Allegri might follow Antonio Conte's footsteps and move from Turin to London\nDIEGO SIMEONE (AGE 46, ATLETICO MADRID MANAGER)\nAs the Premier League benefits from Jose Mourinho, Pep Guardiola, Jurgen Klopp, Conte, Mauricio Pochettino – all the world’s best bosses – there is a feeling one manager is missing.\nThat man is Diego Simeone, currently in charge of Atletico Madrid. If he was to take over at Arsenal, the collection could be considered complete.\nWenger comes across as softly spoken. Let Simeone loose in Arsenal’s changing room and they could get that change they have been craving.\nSimeone’s record speaks for itself – as a manager he led Atletico to the La Liga title against all odds and also won the Europa League.\nHe has twice been a runner-up in the Champions League with the Spanish club – while Arsenal can only dream of getting to the final of Europe’s elite competition.\nAs one of Europe’s best bosses, Simeone would excite fans and breathe new life into the Emirates Stadium. Yet he is – unfortunately – likely to be seen as too erratic by Arsenal’s cautious board.\nBOOKMAKERS’ ODDS: 14/1\nSPORTSMAIL’S LIKELIHOOD RATING: 3/10\nFiesty Diego Simeone could be considered to be too erratic by Arsenal's conservative board\nTHOMAS TUCHEL (AGE 43, BORUSSIA DORTMUND HEAD COACH)\nThe Borussia Dortmund boss who replaced Klopp at the Westfalenstadion.\nThere is an increasing belief that Tuchel could be convinced to leave the one-horse race that is the Bundesliga to join the Premier League if offered the opportunity.\nTuchel is a savvy tactical but also has a hint of Klopp in him by playing high-pressing football. That yellow wall at Dortmund must spark something in a manager.\nLast season he led BVB to second in the table. This season they are third behind Bayern Munich and RB Leipzig – 13 points off the top. They are, however, still in the Champions League.\nTuchel has only one year left on his current contract at the German club.\nArsenal could turn his head if they wanted to, though the north London club will be aware that he has yet to win a major trophy as a manager.\nBOOKMAKERS’ ODDS: 9/1\nSPORTSMAIL’S LIKELIHOOD RATING: 4/10\nThomas Tuchel, who replaced Jurgen Klopp at Borussia Dortmund, may leave the German club\nLUIS ENRIQUE (AGE 46, BARCELONA MANAGER, SOON TO BE A FREE AGENT)\nEnrique announced he is to leave Barcelona at the end of this season and so, naturally, his name was linked with Arsenal by the bookmakers.\nBarcelona are fresh from completing one of the greatest comebacks of all time following their 6-1 win over Paris Saint-Germain at the Nou Camp this week.\nArsenal failed to do that against Bayern Munich. Enrique got out of his players what Wenger couldn’t – although, granted, there is a sizeable gap in talent between Barca and Arsenal.\nThat win over PSG, without a doubt, is one for Enrique’s CV. Also on there are two La Liga titles and a Champions League trophy, among other achievements - including a treble in his first season.\nThe reason Enrique is leaving the Spanish club, though, is because he is feeling too tired.\nWould he then take on a project as big as Arsenal’s, one that requires a rebuild? Unlikely.\nBOOKMAKERS’ ODDS: 11/1\nSPORTSMAIL’S LIKELIHOOD RATING: 2/10\nLuis Enrique is leaving Barcelona but is unlikely to take on a rebuilding project this summer\nEDDIE HOWE (AGE 39, BOURNEMOUTH MANAGER)\nThe Bournemouth boss. The English option.\nA surprise suggestion but still one whose name is being mentioned by bookmakers – just as it was when the Football Association were searching for a new England manager.\nYet Howe is already planning for next season with Bournemouth in the Premier League.\nIndeed, on the same night that Arsenal were beaten 5-1 by Bayern Munich, Howe was at Loftus Road to watch the Championship clash between Queens Park Rangers and Barnsley.\nHe was there doing his homework ahead of a big summer of trying to bolster his Bournemouth squad.\nAt the age of 39, Howe still has plenty of time to take over at a top club, someday. Arsenal, surely, would come far too soon.\nBOOKMAKERS’ ODDS: 14/1\nSPORTSMAIL’S LIKELIHOOD RATING: 1/10\nEddie Howe is already planning for life next season in the Premier League with Bournemouth\nLEONARDO JARDIM (AGE 42, MONACO MANAGER)\nAnother on the shortlist is Monaco’s manager Jardim, who has been getting the best out of Radamel Falcao at the Stade Louis II.\nThe 42-year-old previously led Portuguese minnows Chaves and Beria-Mar to promotion.\nHe was also at Olympiakos, though was strangely sacked by the Greek club when they were top of the table by 10 points. They still went on to win the title.\nJardim has been at Monaco since 2014 and the French club currently sit top of Ligue 1 by three points with PSG and Nice trying to catch up.\nThe football they have been playing this season is mesmerising. In France’s top flight, Monaco have scored an extraordinary 82 goals in 28 games this season.\nA move to the Premier League would be a big step up for Jardim but, given Arsenal pride themselves on attractive football, he will be admired in their boardroom.\nBOOKMAKERS’ ODDS: 18/1\nSPORTSMAIL’S LIKELIHOOD RATING: 3/10\nLeonardo Jardim may be admired in Arsenal's boardroom due to his attacking playing style\nAND A FEW ALSO-RANS…\nRONALD KOEMAN (AGE 53, EVERTON MANAGER)\nSomeone who knows the Premier League but the Everton manager is apparently attracting attention from Barcelona. Likely to stay at Goodison Park in the summer, though.\nJORGE SAMPAOLI (AGE 56, SEVILLA MANAGER)\nThe Sevilla manager from Chile who knows Alexis Sanchez well. If he was to join, could Sanchez be convinced to stay? Maybe that’s why his name has been mentioned.\nRonald Koeman knows the Premier League but is likely to stay at Everton in the summer\nRAFA BENITEZ (AGE 56, NEWCASTLE UNITED MANAGER)\nThe Newcastle United chief who is leading the club back into the Championship. Another on the bookmakers’ lists but the former Liverpool manager is unlikely to be a true candidate for Arsenal.\nTHIERRY HENRY (AGE 39, BELGIUM ASSISTANT MANAGER)\nCurrently working with Roberto Martinez and the Belgium national team, the Arsenal legend could look to crack into coaching soon. Too soon for him to step up, though.\nPATRICK VIEIRA (AGE 40, NEW YORK CITY HEAD COACH)\nNew York City's manager, formerly of Manchester City reserves. Far too soon for him and it goes to show the bookmakers will take bets on anything.","url":"https://www.dailymail.co.uk/sport/football/article-4300910/Arsenal-manager-candidates-replace-Arsene-Wenger.html"}
