{"authors":["Amitai Winehouse For Mailonline"],"date_download":"2018-10-23 01:50:47","date_modify":"2018-10-23 01:50:47","date_publish":"2017-03-10 10:21:43","description":"They were afforded an opportunity to forget their 5-1 thrashing at the hands of Bayern Munich earlier this week on Thursday when they attended a launch night held by Oculus.","filename":"data/vaneerConsumption/ArsenalstarsescaperealityastheyattendOculusevent.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E22424200000578-0-image-a-11_1489142706292.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4300722_Arsenal-stars-escape-reality-attend-Oculus-event_1540259447.html","title":"Arsenal stars escape reality as they attend Oculus event","title_page":"Arsenal stars escape reality as they attend Oculus event | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Arsenal have had a difficult time recently, and it would be no surprise to hear that some of their players wanted to escape reality.\nThey were afforded an opportunity to forget their 5-1 thrashing at the hands of Bayern Munich earlier this week on Thursday when they attended a launch night held by Oculus.\nArsene Wenger's players tried on the virtual reality headsets and looked to be having a great time at the event, with left back Nacho Monreal the most obviously enthusiastic about the technology.\nArsenal players Nacho Monreal, Lucas Perez, Hector Bellerin, Emiliano Martinez and Danielle Carter (left to right) at Thursday night's event held by Oculus\nMonreal looks enthusiastic about the virtual reality headset during Thursday night's event\nArsenal reserve goalkeeper Martinez gets to grips with the gaming system on Thursday\nMonreal was joined at the event by compatriots Lucas Perez and Hector Bellerin, and fellow Spanish speaker Emiliano Martinez also attended.\nAnd Martinez took to Instagram to express how much he had enjoyed using the Oculus Rift.\nHe wrote: 'Down time with the boys last night @Oculus event!'\nThe foursome played a basketball game at the event, which was also attended by celebrities Jonathan Ross, Nick Grimshaw and band Foals.\nArsenal stars Bellerin and Martinez (left), and Perez and Monreal pose for photographs\nMartinez watches on as others laugh at Arsenal left back Monreal during the event\nChelsea youngsters Josimar Quintero, Kayne Ramsey and Kasey Palmer (left) and Arsenal Ladies star Danielle Carter (right) also attended the event organised by Oculus\nBellerin gets to grips with the virtual reality device after Arsenal's Champions League woe\nWHAT IS OCULUS? Oculus is a virtual reality headset developed by Oculus VR. It was first released on March 28, 2016. The huge success of the original crowdfunding push for the device prompted Facebook to purchase Oculus for $2billion (£1.64bn). It costs £499 to purchase one in the United Kingdom.\nArsenal's players were not the only footballers trying out the Oculus gear. Swansea's Jordi Amat also showed up.\nAnd Chelsea had their own representatives, with Huddersfield Town loanee Kasey Palmer and academy players Josimar Quintero and Kayne Ramsey in attendance.\nArsenal Ladies star Danielle Carter posed for a photo with her fellow Arsenal players.\nBellerin and Co take on Lincoln City in the FA Cup quarter-final on Saturday.","url":"https://www.dailymail.co.uk/sport/football/article-4300722/Arsenal-stars-escape-reality-attend-Oculus-event.html"}
