{"authors":["Pa Reporter"],"date_download":"2018-10-23 03:44:58","date_modify":"2018-10-23 03:44:58","date_publish":"2017-03-10 13:34:13","description":"Ahead of the weekend's Premier League action, Sportsmail will be providing you with all you need to know teams, kick-off and stats, ahead of Arsenal's FA Cup clash with Lincoln City.","filename":"data/vaneerConsumption/ArsenalvsLincolnCityTeamnewskickoffodds.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E0E7A6F00000578-0-image-a-6_1489144384098.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4300922_Arsenal-vs-Lincoln-City-Team-news-kick-odds_1540266298.html","title":"Arsenal vs Lincoln City: Team news, kick-off, odds","title_page":"Arsenal vs Lincoln City: Team news, kick-off, odds | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ahead of the weekend's Premier League action, Sportsmail will be providing you with all you need to know about every fixture, with team news, provisional squads, betting odds and Opta stats. Here is all the information you need for Arsenal's FA Cup clash with Lincoln City.\nArsenal vs Lincoln City (Saturday - The Emirates)\nTeam news\nArsenal\nArsenal will be without both Alex Iwobi and Danny Welbeck for Saturday's FA Cup sixth-round clash with Lincoln.\nThe pair have been struck down with illness while manager Arsene Wenger is sweating over Mesut Ozil, who is also sick.\nArsenal are sweating on the fitness of playmaker Mesut Ozil, who has been out with illness\nSanti Cazorla (Achilles) and Mohamed Elneny (ankle) also miss out, with Wenger likely to make a number of changes for the visit of the Vanarama National League leaders.\nProvisional squad: Cech, Ospina, Martinez, Bellerin, Holding, Gabriel, Mertesacker, Koscielny, Mustafi, Monreal, Gibbs, Maitland-Niles, Coquelin, Xhaka, Ramsey, Oxlade-Chamberlain, Walcott, Reine-Adelaide, Perez, Sanchez, Giroud.\nLincoln City\nLincoln have been given permission to include Aston Villa left-back Riccardo Calder and Doncaster goalkeeper Ross Etheridge in their FA Cup quarter-final squad at Arsenal after signing the duo on loan.\nForward Lee Angol marked his Imps debut with a hat-trick for the National League leaders against Braintree on Tuesday night, but is cup-tied having played against Chelsea for parent club Peterborough in the third round.\nForward Lee Angol marked his Imps debut with a hat-trick for the National League leaders\nMidfielder Josh Ginnelly, on loan from Burnley, is also ineligible after he made an appearance in the FA Cup during a spell with Walsall, while defender Lee Beevers has been out since the end of October with a knee problem.\nProvsional squad: Farman, Habergham, Wood, Waterfall, Raggett, Arnold, Woodyard, Hawkridge, Power, Muldoon, Rhead, Walton, Marriott, McMenemy, Long, Ward, Southwell, McCombe, Calder, Etheridge.\nKey match stats (supplied by Opta)\nArsenal last played Lincoln in any competition in March 1915, losing 1-0 to them away from home in a second division match.\nLincoln are the first non-league side to be in the last eight of the FA Cup since QPR in 1913/14. This is the furthest they’ve ever gone in the competition.\nThe last non-league team to play in an FA Cup semi-final were Swindon in 1911/12.\nBy contrast, the Gunners are looking to make the semi-final of the competition for the third time in the last four seasons, having won the trophy in 2013/14 and 2014/15.\nArsene Wenger has taken Arsenal to the sixth round stage 12 times before, progressing to the semi-final on 10 occasions.\nSean Raggett’s winning goal in Round 5 was Lincoln’s only shot on target in the match\nLincoln’s only previous FA Cup progressions at the expense of top-flight teams have been against West Brom in the third round in 1960/61 and against Burnley in the last round.\nThe Imps have never won away at Arsenal in any competition (D3 L10) but this will be their first visit in over 102 years.\nTheo Walcott has scored four times in the FA Cup this season, with no player left in the competition having scored more than him.\nWalcott has scored six times in his last four FA Cup games but none of those goals have come at the Emirates. His last FA Cup goal there was in January 2012 v Aston Villa.\nSean Raggett’s winning goal in Round 5 was Lincoln’s only shot on target in the match. Raggett also scored in Round 1 v Altrincham.","url":"https://www.dailymail.co.uk/sport/football/article-4300922/Arsenal-vs-Lincoln-City-Team-news-kick-odds.html"}
