{"authors":["Sportsmail Reporter"],"date_download":"2018-10-22 23:29:18","date_modify":"2018-10-22 23:29:18","date_publish":"2016-01-29 11:21:11","description":"Ahead of this weekend's FA Cup action, Sportsmail will be providing you with all you need to know about every fixture, with team news, provisional squads, betting odds and Opta stats.","filename":"data/vaneerConsumption/ArsenalvsBurnleyTeamnewskickofftimeprobablelineupsoddsandstatsfortheFACupclash.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30A13C9800000578-0-image-a-14_1454065574794.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422576_Arsenal-vs-Burnley-Team-news-kick-time-probable-line-ups-odds-stats-FA-Cup-clash_1540250958.html","title":"Arsenal vs Burnley: Team news, kick-off time, probable line-ups, odds and stats for the FA Cup clash","title_page":"Arsenal vs Burnley: Team news, kick-off time, probable line-ups, odds and stats for the FA Cup clash  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ahead of this weekend's FA Cup action, Sportsmail will be providing you with all you need to know about every fixture, with team news, provisional squads, betting odds and Opta stats. Here is all the information you need for Arsenal's clash with Championship side Burnley.\nTeam news\nArsenal\nMidfielder Mohamed Elneny is expected to make his debut for Arsenal in their Emirates FA Cup fourth-round tie against Burnley.\nFrancis Coquelin and Tomas Rosicky (both knee) are also in line to return for Arsene Wenger's side, while goalkeeper David Ospina will replace Petr Cech.\nDanny Welbeck is back in full training, but will not feature, while Jack Wilshere and Santi Cazorla remain sidelined. Per Mertesacker is suspended.\nProvisional squad: Cech, Ospina, Macey, Monreal, Gibbs, Koscielny, Gabriel, Bellerin, Debuchy, Chambers, Ramsey, Elneny, Coquelin, Rosicky, Flamini, Ozil, Oxlade-Chamberlain, Reine-Adelaide, Iwobi, Sanchez, Campbell, Walcott, Giroud\nMohamed Elneny is expected to make his debut for Arsenal in their FA Cup fourth-round tie against Burnley\nBurnley\nDean Marney is doubtful for Burnley due to a calf injury that has sidelined him recently, and Matt Gilks (elbow) is out.\nGoalkeeper Paul Robinson is set to be in the matchday squad after signing this month, while Ashley Barnes and Lukas Jutkiewicz (cruciate ligament) are out.\nProvisional squad: Heaton, Lowton, Robinson Duff, Keane, Mee, Gray, Marney, Vokes, Kightly, Barton, Jones, Taylor, Hennings, Ulvestad, Boyd, Ward, Long, Darikwa, Anderson, Arfield\nBurnley manager Sean Dyche will take his side to the Emirates Stadium to face Arsenal\nARSENAL v BURNLEY Kick-off: Saturday, 3pm Odds (subject to change): Arsenal 4/9 Draw: 4/1 Burnley 9/1 Referee: Roger East Managers: Arsene Wenger (Arsenal), Sean Dyche (Burnley)\nKey match stats (supplied by Opta)\nArsenal have won their last five FA Cup ties against Burnley, scoring 16 and conceding just once. The one goal Burnley did score was in their biggest FA Cup loss since 1896 (Burnley 1-7 Arsenal, 20/02/1937).\nThe Gunners have lost just one of their 40 FA Cup games against lower league opposition under Wenger’s management (W31 D8).\nBurnley have progressed past the fourth round on five of the last six occasions, though they’ve not reached the fifth round since 2011.\nArsenal have won 32 of their last 39 home FA Cup ties at home (D6 L1).\nOlivier Giroud has scored nine goals in his last 13 FA Cup appearances for Arsenal.\nBurnley have won their last three away games in all competitions, scoring 10 goals and conceding just two.","url":"https://www.dailymail.co.uk/sport/football/article-3422576/Arsenal-vs-Burnley-Team-news-kick-time-probable-line-ups-odds-stats-FA-Cup-clash.html"}
