{"authors":["Matthew Smith For Mailonline"],"date_download":"2018-10-23 02:41:07","date_modify":"2018-10-23 02:41:07","date_publish":"2017-03-10 11:53:52","description":"The team also features heavy presences from Germany players and Real Madrid stars - Ozil's country and former club. However Lionel Messi and Gareth Bale are among those missing out.","filename":"data/vaneerConsumption/ArsenalmidfielderMesutOzilpickshisworldsbestXI.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22BC7600000578-0-image-a-110_1489147877486.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4300888_Arsenal-star-Mesut-Ozil-picks-just-TWO-Gunners-world-XI_1540262467.html","title":"Arsenal midfielder Mesut Ozil picks his world's best XI","title_page":"Arsenal midfielder Mesut Ozil picks his world's best XI | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mesut Ozil named just two Arsenal team mates after being asked to pick his version of the world's best XI.\nThe Gunners midfielder included just three members of his club in the team - himself, right-back Hector Bellerin, and forward Alexis Sanchez.\nThe team also features heavy presences from Germany players and Real Madrid stars - Ozil's country and former club.\nMesut Ozil named just two Arsenal team mates after being asked to pick his world's best XI\nRight back Hector Bellerin is one of the three Arsenal stars who Ozil chose for his team\nAlexis Sanchez is also included despite recent events linking him with leaving Arsenal\nOzil picked a 4-3-3 heavily featuring Real Madrid players and his Germany team mates\nOzil chose Spanish defender Bellerin because he 'is the fastest player in the world I think'\nOzil: 'On the right Sanchez, because he works a lot and really wants to be successful'\nThree members of the current world champions join Ozil in his team - goalkeeper Manuel Neuer, centre back Jerome Boateng, and defensive midfielder Ilkay Gundogan.\nThe rest of the squad is made up of current members of the Real team, who Ozil left in a £42.5million transfer to north London in September 2013.\nBallon D'Or and Euro 2016 winner Cristiano Ronaldo makes it, as does fellow BBC front man Karim Benzema. Gareth Bale misses out, perhaps due to his Tottenham Hotspur connections - although ex-Spurs man and current Bernabeu hero Luka Modric does make the cut.\nThree members of the Germany side join Ozil in his team, including goalkeeper Manuel Neuer\nCentre back Jerome Boateng is another pick by Ozil from the current world champions\nManchester City and Germany midfielder Ilkay Gundogan is the anchor in Ozil's dream side\nReal captain Sergio Ramos and left-back Marcelo make up the XI.\nAlso notable by his absence is Lionel Messi, the Barcelona and Argentina forward not lining up among Ozil's favourites.\nHowever the lack of Gunners is notable, particularly in a week where Arsenal were humiliated in the Champions League by Bayern Munich 10-2 on aggregate after 5-1 defeats home and away.\nBallon D'Or and Euro 2016 winner Cristiano Ronaldo makes it but Lionel Messi does not\nRonaldo's fellow BBC front man Karim Benzema leads the line while Gareth Bale misses out\nBernabeu hero Luka Modric makes the cut despite his Tottenham Hotspur connections\nReal Madrid captain Sergio Ramos is at the heart of Ozil's ideal defensive line-up\nReal left back Marcelo is chosen above Arsenal options Nacho Monreal or Kieran Gibbs\nExplaining his reasons behind choosing the Arsenal layers who did make it, Ozil said pace and ambition were the major factors.\nHe said: 'Bellerin is the fastest player in the world I think. On the right Sanchez because he works a lot and really wants to be successful.'\nIt is thought Sanchez wants to be successful away from Arsenal, the Chilean linked heavily with a move away from the Emirates Stadium in the summer after a training ground bust up, which saw him benched for the Premier League game at Liverpool by manager Arsene Wenger.","url":"https://www.dailymail.co.uk/sport/football/article-4300888/Arsenal-star-Mesut-Ozil-picks-just-TWO-Gunners-world-XI.html"}
