{"authors":["Jonny Singer For Mailonline"],"date_download":"2018-10-22 22:35:41","date_modify":"2018-10-22 22:35:41","date_publish":"2016-01-29 09:48:41","description":"Arsene Wenger insists that Arsenal do not need to buy in order to keep up their challenge for a first Premier League title since 2004.","filename":"data/vaneerConsumption/ArsenalwillNOTbebuyinganymoreplayersinJanuaryasArseneWengerinsistswehavethequalityandnumbers.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/09/30A13E4700000578-0-image-a-19_1454060905366.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422456_Arsenal-NOT-buying-players-January-Arsene-Wenger-insists-quality-numbers_1540247741.html","title":"Arsenal will NOT be buying any more players in January as Arsene Wenger insists 'we have the quality and numbers'","title_page":"Arsenal will NOT be buying any more players in January as Arsene Wenger insists 'we have the quality and numbers' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Arsene Wenger insists that Arsenal do not need to buy in order to keep up their challenge for a first Premier League title since 2004.\nWenger did not buy a single outfield player last summer, and has made just one signing in this window, bringing in midfielder Mohamed Elneny, who is yet to make his debut.\nBut with the likes of Francis Coquelin, Danny Welbeck and Tomas Rosicky returning to fitness, Wenger believes that there is no need to invest further.\nArsenal forward Alexis Sanchez trains this week as he nears a return to first-team action\nWith Danny Welbeck (above) fit for the first time since April, Wenger says he does not need to buy this January\nWenger (right) is showing faith in the players who have kept Arsenal in the title race so far\nWenger hinted that out of favour right back Mathieu Debuchy could leave the club during the current window, although a deal is not yet done.\n'Debuchy might go somewhere but I don't know where at the moment, but that decision has to be made very quickly now because it is only 48 hours to go and he has much interest,' said the Arsenal boss.\n'But I have a number of people who can play right back so I open the door for him because at the moment he does not play and he has Bellerin in front of him.'\nHowever, with 23 of his 25 senior players now fit, with Coquelin and Rosicky available for Saturday's FA Cup tie against Burnley and Welbeck in line for an under-21 return, he denied that any more senior players would arrive at the club.\n'Welbeck is coming back and Alexis Sanches is back,' said Wenger on Friday. We have the quality and the players that we need up front.'\nHowever, Gunners fans will be treated to one new player on Saturday, with Elneny set to play his first game for the club.\nFrancis Coquelin (right) is back in training with Arsenal and could play his first game since November\nWenger also opened the way for Mathieu Debuchy (above) to leave the club, but said he would not be buying\n'It's a possibility,' admitted Wenger, who said he would play a 'Premier League team' against the Championship high-fliers.\n'He's naturally a box to box player, with a bit more defensive minded than a usual box to box player. He has good technique, good vision, quick decision making and is very mobile.'\nOne player that Wenger did confirm would start is back-up goalkeeper David Ospina, who has struggled this season.\nOspina has played just three times for his club, losing twice in two Champions League games, the latter of which included an embarrassing gaffe against Olympiacos.\nDavid Ospina (pictured) is set to play just his fourth game of the season for the Gunners, ahead of Petr Cech\nThe Arsenal boss also hinted that new signing Mohamed Elneny (above) could make his debut against Burnley","url":"https://www.dailymail.co.uk/sport/football/article-3422456/Arsenal-NOT-buying-players-January-Arsene-Wenger-insists-quality-numbers.html"}
