{"authors":["Harriet Mallinson For Mailonline"],"date_download":"2018-10-23 02:42:56","date_modify":"2018-10-23 02:42:56","date_publish":"2016-01-28 17:45:37","description":"Arteval Duarte performed the gruesome spectacle in Goianésia do Pará, Brazil. In the stomach-churning footage he inserts the two creatures simultaneously before letting them crawl out.","filename":"data/vaneerConsumption/ArtevalDuarteputsalivetarantulaandbatinhismouthinGoiansiadoParBrazil.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AC716700000578-0-image-a-47_1453999872441.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421271_Arteval-Duarte-puts-live-tarantula-bat-mouth-Goian-sia-Par-Brazil_1540262576.html","title":"Arteval Duarte puts a live tarantula and bat in his mouth in Goianésia do Pará, Brazil","title_page":"Arteval Duarte puts a live tarantula and bat in his mouth in Goianésia do Pará, Brazil | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the repulsive moment a man puts a live tarantula and a bat in his mouth at the same time.\nArteval Duarte performed the spectacle in Goianésia do Pará, Brazil.\nHe shows the creatures to the camera to fully emphasize their gruesomeness. He then lets the furry spider crawl around the table and even extends the bat's leathery-looking wings.\nSnack time: This is the stomach-churning moment a man puts a live tarantula and a bat in his mouth. Arteval Duarte performed the spectacle in Goianésia do Pará, Brazil\nWhat a mouthful: With a slight look of fear in his eyes, Duarte places the spider briefly in his mouth, removes it... and then fully inserts it. His faces crumples into a grimace as he makes sure the arachnid is fully in, his teeth locked so it can't escape\nHe narrates his actions in Portuguese throughout.\nWith a slight look of fear in his eyes, Duarte places the spider briefly in his mouth, removes it... and then fully inserts it.\nHis faces crumples into a grimace as he makes sure the arachnid is fully in, his teeth locked so it can't escape.\nPainstakingly Duarte then tries to fold the bat into an edible shape before putting that too inside his mouth.\nHe certainly doesn't seem to be enjoying the experience.\nHe then tilts his head back and open his mouth and lets the bat clamber out then fly off. The spider too crawls out and continues up over his face to his eyes.\nNo doubt grateful the ordeal is over, Duarte gives the camera a thumbs up.\nLook of pain: His faces crumples into a grimace as he makes sure the arachnid is fully in, his teeth locked so it can't escape. Painstakingly Duarte tries to fold the bat into an edible shape before putting that too inside his mouth. He then tilts his head back and open his mouth and lets the bat clamber out then fly off\nEverybody out: The spider too then crawls out and continues up his face to his eyes\nOther clips of the daredevil show him inserting four snakes at the same time. He has been nicknamed the ‘Ninja of Serpents’ thanks to his snake antics, all of which he finds in the wild.\nOn one occasion he has put three tarantulas in simultaneously and on another a poisonous frog and venomous snake. He has also been known to insert scorpions and centipedes.\nDuarte caries out these gruesome feats as part of an ongoing demonstration to raise awareness about deforestation in the Amazon.\nThe performer has worked with reptiles for over 15 years.\nDedicated: Duarte caries out these gruesome feats as part of an ongoing demonstration to raise awareness about deforestation in the Amazon","url":"https://www.dailymail.co.uk/news/article-3421271/Arteval-Duarte-puts-live-tarantula-bat-mouth-Goian-sia-Par-Brazil.html"}
