{"authors":[],"date_download":"2018-10-22 20:58:54","date_modify":"2018-10-22 20:58:54","date_publish":"2014-06-03 19:05:19","description":"A museum is displaying a copy of Vincent van Gogh's ear, grown using genetic material provided by one of the artist's living relatives.","filename":"data/vaneerConsumption/ArtImitatesLifeReplicaofVanGoghsEarCreatedFromLiveCells.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/484921/140603-van-gogh-ear-1452_162bea40d837fa579555dd193435b631.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_weird-science_art-imitates-life-replica-van-goghs-ear-created-live-cells-n121536_1540241934.html","title":"Art Imitates Life: Replica of Van Gogh's Ear Created From Live Cells","title_page":"Art Imitates Life: Replica of Van Gogh's Ear Created From Live Cells","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"I use science basically like a type of brush, like Vincent used paint,\" Strebe told The Associated Press in a telephone interview Tuesday.\nThe U.S.-based artist said the ear, which was grown at Boston's Brigham and Women's Hospital, is being kept alive inside a case containing a nourishing liquid and could theoretically last for years.\nConvincing Lieuwe van Gogh to take part was easy. \"He loved the project right away,\" said Strebe.\nLieuwe and Vincent van Gogh share about 1/16th of the same genes, including the Y-chromosome that is passed down the male lineage.\nBut hopes of using genetic material that belonged to the post-Impressionist master himself were dashed when DNA extracted from an envelope turned out to belong to someone else. \"The postman messed it up,\" Strebe joked.\nStill, work is underway with a female relative to include mitochondrial DNA — passed down the mother's line — for future installations.\nThe exhibition, at which visitors can speak into the ear through a microphone, lasts until July 6. Strebe said she plans to display the ear in New York next year.\n— Associated Press","url":"https://www.nbcnews.com/science/weird-science/art-imitates-life-replica-van-goghs-ear-created-live-cells-n121536"}
