{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-31 00:04:05","date_modify":"2018-10-31 00:04:05","date_publish":"2016-12-05 00:00:00","description":"Gina Miller says he vilification in the press means she can't take the tube, work from her office, or see her family anymore.","filename":"data/vaneerConsumption/Article50claimantGinaMillersaysshesscaredtoleavehouseafterthreats.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_article-50-brexit-eu-gina-miller-scared-to-leave-house-threats-daily-mail-2016-12_1540944245.html","title":"Article 50 claimant Gina Miller says she's scared to leave house after threats","title_page":"    Article 50 claimant Gina Miller says she's scared to leave house after threats - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Gina Miller, the lead claimant in the Article 50 court case. AP Photo/Matt Dunham LONDON — Gina Miller, the face of the legal challenge to the government's right to trigger Article 50, claims she can no longer live a normal life after being attacked in the right-wing press.\nMiller told The Guardian in an interview that she could no longer take the tube, work in her office, or spend time with her family after all the negative coverage of the case in papers like the Sun and the Daily Mail. \"I don't go anywhere - it has been a complete poisoned chalice,\" she told The Guardian.\nWriting in yesterday's Mail on Sunday,* Miller said: \"There has been a great deal of abuse, both political and personal. I am not exaggerating when I say that since the original High Court decision last month, I have felt frightened and find it difficult to leave the house.\"\nMiller has already had to spend £60,000 on security measures after receiving rape and death threats. She wrote in the Mail on Sunday: \"It began with racist, misogynistic and obscene messages online, on the phone and in the post and then became even more sinister with threats of violence, rape and murder.\"\nMiller told The Guardian that the right-wing press has also \"vilified\" the judges involved with the case. The Daily Mail ran a piece over the weekend profiling the Supreme Court judged with the headline: \"11 unaccountable individuals will consider a case that could thwart the will of the majority on Brexit. The Mail makes no apology for revealing their views - and many have links to Europe.\"\nIt follows a controversial front page last month calling the three judges who sided with Miller in the initial case \"Enemies of the People.\" The appeal will be heard this week by the Supreme Court.\n\"It is the judges' role to uphold the rule of law and yet they have been vilified by some politicians and commentators who dismiss their independence and objectivity, simply because they don't like the decision,\" she wrote in the Mail on Sunday.\nMiller is one of the lead claimants in a case arguing that the government must consult parliament before triggering Article 50, the process which begins Britain's exit from the European Union. The High Court sided with her argument but the government appealed.\nMiller told the Guardian that the case was not about Brexit but simply ensuring that due course is followed and the law respected. She said: \"We would be undoing 400 years of democracy and sovereignty if the government were allowed to use this royal prerogative.\"\nHowever, right-wing, eurosceptic parts of the press have attacked her personally for her perceived anti-Brexit stance, with The Sun dubbing her a \"foreign-born multimillionaire.\"\nDavid Greene, a solicitor representing another claimant in the case, told the Guardian: \"It is a sad day when space needs to be made at the highest civil court for security guards for parties and party anonymity is required to protect litigants seeking their legitimate right to bring this matter to court.\n\"Neither the parties, including my client, nor judges, are the enemies of the people. The court process and an independent judiciary are the hallmark of a democracy. It would be a sad day indeed when an executive can ride roughshod over the judiciary, portrayed as anti-democratic. To the contrary, we should be celebrating the court process and the rule of law.\"\n*Wondering why Gina Miller is writing for the Mail on Sunday while also attacking the Daily Mail for vilifying judges? They're actually separate papers with separate staff and the Mail on Sunday was one of the few national papers to actually back the Remain campaign. It is much more centerist than its daily stablemate.","url":"https://www.businessinsider.com/article-50-brexit-eu-gina-miller-scared-to-leave-house-threats-daily-mail-2016-12"}
