{"authors":["Kenneth Dickerman","Photo Editor"],"date_download":"2018-10-21 03:01:17","date_modify":"2018-10-21 03:01:17","date_publish":"2018-08-03 10:00:53","description":"A new exhibition in London explores the work of Omar Victor Diop.","filename":"data/vaneerConsumption/ArtistOmarVictorDiopsworkrecastshistoryandtheglobalpoliticsofblackresistance.json","image_url":"https://www.washingtonpost.com/resizer/41AKM9jjySJm0llKsvcJqg4gdh4=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BIH5ZGYCEE347OQTKGBBIHBIIE.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_08_03__1540090877.html","title":"Artist Omar Victor Diop’s work ‘recasts history and the global politics of black resistance’","title_page":"Artist Omar Victor Diop’s work ‘recasts history and the global politics of black resistance’ - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Omar Victor Diop, Thiaroye 1944. From Liberty (2016). (Omar Victor Diop/MAGNIN-A, Paris)\nPhoto Editor\nIn 1944, the Senegalese Tirailleurs (West African soldiers who fought in the colonial infantry in the French Army during the Second World WarI) were released from German prisons and repatriated with the promise of remuneration, including pensions. These infantrymen came from all over the A.O.F. and the A.E.F. (French West Africa and French Equatorial Africa), which stretched from Senegal to the Congo. On 1 December 1944, a group of soldiers staged a military coup at the Thiaroye camp on the outskirts of Dakar, Senegal, to protest against poor working conditions and France’s failure to compensate them for their service as promised. A bloody repression was organised by the colonial authorities in response, during which approximately 70 of these Second World War veterans were killed. Commonly known as the Thiaroye Massacre, the mutiny is seen as a crucial revolt against the colonial regime that constituted the beginnings of a nationalist movement.\nOmar Victor Diop, Frederick Douglass 1818–1895. From Diaspora (2014) (Omar Victor Diop/MAGNIN-A, Paris)\nFrederick Douglass was an African-American social reformer, statesman and abolitionist celebrated for his accomplished oratory and writing skills. After escaping from slavery in Maryland in 1838, he became a national leader of abolitionist movements in New York and Massachusetts. He wrote three acclaimed autobiographies detailing his experience as a slave: Narrative of the Life of Frederick Douglass, an American Slave (1845), My Bondage and My Freedom (1855) and Life and Times of Frederick Douglass (1881). In 1847 he founded his own abolitionist newspaper, North Star. Douglass made several trips to Europe, and during one of his visits to England he became legally free when British supporters raised funds to buy his freedom from his American owner. He was the most photographed American of the nineteenth century, and he is also remembered for being the first African-American to be nominated for the position of Vice President of the United States. A symbol for freedom, human rights, equality, Douglass also supported campaigns for women’s suffrage. Original portrait by Samuel J. Miller.\nSenegalese photographer Omar Victor Diop is having his first solo exhibition in Britain at London’s Autograph gallery. It contains images from two projects, “Liberty” and “Diaspora.” A statement from the gallery says that Diop’s work, “recasts history and the global politics of black resistance.”\nIn each image, Diop creates self portraits in which he has cast himself in different roles. He includes an artwork description, shown verbatim with the images here, that provides information on the piece he bases his portrait upon but also, more important, the details of the subject of the artwork and their role in history.\nIn “Liberty,“ Diop’s work centers on his reinterpretation of “defining moments of historical revolt and black struggle in Africa and the diaspora.” In this series, Diop portrays an African railway worker, French migrant, World War II soldier, Jamaican maroon and also a member of the Black Panther Party. According to Diop, these images constitute “a reinvented narrative of the history of black people, and therefore, the history of humanity and of the concept of Freedom.”\nThe next series included in the exhibition is called “Diaspora,” and once again, Diop has created self-portraits. This time, the work is based on historical paintings, but he reinterprets those paintings, including contemporary references to soccer. The portraits feature a group of notable Africans in European history stretching from the 15th century to the 19th century. Among those people are abolitionist Frederick Douglass and Olaudah Equiano, a freed slave, writer and activist in London. Diop describes this body of work in the following words:\n“Football [soccer] is an interesting global phenomenon that for me often reveals where society is in terms of race. When you look at the way that the African football royalty is perceived in Europe, there is an interesting blend of glory, hero-worship and exclusion. Every so often, you get racist chants or banana skins thrown on the pitch and the whole illusion of integration is shattered in the most brutal way. It’s that kind of paradox I am investigating in the work.”\nThe exhibition is at the Autograph through Nov. 3. You can find more information at the gallery’s website.\nOmar Victor Diop, Selma 1965. From Liberty (2016). (Omar Victor Diop/MAGNIN-A, Paris)\nBetween 7 and 21 March 1965, three protest marches to demand the right to vote for African-American citizens were held along the 80-kilometre highway linking Selma to the state capital of Montgomery in Alabama, USA. These pivotal marches represented a defining moment in the struggle for civil rights and were instrumental in the fight for black voting rights. During the first of these marches, on 7 March, 600 protesters demanded an end to discrimination in voter registration, many of whom were severely attacked by law enforcement agencies, state troopers and white separatists. This event became known as Bloody Sunday. Dr. Martin Luther King participated in the subsequent marches, on 9 and 17 March. Numerous killings, abuse by the police and the Ku Klux Klan, as well as the legal battles that marked the weeks of protests, all drew the attention of the national and international community to the issues of civil rights. The marches led to the signing of the Voting Rights Act of 1965.\nOmar Victor Diop, Breakfast for the Children of the Black Panthers 1969. From Liberty (2016). (Omar Victor Diop/MAGNIN-A, Paris)\nThe Free Breakfasts for Children initiative was a revolutionary community programme started by the Black Panthers at their headquarters in Oakland, California. It was one of the first school food programmes in the country, providing free breakfasts to disadvantaged children each morning. Based on the belief that children could not take full advantage of their education by going to school hungry, it reflected the Black Panthers’ key message of self-determination and illustrated their belief in the importance of education. The programme was funded through donations from within the communities being served, receiving support from local stores, churches and groceries. In its first year, the programme became so popular that it was extended all over the United States, and by the end of 1969 the Black Panthers were serving full free breakfasts to 20,000 school-aged children in 19 different cities. Inspired in part by the ideas and actions of the Black Panthers in the 1960s, the US Department of Agriculture later started their own School Breakfast Programme, which feeds nearly 13 million students daily.\nOmar Victor Diop, The Women’s War 1929. From Liberty (2016). (Omar Victor Diop/MAGNIN-A, Paris)\nIn 1929, tens of thousands of south-eastern Nigerian women rebelled against British colonial powers in what is known as the Women’s War, or the Aba Women’s Riots. This insurgent movement brought together more than 25,000 women in a fight against policies imposed by British authorities: in particular, special taxes levied on female market traders, which were implemented by male leaders (warrant chiefs) appointed by a colonial governor. The women rebelled above all to preserve the status they had held in their traditional societies before the arrival of the British, who felt the matriarchal system was against the moral order. The women’s activism prompted colonial authorities to drop their plans and to reduce the power of the warrant chiefs. Considered as the first major challenge to British authority in Nigeria and West Africa during the colonial period, the Women’s War took months for the government to suppress, and became a historic example of feminist and anti-colonial protest.\nOmar Victor Diop, Nanny and Quao, Jamaica, 1720. From Liberty (2016). (Omar Victor Diop/MAGNIN-A, Paris)\nQueen Nanny (c. 1686 – c. 1755), a Jamaican national heroine, was a major figure of the Maroon resistance in the eighteenth century. Nanny was born into the Asante people of what is today known as Ghana, although much of what is known about her derives from oral history, as little textual evidence exists. It is believed that she fled the plantations with her brother Quao, and together they founded the Maroon community of escaped slaves around 1720 in the Blue Mountains in the town of Portland, Jamaica. This area, named Nanny Town, was considered inaccessible by the British because of its altitude and the lack of trails leading to it. The Maroons, a majority of whom were descendants of West Africans, led most of the slave rebellions in Jamaica, helping to free slaves from plantations and integrating them into their community. Nanny herself is credited with organising the release of several hundreds of slaves during a period of 30 years.\nOmar Victor Diop, Pedro Camejo 1790–1821. From Diaspora (2014). (Omar Victor Diop/MAGNIN-A, Paris)\nPedro Camejo was born in San Juan de Payara, Venezuela. Better known as ‘Negro Primero’ or ‘The First Black’, he fought in the rebel army during the Venezuelan War of Independence, reaching the rank of lieutenant. He was one of the 150 lancers who participated in the Battle of Las Queseras del Medio (1819), for which he received the Order of Liberators of Venezuela. He died in the Battle of Carabobo on 24 June 1821, an event that led to the independence of Venezuela and the establishment of the Republic of Gran Colombia. Camejo was given the nickname ‘Negro Primero’ for his great weaponry skills, courage and bravery, fighting at the forefront of the battlefield.\nOmar Victor Diop, Omar Ibn Saïd 1770–1964. From Diaspora (2014). (Omar Victor Diop/MAGNIN-A, Paris)\nOmar Ibn Saïd, nicknamed Uncle Moreau and Prince Omeroh, was an Islamic scholar born to a wealthy family in Futa Toro, a northern province in modern-day Senegal, where he extensively studied arithmetic and theology with prominent Muslim scholars. He was taken captive during a military conflict, and brought to the United States in 1807. Although he remained enslaved for the rest of his life, he authored a series of works on history and theology, including 14 manuscripts written in Arabic, and a memoir entitled Autobiography of Omar Ibn Saïd, Slave in North Carolina, 1831. He died in North Carolina in 1864. Original portrait by an unknown artist.\nOmar Victor Diop, Ayuba Suleiman Diallo 1701–1773. From Diaspora (2014) (Omar Victor Diop/MAGNIN-A, Paris)\nAyuba Suleiman Diallo, also called Job ben Solomon, was born to a family of Muslim clerics in Bun-du, Senegal. A victim of the Atlantic slave trade in 1731, he worked on a plantation in America before arriving in London in 1733, where he was bought out of slavery by public subscription. Ayuba’s memoirs were published in 1734, and are considered to be one of the earliest understandings in Britain of West African culture, Islam and slavery. Diallo is cited as a pioneering figure in asserting the moral rights and humanity of black people. Original painting by William Hoare of Bath.\nOmar Victor Diop, Trayon Martin, 2012. From Liberty (2016). (Omar Victor Diop/MAGNIN-A, Paris)\nTrayvon Benjamin Martin (1995–2012) was an African-American teenager who was murdered in 2012 in Sanford, Florida. On his way to his father’s home from buying candy and a can of fruit juice, 17-year-old Trayvon crossed a fenced area where there had been a series of burglaries. Former neighbourhood watch champion and resident of this gated neighbourhood, George Zimmerman, took matters into his own hands despite orders from the police not to do so, having previously contacted them by telephone on several recorded 911 calls. An altercation ensued and the unarmed teenager was fatally shot in the chest. After his trial, Zimmerman was acquitted by an all-female jury of six women. The killing of Trayvon Martin became a catalyst in the fight against perpetual violence and systematic racism towards black people and members of the African-American community, triggering international activist movements, and Black Lives Matter campaigns. One of the most popular protest marches was the Million Hoodie March held in March 2012 in New York, where thousands of people came together dressed in hooded jumpers similar to the one worn by the young Trayvon Martin on the day of his killing.\nOmar Victor Diop, Albert Badin 1747?–1822. From Diaspora (2014). (Omar Victor Diop/MAGNIN-A, Paris)\nAdolf Ludvig Gustav Fredrik Albert Badin, né Couchi, was a Swedish court-servant and diarist. Born in St. Croix in the Danish West Indies, he was brought to Sweden in 1757 at the age of seven, and presented as a ‘gift’ to Louisa Ulrika of Prussia, Queen of Sweden. Well-educated and fluent in Swedish, French, German and Latin, Badin also served at the royal court as the Queen’s Emissary to France on several occasions. He collected an extensive library consisting of 900 volumes, mostly in French, which makes him one of the first recorded book collectors of African origin. Original painting by Gustaf Lundberg.\nOmar Victor Diop, Jean-Baptiste Belley 1746?–1805?. From Diaspora (2014). (Omar Victor Diop/MAGNIN-A, Paris)\nJean-Baptiste Belley, also known as Mars, was born on the island of Goree, Senegal. Kidnapped by slave catchers when he was aged two, he was taken to the French colony of Saint Domingue, present-day Haiti. He later purchased his freedom, joined the army and fought alongside Toussaint L’Ouverture in the Haitian Revolution. In 1793, Belley was one of three representatives elected to the French Convention, becoming the first black deputy to take a seat. He delivered an impassioned speech there in 1794, when a unanimous decision was taken to abolish slavery. Original painting by Anne-Louis Girodet de Roussy-Trioson\nOmar Victor Diop, The Sonacotra Tenant Strike 1974-80. From Liberty (2016). (Omar Victor Diop/MAGNIN-A, Paris)\nFrom 1974 to 1980, a prolonged strike pitted the tenants of Sonacotra, a French state-owned agency responsible for providing public housing to migrant workers from north and sub-Saharan Africa, against its management, many of whom were former colonial officers. Those striking opposed perpetual rent increases and demanded better living conditions in worker dormitories controlled by the Sonacotra authorities, paving the way for the first collective protest of black African immigrants in postcolonial France. A struggle for tenants’ and workers’ rights, the Sonacotra Tenant Strike is regarded as a pivotal moment of black solidarity in the history of collective political activism by African diasporas in Europe.\nOmar Victor Diop, The Soweto Uprising 1976. From Liberty (2016). (Omar Victor Diop/MAGNIN-A, Paris)\nA defining moment in the struggle to end apartheid, the Soweto Uprising refers to a series of student demonstrations in South Africa, which began on the morning of 16 June 1976 when around 20,000 students from Soweto’s higher education institutions came together to protest against the introduction of Afrikaans as the primary language of instruction. They were violently repressed by the police, who quickly opened fire on the students; the number of young boys and girls killed is estimated to be in the hundreds. To commemorate these events, 16 June was declared a public holiday in South Africa, known as Youth Day. Historians have argued that the Soweto Uprising, which highlighted the role of young people in shaping the character and form of revolt, served as both an inspiration and a template for a second wave of unrest in the 1980s, which eventually led to apartheid’s demise.\nOmar Victor Diop, St Benedict of Palermo 1526–1589 From Diaspora (2014). (Omar Victor Diop/MAGNIN-A, Paris)\nBenedetto Manasseri, also known as Benedict the Moor, was born in San Frantello, Sicily, of African slaves. He was freed at birth because of his parents’ loyal service to the Church. At the age of 21 he joined a local hermit community. Later on, he was assigned to the Franciscan Friary in Palermo, where he quickly rose through the Order’s ranks. Benedict was beatified by Pope Benedict XIV in 1743 and canonised in 1807 by Pope Pius VII. He is venerated as a saint in the Catholic and Lutheran churches, and remembered for his charity, his professed healing powers, his understanding of scripture and his tolerance when confronted with racial prejudice. Benedict’s feast day is celebrated on 4 April. Original sculpture attributed to José Montes de Oca.\nAn earlier version of this article incorrectly said that Trayvon Martin had a can of iced tea with him on the night of his death. He had a can of fruit juice. This text has been corrected and updated.\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\nThousands entered the iPhone Photography Awards contest. These are the winners.\nInside a mostly faded culture on Norway’s border with Sweden\nHaunting images of life on the St. Lawrence River in Canada","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/08/03/artist-omar-victor-diops-work-recasts-history-and-the-global-politics-of-black-resistance/"}
