{"authors":["Julian Robinson For Mailonline"],"date_download":"2018-10-23 01:46:38","date_modify":"2018-10-23 01:46:38","date_publish":"2016-01-28 16:12:16","description":"The artwork, which includes watercolours of houses, castles and countryside scenes, will be sold off in the Bavarian city of Nuremberg in southern Germany.","filename":"data/vaneerConsumption/ArtworkbyAdolfHitlerupforauctioninNurembergGermany.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AB529300000578-0-image-a-130_1453997252905.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421244_Artwork-Adolf-Hitler-fetch-hundreds-thousands-dozen-paintings-Nazi-dictator-hammer-auction-Nuremberg_1540259198.html","title":"Artwork by Adolf Hitler up for auction in Nuremberg, Germany","title_page":"Artwork by Adolf Hitler up for auction in Nuremberg, Germany | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A collection of paintings and drawings made by Nazi dictator Adolf Hitler are going under the hammer in Germany - and they could fetch hundreds of thousands of pounds.\nThe artwork, which includes watercolours of houses, castles, countryside scenes and town squares, will be sold off in the Bavarian city of Nuremberg.\nIt comes six months after another collection of his art fetched £286,000 at auction with one work - a painting of Neuschwanstein Castle in Bavaria - selling to a Chinese buyer for £71,000.\nFor sale: A collection of paintings and drawings made by Nazi dictator Adolf Hitler are going under the hammer in Germany - and they could fetch hundreds of thousands of pounds\nThe artwork, which includes watercolours of houses, castles, countryside scenes and town squares, will be sold off in the Bavarian city of Nuremberg\nThere has been no indication yet how much the latest collection could sell for\nPeople from all over the world made bids for the Nazi dictator's work at a previous aucion\nThere is no indication yet how much the latest collection could sell for.\nWatercolour landscapes, nude portraits and still lifes were among the 14 pieces that went under the hammer at an auction in June, which was also in Nuremburg.\nIn November a watercolour painted by a young Hitler in 1914 of the city hall in Munich sold for 130,000 euros at a sale organised by the same auction house.\nAs a budding young artist, Hitler applied to the Vienna Academy of Art but was rejected. He continued to paint however, copying images from postcards that he sold to tourists.\nUnder the hammer: The Nazi dictator's paintings are up for sale at an auction in Nurenberg in southern Germany\nEarly work: As a budding young artist, Hitler applied to the Vienna Academy of Art but was rejected\nHitler continued to paint after being rejected from he Vienna Academy of Art and copied images from postcards that he sold to tourists\nHitler went on to become Germany's Nazi leader from 1933 to 1945, launching the Second World War and causing the deaths of millions of people\nHe went on to become Germany's Nazi leader from 1933 to 1945, launching the Second World War and causing the deaths of millions of people.\nLast year, Germany's Frankfurter Allgemeine Zeitung reported that German law allows for Hitler's paintings to be sold as long as they do not display any Nazi symbols.\nExperts consider his work to be of mediocre quality.\nDespite having produced numerous paintings, experts consider his work to be of mediocre quality\nLast year, Germany's Frankfurter Allgemeine Zeitung reported that German law allows for Hitler's paintings to be sold as long as they do not display any Nazi symbols","url":"https://www.dailymail.co.uk/news/article-3421244/Artwork-Adolf-Hitler-fetch-hundreds-thousands-dozen-paintings-Nazi-dictator-hammer-auction-Nuremberg.html"}
