{"authors":[],"date_download":"2018-10-30 20:02:00","date_modify":"2018-10-30 20:02:00","date_publish":"2017-04-25 13:52:00","description":"Atlanta home prices are not rising as fast as the national average, according to Case-Shiller. But it's still faster than most incomes.","filename":"data/vaneerConsumption/AsAtlantahomepricesrisecanbuyersactuallyaffordthem.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/25/Images/Home%20sale%20AJC%2010.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_real-estate_atlant_5312645c9442f41760f2d3f6487888c9__1540929720.html","title":"As Atlanta home prices rise, can buyers actually afford them?","title_page":"Atlanta home prices up solidly in latest Case-Shiller report, ","title_rss":"NULL","source_domain":"ajc.com","text":"The housing market in Atlanta continued to heat up as spring approached, but the pace of increase has fallen behind the national average, according to a much-watched national survey released Tuesday.\nThe average price of a home in the metro area rose 5.6 percent during the past year, compared to a 5.8 percent U.S. average, according to the S&P/Case-Shiller House Price Index.\nChannel 2's Clark Howard says if your going to do it on your own, then you better have a plan.\nCase-Shiller calculates a three-month average of prices across the country, but does not include new construction.\nExperts continue to warn that the market’s overall strength is a problem in the lower price tiers.\n“While the housing market looks to be recovering, these high prices impact the affordability of homes, directing the strongest headwinds towards starter-home buyers,” said Cheryl Young, senior economist for San Francisco-based Trulia, an online housing data resource.\nHome prices in metro Atlanta were up 0.4 percent in the past month surveyed, Case-Shiller said. However, when adjusted to account for normal season trends, Atlanta prices were up 0.8 percent.\nCase Shiller’s numbers – calculated from a three-month rolling average of resales – are somewhat more modest than the recent reports from some other sources. For example, Re/Max of Georgia recently reported Atlanta prices climbing in double digits during the past year.\nBut whatever the precise figures, there is general consensus that the market is strong, but not smooth.\nImbalances continue to bedevil the Atlanta market. Most obviously, there are not enough homes for sale, so buyers in the market often find themselves competing against each other.\nUltimately that can create a different kind of problem, since it drives the selling prices up faster than incomes for many potential buyers.\nAnd Atlanta’s market could be much stronger than it is, since there is a deep pool of potential buyers in metro Atlanta, said Bruce McClenny, president of Apartmentdata.com, which – as the name suggests -- collects data on apartments. “People in the home market look to rentals as their next customers.”\nYoung people may prefer apartment living – especially in places like Midtown Atlanta – but there are milestones in their lives where they think about buying a home, he said. “When you get married, have kids – that is typically the point.”\nYet the incentives to keep renting are getting stronger, McClenny said. “The debts that so many people have, the higher loan quality standards since the Great Recession. It made it easier to say, ‘We’re going to choose to be renters.’”\nEven for those without student debt hanging over them, required down-payments of 10 percent or more on a home are an obstacle for many young people with modest incomes, McClenny said. “And the other thing working for rentals in Atlanta is that the housing market is just so strong. You have prices (in the past year) up more than 10 percent.”\nThe faster prices rise, the more that younger people are likely to be priced out of the market.\nAverage price increases, past year:\nSeattle 12.2 percent\nPortland 9.7 percent\nDallas 8.8 percent\nDenver 8.5 percent\nBoston 7.6 percent\nTampa 6.9 percent\nMiami 6.7 percent\nSan Diego 6.5 percent\nSan Francisco 6.4 percent\nLas Vegas 6.3 percent\nDetroit 6.2 percent\nChicago 6.2 percent\nCharlotte 6.1 percent\nMinneapolis 5.9 percent\nATLANTA 5.6 percent\nNational average: 5.8 percent\nTop 20 metro areas: 5.9 percent\nSource: S&P/Case-Shiller House Price Index","url":"https://www.ajc.com/business/real-estate/atlanta-home-prices-rise-can-buyers-actually-afford-them/ak4j5fl5A8iUVJOUw4pW4H/"}
