{"authors":["Joey Millar For Mailonline"],"date_download":"2018-10-23 00:44:45","date_modify":"2018-10-23 00:44:45","date_publish":"2016-01-29 14:02:41","description":"Jack Briggs unwittingly exposed his wife every time he came home from work at BBA Aviation Plc with filthy clothes. She would then wash his deadly laundry and sweep the contaminated floor.","filename":"data/vaneerConsumption/AsbestoscoveredJackBriggspoisonedwifewithhugsandkisses.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30B1ED6D00000578-0-image-a-4_1454068639576.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422556_Asbestos-covered-husband-poisoned-wife-hugs-kisses-four-decades_1540255485.html","title":"Asbestos-covered Jack Briggs poisoned wife with hugs and kisses","title_page":"Asbestos-covered Jack Briggs poisoned wife with hugs and kisses | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Daughter suing BBA Aviation for over £100k for failing to protect parents\nJack Briggs returned from work at factory covered in toxic dust every day\nAn elderly Yorkshire widow died four decades after she was poisoned by hugs and kisses from her asbestos-covered husband, it is claimed.\nJack Briggs unwittingly exposed his wife of over 50 years to the deadly substance every time he came home from work at a BBA Aviation Plc factory covered in dust.\nPaula, who would further expose herself as she washed her husband's dirty laundry, emptied his work bag and swept the dusty floor, died of an asbestos-related cancer in 2014.\nLisa Wharton is suing BBA Aviation Plc at the High Court for failing to protect her parents from asbestos dust\nTheir daughter, Lisa Wharton, is now suing the aircraft repair and support company for up to £110,000 in damages on behalf of her mother's estate.\nIn a High Court claim, the family's lawyers claim the company did not do enough to protect the couple from exposure to asbestos dust when Mr Griggs worked at their factory in Cleckheathon, West Yorkshire in the 1970s and 1980s.\nMs Wharton's lawyer Peter Cowan explained: 'Jack Briggs returned home from work with the defendant each day in his work clothing and footwear.\n'He would greet the deceased with a hug and a kiss. He would then go about his activities in the house.\n'Later on he would remove his dusty clothing and place it in the laundry basket.\n'The deceased would later sort the clothing from the laundry basket, shaking off the dust from the work clothing and in particular removing the dust which had gathered in the trouser turnups and in the various pockets.'\nMrs Briggs would then sweep dust off the kitchen floor, porch and pantry before shaking out his work bag, which was also full of the toxic dust.\nExposure to asbestos, which was commonly used in construction before its toxicity was discovered, can result in the development of cancer years or even decades later\nMr Cowan claims that Mr Briggs' former employers ought to have known of the risk they were exposing him and his family to.\nThe labourer died aged 76, when he suffered a brain haemorrhage at home in September 2011. His wife died in August three years later at the age of 79.\nThe claim for damages, has been lodged at the High Court in London. However the defence to the action was not available from the court and the contents of the writ have yet to be tested in evidence before a judge.","url":"https://www.dailymail.co.uk/news/article-3422556/Asbestos-covered-husband-poisoned-wife-hugs-kisses-four-decades.html"}
