{"authors":["Julie Cart","Dan Morain"],"date_download":"2018-10-30 22:47:11","date_modify":"2018-10-30 22:47:11","date_publish":"2018-08-08 02:23:40","description":"Climate-warming compounds will be released by the charred forests long after California's wildfires are extinguished this season.","filename":"data/vaneerConsumption/AsCaliforniaburnsclimategoalsmaygoupinsmokeevenaftertheflamesareout.json","image_url":"https://calmatters.org/wp-content/uploads/Mendocino-Fire-e1536280133451.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939631.html","title":"As California burns, climate goals may go up in smoke—even after the flames are out","title_page":"As California wildfires burn, climate goals may go up in smoke—even after the flames are out | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"As crews across California battle more than a dozen wildfires—including the largest in state history—the blazes are spewing enough carbon into the air to undo some of the good done by the state’s climate policies.\nWhat’s even worse: Climate-warming compounds that will be released by the charred forests long after the fires are extinguished may do more to warm up the planet than the immediate harm from smoky air.\nScientists say that only about 15 percent of a forest’s store of carbon is expelled during burns. The remainder is released slowly over the coming years and decades, as trees decay.\nThat second hit of carbon, experts say, contains compounds that do more to accelerate climate change than those from the original fire. And future fires over previously burned ground could make climate prospects even more bleak.\n“The worst possible situation is the fire that comes through and kills everything,” said Nic Enstice, regional science coordinator for the Sierra Nevada Conservancy. “Then, 10 or 15 years later, another fire comes through and releases all the carbon left in the trees on the ground. That’s really bad.”\nIt’s a scenario that could explode at any time. Enstice cited a research paper published this year that laid out a chilling tableau: California has more than a 120 million dead trees strewn around its mountain ranges, with the southern Sierra hardest hit.\nWhen fires hit those downed trees, the state will begin to experience “mass fires” spewing plumes of carbon. The resulting conflagrations, according to the researcher, will be almost unimaginable.\n“The emissions from those fires will be unlike anything we will have ever seen,” Enstice said. “And you won’t be able put it out.”\nComputing the carbon released from the fires so far this year will not happen soon. The National Aeronautics and Space Administration flies planes through smoke plumes, gathering data, but air traffic over wildfires is tightly restricted. Scientific research is not a top priority when fires are threatening towns.\nBut some preliminary data is available now.\nOne method uses inventories of existing forests—surveying how many trees and which type. Those records are updated every 10 years. Researchers then overlay infrared images captured from satellites that show what’s burning and at what intensity. From that, predictions can be made about carbon emissions on any given day.\nScientists say that emissions from burned forests are one of the most virulent types, called black carbon. According to the most recent accounting from the state Air Resources Board, California’s annual black carbon discharge—excluding wildfires—is equal to emissions from about 8 million passenger vehicles driven for one year. Not a small number.\nBut when the state calculates the same annual average of black carbon coming solely from wildfires, it’s the equivalent of nearly 19 million additional cars on the road.\nWith year-round fire seasons and fire intensity off the charts, state officials admit that wildfires could set back California’s myriad policies to offset the impacts of climate change.\n“It’s significant,” Enstice said. “We don’t have a lot of data to measure yet; we’re still using primitive tools. But everyone is gearing up to study this.”","url":"https://calmatters.org/articles/as-california-burns-climate-goals-may-go-up-in-smoke-even-after-the-flames-are-out/"}
