{"authors":["Paddy Dinham For Mailonline"],"date_download":"2018-10-23 01:16:05","date_modify":"2018-10-23 01:16:05","date_publish":"2017-03-16 11:05:23","description":"Danielle Snaith tricked Kirsty Griffiths into getting in the trolley at an Asda in Gateshead, Tyne & Wear, but when she shunted her it hit the kerb and Miss Griffiths plunged face-first into the concrete.","filename":"data/vaneerConsumption/Asdacarandtrolleyprankgoesverywrong.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E53797200000578-0-image-a-37_1489660107994.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319496_Asda-car-trolley-prank-goes-wrong_1540257365.html","title":"Asda car and trolley prank goes very wrong","title_page":"Asda car and trolley prank goes very wrong | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A prankster who decided she would get her best friend in a shopping trolley before ramming it with her car saw her joke backfire with painful consequences.\nDanielle Snaith tricked best mate Kirsty Griffiths, both aged 20, into clambering into the trolley at an Asda in Gateshead, Tyne and Wear, but when she shunted her with the vehicle it hit the kerb and Miss Griffiths plunged face-first into the concrete.\nMiss Snaith, a shop worker, had been made to believe she would be pushed by hand, but Miss Griffiths shocked her by instead driving forwards and nudging it with her car.\nA practical joke outside an Asda supermarket in Gateshead, Tyne and Wear, saw this woman painfully face plant the pavement after falling out of a shopping trolley\nDanielle Snaith (left in both in images) tricked her best friend Kirsty Griffiths (right) by making her get in a shopping trolley before pushing her along with a car\nBut slapstick video footage shows the moment carer Miss Snaith's windup suddenly backfired when the trolley picked up speed and hurtled off a kerb, face planting Miss Griffiths into the ground.\nMiss Griffiths, from Newcastle, said: 'We spotted a trolley in front of the car and Danielle told me I had to go and get in it.\n'I told her to get out of the car, but she said she would get out when I got in the trolley. I thought she was going to park and push me herself.\nSlapstick video footage shows the moment carer Miss Snaith's windup suddenly backfired, and the alarm on Miss Griffiths' face is clear\n'I didn't realise she was going to start driving and pushing me with the car, that's why I panicked.\n'I could see the kerb coming and knew what was about to happen and I couldn't do anything about it. When I hit it I just went over.\n'To be honest I have only really hurt my elbow, it was bruised and bleeding.. At least it wasn't my head. I wasn't annoyed at all though.\n'I thought it was funny, when I was in the trolley I just didn't know what to do. There was nothing I could hold onto to stop myself.\nThe trolley picked up speed and hurtled off a kerb, face planting Kirsty into the ground\n'I just went with it - if something like that happens it happens, it was a laugh. Danielle is my best friend and we are like that with each other all the time. We do lots of stupid stuff together.\n'As soon as Danielle put it on Facebook it started getting lots of likes. All my friends were saying it was hilarious and that they couldn't believe it.'\nMiss Snaith filmed Miss Griffiths's unfortunate trolley fail at about 11.30pm last Sunday before posting it to Facebook.\nThe friends of 15 years had visited Asda late in the evening to buy food but forgot the supermarket would be shut due to Sunday trading laws.\nKirsty's minor injuries were uploaded to Snapchat afterwards\nTheir footage has now racked up more than 3,000 views on social media and the girls said their friends also find the prank hilarious.\nMiss Snaith, who also lives in Newcastle, said: 'Kirsty thought I was going to get out and run around pushing the trolley, not drive into it.\n'When I started driving she was like 'what are you doing' - her face was so shocked, she genuinely had no idea what I was doing. She tried to grab my bonnet and jump out.\n'I was only driving for a couple of seconds and I was going at less than five miles an hour. I didn't think she would go down to the kerb, I just gave her a little nudge.\n'I was only going to do it for a few seconds but the trolley picked up speed and went down the kerb.\n'After she fell she was on the floor and I jumped out of the car but I could not stop laughing.\n'It never came to my mind at first that she might be injured, I didn't really think. I ran around eventually and asked whether she was alright, and luckily she was laughing as well.\n'We laughed for about the next hour, it was just ridiculous. We couldn't do anything but look at each other and laugh. I've played the video over and over again.\n'Doing stuff like that is just me. I just think of stupid stuff to do. I have had so many people messaging me saying they would kill me if I did that to them though.'","url":"https://www.dailymail.co.uk/news/article-4319496/Asda-car-trolley-prank-goes-wrong.html"}
