{"authors":[],"date_download":"2018-10-30 21:36:15","date_modify":"2018-10-30 21:36:15","date_publish":"2015-05-13 04:00:00","description":"Steven Satterfield is demonstrating his technique for dressing a salad. First he spoons vinaigrette around the sides of a bowl filled with raw spinach.","filename":"data/vaneerConsumption/AseasonforSatterfield.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/05/13/Images/photos.medleyphoto.7229172.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_food--cooking_season-for-satterfield__1540935375.html","title":"A season for Satterfield","title_page":"A season for Satterfield","title_rss":"NULL","source_domain":"ajc.com","text":"Steven Satterfield is demonstrating his technique for dressing a salad. First he spoons vinaigrette around the sides of a bowl filled with raw spinach. Then he gently lifts the greens and rolls them around to coat them in dressing.\nThe Miller Union chef and newly minted cookbook author believes fresh produce tastes good on its. So why cover it up?\nNever one to slather it on too thick, Satterfield is minimalist to the core. You can see that in his quietly authoritative mannerisms, his personal style, his immaculate, sparsely furnished Inman Park home and — above all else — his simple, unadorned food.\nLet other chefs bray about sweetbreads, pig parts and lamb brains. The Savannah native would prefer to murmur quietly about the sweetness of strawberries, the tartness of rhubarb, the brightness of blueberries, all of which grace his kitchen countertop on the recent morning we gather to cook a simple meal from his book, “Root to Leaf: A Southern Chef Cooks Through the Seasons” (HarperCollins,$45).\nA 488-page, season-by-season, fruit-and-vegetable field guide containing 200 recipes for the likes of Watermelon Salad with Feta and Green Tomato, English Pea Hummus and Spring Onion Pizza, “Root to Leaf” has recently catapulted the local chef to national fame. (Of course it doesn’t hurt that he’s twice been a finalist for the James Beard Foundation’s Best Chef: Southeast and racked up numerous other awards and honors since opening his West Side restaurant in 2009.)\n“Most of these recipes are about getting as much produce into the recipe as possible,” Satterfield says as he sets about making Spinach Salad with Strawberries and Rhubarb Vinaigrette, Creamed Rice with English Peas and Country Ham, and Blueberry Coffee Cake with Streusel.\nThe salad — which marries sweet strawberries, crunchy sunflower seeds and luscious goat cheese — is an anthem to the glories of spring. “I think of it as a like a beautiful mess,” Satterfield quips. “It’s kind of a sloppy salad, but it’s just filled with so many good textures and flavors.” That pink-tinged dressing he will later apply so carefully is a delicate balance of tart rhubarb, champagne vinegar and honey, all thickened with sunflower oil.\nThe creamed rice is Satterfield’s Southern response to risotto.\nHe prefers Anson Mills Carolina Gold Rice from the South Carolina Low Country, rather than the arborio rice Italians favor. (He also uses the Southern pearls in his wonderful-sounding Blood Orange Ambrosia Rice Pudding and pretty much any dish that calls for the grain.) If you can’t find Carolina Gold, you may use long-grain basmati or jasmine.\nFor this porridge-like dish, English peas and country ham are stirred in at the last minute. As Satterfield points out, the dish is like a blank canvas for whatever’s fresh. He’s made it with hakurei turnips, asparagus tips, radishes, summer squash, tomatoes, field peas, butternut squash, escarole, mushrooms.\n“I mean, it’s just risotto,” he quips. “You can throw in whatever you want.” Sometimes, he adds a poached egg to make it more substantial. I think it would be a comforting supper on its own.\nWhen it’s time to assemble the coffee cake, Satterfield uses batter almost as sparingly as salad dressing. The dessert calls for a whopping 4 cups of blueberries to 2 cups flour. Creme fraiche gives it a nice crumb, while the streusel topping adds a crunchy note and a hint of salt. Sliced into wedges, the coffee cake is a blue-marbled showstopper.\nAs spring turns to summer, summer to fall, fall to winter, I’m eager to explore Satterfield’s elemental recipes for okra and field peas, peaches and plums, pecans and sweet potatoes, citrus and kale.\nRadish sandwiches with butter, sea salt and crusty baguette; honeydew perked up with lime, sea salt and cayenne; sauteed beets with orange and walnuts: Sounds like poetry to me.\nAs Satterfield writes in his introduction: “Everything we need is there, if we pay attention, and eat what’s in season.”\nA Steven Satterfield spring menu\nThe following three recipes from the Atlanta chef’s new cookbook, “Root to Leaf,” make for a lovely meal showcasing seasonal produce.\nSpinach Salad with Strawberries and Rhubarb Vinaigrette\n6 cups baby spinach leaves, washed and dried\n6 tablespoons Rhubarb Vinaigrette (see recipe)\nkosher salt\n1 cup sliced strawberries\n4 ounces fresh chevre, crumbled\n1/4 cup toasted sunflower seeds\nShaved fennel bulb (optional)\nPlace the spinach in a large bowl. Spoon the Rhubarb Vinaigrette onto the sides of the bowl. With your hands, gently lift the spinach up repeatedly, coating the leaves with the dressing from the sides of the bowl. Season to taste with salt. Divide the spinach among 4 salad plates or bowls and garnish with equal amounts of strawberries, chevre and sunflower seeds. If desired, a sprinkling of shaved raw fennel can add a sweet and mellow anise finish to the salad. Serves: 4\n— Adapted from “Root to Leaf: A Southern Chef Cooks Through the Seasons” by Steven Satterfield (HarperCollins, $45)\nPer serving (including dressing): 96 calories (percent of calories from fat, 71), 1 gram protein, 5 grams carbohydrates, 1 gram fiber, 7 grams fat (1 gram saturated), no cholesterol, 275 milligrams sodium.\nRhubarb Vinaigrette\n1/2 cup sliced rhubarb\n1/2 scallion, sliced\n1/2 stalk green garlic, sliced (may substitute 1 small clove garlic, sliced)\n1/4 cup Champagne vinegar\n1 tablespoon honey\n1/2 teaspoon whole-grain mustard\n1/2 teaspoon minced fresh ginger\n1 teaspoon kosher salt\n1/4 cup sunflower oil\nPlace the rhubarb, scallion, garlic, vinegar, honey, mustard, ginger, and salt in a blender pitcher. Puree until smooth. With the motor running, drizzle in the sunflower oil. Makes: A little over 3/4 cup\n— Adapted from “Root to Leaf: A Southern Chef Cooks Through the Seasons” by Steven Satterfield (HarperCollins, $45)\nPer 1-tablespoon serving: 44 calories (percent of calories from fat, 82), trace protein, 2 grams carbohydrates, trace fiber, 4 grams fat (trace saturated fat), no cholesterol, 137 milligrams sodium.\nCreamed Rice With English Peas and Country Ham\nIf you can’t find fresh peas, use organic frozen ones. “I have no problem with using frozen organic produce,” says Satterfield, “because it’s usually harvested at peak season and put away right away.”\n1 tablespoon unsalted butter\n1 cup dry Carolina Gold rice, or other aromatic long-grain rice such as basmati\n1/4 cup dry white wine\n2 teaspoons kosher salt\n2 cups stock, heated (may use chicken, pork or vegetable stock)\n1 1/2 cups heavy cream, heated\n1/4 cup finely chopped country ham\n1 cup shelled English peas\nParmigiano-Reggiano cheese for garnish\nIn a wide saucepan or Dutch oven over medium heat, warm the butter until foamy. Add the dry rice and cook, stirring continuously with a wooden spoon, until the grains are opaque, about 5 minutes. Add the white wine and stir until the rice absorbs the wine. Have 1 cup water ready. Add 1/4 cup of the water and continue to stir until the rice absorbs the liquid. Repeat this step until all of the water is absorbed, adding a little at a time.\nSlowly add 1/2 cup of the hot stock and stir until the rice absorbs the liquid. Then add 1/2 cup of the hot cream and stir until the rice absorbs the liquid. Repeat these steps, alternating another 1/2 cup each of hot stock and cream, until all the liquid is absorbed. This process should take 35 to 40 minutes, resulting in tender and creamy grains of rice. Stir in the country ham and peas. Taste for seasoning, and add salt as needed. Garnish with Parmigiano-Reggiano and serve hot. Serves: 4.\n— Adapted from “Root to Leaf: A Southern Chef Cooks Through the Seasons” by Steven Satterfield (HarperCollins, $45)\nPer serving: 573 calories (percent of calories from fat, 61), 9 grams protein, 45 grams carbohydrates, 2 grams fiber, 38 grams fat (23 grams saturated), 134 milligrams cholesterol, 1,118 milligrams sodium.\nBlueberry Coffee Cake with Streusel\nFor the streusel\n1/2 cup rolled oats (not instant)\n6 tablespoons all-purpose flour\n1/4 cup packed light brown sugar\npinch kosher salt\npinch freshly grated nutmeg\n4 tablespoons (1/2 stick) unsalted butter, cubed\nFor the cake\n5 tablespoons unsalted butter (1 tablespoon for greasing pan plus 4 tablespoons, or 1/2 stick, melted, for the cake)\n4 cups blueberries\n2 cups unbleached all-purpose flour\n1 teaspoon baking powder\n1/2 teaspoon baking soda\n1/2 teaspoon kosher salt\n1/2 cup whole milk\n1/2 cup creme fraiche (may use sour cream)\n1/2 cup granulated sugar\n2 large eggs at room temperature\nTo make the streusel: In a small ball, combine the oats, flour, brown sugar, kosher salt and nutmeg. Add the butter and, with your fingers, gently rub the dry ingredients into the butter until they are incorporated and crumbly. Refrigerate until ready to use.\nPreheat the oven to 350 degrees. Grease a 9-inch baking dish (may use square or round) with 1 tablespoon butter. Wash and drain the blueberries; spread them on paper towels to dry, removing any bits of leaf or stem.\nTo prepare the cake: In a large mixing bowl, combine the 2 cups flour, baking powder, baking soda and kosher salt. Stir until well mixed. In a medium bowl, whisk together the milk, creme fraiche (or sour cream), sugar, eggs and 4 tablespoons melted butter. Add the wet ingredients to the flour mixture, stirring to blend well. Gently fold in the blueberries.\nSpread the batter in the prepared dish. Sprinkle evenly with streusel. Bake until a wooden toothpick inserted in the center of the cake comes out clean, 45 to 60 minutes. Cool on a wire rack at least 20 minutes before serving. Serves: 12\n— Adapted from “Root to Leaf: A Southern Chef Cooks Through the Seasons” by Steven Satterfield (HarperCollins, $45)\nPer serving: 296 calories (percent of calories from fat, 40), 5 grams protein, 40 grams carbohydrates, 2 grams fiber, 13 grams fat (8 grams saturated), 69 milligrams cholesterol, 208 milligrams sodium.","url":"https://www.ajc.com/lifestyles/food--cooking/season-for-satterfield/nz8Qg36hK57qHaLq3B0PTP/"}
son-for-satterfield/nz8Qg36hK57qHaLq3B0PTP/?icmp=np_inform_variation-control"}
