{"authors":["Tim Sculthorpe","Deputy Political Editor For Mailonline"],"date_download":"2018-10-23 00:58:19","date_modify":"2018-10-23 00:58:19","date_publish":"2017-03-16 10:31:03","description":"The country's foreign minister said only 'sovereign' states start the process of joining the European Free Trade Association (EFTA) which allows access to the EU single market.","filename":"data/vaneerConsumption/AseparateScotlandfacesYEARSoutsideEuropefreetrade.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E4048FD00000578-0-image-a-12_1489660139486.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319594_A-separate-Scotland-faces-YEARS-outside-Europe-free-trade_1540256299.html","title":"A separate Scotland faces YEARS outside Europe free trade","title_page":"A separate Scotland faces YEARS outside Europe free trade | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A separate Scotland faces spending years outside of the EU single market even if it votes for independence, Iceland has warned.\nThe country's foreign minister said only 'sovereign' states start the process of joining the European Free Trade Association (EFTA) which allows access to the EU single market.\nIt means Scotland could not begin its application until it was actually independent - a process expected to take several years after a referendum vote.\nThe SNP leader is said to be considering applying for Scottish EFTA membership, which would allow entry to the EU single market without being an EU member.\nNicola Sturgeon is said to be considering joining EFTA to secure Scottish access to the EU single market but has been warned only sovereign states are allowed in\nPrime Minister Theresa May yesterday warned the SNP Scotland would leave the EU with the rest of Britain regardless of any independence vote.\nIt means an independent Scotland faces starting outside both the UK and EU single markets, raising a host of questions about how it trades with its current biggest markets.\nThe revelation is a further blow to Ms Sturgeon's plans for a second independence referendum, which are based on protecting Scotland's place in Europe.\nGudlaugur Thor Thordarson, the Icelandic Foreign Minister, warned: 'Only sovereign states can be considered for membership within EFTA, which, for obvious reasons, complicates matters for Scotland if it were to seek entry.'\nGudlaugur Thor Thordarson, the Icelandic Foreign Minister, said only sovereign states could join the EU\nBut, in comments reported by the Telegraph, he added: 'The future direction of Scotland is a debate that will take place in Westminster and Edinburgh and I prefer not to discuss hypotheticals.'\nEFTA currently includes Iceland, Lichenstein, Norway and Switzerland and allows the countries to work on parallel EU rules without being full members.\nScottish Tory leader Ruth Davidson said Iceland's intervention showed Ms Sturgeon's referendum plans had 'given way beneath her'.\nMs Sturgeon was accused by Brexit Secretary David Davis of deliberately stoking rows over Britain leaving the EU to fuel her independence campaign.\nHe told MPs: 'If one side doesn't want to agree, which I'm afraid has been the position of the Scottish Government from time to time, there is no way seek to agree can turn into agree.\n'The stance of the Scottish Government on this has been frankly a very political one, not necessarily in the interests of the people they represent.'\nWHAT IS EFTA? EFTA is a four member organisation that allows countries to trade inside the EU single market without having to be full EU members. It currently includes Iceland, Lichtenstein, Norway and Switzerland and operates trading rules in parallel with the EU. EFTA members are allowed to enter into trade deals with other countries, unlike EU member states - but members are expected to coordinate their activity. Britain was a founding member in 1960 but quit the group to become a full member of the then European Economic Community, a pre-cursor to the EU.\nMs Sturgeon last night defended her plans and said Scots had a right to choose a difference path to the rest of the UK.\nShe told the Channel 4: 'If we don't have the option of a referendum then effectively we are accepting right now a future that is a hard Brexit future with Conservative governments at Westminster for perhaps 20 years or more.\n'If people want that then that's fine, they can choose that, but I think it's right that people have a choice given how much is now at stake for our country.\n'I want Scotland to stay in the EU, that's the long-standing SNP policy.\n'What we have to do, as we did in 2014 but now in the different circumstances we face, is, before people are asked to make that choice, set out the process by which we secure our relationship with Europe.\n'I've said I want Scotland to be in the European Union, I campaigned for remain, that is why I think that is the best future.'","url":"https://www.dailymail.co.uk/news/article-4319594/A-separate-Scotland-faces-YEARS-outside-Europe-free-trade.html"}
