{"authors":["Tamar Hallerman"],"date_download":"2018-10-30 21:00:46","date_modify":"2018-10-30 21:00:46","date_publish":"2016-06-20 18:53:26","description":"WASHINGTON -- The U.S.","filename":"data/vaneerConsumption/AsexpectedSenateturnsbackfourguncontrolmeasures.json","image_url":"https://politics.myajc.com/rf/image_large/Pub/p7/Politics-MyAJC/2016/06/20/Images/WPIMAGE_cmgajcpolitics_24228.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/politics.myajc.com/blog_politics_expected-sena_bfe618f6bd8bafcea7e325b779c35b9a__1540933246.html","title":"As expected, Senate turns back four gun control measures","title_page":"As expected, Senate turns back four gun control measures","title_rss":"NULL","source_domain":"ajc.com","text":"WASHINGTON -- The U.S. Senate extended its long-running stalemate over firearms on Monday, voting to reject four gun control measures eight days after the largest mass shooting in U.S. history.\nGeorgia Sens. Johnny Isakson and David Perdue voted with the majority of their Republican colleagues on the proposals. The two parties had offered competing measures aimed at amending the country's background check system and blocking suspected terrorists from obtaining firearms.\nThe votes on the four bills were essentially repeats of those taken in previous years, and as expected all four provisions failed to get the 60 votes needed to advance.\nMonday's votes put the Senate in roughly the same political spot it was in before the June 12 massacre in Orlando, which left 49 dead and 53 wounded. The parties are still wildly divided over gun control -- the last major law changing firearms laws was signed in 2007 after the massacre at Virginia Tech -- and multiple efforts to bridge the bipartisan divide have fallen flat since then.\nA small group of senators led by Maine Republican Susan Collins is currently trying to craft a compromise measure that would block people on the government's no-fly list from buying guns. The proposal is narrower than one of the Democratic proposals senators rejected this evening that targeted people on the federal terror watch list.\n\"While we should absolutely work to stop terrorists from obtaining deadly weapons, it is regrettable that Democrats have chosen to make this debate political by focusing solely on guns and refusing to address the critical need to fight terrorism at home and abroad,\" said Amanda Maddox, Isakson's spokeswoman. \"We need to give the FBI and the counter terrorism community the support, resources and intelligence-gathering tools necessary to counter ISIL’s efforts to radicalize and inspire attacks on American soil.\"\nAs senators debated the bills on Monday, Republicans said Democrats were focusing on the wrong issue by pushing gun measures and instead highlighted the need for the U.S. to bolster its counterterrorism efforts against the Islamic State.\nThe authors of Monday's proposals are \"approaching this serious topic in a serious, and constitutional, way,\" Senate Majority Leader Mitch McConnell, R-Ky., said in a speech earlier in the day. \"They also understand that ultimately the most important way to prevent more terrorist tragedies at home is by defeating terrorism overseas.\"\nDemocrats, meanwhile, said the GOP was adhering more to the wishes of the National Rifle Association than to those of their constituents.\n\"Senate Republicans should be embarrassed. But they’re not, because the NRA is happy,\" Minority Leader Harry Reid, D-Nev., said in a speech on the Senate floor earlier Monday.\nCheck out our other coverage on the gun debate:\nGun rights groups have spent millions on Georgia campaigns since 2009\n‘Docs vs. Glocks’ case pits First Amendment against the Second\nGun sales in Georgia spike after Orlando shootings","url":"https://politics.myajc.com/blog/politics/expected-senate-turns-back-four-gun-control-measures/YKl1uSUUatXTAQ97YwVjNK/"}
