{"authors":[],"date_download":"2018-10-30 00:58:45","date_modify":"2018-10-30 00:58:45","date_publish":"2015-05-15 00:00:00","description":null,"filename":"data/vaneerConsumption/AShamelessTrainofThought.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2015_05_a_shameless_train_of_thought_1540861125.html","title":"A Shameless Train of Thought","title_page":"A Shameless Train of Thought","title_rss":"NULL","source_domain":"americanthinker.com","text":"Never mind that the Antrak train that crashed outside Philadelphia, killing seven, was being driven at 106 miles per hour around a curve that was designed for 50 or that the “ positive train control” system (PTC) that would have overridden the operator to brake the train was in the pipeline to be installed. According to Democrats who believe money solves everything and that the serpent in the Garden of Eden was probably a Republican, it’s the fault of the Republicans.\nFormer White House Chief of Staff and currently mayor of Chicago, Rahm Emanuel, whose city is rushing to be the next Detroit after decades of big government excesses, once said that a crisis was a terrible thing to waste since it allows you to get things done you couldn’t get done in a saner atmosphere. The Amtrak derailment outside Philadelphia is the latest case in point.\nDemocrats forget that President Obama promised us that our infrastructure problems were over the day he signed the trillion-dollar stimulus package with the Orwellian name of the American Recovery and Reinvestment Act on February 17, 2009:\nBecause of this investment, nearly 400,000 men and women will go to work rebuilding our crumbling roads and bridges, repairing our faulty dams and levees, bringing critical broadband connections to businesses and homes in nearly every community in America, upgrading mass transit, building high-speed rail lines that will improve travel and commerce throughout our nation.\nOne would have thought that if we had money to build high-speed rail, maybe Amtrak had enough money to install safety equipment or train its operators on the virtues of obeying speed limits. But that would assume the federal government was a trustworthy custodian of our tax dollars.\nIt is perfectly natural for President Obama, who refuses to take responsibility for anything from Fast and Furious to the IRS scandal to the Benghazi fiasco, calling them all “phony” scandals overhyped by the likes of Fox News, to not assign responsibility for the tragedy to Amtrak management or the driver of the train. Blame the Republicans who are only guilty of trying not to waste money we don’t have, money borrowed from the Chinese.\nOf course, President Obama and the Democrats are picky and choosy about which infrastructure he favors. His veto threat on the Keystone XL pipeline came amidst rosining oil shipments and train derailments. 'Let's set our sights above a single pipeline,\" the leader of the party of infrastructure told Congress in his 2015 State of the Union address.\nNever mind that as a result of the fracking revolution and shale oil boom oil train shipments have increased, particularly on a railroad shipping oil from North Dakota’s Bakken formation owned by billionaire and friend of Obama, Warren Buffett.\nSo we have the risk of oil train derailments, fires, and explosions that damage the environment and risk human lives. One of a series of such incidents occurred in Illinois in early March when two cars of a 105-car derailed oil train operated by Buffet’s BNSF Railroad and carrying oil from North Dakota caught fire and sent flames and smoke into the skies over Galena, Illinois, a small town of 3,300 people.\nIn July of 2013, a 72-car oil train carrying North Dakota crude, a train similar to those crisscrossing the United States, derailed near the town of Lac-Megantic, Quebec, erupting in a series of explosions, killing 13. It could happen here, and unless more pipelines are built, it likely will.\nAs Investor’s Business Daily has noted, pipelines are much safer than railroads, yet President Obama and the Democrats are loathe to permit their construction. Pipelines carrying Bakken oil would link up to a completed Keystone XL pipeline, creating American jobs and protecting American lives:\nThe first is that Keystone XL will also bring Bakken crude to the American market, accelerating the oil boom from fracking in the shale formation centered on North Dakota. This will make North America energy independent and the rest of the world less dependent on Middle Eastern oil, a matter of no small significance. Second, as the State Department's multiple reviews point out, the Keystone XL pipeline itself poses no serious risk to the environment, no more than the tens of thousands of miles of pipeline that already crisscross the U.S., including one from Canada, all operating quite safely…. A little more than a year ago, Casselton, N.D., had a near-brush with tragedy after a train of tank cars carrying crude oil derailed, resulting in fiery explosions and a call from the town's mayor for a re-examination of how such fuel is transported across the United States.\nOil transport by rail is a disaster waiting to happen, a disaster as dangerous and life-threatening as any Amtrak train derailment, yet President Obama and many Democrats stand in the way of pipelines like Keyatone XL, exposing their hypocrisy on public safety and the need for improving our infrastructure.\nThe Democrats claim building pipelines like Keystone XL will hasten oil extraction and fuel climate change, which has killed nobody. Oil train disasters have killed and their ongoing threat remains, as oil trains run through the heart of many American communities.\nThe Amtrak derailment outside Philadelphia had nothing to do with funding levels and everything to do with an operator not following safety procedures. It has everything to do with the worst kind of politics. The Democrats who shamefully exploit the dead know this and the American people should know this too.\nDaniel John Sobieski is a freelance writer whose pieces have appeared in Investor’s Business Daily, Human Events, Reason Magazine and the Chicago Sun-Times among other publications","url":"https://www.americanthinker.com/articles/2015/05/a_shameless_train_of_thought.html"}
