{"authors":["Richard Spillett","Crime Correspondent For Mailonline"],"date_download":"2018-10-23 01:23:03","date_modify":"2018-10-23 01:23:03","date_publish":"2017-03-10 09:27:32","description":"Sandie Rayne, 25, was found severely injured and a man was found dead when police officers forced their way into her home in Ashby-de-la-Zouch, Leicestershire yesterday.","filename":"data/vaneerConsumption/Ashbypolicefindmansbodyinjuredwomaninhome.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22A8BC00000578-0-image-a-70_1489147556025.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300518_Police-man-s-body-injured-woman-Ashby-home_1540257783.html","title":"Ashby police find man's body, injured woman in home","title_page":"Ashby police find man's body, injured woman in home  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sandie Rayne was found with stab wounds at her home in Leicestershire yesterday. A man was found dead at the property as well as a young girl, who was unharmed\nA young mother posted a desperate plea on Facebook the day before she was found stabbed in an incident at her home.\nSandie Rayne, 25, was found severely injured and a man was found dead when police officers forced their way into her home in Ashby-de-la-Zouch, Leicestershire yesterday.\nHer two-year-old daughter was also found unhurt in the bungalow and is being looked after by relatives after Ms Rayne was rushed to hospital.\nThe man found dead at the scene from stab wounds has been named locally as Ms Rayne's ex-boyfriend Warren Hall, who is also 25.\nIt emerged today that the 25-year-old posted a message on Facebook the day before the tragedy - saying she wanted to 'run away'.\nShe wrote that she: 'Wants to run away... somewhere no one knows you or your business and just start all over again... if anyone knows a place let me know.'\nFive days earlier, on March 3, she wrote: 'Don't you wish you could just run away and hide where no one can find you...'\nShe had posted a series of troubling messages online before in the days before the incident\nThe incident unfolded on this new-build estate in Ashby-de-la-Zouch, Leicestershire\nPolice are investigating what happened at the £200,000 bungalow yesterday afternoon, but are not looking for anybody else.\nHer mother Tracie, 46, said today: 'We hope Sandie pulls through. We don't want to say any more about it.'\nFriend Annie Brookes said: 'She's a great mother to her daughter, who is a her little ray of sunshine, she's just a great mother which has been obvious whenever I've seen them together.\n'Her daughter is so adorable and it's lovely to see Sandie with her, I hope for everyone's sake she will make a full recovery.'\nTributes were also paid to Mr Hall, with friend Michael Clarke posting online: 'Thoughts go out to Warren's family today. Another friend gone too soon. Love ya bro! R.I.P x'\nMr Hall's mother declined to comment this afternoon.\nPolice have condoned off a number of bungalows as they investigate what happened\nA resident who lives near to the bungalow where the incident happened said: 'He was in his late 20s and the woman is probably in her mid-20s. The little girl must have been about two years old.\n'The woman and the little girl are great. I only said hello to him once and he didn't reply. He used to go out to work early most days on a motorbike.\n'As far as I know it was just the three of them in the house.'\nA police spokesman said: 'Detectives have launched an investigation following the discovery of a man's body and a woman with serious injuries inside a house in Ashby.\n'Officers were called to a house in Holland Crescent at around 3.20pm after receiving a report that a woman had been seriously injured.\n'Upon arrival a woman was found inside the property suffering from extensive injuries.\n'She was airlifted to hospital where her condition is described as stable.\nPolice teams scoured the house today as they attempt to work out what took place\nThe spokesman added: 'Officers also found the body of a man inside the house. It is not yet clear what may have caused his death.\n'A young child was also found inside the house. She was unharmed and is currently being cared for by relatives.\nThe spokesman added: 'The house has been cordoned off and is being forensically examined. House to house enquiries will be conducted with nearby residents.\nThe house where Ms Rayne was found is being examined by forensics experts\n'The investigation is in its early stages but at this point detectives are not looking for anyone else in connection with the enquiry.\n'They have stressed that whilst the local community will be shocked by news of this incident, they should not be alarmed about their own personal safety.'\nA police car and a forensics van could be seen parked in the street late on Thursday night as officers in white overalls searched the area.\nTory councillor Graham Allman, who represents Ashby on North West Leicestershire District Council, said: 'Obviously something tragic has happened and it's most unfortunate.\n'My thoughts and feelings go out to all those who are affected by this. One of my staff told me she had heard something about a death in Ashby.\n'I was in Ashby this afternoon and I did hear a lot of sirens at about half past three. That's not unusual these days unfortunately.\n'It feels like Ashby is becoming a changed town with all the things that have happened here recently.'","url":"https://www.dailymail.co.uk/news/article-4300518/Police-man-s-body-injured-woman-Ashby-home.html"}
