{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:22:22","date_modify":"2018-10-30 20:22:22","date_publish":"2015-10-14 03:17:26","description":"At the Oct. 13 Democratic debate, Anderson Cooper asked candidates to explain the gun laws they believe are necessary, including Jim Webb.","filename":"data/vaneerConsumption/AsHillaryClintonMartinOMalleyTargetNRAJimWebbTargetsPoliticalClassAverageAmericansDontHaveBodyguards.json","image_url":"https://media.breitbart.com/media/2015/10/jim-webb-iowa-state-fair-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_13__1540930942.html","title":"As Hillary Clinton, Martin O'Malley Target NRA, Jim Webb Targets Political Class: Average Americans Don't Have Bodyguards","title_page":"As Hillary Clinton, Martin O'Malley Target NRA, Jim Webb Targets Political Class: Average Americans Don't Have Bodyguards | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"During the October 13 Democratic debate, the second question asked by moderator Anderson Cooper was about guns—he asked each presidential hopeful to explain the gun laws they believe are necessary and also how they plan to secure the passage of such laws.\nIn answering, Hillary Clinton and Martin O’Malley went directly after the NRA and pressed massive gun controls, while former Sen. Jim Webb defended the 2nd Amendment and attacked the rhetoric of the political class by pointing out that the “average American” doesn’t have bodyguards.\nWhen Cooper asked about guns, Bernie Sanders responded first by bragging that he gets a “D-minus from the NRA.” He made clear that he supports “assault weapon” bans, instant background checks, and closing “the gun show loophole,” among other things.\nCooper then pointed out that Sanders voted to shield gun manufacturers from lawsuits in 2005, and he asked Sanders, “Do you want to shield gun companies from lawsuits?” Sanders answered, “Of course not.” During a Meet the Press interview on October 11, Sanders had already admitted that his position on gun manufacturers was shifting; that he believes gun manufacturers may need to be held liable for gun crime.\nSo Cooper then turned to Hillary Clinton and asked, “Is Bernie Sanders tough enough on gun laws?” Clinton answered, “No. Not at all.” She said it is “time the entire country stood up against the NRA” and passed gun control. Clinton then pointed her finger, suggesting that Sanders’s real position has not changed, that “everybody else has to be accountable, but not the gun manufacturers.” She pointed out that she was in Senate at the same time that Sanders voted to shield gun manufacturers. Clinton, however, voted against the measure.\nClinton said, “It was pretty clear to me that [Sanders] was voting to give immunity” to gun manufacturers. She said, “We need to stand up and say ‘enough of this, we’re not going to take it.'”\nWhen it was O’Malley’s turn, he talked about comprehensive gun control but kept trying to call it “comprehensive gun safety” instead. And he referenced the gun control he was able to pass while Governor of Maryland in an effort to show he was not talking about what he could do but what he did do.\nHe wrote on these controls previously in the Boston Globe:\nIn Maryland, we implemented some of the toughest measures in the nation to crack down on gun violence. The reforms we put in place included required licensing, fingerprinting, background checks, and safety training. We ensured that these requirements applied to all buyers, whether they were acquiring a gun from a dealer, a secondary sale, or as a private gift. We took action to keep guns off the street and make them less deadly. We banned the sale of assault weapons and limited the size of magazines. And, if a firearm was lost or stolen, we required it to be reported immediately to law enforcement.\nBut what have these controls wrought? Gun crime in Baltimore is surging and homicides are setting per-month records in 2015. Still, O’Malley stood beside Hillary and mocked the idea of “pandering to the NRA.”\nThen came former Sen. Jim Webb. He stressed there are people who ought not have guns and said that we need to keep guns out of their hands if possible—he believes that makes our background check system necessary. Then he said:\nBut we have to respect the tradition in this country of people who want to defend themselves and their family from violence. There are people in high levels in this government who have bodyguards twenty-four hours a day, seven days a week. The average American does not have it and deserves the right to be able to protect their family.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/10/13/hillary-clinton-martin-omalley-target-nra-jim-webb-targets-political-class-average-americans-dont-bodyguards/"}
