{"authors":["Iona Kirfor Dailymail.Com"],"date_download":"2018-10-22 21:10:17","date_modify":"2018-10-22 21:10:17","date_publish":"2016-01-29 05:38:15","description":"The 26-year-old attended a party in Miami to celebrate her cover of Ocean Drive magazine.","filename":"data/vaneerConsumption/AshleyBensonwearsanorangeromperasshecelebratesOceanDrivemagazinecover.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/05/30AFECC000000578-0-image-a-30_1454045843393.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422157_Ashley-Benson-shows-petite-frame-bright-orange-romper-celebrates-magazine-cover_1540242617.html","title":"Ashley Benson wears an orange romper as she celebrates Ocean Drive magazine cover","title_page":"Ashley Benson wears an orange romper as she celebrates Ocean Drive magazine cover | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ashley Benson showed what a Pretty Little Liar she is on Thursday, as she attended a party in Miami to celebrate her cover of Ocean Drive magazine.\nThe 26-year-old revealed her slim but curvy figure in a tiny tangerine romper, which was nipped in at her petite waist.\nAshley also flashed her long and slender legs in the strapless orange one-piece, which she paired with beige patent heeled sandals.\nCover girl: Ashley Benson celebrated her Ocean Drive magazine cover at a party in Miami on Thursday\nThe actress pulled styled her dark blonde hair in a braided updo, and finished off her glamorous look with shiny pink lip gloss and winged black eyeliner.\nAshley is best known for playing Hanna Marin in Pretty Little Liars, which resumed for the second part of its sixth season earlier this month - complete with a new mystery.\nThe show, which finally revealed the identity of the villainous 'A' in the midseason finale, will end after season seven. It also stars Shay Mitchell, Lucy Hale and Troian Bellisario.\nAshley's role on the popular series has helped her to land parts in movies such as Spring Breakers and Pixels, but even she is not immune to the ridiculous expectations of Hollywood.\nTerrific in tangerine: The Pretty Little Liars star showed off her slim but curvy figure in an orange romper\nLeggy lady: Ashley also revealed her long and slender legs in the one-piece, which she paired with beige heels\nIn her interview with Ocean Drive, the gorgeous star revealed: 'I was just told I was too fat for a part. I'm a size two!\n'I cried for 30 minutes, but then you have to let it roll off your shoulders or it could cause a serious eating disorder.'\nAshley added: 'A lot of people in this industry hear they need to lose weight more times than they should.\nThrilled: The 26-year-old happily posed beside a giant version of her cover, which she also autographed\nPlait's nice: Ashley pulled her dark blonde hair into a braided updo and finished off her look with winged black eyeliner and glossy pink lips\n'It does make you stronger, though. Because if you let that affect you, you can't be in this industry - you'd go crazy.'\nAshley also revealed to Ocean Drive that she hates seeing herself being heavily Photoshopped - explaining that she doesn't want fans to perceive her in that way.\n'I saw photos from a shoot of myself just the other day and thought, What the hell? That doesn't even look like me! I was so disappointed,' she said. 'I hate to think that girls are like, \"She's so skinny! Her skin is so perfect!\" I have pimples just like they do.'\nMaking friends: The actress posed for photos with model Isabela Rangel\nBack in 2013, Ashley slammed a Pretty Little Liars season four promo poster for excessively airbrushing an old photo of her and her co-stars.\n'Saw this floating around....hope it's not the poster,' she wrote on Instagram. 'Our faces in this were from 4 years ago.....and we all look ridiculous. Way too much photoshop. We all have flaws. No one looks like this. It's not attractive.'\nAshley can next be seen alongside Kevin Spacey and Michael Shannon in Elvis & Nixon, which hits cinemas in the US on April 15 and the UK on April 29.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422157/Ashley-Benson-shows-petite-frame-bright-orange-romper-celebrates-magazine-cover.html"}
