{"authors":["Katie Storey For Mailonline"],"date_download":"2018-10-23 02:28:19","date_modify":"2018-10-23 02:28:19","date_publish":"2017-03-16 12:59:25","description":"The former Made In Chelsea star, 29, dressed to impress in a sultry little black dress that gave onlookers more than they bargained for - thanks to its plunging neckline and daring hem.","filename":"data/vaneerConsumption/AshleyJamesdefiesputsonaVERYbustyandleggydisplay.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E53864B00000578-0-image-a-92_1489663530699.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319804_Ashley-James-defies-puts-busty-leggy-display_1540261699.html","title":"Ashley James defies puts on a VERY busty and leggy display","title_page":"Ashley James defies puts on a VERY busty and leggy display | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's not afraid to put her best assets on display.\nAnd Ashley James made sure to give onlookers a lot more than they bargained for as she headed to Dirty Harry's restaurant and bar in Soho London on Wednesday night.\nThe former Made In Chelsea star, 29, was dressed to impress in a sultry little black dress and defied the fashion rule book as she put on both a busty and leggy display.\nScroll down for video\nDefying the rule book: Ashley James, 29, put on both a busty and leggy display for her evening out at Dirty Harry's in Soho London on Wednesday night\nThanks to its plunging neckline and thigh-skimming hemline, Ashley's minidress certainly made a statement as she partied in the capital.\nThe model made sure all eyes were on her as she put her ample assets on display, but her lengthy pins weren't shy of attention either in a pair of nude Louboutin heels.\nChoosing not to accessorise, Ashley let her form-fitting frock take centre stage and wore her blonde locks in soft tousled curls.\nShe finished off her glamourous look with neutral shades for her make-up and enviably dewy skin.\nA daring choice! The former Made In Chelsea star made a statement in her minidress thanks to its plunging neckline and thigh-skimming hemline\nPart of the gang! Ashley couldn't resist joining the scantily-clad dancers up on stage as she partied in the capital\n'I was a bit young': Although, the model confessed she hadn't actually seen the film Coyote Ugly that the dancers had been inspired by\nClearly making the most of her evening, the reality star was in high spirits as she drank cocktails and danced up a storm with the Coyote Ugly inspired dancers on the bar.\nAlthough, Ashley made a surprising confession on Instagram, as she revealed she has never seen the movie - released in 2000.\nShe claimed she had been 'too young' at the time, telling her 81k followers on the social media site: 'Wednesday is the new weekend apparently. Just discovered @dirtyharrys_soho - amazing food and cocktails if you're looking for somewhere new to try.\n'Apparently there's going to be some #CoyoteUgly style bar action too - I was a bit young to watch this film but I'm definitely going to after tonight!\n'Having a drink or two': Throughout the evening, Ashley kept her social media followers updated on her antics via Snapchat\nAll smiles: The blonde-haired beauty was in high spirits as she took to the bar to rub shoulders with her dancing pals\nDespite her lack of knowledge about the film, that didn't stop Ashley from getting involved.\nShe looked just incredible as she posed alongside the scantily-clad bar dancers, proving she is just as body confident as she encourages others to be.\nHaving opened up about her previous personal battles with her appearance, Ashley is often promoting 'self-love' and encouraging others to be confident with the way they look.\nBody confident: Ashley, who is known for encouraging self-esteem among others, oozed body confidence while striking a slew of poses for the cameras\nThe TV personality admits she has struggled with body dysmorphia in the past and it has taken her a 'long time' to feel comfortable in her own skin.\nReflecting on her experiences, Ashley took to Instagram in just her lingerie to prove there is no such thing as a 'disgusting' body, only 'unflattering angles'.\nAshley's post featured a side-by-side comparison of lingerie selfies taken seconds apart; one that complemented her and another that she admits did no favours for her figure.\nShe wrote: 'We can all feel beautiful or ugly in photos depending on the right angles and lights, and these photos [were] taken 2 seconds apart.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319804/Ashley-James-defies-puts-busty-leggy-display.html"}
