{"authors":["Australian Associated Press"],"date_download":"2018-10-22 23:49:36","date_modify":"2018-10-22 23:49:36","date_publish":"2017-03-10 04:49:17","description":"Ashleigh Meagan Watterson has pleaded not guilty to two charges of attempted murder and one of assault causing grievous bodily harm over three alleged attacks in late 2010.","filename":"data/vaneerConsumption/AshleighWattersonwouldhavebeenanewbornforlife.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/04/3E17477600000578-0-image-a-31_1489120723219.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299972_Little-girl-21-months-stuck-like-newborn-life_1540252176.html","title":"Ashleigh Watterson would have been a newborn for life","title_page":"Ashleigh Watterson would have been a newborn for life | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A mother on trial for trying to kill her baby girl asked doctors to put in place a 'not-for-resuscitation' order before knowing the child's long-term prospects of recovery.\nAshleigh Meagan Watterson has pleaded not guilty to two charges of attempted murder and one of assault causing grievous bodily harm over three alleged attacks on her daughter, Sarah, in late 2010.\nSarah died from undetermined causes in March 2012, aged 21 months.\nSarah (pictured), who died at 21 months, would have been stuck like a newborn for life\nThe Crown alleges Watterson 'deliberately obstructed' her daughter's airways twice, in October and November 2010, when the girl was aged four and five months old.\nPediatrician Bruce Goodwin told the Queensland Supreme Court on Friday no medical condition could be identified to explain why Sarah suffered repeated episodes of apnoea - a temporary loss of breathing.\nThe lack of oxygen left Sarah with brain injuries that meant she would remain like a newborn for the rest of her life, the court heard.\n'There was no smiling, no purposeful movements, she had very poor vision,' Dr Goodwin said.\nAshleigh Watterson (above) allegedly 'deliberately obstructed' her daughters airway's twice\nSarah (pictured) died from undetermined causes in March 2012, aged 21 months\nDr Goodwin said a multidisciplinary meeting was held in November 2010, just a week after he started treating Sarah, to discuss the child's ongoing care and long-term prognosis.\nIt was at that meeting Watterson asked doctors to set up a 'not-for-resuscitation' order if Sarah ever suffered another significant apnoea event.\nDr Goodwin said while Watterson's request didn't raise his suspicions, he was surprised as it was normally a matter brought up by medical professionals once they built a rapport with a patient's family and it was unnecessary for them to decide at that time.\nThe Crown alleges Watterson (left) 'deliberately obstructed' her daughter's airways twice. Right, Sarah's father Mark Watterson\n'I thought it was unusual at that stage,' he said.\nDr Goodwin said he asked Watterson to discuss the matter with Sarah's father Mark Watterson, who was not at the meeting, but she replied they had already agreed they did not want advanced life support.\nThe trial continues before Justice Glenn Martin.","url":"https://www.dailymail.co.uk/news/article-4299972/Little-girl-21-months-stuck-like-newborn-life.html"}
