{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 22:05:28","date_modify":"2018-10-22 22:05:28","date_publish":"2017-03-16 02:33:23","description":"She a multi-talented Hollywood star. So it's little surprise that Ashley Tisdale is prioritizing staying both hip and fit. The 31-year-old High School Musical star started","filename":"data/vaneerConsumption/AshleyTisdalerockschicsleevelessdressafterworkout.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/3E4FE89500000578-0-image-a-24_1489625546350.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318510_Ashley-Tisdale-rocks-chic-sleeveless-dress-workout_1540245928.html","title":"Ashley Tisdale rocks chic sleeveless dress after workout","title_page":"Ashley Tisdale rocks chic sleeveless dress after workout | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She a multi-talented Hollywood star.\nSo it's little surprise that Ashley Tisdale is prioritizing staying both hip and fit.\nThe 31-year-old High School Musical star started her Wednesday with a healthy workout in Studio City, California.\nKeeping fit! Ashley Tisdale, 31, started her Wednesday with a healthy workout in Studio City, California\nThe former Disney starlet donned a dark Rangers hoodie for her athletic endeavor, which she paired with some slate grey, cropped leggings and black leather sandals.\nHer main accessory was a pair of distinctive, vintage-style shades, though she also toted a very furry key chain.\nShe also must have worried about hydration, as she carried both a massive bottle of water and a smaller secondary drink container.\nProbably for practical reasons, she pulled her brunette tresses back into a messy bun.\nMade for walking: A sleeveless black number fell past her knees, which she paired with very ornate black studded booties\nSome light blush and nude lipstick made her youthful, post-workout visage glow.\nLater, the wife of musician Christopher French swapped out her utilitarian look for a more sophisticated ensemble.\nA sleeveless black number fell past her knees, which she paired with very ornate black studded booties.\nLocking up her look! She also carried a substantial Louis Vuitton handbag which even sported a small padlock on the front, and shielded her eyes with some fancy gradient sunglasses with gold frames\nShe also carried a substantial Louis Vuitton handbag which even sported a small padlock on the front, and shielded her eyes with some fancy gradient sunglasses with gold frames.\nThis time, her caramel locks were parted in the middle and styled into gentle waves.\nMeanwhile, the actress has been busy lately lending her voice to the upcoming animated film, Charming.\nThe actress plays Cinderella in the upcoming animated musical, which boasts a star-studded cast of Demi Lovato, Wilmer Valderrama, and Sia.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318510/Ashley-Tisdale-rocks-chic-sleeveless-dress-workout.html"}
