{"authors":["Kipp Jones"],"date_download":"2018-10-30 18:16:49","date_modify":"2018-10-30 18:16:49","date_publish":"2015-03-20 03:34:50","description":"Actress and devout feminist Ashley Judd published a lengthy essay Thursday to further explain her reasoning for taking legal action against what she perceives as “gender-based violence” on Twitter.","filename":"data/vaneerConsumption/AshleyJuddPensEssayAboutMisogynyonTwitter.json","image_url":"https://media.breitbart.com/media/2015/03/Ashley-Judd-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_03_19__1540923409.html","title":"Ashley Judd Pens Essay About Misogyny on Twitter","title_page":"Ashley Judd Pens Essay About Misogyny on Twitter","title_rss":"NULL","source_domain":"breitbart.com","text":"Actress and devout feminist Ashley Judd published a lengthy essay Thursday to further explain her reasoning for taking legal action against what she perceives as “gender-based violence” on Twitter.\n“I routinely cope with tweets that sexualize, objectify, insult, degrade and even physically threaten me,” she now says, also stating that she hasn’t wavered on her promise to pursue charges against the malefactors.\nJudd says she had previously “looked into what is legally actionable in light of such abuse,” and has given Twitter scores of reports about the “horrifying content” on its platform, but her treatment over the weekend crossed the line.\n“This particular tsunami of gender-based violence and misogyny flooding my Twitter feed was overwhelming,” she continued.\nThe actress has now become the subject of a heated national debate regarding free speech on social media. After her Kentucky Wildcats defeated the Arkansas Razorbacks in the SEC Championship basketball game Sunday, Judd now says she was left feeling deflated by a misogynistic society, one that is lurking to pounce on women who share their opinions on sports and other matters.\nAfter the game, Judd tweeted that she felt the Hogs were playing “dirty.” but she became more irate when users on Twitter made their attacks on her personal. After an image went viral of her sharing a kiss with former coach Dick Vitale, things got ugly.\n“Tweets rolled in, calling me a c-nt, a whore or a b–ch, or telling me to suck a two-inch d–k. Some even threatened rape, or “anal anal anal,” she writes in the essay.\nThe actress, 46, also says the trolls consistently single her and others out because they are women:\nMy uncle who is a chaplain, also expressed fear that the athletes would be hurt badly. But my uncle wasn’t told he was a smelly p–sy. He wasn’t spared because of his profession; being a male sports fan is his immunity from abuse. What happened to me is the devastating social norm experienced by millions of girls and women on the Internet. Online harassers use the slightest excuse (or no excuse at all) to dismember our personhood. My Tweet was simply the convenient delivery system for a rage toward women that lurks perpetually.\nJudd takes particular issue with a user who tweeted: “I watched Simon Birch. Lousy movie, but I got to see Ashley Judd die.”\n“The themes are predictable,” she says, while further lamenting that taking heavy criticism online is a part of the job description of a person of fame and notoriety.\nShe goes even further to connect her current online treatment to her past as a victim of rape and sexual assault, before promising a reckoning of sorts: “The timing was canny, and I knew it was a crime. It was time to call the police and to say to the Twittersphere, no more.”\nYou can read Judd’s entire 1,300-word essay here.","url":"https://www.breitbart.com/entertainment/2015/03/19/ashley-judd-tired-of-anal-rape-threats-on-twitter-will-pursue-charges/"}
