{"authors":["Spencer Morgan For Mailonline"],"date_download":"2018-10-23 02:27:54","date_modify":"2018-10-23 02:27:54","date_publish":"2017-04-26 13:35:34","description":"Ashley Young and Jesse Lingard showed no signs that they are feeling the pressure ahead of Thursday's clash with Manchester City as they teamed up to prank Juan Mata.","filename":"data/vaneerConsumption/AshleyYoungandJesseLingardprankJuanMata.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9F9CBB00000578-0-image-a-96_1493209473212.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4447636_Ashley-Young-Jesse-Lingard-prank-Juan-Mata_1540261674.html","title":"Ashley Young and Jesse Lingard prank Juan Mata","title_page":"Ashley Young and Jesse Lingard prank Juan Mata  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Manchester United duo Ashley Young and Jesse Lingard showed no signs that they are feeling the pressure ahead of Thursday's clash with Manchester City as they teamed up to prank Juan Mata.\nThe English pair lightened the mood at Old Trafford as they teamed up with Chevrolet to get the better of the Spaniard.\nThe clip shows a 'United super-fan' presenting Mata with a selection of drawings that he had made of him.\nScroll down for video\nManchester United duo Ashley Young and Jesse Lingard played a prank on Juan Mata\nA Manchester United 'super-fan' presented the Spaniard with some bizarre drawings\nA clearly confused Mata could do nothing else but laugh at the strange situation\nLittle did the 28-year-old know, the meeting was a set up and his fellow United stars were watching in a nearby room.\nYoung and Lingard were speaking to the fan via an earpiece as he began to show the playmaker pictures of himself as different mythical creatures.\nFirstly, he portrays the confused Spaniard as a Centaur and then a wizard cutting grass.\nA confused Mata clearly saw the funny side ahead of the crucial match with their local rivals.\nJust one point separates fifth-placed United and fourth-placed City with just six games left to play.\nThe 'fan' showed Mata pictures of himself as a centaur (pictured) and a wizard","url":"https://www.dailymail.co.uk/sport/football/article-4447636/Ashley-Young-Jesse-Lingard-prank-Juan-Mata.html"}
