{"authors":["Sinead Maclaughlin For Daily Mail Australia","Australian Associated Press"],"date_download":"2018-10-23 00:09:30","date_modify":"2018-10-23 00:09:30","date_publish":"2017-04-26 09:16:40","description":"Former NSW police officer Ashley Bryant, who took his own life in 2013, made a chilling triple-zero call before his death, requesting it be investigated by authorities.","filename":"data/vaneerConsumption/AshleyBryantstriple0callbeforetakinghislife.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F9D958800000578-0-image-a-9_1493195957810.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446506_Officer-s-chilling-triple-0-call-taking-life_1540253370.html","title":"Ashley Bryant's triple-0 call before taking his life","title_page":"Ashley Bryant's triple-0 call before taking his life | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The haunting last words of a former police officer made before he jumped to his death have been heard in a Sydney coroner's court.\nAshley Bryant fell to his death in December 2013 in the Border National Park after battling for several years with a multitude of mental health problems brought on by exposure to traumatic events in his job.\n'I understand this is being recorded and that's exactly what I want,' the 44-year-old former detective sergeant said in a triple-zero call from Minyon Falls shortly before his death.\n'I want this to get to the coroner.'\nFormer NSW police officer Ashley Bryant (pictured) made a chilling triple-zero call before his death, requesting it be investigated\nMr Bryant fell to his death in December 2013 after battling for several years with a multitude of mental health problems brought on by exposure to traumatic events in his job (pictured with his wife)\nIn the call, Mr Bryant said he suffered from PTSD and could 'no longer live with the pain' the NSW Coroner's Court heard on Wednesday.\n'I now live with the trauma of it and I know this will go to the coroner. There needs to be more things put in place for partners of those that suffer ...'\nMr Bryant had been exposed to a number of traumatic incidents of the course of his 24 year career, including road fatalities, drownings, rapes, murders and suicides, Counsel Assisting Ian Bourke SC told the inquest.\nHe provided his birth date, registered police number and spelled out his last name to the operator, who asked the former officer if he could wait for officers to get to him.\n'No, I'll be gone before they arrive, thank you,' Mr Bryant replied and ended the call.\nPolice soon arrived at the falls to find his body.\nPolice found Mr Bryant's body at Minyon Falls in Border National Park (pictured)\n'I understand this is being recorded and that's exactly what I want,' the 44-year-old former detective sergeant said in a triple-zero call before his death\nWhen the operator asked the former officer if he could wait for officers to get to him, he replied 'No, I'll be gone before they arrive, thank you'\nThe court heard on Wednesday morning that Mr Bryant had suffered from PTSD, alcoholism and anxiety for several years.\nCouncil assisting the coroner Ian Bourke said Mr Bryant had once told his wife that he hadn't initially disclosed his mental health problems to police because he was scared of losing his job.\nA former colleague and friend, Detective Inspector Matthew Kehoe, told the court he had not known of Mr Bryant's alcohol problems for several years, but there had been a 'strong culture of abuse of alcohol' in the NSW police force when he began his career.\nMr Bryant (pictured) provided his birth date, registered police number and spelled out his last name to the operator, who asked the former officer if he could wait for officers to get to him\nMr Bryant (pictured) had been exposed to a number of traumatic incidents of the course of his 24 year career, including road fatalities, drownings, rapes, murders and suicides, Counsel Assisting Ian Bourke SC told the inquest\n'We may go out and drink until the sun comes up,' Det Insp Kehoe said of the 1990s.\nOfficers were inclined to hide the fact they were struggling as they didn't want to feel they were letting anyone down by leaving work or seeking help, he added.\n'Police are very good at hiding things from people.'\nA lawyer for Mr Bryant's family, Jim Glissan, asked: 'They will go on until they break?'\n'Yes,' the detective inspector replied.\nThe inquest continues.\nReaders seeking support and information about suicide prevention can contact Lifeline on 13 11 14 or Suicide Call Back Service 1300 659 467.","url":"https://www.dailymail.co.uk/news/article-4446506/Officer-s-chilling-triple-0-call-taking-life.html"}
