{"authors":["Nate Allen"],"date_download":"2018-10-30 14:38:34","date_modify":"2018-10-30 14:38:34","date_publish":"2018-09-14 00:00:00","description":"Arkansas Razorbacks football fans seldom long recall games like today's.","filename":"data/vaneerConsumption/AsHogsfaceMeanGreenfansmustshowpatience.json","image_url":"https://media.arkansasonline.com/img/photos/2018/09/14/Nate91518_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_sep_15__1540910314.html","title":"As Hogs face Mean Green, fans must show patience","title_page":"As Hogs face Mean Green, fans must show patience","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Arkansas Razorbacks fans cheer during the third quarter of a football game, Saturday, September 8, 2018 at Colorado State University in Fort Collins, Colo. - Photo by Charlie Kaijo\nFAYETTEVILLE -- Arkansas Razorbacks football fans seldom long recall games like today's.\nUnless Arkansas loses them. Those games they remember. Indelibly.\nThe Citadel in the 1992 season-opener in Fayetteville exiting Jack Crowe.\nLouisiana-Monroe in Little Rock virtually ending John L. Smith's interim era two games into him playing out the 2012 4-8 string.\nThe Holy, Toledo! of Bret Bielema's 2015 Razorbacks tumbling to Toledo.\nAll still haunt.\nPast narrow 28-24, 28-27 and 30-27 escapes over Western Illinois, Louisiana-Monroe and Northern Illinois don't blip Arkansas radar.\nEven the 1968 irony of Frank Broyles' 10-1 Sugar Bowl champion/Southwest Conference co-champions midseason escaping North Texas State, 17-15 barely reemerges today.\nNow called the University of North Texas but still monikered Mean Green, UNT is today's 3 p.m. Arkansas opponent at Reynolds Razorback Stadium.\nThose Arkansas fans who assumed the 1968 Mean Green would not be so mean didn't take into account them becoming the \"Mean Greene.\" Eventual Pittsburgh Steelers NFL Hall of Famer Mean Joe Greene wreaked havoc as a Mean Green defensive end.\nThis current crop of 2-0 Mean Green also appears better than what most Arkansas fans preseason presumed. UNT sports the nation's leading passer. Quarterback Mason Fine averages 431 passing yards per game\nRegardless how \"Fine\" the Mean Green could be, it seemed most Arkansas fans fancied their Hogs starting 3-0 nonconference.\nThat fancy passed. The 1-1 Razorbacks followed their 55-20 victory in Fayetteville over lower division Eastern Illinois by losing a 27-9 third quarter lead in a 34-27 loss to underdog Colorado State in Fort Collins, Colo.\nAlready patience with new Coach Chad Morris wears thin. The Hogs are still favored today but jaded fans see it less winnable.\nNext comes a SEC gauntlet. At No. 7 SEC West champion Auburn; in Dallas against Texas A&M, 6-0 against Arkansas since joining the SEC West; then national champion No. 1 Alabama in Fayetteville.\nIt behooves Morris and the Razorbacks to win today.\nIt even more behooves Arkansas fans to stay patient if the Hogs don't prevail.\nSome Arkansas teams -- like what Houston Nutt inherited from Danny Ford off 4-7 seasons but with the 1995 SEC West title in their background, or the 1977 Razorbacks that Lou Holtz inherited off a 5-5-1 1976 but with the 1975 Southwest Conference and Cotton Bowl championship on their resume -- insisted they weren't rebuilding but rededicating. Their 9-3 and 11-1 records for 1998 and 1977 reflected their state of mind.\nThe Razorbacks haven't achieved that state of mind since Bobby Petrino crashed his motorcycle.\nChanging coaches like socks won't help.\nMorris was summoned in great part for his offensive prowess and style and ability to recruit in Texas.\nHe can't implement either unless supported.\nBesides, if today's message board hair-trigger firing fingers prevailed back when Frank Broyles first started 0-6 and Nolan Richardson's basketball Hawgball debuted 12-16, Arkansas' national championships would run only in track and field and cross country.\nSports on 09/15/2018","url":"https://www.arkansasonline.com/news/2018/sep/15/as-hogs-face-mean-green-fans-must-show-/"}
