{"authors":["Monica Hunter-Hart"],"date_download":"2018-10-31 01:47:02","date_modify":"2018-10-31 01:47:02","date_publish":"2018-09-06 14:59:46","description":"On Thursday morning, a gunman opened fire in downtown Cincinnati at Fifth Third Bank and shot multiple people. An early report from Cincinnati.com indicated that there were both fatalities and additional injuries.\nThe shooting happened around 9 a.m.…","filename":"data/vaneerConsumption/AShootingInDowntownCincinnatiWasReportedPoliceAreResponding.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/6/dbbc3873-1343-4aa1-af4d-c3f93d151c01-getty-540430272.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_a-shooting-in-downtown-cincinnati-was-reported-police-are-responding-11773700_1540950422.html","title":"A Shooting In Downtown Cincinnati Was Reported & Police Are Responding","title_page":"A Shooting In Downtown Cincinnati Was Reported & Police Are Responding","title_rss":"NULL","source_domain":"bustle.com","text":"On Thursday morning, a gunman opened fire in downtown Cincinnati at Fifth Third Bank and shot multiple people. An early report from Cincinnati.com indicated that there were both fatalities and additional injuries.\nThe shooting happened around 9 a.m. ET. By 11 a.m., the local police department had announced that three people were known to have died. The outlet also noted that the previous deadliest local mass shooting of the past five years had resulted in two casualties, which means that Thursday's incident is the new deadliest.\nAccording to police, the suspected gunman is also dead. Police Chief Eliot Isaac told reporters that the suspect entered the bank from the loading dock, began shooting, and continued into the lobby of the building. Officers engaged him there and exchanged fire; none of the officers were injured. Isaac said that the shooting happened only in those areas, but in addition to the bank, victims were also found in an ice cream shop and at an intersection close by, according to Cincinnati.com.\n\"Terrible shooting incident in the heart of our city this morning,\" Councilman P.G. Sittenfeld tweeted on Thursday. \"Multiple shot, and tragically there are fatalities. Details still emerging. Pray for our city.\"\nVictims were transported to the University of Cincinnati Medical Center and possibly also the Good Samaritan Hospital, according to Cincinnati.com. \"Our physicians and staff are focused on caring for the patients and their families. We prepare for situations like these and hope they never happen,\" a spokesperson for UC Health told the outlet. \"Our thoughts and prayers are with the victims, their families and all involved.\"\n\"I heard about eight gunshots, and I actually got on my knees,\" a witness told CNN. \"I kind of got down on the ground and then all the cops started coming.\"\nOther witnesses reported seeing people taken motionless from the bank on stretchers, per Cincinnati.com. One man, Leonard Cain, said that he'd been about to enter the building when someone stopped him and warned him about the gunman. Cain saw a woman entering and tried to alert her, too, but she was wearing headphones and didn't hear him.\n\"She walked in the door and he shot her,\" Cain said.\n\"Our officers responded very quickly. They engaged the threat, they neutralized that threat,\" Isaac told reporters during a Thursday morning press conference, adding that there were \"tragedies that did occur.\" Mayor John Cranley also noted the heroism of the first responders. \"Our officers were able to kill him and stop the threat very quickly,\" he said. \"We can imagine the situation being much worse than it was.\"\nIsaac said that the suspect's motive is currently unknown. He noted that his department is \"very early in the investigative process,\" and that body camera footage from officers, as well as possible security camera footage, will aid in gathering information.\nFifth Third Bank lies in Fountain Square, a commercial hub in the city. Police announced that several streets around the square will be closed on Thursday afternoon while they continue their investigation.","url":"https://www.bustle.com/p/a-shooting-in-downtown-cincinnati-was-reported-police-are-responding-11773700"}
