{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 19:16:55","date_modify":"2018-10-30 19:16:55","date_publish":"2017-02-15 18:10:26","description":"The 'Ranch' actor testified before the Senate Foreign Relations Committee on ending modern slavery and child sexual exploitation.","filename":"data/vaneerConsumption/AshtonKutcherBlowsKisstoJohnMcCainDuringSenateHearing.json","image_url":"https://media.breitbart.com/media/2017/02/AshtonKutcherBlowsKissMcCain.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2017_02_15__1540927015.html","title":"Ashton Kutcher Blows Kiss to John McCain During Senate Hearing","title_page":"Ashton Kutcher Blows Kiss to John McCain During Senate Hearing","title_rss":"NULL","source_domain":"breitbart.com","text":"Actor Ashton Kutcher sent a little love to Sen. John McCain (R-AZ) Wednesday during a Senate Foreign Relations Committee hearing focused on ending modern slavery and child sexual exploitation.\n“You were better-looking in the movies,” McCain joked to Kutcher, before The Ranch star blew back a kiss in response.\nDuring the hearing Wednesday, the 39-year-old actor — who co-founded the technology company Thorn, which builds software tools to combat child sexual exploitation and human trafficking — delivered a 15-minute speech detailing how technology can play a role in ending the vicious practices of rape and modern slavery.\n“This is about the time, when I start talking about politics, that the Internet trolls start telling me to stick to my day job,” Kutcher told the panel, chaired by Sen. Bob Corker (R-TN).\nBut Kutcher said his day job comprised of working at Thorn to fight child sex crimes, and of being a father to two children.\n“I’ve been on FBI raids where I’ve seen things that no person should ever see,” he said, appearing to choke up. “I’ve seen video content of a child that’s the same age as mine, being raped by an American man that was a sex tourist in Cambodia, and this child was so conditioned by her environment that she thought she was engaging in play.”\nKutcher said his company had once received a call from the Department of Homeland Security asking for help in locating a serial sex abuser.\n“We were the last line of defense, an actor and his foundation, we were the potential last line of defense,” he said. “That’s my day job, and I’m sticking to it.”\nKutcher also discussed a tool that his company built called Spotlight, which allows law enforcement officers the ability to prioritize their case load. He said the program was already being used by more than 4,000 law enforcement officials in over 900 agencies.\n“There’s often a misconception about technology; that in some way, it is the generator of some evil, that it’s creating job displacement and that it enables violence and malice acts,” he continued. “But as an entrepreneur and as a venture capitalist in the technology field, I see technology as simply a tool. A tool without will. The will is the user of that technology, and I think it’s an important distinction.”\n“Technology can be used to enable slavery, but it can also be used to disable slavery, and that’s what we’re doing,” he added.\nWatch Kutcher’s full speech above.\nFollow Daniel Nussbaum on Twitter: @dznussbaum","url":"https://www.breitbart.com/entertainment/2017/02/15/ashton-kutcher-blows-kiss-john-mccain-video/"}
