{"authors":["Associated Press"],"date_download":"2018-10-23 03:29:30","date_modify":"2018-10-23 03:29:30","date_publish":"2017-03-16 14:24:43","description":"TOKYO (AP) - Asian markets were mixed Friday, weighing prospects that the U.S. Federal Reserve will not raise interest rates as many times as some investors...","filename":"data/vaneerConsumption/AsianindexesmixedweighingprospectsoffewerFedhikes.json","image_url":"https://i.dailymail.co.uk/1/2017/03/17/03/wire-232029-1489722268-845_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320490_US-stock-indexes-climb-amid-rising-global-tide_1540265370.html","title":"Asian indexes mixed, weighing prospects of fewer Fed hikes","title_page":"Asian indexes mixed, weighing prospects of fewer Fed hikes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"TOKYO (AP) - Asian markets were mixed Friday, weighing prospects that the U.S. Federal Reserve will not raise interest rates as many times as some investors expect.\nKEEPING SCORE: Japan's benchmark Nikkei 225 edged down 0.3 percent in morning trading to 19,523.27. Australia's S&P/ASX 200 added 0.3 percent to 5,803.90. South Korea's Kospi was up 0.3 percent to 2,156.74. Hong Kong's Hang Seng inched up 0.2 percent to 24,345.66, while the Shanghai Composite shed 0.2 percent to 3,262.42.\nWALL STREET: The Standard & Poor's 500 index slipped 3.88 points, or 0.2 percent, to 2,381.38. The Dow Jones industrial average fell 15.55 points, or 0.1 percent, to 20,934.55. The Nasdaq composite, meanwhile, rose 0.71 points, or 0.01 percent, to 5,900.76. The Russell 2000 index of smaller stocks also rose slightly, up 3.20 points, or 0.2 percent, to 1,386.03.\nNew York Stock Exchange Executive Floor Gov. Rudy Mass, center, calls out prices for the Canada Goose IPO on the floor of the New York Stock Exchange, Thursday, March 16, 2017. (AP Photo/Richard Drew)\nTHE QUOTE: \"Monetary tightening is probably an inevitable trend in the U.S., China, Europe and even Japan. Europe and Japan have already pushed quantitative easing to the extreme and there is not much room for further easing,\" says Margaret Yang Yan, market analyst at CMC Markets Singapore. \"So in the future, money will become more and more expensive to borrow.\"\nRATES FACTOR: The Fed is hoping to lift rates gradually off their record lows, where they stayed for seven years following the 2008 financial crisis. Some investors thought the Fed may try to raise rates four times this year, but it has stuck with its forecast for three. China's central bank raised short-term interest rates, following the U.S. rate increase. Japan's central bank has so far opted to retain its ultra-lax monetary stimulus, but that could change.\nENERGY: Benchmark U.S. crude added 7 cents to $48.82 a barrel. It had slipped 11 cents to settle at $48.75 per barrel Thursday, the eighth drop in the last nine days. Brent crude, which is used to price international oils, gained 4 cents to $51.78 a barrel.\nCURRENCIES: The euro rose to $1.0774 from $1.0726 in Asia, while the dollar was edged up to 113.46 yen from 113.40 yen.\n___\nAP Business Writer Stan Choe contributed to this report.\nFollow Yuri Kageyama on Twitter at https://twitter.com/yurikageyama\nHer work can be found at http://bigstory.ap.org/content/yuri-kageyama\nTrader Frank O'Connell works on the floor of the New York Stock Exchange, Thursday, March 16, 2017. U.S. stock indexes took a small step back on Thursday, while bond yields recovered some of their sharp losses from the prior day. Stock markets around the world rallied. (AP Photo/Richard Drew)\nTraders Timothy Nick, left, Peter Tuchman, center, and Gordon Charlop work on the floor of the New York Stock Exchange, Thursday, March 16, 2017. U.S. stock indexes took a small step back on Thursday, while bond yields recovered some of their sharp losses from the prior day. Stock markets around the world rallied. (AP Photo/Richard Drew)\nTraders Tommy Kalikas, left, and Ronald Madarasz work on the floor of the New York Stock Exchange, Thursday, March 16, 2017. U.S. stock indexes took a small step back on Thursday, while bond yields recovered some of their sharp losses from the prior day. Stock markets around the world rallied. (AP Photo/Richard Drew)","url":"https://www.dailymail.co.uk/wires/ap/article-4320490/US-stock-indexes-climb-amid-rising-global-tide.html"}
