{"authors":["Associated Press"],"date_download":"2018-10-23 03:42:27","date_modify":"2018-10-23 03:42:27","date_publish":"2017-04-26 15:10:54","description":"HONG KONG (AP) - Asian shares slipped Thursday as investors digested the scant details of President Donald Trump's U.S. tax overhaul, and economic and...","filename":"data/vaneerConsumption/AsianstockslipasinvestorsmullTrumptaxplan.json","image_url":"https://i.dailymail.co.uk/1/2017/04/27/04/wire-469489-1493264481-555_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4448006_Stocks-hold-steady-ahead-tax-plan-announcement_1540266147.html","title":"Asian stock slip as investors mull Trump tax plan","title_page":"Asian stock slip as investors mull Trump tax plan | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"HONG KONG (AP) - Asian shares slipped Thursday as investors digested the scant details of President Donald Trump's U.S. tax overhaul, and economic and corporate reports. Investors also were awaiting a policy statement from the Bank of Japan that's expected to provide fresh insights into the state of Asia's second-biggest economy.\nKEEPING SCORE: Japan's benchmark Nikkei 225 index lost 0.2 percent to 19,243.76 while South Korea's Kospi dipped 0.3 percent to 2,201.39. Hong Kong's Hang Seng shed 0.1 percent to 24,565.60 and the Shanghai Composite index in mainland China fell 0.4 percent to 3,128.42. Australia's S&P/ASX 200 edged up a fraction to 5,914.00. Benchmarks in Taiwan and Southeast Asia slipped.\nTRUMP ON TAX: The White House unveiled the broad outlines of Trump's tax plan while leaving out many of the details. Officials said they hoped to slash corporate taxes to 15 percent from 35 percent, but specifics are still to be negotiated. Stocks have been lifted by investor anticipation of big tax cuts as well as Trump's vow to cut red tape for businesses. But based on the few specifics spelled out so far, most experts suggested the plan would add little to growth while swelling the budget deficit and potentially handing large windfalls to wealthier taxpayers.\nPeople stand next to an electronic board showing Hong Kong share index outside a local bank in Hong Kong, Thursday, April 27, 2017. Share prices were mostly lower in Asia following U.S. President Donald Trump's proposal for tax cuts, with Japan's Nikkei 225 index down 0.2 percent and Hong Kong's Hang Seng 0.3 percent lower. Traders were awaiting the release of a policy statement by the Bank of Japan, though no major changes were expected. (AP Photo/Vincent Yu)\nQUOTEWORTHY: \"As expected, the Trump administration rolled out the tax reform roadshow on Wednesday,\" said Stephen Innes, senior trader at OANDA. \"Given the markets lofty expectations, traders are viewing it as little more than a road map, rather than the much ballyhooed 'big announcement,' because the statement did not provide any comprehensive details.\"\nSOUTH KOREAN GROWTH: A recovery in exports helped the South Korean economy expanded at the fastest pace in a year, the country's central bank said. Asia's No. 4 economy beat forecasts by growing 2.7 percent in the first quarter, defying a backlash from Chinese consumers over deployment of a U.S. missile defense system.\nSAMSUNG IN THE MONEY: The South Korean electronics giant posted its fattest quarterly profits in more than three years, boosted by stellar performance at its semiconductor division. The first-quarter earnings, which come after a tough period for the company, leaped 46 percent over the year-ago period.\nTAKATA SHARES SUSPENDED: Shares in troubled airbag and seatbelt maker Takata Corp. were suspended from trading on Thursday after the financial newspaper Nikkei reported the company was planning to file for bankruptcy protection. Company officials said the company had made no announcement but planned to issue a statement. The Nikkei reported that Key Safety Systems, a subsidiary of China's Ningbo Joyson Electronic Corp., would establish a new company to buy Takata's operations.\nWALL STREET: The Standard & Poor's 500 index slipped less than 0.1 percent to 2,387.45 after briefly climbing above its record closing level earlier in the day. The Dow Jones industrial average lost 0.1 percent to 20,975.09 and the Nasdaq composite slipped less than 0.1 percent to 6,025.23. The Russell 2000 index of small-caps rose 0.6 percent to 1,419.43.\nENERGY: Benchmark U.S. crude oil fell 22 cents to $49.40 a barrel in electronic trading on the New York Mercantile Exchange. The contract rose 6 cents to settle at $49.62 a barrel on Wednesday. Brent crude, which is used to price international oils, fell 17 cents to $52.24.\nCURRENCIES: The euro rose to $1.0913 from $1.0905 late Wednesday, while the dollar rose to 111.21 yen from 111.07 yen.\nA man walks past an electronic board showing Hong Kong share index outside a local bank in Hong Kong, Thursday, April 27, 2017. Share prices were mostly lower in Asia following U.S. President Donald Trump's proposal for tax cuts, with Japan's Nikkei 225 index down 0.2 percent and Hong Kong's Hang Seng 0.3 percent lower. Traders were awaiting the release of a policy statement by the Bank of Japan, though no major changes were expected. (AP Photo/Vincent Yu)\nA man looks at an electronic stock board showing Japan's Nikkei 225 index at a securities firm in Tokyo, Thursday, April 27, 2017. Share prices were mostly lower in Asia following U.S. President Donald Trump's proposal for tax cuts, with Japan's Nikkei 225 index down 0.2 percent and Hong Kong's Hang Seng 0.3 percent lower. Traders were awaiting the release of a policy statement by the Bank of Japan, though no major changes were expected. (AP Photo/Eugene Hoshiko)","url":"https://www.dailymail.co.uk/wires/ap/article-4448006/Stocks-hold-steady-ahead-tax-plan-announcement.html"}
