{"authors":["Paige Tutt"],"date_download":"2018-10-30 23:57:28","date_modify":"2018-10-30 23:57:28","date_publish":"2014-08-12 20:37:33","description":"Since Lifetime greenlit the 14-episode docuseries Raising Asia , which chronicles the life of mini megastar Asia Monet Ray, viewers have been able to get a glimpse of her famous manager, Billy Hufsey, her bodybuilder father Shawn Ray, her gymnast…","filename":"data/vaneerConsumption/AsiaMonetRaysMomKristieRayTellsUsWhatItsLikeRaisingAsiatheNextBeyonce.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/1c3142c9-6fe4-4a6c-88b8-5a8f080e9ce0.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35338-asia-monet-rays-mom-kristie-ray-tells-us-what-its-like-raising-asia-the-next-beyonce_1540943848.html","title":"Asia Monet Ray's Mom Kristie Ray Tells Us What It's Like 'Raising Asia,' the Next Beyonce","title_page":"Asia Monet Ray's Mom Kristie Ray Tells Us What It's Like 'Raising Asia,' the Next Beyonce","title_rss":"NULL","source_domain":"bustle.com","text":"Since Lifetime greenlit the 14-episode docuseries Raising Asia , which chronicles the life of mini megastar Asia Monet Ray, viewers have been able to get a glimpse of her famous manager, Billy Hufsey, her bodybuilder father Shawn Ray, her gymnast little sister, and of course the powerhouse that is Kristie Ray, her mother. Kristie's no stranger to the limelight herself, having been a commercial model, and in an interview with Bustle, she says that her and Shawn's backgrounds have helped them understand Asia's experiences. \"Shawn being a bodybuilder, understanding the demand of it, as well as him being in the limelight, it comes with an understanding of how to be good at what you do,\" she says.\nKristie joins the ranks of other famous momagers such as Kris Jenner, Miley Cyrus' mom Tish Cyrus, and Justin Timberlake's mother Lynn Harless. Kristie has a lot on her plate between balancing being a mother to young daughters Asia Monet, 9, and Bella Blu, 6, managing Asia's career, and being a wife to Shawn. Kristie has also got her own career to look after.\nBilly Hufsey reported on his Facebook on Aug. 8 that Kristie Ray will join the cast of feature film Sista Code, alongside her daughter Asia, and mommy co-star Amber Rose. The film will also star America's Next Top Model's Eva Marcille and former That's So Raven actress Drew Sidora.\nBut what's it like raising the next Beyoncé? Kristie Ray reveals that it's no easy feat. \"It is challenging, but I've always had the hardest job between myself and my husband because I'm the mom and she's the little diva,\" Kristie says. \"Keep in mind that I'm the mom first... I'm always the mother first.\" Kristie is also mother to Bella, but because of Asia's extremely busy work schedule, she doesn't get to spend as much time with her as she'd like, \"It's a challenge to keep her well-balanced and to give her the time she needs... it can't be all about Asia all the time.\"\nDespite family time sometimes being a rarity, Kristie says the family tries to get together as often as possible for a little quality time. Prior to Kristie's marriage to Shawn, the two used to travel a lot for work, which slowed when Asia was born. When Asia started exhibiting signs of her talents, the couple had to reevaluate their life plans as a family.\nTheir sacrifices have paid off, as can be seen by Asia's rising singing, acting, and dance career. Kristie offered a few tips on some of the things that have helped cultivate a rising star like Asia, \"Things don't come easy... If you do something, do it 110 percent because if you wanna do things and you sacrifice to do it, you need to put in all that you have,\" she says. \"Understand that you need to be grateful... Always be on your A game.\"\nKristie's main priority as a mother and as a manager is to make sure Asia is doing everything that she wants, that's she's happy, and most importantly that she stays humble. \"I want her to stay true to herself, to stay unique... My number one goal is to let people know who she is,\" Kristie says about Asia. \"She's 9 years old and humble. She can interact and be mature. She has a natural talent that can't be taught... She's a great role model, and she's thankful.\"\nAccording to Kristie, diet is a crucial factor as well, \"feed yourself with good fuel... Asia doesn't have soda,\" she explains. Kristie says that Asia is allowed to have cheat days and she isn't denied the pleasures of being a 9-year-old, like birthday cake at a friend's party, but it's about finding balance. Asia just turned 9 on Aug. 10 and spent her day at the Teen Choice Awards.\nI'm sure after everyone's hard work, Kristie threw up her hands and exclaimed \"let them eat cake,\" if only for a day.\nImages: Asia Monet Ray/Instagram (3)","url":"https://www.bustle.com/articles/35338-asia-monet-rays-mom-kristie-ray-tells-us-what-its-like-raising-asia-the-next-beyonce"}
