{"authors":["Associated Press"],"date_download":"2018-10-22 20:50:59","date_modify":"2018-10-22 20:50:59","date_publish":"2016-01-28 04:15:43","description":"HONG KONG (AP) — Most Asian stock markets edged higher Thursday after the Fed sounded a note of caution on the world economy and its effect on U.S. growth bu...","filename":"data/vaneerConsumption/AsianstocksedgehigheraftercautiousFedoutlook.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:a6b5f870d02d403891af905c7ea5ced6-2vdWmEltwXfba0ce28e6323beb8f-264_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420338_Asian-stocks-edge-higher-cautious-Fed-outlook_1540241459.html","title":"Asian stocks edge higher after cautious Fed outlook","title_page":"Asian stocks edge higher after cautious Fed outlook | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Asian stocks edge higher after cautious Fed outlook\nHONG KONG (AP) — Most Asian stock markets edged higher Thursday after the Fed sounded a note of caution on the world economy and its effect on U.S. growth but left the door open for continued rate hikes.\nKEEPING SCORE: Japan's benchmark Nikkei 225 index rose 0.2 percent to 17,196.30 and South Korea's Kospi edged up 0.1 percent to 1,899.28. Hong Kong's Hang Seng climbed 0.4 percent to 19,128.18 while the Shanghai Composite Index in mainland China lost 0.4 percent to 2,726.07. Australia's S&P/ASX 200 advanced 0.7 percent to 4,981.40. Markets in Taiwan and Southeast Asia rose.\nPOLICY PACE: The Federal Reserve issued a cautious assessment of the global economy while also downgrading its view of U.S. growth, after officials from the central bank wrapped up their latest policy meeting Wednesday. The Fed's December rate hike had raised expectations of several more increases this year, with the first as early as March. However, in their latest statement, officials suggested that if stock market turmoil and global economic weakness persist, they might reduce the pace of future interest rate hikes. Investors were disappointed, though, that officials did not commit outright to delaying the pace.\nSpecialist Paul Cosentino, foreground, works with traders at his post on the floor of the New York Stock Exchange, Wednesday, Jan. 27, 2016. Stocks are opening broadly lower as energy companies take another tumble and after Apple predicted its first sales decline in 13 years. (AP Photo/Richard Drew)\nANALYST VIEW: \"In terms of the Fed overnight: It's clear that global central banks are now starting to be concerned about the impact of global growth worries and the latest plunge in oil prices in terms of meeting their inflation targets and as a result are now starting to sound more dovish,\" Shane Oliver, head of investment strategy at AMP Capital in Sydney, said in a report.\nWALL STREET: Major U.S. benchmarks sank on the Fed's statement. The Dow Jones industrial average fell 1.4 percent to 15,944.46 and the Standard & Poor's 500 dropped 1.1 percent to 1,882.95. A slump in tech stocks hammered the Nasdaq composite index, which lost 2.2 percent to 4,468.17.\nENERGY: Benchmark U.S. crude rose lost 31 cents to $31.99 a barrel in electronic trading on the New York Mercantile Exchange. The contract rose 85 cents, or 2.7 percent, to close at $32.30 a barrel on Wednesday in New York. Brent crude, the benchmark for international oils, fell 29 cents to $33.64 a barrel in London.\nCURRENCIES: The euro slipped to $1.0891 from $1.0905. The dollar rose to 118.82 yen from 118.46 yen.\nSpecialist Robert Nelson, foreground left, and trader Gordon Charlop, right, work on the floor of the New York Stock Exchange, Wednesday, Jan. 27, 2016. Stocks are opening broadly lower as energy companies take another tumble and after Apple predicted its first sales decline in 13 years. (AP Photo/Richard Drew)\nSpecialist Anthony Matesic, left, and trader Mark Muller work on the floor of the New York Stock Exchange, Wednesday, Jan. 27, 2016. Stocks are opening broadly lower as energy companies take another tumble and after Apple predicted its first sales decline in 13 years. (AP Photo/Richard Drew)\nSpecialist William McArdle, left, and trader Patrick Casey, right, work on the floor of the New York Stock Exchange, Wednesday, Jan. 27, 2016. Stocks are opening broadly lower as energy companies take another tumble and after Apple predicted its first sales decline in 13 years. (AP Photo/Richard Drew)","url":"https://www.dailymail.co.uk/wires/ap/article-3420338/Asian-stocks-edge-higher-cautious-Fed-outlook.html"}
