{"authors":["William Bigelow"],"date_download":"2018-10-30 17:57:09","date_modify":"2018-10-30 17:57:09","date_publish":"2015-06-02 18:40:34","description":"In another telling hint that universities are discriminating against Asian-Americans, Michael Wang, who notched a perfect ACT score, a 2230 SAT, a 4.67 weighted grade point average and 13 Advanced Placement courses on his resume, was rejected by seven Ivy League universities and Stanford in 2013. The only Ivy League school to accept him was the University of Pennsylvania. |","filename":"data/vaneerConsumption/AsianAmericanFilesComplaintAgainstIvyLeagueSchoolsAllegesDiscrimination.json","image_url":"https://media.breitbart.com/media/2015/02/harvard-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_02__1540922229.html","title":"Asian-American Files Complaint Against Ivy League Schools, Alleges Discrimination","title_page":"Asian-American Files Complaint Against Ivy League Schools, Alleges Discrimination","title_rss":"NULL","source_domain":"breitbart.com","text":"In another telling hint that universities are discriminating against Asian-Americans, Michael Wang, who notched a perfect ACT score, a 2230 SAT, a 4.67 weighted grade point average and 13 Advanced Placement courses on his resume, was rejected by seven Ivy League universities and Stanford in 2013. The only Ivy League school to accept him was the University of Pennsylvania.\nWang filed a complaint with the U.S. Department of Education, charging Yale, Stanford, and Princeton with discrimination. In May, roughly 60 Asian-American groups filed a lawsuit against Harvard charging Harvard and other Ivy League schools with using racial quotas to lock out Asian-Americans. Another group, Students for Fair Admissions, filed suits against Harvard and the University of North Carolina at Chapel Hill, charging them with racial discrimination against Asian-Americans. The Wall Street Journal wrote a piece describing Asian-Americans as “The New Jews of Harvard Admissions.”\nWang’s extracurricular resume was also strong; he participated in national speech and debate competitions as well as math competitions. Wang currently attends Williams College.\nHarvard riposted that “within its holistic admissions process, and as part of its effort to build a diverse class, Harvard College has demonstrated a strong record of recruiting and admitting Asian-American students,” adding that the U.S. Department of Education’s Office of Civil Rights conducted an investigation and decided that Harvard’s “approach to admissions was fully compliant with federal law.”","url":"https://www.breitbart.com/politics/2015/06/02/asian-american-files-complaint-against-ivy-league-schools-alleges-discrimination/"}
