{"authors":["Kristian Wilson"],"date_download":"2018-10-31 01:38:15","date_modify":"2018-10-31 01:38:15","date_publish":"2018-09-14 21:29:52","description":"A Simple Favor premiered Friday, and fans of Darcey Bell's debut novel are wondering how the ending will stack up against the book's many twists and turns. I've got all the details on the book and movie endings of A Simple Favor below, so keep…","filename":"data/vaneerConsumption/ASimpleFavorBookVsMovieDifferencesProveThatBothVersionsOfThisStoryAreCompletelyWild.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/d62188b3-408b-4f38-a916-14c769d5d9b5-9e96c0a7-221d-47be-9a11-0267e862011e-screen-shot-2018-05-02-at-12104-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_a-simple-favor-book-vs-movie-differences-prove-that-both-versions-of-this-story-are-completely-wild-11923949_1540949895.html","title":"'A Simple Favor' Book Vs. Movie Differences Prove That Both Versions Of This Story Are Completely Wild","title_page":"'A Simple Favor' Book Vs. Movie Differences Prove That Both Versions Of This Story Are Completely Wild","title_rss":"NULL","source_domain":"bustle.com","text":"A Simple Favor premiered Friday, and fans of Darcey Bell's debut novel are wondering how the ending will stack up against the book's many twists and turns. I've got all the details on the book and movie endings of A Simple Favor below, so keep reading if you want spoilers before you head off to theaters. Seriously, there are major spoilers ahead.\nPublished in March 2017, Darcey Bell's A Simple Favor centers on Stephanie and Emily, two women who meet when they enroll their sons in the same Connecticut school. Stephanie is a widowed mommy blogger, and Emily's a high-powered executive raising her son with help from her British stock-trader husband, Sean. When Emily suddenly disappears, the police suspect Sean, who stands to gain $2 million from an insurance policy on his wife.\nThere's just one problem: Sean and Emily had planned to fake her death and use the insurance money to start a new life somewhere else. When Emily's body is found in a lake near her family's cabin, her death is ruled a suicide, and Sean — earnestly believing his wife to be dead — begins an affair with Stephanie. Just as the new couple attempt to unravel the mystery of Emily's demise, Sean's wife shows up alive... and angry.\nAs it turns out, Emily has a twin sister, Evelyn, whom she has kept secret from everyone in her life. Evelyn had drug addictions that didn't fit in with Emily's picture-perfect life, and it's her body that turned up in the lake. Emily murders the insurance company investigator, and convinces Stephanie to help her dispose of the body by telling her that Sean was abusive to Emily, her sister, and her son, and that the plan to fake her death was really a ruse to get Sean out of the picture so that she and her son could be safe.\nSo what's going on? Why didn't Sean stick with the plan he and Emily originally hatched? Is Emily telling the truth about her sister and the abuse? Most importantly: Who will make it out unscathed in the end?\nThat last question is where the book and film versions of A Simple Favor diverge. Let's break down the differences, shall we?\nA Simple Favor by Darcey Bell, $11.59, Amazon\nIn the book, Stephanie — who has kept her readership apprised of the twists and turns of Emily's life — breaks off her relationship with Sean and writes a blog that paints him as an abusive husband and father. He goes into hiding outside of the U.S., leaving Emily and Stephanie to raise their sons as single moms together. Then the police find Emily's ring at the scene of the insurance agent's death, opening a new investigation involving Stephanie's best friend. Emily puts the police on Sean and Stephanie's tail long enough to plot her escape from the U.S. with her son.\nThe film adaptation of A Simple Favor ends... a bit differently. In the movie, Emily's attempt to convince Stephanie of Sean's abusive streak appears to work. Stephanie shows up — wearing a hidden body camera to livestream the events to her followers — and \"shoots\" Sean, who is wearing a blood pack, with a blank round. She gets Emily to confess to her sister's murder on camera, but then Emily shoots Sean and begins to threaten Stephanie with the gun. When Stephanie reveals that she's on candid camera, Emily runs — only to get hit by a car driven by one of the school's other parents. The movie ends with Emily serving a 20-year prison sentence, Sean and his son living on the West Coast, and Stephanie as a wildly successful vlogger turned P.I. Talk about dramatic.","url":"https://www.bustle.com/p/a-simple-favor-book-vs-movie-differences-prove-that-both-versions-of-this-story-are-completely-wild-11923949"}
