{"authors":["Alex Swoyer"],"date_download":"2018-10-30 21:23:39","date_modify":"2018-10-30 21:23:39","date_publish":"2015-07-20 20:13:05","description":"Huckabee Campaign Video Comments on Racial Tension, America Has a 'Sin Not Skin' Problem","filename":"data/vaneerConsumption/ASinNotSkinProblem.json","image_url":"https://media.breitbart.com/media/2015/07/Huckabee-at-Family-Leadership-Summit-AP-PhotoCharlie-Neibergall.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_20__1540934619.html","title":"A 'Sin Not Skin' Problem","title_page":"Huckabee on Racial Tension: A 'Sin Not Skin' Problem","title_rss":"NULL","source_domain":"breitbart.com","text":"GOP presidential candidate Gov. Mike Huckabee released a new online ad titled “Sin Not Skin,making its first debut with Breitbart News.\nThe paid online campaign ad began running in Iowa and South Carolina. It features Huckabee’s remarks on racial tension while he spoke at the Family Leader Summit in Ames, Iowa on Saturday.\nThe transcript of the ad is as follows:\nWe don’t have a skin problem in America, we have a sin problem in America. That is the root and the heart and the cause of racial strife and it cannot be reconciled by the government stepping in and making pronouncements. There is a prescription…2nd Chronicles 7:14….’If My people, who are called by My name, will humble themselves and pray, and seek My face and turn from their wicked ways’ – those are the conditions – then He says ‘He will hear from Heaven, He will forgive our sins, and He will heal our land.’ I think people forget God will heal this land, but He won’t do it if we don’t meet the conditions for Him to heal it.\nHuckabee gave similar remarks when he appeared at an Africa American Church in South Carolina on Sunday.\nThe video is part of push by the Huckabee campaign to engage African American voters. Huckabee won roughly 48 percent of the black vote in Arkansas, a CNN exit poll suggests.","url":"https://www.breitbart.com/politics/2015/07/20/exclusive-huckabee-campaign-video-comments-on-racial-tension-america-has-a-sin-not-skin-problem/"}
