{"authors":["David Schaper"],"date_download":"2018-10-23 05:45:26","date_modify":"2018-10-23 05:45:26","date_publish":"2014-10-29 00:00:00","description":"The nation's aging pipes and water mains are springing expensive leaks, wasting more than 2 trillion gallons of drinking water nationally and 22 billion gallons in the Chicago area alone.","filename":"data/vaneerConsumption/AsInfrastructureCrumblesTrillionsOfGallonsOfWaterLost.json","image_url":"https://media.npr.org/assets/img/2014/10/29/1453_wide-4f61ba67bee157ee7cc528076fcafa896150f867.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2014_10_29_359875321_as-infrastructure-crumbles-trillions-of-gallons-of-water-lost_1540273526.html","title":"As Infrastructure Crumbles, Trillions Of Gallons Of Water Lost","title_page":"As Infrastructure Crumbles, Trillions Of Gallons Of Water Lost : NPR","title_rss":"NULL","source_domain":"npr.org","text":"As Infrastructure Crumbles, Trillions Of Gallons Of Water Lost\nEnlarge this image toggle caption David Schaper /NPR David Schaper /NPR\nImagine Manhattan under almost 300 feet of water. Not water from a hurricane or a tsunami, but purified drinking water — 2.1 trillion gallons of it.\nThat's the amount of water that researchers estimate is lost each year in this country because of aging and leaky pipes, broken water mains and faulty meters.\nFixing that infrastructure won't be cheap, which is something every water consumer is likely to discover.\nIn Chicago, fresh water is drawn into water intake cribs in Lake Michigan and piped to the enormous Jardine Water Filtration Plant on the lakefront, adjacent to Navy Pier.\nJardine is the largest water filtration plant in the world by volume, pumping about 1 billion gallons of purified drinking water out through hundreds of thousands of miles of pipes to 5 million people in Chicago and 125 surrounding communities.\nBut not all of that treated, potable water makes it through the system to homes and businesses. In fact, quite a bit of it is lost.\nThe Chicago-based Center for Neighborhood Technology, a nonprofit focused on sustainability, recently put out a report that estimates \"about 6 billion gallons of water per day may be wasted in the U.S.,\" says Danielle Gallet, the group's water supply program manager.\nWhere does it go? Much of it just leaks out of aging pipes and water mains that crack and break.\n\"We do have a crumbling infrastructure issue,\" Gallet says. \"It is old.\"\nEnlarge this image toggle caption David Schaper/NPR David Schaper/NPR\nLast winter's extremely bitter cold in the Midwest and Northeast was especially tough on the aging water infrastructure in those parts of the country.\nBut water main breaks are becoming increasingly common in warmer months too. \"We replaced 6 feet of main here [of a] 10-inch main,\" that burst open 5 feet beneath a busy thoroughfare in the Chicago suburb of Skokie, says Perry Gabuzzi, a maintenance worker for that city's water department, one recent warm morning.\n\"See the golf-ball-sized holes in it?\" he asked, pointing to the section of pipe his crew removed.\nThe rusted pipe broke open just because of old age. Gabuzzi and his colleagues estimated the section to be at least 70 years old.\nIn Los Angeles in July, a water main estimated to be 93 years old broke wide open, causing severe flooding on the campus of UCLA.\nAnd these kinds of incidents are happening all over the country, as much of the nation's water infrastructure is now a century old.\n\"The infrastructure and the massive investment that our grandparents, great-grandparents, some of us our great-great-grandparents put in, is coming to the end of its useful life, and the bill has come due on our watch,\" Gallet says.\nA recent study by Gallet's group and the Chicago Metropolitan Agency for Planning found the Chicago area alone is losing 22 billion gallons of treated water per year through leaky pipes.\n\"We figured that that could fill the residential needs of about 700,000 people in a year,\" says Tim Loftus, water resource planner for the agency.\n\"That's a big city,\" he says. \"That's a year's worth of residential water use.\"\nNationwide, the amount of water that is lost each year is estimated to top 2 trillion gallons, according to the American Water Works Association. That's about 14 to 18 percent (or one-sixth) of the water the nation treats.\nAnd it's not just water that's going down the drain, but billions of dollars in revenue too because utilities can't charge customers for water that is lost before it gets to them.\nBut fixing the nation's water systems isn't going to be cheap.\n\"Our estimates are that this is a trillion-dollar program,\" says David LaFrance, CEO of the American Water Works Association. \"About half of that trillion dollars will be to replace existing infrastructure. The other half will be putting into the ground new infrastructure to serve population growth and areas that currently aren't receiving water.\"\nAcross the country, many communities are raising water rates — some in the double and triple digits — to begin addressing the problem. California and Maine, as well as several individual communities, are asking voters next week to approve massive bond initiatives to fund water infrastructure improvements.\nBut some government spending watchdogs are skeptical.\n\"Anytime somebody tells me that we have to spend more money, I'm going to look at who is telling me that and do they have an interest in it,\" says Steve Ellis of the Washington-based group Taxpayers for Common Sense.\nHe says water utilities stand to gain from massive water infrastructure spending, as does the American Society of Civil Engineers, which gives the nation's water infrastructure a barely passing grade of \"D.\"\nEllis says that doesn't mean big spending on water infrastructure isn't needed. Voters just need to make sure there's proper oversight, as well as investments in better technologies and conservation.\nThe American Water Works Association is meeting in Atlanta this week in its first conference focused on water infrastructure.\nLaFrance says the first priority is to get water utilities to audit their systems and install and upgrade meters where needed. Then they can get a better handle on just how much water is being lost because too many, he says, just don't know.\nAnd in the meantime, the old and crumbling pipes keep leaking.","url":"https://www.npr.org/2014/10/29/359875321/as-infrastructure-crumbles-trillions-of-gallons-of-water-lost"}
