{"authors":[],"date_download":"2018-10-23 04:10:18","date_modify":"2018-10-23 04:10:18","date_publish":"2016-01-29 19:55:25","description":"Researchers have for the first time witnessed how a single cell can change and give rise to cancer, raising hopes that scientists may discover a way to stop ...","filename":"data/vaneerConsumption/Asinglecellschangegivesinsightoncancersorigin.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i5fx-3bmscybNe842cce83474b596628c-719_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3423381_A-single-cells-change-gives-insight-cancers-origin_1540267818.html","title":"A single cell's change gives insight on cancer's origin","title_page":"A single cell's change gives insight on cancer's origin | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A single cell's change gives insight on cancer's origin\nResearchers have for the first time witnessed how a single cell can change and give rise to cancer, raising hopes that scientists may discover a way to stop tumors before they start.\nDescribed Friday in the journal Science, the study was led by doctors at Boston Children's Hospital and is based on zebrafish that developed melanoma.\nWhen a cell reverted to a stem-cell state and began dividing, it became cancer, researchers found.\nResearchers have for the first time witnessed how a single cell can change and give rise to cancer, raising hopes that scientists may discover a way to stop tumors before they start ©Eric Piermont (AFP/File)\nThe spark for that change was in the crestin gene, which should only be active in embryonic tissue but became inappropriately activated again, resulting in melanoma.\n\"An important mystery has been why some cells in the body already have mutations seen in cancer, but do not yet fully behave like the cancer,\" said first author Charles Kaufman, a postdoctoral fellow in the Zon Laboratory at Boston Children's Hospital.\n\"We found that the beginning of cancer occurs after activation of an oncogene or loss of a tumor suppressor, and involves a change that takes a single cell back to a stem cell state.\"\nThe fish contained a human cancer mutation known as BRAF V600E, which is found in most benign moles.\nThe fish were also engineered to have lost the tumor suppressor gene p53, and to have their individual cells light up in fluorescent green if a gene called crestin was turned on.\n\"Every so often we would see a green spot on a fish,\" said co-author Leonard Zon, MD, director of the Stem Cell Research Program at Boston Children's.\n\"When we followed them, they became tumors 100 percent of the time.\"\nThe research team is trying to develop a genetic test that could be given to people with moles that may look suspicious, to see if their cells are behaving in a way that could lead to cancer.\nAnother avenue for study are so-called super-enhancers, which turn on the genetic changes and could potentially be targeted with drugs to stop a mole from becoming cancerous.\nThe paper \"gives us insight as to one of these additional events that can turn a benign lesion with a BRAF V600E mutation into a malignant melanoma,\" said Craig Devoe, acting chief of the division of hematology and oncology at Northwell Health Cancer Institute in Lake Success, New York.\nPerhaps one day, this knowledge will be translated into new therapies for patients, he added.","url":"https://www.dailymail.co.uk/wires/afp/article-3423381/A-single-cells-change-gives-insight-cancers-origin.html"}
