{"authors":[],"date_download":"2018-10-30 19:55:11","date_modify":"2018-10-30 19:55:11","date_publish":"2017-03-20 19:00:00","description":"Masjid Al-Mu’minun, a mosque on Hank Aaron Drive in south Atlanta, is one of the few that play...","filename":"data/vaneerConsumption/AsMuslimcommunitygrowsopinionsplitsonconfrontingfearshatred.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/21/Images/newsEngin.16541504_091416-mosque-protest-CC11.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_m_035193f56dfe1ef7196cf9216cb00ef0__1540929311.html","title":"As Muslim community grows, opinion splits on confronting fears, hatred","title_page":"As Muslim community grows, opinion splits on confronting fears, hatred","title_rss":"NULL","source_domain":"ajc.com","text":"Masjid Al-Mu’minun, a mosque on Hank Aaron Drive in south Atlanta, is one of the few that play the call to prayer over external speakers, letting the sound drift through the neighborhood. Ahmed Najee-ullah, a leader in the congregation, joked that local residents set their watches by it.\n“We are in those parts of the African American community where a lot of people wouldn’t venture and the communities that we’re in appreciate us being there,” he said. “They have this perception that we represent the best in them.”\nNajee-ullah converted to Islam at the height of the Civil Rights movement. In the years since, the Muslim population of the United States has grown and diversified, fueled by immigration. But as Islamic worship centers move into the suburbs and rural areas, they can face backlash from opponents citing everything from insufficient parking to alleged plots to take over the country and impose Sharia law. Meanwhile, community leaders say mosques help confront Islamophobia on the one hand, and radicalization on the other.\nRead our entire report on how Georgia’s diverse Muslim community is divided over how to assuage fears of non-Muslims while defending their right to worship.","url":"https://www.ajc.com/news/local-govt--politics/muslim-community-grows-opinion-splits-confronting-fears-hatred/tIhxmsnVhHpVCF20C5KdKI/"}
