{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 19:48:03","date_modify":"2018-10-30 19:48:03","date_publish":"2015-01-14 14:45:47","description":"As the western powers prepare for the latest round of never-ending talks with Iran over the fate of its nuclear program, the Tehran regime is reportedly overseeing the construction of a nuclear plant in Syria, as well as the building of new missile sites. Both moves underscore the contempt that Iran has for UN Security Council resolutions and for the nuclear talks themselves, and suggest that President Barack Obama's quest for a deal at any price has only encouraged Iran to behave more aggressively. |","filename":"data/vaneerConsumption/AsObamaDithersIranBuildsNuclearPlantMissilesinSyria.json","image_url":"https://media.breitbart.com/media/2014/12/upi_UN-GENERAL-ASSEMBLY2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_01_14__1540928883.html","title":"As Obama Dithers, Iran Builds Nuclear Plant, Missiles in Syria","title_page":"As Obama Dithers, Iran Builds Nuclear Plant, Missiles in Syria | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"As the western powers prepare for the latest round of never-ending talks with Iran over the fate of its nuclear program, the Tehran regime is reportedly overseeing the construction of a nuclear plant in Syria, as well as the building of new missile sites. Both moves underscore the contempt that Iran has for UN Security Council resolutions and for the nuclear talks themselves, and suggest that President Barack Obama’s quest for a deal at any price has only encouraged Iran to behave more aggressively.\nIn 2007, Israel launched a secret surprise attack on a Syrian nuclear facility that was being built with the help of North Korea. If the new allegations, published by the German magazine Der Spiegel, are confirmed, it will mean that the deterrent effect of that effect has faded, possibly because of the perceived opposition of the Obama administration to any pre-emptive Israeli strikes. It is also possible that Iran might use the Syria plant as a bargaining chip to retain more of the nuclear program inside Iran itself.\nConfronted about the Der Spiegel report earlier this week, State Department Deputy Spokesperson Marie Harf said that the Obama administration would not bring up the alleged Syria nuclear plant in upcoming nuclear talks with Iran. “I just said we’re not going to. I’m not sure what you don’t understand about that,” she said in response to questions by the press. The Obama administration resists the reality that the regime of Bashar al-Assad is, for all intents and purposes, an extension of Tehran.\nFurthermore, as the Washington Free Beacon’s Adam Kredo noted, Iran’s missile-building activity in Syria “could constitute a gross violation of sanctions on the regime enacted by the United Nations and Western powers.” If ignored–as seems likely–it would only be the latest violation that the Obama administration has been willing to tolerate in order to preserve the talks, which are due to expire at the end of June. Previously, Iran has been caught cheating on the interim nuclear agreement.\nSenior Editor-at-Large Joel B. Pollak edits Breitbart California and is the author of the new ebook, Wacko Birds: The Fall (and Rise) of the Tea Party, available for Amazon Kindle.\nFollow Joel on Twitter: @joelpollak","url":"https://www.breitbart.com/national-security/2015/01/14/as-obama-dithers-iran-builds-nuclear-plant-missiles-in-syria/"}
