{"authors":[],"date_download":"2018-10-30 01:10:39","date_modify":"2018-10-30 01:10:39","date_publish":"2015-12-05 00:00:00","description":null,"filename":"data/vaneerConsumption/AsoldiernotaterroristinSanBernardino.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_12_a_soldier_not_a_terrorist_in_san_bernardino_1540861839.html","title":"A soldier, not a terrorist in San Bernardino","title_page":"A soldier, not a terrorist in San Bernardino","title_rss":"NULL","source_domain":"americanthinker.com","text":"A terrorist is a misfit, an outlier, perhaps mentally ill. A soldier is a noble figure, sacrificing himself for a cause bigger than he is. Whatever may have happened between Nicholas Thalasinos and Syed Farook, and it does seem likely that being hectored by someone who was both a Christian and a Jew may have pulled the lanyard on Farook prematurely, this was not a terrorist attack – it was a military op. Conducted from a base stocked with ordnance.\nAnd it ended perfectly. Farook and his buddy Tashfeen Malik, who was also his wife, went out in a blaze of enemy – our guys' – fire, killed in jihad, the highest estate in Islam, going directly to Paradise and together forever.\nA soldier, particularly one on a mission in enemy territory, is going to fit in, follow the local customs, not make waves. Until he strikes – unexpectedly, deadly, extremely. That is Tamerlan and Dzhokar Tsarnaev; that is Sayyid Farook and Tashfeen Malik.\nThere is a search for \"characteristics\" that Farook might have exhibited of dissatisfaction or insanity or discomfiture with or being marginalized from our society. Instead, we get \"He was so nice and quiet; who knew?\"\nWe have all-volunteer Armed Forces. Do we think those volunteers are misfits, or worse, antisocial or even insane? No! They are our best, engaged in a noble activity: defending the Republic.\nWhy isn't this a terrorist attack – a cowardly, immoral action? Because there are no innocents among the infidels, no innocents in the house of war, Dar al-Harb. Dar al-Harb is to be converted to Dar al-Islam, the house of Islam. That is its only destiny. And until that destiny is achieved, the house of war is profane, an obscenity in the eyes of the Muslim god. It is the duty of all good Muslims to engage in jihad, in subduing that part of the world not yet part of Dar-al Islam, not yet under sharia law, and they are not squeamish about it, as they perceive us to be. Our moderation, our respect for life is weakness in their eyes. What could be more glorious, how could a life be more fulfilled, than in dealing a deadly blow to the Great Satan, what Stalin would have called the \"principal adversary\"?\nThat is what happened in San Bernardino. An engagement in the long but unquenchable struggle for Islam to rule the globe through sharia. Yes, this is a pinprick to the Great Satan, but since we no longer have the will to defend ourselves, since our degenerate customs and apostasy have eaten away our souls, who knows how little it might take to make our whole rotten structure come crashing down? And whatever it takes, Islam will provide. As they say in Afghanistan, \"the Americans have all the watches, but we have all the time.\"\nMany, perhaps most, American Thinker readers will have a skeptical view of Franklin Roosevelt for his introduction of socialism into the American bloodstream. Forget that for a second. We were lucky to have FDR as our war leader the last time we were attacked on our home territory. He knew how to floor the accelerator. In his speech to Congress on December 8, he declared, \"The American people in their righteous might will win through to absolute victory.\" Looking back, studying history, this has seemed obvious, really a cliché. But now we know what it is like when our leadership cannot summon such resolve, is unable to even identify the enemy, much less take the fight to it.\nAnd then, at the Casablanca Conference in January 1943, Roosevelt, taking the term from Ulysses Grant, stated that our war goal was \"unconditional surrender.\" We can now see that that not only made things clear to the other side, but also made things clear to our side.\nLiberals, meaning Democrats, will not defend our society or our country. They will not defend America because they don't think we have a right to exist, that we are so contaminated by our sins that righteousness lies on the side of our enemies, not on ours.\nObama is committed to Islam. If he accepted the violence that is at the heart of Islam, he would have nowhere to go. He would have to acknowledge that America is in the right, that our power and influence back down the destroyers and the sadists. That America is a force for good in the world. His entire life is dedicated to the opposite idea, that his role is to apologize for American power and to diminish it. His support for the Arab Spring, the escape of Arab Muslim radicalism from the chains in which the Arab strongmen had held it shows where his allegiance lies.\nWhat is to be done? We have to hope that we can muddle through until 2017 and Donald Trump can get to the helm. Then, as Patton put it, God have mercy on our enemies, for we shall have none.","url":"https://www.americanthinker.com/blog/2015/12/a_soldier_not_a_terrorist_in_san_bernardino.html"}
