{"authors":[],"date_download":"2018-10-30 14:33:29","date_modify":"2018-10-30 14:33:29","date_publish":"2018-08-16 20:08:00","description":"In metro Atlanta, 342 people died from opioid overdoses in 2017, a 14 percent increase from the year before.","filename":"data/vaneerConsumption/AsopioiddeathsrisemetroAtlantasearchesforsolutions.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/MyAJC/2018/08/16/Images/newsEngin.22673371_071518-overdose_AP_5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_2b22d781d28cab9d5d1afe63f4bc6418__1540910009.html","title":"As opioid deaths rise, metro Atlanta searches for solutions","title_page":"Metro Atlanta counties adopt different approaches to combating opioids","title_rss":"NULL","source_domain":"ajc.com","text":"A large crowd watched as the man collapsed on a stage in Decatur, acting as if he’d just overdosed on opioids. He shut his eyes, splayed his arms and stuck a bent knee out to his side.\nDr. Daniel Knecht guided the crowd through how to help him: Try to get him to wake up. If that doesn’t work, check to see if he is breathing. Rub his sternum with your knuckles. And if he doesn’t respond, spray some Narcan — an overdose reversal medication — up his nose, roll him on his side and wait for an ambulance to arrive. The actor pretended to awaken after Knecht finished with him, and then he bowed dramatically, eliciting applause.\nThat demonstration – held last month at DeKalb County’s recent second annual Opioid Summit — is part of the Atlanta region’s wide-ranging response to the opioid overdose epidemic. Now deadlier than guns and car crashes, drug overdoses killed about 72,000 Americans last year, a record number driven by a spike in opioid-related deaths, according to estimates released by the U.S. Centers for Disease Control and Prevention this week. In the Atlanta area last year, 342 people died from opioid-related overdoses, up 14 percent from the previous year, state Department of Public Health figures show.\nMORE: Meth is back — and deadlier than ever\nMORE: Fatal heroin overdose tests limits of Ga. amnesty law\nIn January, a federal judge in Cleveland, Ohio seeking to resolve hundreds of lawsuits filed by local governments against the opioid industry said they weren’t doing enough.\n“In my humble opinion, everyone shares some of the responsibility, and no one has done enough to abate it,” said U.S. District Court Judge Dan Polster.\n“That includes the manufacturers, the distributors, the pharmacies, the doctors, the federal government and state government, local governments, hospitals, third-party payors, and individuals.”\nAs they watch the death toll rise and their taxpayer costs for health care, law enforcement and other related expenses jump, Atlanta-area governments are scrambling to fight the epidemic. There isn’t a single playbook, so they are attacking the crisis from many different angles and learning along the way.\nMore than 10 percent of hospitalized patients who took one or more opioid painkillers experienced a side effect tied to the drug, according to a study published Wednesday in the journal JAMA Surgery. (Dreamstime) (The Washington Post)\nFor DeKalb, that means raising awareness and training; for Fulton County, that means naming a point person to focus on the problem; for Cobb County, that means teaming up with a heavyweight nonprofit that is combating drug addiction; and for Gwinnett County, that means working with a state agency that offers addiction treatment. On the front lines, Atlanta-area police and sheriff’s deputies are carrying Narcan and treating jail inmates suffering from painful withdrawal symptoms.\n“There’s no one magic way to tackle this for a county, because it really very much depends on the leadership locally and who’s the trusted person in the community, how you get the support from the elected officials in the makeup of that community,” said Brian Bowden, associate legislative director for the National Association of Counties.\nStill in ‘study mode’\nAbout 100 people — including social workers, county commissioners and others — watched on July 26 as Knecht demonstrated how to push down the plunger on a bottle of Narcan. It clicked as he pressed it with his fingers.\n“We are seeing, unfortunately, more and more opioid overdose victims requiring multiple doses of Narcan. This is because there is more and more heroin being used and stronger and more potent opioids,” said Knecht, vice president of clinical strategy and policy for Aetna.\nThe Aetna Foundation donated $15,000 worth of Narcan kits to DeKalb at the event. The county, meanwhile, is still in “study mode” when it comes to battling the epidemic, said DeKalb Commissioner Larry Johnson, who co-hosted the summit with Stand Inc., a nonprofit aimed at preventing substance abuse.\n﻿In-depth: Heroin’s trail of death﻿\n﻿In-depth: What the painkillers took﻿\nIn neighboring Gwinnett, officials are referring people to View Point Health, a state agency that handles most of the county’s behavioral and mental health care. The agency operates four outpatient centers, offers detox services and can set up subsidized housing for patients through a residential recovery program in Covington.\nMissy Owen, executive director of the Davis Direction Foundation, and others work at The Zone in Marietta, Georgia, on Monday, June 25, 2018. The Zone is operated under the foundation to support people in recovery. REANN HUBER/REANN.HUBER@AJC.COM\nMeanwhile, Cobb is working closely with the Davis Direction Foundation, which was created to fight drug addiction after Davis, the son of Missy and Michael Owen, died of a heroin overdose in 2014. The county leased a building to the Marietta-based nonprofit in 2016. And key county officials work closely with it, including the county’s medical examiner and police and fire chiefs. In September, the foundation will host its first national conference, Building Communities of Recovery, where guests will hear from speakers, including Cobb District Attorney Vic Reynolds, local pastor Creflo Dollar and Heather Hayes, a specialist who has appeared on the A&E series “Intervention.”\n“We have partnerships all over this county,” said Missy Owen, the foundation’s executive director. “Because this epidemic is so widespread, everybody has some affiliation.”\nThe opposite of addiction\nEdward’s harrowing journey started with prescription pills. A chef from Roswell, he dug into medicine cabinets at his friends’ homes. He also used cocaine, which became his favorite drug. But soon that wasn’t strong enough. So he moved to heroin. He overdosed and nearly died the first time he tried it. He later learned it had been spiked with fentanyl, a powerful pain medication that can be lethal in tiny amounts.\n“I was found on my couch,” said Edward, who spoke to The Atlanta Journal-Constitution at No Longer Bound — a 12-month, abstinence-based residential treatment center in Cumming — on condition that only his first name be used to protect his privacy. “Everything was shutting down. The crazy addiction part of it was in the hospital just telling myself, ‘Just don’t do that again. Just do what you know is right, or what you know isn’t right but what you know how to do.’”\nDOCTORS AND OPIOIDS: An AJC National Investigation\nMORE: Overdose deaths in Georgia outpace nation\nThe government can best fight the epidemic, Edward said, by overhauling the way doctors prescribe painkillers and by getting addicts in treatment. And that treatment, he said, should focus on opioid addictions as a disease, not as a moral failing.\n“Education is huge — and not educating people by using guilt and using shame,” he said. “If you are going to just keep guilting and shaming me into making me believe what you think I should believe – for me my personality was: I am going to go the other direction and experience it for myself.”\nKeaton, a Gainesville resident who worked in the landscaping industry, recovered with Edward at No Longer Bound. He exhaled deeply before telling his story about abusing prescription pain medication and becoming addicted to methamphetamine and heroin. He stole from friends. He got arrested for driving under the influence. He destroyed his friendships. He spent months in jail.\n“Really early, I started living a double life. I was a varsity wrestler. But in my off time I was using drugs and getting high — kind of running with two crowds,” he said. “It got to a point where the party life just took over and I ended up getting kicked out of school and would kind of get sober and do good for a couple of months and then just sabotage it and blow it up.”\nMissy Owen, executive director of the Davis Direction Foundation, is seen with “The Zone Replication Toolkit”at The Zone in Marietta, Georgia, on Monday, June 25, 2018. The toolkit is designed to help others create the same model ofThe Zone, which is operated under the foundation to support people in recovery. (Reann Huber)\nKeaton eventually began living for just one thing: Getting his next fix. The government, he said, should educate people at an early age about the dangers of opioids. Connecting recovering addicts with supportive professionals, friends and family also would help, he said.\n“The opposite of addiction is connection,” he said. “Once it is out there, you are not struggling. It is not just internal anymore. People know where you are at. And they can love you where you are at. And that is half the battle right there.”\n‘You have to do all of that, baby?’\nLynnette Allen remembers how her mother seized immediately on the seriousness of her new job after Fulton County appointed her as its new interim coordinator for the epidemic. A veteran public health official, Allen serves as a liaison between the county and community leaders and helps make people aware of the resources Fulton offers to those afflicted by the crisis. The South Carolina native is also hoping to find funding, including grant money.\n06/26/2018 -- Roswell, GA - Lynnette Allen (right) Fulton County's new opioid coordinator, listens to speakers during an Opioid Crisis Forum at the Roswell City Council Chambers,Tuesday, June 26, 2018. ALYSSA POINTER/ALYSSA.POINTER@AJC.COM (Alyssa Pointer)\n“My mom was super excited and she was like, ‘You have to do all of that, baby?’ And I said, ‘yes, ma’am, I do,’” said Allen, who previously worked as a disease investigator for the Georgia Department of Public Health.\nFulton, Allen said, has spent $98,000 equipping its public safety officials with anti-overdose medication. The county is home to 22 disposal boxes for unwanted medication. And this year, the Fulton County Jail began giving detainees who have abused drugs, including pregnant women, buprenorphine, a medication for opioid addiction.\nSoon after she began her new job this year, Allen started hearing stories illustrating the broad scope of the deadly crisis and the stigma attached to those caught in it. People keep approaching her in private, she said, wanting to secretly tell her about friends and family battling opioid addiction.\n“They are like, ‘Oh, you do that? Well come here, let me tell you about this person. Let me tell you what has been happening,’” she said. “I’m getting a lot of that.”\nLocal governments can’t stop the epidemic on their own, said Fulton Commission Vice Chairman Bob Ellis. Consumers, he said, should pay close attention to their prescriptions and the medications their relatives are receiving.\n“It can’t be solved by just local government. It has got to take citizens acting as well,” he said. “This is a man-made epidemic. And man can change it. This is solvable.”","url":"https://www.ajc.com/news/state--regional-govt--politics/opioid-deaths-rise-metro-atlanta-searches-for-solutions/g5phkSzJN0d5PMtCXT2aeI/"}
