{"authors":["Frances Martel"],"date_download":"2018-10-30 19:29:11","date_modify":"2018-10-30 19:29:11","date_publish":"2015-03-24 15:15:49","description":"Wikileaks founder Julian Assange has decided to jump into the fray of the Alberto Nisman murder mystery, telling an Argentine news outlet that the high-ranking prosecutor-- found dead hours before he was scheduled to accuse the Argentine president of aiding Hezbollah-- should have been \"disciplined\" for cooperating in his investigations with the United States. |","filename":"data/vaneerConsumption/AssangeArgentineProsecutorInvestigatingIranShouldHaveBeenDisciplined.json","image_url":"https://media.breitbart.com/media/2015/03/julian-assange-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_24__1540927751.html","title":"Assange: Argentine Prosecutor Investigating Iran 'Should Have Been Disciplined'","title_page":"Assange: Argentine Prosecutor Investigating Iran 'Should Have Been Disciplined' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Wikileaks founder Julian Assange has decided to jump into the fray of the Alberto Nisman murder mystery, telling an Argentine news outlet that the high-ranking prosecutor– found dead hours before he was scheduled to accuse the Argentine president of aiding Hezbollah– should have been “disciplined” for cooperating in his investigations with the United States.\n“Nisman made himself very dependent on the United States to receive intelligence reports,” Assange alleges in an interview with Argentina’s Página 12. Nisman had been working for years on finding the culprits responsible for the 1994 bombing of the Argentine Israeli Mutual Association (AMIA), the deadliest attack in that nation’s history, leaving 85 dead and dozens of others wounded. The nearly 300-page report he was to present the Argentine Congress on January 19, the day after his death, suggests that Iranian terrorists associated with the Shiite terrorist group Hezbollah were responsible for the attack, and that President Cristina Fernández de Kirchner negotiated with Iran to help keep the suspects hidden from Interpol. No suspects have been arrested in relation to the bombing in 21 years.\nAssange argues that the real problem in the AMIA case is not the links Nisman offered to prove existed between the Fernández de Kirchner administration and Hezbollah, but that Nisman’s intelligence may have been aided by American operatives. According to Assange, Jaime Stiuso, one of Nisman’s main intelligence sources in writing the report, received much of his intelligence from “the United States and Israel.”\n“There is a much more important critique to make, and that is the fault of the Kirchner government in not disciplining Nisman in due time for his relationship with intelligence services, his relationship with the U.S.,” Assange alleges. “There appeared to be a national agreement between the government, opposition, and media to not question the quality of Nisman’s investigation,” Assange claimed. He also describes the interests of the various state powers as Iran wanting to “protect itself,” while the United States “sought to demonize Iran.”\nThe interview includes Russia Today-worthy tidbits on all sorts of other international matters, including the accusation that “Israel supported Hamas initially,” “the West is destroying Iraq to extract petroleum,” and a strange critique that Russia failed to properly “relate to the Ukrainian people” before invading that country outright.\nAssange’s decision to opine on the Nisman matter follows scathing comments from President Fernández de Kirchner’s chief of staff that Nisman’s report was of questionable credibility because of his own moral shortcomings. Anibal Fernández (no relation) told the press last week that Nisman “received a lot of money” for the AMIA case and “spent it on young women and ñoquis [Argentine slang for an employee who gets paid without working],” adding that Nisman “went to Cancun with a secretary ñoqui and a known prostitute” and was generally a “scoundrel.” Such a posthumous ad hominem attack took some Argentine media by surprise.\nNisman’s murder– initially ruled a suicide– remains a mystery, and Argentines want answers. Nearly half a million Argentines took the streets of Buenos Aires on February 18, the one-month anniversary of his death, demanding a thorough investigation. At least one independent study implicates Hezbollah in his shooting. Argentina may face international sanctions should its government be found complicit in either aiding the perpetrators of the AMIA bombing or in Nisman’s murder.","url":"https://www.breitbart.com/national-security/2015/03/24/assange-argentine-prosecutor-investigating-iran-should-have-been-disciplined/"}
