{"authors":["Chris Summers For Mailonline"],"date_download":"2018-10-23 00:20:56","date_modify":"2018-10-23 00:20:56","date_publish":"2017-04-26 09:47:52","description":"WikiLeaks founder Julian Assange has lambasted Donald Trump's administration for threatening to crack down on the website because it had revealed their own failings.","filename":"data/vaneerConsumption/AssangehitsoutatTrumpsvowtocrackdownonWikiLeaks.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F94FC1E00000578-0-image-a-10_1493194199236.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446772_Assange-hits-Trump-s-vow-crack-WikiLeaks_1540254056.html","title":"Assange hits out at Trump's vow to crack down on WikiLeaks","title_page":"Assange hits out at Trump's vow to crack down on WikiLeaks | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"WikiLeaks founder Julian Assange has lambasted Donald Trump's administration for threatening to crack down on the website because it had revealed their own failings.\nAssange has been holed up in the Ecuadorian embassy in London since 2012, having claimed political asylum because he fears deportation to the United States, where he faces prosecution for revealing state secrets.\nHe is still wanted for extradition to Sweden, where he was accused of raping two women in 2010, but the statute of limitations on those offences will expire in 2020.\nJulian Assange (pictured, right) has criticized CIA director Mike Pompeo (left) for 'declaring war on free speech'\nAssange penned an article in the Washington Post in which he criticized the CIA's new director, Mike Pompeo for 'declaring war on free speech'.\nHe said that rather than going after America's 'actual adversaries' Pompeo had gone after WikiLeaks, which recently gave descriptions of CIA-developed malware that could turn Samsung TVs into recording devices.\nIt was part of WikiLeaks' Vault 7 series, which it claims to be information leaked from secret CIA files.\nAssange wrote: 'In Pompeo's worldview, telling the truth about the administration can be a crime - as Attorney General Jeff Sessions quickly underscored when he described my arrest as a \"priority\".'\nLast week Sessions told reporters Assange's arrest was a priority and added: 'We've already begun to step up our efforts, and whenever a case can be made, we will seek to put some people in jail.'\nAssange wrote: 'Vault 7 has begun publishing evidence of remarkable CIA incompetence and other shortcomings.\n'This includes the agency's creation, at a cost of billions of taxpayer dollars, of an entire arsenal of cyber viruses and hacking programs - over which it promptly lost control and then tried to cover up the loss.'\nAssange pointed out that Donald Trump (left) had been happy to highlight 'incredible information' released by WikiLeaks during the presidential campaign but now his Attorney General, Jeff Sessions (right) was making Assange's arrest a 'priority'\nAssange said Pompeo's demonization of WikiLeaks as an 'enemy' should be a wake-up call for all journalists and seekers of truth\nAssange claimed the Trump administration was racked by hypocrisy.\nHe wrote: 'As a candidate, Trump tweeted: \"Very little pick-up by dishonest media of incredible information provided by WikiLeaks.\" The president mentioned WikiLeaks 164 times during the last month of the election and gushed: \"I love WikiLeaks\".'\nBut now his senior officials, like Pompeo and Sessions, were targeting WikiLeaks and Assange himself.\nAssange, who is an Australian citizen, wrote: 'When the director of the CIA, an unelected public servant, publicly demonizes a publisher such as WikiLeaks as a \"fraud\", \"coward\" and \"enemy\", it puts all journalists on notice, or should.'\nPompeo described WikiLeaks as a 'non-state hostile intelligence service', which Assange claimed was 'a dagger aimed at Americans' constitutional right to receive honest information about their government'.\nHe added: 'This accusation mirrors attempts throughout history by bureaucrats seeking, and failing, to criminalize speech that reveals their own failings.'","url":"https://www.dailymail.co.uk/news/article-4446772/Assange-hits-Trump-s-vow-crack-WikiLeaks.html"}
