{"authors":["Elizabeth Castillo","Dan Morain","Dan Walters"],"date_download":"2018-10-30 22:43:10","date_modify":"2018-10-30 22:43:10","date_publish":"2018-09-06 19:34:46","description":"The state gives migrant farmworker families a new exemption from the 50-mile rule, which had required them to move during the school year to keep their housing.","filename":"data/vaneerConsumption/AsschoolyearbeginsCaliforniaendspracticethatuprootedmigrantstudents.json","image_url":"https://calmatters.org/wp-content/uploads/Child-outside-migrant-house-e1536281077112.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939390.html","title":"As school year begins, California ends practice that uprooted migrant students","title_page":"As school year begins, California ends practice that uprooted migrant students | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Oscar Ramos teaches students of migrant farm workers in his classroom at Sherwood Elementary School in Salinas, California. He sees students disappear because they must follow the crops with their parents, moving from town to town, making a steady education difficult. One year, a 4th grade teacher started the year with 28 students and ended with just three.\n“When the harvest season is over here in the Valley, the Central Coast, a lot of our parents would move to Arizona,” he said. “Everyone, the parents, the children, they would all go. So we would lose a lot of students.”\nOne reason that’s been happening in some California communities: the “50-mile regulation ” defining who qualifies to live in one of 24 state-subsidized migrant housing centers . To maintain their housing eligibility, workers have had to move at least 50 miles away for several months out of the year, returning for the next harvest. Some moved across California, or to other states such as Arizona, or even back to Mexico—their children in tow. The regulation originated decades ago, when it impacted mostly single men—but as more families came to use that housing, the rule disrupted their children’s education every year.\nUntil now.\nAs the new school year gets underway, many migrant families will be able to take advantage of a newly enacted exemption , championed by Democratic Assemblywoman Anna Caballero of Salinas. It allows migrant farmworkers with children to stay put for the duration of the school year. Up to half of subsidized migrant housing may now be allocated to farmworkers with families.\nWhile some advocates applaud the new exemption, others worry the change could exacerbate an existing housing crisis for farmworkers without children.\n“We should be providing more decent affordable housing for all farm workers,” said Ilene Jacobs, director of litigation, advocacy and training for California Rural Legal Assistance, a nonprofit that provides legal support to farmworkers and other low-income people in rural communities. “We shouldn’t be pitting one group of farmworkers against another group of farmworkers and allowing them to win out in eligibility.”\nThe federal Office of Migrant Education works to improve the circumstances of migrant students, but even identifying them can be difficult.\nRamos said that as children begin to stay with relatives or live with other farm-working families, new challenges arise. These students no longer qualify as migrants but they may live in cramped quarters.\n“Housing is one of the biggest issues we have in our area,” he said. “It’s huge.”\nHe said that teachers often need to make home visits and prideful families are reluctant to let teachers see where they’re living. “They don’t want us to see where they’re living just because they’re sharing an apartment with three other families where one family is renting one room, and there’s an entire other family renting another room,” Ramos said.\nJacobs, who’s helped farmworkers with housing for over 20 years, said she’s seen people living in their trucks and under trees.\nStill, for those who rely on the migrant housing centers, moving every year adds another barrier to student success.\nFour out of every five students California classifies as “migrant” graduate high school, according to the State Superintendent of Education’s office. But that includes students who were formerly migrants, even though their circumstances have changed.\nCaballero pushed for the budget trailer bill creating the exemption because she contends the regulation fueled lower graduation rates for migrant students. She said she discovered the problem in her previous job as the governor’s secretary of business consumer services and housing.\n“When the bar is so high because you’ve had to move from school to school, it becomes very discouraging,” she said. “It’s my hope that what we’ll see is migrant students doing better in school, and a stability in their educational experience.”","url":"https://calmatters.org/articles/california-stops-uprooting-migrant-students-50-mile-regulation-exemption/"}
