{"authors":["John J. Xenakis"],"date_download":"2018-10-30 20:33:56","date_modify":"2018-10-30 20:33:56","date_publish":"2016-09-13 13:29:34","description":"Contents: As Syria ceasefire begins, Bashar al-Assad quickly rejects it; Confusion grows over role of al-Nusra Front in US-Russia peace plan | National Security","filename":"data/vaneerConsumption/AsSyriaCeasefireBeginsBasharalAssadQuicklyRejectsIt.json","image_url":"https://media.breitbart.com/media/2016/09/wi/afp_2f62e3cae24a5f56f9244e3cd34f469ded1b65cb-e1473773369134.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_09_13__1540931636.html","title":"As Syria Ceasefire Begins, Bashar al-Assad Quickly Rejects It","title_page":"As Syria Ceasefire Begins, Bashar al-Assad Quickly Rejects It","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nAs Syria ceasefire begins, Bashar al-Assad quickly rejects it\nConfusion grows over role of al-Nusra Front in US-Russia peace plan\nAs Syria ceasefire begins, Bashar al-Assad quickly rejects it\nMap of Syria and Iraq, showing who’s in control of different regions (WaPost)\nThe latest and greatest ceasefire in Syria’s war began at 7 pm local time on Monday, amid reports that the regime of Syria’s president Bashar al-Assad is continuing to drop barrel bombs on civilian neighborhoods in Aleppo.\nIt has never been entirely clear whether or not al-Assad was accepting the ceasefire proposal that was imposed by Russia and the United States, but on Monday, he made a statement that clearly rejected it:\nWe as a nation… are delivering a message that the Syrian state is determined to recover all regions from the terrorists and restore security, infrastructure, and everything else that was destroyed in both human and material aspects. We come today here to replace the fake freedom they tried to market at the beginning of the crisis… with real freedom, not the freedom that begins with them and is sustained by dollars… and by some promises of positions.\nIf you look at the map above, you can see that the al-Assad regime and the opposition rebels (the “Sunni insurgents”) are together fighting over a western region that is only a small fraction of Syria, and that al-Assad is not in control of the overwhelming portion of Syria.\nThe region colored green, which is controlled by Kurdish forces, is much larger, if you count the portions under Kurdish control in both Syria and Iraq. The so-called Islamic State (IS or ISIS or ISIL or Daesh) also controls large sections of Syria and Iraq, and those are totally out of reach of the al-Assad regime.\nSo the ceasefire agreement, if implemented, might leave al-Assad still in power, but only in control of a small fraction of the country. And al-Assad is clearly not willing to accept that.\nThe second portion of al-Assad’s statement promises to replace “fake freedom they tried to market at the beginning of the crisis… with real freedom.” There is some confusion about what this statement means, and I have actually seen different translations in different reports, but here is my interpretation of what it means.\nWhen the crisis began early in 2011, there was no ISIS, no al-Nusra, and no Free Syrian Army. There were just peaceful protests, demanding what al-Assad is now calling “fake freedom.” There are peaceful protests in Washington, London, Paris, and other cities. Suppose there were a “Black Lives Matter” protest on the Washington Mall, and President Obama responded by calling out the army and air force to shoot and bomb the protesters, as well as the cities in which the protesters live.\nIt is a bizarre concept, but that is what al-Assad did in 2011, and this brings me to a contradiction that has been bothering me for years. Suppose there were some peace agreement, and everyone stopped fighting. What would happen if Syrian civilians began peaceful protests again? – which is what would happen in a generational Awakening era. I’m guessing that the psychopathic Bashar al-Assad would start shooting and bombing civilians again.\nSo this week we have a ceasefire deal reached in Geneva by the United States and Russia. But there are no penalties for violations, in particular, no violations for continuing air strikes and barrel bombs launched by the al-Assad regime. And neither al-Assad nor any of the opposition groups have endorsed the deal, anyway. Indeed, the US State Department on Monday had to go out of its way to deny that the US and Russia would have any control whatsoever on Syrian regime airstrikes.\nAs usual in the media, there always has to be “good news” and “hope.” Today’s version is that most of the fighting seems to have stopped at least for the time being. We’ll have to see how long it lasts. Washington Post and ARA News (Syria) and VOA\nRelated Articles\nConfusion grows over role of al-Nusra Front in US-Russia peace plan\nWhen jihadists from around the world began pouring into Syria in 2013 to fight Bashar al-Assad, many of them joined al-Qaeda linked Jabhat al-Nusra (al-Nusra Front). However, as the trickle of jihadists turned into a flood, there was a split between al-Nusra and a new jihadist group, the so-called Islamic State (IS or ISIS or ISIL or Daesh). There were two major differences between the two jihadists group.\nThe first difference was that ISIS refused to pledge allegiance to al-Qaeda, while al-Nusra continued its allegiance to al-Qaeda.\nThe second difference was that al-Nusra has always been an organization of almost exclusively Syrian fighters, while ISIS has fighters from all over the world. However, members of the Free Syrian Army and other “moderate” rebel groups did not want to be associated with any jihadist group, either al-Nusra or ISIS.\nIn July, al-Nusra announced that it would split with al-Qaeda, and rename itself Jabhat Fateh al-Sham (JFS – Front for the Conquest of Syria). The announced objective was to become more acceptable to the moderate rebel groups in Syria, and also to become more acceptable to the international community.\nThe United States announced that JFS was still considered to be a terrorist organization. The US airstrikes have continued to target JFS, and last week the US announced that an airstrike had killed Abu Hajer al Homsi (alias Abu Omar Saraqeb), a top JFS commander.\nHowever, JFS’s split with al-Qaeda has made any discussion of a peace agreement more complicated. An objective of the US-Russia ceasefire deal is that FSA and “moderate” rebel groups should be spared, while jihadists should continue to be targeted. But now JFS and FSA are working more closely together in fighting al-Assad. Insofar as they’ve merged, the distinction between moderate and jihadist fighters has gotten even more complicated, and makes it even less likely that any ceasefire will last for long. Reuters (9-Sept) and The National (UAE) and Al-Monitor\nRelated Articles\nKEYS: Generational Dynamics, Syria, Bashar al-Assad, Aleppo, Islamic State / of Iraq and Syria/Sham/the Levant, IS, ISIS, ISIL, Daesh, Jabhat al-Nusra, al-Nusra Front, Free Syrian Army, FSA, Jabhat Fateh al-Sham, JFS, Front for the Conquest of Syria, Abu Hajer al Homsi, Abu Omar Saraqeb\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2016/09/13/13-sep-16-world-view-syria-ceasefire-begins-bashar-al-assad-quickly-rejects/"}
