{"authors":["Judy Lin","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 23:09:59","date_modify":"2018-10-30 23:09:59","date_publish":"2016-06-04 08:00:00","description":"One by one, dozens of blacks and Latinos lined up behind a microphone placed before the state school board appointed by Gov. Jerry Brown. Spanish-speaking","filename":"data/vaneerConsumption/AStanfordprofessorshighstakesplantosaveCaliforniaschools.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/Kirst_Rahimian14-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940999.html","title":"A Stanford professor’s high-stakes plan to save California schools","title_page":"A Stanford professor’s high-stakes plan to save California schools | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"One by one, dozens of blacks and Latinos lined up behind a microphone placed before the state school board appointed by Gov. Jerry Brown. Spanish-speaking mothers pleaded for the 10-member panel to evaluate schools based on parent involvement because they have felt unwelcome at their children’s schools. African-American students asked the state to compile school suspension and absenteeism rates because those problems cause students to fall behind on schoolwork, feel alienated by teachers and struggle to find their self worth.\n“Please, we just want to make sure that it is a defining factor in the way you measure the success of schools,” George Green, a Sacramento high school student, said at the meeting in March.\nHow the state will close a staggering academic performance gap between students from poor communities and those in wealthier pockets that is nearly the worst in America rests disproportionately on State Board of Education President Michael Kirst. The 76-year-old retired Stanford University professor has served four decades as one of Brown’s closest advisors and witnessed how difficult it is to improve classroom learning.\nTogether, he and the governor have devised a dramatic transformation of the nation’s largest public school system that calls for dismantling decades of centralized state reporting and promoting teacher autonomy. It’s an experiment of California proportions that even its key architect doesn’t know how it will play out for millions of disadvantaged children.\n“Even though this is my 52nd year in educational policy,” Kirst said. “I don’t know what’s going to happen.”\nCalifornia’s push for local control is anchored in a principle the governor calls subsidiarity, the idea that teachers, principals and local school administrators are better equipped to deal with classroom problems than state lawmakers or government bureaucrats. Having witnessed various education reform efforts of the past half century, Kirst and Brown have come to be dismissive of educational fads and discouraging about the state’s ability to fix the problems.\n“If the parent screwed up things, and if the principal’s no good, if the principal can’t lead, if the superintendent isn’t very good, if the local school board isn’t so good, what makes you think that the Legislature can fix it,” Brown said at a Los Angeles dinner in May.\nGov. Jerry Brown at Berggruen Institute’s five-year anniversary celebration\nTheir hands-off approach plays favorably for teachers unions that chafe at evaluations but increasingly, parents, students and civil rights advocates are pushing back.\nSpeakers at recent state education board meetings expressed concern that underperforming schools will not be held accountable without proper state oversight. Advocates are demanding the state monitor social factors to ensure positive learning environments and there’s a politically charged debate over whether the state should resume school rankings.\nSome Democrats are anxious that handing state decisions to local school districts could expand the power of the teachers union without doing much to tackle the academic performance lag among California’s 3.7 million African-American and Latino children who are disproportionately poor and make up 60 percent of students in school today.\n“At root, the problem is trust,” wrote Charles Kerchner, a research professor at Claremont Graduate University, in what he called California’s accountability vacuum, “For the last half century, education politics has been built on profound distrust of school districts to act in the best interests of poor and minority students. Civil rights efforts in the United States were born of this reality. Brown’s principle of subsidiarity is about trusting schools and districts, and, increasingly, the advocates and Legislature are pushing back.”\nFew understand this distrust more than Kirst, who shares the governor’s long view of public education dating back to the 1950s. Having served Brown since his first term, Kirst is respected in academic and policy circles for his understanding of government systems; known as a prolific writer who authored a widely used textbook on American education politics; and liked by the governor for his ability to corral disparate views from the powerful California Teachers Association to billionaire education reform booster Eli Broad. Fellow Stanford education professor Linda Darling-Hammond, respected in her own right, called Kirst’s work on local control “revolutionary.”\nCalifornia’s public school system, once a model for the world, has been in disrepair for decades. A property tax revolt in 1978 caused a loss in local school funding. Today, the state doesn’t just rank low on school spending, its students rank near the bottom on national tests in both reading and math for fourth and eighth grades.\nThe achievement gap is even more glaring along racial lines. Fewer than one in four Latino children and fewer than one in five African American children were proficient in math. Meanwhile, half of white students and more than two-thirds of Asian American students measured proficient on the same test.\nIn response, Kirst designed — and Brown pushed through — a school funding overhaul that targeted more state money to students from low-income families, English-language learners and foster children. Brown’s landmark 2013 school funding overhaul, called the Local Control Funding Formula, gave substantial discretion to local school districts without requiring them to tell the state how they are spending that money.\nRather than dictating from Sacramento, Kirst’s recipe was to direct more funding to poorer pockets of the state on the belief that local educators would intervene on behalf of underperforming students. The state would only step in for the most egregious cases but otherwise act as a help center.\nThe state’s ultimate goal is to create easy-to-use school report cards and offer struggling districts support through county offices of education and a newly created California Collaborative for Educational Excellence. Carl Cohen, a former Long Beach superintendent, testified before the Senate Education Committee this spring that the center remains in its infancy and a skeleton staff is starting off with a pilot program in San Bernardino County.\nThis model assumes school districts will be able to manage mostly by themselves, but that is an area of debate.\n“We’ve got a lot of school districts out there that do not have strong leadership, do not have the kinds of cultures that are necessary to succeed, so having a local funding system I don’t think is going to be a panacea,” said Gary K. Hart, a Democratic state lawmaker from 1974-1994 and Davis’ education secretary. “In some instances, it might be a step backwards.”\nBrown’s decision to hand over no-strings-attached dollars may be extreme, but Kirst said the “downside risk isn’t all that great” because whatever the state has been doing hasn’t been working. What history does tell them is that federal and state government have overreached, stifling creativity and innovation in schools.\nThe governor also said in an interview that he doesn’t want his funding formula to be judged on whether it closes the academic performance gap between African Americans and Latinos and other students groups.\n“The gap has been pretty persistent. So I don’t want to set up what hasn’t been done ever as the test of whether LCFF is a success or failure,” he said.\nTaken together, Brown and Kirst have done more than any recent administration to change what students learn and how teachers teach by embracing the new Common Core education standards, planning new science curriculum, increasing school budgets and pushing local decisionmaking.\nThis year, the state is once again considering a major policy change where the amount of discretion granted to local authorities is a topic of debate.\nThe State Board of Education is expected to adopt a new system for evaluating school performance in September in order to comply with recent changes in federal law. In trying to decide what measures to track statewide, the board has been getting an earful from education and children’s advocacy groups about the need to add social factors in order to hold schools accountable for positive learning environments.\nGone is the three-digit Academic Performance Index based solely on math and English test results crafted during the No Child Left Behind era. The board began the year looking at a dashboard of conventional measures such as English and math test scores, how fast English learners gain proficiency and graduation rates.\nAfter hearing from dozens of parents and students in March and May, the board voted to include so-called school climate measures, such as suspension and absenteeism rates. They also left room for surveys to study parent and student opinion.\nCivil rights advocates say school climate offers a more holistic view of whether students are managing emotions, setting high expectations for themselves and they can even help make parents feel welcome on campus. Most academic and education leaders embrace such noncognitive measures on a local level, but many are skeptical that social factors can be defined and tracked fairly across such a big state like California.\n“We might be able to measure your grit versus mine, but we’ll be unable to measure your growth very well,” Kirst said.\nParents like LaRae Cantley of Los Angeles, told the board this spring that her son, who has genetic disorder and is deaf in one ear, has “suffered tremendously” from a lack of school support. She asked for parent participation to be part of school ratings.\n“I’ve faced some challenges as a parent by not being welcome on the school ground,” Cantley said.\nWhat the final system will look like (one mockup uses a color spectrum of red to blue to indicate improvement) and whether schools will even be ranked remains fuzzy.\nThe U.S. Education Department is requiring states to identify the bottom 5 percent of schools every three years, but it’s not likely states will have to assign a value to each school.\nCalifornia did have a test-based index until two years ago. Many teachers disliked that ranking system for being a crude measure of schools. And even the California school leaders who created it have become disenchanted.\nSue Burr, a member of the state board, believes shaming and blaming public schools hasn’t worked. Burr, a former school administrator who has worked for both Brown and former Gov. Gray Davis, said there’s a “fallacy to ranking schools” because it doesn’t show you where schools are improving where they need to most.\nBurr said the state should abdicate its role in ranking schools and doesn’t care if an outside group decides to step in. Already, sites like GreatSchools.org take test results and gives schools a 1 to 10 score.\n“That’s fine with me,” Burr said. “I don’t care if someone comes in to be entrepreneurial.”\nOne interest group is particularly interested in blocking rankings. The California Teachers Association, one of the most powerful lobbies in Sacramento, says schools should be judged on their own progress.\nThe point of the new evaluation system is “not to compare and rank schools” but identify where schools might need extra help, said CTA President Eric Heins.\nHeins co-chaired a task force along with the Association of California School Administrators that made recommendations about the evaluation system to State Superintendent of Public Instruction Tom Torlakson in May. The task force did not recommend a ranking system for schools.\nThe 325,000-member union is used to getting its way in a blue state like California. CTA spent more than $2.2 million on the Democrat-dominated Legislature last year and poured millions more to get Brown re-elected, as well as help foot his 2012 tax initiative to support schools. It also supported Torlakson’s re-election in the most expensive statewide race of 2014 against a rival who supported stronger accountability for schools and teachers.\nAdvocates are divided on the issue of rankings. Some would be happy if the state simply required regular state assessment of public schools so a parent has an apples-to-apples comparison of schools in different neighborhoods. Dozens of civil rights and education groups are supporting a bill, AB 2548, in the Legislature along a parallel track.\n“We need to know how schools are performing for all of their students,” said Ryan Smith, executive director of the Oakland-based Education Trust-West, which is promoting Black Minds Matter and sponsoring AB 2548. “If it’s not an index, there’s going to have to be some way to categorize schools to know which schools are succeeding and which schools need support and intervention, or we’re going to have a very hard time identifying struggling schools.”\nMuch of the final accountability design rests with Kirst, who has spent his life studying the public education systems and stands in the rare position of having been in Brown’s inner circle for decades.\nThe West Reading, Pa.-born son of a house painter went to Dartmouth on a need-blind scholarship and went on to earn his master’s and doctorate degrees from Harvard. He got his start in Washington, D.C., doing education budget work under President Lyndon B. Johnson’s administration in the ‘60s. He later worked for a Pennsylvania senator and ended up at Stanford after his boss lost re-election.\nOnce at Stanford, Kirst worked as professor of education and business administration and specialized in the politics of education as well as education policy and finance. He co-founded the Policy Analysis for California Education, a university-based education research center. He has authored 10 books, including “The Political Dynamics of American Education,” a textbook for graduate education students. He also advised Brown when Brown was mayor of Oakland and he established two charter schools.\nDarling-Hammond, Kirst’s Stanford colleague, said Kirst’s approach on local control and extra funding for high-need students has been “groundbreaking.” She is optimistic the state will begin to see districts narrow the achievement gap when the next batch of test results come in.\n“Of course these things always have glitches when you start them, but it’s requiring local communities to be involved and really think about how they’re spending their money and whether they’re getting outcomes that they want,” Darling-Hammond said. “That’s really revolutionary and we have Mike to thank for that.”","url":"https://calmatters.org/articles/a-stanford-professor-disrupts-california-schools/"}
