{"authors":["Sportsmail Reporter"],"date_download":"2018-10-22 23:52:34","date_modify":"2018-10-22 23:52:34","date_publish":"2016-01-29 12:30:07","description":"Ahead of this weekend's FA Cup action, Sportsmail will be providing you with all you need to know about every fixture, with team news, provisional squads, betting odds and Opta stats.","filename":"data/vaneerConsumption/AstonVillavsManchesterCityTeamnewskickofftimeprobablelineupsoddsandstatsfortheFACupclash.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30AC40CF00000578-0-image-a-30_1454070575177.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422702_Aston-Villa-vs-Manchester-City-Team-news-kick-time-probable-line-ups-odds-stats-FA-Cup-clash_1540252354.html","title":"Aston Villa vs Manchester City: Team news, kick-off time, probable line-ups, odds and stats for the FA Cup clash","title_page":"Aston Villa vs Manchester City: Team news, kick-off time, probable line-ups, odds and stats for the FA Cup clash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ahead of this weekend's FA Cup action, Sportsmail will be providing you with all you need to know about every fixture, with team news, provisional squads, betting odds and Opta stats. Here is all the information you need for Aston Villa's clash with Manchester City.\nTeam news\nAston Villa\nGabriel Agbonlahor could return for Aston Villa against Manchester City after finally shrugging off a back injury.\nThe forward has played just one minute under boss Remi Garde, who was appointed in November, and had been linked with a move away from the club, although he is expected to stay.\nGarde remains without Alan Hutton and Carlos Sanchez (both hamstring) with Adama Traore out for at least another month with a broken foot while Jordan Amavi is out for the season with a knee injury. Charles N'Zogbia is fit but is not part of Garde's current plans.\nProvisional squad: Guzan, Bunn, Bacuna, Lescott, Richards, Clark, Okore, Richardson, Cissokho, Westwood, Gil, Lyden, Sinclair, Gana, Veretout, Grealish, Ayew, Agbonlahor, Gestede, Kozak.\nGabriel Agbonlahor could return for Aston Villa against Manchester City after finally shrugging off a back injury\nManchester City\nManchester City are without midfielder Kevin De Bruyne for the trip. The Belgium international suffered ankle and knee ligament damage in Wednesday's Capital One Cup semi-final win over Everton and is expected to be sidelined for eight to 10 weeks.\nCaptain Vincent Kompany (calf), centre-back Eliaquim Mangala (hamstring) and left-back Aleksandar Kolarov (calf) are still out but could be back in training next week, with striker Wilfried Bony (calf) returning in a fortnight. Playmaker Samir Nasri (thigh) is out long term. Willy Caballero will continue in goal.\nProvisional squad: Caballero, Hart, Sagna, Zabaleta, Demichelis, Otamendi, Clichy, Toure, Fernando, Fernandinho, Delph, Silva, Navas, Sterling, Aguero, Iheanacho, Barker, Humphreys, Angelino.\nKevin De Bruyne will miss out for Manchester City after being ruled out for 10 weeks through injury\nKey match stats (supplied by Opta)\nManchester City have progressed past Aston Villa in the last three meetings in the cup, including a 3-0 fifth round win en route to winning the trophy in 2011.\nASTON VILLA v MANCHESTER CITY Kick-off: Saturday, 3pm Odds (subject to change): Aston Villa 17/4 Draw 3/1 Manchester City 3/4 Referee: Michael Jones Managers: Remi Garde (Aston Villa), Manuel Pellegrini (Manchester City)\nAston Villa have won three of their last four FA Cup games against fellow Premier League sides, all en route to the final last season.\nThe Villans have scored in each of their last 12 home games in the FA Cup, scoring two or more on 10 occasions.\nThe last time the Citizens lost against a team from the same division in the FA Cup was in 2013 when they were defeated 1-0 in the final by Wigan Athletic.\nAston Villa have won more cup matches (3) than league games (2) so far in 2015-16.\nThe Villans have conceded just one goal in their last four competitive matches.\nMan City have won only two of their last nine competitive away matches (W2 D3 L4).","url":"https://www.dailymail.co.uk/sport/football/article-3422702/Aston-Villa-vs-Manchester-City-Team-news-kick-time-probable-line-ups-odds-stats-FA-Cup-clash.html"}
