{"authors":["Viknesh Vijayenthiran","Motor Authority"],"date_download":"2018-10-30 23:28:39","date_modify":"2018-10-30 23:28:39","date_publish":"2016-12-07 00:00:00","description":null,"filename":"data/vaneerConsumption/AstonMartinhypercarcarbonfiberandtitanium.json","image_url":"https://amp.businessinsider.com/images/58486125e02ba75d658b6ef3-1136-568.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_aston-martin-hypercar-carbon-fiber-and-titanium-2016-12_1540942119.html","title":"Aston Martin hypercar carbon fiber and titanium","title_page":"    Aston Martin hypercar carbon fiber and titanium - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"No steel! Motor Authority More details have emerged on the new hypercar being developed by Aston Martin in partnership with the Red Bull Racing Formula One team.\nThe latest details come from Aston Martin design boss Marek Reichman who spoke recently with Motoring.\nHe revealed that the new car, code-named the AM-RB 001 and due for delivery in late 2018, won't feature a single piece of steel in its construction, such is the focus on saving weight.\nHe said the car will be constructed almost entirely from carbon fiber and titanium. Its wheels will be carbon and magnesium and its engine will be aluminum.\nSpeaking of the engine, Reichman said it will be a naturally-aspirated V-12 with a displacement somewhere between 6.0 and 7.0 liters and ability to rev to 9,500 rpm. The engine will also feature a flat-plane crank ensuring the AM-RB 001 will be the \"most incredible sounding car out there.\"\nDrive will be to the rear wheels via a sequential transmission sourced from Xtrac. Reichman said Aston Martin picked this design because of its much lighter weight compared to a dual-clutch transmission.\nIn his interview with Motoring, Reichman also provided a few details on the oft-rumored hybrid component of the powertrain. He described the system as a capacitor-based KERS that can provide an 80-horsepower boost during high-load situations. The KERS also has the ability to start and power the car at low speeds.\nPeak power for the AM-RB 001 is expected to be 1,000 horsepower, with this figure roughly equal the weight of the car in kilograms. Top speed, Reichman said, will be upwards of 250 mph. We've also heard that the car will produce over 4,000 pounds of downforce and over 4 g of cornering force.\nOther tidbits revealed by Reichman include the possibility of traditional side mirrors being replaced by cameras, the concept unveiled in July being 95 percent representative of the final design, and powered gullwing doors being used to aid ingress and egress.","url":"https://www.businessinsider.com/aston-martin-hypercar-carbon-fiber-and-titanium-2016-12"}
