{"authors":["Ralph Ellis For Mailonline"],"date_download":"2018-10-23 01:17:56","date_modify":"2018-10-23 01:17:56","date_publish":"2016-01-11 11:59:23","description":"After a weekend of FA Cup football which provided little in the way of upsets but plenty of drama, RALPH ELLIS took a closer look at the numbers. Here, he shares what he has learned this weekend.","filename":"data/vaneerConsumption/AstonVillasScottSinclairhasgonedownhillandwhatshappenedtoFedericoMacheda10THINGSWELEARNED.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/300041A700000578-0-image-a-28_1452512939019.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_article-3393729_Aston-Villa-s-Scott-Sinclair-gone-backwards-Jonjo-Shelvey-hash-things-10-THINGS-LEARNED_1540257476.html","title":"Aston Villa's Scott Sinclair has gone downhill and what's happened to Federico Macheda? - 10 THINGS WE LEARNED","title_page":"Aston Villa's Scott Sinclair has gone downhill and what's happened to Federico Macheda? - 10 THINGS WE LEARNED | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"After a weekend of FA Cup football which provided little in the way of upsets but plenty of drama, RALPH ELLIS took a closer look at the numbers. Here, he shares what he has learned this weekend.\nJamie Vardy still travelled to Tottenham despite only having surgery on a groin injury two days earlier\n1. Jamie Vardy gave a clear signal of his commitment to Leicester’s cause even though the January window is now open by turning up at White Hart Lane to cheer on his team-mates.\nJust two days after surgery to treat a groin injury, the former non-League striker, whose 15 goals in half a season have not surprisingly made him a target for Champions League clubs, still travelled to London for Leicester's game against Tottenham.\nLeicester have made it clear they don’t want to sell, but it is still good news for Claudio Ranieri if his prize asset won’t be agitating for a move.\n2. Peter Crouch admitted he wants more regular football and he must surely be a target for one of the Premier League clubs who need to find some goals in the second half of the season. The beanpole former England striker will be 35 at the end of January but still knows where the goal is as he proved with the volley that set Stoke on their way to their 2-1 win at Doncaster.\nDespite signing a fresh two-year contract in the summer his total playing time in the last 12 months adds up to just over nine games – but he’s still scored seven goals in that time.\nPeter Crouch has barely played since signing a new deal at Stoke last summer but scored against Doncaster\n3. It’s hard to name a single Aston Villa player who has improved under Remi Garde’s management, but Scott Sinclair is definitely one who has gone backwards.\nTop scorer with six goals when the Frenchman took charge at the start of November, he was moved back to the wing after Tim Sherwood’s experiment using him in a more central role.\nAt Wycombe he was hardly involved, touching the ball just 22 times before getting subbed after 71 minutes – the fourth start in a row that he’s not finished the game.\nScott Sinclair has failed to impress since Remi Garde arrived as manager of Aston Villa in November last year\n4. Calum Chambers could give Arsenal a handy extra option as a midfield man after his switch to the midfield holding role against Sunderland proved a success.\nThe 20-year-old arrived from Southampton in a £16million move as a full back and also played in central defence last season, but has struggled to get in the side this term because of the form of Hector Bellerin.\nAgainst Sunderland he stepped smoothly into his new job, giving the ball away only three times in the 67 minutes he played of the 3-1 win before Arsene Wenger brought on Aaron Ramsey.\nCalum Chambers is the man to bolster Arsenal's midfield as he proved against Sunderland on Saturday\n5. Teenager Sheyi Ojo could be more suited to life back at Anfield now Liverpool have cut short his loan spell with Wolves.\nThe England Under 19 winger has struggled in the hurly burly of Championship football at Molineux but impressed Jurgen Klopp during a couple of trial games during the November international break.\nHe made a huge difference after coming on as a 71st minute sub at Exeter, setting up the Brad Smith goal that spared the Premier League club a shock exit.\nSheyi Ojo (left) found life difficult at Molineux and is hoping life at Anfield serves him better\n6. Maybe Jonjo Shelvey was trying too hard, but his efforts to fight for his place in Swansea’s team and in doing so protect a spot in Roy Hodgson’s England squad went from bad to worse at Oxford United.\nThe midfielder was making only his second start since November after falling out of favour with caretaker Alan Curtis.\nBut as well as blazing four long range shots well wide, he gave the ball away 27 times, won only three duels and for good measure picked up his fifth booking of the season.\nJonjo Shelvey (centre) was one of Swansea's senior players who underperformed in the 3-2 defeat by Oxford\n7. Reece Oxford was kept away from West Ham’s first team for a couple of months after becoming the club’s youngest ever player when he made his debut aged 16 years and 198 days in a Europa Cup tie at the start of the season.\nThey explained it was to help him deal with some growing issues, and used the same reason to stop him joining up with England’s Under 17s in October for the World Youth Cup.\nOxford signed his first pro contract on his 17th birthday in December, and it looks as if he’s now ready to be involved again – his late cameo against Wolves was the second time he’s come off the bench in the Hammers last four games.\nReece Oxford is ready to fight his way back into the first team at West Ham after dealing with growth issues\n8. Federico Macheda was once rated as the brightest star coming through the Manchester United youth system but at 24 the Italian is reaching a crossroads in his career.\nFit again after missing two months of this season following surgery on a back injury he’s not wanted by current club Cardiff’s manager Russell Slade.\nBut given a rare start in the FA Cup against Shrewsbury he showed only flashes of his potential to convince anybody else to give him a chance and could find himself stuck in limbo for the remaining 18 months of his contract.\nFederico Macheda shows his frustration in Cardiff City's FA Cup tie against Shrewsbury which they lost 1-0\n9. West Ham pulled off something of a coup in the summer when they persuaded Norwegian youth international Martin Samuelsen, who had been with Manchester City and was also admired by Chelsea and Real Madrid, to join their Academy.\nThe 18-year-old is showing why he was so sought after since joining Peterborough on loan.\nHe followed up a dazzling solo goal on January 2 to win a game at Sheffield United with another wonderful individual effort as Posh beat Preston 2-0 to reach the FA Cup fourth round.\nWest Ham academy star Martin Samuelsen, 18, proving his credentials in Peterborough's 2-0 win over Preston\n10. Swindon’s comeback from two goals down to beat Southend 4-2 was all the more of an achievement for caretaker manager Luke Williams after losing five players the day before.","url":"https://www.dailymail.co.uk/sport/article-3393729/Aston-Villa-s-Scott-Sinclair-gone-backwards-Jonjo-Shelvey-hash-things-10-THINGS-LEARNED.html"}
