{"authors":["Sadie Whitelocks For Mailonline"],"date_download":"2018-10-23 02:39:08","date_modify":"2018-10-23 02:39:08","date_publish":"2017-04-26 13:46:16","description":"French astronaut Thomas Pesquet, 39, decided to show his love of aviation by documenting dozens of runways from an extreme vantage point 250 miles up on the International Space Station.","filename":"data/vaneerConsumption/Astronauttakesstunningphotosofairportsfromspace.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9F451600000578-0-image-a-120_1493205063299.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-4447332_Astronaut-takes-stunning-photos-airports-space_1540262348.html","title":"Astronaut takes stunning photos of airports from space","title_page":"Astronaut takes stunning photos of airports from space | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"From bustling commuter hubs in city centres to small landing strips on desert islands, this fascinating collection of images shows what airports around the globe look like from space.\nFrench astronaut Thomas Pesquet, 39, decided to show his love of aviation by documenting dozens of runways from an extreme vantage point, 250 miles up on the International Space Station.\nThe aerospace engineer and pilot's stunning gallery takes viewers around the world, jumping from England to France to Africa.\nHe even captured an odd location in the Australian outback where he suggests something mysterious is afoot. He commented: 'The Australian outback hides lots of beauty, and some surprises. I don't know what this is, but it looks strangely like an eyeball. It has its own runway and lots of regular shaped-buildings around. Secret military base?'\nThe European Space Agency spaceman also captured several French airports in tribute to his time as a commercial pilot for Air France, and snapped Heathrow Airport as a shout out to British astronaut Tim Peake.\nPesquet took off for his first mission into space on November 14, 2016, and in January he was the fourth French astronaut to perform a spacewalk as he installed new batteries on the flight craft.\nInto the dust: 'I think I found the most isolated airport in the world lost in the desert of an Arabian peninsula,' Mr Pesquet said after spotting this remote tarmac strip lining the arid landscape\nDrop in the ocean: Mr Pesquet spotted this landing strip on an island in the Indian Ocean off the coast of Madagascar. He said the small sandy runway didn't appear to be in use\nWest coast wonders: Dakar International Airport is the largest airport in Senegal and one of the fastest growing commuter hubs in Africa\nOn the water: Marseille airport, strategically located at the heart of Southern Europe, served 8.5million passengers last year\nCommuter hub: Heathrow Airport in London has two runways, with airlines serving a total of 194 destinations\nPar avion: Thomas Pesquet said this photo of Paris from the air was for all of his friends and colleagues at Air France. The images show the capital's two airports, Charles de Gaulle and Orly\nSpanish sojourn: Barcelona Airport, located seven miles southwest of the city centre, served more than 44million passengers last year\nOn the wish list: Mr Pesquet said he was meant to land at Beirut airport a while back but his trip to Lebanon was cancelled. He says he hopes to get there one day\nG'day, mate: Melbourne Airport, colloquially known as the Tullamarine airport, is the primary airport serving the city of Melbourne, and the second busiest airport in Australia. It was opened in 1970 to replace the nearby Essendon Airport\nMr Pesquet said of this image: 'The Australian outback hides lots of beauty, and some surprises. I don't know what this is, but it looks strangely like an eyeball. It has its own runway and lots of regular shaped-buildings around. Secret military base?'\nCountryside commute: Lyon–Saint Exupéry Airport, formerly known as Lyon Satolas Airport, is the international airport of Lyon, the third-biggest city in France\nFar from home: Mr Pesquet is based at Cologne Airport when he's back on earth as it's where the European Astronaut Centre is based\nOoh la la! Montpellier–Méditerranée Airport, in southern France, is the country's tenth largest airport welcoming more than one million passengers each year\nOcean views: Nice is France's third busiest airport after Charles de Gaulle and Orly, both of which are located in Paris\nMadrid Barajas Airport was opened in 1933 and in 1965 the airport adopted the title it is known by today, named after the small town nearby\nGoing Greek: Athens Eleftherios Venizelos Airport, built ahead of the 2004 Olympic Games, took 51 weeks to build at the cost of more than €2billion\nCairo International Airport was built during the mid-1940s and served American Allied Forces. It was used for civil aviation purposes shortly after the Second World War ended\nAloha! Honolulu Airport in Hawaii first opened in 1927 and was originally called the John Rodgers after a prominent local naval officer. By the 1950s it was one of America's top-three busiest airports","url":"https://www.dailymail.co.uk/travel/travel_news/article-4447332/Astronaut-takes-stunning-photos-airports-space.html"}
