{"authors":["Associated Press"],"date_download":"2018-10-23 01:56:55","date_modify":"2018-10-23 01:56:55","date_publish":"2016-01-11 13:21:15","description":"LONDON (AP) — Here he is, sitting in a tin can, far above the world — and saying goodbye to David Bowie. Messages of condolence for the late rock star flowed...","filename":"data/vaneerConsumption/AstronautPeakepaystributetoStarmanBowiefromspace.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:cf654675a2924e21ab06783e7ab654f6-56CX32zFKLb7123928b84cf0d23f-799_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393687_Astronaut-Peake-pays-tribute-Starman-Bowie-space_1540259815.html","title":"Astronaut Peake pays tribute to 'Starman' Bowie from space","title_page":"Astronaut Peake pays tribute to 'Starman' Bowie from space | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Astronaut Peake pays tribute to 'Starman' Bowie from space\nLONDON (AP) — Here he is, sitting in a tin can, far above the world — and saying goodbye to David Bowie.\nMessages of condolence for the late rock star flowed in Monday from around the world — and from space, where British astronaut Tim Peake tweeted from the International Space Station.\n\"Saddened to hear David Bowie has lost his battle with cancer - his music was an inspiration to many,\" Peake wrote Monday.\nFILE - In this Tuesday, Dec. 15, 2015 file photo, British astronaut Tim Peake, member of the main crew of the expedition to the International Space Station (ISS), prior the launch of Soyuz TMA-19M space ship at the Russian leased Baikonur cosmodrome, Kazakhstan. Messages of condolence for the late rock star David Bowie flowed in Monday Jan. 11, 2016, from around the world - and from space, where British astronaut Tim Peake tweeted from the International Space Station. (AP Photo/Dmitry Lovetsky, File)\nThe outer-space tribute seemed fitting. Unique and otherworldly, Bowie often seemed like a creature from another planet, the \"Starman\" of one of his 1970s hits.\nThe cosmos fascinated him from his first big hit, \"Space Oddity.\" Released in 1969, the year of the first moon landing, it told the story of Major Tom, an astronaut adrift, \"sitting in my tin can, far above the world.\"\nThe song caught the world's imagination again in 2013 when Canadian astronaut Chris Hadfield strummed it on his guitar while orbiting Earth aboard the space station. The video was viewed millions of times, and Bowie gave the rendition his seal of approval, calling it \"the most poignant version of the song ever created.\"\nHadfield tweeted Monday: \"Ashes to ashes, dust to stardust. Your brilliance inspired us all. Goodbye Starman.\"","url":"https://www.dailymail.co.uk/wires/ap/article-3393687/Astronaut-Peake-pays-tribute-Starman-Bowie-space.html"}
