{"authors":["Meenal Vamburkar","The Real Deal"],"date_download":"2018-10-30 23:53:54","date_modify":"2018-10-30 23:53:54","date_publish":"2018-07-15 00:00:00","description":"Over supply is crushing Manhattan's rental market, with median rents are down 2.9% over the past year.","filename":"data/vaneerConsumption/AsupplyglutiscrushingManhattansrentalmarket.json","image_url":"https://amp.businessinsider.com/images/5b48fe7067ce352e008b4829-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_a-supply-glut-is-crushing-manhattans-rental-market-2018-7_1540943634.html","title":"A supply glut is crushing Manhattan's rental market","title_page":"    A supply glut is crushing Manhattan's rental market - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Maridav/Shutterstock\nPrices keep sliding in the Manhattan rental market as concessions remain rampant.\nThe net effective median rental price of $3,314 in June was down 2.8 percent year-over-year, according to Douglas Elliman's latest market report. That's the sixth year-over-year decline in seven months. Median face rents also fell 2.9 percent over last year to $3,400.\n\"It's definitely been consistent over the past couple of months,\" said Hal Gavzie, executive manager of leasing at Elliman. \"It's all tied to just all the supply. There's just a lot of product out there.\"\nDuring the month, the share of new leases with concessions was 32.6 percent — up from 23.9 percent a year earlier. At the same time, the number of new leases fell 17.5 percent. In non-doorman buildings, the median face rent hasn't seen a year-over-year price increase in nine months.\nAs sales have been soft, the high-end of the rental market has seen more interest. Still, the luxury market hasn't been immune to incentives, given the level of inventory available. That's included renters seeking more flexible leasing terms. In June, the median rental price for luxury units was roughly in line with the level a year ago, inching up 0.6 percent. Landlords are also being more aggressive in trying to renew leases with existing tenants, Gavzie said.\nIn a separate report, Citi Habitats noted incentives continue to be \"a significant marketing tool\" for both new developments and existing properties.\n\"Sensing conditions were in their favor, some owners raised rents — while boosting the incentives offered,\" Gary Malin, president of Citi Habitats, said in a statement. \"However, it's a delicate balancing act — as apartment seekers remain highly price-sensitive.\"","url":"https://www.businessinsider.com/a-supply-glut-is-crushing-manhattans-rental-market-2018-7"}
