{"authors":[],"date_download":"2018-10-22 20:37:29","date_modify":"2018-10-22 20:37:29","date_publish":"2014-06-02 14:23:28","description":"Not content to launch another 2-in-1 hybrid, ASUS has announced the ASUS Transformer Book V.","filename":"data/vaneerConsumption/ASUSTransformerBookVIsFiveDevicesInOne.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/481721/asus_redo_4616053daa4fde3da980d380e7672680.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_gift-guide_asus-transformer-book-v-five-devices-one-n120241_1540240649.html","title":"ASUS Transformer Book V Is Five Devices In One","title_page":"ASUS Transformer Book V Is Five Devices In One","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nNot content to launch another 2-in-1 hybrid, ASUS has announced the ASUS Transformer Book V, a device which combines a 5-inch phone, a 12.5-inch tablet, and a keyboard dock into a system which can serve as an Android phone, an Android tablet, a Windows tablet, a Windows laptop or an Android laptop.\nWhere other dual-OS devices such as the ASUS Transformer Book Trio have fallen afoul of both Google and Microsoft, ASUS ingeniously gets around any licensing restrictions by putting all of the Android hardware and software on the phone and all of the Windows hardware and software on the tablet, which displays the phone’s Android environment as a remote desktop.\nOn the outside, the Transformer Book V looks like a a larger version of the Transformer Book T100 Windows tablet cross-bred with one of ASUS’s Padfone tablet-handset combos. There’s a 12.5-inch tablet that has a black bezel and a black or white soft touch back with a dock for a separate 5-inch phone that comes as part of the device.\nThe phone and tablet can operate independently.\nThe phone and tablet can operate independently, with the 5-inch handset running Android 4.4 topped by ASUS’s Zen UI and the slate booting into Windows 8.1. A full-size keyboard dock attaches to the tablet and provides two USB ports, along with an internal 1TB hard drive.\nMORE: Top 8 Windows 8.1 Tablet-Laptop Hybrids\nWhen you slide the phone into the docking port on the back of the tablet, ASUS’s PC Link software opens on the tablet’s Windows desktop, showing the phone’s UI in a window. Users are able to remotely control the phone from Windows, transferring files between the two environments, copying and pasting text or typing directly into apps using the keyboard. Hitting a button on the keyboard dock or tapping a toggle in the software switches PC Link to full-screen mode, effectively turning the device into an Android tablet / Android laptop.\nIn our brief demo, we were particularly impressed with how quickly and easily the device changed between full-screen Windows, Android in a window and full-screen Android. In Android mode, the icons and content adapted to the 12.5-inch, landscape tablet rather than the vertically-positioned phone in the dock. We can imagine using the Transformer Book V to type text messages on the phone using the keyboard dock or drag files back and forth.\nIn our brief demo, we were particularly impressed with how quickly and easily the device changed between full-screen Windows, Android in a window and full-screen Android.\nThe phone by itself is very similar to ASUS’s Zenfone 5 with its 5-inch, 720p display and Zen UI. However, on the inside, the handset is powered by Intel’s next-generation, quad-core Moorefield processor.\nThe 12.5-inch tablet has a rather low-res 1366 x 768 display, but offered solid viewing angles and bright colors during our demo. Inside it has an unnamed “next generation” Intel quad-core Atom processor, which could be Intel’s upcoming Cherry Trail platform.\nMORE: Best Tablets 2014\nASUS has not disclosed availability or pricing for the Transformer Book V, but a representative at the company’s event said that the device would likely cost less than the combined price of an ASUS Transformer Book T100 and a Zenfone 5. The T100 retails for $349 and an unlocked Zenfone 5s selsl for around $199, which suggests that the Transformer Book V will cost less than the equivalent of $500 U.S.\nASUS did not say whether the Transformer Book V would be coming to the U.S. The company recently managed to get the Padfone X released in America, so perhaps this system will be the second. We hope to learn more about the Transformer Book V as it gets closer to launch in the months ahead.\n-- Avram Piltch, LAPTOP","url":"https://www.nbcnews.com/tech/gift-guide/asus-transformer-book-v-five-devices-one-n120241"}
