{"authors":[],"date_download":"2018-10-22 20:34:07","date_modify":"2018-10-22 20:34:07","date_publish":"2014-05-02 13:54:40","description":"With \"Glass Night Out,\" Google is hoping Explorers themselves will spread the good word about the Gospel of Glass.","filename":"data/vaneerConsumption/ASwarmofGoogleGlassUsersWillDescendonYourCitySaturday.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_09/220281/140228-googleglass-9p_563cae517df71813548e507e3587a424.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_gadgets_swarm-google-glass-users-will-descend-your-city-saturday-n95586_1540240447.html","title":"A Swarm of Google Glass Users Will Descend on Your City Saturday","title_page":"A Swarm of Google Glass Users Will Descend on Your City Saturday","title_rss":"NULL","source_domain":"nbcnews.com","text":"The idea of a computer and recording device on one's head has made some non-Glass users uncomfortable, and it has pushed the conversation about etiquette and social norms in a connected world. Establishments including bars and movie theaters have kicked out Explorers (whom critics call \"Glassholes\").\nIn February, Google released an etiquette guide explaining how users can avoid being labeled a \"Glasshole\" when strutting around with the headware. The company followed up with a post in March about the \"top 10 myths\" about Glass, which include the idea that Glass is always recording.\nWith \"Glass Night Out,\" Google is clearly hoping Explorers will spread the good word about the Gospel of Glass.\nAs of Friday morning, the \"Explorer Events Calendar\" listed Night Out or meetup events for Saturday in eight cities: Boston; Los Angeles; Madison, Wisconsin; Milwaukee; New York; Orlando, Florida; Palo Alto, California; and Washington, D.C.\nBut Glass naysayers in small towns aren't safe either. Explorers in other cities and towns posted on a Glass community page on Google+ to organize other meetups on Saturday.","url":"https://www.nbcnews.com/tech/gadgets/swarm-google-glass-users-will-descend-your-city-saturday-n95586"}
