{"authors":["John Hayward"],"date_download":"2018-10-30 19:32:58","date_modify":"2018-10-30 19:32:58","date_publish":"2017-04-13 19:20:20","description":"Satellite photography reportedly shows that North Korea is preparing its Punggye-ri nuclear test site for another detonation.","filename":"data/vaneerConsumption/AsWorldAwaitsNuclearTestJapanSuggestsNorthKoreaMayHaveSarinGasMissiles.json","image_url":"https://media.breitbart.com/media/2017/04/wi/afp/12/1vfjfrd-e1492111213809.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_04_13__1540927978.html","title":"As World Awaits Nuclear Test, Japan Suggests North Korea May Have Sarin Gas Missiles","title_page":"As World Awaits Nuclear Test, Japan Suggests North Korea May Have Sarin Gas Missiles | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Satellite photography reportedly shows that North Korea is preparing its Punggye-ri nuclear test site for another detonation, probably timed to coincide with celebrations of national founder Kim Il-sung’s 105th birthday this weekend.\nReuters reports that North Korean officials told foreign journalists in Pyongyang to prepare for a “big and important event” on Thursday. This proved to be a considerable letdown when the journalists were merely conducted to the opening of a new street in the middle of Pyongyang, but it is always possible the North Koreans are playing coy with journalists.\nThe report of activity at Punggye-ri comes from monitoring group 38 North, which said the site was “primed and ready” after detecting the movement of vehicles and personnel. The sort of activity they described seems consistent with preparation, rather than a frenzy of activity that would indicate an imminent detonation.\n38 North analyst Joseph Bermudez, who has a good track record of predicting Pyongyang’s nuclear tests, told CNN the activity noted over the past six weeks is “suggestive of the final preparations of a test.” In particular, 38 North analysts thought the end of excavation and water pumping at the site were indicators that it could be put to use soon.\nFox News cites South Korean officials saying they “saw no signs that North Korea was preparing any sort of provocative actions,” although they acknowledged that North Korea has demonstrated the ability to conduct missile tests with very little warning.\nJapan added another reason for concern, as Prime Minister Shinzo Abe told a session of his parliament, “There is a possibility that North Korea already has a capability to deliver missiles with sarin as warheads.”\nSarin is the nerve agent suspected of deployment in the chemical weapons attack in Syria last week. North Korean dictator Kim Jong-un’s half-brother Kim Jong-nam was allegedly killed with a different chemical weapon, VX, at the Kuala Lumpur airport in February.\nInterestingly, China’s Communist Party organ, the Global Times, published an editorial calling on North Korea to suspend its nuclear activities, coupled with a promise that China will “actively work to protect the security of a denuclearised North Korean nation and regime.”\nChina has previously promoted a deal in which North Korea would suspend nuclear tests if the United States agreed to halt military drills with South Korea, but there was little interest in the deal from either side. In fact, the United States Air Force launched a surprise exercise of air power in Japan on Thursday, which was seen as a demonstration to North Korea of what the Air Force’s largest combat-ready wing can do on short notice.\nChina is still advocating for a non-violent resolution to the North Korean nuclear situation. The Trump administration is talking about using unprecedented sanctions to halt Pyongyang’s nuclear and missile programs, potentially instituting what one official described to Reuters as “essentially a trade quarantine on North Korea.”\nThe measures under consideration could include “an oil embargo, banning its airline, intercepting cargo ships and punishing Chinese banks doing business with Pyongyang,” according to the officials who spoke to Reuters. Other possibilities include interdicting North Korean freighters, prohibiting the use of North Korean contract labor abroad, implementing a global ban on coal, or banning North Korea’s seafood exports.\nSome of these steps would not require U.N. approval, which means China would not be able to veto them. China has been remarkably tough in enforcing its own punitive ban on North Korean coal exports, but Trump administration officials worried Beijing might have gone as far as it’s willing to go. It is considered something of a gamble to menace Chinese interests with the secondary effects of tough sanction against North Korea and hope it inspires them to bring Pyongyang to heel, instead of alienating the Chinese.\n“China has always opposed the use of unilateral sanctions in international relations and is firmly opposed when such unilateral sanctions harm China’s interests,” Foreign Ministry spokesman Lu Kang said at a press briefing.","url":"https://www.breitbart.com/national-security/2017/04/13/north-korea-prepares-nuclear-site-tells-reporters-to-get-ready-for-big-and-important-event/"}
