{"authors":[],"date_download":"2018-10-22 20:30:59","date_modify":"2018-10-22 20:30:59","date_publish":"2014-05-02 03:27:51","description":"Leo Sharp survived the World War II Battle of Mount Battaglia and became a world-renowned daylily breeder. He also ran drugs for the Sinaloa cartel.","filename":"data/vaneerConsumption/At89aWarHeroaFamousFloristandaMexicanDrugRunner.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_18/415226/140501-leo-earl-sharp-2257_d58070139f85d8b039322aa46d623d48.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_89-war-hero-famous-florist-mexican-drug-runner-n95356_1540240259.html","title":"At 89, a War Hero, a Famous Florist - and a Mexican Drug Runner","title_page":"At 89, a War Hero, a Famous Florist — and a Mexican Drug Runner","title_rss":"NULL","source_domain":"nbcnews.com","text":"But now he's pushing 90. His birthday is Wednesday — the day his sentence will be formally entered — and his lawyers say he suffers from \"dementia and a variety of other health conditions\" that require 24-hour monitoring and make prison impractical.\nIn a vividly written sentencing memorandum, Darryl Goldberg, Sharp's lead attorney, characterizes Sharp as \"a colorful, self-made, charitable man who has worked hard throughout this entire admirable, extraordinary, and long life.\" Running drugs for Mexican dealers was merely \"a monumental mistake at a moment of perceived financial weakness, \" Goldberg asserted.\n\"Colorful\" certainly describes Leo Earl Sharp — a great-grandfather, legitimate World War II hero and world-renowned horticulturist known for hybridizing popular new breeds of flowers.\nSharp received numerous decorations for valor for his service with the Army's 88th Infantry during its nearly year-long march through Italy to Austria in 1944 and 1945, military records show. More than 15,000 members of the 88th were killed or wounded in the 344 days the unit made its way through the Dolomite Mountains — a mission that included the famously bloody Battle for Mount Battaglia.\nSharp has also received numerous awards — including at least one lifetime achievement honor — from horticulture societies. He's particularly known for his creation of new daylilies, according to the American Hemerocallis Society. (Daylilies are members of the Hemerocallis genus.)\nSharp's life has been one of \"generosity and ... tremendous positive contributions to the community,\" Goldberg wrote. \"His life has truly been one of service, not just to his country, but his community in general.\"\nExcept, of course, for that drug-running bit.","url":"https://www.nbcnews.com/news/us-news/89-war-hero-famous-florist-mexican-drug-runner-n95356"}
