{"authors":[],"date_download":"2018-10-30 00:58:48","date_modify":"2018-10-30 00:58:48","date_publish":"2015-10-08 08:00:00","description":null,"filename":"data/vaneerConsumption/ATaleofTwoGPSs.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/10/Screen20Shot202015-10-0720at207.22.1220PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861128.html","title":"A Tale of Two GPS’s","title_page":"A Tale of Two GPS’sThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"There was a time once when our country split along an east-west line, between north and south, and the upshot was a devastating civil war.\nToday we’re divided by something that transcends regional boundaries. We no longer agree on what north and south mean.\nWhen I heard of the recent atrocity in Roseburg, Oregon, the main thing that struck me was that, if reports were right, it was an example of a genuine hate crime against religious believers, something pretty rare in America, no matter what they tell you.\nBut over on the other side of the political street, from what I’ve observed, the main lesson that strikes our liberal neighbors is the evil of Second Amendment supporters.\n“We could easily prevent this kind of tragedy through passing a couple of simple, common-sense laws,” they say. “Anyone who would oppose these laws must have no human compassion. They must love death and cruelty.”\nIt’s as if we live in two alternate universes, where the geographic coordinates have nothing in common with each other.\nThe liberals’ moral GPS tells them that their present location is right outside the gates of Eden. They’re still wearing their fig leaf aprons (they believe) and just a couple steps back in the right direction will return them to Paradise. How could anyone be against that?\nIn their view, the problem is simple, like a crossword puzzle. Fill in all the spaces correctly, and Paradise is regained. The fact that the goal is never achieved in practice, that more and more spaces keep appearing, needing new laws written to fill them, does not trouble them. Next time it will be different. We’re almost there. We can see Eden from our front porches.\nThe conservative’s GPS gives very different coordinates. We find ourselves 5,000 miles from Eden, lost in a wilderness. We’re dressed in animal skins, the very ones the Lord Himself gave us to wear after the Fall. We still hear the cries of the beasts who died to provide them. We hear them in our dreams, and pity them. Our problem, as we see it, is not a simple puzzle, but a convoluted saga, a panoramic tragedy larger and more complex than A Game of Thrones. There’s no solution to the essential conundrum, not until our “change comes,” to quote the Bible again. Until then we fight, we cope, and we salvage what we can. Our hope is in ongoing battle, in heroism, not in neat puzzle solutions.\nAnd that is why the left hates heroism, and does all it can to suppress it, especially in boys and young men. Chris Mintz, the hero of Roseburg, represents the ancient, evergreen promise that brightens the ancient legends. “If he’d had a weapon,” we say, “he could have saved most, or all, of those lives. And just as important, he could have taught a lesson to the cowardly murderer and others like him.”\nTo the left, that promise is worse than the problem. To the left, Chris Mintz stepped out of line. He should have died cowering, with the other sheep.\nI know a little about sheep. My brothers and I raised them for a while, when we were young, like Abel, son of Adam, the first murder victim.\nIt’s true that sheep are generally docile. They’re easily frightened, and easily killed when cornered.\nBut there’s one kind of sheep that isn’t docile. That’s the mature male sheep — the ram. Rams are tough. Rams are protective. Rams have horns and are dangerous.\nWe raised our sheep for meat and wool. We did not want rams. And we had a way to solve the problem of rams.\nWe castrated them.","url":"https://spectator.org/64290_tale-two-gpss/"}
