{"authors":[],"date_download":"2018-10-22 20:54:52","date_modify":"2018-10-22 20:54:52","date_publish":"2014-06-02 17:42:39","description":"\"Seeing one's culture on beautiful stages is critical, it makes you feel like you belong,\" says the Hispanic theater's artistic director.","filename":"data/vaneerConsumption/AtCaraMiaTheaterInDallasLatinoArtsTakeCenterStage.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/481841/140602-magic-rainforest-03_2af31263de5104b8ca16dfb1b8a63704.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_cara-mia-theater-dallas-latino-arts-take-center-stage-n120431_1540241692.html","title":"At Cara Mia Theater In Dallas, Latino Arts Take Center Stage","title_page":"At Cara Mia Theater In Dallas, Latino Arts Take Center Stage","title_rss":"NULL","source_domain":"nbcnews.com","text":"A big component of Cara Mia's mission is showcasing the work of Latino writers. The \"Magic Rainforest” was written by award-winning playright José Cruz Gonzalez; the theater has also produced works by Sandra Cisneros and Jimmy Santiago Baca.\nLast year, the artists from the theater, overseen by Lozano, wrote an original production called “The Dreamers: A Bloodline.” Using interviews from real immigrants, “The Dreamers” portrayed the experience of three women as they travel from El Salvador to the United States in the hopes of finding a better life for their children.\nWorks like these, says Lozano, are the reason Cara Mia is proud of the role it has played in the artistic landscape of Dallas. In 2009 the theater was on the brink of shutting down for financial reasons that were exacerbated by the recession. New members joined the Board of Directors, and along with a dedicated team of about thirty volunteers, the Cara Mia was saved from closing down.\nThat same year a play based on actual events, \"Crystal City 1969,” made its debut. Co-written by Lozano and Raul Trevino, the play chronicled the group of rural Texan Latino students who staged a walkout after their school board refused their demands for equal rights. The show was completely sold out and The Dallas Morning News wrote it was one of the best original works of the year.\nOne of Cara Mia's biggest missions is youth education. An exciting development for the theater company came recently when it was one of 19 organizations worldwide to receive a grant from the prestigious Hermes Foundation in Paris. That grant can go a long way in aiding the theater's youth programs, which currently reach about 15,000 students a year in 350 venues. In Dallas that’s noteworthy considering that nearly 70 percent of public school students are Hispanic.\nThese opportunities to educate are “just as important to us as our professional productions,” says Lozano. Growing up without an arts program that represented Latinos was challenging, he recalls. “It’s important for young to people see themselves reflected in the arts.”\nWith more financial backing, Cara Mia hopes to provide a dedicated infrastructure for the children instead of the small ensemble that travels to each school. According to Lozano, schools have responded positively to Cara Mia since they began the programs five years ago, and he hopes it remains this way .\n\"These young people need to see their stories reflected on stage, at their schools and in their communities.\" says the theater's current artistic director.\n“These young people need to see their stories reflected on stage, at their schools and in their communities,\" he said.\nFor now, Cara Mia’s objective is to continue pushing the envelope theatrically and artistically and stay connected to the cultural needs of the Dallas Latino community.\n“The Magic Rain Forest” runs through June 8 at the Latino Cultural Center in Dallas.The Cara Mia hopes to bring in a robust audience of theater lovers - and not just those with Hispanic backgrounds.\n“Anybody can watch and see the magic of theater happen,” says co-director and choreographer Jeffrey Colangelo.","url":"https://www.nbcnews.com/news/latino/cara-mia-theater-dallas-latino-arts-take-center-stage-n120431"}
