{"authors":[],"date_download":"2018-10-22 21:35:36","date_modify":"2018-10-22 21:35:36","date_publish":"2014-06-05 12:21:04","description":"El Rescate, which means \"rescue\" in Spanish, gives homeless, LGBTQ youth a safe place to live as well and teaches them life skills for the road ahead.","filename":"data/vaneerConsumption/AtChicagosElRescateHomelessLGBTQYouthFindTrueHome.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/489036/140605-el-rescate-mn-806_9dfda7a697bd89df3c1378c2b63e6076.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_chicagos-el-rescate-homeless-lgbtq-youth-find-true-home-n123296_1540244136.html","title":"At Chicago's El Rescate, Homeless, LGBTQ Youth Find True \"Home\"","title_page":"At Chicago's El Rescate, Homeless, LGBTQ Youth Find True \"Home\" ","title_rss":"NULL","source_domain":"nbcnews.com","text":"“Any group that faces double discrimination and double stigma find being on the streets even more challenging,” said Jerry Jones, executive director of National Coalition for the Homeless. Jones added he has heard horror stories of kids on the streets who are sent to mainstream shelters where they encounter violence because of their sexuality.\nSocial services are often not equipped to deal with this population, Jones said. In fact, according to Project Fierce Chicago, many facilities do not recognize transgender identity, and youth are required to identify with their biological sex to obtain housing. This makes it a challenge to seek shelter.\nIn addition, Latino and other immigrant youth face other obstacles; many shelter facilities are unable to handle language barriers and lack the cultural competency to serve a broad range of clients.\nMany of these obstacles take a severe toll. The Center for American Progress has found that among homeless youth, 73 percent of those who identify as gay and lesbian report thinking about suicide, compared to 53 percent of their heterosexual peers. Fifty seven percent of gay and lesbian homeless youth have attempted suicide compared to 33 percent of non-lesbian or gay homeless youth.\nThe Latino community often lacks safe spaces for LGBTQ youth because of religious beliefs, cultural attitudes, socioeconomic barriers, and lack of education, said one\nVictor Diaz-Herman, executive director of the South Florida-based Pridelines Youth Services, said the Latino community often lacks safe spaces because of religious beliefs, cultural attitudes, socioeconomic barriers, and lack of education. Diaz believes it is necessary to create a system of care that includes engaging families as well as providing physicians and mental health specialists who are equipped to treat this population.\n“All LGBTQ youth require safe spaces and affirming environment for healthy development and safe interaction,” said Diaz-Herman.\nEl Rescate provides the residents with the tough love and support they're lacking, said Gonzalez. Though the program is Latino-focused, they accept people of all races and backgrounds.\n“What keeps the youth here is that we actually treat them as family. I treat them like they're my kids,” Gonzalez explained.\nGonzalez gives the example of a transgender man from Tennessee who was living at the center and decided to move back home. Not even a week later, he returned to El Rescate because he realized they were his true family.\nThough the center is very welcoming, there are strict rules to ensure safety and stability. Youth who live at El Rescate have to meet curfew, do chores and are prohibited from sexual intercourse. They cannot have guests and cannot use drugs and alcohol. A resident advisor stays overnight to make sure everything runs smoothly.\n\"It's a place where you can learn how to be independent and productive and not be another statistic,” said one El Rescate resident.\nBeyond providing shelter and support, the program uses living skills facilitators– they are called grandma and auntie– to teach young people cooking, cleaning and proper hygiene. El Rescate also offers case management, job readiness workshops, health referrals and guidance on financial literacy. Because the focus is education and employment, all residents must be either work or attend school. If not, they must be actively pursuing either one.\n“I wish that when I had come out, I would have had the guidance El Rescate provides. Maybe I would have avoided sex work, drugs, and my time on the street,” said Maritxa Vidal, a transgender woman who is the director of the heath at Vida/SIDA, Rescate's sister organization.\nAs for Antonio Gray, he is very grateful for the opportunity to get on his feet. “It's very tailored to what you want to accomplish.” Gray is currently pursuing his GED and plans to go to college; his interests are cooking, writing and sociology.\n“It's a great place to build a foundation for where you want to go; it's a very loving atmosphere,\" said Gray, adding, \"it's a place where you can learn how to be independent and productive and not be another statistic.'","url":"https://www.nbcnews.com/news/latino/chicagos-el-rescate-homeless-lgbtq-youth-find-true-home-n123296"}
