{"authors":["Mailonline Reporter"],"date_download":"2018-10-23 01:04:54","date_modify":"2018-10-23 01:04:54","date_publish":"2017-03-16 10:45:43","description":"Humour is the personality trait most British people want to be remembered for when they die, according to a nationwide survey of 845 adults by terminal illness charity Marie Curie.","filename":"data/vaneerConsumption/AthirdofBritswanttoberememberedfortheirhumour.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E4E5D9A00000578-0-image-a-4_1489657970798.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-4316980_A-Brits-want-remembered-humour_1540256694.html","title":"A third of Brits want to be remembered for their humour","title_page":"A third of Brits want to be remembered for their humour | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They say laughter is the best medicine.\nSo it's perhaps fitting that humour is the personality trait most British people want to be remembered for when they die.\nLevity and amusement top the list of characteristics most-desired to define us in death, new research shows.\nGood times: Humour is the personality trait most British people want to be remembered for when they die, research by Marie Curie found\nThe finding comes after terminal illness charity Marie Curie quizzed 845 adults as part of their annual Great Daffodil Appeal.\nThirty six per cent prioritized humour over every other trait, while two fifths said they want to be known for how caring they were.\nFittingly, some 41 per cent said their most enduring memories of loved ones included their jokes, smiles and laughs, the survey found.\nHappy memories were also considered crucial to helping people overcome the sadness of losing a loved one, the charity added.\nEighty two per cent of people also said positive memories helped them deal with their loss.\nBut, 35 per cent said their happy memories of loved ones were tainted by the poor end of life care they received.\nHealing: Happy memories were also considered crucial to helping people overcome the sadness of losing a loved one, the charity added\nAbout 20 per cent said better end of life care would have helped them to preserve memories of loved ones.\nAnn Scanlon, of the charity, said: 'Each family deals with the loss of a loved one in a different way, and how we go about coping with a loss can vary depending on the individual.\n'It is sad to see so many people feeling that their lasting memories have been tainted by the poor care that their loved ones had received at an important and precious time.\n'When you lose someone close to you, it can be an overwhelming and potentially traumatic experience, but with the right care and support in place it can also be as peaceful and calm as possible.'","url":"https://www.dailymail.co.uk/health/article-4316980/A-Brits-want-remembered-humour.html"}
