{"authors":[],"date_download":"2018-10-30 01:05:46","date_modify":"2018-10-30 01:05:46","date_publish":"2015-03-31 08:00:00","description":null,"filename":"data/vaneerConsumption/AThirdWayPastStudentLoans.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/03/1024px-Apprenticeship.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861546.html","title":"A Third Way Past Student Loans","title_page":"A Third Way Past Student LoansThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"RALEIGH, N.C. — As lawmakers debate various proposals to ostensibly solve the $1 trillion student-loan crises in America—lower student-loan interest rates or forgive loans altogether being two—clear-thinking individuals should catch a vision for alternatives.\nIn two decades, imagine a post-secondary education arena in which a majority of students avoid the need for student loans in the first place. Or, if loans are necessary, have a job upon graduation sufficient to pay them off. Novel concepts? Perhaps. But they shouldn’t be.\nWe are witnessing the result of excessive student loan consumption by the predicament of the Millennial generation—roughly those born between 1980 and 2000. Despite an improving economy, many of these young people remain at home, lacking true financial independence, delaying marriage, and putting off having children. One of the biggest culprits, if not the biggest, is student loan debt.\nToo often, the solutions preferred focus on either further subsidizing an increasingly low return-on-investment college education or winking at students’ loan obligations. There is a better way—putting more emphasis on directing young people away from traditional four-year schools (and what might end up being an expensive and low-ROI degree) and toward more vocational-oriented training.\nFrom a practical standpoint, education should have as a central goal the acquisition of skills and knowledge demanded by the marketplace. This goal is accomplished for many young people through a traditional four-year route, but for many others, such as those from low-income families, that option is not always feasible. Alternatives are needed.\nThinkers have caught on to this, but solutions are too-oft ignored by many advisors. “Americans have a host of postsecondary options other than a four-year degree—associate degrees, occupational certificates, industry certifications, apprenticeships,” writes Tamara Jacobs in the Wall Street Journal. “Many economists are bullish about the prospects of what they call ‘middle-skilled’ workers. In coming years, according to some, at least a third and perhaps closer to half of all U.S. jobs will require more than high school but less than four years of college—and most will involve some sort of technical or practical training.”\nIt seems counter-intuitive, but the combination of an associates degree and practical experience in an in-demand field could actually result in more financial stability and well-being for a young person than a four-year liberal arts degree. In fact, increasingly, it’s becoming the norm.\nOne of the best ways to achieve this is through apprenticeships. A fine example exists in North Carolina right now. The NC Triangle Apprenticeship Program (NCTAP), operating in the Raleigh area of North Carolina, is a hands-on, intensive technical experience that actually prepares high-school students for existing jobs and a successful career. NCTAP was born out of a desire for students with an engineering bent at Thales Academy (a local network of private schools covered in this magazine here) to have an apprenticeship opportunity.\nProspective participants apply for NCTAP early in their high-school career. The program begins during their sophomore year and continues for four full years—through the completion of an associates degree in mechanical engineering technology at a local community college. The program has the added benefit of encouraging young people to get serious about a career trajectory early on, rather than as a thirty-something still living in mom’s basement.\nWhile enrolled in school, students participate in an apprenticeship at a number of high-caliber local businesses, including the pharmaceutical giant GlaxoSmithKline and the kitchen ventilation company CaptiveAire. The one-two punch of a two-year degree mixed with invaluable on-the-job experience can’t be underscored enough. In a job market saturated with bachelor degree recipients, one of the most defining characteristics to set apart applicants is actual experience—and far better, actual experience in a given field of specialization. NCTAP provides it.\n“By the time students have finished their apprenticeship and associates degree, they already have three to four years of work seniority—and no debt,” says NCTAP chairman Lukas Schoenwetter. “They can make a very good living and climb the career ladder fast.”\nAnother kicker: The associates degree is entirely paid for by the employer. So completers of the program have zero debt. Imagine the life of success created by this pathway: a practical, technical degree mixed with practical, technical training—with no debt upon graduation. That is a rosy picture for a 20-year-old just beginning a career. Even if NCTAP apprentices choose to return to obtain a four-year degree, they will be in a much better position to do so in a financially prudent way.\nWho shoulders the cost for the apprenticeship? The companies involved. But the end result—a skilled worker—is a worthwhile investment for any business.\n“The real cost to our partner companies is the pay and benefits for apprentices over the four-year duration of the program, plus approximately $5,000 for the associates degree in mechanical engineering,” says Kent Misegades, vice chairman of NCTAP and an engineer by trade. That estimated cost is $140,000 total for each participant. But as Misegades notes, “These are productive employees and worth every penny.”\nThe big news is that, in each case, a job waits a young people upon graduation from the program. “Virtually 100 percent of those who make it through the program will be hired by their employer,” Misegades notes.\nNCTAP is a model that specifically targets high-achieving students, but the same approach could be taken with strugglers or those from low-income backgrounds.\nU.S. Department of Labor Secretary Thomas Perez recently visited NCTAP and called it a model for the nation to follow.\n“Apprenticeships give participants a very structured learning and training environment and also provides employers the opportunity to grow talent locally,” says Schoenwetter. “Good apprentices will pay back the investment of an employer at the end of three to four years.”\nThis model is a win-win for both students and corporations. It deserves more attention, primarily because such approaches threaten the established university network that benefits from bloated costs and readily available student loan commitments at exorbitant amounts, factors that stall the career growth of young people.\nThis approach doesn’t help current youth mired in student-loan obligations. But it is a vision for the future that we should be encouraging now. As many observers begin to predict a coming collapse of the so-called “higher education bubble,” apprenticeship examples such as NCTAP will get more attention. And deservedly so.","url":"https://spectator.org/62224_third-way-past-student-loans/"}
