{"authors":["Press Association"],"date_download":"2018-10-22 21:03:37","date_modify":"2018-10-22 21:03:37","date_publish":"2016-01-11 00:07:48","description":"David Moorcroft believes confidence in athletics is at an all-time low thanks to the corruption scandal that has hit Russia and the sport's world governing b...","filename":"data/vaneerConsumption/Athleticsletdownbytheiaafoverdopingscandalsaysdavidmoorcroft.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-606e0eb4-f361-45ed-b0d7-9e1dc864925f-56CX32zFKLb7123928b84c7a8be6-164_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3392658_Athletics-let-IAAF-doping-scandal-says-David-Moorcroft_1540242217.html","title":"Athletics \"let down\" by the iaaf over doping scandal, says david moorcroft","title_page":"Athletics \"let down\" by the iaaf over doping scandal, says david moorcroft | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Athletics \"let down\" by the IAAF over doping scandal, says David Moorcroft\nDavid Moorcroft believes confidence in athletics is at an all-time low thanks to the corruption scandal that has hit Russia and the sport's world governing body the IAAF.\nThree leading figures within the sport were handed lifetime bans on Thursday for blackmail and covering up positive drugs tests.\nPapa Massata Diack, the son of the former IAAF president Lamine Diack and a marketing consultant for the organisation, former Russian athletics federation (ARAF) president and IAAF treasurer Valentin Balakhnichev, and Alexei Melnikov, a senior ARAF coach, were all banned, plunging the sport into further chaos.\nDavid Moorcroft is concerned by the recent revelations about drug cheats in athletics\nThe second part of an independent report, commissioned by the World Anti-Doping Agency (WADA) and written by former WADA president Dick Pound, will be published on Thursday.\nAnd Moorcroft, a former chief executive of UK Athletics, admits there is little faith left in the sport's international governing body.\n\"The sport feels really let down by the IAAF at the moment,\" Moorcroft told BBC Radio 5 Live's Sportsweek programme.\n\"We have got great hope that (president) Seb Coe can pull things round but you expect real strong leadership and integrity at the very highest level from the governing body and one of the people involved has been banned for life - Papa Diack, the son of Lamine Diack, who is under investigation by the French police.\n\"We have no idea how that will go, but if there has been collusion and money taken for overlooking doping in Russia at the highest levels, that is almost the worst thing you could ever do.\n\"Most people feel incredibly let down by the IAAF and its leadership and that is the biggest challenge the sport faces - to renew the integrity and our belief in the international governing body.\"\nUKA will publish its own blueprint for cleaning up the sport on Monday. Moorcroft hopes the organisation will call for global, unannounced, round-the-clock testing, as happens in the UK.\n\"I have no idea what they might suggest but I am glad they are taking the initiative,\" said the former 5,000 metres runner.\n\"I hope that they continue to push for longer bans, more investment in testing, better testing around the world and more consistent testing.","url":"https://www.dailymail.co.uk/wires/pa/article-3392658/Athletics-let-IAAF-doping-scandal-says-David-Moorcroft.html"}
