{"authors":[],"date_download":"2018-10-30 01:05:36","date_modify":"2018-10-30 01:05:36","date_publish":"2015-07-27 08:00:00","description":null,"filename":"data/vaneerConsumption/ATimidTakeonEconomicInequality.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/07/Screen20Shot202015-07-2620at209.24.5920PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861536.html","title":"A Timid Take on Economic Inequality","title_page":"A Timid Take on Economic InequalityThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Like it or not, economic inequality will be a habitual theme during the 2016 presidential campaign. Democrats are continuing to harp on the topic, with Democratic frontrunner Hillary Clinton making its (hypothetical) elimination the cornerstone of her economic platform. Since the unfortunate arrival of John Edwards on the national scene, the idea of two America—the haves and the have-nots—has been firmly engrained in our national discourse.\nThat’s why I wasn’t surprised to see renowned political scientist, Harvard professor, and cultural observer Robert Putnam chime in on the topic. He does so in his latest work, Our Kids: The American Dream in Crisis.\nPutnam is widely recognized for his seminal book published in 2000 entitled Bowling Alone. That book explored the growing demise of civic life in America and attributed it to several major causes (two-income families, long commutes, suburban sprawl, and the rise of television, to name a few). Putnam has contributed other important research as well, including American Grace: How Religion Divides and Unites Us, which explores the unfortunate decline of religious allegiance and participation in American life.\nIn Our Kids, Putnam leaps into the fray over economic inequality, and he does so from a decidedly left-of-center perspective (if his Harvard affiliation wasn’t suggestive enough). The book contains much handwringing over the growing gap between wealthy, stable families and poor, tumultuous ones.\nTo his credit, however, Putnam focuses more on a lack of economic mobility rather than equality. A key difference exists between the two. The Left’s obsession with economic inequality desires an outcome that is impossible in this world—equality of outcome. Economic mobility, in contrast, seeks to create a level playing field, expanding opportunities and tearing down barriers to success.\nThere is no doubt that Putnam’s exploration of class divides is fascinating and timely. Arguing that economic class poses a great dividing line for youth than does race in today’s world, Putnam notes that neighborhoods, schools, and social circles were less segregated economically in the 1950s than they are today.\nIn contemporary American life, the wealthy tend to cluster in certain zip codes, schools, and venues, while the poor have distinctly separate lives. This class division existed in the past in America, of course, but the fact remains that youth from all walks of life were more likely to rub elbows than they are today.\nThat topic brings Putnam to a discussion on the family differences between the rich and poor. Putnam defines this new upper class as “neo-traditionalists,” a close parallel to the traditional-values oriented families of the 1950s, with a few notable exceptions: both spouses work outside the home, childbearing is delayed until careers are underway, and domestic duties are more evenly split.\nThese upper-class marriages “have become nearly as durable as the 1950s model,” Putnam writes. These are individuals with stable marriages, families, and careers who live in solid communities, enjoy access to high-caliber schools, and still tend toward religious involvement.\nThe lower class, on the other hand, Putnam labels “fragile families.” It is defined by out-of-wedlock childbirth, less durable sexual relationships, poor school quality, and community discord.\nAs to causes, Putnam attributes this growing divide to the decline of working-class labor (felt most acutely beginning in the 1970s) and the sharp rise in divorce, out-of-wedlock birth, and general family instability around the same time.\nIn general, these are accurate assessments. The economic shift from a manufacturing economy to a knowledge economy has had major impacts. And there is no doubt that family disintegration has wrought havoc on the economic plight of the less well off.\nUnfortunately, while Putnam does a fair job diagnosing the problem, his solutions are lackluster and fall decidedly into the leftist camp. To solve the family crisis, he points to increased use of contraception (government funded) as the solution. To help the education divide, he suggests universal pre-school. He also recommends a nebulous return to a sense that all kids are “our kids,” collectively as Americans.\nPutnam can’t bring himself to advocate for the values-oriented solutions that would really work because these are politically incorrect (and, admittedly, difficult) solutions: Better training for marriage and family life, celebration of traditional sexual morals, more emphasis on thrift and hard work, expanded school choice, etc.\nThese are the values that neo-traditional, higher-income families follow. The poor tend not to, but Putnam says that the poor never will (nor, he suggests, should we encourage them to). It amounts to hangwringing but unwillingness, for political correctness’ sake, to acknowledge the real solutions.\nIn addition, I was struck by the fact that Putnam’s book had largely already been written two years before by American Enterprise Institute scholar Charles Murray. His 2012 book Coming Apart chronicled the growing income, education, and home-life gap in America. And, not to put too fine a point on it, Murray tells this story better.\nBe sure to pick up a copy of Coming Apart and only use Our Kids as supplementary reading. Heading into what’s sure to be another campaign season littered with ill-informed rhetoric on economic inequality, arming yourself with the powerhouse of data and reasoning in Coming Apart is crucial.","url":"https://spectator.org/63577_timid-take-economic-inequality/"}
