{"authors":[],"date_download":"2018-10-30 20:59:02","date_modify":"2018-10-30 20:59:02","date_publish":"2015-06-22 21:54:42","description":"1956: The Confederate battle emblem is added to the state flag in 1956, two years after the Brown v.","filename":"data/vaneerConsumption/AtimelineofeventssurroundingtheConfederatesymbolin.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/06/23/Images/photos.medleyphoto.7484742.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_a57c381bdcb946b4bc9d1c1911358899__1540933142.html","title":"A timeline of events surrounding the Confederate symbol in...","title_page":"A timeline of events surrounding the Confederate symbol in...","title_rss":"NULL","source_domain":"ajc.com","text":"1956: The Confederate battle emblem is added to the state flag in 1956, two years after the Brown v. Board of Education decision making segregation unconstitutional.\n1993: Gov. Zell Miller calls on state lawmakers to remove the emblem from the state flag, but the effort fails.\n1996: The Confederate flag causes controversy when it flies over the Olympic Games in Atlanta.\n2001: Gov. Roy Barnes succeeds in changing the Georgia flag. The compromise design features a smaller depiction of the Confederate symbol, along with other versions of the state’s flag. The move is believed to have contributed to Barnes’ re-election loss in 2002, when he was defeated by Republican Sonny Perdue. Perdue pledged to give Georgians a vote on the issue. He never did.\n2003: The current state flag is adopted. It completely removes the iconic Red and Black Confederate symbol but does evoke a pre-1956 version of the state’s flag.\n2014: Georgia approves a specialty license plate design submitted by the Georgia chapter of the Sons of Confederate Veterans that features the Confederate symbol. More than 3,500 of the plates have been sold, according to the state Department of Revenue.\n2014-15: The sole county commissioner in Chattooga County, in the North Georgia mountains, gives his permission for the Sons of Confederate Veterans to fly a series of eight Confederate flags at a memorial in Summerville located on government land a few yards in front of the county courthouse. The flags began their rotation in October, but it wasn’t until April, when the distinctive, square Confederate battle flag was hoisted, that complaints poured into county offices.\nOTHER SOUTHERN STATES:\nAlabama: Gov. Jim Folsom banned the Confederate symbol from the state Capitol Dome in 1993.\nMississippi: The emblem remains in the upper corner of the Mississippi flag. A petition has been circulated to remove it.","url":"https://www.ajc.com/news/state--regional-govt--politics/timeline-events-surrounding-the-confederate-symbol-georgia/FoOc56udZXpdXKe5gakNzL/"}
