{"authors":["Associated Press"],"date_download":"2018-10-22 20:10:57","date_modify":"2018-10-22 20:10:57","date_publish":"2016-01-28 00:29:47","description":"FOX LAKE, Ill. (AP) — Investigators announced a felony indictment Wednesday against the widow of a northern Illinois police officer who staged his suicide to...","filename":"data/vaneerConsumption/AtimelineofeventsindeathofIllinoispoliceofficer.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420185_A-timeline-events-death-Illinois-police-officer_1540239057.html","title":"A timeline of events in death of Illinois police officer","title_page":"A timeline of events in death of Illinois police officer | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A timeline of events in death of Illinois police officer\nFOX LAKE, Ill. (AP) — Investigators announced a felony indictment Wednesday against the widow of a northern Illinois police officer who staged his suicide to appear as if he had been shot in the line of duty.\nMelodie Gliniewicz is accused of helping her late husband, Fox Lake Police Lt. Charles Joseph Gliniewicz, siphon money from a youth program. Authorities believe he killed himself because he feared discovery of the embezzlement.\nHere is a timeline of events in the case:\n— Tuesday, Sept. 1:\n7:52 a.m. — Joseph Gliniewicz, who is on his way to work, radios to say he has spotted suspicious individuals and is checking them out.\n7:55 a.m. — He radios again to say the three men — two white and one black — ran into a swampy area and he is pursuing. He asks for backup.\n8:01 a.m. — Two more police officers arrive.\n8:09 a.m. — Officers find Gliniewicz's body about 50 yards from his squad car.\n— Wednesday, Sept. 2: Hundreds of people gather at a Fox Lake park for a vigil for Gliniewicz. Authorities use dogs and aircraft to search for suspects.\n— Thursday, Sept. 3: Authorities use at least 100 investigators to broaden the hunt from the initial 2-square-mile perimeter.\n— Friday, Sept. 4: $50,000 reward offered for capture and conviction of those suspected of killing Gliniewicz.\n— Monday, Sept. 7: Hundreds of police officers from around the country attend Gliniewicz's funeral with a mile-long procession through Fox Lake.\n— Tuesday, Sept. 8: The Lake County Major Crime Task Force holds a news conference to say a promising lead didn't pan out but that they are trying to identify DNA left at the crime scene.\n— Wednesday, Sept. 9: The Lake County coroner says Gliniewicz died of a \"single devastating\" gunshot wound, but that it can't rule whether his death was a homicide, suicide or accident.\n— Thursday, Sept. 10: Police leading the investigation call the coroner's release of Gliniewicz's cause of death inappropriate and potentially harmful.\n— Saturday, Sept. 12: Former Chicago police officer Joseph A. Battaglia is charged with a felony for allegedly threatening the Lake County coroner and investigators unless they categorized Gliniewicz's death as a suicide.\n— Wednesday, Sept. 16: Gliniewicz's son, Donald \"D.J.\" Gliniewicz, says his father \"never once had a single suicidal thought in his life.\"\n— Monday, Sept. 21: Police say they received the results of gun residue and ballistics tests but that they don't support or exclude any theories in Gliniewicz's death.\n— Thursday, Oct. 1: Police hold a news conference to say Gliniewicz was shot twice with his own weapon and there were signs of struggle at the scene.\n— Wednesday, Oct. 13: A woman from a nearby community pleads not guilty to falsely telling police she saw suspects wanted in Gliniewicz's death.\n— Wednesday, Nov. 4: Authorities say Gliniewicz elaborately staged his own death and had embezzled thousands of dollars over seven years from the Fox Lake Police Explorers youth program, which he oversaw. They say he spent the money on mortgage payments, travel and adult websites, among other things.","url":"https://www.dailymail.co.uk/wires/ap/article-3420185/A-timeline-events-death-Illinois-police-officer.html"}
