{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 20:01:22","date_modify":"2018-10-30 20:01:22","date_publish":"2016-01-21 15:30:58","description":"Atlanta’s booming cocktail scene shows no signs of slowing down, which means more bars are wil...","filename":"data/vaneerConsumption/AtlantaBarScene5cognaccocktailstotryatAtlantabars.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_at_158cc5e44edb693b259e2d0969d0b7d0__1540929682.html","title":"Atlanta Bar Scene: 5 cognac cocktails to try at Atlanta bars","title_page":"Atlanta Bar Scene: 5 cognac cocktails to try at Atlanta bars","title_rss":"NULL","source_domain":"ajc.com","text":"Atlanta’s booming cocktail scene shows no signs of slowing down, which means more bars are willing to experiment with everything from fanciful garnishes to cocktails with unusual base spirits. Cognac, a twice distilled, oak-aged French wine, is enjoying a healthy resurgence among curious cocktailians, and Atlanta’s bartenders are keeping up with demand shaking and stirring riffs on cognac classics as well as updated, after-dinner stunners. Here are five of the best cognac-based cocktails coming out of the city’s bartending trendsetters.\nSwing Low\nCreated for BoccaLupo by long-time barmen Greg Best and Paul Calvert, the Swing Low marries two wood-aged spirits – cognac and brandy-fortified port – to create a beautiful and satisfying after-dinner drink. The cognac and tawny port contain caramel and nutty flavors, the port lending a hint of lush fruit. The two spirits are bound together by Amaro CioCiaro, a bittersweet orange digestif that helps bump up the raisin tones the cognac and port retain from the aging process. Served up, this rich spin on a Manhattan carries you away into warm mellowness without the heady buzz of its much stronger cousin.\nBoccaLupo, 753 Edgewood Ave. NE, Atlanta, 404-577-2332, boccalupoatl.com\nThe Two World Hero from Kellie Thorn at Empire State South.\nTwo World Hero\nEmpire State South’s bar manager, Kellie Thorn, calls her Two World Hero “a great introductory cognac cocktail for whiskey drinkers.” Legendary barman and cocktail writer Gary Regan considers it one of the 101 Best New Cocktails of 2015.\n“While the predominant spirit is cognac, we felt the rye whiskey afforded customers some familiarity,” Thorn said.\nTo make this variation on a Vieux Carre, Thorn makes a 10-minute infusion of black tea, giving the 19th century, revival-style Pierre Ferrand 1840 cognac a hint of bitterness. Adding rye whiskey and sweet vermouth furthers the cocktail’s travels into Vieux Carre territory. The drink takes a distinctly Southern turn using red wine syrup muddled with mint. The syrup clings to the tea-infused cognac and transforms the sipper into a potent sweet tea with all the charms of a Southern belle and the bewitching appeal of a sultry jazz singer.\nEmpire State South, 999 Peachtree St. NE, Suite 140, Atlanta, 404-541-1105, empirestatesouth.com\nAntique Sour\nTiconderoga Club partners Paul Calvert and Greg Best love to work with cognac and brandy for the fruity characteristics the spirits bring to cocktails. The Antique Sour was born from such appreciation.\n“The Antique Sour is a slightly more rustic, savory and Southern version of the traditional brandy sour with the addition of sorghum and nutmeg for garnish, but it holds true to classic construction: sugar, fresh citrus and a well-made spirit in tested proportion,” Calvert explained.\nThe use of sorghum is key to the drink as it is needed to play up the tang of the fresh lemon and nutty notes of the cognac--giving this cocktail extra verve. “Nothing can sub for that wild and savory funk,” Calvert said.\nTiconderoga Club, Krog Street Market, 99 Krog St. NE, Atlanta, 404-458-4534, ticonderogaclub.com\nStinger at Marcel. Photo credit: Andrew Thomas Lee.\nThe Stinger\nThe Stinger harkens back to an age when the cocktail was king. This mid-century classic was enjoyed by ladies who lunched as well as those chasing their troubles away with a nightcap, explained Marcel bar manager Eduardo Guzman.\n“The Stinger was a classic drink during the late 1950s and 60s. Think: ‘Mad Men,’” said Guzman. “It’s classy and speaks to the cabaret vibe of the bars during that period when cocktails and cognac were key to the culture.”\nMarcel’s Stinger has been thoughtfully updated for the modern imbiber by subbing out syrupy sweet creme de menthe with the crisp, spearmint liqueur, menthe pastille. Using a young cognac allows the notes of fresh peach and raisin to remain predominant while the mint cools and subtly cleanses the palate between sips.\nMarcel, 1170 Howell Mill Road, Atlanta, 404-665-4555, marcelatl.com\nJimmie Roosevelt\nAfter working under cocktail maven Audrey Saunders at New York’s Pegu Club, Eric Simpkins, operating partner and beverage director of The Lawrence , credits the classic Jimmie Roosevelt for his love of crafting cocktails. The cognac and champagne drink’s deceptive simplicity and need for exacting precision makes it both challenging and breathtaking to create.\n“This is one of those cocktails I carry with me to every bar. I make it just like I did at Pegu. It’s super boozy. The cognac and champagne combination are as powerful as they are beautiful together.”\nA sugar cube is placed in an oversized coupe glass and then soaked in bitters before cracked ice is added. Equal parts cognac and champagne are then poured over the ice. Floating a few drops of chartreuse on top wakes the senses between each sip. A master craftsman, Simpkins delivers with this near perfect, layered cocktail worth every bit of its $20 price tag.\nThe Lawrence, 905 Juniper St. NE, Atlanta, 404-961-7177, thelawrenceatlanta.com\nThirsty for more? It’s cold outside. Warm up with one of these hot cocktails.\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook and following Atlanta Dining on Twitter.","url":"https://www.ajc.com/blog/atlanta-restaurants/atlanta-bar-scene-cognac-cocktails-try-atlanta-bars/su9MniQkoR1iqnzpeH334M/"}
