{"authors":[],"date_download":"2018-10-30 20:40:34","date_modify":"2018-10-30 20:40:34","date_publish":"2014-06-04 21:09:00","description":"A known-drug dealer has been sentenced to more than 21 years in federal prison on new weapons and drug charges.","filename":"data/vaneerConsumption/Atlantamantospend21yearsinprisonfordrugweapons.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/USAT_News/2018/08/01/Images/877266002_636136381546385466-crime.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_atlanta-man-spend-year_908d44060e9c6c3c9cb8364f8738c2a8__1540932034.html","title":"Atlanta man to spend 21 years in prison for drug, weapons...","title_page":"Atlanta man to spend 21 years in prison for drug, weapons...","title_rss":"NULL","source_domain":"ajc.com","text":"A known-drug dealer has been sentenced to more than 21 years in federal prison on new weapons and drug charges.\nDemetrius Pullins, 40, of Atlanta, pleaded guilty in February to possession of drugs with the intent to distribute, and being a convicted felon in possession of a weapon. He was sentenced to 21 years and 10 months in prison. The charges were in connection with an investigation that dates to 2012, according to a news release from the office of U.S. Attorney Sally Quillian Yates. When Pullins, also known as “Foosie,” pleaded guilty he claimed ownership of about $95,000 of crack cocaine, two firearms and more than $5,000.\nPullins’s prior criminal history, which included a three- year federal prison sentence, factored into his punishment, Yates said in the statement.\n“Pullins’ armed drug dealing has plagued the community for many years,” said Yates said in the emailed statement. “Despite three prior felony convictions for drug trafficking spanning two decades, he was unrepentant. This sentence ends Pullins’ ability to sell drugs in our community.”","url":"https://www.ajc.com/news/atlanta-man-spend-years-prison-for-drug-weapons-offenses/AYY3W221QYlUzPK5RbFTTK/"}
