{"authors":["Kelly Yamanouchi"],"date_download":"2018-10-30 20:06:23","date_modify":"2018-10-30 20:06:23","date_publish":"2016-07-07 12:52:10","description":"Atlanta is close to getting its first scheduled airline flights to Cuba in decades.","filename":"data/vaneerConsumption/AtlantatogetflightstoHavanaCuba.json","image_url":"https://www.myajc.com/rf/image_large/Pub/p7/MyAJC/2016/02/16/Images/WPIMAGE_cmgajcairport_5030.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/myajc.com/blog_airport_atlanta-get-flights-havana-cuba__1540929983.html","title":"Atlanta to get flights to Havana, Cuba","title_page":"Atlanta to get flights to Havana, Cuba","title_rss":"NULL","source_domain":"ajc.com","text":"Atlanta is close to getting its first scheduled airline flights to Cuba in decades.\nDelta Air Lines on Thursday received tentative federal approval to launch flights to Havana, Cuba from Atlanta, New York and Miami. The airline plans to start selling seats to Havana this summer, with flights launching this fall, subject to Cuban regulatory approval.\nThe service will be Delta's first daily nonstop scheduled flights to Cuba in nearly 55 years.The last time Delta flew to Cuba was in 1961, when the airline pulled its service from New Orleans to Cuba amid \"political instability and profitability issues.\"\nDelta in recent years operated some charter flights to Cuba, but the Obama Administration has opened the door to regularly scheduled airline flights to Cuba as part of re-established diplomatic relations with the country.\nAtlanta-based Delta is \"working diligently to address the unique logistical challenges to reestablishing daily scheduled Havana service,\" according to Delta's vice president for Latin America and the Caribbean Nicolas Ferri.\nWith the restart of scheduled airline service between the two countries, U.S. visitors to Cuba must still qualify under one of 12 categories authorized by the U.S. Department of Treasury’s Office of Foreign Assets Control.\nThe U.S. Department of Transportation tentatively awarded Havana routes to Delta, Alaska Airlines, American Airlines, Frontier Airlines, JetBlue Airways, Southwest Airlines, Spirit Airlines and United Airlines. After a period where opponents can file objections, the DOT plans to make final decisions later this summer.\n“Restoring regular air service holds tremendous potential to reunite Cuban American families and foster education and opportunities for American businesses of all sizes,\" said U.S. Transportation Secretary Anthony Foxx in a written statement.","url":"https://www.myajc.com/blog/airport/atlanta-get-flights-havana-cuba/ZOuHqtWAtHHwA5oPo6vlZO/"}
