{"authors":[],"date_download":"2018-10-30 20:19:55","date_modify":"2018-10-30 20:19:55","date_publish":"2015-12-28 12:39:03","description":"A possible carjacking victim and a police officer were wounded early Monday during a wild shootout on Atlanta’s west side.","filename":"data/vaneerConsumption/Atlantacoppossiblecarjackingvictimhurtinwildshootout.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/12/28/Images/photos.medleyphoto.8531519.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_atlanta-cop_5d598376750f5f0185ea8d5a17916a5c__1540930795.html","title":"Atlanta cop, possible carjacking victim, hurt in wild shootout","title_page":"Atlanta cop, possible carjacking victim, hurt in wild shootout","title_rss":"NULL","source_domain":"ajc.com","text":"A possible carjacking victim and a police officer were wounded early Monday during a wild shootout on Atlanta’s west side.\nAccording to Atlanta police, officers received a call around 2:15 a.m. from a man who said that his friend had been carjacked and abducted, and that he was following the friend’s stolen yellow Mustang.\nPolice spotted the Mustang in the 3300 block of Martin Luther King Jr. Drive, and stopped the car, which was being driven by the car’s owner.\nThe Mustang driver, 45-year-old Derrick Grayson, “got out of the Mustang and ran towards the police,” Atlanta police spokeswoman Kim Jones said.\n“The passenger got out of the Mustang and began shooting at Mr. Grayson, striking him several times,” Jones said. “The passenger then began shooting at police.”\nAn officer returned fire, but the passenger was able to jump into the 911 caller’s vehicle and flee, according to police. He bailed out of the second stolen car about a mile away, on Fairburn Road, and escaped on foot.\nJones said Grayson was shot in the arms and legs, and was taken to Grady Memorial Hospital in stable condition. Investigators had not yet spoken with Grayson late Monday afternoon, a police spokesman said.\nThe officer that was fired on by the suspect sustained “very minor marks on his right arm as a result of the incident,” Jones said, and was treated for the minor injury and released.","url":"https://www.ajc.com/news/crime--law/atlanta-cop-possible-carjacking-victim-hurt-wild-shootout/41wMEKZ3ArVkJ7ws28oN3L/"}
