{"authors":[],"date_download":"2018-10-30 20:34:26","date_modify":"2018-10-30 20:34:26","date_publish":"2015-08-20 13:51:39","description":"A northwest Atlanta father shot in the legs Sunday as he tried to protect his wife and children during a violent home invasion has taken his first steps toward recovering from his injuries, a family member said.","filename":"data/vaneerConsumption/AtlantahomeinvasionManshotprotectingfamilytakes1ststeps.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/08/20/Images/photos.medleyphoto.7965277.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_atlanta-hom_0f79732e8c0341919495744af4f3b4fc__1540931666.html","title":"Atlanta home invasion: Man shot protecting family takes 1st steps","title_page":"Atlanta home invasion: Man shot protecting family takes 1st steps","title_rss":"NULL","source_domain":"ajc.com","text":"A northwest Atlanta father shot in the legs Sunday as he tried to protect his wife and children during a violent home invasion has taken his first steps toward recovering from his injuries, a family member said.\nMichael Lash, his wife, Whitney, and the couple’s two children had just arrived at their Sumter Street home when two teenagers approached and asked for a car jack before trying to force their way into the family’s home.\nMichael Lash was shot twice — once in each leg — as he tried to stop them. Whitney Lash heard the shots, grabbed the couple’s 6-month-old daughter and ran toward a back door. The suspects fired two shots at Whitney Lash, but missed her as she ran out the back door and to a nearby home for help. Several suspects then ransacked the family’s home, according to police.\nLate Wednesday, Michael Lash’s father-in-law updated his condition on a GoFundMe page set up for the family.\n“Our son-in-law Mike made some painful but significant progress, taking his first steps with a walker. One of his legs is doing very well because the bullet passed through that thigh without hitting bone or artery. He has some serious nerve damage in the other leg which will require many months of physical therapy.”\nThe posting went on to say, “Mike should be released from Grady [Memorial Hospital] this week.”\nAs of Thursday afternoon, more than $81,000 in donations had been made to the GoFundMe fundraising page to assist Michael and Whitney Lash with medical and other costs.\nNo arrests have been made in the case. Authorities released Wednesday afternoon a sketch of the man accused of shooting Lash. That Georgia Bureau of Investigation sketch shows a black man with a piercing between his eyes.\nAnyone with information in the case is asked to contact Crime Stoppers by calling 404-577-TIPS, visiting crimestoppersatlanta.org, or texting CSA and the tip to 274637. Tipsters can remain anonymous.\nA $5,000 reward is being offered.","url":"https://www.ajc.com/news/crime--law/atlanta-home-invasion-man-shot-protecting-family-takes-1st-steps/krt4iYSotXrtN2TDLR3oWO/"}
