{"authors":[],"date_download":"2018-10-30 18:15:53","date_modify":"2018-10-30 18:15:53","date_publish":"2015-08-25 10:00:00","description":"For five years, the Michael C. Carlos Dance Centre, located along an industrial stretch of the burgeoning West Midtown district, has been a beehive of activity.","filename":"data/vaneerConsumption/AtlantaBalletopensWestMidtownstudiodoorsforbenefit.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/08/25/Images/photos.medleyphoto.8005100.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_arts--theater_ace2c7378507c73073bf0fb6ee4daa25__1540923353.html","title":"Atlanta Ballet opens West Midtown studio doors for benefit...","title_page":"Atlanta Ballet opens West Midtown studio doors for benefit...","title_rss":"NULL","source_domain":"ajc.com","text":"For five years, the Michael C. Carlos Dance Centre, located along an industrial stretch of the burgeoning West Midtown district, has been a beehive of activity.\nBut unless you are an Atlanta Ballet professional dancer, a parent delivering a student to its Centre for Dance Education or a company patron attending a special event, you’ve probably never witnessed the buzz that reverberates across its 22-foot-high lobby or inside its five full-size dance studios.\nThe 54,000-square-foot former Hotpoint appliance plant, which opened in 1955 and which the dance troupe reopened in 2010 after a nearly $11 million transformation, is still cooking with gas.\nSaturday evening, the public will have a rare opportunity to check out one of the metro area’s most happening arts HQs at the first Atlanta Ballet Block Party.\nWabi Sabi, Atlanta Ballet’s contemporary summer offshoot ensemble, will share the spotlight with the Alliance Theatre (performing an excerpt from its season-opening “One Flew Over the Cuckoo’s Nest”) and the Atlanta Opera (soloist Elizabeth Claxton performs two arias).\nThe family-friendly event also will feature mini dance classes, rehearsal viewing (for February’s performance of “Moulin Rouge — The Ballet”), scenery-wardrobe tours, a costume sale, stage makeup demos, a DJ spinning tunes, a Top Golf Midtown demo station, a photo booth, food trucks, door prizes and more.\nAdmission is free, but a suggested donation of $20 will support the Dancers’ Resource Fund, and will even get you three throws at the Dunk-a-Dancer Booth.\nDunk a fine-tuned performing artist — who thought that was a good idea?\nWell, the Atlanta Ballet’s dancers, who will likely be building up heads of sweat as they perform, rehearse, teach and schmooze throughout the three-hour event.\n“I’m looking forward to that,” Atlanta Ballet company dancer Christian Clark admitted of the splish-splash. “After a long, hot day of rehearsals, it’s going to feel nice.”\nAtlanta Ballet’s calendar is filled with lots of long, hot days of rehearsals, which is partly why the time-stretched dancers, along with the company’s marketing department, decided to launch the Block Party to replace the annual performance of “Nutty Nutcracker” as the main benefit for the Dancers’ Resource Fund.\nThe fund mainly supports dancers with school and training needs as they prepare for second careers after dance.\nClark’s wife, former Atlanta Ballet dancer Naomi-Jane Clark, tapped the fund for tuition help when she was studying at the Art Institute of Atlanta to become an interior designer. And Clark himself has been granted funds to videotape his choreography.\n“Most of us out of high school are looking for jobs, and the time (once your professional career starts) is so precious and short-lived,” said Clark, an Atlanta native who began classes at the Centre for Dance Education at age 9 and has, at 32, shaped an accomplished career with his hometown company. “And all of the sudden you’re in your mid- to late 30s, and you’re thinking, ‘Oh my God, I have all this time invested in the ballet, but it’s not a career that lasts forever.’\n“So you need that backup plan, and in that way the fund is really good.”\nBut beyond supporting that good cause, the Block Party is envisioned by the dancers and administration as a more casual way to connect with the public and turn them into knowing supporters.\nThe organizers hope it will become an annual “welcome to the season” public celebration.\nAtlanta Ballet’s only other yearly public event at its studios is Healthy Living Day, a free afternoon of activities for families that includes dance classes, food demonstrations, healthy living and nutrition seminars and arts and crafts. The fourth edition is planned for noon-6 p.m. Sept. 13.\n“Every day when I go to work, I still can’t believe this is the building we get to work in,” said Clark, who is entering his 14th season. “It’s a real luxury and we’re so privileged to be in a space like ours. So we’re really, really proud of it, and we’ve been wanting to have more opportunities to show that off to the public and have events like the Block Party.”","url":"https://www.ajc.com/entertainment/arts--theater/atlanta-ballet-opens-west-midtown-studio-doors-for-benefit-block-party/UnlsW3f7L4qvS8gnZIUDpI/"}
