{"authors":[],"date_download":"2018-10-30 18:19:01","date_modify":"2018-10-30 18:19:01","date_publish":"2014-06-20 04:00:00","description":"Atlanta Lyric Theatre has a positive history with historic Marietta Square, and the metro area’s only professional musical theater company plans to renew the relationship after a year’s absence.","filename":"data/vaneerConsumption/AtlantaLyricexpandstosecondstageonMariettaSquare.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/MyAJC/2014/06/20/Images/photos.medleyphoto.5402824.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_atlanta-lyric_bbe214e58ae50a1d0ee6905f3ce32678__1540923541.html","title":"Atlanta Lyric expands to second stage on Marietta Square","title_page":"Atlanta Lyric expands to second stage on Marietta Square","title_rss":"NULL","source_domain":"ajc.com","text":"Atlanta Lyric Theatre has a positive history with historic Marietta Square, and the metro area’s only professional musical theater company plans to renew the relationship after a year’s absence.\nThe Lyric, which performed at the Earl Smith Strand Theatre for five seasons — before moving to the Cobb Civic Center last fall when it couldn’t reach an agreement on a new lease — has announced it will open a second space back on the square. It is renting the Alley Stage, the smaller performance hall of the now-defunct Theatre in the Square.\nThe 80-seat theater, which is being renamed the Lyric Studio Theatre in the Square, will present weekly cabaret entertainment, new and original musical works and Atlanta Junior Lyric shows. The Lyric plans to release the initial schedule early in July for its second stage, which is undergoing an extensive renovation.\nManaging Artistic Director Brandt Blocker said he expects presentations at the Lyric Studio Theatre to complement the main stage productions at Cobb Civic Center’s 600-seat Jennie T. Anderson Theatre. The Lyric is presenting the final show of its 2013-14 season, “Spamalot,” there through June 29, then will launch its five-show 35th season at the Cobb center in August with “Cats.”\n“The reason for this expansion is a desire for the company to fully realize our mission,” Blocker said.\nThe Lyric’s mission centers on expanding the metro audience for musical theater by mixing quality performances and educational outreach.\n“Once the former Alley stage became available, we determined it would be an ideal location for these (non-main stage) programs, as well as an opportunity to return to the Marietta Square,” Blocker said.\nThe fix-up before the Lyric Studio Theatre opens includes new cabaret-style table seating to replace the Alley Stage’s theater-style seats and risers. A storefront at 12 Powder Springs St. will serve as the new entrance for theatergoers, replacing the back-alley entrance used in Theatre in the Square days.\nThe facility is being repainted and redecorated, with hardwood floors replacing old carpeting. Lighting and sound will be upgraded, as well. The Lyric is applying for a beer and wine license.\nBlocker said the improvements are being paid for with a $10,000 Georgia Commerce Bank sponsorship; paint and flooring is being donated by local suppliers.","url":"https://www.ajc.com/entertainment/atlanta-lyric-expands-second-stage-marietta-square/svxzewKJpJczxOuIBP6ZOM/"}
