{"authors":[],"date_download":"2018-10-30 20:36:47","date_modify":"2018-10-30 20:36:47","date_publish":"2015-08-19 12:31:25","description":"The northwest Atlanta father shot in both legs during a home invasion remained hospitalized Wednesday morning following surgery to insert a rod from his knee to his hip, Michael Lash’s wife said.","filename":"data/vaneerConsumption/Atlantafathershotduringviolenthomeinvasionquotedscripture.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/08/19/Videos/4431837597001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_atlanta-fat_4c25df2031bb9733e3c9f9ccc26a0ae5__1540931807.html","title":"Atlanta father shot during violent home invasion quoted scripture","title_page":"Atlanta father shot during violent home invasion quoted scripture","title_rss":"NULL","source_domain":"ajc.com","text":"The northwest Atlanta father shot in both legs during a home invasion remained hospitalized Wednesday morning following surgery to insert a rod from his knee to his hip, Michael Lash’s wife said.\nIn a post on an online fundraising page for the family, Whitney Lash said her husband doesn’t have feeling in his foot, but doctors are hopeful physical therapy will help him regain sensation.\nStill, it was her husband’s words after being shot that Whitney Lash said are helping the family through the ordeal. Her husband was praying, citing one specific verse from Luke 23.\n“Forgive them Father, they know not what they have done,” Michael Lash said, according to his wife.\n“His immediate grace and forgiveness for others in the midst of life and death is a constant reminder for me as I feel anger trying to creep in,” Whitney Lash posted online.\nThe Lash family had just returned to their Sumter Street home Sunday evening following a beach vacation when two teenagers approached Michael Lash on the front porch, asking for a car jack, according to police. As the father of two tried to stop the two from forcing their way into his home, he was shot twice, once in each leg.\nShots were also fired at Whitney Lash as she ran from the home with the couple’s 6-month-old baby, but no one else was injured. Several suspects then ransacked the family’s home, according to police.\nNo arrests had been made in the case Wednesday morning. The home invasion remained under investigation.","url":"https://www.ajc.com/news/crime--law/atlanta-father-shot-during-violent-home-invasion-quoted-scripture/hGhJKnu1BBPFfr6UqUnhDL/"}
