{"authors":[],"date_download":"2018-10-30 21:44:36","date_modify":"2018-10-30 21:44:36","date_publish":"2015-07-24 14:03:32","description":"Arthur Blank acknowledges he isn’t a patient man, so don’t expect Atlanta United FC to field a typical expansion team that will merely try to play hard in the first 2-3 years when it takes the field in 2017.","filename":"data/vaneerConsumption/AtlantaUnitedwillbebuiltaroundinternationalplayers.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/07/24/Images/photos.medleyphoto.7746725.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_pro-sports_atlanta-u_0f8e66cae353a786124c6f17d8e66163__1540935876.html","title":"Atlanta United will be built around international players","title_page":"Atlanta United will be built around international players","title_rss":"NULL","source_domain":"ajc.com","text":"Arthur Blank acknowledges he isn’t a patient man, so don’t expect Atlanta United FC to field a typical expansion team that will merely try to play hard in the first 2-3 years when it takes the field in 2017.\n“Our aspiration is to have a winning team from the get-go,” Blank, the team’s owner, said. “The emphasis will be building long-term, but winning short-term as well.”\nTo marry short-term winning with long-term success, president Darren Eales and technical director Carlos Bocanegra said the team likely will be built around the eight international slots MLS teams start with. Those slots can be traded.\nEales said he hopes his connections at Tottenham Hotspur, as well as Bocanegra’s from playing in England, Scotland, Spain and France will help them find and sign players from all over the globe.\nThose players will be the nucleus because all three want to win, and it’s unlikely that Atlanta United will find a lot of starters in the expansion draft or its first college draft. There may be some American free agents available, but not enough from which to build a team.\nInternational veterans will bring experience on the field, experience in the locker room and an understanding of what it takes to be a professional to lead the younger American players.\n“We’re not trying to be a foreign team,” Bocanegra said. “The reality is it’s going to be very tough to get all of our talent from here in America right from the get-go.”\nAs the team continues to develop in the following seasons, the younger Americans coming through the academy, as well as the draft picks, free agents and perhaps any “designated player” slots that haven’t been used, will be mixed in.\n“Then it gets less important to have foreign players be the core of the team,” Bocanegra said.\nBuilding the team will start with hiring the coach.\nBocanegra said the coach likely won’t be hired until the summer of 2016, but Blank said it could happen sooner if the right person came along. The coach doesn’t have to have knowledge of MLS, with its single-entity structure that creates different methods of signing players than other leagues use, but Bocanegra said that someone on staff will need to know the league, its teams and players.\nAnd then, likely in December 2016, the roster will start to take shape.\nEales stressed that cohesiveness of the team is important. They won’t sign a big-name designated player just because he’s available unless they think he will fit in well with the team, organization and community.\nThey have watched how the two most recent expansion teams, New York City FC and Orlando SC, have built their teams. NYCFC spent a lot of money on attacking players such as David Villa and Mix Diskerud. They are ninth of 10 teams in the Eastern Conference. Orlando City SC spread its money around, with the jewel being midfielder Kaka. They are sixth in the East. Eales has said he wants to build a team that will be strong up the middle.\nBocanegra said it won’t be a difficult sales pitch to lure international players to come to Atlanta and MLS.\n“Everybody’s curious about America; everybody wants to come to America,” he said. “The league is getting stronger and stronger.”\nAs an example, Eales said when he and Mexico’s Gio dos Santos were both at Tottenham, the club couldn’t interest him in moving to MLS. He wouldn’t listen to the idea. Dos Santos recently signed with the L.A. Galaxy.\n“It shows how far it’s come,” Eales said.","url":"https://www.ajc.com/sports/pro-sports/atlanta-united-will-built-around-international-players/W8QGiEVtMiWqySS3GKbfqK/"}
