{"authors":[],"date_download":"2018-10-30 20:44:20","date_modify":"2018-10-30 20:44:20","date_publish":"2014-05-07 01:22:12","description":"An Atlanta woman who used Georgia’s “stand your ground” law as her defense was found guilty of murder Friday by a Fulton County jury.","filename":"data/vaneerConsumption/Atlantawomanusingstandyourgrounddefensefoundguilty.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_atlanta-woman-us_ce81ab2fc3dc4c99cb0f314c050c0b74__1540932260.html","title":"Atlanta woman using ‘stand your ground’ defense found guilty...","title_page":"Atlanta woman using ‘stand your ground’ defense found guilty...","title_rss":"NULL","source_domain":"ajc.com","text":"An Atlanta woman who used Georgia’s “stand your ground” law as her defense was found guilty of murder Friday by a Fulton County jury.\nShakeithia Wheeler, 32, was convicted on charges of felony murder, aggravated assault and weapons offenses, Fulton County District Attorney Paul L. Howard Jr.’s office announced today. She was sentenced to life plus eight years in prison.\nWheeler admitted to fatally shooting 28-year-old Charles Roberson on May 3, 2009, in the parking lot of her Verdant Drive apartment complex in southwest Atlanta, the news release said.\nHowever, she said she believed that she had the right to do so under the “stand your ground” law.\nWheeler said she thought her brother was in danger when she heard an argument outside. She left her apartment with a gun and opened fire, grazing a nearby woman before arguing with the man who was arguing with her brother earlier, prosecutors said. As the argument escalated, Wheeler shot Roberson in the head. She said she believed Roberson had a weapon and she was in danger and had “no duty to retreat,” authorities said.\nWitnesses testified that Wheeler was the aggressor.\n“The evidence showed that no one involved in this case was armed except for Wheeler,” Fulton DA spokeswoman Yvette Jones said in the news release.","url":"https://www.ajc.com/news/local/atlanta-woman-using-stand-your-ground-defense-found-guilty-murder/bWhJcy54urQWrXgSQOBYwN/"}
