{"authors":[],"date_download":"2018-10-30 19:53:56","date_modify":"2018-10-30 19:53:56","date_publish":"2017-04-07 14:29:00","description":"The Atlanta Braves host batting practice three hours before first pitch. Here is how you can watch your favorite MLB players practice at SunTrust Park.","filename":"data/vaneerConsumption/AtlantaBravesbattingpracticetimesVIPtickets.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/30/Images/033117%20braves%20stadium%20CC27.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_suntrust-park-ho_f89678836324b590aef8bde4ab3594d3__1540929236.html","title":"Atlanta Braves batting practice times, VIP tickets","title_page":"SunTrust Park: Atlanta Braves batting practice times, VIP tickets","title_rss":"NULL","source_domain":"ajc.com","text":"There’s usually two reasons baseball fans like to arrive early at a stadium.\nIn the case of the new SunTrust Park, it’s probably to beat the inevitable game day traffic.\nBut for those die-hard baseball fans, it also gives them a chance to watch players partake in an essential pregame tradition: batting practice.\nSo whether you’re a Braves fan or NL East fan from out-of-town, here is a quick guide to batting practice at SunTrust Park.\nWhat time does batting practice start?\nA typical MLB batting practice session in begins two-three hours before first pitch.\nFor 7:10 p.m. games, the Braves hit at 4:40 p.m. and the visitors swing at 5:40 p.m.\nFor 7:35 p.m. games, batting practice starts at 5:05 p.m. and opponents hit at 6:05 p.m.\nFor 1:35 p.m. games, the Braves hit at 11:05 a.m. and visiting team starts at 12:05 p.m.\nHow long are batting practice sessions?\nThe Braves will take their swings first for 45 minutes to an hour.\nVisiting teams will then step into the cage for about 15 to 30 minutes if they choose to participate.\nHow can I watch batting practice?\nThe Braves offer an option to purchase a “Batting Practice Experience” ticket, which allows fans to stand on the warning track behind home plate and watch their favorite players.\nThose with batting practice experience tickets should arrive three hours before game time and enter at the Right Field Gate, which is located across from the Coca-Cola Roxy Theatre.\nFor fans without an Experience ticket, the Chop House and premium club gates open two hours before first pitch.\nFans can watch the Braves' batting practice from the outfield seats regardless of where their seats are located, according to Braves spokesperson Beth Marshall.\nWhere do I get tickets for the batting practice experience?\nThe Braves suggest that fans purchase their passes in advance online or through a ticket representative. Prices can range from $75 to $120.\nPasses may be available for purchase on game day at the SunTrust Park ticket office if they are not sold out. The experience is not available for day games, including Sunday afternoons.\nFor families planning a Braves outing, children over three must have an experience pass too and children 16 and under must have an adult accompany them.\n﻿What happens if there is bad weather on gameday?\nIn case of bad weather, a practice session may get canceled and fans who purchased the experience may exchange it for a different game later in the season.\nThere are no exchanges or refunds if 30 minutes has passed and weather ends practice early.","url":"https://www.ajc.com/news/local/suntrust-park-how-watch-atlanta-braves-batting-practice/juyk1TKDm9P3rCdV9CpthI/"}
