{"authors":[],"date_download":"2018-10-30 17:59:23","date_modify":"2018-10-30 17:59:23","date_publish":"2016-05-31 00:00:00","description":"The June 4, 1962, front page of the Atlanta Constitution gave Atlantans the tragic news that over 100 of their fellow citizens had perished in the Orly plane crash near Paris, France. Onboard were prominent leaders in the Atlanta arts community on a tour of European museums..","filename":"data/vaneerConsumption/Atlantaartspatronsdiein1962Parisplanecrash.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/05/31/Images/photos.medleyphoto.9979700.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_ajc-archives-atlanta-a_cc5c796d73b06445d035cc6e39fe247a__1540922363.html","title":"Atlanta arts patrons die in 1962 Paris plane crash","title_page":" Atlanta arts patrons die in 1962 Paris plane crash - Photos","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 21\nAJC FILE The June 4, 1962, front page of the Atlanta Constitution gave Atlantans the tragic news that over 100 of their fellow citizens had perished in the Orly plane crash.\n2 / 21\nAP FILE JUne 3, 1962 -- People living in the vicinity of Orly field, near Paris, look over a fence at rescue workers probing through wreckage of the Air France jetliner that crashed on takeoff from the field. The plane was bound for New York and Atlanta and carried 133 persons, at least 130 of whom died in the disaster.\n3 / 21\nAP FILE A helicopter hovers over the wreckage of a charter Air France Boeing which crashed and burned after take-off from Orly Airport, near Paris, June 3, 1962, killing 131 people. 113 of those killed were from Georgia. LEARN MORE: Read our photostory review of the crash\n4 / 21\nAP FILE June 3, 1962 - Paris, France - The twisted remains of an Air France Boeing 707 jet are scattered over Orly Field near Paris. The tail section is the only recognizable part of the plane after it crashed on takeoff.\n5 / 21\nAP FILE June 1962 - The plane's wreckage is strewn almost at nearby doorsteps. The charred remains of the aircraft are shown in Villeneuve Le Roi near Orly Air Field.\n6 / 21\nKEN PATTERSON / AJC FILE June 4, 1962 - Each news bulletin coming back to Atlanta's Air France office concerning the Orly crash got worse. Inside Atlanta's Air France office, the fatality list became longer.\n7 / 21\nKen Patterson June 4, 1962 - Eash news bulletin coming back to Atlanta's Air France office concerning the Orly crash got worse. Inside Atlanta's Air France office, the fatality list became longer Sunday afternoon.\n8 / 21\nAP FILE June 1962 - An unidentified official counts the covered bodies of Air France crash victims at Orly.\n9 / 21\nBILLY DOWNS / AJC file June 4, 1962 - An American flag flies at half-staff in Atlanta in honor of the victims of a chartered Air France Boeing 707 which crashed on takeoff at Orly Air Field in France. Most of the passengers were from Atlanta.\n10 / 21\nAP FILE June 8, 1962 - Firemen probe the wreckage of the Air France jet that crashed in French village of Villeneuve Le Roi near Orly Airfield in Paris.\n11 / 21\nCOPY June 4, 1962 - Atlanta, Ga.: Newspaper vendor sells a Atlanta Journal Special Extra with the latest news of the crash of an Air France chartered jet which carried many members of the Atlanta arts community. No passengers survived the crash.\n12 / 21\nCHARLES PUGH / AJC file October 1968 - Tuxedoes and formal gowns are in evidence at the red-carpet premiere of the Atlanta Memorial Arts Center. Now called the Woodruff Arts Center, the facility was built as a memorial in honor of the Orly crash victims.\n13 / 21\nAP FILE June 3, 1962 - After flames are extinguished, two firemen climb over one of jet engines. The Boeing 707 just missed a house (extreme right) in Villeneuve Le Roi, near Orly Airfield.\n14 / 21\nCOPY June, 1962 - After flames extinguished, two firemen climb over one of jet engines. Boeing 707 just missed house (extreme right) in Villeneuve Le Roi, near Orly Airfield.\n15 / 21\nAP FILE Atlantan Doug Davis, 32, a portrait and mural artist, was one of the 130 victims of the Air France plane crash at Orly Field in Paris.\n16 / 21\nAP FILE The wrecked tail section of the Air France chartered Boeing jetliner points skyward after the plane crashed on takeoff from Orly Field, near Paris. In the foreground are navigation lights marking the approach of the air field.\n17 / 21\nAP FILE June 4, 1962 - Technicians take down information from instrument panel of the wrecked Air France jetliner at Orly Field, near Paris. The plane crashed June 3 on takeoff with a loss of 130 lives. It had been chartered by the Atlanta Art Association.\n18 / 21\nAP FILE\n19 / 21\nAP FILE June 3, 1962 - A rescue worker holds the charred movie camera of an Orly crash victim at the crash site.\n20 / 21\nThe most important plane crash in Atlanta history did not happen in Atlanta, it occurred June 3, 1962, as Air France Flight 007 departed Paris' Orly airport. The Boeing 707 charter flight was headed to Atlanta via New York when it crashed, killing 130 of the 122 passengers and 10 crew on board. It was the first civilian jet disaster with more than 100 deaths. More than 100 of the passengers were art patrons from Atlanta returning from a monthlong tour of Europe.\n21 / 21","url":"https://www.ajc.com/news/ajc-archives-atlanta-arts-patrons-die-1962-paris-plane-crash/JO4fM17jvI5t89Y0tXXwfN/"}
