{"authors":[],"date_download":"2018-10-30 14:38:33","date_modify":"2018-10-30 14:38:33","date_publish":"2018-07-29 10:00:00","description":"Subpoenas in the federal corruption probe of Atlanta City Hall have shifted from outside contractors to Reed's inner circle.","filename":"data/vaneerConsumption/AtlantaCityHallcorruptionprobefocusingonspending.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/07/24/Videos/4445980.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_c_6adf402112586209e9e69f7a3c5f374b__1540910313.html","title":"Atlanta City Hall corruption probe focusing on spending","title_page":"Atlanta City Hall corruption probe focusing on spending","title_rss":"NULL","source_domain":"ajc.com","text":"Federal investigators over the past two years have peered into nearly every corner of Atlanta City Hall.\nThe corruption probe started with a subpoena related to a pair of outside contractors and one of former Mayor Kasim Reed’s campaign advisers. Then it pivoted, with one aimed at the airport, Watershed and Public Works departments.\nThis spring, investigators peeked into Reed’s wallet with a request that the city turn over the former mayor’s city-issued credit card statements. Then, this month, they requested information about payouts made to Reed’s closest advisers for accrued leave.\nRELATED CONTENT: BONUSES\nEven without knowing what information has been sought from private businesses and individuals, legal experts say the nine subpoenas issued to the city so far reveal the broad contours of a sprawling investigation that shows no signs of wrapping up soon.\nThey say the subpoenas have followed a familiar investigatory pattern: begin at the outside and work in. The first subpoenas from 2016 were clearly aimed at exposing procurement fraud and bribes to officials, while the most recent from 2018 have focused on Reed and senior members of his cabinet.\n“The reason these things bounce around: One piece of information leads to another; one source leads to another source; somebody talks and somebody pleads guilty,” said Caren Morrison, a law professor at Georgia State University who was formerly a federal prosecutor in the Eastern District of New York.\nMorrison and two other experts reviewed each of the subpoenas last week for The Atlanta Journal-Constitution. She called the breadth of the investigation “impressive,” and said the most recent subpoenas seem to be drawing sharp focus on top officials from the Reed administration.\n“The image that comes to mind with the most recent subpoenas is the walls closing in,” Morrison said. “They really are circling around the highest-level people of Mayor Reed’s cabinet. These investigations are kind of like building a pyramid — you keep building until you get to the top.”\nFormer chief purchasing officer Adam Smith is serving a 27-month prison sentence for taking bribes. HYOSUB SHIN / HSHIN@AJC.COM (The Atlanta Journal-Constitution)\nThe only member of Reed’s cabinet who has been charged in the investigation so far is former Chief Procurement Officer Adam Smith, who pleaded guilty last year to taking bribes and agreed to cooperate with the investigation. He received a 27-month prison sentence, which was reduced at least in part because of secret recordings he made to further the probe.\nLester Tate, a criminal defense attorney and former president of the Georgia Bar Association, said it’s impossible to draw definitive conclusions about where the investigation is headed based on the nine subpoenas. That’s because prosecutors have more evidence — and have likely issued more subpoenas — than are known to the public.\n“If we’re seeing nine subpoenas, I bet there are 10 times that many out there,” Tate said. “Certainly, they’re looking at bank records, cash withdrawals, assets — there are all manner of things like that could be the subject of subpoenas.”\nThe early focus: outside vendors\nThe U.S. Attorney’s Office opened the investigation with a volley of three subpoenas in the second half of 2016, aimed squarely at contracting and bribery.\nThe first, issued in August of that year, focused on Rev. Mitzi Bickers, a go-to political consultant who helped boost Reed’s 2009 campaign over the top with an expansive get-out-the-vote effort. Reed then made Bickers head of his Human Services Department, until she resigned in 2013 in a cloud of controversy for not claiming outside income on financial disclosures she was required to file with the city.\nRELATED CONTENT: SUBPOENAS\nThe Bickers subpoena asked for her employment and salary history, emails, work product, and consulting services performed by companies in which she had ownership interest.\nMitzi Bickers and her attorney Richard Hendrix the Richard B. Russell Federal Building after her first appearance in federal court on April 5, 2018, to face charges that she took $2 million in bribes to steer city of Atlanta contracts to at least two contractors from 2010 to 2015. She has pleaded not guilty. HYOSUB SHIN / HSHIN@AJC.COM (The Atlanta Journal-Constitution)\nBickers was indicted on 11 federal charges in April, including conspiracy to commit bribery, money laundering, wire fraud, tampering with a witness or informant, and filing false tax returns. She has pleaded not guilty.\nIn November 2016, a subpoena demanded records for contractors Elvin “E.R.” Mitchell Jr. and Charles P. Richards Jr., whose companies were awarded millions of dollars in contracts by the city’s Public Works Department. Two months later, they became the first people to be charged, plead guilty and agree to cooperate.\n“Those guilty pleas are a prime example of just how powerful this type of information (obtained through subpoena) can be, and how quickly guilty pleas can be obtained once that evidence is received,” said Jeff Brickman, a criminal defense attorney and former federal prosecutor. “Documents come in, the feds look at them, call in the defense attorneys and slide those documents across the table and say: ‘How do you explain this?’\n“That is an uncomfortable seat to be in.”\nProsecutors allege that Mitchell and Richards paid Bickers for contracts, and that she retained influence at City Hall even after she quite working for the Reed administration.\nAn explosive subpoena was issued in September 2016, but the public didn’t know anything about it until May because the Reed administration withheld the document and did not acknowledge its existence. That 10-point subpoena, issued after Reed fired airport general manager Miguel Southwell and Watershed Commissioner Jo Ann Macrina, demanded information about specific airport contracts, the ranking or re-ranking of responses to airport contract solicitations, existing airport concessionaires and financial documentation for Southwell, Macrina and Smith.\nAs the AJC has previously reported, the subpoena was also hidden from Atlanta City Council, which approved four multi-million dollar contracts without knowing they were under federal investigation.\nPrison for procurement chief\nSmith, the procurement chief, was the subject of a second subpoena just a few months later, in February 2017. Federal agents raided his office and hauled away his work computer and smart phone on the same day they issued the records demand, and Reed fired him.\nThe subpoena asked for forensic images of Smith’s computer and cell phone, emails, financial disclosure statements, and all records in which Smith certified that companies with contracts of $1 million or more had disclosed their personal relationships and that the contracts were “appropriate.”\nWhen pleading guilty in September 2017, Smith admitted to accepting at least $30,000 in cash payments from an executive from an Atlanta construction firm to discuss bids, projects and future project solicitations. That vendor was an active participant in city work.\n>> COMPLETE COVERAGE: Latest Atlanta City Hall investigative content\nIt is still unknown who or what Smith recorded, but earlier this month Bickers’ attorney asked for more time to prepare for a pretrial hearing because he had received more than 40 audio records, many of which were more than two hours long. His request for more time also said more than 1 million pages of documents in the case against Bickers were given to him for review.\nJust days before Smith’s guilty plea, prosecutors issued another subpoena to the city asking for records related to airport and watershed contractor The PRAD Group, and its executive Jeff Jafari, along with records about the city’s “deliberative process” during contract awards to PRAD.\n“Based on the subpoenas I’ve reviewed, there does not appear to be any confusion about the strategy they’re employing,” attorney Brickman said. “An investigation can be developed not only by internal investigation by case agents, but by ongoing cooperation by defendants.”\nFederal prosecutors have sought the records of former Atlanta mayor Kasim Reed’s city-issued credit card and recently demanded records of leave and payouts to members of his cabinet. ALYSSA POINTER/ALYSSA.POINTER@AJC.COM (The Atlanta Journal-Constitution)\nLatest round aimed at Reed’s inner circle\nAnother flurry of activity happened in the case in April, when prosecutors issued three subpoenas asking for financial records from deputy chief of staff Katrina Taylor Parks; documents related to Reed’s taxpayer-backed credit card; and city payments to Taylor Parks husband, DeAnthony Parks.\nThe request for Reed’s credit card statements came just days after the AJC and Channel 2 Action News reported on the former mayor’s lavish spending with the card, which included $150,000 in charges during 2017 on expensive restaurants, business-class airfare and top-rated hotels.\nRELATED CONTENT: EXPENSES\nEach subpoena is issued in the name of a grand jury, which meets monthly to hear evidence in the case.\n“Criminal federal grand juries are investigative devices. State grand juries are charging authorities,” Tate said. “So with federal grand juries, that can be a long and winding road going to a lot of different places.”\nFormer State Sen. Vincent Fort, who ran for mayor last year, said it was important that investigators do a thorough job of rooting out corruption at City Hall, but he regrets that the federal probe had shifted attention away from other important issues such as affordable housing, homelessness and public safety.\n“The focus (now) is not on those issues so much as it is on: ‘Who’s getting indicted next?’” Fort said. “That’s the feeling that I get. People are saying: ‘There’s more shoes to fall and those shoes are going to be big shoes.’”\nCity Council Member Andre Dickens said the investigation has hurt employee morale and jeopardized public trust in government. But it’s had at least one positive effect: empowering the city council to provide better oversight of tax dollars.\n“It gives us a chance to change the way things were being done,” he said. “People are looking to us now.”","url":"https://www.ajc.com/news/local-govt--politics/corruption-probe-atlanta-city-hall-shifts-from-bribes-spending/ISdvGJDKXmL0ijYku1uH3L/"}
