{"authors":[],"date_download":"2018-10-30 14:38:27","date_modify":"2018-10-30 14:38:27","date_publish":"2018-09-04 22:18:00","description":"Atlanta Mayor Keisha Lances Bottoms acknowledges difficult time, hopes opening the city's checkbook convinces public of her commitment to transparency","filename":"data/vaneerConsumption/AtlantaMayorBottomsputscityexpensesoninternetforpublicreview.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/09/04/Videos/4475905.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_atlanta-mayor-bottoms-_c306e56ac24717214c8fe8609d7bced0__1540910307.html","title":"Atlanta Mayor Bottoms puts city expenses on internet for public review","title_page":"Atlanta Mayor Bottoms puts city expenses on internet for public review","title_rss":"NULL","source_domain":"ajc.com","text":"Atlanta Mayor Keisha Lance Bottoms on Tuesday announced that she had put the city’s checkbook on the internet for all to see — an historic move that coincides with a painful time at City Hall.\nAt a press conference Tuesday, Bottoms and her senior staff demonstrated how they had made it possible to track individual expenditures by department, vendor, date and fund for the first time.\n>> LEARN MORE: Take a look at Atlanta’s new “Open Checkbook” website\nThe new administration’s “Open Checkbook” was formed under the pressure of a federal corruption investigation at City Hall; a state inquiry into possible criminal violations of the Georgia Open Records Act; and questions about Bottoms’ own spending.\nFor the first time in the City of Atlanta’s history, the public can now review individual city expenses on the internet. (Channel 2 Action News)\n“We received so many questions about our spending,” Bottoms said. “Rather than waiting for the public to ask, rather than waiting for the media to ask, we are now making it available to you.”\nThe data is limited to 18 months — January 1, 2017 to June 30 of this year. Payroll expenses weren’t included.\nAnd some expenditures appeared to be missing when cross-referenced with data sets previously obtained by The Atlanta Journal-Constitution this year.\nThe public couldn’t view Bottoms’ $7,088.50 bi-weekly pay check, or see that the city paid $5,000 to a nonprofit called Project Seraphim on Nov. 29, 2017.\nHowever, within an hour of the announcement at least one curious expense began circulating on Twitter: $2,500 for rush dry-cleaning of an Atlanta Falcons flag in February 2017 — paid for out of Hartsfield-Jackson International Airport funds.\n“The past several months have been a very difficult time in the life of the City of Atlanta,” Bottoms said. “The past eight months have really tested the patience of not just our employees, but also our residents. I sincerely hope that with ‘Open Checkbook,’ the public will be reminded of our administration’s commitment to transparency.”\n‘This is a start’\nAt her press conference, Bottoms did acknowledge that residents might experience some some kinks with the site.\n“I just want to remind people that this is a new portal for us,” she said. “I don’t want to set expectations of perfection.”\nShe said the portal would be updated quarterly and that the city would add financial data from prior years. “This is a start,” Bottoms said.\nRELATED CONTENT: PURCHASING CARD USE\nSara Henderson, executive director for the government watchdog group Common Cause Georgia, said she met with Bottoms’ staff a few months ago to review a demonstration of the portal. She called it a “definite move toward a more transparent Atlanta city government.”\nBut she said the portal does not address systemic problems at City Hall. For example, Henderson said she was still waiting for information she requested under the Georgia Open Records Act in January. She also said an independent office should handle those requests, not political appointees in the mayor’s press office.\n“I just think this is an example of sort of sidestepping the real problem that the City of Atlanta is facing with regards to ethics and transparency,” Henderson said.\n(CITY OF ATLANTA)\nBottoms’ announcement occurred during an uptick of activity in a federal corruption investigation at City Hall. Last month, Bottoms’ former Deputy Chief of Staff Katrina Taylor Parks — a holdover from the previous administration of Kasim Reed — pleaded guilty in federal court to accepting a bribe.\nBottoms said that although the federal investigation had added urgency to the effort to establish the portal, it was not the driving force behind it.\nDuring her campaign for mayor last year, Bottoms said she heard from many people interested in a more transparent government.\n“This is something that was talked about very early on in the administration,” she said.\n‘Not to look back’\nReed used his influence and fund-raising ability to help put Bottoms in the mayor’s office. However, during his eight years in office, the former mayor earned notoriety for holding onto information with an iron grip.\nAtlanta was one of five cities that earned an F grade in a 2013 report from the U.S. PIRG (Public Interest Research Group) Education Fund that rates 30 of America’s largest cities for making government data available online.\nIn June, Investigative Reporters & Editors, a national nonprofit that promotes investigative reporting, selected Atlanta for the ‘Golden Padlock Award” for actions that occurred under Reed’s administration that included “directing city staff to block records requests and for releasing false invoices that triggered a criminal investigation into alleged violations of Georgia’s Open Records Act.”\nReed also withheld from the public a federal grand jury subpoena showing that the federal investigation involved the mayor’s office and not just the Department of Procurement.\nFormer Atlanta Mayor Kasim Reed has been named in two subpoenas connected to the federal corruption investigation at Atlanta City Hall. (Photo: BOB ANDRES / BANDRES@AJC.COM) (bandres@ajc.com)\nSome have argued that if the document had been turned over in response to an open records request and made public, Bottoms may not have been elected.\nDuring her first few months in office, Bottoms sought to set new tone. She turned over the subpoena her predecessor withheld. Her administration worked to fulfill a backlog of open records requests.\nRELATED CONTENT: ETHICS QUESTIONS\nThe new mayor has sometimes stumbled, though. Her administration initially declined to turn over text messages between Bottoms and Atlanta Public Schools Superintendent Meria Carstarphen about talks to provide tax incentives to redevelop an area of downtown, only providing them after APS did.\nAnd Bottoms declined to turn over a copy of her calendar citing security concerns and arguing that the information was exempt under the Open Records Act.\nOver the past eight months, Bottoms has refused to comment on the culture created under Reed. That continued on Tuesday.\n“I am very careful,” she said, “not to look back.”","url":"https://www.ajc.com/news/atlanta-mayor-bottoms-puts-city-expenses-internet-for-public-review/NgyZUsQqf9e5YXxrha6YcL/"}
