{"authors":[],"date_download":"2018-10-30 20:26:34","date_modify":"2018-10-30 20:26:34","date_publish":"2015-10-30 14:21:48","description":"Work zone delays could be ghoulish on some stretches of metro Atlanta interstates this Halloween weekend, but rain forecast to arrive Saturday night could put a damper on road construction.","filename":"data/vaneerConsumption/AtlantaweekendGhoulishtrafficraindaylightsavingtime.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/10/30/Videos/4587263094001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_traffic_atlanta-weeken_7913ffc3cc69b43f22fa0fd1fe5e73e5__1540931194.html","title":"Atlanta weekend | Ghoulish traffic, rain, daylight saving time","title_page":"Atlanta weekend | Ghoulish traffic, rain, daylight saving time","title_rss":"NULL","source_domain":"ajc.com","text":"Work zone delays could be ghoulish on some stretches of metro Atlanta interstates this Halloween weekend, but rain forecast to arrive Saturday night could put a damper on road construction.\nHere’s where you can expect to find backups:\nExpress Lanes work could jam I-75 in Cobb County\nThe entrance ramp from the Canton Road Connector to I-75 southbound will be closed from 9 p.m. Friday until 5 a.m. Saturday for work on the Express Lanes project. The Georgia Department of Transportation said traffic trying to enter the southbound interstate will be directed to take I-75 northbound to Barrett Parkway, then left on Barrett Parkway to the southbound I-75 entrance ramp.\nAnother Express Lanes construction detour will require traffic traveling northbound on I-575 to exit the interstate at Towne Lake Parkway and reenter the interstate via the I-575 northbound entrance ramp from Towne Lake Parkway from 9 p.m. Friday through 5 a.m. Saturday.\nIn other Express Lanes closures, two southbound lanes of I-75 will be closed at Barrett Parkway from 9 p.m. Friday through 5 a.m. Saturday, and two southbound lanes will be closed between South Marietta Parkway and Delk Road during the same hours.\nWork on the South Metro Express Lanes will shut down one lane of I-75 southbound between Ga. 138 and Ga. 155 in Henry County from 9 p.m. Friday through 7 a.m. Saturday. Two northbound lanes of the same stretch of I-75 will be closed all weekend.\nOne lane of I-285 in each direction between Old National Highway and I-85 will be closed all weekend, while north of there, two northbound lanes of I-285 will be closed throughout the weekend between Camp Creek Parkway and Ga. 166, and two southbound lanes will be closed between South Cobb Drive and I-85.\nOn I-20, two westbound lanes will be closed all weekend between Hamilton E. Holmes Drive and Martin Luther King Jr. Drive, and two eastbound lanes will be shut down from I-285 to Martin Luther King Jr. Drive.\nAlso on I-20, one eastbound lane will be closed between Almon Road and U.S. 278 from 9 p.m. Friday through 5 a.m. Monday.\n» For updated traffic information, listen to News 95.5 and AM 750 WSB and follow @ajcwsbtraffic on Twitter.\nRain, Standard Time return\nChannel 2 meteorologist said clouds will thicken during the day on Saturday, and while most areas will be dry for Saturday night’s trick-or-treating, “we can’t rule out a few sprinkles” before the bulk of the rain moves in late Saturday night.\nThat rain will continue off-and-on through Sunday and into Monday, Minton said. She put the chance of rain at 70 percent Saturday night, 100 percent Sunday and 60 percent Monday.\nThere will be an extra hour of that rain as clocks are moved back an hour at 2 a.m. Sunday, the end of Daylight Saving Time.\nWeekend highs will be in the mid-60s, with morning lows around 50 early Saturday and 60 early Sunday.\n» Check the full forecast and track changes\nFalcons, Blue Angels and marching bands top weekend events\nMore than 40 high school marching bands from as far away as Texas, Maryland and Missouri will be at the Georgia Dome Friday and Saturday for the Bands of America Southeastern Regional Championships.\nOn Sunday afternoon, the Falcons host Tampa Bay at the Dome.\nNext door to the Dome, fans of “The Walking Dead” will converge on the Georgia World Congress Center Friday through Sunday for Walker Stalker Con.\nIn the same area, the Hawks play the Hornets Friday night at Philips Arena.\nKennesaw State’s football team plays Monmouth at home at 1 p.m. Saturday.\nSouth of Atlanta in Peachtree City, the U.S. Navy Blue Angels flight demonstration team performs Saturday and Sunday at the Great Georgia Air Show at Falcon Field.\n» Full list of weekend events","url":"https://www.ajc.com/news/traffic/atlanta-weekend-ghoulish-traffic-rain-daylight-saving-time/a94Abk3NuoHItLebDoceHK/"}
