{"authors":[],"date_download":"2018-10-30 18:17:03","date_modify":"2018-10-30 18:17:03","date_publish":"2015-06-24 04:00:00","description":"Anyone who’s ever doubted if rock ’n’ roll is an international language should check out “Don’t Think I’ve Forgotten: Cambodia’s Lost Rock and Roll,” a documentary that will be screened July 1 at the Plaza Theatre.","filename":"data/vaneerConsumption/AtlantasDusttoDigitallabelplugsinthepowerof.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/MyAJC/2015/06/24/Images/photos.medleyphoto.7488852.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_arts--theater_3ad3da8345a6aa51fb04f3613a33382f__1540923423.html","title":"Atlanta’s Dust-to-Digital label plugs in the power of...","title_page":"Atlanta’s Dust-to-Digital label plugs in the power of...","title_rss":"NULL","source_domain":"ajc.com","text":"Anyone who’s ever doubted if rock ’n’ roll is an international language should check out “Don’t Think I’ve Forgotten: Cambodia’s Lost Rock and Roll,” a documentary that will be screened July 1 at the Plaza Theatre.\nDirector John Pirozzi’s film chronicles Cambodia’s vibrant pop music scene of the 1950s and ’60s that was largely wiped out after the arrival of the Khmer Rouge in 1975.\nAtlanta’s Dust-to-Digital label, best known for its reissues of American roots and folk music, recently released the 20-song “Don’t Think I’ve Forgotten” soundtrack. Many of the tracks are available outside of Cambodia for the first time. The CD includes a 36-page booklet.\nAfter almost a century under French control, Cambodia became independent in 1953, and its emerging generations of musicians increasingly merged American, British, French and Latin influences with hypnotic Cambodian rhythms. The profusion of music that resulted ranged from the crooning of Sinn Sisamouth to the female rock vocals of Ros Serey Sothea to the surf guitar music of the band Baksey Cham Krong.\nThe musicians were silenced, and many killed, during the Khmer Rouge’s four-year reign.\n“We are just like everybody else,” Mol Kagnol, Baksey Cham Krong’s lead guitarist, now 69 and living in Arizona, told The New York Times. “We have electric guitars. We can jump, we can dance, we can be happy. The Khmer Rouge destroyed all of that.”\nReviewers have noted that the film is more celebration than commemoration. See for yourself at the 7 p.m. July 1 screening at the Plaza. $10. 1049 Ponce de Leon Ave. N.E., Atlanta. 404-873-1939, plazaatlanta.com.\nFILM\nOut on Film reveals first titles\nOut On Film has announced its first two titles for the 28th annual Atlanta LGBT film festival, Oct. 1-8 at Landmark’s Midtown Art Cinema:\n“Out to Win” is director Malcolm Ingram’s documentary examining of the experiences of gay and lesbian athletes including Martina Navratilova, former Atlanta Hawk Jason Collins, Billy Bean and Brittney Griner.\n“Addicted to Fresno” is a dark comedy starring Natasha Lyonne (“Orange Is the New Black”) and Judy Greer (“Tomorrowland”) as co-dependent sisters and hotel maids whose lives gets further complicated by their attempts to cover up an accidental crime.\nThe full fest schedule will be announced in late August. www.outonfilm.org.\nTHEATER\nOnstage Atlanta announces 2015-16 season\nOnstage Atlanta, the Decatur ensemble, has announced its 2015-16 schedule:\nOct. 23-Nov. 14: “A Murder is Announced,” the Agatha Christie mystery.\nNov. 27-Dec. 20: “The Great American Trailer Park Christmas Musical,” Atlanta premiere.\nDec. 3-13: “Merry Little Holiday Shorts 2015,” eight one-acts by local and national playwrights.\nFeb. 5-20, 2016: “Five Course Love,” a musical from Greg Coffin in which three actors play 15 characters in search of true love in five restaurants.\nMarch 4-26, 2016: “Prelude to a Kiss,” the Craig Lucas romantic comedy.\nJune 3-25, 2016: “Enchanted April,” Matthew Barber’s comedy about the renewing spell of Italy on four women.\nJuly 8-Aug. 13, 2016: “Dirty Rotten Scoundrels,” comic musical from David Yazbek and Jeffrey Lane about con-men scheming to bilk rich women on the French Riviera.\nTickets: $14-$25. 2969 E. Ponce de Leon Ave. Decatur. 404-897-1802, www.onstageatlanta.com.\nVISUAL ART\n‘Otherworldly’ landscapes in Highlands, N.C.\nThe Bascom: A Center for the Visual Arts in Highlands, N.C. (just over the Georgia line from the town of Dillard), recently opened “Lands Beyond: Otherworldly Landscapes and Visionary Topographies.”\nThe exhibit was curated by Tom Patterson, a long-time champion of Southeastern visionary and self-taught art whose author credits include “Howard Finster: Stranger from Another World.”\nOn view through Aug. 30, “Lands Beyond” mixes work by academically trained artists including Brian Mashburn and Scott Eagle with “autodidacts” (partly or fully self-taught artists) including William Fields and the late Anthony Dominguez.\n“The word ‘visionary’ doesn’t speak to an artist’s formal training or lack thereof,” Patterson has said. “ I don’t really care about the training issue, one way or another. It’s all about the art for me. And the artist.”\nThe show includes the topographically inspired work of former Atlantan George Lowe, the star voice of Cartoon Network’s “Space Ghost Coast to Coast” who now resides in Lakeland, Fla., and J.J. Cromer of southwest Virginia.\nWhile Lowe’s otherworldly drawings recall Aboriginal art (though with skylines and factories sometimes sketched in), Cromer said at the Bascom opening reception that he finds his inspiration closer to home. He noted that his works were inspired by the disconnect between topographical maps of his coal-rich home region vs. the reality of living in an area where the mining industry has altered the landscape, removing “poetically named creeks, peaks and hollers” and affecting day-to-day life.\nProviding a point of contrast is the Bascom’s major summer show of Hudson River School paintings, “Sublime Beauty: The American Landscape” (through Sept. 27).\n10 a.m.-5 p.m. Mondays-Saturdays, noon-5 p.m. Sundays. 323 Franklin Road, Highlands, N.C. 828-526-4949, www.thebascom.org.","url":"https://www.ajc.com/entertainment/arts--theater/atlanta-dust-digital-label-plugs-the-power-cambodian-rock/uDYfJYzKWaUDVb3RhHivON/"}
