{"authors":[],"date_download":"2018-10-30 18:58:18","date_modify":"2018-10-30 18:58:18","date_publish":"2015-08-21 20:24:51","description":"This is how big the film and TV industry is in Georgia: Since 2008, Atlanta has played backdrop to more than 140 films and TV shows (and counting), according to the Georgia Department of Economic Development.","filename":"data/vaneerConsumption/AtlantasexplosivefilmandTVgrowthbythenumbers.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_movies_atlant_f823578922996deb87bb5d21d43fbc7e__1540925898.html","title":"Atlanta’s explosive film and TV growth, by the numbers","title_page":"Atlanta’s explosive film and TV growth, by the numbers","title_rss":"NULL","source_domain":"ajc.com","text":"This is how big the film and TV industry is in Georgia:\nSince 2008, Atlanta has played backdrop to more than 140 films and TV shows (and counting), according to the Georgia Department of Economic Development.\nIn fiscal year 2015, production companies spent $1.7 billion on 248 projects, an increase from the $1.3 billion spent in fiscal year 2014 which was already a more than 500 percent increase from 2008.\nAnd in a Film L.A. survey of primary filming locations conducted last year, Georgia was the third U.S. state to top the list, coming in at No. 5 behind only California and New York and two international locations.\n\"It's really nice to be prepared to take advantage of the opportunities presented to you. You have to be ready,\" said Craig Miller, chair of the Georgia Film, Music and Digital Entertainment Advisory Commission. \"And now, Atlanta is ready.\"\nThe story of the exploding production industry is one about taxes and legislation and politicking.\nBut it's actually pretty simple, to hear some state officials tell it: In 2004, \"Ray,\" a biopic of the beloved Georgia musician starring Jamie Foxx, filmed in Louisiana — a deal usurped (an Atlanta production office had already opened) by that state's tax credits.\nThen, in 2008, came a real counter-offer: Georgia began offering 20 percent tax credits to productions with at least a $500,000 production budget. If producers showed the Georgia logo at the end of the credits, the state would up its offer to 30 percent.\nPrograms like Georgia's are not new, and they're not without controversy. Any money divvied out in tax credits is revenue the state is sacrificing, and critics say there may not be an even return. Critics charge that the credits, which have faced fraud allegations elsewhere, amount to a too-pricey giveaway in the state, returning mostly low-wage local jobs.\nThey argue that the industry's explosive growth is directly tied to the credits themselves, and would end just as quickly if the program did.\n\"Whatever sacrifice we make in revenue on the tax credit, we more than make up for through the multiplier effect of economic development,\" Gov. Nathan Deal said in 2013.\nThe state did recently claim the production spending in fiscal year 2015 amounted a $6 billion economic impact. The AJC's Politifact team rated this as \"half true\": Georgia's economic multiplier was far too high, experts said, though more realistic production spending still added up to a $3.1 billion economic impact for the year.\nForty-two movies filmed throughout Georgia in July, Miller said. The state is attractive for its diversity, he said. Productions can find coastlines, leafy neighborhoods, farmland and a sprawl of skyscrapers and interstates, all reachable within hours. \"X Men: First Class\" actually filmed one of its final scenes, set in Cuba, on Jekyll Island.\nPlus: Atlanta has a giant airport.\nOn one recent day, for example, Hartsfield-Jackson had 27 flights departing to Los Angeles. Delta alone offered 8 flights to the nation's movie capital.\nIn Miller's eyes, this type of transportation is invaluable.\n\"Big players in the movie industry need to get back to L.A. quickly,\" he said. \"Nobody else can offer the amount of direct transportation that Atlanta can.\"\nThe city is the star of the state's boom, attracting high-profile projects such as \"The Walking Dead,\" the Marvel films, and \"The Hunger Games\" franchise.\nThe city's Office of Entertainment estimates that 75 percent of filming takes place in the city, meaning it keeps 75 percent of the 77,900 jobs and $3.8 billion in wages the Motion Picture Association of America (MPAA) attributes to the new business.\nAtlanta's historic Swan House, which is one of the most visible local landmarks used on screen (throughout the \"Hunger Games\" films) never used to receive requests for filming — and now gets them two or three times a month.\n\"Flight,\" starring Denzel Washington, was reportedly written for Oklahoma and then relocated to Georgia.\nAs Lee Thomas, deputy commissioner of Georgia Department of Economic Development, previously told the AJC: \"It’s funny because now no matter what the script says, they'll say, 'We'll make it work.' \"\nClick here for an immersive, interactive look at filming locations around Atlanta","url":"https://www.ajc.com/entertainment/movies/atlanta-explosive-film-and-growth-the-numbers/vJ5qcYzqz37YQDcRxOY48L/"}
