{"authors":[],"date_download":"2018-10-30 18:07:17","date_modify":"2018-10-30 18:07:17","date_publish":"2018-07-27 10:25:00","description":"Best things to do in Atlanta this weekend, including the Atlanta Ice Cream Festival at Piedmont Park, a tribute to Whitney Houston at Symphony Hall, Singer Michael McDonald concert at Atlanta Botanical Gardens, movies at Fox Theatre, Great Southern Beer Fest in Atlanta","filename":"data/vaneerConsumption/AtlantaIceCreamFestival.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/24/Images/PHOTO%20Whitney%20Belinda%20White%20Dress%20Arms%20Angle%20with%20Credit%20Steve%20Draper.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_things-atlanta-w_c1adb3e3aadb5b9a02166b394d084263__1540922837.html","title":"Atlanta Ice Cream Festival","title_page":"Events this weekend in Atlanta: Atlanta Ice Cream Festival","title_rss":"NULL","source_domain":"ajc.com","text":"THE GREATEST LOVE OF ALL: A TRIBUTE STARRING BELINDA DAVIDS\nSouth African singer Belinda Davids gives a powerful musical tribute to her idol, Whitney Houston in “The Greatest Love of All: A Tribute Starring Belinda Davids,” on July 27 at Symphony Hall at the Woodruff Arts Center.\nThe show, which been on tour for six years, honors the music and memory of Houston, who died Feb. 11, 2012 in Los Angeles. Davids is accompanied by a live band, background vocalists and dancers, plus state-of-the-art sound, lighting, vision and theatrical effects.\nIn addition to her solo career, Davids has worked with The Temptations, Keri Hilson, Keyshia Cole, Monica and Johnny Gil.\nThe Greatest Love of All: A Tribute Starring Belinda Davids. 7:30 p.m. July 27. $29-$49. Symphony Hall at the Woodruff Arts Center, 1280 Peachtree St. N.E. 404-733-5000. www.woodruffcenter.org\nRELATED: Bobby Brown to receive proclamation for Bobbi Kristina Serenity House\nMICHAEL MCDONALD\nMusic lovers can chill under the stars at the Atlanta Botanical Garden and listen to the soulful vocals of Grammy-winning singer Michael McDonald.\nMcDonald will perform during “Concerts in the Garden” at 8 p.m. July 27.\nThe former Doobie Brothers frontman, is touring to promote the release of “Wide Open,” his first album of original music in 17 years.\nMichael McDonald plays a solo show at Symphony Hall on Oct. 13, 2013. Photo: (Danny Clinch) (Danny Clinch)\nMichael McDonald in concert, 8 p.m. July 27, $51.50-$53.50, Atlanta Botanical Garden. 1345 Piedmont Ave. 404-876-5859. www.concertsinthegarden.org\nRELATED: More top concerts in Atlanta this weekend\nFELTON EADDY’S POETRY KITCHEN\nFelton Eaddy, the Atlanta-based author of three books of poetry, will be at the Hammonds House Museum on July 27.\nMore: Before you go, check out the weather forecast\nLovers of the word can come out for an evening of poetry with poets from throughout the community. Other poets will join him.\nFelton Eaddy’s Poetry Kitchen. 8:30 p.m. July 27. free for museum members. $5 for non-members. Hammonds House, 503 Peeples St. S.W. 404-612-0481 www.hammondshouse.org\nATLANTA ICE CREAM FESTIVAL\nSummer heat may make this one of the coolest events to attend in Atlanta this weekend.\nWho screams for ice cream?\nHere’s the scoop: The 8th annual Atlanta Ice Cream Festival will be held at Piedmont Park on July 28.\nRelated: The Best Ice Cream in Atlanta\nVisitors can enjoy local ice cream, gelato, games and activities for the whole family, including an ice cream eating contest for children. There will also be free wellness screenings.\nAtlanta Ice cream festival. 11 a.m.-6 p.m. July 28. Free. Piedmont Park, close to Charles Allen Drive. www.atlantaicecreamfestival.com\nMore: Listen to our latest podcast with the Dream’s Angel McCoughtry\nLEGENDS OF HIP HOP\nJuvenile, Scarface, Too Short, DJ Quik, 8ball & MJG, Project Pat, Pastor Troy and others will headline the “Legends of Hip Hop” concert at Wolf Creek Amphitheater onJuly 28.\nThe outdoor venue in south Fulton County offers tables, reserved seating and lawn seating.\nLegends of Hip Hop 6:30 p.m. July 28. $54-$104. Wolf Creek Amphitheater, 3025 Merk Rd. S.W. 404-443-5000. www.wolfcreekamphitheater.com\nWALK THE BELTLINE\nHere’s how you can get your walk on and learn a bit of history.\nHistorian and curator, Karcheik Sims-Alvarado, presents an outdoor photography exhibit on the Atlanta Beltline’s Eastside and Westside trails that focuses on city’s contribution to the civil rights movement .\nRelated: Beltline visitors can exercise and learn about civil rights history\nIt stretches across four miles on the Beltline; making it perhaps the longest public photography exhibition on civil and human rights in the United States.\nThe exhibit of black and white photographs runs through Dec. 1.\nOpen-air exhibit based on book “Images of America: Atlanta and the Civil Rights Movement, 1944-1968.” free. Runs through Dec. 1. Eastside and Westside trails of the Atlanta Beltline. beltline.org\n>> Sunday: How to watch Chipper Jones of the Atlanta Braves enter the Baseball Hall of Fame\n>> Sunday: Atlanta Falcons to hold public practice Sunday at Mercedes-Benz Stadium\nLooking Ahead August 5, 2018: Southern Wing Showdown in Atlanta\nAlso on the calendar\nBB&T Atlanta Open Tennis at Atlantic Station\nFood Truck Friday in Duluth\nGreat Southern Beer Fest at John Howell Park Atlanta\nMovies at the Fox Theatre: Saturday AM Cartoons, Marvel Studio’s Iron Man\nButterfly Encounter in Roswell at Chattahoochee Nature Center\n>> MORE Things to do this weekend in Atlanta\nMarietta and Cobb County calendar\nDeKalb County calendar\nRoswell and North Fulton calendar\nGwinnett County calendar","url":"https://www.ajc.com/lifestyles/things-atlanta-whitney-houston-tribute-michael-mcdonald-and-all-the-ice-cream-you-can-eat/XXH1Mj96HyjiRExgS3AggO/"}
