{"authors":[],"date_download":"2018-10-30 20:38:22","date_modify":"2018-10-30 20:38:22","date_publish":"2014-08-21 21:46:55","description":"An Atlanta man was sentenced to life plus 10 years in prison for a 2013 New Year’s Day killing.","filename":"data/vaneerConsumption/AtlantamangetslifesentenceforNewYearsDaykilling.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_atlanta-man-gets-life-sentence-for-new-year-day-killing__1540931902.html","title":"Atlanta man gets life sentence for New Year’s Day killing","title_page":"Atlanta man gets life sentence for New Year’s Day killing","title_rss":"NULL","source_domain":"ajc.com","text":"An Atlanta man was sentenced to life plus 10 years in prison for a 2013 New Year’s Day killing.\nRonnie “Bo” Clay was convicted of murder, felony murder, aggravated assault and weapons charges Wednesday in connection with the death of 18-year-old Jared Billings, according to a news release from Fulton County District Attorney Paul L. Howard Jr.\nWitnesses to the shooting at a home on Epworth Street said tensions between Clay and Billings were high the night before. Clay, who witnesses said was drunk and high on New Year’s Eve, pointed a gun at Billings’ face several times during the night, according to the release. Billings got a knife from the kitchen and demanded that Clay leave the house.\nThe two got into an argument the next day, and at some point during the disagreement, Clay pulled a gun and shot Billings in the chest, according to the release. Clay fled the scene, but not before firing three more shots in Billings’ direction.\nAfter his arrest, Clay told authorities he shot Billings in self-defense because he was being robbed at knife point. It took a Fulton County jury less the 15 minutes to return multiple guilty verdicts.","url":"https://www.ajc.com/news/atlanta-man-gets-life-sentence-for-new-year-day-killing/WfKvWh23D6YzotXvKUrRcO/"}
