{"authors":[],"date_download":"2018-10-30 18:01:39","date_modify":"2018-10-30 18:01:39","date_publish":"2018-09-10 16:44:00","description":"In a proactive move made based on Hurricane Florence’s path, the Atlanta Humane Society has taken in 35 dogs and cats from South Carolina.","filename":"data/vaneerConsumption/AtlantasheltertakesinSouthCarolinadogscats.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/09/10/Videos/4479987.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_hurricane-floren_7523f4e2892a6a4ca5f58a5b11b05c3c__1540922499.html","title":"Atlanta shelter takes in South Carolina dogs, cats","title_page":"Hurricane Florence: Atlanta shelter takes in South Carolina dogs, cats","title_rss":"NULL","source_domain":"ajc.com","text":"Some of the 35 dogs and cats the Atlanta Humane Society took in from South Carolina Monday ahead of Hurricane Florence are now up for adoption.\nSeven cats were taken to the West Midtown location, and nine dogs are at the Alpharetta location. The status of the other 19 animals was not announced; they may still be awaiting medical evaluation.\nThe animals were previously available for adoption at shelters in South Carolina, a spokeswoman with the Atlanta organization confirmed. They were moved in an effort to ensure their safety, and because those shelters may need the space for animals who become lost or displaced during or after the storm.\nThis happened before the latest projections began to show Hurricane Florence shifting slightly to the south, putting parts of Georgia at risk for heavy rain and possible flooding. Gov. Nathan Deal declared a state of emergency for all of Georgia on Wednesday.\nWhen the storm began to form, the organization’s Animal Emergency Services team contacted its partner shelters to see how they could help. Last year, the Atlanta Humane Society helped take in nearly 1,000 shelter animals from hurricane ravaged areas.\nAnother shelter working to protect animals is the American Humane Rescue team. The organization picked up 76 cats and kittens from shelters in South Carolina and drove them more than 800 miles to shelters in New York and Connecticut.\n“The animals are part of the first wave of rescues in advance of what is predicted to be a potentially catastrophic storm,” a Wednesday press release said.\nState parks are also welcoming some evacuees, pets and “equestrians,” the Georgia Department of Natural Resources website says.\nREAD | Twice as many coyotes killed in state’s 2nd hunting contest\nREAD | Cobb woman strives to help abused animals in the Amazon\nLike Intown Atlanta News Now on Facebook | Follow us on Twitter","url":"https://www.ajc.com/news/local/hurricane-florence-atlanta-shelter-takes-south-carolina-dogs-cats/2ibvbQU0Qb1uOzqYT6OQFJ/"}
