{"authors":[],"date_download":"2018-10-30 18:44:06","date_modify":"2018-10-30 18:44:06","date_publish":"2018-07-12 19:29:00","description":"The Atlanta Board of Education will hold three public hearings on a proposal to drop the millage rate from 21.74 mills to 20.74 mills.","filename":"data/vaneerConsumption/AtlantaPublicSchoolsschedules3publichearingsontaxrate.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/06/27/Videos/4426051.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_aps-schedules-public-hearings-tax-rate__1540925046.html","title":"Atlanta Public Schools schedules 3 public hearings on tax rate","title_page":"Atlanta school board to hold tax rate hearings on July 16 and July 23","title_rss":"NULL","source_domain":"ajc.com","text":"The Atlanta school board scheduled three public hearings to listen to residents’ opinions before adopting a property tax rate, a process homeowners are watching closely because of soaring Fulton County property values that have led to higher estimated tax bills.\nThe public hearings will take place at 11 a.m. and 6 p.m. July 16 and at 6 p.m. July 23. All meetings will be held at the Atlanta Public Schools headquarters, 130 Trinity Ave. SW. The board is expected to vote on the millage rate July 23.\nThe school board is considering a proposal to decrease the millage rate from the current 21.74 mills to 20.74 mills. Though the proposed rate would be lower, the rate is technically an 8.23 percent increase in property taxes because the district is not planning to drop the rate all the way to 19.163 mills, the level that would completely offset growth caused by reassessments.\nThe proposed 1.577 mill increase over the rollback rate would cost the owner of a home with a fair market value of $300,000 about $142, according to a legal notice published by the district.\nFulton County officials froze property values last year at 2016 levels. This year, about a third of Atlanta homeowners could see a 50 percent increase in property values, according to preliminary estimates.\nThis year’s tax digest reflects increases that “address years of inaccurate assessments in Fulton County,” according to an APS news release.\nAPS said adopting a tax rate of 20.74 mills would allow the district to put about $11.7 million into its fund balance as well as pay for employee salary increases and cover rising mandatory costs, such as health care and pensions.","url":"https://www.ajc.com/news/local-education/aps-schedules-public-hearings-tax-rate/A4818LeixNIsRQesL83e6K/"}
