{"authors":[],"date_download":"2018-10-30 18:39:28","date_modify":"2018-10-30 18:39:28","date_publish":"2018-08-31 20:39:00","description":"Climbing construction costs will add an estimated $19.35M to Atlanta Public Schools' building projects, but tax revenue is also higher.","filename":"data/vaneerConsumption/AtlantaPublicSchoolsseesbuildingprojectcostsrise.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/06/27/Videos/4426051.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_cost-a_5e731fab95ba8001247c45ed9213586c__1540924768.html","title":"Atlanta Public Schools sees building project costs rise","title_page":"Atlanta Public Schools sees building project costs rise","title_rss":"NULL","source_domain":"ajc.com","text":"Because of rising construction costs, Atlanta Public Schools could spend $19.35 million more than first estimated to complete eight projects paid for with sales-tax money.\nDistrict officials presented the higher prices for seven school renovations and a new transportation center to the school board Thursday. The new, combined estimate of $122.35 million is 18.8 percent more than the district initially planned to complete the projects, funding for which comes from a one-cent Special Purpose Local Option Sales Tax, or SPLOST, approved by voters in 2016.\n﻿>> PHOTOS: Take a look inside MLK’s old school, David T. Howard Elementary\n﻿Construction costs have gone up about 4.5 percent year over year, instead of the 1.5 percent the district planned for, said Larry Hoskins, who supervises APS operations.\nWhen school board members asked why the district’s estimate was so inaccurate, Hoskins said they didn’t know what was to come when they made the projections. He cited a booming Atlanta construction market and labor shortage as part of the reason for the greater-than-expected inflation.\n“No matter how much their estimates were off, we have a problem … in the future, for the next SPLOST, I think we need to talk about escalation in a much more detailed way and get more projections,” Superintendent Meria Carstarphen told the board.\nBut there’s good news for APS, too.\nOfficials said the district is collecting more revenue that it initially projected it would receive from the sales tax, about $6 million more so far. Voters authorized the collection of up to $546 million, but APS anticipated receiving 85 percent of that amount. As of June, the collection rate is about 91 percent.\nIf that pace keeps up, the district expects to have enough to cover the climbing costs of projects in the spending plan and possibly add a few, unless inflation soars wildly.\n“We believe with the way collections are going you’ll cover it and have a little bit left over,” Carstarphen said.\nRenovation of the David T. Howard Building, shown here in 2015, into a new middle school is one of the APS construction projects that were not affected by the inflation that has raised the cost of some others. The district has already locked in a contract for the Howard renovation. BOB ANDRES / BANDRES@AJC.COM (The Atlanta Journal-Constitution)\nThe remaining eight projects include two elementary school renovations — Humphries and Hutchinson— now in the design phase with construction scheduled to begin next year. There are also five school overhauls slated to start in several years: Grady High School, Barack and Michelle Obama Academy and West Manor, Morningside and Toomer elementaries — plus a transportation center.\nThe rising inflation did not affect the first eight construction projects in the SPLOST plan for which the district has already secured contracts and where work is underway or nearing completion. Those include an $8 million athletic complex to open in early October at the former site of Walden Middle School and a $52 million renovation of Martin Luther King Jr.’s childhood school, the David T. Howard Building. It will open as a new middle school in 2020.\nThe board also is considering what to do if the SPLOST ends up generating more money than needed to cover inflation as well as the reallocation of $9.15 million that had been set aside for infrastructure work at two currently unused school buildings.\nOne suggestion has garnered strong board support: Spending $2.4 million more on a building renovation for the future Harper-Archer Elementary School, to be created by merging two schools. The district already plans to spend $9.2 million for mostly interior work, but Carstarphen said more money would pay for an exterior face-lift and a more secure entrance when the school opens next year.\nOther projects on a list for the board to consider funding include $2.5 million to reopen the pool at Hollis Innovation Academy, $3 million to demolish dilapidated buildings, $50,000 for a replica plane to hang in the foyer of what will be a new building to house Tuskegee Airmen Global Academy, $2.3 million to redo the Harper-Archer planetarium, $7 million for a gym and cafeteria addition at Forrest Hill Academy, $530,000 for hardwood floors at the Howard school, $7.58 million for a college and career academy, and funding for a new arts-focused high school.\nSeveral board members said they’re willing to consider additional projects, if money allows, but the priority must be to finish the ones already in the spending plan.\n“I want to make sure that we complete what we already committed to with the SPLOST,” said Erika Mitchell, who represents west Atlanta. “We just really need to see that through.”","url":"https://www.ajc.com/news/local-education/cost-atlanta-public-schools-building-projects-tops-estimates/EVt3iHnd1R5tuREvOME3GM/"}
