{"authors":[],"date_download":"2018-10-30 20:50:03","date_modify":"2018-10-30 20:50:03","date_publish":"2018-09-14 10:00:00","description":"AJC columnist Bill Torpy on why a proposed deal to develop downtown Atlanta's \"Gulch\" is a giveaway to the developer that takes away from taxpayers.","filename":"data/vaneerConsumption/AtlantaGulchproposalAgiveawaytothedeveloper.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/09/10/Videos/4480210.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_torpy-large-atlanta-gulch-giveaway-real-gulper__1540932603.html","title":"Atlanta Gulch proposal: A giveaway to the developer","title_page":"Atlanta Gulch proposal: A giveaway to the developer | Torpy","title_rss":"NULL","source_domain":"ajc.com","text":"Recently, I wrote about the Georgia Aquarium getting a $7.5 million tax break from the city to build a large addition to house sharks.\nI called it the Affordable Housing Program for Big, Scary Fish.\nBut you want scary? Forget the sharks and come to Atlanta’s City Hall to watch the massive tax giveaway being heaped upon a Los Angeles company owned by the brother of the billionaire who owns the Atlanta Hawks, who earlier got his own $142.5 million deal to fix up their arena.\nThis past week, City Council members tried to wrap their minds around a 600-page document that spelled out in obtuse, legalese fashion how the firm, CIM Group, would get up to $1.75 billion in tax money (that’s with a “B”) to fill up downtown’s Gulch with all sorts of new development.\nThe developers would build $3.5 billion to $5 billion of cool stuff down in the Gulch, the 40 acres of railroad lines and weedy parking lots on the west side of downtown where Falcons fans like to drink beer.\nThat means, if Team CIM builds out its entire $5 billion dream of apartments, office towers and retail space, then taxpayers will have paid 35 percent of the bill. And CIM will own all of it, including most of the new streets.\nNow, I get it. Building there will be expensive, and no one through the decades has taken the initiative to fill in the Gulch, even though it’s right there downtown. The developers will have to construct streets on stilts and build around active train lines, which means people in the apartments and offices should get used to some rumble in their lives.\nThe vote is being pushed by Mayor Keisha Lance Bottoms, who’s trying to play finisher to her predecessor, Kasim Reed, who started cooking up the deal back when he was Big Cheese.\nMayor KLB came to a City Council committee meeting on Tuesday to ask council members to move the deal along so the full council could vote on it. Council members, who are showing more independence (aka backbone) than they demonstrated under Hizzoner, demurred.\nThat independence might be because almost half the council members are new and don’t realize their role is to act like potted plants. Or it might be that Mayor KLB is operating in a world where federal investigators are still fumigating City Hall and there’s just not a lot of communal trust to be found.\nThe Gulch in Atlanta on Sept. 27, 2017. The site is a possible location for Amazon’s second headquarters should the company choose Atlanta as the host city. (CASEY SYKES / AJC FILE)\nOn Thursday, a table full of lawyers and finance guys in suits explained the joys of giving $1.75 billion (again, with a “B”) to a private developer.\nThe biggest chunk would come from the state, which will postpone getting its share of sales tax raised on the property over the next 30 years. That would be an estimated $1 billion based on the 4 cents of state sales tax. Atlanta and other cities in Fulton County would give up a penny of local sales tax — or $250 million.\nAnd then there would be a Tax Allocation District (TAD) on the property, meaning property taxes generated in the upcoming decades would go to building infrastructure there, not to funding schools or cops or fixing streets elsewhere.\nThe boosters argue this is not a giveaway because there is very little tax being raised on the property now.\nAlvin Kendall (center, front), outside lawyer for the city of Atlanta in the Gulch deal, and Peter Andrews (left), lawyer with Greenberg Traurig, outside lawyer for city, were on the panel presenting to the Atlanta City Council on Thursday, Sept. 13, 2018. council. Council members attended a committee work session to study the Gulch deal. (BOB ANDRES /BANDRES@AJC.COM)\n“There’s nothing there today, so we’re not really giving anything away,” said lawyer Peter Andrews, one of the suits at the table. “There’s zero there now.”\nThe boosters said the project will give the city $28 million to build affordable housing (on top of a promise that up to 30 percent of the units built in the Gulch will be affordable). Also, they will throw in a new fire station and millions of dollars more to help train for jobs.\nEveryone likes jobs, and the paperwork handed out by boosters said the plan would create “in excess of 18,500 construction jobs” spread out over the years as the project is built.\nSounds great. My brother raised five kids with a construction job.\nBut prodded by new Councilman Amir Farokhi, Andrews backed off from the exuberance listed on the handout, saying it would be more like 1,500 to 1,800 construction jobs each year.\nAtlanta City Council members, including Amir Farokhi, attended a committee work session to study the Gulch deal on Thursday, Sept. 13, 2018. Atlanta Mayor Keisha Lance Bottoms faces a big test with a pending vote to approve a massive public subsidy to redevelop downtown’s Gulch. (BOB ANDRES /BANDRES@AJC.COM)\n“It feels like an inflated number,” Farokhi said. “That’s where we lose a little trust.”\nAndrews responded that the project would add up to 35,000 permanent jobs.\n“But that’s just a projection,” Farokhi countered. “Let’s say there’s a market crash in six years …”\nDoes anyone remember the big hole that sat in the middle of Buckhead a decade ago after the Great Recession?\nThe Gulch is said to be in the offing to house the zillion-dollar Amazon HQ2 headquarters, although the CIM folks say they are going forward with or without them.\nCouncilwoman Jennifer Ide asked about what incentives might be given to bringing companies or headquarters to that site, given that the city and state would already be locked in on the subsidies deal with CIM.\n“It doesn’t make any sense to give tax abatements in TADs,” she said.\nHmmm. A tax abatement wrapped in a TAD and smothered with deductions and subsidies: Atlanta tax attorneys reading that sentence will no doubt be brought to a state of arousal.\nNo, there wouldn’t be a TAD and a tax abatement given on the same land, Ide was told.\nThey’d just have to dream up some other incentives. And I have full faith in our leaders that they’d do it.\nA rendering from developer CIM Group shows a new plaza within the redeveloped Gulch. (CIM GROUP)\nThis week, former Invest Atlanta board member Julian Bene told me the Gulch would pull away office space, retail stores and apartments that otherwise would be built elsewhere in the city, in places where they might bring in more taxes. In essence, the Gulch deal might cannibalize development from elsewhere.\n“You’re going to have buildings built somewhere,” he said. “Are they going to be built somewhere taxable or somewhere not taxable?”\nAfter I ran my shark story, Bene told me, “The Gulch subsidy is 266 times as outrageous as the aquarium’s.”\nActually, he was going on figures that the Gulch subsidy would be $2 billion. So, with the subsidy at $1.75 billion, the outrageousness factor is more like 233.\nGotta be precise here.","url":"https://www.ajc.com/news/local/torpy-large-atlanta-gulch-giveaway-real-gulper/Mb6Q4K7DRf69VzB7TTzTZL/"}
