{"authors":[],"date_download":"2018-10-30 20:46:16","date_modify":"2018-10-30 20:46:16","date_publish":"2014-05-03 13:45:42","description":"A missing 3-year-old girl who was the subject of a Levi’s Call was found this evening in good health, an Atlanta police spokesman said.","filename":"data/vaneerConsumption/AtlantapoliceMissing3yearoldgirlfoundingoodhealth.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/05/03/Videos/3532250161001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_atlanta-police-missing-year-old-girl-found-good-health__1540932376.html","title":"Atlanta police: Missing 3-year-old girl found in ‘good health’","title_page":"Atlanta police: Missing 3-year-old girl found in ‘good health’","title_rss":"NULL","source_domain":"ajc.com","text":"A missing 3-year-old girl who was the subject of a Levi’s Call was found this evening in good health, an Atlanta police spokesman said.\nIt is not clear where Azaria Grace Iwangou was found. No details were immediately available.\nAzaria was last seen about 12:30 a.m. Saturday in the 2300 block of Donald Lee Hollowell Parkway, Atlanta police Officer John Chafee said. She was wearing a white and blue dress, black tights, a pink and gray sweatshirt and clear sandals. She is approximately 2-foot-6 and weighs about 35 pounds. She has black hair with braids and brown eyes.\nThe girl and her mother were walking with an acquaintance to a home when the mother fell behind and the man continued with the child, Chafee said. The man’s name is Anthony and he is also known as Ant. He is between 5-foot-7 and 5-foot-9 and has an afro. He lives in the Donald Lee Hollowell Parkway and Hollywood Road area, but his last name and address are unknown.\nConcerned for the welfare of the child, Atlanta police this afternoon requested tracking dogs to assist in the search for Azaria. And this evening, the Georgia Bureau of Investigation activated a Levi’s Call, Georgia’s Amber Alert, for the girl. That Levi’s Call was canceled just before 6:45 p.m. Saturday.\nAs a precaution, Azaria will be evaluated by medical personnel, Chafee said.","url":"https://www.ajc.com/news/atlanta-police-missing-year-old-girl-found-good-health/cVbjdRmbX54ctaVGJrw0OM/"}
