{"authors":["Ariel Zilber For Dailymail.Com"],"date_download":"2018-10-22 22:52:01","date_modify":"2018-10-22 22:52:01","date_publish":"2017-03-16 04:46:38","description":"A five-year-old girl who survived a mauling by three pit bulls that killed her friend in Atlanta in January is home after eight surgeries, her grandmother said Wednesday.","filename":"data/vaneerConsumption/Atlantagirlinjuredinpitbullmaulingsenthome.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/05/3E51EE7800000578-0-image-a-2_1489640934810.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318836_Girl-seriously-hurt-pit-bull-mauling-home-hospital_1540248721.html","title":"Atlanta girl injured in pit bull mauling sent home","title_page":"Atlanta girl injured in pit bull mauling sent home | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A five-year-old girl who survived a mauling by a pit bull that killed her friend in Atlanta this past January is home after undergoing eight surgeries.\nSyrai Sanders is now home and recovering from the attack, her grandmother told Atlanta Journal-Constitution on Wednesday.\n'She's doing awesome,' said Sabrina Williams.\n'She's got her same spirit.'\nLogan Braatz, 6, and his classmate, Sanders, were jumped by three pit bulls who attacked them on their way to school.\nSyrai Sanders (above) is now home and recovering from the attack by three pit bulls that left her seriously injured on January 17\nTragic attack: Logan Braatz, 6 (left), died and Sanders, 5 (right), suffered serious injuries after three pit bulls attacked them in Atlanta\nBraatz was mauled to death as he walked to F.L. Stanton Elementary School in southwest Atlanta.\nSanders was also attacked and taken to hospital, but she survived.\nSeveral school students who were with them at the time tried to pull the animals off the pair.\nCulprit: Police officers shot one of the animals and had two others removed. One of the dogs is seen sitting outside a home near the scene\nOne of the dogs was shot by officers and the other two were taken away by animal control officers.\nThe owner of the pit bulls, Cameron Tucker, was arrested on two misdemeanor counts of reckless conduct.\nNeighbor Shamonte Clayton says he awoke to the sound of screams. He ran outside, saw one pit bull standing over Syrai and eventually chased the dog away with his gun.\nHe then noticed Braatz's body lying on a patch of grass and picked him up as his mother sobbed nearby.\nAnother neighbor, Angie Smith, described the moment she saw little Syrai get mauled.\nA pit bull is pictured in a cage being taken away from the scene by animal control officers\nOwner charged: The owner of the pit bulls, Cameron Tucker (pictured above), was arrested on two misdemeanor counts of reckless conduct\nThe attack took place in the area of Cerro Street as the children were walking to elementary school\n'The dog just ripped into her,' she recounted. 'I ran to the baby and when I looked down at her I knew there was nothing that I could do,' she told WSB-TV.\nLogan was taken to Grady Memorial Hospital, where he later succumbed to his injuries.\nSyrai was transported to the Children's Healthcare of Atlanta at Egleston, where she was listed in stable condition.\nPolice say three other children witnessed the grisly dog attack and valiantly tried to help their friends who were being mauled by pulling the pit bulls off of them.\nA crisis team was dispatched to Stanton to provide grief counseling for students and staff.\nWilliams said that Sanders will likely need more surgeries.\nShe said that the family waited until just before she left the hospital to tell her that her friend, Logan, had died.\n'She misses him, playing with him and talking to him,' Williams said.","url":"https://www.dailymail.co.uk/news/article-4318836/Girl-seriously-hurt-pit-bull-mauling-home-hospital.html"}
