{"authors":[],"date_download":"2018-10-30 18:42:21","date_modify":"2018-10-30 18:42:21","date_publish":"2018-07-16 18:02:00","description":"The Atlanta school board is considering a 1-mill property tax reduction and is holding three public hearings to gather input before voting July 23.","filename":"data/vaneerConsumption/AtlantataxpayersaskAPSformoretaxrelief.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/06/27/Videos/4426051.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_reside_5b526f56655608c59794daaa599808da__1540924941.html","title":"Atlanta taxpayers ask APS for more tax relief","title_page":"Atlanta taxpayers ask APS for more tax relief","title_rss":"NULL","source_domain":"ajc.com","text":"Property tax payers told the Atlanta school board Monday that the district’s proposed one-mill rate reduction doesn’t do enough to help homeowners who will struggle to pay higher tax bills.\nThe call for tax relief came during two public hearings Monday that the Atlanta Board of Education is required to hold before it sets a millage rate, currently at 21.74 mills.\nThe third and final public hearing is scheduled for 6 p.m. July 23, after which the board is scheduled to vote to adopt a tax rate.\nAbout two dozen people attended the first of three Atlanta school board property tax hearings on Monday, July 16. Residents who spoke asked the school board to lower the property tax millage by more than the proposed one-mill reduction. VANESSA McCRAY/AJC\nAPS administrators have advised the board to lower the property tax rate to 20.74. Though that proposal is one mill lower than the current rate, it reflects an 8.23 percent increase in property taxes. The rate needed to fully offset increases because of reevaluations and reassessments would be 19.163 mills.\n“A one-mill reduction in the millage rate for me or any of those people who have to sell their homes in the Old Fourth Ward in order to survive really is not going to help them at all. And I know you all don’t do the assessing, but you all have an opportunity to help longtime citizens of Atlanta to get by a little easier by doing something special, and if it means cutting fat out of the budget then so be it,” resident Bobby Lichtenstein told board members.\nThe proposed 1.577 mill increase over the rollback rate would cost the owner of a home with a fair market value of $300,000 about $142, according to the district.\nHomeowners are bracing for higher tax bills after Fulton County property assessments soared this year. Last year, Fulton County officials froze values at 2016 levels, but this year many homeowners are seeing significant jumps.\nAbout two dozen people attended the Monday morning APS hearing, and seven speakers addressed the board. Five of the nine school board members were present.\nPatricia Lawson encouraged the school board members “to do more.” She cited the burden that higher tax bills will place on families with limited wage increases and on retired homeowners.\n“I do know that increasing property taxes to increase the budget at the risk of homeowners losing their homes is not the answer,” Colleen O’Rourke told board members.\nAtlanta Public Schools has yet to set a millage rate. BOB ANDRES /BANDRES@AJC.COM (Bob Andres/bandres@ajc.com)\nAbout 15 people, three of whom spoke, and eight board members attended the later meeting Monday.\nTwo residents residents at the evening meeting asked the school board to support tax relief measures to help senior citizens so that older residents on a fixed income could continue to live in their neighborhoods.\nA third resident, Cita Cook, said her views about the importance of funding public education may put her in the minority.\n“I think our society has lost the understanding of what it means to have public services, and that public education is a responsibility,” she said.\nThe district estimates that with a 1-mill tax cut, its local tax revenue -- most of which comes from Fulton County -- would increase to $607.1 million from last year’s budgeted $545.5 million. If APS were to maintain the current millage rate and not lower it at all, the district estimates local tax revenue would increase this year to $634.9 million.\nThe school district has said that dropping the tax rate to 20.74 mills would allow it to put about $11.7 million into its fund balance as well as pay for salary increases and rising mandatory costs while also helping homeowners.\nVoters in November will have a chance to increase the base homestead exemption on the Atlanta schools portion of their tax bills. Residents currently receive a base homestead exemption that exempts them from school taxes on their first $30,000 of assessed value.\nThe proposal would boost that exemption from $30,000 to $50,000, but all homeowners would have to pay taxes on the first $10,000 in value. If approved, the exemption would decrease next year’s tax bills and expire in three years.","url":"https://www.ajc.com/news/local-education/residents-ask-aps-lower-property-tax-rate-more-than-mill-proposal/XhOkLHf4TjNoinmFBcpHeM/"}
