{"authors":[],"date_download":"2018-10-30 17:55:45","date_modify":"2018-10-30 17:55:45","date_publish":"2015-08-10 21:32:59","description":"The Atlanta airport will start screening workers at a new security checkpoint in the domestic terminal at the end of this month, a move prompted by a gun-smuggling scheme uncovered late last year.","filename":"data/vaneerConsumption/Atlantaairporttolaunchemployeescreening.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_hartsfield-jackson-launch-employee-screening__1540922145.html","title":"Atlanta airport to launch employee screening","title_page":"Atlanta airport to launch employee screening","title_rss":"NULL","source_domain":"ajc.com","text":"The Atlanta airport will start screening workers at a new security checkpoint in the domestic terminal at the end of this month, a move prompted by a gun-smuggling scheme uncovered late last year.\nThe new three-lane checkpoint, recently built on the mezzanine level below the main terminal level for passengers, will screen airport workers with badges to access secure areas.\nEmployees of the airport’s biggest operator, Delta Air Lines, won’t use the checkpoint. The airline says it will continue spot checks at employee shuttle lots and plans more extensive screening in the future. The industry has expressed concern about the cost and effectiveness of screening all airport workers, and about the potential for causing delays.\nMiguel Southwell, general manager at Hartsfield-Jackson International, said he does not expect the new screening to cause backups that would delay employees’ arrival at their jobs to work flights.\nBut the airport is doing a soft launch of the checkpoint Aug. 31 to work out kinks before requiring workers to use it starting in early September.\n“We’re hoping it’s a 3- to 5-minute process” for workers, Southwell said.\nCurrently, certain airport workers do not have to pass through security checkpoints before entering secure areas.\nThat changes with the new checkpoint, which will be paid for by the airport and staffed by security contract workers, rather than Transportation Security Administration screeners. The checkpoint will use metal detectors, X-ray and explosive trace detection machines to screen workers for prohibited items.\nThe airport is adding $5.5 million to a security contract with HSS Inc. to staff employee inspection areas and vehicle inspection locations and to handle the employee screening.\nAbout 40,000 workers at Hartsfield-Jackson — mainly airline employees — work in secure areas, Southwell said.\nLast December, two men with ties to Delta repeatedly evaded airport security to transport guns from Atlanta to New York. In the scheme, a baggage handler who had not been screened handed carry-on bags full of guns to a former Delta employee who boarded flights after going through regular security for passengers.\nThe airport has already been inspecting some workers’ bags at other employee entrances, and will continue to do so. Concessions workers will still be screened through a TSA checkpoint.\nFlight crews already use an expedited screening process. Some others will be exempt from going through employee screening, including emergency responders.\nBecause of the connectedness of the aviation system, the Atlanta airport’s new system won’t close all gaps. For example, workers in the vast majority of airports around the country are not fully screened. That means workers elsewhere have access to planes and passengers that fly to Atlanta.\nThe discovery of the gun smuggling ring at Hartsfield-Jackson triggered creation of a federal review of airport access control. A working group in its final report earlier this year said random screening would be more cost-effective than screening of all employees.\nThe group recommended TSA increase random employee screening, strengthen employee vetting and tighten access restrictions for airport ID holders. The TSA said it has implemented several of the recommendations and is working on others.\nA Hartsfield-Jackson representative served on the panel, along with representatives of airlines.\nAtlanta airport officials say full screening is the right choice for Hartsfield-Jackson.","url":"https://www.ajc.com/business/hartsfield-jackson-launch-employee-screening/hUhOI69oksElTD4NEYMaBL/"}
