{"authors":[],"date_download":"2018-10-30 14:30:03","date_modify":"2018-10-30 14:30:03","date_publish":"2017-02-14 16:52:00","description":"Asset liquidation company Schneider Industries has been hired to sell pieces of the Atlanta Falcons' Georgia Dome before its demolition in late 2017.","filename":"data/vaneerConsumption/AtlantaFalconsstadiumseatsforsale.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/MyAJC/2017/02/14/Images/newsEngin.17768355_012317-falcons-photos-CC52.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_how-the-geo_6a41bbba89b84f33a15dcdc097132fe4__1540909803.html","title":"Atlanta Falcons stadium seats for sale","title_page":"Georgia Dome liquidation: Atlanta Falcons stadium seats for sale","title_rss":"NULL","source_domain":"ajc.com","text":"The company hired to liquidate the contents of the soon-to-be-demolished Georgia Dome once auctioned off a urinal from the St. Louis Cardinals’ clubhouse to a baseball fan for about $2,500.\n“So don’t be surprised,” Schneider Industries chief operating officer Dan Rosenthal said with a laugh, if the company tries to sell a Dome urinal or two to Falcons fans.\nThe St. Louis-based company has been hired to sell various pieces of the Dome that aren’t slated for reuse in the new Mercedes-Benz Stadium or elsewhere on the Georgia World Congress Center campus: seats, lockers, signs, pieces of artificial turf, furniture from the suites, you name it.\nSchneider Industries, an asset liquidation company, has a history of selling contents of abandoned stadiums. Its previous sports projects, Rosenthal said, include Busch Memorial Stadium in St. Louis, Texas Stadium outside Dallas, Tiger Stadium in Detroit and Candlestick Park in San Francisco.\nThe final event in the 25-year-old Georgia Dome is a Monster Jam trucks show March 5. Salvage operations are scheduled to begin immediately after that, with interior demolition to begin in May and implosion to occur in the summer — likely before the first scheduled event next door in Mercedes-Benz stadium, an Atlanta United soccer match on July 30.\nThe first step in Schneider Industries’ work at the Dome is the sale of the stadium’s red and black seats, which already are available for online orders at www.georgiadomesale.com. The seats cost $599 for a connected set of two, including stand-up brackets, shipping to the customer by April 15 and a certificate of authenticity.\nRosenthal pitches the seats as an opportunity for fans “to keep Dome memories alive,” perhaps in a home theater or a memorabilia collection.\nFalcons season-ticket holders can order their exact seats.\nRosenthal had no prediction of how many seats fans will purchase, acknowledging the cost means “not everybody can afford to buy a pair of seats.” Aside from sales to fans as keepsakes, he expects seats also to be sold in bulk to high schools and colleges.\n“Our goal here,” he said, “is to sell a lot of seats and keep them out of the landfills.\n“I got a message today from a school looking to get 500. They’re not going to be used as memorabilia, such as the pairs we’re selling to the general public, but just as seats in a stadium.”\nThe seat sales start a four-prong program Schneider Industries has for the Dome.\nThe second prong is “selling what we call salvage equipment used on the industrial side of things — the boilers, the chillers, the restaurant equipment, the furniture from the suites and lounge areas,” Rosenthal said. Such items likely will be sold to companies by sealed bids, he said.\nThe third prong, he said, will be an online auction of “high-end memorabilia,” such as lockers used by Falcons players or a large piece of turf “that a fan might want to put into his man cave so next year he’s sitting on turf that the Falcons won the NFC championship on.” A date for the auction hasn’t been set, but “we’re hoping early April.”\nAnd finally, Rosenthal said plans are being made for a “fanfest”-style garage sale outside the Dome, probably in late April, to sell smaller pieces of memorabilia, such as pictures, signs and miscellaneous locker-room items.\nSchneider Industries’ business extends beyond sports.\n“Stadiums don’t close that often, so I couldn’t make a living just selling stadiums,” Rosenthal said. “Our day-to-day business is … we help companies sell their surplus equipment. If Anheuser-Busch is getting new equipment, we help them sell the old equipment.”\nAt the Georgia Dome, he said workers will begin extracting seats and other items immediately after the final event there March 5.\n“We’ll throw a few hundred men in there and get stuff out of there and into a warehouse and packaged up,” he said.\nThe cost of demolishing the Dome is included in Mercedes-Benz Stadium’s $1.5 billion construction budget. Net proceeds from items salvaged from the Dome will go toward the cost of the new stadium.","url":"https://www.ajc.com/sports/football/how-the-georgia-dome-will-emptied-and-liquidated/k7iyR6lknLWzavXwZlZphP/"}
