{"authors":[],"date_download":"2018-10-30 14:29:09","date_modify":"2018-10-30 14:29:09","date_publish":"2017-02-06 00:00:00","description":"A number of Atlanta Falcons become free agents at the end of the 2016 season. Among the names are Jonathan Babineaux, Matt Schaub, Eric Weems and Dwight Fr","filename":"data/vaneerConsumption/AtlantaFalconsfreeagentsin2017.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/06/Images/babineaux.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_atlanta-falcons-free-agents-2017__1540909749.html","title":"Atlanta Falcons’ free agents in 2017","title_page":"Atlanta Falcons roster: Which players are free agents in 2017","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 17\nCurtis Compton / ccompton@ajc.co Jonathan Babineaux (95), defensive tackle -- A second-round draft pick in 2005, Babineaux has spent 12 seasons in Atlanta. He has recorded 394 tackles -- 14 in 2016 -- and 27.0 tackes and 23 pass defended for 4 interceptions in his career.\n2 / 17\nScott Cunningham/Getty Images Dwight Freeney (93), defensive end -- The Falcons signed Freeney -- a 15-year veteran with stops at the Colts, Chargers and Cardinals -- in 2016. Freeney, 36, appeared in 15 games, including 3 postseason games, recording 8 tackles and 4.0 sacks.\n3 / 17\nCurtis Compton / ccompton@ajc.com Jacob Tamme (83), tight end -- Tamme joined the Falcons in 2015 after seven seasons with the Broncos and Colts. In two seasons in Atlanta, he had 81 catches for 867 yards and 4 touchdowns. He played in just eight games this year and went on injured reserve following a shoulder injury.\n4 / 17\nEric Gay/AP Chris Chester (65), offensive lineman -- Chester has made 143 regular-season starts, including all games the past two years with Atlanta. The 34-year-old completed his 11th season in the NFL.\n5 / 17\nDavid Barnes/AJC Patrick DiMarco (42), fullback -- DiMarco joined the Falcons in the 2013 season. A two-time Pro Bowl selection, DiMarco has 37 receptions for 273 yards and four touchdowns in four season. He's had only one carry in his entire time with the Falcons.\n6 / 17\nKevin C. Cox/Getty Images Sean Weatherspoon (56), linebacker -- Weatherspoon was a first-round pick by the Falcons in 2010. He rejoined the Falcons in 2016 after one season with the Cardinals. He played in four games this year, recording 27 tackles before an injury sidelined him for the remainder of the season.\n7 / 17\nCurtis Compton/ccompton@ajc.com Matt Schaub (8), quarterback -- A third-round pick by the Falcons in 2004, Schaub rejoined the Falcons in 2016 as Matt Ryan's backup following stints with the Texans, Raiders and Ravens. He appeared in just four games completing 1-of-3 passes for 16 yards. He has thrown for about 25,000 yards and 133 touchdowns over 13 seasons in the NFL.\n8 / 17\nCurtis Compton/ccompton@ajc.com Philip Wheeler (41), linebacker -- Wheeler, a third-round pick by Indianapolis in the 2008 draft out of Georgia Tech, spent his first full season in Atlanta in 2016 following stints at San Francisco, Miami, Oakland and Indy. He made four starts this season and had 57 tackles and 1 sack over two years in Atlanta.\n9 / 17\nCurtis Compton/ccompton@ajc.com Levine Toilolo (80), tight end -- Toilolo was drafted by the Falcons in the fourth round of the 2013 NFL draft. He made 11 starts this season, finishing with 13 receptions for 264 yards and 2 touchdowns.\n10 / 17\nCurtis Compton/ccompton@ajc.com Courtney Upshaw (91), linebacker -- Upshaw was a 2-round pick by Baltimore in 2012. He joined the Falcons in 2016, logging 15 tackles and 1.5 sacks -- which include his sack of New England’s Tom Brady in the Super Bowl.\n11 / 17\nJeff Gross/Getty Images Paul Worrilow (55), linebacker -- The Falcons added Worrilow as an undrafted free agent in 2013. He made 44 starts with Atlanta, recording 244 tackles, 4.0 sacks and 2 interceptions. He had just 14 tackles this season.\n12 / 17\nKevin C. Cox/Getty Images Eric Weems (14), wide receiver -- Signed as an undrafted free agent in 2007, Weems is in the second of two stints with Atlanta. He spent two seasons with the Chicago Bears before returning to Atlanta in the 2015 season. Used primarily on special teams, Weems returned 24 punts for 273 yards and 17 kick offs for 391 yards.\n13 / 17\nCurtis Compton / ccompton@ajc.com LaRoy Reynolds (53), linebacker -- Reynolds joined the Falcons in 2016 after four seasons with the Jaguars and Bears. He had his best year, making 30 tackles and three game starts.\n14 / 17\nHyosub Shin/hshin@ajc.com Alrick Robinson (19), wide receiver -- Robinson, signed following the 2015 season, was drafted by Washington in the sixth-round in 2011. He made one start, catching 20 passes of 323 yards and 2 touchdowns this season.\n15 / 17\nEric Gay/AP Tom Compton (76), offensive lineman -- Compton, who was signed by the Falcons in 2016, appeared in all 16 regular season and 3 postseason games. He had spent the four previous seasons in Washington.\n16 / 17\nDavid J. Phillip/AP Dashon Goldson (38), defensive back -- Goldson was signed after rookie safety Keanu Neal was sidelined by an injury. He played in just 4 games, recording 1 tackle.\n17 / 17","url":"https://www.ajc.com/sports/football/atlanta-falcons-free-agents-2017/8pTQHL7FyIfL1OSYstFthO/"}
