{"authors":[],"date_download":"2018-10-30 19:30:26","date_modify":"2018-10-30 19:30:26","date_publish":"2017-04-11 22:17:00","description":"Atlanta United celebrated Tuesday the opening of its training ground, a $60 million complex in Marietta","filename":"data/vaneerConsumption/AtlantaUnitedopensMariettacentersaysMercedesBenzontime.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/05/12/Images/preview.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_a_ebf748e1ce59aeda77be0c99fa34255a__1540927826.html","title":"Atlanta United opens Marietta center, says Mercedes-Benz on time","title_page":"Atlanta United opens Marietta center, says Mercedes-Benz on time","title_rss":"NULL","source_domain":"ajc.com","text":"Atlanta United celebrated Tuesday the opening of its training ground, a $60 million complex in Marietta that includes the team headquarters and six pristine pitches. But the MLS expansion team couldn’t escape questions about its other home: Mercedes-Benz stadium.\nIn 2014, the Atlanta United became Major League Soccer's 22nd franchise, beginning play in 2017.\nTeam owner Arthur Blank and president Darren Eales insisted everything is on schedule for the new $1.5 billion stadium to open “late summer” despite reports of a delay caused by problems with the retractable roof. The stadium is scheduled to open with Atlanta United hosting Orlando City on July 30.\n“If and when we have different information then we’ll look at contingency plans,” Eales said.\nAtlanta United soccer players workout that the new state-of-the-art facility, the Children’s Healthcare of Atlanta Training Ground, after the ground breaking ceremony in Marietta GA Tuesday 11, 2017. STEVE SCHAEFER / SPECIAL TO THE AJC (The Atlanta Journal-Constitution)\nBlank acknowledged that timing was tight in the final weeks, saying the roof was a “complex” element to construct.\nTheir comments came after MLS Commissioner Don Garber said during his welcome speech that he looked forward to watching the team play at the new stadium in September. Eales called it a “slip of the tongue.”\nAtlanta United played its inaugural game on March 5 to a sold out crowd at Georgia Tech’s Bobby Dodd stadium, its temporary home while the new stadium is completed. The team lost that game against the New York Red Bulls, but won at Minnesota United FC a week later and against Chicago Fire at home on March 18. It has drawn more than 100,000 fans to its two home games. Its next home game will be April 30 against D.C. United.\nThe training facility will host the first team, as well as Atlanta United’s academy teams.\nThe opening was attended by local Marietta officials, community leaders and organized fan clubs.\nIt marks a dramatic turnaround for the Franklin Gateway community, which has been targeted by aggressive redevelopment efforts that saw the city buy and raze five low-rent apartment buildings using a $68 million redevelopment bond issuance. The redeveloped land was leased to Atlanta United for its facility.\nAtlanta United Owner and Chairman Arthur Blank announced that the state-of-the-art facility, will be call the Children’s Healthcare of Atlanta Training Ground at the ground breaking of the facility in Marietta GA Tuesday 11, 2017. STEVE SCHAEFER / SPECIAL TO THE AJC (The Atlanta Journal-Constitution)\nMayor Steve Tumlin said he looked forward to a positive economic impact from the team’s base.\n“We’re in love with our soccer team but we also love the halo they’re doing for this part of Marietta,” he said.\nLast week, city council voted to buy another 7 acres on Franklin Gateway for $5.8 million using funds from the same bond issuance.\nLocal residents are excited about the opportunities Atlanta United brings. However, some have voiced concerns about displacement as rents rise.\nLaura Keefe, executive director of Lead Youth Empowerment through Learning, Leading, and Serving (YELLS), a nonprofit located nextdoor, said the team brought the kids to the first game and have doanted equipment.\n“It’s really helping to make our youth and our families excited that next door is a team that actually cares about the community,” she said.\nMYAJC.COM: REAL JOURNALISM. REAL LOCAL IMPACT.\nThe AJC's Meris Lutz keeps you updated on the latest happenings in Cobb County government and politics. You'll find more on myAJC.com, including these stories:\nNever miss a minute of what's happening in Cobb politics. Subscribe to myAJC.com.","url":"https://www.ajc.com/news/local-govt--politics/atlanta-united-opens-marietta-center-anticipates-mercedes-benz-play/6sn6rmmkzAbuqPf25c102K/"}
