{"authors":["Melissa Ruggieri"],"date_download":"2018-10-30 18:05:55","date_modify":"2018-10-30 18:05:55","date_publish":"2018-07-26 13:30:00","description":"Atlanta Concerts this week: AJC editor's picks, including Keith Urban With Kelsea Ballerini at Verizon Amphitheatre, Pentatonix at Chastain Park, and OAR at Coca-Cola Roxy Theatre. Has it really been 21 years since the Maryland quintet released their debut, “The Wanderer”?","filename":"data/vaneerConsumption/AtlantaConcertsthisweekKeithUrbanPentatonix.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/25/Images/Keith%20Urban.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_music_atlanta-concerts-this-week-keith-urban-pentatonix__1540922755.html","title":"Atlanta Concerts this week: Keith Urban, Pentatonix","title_page":"Atlanta Concerts this week: Keith Urban, Pentatonix","title_rss":"NULL","source_domain":"ajc.com","text":"FRIDAY\nWeezer and Pixies\nIn June, the two alt-indie-rock bands embarked on their first-ever joint tour. The seven-week run complements the October release of Weezer’s 11th studio album, “Pacific Daydream.” The Pixies’ set will last about 75 minutes and feature the band playing “anything they want.”\nWith Sleigh Bells. 7:30 p.m. July 27. $25-$150. Cellairis Amphitheatre at Lakewood, 2002 Lakewood Way, Atlanta. 1-800-745-3000, www.ticketmaster.com.\nRELATED: Tickets on sale this week in Atlanta\nRELATED: More things to do this weekend in Atlanta\nBowzer’s Rock ‘n’ Roll Party\nJon “Bowzer” Bauman of Sha Na Na fame will lead this nostalgic romp, as well as perform with his group, The Stingrays. In an interview with The Atlanta Journal-Constitution earlier this week, the Brooklyn native said fans can expect familiar vocals – especially from Jay Siegel, who sings The Tokens’ “The Lion Sleeps Tonight” in the same key and with the same falsetto as the classic 1961 version.\nWith Jay Siegel’s Tokens, Shirley Alston Reeves (original lead singer of The Shirelles), Freddy “Boom Boom” Cannon, Bowzer & The Stingrays and Johnny Contardo (formerly of Sha Na Na). 7:30 p.m. Friday. July 27 $35-$65. Cobb Energy Performing Arts Centre, 2800 Cobb Galleria Parkway, Atlanta. 1-800-745-3000, www.ticketmaster.com.\nMichael McDonald\nThe molasses-voiced singer is back on the road to support “Wide Open,” his first album of original material in 17 years; it features guest shots from Warren Haynes, Marcus Miller and Branford Marsalis, among others. McDonald, who will forever be known as a key voice of The Doobie Brothers, also recently collaborated with Kenny Loggins and bassist Thundercat for the song, “Show You the Way.”\n8 p.m. July 27. $53.50 (members $51.50). Atlanta Botanical Garden, 1345 Piedmont Ave. NE, Atlanta. 404-876-5859, atlantabg.org.\nSATURDAY\nYes\nIt’s getting confusing trying to identify which version of Yes is performing at any given time, because both iterations are touring to celebrate the band’s 50th anniversary. This one features longtime guitarist Steve Howe, drummer Alan White, keyboardist Geoff Downes, bassist Billy Sherwood and singer Jon Davidson. It’s also the final date of the tour.\n7:30 p.m. July 28. $39.50-$69.50. Atlanta Symphony Hall, 1280 Peachtree St. NE, Atlanta. 1-800-745-3000, www.ticketmaster.com.\nSUNDAY\nKeith Urban\nThe affable Aussie is earning laudatory reviews for his summer run, with everything from his slick stage design to his ace guitar playing to his willingness to schlep to the lawn seats to perform being hailed. Urban’s current album, “Graffiti U,” features the hit “Coming Home” with pop songstress Julia Michaels.\nWith Kelsea Ballerini. 7:30 p.m. July 29. $58.75-$143.75. Verizon Amphitheatre at Encore Park, 2200 Encore Parkway, Alpharetta. 1-800-745-3000, www.ticketmaster.com.\nPanic! At the Disco\nNow that frontman Brendan Urie has completed his stint on Broadway (where he portrayed Charlie Price in “Kinky Boots”), he can return to playing sold-out arenas in support of the band’s new album, “Pray for the Wicked,” which debuted at No. 1 on the Billboard 200 album chart. The Las Vegas-formed synth-rock band also returned to radio with the hits “High Hopes” and “Say Amen (Saturday Night).”\nWith Arizona & Hayley Kiyoko. 7 p.m. July 29. $30.75-$70.75. Infinite Energy Arena 6400 Sugarloaf Parkway, Duluth. 770-626-2464, www.infiniteenergycenter.com/\nEchosmith will open for Pentatonix at Chastain.\nTUESDAY\nPentatonix\nIt will be a slightly different look for the Grammy-winning quintet as singer Matt Sallee replaces founding member Avi Kaplan, who departed the group last year. The ever-popular a cappella artists released “PTX Presents: Top Pop, Vol. 1,” in April, which launched with their specialized take on Camila Cabello’s “Havana.”\nWith Echosmith and Calum Scott. 8 p.m. July 31. $61.50-$121.50. State Bank Amphitheatre at Chastain Park, 4469 Stella Drive NW, Atlanta. 1-800-745-3000, www.ticketmaster.com.\nWEDNESDAY\nO.A.R\nHas it really been 21 years since the Maryland quintet released their debut, “The Wanderer”? In the ensuing years, the band broke into the mainstream with earnest pop-rockers “Shattered (Turn the Car Around),” “Peace” and “I Go Through.” A new single, “Just Like Paradise,” prefaced their summer tour.\nWith Matt Nathanson. 7 p.m. Aug. 1. $40-$53. Coca-Cola Roxy Theatre, 800 Battery Ave. SE, Atlanta. 1-800-745-3000, livenation.com.","url":"https://www.ajc.com/blog/music/atlanta-concerts-this-week-keith-urban-pentatonix/zTsmBDZn1MyYA3N9pS7EoM/"}
