{"authors":[],"date_download":"2018-10-30 01:22:31","date_modify":"2018-10-30 01:22:31","date_publish":"2018-07-26 16:20:00","description":"Atlanta's job growth solid in first half of year.","filename":"data/vaneerConsumption/AtlantaaddsjobsinJunebuttradeaworry.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/26/Images/newsEngin.22612424_ups1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_atlanta-adds-jobs-june-but-trade-worry__1540862551.html","title":"Atlanta adds jobs in June, but trade a worry","title_page":"Summer starts with higher unemployment in Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"Metro Atlanta added 8,900 jobs last month, the strongest growth of any June since 2000, according to the Georgia Department of Labor.\nSince June of last year, the metro area economy has added 49,000 jobs – not as robust as the four previous years, but still the lion’s share of the jobs added in the state.\nVIDEO: In other business news\n5 Signs You're Underpaid 1. Your company's website has a similar job listing with higher pay Searching your company's job listings can give you an idea of whether or not you should be paid more. Use this to your advantage as leverage. 2. Your company's revenue is skyrocketing, but your income hasn't budged If your company is booming and you aren't getting a piece of the pie, you should definitely argue for a raise. 3. You make less than your colleagues, even though you have similar ed\nThe unemployment rate rose from 3.4 percent in May to 4.0 percent, but that much-quoted statistic can often be deceptive. In this case, that increase was the result of a labor force that grew faster than hiring.\nIn fact, in every single June for the past 25 years the jobless rate has gone up.\n“The Georgia job market is very strong,” said Mark Butler, Georgia commissioner of labor. “An uptick in the unemployment rate is common this time of year due to an increase in high school and college graduates entering the workforce.”\nThe region is also among the top destinations for footloose Americans.\nThe current unemployment rate is still the lowest June rate since 2001, when the rate was 3.6 percent. The unemployment rate in June of last year was 4.8 percent.\nAtlanta-based Linq3 is one example of a growing company, having expanded from 38 to 48 employees in the past year, according to Mark Smith, the company’s chief marketing officer.\nLinq3, which supplies technology to the Georgia Lottery, moved its headquarters from New York to Atlanta because of this area’s “ecosystem” of financial technology firms, he said.\n“There’s also a level of technology talent that’s unmatched by most other cities, which is vital to our recruiting efforts,” Smith said. “We’re planning to hire 25 more employees in Atlanta by the end of 2018 and most of these hires will be for technology and product development positions.”\nMost signs signal a growing, vibrant economy. For example, the number of new jobless claims – an indication of layoffs – was down 13 percent last month from the pace of a year ago.\nThe strongest sectors for hiring were hospitality, construction and logistics.\nHospitality hiring – restaurants, bars, hotels – is a sign that consumers have money to spend, either in their own cities or as tourists. Construction jobs have been booming along with corporate expansions and the need for apartments and condos.\nLogistics, however, may be the most sensitive to global factors, since the huge sector handles the goods that are shipped, warehoused, sold and delivered as part of commerce. Experts worry that, if the current fight over tariffs escalates into a full-blown trade war, it could damage that sector, but there is no sign of that yet.","url":"https://www.ajc.com/business/atlanta-adds-jobs-june-but-trade-worry/b3EsbgEBhayS03kAonNFVP/"}
