{"authors":[],"date_download":"2018-10-30 14:32:20","date_modify":"2018-10-30 14:32:20","date_publish":"2018-09-06 18:23:00","description":"Mayor Keisha Lance Bottoms and city leaders held a ceremonial groundbreaking Thursday for the Westside Park at Bellwood Quarry.","filename":"data/vaneerConsumption/AtlantabreaksgroundonmassivenewparkoncitysWestside.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/01/02/Videos/4286780.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_a_eab5deb8685c987d3ce3afd05ecbfd7b__1540909940.html","title":"Atlanta breaks ground on massive new park on city's Westside","title_page":"Atlanta breaks ground on massive new park on city's Westside","title_rss":"NULL","source_domain":"ajc.com","text":"It’s a lush forest five miles northwest of City Hall and in many ways, it’s a world away from the concrete jungle of downtown Atlanta.\nAnd on Thursday, after more than a decade of planning, city leaders held a ceremonial groundbreaking for the Westside Park at Bellwood Quarry, a sprawling tract that will become the city’s largest park.\nMayor Keisha Lance Bottoms and others hailed the park as a new attraction for the city that will also become an economic engine for long-forgotten neighborhoods west of Georgia Tech.\n“No longer will you have to watch ‘The Walking Dead’ to see the beauty of the quarry,” Bottoms said of the site, which has become a popular filming destination for the zombie thriller and other shows, including “Stranger Things.” “If you’ve ever been on a plane and you’ve flown over and said, ‘Where is that?’ Now you can come here and enjoy it.”\nAtlanta Mayor Keisha Lance-Bottoms (center), Atlanta Parks and Recreation commissioner Amy Phuong (third from left) and Atlanta Department of Watershed Management Commissioner Kishia Powell (third from right) are joined by members of the Atlanta City Council, Atlanta Beltline Inc. and the Atlanta Beltline Partnership as they break ground for the new Westside Park at the Bellwood Quarry in Atlanta, Thursday, September 6, 2018. The park, planned for years as both a recreational center and reservoir for drinking water, has been seen as a potential catalyst for redevelopment of the city’s northwest side. (ALYSSA POINTER/ALYSSA.POINTER@AJC.COM) (The Atlanta Journal-Constitution)\nThe promised 280-acre Westside Park has been a driver for new development on the city’s Westside, a historically industrial area surrounded by generally lower income neighborhoods, that has seen a rush of real estate speculation since the Great Recession. The rise in development has stoked fears by residents of potential displacement from rising prices.\nThe $26.5 million first phase of the park will include a new gateway entrance to the property along Johnson Road as well as new lighting, and pedestrian and bicycle improvements.\nBottoms said “this park is designed to be inclusive at every level,” and touted its future connections to the Beltline and Proctor Creek Greenway. She also said it will continue to attract new development along with new affordable housing.\nSouth of the Bellwood Quarry, former Atlanta Brave Mark Teixeira and partners have proposed Quarry Yards, a project that in its first $400 million phase could include 850 residences, a 300-room hotel, retail, restaurants and more than a half-million square feet of high-end office space. The partners said earlier this year they are committed to the city’s 15 percent requirement for affordable rental housing for residents at 80 percent of the area median income.\nHousing experts say the region is in need of new housing at lower income levels.\nCloaked behind warehouses\nAlong Perry Boulevard, new subdivisions with homes priced at more than $400,000 have sprouted, and developers have eyed nearby warehouses for new development.\nCity Councilman Dustin Hillis, who represents the area, said city agencies will continue to work together to strike a balance “to guide our development and ensuring no one is left out as we develop more on the Westside and the Proctor Creek Watershed.”\nToday, the quarry is cloaked behind warehouses and a curtain of pines, hardwoods and kudzu.\nAmy Phuong, the city’s commissioner of parks and recreation, said the first phase of the park is expected to open to the public in 2019 or 2020.\n“What we’ve heard loud and clear from the community is: ‘Don’t build us a manicured park that you see in some other cities. Build us something we can enjoy and explore on our own and have great pockets with spaces that allow that exploration,’ ” Phuong said.\nA rendering shows office buildings at the proposed Quarry Yards development near the future Westside Park at Bellwood Quarry in Atlanta. (The Atlanta Journal-Constitution)\nThe park will surround a new reservoir in the quarry that is currently under construction. The reservoir project, which will connect the quarry via a tunnel to the Chattahoochee River, is a $350 million investment expected to create a 30-day drinking water reserve for the city upon its completion.\nA giant boring machine, dubbed “Driller Mike,” a play on the name of Atlanta rapper Killer Mike, has drilled more than 4 miles underground toward the Chattahoochee River, Atlanta Watershed Commissioner Kishia Powell said.\nThe reservoir will one day hold 2.4 billion gallons of water, Powell said, helping to make the city more resilient to the threat of drought as the region is expected to grow from 5.5 million to 8 million people through 2040.\n“If the city of Atlanta went without water for just one day, we estimate there would be an [economic] impact of $250 million,” Powell said. “Water is life and no one can live without it.”\nA 150-foot buffer will surround the reservoir to protect the drinking water supply, officials said.\nThe city and philanthropic partners acquired the quarry land during the term of former Mayor Shirley Franklin, and plans for the park were unveiled in December at the end of former Mayor Kasim Reed’s second term.\nBottoms thanked her predecessor for his administration’s work on the reservoir and to prepare to break ground for the park.\nAtlanta Mayor Keisha Lance Bottoms greets individuals following the ground breaking ceremony for the new Westside Park at the Bellwood Quarry in Atlanta, Thursday, September 6, 2018. The park, planned for years as both a recreational center and reservoir for drinking water, has been seen as a potential catalyst for redevelopment of the city’s northwest side. (ALYSSA POINTER/ALYSSA.POINTER@AJC.COM) (The Atlanta Journal-Constitution)\nCouncilman Michael Julian Bond noted the arch of the site’s history.\nHe said in the mid-1990s, residents surrounding the quarry were angered at the noise from explosions and trucks and the constant dust from mining.\nBy the early 2000s, Bond said he helped fight plans to turn the land into a massive garbage transfer station.\n“What if they had succeeded in their plan?” he said. “Would we be able to enjoy the natural beauty of this site?”\n“On a clear day,” Bond said, “you can see all of Peachtree Ridge, everything from Summerhill to Tower Place. There’s no place in Atlanta like it.”","url":"https://www.ajc.com/news/local-govt--politics/atlanta-breaks-ground-city-biggest-park-bellwood-quarry/GgR7HQxDtbnPl1IpREkuYI/"}
