{"authors":[],"date_download":"2018-10-30 18:59:05","date_modify":"2018-10-30 18:59:05","date_publish":"2018-10-30 18:56:35","description":"Atlanta police officers are responding to a report of a suspicious package on Peachtree Street downt...","filename":"data/vaneerConsumption/Atlantapoliceinvestigatinganothersuspiciouspackagedowntown.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Images/breakingnewsajc.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_breaking-atlanta-polic_c89179a3123397f9d55e4f830d71b1c1__1540925945.html","title":"Atlanta police investigating another suspicious package downtown","title_page":"Atlanta police investigating another suspicious package downtown","title_rss":"NULL","source_domain":"ajc.com","text":"Atlanta police officers are responding to a report of a suspicious package on Peachtree Street downtown, officials said, the third such call in three days.\nPortions of Peachtree Center at 231 Peachtree St. have been evacuated “as a precaution,” police spokeswoman Officer Lisa Bender said in a statement.\nSWAT teams were called to the scene.\nAPD ALERT: Officers are responding to a report of a suspicious package at 231 Peachtree St. NE. Portions of Peachtree Center Mall have been evacuated as a precaution. International Blvd. NE between Peachtree Center Ave. NE and Peachtree St. NE is currently closed. #ATLTraffic — Atlanta Police Dept (@Atlanta_Police) October 30, 2018\nInternational Boulevard between Peachtree Center Avenue and Peachtree Street is closed as crews investigate, police said.\nThe probe comes one day after a parcel at an Atlanta post office was investigated by the FBI in connection with the more than a dozen packaged bombs that were sent around the country over the past week.\nAtlanta police also investigated a suspicious package at the Atlanta airport on Sunday that was deemed to be harmless.\nIn other news:","url":"https://www.ajc.com/news/breaking-atlanta-police-investigating-another-suspicious-package-downtown/vSu8CNZKCS13cGYHdoiFHO/"}
