{"authors":["Cassie Carpenter For Dailymail.Com"],"date_download":"2018-10-22 22:44:59","date_modify":"2018-10-22 22:44:59","date_publish":"2017-03-10 01:26:01","description":"Golden Globe nominee Ryan Reynolds - who portrays Wade Wilson/Deadpool - made the official announcement Thursday to his 18.3M social media followers","filename":"data/vaneerConsumption/AtlantasZazieBeetztoplaymutantDominoinDeadpool2.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/01/3E1F0D5D00000578-0-image-a-45_1489107727640.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299526_Atlanta-s-Zazie-Beetz-play-mutant-Domino-Deadpool-2_1540248299.html","title":"Atlanta's Zazie Beetz to play mutant Domino in Deadpool 2","title_page":"Atlanta's Zazie Beetz to play mutant Domino in Deadpool 2 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"20th Century Fox just selected Zazie Beetz to play the mutant mercenary Neena Thurman/Domino in the highly-anticipated Deadpool sequel for 2018.\nGolden Globe nominee Ryan Reynolds - who portrays Wade Wilson/Deadpool - made the official announcement Thursday to his 18.3M social media followers.\nThe 25-year-old actress will fly to the Canadian 40-year-old's Vancouver hometown in May or June to begin playing the lucky superhero with 'probability-altering' powers.\nCasting news: 20th Century Fox just selected Zazie Beetz to play the mutant mercenary Neena Thurman/Domino in the highly-anticipated Deadpool sequel for 2018 (pictured Feb. 11)\n'Zazie Beetz Effect': Ryan Reynolds - who portrays Wade Wilson/Deadpool - made the official announcement Thursday to his 18.3M social media followers\n'Knock it off, idiot': The 25-year-old actress will fly to the Canadian 40-year-old's Vancouver hometown in May to begin playing the lucky superhero with 'probability-altering' powers\nAside from Tychokinesis, Domino possesses exceptional marksmanship and hand-to-hand skills, as well as goth style complete with a cleavage-boosting leather jumpsuit.\nZazie beat out actresses like Kerry Washington, Ruby Rose, Kelly Rohrbach, and Sienna Miller to nab the part of the S.H.I.E.L.D.'s Six Pack member.\nThe Berlin-born New Yorker is best known for her role as Donald Glover's babymama Vanessa 'Van' Keefer in FX dramedy series Atlanta, which was renewed for a second season.\nHarlem-based Beetz is every bit the bohemian beauty proudly growing out her armpit hair, attending Women's Marches, and sporting trendy millennial tattoos.\nVamp: Aside from Tychokinesis, Domino possesses exceptional marksmanship and hand-to-hand skills, as well as goth style complete with a cleavage-boosting leather jumpsuit\nImpressive: Zazie beat out actresses like Kerry Washington (L), Ruby Rose (M), and Kelly Rohrbach (R) to nab the part of the S.H.I.E.L.D.'s Six Pack member\nRenewed for a second season! The Berlin-born New Yorker is best known for her role as Donald Glover's (R) babymama Vanessa 'Van' Keefer in FX dramedy series Atlanta\nFeminist: Harlem-based Beetz is every bit the bohemian beauty proudly growing out her armpit hair, attending Women's Marches, and sporting trendy millennial tattoos\nMeanwhile, it's still unclear precisely which leading man type will be playing Domino's love interest Nathan Summers/Cable.\nThe only other announced characters for Deadpool 2 include Negasonic Teenage Warhead (Brianna Hildebrand), Colossus (Stefan Kapicic), and Dopinder (Karan Soni).\nThe continuation of the R-rated action comedy - hitting US theaters on March 2, 2018 - will be helmed by SAG Award-winning stuntman David Leitch.\nLast year's Deadpool was a surprising critical and commercial smash success, amassing an impressive $783.1M at the global box office.\nLiam Neeson? Russell Crowe? Meanwhile, it's still unclear precisely which leading man type will be playing Domino's love interest Nathan Summers/Cable\nBack for more! The only other announced characters for Deadpool 2 include Negasonic Teenage Warhead (Brianna Hildebrand), Colossus (Stefan Kapicic), and Dopinder (Karan Soni)","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299526/Atlanta-s-Zazie-Beetz-play-mutant-Domino-Deadpool-2.html"}
