{"authors":[],"date_download":"2018-10-30 20:31:25","date_modify":"2018-10-30 20:31:25","date_publish":"2015-08-21 11:53:49","description":"An artist’s sketch of a suspect, and a Crime Stoppers tip that it led to, resulted in the arrest late Thursday of an 18-year-old man in an Atlanta home invasion case that shocked people across the metro area, and beyond.","filename":"data/vaneerConsumption/AtlantahomeinvasionSuspectwasarmedwhenarrestedcopssay.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/08/21/Images/photos.medleyphoto.7978386.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_atlanta-hom_396d012b45772a43436b92ba90995a5d__1540931485.html","title":"Atlanta home invasion: Suspect was armed when arrested, cops say","title_page":"Atlanta home invasion: Suspect was armed when arrested, cops say","title_rss":"NULL","source_domain":"ajc.com","text":"An artist’s sketch of a suspect, and a Crime Stoppers tip that it led to, resulted in the arrest late Thursday of an 18-year-old man in an Atlanta home invasion case that shocked people across the metro area, and beyond.\nBrandon Jerome Smith was arrested in connection with the attack that left a northwest Atlanta father wounded in both legs. He was captured while walking to a friend’s house with a stolen .40-caliber handgun in his possession, Atlanta police said Friday.\nSmith, who did not resist arrest, is believe to be the shooter of Michael Lash, police chief George Turner said at a news conference. He has been charged with armed robbery and aggravated assault.\nPolice are looking for three other suspects, and Turner said they have “good leads.”\nA Crime Stoppers tipster who saw a GBI sketch of one of the suspects that was released earlier this week led them to Smith. That sketch shows a black man with a piercing between his eyes.\nSmith had an existing warrant after he failed to appear in court on a Brookhaven car break-in charge, police said.\nThe arrest came less than a week after Lash was shot in both legs as he tried to protect his wife, Whitney, and their children during the home invasion.\nLash and his family had just returned to their Sumter Street home when two male teenagers approached him on his front porch, witnesses told police. The teens asked if they could borrow a jack for their car, then tried to force their way inside as two other teens stood across the street, police said.\nWhen Lash tried to close the door, he was shot by one of the teens, who had a short afro and tattoos and piercings on his face, Lash told police.\nWhitney Lash heard the shots, grabbed the couple’s 6-month-old daughter and ran toward the back door.\nShe then called 911, and in a hushed voice, told the operator her husband had been shot.\nThe suspects fired two shots at her, but missed as she ran out the back door and to a nearby home for help.\nThe couple’s 2-year-old son was asleep upstairs in the home and also was not injured.\nMichael Lash was able to speak to the first officers who arrived, though he was in immediate need of emergency treatment for the gunshot wounds to both legs, according to police. One officer used his fingers to temporarily plug the man’s wounds.\n“I ordered other officers on scene to get a belt so that we could tourniquet his right leg,” the officer wrote in the police report. “I kept talking to Mr. Lash to keep him conscious until Fire and EMS units arrived on scene.”\nMichael Lash underwent emergency surgery, but is expected to fully recover from his injuries.\nHe took his first steps with a walker, according to Whitney Lash’s father, who has posted updates on a GoFundMe page set up to help the family with medical and other costs. Michael Lash was set to begin a new job when he was shot, according to a family friend.\nAs of Friday morning, more than $88,000 in donations had poured into the page.\n“Friends,” Whitney Lash’s father wrote in a post after the arrest was announced, “we have great news!”\n— Please return to AJC.com for updates.","url":"https://www.ajc.com/news/crime--law/atlanta-home-invasion-suspect-was-armed-when-arrested-cops-say/3EVo5vHCpJXXof25x420tL/"}
