{"authors":[],"date_download":"2018-10-30 21:45:17","date_modify":"2018-10-30 21:45:17","date_publish":"2018-10-30 21:30:07","description":"A marshy nature preserve close to where the Atlanta Beltline’s southeast trail will one day run was recently designated as an Atlanta Audubon Certified Wildlife Sanctuary.","filename":"data/vaneerConsumption/AtlantanaturepreservebecomesAudubonCertifiedWildlifeSanctuary.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Images/Susan%20Rutherford,%20Esther%20Stokes,%20and%20Joy%20Carter%20at%20McDaniel%20Branch%20Wetlands%20Dedication.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_atlanta-nature-p_364b3e170c4a7cba24a35a6a77c1cd52__1540935917.html","title":"Atlanta nature preserve becomes Audubon Certified Wildlife Sanctuary","title_page":"Atlanta nature preserve becomes Audubon Certified Wildlife Sanctuary","title_rss":"NULL","source_domain":"ajc.com","text":"A marshy nature preserve near where a stretch of the Atlanta Beltline’s southeast trail will eventually run was recently designated as an Atlanta Audubon Certified Wildlife Sanctuary.\nThe McDaniel Branch Wetlands received the designation from the Audubon Society program — which encourages private and public properties to design their land so that it provides food, water and shelter for birds and other wildlife — on Oct. 19.\nThe property recently underwent a stormwater project to alleviate flooding in surrounding neighborhoods, during which the city’s Department of Watershed Management installed many different kinds of plants in order to help hold the stream banks in place.\nThe land is tucked away near Arthur Langford Park, I-85, the Southeast Atlanta Library and residential areas. Atlanta Audubon board member Melinda Langston said the techniques used in the McDaniel Branch renovation will improve water quality and “create valuable habitat for birds and other wildlife,” a press release said.\nTwo other properties in the area, the Lionel Hampton-Beecher Hills and Herbert Greene Nature Preserves, are also working to complete the Atlanta Audubon Wildlife Sanctuary certification process.\nREAD | Atlanta park now offers free WiFi for everyone\nREAD | 2-story restaurant, private pool club planned for West Midtown rooftop\nLike Intown Atlanta News Now on Facebook | Follow us on Twitter\nIn other news...","url":"https://www.ajc.com/news/local/atlanta-nature-preserve-becomes-audubon-certified-wildlife-sanctuary/PW6bJT4fE7P2jJTr82oRCO/"}
