{"authors":["Ligaya Figueras"],"date_download":"2018-10-30 19:59:41","date_modify":"2018-10-30 19:59:41","date_publish":"2016-04-12 11:00:52","description":"An Atlanta filmmaker is headed to the Cannes Film Festival in France next month with his directorial...","filename":"data/vaneerConsumption/AtlantafilmmakersdocumentaryontheSazeraccocktailtoscreenatC.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/04/13/Images/WPIMAGE_cmgajcfoodandmore_7650.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_at_9bcd070ab8ef0eef2a2ae2b71fb959dd__1540929581.html","title":"Atlanta filmmaker’s documentary on the Sazerac cocktail to screen at C","title_page":"Atlanta filmmaker’s documentary on the Sazerac cocktail to screen at C","title_rss":"NULL","source_domain":"ajc.com","text":"An Atlanta filmmaker is headed to the Cannes Film Festival in France next month with his directorial debut, “The New Orleans Sazerac.” James Martin’s documentary on the famed New Orleans cocktail was chosen as an official selection of the Emerging Filmmaker Showcase. It will be screened along with 14 other films at the American Pavilion during the prestigious festival. Nearly 500 filmmakers submitted their projects to be chosen to attend Cannes, making Sazerac’s selection a great honor for the young director.\nThe film debuted in Atlanta last week at the Atlanta Film Festival, including an encore presentation on the festival’s final day . “The New Orleans Sazerac” won an audience choice award and was named Best Crowdfunded Project.\nMartin, 29, began writing about his love affair with cocktails and their histories in 2014 on his website, The Sipologist. The site includes one-on-one interviews with some of the country’s top bartenders as well as his own home cocktail experiments. That project, as well as assisting his partner Jen West, with her film projects, led the pair to create a short documentary on the history of the first cocktail that Martin researched for his website, the Sazerac.\n“The Sazerac has a complex history full of facts and folklore. It's a simple drink in approach, only incorporating four ingredients, but the stories told around the drink give it such a mystique,” Martin said. “For some, it's always been a brandy-focused drink, for others, it's a rye whiskey drink. Some allow for multiple bitters, while others declare Peychaud's their one and only. Is it absinthe or Herbsaint that defines a true Sazerac?”\nMartin wrote and directed the 20-minute documentary that was filmed on location in New Orleans last summer when he and West attended the annual cocktail convention Tales of the Cocktail. The conference gave the pair access to many of the films’ experts, like cocktail historian, David Wondrich and New York Times cocktail writer and author, Robert Simonson along with a few of NOLA’s best bartenders. “The New Orleans Sazerac” takes a detailed looked at one of the cocktail world’s most storied concoctions, chronicling its days from apothecary cure-all to the drink it is today.\nMartin is currently organizing future Atlanta screenings upon return from Cannes. He hopes the exposure that the film gains in France will kickstart a series of cocktail documentaries he intends to write and direct.\nWatch this video of Atlanta filmmaker James Martin discuss the filming of “The New Orleans Sazerac.”\nWant to give this cocktail a try? Among Atlanta bars, Martin recommends ordering a Sazerac at Kimball House, Empire State South, The Sound Table and The Mercury.\nFor more information on the film, visit sazeracdoc.com.\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/atlanta-filmmaker-documentary-the-sazerac-cocktail-screen-cannes-film-festival/kaTR4jdxDNjbHANhEJ0h2H/"}
