{"authors":["Jennifer Brett"],"date_download":"2018-10-30 21:35:10","date_modify":"2018-10-30 21:35:10","date_publish":"2014-10-09 11:07:21","description":"“Kill the Messenger,” in theaters Friday, is set mostly in California and some in Centra...","filename":"data/vaneerConsumption/AtlantafilmedKilltheMessengersharesseriousmessage.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/10/09/Images/WPIMAGE_cmgajcbuzz_464.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_buzz_atlanta-filmed-ki_537afe56f978fc3bc762722654e642d3__1540935310.html","title":"Atlanta-filmed “Kill the Messenger” shares serious message","title_page":"Atlanta-filmed “Kill the Messenger” shares serious message","title_rss":"NULL","source_domain":"ajc.com","text":"“Kill the Messenger,” in theaters Friday, is set mostly in California and some in Central America, but was shot in Atlanta.\nMichael Cuesta\nHere's the official trailer:\nhttp://youtu.be/2N2nuDtJX0M\n“I thought it was the right time to tell this story,” director Michael Cuesta said during a recent interview. “Gary knew he was poking a hornet’s nest. He was a guy who saw himself as a soldier.”\nWebb, played by Jeremy Renner in the movie, was initially celebrated when his work was published in the San Jose Mercury News, but following skeptical articles by other publications, the paper published an editor’s note that walked back Webb’s conclusions. He resigned and eventually took his own life 10 years ago.\nWhile Cuesta respects his subject he does understand the controversy that engulfed him.\n“Make sure the story is cooked completely before you print it,” Cuesta said. “Make sure you get all the sources. dig as deep as you can. If you’re able to unearth some stuff, keep going. If we don’t have these watchdogs, like Gary Webb, we’re not going to get the truth.”","url":"https://www.ajc.com/blog/buzz/atlanta-filmed-kill-the-messenger-shares-serious-message/6zB2GH9Bvyu9zQdpKI3YMI/"}
