{"authors":[],"date_download":"2018-10-30 20:31:33","date_modify":"2018-10-30 20:31:33","date_publish":"2015-08-21 14:00:31","description":"A 140-year-old building once a part of the Morris Brown College campus should be torn down because it poses a safety hazard in the wake of a fire that left it heavily damaged, according to Atlanta fire investigators.","filename":"data/vaneerConsumption/AtlantafireFormerMorrisBrowndormshouldbedemolished.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/08/20/Images/photos.medleyphoto.7969960.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_atlanta-fir_a53111d5fd3d32c4f33f27930d4e5681__1540931493.html","title":"Atlanta fire: Former Morris Brown dorm should be demolished","title_page":"Atlanta fire: Former Morris Brown dorm should be demolished","title_rss":"NULL","source_domain":"ajc.com","text":"A 140-year-old building once a part of the Morris Brown College campus should be torn down because it poses a safety hazard in the wake of a fire that left it heavily damaged, according to Atlanta fire investigators.\nThe former Gaines Hall, which was heavily damaged in the Thursday night blaze, is unstable and poses a danger to pedestrians and drivers along nearby Northside Drive, according to a Channel 2 Action News report.\nInvest Atlanta, however, the city’s economic development agency which owns the building, said the agency will need to do a full assessment of the damage before it is razed.\nThe cause of the fire was under investigation. Atlanta Fire Rescue Department spokeswoman Janet Ward said crews must determine if the building is stable enough to enter.\nEarlier this year the former honors dormitory was sold to Invest Atlanta and Friendship Baptist Church for $14.7 million as part of Morris Brown’s bankruptcy court proceedings. The college agreed to sell 26 acres of property and buildings to the two groups.\nThe 2-alarm fire made for a spectacular sight, with flames shooting out of the building and a dense cloud of smoke rising high into the air.\nThere was only one minor injury. A firefighter hurt an ankle, Ward said.","url":"https://www.ajc.com/news/crime--law/atlanta-fire-former-morris-brown-dorm-should-demolished/CVlkt5JcCovzgRESPK6ymN/"}
