{"authors":[],"date_download":"2018-10-30 20:54:01","date_modify":"2018-10-30 20:54:01","date_publish":"2014-09-17 04:01:00","description":"Jonathan Rapping, an Atlanta lawyer, laughs when he says he’s no genius but is deadly serious when he speaks about the plight of poor people charged with crimes.","filename":"data/vaneerConsumption/AtlantalawyerJonathanRappingwinsMacArthurgeniusgrant.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/09/17/Images/photos.medleyphoto.6139196.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_breaking-news_atlanta-_cecd6e6d1b5808858c786d79d8db60bc__1540932841.html","title":"Atlanta lawyer Jonathan Rapping wins MacArthur ‘genius grant'","title_page":"Atlanta lawyer Jonathan Rapping wins MacArthur ‘genius grant'","title_rss":"NULL","source_domain":"ajc.com","text":"Jonathan Rapping, an Atlanta lawyer, laughs when he says he’s no genius but is deadly serious when he speaks about the plight of poor people charged with crimes.\nThe United States, he says, “has come to accept an embarrassingly low standard of justice for poor people” who cannot afford their own lawyers and must rely on counsel provided by the state.\nRapping’s determination to change that earned him a 2014 MacArthur Foundation “genius grant.\"\nRELATED: Meet Jonathan Rapping and the keepers of Atlanta-based Gideon’s Promise\nThe MacArthur program honors extraordinary originality and dedication in recipients’ creative pursuits.\nRapping is one of 21 recipients, announced Wednesday, who will each receive a no-strings-attached stipend of $625,000, paid out over five years. The fellowship comes with no stipulations or reporting requirements, and allows recipients maximum freedom to follow their own creative visions.\nIn 2007, Rapping created the Southern Public Defender Training Center, subsequently renamed Gideon’s Promise. Named after the landmark 1963 Supreme Court case Gideon v. Wainwright, Gideon’s Promise teaches public defenders to work more effectively within the judicial system by providing coaching, training and professional development, as well as a supportive network of peers and mentors from around the country.\nSince its founding, the organization, based in Atlanta, has grown from a single training program for 16 attorneys in two offices in Georgia and Louisiana, to a multitiered enterprise with over 300 participants in more than 35 offices across 15 mostly Southern states.\nThe landmark Gideon case “says you have a right to a lawyer, and we haven’t lived up to that promise,” Rapping said in a phone conversation Tuesday evening.\nStephen Bright, president and senior counsel of the Southern Center for Human Rights, said Rapping “is making the Constitution of the United States a reality for the first time in courtrooms all over the Southeast.”\n“He is teaching public defenders to be client-oriented — to recognize the dignity of their clients, treat them with respect and give them the same representation they would receive if they could afford the best lawyer in town,” Bright said.\nAccording to Rapping, 80 percent of the people charged with crimes in the U.S. rely on public defenders, and those accused are disproportionately people of color.\n“Public defenders are doing this generation’s civil rights work,” he said.\n“I’ve met passionate defenders who entered the legal profession for the right reasons, and the system beat the passion out of them,” Rapping said. “The system expected them to just process human beings. Caseloads too high. … Insufficient resources. … So my wife and I started an organization, a supportive community of lawyers who are working to force the system to live up to its highest ideals.”\nRapping’s wife, Ilham Askia, is the executive director of Gideon’s Promise. She was a schoolteacher in College Park when she agreed to take a year off to help her husband launch his dream, and she’s never looked back.\nIndeed, social justice is a family affair for Rapping. He says his mother was an activist, community organizer, writer and professor, and his two children — a 10-year-old daughter and a 6-year-old son — already see themselves as a team with Mom and Dad, “getting poor people out of jail.”\nIn 2014, Rapping established a partnership with the Maryland Office of the Public Defender, marking the first time the Gideon’s Promise model will be integrated into a statewide defender system. Rapping, who is also an associate professor at Atlanta’s John Marshall Law School, commutes to Maryland from his family’s Virginia-Highland home.\nAs for what will be done with the prize money, “I haven’t figured that out yet,” he said. “But it certainly takes a lot of the pressure off. My wife left a secure job. And when you run a nonprofit that supports public defenders, you really sort of, year to year, are trying to keep the doors open.”\nABOUT JONATHAN RAPPING\nEducation:\nBachelor’s (1988) from the University of Chicago\nMPA (1992) from the Woodrow Wilson School of Public and International Affairs at Princeton University\nJD (1995) from George Washington University\nCareer, prior to founding Gideon’s Promise in 2007:\nTraining chief for the New Orleans Office of the Public Defender (2006-2007)\nTraining director for the Georgia Public Defender Standards Council (2004-2006)\nStaff attorney for the Public Defender Service for the District of Columbia (1995-2004), where he served his final three years as training director.\nSince 2007, Rapping has also been an associate professor at Atlanta’s John Marshall Law School, where he serves as the founding director of the Honors Program in Criminal Justice. He is currently on sabbatical from his position at John Marshall to serve as the director of strategic planning and organizational development for the Maryland Office of the Public Defender.\nStaff writer Bill Rankin contributed to this article. Email staff writer Michelle Miller.","url":"https://www.ajc.com/news/breaking-news/atlanta-lawyer-jonathan-rapping-wins-macarthur-genius-grant/cSipLamRK1PuqFuvDBkrgM/"}
