{"authors":[],"date_download":"2018-10-30 14:31:19","date_modify":"2018-10-30 14:31:19","date_publish":"2018-08-02 17:08:00","description":"4 Rivers Smokehouse is hosting its a Back-to-School Backpack Drive through Aug. 8. This means the Atlanta location is offering one free classic barbecue sandwich for anyone who donates a backpack filled with school supplies.","filename":"data/vaneerConsumption/AtlantaeateryofferingfreeBBQinexchangeforbackpackssupplies.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/08/21/Images/WPIMAGE_cmgajcfoodandmore_18761.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_atlanta-eatery-o_da6035f1592f829442fc983619158fd1__1540909879.html","title":"Atlanta eatery offering free BBQ in exchange for backpacks, supplies","title_page":"Atlanta eatery offering free BBQ  in exchange for backpacks, supplies","title_rss":"NULL","source_domain":"ajc.com","text":"Here’s a good deed that will not only go noticed — as all good deeds do — but will also land some free barbecue in your belly.\n4 Rivers Smokehouse is hosting a Back-to-School Backpack Drive through Aug. 8. This means the Atlanta location is offering one free classic barbecue sandwich for anyone who donates a backpack filled with school supplies.\nThe backpacks and supplies will be donated to Beecher Hills Elementary School. A complete list of suggested supplies can be viewed here.\nThe restaurant will also offer free food for children 12 and under on Mondays through Fridays from Aug. 13 to Aug. 31. With the purchase of an adult meal, each child can order one complimentary meal from the Lil' Bites Menu.\nREAD | ‘John Lewis Freedom Parkway’ signs coming soon\nREAD | Popular nail salon, barbershop opening at Westside Provisions District\nJohn Rivers, founder and CEO of 4R Restaurant Group, said the drive is intended to help alleviate some of the expenses that come with a new school year.\n“4 Rivers is a family-focused brand, so we’re well aware of how stressful and expensive back-to-school season can be,” Rivers said in a statement.\nThe Atlanta restaurant, located at 822 Marietta St., opened in April 2017. The restaurant group is based in Florida, where it has 15 locations.\nLike Intown Atlanta News Now on Facebook | Follow us on Twitter\nIn other food news...","url":"https://www.ajc.com/news/local/atlanta-eatery-offering-free-bbq-exchange-for-backpacks-supplies/1W7HGNBQxaobBXe4ZmEk3L/"}
