{"authors":[],"date_download":"2018-10-22 21:10:27","date_modify":"2018-10-22 21:10:27","date_publish":"2014-05-06 08:33:28","description":"At least 30 pro-Russian militants and four state troops were killed in fighting in the city of Slovyansk, Ukrainian officials said.","filename":"data/vaneerConsumption/AtLeast34KilledinBattletoReclaimUkrainesSlovyansk.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/422386/140506-ukraine-5a_212d4635e1a96b0e455d3dd8588ba3eb.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_least-34-killed-battle-reclaim-ukraines-slovyansk-n97886_1540242627.html","title":"At Least 34 Killed in Battle to Reclaim Ukraine's Slovyansk","title_page":"At Least 34 Killed in Battle to Reclaim Ukraine's Slovyansk","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAt least 30 pro-Russian separatists were killed by Ukrainian troops Monday as the government continued its push to reclaim an occupied city, the country's interior minister said.\nAt least four Ukrainian troops were also killed and another 20 injured in gunbattles on the outskirts of Slovyansk, Arsen Avakov said in a Facebook post Tuesday.\nThe Defense Ministry said Monday a helicopter was shot down but both pilots survived, and that its forces have now effectively surrounded the city in an attempt to squeeze the occupying militias.\nThe area is one of several towns and cities in the Donetsk and wider region that were last month seized by armed groups demanding closer ties with Russia.\nSeparatist leader Igor Strelkov had earlier told the Kiev Post that around 10 of his men were killed and as many as 25 wounded in the fighting.\nMeanwhile, the region's largest largest airport announced Tuesday that all flights had been temporarily suspended \"by order of the State Aviation Authority of Ukraine.\" It did not give a reason for closure and its online departure board showed flights from Donetsk to the capital Kiev still going ahead.\n- Maria Stromova and Alexander Smith","url":"https://www.nbcnews.com/storyline/ukraine-crisis/least-34-killed-battle-reclaim-ukraines-slovyansk-n97886"}
