{"authors":[],"date_download":"2018-10-30 18:20:32","date_modify":"2018-10-30 18:20:32","date_publish":"2017-03-15 15:41:00","description":"A traveling Atlanta History Center exhibit from Belgium is augmented by several artifacts in the museum’s collection.","filename":"data/vaneerConsumption/ATLHistoryCenterpaystributetothe18millionkilledinWWI.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/15/Images/newsEngin.18003088_031817-WWI-exhibits_McCrae-s-Tribute-Painting.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_atlanta-history-_faa0b22fbd717fbe7546014dc2d6ba95__1540923632.html","title":"ATL History Center pays tribute to the 18 million killed in WWI","title_page":"ATL History Center pays tribute to the 18 million killed in WWI","title_rss":"NULL","source_domain":"ajc.com","text":"One hundred years ago, the United States entered what came to be known as the Great War, the first truly global armed conflict which claimed the lives of an estimated 18 million worldwide.\nWhile it would have been unfathomable at the time, one of America’s bloodiest conflicts — World War I — has arguably become a forgotten war. Overshadowed in memory and legend by the Civil War on one side of history and by World War II on the other, the Great War has largely faded from consciousness in the United States, according to Michael Rose, executive vice president of the Atlanta History Center.\n“In so many ways, the Great War is nearly forgotten in our nation’s memory,” said Rose. “Yet, the loss of life, casualties and impact on our nation was significant.”\nThe Atlanta History Center aims to help revive some of the lost memories of the Great War by opening four exhibitions during 2017 and 2018.\nWhen the United States entered World War I, the publication of both printed and recorded patriotic music quickly proliferated. Sheet music, usually for the piano and voice, offered inspiration and activity at the home front. The Atlanta History Center exhibition “The Great War in Broad Outlines” will include sheet music for several songs, including Over There by Broadway composer George M. Cohan, the most popular and enduring American song of World War I. (COURTESY ATLANTA HISTORY CENTER)\n“The consequences of World War I on the world, not just the U.S., are here today,” Rose said. “We live in the world that World War I created.”\nThe first exhibit, “The Great War in Broad Outlines,” opened March 6 and provides an overview of the conflict.\nOn April 6, 1917, the U.S. entered World War I, which began in 1914, and more than 116,000 American soldiers made the ultimate sacrifice before the “war to end all wars” finally came to an end in late 1918. It stretched from Chile to Samoa, involving soldiers from at least 50 different countries.\nRELATED STORIES:\nAll-black orchestra strives to widen music choices of African-Americans\n30 years ago: What happened in 1987\nKSU strives to educate about the forbidden music from the Holocaust\nThe traveling exhibit from Belgium is augmented by several artifacts in the museum’s collection. These include a re-created World War I tent. There are also six flour sacks from American mills, which are on loan from the Herbert Hoover Presidential Library and Museum. The sacks were decorated by Belgian women and sold to raise funds for war charities. Belgium began the war as a neutral party, but was invaded by Germany in an attempt to capture Paris and endured four years of German occupation.\nThere is also sheet music of popular tunes of the day, which include colorful cover artwork from an era before radio became a common medium.\nIllustrated by a 1767 botanical print, the exhibit also details the quest of Moina Michael of Walton County, Georgia, who turned the red poppy into a universal symbol of war remembrance.\nThe Atlanta History Center is enhancing the touring exhibition “The Great War in Broad Outlines” with additions including six flour sacks from America that were among thousands that, after the contents fed wartime Belgians, were decorated by Belgian women, then sold to benefit war charities. This one and five others are on loan from the Herbert Hoover Presidential Library and Museum. (COURTESY ATLANTA HISTORY CENTER)\n“In 2016, nearly 3.5 million poppies were distributed by the American Legion Auxiliary, raising $2.1 million,” said Don Rooney, the Atlanta History Center’s director of exhibitions. “ The poppy is now an enduring symbol of remembrance and recognition adopted by other military veterans’ groups worldwide.”\nThat exhibit closes April 30.\nThe second exhibit, “Anne Morgan’s War: American Women Rebuilding France, 1917-1924,” runs from April 6 to Sept. 30 at the Kenan Research Center. The exhibit features pictures and silent films from the era depicting the work of 350 women who left the U.S. to devote themselves to humanitarian aid in France.\nAnne Morgan, daughter of financier John Pierpont (J.P.) Morgan, led the group and collected private funds to found the American Committee for Devastated France.\nThe third exhibit, “Uncle Sam Wants You! — World War I and the Poster,” features more than 60 World War I posters from a private Atlanta collection and from the History Center’s own archives.\nArmy Corporal Leslie E. Roberts' World War I service in France from 1918 to 1919 is detailed in photographs, documents, ID tags, uniform buttons, a diary and more in the Atlanta History Center exhibition \"The Great War in Broad Outlines.\" (CONTRIBUTED BY ATLANTA HISTORY CENTER)\nThe private collection comes from local historian Walton Rawls, author of the 2001 book, “Wake Up, America!: World War I and the American Poster.” Americans were initially reluctant to enter what they considered a European war. When the U.S. did enter the war, the government utilized artists to create “pictorial publicity” for the war effort.\nProminent artists of the period include James Montgomery Flagg, Howard Chandler Christy, J.C. Leyendecker, and N.C. Wyeth.\nGeorgia-connected artifacts include the complete World War I uniform of Eugene T. Johnson, a Georgia native who trained at Camp Gordon in what is now Peachtree-DeKalb Airport.\nThe fourth and final exhibit is called “Fields of Battle — Lands of Peace: The Doughboys, 1914-1918,” and will run from March 16 to July 5, 2018 in the Goizueta Gardens.\nArmy Corporal Leslie E. Roberts' World War I service in France from 1918 to 1919 is detailed in photographs, documents, ID tags, uniform buttons, a diary and more in the Atlanta History Center exhibition \"The Great War in Broad Outlines.\" (CONTRIBUTED BY ATLANTA HISTORY CENTER)\nA portrait of World War I battlefields, the exhibit is an outdoor photographic series featuring the work of photojournalist Michael St. Maur Sheil. It’s the only Southern tour stop for the traveling exhibit, which displays modern photos of the fields of battle a century later. The exhibit will span 33 acres of the gardens, showing reconciliation across the lands of formerly warring nations.\nRELATED VIDEO:","url":"https://www.ajc.com/lifestyles/atlanta-history-center-exhibits-pay-tribute-million-killed-wwi/goWw01aWAcZ4PGYHCOzQ1M/"}
