{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 23:39:09","date_modify":"2018-10-30 23:39:09","date_publish":"2016-12-06 00:00:00","description":"'What's different about our customer experience is that everything is controlled via the apps that we produce,' CEO Mark Mullen told Business Insider.","filename":"data/vaneerConsumption/AtomBankCEOMarkMullenondigitalmortgagesandplansfor2017.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_atom-bank-ceo-mark-mullen-on-digital-mortgages-and-plans-for-2017-2016-12_1540942749.html","title":"Atom Bank CEO Mark Mullen on digital mortgages and plans for 2017","title_page":"    Atom Bank CEO Mark Mullen on digital mortgages and plans for 2017 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Atom Bank CEO Mark Mullen. Atom Bank LONDON — Digital-only challenger bank Atom Bank has launched an online-only mortgage product.\nBusiness Insider reported in September that the startup was close to launching mortgages and the startup confirmed the launch in an email on Tuesday.\nCEO Mark Mullen told Business Insider: \"What's different about our customer experience is that everything is controlled via the apps that we produce. All the documentation between you, your advisor, and Atom is produced digitally and stored digitally, and all of the notifications that tell you what's happened to your mortgage is shared via the app.\"\nMullen, who ran HSBC's phone-only bank First Direct before joining Atom, said he hoped the digital-first approach would help it stand out in the market, saying: \"We can offer an agreement in principle in real time. That's easy to say, difficult to engineer.\"\nHe added: \"The mortgage market is pretty competitive but it's also very big and like every other market in banking it's dominated by the big banks.\n\"A new provider like us has an opportunity to go and build lending within the market because it's such a big market. There £230 billion of mortgages in the UK every year.\"\nAtom will sell its residential mortgages through brokers across the country.\nMullen told BI that Atom has now hit £100 million in customer deposits. The startup, founded in April 2014, opened two savings products, only available through its app, in April of this year.\nMullen says: \"It's taken us a year and a half to stand up loans to small businesses, deposit taking via our app, and now lending to the mortgage market, but they're three very big products and three products is not bad for us I think. I think we can do better in 2017 and I think we will.\"\nAsked why Atom didn't launch a current account ahead of a mortgage product, Mullen said: \"Our view of current accounts is they're incredibly important because they provide the window for customers to understand their cash flow and manage their money on a daily basis.\n\"But we have no desire to replicate what the existing banks do which is essentially to loss-lead on them and then believe that the way you can make money out of them is by screwing overdraft users, which we just think is wrong, or by selling a product or service to that customer but never being transparent about how you made money or what money you made.\n\"Everyone who rings the bell and says change is coming — yeah it is, but it just doesn't come that quickly, which is a bit tedious. In the meantime, our philosophy is to try and build simple, transparent products and try and make sure the customer can see and control what's happening with their money because, obviously, it's their money.\"\nHe added: \"We're expanding our range of mortgage products and expand our range of savings products. That's going to continue all through 2017. We'll look to implement our core banking, or current account proposition, in 2017 as early as possible. We're currently testing that.\"\nDespite being dismissive of overdraft fees, Atom confirmed in its press release announcing the mortgage product on Tuesday that it plans to launch an overdraft product in 2017.\nAtom is one of a number of app-only banks, known as \"neobanks,\" launching this year in the UK. Others include Mondo, Starling Bank, and Tandem. Durham-based Atom is the most well-funded, having raised over £135 million to date from backers including Spanish bank BBVA.","url":"https://www.businessinsider.com/atom-bank-ceo-mark-mullen-on-digital-mortgages-and-plans-for-2017-2016-12"}
