{"authors":["Meredith Rizzo"],"date_download":"2018-10-23 00:57:28","date_modify":"2018-10-23 00:57:28","date_publish":"2017-04-30 00:00:00","description":"Years of treating grievously injured people starts to wear on a person, a trauma nurse in Minneapolis says. She explores \"compassion fatigue\" in a semi-autobiographical poem.","filename":"data/vaneerConsumption/ATraumaNurseReflectsOnCompassionFatigue.json","image_url":"https://media.npr.org/assets/img/2017/04/28/affliction-still_wide-62ff1fe6d5f041949096fcf8344d221633506e6e.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2017_04_30_526056664_a-trauma-nurse-reflects-on-compassion-fatigue_1540256248.html","title":"A Trauma Nurse Reflects On 'Compassion Fatigue'","title_page":"A Nurse Reflects On 'Compassion Fatigue' : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"A Trauma Nurse Reflects On 'Compassion Fatigue'\nSometimes, even professionally compassionate people get tired.\nKristin Laurel, a flight nurse from Waconia, Minn., has worked in trauma units for over two decades. The daily exposure to distressing situations can sometimes result in compassion fatigue.\n\"Some calls get to you, no matter who you are,\" she says.\nThat burnout is what Laurel says she was trying to understand when she wrote her semi-autobiographical poem, Afflicted. The poem delves into the night shift of an emergency room nurse in Minneapolis, weaving together stories of patients who are homeless, addicted to drugs or victims of homicide.\nTen years ago, Laurel took a writing workshop in Minneapolis and earned a two-year fellowship that introduced her to the world of contemporary poetry. She found that, unlike other forms of writing, poetry had an efficiency and raw honesty that made it a fitting outlet for her observations as a trauma nurse.\nLaurel published her first collection of poems, Giving Them All Away, after winning the Sinclair Prize for poetry in 2011.\nShe says that writing allowed her to acknowledge her darker experiences in the ER while also taking care of herself.\n\"It's a way of letting go,\" she says, especially of patients who die. \"I acknowledge their life as well as let go of my grief. There's definitely power and healing in that.\"\nListen to Kristin Laurel read her poem 2:23\nKristin Laurel\nIt is the night shift, and most of Minneapolis does not know\nthat tonight a drunk man rolled onto the broken ice\nand fell through the Mississippi.\nHe lies sheltered and warm in the morgue, unidentified.\nBehind a dumpster by the Metrodome\na mother blows smoke up to the stars;\nshe flicks sparks with a lighter\nand inside her pipe, a rock of crack glows\nbefore it crumbles into ash\nand is taken by the wind.\nAnother mother waits up for her son;\nhe was shot in the chest, then pushed out of a fleeing car.\nHe bleeds on black pavement, exhaust fumes hover over him.\nThrough the back doors of the ER\nmedics dump off the indigent\nand black-booted cops track in salt and sand.\nWe are all misplaced.\nAn Indian brave\nis just plain drunk;\nthe white paint on his cheeks and nose\nis from huffing paint.\nHe is snoring off his stupor\nfrom drinking bottles of Listerine\n(the poor man's liquor).\nIt's so easy to judge\nbut we are all broken, in one way or another;\nThe officer was just trying to clean up the streets\nkeep his back seat sanitary\nwhen he picked up another filthy drunk\nand shoved him into the trunk of his squad car.\nThe young nurse was conned\ninto being callous;\nIt only took being spit at, being called a bitch\nand one punch to the face, to learn to be gruff\nand keep them all cuffed to the bed:\nShe takes off soiled jeans,\nuncovers scraps of a shredded newspaper\nthe homeless man's underpants (pissed-on words).\nA grimy, tattered shirt is stuck to his chest,\nshe peels it off, holding her breath, while\nflakes of dead skin detach into the air.\nIn one more hour it will be daybreak.\nShe will go home to her clean house,\nher white down comforter on a pillow-topped bed.\nBut, she knows,\nthere is an affliction in the air.\nEven the snowflakes fall like ash.\nShe washes her hands.\nApril is National Poetry Month, and Shots is exploring medicine in poetry through the words of doctors, patients and health care workers. The series is a collaboration with Pulse: Voices Through The Heart Of Medicine, a platform that publishes personal stories of illness and healing.","url":"https://www.npr.org/sections/health-shots/2017/04/30/526056664/a-trauma-nurse-reflects-on-compassion-fatigue"}
