{"authors":["Associated Press"],"date_download":"2018-10-22 23:08:00","date_modify":"2018-10-22 23:08:00","date_publish":"2017-03-16 05:59:15","description":"SACRAMENTO, Calif. (AP) - A California woman who was drugged along with her boyfriend and then dragged from their home described the \"hell that we have...","filename":"data/vaneerConsumption/Atsentencingwomansayskidnaponcecalledhoaxwashell.json","image_url":"https://i.dailymail.co.uk/1/2017/03/17/04/wire-232269-1489725270-775_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318936_Disbarred-lawyer-faces-sentencing-kidnap-called-hoax_1540249680.html","title":"At sentencing, woman says kidnap once called hoax was 'hell'","title_page":"At sentencing, woman says kidnap once called hoax was 'hell' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SACRAMENTO, Calif. (AP) - A California woman who was drugged along with her boyfriend and then dragged from their home described the \"hell that we have survived\" in emotional testimony Thursday before her abductor was sentenced to 40 years in prison in a crime so elaborate and bizarre that police initially dismissed it as a hoax.\n\"You treated me like an object, a toy, an animal,\" Denise Huskins told her kidnapper, Matthew Muller, a disbarred Harvard University-trained attorney who pleaded guilty in September.\nHuskins described the two days of physical and psychological torture she endured after Muller snatched her from her and her boyfriend's San Francisco Bay Area home two years ago.\nFILE - In this July 13, 2015 file photo, Denise Huskins, left, and her boyfriend Aaron Quinn appear at a news conference in Vallejo, Calif. Matthew Muller, a disbarred Harvard University-trained attorney, faces decades in prison when he is sentenced Thursday, March 16, 2017, for kidnapping Huskins in a scheme so elaborate and bizarre that police in California initially dismissed it as a hoax. (Mike Jory/The Times-Herald via AP, File)\n\"I still have nightmares every night,\" she said, fighting back tears. \"Sleep is not rest for me. It is a trigger.\"\nHer boyfriend, Aaron Quinn, who was bound and drugged during the kidnapping, said he \"cannot and will not ever be the same.\"\nU.S. District Judge Troy Nunley called the abduction a \"heinous, atrocious, horrible crime\" as he sentenced Muller, 39. He had faced up to life in prison, but prosecutors agreed to recommend 40 years in exchange for his guilty plea.\nIn court, Muller said he was \"sick with shame\" for the \"pain and horror\" he caused. Shackled and wearing an orange jail jumpsuit, he looked straight ahead and showed no emotion as he was sentenced.\n\"He doesn't have empathy. I don't think he's capable of it,\" Quinn's mother, Marianne Quinn, said after the sentencing.\nShe said a life sentence would have been better \"because they never would have to worry about him ever again, but again, he's going to be in jail for a long, long, long time.\"\nDefense attorney Thomas Johnson argued for a 30-year sentence, saying his client has been diagnosed as manic and depressive and can be rehabilitated with proper treatment.\n\"They want him to be a monster to get to 40 years. Fine. Marginalize mental illness,\" Johnson told the judge sardonically.\nHe declined comment after the hearing.\nMuller used a remote-controlled drone to spy on Huskins and Quinn before he broke into their Vallejo home with a fake gun, tied up the couple and made them drink a sleep-inducing liquid, prosecutors said. They were blindfolded while Muller played a pre-recorded message that made it seem as if there was more than one kidnapper.\nHe put Huskins in the trunk of his car, drove her to his home in South Lake Tahoe and held her there for two days before eventually releasing her in her hometown of Huntington Beach.\nInvestigators said they found videos of Muller arranging cameras in a bedroom and then recording himself twice sexually assaulting his blindfolded victim.\n\"The only way I got through it was to picture that it was Aaron that I was with,\" Huskins said, sobbing uncontrollably until Quinn joined her and kissed her gently on the forehead.\nThe Associated Press does not normally name victims of sexual assault. But Huskins spoke in an open courtroom with many media present and has frequently spoken publicly about the case in the past. Prosecutors cited the rapes as one of several aggravating factors justifying a 40-year sentence.\nMuller was not charged with a sex crime because there is no appropriate federal law, said Lauren Horwood, spokeswoman for the U.S. Attorney's Office, though she said he could still face state charges.\nEl Dorado County Assistant District Attorney James Clinchard said his office now plans to contact the FBI and other law enforcement agencies to see if his office should file charges.\nDuring and after the kidnapping, Muller used an anonymous email address to send messages to a San Francisco reporter claiming that Huskins was abducted by a team of elite criminals who were practicing their tactics.\nAfter her release, Vallejo police called the kidnapping a hoax and erroneously likened it to the book and movie \"Gone Girl,\" in which a woman goes missing and then lies about being kidnapped when she reappears.\nInvestigators dropped that theory after Muller was arrested in an attempted robbery at another Bay Area home. Authorities said they found a cellphone that they traced to Muller and a subsequent search of a car and home turned up evidence, including a computer Muller stole from Quinn, linking the disbarred attorney to the abduction.\nVallejo police have since apologized. Huskins is suing the city and two police officers, accusing them of defamation and inflicting emotional distress.\nQuinn described Thursday how the home he once loved \"turned into a prison\" and how his young nieces still check under their beds each night.\n\"They're not checking for a bogeyman,\" he told Muller directly. \"They're checking for you.\"\nMuller, a former Marine, was admitted to practice law in California in 2011, and his state bar profile says he attended Harvard Law School. He lost his law license in 2015 in an unrelated incident.\n\"Muller had advantages in life that most people only dream of,\" U.S. Attorney Phillip Talbert said in a statement, \"yet he used his considerable intelligence to plan and execute the physical assault and psychological torture of two innocent strangers.\"\nFILE - This June, 2015 file booking photo released by the Dublin, Calif., Police Department shows Matthew Muller after he was arrested on robbery and assault charges. Muller, a disbarred Harvard University-trained attorney, faces decades in prison when he is sentenced Thursday, March 16, 2017, for a kidnapping so elaborate and bizarre that police in California initially dismissed it as a hoax. (Dublin Police Department via AP, File)\nFILE - In this March 25, 2015 file photo, a news crew reports in front of the home of Denise Huskins, who was abducted in Vallejo, Calif. Matthew Muller, a disbarred Harvard University-trained attorney, faces decades in prison when he is sentenced Thursday, March 16, 2017, for kidnapping Huskins in a scheme so elaborate and bizarre that police in California initially dismissed it as a hoax. (Chris Riley/Vallejo Times-Herald via AP, file)","url":"https://www.dailymail.co.uk/wires/ap/article-4318936/Disbarred-lawyer-faces-sentencing-kidnap-called-hoax.html"}
