{"authors":[],"date_download":"2018-10-22 22:10:40","date_modify":"2018-10-22 22:10:40","date_publish":"2014-06-08 20:14:16","description":"Gunmen disguised as police guards stormed an airport terminal used for VIPs and cargo in Pakistan's largest city Sunday night.","filename":"data/vaneerConsumption/AttackonPakistanAirportLeavesatLeast23Dead.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/495756/140609-world-karachi-distance-230a_cf39d1dab1e849550a8fed1a9e32102f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_attack-pakistan-airport-leaves-least-23-dead-n125741_1540246240.html","title":"Attack on Pakistan Airport Leaves at Least 23 Dead","title_page":"Attack on Pakistan Airport Leaves at Least 23 Dead","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nTen gunmen disguised as police guards attacked a terminal at Pakistan's busiest airport with machine guns and a rocket launcher during a five-hour siege that killed 13 people as explosions echoed into the night, while security forces retaliated and killed all the attackers, officials said Monday.\nThe airport attack came as a separate suicide bombing in the country's southwest killed 23 Shiite pilgrims returning from Iran, authorities said.\nNo one claimed responsibility for the attack on the Jinnah International Airport in Karachi, named after the founder of Pakistan, nor the suicide bombing in Baluchistan province. However, the attacks come as government-led peace talks with the local Taliban faction and other militants have floundered in recent weeks.\nThe airport attack began late Sunday and ended before dawn Monday in Karachi, a sprawling port city on Pakistan's southern coast, although officials said all the passengers had been evacuated. During the course of the attack, heavy gunfire and multiple explosions could be heard coming from the terminal, used for VIP flights and cargo, as militants and security forces battled for control. A major fire rose from the airport, illuminating the night sky in an orange glow as the silhouettes of jets could be seen.\nThe deadly operation was carried out by 10 militants, said the chief minister of Sindh province, Qaim Ali Shah.\n\"They were well trained. Their plan was very well thought out,\" he told reporters. He said they intended to destroy some of the aircraft and buildings but were not able to.\nRizwan Akhtar, the director general of paramilitary Rangers told reporters that the airport would be handed over to civilian authorities to resume normal operations later Monday. He said the attackers apparently were Uzbeks but authorities were still trying to determine their identities and nationalities.\nAt least some of the gunmen wore the uniforms of the Airport Security Force that protects the nation's airports, said an official who briefed journalists near the airport. He said all were strapped with explosives. He said that when a guard one of them, the explosives strapped to his body went off. The official said another attacker also blew up after being shot at by security forces.\nThe official described himself as being with one of the country's intelligence agencies but declined to give his name.\nAfter storming into the airport grounds, gunmen took shelter in two sections of the airport, said senior police officer Ghulam Qadir Thebo.\nAuthorities seized four machine guns and a rocket launcher, Thebo said. He said the billowing smoke and flames was from oil that had caught fire.\nAuthorities diverted incoming flights and suspended all flight operations. A spokesman for the Civil Aviation Authority said the airport would be closed until at least Monday night.\nLocal news channels reported Monday morning that authorities were still searching the airport buildings and intermittent firing was still being heard.\nKarachi is Pakistan's largest city and has been the site of frequent militant attacks in the past. It is the country's economic heart and any militant activity targeting the airport likely would strike a heavy blow at foreign investment in the country.\n—Associated Press","url":"https://www.nbcnews.com/news/world/attack-pakistan-airport-leaves-least-23-dead-n125741"}
