{"authors":["Associated Press"],"date_download":"2018-10-23 01:14:17","date_modify":"2018-10-23 01:14:17","date_publish":"2016-01-29 14:59:53","description":"RIYADH, Saudi Arabia (AP) — Two gunmen wearing suicide bomb belts attacked a Shiite mosque in eastern Saudi Arabia during Friday prayers, an assault that kil...","filename":"data/vaneerConsumption/AttackonShiitemosqueineasternSaudiArabiakills3.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422513_Gunfire-wounds-Shiite-mosque-east-Saudi-Arabia_1540257257.html","title":"Attack on Shiite mosque in eastern Saudi Arabia kills 3","title_page":"Attack on Shiite mosque in eastern Saudi Arabia kills 3 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Attack on Shiite mosque in eastern Saudi Arabia kills 3\nRIYADH, Saudi Arabia (AP) — Two gunmen wearing suicide bomb belts attacked a Shiite mosque in eastern Saudi Arabia during Friday prayers, an assault that killed at least three people and one bomber and wounded 18, authorities said.\nThe attack struck the Imam Reda Mosque in the neighborhood of Mahasen, an area popular with Shiite workers of the state-run Saudi Arabian Oil Co., the world's largest oil-producing firm.\nOne attacker detonated his explosives, while the other opened fire, the Interior Ministry said in a statement carried by the state-run Saudi Press Agency. The other attacker was stopped by worshippers from blowing himself up, it said.\nThe dead included two security officers and a civilian, as well as a suicide bomber, authorities said.\nIn the attack's chaotic aftermath, Saudi police fired assault rifles into the air to drive away an angry mob that surrounded a police car holding a suspected attacker, according to video shot from the scene.\nShiites in Saudi Arabia make up some 10 to 15 percent of the ultra-conservative, Sunni-ruled kingdom's population. The minority group, many of whom live in the country's oil-producing east, previously have been targeted in attacks by the Islamic State group, which views Shiites as heretics. No group immediately claimed Friday's attack.\nEarlier this month, Saudi officials executed prominent Shiite cleric Nimr al-Nimr, who comes from the east of the country, raising tensions in the area.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3422513/Gunfire-wounds-Shiite-mosque-east-Saudi-Arabia.html"}
