{"authors":["Edward Schumacher-Matos","Dina Temple-Raston"],"date_download":"2018-10-23 01:05:23","date_modify":"2018-10-23 01:05:23","date_publish":"2014-08-16 00:00:00","description":"A story failed to report a CIA link but was not as misguided as Glenn Greenwald claims.","filename":"data/vaneerConsumption/AttackingNPRAsAShillForGovernmentIntelligence.json","image_url":"https://media.npr.org/assets/img/2014/08/15/greenwald_wide-d1de9ca8768dcd5d9378b9161c2e925cf8e1eabc.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_ombudsman_2014_08_16_340624540_attacking-npr-as-a-shill-for-government-intelligence_1540256723.html","title":"Attacking NPR As A Shill For Government Intelligence","title_page":"Attacking NPR As A Shill For Government Intelligence : NPR Ombudsman : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Attacking NPR As A Shill For Government Intelligence\nEnlarge this image toggle caption Andrew Burton/Getty Images Andrew Burton/Getty Images\nGlenn Greenwald can certainly raise a ruckus.\nThe lawyer-cum-journalist who has been a principal conduit for the publication of the National Security Agency documents leaked by Edward Snowden has turned his sights on a recent NPR story by counterterrorism correspondent Dina Temple-Raston. Greenwald has called it an \"indisputable case of journalistic malpractice and deceit.\"\nThe story itself—about the data mining by a small Massachusetts company that purports to show a correlation between the Snowden leaks and cyber-security measures taken by al-Qaida—generated little reaction when it first ran August 1. But since the story was attacked August 12 by Greenwald in The Intercept, an online publication he co-founded, and again on television, scores of listeners have sent emails and tweets angrily turning on NPR and Temple-Raston.\n\"As a 35-year NPR supporter and member,\" wrote Heidi Schlossberg of Littleton, Col, in a typical message, \"I am going to cancel my support unless you fire Dina Temple-Raston as well as transparently inform those of us who trusted you who at NPR are the shills for the NSA and our government. . . .I am so disgusted with you I don't have sufficient adjectives to describe my horror at what you allowed.\"\nAfter doing my own research, I strongly agree with the critics that the story committed a fundamental failure in not noting that both the company, Recorded Future, and a second company that aided it, ReversingLabs, have ties to the United States intelligence community. Temple-Raston and her editor, Bruce Auster, agree, too, and say that what happened was an oversight on deadline.\nEnlarge this image toggle caption Dina Temple-Raston Dina Temple-Raston\nAny of us can make a human error, and I find no intention to deceive, as Greenwald charges with no proof. I also disagree with his contention that the story swallows the government's case that the Snowden leaks seriously damaged the ability of the United States to monitor al-Qaida communications. Instead, this was a small story on what today is a small historical point; in fact, by the end of the story that small point is largely dismissed by a leading expert as possibly interesting but not terribly relevant.\nI respect much of what Greenwald does, but in this case he hears more in the NPR report than is there. This is not unusual for someone as involved in an issue and as passionate about it as he is.\nLet's look first at what the story failed to report.\nThe government, along with Google and many private companies, is an investor in Recorded Future. The government does so through In-Q-Tel, a quasi-government venture capital fund that publicly invests in young high-tech companies on behalf of the CIA and other partner intelligence agencies in hopes of encouraging the development of commercial technology that the agencies can use.\nRecorded Future employs sophisticated algorithms and computing power to sift through billions of bits of internet traffic, news reports and blogs to find trends and possibly predict future directions of any given matter. While the company does some work for the government, its web site and news reports suggest that it does much more for Wall Street, tech firms and others.\nGreenwald, citing a number of published reports, has claimed that In-Q-Tel has seats on Recorded Future's board, which would give it a direct say over the operations of the company. However, the CEO of Recorded Future, Christopher Ahlberg, told ombudsman researcher Annie Johnson in a telephone interview that the claim about the board is not true. He said that In-Q-Tel has rights to send an observer to board meetings and sometimes does, but as an observer, she or he cannot vote on board matters.\nOn deadline, as we were making changes to the story, I just forgot to include that.\nIn-Q-Tel is similarly invested in ReversingLabs, the other company quoted in the NPR report. ReversingLabs is a cyber analysis company that was brought in by Recorded Future to pull apart the new encryption software said to be incorporated by al-Qaida and its affiliates. In-Q-Tel's web site says that its investments amount to an average of roughly 10 percent of the total investments in companies in its portfolio.\nTemple-Raston knows all this. She did a 2012 story on Recorded Future in which she mentioned the investment by In-Q-Tel and called it the \"the CIA's investment arm.\" This by itself shows that she has not attempted to hide the government intelligence link, which is public knowledge anyway.\nSo, why was the link left out of this latest story?\nTemple-Raston's report was an exclusive on the release of the second part of Recorded Future's al-Qaida study. The first part was released in May and received some press attention, though not on NPR. The main element of the second part was the analysis by ReversingLabs of al-Qaida's encryption methods. Temple-Raston was given an advance copy and conducted her interviews with the idea of airing the story on Morning Edition on August 1, a few hours before the public release of the study. It was hardly a major exclusive, but was an interesting contribution for NPR's listeners. She had to make the deadline if she was going to keep her exclusivity.\n\"I was aware that the companies had worked with In-Q-Tel and the government on some projects in addition to their commercial work,\" Temple-Raston told me. \"I had meant to include a line in the piece saying as much. On deadline, as we were making changes to the story, I just forgot to include that. It would have been better to have noted it, but I certainly didn't leave it out on purpose.\"\nMistakes happen. Greenwald should know ... But the coincidence is a reminder of the wisdom of humility before throwing stones.\nMistakes happen. Greenwald should know. He co-wrote the Intercept story with Andrew Fishman, who was not identified in the original post. A recent update—I don't know how recent—said that this, too, was an \"oversight.\" It identified Fishman as a former intern and freelancer . . . for NPR. I have no idea if Fishman's material tie influenced the story, and I would not dare suggest that there is an equivalence between what appears to be a relatively minor Intercept oversight, which was corrected, and the NPR error, which has not yet been corrected but should be. But the coincidence is a reminder of the wisdom of humility before throwing stones at someone else's mistake.\nI encourage you, moreover, to read the transcript of the original NPR piece, and not just the Intercept report. The latter in many places confusingly repeats quotes from the Recorded Future study as if they had been aired on NPR. Many of the quotes were not.\nMost critically, Temple-Raston did not say in her report that there is a proven causal link between the Snowden leaks and internet encryption improvements made by al-Qaida — as Greenwald and Fishman suggest she did. (The story summary that pops up when web viewers click on the link to hear the story does use the word \"proof\" — and that should be corrected).\nWhat Temple-Raston did do in her story was to allow Ahlberg, the head of Recorded Future, to wrap up the section of the story on its study by concluding:\nAHLBERG: This is as close to proof you can get to these guys have changed and improved their communications infrastructure post the Snowden leaks.\nThe pooh-poohing of the Recorded Future study begins in the next line and was quietly devastating.\nI would have liked a little more skepticism on the significance of the Recorded Future findings in the lead-in read by host Renee Montagne and up until this conclusion by Ahlberg. But this is a matter of editorial judgment and arguably the additional skepticism wasn't necessary. The pooh-poohing of the study that begins in the next line after Ahlberg's statement went beyond being possibly sufficient to being quietly devastating:\nBRUCE SCHNEIER: It's hard to tell. Certainly they've made changes. Is that because of the normal cost of software development or because they thought, rightly or wrongly, that they were being targeted? TEMPLE-RASTON: Whatever the reason, Schneier says al-Qaida's new encryption program won't necessarily keep communication secret. SCHNEIER: It is relatively easy to find vulnerabilities in software. I mean, this is why cyber criminals do so well stealing our credit cards. And it's also going to be why intelligence agencies are going to be able to break whatever software these al-Qaida operatives are using. TEMPLE-RASTON: The NSA declined to comment. Dina Temple-Raston. NPR News, New York.\nYou could feel the toss of ice water dripping over the Recorded Future study. At least I could.\nGreenwald makes much of the fact that more minutes were given to the study than to Schneier, but this means little. Indeed, the bottom-line impact of the story would not have changed even if the government tie had been reported. Recorded Future's trolling of the internet for al-Qaida references to Snowden, the tracking of encryption software used by the terrorists, and other such mining and scraping of data were an interesting academic exercise, whether the CIA was involved or not. But is anyone surprised that there might be a link between encryption improvements and the Snowden leaks? I think we all expect it.\nThe real issue is: how significant those terrorist adjustments might be, and here Schneier has the final authoritative word in the story. His pronouncement? Not very. Encryption updates are continually made for reasons hard to definitively prove, he says, but no matter: \"Its relatively easy to find vulnerabilities in software.\"\nAnother obvious question, not addressed in the NPR story, is whether the government asked Recorded Future to investigate al-Qaida's response to the Snowden leaks. Ahlberg insists that the government had nothing to do with his study. \"We weren't asked by anybody to do this,\" he told Johnson, my assistant. \"I dreamed up the analysis and published it.\"\nIs anyone surprised that there might be a link between encryption improvements and the Snowden leaks?\nTo be sure, we should have been told this and about the government link to the company, regardless of whether this additional information would have changed the story's bottom line. Each of us would then have had our own reaction to the knowledge. But one of the good things about daily journalism is that you can always come back another day to self-correct and keep filling out the story.\nAnd Temple-Raston will surely be back. She is a highly accomplished reporter who has just come off a year at Harvard as a Nieman Fellow and is the author of four acclaimed books. The last two—In Defense of Our America and The Jihad Next Door—deal precisely with the threat that national security concerns are having on civil liberties. Her co-author on the first of the two is the executive director of the American Civil Liberties Union. Given the angry accusations being hurled at her, one can only say: Oh, the irony.\nEditorial researcher Annie Johnson contributed to this report.","url":"https://www.npr.org/sections/ombudsman/2014/08/16/340624540/attacking-npr-as-a-shill-for-government-intelligence"}
