{"authors":["Scott Neuman"],"date_download":"2018-10-22 21:43:19","date_modify":"2018-10-22 21:43:19","date_publish":"2014-11-27 00:00:00","description":"A suicide bomb attack on a British diplomatic vehicle killed five people, including a British national. Later, a blast and gunfire were heard in the city's diplomatic area.","filename":"data/vaneerConsumption/AttacksInTheAfghanCapitalKill5.json","image_url":"https://media.npr.org/assets/img/2014/11/27/ap481411127355_wide-d3a34e3c4f2081ffff374a532b3c22887bf247c3.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2014_11_27_367017503_foreign-guesthouse-reportedly-attacked-in-kabuls-diplomatic-area_1540244599.html","title":"Attacks In The Afghan Capital Kill 5","title_page":"Attacks In The Afghan Capital Kill 5 : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Attacks In The Afghan Capital Kill 5\nEnlarge this image toggle caption AP AP\nUpdated at 5:05 p.m. ET\nAt least five people are dead in the Afghan capital, Kabul, after after a suicide bombing attack on a British embassy vehicle. A guesthouse run by a foreign aid agency in the diplomatic area of the city also came under attack.\nThe BBC says that \"a British worker and an Afghan member of staff among those killed.\n\"The Briton who died was a member of the embassy security team, as was another UK national who was wounded. \"Three other Afghans were killed and more than 30 wounded in the attack, which the Taliban say they carried out.\"\nHours later, NPR's Sean Carberry, reporting from the Afghan capital, said there was gunfire and blasts coming from the city's diplomatic area.\nA statement from Afghanistan's deputy minister of interior said in a statement that all four attackers had been killed.\nHe said one militant blew himself up on the back side of the compound and two others were shot by guards at the guesthouse either belonging to International Relief and Development (IRD) or a partner of IRD.\nReuters, quoting a local military commander, reports that the blast was the result of a car bomb.\nThe commander of 111 Military Corps Kabul, Qadam Shah Shaheem, told Reuters that the target was a foreign guesthouse in the Wazir Akbar Khan area of the city, where many embassies and international organizations are located.\n\"Two or three insurgents have entered the compound. Our forces are there and the fight is ongoing,\" he told Reuters.\nNo one immediately claimed responsibility for the second attack.","url":"https://www.npr.org/sections/thetwo-way/2014/11/27/367017503/foreign-guesthouse-reportedly-attacked-in-kabuls-diplomatic-area"}
