{"authors":["John J. Xenakis"],"date_download":"2018-10-30 18:38:43","date_modify":"2018-10-30 18:38:43","date_publish":"2016-07-06 13:42:01","description":"Contents: Attack on Islam's holy site in Medina caps end-of-Ramadan jihadist carnage; Bond yields continue to plummet globally into negative territory after Brexit | National Security","filename":"data/vaneerConsumption/AttackonMedinaCapsEndofRamadanJihadistCarnage.json","image_url":"https://media.breitbart.com/media/2016/07/saudi-arabia-medina-suicide-bombing-ap-image.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_07_06__1540924723.html","title":"Attack on Medina Caps End-of-Ramadan Jihadist Carnage","title_page":"Attack on Medina Caps End-of-Ramadan Jihadist Carnage","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nAttack on Islam’s holy site in Medina caps end-of-Ramadan jihadist carnage\nBond yields continue to plummet globally into negative territory after Brexit\nAttack on Islam’s holy site in Medina caps end-of-Ramadan jihadist carnage\nThe aftermath of the suicide bombing attack on the Prophet’s Mosque in Medina, Saudi Arabia (Arab News)\nMuslims around the world are horrified and appalled that the grave of the Prophet Mohammed in Medina was targeted by a suicide bomber on Monday. Four policemen became suspicious of an individual who was approaching the Prophet’s Mosque, and when they questioned him, he blew up his explosive belt. Only the four policemen were killed, but their actions are being credited with saving the lives of many others.\nEarlier, two suicide bombers blew themselves up outside the Faraj al-Omran Mosque in Qatif, with no casualties. And a suicide bomber blew himself up near the US consulate in Jeddah, although some Saudi authorities say that it was the mosque next door, not the consulate, that was the target of the attack. Two policemen were lightly wounded in this attack.\nThere were no claims of responsibility for the three attacks, but it is assumed that the so-called Islamic State (IS or ISIS or ISIL or Daesh) is responsible. It is not even known if the three attacks were coordinated, or if they were independent attacks, all scheduled for the last day of Ramadan, in accordance with pre-Ramadan incitement by ISIS.\nEarly in June, ISIS spokesman Abu Mohammed al-Adnani told “lone wolves” and other ISIS supporters:\nWe will make this month [Ramadan], inshallah, a month of calamities for the infidels everywhere. This call specifically goes out to the supporters of [ISIS] in Europe and America.\nThe scale of the carnage inflicted by jihadist extremists over the past week alone has been staggering. The attacks included more than 250 killed by a truck bomb in a crowded Baghdad market in Iraq; 44 killed at an airport in Istanbul, Turkey; 23 killed in a siege of a café in Dhaka, Bangladesh.\nAnd yet, in another sense, the ISIS incitement was not really fulfilled. The attacks during the month of Ramadan killed over 800 people worldwide, but the only one that really targeted “Europe and America” was the ISIS-inspired lone wolf who killed 49 people in a gay bar in Orlando, Florida.\nAs I’ve written many times in the past, there is a war being prosecuted by al-Qaeda and by ISIS, but it’s not a war against Westerners or Christians. The huge mass of casualties from the jihadists wars are other Muslims, and the number of Westerners is minuscule by comparison. This is a war by Muslims against Muslims, whether it’s Sunnis versus Shias, Sauds versus Wahhabis, or some other fault line.\nPossibly nothing illustrates this more than the attack on the Prophet’s Mosque in Medina. This was a shocking escalation in ISIS’s war against Muslims. Medina is the second holiest city in Islam, behind Mecca, and is always crowded with Muslim visitors. ISIS considers the Saudi government to be infidels in league with the West, and so perhaps Medina could somehow be a “Western” target. This has been particularly true since November 20, 1979, when young jihadists led by terrorist Juhayman al-Oteibi seized the Grand Mosque in Mecca. By the end, the official death toll was 127 soldiers and 117 militants. Unconfirmed reports indicate that over 1,000 civilians lost their lives. ( “12-Sep-2015 World View — Saudi Arabia’s Grand Mosque, site of huge construction accident, has links to 9/11”)\nBut whatever ISIS’s justification for attacking Medina, it’s still Muslims that are being killed, and it’s still the second holiest shrine in Islam. As one Muslim tweeted on Tuesday, “Is there anyone on earth who still thinks these barbarians HAVE ANYTHING TO DO WITH ISLAM?” Arab News and The National (UAE) and CNN\nBond yields continue to plummet globally into negative territory after Brexit\nInvestors worldwide are continuing to seek “safe havens” by investing in government bonds. The demand for these bonds is forcing prices up to historical levels, which means that their yields (interest rates) are falling to historic levels, increasing to negative levels.\nBond yields had already pushed many bond yields lower, thanks to central banks “printing money” via quantitative easing, and pouring it into the banking system. This has pushed bond yields on the most popular bonds in Japan, Germany, Switzerland and much of Western Europe below zero. A negative yield means that if an investor invests a million dollars in bonds, then he’ll get less than a million dollars back when the bonds expire.\nThe Brexit referendum vote, which mandated that Britain leave the European Union, apparently has accelerated the plunge in bond yields as an unexpected consequence, because uncertainty about the UK and EU economies has caused investors to flee to safe havens. ( “25-Jun-16 World View — Fallout from Brexit: Impact on geopolitics, economics, and stock markets”)\nOn Tuesday, ten-year US Treasury bond yields, going into uncharted territory, fell to 1.367%, down from an already extremely low 1.47% on Friday.\nIn Europe, the yield on 10-year UK government bonds (“gilts”) fell to a record low of 0.780%. The Bank of England has already announced that there will be further quantitative easing during the summer. The yield on Germany’s 10-year bonds (“bunds”) fell further into negative territory to -0.182%. Switzerland’s 50-year bond yields became negative for the first time on Tuesday.\nAt the same time, massive injections of “printed” money by central banks is keeping the stock markets at historically high levels, despite the fact that second quarter earnings are forecast to plunge about 8%, making the huge stock market bubble even larger, meaning that it will do more damage than ever when it implodes.\nThere was a major exception on Tuesday to falling bond yields: Italy, whose 10-year bond yields rose slightly. As we wrote yesterday, Italy’s bank crisis is extremely dangerous, and may become an EU crisis when bank stress tests are announced on July 29. AFP and Market Watch and Reuters and Zero Hedge\nKEYS: Generational Dynamics, Saudi Arabia, Medina, Prophet’s Mosque, Islamic State / of Iraq and Syria/Sham/the Levant, IS, ISIS, ISIL, Daesh, Faraj al-Omran Mosque, Qatif, Ramadan, Abu Mohammed al-Adnani, Juhayman al-Oteibi, Grand Mosque, Mecca, Japan, Germany, Switzerland, Britain, Brexit, Italy\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2016/07/06/6-jul-16-world-view-attack-islams-holy-site-medina-caps-end-ramadan-jihadist-carnage/"}
