{"authors":["Merrit Kennedy"],"date_download":"2018-10-22 23:07:26","date_modify":"2018-10-22 23:07:26","date_publish":"2018-08-23 00:00:00","description":"The Kroger Co. includes major chains such as Ralphs, Harris Teeter, Food4Less and Pick 'n Save. Its goal is to eliminate all single-use plastic bags by 2025.","filename":"data/vaneerConsumption/AttentionShoppersKrogerSaysItIsPhasingOutPlasticBags.json","image_url":"https://media.npr.org/assets/img/2018/08/23/ap_18169747005095_wide-2172856c6edfdc8b4897ec01a2607ba816f004ce.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_08_23_641215873_attention-shoppers-kroger-says-it-is-phasing-out-plastic-bags_1540249646.html","title":"Attention, Shoppers: Kroger Says It Is Phasing Out Plastic Bags","title_page":"Attention, Shoppers: Kroger Says It Is Phasing Out Plastic Bags : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Attention, Shoppers: Kroger Says It Is Phasing Out Plastic Bags\nEnlarge this image toggle caption Rogelio V. Solis/AP Rogelio V. Solis/AP\nOne of the largest supermarket companies in the U.S. has announced it is phasing out single-use plastic bags in an effort to reduce plastic waste.\nThe Kroger Co. says it plans to stop distributing single-use bags completely by 2025 across its chains.\nKroger includes major chains such as Ralphs, Harris Teeter, Food 4 Less, Pick 'n Save and, of course, Kroger. As of 2017, the company says it owns more than 2,700 supermarkets in 35 states and Washington, D.C.\nThat phase-out will start with the Seattle-based supermarket chain QFC, which should transition away from plastic by 2019.\n\"We listen very closely to our customers and our communities, and we agree with their growing concerns,\" Mike Donnelly, Kroger's executive vice president and COO, said in a statement. \"That's why, starting today at QFC, we will begin the transition to more sustainable options.\"\nThe company is encouraging people to switch to reusable options such as these bags:\ntoggle caption Kroger\nSingle-use plastic bags create a huge amount of waste. According to the Environmental Protection Agency, more than 380 billion plastic bags are used in the U.S. every year. That plastic can end up in waterways, harming marine life.\nIt breaks down into very small pieces known as microplastics, which are troubling to scientists because they turn up just about everywhere. As NPR's Christopher Joyce has reported:\n\"Researchers started to pay serious attention to microplastics in the environment about 15 years ago. They're in oceans, rivers and lakes. They're also in soil. Recent research in Germany found that fertilizer made from composted household waste contains microplastics. \"And, even more concerning, microplastics are in drinking water. In beer. In sea salt. In fish and shellfish.\"\nKroger says it also is working on other measures to reduce waste, including a goal to \"divert 90% of waste from the landfill by 2020.\"\nOther companies are taking steps to reduce plastic waste — for example, Starbucks announced plans in July to eliminate plastic straws from its stores worldwide. Marriott International followed suit a few days later.\nCalifornia has a statewide ban on single-use carryout bags at grocery stores and large retail stores. Multiple cities and counties either have a ban on plastic bags or charge a small fee to use one. The National Conference of State Legislatures has a rundown of local laws.\nOther countries have taken steps to rein in the plastic use. For example, Kenya introduced a ban on plastic bags last year that carries heavy fines or even jail time. Eight months into the program, The Guardian wrote that some businesses were \"struggling to find affordable alternatives,\" but at the same time, \"waterways are cleaner, the food chain is less contaminated with plastic.\"\nSome of Australia's largest retailers, and multiple states there, have also banned the bags. As NPR reported, environmental groups and many shoppers were pleased with the change — but in the early days, there were also reports of tensions between cashiers and customers who still wanted free plastic bags.\nAhead of the shift, a union representing retail workers in Australia released ads to try to ease tensions. Take a look:","url":"https://www.npr.org/2018/08/23/641215873/attention-shoppers-kroger-says-it-is-phasing-out-plastic-bags"}
