{"authors":["Laurel Rosenhall"],"date_download":"2018-10-30 22:53:51","date_modify":"2018-10-30 22:53:51","date_publish":"2016-06-28 08:00:00","description":"The Capitol dome looms over downtown Sacramento, a magnet for money and power. Shiny-shoed politicians and well-dressed lobbyists hustle toward the","filename":"data/vaneerConsumption/Atthecornerofpowerandpoverty.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/Bartley1-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940031.html","title":"At the corner of power and poverty","title_page":"At the corner of power and poverty | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"The Capitol dome looms over downtown Sacramento, a magnet for money and power.\nShiny-shoed politicians and well-dressed lobbyists hustle toward the building where billion-dollar decisions are made. Nearby shops sell fine cigars and custom suits. A bar serves $16 martinis.\nBut the streets that surround this regal building also are home to some of Sacramento’s most destitute residents, many suffering from mental illness or drug addiction in addition to extreme poverty. It’s not uncommon to see them rifling through trash cans, shouting incoherently or sleeping barefoot in the shade on the Capitol’s manicured grounds.\nBridging these two worlds is Debbie Bartley, a 55-year-old grandmother who stands across the street selling Homeward, a newspaper produced by homeless people. She chats with the political staffers and lobbyists who give her a few dollars as they pass by. Then she buys food for people who sleep on these streets.\n“I can’t feed the world, but I would if I could,” Bartley said. “Because I understand the concept of being hungry.”\nAcross the sprawling county of Sacramento, roughly 950 people have no shelter on a typical night. On the streets surrounding the Capitol, local officials counted 62 people sleeping in March – almost double the number they counted two years earlier.\nIt is heartbreaking evidence of a longstanding problem in many cities across California, a state home to more than one-fifth of all homeless people nationwide. Inside the marble-floored Capitol, lawmakers have now passed a $2 billion bond to build housing for homeless people who are mentally ill.\nThe proposal was partly crafted by Darrell Steinberg, the former state Senate leader who was recently elected mayor of Sacramento. He hopes it will help local governments statewide.\n“It would be folly to say we can end homelessness and get everybody off the streets. But we must make it better,” he said.\nAs mayor, Steinberg is promising an approach that combines more housing with additional outreach, case management and mental health services.\nBartley thinks she can help. Until last year, she was homeless, bouncing among shelters, cheap motel rooms and a tent after losing her job at a mini-mart in 2011. Now she makes enough money most months selling Homeward to pay the $400 rent at a Sacramento trailer park.\n“I worry every day about being homeless again,” she said, pointing to a broken tooth and the deep lines on her face as testimony to life on the streets.\nBartley buys the papers from the nonprofit publisher for 10 cents apiece and sells them for a minimum donation of $1. Each weekday morning, she sweeps her graying hair into a bun, rides the bus downtown at 7 o’clock, then spends hours on a busy street corner, waving the paper high above her head and greeting everyone who passes by.\n“Good morning guys,” Bartley calls out. “Would you like to make a donation to a homeless nonprofit?”\nAt the corner of power and poverty In Sacramento, right outside California’s gleaming state Capitol, dozens of homeless people live on the streets. Here is Debbie Bartley, a grandmother who was one of them until last year. She now ekes by selling a street publication, helping others who still live on the edge.\nSome lawmakers pass without making eye contact. Bartley can name others who regularly shake her hand. There are days when she feels angry, watching people with means stroll by without sharing. But for the most part, she says, the Capitol workforce is a generous bunch.\nBartley says she was addicted to methamphetamines for many years and weathered abusive relationships. A stern warning from a judge prompted her to get sober.\nAbout this story This is part of a collaboration by media outlets in California that are reporting about homelessness on June 29, 2016. The effort is led by the San Francisco Chronicle and includes about 70 news organizations. More information on the project is here. You can follow the stories on Twitter and Facebook.\nShe raised five children, working at minimum-wage jobs. Two of her daughters are now drug addicts who live on the streets. She looks for them in abandoned houses some afternoons when she’s done selling newspapers.\nBartley says she’s been diagnosed with bipolar disorder but shuns medication because it makes her feel weird. She carries receipts from her rent payments in her backpack, eagerly showing them to people who give her donations. She wants them to know she doesn’t spend their money on drugs.\n“She has a work ethic that won’t quit,” said John Lovell, a lobbyist for law enforcement groups who gives Bartley money and buys her ham sandwiches. “She is out here rain or shine.”\nOn a recent morning, Bartley had collected $17 by 10:30 a.m. That was after she spent $1 on a Pepsi for a homeless man she frequently takes care of. He’s a regular presence around the Capitol; outreach workers say they have tried to help him but can’t break through a fog of mental illness.\nThe summer sun was baking the sidewalk as the man approached Bartley on her corner. She went into a market and came out with the soda.\n“Here, baby,” she said. “Have a blessed day.”\nBartley said she began sharing food with the man after she saw him eating from a garbage can. Now she picks up a bag lunch for him from a nearby charity or gives him leftovers she collects from lunchtime events on the Capitol grounds.\n“There is no reason for anybody in this world to eat out of a garbage can,” Bartley said. “There is too much money here.”","url":"https://calmatters.org/articles/at-the-corner-of-power-and-poverty/"}
