{"authors":["Charlie Nash"],"date_download":"2018-10-30 18:19:16","date_modify":"2018-10-30 18:19:16","date_publish":"2018-07-02 20:28:15","description":"AT&T has been hit with a $5.25 million fine from the Federal Communications Commission (FCC) over several 911 emergency line outages in 2017. - AT&T | Tech AT&T has been hit with a $5.25 million fine from the FCC over several 911 emergency line outages in 2017.","filename":"data/vaneerConsumption/ATTHitwith525MillionFinefor911Outages.json","image_url":"https://media.breitbart.com/media/2018/03/wi/ap/12/2248mt_aptopix-helicopter-crash-48556-responders-carry-person-an-ambulance-helicopter-e1530563287422.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2018_07_02__1540923556.html","title":"AT&T Hit with $5.25 Million Fine for 911 Outages","title_page":"AT&T Hit with $5.25 Million Fine for 911 Outages | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"AT&T has been hit with a $5.25 million fine from the Federal Communications Commission (FCC) over several 911 emergency line outages in 2017.\nThe outages resulted in around 15,200 unique calls being unable to get through to 911, prompting FCC chairman Ajit Pai to call for an investigation into the company last year.\nOutage reports were received from New York City, Philadelphia, Washington, D.C., Chicago, Miami, Dallas, Houston, San Francisco, Los Angeles and Seattle.\n“As a condition of the settlement, the company must pay a $5.25 million fine, implement proactive system changes to reduce the likelihood and impact of future 911 outages, improve processes for notifying 911 call centers of any future outages, ensure reliable 911 call completion, and regularly file compliance reports with the FCC,” declared the FCC in a statement. “On March 8, 2017, and again on May 1, 2017, AT&T’s wireless phone customers across the country experienced 911 service outages on the company’s Voice over Long Term Evolution (VoLTE) network. Planned network changes implemented by AT&T on those days inadvertently interfered with the company’s routing of 911 calls.”\n“The March outage lasted approximately five hours, resulting in the failure of 911 calls from some 12,600 unique users,” the FCC revealed. “The May outage lasted approximately 47 minutes, resulting in 2,600 failed 911 calls. The FCC’s investigation also found that, during the March outage, the company failed to quickly, clearly, and fully notify all affected 911 call centers.”\n“Such preventable outages are unacceptable. Robust and reliable 911 service is a national priority, as repeatedly expressed by both Congress and the Commission. Carriers have a responsibility to both prevent outages and, if they do take place, quickly inform the Commission and affected 911 call centers,” they concluded. “FCC rules mandate that mobile phone service providers ‘transmit all wireless 911 calls’ and inform 911 call centers of any 911 network outage that lasts 30 minutes or more.”\nIn June, a federal judge approved AT&T’s takeover of Time Warner, which President Donald Trump had expressed opposition to.","url":"https://www.breitbart.com/tech/2018/07/02/att-hit-with-5-25-million-fine-for-911-outages/"}
