{"authors":["Npr Staff"],"date_download":"2018-10-22 21:23:48","date_modify":"2018-10-22 21:23:48","date_publish":"2016-08-06 00:00:00","description":"A new bar in Sussex has lined its walls with foil to block phone signals. The owner, inspired by the Faraday cage, hopes people will talk to each other rather than stare at their smartphones.","filename":"data/vaneerConsumption/AtThisEnglishBarAnOldSchoolSolutionToRudeCellphones.json","image_url":"https://media.npr.org/assets/img/2016/08/05/gettyimages-136810806_wide-82a028fec4787bac7edaee0db7a1f60fb9d4057e.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_alltechconsidered_2016_08_06_488864179_at-this-english-bar-an-old-school-solution-to-rude-cellphones_1540243428.html","title":"At This English Bar, An Old-School Solution To Rude Cellphones","title_page":"At This English Bar, An Old-School Solution To Rude Cellphones : All Tech Considered : NPR","title_rss":"NULL","source_domain":"npr.org","text":"At This English Bar, An Old-School Solution To Rude Cellphones\nEnlarge this image Liam Norris/Getty Images/Cultura Exclusive Liam Norris/Getty Images/Cultura Exclusive\nThere was a time when people went to bars to talk to other people, maybe even meet someone new. But that was in the BC era — before cellphones.\n\"I've been in the pub industry for a long time, and progressively it's become less and less social and more and more antisocial,\" Steve Tyler, the owner of the Gin Tub in Sussex, England, tells NPR's Scott Simon.\nAnd that's bad for business. So Tyler wanted to bring back the conversation, and he did by turning his bar into a Faraday cage — a 19th-century invention that reflects electromagnetic fields and conducts currents around, rather than inside, an enclosure.\nHe installed copper wire mesh in the bar's ceiling and tin foil on the walls, effectively blocking cell phone signals from getting into the establishment.\ntoggle caption Fabian Bimmer/AP\n\"It's not military grade,\" Tyler says, but \"it does its job.\"\nTyler says that, because it doesn't send a signal to jam phones, the setup is totally legal. But just in case, the Gin Tub has a sign at its entrance that tells people exactly what they're getting into: \"No Wi-Fi, no signal, just friends.\"\nA week in, Tyler says that people are loving the change.\n\"I think I've hit a nerve in the world, that I think it's rude, and I think society has accepted people on their phones in bars and in places where it's socially unacceptable,\" he says.\nHe hasn't seen sight of any imitators, but Tyler is confident that his approach — or at least the general idea — will win out.\n\"I think this is gonna be the new way forward for restaurants and bars and clubs,\" he says.\nWithout phones in their hands, people are no longer drinking in silence but instead talking with each other. Tyler says that's how bars were intended.\n\"It's like Cheers, the TV program, when you walk in everyone knows your name,\" Tyler says. \"Well, there are no pubs now where everyone knows your name.\"\nThat is, except within the Faraday cage.","url":"https://www.npr.org/sections/alltechconsidered/2016/08/06/488864179/at-this-english-bar-an-old-school-solution-to-rude-cellphones"}
