{"authors":[],"date_download":"2018-10-22 22:51:58","date_modify":"2018-10-22 22:51:58","date_publish":"2014-05-12 22:24:43","description":"The two companies may finalize a deal in the next few weeks, Reuters reported.","filename":"data/vaneerConsumption/ATTinTalkstoBuyDirecTVforAbout50Billion.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_20/437546/140512-directv-att-mms-1829_316a3ec3f55e37cab3791bc1beda555f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_business-news_t-talks-buy-directv-about-50-billion-n103646_1540248718.html","title":"AT&T in Talks to Buy DirecTV for About $50 Billion","title_page":"AT&T in Talks to Buy DirecTV for About $50 Billion","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAT&T is in active talks to buy satellite TV provider DirecTV and may finalize a deal in the next few weeks that could be worth close to $50 billion, two people familiar with the matter told Reuters on Monday.\nThe second largest wireless operator is discussing an offer in the low to mid-$90s per share for DirecTV, one of the people said, compared with the company's closing price of $87.16 on Monday. Shares rose 6 percent to $92.50 in extended trading.\nA bid at around $95 per share would value DirecTV at more than $48 billion based on its shares outstanding.\nThe deal price has yet to be finalized and terms could still change, the people said, adding that discussions are continuing and asking not to be named because the matter is not public.\nAT&T and DirecTV declined to comment. Bloomberg News earlier reported that AT&T was offering to pay around $100 per share for DirecTV, whose management team will continue to run the company as a unit of AT&T. The Wall Street Journal said a deal could happen in two weeks.\nDirecTV is working with advisers including Goldman Sachs Group to evaluate a possible combination following a recent takeover approach from AT&T, Reuters reported last week.\n\"This is not the first time that AT&T and DirecTV have danced around the fire and thought if they could give it a go,\" said ReconAnalytics analyst Roger Entner.\n\"They both looked at each other for at least 10 years. Both kind of came to the conclusion that it was in the right environment. It makes a lot of sense to get together, but there was never the right regulatory environment for it.\"\n-Reuters","url":"https://www.nbcnews.com/business/business-news/t-talks-buy-directv-about-50-billion-n103646"}
