{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:15:27","date_modify":"2018-10-30 22:15:27","date_publish":"2015-09-08 19:49:13","description":"Last week the attorney for the illegal alien on trial for murdering Kathryn Steinle, defended his client by pointing out his poverty.","filename":"data/vaneerConsumption/AttorneyinSteinleCaseBlamesGunmansPoverty.json","image_url":"https://media.breitbart.com/media/2015/07/ap_francisco-sanchez-jeff-adachi-diana-garciaor_ap-photo-1024x738.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_09_08__1540937727.html","title":"Attorney in Steinle Case Blames Gunman's Poverty","title_page":"Attorney in Steinle Case Blames Gunman's Poverty","title_rss":"NULL","source_domain":"breitbart.com","text":"Last week Matt Gonzalez, attorney for the illegal alien on trial for murdering American Kathryn Steinle, defended his client by pointing out that Lopez-Sanchez only has a “second grade education.”\nJuan Francisco Lopez-Sanchez shot and killed Steinle on San Francisco’s Pier 14 on July 1.\nAccording to the Associated Press, Gonzalez defended Lopez-Sanchez by pointing out that he “is homeless and has a second-grade education.” Gonzalez also focused on Lopez-Sanchez’s poverty, describing the way he was “arrested an hour after the shooting while wearing one sock and two pairs of pants to keep warm.”\nBreitbart News previously reported that Gonzalez also blamed the gun for Steinle’s death, suggesting it fired accidentally because it “has no safety.”\nGonzalez does not counter claims that the stolen .40 caliber Sig Sauer pistol was in Lopez-Sanchez’s possession when Steinle was shot. Rather, he contends “there is no evidence that [Lopez-Sanchez] put his finger in the trigger.”\nLopez-Sanchez is a five-time deportee and seven-time convicted felon who was released from jail in April after San Francisco authorities refused a U.S. Immigration and Customs Enforcement (ICE) detainer request.\nHouse Minority Leader Nancy Pelosi (D-CA-12th) responded to the subsequent outrage over San Francisco’s sanctuary city policies by assuring everyone that sanctuary policies are not the problem–that, rather, guns are.\nPhoto: File\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/local/2015/09/08/attorney-in-steinle-case-blames-gunmans-poverty-lack-of-education/"}
