{"authors":["Bryant Hevesi For Daily Mail Australia"],"date_download":"2018-10-23 00:17:05","date_modify":"2018-10-23 00:17:05","date_publish":"2017-03-10 06:18:43","description":"A woman was raped just hours after losing her virginity. The woman was in her own bed at her Auckland, New Zealand home when she was raped by a man.","filename":"data/vaneerConsumption/Aucklandwomanrapedbyastrangerinherownbed.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/05/3E1FFE5300000578-0-image-a-34_1489122260903.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300010_Auckland-woman-raped-stranger-bed_1540253825.html","title":"Auckland woman raped by a stranger in her own bed","title_page":"Auckland woman raped by a stranger in her own bed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A woman was raped just hours after losing her virginity.\nThe woman was in her own bed when she was raped by a man in her Auckland, New Zealand home, the New Zealand Herald reported.\nIt was November 2015 when the then 25-year-old woman had consensual sex for the first time, with a friend at a house party she and her roommate were hosting.\nA New Zealand woman was raped hours after losing her virginity (stock image pictured)\nHours later, she went to bed and woke to find a man having sex with her.\nAs it was pitch black at the time, the woman thought it was her friend.\nBut after going to the toilet, and moving a blanket, she was horrified to realise it was another man who had been at the party who was in her bed.\nThe terrified woman ran from the room and the man fled the house before driving off.\nThe man was later arrested and he pleaded guilty to two counts of sexual violation and indecent assault.\nThe man was sentenced in the Auckland District Court (pictured)\nA woman was raped by a man in her own bed (stock image pictured)\nHe appeared before the Auckland District Court in November last year, where he was imprisoned for six years for the two counts of sexual violation.\nHe was also sentenced to two years for indecent assault, which will be served concurrently.","url":"https://www.dailymail.co.uk/news/article-4300010/Auckland-woman-raped-stranger-bed.html"}
