{"authors":["Merrill Hope"],"date_download":"2018-10-30 21:52:32","date_modify":"2018-10-30 21:52:32","date_publish":"2016-08-25 13:53:59","description":"Newly released findings in an independent audit of the Houston Independent School District reveal why a $1.9 billion bond program approved by voters in 2012 came up $211 million short.","filename":"data/vaneerConsumption/AuditBlamesHoustonPublicSchoolsFor211MillionBudgetShortfall.json","image_url":"https://media.breitbart.com/media/2016/05/Houston-ISD.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_08_25__1540936352.html","title":"Audit Blames Houston Public Schools For $211 Million Budget Shortfall","title_page":"Audit Blames Houston Public Schools For $211 Million Budget Shortfall","title_rss":"NULL","source_domain":"breitbart.com","text":"Newly released findings in an independent audit of the Houston Independent School District reveal why a $1.9 billion bond program approved by voters in 2012 came up $211 million short.\nThe audit, Making the Grade, conducted by KPMG, examined what went wrong with Houston ISD’s $1.9 billion bond program in 2012. While not a forensic fraud audit, auditors found no fraud. The report uncovered that while inflation and “increased construction activities” played pivotal roles behind the $211 million shortfall, these were not the only reasons.\n“Although we agree that the main driver of the higher than anticipated construction cost resulted from the increase construction activity in the Houston market, there were a number of limitations and constraints in HISD’s budgeting processes that contributed to the pricing variances,” the report read.\nIt suggested the school district was not equipped to handle such a massive undertaking citing “weak or nonexistent policies and procedures for budget development,” a lack of “effective and efficient organizational structure,” incomplete project assumptions, and “inconsistent construction bid evaluations.” The school district also lacked adequate oversight, according to the report.\nAuditors pointed to a “confusing management structure” both internally in the district and in hired contractors. They highlighted mistakes like the 2012 bond pricing for high school construction was “based on actual costs” for elementary school building costs in the 2007 bond program.\nThe report recommended the Houston ISD board “consider approving” budgets before bonds are finalized. Some school design concepts were loaded up with top-dollar “21st Century learning components” such as “sustainability driven influences, collaborative learning spaces, technology.” The district even created Project Advisory Teams (PAT) comprised of administrators, teachers, parents, and other perceived stakeholders, some who went “on visits to out of state schools to observe the 21st Century learning experience” for school design plans that “exceeded approved budgets.”\nIn 2012, Houston ISD wrapped big plans to renovate 40 aging campus structures and upgrade technology and security into a massive $1.9 billion bond package, the largest school bond in any Texas district’s history. HISD, the largest in Texas, is also seventh largest in the United States and serves approximately 215,000 students at 283 campuses. Its operating budget is $2,355,857,000, spending an average of $11,601 per student, according to Niche, which ranked the district 47th out of 82 best school districts in the Houston Metro area, and placed them at 605th in the state.\nIn Fall 2015, then Superintendent Dr. Terry Grier blamed inflation and construction costs for the school district’s financial woes. An internal audit suggested similar findings to the KPMG report, also listing oversight and overpayment as playing key roles. In November, the board of trustees voted to contract KPMG to evaluate why bond spending produced a $211 million shortfall. A month later, the board approved the district borrowing $212 million from taxpayers to cover the crater in the $1.9 billion bond, according to KUHF. However, it did not solve the entire problem. Houston ISD still had a $107 million gap.\nMeanwhile, an unrelated budgetary battle broke out between the taxpayers and school board members who pushed to re-brand eight Houston ISD schools with historical namesakes tied to the Confederacy. This followed the 2015 tragic shooting of nine black church parishioners during a Bible study in Charleston, SC. Although not part of the KPMG audit, this flap ended with the school board voting to saddle Houston ISD taxpayers with an addition $1.25 million to rename all eight campuses in the face of the $107 million shortfall.\nFollow Merrill Hope, a member of the original Breitbart Texas team, on Twitter.\nKPMG Houston ISD Audit by BreitbartTexas on Scribd","url":"https://www.breitbart.com/border/2016/08/25/audit-blames-houston-public-schools-211-million-budget-shortfall/"}
