{"authors":["Associated Press"],"date_download":"2018-10-23 03:03:17","date_modify":"2018-10-23 03:03:17","date_publish":"2016-01-28 18:18:02","description":"WASHINGTON (AP) — As local officials and the Justice Department begin the process of reforming troubled police departments in Baltimore, Chicago and other ci...","filename":"data/vaneerConsumption/AuditfindsDCpolicedontusefirearmsexcessively.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421019_Report-look-use-force-DC-police-7-years_1540263797.html","title":"Audit finds DC police don't use firearms excessively","title_page":"Audit finds DC police don't use firearms excessively | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Audit finds DC police don't use firearms excessively\nWASHINGTON (AP) — As local officials and the Justice Department begin the process of reforming troubled police departments in Baltimore, Chicago and other cities where officer misconduct has provoked national outrage, police in the nation's capital are showing that sustained reductions in the use of unnecessary force are possible, the department's longtime independent monitor said Thursday.\nWashington's Metropolitan Police Department agreed voluntarily to Justice Department oversight in 2001 after it was labeled the deadliest big-city police force in the nation. The oversight led to a variety of reforms and ended in 2008.\nThe District of Columbia auditor's office hired the department's former monitor, Michael Bromwich, to analyze whether, after seven years without oversight, those reforms are still having their desired effect. For the most part, they are, according to a report released Thursday that finds \"no evidence that the excessive use of force has re-emerged as a problem\" in the District.\n\"I don't think there are that many people nationwide that know that this department went through this, much earlier than most did,\" Bromwich said. \"Seven-plus years after oversight ended, things are still pretty good here.\"\nShootings by District police have dropped significantly, the report found. Officers fired their guns intentionally 28 times in 2001, 30 in 2004 and 31 in 2007. Officers opened fire seven times in 2010, nine times in 2012 and 15 times last year. The number of fatal police-involved shootings \"has consistently been in the range of three to eight per year\" in the District, which has 658,000 residents and about 3,800 sworn officers, the report found.\nThe report did find that some problems have emerged, largely surrounding investigations of use of force and officers' use of less-deadly force, including takedowns and other physical techniques. The audit contains 38 recommendations for the department, 28 of which it has agreed to follow either fully or partially, Bromwich said.\nOne recommendation that the department has chosen not to follow is to appoint internal investigators whose sole focus is to investigate use of force by officers. The department had such a unit while under oversight but has since folded it into a larger department.\nThe department also won't follow recommendations to investigate all \"takedowns\" — in which a suspect is tackled by one or more officers — or to collect data on lesser uses of force like an officer grabbing a person's arm. The department currently investigates takedowns when the person complains of pain.\n\"They're missing out on significant data,\" Bromwich said. \"If an officer is using such force repeatedly, why is that?\"\nThe report also noted that police dogs are biting people too often and recommended that the department restrict the use of dogs to people believed to be violent and warn people three times, instead of just once, before unleashing dogs. The department disagreed with the recommendation to limit canine use to violent suspect but agreed to issue more warnings \"when tactically sound.\"\nPolice Chief Cathy Lanier said she was pleased with the report's conclusions about deadly force and said the department would be diligent about implementing many of the recommendations. The points on which she disagrees are mostly minor, she said.\nLanier noted that in the late 1990s when city police gained a reputation for shooting people far too often, the city's finances were in disarray, leading to a temporary takeover by Congress. The agreement with the Justice Department brought in millions of dollars in new equipment and training for officers, allowing the department to change its culture, she said.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3421019/Report-look-use-force-DC-police-7-years.html"}
