{"authors":["Ollie Gillman","Peter Devlin For Daily Mail Australia"],"date_download":"2018-10-23 04:22:13","date_modify":"2018-10-23 04:22:13","date_publish":"2017-04-26 16:03:05","description":"A dramatic video shows the white Audi R8 slowing as its driver tries to negotiate its way around an unmarked police car that blocks its way in Sydney.","filename":"data/vaneerConsumption/AudiR8sportscarstolenatgunpointinSydney.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/23/3FA3C92500000578-0-image-a-84_1493244495395.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448070_Audi-R8-sportscar-stolen-gunpoint-Sydney_1540268533.html","title":"Audi R8 sportscar stolen at gunpoint in Sydney","title_page":"Audi R8 sportscar stolen at gunpoint in Sydney | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The driver of a stolen $230,000 sports car has been caught on camera ramming through a police roadblock as he made his getaway.\nA dramatic video shows the white Audi R8 slowing as its driver tries to negotiate its way around an unmarked police car that blocks its way.\nAn officer runs towards the luxury car and attempts to wrench the driver's door open, only for the vehicle to accelerate and smash its way past the parked police car.\nThe 'ibis white' Audi was stolen at gunpoint during a test drive in Sydney on Wednesday evening, police say, before the thief escaped from pursuing officers.\nA dramatic video shows the white Audi R8 slowing as its driver tries to negotiate its way around an unmarked police car that blocks its way\nThe driver of a stolen $230,000 sports car has been caught on camera ramming through a police roadblock as he made his getaway\nThe 30-year-old owner of the luxury vehicle, which is still missing, met with a potential buyer outside a service station at Balgowlah at 6pm on Wednesday for a test drive.\nThe passenger allegedly threatened the owner with a gun after the pair got in the car, police said.\nThe passenger hit the owner with the gun and forced them out of the car, before driving off, police said.\nThe owner suffered a cut to his left eye during the altercation.\nPolice engaged in several pursuits of the vehicle across Sydney but had to call off the chase several times because of collisions and the ramming of a police car.\nMotorist Beau Driessen told the Sydney Morning Herald that the Audi almost crashed into him by the Spit Bridge, near Balgowlah.\n'Once across the Spit Bridge, he then sped off, and then a few minutes later I saw a highway police car attempt to pull over the Audi,' he said.\n'From here on while driving into the city I saw lots of police cars patrolling the area from Mosman to the city.'\nAn officer runs towards the luxury car and attempts to wrench the driver's door open, only for the vehicle to accelerate and smash its way past the parked police car\nA driver said the Audi (left) almost crashed into him as it overtook him near the Spit Bridge\nThe Audi R8 sportscar was stolen from Sydney's northern beaches and trashed during multiple police chases (stock image of an Audi R8)\nMr Driessen has passed dashcam footage he took of the car to the police.\nThe Audi was seen driving through the Harbour and Lane Cove tunnels before heading onto the M2 motorway.\nIt was last seen near Beecroft in Sydney's north west, police said.\nThe man who stole the car is described as being of Mediterranean or Middle Eastern appearance with a thin build, possibly aged in his early 20s, police said.\nHis hair is shaved at the sides and is long on top.\nHe was wearing a long, black leather jacket, black shirt and pants and white sneakers. The man was armed with a handgun.\nPolice have urged the thief to turn himself in, saying they are 'reasonably confident' they know who he is.\nThe armed thief is 'not going to get away with it', Superintendent David Darcy warned on Thursday.\nPolice urged the public to contact authorities if they see a white Audi with NSW registration DCL86X, but not to approach the driver.\nThe 2014 model had done about 25,000km before it was taken.","url":"https://www.dailymail.co.uk/news/article-4448070/Audi-R8-sportscar-stolen-gunpoint-Sydney.html"}
