{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 19:55:26","date_modify":"2018-10-30 19:55:26","date_publish":"2016-09-01 19:59:45","description":"The survivors and family members of the Aurora, CO, theater massacre were ordered to pay the $700,000 in legal fees incurred by the theater.","filename":"data/vaneerConsumption/AuroraTheaterMassacreSurvivorsMustPay700KinLegalFees.json","image_url":"https://media.breitbart.com/media/2015/04/James-Holmes-Aurora-Theatre-shooting-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_09_01__1540929326.html","title":"Aurora Theater Massacre Survivors Must Pay $700K in Legal Fees","title_page":"Aurora Theater Massacre Survivors Must Pay $700K in Legal Fees","title_rss":"NULL","source_domain":"breitbart.com","text":"After losing a lawsuit against the Aurora, Colorado, theater, where a lone gunman killed 12 people and injured 70 others, the survivors and family members of victims were ordered to pay the $700,000 in legal fees incurred by the theater.\nThe group of survivors and family members of victims had organized to sue the Cinemark theater chain after losing loved ones during the July 20, 2012, attack. The litigants insisted that the theater chain was culpable for the attack because it did not have enough security measures in place to prevent such an incident.\nAfter a four-year court case, the theater chain won with the argument that there was nothing it could have done to prevent the massacre.\nNow, after a long battle, the victims are left with an even larger burden, as a federal judge has ordered them to pay the expenses of the winning side, the Los Angeles Times said.\nCinemark, the nation’s third-largest theater chain, billed the losing side of the lawsuit for up to $500,000 in costs incurred bringing in experts to testify on the theater’s behalf and another $200,000 in assorted costs and fees, the New York Daily News reported.\nDuring the trial, the judge had urged the group of victims to take a settlement offered by the theater chain. If they had taken the offer, they would not have been presented with the bill for legal fees.\nBut a spokesman for the victim group said that the offer was a “slap in the face.”\n“Either seek justice and go into debt, or take that pitiful offering of money and the improved public safety,” Marcus Weaver, who received a wound in the shoulder during the attack, recently told the media.\nAccording to court documents, the group had initially agreed to accept a $150,000 settlement, but one member of the group who lost her child and was left paralyzed from the attack rejected the offer, and the rest lined up in support of her decision.\nWeaver was discouraged after losing the lawsuit: “Theaters aren’t any safer,” he told the Times. “It’s almost like everything was for naught.”\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com.","url":"https://www.breitbart.com/politics/2016/09/01/aurora-theater-massacre-survivors-ordered-to-pay-700k-in-legal-fees-after-losing-lawsuit/"}
