{"authors":[],"date_download":"2018-10-23 04:48:46","date_modify":"2018-10-23 04:48:46","date_publish":"2016-01-28 21:00:48","description":"Ben Simmons, an Australian college basketball star playing for Louisiana State University, resists comparisons to NBA legend Magic Johnson even as he conside...","filename":"data/vaneerConsumption/AussiecollegestarinNBAshopwindow.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h4lc-2vdWmEltwXfba0ce28e632c9846a-733_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421690_Aussie-college-star-NBA-shop-window_1540270126.html","title":"Aussie college star in NBA shop window","title_page":"Aussie college star in NBA shop window | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Aussie college star in NBA shop window\nBen Simmons, an Australian college basketball star playing for Louisiana State University, resists comparisons to NBA legend Magic Johnson even as he considers superstar LeBron James \"like a brother.\"\nBut the 19-year-old freshman power forward from Melbourne will have the chance to show his skills Saturday against second-ranked Oklahoma and a major rival for the Wooden Award as the US college Player of the Year.\nSimmons and the Tigers play host to 16-2 Oklahoma, ranked second in this week's USA Today poll of college coaches, and Sooners' junior guard Buddy Hield.\nBen Simmons of the LSU Tigers reacts to a dunk on January 5, 2016 in Baton Rouge, Louisiana ©Stacy Revere (Getty/AFP/File)\nBoth Simmons and Hield figure to be among top choices in June's NBA Draft, with Simmons already drawing comparisons to such legends as former Los Angeles Lakers great Johnson.\n\"It's really hard to compare me to one of the greatest point forwards in the game in Magic Johnson,\" Simmons told ESPN Thursday. \"To him it's not a good comparison. I'm still in college. I try to learn things from watching LeBron or Kevin Durant.\"\nJames, the four-time NBA Most Valuable Player who has played in the past five NBA Finals with Miami and Cleveland, has made himself available to Simmons to help with the problems he might face being a high-profile youth star making the transition not only from one nation to another but from the amateur ranks to the NBA level.\n\"He has been like a big brother to me,\" Simmons said of James. \"He has been there if I need someone to talk to. If I need some good advice he is there to talk to.\"\nHield, from the Bahamas, averages 25.9 points, 5.8 rebounds and 2.5 assists a game for Oklahoma's title contenders. He ranks second among US collegiate scorers.\nSimmons, whose Tigers are only 13-7, ranks only 34th in the nation with 19.8 points a contest but is third among US collegians with 12.7 rebounds a game and also boasts 4.9 assists, 1.8 steals and 1.0 blocked shots a game over 31.4 minutes per contest.\nThe Aussie is flirting with rare feats. Only two freshmen since the 1972-73 season have scored 20 points and grabbed 10 rebounds a game.\nAnd Simmons ranks in the top five among Southeastern Conference schools in points, rebounds and assists with no player having finished the season in the top five in all three categories since the league began charting all three statistics in 1969.\n- Olympics, NBA could come this year -\nIt's no wonder that NBA scouts are longing to fit him for a uniform, although Simmons has said he hopes to play for Australia at the Rio de Janeiro Olympics in August. And he still has Louisiana State games and grades to consider before he commits to turning professional.\n\"I've got to finish this season first and my classes,\" he said. \"I'll get my grades first and then we will see what happens.\"\nCampus life is different for Simmons, who has a documentary film crew following him around as he has since high school stardom struck.\n\"We'll have to wait and see with that but it should be coming out soon,\" he said. \"It looks cool.\"\nSimmons, who moved to Florida from Australia in 2013, has adjusted to college and fame well in a region known for spicy Cajun cooking and its love for Tigers sports teams.\n\"It's a lot different just walking to classes or getting a meal. Everybody kind of recognizes you around campus, but it's cool,\" Simmons said.\n\"Just being in college, it's just different than being in high school and me being from Australia. Everything (is different), the food, the people, some Cajun food. It's a bit different but I'm enjoying it.\"\nSimmons and his roommates have friends look after their pet lizards when they are on the road, although they had to ditch the pet snakes they had earlier in the school year.\n\"We were just bored at the start of the season when nothing was happening. We've settled down on that,\" Simmons said. \"We had to get rid of those (snakes). The lizards are easy to take care of.\"","url":"https://www.dailymail.co.uk/wires/afp/article-3421690/Aussie-college-star-NBA-shop-window.html"}
