{"authors":[],"date_download":"2018-10-30 21:54:07","date_modify":"2018-10-30 21:54:07","date_publish":"2016-02-07 09:49:50","description":"Austria will extend its border controls if Turkey does not take back refugees picked up at sea on their way to Greece, Chancellor Werner Faymann said","filename":"data/vaneerConsumption/AustriaThreatenstoExtendBorderControls.json","image_url":"https://media.breitbart.com/media/2016/02/GettyImages-493198726.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_02_07__1540936447.html","title":"Austria Threatens to Extend Border Controls","title_page":"Austria Threatens to Extend Border Controls","title_rss":"NULL","source_domain":"breitbart.com","text":"VIENNA (Reuters) – Austria will extend its border controls if Turkey does not take back refugees picked up at sea on their way to Greece, Chancellor Werner Faymann said in an interview with the daily Oesterreich.\nHe had earlier said that migrants picked up at the Greek external EU border should be sent back directly to Turkey because this was the only measure that would make a radical enough impact.\nAustria is set to introduce a new border management system at Spielfeld, a key crossing point on its south-eastern border with Slovenia, which aims at speeding up applications and making the country less attractive to asylum seekers.\nMore such border management facilities on other routes may be needed if Turkey does not respond to his proposal, the chancellor was quoted as saying.\nFaymann said Turkey must make a decision by Feb. 18, when EU leaders meet for a summit.\nIt would not be a solution if Turkish border controls led to 10,000 refugees arriving at EU borders instead of 20,000, Faymann was quoted as saying in the interview.\n“Then we must secure our borders even more,” Faymann said. “To protect internal borders is a makeshift solution. But we have to be prepared.”\nAnkara and Brussels agreed to slow down the flow of migrants in a Nov. 29 deal, but refugees continue to stream into Greece.\nAustria, which has a population of 8.4 million and last year received 90,000 applications for asylum, has said that the number of refugees it will accept this year will be limited to 37,500.\nMore than one million people arrived in Europe last year, fleeing war and failing states in the Middle East and Africa.","url":"https://www.breitbart.com/europe/2016/02/07/austria-threatens-to-extend-border-controls/"}
