{"authors":[],"date_download":"2018-10-22 21:10:10","date_modify":"2018-10-22 21:10:10","date_publish":"2016-01-28 07:00:25","description":"An Australian teenager facing terror charges allegedly discussed stuffing a kangaroo with explosives, painting it with the Islamic State group symbol and set...","filename":"data/vaneerConsumption/Australianteenaccusedofplanningkangaroobombreports.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g64e-2vdWmEltwXfba0ce28e63253d214-710_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420450_Australian-teen-accused-planning-kangaroo-bomb-reports_1540242610.html","title":"Australian teen accused of planning 'kangaroo bomb': reports","title_page":"Australian teen accused of planning 'kangaroo bomb': reports | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Australian teen accused of planning 'kangaroo bomb': reports\nAn Australian teenager facing terror charges allegedly discussed stuffing a kangaroo with explosives, painting it with the Islamic State group symbol and setting it loose on police, media reported Thursday citing court documents.\nSevdet Besim, 19 -- who was arrested in counter-terrorism raids in Melbourne in April -- pleaded not guilty to four charges related to planning an attack during Anzac Day commemorations for Australian and New Zealand Army Corps troops who died in combat.\nA fifth charge of conspiring to commit a terrorist act was dropped.\nProsecutors allege that an Australian teen arrested in April had online conversations with another teenager about using a kangaroo for a terrorist attack ©Tony Ashby (AFP/File)\nProsecutors alleged that Besim had online conversations with another teenager based overseas, which involved using the marsupial during an attack.\n\"Communications resume in the early hours of Thursday 20 March 2015 with an image being sent by BESIM with a comment of 'look what I got ahaha',\" the Australian Broadcasting Corporation reported, citing court documents.\n\"The conversation continues with BESIM detailing what he did that day and they have a general discussion around animals and wildlife in Australia including a suggestion that a kangaroo could be packed with C4 explosive, painted with the IS symbol and set loose on police officers.\"\nBesim also allegedly said \"I'd love to take out some cops\" and \"I was gonna meet with them then take some heads ahaha\".\nHis court appearance came two days after authorities charged an 18-year-old Sydney teen with collecting documents on ways to stage terrorist acts.\nCanberra has been increasingly concerned about home-grown extremism and raised the terror threat alert level to high in September 2014.\nAuthorities have conducted a series of counter-terrorism raids in various cities, while the government has passed new national security laws.","url":"https://www.dailymail.co.uk/wires/afp/article-3420450/Australian-teen-accused-planning-kangaroo-bomb-reports.html"}
