{"authors":["Virginia Hale"],"date_download":"2018-10-30 19:29:46","date_modify":"2018-10-30 19:29:46","date_publish":"2017-04-19 16:09:29","description":"Austria's Interior Minister called on the EU to seal the Mediterranean route after boats ferried 9,000 migrants from Africa over Easter weekend.","filename":"data/vaneerConsumption/AustriaCallsforClosureofMediterraneanRouteAfter9000MigrantsFerriedtoEuropeatEaster.json","image_url":"https://media.breitbart.com/media/2016/10/Italy-immigration.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_04_19__1540927786.html","title":"Austria Calls for Closure of Mediterranean Route After 9,000 Migrants Ferried to Europe at Easter","title_page":"Austria Calls for Closure of Mediterranean Route After 9,000 Migrants Ferried to Europe at Easter | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Austrian Interior Minister Wolfgang Sobotka has called for the European Union (EU) to seal the Mediterranean route after 9,000 migrants were ferried from Africa during Easter weekend.\nThe minister told local media that closing the route and securing Europe’s external borders “is the only way to end the tragic and senseless dying in the Mediterranean.\n“A rescue in the open sea cannot be a ticket to Europe, because it gives criminal gangs every argument to persuade people to escape their countries for economic reasons.”\nAsked about measures Austria has in place to cope with a sudden influx of migrants over its border with Italy, Sobotka said the nation is now “equipped and able to ramp up controls within hours”.\nLast year, Austria backed closing the Western Balkan route used by migrants seeking to enter the more wealthy nations in Europe.\nDefence Minister Hans Peter Doskozil said the country was one of 16 around the Balkan route, used by more than a million migrants to journey from Greece into Europe, who are working together to defend the borders.\nAccording to United Nations (UN) aid agencies, nearly 9,000 migrants were picked up by European vessels and private charity ships in the Mediterranean over the Easter weekend.\nDespite the record-breaking numbers last year, Italy has seen a 30 per cent rise in immigration in the first quarter of 2017 over the same period in 2016.\nWith the Easter weekend arrivals, the year’s total immigration into Italy now exceeds 37,000.\nLast month, the European agency in charge of border control, Frontex, released a report accusing NGOs and “aid” organisations operating in the Mediterranean of complicity in human trafficking by lowering their costs and improving their “business model”.\n“Migrants and refugees – encouraged by the stories of those who had successfully made it in the past – attempt the dangerous crossing since they are aware of and rely on humanitarian assistance to reach the EU,” the report said.","url":"https://www.breitbart.com/europe/2017/04/19/austria-mediterranean-9000-migrants/"}
