{"authors":["Associated Press"],"date_download":"2018-10-22 23:59:17","date_modify":"2018-10-22 23:59:17","date_publish":"2017-03-16 08:34:17","description":"MANILA, Philippines (AP) - Australia urged Southeast Asian nations and China to conclude a legally binding code of conduct in the South China Sea as soon as...","filename":"data/vaneerConsumption/AustraliacallsforenforceableSouthChinaSeapactsoon.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319200_Australia-calls-binding-conduct-code-South-China-Sea_1540252757.html","title":"Australia calls for enforceable South China Sea pact soon","title_page":"Australia calls for enforceable South China Sea pact soon | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MANILA, Philippines (AP) - Australia urged Southeast Asian nations and China to conclude a legally binding code of conduct in the South China Sea as soon as possible, voicing concern Thursday about the scale of reclamation and construction by China in the disputed territory.\nAustralian Foreign Minister Julie Bishop, speaking in Manila, urged the 10-member Association of Southeast Asian Nations and China to go beyond ongoing discussions to craft a framework of the code of conduct and rapidly conclude an enforceable regional nonaggression pact.\n\"We believe that ASEAN should drive for an enforceable code of conduct,\" Bishop told the forum of the ADR Institute for Strategic and International Studies. \"I would urge ASEAN under the Philippines' leadership to go further and conclude a code of conduct as soon as possible.\"\nActing Philippine Foreign Secretary Enrique Manalo said in a separate news conference that diplomats from ASEAN member states and China were progressing in efforts to draft a framework of the code although he refused to provide details.\nNegotiations for a stronger code of conduct in the disputed region have dragged on for years with China being blamed for stonewalling while it was quietly transforming seven disputed reefs into islands in recent years.\nCritics of China's assertive actions say Beijing may be giving a small concession by agreeing to complete a framework of the code because it has completed its current island-making works. China's once-frosty ties with the Philippines have also turned around under President Rodrigo Duterte, who has sought Chinese investments and aid while putting aside territorial disputes with Beijing.\nDuterte holds ASEAN's rotating chairmanship this year and will host its annual summits of its heads of state with other Asian and Western leaders.\nBishop said an enforceable code of conduct could be based on the recommendations made by the Hague-based arbitration tribunal last year when it ruled on a case filed by the Philippines against China.\nThe tribunal invalidated China's sweeping territorial claims in the South China Sea and ruled that China violated the rights of Filipinos to fish at Scarborough Shoal, which lies off the northwestern Philippines. Beijing had seized Scarborough in 2012 after a dangerous standoff with Philippine vessels.\nChina has since allowed Filipino fishermen to return to the shoal, but it does not recognize the tribunal's ruling as valid and insists it has historical claims to almost the entire South China Sea.\n\"Australia opposes the scale of reclamation and reconstruction that has occurred and certainly we do not support militarization by any party of the islands and the other features in the South China Sea because it would raise tensions, it would raise the prospect of conflict,\" Bishop said, referring to reports of China installing a missile-defense system in its man-made islands.\nA rules-based international order is fundamental to prosperity and stability of countries in the region and \"we should all advocate for its preservation and be prepared to defend it, even fight for it, should that be necessary,\" Bishop said.\nAustralia supports U.S. leadership to preserve that regional order and safeguard international peace but is also committed to a strong Australian defense force to defend its own security interests, she said.\nAustralia will spend $195 billion over the next decade on improving its military and intelligence capability, she said.","url":"https://www.dailymail.co.uk/wires/ap/article-4319200/Australia-calls-binding-conduct-code-South-China-Sea.html"}
