{"authors":["Mary Chastain"],"date_download":"2018-10-30 20:37:41","date_modify":"2018-10-30 20:37:41","date_publish":"2015-08-14 18:35:32","description":"Prime Minister Tony Abbott confirmed Australia might join the U.S.-led coalition against ISIS in Syria along Turkey’s border.","filename":"data/vaneerConsumption/AustraliaMightJoinAirstrikesAgainstISISinSyria.json","image_url":"https://media.breitbart.com/media/2015/02/Tony-Abbott-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_08_14__1540931861.html","title":"Australia Might Join Airstrikes Against ISIS in Syria","title_page":"Australia Might Join Airstrikes Against ISIS in Syria","title_rss":"NULL","source_domain":"breitbart.com","text":"Prime Minister Tony Abbott confirmed that Australia might join the U.S.-led coalition against the Islamic State (ISIS/ISIL/IS) in Syria along Turkey’s border.\nThe government had participated in strikes in Iraq, but never crossed over to Syria because they do “not recognise President Bashar al-Assad.” Abbott said the U.S. has not asked Australia to join, but the two forces talked about it.\n“While the legality is different, whether these air strikes are taking place in Syria or Iraq, the morality is the same,” explained Abbott.\nThe Labor Party supports strikes, but, like Abbott, does not believe the government should take any action until legal issues are resolved.\n“Without a clear legal basis for Australian involvement and without a clear plan–like, what does victory in Syria look like?–I think it would be very dangerous to send Australian personnel into one of the most dangerous places on Earth right now,” stated Tanya Plibersek, spokeswoman for the Labor Party on foreign affairs.\nIn December, Australian Foreign Minister Julie Bishop issued a ban on travel to Syria’s Raqqa province due to a large number of Australians fleeing to fight for the terrorist group: “Under the provisions of our foreign fighters legislation, I have today declared al-Raqqa province an area where a listed terrorist organisation is engaging in hostile activity,” she said. “This now makes it an offence under Australian law to enter or remain in the province of al-Raqqa without a legitimate reason. Anyone who enters or remains faces a penalty of up to 10 years’ imprisonment.”\nOver 75 passports were canceled and ten people were denied passports under the new law passed in September. Anyone who breaks the law, which “includ[es] family visits, journalism or aid work,” could receive a sentence of 10 years in prison. The law allows spies to monitor the Australian Internet for anyone who passes out confidential “information … [that] relates to a special operation.” These people can also receive 10 years in prison.\nAt that time, the government believed 70 citizens were working with ISIS. Another estimate in February put the number between 150-300. But some quickly realize that life in the Caliphate is much different without the tinted glasses, which means a return to their native land.\nThe topic is extremely controversial in Australia, especially after the wife of Australian terrorist Khaled Sharrouf announced she wants to come home with her five children. David Sharma, Australia’s ambassador to Israel, spoke with i24news about a possible new law that “would revoke the citizenship of dual-nationals known to have gone abroad to fight.” Sharma said it would not be right to revoke citizenship of those who only hold Australian citizenship because it is “not consistent with being part of the international community.” He said those people “will face ‘the full extent of the law,’” which echoes Abbott’s thoughts. He issued a harsh warning that the Sharrouf family will face punishment for their crimes.\n“Crime is crime is crime, and criminals will face the full severity of Australian law, whether they’re male or female,” he said. “I’m afraid you don’t get off scot-free just because you say, ‘I’ve seen the error of my ways.’”\nAt least 30 Australians returned from fighting with ISIS, but Sharma said “an additional 155 are known to be providing support to the militant group.” There is no room to “rehabilitate” anyone who joined ISIS.\n“Whilst Australia is a compassionate country, there is little sympathy amongst the Australian public for those who have gone to fight with IS in Syria; the public expects them to face the full consequences of the law should they return,” he explained.","url":"https://www.breitbart.com/national-security/2015/08/14/australia-might-join-in-airstrikes-against-isis-in-syria/"}
