{"authors":[],"date_download":"2018-10-22 23:03:00","date_modify":"2018-10-22 23:03:00","date_publish":"2016-01-11 04:26:27","description":"Australian pacemen Joel Paris and Scott Boland will make their international debuts but Shaun Marsh will miss out when the one-day series opener against Indi...","filename":"data/vaneerConsumption/AustralianewboysParisBolandtofaceIndiainODIseries.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z64c-48qEJGFphM8d437f0aaf9203beff-491_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3393364_Australia-new-boys-Paris-Boland-face-India-ODI-series_1540249380.html","title":"Australia new boys Paris, Boland to face India in ODI series","title_page":"Australia new boys Paris, Boland to face India in ODI series | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Australia new boys Paris, Boland to face India in ODI series\nAustralian pacemen Joel Paris and Scott Boland will make their international debuts but Shaun Marsh will miss out when the one-day series opener against India starts in Perth on Tuesday.\nWestern Australia's Paris and Victoria's Boland get their chance following the retirement of Mitchell Johnson and injury to Mitchell Starc.\nAustralia captain Steve Smith said Paris's left-arm swing in his home conditions swayed the selectors in his favour.\nAustralian bowler Scott Boland (R) speaks with teammate Nathan Lyon after Australia defeat the West Indies in the Test series on the final day of the third match in Sydney on January 7, 2016 ©William West (AFP/File)\n\"Traditionally we like to play a left-armer here who can use the breeze and move the ball so hopefully he'll be able to do that for us tomorrow,\" Smith told reporters on Monday.\n\"He's been very impressive in the (one-day) Matador Cup in the last couple of years and in the T20 Big Bash this year. We look forward to seeing how he goes.\n\"It's a good opportunity for him and some other young quicks around the country. So it's an exciting time for Joel to make his debut at the WACA.\"\nBoland gets the nod after being on the fringes of the Australian Test team this season.\n\"His death bowling has been very impressive,\" said Smith of Boland's efforts with the Melbourne Stars in the BBL.\n\"I think he hits a yorker as well as anyone at the moment. He's got a bit of pace to him so hopefully he can hurry up the Indian batters a bit.\"\nSmith said he would decide who takes the important final overs of the Indian innings on the day.\n\"We've got a few options, all of our fast bowlers in this game can perform a role at the death,\" Smith said.\nMarsh, who has scored 218 runs in five matches for the Perth Scorchers in the BBL at 72.67, could not force his way back into the Australian team with George Bailey filling the batting spot left by the retirement of former captain Michael Clarke.\n\"It's very difficult but Shaun's been exceptional,\" Smith said.\nMarsh has been unlucky this season after scoring his highest Test score of 182 in the first Test against the West Indies in Hobart, only to make way for the return from injury of Usman Khawaja in the second Melbourne Test.\n\"He hasn't whinged once, he's taken it on the chin and he's been great around the group,\" Smith said.\n\"He's been really impressive and hopefully every time he goes back (to state cricket) he can continue to dominate, keep scoring big runs and to put his name up there.\"\nAustralia - David Warner, Aaron Finch, Steve Smith (capt), George Bailey, Glenn Maxwell, Mitchell Marsh, Mathew Wade, James Faulkner, Joel Paris, Scott Boland, Josh Hazlewood.","url":"https://www.dailymail.co.uk/wires/afp/article-3393364/Australia-new-boys-Paris-Boland-face-India-ODI-series.html"}
