{"authors":["Merrit Kennedy"],"date_download":"2018-10-22 23:07:37","date_modify":"2018-10-22 23:07:37","date_publish":"2018-07-01 00:00:00","description":"While environmental groups and many shoppers are applauding the change, the initial implementation has been tense at times.","filename":"data/vaneerConsumption/AustralianStatesAndRetailChainsBanSingleUsePlasticBags.json","image_url":"https://media.npr.org/assets/img/2018/07/01/rtx6a9h4_wide-4906a133ce4d6b3528f89f6152463c6f1b8b95eb.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_07_01_625145032_australian-states-and-retail-chains-ban-single-use-plastic-bags_1540249657.html","title":"Australian States And Retail Chains Ban Single-Use Plastic Bags","title_page":"Australian States And Retail Chains Ban Single-Use Plastic Bags : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Australian States And Retail Chains Ban Single-Use Plastic Bags\nEnlarge this image toggle caption Jill Gralow/Reuters Jill Gralow/Reuters\nTo cut down on waste from single-use plastic bags, some of Australia's largest retailers are banning them.\nAnd while environmental groups and many shoppers are applauding the move, implementing the change has been tense at times.\nA man enraged that he was not being provided a free plastic bag apparently placed his hands around the throat of a Woolworths employee, according to The West Australian.\nThe Australian states Queensland and Western Australia, and retail chains Coles and Big W are placing new restrictions on these bags as of July 1. On June 20, Woolworths said it had removed single-use plastic bags from its stores nationwide. The states of Tasmania and South Australia have previously banned this type of plastic bag.\nThat means that as it stands now, \"major retailers in all but two Australian states will be fined if they supply single-use plastic bags,\" as Reuters reported.\nThe reported abuse at market checkouts prompted the SDA, a union representing retail workers, to launch a campaign called \"Don't Bag Retail Staff.\"\nThe union released an ad showing a man berating a shop employee, asking why he can't have a free bag. They're approached by two people dressed like a turtle and a fish. \"Uh, I think you know why, mate,\" says the turtle, looking disgusted.\nSDA Union YouTube\n\"While we understand that some customers may be frustrated by this change, there is absolutely no excuse for abusive or violent behaviour towards retail staff,\" SDA National Secretary Gerard Dwyer said in a statement.\n\"The union conducted a survey earlier this week and of 132 members who responded, 57 said they suffered abuse due to the plastic bag ban,\" according to Reuters.\nReuters reported that Woolworths will offer free reusable bags to customers until July 8 in response to the tensions. \"They just want a little extra help from us to get through the transition,\" Claire Peters, Woolworths managing director, said in a statement to the wire service.\nColes, one of the retailers that has implemented a ban, has also pledged to \"halve food waste across its supermarkets by 2020.\"\nAccording to the U.N., \"up to 5 trillion single-use plastic bags are used worldwide every year.\" And, the amount of plastic waste produced globally each year is \"nearly equivalent to the weight of the entire human population.\"\nThe expanding ban in Australia is part of a global shift. As the BBC reported, \"around 40 [countries] have banned single-use plastic bags, with charges or outright prohibitions in place in China, Bangladesh. and about 15 African countries.\"","url":"https://www.npr.org/2018/07/01/625145032/australian-states-and-retail-chains-ban-single-use-plastic-bags"}
