{"authors":["Shayan Shankar For Daily Mail Australia"],"date_download":"2018-10-22 23:15:22","date_modify":"2018-10-22 23:15:22","date_publish":"2017-03-10 02:34:20","description":"Footage shot by the Australian Reptile Park shows five turtles gobbling up a juicy watermelon for their afternoon snack while one hungry turtle ignores the proper dining etiquette.","filename":"data/vaneerConsumption/AustralianReptileParkturtlesmunchonmelon.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/02/3E1F435E00000578-0-image-a-45_1489113144985.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299584_Adorable-turtles-munch-watermelon-Sydney_1540250122.html","title":"Australian Reptile Park turtles munch on melon","title_page":"Australian Reptile Park turtles munch on melon | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sharing food can have its share of complications, but one eager turtle wasn't about to let courtesy get in the way of hunger.\nAdorable footage shot by the Australian Reptile Park shows five turtles munching on a juicy watermelon for their afternoon snack at the wildlife sanctuary in Somersby.\nBut not letting table manners get in the way of a good feed, one hungry turtle ignored his fellow diners and crawled his way all over fruit, taking a bite wherever it could.\nScroll down for video\nA cheeky turtle ignored his friends while he climbed on top of a watermelon to munch on his fruity snack\nWhile turtles are known for their diets of protein and calcium, the five turtles were clearly enjoying a break from their usual cuisine.\nThe rogue turtle began its journey through the watermelon peacefully enough but it didn't take long for it to work its way through.\nAt one point all four of its webbed feet rested entirely upon the watermelon as it snacked away.\nThe hand of a zookeeper could be seen lifting the turtle back to the watermelon's rind multiple times when the turtle strayed too far.\nMeanwhile his dining comrades sat patiently around the edge, utilising proper eating etiquette while doing their best to ignore their keen friend.\nOne frustrated turtle had to stop its eating while it was being bumped into by the ravenous reptile who cared little for the boundaries the others were observing.\nThe five turtles began their dining experience relatively normally, before the hungry turtle started to take over\nThe turtles enjoyed their afternoon snack at the Australian Reptile Park wildlife sanctuary in Somersby","url":"https://www.dailymail.co.uk/news/article-4299584/Adorable-turtles-munch-watermelon-Sydney.html"}
