{"authors":["Jenny Awford For Daily Mail Australia"],"date_download":"2018-10-22 20:56:11","date_modify":"2018-10-22 20:56:11","date_publish":"2016-01-28 05:12:09","description":"Sevdet Ramadan Besim, 19, (pictured) is also accused of plotting to run down and behead a police officer at a Veterans' Day ceremony in Melbourne last year.","filename":"data/vaneerConsumption/AustralianplannedtopackkangaroowithbombforISISinAnzacDayterrorplot.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/09/30A8437100000578-0-image-a-2_1453974915487.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420357_Australian-accused-planning-pack-kangaroo-bomb_1540241771.html","title":"Australian 'planned to pack kangaroo with bomb for ISIS' in Anzac Day terror plot","title_page":"Australian 'planned to pack kangaroo with bomb for ISIS' in Anzac Day terror plot | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A teenager allegedly planned to pack a kangaroo with explosives, paint it with an Islamic State symbol and set it loose on police officers in an Anzac Day terror plot, a court has heard.\nSevdet Ramadan Besim, 19, is also accused of plotting to run down and behead a police officer at a Veterans' Day ceremony in Melbourne last year.\nHe has been ordered to stand trial in the Victorian Supreme Court after pleading not guilty to four terror charges.\nBesim, from Hallam, in Melbourne's outer south-east, was arrested along with four alleged conspirators in April 2015 - a week before Anzac Day. He has been in custody since.\nSevdet Ramadan Besim, 19, (pictured) allegedly planned to pack a kangaroo with explosives, paint it with an Islamic State symbol and set it loose on police officers in an Anzac Day terror plot, a court has heard\nProsecutors alleged on Thursday that he was discussing the planned attack with a British accomplice as well as doing online searches about Gallipoli landings commemoration events.\nHe allegedly said he was 'ready to fight these dogs on there [sic] doorstep', according to court documents.\n'I'd love to take out some cops,' Besim is alleged to have written. 'I was gonna meet with them then take some heads.'\nThe ABC also quoted a document presented by prosecutors that summarised the alleged conversation about the kangaroo bomb.\nMultiple photos of Besim on his social media pages show him posing with one raised index finger, a symbol that other ISIS supporters have also frequently used\nHe has been ordered to stand trial in the Victorian Supreme Court after pleading not guilty to four terror charges\nBesim allegedly sent an image on 20 March 2015 saying 'look what I got ahaha', the court documents said.\n'The conversation continues with BESIM detailing what he did that day and they have a general discussion around animals and wildlife in Australia including a suggestion that a kangaroo could be packed with C4 explosive, painted with the IS symbol and set loose on police officers.'\nBesim allegedly also said: 'Main thing I guess is that I send the dog to hell'.\nThe 19-year-old has been in custody since 18 April, when 200 heavily armed officers swooped on the city's south-east, arresting five teens and seizing knives and swords.\nHe will appear in the Supreme Court charged with planning an Islamic State group-inspired terrorist attack at services in Melbourne and the neighboring city of Dandenong to mark Anzac Day.\nHe will appear in the Supreme Court charged with planning an Islamic State group-inspired terrorist attack at services in Melbourne, pictured is the Dawn Service on Anzac Day in 2015\nThe campaign for the 1915 Gallipoli landings in Turkey was the The campaign was the first major military action fought by the Australian and New Zealand Army Corps during the First World War.\nPolice have alleged that Besim was motivated by an extremist ideology and had expressed support for terrorist organizations, particularly the Islamic State movement.\nBesim faces a potential life sentence in prison if convicted.\nA British court in October sentenced a 15-year-old boy from Blackburn, northwestern England, for his part in the ANZAC Day plot.\nIn passing sentence in the Manchester Crown Court, Judge John Saunders said the teenager, who can't be named because of his age, would only be released when he was no longer a danger to the public.","url":"https://www.dailymail.co.uk/news/article-3420357/Australian-accused-planning-pack-kangaroo-bomb.html"}
