{"authors":[],"date_download":"2018-10-22 22:26:39","date_modify":"2018-10-22 22:26:39","date_publish":"2016-01-29 09:30:26","description":"Thousands of students were evacuated from schools in two Australian states Friday following hoax bomb threats, with local media saying they could be linked t...","filename":"data/vaneerConsumption/Australianschoolsevacuatedinlockdownafterthreats.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h8e9-4PuZeKVXE7cd9005b2c8767ceec4-312_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422437_Australian-schools-evacuated-lockdown-threats_1540247199.html","title":"Australian schools evacuated, in lockdown after 'threats'","title_page":"Australian schools evacuated, in lockdown after 'threats' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Australian schools evacuated, in lockdown after 'threats'\nThousands of students were evacuated from schools in two Australian states Friday following hoax bomb threats, with local media saying they could be linked to similar scares in Europe.\nSeveral schools in New South Wales, home to Australia's largest city Sydney, and Victoria reportedly received bomb threats and were either evacuated or locked down.\nOn Thursday more than 20 schools in France, Italy and Britain were placed on alert after receiving threatening phone calls.\nSeveral schools in New South Wales, home to Australia's largest city Sydney, and Victoria reportedly received bomb threats and were either evacuated or locked down ©Peter Parks (AFP/File)\nOn Tuesday six Paris schools and 14 in Britain were evacuated after hoax bomb threats.\n\"Victoria Police can confirm it is treating the threatening phone calls received by a number of Victorian schools today as a hoax,\" Victoria Police said in a statement, without naming the schools or stating how many were affected.\n\"We are aware that schools in a number of other states and countries have received similar phone calls in the past 24 hours.\"\nVictoria Police added that there was no immediate threat to schools and the threats were not terrorism-related.\nA NSW Police spokesman told AFP they were investigating the matter but made no further remarks. An Australian Federal Police spokeswoman would not comment on the incidents.\nAssistant principal Rod McKenzie of Cowes Primary School, on an island off Victoria, told Melbourne's Herald Sun newspaper a receptionist received a \"computerised\" message through a phone call which said there was a \"bomb in a backpack but no more specifics\".\nThe threats to the French and British schools on Tuesday were claimed by a Twitter account calling itself the Evacuation Squad, with a profile picture of Russian President Vladimir Putin.\nBut the Sydney Morning Herald said an email it purportedly received from the group denied they were behind the Australian hoaxes.\n\"We have only targeted schools in Europe, Canada, The United States, South Africa, and Japan,\" Fairfax reported the email as saying, citing the user name Viktor Olyavich.\n\"We are unsure of who it is (behind the Australian attacks). It is most likely a 'copycat' incident.\"\nAustralia raised its terror alert level to high in 2014, introduced new national security laws and conducted several counter-terrorism raids across the country amid growing fears of home-grown extremism.","url":"https://www.dailymail.co.uk/wires/afp/article-3422437/Australian-schools-evacuated-lockdown-threats.html"}
