{"authors":[],"date_download":"2018-10-22 21:10:45","date_modify":"2018-10-22 21:10:45","date_publish":"2016-01-29 05:50:25","description":"Australia are working hard to deal with New Zealand's dangerous swing bowlers, captain Steve Smith said Friday on the eve of leading an advance touring party...","filename":"data/vaneerConsumption/AustraliancricketersworkinghardtobeatNewZealandswing.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h774-3bmscybNe842cce83474b5100341-532_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422213_Australian-cricketers-working-hard-beat-New-Zealand-swing_1540242645.html","title":"Australian cricketers working hard to beat New Zealand swing","title_page":"Australian cricketers working hard to beat New Zealand swing | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Australian cricketers working hard to beat New Zealand swing\nAustralia are working hard to deal with New Zealand's dangerous swing bowlers, captain Steve Smith said Friday on the eve of leading an advance touring party across the Tasman Sea.\n\"We're very hungry for New Zealand, we haven't performed extremely well away from home recently,\" Smith admitted.\n\"That's a big thing on my agenda.\"\nNew Zealand's Trent Boult is ranked the world's top ODI bowler ©Michael Bradley (AFP/File)\nAustralia have won Test series at home against the West Indies and New Zealand this southern summer, but notably surrendered the Ashes in England last year.\n\"It's gonna be a tough one for us, they (New Zealand) play very well at home,\" Smith said.\nHe lifted the lid a little on what his team were doing to counter the threat from left-armer Trent Boult, ranked the world's top ODI bowler.\n\"There's a few different things you can do,\" he said, listing using a bowling machine or softer balls that swing quite a lot.\n\"It's hard to train... and try and form sort of a new technique.\n\"Guys know what to expect and we've got to keep working on it as much as we can and be ready to go,\" he said.\nThere could be some relief for the tourists however with reports that Boult's new ball partner Tim Southee may not recover from a foot injury in time.\n\"I think the wickets in New Zealand for one-day cricket are gonna swing around a bit,\" Smith said.\n\"We're gonna get some practise in on those conditions.\n\"They're gonna prepare wickets that are gonna do a bit.\"\nAustralia also had the tools to exploit the local conditions, Smith added.\n\"We've got some bowlers there to hopefully get a bit out of that and the batters are gonna have to adapt a little bit better than we have previously,\" he said.\n\"It's a big challenge, we're gonna have to be at our best if we want to beat them.\"\nThe Chappell-Hadlee Trophy ODI series starts in Auckland on February 3 and moves on to Wellington on February 6 and Hamilton February 8.\nTwo Test matches follow in Wellington from February 12 and Christchurch from February 20.","url":"https://www.dailymail.co.uk/wires/afp/article-3422213/Australian-cricketers-working-hard-beat-New-Zealand-swing.html"}
