{"authors":[],"date_download":"2018-10-30 21:54:06","date_modify":"2018-10-30 21:54:06","date_publish":"2015-12-30 00:05:22","description":"Austria has sent hundreds of migrants back to neighbouring Slovenia in the past three days for lying about their nationality.","filename":"data/vaneerConsumption/AustriaTurnsAwayHundredsofMigrantsforLyingAboutNationality.json","image_url":"https://media.breitbart.com/media/2015/12/Slovenia-Austria-migrants-Getty.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_12_29__1540936446.html","title":"Austria Turns Away Hundreds of Migrants for Lying About Nationality","title_page":"Austria Turns Away Hundreds of Migrants for Lying About Nationality","title_rss":"NULL","source_domain":"breitbart.com","text":"VIENNA – Austria has sent hundreds of migrants back to neighbouring Slovenia in the past three days for lying about their nationality in an apparent attempt to improve their chances of being granted asylum, a police spokesman said on Tuesday.\nSince the summer, hundreds of thousands of migrants have crossed into Austria, the last country on the so-called Balkan route to Germany, the chosen destination for most of the migrants. Many are bussed through Austria straight to the German border.\nIn spot checks of the 3,000 daily arrivals in the southern province of Carinthia, police and translators noticed a rise in the number of unregistered people whose language skills did not match their purported nationality, the spokesman said.\n“We assume that some are trying to take advantage of the situation, knowing very well that they have little chance of being granted asylum in Austria and Germany,” he said, adding that hundreds of such migrants had been sent straight back to Slovenia since Dec. 26.\nIn 2014, migrants from Syria and Afghanistan were granted asylum in more cases than people from any other countries. The spokesman for the police in Carinthia declined to say where the migrants who were sent back to Slovenia were from.\nThe flow of migrants into Austria from Slovenia has been shifted to Carinthia while new infrastructure including barriers to control crowds is put in place at the main crossing between the two countries, further the east in the province of Styria.\n(Reporting By Shadia Nasralla; editing by Francois Murphy, Larry King)","url":"https://www.breitbart.com/europe/2015/12/29/austria-turns-away-hundreds-of-migrants-for-lying-about-nationality/"}
