{"authors":["Daniel Piotrowski","Liam Quinn For Daily Mail Australia"],"date_download":"2018-10-22 23:32:58","date_modify":"2018-10-22 23:32:58","date_publish":"2016-01-11 06:25:45","description":"Experts have warned people need to embrace 'a new normal' for the Australian Dollar of as low as 65 cents, after more than $100 billion plunged from the stock market.","filename":"data/vaneerConsumption/Australiasstockmarketsuffers100BNfallbiggestwipeoutin2andhalfyears.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/09/3006807D00000578-0-image-a-18_1452503835973.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393445_The-holiday-s-Australians-stock-market-suffers-staggering-100-BILLION-fall-biggest-wipeout-two-half-years_1540251178.html","title":"Australia's stock market suffers $100BN fall, biggest wipeout in 2-and-half years","title_page":"Australia's stock market suffers $100BN fall, biggest wipeout in 2-and-half years | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Experts have warned people need to embrace 'a new normal' for the Australian Dollar of as low as 65 cents, after more than $100 billion plunged from the stock market.\nThe Australian Stock Exchange (ASX) has endured a tumultuous start to the year, with more than $100 billion coming off the board in the first 11 days of 2016.\nThe volatility hit the currency market on Monday, as the Australian Dollar (AUD) dramatically plunged to US$69.30 cents in early trading - more than one cent lower than it was last week.\nThe dollar is also expected to continue its struggle against the Great Britain Pound, which has increased in value compared to the AUD in the early stages of 2016.\nScroll down for video\nExperts have warned people need to embrace 'a new normal' for the Australian Dollar of as low as 65 cents, after more than $100 billion plunged from the stock market (stock image)\nNAB Global Co-Head of FX Strategy Ray Attrill said the drop is in line with global financial factors, and the current level is what Australians should expect for the foreseeable future.\n'The fall in the last week has been driven by massive increases in market volatility levels,' Mr Attrill told Daily Mail Australia.\n'There'll likely be more weaknesses ahead - it's conceivable we could fall to about 65 cents.\n'The things that equated to such a strong, above parity dollar are gone. The USD was weak and at the same time commodity prices continued to head north.\nExperts warn current levels for the Australian Dollar, which has dropped with the market, should be seen as 'the new normal' (stock picture)\n'That was really the cocktail that drove the Australian dollar - none of those factors exist today, this is absolutely the new normal.'\nMr Attrill also said there's a chance of further severe falls in future, but said it is more likely there is a 'slight downtime to come'.\n'For the dollar to drop to 60 a lot would have to happen - we'd almost need a GFC-styed event, commodities would have to plummet further... neither or those are on the horizon right now,' he told DMA.\nIt comes after Commsec analyst Steven Daghlian said: 'It's been a terrible start to a new year, to 2016, with really heavy losses'.\nNAB Global Co-Head of FX Strategy Ray Attrill said the AUD's drop is in line with global financial factors - such as a downturn in China\nDistraught investors watch the market indicator boards at the Australian Stock Exchange on January 5, 2016\nMr Daghlian said 'no sector has... been exempt from the selling'.\nHousehold names such as Rio Tinto and BHP each dropped around 4 per cent and the banking sector plunged across the board.\nThe falls have been driven by big drops on the Chinese sharemarket - which lost about 10 per cent of its value last week, Mr Daghlian said.\nThe falls come as the Chinese Central Bank devalued its currency in a bid to stimulate the economy. New sharemarket rules have also caused troubles.\n'The things that equated to such a strong, above parity dollar are gone. The USD was weak and at the same time commodity prices continued to head north,' NAB Global Co-Head of FX Strategy Ray Attrill says\nBut Mr Daghlian said the dramatic falls recently were probably inevitable given China's huge growth since mid-2014.\n'From June 2014 to 2015 Chinese markets rose 150 per cent while the Aussie market rose three per cent and the U.S. something like seven,' he said.\n'(With) unsustainable gains we were always going to see a pullback at some stage and that's what we've seen in the past seven months'.\nAn investor looks through stock information at a trading hall of a securities firm in Hangzhou, capital of east China's Zhejiang Province\nMr Daghlian said there was not cause for concern just yet: 'It's not like the global economy is suddenly deteriorating in a really big way'.\nLooking at the big picture, he said the first two weeks of 2016 had just erased the final two weeks of 2015. 'It's always difficult to look ahead and see what will happen.\n'There have been years where the market has fallen by a substantial amount in the early part of the year and things generally tend to recover.","url":"https://www.dailymail.co.uk/news/article-3393445/The-holiday-s-Australians-stock-market-suffers-staggering-100-BILLION-fall-biggest-wipeout-two-half-years.html"}
