{"authors":[],"date_download":"2018-10-22 22:06:24","date_modify":"2018-10-22 22:06:24","date_publish":"2014-06-08 11:26:44","description":"Police and rangers in Australia shot dead two crocodiles, one of which they believe contains the remains of a man taken from his boat.","filename":"data/vaneerConsumption/AustraliaCopsKillTwoCrocodilesFindHumanRemainsInsideOne.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/494911/auscroc_140608-8a_03c54c8654b63efff93f7be87f1a9b28.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_australia-cops-kill-two-crocodiles-find-human-remains-inside-one-n125541_1540245984.html","title":"Australia Cops Kill Two Crocodiles, Find Human Remains Inside One","title_page":"Australia Cops Kill Two Crocodiles, Find Human Remains Inside One","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPolice and rangers in Australia shot and killed two crocodiles Sunday, one of which they believe contains the remains of a man taken from his boat, local media reported.\nThe 62-year-old man was attacked at a popular tourist spot in Kakadu National Park, south-east of Darwin in Northern Territories.\nIt is understood the man's wife, son and daughter-in-law were with him at the time, Australian national broadcaster ABC News reported.\nSergeant Andrew Hocking of Northern Territory Police said: \"Kakadu rangers using their expertise of crocodile behavior managed to locate two large salt-water crocodiles in a billabong. Two of those crocodiles were shot and killed.\n“One of those crocodiles was later examined and a quantity of human remains were recovered.\"\nHe added: \"The crocodile that was shot and killed and containing remains was in excess of 4.7 metres.\"\nCrocodile expert Graeme Webb told Australia's ABC News it is unusual for crocodiles to attack at this time of the year.\n\"Attacks usually occur in the warmer months of the year when the crocs are more active and they need more food, so it's unusual to have an attack like this at this time of year,\" he said.\nAlastair Jamieson","url":"https://www.nbcnews.com/news/world/australia-cops-kill-two-crocodiles-find-human-remains-inside-one-n125541"}
