{"authors":["Nick Hallett"],"date_download":"2018-10-30 21:55:39","date_modify":"2018-10-30 21:55:39","date_publish":"2016-02-16 14:42:06","description":"Austria is set to introduce a daily cap on the number of migrants allowed into the country as it struggles to deal with record levels of immigration.","filename":"data/vaneerConsumption/AustriatoIntroduceDailyCaponMigrantsasitStrugglestoDealwithInflux.json","image_url":"https://media.breitbart.com/media/2016/02/GettyImages-493198726.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_02_16__1540936539.html","title":"Austria to Introduce Daily Cap on Migrants as it Struggles to Deal with Influx","title_page":"Austria to Introduce Daily Cap on Migrants as it Struggles to Deal with Influx","title_rss":"NULL","source_domain":"breitbart.com","text":"Austria is set to introduce a daily cap on the number of migrants allowed into the country as it struggles to deal with record levels of immigration.\nThe cap will apply to migrants crossing into the country from the border with Slovenia, the next country down the migrant trail, although exact details on the number allowed to cross and how they will be monitored have yet to be announced, Die Welt reports.\nThe move marks a dramatic reversal of policy from a few months ago, when the Austrian government refused to build any fence along its border and strongly criticised Hungary for closing its frontier with Serbia.\nIn November, the sheer number of new arrivals forced the government into an embarrassing climb-down, with Chancellor Werner Faymann announcing the construction of a razor-wire fence.\nInterior Minister Johanna Mikl-Leitner added that “a fence is not a bad thing. Anyone who has a house, has a garden and a fence.” However, she then spoke of her distaste for the word, asking journalists: “If it is possible to avoid the word ‘fence’ from a technical point of view, then that’s fine by me.”\nSince then, the Austrian government’s tone has become progressively harder culminating in the latest policies, which also includes listing nations such as Morocco, Algeria and Tunisia as “safe”, thus making it more difficult for economic migrants from those countries to claim asylum.\nSpeaking yesterday, Ms Mikl-Leitner said: “In the case of economic migrants, we need unambiguous signals that there is no protection for them in Austria.”\nHowever, the number of new arrivals from these newly “safe” countries still makes up only a tiny fraction of the overall number of migrants entering the country.\nThe small central-European nation of around 9 million people received 90,000 asylum claims last year, one of the highest per capita ratios in Europe.","url":"https://www.breitbart.com/europe/2016/02/16/austria-to-introduce-daily-cap-on-migrants-as-it-struggles-to-deal-with-influx/"}
