{"authors":["Chris Tomlinson"],"date_download":"2018-10-30 21:54:27","date_modify":"2018-10-30 21:54:27","date_publish":"2016-03-11 16:08:03","description":"The Austrian army is leading a training exercise with national police to prepare for what they call a migrant crisis “worst case scenario”. On Thursday |","filename":"data/vaneerConsumption/AustrianArmyAndPolicePrepareAtBorderForWorstCaseScenarioMigrantInvasion.json","image_url":"https://media.breitbart.com/media/2016/03/GettyImages-500313502.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_03_11__1540936467.html","title":"Austrian Army And Police Prepare At Border For 'Worst Case Scenario' Migrant Invasion","title_page":"Austrian Army And Police Prepare At Border For 'Worst Case Scenario' Migrant Invasion","title_rss":"NULL","source_domain":"breitbart.com","text":"The Austrian army is leading a training exercise with national police to prepare for what they call a migrant crisis “worst case scenario”.\nOn Thursday members of the Austrian armed forces along with the federal police engaged in an exercise to test their ability to secure the border in case of an emergency. The joint exercise was held at Ferlach, a short distance from the Slovenian border which has seen thousands of migrant crossings after the Hungarian border was closed last year.\nThe military and police were tested in a number of different scenarios, including one where migrants broke through the border security and attempted to escape into the country, reports Kurier. The aim of the drills is to create a communication and cooperation alliance between the two groups to better coordinate their joint resources in case migrants are able to storm through the Balkan countries.\n150 soldiers from the Austrian army and 50 police officers were involved in the operation which also saw 40 soldiers playing the part of migrants. The troops roleplaying illegals were told to try their hardest to cross the border in whatever means they could, and to get away. As the operation progressed the army flew in five helicopters to help locate the fake migrants who had manged to evade the combined force at the border.\nCarinthian provincial police director Michaela Kohlweiss and Austrian army commander Walter Gitschthaler said they were satisfied at how the operation progressed and at the ability of the army and police force to act in cooperation with each other. “Each organization involved has its own language and its own tactics in the relatively new situation of assistance operations, it is crucial that we improve cooperation wherever it is possible,” the police director said.\nArmy commander Gitschthaler agreed with the sentiment of the police director saying that these kinds of exercises are decisive for creating a functional and effective force for protecting the border: “We have deliberately chosen such an exercise under the assumption that we must prepare for a worst case scenario, it is currently quiet at the Carinthian border which must stay that way but it will not always be so.”\nAustria has been advocating broad restrictions on their borders for the past few months. The charge for secure borders has been led by Austrian interior minister, Johanna Mikl-Leitner, who has sparked controversy in Germany and Europe by supporting controls on the number of migrants that will be allowed to enter Austria.\nMikl-Leitner has gone even further recently by starting a new PR campaign in various countries that have seen large numbers of their citizens attempt to cross into Europe. The campaign which includes posters, TV spots and internet ads targets potential migrants and tells that Austria is not the paradise many people smugglers have tried to tell them it is.","url":"https://www.breitbart.com/europe/2016/03/11/austrian-army-police-prepare-at-border-for-worst-case-scenario-migrant-invasion/"}
