{"authors":["April Glover For Daily Mail Australia"],"date_download":"2018-10-22 21:52:13","date_modify":"2018-10-22 21:52:13","date_publish":"2017-03-16 02:03:28","description":"Australia's internet speeds have failed to keep up with countries like Kenya and Bulgaria - and was ranked 51st in the world for average speed because of the country's vast rural population and failing NBN.","filename":"data/vaneerConsumption/AustraliasinternetspeedsworsethanBulgariaandKenya.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/01/3E4FE84600000578-0-image-a-17_1489627408957.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318458_Australia-s-internet-speeds-worse-Bulgaria-Kenya_1540245133.html","title":"Australia's internet speeds worse than Bulgaria and Kenya","title_page":"Australia's internet speeds worse than Bulgaria and Kenya | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Australia's internet speed has ranked as the 51st slowest out of 108 countries around the world, lagging behind underdeveloped nations such as Kenya and Sri Lanka.\nAustralia's online bandwidth has pathetic internet speeds compared to Norway, Sweden, Hong Kong, Switzerland, Denmark and Singapore - which all have speed above 20 megabits per second (mbps).\nSouth Korea topped the list with the fastest connectivity at 26.1mbps.\nInternet speed in Australia sits at 10.01mbps which is far slower than Kenya which manages 15mbps\nAustralia's average speed was recorded at 10.01 mbps, seven megabits behind the USA which was ranked at 13th with 17.2mbps , Akamai's State of the Internet report found.\nKenya recorded far better connectivity speeds than Australia - the east African country listed at the 23rd fastest in the world with an impressive average of 15mbps.\nThe Philippines had the worst internet speed of the countries surveyed.\nIn 2015 Australia was sitting at 48th on the list with an average internet speed of 9.6mbps, but last year the country slipped out of the top 50 entirely.\nAustralia can't keep up with the rest of the world and it's because NBN has failed to successfully roll-out across the country - as well as our sparely populated land\n'Quarterly changes were positive across the board except for Australia, which posted a 1.9 per cent decline in adoption,' the report notes.\nVietnam and India were the only two countries to enjoy double-digit growth.\nBut mobile connectivity in Australia is topping the Asia Pacific region at 13.8mbps, which is higher than the global average of 7mbps.\nThe disappointing connectivity in Australia was blamed on the unfinished implementation of NBN across the country.\n'Providing fast, reliable internet to a vast rural population of this scale is a challenge that no other country has to deal with,' Akamai said.\nIt is hard to compare Australia's speeds to a small and densely populated country like Singapore, for example, where a single switch provides hundreds of thousands of people with internet.\nThe original premise of the National Broadband Network vowed it would make Australia a world leader in internet connectivity.\nCOUNTRIES RANKED BY INTERNET SPEED 1. South Korea: 26.1Mbps 2. Norway: 23.6Mbps 3. Sweden: 22.817.3Mbps 4. Hong Kong: 21.9Mbps 5. Switzerland: 21.23Mbps 6. Denmark: 20.7Mbps 7. Finland 20.6Mbps 8. Singapore: 20.2Mbps 9. Japan: 19.6Mbps 10. Netherlands: 17.6Mbps 11. Latvia: 17.2Mbps 12. Czech Republic: 17.3Mbps 13. United States: 17.2Mbps 14. United Kingdom: 16.3Mbps 15. Romania: 16.1Mbps 16. Belgium: 15.9Mbps 17. Spain: 15.4Mbps 18. Ireland: 15.3Mbps 19. Taiwan: 15.6Mbps 20. Bulgaria: 15.6Mbps 21. Kenya: 15.0Mbps 22. Lithuanian: 14.6Mbps 23. Canada: 14.9Mbps 24. Hungary: 14.3Mbps 25. Germany: 14.6Mbps 26. Lithuania: 14.6Mbps 27. Israel: 14.4Mbps 28: Hungary: 14.3Mbps 29: Slovenia: 14.0Mbps 30: Austria: 13.9Mbps 31. Thailand: 13.1Mbps 32. Slovakia: 13.0Mbps 33. Malta: 12.9Mbps34 34. New Zealand: 12.9Mbps 37: Portugal: 12.6Mbps 39: Poland: 12.4Mbps 41: Qatar: 11.9Mbps 42: Russia: 11.6Mbps 43: Estonia: 11.4Mbps 45: Luxembourg: 11.1Mbps 48: United Arab Emirates: 10.7Mbps 51: Australia: 10.0Mbps Note: Report did not contain full 1-51 ranking Source: Akamai State of the Internet 2016 Q4\nBut its slow adoption and those who have NBN have reported failing connections and slow data.\nNBN Australia told Daily Mail Australia the report is an example of how fast broadband desperately needs to be rolled out across the country.\nIt said: 'NBN reiterates the importance of understanding what the report is detailing, which is average speeds delivered at a point in time across 10 million services most of which are old ADSL services, not the actual speeds the NBN network can deliver.\nWith almost two million homes and businesses now accessing fast broadband over the NBN network, and multiple thousands more connecting every day, we expect average speeds delivered to improve.'\nBy 2020 a global roll-out of a 5G connection is expected to drastically improve internet connectivity everywhere.\nA 5G connection will allow users to download around one gigabit per second - or one HD movie in under two minutes.","url":"https://www.dailymail.co.uk/news/article-4318458/Australia-s-internet-speeds-worse-Bulgaria-Kenya.html"}
