{"authors":["Daniel Piotrowski For Daily Mail Australia"],"date_download":"2018-10-22 22:54:04","date_modify":"2018-10-22 22:54:04","date_publish":"2016-01-11 04:04:39","description":"Australian firebrand preacher Mohammed Junaid Thorne (pictured) has re-emerged after being released from prison after flying under a fake name.","filename":"data/vaneerConsumption/AustralianIslamicpreacherJunaidThornereleasesvideomessage.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/02/30042BDD00000578-0-image-a-7_1452480550265.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393284_Firebrand-Australian-Islamic-preacher-jailed-flying-fake-releases-video-message-calling-brothers-prison-set-free_1540248844.html","title":"Australian Islamic preacher Junaid Thorne releases video message","title_page":"Australian Islamic preacher Junaid Thorne releases video message | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Australian firebrand preacher Junaid Thorne has resurfaced with a video message online after his release from prison last month.\nMohammed Junaid Thorne, a 26-year-old who lived in Saudi Arabia in his youth, was sentenced to eight months imprisonment last year for booking flights under a fake name in 2014.\nThorne was released on December 5 following an appeal, and in a clip this week he asked young Muslims to support people 'suffering' in Syria, Iraq and Palestine.\nHe also called for his 'brothers' in Australian jails to be set free.\nFresh from prison, Mohammad Junaid Thorne asked Allah to 'release our brothers who are behind bars'\nThorne was jailed for five months for flying under a fake name with two of his friends\nIn the clip, Thorne said the Muslim ummah (community) was wounded around the world, pointing to conflicts in Syria, Palestine, Kashmir, Afghanistan and the Philippines.\n'More and more wounds have opened in our body. And this will continue to be the case unless there is a change.\n'Allah does not change the situation of a nation unless they change themselves, until they make a change themselves.\n'If we don't get up and make a change to better the situation of our ummah (community) nothing is going to happen by itself,' he said.\nJust weeks after his release from jail, he also asked Allah to release his 'brothers' behind bars who he said were doing it tough.\n'They're going through a lot and they're suffering a great deal,' Thorne said in the YouTube clip.\n'I've been a person there. I know how it feels. I know what they're going through.'\n'There are some of the beautifulest (sic), the best brothers on Earth behind bars'.\nA court heard Thorne flew from his native Perth to Sydney via Brisbane with two other friends, Mostafa Shiddiquzzaman and Omer Abdirahman Issak, on December 8 2014.\nThorne admitted to police the flights had been booked under fake names including 'Prince Bhopal'\nThorne, a first time offender, was released from Goulburn Supermax last month\nShiddiquzzaman had booked a seat under the name Prince Bhopal, Thorne as Mathew Jacobs and Issak as Moses Bangura, court records said.\nA court heard Virgin security agents informed the Australian Federal Police joint counter-terrorism squad that day and both Shiddiquzzaman and Thorne were arrested within a week.\nIn an interview with authorities, Shiddiquzzaman said he did it 'just for fun... to see if it works and it did... We heard from someone else that it does work and so we tried it out for fun'.\nThorne admitted to police the flights were booked under false names as Shiddiquzzaman did not want people to know he was travelling with Thorne because of his high media profile.\nA frequent flyer card under Thorne's name had been used in the booking, according to court materials.\nIn his latest video, Thorne said Muslim youth were too distracted by 'drugs' and 'women'. 'They just need a push in the right direction,' he said.\nThorne sparked controversy a year ago after a Facebook post where he apparently justified the Charlie Hebdo killings in Paris.","url":"https://www.dailymail.co.uk/news/article-3393284/Firebrand-Australian-Islamic-preacher-jailed-flying-fake-releases-video-message-calling-brothers-prison-set-free.html"}
