{"authors":[],"date_download":"2018-10-22 21:11:36","date_modify":"2018-10-22 21:11:36","date_publish":"2016-01-29 06:00:42","description":"A confident Australian Prime Minister Malcolm Turnbull on Friday said elections would be held between August and October but, after a period of political tur...","filename":"data/vaneerConsumption/AustraliaPMsetselectionsforsecondhalf.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h7b9-4PuZeKVXE7cd9005b2c876576355-684_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422233_Australia-PM-sets-elections-second-half_1540242696.html","title":"Australia PM sets elections for second half","title_page":"Australia PM sets elections for second half | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Australia PM sets elections for second half\nA confident Australian Prime Minister Malcolm Turnbull on Friday said elections would be held between August and October but, after a period of political turmoil, warned he would not hand out sweeteners for voters.\nThe Liberal leader is expected to win the vote, which must be held by late January 2017, and consolidate his power in Canberra after Australia changed prime minister five times in as many years.\n\"There will be an election... in August, September, October, in the latter part of the year,\" the self-made millionaire told 3AW commercial radio.\nAustralia's resources-driven economy has enjoyed more than two decades of growth but is struggling to as an unprecedented mining investment boom wanes, commodity prices slump and tax receipts drop ©Peter Parks (AFP/File)\nBut Turnbull, who ousted premier Tony Abbott in a September coup calling for better management of Australia's economy, said there would be no spending hikes as the government tackles a booming structural deficit.\n\"This is not going to be a fistful-of-dollars election campaign,\" he said.\n\"My view is that the Australian electorate are very well attuned to the difficult financial situation that the government faces, and the fact that it is in deficit.\n\"It will certainly be a tight budget,\" added the former investment banker, whose coalition government enjoys a strong poll lead over the opposition Labor party.\nThe interview came a day after Treasury Secretary John Fraser called for substantial structural savings and warned of the dangers from higher and higher federal spending, which has hit 25.9 percent of national income.\nAustralia's resources-driven economy has enjoyed more than two decades of growth but is struggling to as an unprecedented mining investment boom wanes, commodity prices slump and tax receipts drop.\nAbbott's Liberal-National coalition swept to power in September 2013, ending years of chaotic Labour rule, only to fail to push swingeing budgets cuts through parliament and plunge in the polls amid a series of gaffes.\nBefore him the country was led by Labor's Julia Gillard, who had ousted her own leader Kevin Rudd in a ruthless power grab, before being knifed herself by Rudd ahead of a 2013 vote.","url":"https://www.dailymail.co.uk/wires/afp/article-3422233/Australia-PM-sets-elections-second-half.html"}
