{"authors":[],"date_download":"2018-10-22 20:16:33","date_modify":"2018-10-22 20:16:33","date_publish":"2016-01-28 00:45:25","description":"Australia diver Matthew Mitcham announced his surprise retirement on Thursday after winning gold at the Beijing Olympics and 2014 Commonwealth Games. The 27-...","filename":"data/vaneerConsumption/AustralianOlympicgolddiverMitchamretires.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g53z-4vVdYopwYQ7f641721b07a6da873-848_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420219_Australian-Olympic-gold-diver-Mitcham-retires_1540239393.html","title":"Australian Olympic gold diver Mitcham retires","title_page":"Australian Olympic gold diver Mitcham retires | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Australian Olympic gold diver Mitcham retires\nAustralia diver Matthew Mitcham announced his surprise retirement on Thursday after winning gold at the Beijing Olympics and 2014 Commonwealth Games.\nThe 27-year-old, who won the 10m platform in the 2008, had been expected to compete in Rio this year.\nWith his final dive in Beijing he claimed the highest individual score in Olympic history.\nMatthew Mitcham of Australia competes in the Men's 1m Springboard Diving Final Competition in the 2014 Commonwealth Games in Edinburgh, Scotland on July 30, 2014 ©Andy Buchanan (AFP/File)\n\"I have achieved everything I hoped for, including the big three -- Olympic gold in 2008, world number one in 2010, and Commonwealth gold in 2014, which could never have happened without all the help I've had along the way,\" Mitcham said.\n\"I have no doubt that Grant Nel, James Connor and Domonic Bedggood, along with our girls, will do Australia proud at the Rio Olympic Games this year.\"\nHe said he would pursue media and entertainment opportunities.\nDiving Australia chairman Michael Murphy described Mitcham as the nation's most successful diver.\n\"He has had his fair share of ups and downs, but he has been a wonderful ambassador for our sport and an inspiration for so many athletes in general, not just divers,\" Murphy said.","url":"https://www.dailymail.co.uk/wires/afp/article-3420219/Australian-Olympic-gold-diver-Mitcham-retires.html"}
