{"authors":[],"date_download":"2018-10-22 21:23:48","date_modify":"2018-10-22 21:23:48","date_publish":"2016-01-28 07:20:25","description":"An Australian-led consortium including a Chinese sovereign wealth fund bid US$6.30 billion for ports and rail operator Asciano Thursday, kicking off a biddin...","filename":"data/vaneerConsumption/Australialedgroupbids63bnforlogisticsfirmAsciano.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g5y0-4vVdYopwYQ7f641721b07aa1bec4-215_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420482_Australia-led-group-bids-6-3bn-logistics-firm-Asciano_1540243428.html","title":"Australia-led group bids $6.3bn for logistics firm Asciano","title_page":"Australia-led group bids $6.3bn for logistics firm Asciano | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Australia-led group bids $6.3bn for logistics firm Asciano\nAn Australian-led consortium including a Chinese sovereign wealth fund bid US$6.30 billion for ports and rail operator Asciano Thursday, kicking off a bidding war with a Canadian asset manager.\nQube Holdings -- leading a group including China's CIC Capital Corporation, the Canada Pension Plan Investment Board and investment group Global Infrastructure Partners -- said it had submitted the offer with an implied value of Aus$9.17 per Asciano share.\nThat valued the bid at Aus$8.95 billion.\nAsciano CEO John Mullen (R) and Canada's Brookfield Infrastructure Partners CEO Sam Pollock (L) in August 2015 after the Canadian asset manager announced a bid for the Australian ports and rail operator ©Saeed Khan (AFP/File)\nThe announcement comes three months after the consortium bought a 19.99 percent stake in the Australian logistics giant and indicated a desire to break up the business.\nThe move is a direct challenge to the Aus$9 billion takeover bid revealed in July by Canadian asset manager Brookfield Infrastructure Partners, which if successful would be the biggest logistics deal in Australian corporate history.\nBrookfield currently has a stake of just over 20 percent in Asciano.\n\"The official gun has been fired, so we've had this shadow-boxing situation where Brookfield and Qube and its consortium partners have been throwing non-binding bids at each other,\" IG markets analyst Evan Lucas told AFP.\n\"This is binding, so it's now a set, official price and a bidding war is underway. The winners out of this are Asciano shareholders. They are either going to get a higher price or a good deal, whichever way the board recommends them to go with.\"\nBrookfield is still waiting for the Australian Competition and Consumer Commission's approval of its takeover bid. An earlier undertaking was rejected by the corporate watchdog owing to questions about competition issues.\nAsciano's board said it received and was considering Qube's proposal, but reiterated that it was continuing to unanimously recommend the Brookfield offer at this stage.\nAsciano shares closed 4.00 percent higher to Aus$8.84 Thursday in Sydney, while Qube ended the day's trade up 3.81 percent to Aus$2.18.","url":"https://www.dailymail.co.uk/wires/afp/article-3420482/Australia-led-group-bids-6-3bn-logistics-firm-Asciano.html"}
