{"authors":[],"date_download":"2018-10-22 23:48:11","date_modify":"2018-10-22 23:48:11","date_publish":"2017-03-16 07:57:02","description":"A Perth woman has been allegedly raped by two men in Kuta Beach, Bali after asking for a lift back to her hotel after her friends left her when her shoes broke","filename":"data/vaneerConsumption/Australianwomanrapedwhenshewasofferedafreelift.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/07/3E526C7600000578-0-image-a-11_1489650332738.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319136_Australian-woman-raped-offered-free-lift_1540252091.html","title":"Australian woman raped when she was offered a free lift","title_page":"Australian woman raped when she was offered a free lift | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bali police say they have approached Australian authorities for help over the alleged sexual assault of a Perth woman in Kuta, as they are finding it 'difficult' to properly investigate the case.\n'She doesn't want to be visited by the police, doesn't want this case to be known by the (Australian) consulate or her family,' Denpasar District Police Chief Colonel Hadi Purnomo told reporters on Thursday.\nHe said two men are now believed to have been involved in the alleged attack.\nBali police have asked for help investigating the alleged rape of a Perth woman\nThe woman was allegedly assaulted at Kuta Beach after a man on a motorbike 'taxi' offered her a free ride to her hotel\nBali police have contacted the consulate and Australian Federal Police (AFP) for help in a bid to obtain a forensic examination of the woman.\nAAP has contacted the AFP and the Department of Foreign Affairs Trade (DFAT) for comment.\n'We pity her ... (she) came to Bali to have a holiday with her friends then this incident happened,' Colonel Purnomo added.\nPolice initially told reporters the woman had been walking along Legian Road in Kuta, after leaving Paddy's Bar, in the early hours of Tuesday morning when she was offered a free ride by an 'ojek' or motorbike taxi driver.\nIt was initially believed that only one man was involved in the alleged attack on her.\nBut on Thursday, Colonel Purnomo said it appeared there were two men involved in the 'rape'.\n'She was left behind (by her friends) because her shoes were broken and she was not carrying money,' he said.\nThe woman's friends left her when her shoes broke, according to police\n'That was why she accepted help to take her to her hotel.'\nBut rather than taking her to where she was staying, Colonel Purnomo said she was driven to Kuta Beach.\nSecurity guards at Jayakarta Hotel, near the spot where the alleged assault took place, heard screaming.\nOne of their officers ran to help but by the time they arrived the perpetrators had fled, the hotel's security told AAP on Tuesday.\nTwo men are suspected of having sexually assaulted her near Kuta Beach, Colonel Purnomo said, adding the woman could only give a rough description of one as being around 168cm tall with long hair.\nHe said the woman, who was still in Bali, had been drinking.\n'We're still trying to find other evidence like CCTV, and questioning witnesses.'","url":"https://www.dailymail.co.uk/news/article-4319136/Australian-woman-raped-offered-free-lift.html"}
