{"authors":["Matt Ogilvie For Daily Mail Australia"],"date_download":"2018-10-22 23:28:25","date_modify":"2018-10-22 23:28:25","date_publish":"2016-01-11 06:09:26","description":"The Advertising Standards Bureau has launched an investigation into a Meat and Livestock ad after it received dozens of complaints about the ad's treatment of vegans.","filename":"data/vaneerConsumption/AustraliaDaylambadstarringLeeLinChinandSamKekovichinvestigated.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/06/30055F6700000578-0-image-a-6_1452492284992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393407_Lamb-livestock-Australia-Day-ad-investigated-violent-treatment-vegans_1540250905.html","title":"Australia Day lamb ad starring Lee Lin Chin and Sam Kekovich investigated","title_page":"Australia Day lamb ad starring Lee Lin Chin and Sam Kekovich investigated | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The backlash is aimed at a scene with a flamethrower and a vegan man\nThe Advertising Standards Bureau has launched an investigation into a Meat and Livestock ad after it received dozens of complaints about its treatment of vegans.\nThe advertisement features a bevy of Australian celebrities, including SBS presenter Lee Lin Chin, who have banded together in a mission to bring overseas countrymen home for Australia Day.\nThe vegan backlash to the ad is aimed at a scene when 'lambassador' Sam Kekovich's team of commandos busts down the door of an Australian man living in the U.S.\nVegan backlash: A man cowers in fear when a Australia Day 'commander' torches his table after hearing the man has become a vegan\nThe ad launched on Sunday and by Monday morning the Advertising Standards Board (ASB) said it had received more than 50 complaints\nControversial lamb ad: 'Right now there are thousands of Australians stranded overseas. They're a snowball's chance in hell of eating lamb on Australia Day - let's go get em'\n'Don't worry mate, in a few hours you'll be eating lamb on the beach,' says the rescue commander.\nThe man looks up in horror and quivers, 'but I'm a vegan now.'\nThe commando looks at the man in disgust and orders the team to retreat after burning the vegan's coffee table with a flamethrower gun.\nThe lamb Australia Day commercials are known for targeting vegetarians and vegans, with the first ad describing the diet's followers as 'un-Australian' and 'soap avoiding, pot smoking vegetarians'.\nThe ad launched on Sunday and by Monday morning the Advertising Standards Board (ASB) said it had received more than 50 complaints, some complaining that the ad was offensive to vegans, reported Mumbrella media blog.\nThe lamb Australia Day commercials are known for targeting vegetarians and vegans, with the first ad describing the diet's followers as 'un-Australian' and 'soap avoiding, pot smoking vegetarians'\n'The violence is the main issue people are complaining about,' said a spokeswoman for the ASB.\nAn urgent hearing has been scheduled given the number of complaints and the short time schedule planned for the campaign.\nThe 2016 installment has been launched and is a distinct departure from previous campaigns, with the celebrity-laden, major production already praised as 'one of the best ads ever' by fans online.\nHysterical SBS reporter Lee Lin Chin is the latest 'lambassador', spearheading the dramatic campaign with cameos from Nova radio hosts Fitzy and Wippa, Rugby star Stephen Moore, newly retired cricket hero Mitchell Johnson and Masterchef judge George Calombaris.\nThe 2016 installment has been launched and is a distinct departure from previous campaigns, with the celebrity-laden, major production already praised as 'one of the best ads ever' by fans online\nWallabies captain Stephen Moore is seen looking downtrodden in Twickenham, England, when an operative approaches, shining a light in his face and telling him: 'it's time to go home'\nA squad descends upon a variety of worldwide locations – including an LA dentist office, a Tokyo boardroom meeting and even former cricketer Mitch Johnson's Bali holiday – to extract Australians and smuggle them back to the land down under to ensure they can enjoy lamb on Australia Day\nHysterical SBS reporter Lee Lin Chin is the latest 'lambassador', spearheading the incredibly dramatic campaign with cameos from Nova radio hosts Fitzy (right) and Wippa (left)\nThe ad has already had a positive reception on social media as users declared it one of the 'greatest' ever.\n'Great lamb ad or *greatest lamb ad?' leveled Twitter user Chris Neugebauer.\n'Just seen the Australia Day lamb ad. One of the greatest ads I have ever seen,' former wicket keeper cricket Daniel Smith.\n'Oh my Lord. Lee Lin Chin is the face of lamb now,' tweeted SBS personality Marc Fennell.","url":"https://www.dailymail.co.uk/news/article-3393407/Lamb-livestock-Australia-Day-ad-investigated-violent-treatment-vegans.html"}
