{"authors":[],"date_download":"2018-10-22 22:42:08","date_modify":"2018-10-22 22:42:08","date_publish":"2016-01-29 09:55:27","description":"Rod Laver on Friday urged Novak Djokovic to go all-out for the calendar-year Grand Slam -- a feat not achieved in men's tennis since the Australian legend la...","filename":"data/vaneerConsumption/AustralianlegendLaverurgesDjokovictogunforGrandSlam.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h8nh-4PuZeKVXE7cd9005b2c876827d53-996_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422481_Australian-legend-Laver-urges-Djokovic-gun-Grand-Slam_1540248128.html","title":"Australian legend Laver urges Djokovic to gun for Grand Slam","title_page":"Australian legend Laver urges Djokovic to gun for Grand Slam | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Australian legend Laver urges Djokovic to gun for Grand Slam\nRod Laver on Friday urged Novak Djokovic to go all-out for the calendar-year Grand Slam -- a feat not achieved in men's tennis since the Australian legend last won it in 1969.\nThe 77-year-old Laver, who won all four major titles in the same year twice in his career, said Djokovic was \"well on his way\" to the Grand Slam after he fell just one win short last year.\nThe Serbian world number one and defending champion reached his fifth major final in a row late on Thursday when he defeated Roger Federer in the Australian Open semi-finals.\nSerbia's Novak Djokovic has reached his fifth Grand Slam final in a row after beating Roger Federer of Switzerland at the Australian Open on January 28, 2016 ©William West (AFP)\n\"I think it's good for the sport if someone does win a Grand Slam. This is not a club that (only) I'm a member of. It's an open course,\" Laver told reporters at the tournament in Melbourne.\n\"I think someone like Novak is I think well on his way trying to accomplish that. Yes, we're at the very beginning. I remember when Roy Emerson and I were competitors back in our era.\n\"After one of us won the Australian, you'd say, I guess I'm going for the Grand Slam. Everybody knew about it. That's the same way I think Novak will be able to accomplish it.\"\nLaver said Djokovic \"played beautifully\" in his opening two sets against Federer, which he wrapped up in 54 minutes for the loss of just three games.\nBut he said Federer had a chance of adding to his record 17 Grand Slam titles, although he said it was a \"big stretch\" for the Swiss great, who would need a kindly draw.\n\"He's (Djokovic) going to have a lot of competition. It's not to say Roger's going to -- maybe he's going to play a little better next time they play,\" Laver said.\n\"But of course you have (Milos) Raonic, you have a lot of players in there, that are just starting to come into their own. I think that will show up through this year. But Novak certainly has a chance to pull off a Grand Slam.\"\nDjokovic, with 10 Grand Slam titles to his name, won the Australian Open, Wimbledon and the US Open last year but was beaten in the French Open final by Stan Wawrinka.","url":"https://www.dailymail.co.uk/wires/afp/article-3422481/Australian-legend-Laver-urges-Djokovic-gun-Grand-Slam.html"}
