{"authors":[],"date_download":"2018-10-22 22:31:21","date_modify":"2018-10-22 22:31:21","date_publish":"2014-05-11 04:12:54","description":"\"For me, my dream came true,\" Wurst, 25, whose birth name is Tom Neuwirth, told a news conference after the win.","filename":"data/vaneerConsumption/AustriasBeardedLadyConchitaWurstWinsEurovisionContest.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/434486/140511_conchita-wurst-eurovision_c4e40b7725d9e55bc5c82354c9c0e08f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_austrias-bearded-lady-conchita-wurst-wins-eurovision-contest-n102366_1540247481.html","title":"Austria's 'Bearded Lady' Conchita Wurst Wins Eurovision Contest","title_page":"Austria's 'Bearded Lady' Conchita Wurst Wins Eurovision Contest","title_rss":"NULL","source_domain":"nbcnews.com","text":"The Danish organizers had declared tolerance a main theme for this year's event, and the rainbow-colored flag symbolizing gay pride has been flying in many places in Copenhagen during the past week.\n\"I hope we can change just a few minds,\" said Wurst's agent René Berto. \"It is just a lady with a beard. But it is like we have landed on the moon.\"\nWurst, Austria's first Eurovision winner since 1966, received the biggest cheers from the audience but also stirred controversy in some countries. Online petitions were started in Belarus, Armenia and Russia - whose government passed a law last year banning \"gay propaganda\" among minors - to have Wurst removed or edited out of broadcasts in their countries.\n\"We did it. It is the most amazing thing. But I knew she would win. I just knew it,\" Austrian fan Damel Saric told Reuters. \"I have traveled to Copenhagen just for this moment.\"\nThe Eurovision competition, which has been held annually since 1956, was created to help foster unity after World War Two and is meant to be non-political. But political strife slipped between the cracks at this year's contest.\nMany in the audience booed when the Russian contestants, the 17-year-old Tolmachevy twin sisters, were presented at Saturday's opening ceremony and again when they were awarded points from other, mostly neighboring, nations. It was widely speculated that Russia's entry could suffer for the country's annexation of Crimea in March and the government's intransigence on gay rights. Eurovision is hugely popular in the gay community.\n\"The two Russian girls are sweet, and it is not their fault. But this is a party for everybody. Russia doesn't get that,\" said one of the booing spectators, a gay Dutch fan who identified himself as Xander.\nUkrainian singer Mariya Yaremchuk, 21, got huge cheers at her performance. \"It could be in the favor of Ukraine, that people vote for Ukraine and people don't vote for Russia because they don't like the political situation,\" said another Dutch fan, Patrick Van Der Ploeg.\nAdding to controversy, organizers said votes from Crimea count as Ukrainian votes, because tallies are based on existing national telephone codes. Ukraine's song was voted the sixth best of the 26 songs, and Russia's came in at seventh. Since politics had played a role in the voting in the past, half the points are now awarded by professional judges and half by the public via phone and SMS.\n— Reuters","url":"https://www.nbcnews.com/news/world/austrias-bearded-lady-conchita-wurst-wins-eurovision-contest-n102366"}
