{"authors":["Harry Pearl For Daily Mail Australia"],"date_download":"2018-10-22 21:18:08","date_modify":"2018-10-22 21:18:08","date_publish":"2016-01-29 06:26:39","description":"A stubby holder depicting a naked female silhouette that was handed out at an Australia Day citizenship ceremony in Port Stephens has sparked outrage online.","filename":"data/vaneerConsumption/AustraliaDaycitizenshipceremonyhandsoutnakedfemalestubbyholdersinPortStephens.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/05/30AFE96F00000578-0-image-a-29_1454045324462.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422236_Stubby-holder-depicting-naked-female-silhouette-handed-Australia-Day-citizenship-ceremony_1540243088.html","title":"Australia Day citizenship ceremony hands out naked female stubby holders in Port Stephens","title_page":"Australia Day citizenship ceremony hands out naked female stubby holders in Port Stephens | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A local council has come under fire for unwittingly including a stubby holder depicting a naked female silhouette in a gift bag distributed at an Australia Day citizenship ceremony.\nPort Stephens Council, north of Newcastle in NSW, has faced a torrent of online criticism after Kate Washington, the state MP for Port Stephens, posted a photo of the stubby holder on her Facebook Page.\n'I am disgusted and embarrassed that the objectification and denigration of women would be endorsed in this manner by my own Council,' she wrote.\nThe stubby holder that was handed out in a gift bag at an Australia Day citizenship ceremony in Port Stephens\nMs Washington, who is Shadow Minister for the prevention of Domestic Violence and Sexual Assault, said called the gift 'backward'.\nThe council has apologised unreservedly and said the stubby holder was 'in no way part of the official citizenship pack.'\nThe gift bag was packed by a local business and distributed to attendees by a volunteer committee that organised the event, the council said.\n'At no point was Council aware of the contents of the gift bag,' read a post on the council's Facebook page.\n'There has obviously been a failure of oversight and quality control in this instance.'\nKate Washington, the state MP for Port Stephens, called the gift 'backward' and disgusting\nDoug Cross, the chairman of the volunteer committee, said he accepted full responsibility for the mix up and the committee has promised to review its procedures.\nHowever, the gift has already sparked outrage among residents and social media users.\n'Sexualising women, great example to the new Australian citizens!' said Rebecca Sumner on Facebook.\nAnother women asked: 'Appalling, what uneducated bogan funded these pieces of rubbish?'\nOthers were concerned with the 'endorsement' of alcohol as a quintessential part of Australian life.\nNot everyone agreed the gift was in poor taste, however.\nGary Sweetman wrote: 'I want one, where can I buy them.'\n'Sexualising women, great example to the new Australian citizens,' wrote Rebecca Sumner\nMany local residents expressed embarrassment about the gift\nOthers were more concerned with the 'endorsement' of alcohol as a quintessential part of Australian life","url":"https://www.dailymail.co.uk/news/article-3422236/Stubby-holder-depicting-naked-female-silhouette-handed-Australia-Day-citizenship-ceremony.html"}
