{"authors":["Reuters Reporter"],"date_download":"2018-10-23 00:59:38","date_modify":"2018-10-23 00:59:38","date_publish":"2017-03-10 08:22:14","description":"Cricket Australia physiotherapist David Beakley said that Mitchell Starc experienced pain in his right foot during the second test in Bangalore, which had not subsided as hoped.","filename":"data/vaneerConsumption/AustraliasMitchellStarctoleaveIndiaduetofootwoe.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/08/3E076F4700000578-0-image-a-6_1489134092261.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_cricket_article-4300364_Australia-s-Mitchell-Starc-leave-India-foot-woe_1540256378.html","title":"Australia's Mitchell Starc to leave India due to foot woe","title_page":"Australia's Mitchell Starc to leave India due to foot woe | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Australia fast bowler Mitchell Starc won't play in the remaining two Tests against India due to a stress fracture in his right foot.\nCricket Australia physiotherapist David Beakley said that Starc experienced pain in his right foot during the second test in Bangalore.\n'Mitchell experienced some pain in his right foot during the second Test in Bangalore which unfortunately had not subsided a few days after the Test as we had hoped,' Beakley said.\nFast bowler Mitchell Starc (right) has been sent home by Australia during their tour of India\n'We made the decision to scan his foot in Bangalore this morning and unfortunately it has revealed a stress fracture.\n'Subsequently, this means Mitchell will be unavailable for the remainder of the tour of India and will return home to Australia to start his rehabilitation.'\nCricket Australia said it would name a replacement player in the next few days, but they have yet to say who it will be. The series is level at 1-1.\nStarc is the second player to be sent home by Australia during the tour.\nMitchell Marsh was ruled out of the series after he picked up a shoulder injury. He has been replaced by Marcus Stoinis in the squad.","url":"https://www.dailymail.co.uk/sport/cricket/article-4300364/Australia-s-Mitchell-Starc-leave-India-foot-woe.html"}
