{"authors":["Associated Press"],"date_download":"2018-10-23 00:23:48","date_modify":"2018-10-23 00:23:48","date_publish":"2017-03-10 06:54:07","description":"CANBERRA, Australia (AP) - With concerns over Chinese political influence in Australia and Russian interference in the U.S. presidential election, an...","filename":"data/vaneerConsumption/Australianreporturgesbanonforeignpoliticaldonations.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300204_Australian-report-urges-ban-foreign-political-donations_1540254228.html","title":"Australian report urges ban on foreign political donations","title_page":"Australian report urges ban on foreign political donations | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"CANBERRA, Australia (AP) - With concerns over Chinese political influence in Australia and Russian interference in the U.S. presidential election, an Australian parliamentary committee on Friday recommended a ban on political donations from foreign companies and individuals.\nUnlike the U.S. and many other countries that ban foreign donations, Australian law has never distinguished between donors from Australia and overseas.\nBut the Joint Standing Committee on Electoral Matters recommended a ban on foreign donations to registered political parties and associated entities.\n\"It is a matter of national sovereignty that only Australians should have the power to influence Australian politics and elections,\" said committee chair Linda Reynolds.\nThe opposition rejected the committee's recommendation that the ban should also apply to environmental and activist groups involved in politics.\nFormer President Barack Obama's administration last year called for the Australian system to be reformed to remove the influence of Chinese political donations. China is Australia's most lucrative trading partner and largest source of foreign political funds.\nIn September, then-Ambassador John Berry said the United States was surprised by the amount of Chinese money and influence in Australian politics and wanted Australia to resolve the foreign donation issue.\nA week earlier, the opposition Labor Party called for foreign political donations to be banned after Labor Sen. Sam Dastyari stepped down from a senior role for asking a Chinese company to pay a 1,670 Australian dollar ($1,250) travel bill. While Dastyari broke no law, he acknowledged that having the Sydney-based company Top Education Institute pay a personal bill was wrong.\nLawmakers in the conservative government have also been tainted by Chinese largesse. Three government lawmakers accepted Rolex watches gifted by a Chinese businessman but returned them after discovering the $28,000 timepieces were not fake.\nPrime Minister Malcom Turnbull advocates more transparency in Australian politics, pointing to multiple allegations of Russian interference in President Donald Trump's election in November.\n\"Overseas events, as well as those here in Australia, have shown us that the Australian people must be confident that our electoral process is free from foreign intervention or interference,\" Turnbull said in a speech last month.\nOpposition lawmakers said in a report that recent examples of foreign electoral interference in countries including the United States \"make action urgent\" in reforming the Australian system.\nA Labor government introduced a bill to ban foreign donations in 2010, but it never became law.","url":"https://www.dailymail.co.uk/wires/ap/article-4300204/Australian-report-urges-ban-foreign-political-donations.html"}
