{"authors":["Associated Press"],"date_download":"2018-10-23 00:17:44","date_modify":"2018-10-23 00:17:44","date_publish":"2016-01-11 09:14:20","description":"PERTH, Australia (AP) — Fast bowlers Joel Paris and Scott Boland will make their debuts for Australia in Tuesday's opening one-day international against Indi...","filename":"data/vaneerConsumption/Australianames2uncappedfastbowlersfor1stOD.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393384_Australia-names-2-uncapped-fast-bowlers-1st-ODI-vs-Indi_1540253864.html","title":"Australia names 2 uncapped fast bowlers for 1st OD","title_page":"Australia names 2 uncapped fast bowlers for 1st OD | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Australia names 2 uncapped fast bowlers for 1st OD\nPERTH, Australia (AP) — Fast bowlers Joel Paris and Scott Boland will make their debuts for Australia in Tuesday's opening one-day international against India as the two sides prepare to renew a growing rivalry.\nParis has been chosen to make his first international appearance on his home WACA Ground after being fast-tracked into the Australia squad following the retirement of Mitchell Johnson and and injury to Mitchell Starc.\nBoland, from Victoria, has also been handed a debut as Australia replenishes its fast bowling stocks but allrounder Shaun Marsh has been omitted from the Australian lineup for the first match of the five-match series.\nCaptain Steve Smith said Paris was selected because Australia wants a left-armer in Perth \"who can use the breeze and move the ball.\"\nBoland was a member of the Australia test squad during the recent series against the West Indies but didn't get a chance to play. Smith said his form for the Melbourne Stars in the Big Bash League had been compelling.\n\"His death bowling has been very impressive,\" Smith said. \"He hits a yorker as well as anyone at the moment. He's got a bit of pace to him so hopefully he can hurry up the Indian batters a bit.\"\nMarsh hasn't been able to clinch his place in the Australia match XI, though his Big Bash form has also been outstanding. He has scored 218 runs in five matches for the Perth Scorchers at an average of 72.67 and a strike-rate of 128.24.\nAustralia has opted instead to let veteran George Bailey fill the batting vacancy left by the retirement of Michael Clarke.\n\"It's very difficult but Shaun's been exceptional,\" Smith said. \"He hasn't whinged once, he's taken it on the chin and he's been great around the group.\"\nIndia may also name an uncapped paceman. India's team hasn't yet been announced but Barinder Stan is expected to be replace the injured Mohammed Shami.\nTuesday's match is the first meeting between Australia and India since the World Cup semifinal in Sydney in March.\nRecent meetings between the teams have featured verbal exchangfes betwen players but India captain Mahendra Singh Dhoni believed the coming series would be played in good spirit.\n\"When it comes to sport and cricket, I don't think revenge and hate are words that should be used,\" Dhoni said. \"Because then on the same line we'll say it's a gentleman's sport, so it becomes quite conflicting.\n\"You are representing your country and you want to win. But at the same time, you want to follow the guidelines I've been given — the spirit of the game and everything.\"\n____","url":"https://www.dailymail.co.uk/wires/ap/article-3393384/Australia-names-2-uncapped-fast-bowlers-1st-ODI-vs-Indi.html"}
