{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 18:41:52","date_modify":"2018-10-30 18:41:52","date_publish":"2015-04-20 22:19:08","description":"Australia and Iran have reached an agreement that allows for the two nations to share intelligence about the fight against Sunni jihadists in the Middle East, Australian Foreign Minister Julie Bishop announced over the weekend.","filename":"data/vaneerConsumption/AustraliaIranSignIntelligenceSharingAccord.json","image_url":"https://media.breitbart.com/media/2015/04/ap_hassan-rouhani_ap-photo1-1024x682.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_04_20__1540924912.html","title":"Australia, Iran Sign Intelligence Sharing Accord","title_page":"Australia, Iran Sign Intelligence Sharing Accord","title_rss":"NULL","source_domain":"breitbart.com","text":"Australia and Iran have reached an agreement that allows for the two nations to share intelligence about the fight against Sunni jihadists in the Middle East, Australian Foreign Minister Julie Bishop announced over the weekend.\n“During my discussions with the national leadership here it was agreed that we could share intelligence, particularly on the foreign terrorist fighters from Australia who are taking part in this conflict in Iraq,” said the Aussie official, dressed in full hijab.\nBishop met in Tehran with Iranian President Hassan Rouhani to officially announce the accord.\nThey hoped that the new agreement would turn back the advances of the Islamic State terror group in Iraq and Syria.\n“It was an informal arrangement whereby we would share intelligence that would give us information on the Australians who are taking part and I believe that Iran has information that we would seek and they were very agreeable to share that information with us,” added Bishop.\nThe Guardian reports that Bishop failed to address the potential scenario posited that Iran could decide to use the information to execute Australian soldiers. “I’m not going into those kind of details. That is obviously a matter of deep intelligence operational issue,” she responded.\n“But obviously if Iran has information that will be of interest to us, if we have information that would be of interest to them, in pursuing our common purpose of defeating [Islamic State], then that is an appropriate exchange,” added the Australian foreign minister.\nAround 100 Australian citizens are believed to have left their home country and linked up with the Islamic State terror group. This weekend, five teens were arrested in Melbourne for attempting to carry out an ISIS-inspired attack during the country’s World War One remembrance day ceremony.\nBishop, who was fully covered from head-to-toe, and wore a hijab, seemingly to accommodate the Shiite theocracy’s dress code for women, has come under fire for capitulating to the Islamic Republic’s customs.\n“You were not brave enough to challenge the compulsory hijab rules yet. We hope you will soon,” wrote an Iranian dissident journalist.","url":"https://www.breitbart.com/national-security/2015/04/20/australia-iran-sign-intelligence-sharing-accord/"}
