{"authors":["Angela Chen"],"date_download":"2018-10-31 01:38:51","date_modify":"2018-10-31 01:38:51","date_publish":"2018-08-29 05:22:32","description":"The implications of 3-D printed guns were realized on Tuesday after police arrested a man in Utah, charging him with reportedly making violent threats. The man supposedly threatened a school shooting with a 3-D printed gun, according to The Hill.…","filename":"data/vaneerConsumption/AUtahManThreatenedToUseA3DPrintedGunToCarryOutASchoolShootingPoliceSay.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/29/25e98acd-eef1-4f13-be1d-0e67e9309274-getty-183634846.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_a-utah-man-threatened-to-use-a-3-d-printed-gun-to-carry-out-a-school-shooting-police-say-10928024_1540949931.html","title":"A Utah Man Threatened To Use A 3-D Printed Gun To Carry Out A School Shooting, Police Say","title_page":"A Utah Man Threatened To Use A 3-D Printed Gun To Carry Out A School Shooting, Police Say","title_rss":"NULL","source_domain":"bustle.com","text":"The implications of 3-D printed guns were realized on Tuesday after police arrested a man in Utah, charging him with reportedly making violent threats. The man supposedly threatened a school shooting with a 3-D printed gun, according to The Hill. Bustle has reached out to the South Salt Lake City Police Department for comment.\nAccording to a Salt Lake County Jail report via the Deseret News, the man was criminally charged this week after an arrest on Aug. 8. Law enforcement officials said they took him into custody after he supposedly talked with another student \"about using a gun to shoot students at Broadview University.\" When asked for a comment, the suspect's attorney told the Utah newspaper that he had just received the case and wasn't able to comment on it yet.\nA search warrant affidavit revealed that the suspect had reportedly sent text messages about killing people with a \"3D printed gun so the gun could not be traced back to him,\" The Hill reported. This very reason is one of the key points made by critics who ardently oppose 3-D guns for their ability to fly under the radar. The printing of 3-D guns can bypass background checks and present a workaround for people who are legally prohibited from touching a gun, like those with a criminal record. Printable guns can also be created without the required serial number and means to trace ownership.\n\"The statements were forwarded to the university, which caused the university dean to be fearful that a school shooting was actually going to take place,\" the report said, according to the Deseret News. \"An email had to be sent to faculty and students warning them of the threat of a shooting at the school. The school chose to remain open.\"\nAlong with the texts describing his use of a 3-D gun, the suspect also sent out a message that \"contained images of what appears to be a male in a video holding a rifle while standing over another male that is lying on the ground,\" the warrant stated, according to Deseret News. These text messages were allegedly sent on August 7, with the receiving student passing on the texts to a university professor later that same night.\nThe affidavit further described the beliefs of the student who gotten the texts, saying that the student \"believed Austin has a fascination with firearms and violence\" and that he \"described Austin as being quite interested in serial killers, school shooters and other mass casualty type events\" as well as \"liking up close and personal violence such as wounds caused by a knife,\" the Deseret News reported.\nThe suspect was arrested after police served a warrant at his parent's house, where he lives. According to Deseret News, the affidavit stated the police also took away a 3-D printer that was in his home.\n3-D printed weapons, have been at the center of the most recent debate on gun control, as elected officials from both sides of the political aisle have come out against it. On Monday, U.S. District Judge Robert Lasnik upheld a ban on releasing internet blueprints for 3-D printed guns, which will prevent the Texas company intent on releasing them from doing so until all lawsuits against the government are settled.","url":"https://www.bustle.com/p/a-utah-man-threatened-to-use-a-3-d-printed-gun-to-carry-out-a-school-shooting-police-say-10928024"}
