{"authors":[],"date_download":"2018-10-30 20:39:08","date_modify":"2018-10-30 20:39:08","date_publish":"2014-08-21 23:46:15","description":"Authorities are searching for an armed suspect in Fulton County following a pursuit during which an 18-year-old woman was shot in the leg.","filename":"data/vaneerConsumption/AuthoritiessearchingforarmedsuspectinFulton.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/08/22/Images/photos.medleyphoto.5968601.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_breaking-news_authorit_fbd6801dc352ea55c915c7120ecfc1e3__1540931948.html","title":"Authorities searching for armed suspect in Fulton","title_page":"Authorities searching for armed suspect in Fulton","title_rss":"NULL","source_domain":"ajc.com","text":"Authorities are searching for an armed suspect in Fulton County following a pursuit during which an 18-year-old woman was shot in the leg.\nThursday evening’s shooting may involve a College Park officer, a Fulton police spokeswoman said.\n“At this time we do not know whose fire struck the young lady,” Cpl. Kay Lester said. “We believe she was an innocent bystander.”\nCollege Park police and the male suspect exchanged fire during a foot pursuit near Heritage Elementary School. Prior to the shooting, police responded to a nearby discount mall in College Park, where a business reported a cell phone theft, Lester said. When police arrived, they encountered the suspect, who then fled on foot. The chase went about a block, and into Fulton County’s jurisdiction, before police lost the man.\nLester said the search for the man also included Fulton County sheriff’s deputies and school police, since the woman was shot in the back of the school’s property.\nFulton and Fayette county K-9s and officers are aiding in the search, which continued past 10 p.m. and included a nearby apartment complex, she said.\n—Photographer Ben Gray contributed to this report.","url":"https://www.ajc.com/news/breaking-news/authorities-searching-for-armed-suspect-fulton/4qLeeISz0ZTnJzFCr4kFMN/"}
