{"authors":["Associated Press"],"date_download":"2018-10-23 05:41:45","date_modify":"2018-10-23 05:41:45","date_publish":"2016-01-29 21:24:42","description":"MEMPHIS, Tenn. (AP) — State police on Friday released the name of a man who was fatally shot by police during a foot chase in a Memphis neighborhood. The Ten...","filename":"data/vaneerConsumption/AuthoritiesreleasenameofMemphismankilledbyofficers.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423435_Authorities-release-Memphis-man-killed-officers_1540273305.html","title":"Authorities release name of Memphis man killed by officers","title_page":"Authorities release name of Memphis man killed by officers | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Authorities release name of Memphis man killed by officers\nMEMPHIS, Tenn. (AP) — State police on Friday released the name of a man who was fatally shot by police during a foot chase in a Memphis neighborhood.\nThe Tennessee Bureau of Investigation said 32-year-old Johnathan Bratcher died Wednesday in a shootout with police officers near a church in Memphis.\nThe bureau says Bratcher and another man were being pursued on foot by two Memphis officers after Bratcher drove away from a traffic stop and crashed his Chevy Impala while driving recklessly through a neighborhood that also includes apartment complexes and a school.\nDuring the chase, Bratcher drew a gun and fired at officers, bureau spokesman Josh DeVine said. The officers returned fire, striking Bratcher, DeVine said. Bratcher died at the scene.\nThe second man eluded officers at first, but the bureau says he has since been questioned by authorities. He has not been charged.\nThe identities of the officers involved in the shooting have not been released, but DeVine did say that one is white and one is black. Bratcher was black.\nAccording to court records, Bratcher faced a possible return to federal prison for a violation of his probation stemming from a shooting incident on Oct. 27, 2008.\nRecords show Bratcher was charged with 13 counts of aggravated assault after he fired a shotgun at a man in a car, then went to the man's home later that day and fired four or five shots into the man's house. Police said 12 people were in the house at the time.\nThe case was filed in state court, but it was later transferred to federal court. Bratcher, who had previously spent time in prison on another offense, pleaded guilty in June 2010 to possessing a firearm as a convicted felon, court records show.\nBratcher was sentenced to seven years and three months in prison in December 2010. He was released in April 2015 and placed on probation until April 2018, on the condition he commit no other crimes.\nHowever, Bratcher was arrested on Nov. 19 during a traffic stop and charged with possession of Oxycodone with intent to sell and possession of marijuana. U.S. District Judge Samuel Mays ordered his arrest on a probation violation, and he was taken into custody. The judge released Bratcher on $5,000 bond in early December, and set a hearing for Feb. 18 to address the revocation of his probation.\nAfter Wednesday's shooting, people who identified themselves as relatives of Bratcher were crying and hugging near the St. Andrew AME Church. Some insisted that Bratcher would not shoot at officers and claimed he was unjustifiably shot. Friends and relatives held a vigil for Bratcher on Thursday.\nThe bureau said it has collected evidence from the crime scene, including a handgun believed to have been used by Bratcher. The bureau will conduct its investigation and hand over the finding to the Shelby County district attorney for review. The bureau said it can't predict how long its investigation will take.","url":"https://www.dailymail.co.uk/wires/ap/article-3423435/Authorities-release-Memphis-man-killed-officers.html"}
