{"authors":[],"date_download":"2018-10-22 23:25:39","date_modify":"2018-10-22 23:25:39","date_publish":"2014-10-04 00:00:00","description":"A series of embarrassing and potentially catastrophic missteps has people wondering how to fix the Secret Service. Author Ronald Kessler speaks with NPR's Scott Simon about how it can regain trust.","filename":"data/vaneerConsumption/AuthorSecretServiceCultureIsRotten.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2014_10_04_353678995_author-secret-service-culture-is-rotten_1540250739.html","title":"Author: Secret Service Culture Is 'Rotten'","title_page":"Author: Secret Service Culture Is 'Rotten' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Author: Secret Service Culture Is 'Rotten'\nA series of embarrassing and potentially catastrophic missteps has people wondering how to fix the Secret Service. Author Ronald Kessler speaks with NPR's Scott Simon about how it can regain trust.\nSCOTT SIMON, HOST:\nWe are joined now by Ronald Kessler. He's a best-selling author and award-winning investigative journalist formerly with the Washington Post and the Wall Street Journal, and he's written extensively and critically about the U.S. Secret Service. Mr. Kessler, thanks very much for being with us.\nRONALD KESSLER: Thank you for having me.\nSIMON: You say, among other things, that the Secret Service hasn't kept up with modern technology the way local police departments have.\nKESSLER: There's a culture within the management of we make do with less. And the result is the whole place is crumbling. They don't keep up to date with the latest devices for detecting intruders at the White House, they don't even have devices that detect gunshots, which the D.C. police have. Agents and uniformed officers have to work tremendous overtime hours. Morale is very poor, turnover is high, leading to more costs to train new agents. It's just the most poorly managed organization you can imagine.\nSIMON: You I'm sure have noticed this week that a lot of African-American representatives in Congress seem particularly alarmed. Do they have cause?\nKESSLER: Yeah, you know, regardless of skin color, we should all be concerned and regardless of political affiliation. Agents tell me that it is a miracle that there has not already been an assassination given this corner-cutting, this attitude of taking security lightly.\nSIMON: And what do you say to those who've argued this week that although this is all very embarrassing, the system worked? Ultimately, they were able to stop the intruder in the White House, they were able to remove the guy from the elevator.\nKESSLER: That is such a shortsighted attitude. It's so easy to assassinate the president even with the best security because he's out there in the public, especially when he leaves the White House. To say that gee, nothing happened is ridiculous.\nSIMON: Joseph Clancy's been appointed to replace Julia Pierson, at least on an interim basis. You've suggested that's what needed is a leader from the outside. What would that change?\nKESSLER: Well, in any organization when it's failing, whether it's a corporation or a government agency, the solution is to bring in an outsider who has a fresh perspective, who will change the culture. As an example, Bob Mueller, when he became FBI director he was head of the criminal division of the Justice Department, he was a prosecutor. And one of the first things that happened when he got there was a high-ranking FBI official started obfuscating about some problems within her division. And he removed her, and that sent a message immediately throughout the Bureau - boy, you better be honest, otherwise you're going to be out. And that made a huge difference.\nSIMON: Mr. Kessler, what would you like the Secret Service to look like, say, a year from now?\nKESSLER: I would like the Secret Service to be led by a man or a woman who simply will not put up with this nonsense, and makes it clear that anybody who takes a chance, who engages in this corner-cutting will be fired. The incentives today are just the opposite. If an agent points out deficiencies or potential threats, that person will be punished - will not be promoted. You saw that with the female Secret Service uniformed officer who pointed out that there were shots fired at the White House. And then her supervisor overruled her and said - and poo-pooed it and said no, they weren't gunshots. And later she didn't feel that she could push the point because she felt that she would be criticized by management. So those people who do shut up and perpetrate the myth of the Secret Service as invincible are the ones who get ahead, and then management of course continues this cultural attitude of we're able to take care of any threat, so let's not even lock the front door of the White House.\nSIMON: Ronald Kessler, author most recently of \"The First Family Detail. Thanks very much for being with us.\nKESSLER: Thank you.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2014/10/04/353678995/author-secret-service-culture-is-rotten"}
