{"authors":["Associated Press"],"date_download":"2018-10-23 04:49:28","date_modify":"2018-10-23 04:49:28","date_publish":"2016-01-29 20:38:40","description":"SANTA ANA, California (AP) — Authorities say they have captured one of three inmates who escaped from a California jail last week while facing charges involv...","filename":"data/vaneerConsumption/Authoritiessay1of3Californiafugitiveinmatesarrested.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:cdb6a0cb87d44ee9a307463fa60260fb-3bmscybNe842cce83474b59aca7a-714_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423407_Authorities-say-1-3-California-fugitive-inmates-arrested_1540270168.html","title":"Authorities say 1 of 3 California fugitive inmates arrested","title_page":"Authorities say 1 of 3 California fugitive inmates arrested | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Authorities say 1 of 3 California fugitive inmates arrested\nSANTA ANA, California (AP) — Authorities say they have captured one of three inmates who escaped from a California jail last week while facing charges involving violent crimes.\nOrange County Sheriff Sandra Hutchens said 43-year-old Bac Duong was arrested Friday in Santa Ana, the same city where the trio made their elaborate escape.\nHutchens says Duong flagged down a citizen and said he wanted to turn himself in.\nA wanted sign is displayed for the The reward for information leading to the arrest of the the three escaped inmates from the Orange County Central Men's Jail on Tuesday, Jan. 26, 2016, in Santa Ana, Calif. Hossein Nayeri, Jonathan Tieu and Bac Duong are believed to be dangerous and all were awaiting trial for separate violent felonies, authorities said. (Paul Rodriguez/The Orange County Register via AP) MAGS OUT; LOS ANGELES TIMES OUT; MANDATORY CREDIT\nDuong, Jonathan Tieu and Hossein Nayeri escaped Jan. 22, rappelling down the five-story jail using a rope made of bed sheets.\nA woman who taught English classes at the jail was arrested Thursday on suspicion of helping the men.\nThis undated photo provided by the Orange County Sheriff's Department shows Nooshafarin Ravaghi. Ravaghi, 44, who taught English classes at Central Men's Jail in Santa Ana, Calif., was was arrested Thursday, Jan. 28, 2016, on suspicion of helping three inmates escape the lockup. She was arrested nearly a week after the men ¿ one an alleged killer ¿ cut their way out of the jail and rappelled down an outside wall last Friday. (Orange County Sheriff's Department via AP)\nAuthorities with the Orange County Central Jail stand on the top jail floor in Santa Ana, Tuesday, Jan. 26, 2016. Three inmates, including a man suspected of a killing, cut through metal, crawled through plumbing tunnels, climbed a roof and rappelled down four stories to freedom last week using ropes made from bedsheets. The sheriff's department has been slow to add more rooftop security cameras at the jail despite a grand jury's recommendations for eight years straight, according to a report Monday. (AP Photo/Nick Ut)\nThis undated combo photo provided by the Orange County Sheriff's Office shows tattoos and other markings on the body Bac Duong, one of three inmates who escaped Friday, Jan. 22, 2016, from the county's Central Men's Jail in Santa Ana, Calif. Orange County Sheriff Sandra Hutchens said Wednesday that several arrests have been made in the investigation, but the inmates themselves have not been captured. (Orange County Sheriff's Office via AP)\nThis undated photo provided by the Orange County Sheriff's Office shows Bac Duong, one of three inmates who escaped Friday, Jan. 22, 2016, from the county's Central Men's Jail in Santa Ana, Calif. Orange County Sheriff Sandra Hutchens said Wednesday that some arrests have been made in the investigation, but the inmates themselves have not been captured. (Orange County Sheriff's Office via AP)\nCORRECTS DAY TO SATURDAY, JAN. 23- This undated photo provided by the Orange County Sheriff's Office shows a 2008 White GMC Savana utility van that authorities believe three escaped inmates from Orange County, Calif., stole from South Los Angeles on Saturday, Jan. 23, 2016, following their jailbreak Friday. Sheriff's Lt. Jeff Hallock said Nooshafarian Ravaghi, a 44-year-old woman who taught English as a second language to inmates, was arrested Thursday on suspicion of helping three inmates escape the lockup. (Orange County Sheriff's Office via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-3423407/Authorities-say-1-3-California-fugitive-inmates-arrested.html"}
