{"authors":["Kate Pickles For Mailonline"],"date_download":"2018-10-23 01:58:01","date_modify":"2018-10-23 01:58:01","date_publish":"2016-01-28 16:29:22","description":"Coco Bradford, from Cornwall, would become frustrated at not being able to communicate, her mother Rachel said. She started ABA therapy in September and spoke again this week.","filename":"data/vaneerConsumption/Autisticgirl5whodidntspeakfor3yearsasksformoreTOASTplease.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AB561900000578-0-image-a-39_1453997907429.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3421268_Autistic-girl-5-didn-t-speak-three-years-stuns-parents-suddenly-asking-TOAST-please_1540259881.html","title":"Autistic girl, 5, who didn't speak for 3 years asks for 'more TOAST please'","title_page":"Autistic girl, 5, who didn't speak for 3 years asks for 'more TOAST please' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"For three years she had not uttered a word, communicating only through pictures.\nDiagnosed with autism, Coco Bradford had begun speaking at the age of two - only to cease completely.\nBut this week her silence ended when, out of the blue, she asked her astonished parents for 'more toast please'.\nHer mother and full-time carer Rachel, 48, said: 'It was a really magical moment - it was the first thing she has said in three years.\n'Her exact words were ''I want more toast please''. She just kept saying it and we were just like \"oh my god\".'\nCoco Bradford, 5, has autism. She began speaking at the age of two - but ceased shortly afterwards and pointed to pictures to communicate. This week, she spoke for the first time in three years\nCoco ended her silence ended when, out of the blue, she asked her astonished parents for 'more toast please'. Her mother Rachel said: 'I am not surprised her first words were about toast. She loves it'\n'She looked so pleased with herself and was jumping up and down and just kept saying ''I want more toast''.\nShe added: 'I am not surprised her first words were about toast. She loves it and has always eaten it.\n'Like most kids with autism has a very limited diet.\n'You are not supposed to show how excited you get as kids link power with that word but we just couldn't control it. We were clapping and cheering.'\nCoco was saying two-word sentences when she stopped talking altogether at two. Like many children with autism, she has struggled to communicate with people\nLike many children with autism, Coco's language skills were delayed and she struggled to communicate.\nAccording to the National Autistic Society, typical signs are a lack of social instinct, an interest in things rather than people, difficulties with language, and finding comfort in routine and repetitiveness.\nPeople with autism tend to have all these symptoms, though to differing degrees.\nCoco found her voice again after starting a special type of speech therapy called Applied Behavioural Analysis, or ABA in September last year.\nOriginally developed at the University of California, ABA uses a system of rewards to teach a child skills and train them to behave according to social norms.\nMrs Bradford - who lives in St Ives, Cornwall, with husband Luke and has four other children Bianca, 28, Chelsea, 25, Elle, 22, and Oakley, eight - said it had been hard for the family.\n'Coco was talking at 26 months but did not get to more than two word sentences,' she said.\nWHAT IS ABA? Applied Behavioural Analysis, or ABA, was originally developed at the University of California. It uses a system of rewards to teach a child skills and train them to behave according to social norms. Under the supervision of a trained psychologist, ABA tutors work with people at home and school, breaking tasks down into chunks which are repeated over and over. They also teach parents the techniques. ABA claims it can be used to teach everything from toilet training and academic subjects to how to play and have conversations.\n'But her talking just faded away and she stopped responding to her name or making any eye contact.\n'You could tell she was just so frustrated. We tried a speech therapist but the last two years have been horrendous.\n'You could tell angry she was becoming with herself.'\nCoco's treatment was only made possible thanks to a fundraising campaign that has so far raised over £20,000.\nMrs Bradford said she had messaged Coco's tutors to tell them of the news and said they were delighted.\n'We waited so long for her to talk and for her to just do it unprompted was quite magical really.\n'It is just so lovely and I can not explain how happy we all are. The day after, my husband came home from work and Coco poked her head around the corner and said hello.\n'It has really opened things up and in just two days she has started using a lot more words.\n'The speed of how quickly she has learnt has shocked everyone. She is now shocking us every day with something new.","url":"https://www.dailymail.co.uk/health/article-3421268/Autistic-girl-5-didn-t-speak-three-years-stuns-parents-suddenly-asking-TOAST-please.html"}
