{"authors":["Audrey Quinn","Kaitlin Sullivan"],"date_download":"2018-10-22 21:50:34","date_modify":"2018-10-22 21:50:34","date_publish":"2018-07-07 00:00:00","description":"Autistic adults talked about their soothing stim toys with WNYC Studios, creator of the Aftereffect podcast. It examines the life of Arnaldo Rios Soto, an autistic man involved in a police shooting.","filename":"data/vaneerConsumption/AutismStimToysAndWNYCsAftereffectPodcastShots.json","image_url":"https://media.npr.org/assets/img/2018/07/03/img_6300_wide-b7ef652b6cb35e6a3f703a6733a5c3467b7b7181.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2018_07_07_625756385_autistic-new-yorkers-share-their-stim-toy-stories-with-aftereffect_1540245034.html","title":"Autism, Stim Toys And WNYC's 'Aftereffect' Podcast : Shots","title_page":"Autism, Stim Toys And WNYC's 'Aftereffect' Podcast  : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Autistic New Yorkers Share Their Stim-Toy Stories With 'Aftereffect'\nEditor's note: As WNYC Studio's Aftereffect podcast explains, we followed the preference of many self-advocates in choosing to use identity-first language for autism. Here's a post from the Autistic Self-Advocacy Network to explain that approach.\nArnaldo Rios Soto, 28 Enlarge this image toggle caption Norma Molina for WNYC Norma Molina for WNYC\nIn Arnaldo Rios Soto's North Miami neighborhood, neighbors knew the now-28-year-old as the man with the toy trucks.\nHis favorite was a shiny silver tanker that he named based on its logo, \"Celulares Telefónica,\" for the Puerto Rican phone company. He took it everywhere with him, on walks to the park and to the corner store.\nHe'd twist it around and around in his fingers, sometimes rubbing its smooth surface against his cheek. But on July 18, 2016, North Miami police officers mistook Arnaldo's toy for a gun. The consequences of that misinterpretation play out over eight episodes in the new WNYC Studios podcast Aftereffect.\nThrough this reporting I also talked to autistic adults about how they've felt misjudged for carrying stim toys, like Arnaldo's truck.\nAbout Aftereffect In the summer of 2016, a police shooting upended the life of Arnaldo Rios Soto, a 26-year old, nonspeaking, autistic man. Aftereffect tells Arnaldo's story — a hidden world of psych wards, physical abuse and chemical restraints — and asks the question: What made Arnaldo's life go so wrong? You can find the episodes here. WNYC's health coverage and Aftereffect is supported in part by the Robert Wood Johnson Foundation, Jane and Gerald Katcher and the Katcher Family Foundation, Science Sandbox, an initiative of the Simons Foundation, and the Alfred P. Sloan Foundation. Thanks also to the Rosalynn Carter Fellowship for Mental Health Journalism.\nStim toys are objects that people on the spectrum (or anyone else) can use to make soothing repetitive movements. When you feel overwhelmed with sensory input, as a lot of autistic people often feel, stim toys can help settle all that noise by giving you one specific thing to home in on.\nRecently more and more self-advocates have been reclaiming the notion of stim toys, not as markers of childishness, but as highly evolved coping mechanisms.\nAt WNYC we invited autistic New Yorkers from all over the spectrum to a portrait session with their favorite stim toys or other important objects, and we talked with these people about how they want to be perceived.\nJesse and Nathaniel Baryaacov, 18 Enlarge this image toggle caption Amy Pearl for WNYC Amy Pearl for WNYC\nJesse and Nathaniel are identical twins. They're both nonspeaking. Jesse has preferred to carry a shoelace or other string with him since he was little. \"He likes to rub it and he likes to clap it,\" his mom Jenny says. He uses the string both for communication and to stim. \"And sometimes when he's clapping it, he's happy and he laughs,\" Jenny explains. \"And sometimes he's stressed out so he uses it to calm himself.\"\nNathaniel has a preference for flat plastic or cloth that makes a clapping sound. \"I think it does help him when he's tense,\" Jenny says. \"But he does it plenty of times when he's just wandering around the house. He just likes doing it.\"\nMabellene Gonzales, 30 Enlarge this image toggle caption Amy Pearl for WNYC Amy Pearl for WNYC\nMabellene owns at least a dozen different hats. \"I've been wearing hats for perhaps over a decade,\" she says. \"I feel like the cast of the hat, it gives off a shadow to hide my eyes. And eye contact has never been one of my strongest suits. It's as much a security blanket as it is expressing my sense of style.\"\nPorter Francis, 14 Enlarge this image toggle caption Amy Pearl for WNYC Amy Pearl for WNYC\nPorter is a booklover. \"I brought a lot of books because, yeah, I read fast,\" he says. \"I've blown through the first Harry Potter book in one school day. Books are just awesome.\" His favorite genre is science fiction, \"Maybe it's because it lets me distract myself from the current world.\" Porter says lately he's been enjoying audiobooks even more, \"They normally last me longer.\"\nElizabeth Rosenzweig, 34 Enlarge this image toggle caption Amy Pearl for WNYC Amy Pearl for WNYC\n\"I started to read spontaneously when I was 18 months old,\" says Elizabeth. \"And so books were always the way I interfaced with the world. Novels are one of the greatest ways to learn empathy because you're looking at things through someone else's eyes. Reading has never been a guilty pleasure for me; it's also been the key to my academic accomplishments.\" This fall she's heading off to a Ph.D. program at Rutgers University in quantitative biomedicine, after winning over an adviser with her knowledge of a rare disease — something she learned about from novels.\nEvan Blech, 20 Enlarge this image toggle caption Amy Pearl for WNYC Amy Pearl for WNYC\nEvan, 20, loves the feeling of old-fashioned film. He likes putting it in his family's projector, and marking the film with masking tape and a pen. He says it makes him \"happy, excited.\" And every time he sees a film that he set up on the projector, \"I feel much good.\"\nEmmalia Harrington, 32 Enlarge this image toggle caption Amy Pearl for WNYC Amy Pearl for WNYC\n\"I've been collecting dolls since I was little,\" says Emmalia. \"This is Adena. I cobbled her together from two different dolls and gave her a full-body dye bath. Her body comes from a small company that specializes in producing dolls for amputee children, So her legs are very short and covered with stockings with knots at the end.\" Emmalia has been sewing her own dolls clothes since college, from patterns she makes herself, \"because I want more of my dolls to have disabilities ... .\"\n\"The act of sewing, knitting, what have you, is a very nice stim for me. I will fidget myself bloody if my hands are left idle,\" she says, so she also always keeps a shark-shaped stim toy in her bag as well.\nEmmalia also wanted to add, \"I am autistic but I am not a white. I'm neither white nor straight nor a guy. We exist.\"\nOscar Segal, 23 Enlarge this image toggle caption Amy Pearl for WNYC Amy Pearl for WNYC\n\"I like my green backpack,\" says Oscar. \"It does make me feel independent and help me get around the city and stuff. And when I take buses, trains and Uber, I always have my stuff with me.\" Oscar sometimes goes out with support staff, but has practiced most of his routes around the city with this backpack so many times that he never misses a stop.\n\"I have a bunch of jobs,\" he says. \"Like I'm a paid greeter at Shake Shack 16 hours a week, so I give out the menus, the samples and I also give drink refills. I also make dog biscuits for an autism program. They're organic and they're good for dogs, not for humans.\"\nAudrey Quinn is a reporter with New York Public Radio, WNYC. She's spent the last year reporting on adults and autism. Her new podcast Aftereffect from WNYC Studios looks at what happened when the North Miami Police mistook an autistic man's toy truck for a gun — and opened fire. Kaitlin Sullivan is an intern at WNYC.","url":"https://www.npr.org/sections/health-shots/2018/07/07/625756385/autistic-new-yorkers-share-their-stim-toy-stories-with-aftereffect"}
