{"authors":[],"date_download":"2018-10-22 20:35:02","date_modify":"2018-10-22 20:35:02","date_publish":"2014-06-02 12:50:59","description":"In the first quarter, the average auto loan jumped $964 to $27,612, an all-time high, according to Experian.","filename":"data/vaneerConsumption/AutoBuyersLoadUponRecordAmountofLoans.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/480991/140602-autos_0824_546b8e5556a51674b906a8fc9811a298.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_autos_auto-buyers-load-record-amount-loans-n120136_1540240502.html","title":"Auto Buyers Load Up on Record Amount of Loans","title_page":"Auto Buyers Load Up on Record Amount of Loans","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIn the latest sign Americans are increasingly comfortable taking on more debt, auto buyers borrowed a record amount in the first quarter with the average monthly payment climbing to an all-time high of $474.\nNot only that, buyers also continued to spread payments out over a longer period of time, with 24.8 percent of auto loans now coming with payment terms between six and seven years according to a new report from Experian Automotive.\nThat's the highest percentage of 6 and 7-year loans Experian has ever recorded in a quarter\n\"I'm not surprised consumers are borrowing more or taking out longer auto loans,\" said Melinda Zabritski of Experian Automotive. \"With relatively low interest rates, buyers are more comfortable taking out longer loans so they can keep their monthly payment as low as possible.\"\nExperian, analyzed approximately 4.7 million new and used auto loans written between January and March.\nThose loans totaled $100.7 billion, a record amount for auto loans written in any quarter in the U.S. The average length of auto loans increased by one month to five and half years, a new all-time high, it said\n\"Consumers are really relying on financing as the price of new vehicles continues to move higher,\" said Zabritski.\nIn the first quarter, the average auto loan jumped $964 to $27,612, an all-time high, according to Experian. Just five years ago, the average auto loan was $24,174.","url":"https://www.nbcnews.com/business/autos/auto-buyers-load-record-amount-loans-n120136"}
