{"authors":[],"date_download":"2018-10-22 22:17:32","date_modify":"2018-10-22 22:17:32","date_publish":"2014-06-09 18:07:26","description":"General Motors, Ford and Chrysler are pledging $26 million to help support retiree pensions while keeping the city's art off the auction block.","filename":"data/vaneerConsumption/AutomakerstoHelpSaveDetroitsArtTreasures.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/497156/140609-detroit-bankruptcy-art-autos-mms-1410_4e44235eaec786a29f867ab9dd03353a.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_business-news_automakers-help-save-detroits-art-treasures-n126481_1540246652.html","title":"Automakers to Help Save Detroit's Art Treasures","title_page":"Automakers to Help Save Detroit's Art Treasures","title_rss":"NULL","source_domain":"nbcnews.com","text":"Of the $26 million, $10 million will come from Ford Motor Co., $6 million from Chrysler Group LLC, $5 million from General Motors Co. and $5 million from the General Motors Foundation.\n\"The city needs more and specifically the city needs cash,\" Reid Bigland, head of U.S. sales for Chrysler, said during the announcement at the museum.\nSince leaving bankruptcy protection itself in 2009, GM has posted about $20 billion in earnings and currently has a cash stockpile of $27 billion. Chrysler has earned nearly $4 billion since exiting bankruptcy and had $12.5 billion in cash at the end of the first quarter.\nLast week, the Michigan Legislature approved sending $195 million to Detroit's two retirement systems, and Gov. Rick Snyder has said he will sign the bill. A dozen foundations also have committed about $360 million.\nThe influx of money for pensions has become part of state-appointed emergency manager Kevyn Orr's plan of adjustment, which is Detroit's roadmap through and beyond bankruptcy.\nAs part of the deal, the city's art museum and its assets would be transferred to a private nonprofit. About 2,800 city-owned artworks have been valued at between $454 million and $867 million.\nDIA officials would not say how much more the museum needs to reach its $100 million goal.\nSnyder called the corporate and foundation support the \"fundamental core\" of Detroit's comeback.\n-The Associated Press","url":"https://www.nbcnews.com/business/business-news/automakers-help-save-detroits-art-treasures-n126481"}
