{"authors":["Tai Gooden"],"date_download":"2018-10-31 01:41:36","date_modify":"2018-10-31 01:41:36","date_publish":"2018-08-28 11:09:52","description":"Oprah Winfrey Network will explore the profound impact of August 28 on Black history with August 28: A Day in the Life of a People. The short film was written, produced, and directed by the incredible Ava DuVernay and takes viewers through six…","filename":"data/vaneerConsumption/AvaDuvernaysAugust28DelvesIntoJustHowMonumentalThatDateIsToBlackHistoryInAmerica.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/23/792f10e7-41ba-483d-9ee5-026afe3b1473-getty-929491814.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_ava-duvernays-august-28-delves-into-just-how-monumental-that-date-is-to-black-history-in-america-10220382_1540950096.html","title":"Ava Duvernay's 'August 28' Delves Into Just How Monumental That Date Is To Black History In America","title_page":"Ava Duvernay's 'August 28' Delves Into Just How Monumental That Date Is To Black History In America","title_rss":"NULL","source_domain":"bustle.com","text":"Oprah Winfrey Network will explore the profound impact of August 28 on Black history with August 28: A Day in the Life of a People. The short film was written, produced, and directed by the incredible Ava DuVernay and takes viewers through six significant moments that took place on that date during a 175 year span. Who knew so many important things happened, all on the same day?\nThe film was previously available only at the Oprah Winfrey Theatre at the Smithsonian’s National Museum of African-American History and Culture (NMAAHC) in Washington, D.C. but now this rich and visually stunning work of art can be experienced by a larger audience. DuVernay, a self-proclaimed history geek, spoke to CBS correspondent Gayle King in 2016 about how she created August 28 for the groundbreaking museum. She got a call from the museum saying they wanted her to do the orientation film for visitors and was thrilled to accept the offer.\nThe director was given free reign to create a film and the museum loved her August 28 idea. DuVernay said she would continue to track this date and perhaps update the film with additional August stories in the future.\nCBS News on YouTube\nAugust 28 brought history to life with a star-studded cast including Regina King, David Oyelowo, Don Cheadle, Lupita Nyong’o, Michael Ealy, Angela Bassett, Andre Holland, Gugu Mbatha-Raw, and Glynn Thurman. Each event included an actor giving background information about what happened and its impact on Black people. Then, some scenes would immerse the viewer in that time period with a glimpse into an everyday person’s life. The characters would recite powerful words from Black icons like Maya Angelou and Claude McKay to fully encapsulate the emotional ramifications of what transpired on that day.\nSome of these events are well-known while others may not be so familiar. Here are the six August 28 moments that changed the world.\n\"Please Mr. Postman\" Hits The Radio ticktock70 on YouTube Regina King opens the film with a creative accomplishment by Motown Records. The Detroit-based record label was founded in 1959 by Berry Gordy as Tamla Records and became Motown the following year. Motown played a key role in providing a Black-owned label catering to Black talent during times of civil unrest and soon became synonymous with excellence in Black music with acts like The Temptations, Smokey Robinson, Marvin Gaye, The Jackson Five, and countless other artists. In 1961, “Please Mr. Postman” by The Marvelettes began playing on the radio and became the first number one hit for the label. As stated in the film, the Motown sound became a staple in music and bridged the gap for artists to crossover to mainstream success. King then portrayed a ‘60s mom who turns up the radio and shows her teenage daughter how to really get down. It’s a heartwarming peek at a moment of levity and peace inside a Black family’s home, which juxtaposes the turbulence of the time outside of it.\nThe Death of Emmett Till Scott Olson/Getty Images News/Getty Images August 28 then uses David Oyelowo’s powerful voice to highlight the senseless death of Emmett Till, a Black teen who was killed in 1955 in Mississippi after allegedly flirting with Carolyn Bryant, a white woman at a grocery store. Till was tracked down by white men, including Bryant’s husband, and was beaten, shot in the head, and thrown into the Tallahatchie River with a cotton gin fan attached to his body. Oyelowo also documents the aftermath of his death, including his mother Mamie Mobley-Till’s decision to have an open casket funeral so the world could see the brutality of racism and lynching. The actor transforms into an unnamed worker alongside Don Cheadle as they build a pine box like the one Till was buried in. As they assemble the makeshift casket, the pair recite “If We Must Die” by Claude McKay to convey their pain. McKay’s poem was written during a rise in hate crimes and violence known as the Red Summer of 1919, according to Thought Co. It’s a powerful proclamation by oppressed people declaring they will fight the murderers and oppressors responsible for their deaths until the end.\nThe Slavery Abolition Act of 1833 Bob Miller/Getty Images News/Getty Images Glynn Thurman highlights the British royal ascent of the Slavery Abolition Act of 1833, which freed more than 880K slaves and opened the doors for others to seek freedom. It was also a precursor to the United States Emancipation Proclamation 30 years later. Since then, people have been fighting against systemic oppression that leads to continued socioeconomic disparities and acts of race-fueled violence in the Black community. Thurman recites Frances Harper’s “Bury Me in a Free Land,” which depicts several horrors of slavery as the author hopes to one day be buried in soil where everyone is free. According to Biography, Harper was a Black abolitionist who was actually born free and had a career as a poet. She documented her experiences with meeting former slaves, many of them illiterate, and helped tell their stories.\nHurricane Katrina Devastates New Orleans Mario Tama/Getty Images News/Getty Images Hurricane Katrina had a deadly and devastating effect on the vibrant city of New Orleans in 2005. Gugu Mbatha-Raw recaps the horrific natural disaster, the water barrier failures, and the poor response that led to thousands of people dying, most of whom were Black. According to the film and historians, many of the low-income residents were left stranded and abandoned during this desperate time. Social class and racial disparities have affected Black communities for decades during times of crisis and are a reminder that all citizens deserve helping hands in emergencies. Gugu became a Katrina victim trapped in a dark attic as a helicopter bypasses her neighborhood. The frustrated woman dives into the water that has submerged her home as she recites words from “The Negro Speaks of Rivers” by Harlem Renaissance writer Langston Hughes. The poem speaks about seeing ancient rivers on Earth, but it is really a journey of how Black roots have spread around the world. Hughes mentions New Orleans and the Mississippi River by name, making it a fitting choice for this segment.\n'I Have A Dream' Chip Somodevilla/Getty Images News/Getty Images The 1963 civil rights March on Washington and Martin Luther King’s iconic “I Have A Dream” speech is one of the most well-known American historical moments, but August 28 puts an interesting spin on it by focusing on one woman in the audience, portrayed by Angela Bassett. She stands in the crowd beside a man (Andre Holland) as they wait for Dr. King to take the stage. Neither of them are aware that they are about to be a living witness to a pivotal moment in history. They communicate with an excerpt from Zora Neal Hurston’s autobiography Dust Tracks on a Road where she muses about her Blackness from an interesting, hopeful viewpoint.","url":"https://www.bustle.com/p/ava-duvernays-august-28-delves-into-just-how-monumental-that-date-is-to-black-history-in-america-10220382"}
