{"authors":["Associated Press"],"date_download":"2018-10-23 02:03:27","date_modify":"2018-10-23 02:03:27","date_publish":"2016-01-28 16:47:35","description":"WASHINGTON (AP) — Average long-term U.S. mortgage rates fell this week for a fourth straight week amid persisting turmoil in stock markets and global economi...","filename":"data/vaneerConsumption/AverageUSrateon30yearmortgagefallsto379percent.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:ce15c96c93314fa6810a7ace355e2df4-2vdWmEltwXfba0ce28e632abac67-492_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421227_Average-US-rate-30-year-mortgage-falls-3-79-percent_1540260207.html","title":"Average US rate on 30-year mortgage falls to 3.79 percent","title_page":"Average US rate on 30-year mortgage falls to 3.79 percent | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Average US rate on 30-year mortgage falls to 3.79 percent\nWASHINGTON (AP) — Average long-term U.S. mortgage rates fell this week for a fourth straight week amid persisting turmoil in stock markets and global economic worries.\nMortgage buyer Freddie Mac said Thursday the average rate on a 30-year fixed-rate mortgage slipped to 3.79 percent from 3.81 percent a week earlier. That means it stays below the symbolically significant 4 percent level. The rate has increased from its 3.66 percent average a year ago but remains well below its historic average of 6 percent.\nThe average rate on 15-year fixed-rate mortgages declined to 3.07 percent from 3.10 percent.\nFILE - In this Tuesday, June 9, 2015, file photo, a sold sign is displayed in the yard of a newly constructed home in the Briar Chapel community in Chapel Hill, N.C. On Thursday, Jan. 28, 2016, Freddie Mac reports on the week¿s average U.S. mortgage rates. (AP Photo/Gerry Broome, File)\nThe Federal Reserve sounded a note of concern Wednesday about how global pressures could affect a slowing U.S. economy. Fed policymakers kept a key interest rate unchanged following their meeting this week.\nThe continuing volatility in global stock markets has pushed up prices of U.S. government bonds as investors seek safety. That has depressed the yields on the bonds, which mortgage rates track.\nThe yield on the 10-year Treasury bond stood at 2 percent Wednesday, after dropping to 1.98 percent a week earlier — its lowest level since October. The yield was stable at 2 percent Thursday morning.\nThe benchmark yield has fallen sharply since the start of the year amid the market turbulence. At the end of 2015, it was 2.30 percent.\nThe sustained decline in mortgage rates in recent weeks has spurred prospective homebuyers. Applications for mortgages increased 8.8 percent in the week ended Jan. 22 from the previous week, according to the Mortgage Bankers Association.\nThe number of people signing contracts to purchase homes managed to inch up last month, thanks to unseasonably warm weather in the Northeast, data issued Thursday by the National Association of Realtors showed. The tiny bump suggests that home sales may plateau this year after a solid increase in 2015.\nTo calculate average mortgage rates, Freddie Mac surveys lenders across the country at the beginning of each week. The average doesn't include extra fees, known as points, which most borrowers must pay to get the lowest rates. One point equals 1 percent of the loan amount.\nThe average fee for a 30-year mortgage was unchanged from last week at 0.6 point. The fee for a 15-year loan remained at 0.5 point.","url":"https://www.dailymail.co.uk/wires/ap/article-3421227/Average-US-rate-30-year-mortgage-falls-3-79-percent.html"}
