{"authors":["Associated Press"],"date_download":"2018-10-23 03:21:30","date_modify":"2018-10-23 03:21:30","date_publish":"2017-03-16 14:09:19","description":"WASHINGTON (AP) - Long-term U.S. mortgage rates rose this week for a second straight week, posting new highs for the year. The markets were anticipating an...","filename":"data/vaneerConsumption/AverageUS30yearmortgageraterisesto430percent.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/14/wire-229017-1489675782-638_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320424_Average-US-30-year-mortgage-rate-rises-4-30-percent_1540264890.html","title":"Average US 30-year mortgage rate rises to 4.30 percent","title_page":"Average US 30-year mortgage rate rises to 4.30 percent | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"WASHINGTON (AP) - Long-term U.S. mortgage rates rose this week for a second straight week, posting new highs for the year. The markets were anticipating an increase in a key interest rate by the Federal Reserve, which the Fed announced Wednesday.\nMortgage buyer Freddie Mac said Thursday the rate on 30-year, fixed-rate loans climbed to 4.30 percent from 4.21 percent last week. The benchmark rate stood at 3.73 percent a year ago and averaged 3.65 percent through 2016, the lowest level in records dating to 1971.\nThe rate on 15-year mortgages increased to 3.50 percent from 3.42 percent last week.\nFILE - In this May 24, 2016 file photo, a \"Sold\" sign is placed front of a house in Andover, Mass. On Thursday, March 16, 2017, Freddie Mac reports on the week's mortgage rates. (AP Photo/Elise Amendola, File)\nThe Fed's move marked the second time in three months that the central bank has raised its benchmark interest rate. The Fed also forecast two additional hikes this year. The Fed action reflects a consistently solid U.S. economy and will likely mean higher rates on some consumer and business loans.\nThe key short-term rate is rising by a quarter-point to a still-low range of 0.75 percent to 1 percent. The Fed said in a statement that a strengthening job market and rising prices had moved it closer to its targets for employment and inflation.\nTo calculate average mortgage rates, Freddie Mac surveys lenders across the country between Monday and Wednesday each week. The average doesn't include extra fees, known as points, which most borrowers must pay to get the lowest rates. One point equals 1 percent of the loan amount.\nThe average fee for a 30-year mortgage was unchanged this week at 0.5 point. The fee on 15-year loans also remained at 0.5 point.\nRates on adjustable five-year loans rose to 3.28 percent from 3.23 percent last week. The fee held at 0.4 point.","url":"https://www.dailymail.co.uk/wires/ap/article-4320424/Average-US-30-year-mortgage-rate-rises-4-30-percent.html"}
