{"authors":["Jonathan Ray"],"date_download":"2018-10-23 04:24:38","date_modify":"2018-10-23 04:24:38","date_publish":"2016-01-11 17:25:24","description":"It is one of Europe's tiniest pockets. And, when he arrived, Jonathan Ray was not entirely sure why he had travelled there. But a mere two days were enough to make him fall for little Luxembourg.","filename":"data/vaneerConsumption/AveryLuxtakeonEuropeFinefizzychampagnefirstratefoodandscenicjoysaweekendintinyfascinatingLuxembourg.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/2C9AFA9A00000578-0-image-a-3_1452533044122.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_article-3394199_A-Lux-Europe-Fine-fizzy-champagne-rate-food-scenic-joys-weekend-tiny-fascinating-Luxembourg_1540268678.html","title":"A very Lux take on Europe: Fine, fizzy 'champagne', first-rate food and scenic joys - a weekend in tiny fascinating Luxembourg","title_page":"A very Lux take on Europe: Fine, fizzy 'champagne', first-rate food and scenic joys - a weekend in tiny fascinating Luxembourg  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sheeting rain greets me on arrival in Luxembourg City, and it's mighty chilly. No one I know has ever visited Luxembourg. Indeed, no one I know has ever expressed a desire to do so, and I was beginning to wonder why on earth I'd bothered.\nI checked into Hotel Simoncini, a boutique hotel-cum-art-gallery in the centre of the city, dumped my bags, grabbed a brolly and headed out.\nIt so happened that I had arrived, completely unplanned, on the eve of Luxembourg's National Day - Grand Duke Henri's Official Birthday - and despite the driving rain, the city was fully en fête with stalls, stages and pop-up bars on every street and square.\nGreat things in small packages: Luxembourg may not be huge, but it has plenty to entertain visitors\nI stopped under a dripping parasol and ordered a glass of cremant, the Luxembourgish sparkling wine that everyone drinks.\nAnd, blow me, it was overwhelmingly delicious. Why had no one told me that Luxembourg cremant was so good? Creamy, toasty, fruity and zesty, it would give many a champagne a run for its money. And, as I later discovered, Luxembourg's Alsace-like still wines are equally toothsome.\nI grabbed a bowl of warming bouneschlupp (the typical green bean and sausage soup) in Am Tiirmschen, a restaurant celebrated for its local grub, and went out to join the crowds of partying Luxembourgers.\nA group of kindly youngsters adopted me, and we danced, sang and drank until dawn.\nWe also saw the most astonishing firework display, exploding high above the city in honour of the Grand Duke. It was better even than the pornographic pyrotechnics and fruity fireworks I once saw in Nice, but that's another story.\nLuxembourg is built around the gorges of the Alzette and Petrusse rivers, with an Upper Town and a Lower Town (accessible by lift), and was once such a great medieval fortress it became known as 'the Gibraltar of the North'.\nMany of the fortifications remain, and the following morning I spent a merry time getting lost in the 12 miles of labyrinthine tunnels and casemates that run through the ancient walls.\nThe Corniche — 'the most beautiful balcony in Europe' — is a glorious spot to idle about, as are the well-tended city gardens and the Neimënster Abbey/arts centre on the banks of the Alzette.\nThe Old Town, with its Grand Ducal Palace, Chamber of Deputies, cathedral and excellent, if small, museums and galleries, is a city in miniature and takes barely half-an-hour to wander round, including coffee stops.\nAnd it somehow fits Luxembourg's Ruritanian charm that in the Government District one is able to walk right up to the prime minister's office and ring the doorbell, without a barrier or policeman in sight.\nI hired a bike from Velosophie (www.velosophie.lu) and cycled through the peaceful green heart of the city with its immaculate parks full of birdsong.\nI paid my respects to the old Radio Luxembourg HQ and headed across the Red Bridge into Kirchberg to gawp at the striking Philharmonie concert hall and spent an hour in the even more impressive modern art museum (known as MUDAM), designed by Ieoh Ming Pei (he of the glass pyramid at the Louvre).\nThere I ate pigs' trotters and horse steak in Restaurant Ems, near the station, and had one of the best dinners I've ever eaten anywhere (six courses with six wines to match) sitting in a tiny turret in Chiggeri Restaurant overlooking the darkening city.\nSo tiny is Luxembourg (both country and city) that during my long weekend I still had time to hire a car and head north-west for a night at the delightful Hotel-Restaurant de la Gaichel, famous not only for its Michelin-starred grub but also for its nine-hole golf course, two holes of which are in Belgium.\nThe following day, I drove due east from the Belgian border to Germany, between lush, green fields, through the romantic Eisch Valley - the Valley of the Seven Castles - and the wooded highlands of Mullerthal, Luxembourg's 'Little Switzerland'.\nHaving arrived in Luxembourg expecting little, I left having enjoyed much. Luxembourg is no Rome or Paris. But it's a doddle to get to (eastJet from Gatwick in around an hour) and is as charming and as quirky a weekend destination as I can think of.","url":"https://www.dailymail.co.uk/travel/article-3394199/A-Lux-Europe-Fine-fizzy-champagne-rate-food-scenic-joys-weekend-tiny-fascinating-Luxembourg.html"}
