{"authors":[],"date_download":"2018-10-30 01:15:58","date_modify":"2018-10-30 01:15:58","date_publish":"2015-09-04 08:00:00","description":null,"filename":"data/vaneerConsumption/AVictoryforDisciplineProperlyUnderstood.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/09/1024px-thumbnail_5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862158.html","title":"A Victory for Discipline, Properly Understood","title_page":"A Victory for Discipline, Properly UnderstoodThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"My initial reaction to a federal judge tossing Tom Brady’s four-game suspension was as close to Rob Gronkowski spiking the football as I can get. As a longtime New England Patriots fan, it was difficult to avoid social media trash-talking: Court also awards quarterback the Super Bowl rings belonging to Joe Namath and Peyton Manning.\nBut the truth is Brady’s victory is a win for 31 other NFL teams—if cooler heads prevail and this leads to changes in the way the league office handles player discipline.\nThe NFL’s current process is broken. The 2011 collective bargaining agreement (CBA) arguably gives the commissioner too much power in these matters, but the league has stretched even that to a legal breaking point.\nCourts are generally reluctant to overturn arbitration awards. The whole point of arbitration is to keep these kinds of disputes from ever seeing the inside of a courtroom in the first place. There is also ample precedent the NFL can, and did, cite. Even when facing liberal judges, the league should generally win these cases with ease.\nIn fact, the court the NFL chose to hear the Brady case had upheld 66 out of 68 arbitration rulings that previously came before it. The league filed the suit itself in a preemptive strike against the players’ union and Brady’s lawyer, hoping for a friendly venue in New York.\nThey lost decisively, and it’s becoming a pattern.\nThe NFL hired Ted Wells for an investigation that was short on direct evidence and heavy on selective inferences. If you are trying to determine whether your son ate a cookie before dinner, it will suffice to determine that the cookie jar is emptier, your son likes cookies, and he was seen in the kitchen. But if you are conducting a multimillion dollar investigation involving your sport’s marquee player, indeed the reigning Super Bowl MVP, you might want something a little more airtight, no pun intended.\n(You may reply that footage of your son’s hoodlum friend taking the cookie jar to the bathroom or sonny boy destroying the napkin that may contain cookie crumbs are points in your favor. But evidence that cookies frequently disappear from the jar due to natural causes, such as your home’s rodent infestation, would count against you.)\nSet aside for a moment technical arguments about the Ideal Gas Law and even your feelings about Brady’s guilt or innocence. The NFL has lost in court to Ray Rice and Adrian Peterson, two players whose involvement in the underlying offenses that triggered their suspensions weren’t in serious dispute.\nThe NFL has two problems. One, it is selective in its outrage. The league won’t care about domestic violence or performance enhancing drugs or air pressure in footballs. So the league only penalizes players after some constituency—the public, key owners, or influential special interests—gets outraged and demands it.\nOnce Roger Goodell’s minions are convinced they must Do Something, then they shift from benign neglect to wild overreaction. They must demonstrate they are tough, even if the punishment is unfair or arguably fair but inconsistent with either the CBA or the law of shop.\nGood investigations are difficult for private organizations to conduct even when they are trying to be fair. When there is a preordained conclusion that will inevitably be upheld through an appeals process made up of non-independent kangaroo courts and bolstered through selective media leaks designed to manipulate public opinion, they are impossible.\nNobody expects a professional sports league to operate under the burden of proof required in criminal cases. But a good process has to provide some way for an accused player to argue his innocence, or at least know which infractions will produce which punishments.\n“Anytime that there is league discipline, one fanbase tends to see all the unfairness with the system, and the other 31 laugh and point,” writes Stephanie Stradley, a lawyer and Houston Texans blogger whose Deflategate analysis has been an island of sanity in a sea of madness. “There were significant problems with the Bullygate and Bountygate investigations, but unless you are a part of the Dolphin or Saint fanbases, you likely didn’t notice them. Who is going to stick up for Richie Incognito on anything?”\nYes, you want football fans to trust in the integrity of the game. Star quarterbacks must comply with the rules for air pressure in game balls. But that also includes a disciplinary process that fans can trust to be fair.\nThe NFL can take its sixth and biggest courtroom defeat as an impetus to create that kind of process. Or it can instead invite more federal intervention into the NFL, with fined and suspended players increasingly suing to overturn disciplinary rulings, to the detriment of the game.","url":"https://spectator.org/63978_victory-discipline-properly-understood/"}
