{"authors":["Steve Inskeep"],"date_download":"2018-10-23 00:47:24","date_modify":"2018-10-23 00:47:24","date_publish":"2016-04-21 00:00:00","description":"Whitesburg, Kentucky, was an area once known for coal mining but most of those jobs have dried up. Limited opportunities force many residents to leave, but some are able to find their way back.","filename":"data/vaneerConsumption/AViewFromAppalachiaLivingBelowThePovertyLine.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_04_21_475079074_a-view-from-appalachia-whitesburg-kentucky_1540255644.html","title":"A View From Appalachia: Living Below The Poverty Line","title_page":"A View From Appalachia: Living Below The Poverty Line : NPR","title_rss":"NULL","source_domain":"npr.org","text":"A View From Appalachia: Living Below The Poverty Line\nWhitesburg, Kentucky, was an area once known for coal mining but most of those jobs have dried up. Limited opportunities force many residents to leave, but some are able to find their way back.\nSTEVE INSKEEP, HOST:\nAnd I'm Steve Inskeep with the view from Appalachia, exploring how national issues look from a local level. We're in Knoxville, Tenn., where people say Appalachia, not Appalachia. We're before a live audience at Holly's Gourmets Kitchen and joined by some of our friends from NPR's Generation Listen and WUOT in Knoxville. Anybody listen to that station here?\n(APPLAUSE)\nINSKEEP: We are in a region shaped by generations of migration. Now a new wave of economic migrants is leaving and sometimes coming back, for example, Gary Bentley who met us at a coal mine where he used to work in tunnels, sometimes just 36-inches high.\nHow do you work in a tunnel that's only 3-feet high?\nGARY BENTLEY: Crawling on your hands and knees for 12 hours, it's - it can be intense.\nINSKEEP: That doesn't sound like any fun.\nBENTLEY: No, it's not fun, but when it's the only thing you know, you become accustomed to it. And you just - it's another day at work.\nINSKEEP: Dangerous work that cost his grandfather his arm. Yet, Bentley says the pay of $70,000 per year was like an addiction.\nBENTLEY: You grow up in this area, and the coal miners are the ones who were able to provide their families with things that not everybody else could have. And it's, you know, the idea that these people go to work every day knowing that they may not make it back home alive in order to provide for their families and make a better life. So there's something about that that just kind of tugs at you.\nINSKEEP: Bentley lost his job as the coal market collapsed a few years ago. Letcher County, Ky., once had thousands of coal jobs. It now has 100. Bentley had to move to the far side of his state. Because he's divorced, he had to leave his daughter.\nCan we just mention, this is a long state. You were hundreds of miles from your daughter.\nBENTLEY: Yes, I think 384 miles exactly (laughter).\nINSKEEP: Not that anybody was counting.\nBENTLEY: Yeah, no. It was a six-hour trip roughly. So it was a struggle.\nINSKEEP: Now this former coal miner lives in Lexington, Ky., and works in a Dixie Cup factory. Other people want out of Letcher County.\nWe found Shawna Gabrielle Koontz (ph) working and studying at a community college. She is 20 and a single mom.\nSHAWNA GABRIELLE KOONTZ: My baby daddy wasn't someone I thought he was, and it didn't work out. And he never comes around, so I'm doing everything on my own. I can do it. That's why I want to go into the military.\nINSKEEP: After the military, she wants to be a state trooper, but not in her home county where drug abuse is a problem.\nKOONTZ: If I be a cop here, then I'll probably arresting some of my friends (laughter), honestly. And a lot of my friends has gone downhill, and it would kind of suck if I put like one of my used-to-be-close friends in the back of a cop car. So that's why I want to go away and be a cop. It's like every day you see on the news, like, people getting busted for meth. And I don't want to be around here no more.\nINSKEEP: Migration made Appalachia what it is today. European settlers pushed into these hills seeking a better life. After World War II, many of their descendents departed for Midwestern factories. In recent years, Letcher County, Ky., has lost another 5 percent of its population. Yet, something happens to many migrants. It happened to Shawna K. Rodenburg (ph) after she went to college and got out. Something drew her back.\nSHAWNA RODENBURG: I love it here. There's nowhere else that I really feel like myself. In Letcher County, I don't feel like I have to have any kind of artifice, pretend to be something that I'm not.\nINSKEEP: She now commutes to Eastern Kentucky, driving hundreds of miles once a week to teach English at a community college.\nIn a Whitesburg, Ky., restaurant, we talked with two Letcher County natives who returned full time. Elizabeth Sanders (ph) and Brad Shepherd (ph), each made choices to try their fortunes.\nELIZABETH SANDERS: I was really clear with myself when I came back that, you know, my parents really felt like they needed to move away for certain opportunities. And I wanted to figure out for myself how I can be here and raise a family here and hopefully that'll happen.\nBRAD SHEPHERD: Growing up, you don't know what you want to do. It just doesn't seem like the place. There's no opportunity unless you wanted to work in the coal mines. So I was like, well, I'm getting out of here before there's nothing to do. But you just keep wanting to come home.\nINSKEEP: So here they are. Elizabeth Sanders works for Appalshop, a media organization. Brad Shepherd and his husband opened Heritage Kitchen, the restaurant where we sat. It's trendy with the waitress wearing black on a surprisingly vibrant Main Street. Granted, it's not always easy to do business.\nHow's the internet in Letcher County?\n(LAUGHTER)\nSHEPHERD: Laughable.\nINSKEEP: People here are laughing, too. Internet's great in Knoxville, right?\nUNIDENTIFIED CROWD: No.\nINSKEEP: No? OK. Often the credit card charges don't go through, though Shepherd still has hopes that his move will bring him profit.\nNow, Chris Green has been listening to all these voices. He studies Appalachia at Berea College in Kentucky. What do you think about when you hear those stories?\nCHRIS GREEN: All those stories resonate. They're stories of people working to make their lives happen, stories of people who love where they are and stories figuring out how to stay there as well.\nINSKEEP: Well, how much practical help are coal counties or former coal counties in many cases getting from their government?\nGREEN: Tremendous help, actually. There's something called the Shaping Our Appalachian Region which was based in between Kentucky's governor and Hal Rogers, the federal head of the...\nINSKEEP: Congressman, OK.\nGREEN: ...Yeah, Congressman. There's also the Promise Zone, which is bringing in over $200 million. This is a zone of six counties that is working with not-for-profit. It's working with private entities. It's working with funders in order to sustain the economic diversity.\nINSKEEP: Why - briefly though - do people feel otherwise? People don't feel like the government's doing anything for them.\nGREEN: I think it's because the government is not overt about it. It's because it's going to the people to make it happen. It's working with the shop owners. It's working with the people who are getting insurance. It's working with the people of the community level. It's not a top-down imposition.\nINSKEEP: Chris Green, thanks very much. We're going to continue hearing from you throughout this program. We're getting the view from Appalachia. We're before a live audience here at Holly's Gourmets Market. And the people who are with us, by the way, include a distinguished Knoxville musician, R.B. Morris. Mr. Morris, would you take us out of this segment please?\nR.B. MORRIS: (Singing) In this whole world that we got today, who knows how it goes? You may rise, but you may fall. And that's the way it rose. And him that gets will be him that gives. What you got may help. They say a rich man, he may lose his soul by saving all that wealth, but it's hell, hell on a poor boy. It's hell, hell on a poor boy.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2016/04/21/475079074/a-view-from-appalachia-whitesburg-kentucky"}
