{"authors":["Michelle Moons"],"date_download":"2018-10-30 19:32:19","date_modify":"2018-10-30 19:32:19","date_publish":"2014-12-19 13:03:03","description":"Avocado and guacamole lovers: brace yourselves. as your delectable fruit may soon be even more pricey and in short supply. thanks to rising fertilizer and |","filename":"data/vaneerConsumption/AvocadoPricestoRiseasGangWarFightsforGreenGold.json","image_url":"https://media.breitbart.com/media/2014/12/Avocado-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2014_12_19__1540927939.html","title":"Avocado Prices to Rise as Gang War Fights for 'Green Gold'","title_page":"Avocado Prices to Rise as Gang War Fights for 'Green Gold' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Avocado and guacamole lovers: brace yourselves. as your delectable fruit may soon be even more pricey and in short supply. thanks to rising fertilizer and water prices; California drought; and Mexican gangs.\nComprising “[a] $435 million industry in California,” according to Modern Farmer, avocados are a significant crop for both the state and the country.\nSome 95% of avocados grown in the United States don the branches of California trees. An estimated one third of those California avocados are grown in San Diego County. Modern Farmer notes that some southern California farmers are letting avocado fields go fallow under increasingly oppressive fertilizer and water costs–a problem compounded by “green gold” imports from other countries.\nIt takes an estimated 74 gallons of water to produce just one pound of avocados. In east San Diego County, Valley Center farmers face water costs of $1,500 per acre foot, reports the Valley Roadrunner: “They paid $500 per acre-foot 10 years ago.”\nBack in 2013, one San Diego avocado grower blamed water rate hikes for his decision to rip out 200 of his 900 trees according to local ABC affiliate 10 News. Farmer Phil Pace told the news outlet that the 900 plants had produced over $90,000 of avocados per year. But in the prior year, Pace faced an astounding $30,000 water bill to hydrate those plants. Over the course of a year and a half, Pace told 10 News, two water rate increases made the 900-tree crop unsustainable.\nWith avocados’ high demand for water, high water costs and cost competition due to foreign producers, some farmers may drop “green gold” crops altogether for more lucrative ones. YourCentralValley.com reports, “Industry experts expected prices to climb about 30%, which would be about 35 cents.”\nOther growers may even consider replacing crops with housing developments or solar farms. The Valley Roadrunner reports, “Some of the fallow avocado acreage is now slated for housing developments as the high price of water intersects with the high price of housing. Other acreage has gone from crops to solar farms, like the ones you see off Valley Center Road.”\nForeign competition also threatens U.S. prices and production.\n“In Mexico, the $1 billion avocado industry has proven to be too lucrative for drug cartels to resist, and now in some cases they control every part of the avocado operation, from production to distribution,” Modern Farmer notes. While U.S. producers face increased costs and decreased production, foreign supply may undercut sharp U.S. price increases while still raising the cost to the consumer.\nEven for foreign competitors, such as Chilean growers, the pace of production may not last, reports Modern Farmer. Like California, Chile is also facing a drought, raising costs for growers.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2014/12/19/avocado-prices-to-rise-as-gang-war-fights-for-green-gold/"}
