{"authors":["Kaitlin Reilly"],"date_download":"2018-10-31 00:11:12","date_modify":"2018-10-31 00:11:12","date_publish":"2014-08-12 20:00:04","description":"UPDATE: Our worst fears have been realized. ABC Family has cancelled Twisted. EARLIER: I wish I could say that the wait was over, but, sadly, we'll have to hold out just a little bit longer to hear whether ABC Family's Twisted has been renewed for…","filename":"data/vaneerConsumption/AwaitingATwistedSeason2RenewalIsHardWhatItFeelsLikeIn25GIFs.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/9c125ac4-db1a-46e8-93b3-2ed288b18a32.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35332-awaiting-a-twisted-season-2-renewal-is-hard-what-it-feels-like-in-25-gifs_1540944672.html","title":"Awaiting A 'Twisted' Season 2 Renewal Is Hard: What It Feels Like In 25 GIFs","title_page":"Awaiting A 'Twisted' Season 2 Renewal Is Hard: What It Feels Like In 25 GIFs","title_rss":"NULL","source_domain":"bustle.com","text":"UPDATE: Our worst fears have been realized. ABC Family has cancelled Twisted. EARLIER: I wish I could say that the wait was over, but, sadly, we'll have to hold out just a little bit longer to hear whether ABC Family's Twisted has been renewed for Season 2. According to ABC Family President Tom Ascheim's interview with TV Line, the network will announce pick-ups at the end of the summer, which means that we still have a few more weeks of agonizing to do. And it is agonizing — after all, Season 1 of the ABC Family drama concluded with a (potentially deadly) cliffhanger and the possibility of a love connection between Jo and Danny. And let's not forget the totally disturbing twist that the show dropped on us during the last minute of the finale — let's just say that the new MTV series Happyland isn't the only series to show two possible half-siblings in a liplock. (Ick.)\nNot knowing Twisted's fate is a serious struggle. For the many Twisted fans out there, know that I hear your cries and definitely empathize with your pain. Whether you ship Dacey, Janny or, hell, even Jacey, not knowing whether Twisted is returning is a pain we all struggle with. Here's a guide to anticipating the news of Twisted's possible return. (In GIFs, of course!)\nThe Season 1 finale. Tess just dropped the huge bomb. You have no idea how to react.\nUmm, wait, if Tess is Jo's mother, and also Charlie's mother... that means...\nOMG.\nJO MADE OUT WITH HER BROTHER. LIKE A LOT. THIS IS NOT A DRILL. THIS IS NOT A DRILL.\nThen, the shot rings out. Now you're concerned.\nWho got shot?!? Please not Danny please not Danny please not Danny...\n...So you head to Google to find out about Season 2.\nIt tells you nothing.\nSo you wait a week.\nAnd then another week.\nFinally, you find some news on Twisted.\nTwisted hasn't been cancelled yet!\nIt also hasn't been renewed.\nYou start to think about all of the characters you'll miss.\nNot only Rico, but mostly Rico.\nAnd what will happen to Danny and Jo?\n#JoIsTheOne, right? RIGHT?!?!?!\nWould ABC Family really do us like that?\nYou consider boycotting ABC Family until Twisted is renewed.\nExcept of course you don't, because, hello, Pretty Little Liars.\nAnd The Fosters, Switched at Birth, and the fact that there's never not a Nicholas Sparks movie on.\nYou quench your thirst for Twisted by binge-watching it on Netflix.\nAll it does is make you really emotional.\nYou start a new Netflix series instead.\nThen you learn you won't hear about Twisted's fate til the end of summer.\nARE YOU FREAKING KIDDING ME.\nBut then you think, hey, at least it's not cancelled!\n...Even if waiting is the worst.\nBut you can handle it.\nI mean, ABC Family will come around eventually.\nYou're not even worried. Right? Right.\nBecause if it does get renewed...\nYou'll be beyond happy.\nImages: Giphy; Reaction Gifs","url":"https://www.bustle.com/articles/35332-awaiting-a-twisted-season-2-renewal-is-hard-what-it-feels-like-in-25-gifs"}
