{"authors":["Dan Morain","Amita Sharma","Guest Commentary"],"date_download":"2018-10-30 22:33:59","date_modify":"2018-10-30 22:33:59","date_publish":"2018-06-28 05:22:50","description":"Nowhere is the state's homelessness crisis more evident than here, where some 2,000 people hunker down for the night on sleeping pads, cardboard or nothing.","filename":"data/vaneerConsumption/AwalkalongSkidRowinLAblockbybleakblock.json","image_url":"https://calmatters.org/wp-content/uploads/IMG_0405-1-e1530156015435.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938839.html","title":"A walk along Skid Row in L.A.-block by bleak block","title_page":"Homelessness: A walk along Skid Row in L.A.—block by bleak block","title_rss":"NULL","source_domain":"calmatters.org","text":"Anthony Ruffin knelt on one knee and spoke softly to Mr. Murphy, who was sitting on a five-gallon bucket at the edge of Los Angeles’ Skid Row, a heavy coat draped over his head and sandals on his shriveled, diseased feet.\n“He has been sitting there or laying there for more than a year,” Ruffin said as we walked on. “We don’t know where he came from. We don’t even know if his name is Mr. Murphy. We suspect he came from a psych ward or some type of jail ward. Maybe some place up north.”\nRuffin, 50, is an outreach worker for The People Concern, a social service agency that finds housing for homeless people, though he soon will go to work for the Los Angeles County Department of Mental Health.\nHe walks the streets east of the wealthy and gentrified downtown, looking for people who have decompensated to such a degree that they needed to be hospitalized. Every few months, he shows visitors what he sees each day in this place where the discarded people congregate.\nThere are 55,188 homeless people in Los Angeles County—about 40 percent of Californians without shelter, the latest Department of Housing and Urban Development census shows. California has more homeless people, by far, than any other state.\nNowhere is the crisis more evident than here. Once confined to 5th Street, Skid Row, like the city that defined sprawl, goes on block after bleak block.\nRuffin explains what he has learned: Most of its 2,000 residents sleep in tents or under tarps. Those with more status occupy the sides of streets shaded by trees. Location, location, location. The lowest caste sleep on cardboard or nothing. Some people rent tents for a few bucks a night.\nThere are no liquor stores so businessmen buy alcohol from shops a few miles away and sell it at a steep mark-up. Loan sharks collect debts by taking control of the debit cards issued to homeless people by government agencies.\nA guy sits at a table on the sidewalk selling cigarettes and joints. The city has installed sidewalk restrooms. Ruffin pointed to one and figured people inside were shooting up or smoking. Meth, heroin and crack are the scourges of choice. Needles litter the gutter, as does a dead rat. On another block, homeless entrepreneurs chop and assemble bicycles for sale.\nWe visited Hippie Kitchen run by Catholic Charities. It includes a serene courtyard landscaped with plants and benches, a respite from the other side of the fence. A volunteer washed a homeless man’s feet.\nExasperated property owners have begun painting their facades blue, a symbol so that campers won’t squat in front of their buildings. If they don’t get the message, security guards will shoo them away, shoving them to other blocks.\nRuffin checks on a woman laying on the street to see if she’s breathing, and another woman who has no hair and not many teeth, and is scratching herself. Scabies, he guesses. She said she’d like a place to live. Women are targets for predators, he said.\nCharles is in a wheelchair and his ear is bandaged. He said 12 people jumped him. His left leg is swollen and has an oozing sore. He said he has no feeling in the leg.\nHe carried his possessions in a soiled canvas bag, emblazoned with the words: “1999 GUBERNATORIAL INAUGURATION GRAY DAVIS UNITE!” Ruffin tries to persuade Charles to accept housing. He’ll think about it, so long as they don’t force him to eat pork.\nAnd there is Mr. Murphy. His feet and calves looked as if they would be excruciatingly painful. But he could talk, in a mumble, and he had been eating. He was not a danger to himself, and certainly not to anyone else—the standard established by a 1967 law to place someone on a psychiatric hold.\n“Will he be gravely disabled by next winter? Probably so,” Ruffin said.\nThe Legislature is considering bills that would increase authorities’ ability to compel people to get treatment. One would allow mental health and medical professionals to seek court orders placing into conservatorship chronically mentally ill homeless people whose physical health is failing.\nCivil libertarians contend the bill would strip people of their rights, and a Senate committee narrowed it so that it applies only to Los Angeles County, and to people deemed to have no more than six months to live.\nAfter the hearing, Dr. Jonathan Sherin, LA County’s mental health director, said the Senate amendments reflect a lack of understanding of the problem. Some people are so mentally ill they do not know they’re sick. “We can’t have people who are unable to make decisions dying in the streets,” he said.\nGov. Jerry Brown signed a budget Wednesday that sets aside $600 million for homeless services and emergency housing. A measure headed for the November ballot would earmark $2 billion to house mentally ill people.\nDemocratic Lt. Gov. Gavin Newsom, the front-runner to replace Brown, said confronting homelessness is his “Number One, Two and Three” priorities.\nRuffin has heard about some of it and hopes it will help, although his work will not be done any time soon.\n“Every homeless person I see has a parent, a sister or a brother worrying about them,” Ruffin said.\nOr a son.\nRuffin’s father walked away when he was a baby and ended up on Skid Row. Ruffin sees his dad, now 72 and living in an SRO on 5th Street.\n“He calls me son,” Ruffin said near the end of our walk. And so it became a little more clear why he walks these blocks. “I feel like it is a privilege to work here. I can help people less fortunate than I am. I am grateful.”","url":"https://calmatters.org/articles/a-walk-along-skid-row-in-los-angeles-block-by-bleak-block/"}
