{"authors":["Madhuri Sathish"],"date_download":"2018-10-31 01:41:21","date_modify":"2018-10-31 01:41:21","date_publish":"2018-09-14 19:12:15","description":"The contents of a document sent to Sen. Dianne Feinstein (D-CA) back in July have generated a lot of controversy this week in the confirmation process for Supreme Court nominee Brett Kavanaugh. According to a New Yorker report out Friday, the…","filename":"data/vaneerConsumption/AWomanClaimsBrettKavanaughTriedToAssaultHerWhenTheyWereInHighSchoolREPORT.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/61068bc1-6029-4667-86b3-a6c1e27df6da-getty-1027754774.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_a-woman-claims-brett-kavanaugh-tried-to-assault-her-when-they-were-in-high-school-report-11922843_1540950081.html","title":"A Woman Claims Brett Kavanaugh Tried To Assault Her When They Were In High School - REPORT","title_page":"A Woman Claims Brett Kavanaugh Tried To Assault Her When They Were In High School — REPORT","title_rss":"NULL","source_domain":"bustle.com","text":"The contents of a document sent to Sen. Dianne Feinstein (D-CA) back in July have generated a lot of controversy this week in the confirmation process for Supreme Court nominee Brett Kavanaugh. According to a New Yorker report out Friday, the document was a letter from a woman who accused Kavanaugh of sexual misconduct when they were both in high school. Kavanaugh has denied the allegations.\nAccording to The New Yorker's Ronan Farrow and Jane Meyer, the woman attended a high school near Kavanaugh's own Georgetown Preparatory School in Methesda, Maryland, and the alleged misconduct happened in the early 1980s. They detail that alleged incident as follows:\nIn the letter, the woman alleged that, during an encounter at a party, Kavanaugh held her down, and that he attempted to force himself on her. She claimed in the letter that Kavanaugh and a classmate of his, both of whom had been drinking, turned up music that was playing in the room to conceal the sound of her protests, and that Kavanaugh covered her mouth with his hand. She was able to free herself. Although the alleged incident took place decades ago and the three individuals involved were minors, the woman said that the memory had been a source of ongoing distress for her, and that she had sought psychological treatment as a result.\n“I categorically and unequivocally deny this allegation,\" Kavanaugh said in a statement to The New Yorker. \"I did not do this back in high school or at any time.” Bustle has reached out to the White House for comment.\nThe New York Times' Nicholas Fandos and Michael S. Schmidt reported similar details of the allegation contained in the letter on Thursday.\nIn a statement emailed to Bustle on Thursday, an FBI spokesperson indicated that the agency had received the document that reportedly contains these allegations. “Upon receipt of the information on the night of September 12, we included it as part of Judge Kavanaugh’s background file, as per the standard process,\" the spokesperson told Bustle.\nThe Senate Judiciary Committee is scheduled to vote on Kavanaugh's nomination next week, although Democrats like Sen. Cory Booker of New Jersey say Republicans are rushing the confirmation process. However, soon after The New Yorker broke the news of the allegations against Kavanaugh, Sen. Chuck Grassley (R-IA) — the committee's chairman — released a letter of support signed by 65 women who reportedly knew Kavanaugh.\n“We are women who have known Brett Kavanaugh for more than 35 years and knew him while he attended high school between 1979 and 1983,” the letter stated. “For the entire time we have known Brett Kavanaugh, he has behaved honorably and treated women with respect. We strongly believe it is important to convey this information to the Committee at this time.”\nAccording to BuzzFeed News, Grassley's office issued a statement later on Friday clarifying that \"the committee vote on Judge Kavanaugh's nomination will proceed as scheduled, next Thursday.\"\nHis office added that the \"anonymous allegations are reportedly from Judge Kavanaugh’s high school time roughly 35 years ago\" and noted that the FBI's background checks had not turned up any similar allegations since then.","url":"https://www.bustle.com/p/a-woman-claims-brett-kavanaugh-tried-to-assault-her-when-they-were-in-high-school-report-11922843"}
