{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 22:00:55","date_modify":"2018-10-30 22:00:55","date_publish":"2016-12-16 00:00:00","description":null,"filename":"data/vaneerConsumption/AXAparticipatesininsurtechs20Mround.json","image_url":"https://amp.businessinsider.com/images/585409e5a1a45e95648b535e-320-160.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_axa-participates-in-insurtechs-20m-round-2016-12_1540936855.html","title":"AXA participates in insurtech's $20M round","title_page":"    AXA participates in insurtech's $20M round - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Fintech Briefing\" subscribers. To learn more and subscribe, please click here.\nInsurtechs continue to attract attention and investment from incumbents, which One Inc., a Californian core software provider for insurers, proved this week when it raised $20 million in a Series B funding round in which two major insurers participated, according to Crowdfund Insider.\nAXA Strategic Ventures, the French insurer's VC arm, and MassMutual Ventures, the VC arm of Massachusetts Mutual Life, led the round. Existing investor H&Q Asia Pacific also participated. The latest round brings the company's total investment to $36.7 million.\nOne Inc. provides a software platform for insurers' core operations. The platform can be either cloud-based or on-prem, depending on the insurer's requirements. It offers solutions for various functions including billing, rating, payments processing, e-signature, data warehousing, and data analytics. The platform serves as an all-in-one alternative to using different software providers for different functions, allowing for more efficient back-end operations, and enabling large insurers, in particular, to keep better track of their business activity. One's clients include Hudson Insurance Group and National General Insurance Group.\nThe investment in One by leading insurers suggests the industry is realizing the urgency of transforming its core systems. Core system transformations are typically expensive, especially for insurers as large as AXA, but the status quo is no longer sufficient. This latest investment implies that legacy insurers are increasingly aware that they can no longer put off upgrading their own back-end systems and are starting to look for modern, cost-effective solutions. Banks have been engaged in core system transformation for some time, and while the insurance industry has lagged behind, this now seems to be changing.\nThe global insurance industry is worth nearly $5 trillion, and insurance companies are at risk of losing a share of this valuable market to new entrants. That's because these legacy players have been even slower to modernize than their counterparts in other financial services industries.\nThis has created an opportunity for a group of firms known as insurtechs. These startups are leveraging new technology and a better understanding of consumer expectations to increase efficiencies in the insurance industry. Some are helping incumbents deliver better end products, while others are directly competing with legacy players.\nSarah Kocianski, senior research analyst for BI Intelligence, Business Insider's premium research service, has compiled a detailed report on insurtechs that looks at the drivers behind the increasing number of insurtech companies, how they are helping or disrupting legacy players in the insurance industry, and where legacy players are innovating off their own backs.\nHere are some of the key takeaways from the report:\nThe opportunity is currently biggest in the US and Europe. That's because these regions have large, very mature insurance industries.\nInsurtechs' products and services mostly target retail customers. This includes small businesses and consumers.\nMost insurtechs are acting as enablers. This means that they offer products and services that help insurers and reinsurers improve their processes and better serve customers.\nOf the main players in the insurance industry, brokers are most at risk of disruption. This is because insurtechs can easily replicate their services and are solving historical industry problems faster than legacy players.\nLegacy players are also innovating. In particular, insurers and reinsurers are investing in insurtechs and fintechs working with relevant technologies. At the same time, they are improving their own direct-to-consumer digital interfaces, increasing their disruptive threat to brokers.","url":"https://www.businessinsider.com/axa-participates-in-insurtechs-20m-round-2016-12"}
