{"authors":[],"date_download":"2018-10-30 01:20:05","date_modify":"2018-10-30 01:20:05","date_publish":"2018-07-25 20:47:00","description":"A year after the worst data breach in U.S. history to date, Atlanta-based Equifax has been chastened, but its business model is unchanged and the company churns on, virtually undamaged by legislative, regulatory or prosecutorial penalties.","filename":"data/vaneerConsumption/AyearafterdatabreachAtlantabasedEquifaxunbowed.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/05/11/Videos/4391711.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_year-after-data-breach-equifax-unbowed__1540862405.html","title":"A year after data breach: Atlanta-based Equifax unbowed","title_page":"A year after data breach: Atlanta-based Equifax unbowed","title_rss":"NULL","source_domain":"ajc.com","text":"A year after the worst data breach in U.S. history to date, Atlanta-based Equifax has been chastened, but its business model is unchanged and the company churns on, virtually undamaged by legislative, regulatory or prosecutorial penalties.\nIt was a year ago that the company noticed the first signs of historic trouble – hackers had slipped through the Atlanta company’s cyber defenses into the heart of the company’s data.\nWorse, the intrusion had apparently been going on for some time.\nWorse than that, the information accessed was more personal information about more Americans than in virtually any previous major data breach: Information on more than 147 million Americans was accessed – although the scope of the theft was not clear at first.\nIn fact, it took until early September for the company to reveal there had been any hacking at all.\nOnce the word was out, there was a firestorm of anger and investigations which have thus far led to Congressional hearings, lawsuits against the company, charges of insider trading against two former executives and the departure of some higher ranking executives.\nEquifax did agree to a consent order with regulators from eight states, including Georgia, that required the company to report on how it is improving security and to submit to reviews of its practices.\nBut thus far, no financial punishment has been imposed on Equifax itself.\nRick Smith, Equifax’s former chief executive, retired from the company shortly after the data breach was announced, albeit with a large package. (The Atlanta Journal-Constitution)\nDespite contentious hearings, no Congressional action has been taken. A few months later, the Consumer Financial Protection Bureau tabled action against the company.\nAnd while the Federal Trade Commission said it opened an investigation into the Equifax breach in September, the agency has since named as chief of its consumer protection division a lawyer who has represented Equifax.\nThis past week, Equifax asked a federal judge to reject the claims from 46 banks and credit unions for payment of damages because of the massive data breach. The companies claimed that Equifax owes them for all the costs they incurred protecting data after the breach was revealed, costs that could easily run into many millions of dollars.\nBut the company is certainly not unchanged.\nCEO Rick Smith retired prematurely, as did several other top officials. A new CEO was named, as was a new chief information security officer, Jamil Farshchi, who told Wired magazine that the company has invested $200 million on data security infrastructure.\nMeanwhile, most consumers whose data might have been stolen do not know if that information is being used against them, and many have done little to protect themselves. There is also a sizeable group of consumers who don’t even know that the data breach happened.\nAccording to LendEDU, a New Jersey-based personal finance web site, a survey showed that about 27 percent of Americans did not know about the Equifax breach. Of the majority that do know, more than one-third of them have not checked to see if they were affected.\nThe number of complaints against Equifax more than doubled in the year since the breach, compared to the year before, according to an analysis of the Consumer Financer Protection Bureau’s data by LendEDU.\nBut overall, the public urge for punishment seems to have abated a little. After the breach was announced, the LendEDU survey found that 54 percent of respondents thought the company should be banned from the credit bureau business. That attitude is now held by 46 percent of respondents, said LendEDU.\nAfter the stock market closed Wednesday, the company reported earnings.\nEquifax had revenue of $876.9 million during the second quarter of 2018, up 2 percent from the same quarter of last year, officials said.\nNet income was $144.8 million, 12 percent lower than a year ago.\n“We delivered solid results while continuing to make strong progress on our data security, IT, and consumer transformation,” said Mark Begor, CEO, in a written statement.","url":"https://www.ajc.com/business/year-after-data-breach-equifax-unbowed/YQVeBInUBd72EJwHWruQSK/"}
