{"authors":["Kelly Mcevers","Nageeb Alomari","Supreme Court Justice Stephen Breyer"],"date_download":"2018-10-22 21:19:45","date_modify":"2018-10-22 21:19:45","date_publish":"2018-08-10 00:00:00","description":"Nageeb Alomari is an American citizen from Yemen. When the civil war started there, Alomari decided to bring his wife and daughters to the U.S. But then President Trump imposed the travel ban.","filename":"data/vaneerConsumption/AYemeniAmericanWantedToBringHisFamilyHomeThenCameTheTravelBan.json","image_url":"https://media.npr.org/assets/img/2018/08/06/7_wide-8a0e6fda733d1430c0d65602c44c9d83d883d66d.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_08_10_627306970_a-yemeni-american-wanted-to-bring-his-family-home-then-came-the-travel-ban_1540243185.html","title":"A Yemeni-American Wanted To Bring His Family Home. Then Came The Travel Ban.","title_page":"A Yemeni-American Wanted To Bring His Family Home. Then Came The Travel Ban. : NPR","title_rss":"NULL","source_domain":"npr.org","text":"A Yemeni-American Wanted To Bring His Family Home. Then Came The Travel Ban.\nEnlarge this image toggle caption Wesaam Al-Badry for NPR Wesaam Al-Badry for NPR\nNageeb Alomari has lived the Trump Administration's travel ban.\nAlomari is from Yemen, and he moved to the U.S. in the 1990s. He worked at gas stations in Alabama, then California.\nIn 2000, he married a woman in Yemen, and they eventually had three daughters. Like a lot of men from his country, Alomari lived and worked in the U.S. and sent money back to his wife and kids, who stayed in Yemen.\nIn 2010, Alomari became an American citizen.\nA year later, massive protests in Yemen led to the ouster of the country's longtime president. The country became more unstable, and in 2014, a militant group called the Houthis launched an attack and took over Yemen's capital and other parts of the country.\nAnd so began the civil war in Yemen that continues today.\nEnlarge this image toggle caption Hani Mohammed/AP Hani Mohammed/AP\nAlomari was still in the U.S., and he worried about his family, especially his oldest daughter, Shaema, back in Yemen. She has severe cerebral palsy. She can't speak or move on her own.\nShe also needs to take medicine four to five times a day to keep her muscles relaxed and to keep her from having spasms. But she was living in a war zone, where there was a shortage of medicine.\nIn 2016, there was a bombing, right near his family's house.\nEnlarge this image toggle caption Wesaam Al-Badry for NPR Wesaam Al-Badry for NPR\nSo Alomari applied for visas for his wife and daughters to come to the U.S.\n\"That's when I decided, they need to be with me,\" he said.\nPresident Trump imposes the travel ban\nAt the same time, Donald Trump was campaigning for president, and promising \"a total and complete shutdown of Muslims entering the United States.\"\nJust days after Trump's inauguration, on Jan. 27, 2017, he announced the first travel ban. Across the U.S., people converged at airports to protest the administration's ban.\nThat's when I decided, they need to be with me.\nAlomari realized his family was now a target of this ban. He was living in San Francisco, working at a gas station, and, after work one day, he went to the airport to join the protests.\n\"I was afraid for my family,\" he told us. But at the time, he still believed the U.S. would understand his situation and grant his family visas.\nNot long after the protests, the travel ban was put on hold by a federal court. Then the Trump administration announced a second, revised ban. And that, too, was put on hold.\nAlomari decided to go back to Yemen and stay with his family until the visas came through.\nEnlarge this image toggle caption Stephen Lam/Getty Images Stephen Lam/Getty Images\nA dangerous journey back in Yemen\nBut travel in Yemen was difficult. The main airport in the capital, Sanaa, was closed. The only open airport is in the city of Aden, in southern Yemen. Alomari's family lives in the city of Ibb — about 100 miles away — which means he had to cross a frontline to get home. And there were checkpoints along the way. He never knew which group controlled each one.\nEventually, he made it home. A few months later, Alomari got an email from the U.S. government saying the family needed to provide proof of vaccinations to embassy officials. But to do that, they would have to go to Djibouti, the country nearest Yemen with a U.S. embassy. The American embassy in Yemen had suspended operations in 2015, due to the war.\nPolitics Looking Back At The Timeline Of President Trump's Travel Ban Looking Back At The Timeline Of President Trump's Travel Ban Listen · 3:51 3:51\nDjibouti is across the Red Sea from Yemen, and it's about an hour flight away. So Alomari piled the family in a car to drive back to the airport in Aden.\nAgain, he crossed the frontline of a war.\nThe trip took 15 hours. And it was very difficult for Shaema, his oldest daughter, who has cerebral palsy. She couldn't sleep and cried most of the way.\nIn Djibouti, the family had to start from scratch: new apartment, new furniture, new doctors for Shaema. In all, Alomari says, it cost tens of thousands of dollars to live there. Alomari spent all his savings and borrowed the rest.\nEnlarge this image toggle caption Wesaam Al-Badry for NPR Wesaam Al-Badry for NPR\nThe family got the required medical exam, and eventually got an appointment at the embassy.\nBy this point it was late 2017. Back in the U.S., the Trump Administration announced a third version of the travel ban. And the question of the travel ban's constitutionality made it to the Supreme Court, which ruled the ban will take effect while legal challenges continued.\nBut people from the banned countries who are trying to come to the U.S. — Libya, Iran, Somalia, Syria, Yemen, North Korea, and Venezuela — could qualify for something called a waiver.\nThe waiver\nThe waiver is essentially an exception: If you can show you are not a security risk, and that you'd face \"undue hardship\" in your country, you can qualify for this waiver, and if you get it, you can come to the U.S.\nBut according to immigration lawyers, immigrants, and former officials, few people know how these waivers work. There's no form to fill out.\nThe government says if you're from a banned country, and you have already applied for a visa, like Alomari's family, you are automatically considered for a waiver. But many families have no idea a waiver is even an option.\nAlomari worked with a Yemeni-American advocate who told him about the waiver and assured him he would qualify.\nA five-minute interview that decides a family's future\nSo, in early 2018, Alomari and his family put on their best clothes and went to the U.S. embassy in Djibouti. Alomari carried Shaema in his arms.\nAlomari watched as two families and one older woman in front of him left their interviews, saying they were rejected. But Alomari was still confident.\nHe walked into the interview room, and the consular officer first looked at the application of the youngest daughter, Lemya. She's five, and she was born after Alomari became a citizen. The consular officer said she's fine; she's a citizen.\nThen he looked at the other applications — Shaima, 10, Selma, 7, and Asma, their mother — and, according to Alomari, said, \"All of you are rejected. We are under a ban.\"\nAnd then, Alomari said, the consular officer added in Arabic: \"It's a presidential decision.\"\nThe interview took five minutes.\nThe children were crying. Alomari was devastated.\nAlomari's story reaches the Supreme Court\nNageeb Alomari is featured in a documentary by Al Jazeera English. Al Jazeera YouTube\nThe family went back to their apartment in Djibouti, and Alomari tried to figure out what to do next.\nEventually, Alomari did two things:\nA friend put him in touch with a group of lawyers who represent Muslim Americans, and Alomari told them his story. The lawyers added his story to an amicus brief they filed in the Supreme Court case, Trump v. Hawaii, that would determine whether or not the travel ban would stand.\nAnd Alomari also talked to reporters at Al Jazeera and CNN.\nOn April 25, 2018, the Supreme Court heard oral arguments in Trump v. Hawaii. Shaema, Alomari's daughter, was mentioned by the lawyer for the state of Hawaii, Neal Katyal.\n\"A 10-year-old with cerebral palsy who wants to come to the United States to save her life and she can't move or talk,\" said Katyal. \"The 10-year-old was denied a waiver.\"\nThen the government's lawyer, Solicitor General Noel Francisco, was asked about Shaema's case.\n\"How do you deal with the example that was brought up of the child with cerebral palsy?\" Justice Ruth Bader Ginsburg asked.\n\"Your Honor, the waiver is built to address those issues,\" said Francisco. \"I am not familiar enough with the details of that case to tell you what happened in that particular case. But that's what the waiver provision...is intended to address.\"\nEnlarge this image toggle caption Jacquelyn Martin/AP Jacquelyn Martin/AP\nThe Alomari family gets word from the Embassy\nTwo days later, Alomari read an email from the same consular officer who conducted his interview at the embassy in Djibouti. In the email, the officer said the family had actually been approved for a waiver, but their case was still in \"administrative processing.\"\nThis email was actually sent on April 24 — the day before oral arguments in the Supreme Court. Alomari didn't read the email until April 27.\nThe email should have been good news for Alomari. But he didn't believe it. He said he thought the government was trying to save face. And he gave up hope.\nThough this is but one incident and the child was admitted after considerable international attention in this case, it provides yet more reason to believe that waivers are not being processed in an ordinary way.\n\"The doors all closed,\" he told us.\nAbout a month later, though, on May 17, 2018, the family got a phone call from the embassy. An interpreter told them their medical records would expire on May 29, so they need to arrive in the U.S. before May 29.\nThe interpreter wasn't saying it out loud, but the family was about to be granted their visas.\nOn May 26, 2018, the Alomari family landed at JFK and were greeted by applause, balloons, and American flags.\nCriticism of the waiver program\nOne month later, the Supreme Court upheld the travel ban in the Trump v. Hawaii case.\nIn a dissenting opinion written by Justice Stephen Breyer, Shaema Alomari was mentioned.\nHe wrote that it appeared Shaema got the waiver because of \"international attention\" to her case, which is \"more reason to believe that waivers are not being processed in an ordinary way.\"\nEnlarge this image toggle caption Wesaam Al-Badry for NPR Wesaam Al-Badry for NPR\nHe also pointed out that, even though the administration said it would provide guidance on how to get these waivers, there still was no guidance. The State Department says \"there is no separate application for the waiver,\" and that decisions are made \"on a case-by-case basis,\" wrote Breyer.\nMeanwhile, many people in banned countries still don't even know there is a waiver.\nThe State Department says, as of now, more than 1,200 people have been \"cleared\" for a waiver. But it's not clear if they have actually obtained the waivers. The State Department declined to provide current figures for the total number of visa applications, though the Department has previously disclosed there have been more than 30,000 applications from banned countries, and that number has certainly increased.\n\"We should put all 30,000 names in an amicus brief, and maybe then everybody will then get a waiver,\" said Chris Richardson, a former consular officer, who recently resigned.\nHe said the Alomari case is the exception, not the rule.\nAs for the family, they are now living in California. Shaema is stable. Her mother recently got a green card.\nNPR producers Chris Benderev, Noor Wazwaz and Tom Dreisbach contributed reporting to this story.","url":"https://www.npr.org/2018/08/10/627306970/a-yemeni-american-wanted-to-bring-his-family-home-then-came-the-travel-ban"}
