{"authors":[],"date_download":"2018-10-30 20:52:15","date_modify":"2018-10-30 20:52:15","date_publish":"2018-07-22 22:26:00","description":"Atlanta native Christian Broder has died; suspect expected to be charged with murder","filename":"data/vaneerConsumption/Ayouthssecondchanceanotherfamilystragedy.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/23/Images/Jayden-Myrick%20cropped_20180723141359.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_youth-second-chance-another-family-tragedy__1540932735.html","title":"A youth’s second chance, another family’s tragedy","title_page":"Teen was given second chance before charges in Atlanta shooting","title_rss":"NULL","source_domain":"ajc.com","text":"Fulton County Superior Court Judge Doris Downs decided last year to give Jayden Myrick — the teen accused of shooting a man this month as he left a wedding reception — a chance to turn his life around.\nMyrick had been arrested at the age of 14 for his role in an armed robbery and agreed to a negotiated plea of 15 years, to serve seven years in adult prison, according to the Fulton County District Attorney’s Office.\nBut after two-and-a-half years in juvenile detention, the judge gave him a break. She put Myrick on probation and placed him in a special program whose director confidently claimed her program could keep tabs on Myrick and reform him, just as it had many other violent youths, according to a transcript of the hearing.\n“I don’t want anybody else to be held at gunpoint by this man,” the judge said in court when a prosecutor objected to her plan, according to the transcript. “I want to end it. You’re interested in punishment. I’m interested in rehabilitation and community safety for the future, because he is going to get out, and I want him to be a positive influence in the community.”\nNow 17, Myrick is accused of shooting Christian Broder, 34, a restaurant manager from Washington, D.C., who was waiting for an Uber ride as he left a wedding reception earlier this month at Atlanta’s Capital City Country Club. Broder, an Atlanta native, died Friday as a result of the wounds he suffered in the shooting. He is survived by his wife and a 9-month-old daughter.\nChristian Broder, an Atlanta native, was slain as he left a wedding reception. Broder, who worked as a Washington, D.C. area restaurant manager, is survived by his wife and an infant daughter. (The Atlanta Journal-Constitution)\nBroder was a graduate of Woodward Academy and the College of Charleston, according to his LinkedIn profile. He was the general manager of Millie’s Spring Valley, a California Baja-style restaurant, and several others.\nMyrick has now been charged with felony murder, according to the Atlanta Police Department. He was originally charged with three counts of aggravated assault, one count of aggravated battery and one count of possession of a firearm during the commission of a felony.\nThe Fulton County District Attorney’s Office objected when Myrick asked to be released from his sentence before he turned 17 and would be sent from juvenile detention to adult prison. The DA’s office said Myrick had 32 misconduct violations while in juvenile detention, and that his behavior was still unpredictable.\nBut Downs insisted that the probation program, called Visions Unlimited, was the best option. She told Myrick, “I am expecting you to become a changed person” through the program, according to the transcript.\nDowns declined to comment. Myrick’s public defender could not be reached.\nThe DA’s office said Sunday that there were soon signs that Myrick was not on the right path. Just 20 days after the hearing, the DA’s office asked that Myrick’s probation be revoked based on Instagram posts showing him with guns, known gang members and a posted video showing him holding a baggie of pills for sale.\nDowns revoked Myrick’s probation, and he was to remain in jail until February. The DA’s office said he was released on Feb. 21 and was supposed to go back into the Visions Unlimited program but apparently did not report there. The DA’s office said it found more posts on Instagram showing that Myrick was violating his probation and reported that to the judge, but that no action was taken.\nDowns required Myrick in 2017 to avoid gun and drugs and anyone with a gun and she said during the hearing in August 2017 that she understood the prosecutor’s request for more punishment.\n“I think he has been in prison now for two and a half years and I don’t think it helped him much,” the judge said, according to the transcript. “I haven’t noticed a whole lot a change, and I am hoping the change will occur with this opportunity.”\nGwen Sands, the director of Visions Unlimited, told the judge that Myrick would be “very appropriate for our services.” For a minimum of two years, she said, Myrick would be placed in a”very, very structured” plan that would include education, career readiness, and life skills to get away from criminal thinking. The program includes gang intervention and family support, Sands told the judge.\nAccording to the transcript, Sands told the judge that her program is “just like going to school, really like going to a military school with lots of love and respect but the focus is very, very structured, the services are very structured.”\nSands could not be reached for comment.\nAtlanta Police said that Broder was leaving the wedding reception July 8 along with three others and was waiting for an Uber when a car pulled up. Police say Myrick got out with a gun and demanded their possessions. When Broder approached to negotiate, police said, Myrick shot him in the stomach.","url":"https://www.ajc.com/news/youth-second-chance-another-family-tragedy/E1jgzjHXPceQz6OdWlVEjN/"}
