{"authors":["Julie Cart","Dan Morain"],"date_download":"2018-10-31 00:04:19","date_modify":"2018-10-31 00:04:19","date_publish":"2016-04-30 08:00:00","description":"Regulators say the state building code will be the key to achieving the goal, at least in the short term.","filename":"data/vaneerConsumption/AzeronetenergyvisionforCaliforniahomesdoesntmeangoingoffthegrid.json","image_url":"https://calmatters.org/wp-content/uploads/CM_energy_0064.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944259.html","title":"A 'zero net energy' vision for California homes doesn’t mean going off the grid","title_page":"A 'zero net energy' vision for California homes doesn’t mean going off the grid | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Eight years ago, when California regulators decided that by 2020 every newly built home should produce as much power as it used, the idea was novel enough to be nearly unimaginable.\nEven in a state where energy-saving construction was already the norm, there was only a handful of such super-efficient dwellings, owned mostly by wealthy early adopters.\nToday, a Golden State dotted with futuristic homes is in sight, the notion of thousands of new residences running tiny rooftop solar-power plants no longer far-fetched.\nNo law decrees a “zero net energy” landscape, although the state building code may require solar panels for new residential construction—not existing homes—by 2020. And no one is suggesting that Californians who buy brand-new houses in four years will be going off the grid or answering to energy inspectors.\nRather, their homes will be designed to use power so efficiently that they’ll get most of what they need from their own solar production or from renewable sources set up for neighborhood use.\n“You are pretty much there if you add solar panels,” said Dave Ashuckian, manager of efficiency programs for the California Energy Commission, one of the regulatory agencies that created the policy.\nAdditional measures, such as use of electricity in off-peak hours, will help. Homeowners may even receive credit for sending energy to the state grid when it’s most needed.\nThe Energy Commission and the California Public Utilities Commission are still deciding the best way to implement the “zero” energy vision, as the state moves to reduce the use of fossil fuels for a less carbon-choked California.\nA new law took effect this year to dramatically increase Californians’ use of renewable sources, such as sun and wind, and the energy-efficiency of its millions of office and residential buildings, to slash power consumption in half within the next 14 years.\nThe law is not clear on exactly how this should be done. Regulators who are working out the details say the building code will be the key mechanism, at least in the short term.\nIn the meantime, new energy-neutral homes will help. And Gov. Jerry Brown has decreed that new and remodeled state-owned buildings meet that standard beginning in 2025.\nCalifornia’s building code is already the strictest in the nation, requiring relatively high efficiency in newly built or significantly renovated homes and commercial structures. It is likely that a requirement for solar-energy production will be added for new builds in 2020, according to Ashuckian.\nSan Francisco is ahead of the game; the city will require solar panels on new low-rise commercial and residential buildings beginning in January.\nIn areas where rooftop power is not feasible because of climate or a home’s design, an array of solar panels could be installed in a parking lot or other open space to supply a small community.\nIt was Dian M. Grueneich, a member of the Public Utilities Commission, who introduced the energy-neutral-home idea in 2007, a year after the state passed a landmark law to combat climate change. The agency formalized her standard in 2008.\nAt that time, the concept of such a commercially ready home was on a far horizon—technologically achievable, but barely. Grueneich said then that it takes a “big, bold goal” to prompt innovation.\nIndeed, said Barry Hooper, a San Francisco environmental official who has advised the state, the audaciousness of the standard was “a throwdown” that by itself created momentum. He calls the target “one of the best things to come out of the CPUC.”\nNow, the plummeting cost of solar energy and California’s new efficiency law will combine to carry the state “dang close” to its goal, said Mindy Craig, an energy-policy specialist who is consulting with officials on a plan to get all the way there. But it’s complicated.\nNew requirements must not cause homeowners undue financial hardship, officials say. And climate regions vary, as do home designs, defying straightforward, across-the-board calculations.\nCraig said she’s been working to come up with a “solar-ready” concept, much as the city of Santa Monica already requires, in which builders leave space on the roofs of new homes so panels can be installed later.\nAnd California has 16 designated climate zones, some where solar power is consistent and some that are sun-deprived for months each year.\nRequiring solar energy production by every new home “will not be cost effective in every climate zone,” said the energy commission’s Ashuckian. “That will create a cost premium of thousands of dollars. We don’t want that to happen.”\nA possible solution is zone-by-zone requirements, he said. And “it’s very likely we’ll say there are certain building types where it’s not cost effective.”\nAshuckian said officials were still studying what a new zero-energy home would cost—a calculation subject to a wide array of estimates and little agreement. He said a luxury model might be 10-20 percent more expensive than a similar but non-efficient home, but owners would save significantly on utility bills.\nJoe Emerson, founder of ZeroHomes.org, a Bend, Ore., information clearinghouse, pegged the difference at 5 percent, after tax deductions and other incentives, such as rebates, are factored in.\n“In the beginning, these homes were built for rich people who said, ‘I want one.’ They were expensive. Now, all the techniques and technology we use are off the shelf,” which has lowered building costs.\nHe agreed that an efficient home would ultimately save its owner money. In addition, he said, “it’s a more comfortable, better-made home.”\nUpdate: The state Energy Commission in 2018 ruled that most new homes built as of 2020 must have solar panels, unless the roof cannot accommodate them.","url":"https://calmatters.org/articles/a-zero-energy-vision-for-california-homes-but-that-doesnt-mean-going-off-the-grid/"}
