{"authors":["Kenneth R. Harney","The Real Deal"],"date_download":"2018-10-30 23:05:25","date_modify":"2018-10-30 23:05:25","date_publish":"2018-07-23 00:00:00","description":"Baby boomers own two of every five homes in the country. Home demand from younger generations might not be enough to fill the void left by departing older owners, potentially causing gluts in some local markets.","filename":"data/vaneerConsumption/Babyboomerscouldspurahousingbust.json","image_url":"https://amp.businessinsider.com/images/5b561c961dcdd529008b4602-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_baby-boomers-could-spur-a-housing-bust-2018-7_1540940725.html","title":"Baby boomers could spur a housing bust","title_page":"    Baby boomers could spur a housing bust - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"REUTERS/Mike Blake\nWill baby boomers turn into party poopers when they unload their homes in large numbers starting in the next decade? Could they create an indigestible oversupply in the market that lowers home prices and frustrates sales?\nThat's a sobering scenario outlined by two new, provocative studies. One, from Fannie Mae's Economic and Strategic Research group, warns that the \"beginning of a mass exodus looms on the horizon,\" where \"homeownership demand from younger generations is insufficient to fill the void left by multitudes of departing older owners.\" The net result: gluts in some local markets with potentially negative impacts.\nA second study, from the Stephen S. Fuller Institute at George Mason University, focuses on the Washington D.C. market and sees a similar problem ahead. \"The significant number of older owners in relatively large homes may portend a 'baby boomer sell-off'\" in the D.C. region and elsewhere in the U.S., it reports. Some long-time owners \"may have difficulty attaining the price gains they witnessed in their neighborhoods during recent years,\" according to author Jeannette Chapman, the Fuller Institute's deputy director.\nBoth studies cite demographic and housing data to make their cases. Boomers — the giant generation of Americans born between 1946 and 1964 — own 32 million homes, two of every five in the country. The generations preceding them occupy another 14 million homes. Collectively their properties are valued around $13.5 trillion, according to the Fannie Mae study, co-authored by Patrick Simmons of the strategic research group and Dowell Myers, a professor at the University of Southern California.\nAll of these homeowners face key choices: Do we stay put, sell, downsize or move to a rental? At some point, the inevitable kicks in: health issues and death will force them to dispose of their properties.\nFannie's study estimates that from 2016 to 2026, between 10.5 million and 11.9 million older owners will end their ownership status. Between 2026 and 2036, another 13.1 million to 14.6 million will do the same.\nThis massive and unprecedented generational unloading of houses could be \"negative for the home sales market,\" the Fannie study warns, because the upcoming generations of buyers may not have the financial capacity — or desire — to absorb the large numbers of homes coming to market. How much of a price hit to boomers' and potentially other owners' properties could occur can't be predicted at this point, co-author Myers told me in an interview.\n\"It's impossible\" to forecast price impacts \"10 years ahead,\" he said. \"We do not mean to be alarmists,\" he added, but hope to spur discussion of the impending challenges and the need for public and private policies that might cushion the impacts. Among the possibilities: Create additional financing programs that encourage Millennials and others to purchase first-time homes, so that they have the equity needed to purchase boomers' homes 10 to 20 years from now.\nIn the Fuller Institute study, author Chapman notes that there's already a mismatch in many Washington D.C. area neighborhoods, where empty nest seniors own homes with far more space than they need. More than 273,000 homes are owned by individuals 50 years and older that have at least two more bedrooms than the number of people living in the house. \"As these owners downsize or move elsewhere … \" Chapman says, \"the potential for increased supply is large enough to moderate price gains.\"\nArthur C. Nelson, a professor of planning and real estate development at the University of Arizona, says some local markets with large oversupplies of boomer homes for sale could encounter significant price declines. In an email, Nelson, who has written about the coming challenges with boomers' homes for several years, suggested that in the worst-hit areas, price declines could be as crushing as \"a quarter or a third or more\" — essentially the next housing crash.\nNot everybody agrees. Lawrence Yun, chief economist for the National Association of Realtors, says such dark forecasts ignore positive developments well underway — strong U.S. population growth, the rising importance of foreign born buyers who will help sop up the oversupply of large houses in metropolitan suburbs, and the \"glacial\" speed at which the oversupply is likely to manifest itself.\nYun is emphatic: There should be \"no measurable price declines\" attributable to the boomers.\nWhat's this all mean for you? At the very least, be aware of the issue. And think about devising a strategy for dealing with whatever scenario sounds most realistic to you, whether you're an owner or future buyer.","url":"https://www.businessinsider.com/baby-boomers-could-spur-a-housing-bust-2018-7"}
