{"authors":[],"date_download":"2018-10-30 20:19:40","date_modify":"2018-10-30 20:19:40","date_publish":"2015-02-14 02:05:59","description":"A bald eagle clambered out its shell at Berry College on Friday to an entire fan club on Facebook. Now the question is whether the sibling B5 will emerge soon from egg two.","filename":"data/vaneerConsumption/BabyBerryCollegeeaglebirthcaughtoncamerain247world.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_baby-berry-college-eagle-birth-caught-camera-world__1540930780.html","title":"Baby Berry College eagle birth caught on camera in 24-7 world","title_page":"Baby Berry College eagle birth caught on camera in 24-7 world","title_rss":"NULL","source_domain":"ajc.com","text":"A bald eagle clambered out its shell at Berry College on Friday to an entire fan club on Facebook.\nNow the question is whether the sibling B5 will emerge soon from egg two.\n“B4 has successfully hatched and we have gotten our first glimpses of the new eaglet,” read the post at 4:30 p.m. Friday on the Berry College Eagle Update Page. “We will be watching the other egg over the next few days to see if it will be viable. Have a great weekend, friends!”\nA nesting pair created a stir more than 30 days ago when it was discovered they were caring for two eggs on the Rome campus. Assuming B5 hatches, it will be the fifth offspring of the eagle pair who have called the nest in a tall pine on the 27,000-acre campus home since 2012.\nTheir parenting movements are recorded on the “Eagle Cam,” which violates every norm of privacy but makes them incredibly popular, with the birth getting nearly 1,600 “likes” on the eagles’ own Facebook page — a number likely to increase.\nMore than 84,000 followers get updates and more than 89,000 “like” the page.","url":"https://www.ajc.com/news/baby-berry-college-eagle-birth-caught-camera-world/AmUOESKh2QfWRQSTqHIxpK/"}
