{"authors":[],"date_download":"2018-10-22 21:19:01","date_modify":"2018-10-22 21:19:01","date_publish":"2017-04-26 01:31:24","description":"Newborn humpback whales and their mothers whisper to each other to escape potential predators, scientists reported Wednesday, revealing the existence of a...","filename":"data/vaneerConsumption/Babywhaleswhispertomotherstoavoidpredatorsstudy.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/01/wire-462503-1493166686-161_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4446006_Baby-whales-whisper-mothers-avoid-predators-study_1540243141.html","title":"Baby whales 'whisper' to mothers to avoid predators: study","title_page":"Baby whales 'whisper' to mothers to avoid predators: study | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Scientists believe that humpback whale mothers and calves communicate by \"whisper\" to avoid predators\nNewborn humpback whales and their mothers whisper to each other to escape potential predators, scientists reported Wednesday, revealing the existence of a previously unknown survival technique.\n\"They don't want any unwanted listeners,\" researcher Simone Videsen, lead author of a study published in Functional Ecology, told AFP.\n\"Potential predators such as killer whales could listen to their conversations and use that as a cue to locate the calf and predate on it.\"\nWhales are known for their loud calls, congregating fellow members of the pod. Male humpback whales also emit reverberating sounds to attract females during the mating season.\nBut this is the first time scientists have observed a unique, intimate form of communication between humpback mothers and calves.\nWhales are known for their loud calls, congregating fellow members of the pod while male humpback whales also emit reverberating sounds to attract females\nResearchers from Denmark and Australia tracked each of eight calves and two mothers for 24 hours in Exmouth Gulf, Western Australia, a breeding ground for Antarctic humpback whales seeking warmer waters to mate and give birth.\nUsing tags attached to the animals, the team of scientists recorded their faint squeaks and grunts.\n\"These signals between mother and calf are more quiet than those of normal adult humpback whales,\" Videsen said, noting they were 40 dB lower than the singing of males in the area.\nWhile a male's cry can resound over an area covering several kilometres, the pairs in the study could only hear each others' calls within a distance of less than 100 metres (330 feet), she added.\nThe low sounds were detected when the pairs were swimming, suggesting the discreet tone helps the mammals stay together in the murky breeding waters, infested with killer whales preying on stray calves.\n- Marine noise pollution -\nThe faint sounds are also a way to keep mate-seeking males from interfering in the humpback's nurturing, a crucial time in the newborn's life as it braces for an arduous 8,000-kilometre (5,000 mile) journey back home to the Antarctic, the researchers speculated.\nAnd the migration is no less challenging for the mother.\n\"There is no food for them in the breeding grounds so the mothers feast while they are there,\" Videsen said.\nThe researchers also believe that mother and calf -- in their effort to go undetected -- may have developed a silent method to initiate suckling.\nInstead of signalling hunger vocally and risk getting spotted, the calves \"rub against their mothers,\" according to the study's findings.\nHumpback whales can be found both in the Arctic and Antarctic. Each pod spends the summer at the poles and travels to tropical areas in their respective hemispheres during the winter to breed.\nThe scientific investigation also shed light on the growing problem of ocean noise pollution that can severely disrupt marine life.\n\"Because mother and calf communicate in whispers, shipping noise could easily mask these quiet calls,\" Videsen said, potentially provoking the pair to lose each other.","url":"https://www.dailymail.co.uk/wires/afp/article-4446006/Baby-whales-whisper-mothers-avoid-predators-study.html"}
