{"authors":["Peter Devlin For Daily Mail Australia"],"date_download":"2018-10-22 23:20:15","date_modify":"2018-10-22 23:20:15","date_publish":"2017-03-10 02:37:45","description":"An 11-month-old baby boy was found floating face down with blue lips in the bath after his mother, 20 left him there while she went outside to clean her car in Queensland.","filename":"data/vaneerConsumption/BabyfoundfloatingfacedowninbathinQueensland.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/01/3E1F45DE00000578-0-image-a-6_1489110479602.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299714_Baby-floating-face-bath-Queensland_1540250415.html","title":"Baby found floating face down in bath in Queensland","title_page":"Baby found floating face down in bath in Queensland | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An 11-month-old baby boy was found floating face down with blue lips in the bath after his young mother left him there while she went outside to clean her car.\nOn Thursday the pregnant mother, 20, pleaded guilty in Townsville District Court to endangering a child by exposure, the Townsville Bulletin reported.\nThe Queensland mother of three put her eldest child and the 11-month-old baby boy in the bath on October 13, 2015, the court heard. She put the plug in and turned the water on before leaving to clean her car.\nAn 11-month old baby boy was found floating face down with blue lips in the bath after his young mother left him there while she went outside to clean her car\nThe woman's father was at home, but she did not ask him to watch the children in the bath, Crown prosecutor Jodie Crane told the court.\n'The bath was overflowing, the lower bath tap was on hard, the (younger) child was face down in the water and the older child was standing frightened in the corner of the bathroom,' she said.\nThe baby was found unconscious with blue lips by his grandfather who went to investigate after seeing water overflowing from the bathroom.\nAn ambulance was called and when paramedics arrived they discovered water in his airways.\nThe baby suffered seizures while in hospital but was discharged after three days.\nA follow up examination did not show any permanent damage, Ms Crane told the court.\nOn Thursday the pregnant mother, 20, pleaded guilty in Townsville District Court to endangering a child by exposure\nDefence barrister Edward Bassett said the woman had been in contact with the Department of Child Safety and completed a Centacare parenting course.\nJudge Michael Shanahan said the mother was young and made an early guilty plea.\nNo conviction was recorded and she was placed on 12 months probation.","url":"https://www.dailymail.co.uk/news/article-4299714/Baby-floating-face-bath-Queensland.html"}
