{"authors":["Corey Charlton For Mailonline"],"date_download":"2018-10-23 01:24:47","date_modify":"2018-10-23 01:24:47","date_publish":"2016-01-28 15:39:23","description":"With heads resting against one another's chests while being blitzed by snow and ice, these adorable baby penguins take drastic measures to survive a blizzard in Antarctica.","filename":"data/vaneerConsumption/BabypenguinsinAntarcticacuddleuptogethertosurviveicy24Cblizzard.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB38D500000578-0-image-a-35_1453995534501.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421186_Don-t-cold-shoulder-Baby-penguins-Antarctica-cuddle-adorable-attempt-survive-icy-24C-blizzard_1540257887.html","title":"Baby penguins in Antarctica cuddle up together to survive icy -24C blizzard","title_page":"Baby penguins in Antarctica cuddle up together to survive icy -24C blizzard | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"With heads resting against one another's chests while being blitzed by snow and ice, these adorable baby penguins take drastic measures to survive an Arctic blizzard.\nStanding behind the adults, the small colony of emperor penguins are covered in ice as they attempt to seek shelter from the storm.\nFood engineer Gunther Riehle, 53, from Kirchheim unter Teck, Baden Wuerttemberg, Germany, braved the cold in Antarctica to capture the moment.\nHe said: 'The penguins are huddling together to give them shelter and warmth, the adults do this too in Antarctic winter. Scientists measured the interior temperature of an adult huddle and found 37 degrees Celsius.\n'Normally one parent stays close to the group of youngsters while the other parent is fishing. During sunny and open skies the temperature was around minus 24 degrees Celsius. The younger emperor penguins in the photographs are three months old.\n'In the area where we camped there were two colonies, one small one with a few hundred birds and a big one with a few thousand birds. The colonies were about 1 km apart. All colonies consisted of adults and chicks and there was regular traffic between the colonies of both adults and chicks.'\nHe added: 'The colonies would huddle together for hours, during the night and during the snow storms, until the next feeding cycle by parents. When the snowstorms reached 50 knots, the penguin colonies came closer together to give shelter for the birds in the middle and the birds even laid down to have less exposure to the wind.\n'We flew in on a good day with a twin otter and set camp. And stayed there for a week. Thus we were able to go out and photograph in rather bad weather conditions.'\nFour young emperor penguins, all aged about three months old, huddle together as they battle a -24C storm in Antarctica\nThe baby penguins were part of a larger colony that was spending the winter hunkered down on the ice\nA baby emperor penguin, which can grow to more than a 4ft in height, peers at the camera as his friends take shelter from the blizzard\nThe five penguins were gathered together behind a larger adult to reduce their exposure to the elements\nPhotographer Gunther Riehle, 53, spent a week on the ice in Antarctica photographing the colony of penguins\nAdult emperor penguins, such as these pictured, can grow to four feet in height and will protect and cuddle the babies during winter\nMr Riehle said one of the adults will remain to protect the group of youngsters while the other leaves to fetch food\nMimicking the actions of their elders, a group 10 penguins huddle together. By rotating the position in the centre of the circle, they are able to all stay warm","url":"https://www.dailymail.co.uk/news/article-3421186/Don-t-cold-shoulder-Baby-penguins-Antarctica-cuddle-adorable-attempt-survive-icy-24C-blizzard.html"}
