{"authors":["Unity Blott For Mailonline"],"date_download":"2018-10-23 00:19:37","date_modify":"2018-10-23 00:19:37","date_publish":"2016-01-28 14:08:55","description":"Jonah Jones, from Fairmont, Virginia, appears to say, 'Oh no!' after sneezing. The video, posted by dad Gabriel Jones, has been viewed millions of times on social media.","filename":"data/vaneerConsumption/BabyJonahJonesappearstoSPEAKwhenhesneezesincutevideo.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A999A900000578-0-image-a-2_1453979022994.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3420652_Oh-no-Four-month-old-baby-appears-SPEAK_1540253977.html","title":"Baby Jonah Jones appears to SPEAK when he sneezes in cute video","title_page":"Baby Jonah Jones appears to SPEAK when he sneezes in cute video | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A proud parent has captured the moment a four-month-old baby appears to defy science by saying, 'Oh no!' after sneezing.\nNewborns generally start forming words between 12 and 17 months but little Judah Jones seems to have disproved that theory in the space of just 10 seconds.\nIn the adorable clip posted to YouTube, Jonah, from Fairmont, West Virginia, is seen being cradled in the arms of a woman - thought to be his mother, Carly - before taking a deep breath and sneezing loudly.\nFour-month-old Jonah Jones, from Fairmont, Virginia, appears to exclaim, 'Oh no!' after sneezing. The video, posted online by proud dad Gabriel Jones, has since been viewed millions of times on social media\nThe onesie-clad baby then appears to say: 'Oh no!' as his mum Carly, laughs: 'That was so cute.'\nThe heartwarming clip was posted to YouTube by his dad Gabriel Jones with the caption: 'Our cute baby says \"oh no\" after sneezing. It's hard not to love this!'\nIt quickly notched up over 90,000 views on YouTube before being shared more than 4.6 million times on Facebook.\nMum Carly, who appeared to be overwhelmed by the reaction, later shared the video on her Facebook page, writing: 'Oh my goodness. My baby is famous.'\nFriend Marcy Stewart commented: 'I watched this via someone else's Facebook and thought, \"wow, that baby looks like Carly's baby.\" Too funny!!!' while Kelsey Joy wrote: 'Omg! We watch this at least every hour!'\nBaby Jonah Jones takes a deep breath, left, before taking a sneeze and appears to say \"Oh no,\" right\nJonah, pictured with mum Carly, left, and dad Gabriel, centre, has now become an internet sensation\nFour-month-old Jonah Jones appeared to say, 'Oh no!' after sneezing. He will now be around seven months\nMerisier Caleb wrote: '4M views!! I just played it about 5 times in a row because it was really adorable!!! Such a gentleman huh!!!' while Kaylee Kirkpatrick added: 'Oh my gosh, he really is!!! This is AWESOME!!!'","url":"https://www.dailymail.co.uk/femail/article-3420652/Oh-no-Four-month-old-baby-appears-SPEAK.html"}
