{"authors":["Amanda Williams For Mailonline"],"date_download":"2018-10-23 01:00:37","date_modify":"2018-10-23 01:00:37","date_publish":"2016-01-11 11:20:34","description":"Emma Louise Evans, 35, wept in the dock at Burnley Crown Court as she was sentenced for her wedding to a Nigerian national in July 2012.","filename":"data/vaneerConsumption/BabysitterwhomarriedNigerianimmigrantinshammarriagejailed.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/3007715B00000578-0-image-a-11_1452511035947.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393663_Babysitter-married-Nigerian-immigrant-sham-marriage-jailed-six-months-judge-says-crime-struck-heart-immigration-system_1540256437.html","title":"Babysitter who married Nigerian immigrant in sham marriage jailed","title_page":"Babysitter who married Nigerian immigrant in sham marriage jailed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She admitted taking part in the sham marriage in July 2012 but denied her second marriage the following January was also a sham\nEmma Louise Evans, 35, wept in the dock at Burnley Crown Court as she was sentenced for her false wedding with Nigerian Kazeem Kolade\nA babysitter who married a Nigerian immigrant in a sham ceremony has been jailed for six months.\nEmma Louise Evans, 35, wept in the dock at Burnley Crown Court as she was sentenced for her false wedding with Nigerian Kazeem Kolade at Blackburn Register Office in 2012.\nShe was jailed for six months by a judge who told her the crime 'struck at the heart of the immigration system'.\nKolade has since disappeared and the 'authorities have not yet caught up with him' the court heard.\nJudge Jonathan Gibson jailed Evans, who had no previous convictions, and said: 'Offences of this kind strike at the heart of the immigration system and the message must go out to all those thinking of engaging in this kind of behaviour that the punishment will severe.'\nEvans, a babysitter, of Burnley, Lancashire, had never denied taking part in the sham marriage to Kolade, Burnley Crown Court heard.\nBut she was able to convince prosecutors she did then not go on to bigamously marry a second man, Stephen Akinseye, who she remains married to, the following January.\nDefence counsel Mark Stuart was able to produce a divorce certificate, after making inquiries with the Nigerian High Commission, to prove that the first 'wedding' had been annulled.\nThe former Accrington and Rossendale College and Fearns High student, who has also lived in Blackburn and Bacup, had denied bigamy, and also a third charge of taking part in a second sham marriage with Mr Akinseye at Burnley.\nProsecutors said the pleas were acceptable to the Crown, after legal discussions had taken place with Mr Stuart, and further consideration of the evidence in the case.\nThe court heard how Evans been introduced to Mr Kolade, who had first come into the UK on a student visa in 2010, via a man named 'Patrick' on Facebook.\nEvans, a babysitter, of Burnley, Lancashire, had never denied taking part in the sham marriage to Kolade, Burnley Crown Court heard. But she was able to convince prosecutors she did then not go on to bigamously marry a second man, Stephen Akinseye, who she remains married to, the following January\nIn March 2011 they met at the Victoria Coach Station in London. On February 22, 2012 the defendant and Mr Kolade attended a notice of intention to marry interview, and they were married on July 2, 2012.\nProsecuting Neville Biddel said: 'Just under two weeks later on July 15 Mr Kolade appealed to stay in the UK, relying on the fact he was married. It was under a sham marriage and the defendant has never tried to hide that.'\nEvans was able to convince prosecutors she did then not go on to bigamously marry a second man, Stephen Akinseye, who she remains married to\nMr Biddel said that in a prepared statement Evans claimed she felt she was being pressured into the marriage and didn't want to go through with it, but he rejected that notion saying she had nearly two weeks to alert the authorities after the intention to marry interview but chose not to.\nMr Biddel said that according to the Home Office there were between 4,000 and 10,000 sham marriages in the UK each year.\nDefending, Mr Stuart said his 'vulnerable' client had been 'targeted' because she was naïve.\nHe said Evans had never wanted to go through with the marriage and she had been pressured in to it.\nEvans had never agreed to marry Mr Kolade for money, according to Mr Stuart, although Mr Kolade had promised to help Evans financially.\nBut he had 'lost interest' when Evans made it clear she did not want a sexual relationship and stopped contacting her, the court was told.\nMr Stuart said his client has suffered difficulties with her mental health in recent months and had been referred to the mental health team by her GP.\nHe said she had also had a long history with depression and low self esteem.\nMr Stuart said he believed Mr Kolade had 'still not been caught up with' by the authorities.","url":"https://www.dailymail.co.uk/news/article-3393663/Babysitter-married-Nigerian-immigrant-sham-marriage-jailed-six-months-judge-says-crime-struck-heart-immigration-system.html"}
