{"authors":["Meghan Demaria"],"date_download":"2018-10-31 01:42:23","date_modify":"2018-10-31 01:42:23","date_publish":"2018-09-14 17:23:47","description":"For fans who don't believe Bachelor in Paradise leads to lasting relationships, Krystal and Chris are here to prove them wrong. The newly engaged couple looked happier than ever at the reunion during the show's live finale earlier this week. And…","filename":"data/vaneerConsumption/BachelorNationsKrystalChrisAngelaClayArePlanningACouplesRetreatThatSoundsTooSweet.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/d899ecdc-2990-4f76-8dd4-ed7ead9c350e-150091_7356.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_bachelor-nations-krystal-chris-angela-clay-are-planning-a-couples-retreat-that-sounds-too-sweet-11921467_1540950143.html","title":"'Bachelor' Nation's Krystal, Chris, Angela, & Clay Are Planning A \"Couples Retreat\" That Sounds Too Sweet","title_page":"'Bachelor' Nation's Krystal, Chris, Angela, & Clay Are Planning A \"Couples Retreat\" That Sounds Too Sweet","title_rss":"NULL","source_domain":"bustle.com","text":"For fans who don't believe Bachelor in Paradise leads to lasting relationships, Krystal and Chris are here to prove them wrong. The newly engaged couple looked happier than ever at the reunion during the show's live finale earlier this week. And while they're the only one of the three final Paradise couples who are still together, there's another Bachelor Nation couple they're close with, too. Apparently The Bachelor's Krystal, Chris, Angela, and Clay are planning a vacation together, because all four of them have found love — and friendship — within the reality TV universe.\nOf course, not every relationship formed in Paradise has as happy an ending as Chris and Krystal's story. Angela, for instance, dated Eric for much of Season 5, though he eventually left the beach on his own. But after the show's filming ended, Angela connected with Clay, thanks to Chris himself. Chris introduced Clay and Angela, and based on the new couple's recent Instagram posts, they really are a match made in Bachelor Nation heaven.\nIn a post she shared this week, Angela wrote, \"Smitten is an understatement,\" alongside a photo of her and Clay in Boston. Even though they've both appeared on the reality TV franchise, these two found happiness when the cameras weren't rolling.\nOn Thursday night, Krystal, Chris, and Clay shared some exciting news for the weeks ahead. The three of them posted screenshots from a FaceTime conversation between the two couples, with Chris writing in his Instagram Story, \"family trip end of month!!,\" along with several hugging-face emoji.\nChris also wrote, \"Nothing but bliss with these two couples,\" and all four of them have wide grins in the photo.\nPlus, Clay reposted a snapshot from Krystal's Instagram Story, adding, \"Can't wait for couples retreat,\" with a heart-eye emoji.\nDuring Clay and Chris' time on Becca's season of The Bachelorette, there weren't a ton of moments where they seemed to be close friends. And Bachelor in Paradise didn't show a ton of moments between Krystal and Angela either. But the couples' friendship just goes to show that what you see on screen is only part of the story. Meeting through Bachelor Nation is anything but a traditional experience, so it's nice to see that the two couples have each other to lean on for support.\nAnd while Chris and Krystal were both deemed \"villains\" on their respective Bachelorette and Bachelor seasons, there's nothing villainous about their newfound love. Chris, in particular, has been beautifully outspoken about his relationship with his fiancée, even tearing up during the Paradise finale. Chris also shared a sweet photo of himself and Krystal with their moms, thanking the \"single mothers who risk it all for your children everyday.\" It looks like his relationship with Krystal made him open up more about his feelings for the people who are most important to him.\nThe couple also shared on the Paradise finale that they're planning to move in together. And while they didn't name a location, it seems possible that Chris might move to Krystal's current hometown of San Diego. The two have posted a number of photos from Krystal's house, and it looks like Chris fits right into the family with her and her dogs.\nDistance is often a major difficulty for Bachelor Nation couples. But it looks like Chris and Krystal, as well as Angela and Clay, are making their love and their friendship work across the miles. There's no word on where the crew is headed on vacation, but it wouldn't be a surprise if they chose somewhere cold to switch things up after Paradise. A group trip sounds like the perfect way for all of them to keep in touch — without the cameras.","url":"https://www.bustle.com/p/bachelor-nations-krystal-chris-angela-clay-are-planning-a-couples-retreat-that-sounds-too-sweet-11921467"}
