{"authors":["Nicole Pomarico"],"date_download":"2018-10-31 01:40:14","date_modify":"2018-10-31 01:40:14","date_publish":"2018-09-06 17:17:46","description":"Congratulations are in order, because Bachelor Nation officially has its newest couple. Following their disappointing endings on The Bachelorette and Bachelor in Paradise, Clay Harbor and Angela Amezcua are dating, and the first photos of them as a…","filename":"data/vaneerConsumption/BachelorStarsClayAngelaAreDatingProvingThatLoveDoesntAlwaysRequireARoseCeremony.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/3be366c4-8c15-46fe-95d3-d14ea7cd78a8-screen-shot-2018-09-06-at-10810-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_bachelor-stars-clay-angela-are-dating-proving-that-love-doesnt-always-require-a-rose-ceremony-11777140_1540950014.html","title":"'Bachelor' Stars Clay & Angela Are Dating, Proving That Love Doesn't Always Require A Rose Ceremony","title_page":"'Bachelor' Stars Clay & Angela Are Dating, Proving That Love Doesn't Always Require A Rose Ceremony","title_rss":"NULL","source_domain":"bustle.com","text":"Congratulations are in order, because Bachelor Nation officially has its newest couple. Following their disappointing endings on The Bachelorette and Bachelor in Paradise, Clay Harbor and Angela Amezcua are dating, and the first photos of them as a couple are seriously adorable — and yes, this means they're already Instagram official.\nLast time we saw Clay, he was leaving Becca Kufrin's season after getting injured during a group date, knowing that he couldn't risk this injury getting in the way of his football career since that's how he provides for his family. And just this week on BiP, Angela was absolutely heartbroken over Eric Bigger when he changed his mind about being \"all in\" with her as a couple, choosing to pursue Cassandra Ferguson instead. Angela ended up getting sent home during the rose ceremony on Monday night, and Eric made his exit on Tuesday, crying over Angela on his way out. Neither Clay nor Angela have really gotten their happy endings on reality TV.\nBut now, it seems like everything has changed. Because after teasing he'd reveal who he new girlfriend is on Wednesday, he shared this picture, filling fans in on the fact that he and Angela are a couple for the first time.\nFirst of all, they're a beautiful couple — mostly because of how genuine their smiles seem — but the caption Clay wrote for this photo is too sweet. \"What do the kids call it? Woman crush Wednesday? Welp here’s mine,\" he wrote, even throwing in a little light shade toward Eric with his \"#whatwashethinking\" hashtag.\nAngela also shared a different photo of her and Clay together, which also happened to be just as beautiful and mushy as this one. Can we talk about how perfect the caption \"paradise found\" is for a woman who left BiP empty handed, only to find someone even better off the show? Because it is.\nAnd as if that's not enough cute for you, there are also the Instagram story posts that they've both shared since revealing the news, including this one from Clay, where not only did he upload yet another beautiful couple photo, but he also mentioned that Chris Randone introduced them — yes, the same Chris who was a general Paradise menace until he finally settled down with Krystal Nielson.\nClayHarbs82/Instagram Story\nAngela also shared this series of snapshots of her and Clay. Between all these photos, it seems like they may have been dating for awhile not but were unable to share it because Angela's story arc on BiP was still going strong until this week? Whatever it is that made them share the news now, it's obvious that they're so happy together.\nangkay7/Instagram Story\nOn The Bachelorette, Clay seemed like a genuinely good guy who wanted to do his best for the people he loves, and on BiP, fans got to know Angela better as someone who was looking for real love. Now, it seems like they've both found exactly what they were looking for in each other — and they didn't even need Chris Harrison or a rose ceremony to do it.","url":"https://www.bustle.com/p/bachelor-stars-clay-angela-are-dating-proving-that-love-doesnt-always-require-a-rose-ceremony-11777140"}
