{"authors":["Chloe-Lee Longhetti For Daily Mail Australia"],"date_download":"2018-10-22 22:44:32","date_modify":"2018-10-22 22:44:32","date_publish":"2017-03-16 04:24:45","description":"The Bachelor's Olena Khamula gushes about boyfriend Rodney Maroun","filename":"data/vaneerConsumption/BachelorsOlenaKhamulagushesaboutboyfriendRodney.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/03/3E50858F00000578-0-image-a-51_1489634321452.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318638_Bachelor-s-Olena-Khamula-gushes-boyfriend-Rodney_1540248272.html","title":"Bachelor's Olena Khamula gushes about boyfriend Rodney","title_page":"Bachelor's Olena Khamula gushes about boyfriend Rodney | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's recently found love with new boyfriend Rodney Maroun after failing to find it with Richie Strahan on The Bachelor.\nAnd Olena Khamula has gushed about her new partner, calling him 'the one'.\nThe Ukrainian model and TV personality told Daily Mail Australia: 'I'm really happy I've found the one for me.'\nScroll down for video\nHappy: The Bachelor's Olena Khamula has gushed about her new man, Rodney Maroun (pictured) and opened up about their relationship to Daily Mail Australia\n'It's going well, everything's been going great and we have a very good connection,' Olena said.\n'It's been a crazy ride, before the show, during the show, after the show, all of that experience,' the blonde added.\nThe pair are believed to have first started dating back in October.\nGoing strong! 'It's going well, everything's been going great and we have a very good connection,' Olena said\nSmitten: The pair are believed to have first started dating back in October\nMeanwhile, Olena has also revealed what she thinks about new Bachelor Matty, telling Daily Mail Australia she thinks he is perfect for the role.\n'I hope he finds love,' she said.\n'I think it's a really good casting this year and Matty J is going to be a really good Bachelor.'\n'He has the personality for it and can hold the show on his own. It'll be very interesting to see what they get up too,' she said with a laugh.\nShe added that the advice she would give him would to be honest with the women he's dating on the show, and to 'make sure you find out the real reason people are on the show, for love or not.'\n'I hope he finds love': Olena also spoke about new Bachelor Matty J (pictured), saying she thinks he is perfect for the role\nSpeaking from experience: She added that the advice she would give him was to be honest with the women he's dating on the show (pictured on The Bachelor with Richie Strahan)\n'I really hope he finds the girl for him.'\nOlena has just signed on as the face of the Heineken Formula 1 campaign.\nShe is appearing live on interactive billboards in various cities - including Sydney and Melbourne - to find lucky winners to win a spot at Heineken Saturday at the Australian Grand Prix, next week.\nRudimental is set to perform on the day at the Heineken event.\n'I'm definitely very excited to see who the winner will be,' Olena told Daily Mail Australia.\nHelping to chose a winner, she said: 'I'm looking for someone that has a really big and bubbly personality...and we're going to find some talented people.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318638/Bachelor-s-Olena-Khamula-gushes-boyfriend-Rodney.html"}
