{"authors":["Associated Press"],"date_download":"2018-10-23 04:56:52","date_modify":"2018-10-23 04:56:52","date_publish":"2017-04-26 16:35:51","description":"NEW ORLEANS (AP) - In a region that takes food seriously, feral hogs are despised as destructive, but their rich, dark meat is winning fans among Louisiana...","filename":"data/vaneerConsumption/BadbeastsgoodtreatsFeralhogslaughterhousetakesoff.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/17/wire-466463-1493223667-251_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4448346_Bad-beasts-good-treats-Feral-hog-slaughterhouse-takes-off_1540270612.html","title":"Bad beasts, good treats: Feral hog slaughterhouse takes off","title_page":"Bad beasts, good treats: Feral hog slaughterhouse takes off | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NEW ORLEANS (AP) - In a region that takes food seriously, feral hogs are despised as destructive, but their rich, dark meat is winning fans among Louisiana chefs.\nA small slaughterhouse is butchering the wild pigs , which cause the state $76 million-plus in annual damage, and selling sausage to grocery stores and meat to restaurants, where chefs are turning it into savory prosciutto, chorizo and meatballs.\n\"To me, it is the most interesting thing I have seen in years,\" said Rene Bajeux, executive chef for the Palace Cafe and three other Dickie Brennan & Co. restaurants in New Orleans. \"It is good for everything - good for business, good for cooking, good for the ecology, good for everything. Those bad beasts are a good treat.\"\nIn this Thursday, April 13, 2017, photo, a wild boar walks in a swamp, in Slidell, La. Feral hogs are believed to cause $76 million or more in damage across the state every year but in recent years a small Louisiana slaughterhouse has begun butchering the hogs and selling the product to grocery stores and restaurants as part of an effort to help control the hogs' numbers. (AP Photo/Rebecca Santana)\nSpringfield Slaughter House 's main business is butchering wild boar, which otherwise would be gobbling crops, competing with local wildlife and ripping up levees, fragile wetlands and other green spaces.\nFeral hogs probably do more than $1.5 billion damage nationwide each year, according to the USDA, and the problem is only getting bigger: from 1982 to 2012, the invasive species spread from 17 states to 36.\nOwner Charlie Munford got into the wild hog business in 2015. He'd been working with farmers, slaughterhouses and chefs to provide local beef, lamb, pork and goat to restaurants when he bought the slaughterhouse about 40 miles northwest of New Orleans in 2014.\nHunters have to bring the hogs, weighing in at 90 to 300 pounds, to Munford's slaughterhouse alive so they can be inspected before slaughtering. Munford estimates he's killed about 1,000 over the past year.\nBut one small slaughterhouse can take only a bite out of the estimated 600,000 feral swine in Louisiana: Authorities say 70 percent of the population would have to be killed each year just to keep the numbers from growing.\nAt his slaughterhouse, Munford first stayed with the traditional meats. Then he read about a program to slaughter feral hogs for commercial sale in Texas - about 461,000 between 2004 and 2009. The Louisiana Department of Agriculture and Forestry was already considering a program similar to Texas' and helped Munford get started. Feral swine are now 90 percent of his business; the rest is domestic pork.\nWild boar saved the slaughterhouse after a plan to raise and sell grass-fed beef to a grocery chain fell through, he said.\n\"The restaurant demand for beef, lamb and domestic pork has declined. ... It would have been hard to stay in business without a major game-changer,\" Munford said.\nOf the 19 state-inspected slaughterhouses, Springfield is the only one selling wild boar, although state officials say they've gotten inquiries from others that are interested.\nIts wild boar line includes whole hogs and 20-pound boxes of primal cuts such as hams, shoulders and bellies for sale to restaurants. More than half the business is sausages, which are sold to grocery stores.\nCustomers include some top chefs. Bajeux makes about 80 pounds of wild boar bacon every week for weekend brunches and offers a variety of other dishes such as wild boar stew and chili. One recent day, his chillers held wild boar sausage and cold cuts including salami, coppa, and prosciutto-like speck.\nEmeril's Delmonico makes wild boar meatballs served with caponata, chef de cuisine Anthony Scanio said. Like Bajeux, he also makes wild boar charcuterie, often used in specials.\nSince these pigs have spent their lives running around in the open, this pork is not \"the other white meat.\"\n\"The meat is much darker,\" Scanio said. \"I think it tastes darker as well - iron, mineral notes. It's like game, essentially.\"\nIt's so much leaner than domestic pork that Munford's sausage is 30 percent wild pig and 70 percent farm-raised. \"We don't want the sausage to be too lean or too gamy,\" he said.\nAt City Pork Brasserie and Bar in Baton Rouge, chef Ryan Andre likes the stronger flavor.\n\"It's kind of like a cross between pork and beef,\" Andre said. He cooks down a 70-pound hog weekly to make wild boar flautas, his top-selling appetizer.\nThe wild boar effort contrasts with one about 20 years ago to get nutria, an invasive rodent, on restaurant menus and grocery shelves. People love pork already, but the same cannot be said for nutria, which look a bit like rat-tailed beavers.\n\"That was a difficult sell,\" Scanio said.\nBaton Rouge chef Philippe Parola, who was part of that campaign, puts much of the blame for its failure on federal inspection rules. He contends that the federal government must loosen rules requiring meat to be inspected both alive and dead to encourage more efforts to eat invasive mammals like feral hogs or nutria.\nMunford said he applauds Parola's aim, but thinks there are excellent reasons for the live inspection.\n\"When something's dead out in the field and then transported in an unrefrigerated vehicle, it can go bad really quick. Especially in a hot climate,\" he said.\nState officials hope to expand the slaughterhouse program as one more piece in a puzzle that also includes regular hunting - the beasts are \"outlaw quadrupeds\" that can be shot year-round during daylight shooting hours - and even paying to have hogs shot with machine guns from helicopters. They say they've gotten inquiries from other slaughterhouses, but none has signed up so far.\nIn this March 2, 2017 photo, chef's apprentice Stevie Gonzales unwraps a hog that will be processed for meat at the Palace Cafe in New Orleans. The restaurant uses wild boar, which otherwise would be gobbling crops, competing with local wildlife and ripping up levees, fragile wetlands and other green spaces. (AP Photo/Gerald Herbert)\nIn this March 21, 2017 photo, owner Charlie Munford displays a rifle that has to be used to slaughter wild boar at the Springfield Slaughterhouse in Springfield, La. Hunters have to bring the hogs alive so they can be inspected before slaughtering. Munford said he applauds Parola's aim, but thinks there are excellent reasons for the live inspection. (AP Photo/Gerald Herbert)\nFILE - In this June 17, 2014 file photo, John Schmidt, a wildlife trapper, walks past damage from feral hogs that happened overnight while foraging near one of his traps in New Orleans. Feral hogs probably do more than $1.5 billion damage nationwide each year, according to the USDA, and the problem is only getting bigger: between 1982 and 2012, the invasive species spread from 17 states to 36. (AP Photo/Gerald Herbert, File)\nIn this March 21, 2017 photo, wild boar heads hang next to racks of wild boar sausage at the Springfield Slaughterhouse in Springfield, La. The wild boar effort contrasts with one about 20 years ago to get nutria, an invasive rodent, on restaurant menus and grocery shelves. People love pork already, but the same cannot be said for nutria, which look a bit like rat-tailed beavers. (AP Photo/Gerald Herbert)\nIn this March 2, 2017 photo, Rene Bajeux, executive chef for the Palace Cafe at the Palace Cafe, inspects wild boar he is aging at the restaurant in New Orleans. The restaurant uses wild boar, which otherwise would be gobbling crops, competing with local wildlife and ripping up levees, fragile wetlands and other green spaces. And in a region that takes its food seriously, and has the James Beard awards to back it up, the meat passes muster with area chefs who praise its taste and have turned it into savory prosciutto, chorizo and meatballs. (AP Photo/Gerald Herbert)\nIn this March 21, 2017 photo, workers butcher wild boar at the Springfield Slaughterhouse in Springfield, La. Area chefs praise its taste and have turned the meat into savory prosciutto, chorizo and meatballs. And this is a state that takes its food seriously, and has the James Beard awards to back it up. (AP Photo/Gerald Herbert)\nIn this March 21, 2017 photo, state inspected wild boar hangs at the Springfield Slaughterhouse in Springfield, La. The wild boar effort contrasts with one about 20 years ago to get nutria, an invasive rodent, on restaurant menus and grocery shelves. People love pork already, but the same cannot be said for nutria, which look a bit like rat-tailed beavers. (AP Photo/Gerald Herbert)\nIn this March 21, 2017 photo, a worker butchers wild boar at the Springfield Slaughterhouse in Springfield, La. Of the 19 state-inspected slaughterhouses, Springfield is the only one selling wild boar, although state officials say they've gotten inquiries from others that are interested. (AP Photo/Gerald Herbert)\nIn this March 21, 2017 photo, wild boar sausage to be smoked hangs on racks at the Springfield Slaughterhouse in Springfield, La. Their main business is butchering wild boar, which otherwise would be gobbling crops, competing with local wildlife and ripping up levees, fragile wetlands and other green spaces. (AP Photo/Gerald Herbert)\nIn this March 21, 2017 photo, workers Javier Perez, left, and Albert Gonzales remove boar carcasses from hooks for processing at the Springfield Slaughterhouse in Springfield, La. The small Louisiana slaughterhouse has a big mission: getting restaurants and home cooks to take a bite out of the state's $74 million-plus in annual damage from feral hogs. (AP Photo/Gerald Herbert)\nIn this March 2, 2017 photo, chef's apprentice Stevie Gonzales slices hogs head cheese at the Palace Cafe in New Orleans. In a region that takes its food seriously, and has the James Beard awards to back it up, the meat passes muster with area chefs who praise its taste and have turned it into savory prosciutto, chorizo and meatballs. (AP Photo/Gerald Herbert)","url":"https://www.dailymail.co.uk/wires/ap/article-4448346/Bad-beasts-good-treats-Feral-hog-slaughterhouse-takes-off.html"}
