{"authors":["Andre Walker"],"date_download":"2018-10-30 20:07:44","date_modify":"2018-10-30 20:07:44","date_publish":"2015-01-08 16:19:53","description":"Why David Cameron should be worried that the Green Party are unlikely to be included in the general election debates.","filename":"data/vaneerConsumption/BadNewsForCameronAndGoodNewsForFarageOnElectionDebates.json","image_url":"https://media.breitbart.com/media/2015/01/cam-farage.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_01_08__1540930064.html","title":"Bad News For Cameron And Good News For Farage On Election Debates","title_page":"Bad News For Cameron And Good News For Farage On Election Debates | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"UPDATE: Since this article was published David Cameron has refused to join the debates unless the Greens are included.\nCommercial broadcasting regulator OFCOM has ruled the Green Party is not a major party and is therefore unlikely to be included in the leaders’ debates ahead of the next election. Broadcasters got together to propose a 4-3-2 strategy in which Miliband, Cameron, Clegg and Farage would debate each other, then Farage would drop out for the next one and Cameron would debate Miliband alone at the last.\nAs soon as the plan was announced Cameron reacted by asking for the Greens to be included in the four party leaders debate. Do not fool yourself into believing this was a sudden act of altruism, he had an important reason for doing so. A five man debate would be a complete mess, and would be so confused that no one could possibly win. Giving him the opportunity to ‘get Farage out the way’ in a debate that was so bad everyone would forget it quickly.\nHe would then be clear to take on Miliband and Clegg a week later (we assume). The writing is on the wall at this debate already: Clegg would be so tied to the government he would find it impossible to gain the same traction he did before the last election.\nSo we are left with the final two man debate between Cameron and Miliband. The debate itself absolutely plays into the Cameron narrative that the election is about which of these two should be Prime Minister. His polling says a sizeable number of UKIP voters will switch back to the Conservatives when faced with the perceived ‘risk’ of Miliband winning.\nThat is not to say every UKIP voter feels this way, and it also does not mean Cameron will win. But many UKIP/Tory defectors do feel that way and it would make life significantly easier for him. Not least because he has a proven track record of wiping the floor with Miliband, so the smart money would be on the Prime Minister winning that debate.\nIf that debate comes after a couple of messy earlier debates with no obvious winner it would set Cameron up for polling day. Which could be as little as one week later.\nThe problem for Cameron is that Clegg beat him last time by quite some margin. Farage convincingly beat the Liberal Democrat leader twice in the Europe debates earlier this . The UKIP leader effectively slayed the undisputed champion, implying that on a level playing field he would win a debate.\nThis is compounded by UKIP’s circumstances, as they have lots of elected politicians but have yet to take control of any major local authorities. This gives the party credibility but makes it very hard to criticise, which is why rivals revert to personal attacks on individuals rather than challenge the party’s record. In a debate we should assume this would make Farage virtually impossible to deal with.\nClegg was in a similar situation in the lead up to 2010, and despite holding a number of councils: it made him immune to being challenged by Cameron and Brown.\nUnless Cameron can dilute Farage by putting up obstacles like additional leaders the first debate, he will grant UKIP yet another boost. He needs the whole exercise to be about Miliband versus Cameron but at this rate it’s much more likely to be yet another example of Farage humiliating the other three.\nWithout the Greens present, Farage will win debate one, and no one will care about the other two as a result. That could easily cost Cameron the election. So I predict the Conservatives will be encouraging their people to reply to the consultation about major parties to fight for the Greens. OFCOM may want to take their spirited correspondence with a pinch of salt!","url":"https://www.breitbart.com/europe/2015/01/08/bad-news-for-cameron-and-good-news-for-farage-on-election-debates/"}
