{"authors":["Sylvia Longmire"],"date_download":"2018-10-30 21:37:01","date_modify":"2018-10-30 21:37:01","date_publish":"2015-04-23 21:28:22","description":"A recent report by the Government Accountability Office (GAO) indicates spotty radio coverage and inadequate training are challenging the agency’s ability to secure the southwest border and negatively affect agent safety.","filename":"data/vaneerConsumption/BadRadioCoverageInadequateTrainingHinderBorderPatrolOperationsandAgentsSafety.json","image_url":"https://media.breitbart.com/media/2015/04/BP-Radio-RICK-WILKING-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_04_23__1540935421.html","title":"Bad Radio Coverage, Inadequate Training Hinder Border Patrol Operations and Agents' Safety","title_page":"Bad Radio Coverage, Inadequate Training Hinder Border Patrol Operations and Agents' Safety","title_rss":"NULL","source_domain":"breitbart.com","text":"A recent report by the Government Accountability Office (GAO) indicates spotty radio coverage and inadequate training are challenging the agency’s ability to secure the southwest border and negatively affect agent safety. Aside from a firearm, a handheld radio is a Border Patrol agent’s best friend. Often finding themselves in remote areas of the border with untold armed drug and human smugglers nearby, agents need to be able to communicate with each other quickly and clearly.\nThe Washington Examiner recently published a story highlighting the main points of the full GAO report, which basically asserts that the $945 million investment in the system upgrade has been a significant waste. Some Border Patrol agents told congressional investigators that radio communications actually worsened after the update, according to the Examiner. In come situations, their communications are unsecure, allowing outsiders to listen in on their radio traffic.\nInitially DHS intended to build more radio towers in four Arizona and Texas border sectors, but that plan was too expensive. Instead, the agency converted analog systems to digital in the five remaining border sectors. Agents; however, only conducted very limited testing in just the Rio Grande Valley sector, despite a Border Patrol mandate that all new systems be fully tested.\nThe GAO found that agents “missed apprehensions of subjects” because they couldn’t use their radios to communicate with officers from other law enforcement agencies. Most agents interviewed by the GAO indicated they had been “involved in an incident in which a communications challenge jeopardized their safety.”\nSylvia Longmire is a border security expert and Contributing Editor for Breitbart Texas. You can read more about cross-border issues in her latest book, Border Insecurity: Why Big Money, Fences, and Drones Aren’t Making Us Safer.","url":"https://www.breitbart.com/border/2015/04/23/bad-radio-coverage-inadequate-training-hinder-border-patrol-operations-and-agents-safety/"}
