{"authors":["Mary Chastain"],"date_download":"2018-10-30 19:26:23","date_modify":"2018-10-30 19:26:23","date_publish":"2015-01-06 20:58:12","description":"Islam forbids drugs, alcohol, and cigarettes, but rumors have spread for months indicating that members of the Islamic State (ISIS/ISIL) terrorist groups engage in drug use. Those rumors were at least in part confirmed by a discovery this week when VICE journalist Joakim Medin identified cocaine in the house of dead Islamic State leader Emir Abu Zahra just south of Kobane, Syria. |","filename":"data/vaneerConsumption/BagofCocaineFoundinDeadISISLeadersHouse.json","image_url":"https://media.breitbart.com/media/2015/01/isis-fighters-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_01_06__1540927583.html","title":"Bag of Cocaine Found in Dead ISIS Leader's House","title_page":"Bag of Cocaine Found in Dead ISIS Leader's House | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Islam forbids drugs, alcohol, and cigarettes, but rumors have spread for months indicating that members of the Islamic State (ISIS/ISIL) terrorist groups engage in drug use. Those rumors were at least in part confirmed by a discovery this week when VICE journalist Joakim Medin identified cocaine in the house of dead Islamic State leader Emir Abu Zahra just south of Kobane, Syria.\nMedin came across the cocaine by accident. Kurdish journalist Mustafa Ali led him to south Kobane to interview a female member of the Peshmerga when they discovered a group of the People’s Protection Units (YPG) in the house of the dead leader. They showed off their findings to Medin and Ali, but could not name a powdery substance in a plastic bag. From VICE:\nAnd finally, sitting in front of me, is a large, transparent plastic bag filled with white powder. The YPG fighters told me they are not sure what this could be. So I dipped my index finger into it, and sure enough, it’s a big bag of cocaine. I must admit, I am familiar with the taste of the drug. “Cocaine? What is that?” they ask.\nDayan, 23, the leader of the YPG unit, said the Islamic State leader “was distributing in smaller portions to his fighters.”\nIn September, witnesses to strange acts by militants brought up the issue of drug abuse within the system to media outlets.\n“One of their guys charged straight at us waving a large knife,” said YPG member Ferhat. “We shot him dead. When we capture them, we sometimes find syringes in their bags.”\nMilitants kidnapped Kareem Mufleh, 15, to fight for them, but the boy managed to escape. He told the media leaders fed militants drugs to fight. From ChristianPost:\nMufleh continued by explaining how the Islamic State has been so successful in getting militants to follow through with suicide attacks. Mufleh said that before going into battle, the ISIS leaders give fighters an anti-anxiety drug that would cause them to go crazy. When the fighter is mentally unstable and in the heat of battle, a leader hands the fighter a suicide belt and tells the fighter to carry out a suicide attack. Mufleh said he was personally given the anti-anxiety drug Zolam. “That drug makes you lose your mind,” said Mufleh. “If they give you a suicide belt and tell you to blow yourself up, you’ll do it.”\nIn October, International Business Times reported that al-Qaeda in the Islamic Maghreb, which pledged support to the Islamic State, controls the European cocaine trade in north Africa. Allegedly “48 tons of cocaine, worth approximately $18 billion in Europe,” travel through these lucrative routes every single year. Money is transmitted to the Islamic State, which allows them to fund their jihad, weapons, tanks, and missiles.","url":"https://www.breitbart.com/national-security/2015/01/06/bag-of-cocaine-found-in-dead-isis-leaders-house/"}
