{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 19:31:22","date_modify":"2018-10-30 19:31:22","date_publish":"2016-07-27 15:37:57","description":"Bahrain's top Shiite cleric went on trial Wednesday on charges of illegal fund raising and money laundering, judicial sources said.","filename":"data/vaneerConsumption/BahrainTriesShiiteClericForMoneyLaundering.json","image_url":"https://media.breitbart.com/media/2016/07/Sheikh-Isa-Qassim.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_07_27__1540927882.html","title":"Bahrain Tries Shiite Cleric For Money Laundering","title_page":"Bahrain Tries Shiite Cleric For Money Laundering","title_rss":"NULL","source_domain":"breitbart.com","text":"DUBAI (AFP) – Bahrain’s top Shiite cleric went on trial Wednesday on charges of illegal fund raising and money laundering, judicial sources said, just weeks after the Sunni-ruled kingdom revoked his citizenship.\nSheikh Isa Qassim (pictured) is accused of collecting funds illegally and has deposited more than $10 million in his private bank accounts, attorney general Haroun al-Zayani said in a statement on the official BNA news agency.\nQassim, considered the spiritual leader of the majority Shiite community in Bahrain, allegedly kept other amounts in cash to avoid legal controls, said the statement, accusing him of hiding the source of the money.\nAuthorities also accused him of purchasing properties worth more than one million dinar ($2.65 million) in an attempt to legitimise the funds.\nTwo of his aides, Sheikh Hussein Mahrus and Mirza al-Obaidli, are also on trial in the same case.\nThe three defendants did not appear in court for the hearing, held amid tight security, witnesses said.\nThe next hearing will be on August 14.\nOn June 20, Bahrain said it had revoked Qassim’s citizenship, accusing him of sowing sectarian divisions.\nSince then dozens of Shiites have staged a sit-in outside his home in the village of Diraz, which authorities have cordoned off.\nThe move against Qassim prompted criticism from Bahrain’s Western allies as well as its foe Iran, which the kingdom accuses of fuelling unrest among its Shiite community.\nBahrain has been shaken by unrest since security forces crushed Shiite-led protests demanding a constitutional monarchy and an elected prime minister in 2011.\nDespite repeated calls from their Western allies, Bahrain’s rulers have made no concessions to the Shiite opposition and have intensified a crackdown on critics.\nThis month, a court ordered the dissolution of the kingdom’s main Shiite opposition bloc, Al-Wefaq, which was the largest group in parliament before its lawmakers resigned en masse in protest at the crushing of demonstrations.","url":"https://www.breitbart.com/middle-east/2016/07/27/bahrain-tries-shiite-cleric-money-laundering/"}
