{"authors":[],"date_download":"2018-10-30 00:51:33","date_modify":"2018-10-30 00:51:33","date_publish":"2018-08-30 00:05:23","description":"I'm not the only non-leftist who believes that the nation’s criminal-justice system is badly in need of substantive reform. I’ve covered it at the state and local level and, quite frankly, conservatives ought to be far more concerned about the way things operate and far less willing to instinctively side with police and prosecutors, who simply are government officials more interested in protecting their power and prerogatives than promoting justice.","filename":"data/vaneerConsumption/BailingOutonaJustSolution.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/1024px-FolsomStatePrison.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860693.html","title":"Bailing Out on a Just Solution","title_page":"Bailing Out on a Just SolutionThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Sacramento\nI’m not the only non-leftist who believes that the nation’s criminal-justice system is badly in need of substantive reform. I’ve covered it at the state and local level and, quite frankly, conservatives ought to be far more concerned about the way things operate and far less willing to instinctively side with police and prosecutors, who simply are government officials more interested in protecting their power and prerogatives than promoting justice.\nPerhaps the Mueller investigation will serve as a teachable moment about how investigations typically operate. If prosecutors can set a “perjury trap” for the most powerful person in the country (and arguably the world), imagine what they do to some poor kid without any resources to fight back. Or imagine what they’ll do to your kids if they get ensnared in the legal system. I’ve interviewed regular people caught up in these nightmares. It’s not something you’d wish on your worst enemy.\n“It’s no wonder 95 percent of all defendants accept plea offers,” wrote Washington, D.C. public defender Jeffrey Stein, in a Washington Post article, or that 15 percent of exonerees (including 49 percent of manslaughter exonerees) pleaded guilty at some point in the process. “You tell your client that they would probably win at trial, but if they lose, they will go to prison. The plea promises some meaningful benefit: getting out of jail sooner, avoiding deportation, not losing a job, seeing a daughter before her next birthday. But your client would have to accept responsibility for a crime they may not have committed.”\nWriting in a Georgetown Law Journal article in 2015, former 9thCircuit Court of Appeals Judge Alex Kozinski, known for his libertarian/conservative views, made a similar point: “Innocent people do confess with surprising regularity. Harsh interrogation tactics, a variant of Stockholm syndrome, the desire to end the ordeal, emotional and financial exhaustion, family considerations and the youth or feeble-mindedness of the suspect can result in remarkably detailed confessions that are later shown to be utterly false.” Kozinski’s 42-page article paints a dark picture of the state of justice in our country, which should be a concern for anyone interested in “limited government” and the Constitution.\nHere in California, Republican lawmakers have been mostly AWOL on anything related to justice reform. They’ve long embraced a law-and-order approach that has allied them closely with police unions, even as those unions typically back Democrats (because of those Democrats’ support for cushy pension deals and other union priorities). The state’s GOP hasn’t stood for much of anything for years, and scaring the public about crime has been one of the few approaches they’ve taken that can help win votes.\nAgain, there’s a strong conservative case for such reforms. The Right on Crime project, backed by many conservative luminaries, recognizes that throwing money at the criminal-justice system and its bureaucracies isn’t any more effective than throwing money at the welfare system — or any other part of government. It focuses on restitution, community service, reducing recidivism, and — of utmost importance — protecting individual liberties. It does no one any good if people are wrongly imprisoned or face unjust prison sentences.\nBut with Republicans here a “no” on pretty much any justice reform — or at best, a “yes” after kicking and screaming (see asset-forfeiture reform) — we’re left seeing what Democrats choose to do. In California, we’ve got extremely liberal Democrats who can’t be trusted to make crucial distinctions (e.g., maybe violent criminals ought to stay in prison, whereas people who violate some of the state’s onerous regulations ought not to be incarcerated). And we’ve got Democrats who are closely aligned with unions and seem intent on protecting government workers and expanding government bureaucracy.\nOn Tuesday, Gov. Jerry Brown signed a law that eliminates money bail throughout the state. Reference those plea situations above when thinking about the bail situation. People who can’t post bail are three times as likely as those who can to accept a plea deal, according to reports. If you’re in jail and in danger of having Child Protective Services grab your kids, or losing your job or your apartment, you’re at a decided disadvantage when “negotiating” with prosecutors. Under the bail system, determinations are made mainly on the ability to pay for a bail bond.\nThroughout the debate, conservatives mainly argued that an end to money bail would mean that criminals would be out free and that it would lead to a crime wave. But as I wrote recently for the Orange County Register, Maryland’s bail-reform experiment has resulted in the opposite effect: Cash bails have decreased, but judges — more responsible now for determining the terms of release — are reluctant to let people go home. It makes sense. What judge — especially in states where they are elected — wants to be the one who let a violent criminal go free?\nThe new California law, the result of a compromise that gives more power to judicial panels to make determinations, seems likely to keep people incarcerated for longer. That eliminates any financial or justice benefit from the reform — and is the reason many ardent criminal-justice reformers such as the ACLU had urged a veto of a bill it originally sponsored.\nIn another matter, Republicans have been unwilling to support a bill that would force most large counties to create an office of medical examiner to investigate deaths. Currently, most California counties have a sheriff who also is a coroner, and that sheriff gets to make the final determination on a cause of death. A scandal in San Joaquin County, where the top medical official resigned after alleging that the sheriff interfered with his investigations, spotlighted the conflict of interest. The amended bill would give counties the choice of starting their own medical examiner’s office — or the referral of investigations to outside investigators in conflict-of-interest situations (e.g., with officer-involved shootings). This one is a true no-brainer.\nUnfortunately, California Republicans are too busy doing whatever law enforcement tells them rather than thoughtfully engaging on these important issues. That means that the pendulum is likely to swing too far in the other direction given the nature of the state’s Democrats — or we’ll get more laws such as bail reform that only make a bad situation worse.\nSteven Greenhut is Western region director for the R Street Institute. Write to him at sgreenhut@rstreet.org.","url":"https://spectator.org/bailing-out-on-a-just-solution/"}
