{"authors":[],"date_download":"2018-10-23 00:15:56","date_modify":"2018-10-23 00:15:56","date_publish":"2017-03-16 09:23:13","description":"A convicted murderer and child molester in New Zealand won a lawsuit Thursday arguing prison authorities breached his rights by confiscating a toupee he used...","filename":"data/vaneerConsumption/BaldNewZealandkillerwinstoupeelawsuit.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/09/wire-227507-1489656195-942_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4319388_Bald-New-Zealand-killer-wins-toupee-lawsuit_1540253756.html","title":"Bald New Zealand killer wins toupee lawsuit","title_page":"Bald New Zealand killer wins toupee lawsuit | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Convicted paedophile and killer Phillip John Smith was given given permission to wear a toupee \"to improve his self esteem\"\nA convicted murderer and child molester in New Zealand won a lawsuit Thursday arguing prison authorities breached his rights by confiscating a toupee he used to disguise himself when fleeing the country.\nPhillip John Smith fled to Brazil in November 2014 while on temporary release from Auckland Prison.\nAt the time, he was sporting a hairpiece he had been given permission to wear two years earlier \"to improve his self esteem\".\nWhen he was recaptured and returned to New Zealand three weeks later the wig was confiscated and images of Smith's bald pate were splashed across the media when he appeared in court.\n\"I felt totally belittled, degraded and humiliated,\" he told the High Court earlier this month.\nSmith was sentenced to life in 1996 for sexually abusing a boy over a three-year period, then tracking down his victim after his family fled to another city.\nSmith broke into the family's house and fatally stabbed the boy's father as he tried to protect his son.\nThe 42-year-old told the court the toupee was important to his ongoing rehabilitation as he was extremely sensitive about his baldness.\nJudge Edwin Wylie accepted Smith's argument that the Corrections Department failed to consider his rights when it seized the hairpiece.\n\"I have concluded that Mr. Smith's fundamental right to freedom of expression was ignored,\" he said in a written judgement delivered Thursday.\n\"An important right has been breached and the breach may be material.\"\nPaedophile Phillip John Smith said he felt \"totally belittled, degraded and humiliated\" when prison chiefs confiscated his toupee\nVictims' advocate Ruth Money said the Smith case was \"embarrassing for New Zealand\".\n\"I have absolutely zero sympathy, he showed no sympathy for any of his victims,\" she told Prime News.\nJudge Wylie said freedom of expression could include a physical act, such as wearing a wig, and Smith did not lose his fundamental rights when he became a prisoner.\nWylie rescinded the prison's decision to confiscate the toupee but suspended it for two weeks to allow authorities to make a fresh case.\nHe declined Smith's application for NZ$5,000 ($3,500) in damages.\nWylie noted that Smith had denied he could smuggle contraband under the hairpiece because the tape that fixed it to his head was transparent.\n\"He also stated that there were other benefits -- namely the protection of his scalp from sun exposure and the prevention of heat loss through his head in winter,\" the judge said.\nSmith was on the verge of parole when he fled in 2014 but was given an additional 33 months jail time for the Brazil escape.","url":"https://www.dailymail.co.uk/wires/afp/article-4319388/Bald-New-Zealand-killer-wins-toupee-lawsuit.html"}
