{"authors":["Shayan Shankar For Daily Mail Australia"],"date_download":"2018-10-23 00:52:41","date_modify":"2018-10-23 00:52:41","date_publish":"2017-03-16 10:27:10","description":"Four adults have been confirmed to have contracted the deadly virus on the popular tourist island, after returning to Western Australia in the past fortnight.","filename":"data/vaneerConsumption/Balitravellerswarnedaftermeasleoutbreakonisland.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E531F6000000578-0-image-a-38_1489656217329.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319290_Bali-travellers-warned-measle-outbreak-island_1540255961.html","title":"Bali travellers warned after measle outbreak on island","title_page":"Bali travellers warned after measle outbreak on island | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Health authorities have warned holidaymakers headed to Bali to ensure they have been vaccinated against measles, following a surge in cases on the holiday island.\nFour adults have been confirmed to have contracted the deadly virus on the popular tourist island, after returning to Western Australia in the past fortnight.\nIt comes only days after health officials have scrambled to prevent an outbreak after reported cases on the Gold Coast and Melbourne.\nFour WA adults have been confirmed to have contracted measles whilst holidaying in Bali\nWA Health Department medical epidemiologist Gary Dowse, said the reported case of measles in four adults were from different travelling parties.\n'Unfortunately, it is not unusual for Australians to be infected with measles overseas, including in Bali,' Dr Dowse told The West Australian.\n'But the increase in the number of cases in the past month suggests there may be a significant measles outbreak currently underway in Bali.'\nThe number of cases reported on Bali are much higher than from other overseas travel destinations, Dr Dowse added.\nSince 2013 more than 20 cases have been reported of travellers returning from Bali with measles in Western Australia alone.\nEarlier this year, two young children who had not been vaccinated were the first to be infected, leading to an outbreak of another four people in WA.\nSymptoms of the measles include fever, sore eyes and a cough followed by three or four days of a red, blotch rash rash that spreads all across the body\nAn increase of measles cases from travellers from Bali have health authorities warning that there may be a significant outbreak on the holiday island\nSymptoms of the airborne virus include fever, sore eyes and a cough followed by three or four days of a red, blotch rash rash that spreads all across the body.\nThough naturally occurring measles have been eliminated from WA for about 20 years thanks to the stat'e s high vaccination coverage, cases of measles can occur because of tourists or WA residents who have been infected overseas.\nA woman in Brisbane south and a man from Brisbane's north were also found to have carried the virus following a trip to Bali last week.\nAnd an employee of a Big-W store in Melbourne's west, worked shifts between March 3 and March 6 while infections, before being diagnosed with measles.\nHealth authorities are warning travellers to ensure they have been vaccinated against the disease, given how contagious it is.\nTravellers returning from Bali or other countries who developed a fever with other symptoms within weeks of returning home should consult their doctor and phone ahead before going to their GP clinic.","url":"https://www.dailymail.co.uk/news/article-4319290/Bali-travellers-warned-measle-outbreak-island.html"}
