{"authors":[],"date_download":"2018-10-30 18:18:50","date_modify":"2018-10-30 18:18:50","date_publish":"2015-03-11 16:36:14","description":"Heath Gill has played some robust characters in his five-year career with Atlanta Ballet, but none quite like Kilroy, the former boxing champion who lands in the eerie port town of Camino Real.","filename":"data/vaneerConsumption/BalletsGilltakesonTennesseeWilliamsboxerKilroy.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/MyAJC/2015/03/11/Images/photos.medleyphoto.6913156.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_ballet-gill-t_5f13d50b008c3d193ffbb9f8e7ecd9b1__1540923530.html","title":"Ballet’s Gill takes on Tennessee Williams’ boxer Kilroy","title_page":"Ballet’s Gill takes on Tennessee Williams’ boxer Kilroy","title_rss":"NULL","source_domain":"ajc.com","text":"Heath Gill has played some robust characters in his five-year career with Atlanta Ballet, but none quite like Kilroy, the former boxing champion who lands in the eerie port town of Camino Real.\nIt’s Gill’s first time to originate a lead role in a world premiere, choreographer Helen Pickett’s first full-length ballet and one of her first narrative works. Inspired by Tennessee Williams’ 1953 play by the same title, “Camino Real” opens Friday, March 20, at Cobb Energy Performing Arts Centre.\nGill’s all-American demeanor — curly red hair, comedic sense and a face that’s a window on his emotions — make a strong match for Kilroy, based on patriotic World War II-era iconography. Unlike previous parts including Mercutio in “Roméo et Juliette” and Jonathan Harker in “Dracula,” this is Gill’s first role (since his early musical theater days) that requires voice-acting.\nThe play’s surreal aspects require him to deeply understand Kilroy’s psyche. Motivation behind every action must be clear, since metaphors and layered meanings arise at every turn.\n“He has this tough-guy kind of attitude,” Gill said of Kilroy, “but deep down inside, his heart is as big as the head of a baby.”\nKilroy’s heart is as much his weakness as his noblest quality. A fighter to the end, he reintroduces hope, passion and compassion to a place where it’s long been forgotten.\nGill thinks “Camino” will “hit home” in different ways with every audience member. He hopes people will come away “having delved a little deeper into themselves.”\n8 p.m. March 20-21, 2 p.m. March 21-March 22. $23-$124. 2800 Cobb Galleria Parkway, Atlanta. 404-892-3303, www.atlantaballet.com. CYNTHIA BOND PERRY\nMUSIC\nSkylark revives music of WWII, Civil War\nThe Skylark Vocal Ensemble, a 16-member Atlanta a cappella ensemble of vocalists from across the U.S., will present the “Clear Voices in the Dark” on Thursday, March 19, at St. Bartholomew’s Episcopal Church and Friday, March 20, at Immaculate Heart of Mary Catholic Church.\nUnder the direction of Matthew Guard, Skylark will present a program commemorating the 70th anniversary of World War II’s end and the Civil War sesquicentennial. In French, the ensemble will sing Francis Poulenc’s “Figure Humaine” (“The Face of Man”), composed in 1943 and featuring Paul Éluard’s poems of the resistance. Amid more familiar Civil War pieces, Skylark also will perform songs recently rediscovered by Duke University’s Historic American Sheet Music Project.\nBoth concerts at 7:30 p.m. $30, $20 seniors, free for students, music educators. St. Bart’s: 1790 LaVista Road N.E., Atlanta. Immaculate Heart: 2855 Briarcliff Road N.E., Atlanta. www.skylarkensemble.org.\nARTS\nEmerging Artists, ‘Field Experiment’ news\nThe Atlanta Mayor’s Office of Cultural Affairs has selected four 2015 Emerging Artist Awards recipients: choreographer-movement artist MaryGrace Phillips, writer-poet Alex-Gallo Brown, worship artist-playwright Amina S. McIntyre and visual-performance artist Meredith Kooi. They will be celebrated at a free arts-filled public event at Chastain Arts Center, 7-9 p.m. April 17. 135 W. Wieuca Road N.W., Atlanta. www.ocaatlanta.com.","url":"https://www.ajc.com/entertainment/ballet-gill-takes-tennessee-williams-boxer-kilroy/rfqOb8DbGy72QzxMkM0H6J/"}
