{"authors":["Kieran Canning For Mailonline"],"date_download":"2018-10-22 23:56:09","date_modify":"2018-10-22 23:56:09","date_publish":"2016-01-11 07:56:10","description":"KIERAN CANNING: Cristiano Ronaldo may rarely be the favourite in a popularity contest, but the facts don't lie and, despite Barcelona's trophy haul, it was Real's supremo who shone brightest.","filename":"data/vaneerConsumption/BallondOr2015CristianoRonaldobeatsLionelMessiandNeymarwithgoalsscored.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/3009B15300000578-0-image-a-5_1452514840294.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3393496_Cristiano-Ronaldo-scored-goals-Lionel-Messi-Neymar-carried-team-Ballon-d-personal-glory-Madrid-striker_1540252569.html","title":"Ballon d'Or 2015: Cristiano Ronaldo beats Lionel Messi and Neymar with goals scored","title_page":"Ballon d'Or 2015: Cristiano Ronaldo beats Lionel Messi and Neymar with goals scored | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Cristiano Ronaldo may rarely be the favourite in a popularity contest but the facts don't lie and, despite Barcelona's trophy haul, it was Real Madrid's goal king supreme who shone brightest in 2015.\nBy it's very nature the Ballon d'Or was created to reward outstanding individual achievement, not merely a cherry on the top of the cake for those who won the most trophies in the previous 12 months.\nRonaldo was rightly crowned the world's best for a third time last year just months after Germany won the World Cup. Lionel Messi beat off Barca team-mates Xavi and Andres Iniesta after Spain had done the same four years previously, and won his last Ballon d'Or after Madrid had won the league in 2012 thanks to an extraordinary scoring record of the like Ronaldo produced last year.\nAhead of the awards, he posted an image of himself standing outside an airport, ready to fly to Zurich ahead of the Ballon d'Or ceremony.\nRonaldo is heading to Zurich for this year's Ballon d'Or ceremony, where many make Messi the favourite\nCristiano Ronaldo is eyeing up a fourth Ballon d'Or success in Switzerland on Monday\nIf the precedent of personal over collective glory is to be repeated, it is Ronaldo who is deserving of a fourth Ballon d'Or to match Messi's record collection come Monday evening.\nThere is no doubting Messi and Neymar's brilliance. Along with Luis Suarez they have formed one of the most frightening frontlines football has ever seen, but that is what makes Ronaldo's achievements all the greater.\nThe former Manchester United man couldn't rely on the injury-prone and out-of-form Gareth Bale and Karim Benzema to have his back on a bad day, yet he still scored more goals in fewer games (54 in 52) than either Messi (48 in 53) or Neymar (41 in 53).\nIn the year he turned 30, 2015 was supposedly the start of Ronaldo's decline. Yet, in the past 12 months he shot past Messi to become the all-time top scorer in the Champions League and became the top marksman in the history of the world's most decorated club.\nThe Real Madrid striker has won the last two Ballon d'Or awards to add to his other crown in 2008\nRonaldo has become the leading all-time Champions League marksman, shooting past Lionel Messi\nThink about that for a second. Think of all the great strikers to have graced the Bernabeu: Alfredo Di Stefano, Ferenc Puskas, Emilio Butragueno, Ronaldo, Raul.\nNone of them come close to Ronaldo's unparalleled consistency of 338 goals in 324 games. He reined in Raul's record despite playing over 400 games fewer for Madrid than the Spanish legend.\nIt's in vogue to knock Ronaldo's stats as meaningless Madrid excess against La Liga's minnows.\nHe's supposedly slowing down, over the hill, Madrid even reported to be considering selling their greatest asset while they can still claim a world-record fee.\nYet, just last month he proved he's still the most clinical player in Europe by breaking his own record tally for a Champions League group stage with 11.\nDespite turning 30 this year, the Portuguese forward is showing no signs of slowing down just yet\nIf it was that easy, how come Neymar and Suarez weren't doing likewise against the likes of BATE Borisov in Messi's injury absence?\nWhilst the Argentine was on the sidelines for two months from September to November, Barca barely skipped a beat proving there is no such thing as Messi-dependence.\nBy contrast, Madrid are a one-man show where even Ronaldo's brilliance can be undone by the faults of others. Just like Messi, Ronaldo hit two goals in the Champions League semi-finals. Is it his fault at the other end of the field the crumbling Iker Casillas couldn't catch a cold camping in the Highland winter?\nMoreover, he isn't just a star on the field. He may not be expecting an Oscar to sit alongside his golden balls on the mantle piece, but his self-titled documentary was the preening peacock at his best. A 90-minute peak into an at times vacuous lifestyle, but one solely focused on being the best he can be.\nFor large periods in 2015, Ronaldo has had to carry Real Madrid with the likes of Gareth Bale out of form\nRonaldo (right) with new Real Madrid manager Zinedine Zidane in training at Valdebebas last week\nIt may be arrogant, egotistical and self-centred - where his rippled topless torso is given 12 times as much air-time than six glorious years at Manchester United - but his obsession to be the best is what makes him great.\nHe is Marmite; millions love him, millions hate him. But he generates emotion unlike the impassive Messi - who relies on an increasingly outrageous selection of suits to make waves on the red carpet.\nTwo years ago there were tears of joy when Ronaldo finally broke Messi's four-year grip on the title as the world's best player.\nLast year his ebullient \"SIIII\" celebration brought mockery and memes, but has been copied in grounds around Spain in equal measure by those who love and hate him.\nWho doesn't want to see what weird and wonderful reaction Ronaldo has up his sleeve should he match Messi's four as he promised last January?\nThe rumours over a return to the Premier League refuse to die down because, like his film, Ronaldo is box office. The Premier League was lucky to have him and could do with a dose of his star dust in a season dominated by the big guns' mediocrity.","url":"https://www.dailymail.co.uk/sport/football/article-3393496/Cristiano-Ronaldo-scored-goals-Lionel-Messi-Neymar-carried-team-Ballon-d-personal-glory-Madrid-striker.html"}
