{"authors":["John Downes For Mailonline"],"date_download":"2018-10-23 05:55:54","date_modify":"2018-10-23 05:55:54","date_publish":"2016-01-11 18:45:48","description":"Ballon d'Or 2015 winner Lionel Messi did not pick up another major individual prize in Switzerland on Monday, as Wendell Lira won the Puskas Award.","filename":"data/vaneerConsumption/BallondOr2015PuskasAwardwinnernamedBrazilianWendellLira.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/18/300DC57000000578-0-image-a-27_1452538713134.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3394387_Ballon-d-Puskas-Award-handed-Brazilian-Wendell-Lira-brilliant-team-goal_1540274154.html","title":"Ballon d'Or 2015: Puskas Award winner named Brazilian Wendell Lira","title_page":"Ballon d'Or 2015: Puskas Award winner named Brazilian Wendell Lira | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"WINNERS AT 2015 BALLON D'OR Ballon d'Or: Lionel Messi Women's World Player of the Year: Carli Lloyd Puskas Award: Wendell Lira Men's World Coach of the Year: Luis Enrique Women's World Coach of the Year: Jill Ellis Fair Play Award: All football organsations supporting refugees FIFA/FIFPro World XI: Manuel Neuer; Thiago Silva, Marcelo, Sergio Ramos, Dani Alves; Andres Iniesta, Luka Modric, Paul Pogba; Lionel Messi, Neymar, Cristiano Ronaldo\nBallon d'Or 2015 winner Lionel Messi did not pick up another major individual prize in Switzerland on Monday, as Wendell Lira won the Puskas Award.\nMessi's Copa del Rey final goal for Barcelona against Athletic Bilbao at the Nou Camp failed to be adjudged the Goal of the Year.\nArgentine superstar Messi and Roma's Alessandro Florenzi were beaten to the prize by 27-year-old Brazilian Lira at the Kongresshaus, Zurich ceremony hosted by Northern Irish actor James Nesbitt and Sky Sports News presenter Kate Abdo.\nLira, who now plays for Vila Nova, netted a superb bicycle kick for Goianesia away at Atletico Goianiense on March 11 last year to round off a terrific team goal.\n'It is an honour to be here to get to know famous players I've only seen on the screen before,' Lira said in accepting the award. 'I thank my family and all those who voted for me. I should like to thank my wife and my daughter.'\nLira received 46.7 per cent of the vote, well ahead of Messi's 33.3 per cent and Florenzi's 7.1 per cent. The result was determined by a public vote through FIFA's website, and you can watch all three of the top three goals below.\nVila Nova's Brazilian forward Wendell Lira, formerly of Goianesia, delivers a speech at the Gala\nLira wept after winning the FIFA Puskas Award ahead of Lionel Messi at the Kongresshaus in Zurich\nLira poses for a portrait prior to the FIFA Ballon d'Or Gala 2015 at the Park Hyatt hotel on January 10\nThe 27-year-old held up a portrait of himself having travelled to Switzerland for the Monday ceremony\nMessi of Argentina and Barcelona is interviewed by Ballon d'Or hosts, James Nesbitt and Kate Abdo\nMessi celebrates after scoring in the Copa del Rey Final against Athletic Bilbao on May 30, 2015\nTHE WINNER\nWendell Lira - Atletico-GO vs GOIANESIA, Brazilian Goiano, March 11\nThe team goal of the three, but one that still involved a magnificent finish at the end of it, Lira's strike was a joy to watch.\nAfter playing the ball into a team-mate on the edge of the box, Lira ran through the defence, dummied the return pass, and eventually received a delightful chip with his back to goal.\nBarely breaking stride the Brazilian unleashed a peach of a bicycle kick past the goalkeeper, the perfect end to a wonderful move, which earned his side a 2-1 win.\nTHE RUNNERS-UP\nLionel Messi, BARCELONA vs Athletic Bilbao, Copa del Rey, May 30\nNot only was this a brilliant goal, but the fact that it came in a cup final, to open the scoring, added even more weight to its claim to be the best strike of the year.\nWhen Messi picked the ball up on the right hand side, there was nothing on. Tightly marked, facing towards his own goal, the only option seemed to be to play the ball back to his defenders.\nNot for Messi. He turned past the first defender, beat two more as they came across to cover, burst back past the original opponent, cut inside - beat another man - and then fired in at the near post.\nEven in slow motion it was all over so quickly, with four defenders and a goalkeeper beaten inside a couple of seconds, and an individual goal out of absolutely nothing.\nAlessandro Florenzi - ROMA vs Barcelona, Champions League, September 16\nAfter picking up possession deep inside his own half, Florenzi carried the ball past a couple of Barcelona defenders and up to the halfway line.\nLooking up, the 24-year-old full back saw nothing that interested him, in terms of team-mates making runs, but did spot Barca goalkeeper Marc-Andre ter Stegen off his line.\nShowing not only incredible confidence and vision, but also sensational technique, Florenzi shot from the touchline, 50 yards out, lobbing Ter Stegen and finding the back off the net via the inside of the post.","url":"https://www.dailymail.co.uk/sport/football/article-3394387/Ballon-d-Puskas-Award-handed-Brazilian-Wendell-Lira-brilliant-team-goal.html"}
