{"authors":[],"date_download":"2018-10-22 22:34:26","date_modify":"2018-10-22 22:34:26","date_publish":"2014-05-11 13:19:40","description":"The University of Richmond's undergraduate commencement was scheduled for Sunday afternoon.","filename":"data/vaneerConsumption/BalloonCrashCastsPallOverUniversityofRichmondGraduation.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/434756/140511-balloon-virginia-search-950a_b801b83417098dd3eda73ee87fc47aa7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_hot-air-balloon-accident_balloon-crash-casts-pall-over-university-richmond-graduation-n102476_1540247666.html","title":"Balloon Crash Casts Pall Over University of Richmond Graduation","title_page":"Balloon Crash Casts Pall Over University of Richmond Graduation","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nDOSWELL, Va. -- The University of Richmond community prepared for graduation Sunday with heavy hearts after the revelation that two athletic staff members were aboard a hot air balloon that drifted into a power line, burst into flames and crashed in Virginia.\nUndergraduate commencement was scheduled for the afternoon. Meanwhile, investigators were planning to resume their efforts to scour the woods and fields surrounding the site of Friday's balloon crash for the remains of the third person aboard the balloon.\nTwo bodies have already been found. University administrators said in a news release that associate head coach Ginny Doyle and director of basketball operations Natalie Lewis were two of the three people aboard the balloon that crashed Friday night.\n\"Words cannot begin to express our sorrow,\" Keith Gill, the school's athletic director, said in a news release. \"We are all stunned by the tragic news. Our thoughts and prayers go out to their loved ones.\"\nThe university canceled two weekend baseball games and held a moment of silence at commencement Saturday for its law school.\n-- The Associated Press","url":"https://www.nbcnews.com/storyline/hot-air-balloon-accident/balloon-crash-casts-pall-over-university-richmond-graduation-n102476"}
