{"authors":["John Nolte"],"date_download":"2018-10-30 18:25:14","date_modify":"2018-10-30 18:25:14","date_publish":"2015-04-28 17:36:34","description":"Contrary to the emotional blackmail some leftists are attempting to peddle, Baltimore is not America's problem or shame. That failed city is solely and |","filename":"data/vaneerConsumption/BaltimoreIsaDemocratProblemNotAmericasProblem.json","image_url":"https://media.breitbart.com/media/2015/04/ap_ap-photo1644-1024x683.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_28__1540923914.html","title":"Baltimore Is a Democrat Problem, Not America's Problem","title_page":"Baltimore Is a Democrat Problem, Not America's Problem | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Contrary to the emotional blackmail some leftists are attempting to peddle, Baltimore is not America’s problem or shame. That failed city is solely and completely a Democrat problem. Like many failed cities, Detroit comes to mind, and every city besieged recently by rioting, Democrats and their union pals have had carte blanche to inflict their ideas and policies on Baltimore since 1967, the last time there was a Republican Mayor.\nIn 2012, after four years of his own failed policies, President Obama won a whopping 87.4% of the Baltimore City vote. Democrats run the city of Baltimore, the unions, the schools, and, yes, the police force. Since 1969, there have been only two Republican governors of the State of Maryland.\nElijah Cummings has represented Baltimore in the U.S. Congress for more than thirty years. As I write this, despite his objectively disastrous reign, the Democrat-infested mainstream media is treating the Democrat like a local folk hero, not the obvious and glaring failure he really is.\nEvery single member of the Baltimore city council is a Democrat.\nLiberalism and all the toxic government dependence and cronyism and union corruption and failed schools that comes along with it, has run amok in Baltimore for a half-century, and that is Baltimore’s problem. It is the free people of Baltimore who elect and then re-elect those who institute policies that have so spectacularly failed that once-great city. It is the free people of Baltimore who elected Mayor Room-To-Destroy.\nYou can call the arson and looting and violence we are seeing on our television screens, rioting. That’s one way to describe the chaos. Another way to describe it is Democrat infighting. This is blue-on-blue violence. The thugs using the suspicious death of Freddie Gray (at the hands of a Democrat-led police department) to justify the looting that updates their home entertainment systems, are Democrats protesting Democrat leaders and Democrat policies in a Democrat-run city.\nPoverty has nothing to do with it. This madness and chaos and anarchy is a Democrat-driven culture that starts at the top with a racially-divisive White House heartbreakingly effective at ginning up hate and violence.\nWhere I currently reside here in Watauga County, North Carolina, the poverty level is 31.3%. Median income is only $34,293. In both of those areas we are much worse off than Baltimore, that has a poverty rate of only 23.8% and a median income of $41,385.\nDespite all that, we don’t riot here in Watauga County. Thankfully, we have not been poisoned by the same left-wing culture that is rotting Baltimore, and so many other cities like it, from the inside out. We get along remarkably well. We are neighbors. We are people who help out one another. We take pride in our community, and are grateful for what we do have. We are far from perfect, but we work out our many differences in civilized ways. Solutions are our goal, not cronyism, narcissistic victimhood, and the blaming of others.\nOne attitude we don’t have here is the soul-killing belief that somebody owes us something, which, of course, is a recipe for discontent. Because if you’re not getting what’s owed to you, how can you be anything but angry?\nDemocrats and their never-ending grievance campaigns; their never-ending propaganda that government largess is the answer; their never-ending caves to corrupt unions; their never-ending warehousing of innocent children in failed public schools — that’s a Democrat problem, not America’s problem.\nI might believe Baltimore was an American problem if the city was interested in new ideas and a new direction under new leaders. But we all know that will never happen. After Democrat policies result in despair and anarchy, Democrats always demand more of the same, only bigger.\nAnd the media goes right along.\nAnd things only get worse.\nI wish you all the luck in the world Baltimore. And I truly wish you had the courage to change. If you ever do, send up a flare. Until then, there is nothing anyone can do for you. You are victims of your own choices, and no one can make choices for you but you.\nAs far as the good people of Baltimore trapped by the terrible voting of your fellow citizens, I suggest you buy more guns until you can move to a city not run by those who see rioting as part of the Master Plan.\nFollow John Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/politics/2015/04/28/baltimore-is-a-democrat-problem-not-americas-problem/"}
