{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 21:13:10","date_modify":"2018-10-30 21:13:10","date_publish":"2016-12-21 00:00:00","description":"The bank said it would run out of liquidity in four months, rather than 11 months as investors had previously thought.","filename":"data/vaneerConsumption/BancaMontedeiPaschisharesDecember21.json","image_url":"https://amp.businessinsider.com/images/585a6e51dd0895567f8b48d6-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_banca-monte-dei-paschi-shares-december-21-2016-12_1540933990.html","title":"Banca Monte dei Paschi shares, December 21","title_page":"    Banca Monte dei Paschi shares, December 21 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Shares in Banca Monte dei Paschi di Siena crashed in early trading Wednesday after the bank warned over its ability to meet its day-to-day expenses.\nThe bank said it would run out of liquidity in four months, rather than the 11 months that investors had previously thought.\nShares plummeted and were briefly suspended as a result of the drop. Here is the chart: Investing Monte dei Paschi recovered in midmorning trade, however, and stock was briefly positive after Italy's lower house of Parliament approved plans to borrow up to €20 billion to prop up the ailing banking sector.\nHere's how Monte dei Paschi shares look at close to 11:50 a.m. GMT (6:50 a.m. ET): Investing.com The Italian banking crisis is coming to a head after Matteo Renzi resigned as prime minister earlier this month. Banca Monte dei Paschi, the world's oldest lender and Italy's third-biggest bank, is attempting to raise €5 billion by the end of the year to stay in business.\nThe sector is carrying more than €300 billion in nonperforming loans and may ultimately need an injection of about€52 billion, according to Deutsche Bank analyst Paola Sabbione.","url":"https://www.businessinsider.com/banca-monte-dei-paschi-shares-december-21-2016-12"}
