{"authors":[],"date_download":"2018-10-23 00:48:06","date_modify":"2018-10-23 00:48:06","date_publish":"2017-03-10 07:53:09","description":"Opener Soumya Sarkar scored his second half-century of the match as Bangladesh kept their faint hopes of saving the first Test against Sri Lanka alive in...","filename":"data/vaneerConsumption/BangladeshopenersbadlightkeepLankaatbay.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/14/wire-196549-1489157897-870_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4300256_Sri-Lanka-build-lead-against-Bangladesh_1540255686.html","title":"Bangladesh openers, bad light keep Lanka at bay","title_page":"Bangladesh openers, bad light keep Lanka at bay | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bangladesh batsman Soumya Sarkar (R) plays a shot as Sri Lanka wicketkeeper Niroshan Dickwella looks on during the fourth day of the first Test at the Galle International Cricket Stadium in Galle on March 10, 2017\nOpener Soumya Sarkar scored his second half-century of the match as Bangladesh kept their faint hopes of saving the first Test against Sri Lanka alive in Galle on Friday.\nSet a daunting target of 457 runs, Bangladesh reached 67-0 before bad light brought early stumps on the fourth day with the visiting side still needing 393 runs for an improbable win on the final day.\nSoumya, who made 71 runs in the first innings, led the batting charge with an unbeaten 53 while his opening partner Tamim Iqbal took the unusual role of an anchor, scoring 13 not out.\nThe fourth day's play ended 14 overs early as thick clouds hovered over the ground, much to the frustration of the hosts who were desperate to hammer home their advantage by clinching a wicket in the final session.\nUmpires called off play after Asela Gunaratne conceded three runs off his first ball that was declared a rare back-foot no ball, leaving him with the highly unusual figure of 0-0-3-0.\nSri Lanka declared their second innings at 274-6, just five overs into the session, after local boy Upul Tharanga slammed his third Test century and second against Bangladesh.\nUpul Tharanga was out for 115 as Sri lanka reached 247 for 5 at tea against Bangladesh\nTharanga was out for 115 at the end of a 171-ball innings that featured 11 fours and three sixes before he was bowled by off-spinner Mehedi Hasan.\nLeft-arm spinner Shakib Al Hasan bowled Asela Gunaratne for a duck in the next over and Mehedi dismissed Niroshan Dickwella for 15 to give Bangladesh something to celebrate in another taxing day for the visitors.\nDinesh Chandimal rode his luck after being dropped by Soumya Sarkar at slip on 12 to stay unbeaten on 50 before the declaration came with the dismissal of Dilruwan Perera, who made 33.\nEarlier in the second session, Shakib removed Sri Lanka's first innings hero Kusal Mendis who made 19 before hoisting a catch to Taskin Ahmed at square leg boundary. Mendis scored 194 in the first innings.\nSri Lanka began their second innings in the morning cautiously as they scored 87 runs for the loss of opener Dimuth Karunaratne, who gave a catch to Mahmudullah at square leg off Taskin Ahmed after making 32.\nBut the hosts accelerated in the second session and notched up 160 runs in 31 overs.\nTharanga, who scored just four runs in the first innings, led the way and brought up his century with a single off Shakib.\nHe was satisfied with his effort.\n\"I am pleased. (In the) first innings I couldn´t do much and I wanted do the job for the team today,\" he said after the day´s play.\n\"Our plan was to give them 125 overs. If you take the wicket, more than the other Galle wickets, this doesn't have much turn,\" he added.\nShakib and Mehedi each claimed two wickets for Bangladesh, conceding 104 and 77 runs respectively.\nShakib was cautious about team´s plan on the fifth day.\n\"If we play well in the first session (tomorrow), we can take it from there on,\" he said. \"If we try too many things at the start of the session, we might lose a few wickets and end up losing the game.\"\nBangladesh were all out for 312 runs in their first innings, replying to Sri Lanka's total of 494.","url":"https://www.dailymail.co.uk/wires/afp/article-4300256/Sri-Lanka-build-lead-against-Bangladesh.html"}
