{"authors":[],"date_download":"2018-10-23 03:42:50","date_modify":"2018-10-23 03:42:50","date_publish":"2017-04-26 15:16:29","description":"Bangladesh has approved a project to build hundreds of mosques with almost $1 billion from Saudi Arabia, an official said Wednesday, worrying minorities who...","filename":"data/vaneerConsumption/BangladeshtobuildhundredsofmosqueswithSaudicash.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/15/wire-465705-1493216190-190_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4447992_Bangladesh-build-hundreds-mosques-Saudi-cash_1540266170.html","title":"Bangladesh to build hundreds of mosques with Saudi cash","title_page":"Bangladesh to build hundreds of mosques with Saudi cash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bangladesh has suffered from a rise in extremism in recent years as the moderate Islam worshipped for generations has given way to a more conservative interpretation of the scriptures\nBangladesh has approved a project to build hundreds of mosques with almost $1 billion from Saudi Arabia, an official said Wednesday, worrying minorities who fear they could be used to spread fundamentalist Islam.\nThe government plans to construct 560 mosques -- one in every town in Bangladesh -- as the secular administration woos Islamist groups before elections.\nPrime Minister Sheikh Hasina sought the funds from Saudi Arabia, which will provide the lion's share of the $1.07 billion cost, during a visit to the oil-rich state last year, said planning minister Mustofa Kamal.\nThe centres of worship -- equipped with research facilities, libraries and cultural centres -- would be a \"model\" for worshippers in the Muslim-majority country, said Shamim Afzal, head of the state-run Islamic Foundation.\n\"It is a perfect idea of spreading the true knowledge of Islam,\" he told AFP.\nBut minority groups are less certain, concerned the proliferation of Saudi-backed mosques could spread the ultra-conservative Sunni doctrine of Wahhabism practised in the Gulf kingdom.\nBangladesh has suffered from a rise in extremism in recent years as the moderate Islam worshipped for generations has given way to a more conservative interpretation of the scriptures.\nThe government has ordered a crackdown on homegrown extremist outfits after a series of bloody attacks on secular activists, foreigners and religious minorities.\nRezaul Haq Chandpuri, from a federation representing Sufi Muslims who have been targeted for violence, said there was no justification for these new mosques.\n\"Saudi finance is a concern. They may use their money to promote Wahabism through these mosques,\" he told AFP, adding minorities would feel \"helpless and insecure\".\nBut the scheme could also \"help the government monitor hateful sermons\", a tough task in Bangladesh where it controls few of the 300,000 existing mosques, said leading secular activist Shahriar Kabir.\n\"I think the government should take control of all mosques across the country. That way, it can easily identify where extremism are being promoted,\" he told AFP.\nIn a major concession to Islamist groups ahead of polls, Hasina this month announced her government would recognise degrees from hardline madrassas, paving the way for religious scholars to qualify for public service jobs.\nShe also supported conservative protesters railing against a symbolic statue of justice outside the Supreme Court which they deemed un-Islamic.","url":"https://www.dailymail.co.uk/wires/afp/article-4447992/Bangladesh-build-hundreds-mosques-Saudi-cash.html"}
