{"authors":["Associated Press"],"date_download":"2018-10-23 01:39:15","date_modify":"2018-10-23 01:39:15","date_publish":"2016-01-11 12:42:27","description":"BANGKOK (AP) — Bangkok's main international airport has issued an apology after a snake was found on a luggage cart in the arrival hall and startled passenge...","filename":"data/vaneerConsumption/Bangkokairportapologizesforsnakefoundonluggagecart.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393569_Bangkok-airport-apologizes-snake-luggage-cart_1540258755.html","title":"Bangkok airport apologizes for snake found on luggage cart","title_page":"Bangkok airport apologizes for snake found on luggage cart | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bangkok airport apologizes for snake found on luggage cart\nBANGKOK (AP) — Bangkok's main international airport has issued an apology after a snake was found on a luggage cart in the arrival hall and startled passengers.\nSuvarnabhumi (pronounced \"Suwanapoom\") International Airport, built on land previously known as \"Cobra Swamp,\" said it would like to \"apologize for the incident that frightened passengers\" on Sunday.\nPassengers spotted the snake coiled around the base of the trolley after a female traveler had loaded bags onto it and was preparing to leave the arrival hall, Thai media reported.\n\"After being alerted, security officers captured the snake right away and no passengers were injured,\" Airports of Thailand said in a statement Sunday that described the reptile as \"a small baby snake\" but did not identify the species.\nSnake expert Thanaphong Tawan at a Bangkok snake farm run by the Thai Red Cross Society said the snake appeared to be a non-venomous variety called Dryocalamus davisonii — commonly known as Blanford's bridle snake — based on a picture taken at the airport and published by Thai media.\nThe statement sought to \"reassure that clear and strict measures have been imposed to prevent all poisonous animals from slipping into the airport's buildings\" and said it was believed \"the baby snake managed to slip into the airport because it was very small.\"\nMeanwhile, on the resort island of Phuket, a Chinese tourist was bitten on the nose by a python while leaning in to kiss it on the head while visiting a snake show over the weekend, The Bangkok Post newspaper reported Monday.\nA video of the incident was widely shared on social media, showing the snake striking at the woman's face as a loud scream is heard. Thai media reported that the woman received eight stitches and then flew home.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3393569/Bangkok-airport-apologizes-snake-luggage-cart.html"}
