{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-31 00:35:54","date_modify":"2018-10-31 00:35:54","date_publish":"2016-12-01 00:00:00","description":"The Bank says it didn't know that its new polymer banks notes contained traces of animal fat in them until it was brought to light by recent reports.","filename":"data/vaneerConsumption/BankofEnglandsaysitwillfindsolutiontotallowinfivercontroversy.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bank-of-england-solution-tallow-fiver-bank-note-controversy-vegetarian-vegan-2016-12_1540946154.html","title":"Bank of England says it will find solution to tallow in fiver controversy","title_page":"    Bank of England says it will find solution to tallow in fiver controversy - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Bank of England Governor Mark Carney holds a new plastic £5 note as he visits Whitecross Street market in London. Stefan Wermuth PA Wire/PA Images The Bank of England says it did not know that its new polymer banks notes contained traces of animal fat in them until it was brought to light by recent social media reports.\nThe central bank added in a statement that its supplier Innovia is \"working intensively... towards potential solutions,\" suggesting the Bank is trying to make the notes free from tallow, the animal fat currently used in the production process.\nVegetarians and vegans reacted angrily to the news that animal fat is used in the note, which is the first to be made of polymer and has been touted as Britain's most advanced ever. Over 110,000 people have signed a petition on Change.org calling for tallow to be removed from the new bank notes.\nThe Bank of England responded to the controversy with the following statement, issued late on Wednesday evening:\n\"We are aware of some people's concerns about traces of tallow in our new five pound note. We respect those concerns and are treating them with the utmost seriousness.\n\"This issue has only just come to light, and the Bank did not know about it when the contract was signed.\n\"Information recently provided by our supplier, Innovia, and its supply chain shows that an extremely small amount of tallow is used in an early stage of the production process of polymer pellets, which are then used to create the base substrate for the five pound note.\n\"Innovia is now working intensively with its supply chain and will keep the Bank informed on progress towards potential solutions.\"\nThe new banknote was introduced in September and is the first British note to be made from polymer, a type of plastic. It has been introduced to increase the durability of the notes, as they are now waterproof, harder to tear, and harder to counterfeit.","url":"https://www.businessinsider.com/bank-of-england-solution-tallow-fiver-bank-note-controversy-vegetarian-vegan-2016-12"}
