{"authors":["Jill Ishkanian For Dailymail.Com"],"date_download":"2018-10-23 04:57:31","date_modify":"2018-10-23 04:57:31","date_publish":"2017-03-16 16:03:39","description":"City National sued the couple in December claiming they only paid back half of a $400,000 loan. It also wants another $17,000 that Tori allegedly overdrew from her checking account.","filename":"data/vaneerConsumption/BankfilesdefaultagainstToriSpellingfor188K.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E554FBF00000578-0-image-a-22_1489678920191.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4316996_Bank-files-default-against-Tori-Spelling-188K_1540270651.html","title":"Bank files default against Tori Spelling for $188K","title_page":"Bank files default against Tori Spelling for $188K | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"City National Bank sued Tori Spelling and Dean McDermott last December claiming they took out a $400,000 loan in 2012 but only paid back half.\nNow the bank is tired of waiting for its money and has issued a default judgment against the couple for $188,000. If granted the judgment is binding and could cause the bank to attach any assets Tori and Dean may have.\nCity National Bank sued Tori and Dean in December claiming they took out a $400,000 loan in 2012 only to default on half\nThe couple moved into a sprawling 4,714-square-foot, 1980s-era estate in a gated community in Woodland Hills last December. But the couple rent the five-bedroom, five bathroom, home - for $9,500 a month.\nCity National also wants another $17,000 that 43-year-old Tori allegedly overdrew from her checking account.\nOn September 30, 2016, papers allege, '[Tori Spelling] caused her account to be overdrawn in the amount of $17,149.09. The defendant has not paid back the overdraft.'\nThe hits keep coming for the couple. Just last Thursday , as DailyMail.com exclusively reported, McDermott faced eight counts of contempt and jail time over the claim of his ex-wife that he owed $100,000 in child support payments for his first-born son Jack, now 18\nMcDermott, 50, appeared in an LA court on Thursday to face off with his ex-wife Mary Jo Eustace just a week after wife Tori Spelling gave birth to their fifth child.\nJudge Colin Leis told McDermott: 'What we are looking at here is a criminal case, with eight counts of contempt between July 2016 and January 2017. This is just a scheduling matter for arraignment date.'\nTori and Dean moved for the eighth time in six years to make room for their fifth child together\nThe sprawling 4,714-square-foot, 1980s-era estate is in Woodland Hills, California, just nine miles north of her former rental in Encino. The new home features a swimming pool and tennis court\nThe home features both an indoor and outdoor kitchen, formal dining room, walk-in wine cellar, a grand-scale master bedroom and bathroom with balcony and a 'Hollywood style' pool\nDean was a half hour late to the hearing, telling the family court clerk 'I'm sorry, I was on the wrong floor.'\nThe former spouses did not sit together. Both parties represented themselves. The two went before Judge Leis at 10:15 am.\nThe judge looked at what was before him and proceeded to tell both parties that this was just a day to schedule an arraignment.\n'What we are looking at here is a criminal case, with eight counts of contempt between July 2016 and January 2017. This is just a scheduling matter for arraignment date.'\nMcDermott was read his rights by the judge who asked Dean if he would need a public defender. 'Yes your honor,' Dean responded.\nThe judge proceeded to set date for arraignment and Dean interrupted: 'I'm not contesting any of this, your honor. I've fallen on hard times, she knows this, she's taken this step...'\nThe Judge interrupted, 'Sir this is a criminal proceeding, you could get jail time, community service. I encourage you two to talk in hall to come to some agreement.'\nDean McDermott and ex-wife Mary Jo Eustace talk outside the courtroom last week. She was acting as her own attorney as she accused him of contempt, claiming he owes $100,000 in back child support\nRed faced and sweating, McDermott begged his ex to withdraw her complaint and promised to pay back the money. Mary Jo acquiesced and withdrew her claims with prejudice, mean she can refile at any time if he doesn't pay up the $100,000 in back child support\nRed-faced and sweating, McDermott begged his ex to withdraw her complaint and promised to pay back the money.\nHe said, 'you're St Mary Jo, I can't do anything right. Let's go back to the $1,500 like we had before. I'm humiliated! Do you understand that? I have to protect my family. I'm struggling and you want me to go to jail?\n'You're trying to bury me!' Mary Jo acquiesced and withdrew her claims with prejudice, mean she can refile at any time if he doesn't pay up the $100,000 in back child support\nDean, 50, was married to Canadian TV personality Mary Jo Eustace, 54, for 13 years. They had a biological son Jack, and were in the process of adopting a daughter together (Lola, 11) when he began an affair with his Mind Over Murder co-star Tori Spelling.\nMary Jo chronicled the painful break up in her 2009 book, 'Divorce Sucks: What to do when irreconcilable differences, lawyer fees, and when your ex's Hollywood wife make you miserable.\nIn her best seller, Mary Jo recalled a jubilant Dean telling one of his pals (Michael Olifiers) 'You have no idea what this is going to do for my career! I'm with Tori Spelling now, I'm going to make millions!'\nCanadian TV personality Mary Jo Eustace, 54, was married to McDermott for 13 years. They had a biological son and were in the process of adopting a daughter together when he met ToriDean and Mary Jo Eustace were in the process of adopting daughter Lola, 11, left, when he met and fell in love with Tori. Mary Jo recently revealed that her son with Dean has come out as gay\nDean married Tori, 43, on May 7, 2006, and just six weeks later her TV mogul father Aaron Spelling passed away at age 83, leaving his only daughter a 'paltry' $750,000 of his $600 million fortune.\nTori's mother Candy, 71, remained executor of his estate, and became estranged from the 90201 star for years until just recently.\nDailyMail.com broke exclusive news that Candy had thrown her only daughter a lavish $40,000 baby shower for her fifth grandchild at the Hotel Bel Air on February 11.\nWithout a large inheritance to rely on, it was back to work for the McDermott family (Liam, 9, Stella, 8, Hattie, 5, Finn, 4) on their popular reality series for the Oxygen Network, that ended in 2012.\nLater, a Lifetime series 'True Tori' paid the couple millions for airing the fall out of Dean's 2013 cheating scandal with a Canadian woman while he was working as the host of Chopped Canada.\nEven with the money from the various TV shows coming in, Dean had trouble meeting his financial obligations for Jack.\nMary Jo did some research online and learned that Dean could be in big trouble. In January, went to the Los Angeles Superior Court to file, which cost her only $90.\nShe admitted that seeing Tori and Dean live a lavish lifestyle is hard.\n'To see the discrepancy between Dean's lifestyle and what happens when it comes to his son — who has been told constantly there is no money for basics like education or transportation — is an added psychological hurdle,' she said.\n'To be even gracious this whole time has been challenging,' she also admitted.\nTori and Dean have claimed on and off they are suffering financially.\nIn November, American Express sued over an $87,595 credit card debt and earlier that year they had been been hit with a $259,108 lien for unpaid taxes from 2014.\nTori recently dismissed the idea that they were in trouble, saying people just got that idea from her 2013 book where she talk about some struggles in an attempt to have people relate to her. She also claimed they were living 'paycheck-to-paycheck' in 2014.\nAs far as Jack, she said she's happy he came out and is planning his own life.\n'I think Jack received the gift of being a motivated man,' she said.\n'He is focused on taking care of himself, to never need money from anyone. He is on the honour roll in school and will attend a top university with a $20,000 scholarship. He has a job. He wants to control his life. He saw his dad on TV have a nervous breakdown and doesn't want to be that.\n'Dean and Tori have uprooted him so many times with all their moves. They have conveyed to him such mixed messages about money they had for themselves versus money they had for him. All of this could have led to bad places for Jack, yet instead he finds joy in all situations. I'm so proud of him.'\nThis is not the first time Dean has been accused of owing money for child support.\nDean does not pay support for adopted daughter Lola, 10.\nThe pair were in the process of adopting Lola and had even met the infant when Dean revealed he was having an affair with Tori and he subsequently gave up his parental rights to the baby.\nTori and Dean did not respond to requests for comment.","url":"https://www.dailymail.co.uk/news/article-4316996/Bank-files-default-against-Tori-Spelling-188K.html"}
