{"authors":["Andrew Macaskill","Anjuli Davies"],"date_download":"2018-10-30 23:03:06","date_modify":"2018-10-30 23:03:06","date_publish":"2016-12-09 00:00:00","description":"Large banks in Britain want the UK government to allow their industry to remain subject to EU laws for up to five years after Brexit.","filename":"data/vaneerConsumption/BanksstillwanttobeunderEUruleforupto5yearsafterBrexit.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_r-exclusive-banks-want-to-be-subject-to-eu-laws-for-five-years-in-post-brexit-deal-2016-12_1540940586.html","title":"Banks still want to be under EU rule for up to 5 years after Brexit","title_page":"    Banks in Britain want to remain under EU law for 5 years post-Brexit - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"London. Pixabay LONDON (Reuters) - Large banks in Britain want the UK government to allow their industry to remain subject to EU laws for up to five years after Brexit, a move likely to enrage eurosceptics who want to break away from the bloc's legal system as soon as possible.\nThe banks - international players - are also pressing the government to allow the European Court of Justice to rule on decisions related to their businesses during that period, according to a document reviewed by Reuters.\nThe document was drawn up by law firms on behalf of banks lobbying the government for a departure in stages from the EU.\nIt has the support of major banks, has been shared with the Treasury and is the most detailed request yet by Britain's financial industry for a transitional period to give it longer to adapt to Brexit, bankers said.\nThe Treasury declined to comment on the document.\"The report has been received as a fairly serious piece of work. It focuses on the legal underpinning of a transitional arrangement,\" according to one banker at a large international firm. \"It's a heavyweight legal piece of work.\"\nThe British government is currently divided on whether to support demands for transitional arrangements - and if so, in what form - reflecting diverging views about the best way to leave the EU and concerns about a backlash from those who campaigned and voted for Brexit.\nWhile some Treasury officials are backing the move, the Brexit minister David Davis and Prime Minister Theresa May are yet to commit publicly to supporting any deal. The Treasury said in a statement finance minister Philip Hammond is closely listening to the financial sector's views.\nREUTERS/Toby Melville The Department for Exiting the European Union referred Reuters to the Treasury for comment. The document warns of the potential shock to the British and European economy from a loss of critical financial services if banks do not secure a transition phase beyond the two-year withdrawal period that will begin when the government invokes Article 50 of the EU's Lisbon Treaty.\nIf no transition deal is agreed, there is a risk that some banks may not be able to move parts of their operations out of Britain or set up new British subsidiaries in time, the document says, running the risk that the banks may have to halt their EU business activities abruptly.\nIt would normally take banks as long as three years to relocate operations, according to the document, but due to the large number of firms seeking to do this simultaneously regulators may be flooded with requests, slowing down the process.\n\"Transitional arrangements are likely essential,\" the document says. \"This is important in order to avoid potential damage to the \"real economy\" that is reliant upon uninterrupted access to financial services.\"\nThe demands for special treatment for an industry scorned by Britons since the financial crisis may put it on a collision course with swaths of the public and politicians who voted for Brexit because they wanted Britain to regain control of its law.\nOpposition\nHardline supporters of Brexit are opposed to any transitional arrangement worrying it could become permanent as final trading terms can take years to agree.\nRichard Tice, co-chairman of the Leave Means Leave campaign, which is pushing for a so-called \"hard Brexit,\" where Britain leaves the EU's single market in order to impose controls on immigration, said the banks are exaggerating the potential disruption.\n\"This is a nonsense. It is just the banks, frankly, not dealing with the issue,\" he said. \"The country voted for change and the sooner they wake up and accept it the better.\"\nPro-Europe demonstrators protest during a \"March for Europe\" against the Brexit vote result earlier in the year in London. Thomson Reuters The document was drawn up by three of Britain's biggest law firms - Linklaters, Freshfields and Clifford Chance - and says it is \"intended to provide technical support to those developing a negotiating position for the UK.\"All the law firms declined to comment.\nFinancial services firms face some of the biggest challenges of all sectors responding to the vote to leave the EU because large areas of their businesses are governed by passporting rules, which allow them to operate across Europe.\nFinance accounts for about 10 percent of Britain's economy, a larger share than in other big economies, highlighting its importance as the government embarks on talks that may determine if it remains a leading global financial center for years to come.\nThe document argues that Britain must secure an agreement with Brussels - around the time of triggering Article 50 - for a period of delay following the two-year exit process for it to have any impact. The document says the transitional deal should last a minimum of between 3 to 5 years.\nIt says for any transitional deal to be accepted it would require the British government to accept EU law in financial services for the duration of any deal. The document also suggests that the European Court of Justice - one of the most detested institutions by British eurosceptics because it can override UK courts - would most likely have to govern any disagreements that arise during the transition. \"We well understand the political sensitivity to that proposition,\" the document says.","url":"https://www.businessinsider.com/r-exclusive-banks-want-to-be-subject-to-eu-laws-for-five-years-in-post-brexit-deal-2016-12"}
