{"authors":["Katie French For Mailonline"],"date_download":"2018-10-23 03:50:05","date_modify":"2018-10-23 03:50:05","date_publish":"2017-03-16 14:53:31","description":"This is all that remains of the famous Banksy mural 'spy booth' (pictured) which was once worth £1million. It collapsed off a Cheltenham building last year and now appears to be for sale on Facebook.","filename":"data/vaneerConsumption/BanksysspyboothforsaleonFacebook.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54F42200000578-0-image-a-23_1489675912792.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320364_Banksy-s-spy-booth-sale-Facebook_1540266605.html","title":"Banksy's ‘spy booth’ for sale on Facebook","title_page":"Banksy's ‘spy booth’ for sale on Facebook  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The remains of a famous Banksy artwork which was once worth a million pounds appears to be up for sale after it was accidentally destroyed by a builder.\nThe mural, satirising government surveillance, appeared overnight in April 2014 on the side of a Georgian end-terrace home in Cheltenham, Gloucestershire - just a few miles from GCHQ where the UK's surveillance network is based.\nBut it was reduced to a pile of rubble last summer when builders worked on the wall above the artwork and it collapsed while it was being moved.\nNow the pieces have been put up for sale on social media for an undisclosed fee.\nDestroyed: These pieces (pictured) are all that remains of Banksy's political 'spy booths' which was sprayed onto the side of a home in Cheltenham, close to the head quarters of Britain's security services GCHQ\nFor sale: The remains of the famous 'spy booth' Banksy appear to be up for grabs after a mystery man posted to Facebook (above) that he had the artwork in his possession and was considering 'serious offers'\nThe owner of the listed home David Possee took the remains to the council for safekeeping, but today the authority said they had been handed back to him.\nThe seller 'G-City Graf Slaps' claims the pieces - depicting three spies' faces - were 'saved' and are now for sale to people making 'serious offers'.\nThe advert said: 'I have been given the opportunity to sell these original Banksy pieces on the open market.\n'Originally located near GCHQ Cheltenham. Due to local government being a load of tw**s, this original had to be removed from wall.\n'Pic shows what was saved. These three are up for sale. Can be confirmed with letter of home owner and press releases. Serious offers only.'\nThe artwork has been defaced and vandalised several times and the council granted the building Grade II listed status in 2015 to protect it from further damage.\nBig Brother is listening: Banky's piece, once estimated to be worth £1million, showed three 1950s-style agents, using devices to tap into conversations at a telephone box before it was reduced to rubble\nBut home owner David said it became a problem because he was then unable to rent the house out - leaving him struggling financially.\nThe art was accidentally destroyed after builders attempted to remove rendering on the same wall in August 2016.\nDavid loaded up the destroyed artwork in the back of his van and took it to Cheltenham Borough Council.\nA spokesman for the authority said: 'When the investigation was closed, the pieces that were being held by the borough council were given back to the owner.\n'The render and any associated 'Banksy' is not and never was in the ownership of the council.\n'At the time of giving the pieces back to the property owner, he was encouraged to speak with The Wilson, Cheltenham's art gallery and museum.'\nSpeaking at the time, a builder at the site said his colleague was supposed to remove render to within 3ft of the art but it all began collapsing as he worked on it.\nHe said: 'The render had to come down to a certain point so the plasterers could start on Monday.\n'The render had all blown away and had damp behind it. It's been left for two-and-a-half years.\n'It's become derelict. The owner couldn't fix it up to have tenants in because the council said it was listed.\n'The labourer was told to go down to a point where it was safe above the Banksy. He was just following instructions.\n'He hasn't done anything wrong per say, any other building he would have done a good job.\n'He was told to take the render down, about 3ft away from the Banksy. He was asked to chip it down to a point where it was safe.\n'I got a text at 12am Sunday morning saying it had happened.\nCheltenham MP Alex Chalk said at the time that the town needed answers into what had gone wrong.\nThe mural had been repeatedly subjected to vandalism since being painted on the home, which went on the market in January 2016 for £210,000.\nFurious Banksy supporters were outraged and took to social media to describe their shock.\nLaToya Howe wrote: 'Can't believe it's gone! Only in Gloucestershire do we destroy such an important piece of art work, it's horrendous.'\nRichard Knight suggested: 'What a disgrace could have been protected by a big thick sheet of toughened glass.'","url":"https://www.dailymail.co.uk/news/article-4320364/Banksy-s-spy-booth-sale-Facebook.html"}
