{"authors":["Melissa Ruggieri"],"date_download":"2018-10-30 18:38:16","date_modify":"2018-10-30 18:38:16","date_publish":"2016-03-09 18:02:29","description":"The blinds are drawn at Street Execs Studios.","filename":"data/vaneerConsumption/BankrollFreshshootingOnelifelostisonetoomany.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/MyAJC/2016/03/09/Images/WPIMAGE_cmgajcmusic_6214.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_music_bankroll-fresh-s_b243ce220537cb6ea9b76222196481e5__1540924696.html","title":"Bankroll Fresh shooting: 'One life lost is one too many'","title_page":"Bankroll Fresh shooting: 'One life lost is one too many'","title_rss":"NULL","source_domain":"ajc.com","text":"The blinds are drawn at Street Execs Studios.\nThe fenced-in parking lot, accessible only by electronic keypad, is empty on Wednesday afternoon. The only movement is the fluttering of a forlorn-looking basketball hoop near the back staircase that leads into the building.\nIn front, a wilted clutch of flowers and a few blue candles lay in a heap in the middle of a parking spot, a makeshift memorial to the Atlanta rapper who died on the premises late Friday night in a hail of gunfire.\nBankroll Fresh, born Trentavious White, was part of 2 Chainz’s crew, along with other rising names in hip-hop such as Travis Porter, Young Dolph and CAP 1.\nHis funeral will be held Saturday; no other details have been released.\nPolice are still looking for the shooter who unloaded 50 rounds at the studio at 1740 Defoor Place N.W. last weekend, killing the 28-year-old rapper who 2 Chainz said had “infinite potential.”\nLocal hip-hop mogul T.I praised Bankroll on Instagram. “U was a real1 who always came from a real place,” he wrote.\nBankroll Fresh was known for his collaborations with Gucci Mane, Future and 2 Chainz, and last year released the mixtape, \"Life of a Hotboy 2.\"\nThe Street Execs surroundings on Defoor Place are typical industrial-suburban. Dog Days, a dog daycare center, is its neighbor. Across the street, a hat store and event lounge attract moderate traffic.\nTellingly, a “No Loud Music” sign is tacked on the fence surrounding the studio, its message frequently ignored according to a raft of calls to the Atlanta Police Department in the past 12 months.\nMore than a dozen noise complaints from the property were reported since March 2015, shortly after Street Execs opened at that location, as well as a handful of calls regarding fights, illegal drugs and illegal parking. On Nov. 2, 2015, APD fielded a call after shots were fired at the studio.\nAnd then came the Friday call at 11:01 p.m. to report a “person shot.”\nThese incidents have made residents in the surrounding Underwood Hills neighborhood – a placid community dotted with ranch houses and a new apartment development – uneasy. Their consensus is that Street Execs should relocate their business.\n“This isn't just a quality of life issue, although it absolutely is, but this is a life or death matter. One life lost is one too many,” said Kristin Olson, president of the Underwood Hills Neighborhood Association.\nOn Tuesday night, the association held a meeting attended by about 80 people, including Atlanta City Councilman Andre Dickens and Councilwomen Felicia Moore, Mary Norwood and Yolanda Adrean, as well as representatives from the Atlanta Police Department and business owners and residents from nearby neighborhoods.\nEarlier this week, Dickens told the Atlanta Journal-Constitution that he wants Street Execs shut down.\n“After giving them a second chance, now I’m on the side of the community where we were before in saying this type of activity cannot be in our neighborhoods,” Dickens said.\nCurrently, the studio has ceased all studio recording operations. Representatives say they will work with law enforcement officials on the investigation into Bankroll Fresh’s death.\nFollow the AJC Music Scene on Facebook and Twitter.","url":"https://www.ajc.com/blog/music/bankroll-fresh-shooting-one-life-lost-one-too-many/GlvkH1JtMlANb7GPCltvXN/"}
