{"authors":["Press Association"],"date_download":"2018-10-23 02:18:02","date_modify":"2018-10-23 02:18:02","date_publish":"2017-03-16 12:43:09","description":"Eight of nine policymakers voted to keep rates at their current level.","filename":"data/vaneerConsumption/Bankkeepsinterestratesat025butdecisionsplitamidinflationfears.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/12/wire-228351-1489668200-126_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4320084_Bank-keeps-rates-0-25-decision-split-amid-inflation-fears_1540261082.html","title":"Bank keeps interest rates at 0.25% but decision split amid inflation fears","title_page":"Bank keeps interest rates at 0.25% but decision split amid inflation fears | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Bank of England has kept interest rates on hold at 0.25%, but mounting concern over surging inflation saw one policymaker vote for a hike in the first split decision since last July.\nMinutes of the Monetary Policy Committee (MPC) meeting showed that while eight members backed the no-change decision, outgoing rate-setter Kristin Forbes voted for a rise to 0.5%.\nMPC holds #BankRate at 0.25%, maintains government bond purchases at £435bn and corporate bond purchases at £10bn. pic.twitter.com/Ag0AAlciOT — Bank of England (@bankofengland) March 16, 2017\nMs Forbes, who leaves at the end of June, made the move amid fears that inflation is “rising quickly and was likely to remain above target for at least three years”, according to the report.\nPolicymakers left interest rates at 0.25% in the face of potential economic upset from Brexit negotiations\nWhile it marks the first non-unanimous vote since last summer, it also comes as the first call for a rate increase since January 2016.\nThe MPC decision is the last before Article 50 is triggered later this month and policymakers were widely expected to leave rates at 0.25% in the face of potential economic upset from Brexit negotiations.\nMonetary policy summary and minutes of the MPC meeting ending on 15 March 2017 https://t.co/3bDRb4jXlr #BankRate — Bank of England (@bankofengland) March 16, 2017\nBut the move by Ms Forbes suggests growing unease at keeping rates at rock bottom amid soaring inflation from the weak pound and surprisingly resilient growth.\nMinutes of the meeting showed the Bank is pencilling in growth of around 0.6% in the first three months of the year, following 0.7% expansion in the previous quarter.\nThe report added: “Although it was too early to make a confident prediction of growth in the second quarter, there had been relatively little evidence so far from the output indicators of a slowdown.”","url":"https://www.dailymail.co.uk/wires/pa/article-4320084/Bank-keeps-rates-0-25-decision-split-amid-inflation-fears.html"}
