{"authors":["John Maxfield","The Motley Fool"],"date_download":"2018-10-30 20:55:30","date_modify":"2018-10-30 20:55:30","date_publish":"2016-12-23 00:00:00","description":"Even modest increases in rates would provide meaningful boosts to Bank of America's top and bottom lines.","filename":"data/vaneerConsumption/BankofAmericadidntwasteanytimeraisingitsowninterestrates.json","image_url":"https://amp.businessinsider.com/images/55b02f8a2acae7cc3f8b6a6b-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bank-of-america-didnt-waste-any-time-raising-its-own-interest-rates-2016-12_1540932930.html","title":"Bank of America didn't waste any time raising its own interest rates","title_page":"    Bank of America didn't waste any time raising its own interest rates - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"REUTERS/Shannon Stapleton Bank of America has been waiting for the Federal Reserve to raise interest rates for years. So when the central bank went ahead and hiked the fed funds rate last week, Bank of America didn't waste any time in its response.\nOn Wednesday, almost simultaneous with the Fed's announcement of a 25 basis point hike, Bank of America announced that it was increasing its prime lending rate from 3.5% to 3.75%. This is the lowest rate at which it will lend to its most creditworthy customers, typically multinational corporations.\nIt wasn't alone in doing so. Among other banks that followed suit were JPMorgan Chase, Wells Fargo, Citigroup, and U.S. Bancorp.\nBank of America raises its prime rate\nThe actual increase in Bank of America's prime rate was marginal -- like the Fed's, only 25 basis points -- but this doesn't detract from the move's importance.\nWhen a bank makes a loan, it's essentially selling money. The price at which it does so is dictated by prevailing interest rates. It follows that as interest rates rise, banks earn more revenue and profit from lending money.\nYou can get sense for this by comparing how much Bank of America charged for loans before interest rates plummeted eight years ago to how much it charges today. In the fourth quarter of 2006, its loan portfolio yielded 7.42%. Fast-forward to the third quarter of this year, and the yield on Bank of America's loan portfolio had dropped to 3.73%.\nIf Bank of America's loan portfolio yield was the same today as it was in 2006, the North Carolina-based bank's interest income would be $8.3 billion higher. And because that's high-margin revenue -- you don't have to hire more employees or build more branches to earn those extra dollars -- most of that revenue would fall to Bank of America's bottom line as profit, as much as doubling its current earnings.\nA sign hangs above a Bank of America branch in the Financial District on November 1, 2011 in Chicago, Illinois. Bank of America Corp. has reportedly announced they will drop its plan to charge customers a $5-per-month fee for making purchases with their debit cards. Scott Olson/Getty Images\nBank of America's interest rate sensitivity\nIt probably goes without saying, but we're a long way from seeing interest rates double. Yet even modest increases in rates would provide meaningful boosts to Bank of America's top and bottom lines.\nAs of Sept. 30, a 100 basis point, or one percentage point, increase in short- and long-term rates would boost Bank of America's net interest income over the next 12 months by $5.3 billion. That's more than any other bank stands to benefit under that scenario.\nThe Fed helped in this regard, increasing short-term rates by 25 basis points last week. But even more significant from Bank of America's perspective has been the rapid ascent of long-term rates. The yield on 10-year Treasury bonds, the primary long-term interest rate benchmark in the United States, climbed from 1.6% at the beginning of November to around 2.6% today, an increase of 100 basis points.\nViewed from this perspective, it should be clear to investors why Bank of America's decision to raise its prime rate is an auspicious sign of things to come.","url":"https://www.businessinsider.com/bank-of-america-didnt-waste-any-time-raising-its-own-interest-rates-2016-12"}
