{"authors":["David Scutt","Business Insider Australia"],"date_download":"2018-10-30 23:11:16","date_modify":"2018-10-30 23:11:16","date_publish":"2018-07-23 00:00:00","description":"Economists at Bank of America Merrill Lynch believe President Donald Trump will continue to target China on trade until US stocks or his presidential approval rating begins to take a hit.","filename":"data/vaneerConsumption/BankofAmericaTrumpstockstweetspredictfutureofChinatradewar.json","image_url":"https://amp.businessinsider.com/images/5b50cf5601180c1e008b46e5-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bank-of-america-trump-tweets-predict-future-of-the-trade-war-2018-7_1540941076.html","title":"Bank of America: Trump stocks tweets predict future of China trade war","title_page":"    Bank of America: Trump stocks tweets predict future of China trade war - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"President Donald Trump. Jae C. Hong/AP Images\nPresident Donald Trump is a prolific Twitter user who likes to tweet about the US stock market, particularly when it is moving higher.\nHe also doesn't mind tweeting about his presidential approval rating.\nTrump also doesn't mind voicing his concerns about global trade, particularly when he feels the playing field isn't level for US exporters.\nGiven the three topics mentioned above — stock levels, approval ratings, and trade — economists at Bank of America Merrill Lynch have a come up with a theory as to whether trade tensions between China and the United States will increase or decrease.\nMuch depends on whether the trade conflict begins to drag on stocks or Trump's approval rating ahead of US midterm elections in November.\n\"The US is likely to continue to take measures against its trading partners until the equity markets respond or there is a dip in the president's approval rating,\" the BAML economists Aditya Bhave, Ethan Harris, and Helen Qiao said.\nWith US stocks at or moving back toward the record highs struck earlier this year, Trump said late last week that he was prepared to slap all Chinese goods entering the United States with new tariffs.\n\"I'm ready to go to 500,\" Trump told CNBC, referring to the dollar value of US imports from China last year.\n\"I'm not doing this for politics — I'm doing this to do the right thing for our country. We have been ripped off by China for a long time.\"\nShould Trump look to slap tariffs on all Chinese goods entering the US, a steep increase on the $250 billion worth of Chinese goods that already have been hit with or are under consideration for tariffs, it would create something of a challenge for Chinese policymakers given the value of US exports entering China last year was close to one-fourth those going in the other direction.\n\"China's reply to the latest proposed measures — proposed tariffs on $US200 billion worth of Chinese imports — has been hesitant,\" Bhave, Harris, and Qiao said.\n\"Chinese officials have pledged to retaliate, but the exact nature of the retaliation has not been announced. One issue is that China imports only about $US130 billion worth of goods from the US.\n\"Since it has already imposed or promised higher tariffs on over $US50 billion of US goods, it has limited room to raise tariffs further.\"\nWhat to do when you don't have the ability to respond in a true tit-for-tat manner?\nBhave, Harris, and Qiao think China has three options should the US introduce tariffs on all Chinese goods: slap bigger tariffs on US imports, capitulate to US demands, or start a war of attrition.\nThe three think increasing tariffs to match the total US penalties on a much smaller number of goods is unlikely, acknowledging this would mean \"reordering of supply chains which would impose additional costs on the Chinese economy\" and \"negatively affect China's image as an economy that is opening up and reforming.\"\nBAML also views China as unlikely to roll over to US demands, especially when there's popular support for a tough response to the US trade tariffs.\nAs such, Bhave, Harris, and Qiao believe the most likely scenario is a war of attrition developing between the two sides.\nThey explained:\n\"China will probably adopt a 'middle path' of engaging the US in a war of attrition. We expect some retaliatory tariffs, but in smaller amounts than the US measures. Greater restrictions and regulations on US companies operating in China are also likely. Additionally, policymakers might become more tolerant to renminbi depreciation, although they are unlikely to weaponize the currency.\n\"Along with the 'stick' of retaliation, China might also offer the 'carrot' of modest concessions. Of the compromises listed above, greater imports from the US and intellectual property protection measures are likely on the table, not least because China was leaning towards these reforms even before trade tensions started to escalate.\n\"With its carrot-and-stick trade policy and domestic easing measures in place, we think China will go into wait-and-see mode. In our view, Chinese policymakers think they can outlast the US, holding out until the US equity market corrects or the 'sticker shock' effect of the tariffs starts to impact public opinion in the US.\"\nWhile this may sound like a palatable outcome for financial markets, the three BAML economists believe it will not be without risk.\n\"In a war of attrition, there is scope for miscalculation,\" the three said. \"Our game-theoretic analysis of trade negotiations suggests that visible pain is the motivator for de-escalation and compromise.\"\nBAML added that a miscalculation from either side would be costly for consumers and businesses alike, saying investors should \"buckle up\" should such a policy misstep ensue.","url":"https://www.businessinsider.com/bank-of-america-trump-tweets-predict-future-of-the-trade-war-2018-7"}
