{"authors":["John Maxfield","The Motley Fool"],"date_download":"2018-10-30 22:17:30","date_modify":"2018-10-30 22:17:30","date_publish":"2016-12-13 00:00:00","description":"The bank has $439 billion worth of seemingly \"free money\" accrued from checking and other types of non-interest-bearing accounts.","filename":"data/vaneerConsumption/BankofAmericahasoneadvantageoverotherbanksthatdatesbacktoitsorigins.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bank-of-america-has-one-advantage-over-other-banks-that-dates-back-to-its-origins-2016-12_1540937850.html","title":"Bank of America has one advantage over other banks that dates back to its origins","title_page":"    Bank of America has one advantage over other banks that dates back to its origins - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Chris Keane/ Reuters\nWhen it comes to competitive advantages, Bank of America has a huge one.\nAs of the third quarter of this year, it had $439 billion worth of seemingly free money that it can (and does) invest in interest-earning assets -- principally, loans and government bonds.\nWhat is this free money, you ask? It's what Bank of America's customers have stashed away in checking and other types of non-interest-bearing accounts.\nHowever, even though these deposits don't carry a direct cost, there is an indirect cost associated with gathering them up.\nOther peoples' money\nBank of America isn't the only bank that has access to these types of funds. Every one of its competitors does too. But what distinguishes Bank of America in this regard is that it has more noninterest-bearing deposits than any other bank in the United States.\nThis advantage traces back to Bank of America's origin. It was founded at the beginning of the twentieth century to serve individual consumers, who had largely been ignored up until that point by the nation's other leading banks, which focused on commercial customers.\nFast forward to today and this is the reason Bank of America is primed to earn so much more money than other banks when interest rates rise. When this happens, which could be any day now, the North Carolina-based bank will be able to charge higher rates for its loans, while the cost of its massive hoard of interest-bearing deposits will stay the same, at zero.\nGetty Images / Justin Sullivan\nBank of America CEO Brian Moynihan addressed this very point at the 2016 Goldman Sachs U.S. Financial Services Conference last week:\nThe real key is the floating rate parts [or our asset portfolio] move with base rates immediately, and that gets you more [interest income]. And then what really drives the value [from a rate hike] is $500 billion of free deposits. They don't go up or down. It'll be free.\nThis is great for Bank of America's shareholders, as there's every reason to believe at this point that interest rates will soon rise.\nFree money isn't necessarily free\nYet, as Moynihan addressed earlier in his presentation, it's a little misleading to assume that even non-interest-bearing deposits are in fact entirely free. This is because Bank of America has to operate an enormous branch network to attract the funds.\nBank of America has just over 4,600 branches. That's down from the roughly 6,000 that it had when Moynihan took over in 2010, but it's still a lot of real estate that has to be manned by employees. When you factor this into the equation, there's a clear cost associated with what otherwise seems to be free money.\nIf you spread the cost of Bank of America's consumer bank over its deposit base, it comes out on an annualized basis to about 1.6% of its total deposits. Consequently, even its free deposits aren't exactly free.\nThe fact nevertheless remains that Bank of America will still benefit more from higher rates than its peers, who bear similar operating costs to attract deposits. This is because, as rates rise, Bank of America's operating costs should stay the same. Thus it'll earn more money without having to spend more to do so.\nIt's for this reason that most of the added revenue from higher interest rates will, according to Moynihan, \"fall to the bottom line.\"","url":"https://www.businessinsider.com/bank-of-america-has-one-advantage-over-other-banks-that-dates-back-to-its-origins-2016-12"}
