{"authors":["Will Martin"],"date_download":"2018-10-30 22:46:52","date_modify":"2018-10-30 22:46:52","date_publish":"2018-07-30 00:00:00","description":"Speaking in a lengthy interview with Bloomberg's Stephanie Flanders, Carney said it was entirely obvious before the vote that the pound would tank, inflation would sharply increase, and economic growth would slow down in the event of leave winning.","filename":"data/vaneerConsumption/BankofEnglandGovernorMarkCarneyonBrexitpredictions.json","image_url":"https://amp.businessinsider.com/images/5b5ed8e5a592a51a008b4904-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bank-of-england-governor-mark-carney-brexit-predictions-2018-7_1540939612.html","title":"Bank of England Governor Mark Carney on Brexit predictions","title_page":"    Bank of England Governor Mark Carney on Brexit predictions - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The Governor of the Bank of England, Mark Carney, speaks to the Scottish Economics Forum, via a live feed, in central London, Britain March 2, 2018. Reuters/Peter Nicholls\nLONDON — Predicting the immediate fallout from Britain's vote to the leave the European Union in June 2016 was \"probably the easiest call I've seen in macro in 25 years,\" according to Bank of England Governor Mark Carney.\nSpeaking in a lengthy interview with Bloomberg's Stephanie Flanders, Carney said it was entirely obvious before the vote that the pound would tank, inflation would sharply increase, and economic growth would slow in the event of Britain voting to leave the EU.\n\"We did think... that the exchange rate would go down,\" he said. \"We took a lot of heat for saying that in advance, but it was the easiest call one could make, probably the easiest call I've seen in macro in 25 years in terms of what was going to happen to the exchange rate if the vote went a certain way. It did.\"\nThe Bank of England and Carney, in particular, were heavily criticised for their downbeat forecasts ahead of the referendum of what would happen in the event of a leave vote. Carney's forecasts included a possible technical recession. Brexit-backing Conservative MP Jacob Rees-Mogg accused Carney of \"fundamentally\" undermining \"the standing of the Bank of England\" with his predictions.\nAlthough a recession did not materialise, the rest of the bank's forecasts were fairly accurate.\n\"We thought inflation was going to rise, we thought the economy would slow. And all of those have transpired,\" he told Bloomberg. \"Every prediction, every forecast, every comment in that environment has been amplified.\"\nAlthough Carney did make an explicit suggestion that Brexit will fundamentally weaken the British economy, he made clear that the Bank of England is in the process of planning for what it refers to as a \"disorderly\" Brexit, which is believed to be Bank-speak for a no deal outcome.\n\"Within nine months we could have a disorderly Brexit stress test,\" he said. \"We have a responsibility, at a minimum, to manage through the downside if there were a disorderly outcome, something unpredictable.\"\nCarney said he now dedicates around 50% of his working life to Brexit planning and suggested that the Bank of England may be more prepared for Brexit than the Treasury.\nDuring the interview, Flanders asked if the bank had \"done a lot more preparation in terms of hours than the Treasury?\" Carney replied: \"I suspect that's probably right. We can compare time sheets afterwards.\"","url":"https://www.businessinsider.com/bank-of-england-governor-mark-carney-brexit-predictions-2018-7"}
