{"authors":["Will Martin"],"date_download":"2018-10-30 22:11:01","date_modify":"2018-10-30 22:11:01","date_publish":"2016-12-15 00:00:00","description":"The Bank of England left its key interest rate unchanged at 0.25%.","filename":"data/vaneerConsumption/BankofEnglandDecemberinterestratedecisionandminutes.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bank-of-england-december-interest-rate-decision-and-minutes-2016-12_1540937461.html","title":"Bank of England December interest rate decision and minutes","title_page":"    Bank of England December interest rate decision and minutes - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Getty LONDON — The Bank of England left monetary unchanged at the December meeting of its Monetary Policy Committee, it was announced on Thursday.\nThe bank left its key interest rate unchanged at 0.25%, a record low that has been in place since rates were cut in August following the UK's vote to leave the European Union.\nThe MPC voted 9-0 in favour of leaving rates unchanged, as well as leaving the bank's quantitative easing programme unchanged at a maximum of £435 billion — a combination of the £375 billion of QE completed before August, and the £60 billion announced post-Brexit vote.\nBoth decisions were in line with the pre-release forecasts of economists and reflect consensus in the markets.\nAnything other than a unanimous vote to leave rates unchanged would have been a significant surprise, and focus is instead on the minutes of the MPC's meeting.\nAt the December meeting, the BoE reiterated that is has moved away from a bias to more easing (in the form of further rate cuts and QE) and towards a neutral stance, meaning that rates could go either way. That was as a result of better than expected economic data coming out of the UK since the Brexit vote.\n\"Earlier in the year, the Committee noted that the path of monetary policy following the referendum on EU membership would depend on the evolution of the prospects for demand, supply, the exchange rate, and therefore inflation. This remains the case. Monetary policy can respond, in either direction, to changes to the economic outlook as they unfold to ensure a sustainable return of inflation to the 2% target,\" the bank's statement said.\nThe MPC also confirmed the stance that it is willing to allow inflation to run above target in the future if it is required in order to protect jobs and growth, but that there are limits to that overshoot, saying:\n\"Equally, there are limits to the extent to which above-target inflation can be tolerated. Those limits depend, for example, on the cause of the inflation overshoot, the extent of second-round effects on domestic costs, the evolution of inflation expectations, and the scale of the shortfall in economic activity below potential.\"\nWhile acknowledging that it will tolerate an overshoot, the bank said it now expects inflation to run a lottle lower than it forecast at its last meeting in November, saying in its statement:\n\"Since the Committee's previous meeting, sterling's trade-weighted exchange rate has appreciated by over 6%, while dollar oil prices have risen by 14%. All else equal, this would result in a slightly lower path for inflation than envisaged in the November Inflation Report, though it is still likely to overshoot the target later in 2017 and through 2018.\"\nCommenting on the Old Lady of Threadneedle Street's announcement, Ian Shepherdson, chief economist at Pantheon Macroeconomics said:\n\"No real surprises in the minutes; the MPC repeated its November points that policymakers have \"limited tolerance\" for above-target inflation, and that rates can move in either direction in response to the evolving outlook, which remains very uncertain, not least because the scale of U.S. fiscal easing next year is unknown.\"\nThe pound dropped a little on the announcement, moving lower from 1.2485 to 1.2460 against the dollar. Here's the chart:","url":"https://www.businessinsider.com/bank-of-england-december-interest-rate-decision-and-minutes-2016-12"}
