{"authors":[],"date_download":"2018-10-22 23:35:09","date_modify":"2018-10-22 23:35:09","date_publish":"2016-01-29 11:50:27","description":"Japan's central bank shocked markets Friday with plans to effectively charge lenders to park their cash with it, ramping up a long-running battle to kickstar...","filename":"data/vaneerConsumption/BankofJapansurpriseswithnegativeinterestratemove.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h6wx-4PuZeKVXE7cd9005b2c876968f80-701_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422195_BoJ-surprises-unveils-negative-rate-policy_1540251309.html","title":"Bank of Japan surprises with negative interest rate move","title_page":"Bank of Japan surprises with negative interest rate move | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bank of Japan surprises with negative interest rate move\nJapan's central bank shocked markets Friday with plans to effectively charge lenders to park their cash with it, ramping up a long-running battle to kickstart the world's number three economy.\nThe unprecedented decision to adopt a below-zero interest rate policy is the Bank of Japan's latest weapon as it looks to spur bank lending and drive up inflation. In response, the Nikkei stock index soared almost three percent as the yen plunged.\nBoJ chief Haruhiko Kuroda cited recent financial market turmoil and a China slowdown for ushering in a -0.1 percent rate on new reserves, and said the bank may go even further into negative territory. Rates currently are near zero.\nJapan's economy has been beset by ultra-low inflation and the central bank hopes the negative interest rates will encourage more spending and investments ©Yoshikazu Tsuno (AFP/File)\n\"The Japanese economy is not isolated from the global economy,\" he told reporters, after the bank's first meeting of 2016.\n\"There has been big volatility in financial markets... Because of the uncertain outlook for emerging and commodity-exporting economies, particularly China, we see rising risks for corporate confidence\" and consumers' expectations for inflation, he said.\n\"That is why we decided to introduce negative interest rates.\"\nUnder the plan, commercial lenders would now have pay to park cash at the BoJ, giving them an incentive to boost lending, which policymakers hope would stoke economic growth.\nBut some analysts saw it as a desperate move after three years of Prime Minister Shinzo Abe's big-spending, easing money policy, dubbed \"Abenomics\", having limited impact on the moribund economy.\nAnd in a stark acknowledgement of the huge job ahead, the BoJ cut its inflation forecasts and pushed back the timeline for reaching their inflation goal.\n\"It was a surprise to most market players who thought negative interest rates would be a last resort,\" said Koichi Fujishiro, senior economist at Dai-ichi Life Research Institute.\n- 'Bitter divide' -\nA similar below-zero policy was adopted by the European Central Bank in 2014, the first time by a major central bank.\nThe rate change passed by a narrow vote among BoJ policy members, who kept their 80 trillion yen ($673 billion) asset-buying plan unchanged. The scheme is a cornerstone of Abenomics.\n\"Concerns had been mounting that the BoJ were increasingly tapped out in their ability to ease monetary policy any further, and today’s 5-4 decision shows how bitter the divide between hawks and doves is,\" said Angus Nicholson, a market analyst at IG Ltd. in Melbourne.\nKuroda has said he is keeping a close eye on wage rises in spring negotiations. The bank hopes that putting more cash in shoppers' wallets will spur spending and move Japan closer to the inflation target.\n\"Governor Kuroda has gained notoriety by changing course when it is least expected, and today's move will only serve to cement this reputation,\" Marcel Thieliant from research house Capital Economics said in a commentary.\nHe added that Friday's move \"will likely be followed by further cuts in coming months\" rather than an expansion of asset purchases.\nData published hours before the BoJ announcement painted a worrying picture of Japan's economic malaise, with inflation at a well-below-target 0.5 percent last year.\nAlso, spending by households in December fell 4.4 percent from a year ago and monthly industrial production contracted 1.4 percent.\nThe economy grew a stronger-than-expected 0.3 percent in July-September, after initial estimates had shown a contraction. Fourth-quarter data is due next month.\nA lacklustre global economy, marked by the slowdown in China and weakness in emerging markets, is posing challenges to the recovery.\nLast month, the central bank rolled out a series of policy tweaks, including boosting their holdings in firms dedicated to capital spending and new hiring.\nThey also made some other changes to their massive asset-buying programme, but they did not expand the size of the scheme and speculation has been building that they will have to do so in order to light a fire under the economy.\nA deflationary price spiral in Japan for years put consumers off buying in the hope of getting goods cheaper down the road, denting firms' expansion and hiring plans. That weighed on growth in the wider economy.\nBank of Japan (BoJ) chief Haruhiko Kuroda explains his negative interest rate policy during a press conference in Tokyo, on January 29, 2016 ©Toshifumi Kitamura (AFP)\nJapan's export-led economy grew by a stronger-than-expected 0.3 percent between July-September ©Yoshikazu Tsuno (AFP/File)\nJapan's moribund economy saw consumer spending fall by an annual rate of 4.4 percent in December 2015 ©Toru Yamanaka (AFP/File)","url":"https://www.dailymail.co.uk/wires/afp/article-3422195/BoJ-surprises-unveils-negative-rate-policy.html"}
