{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 23:29:21","date_modify":"2018-10-30 23:29:21","date_publish":"2016-12-06 00:00:00","description":"The Bank of England governor thinks the job market is experiencing \"great disruption\" and governments and corporations have a duty to help manage the change.","filename":"data/vaneerConsumption/BankofEnglandsMarkCarneyontechnologychangingjobsmarket.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bank-of-england-mark-carney-technology-jobs-market-fourth-industrial-revolution-2016-12_1540942161.html","title":"Bank of England's Mark Carney on technology changing jobs market","title_page":"    Bank of England's Mark Carney on technology changing jobs market - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Humanoid robots work side by side with employees in the assembly line at a factory of Glory Ltd., a manufacturer of automatic change dispensers, in Kazo, north of Tokyo, Japan, July 1, 2015. REUTERS/Issei Kato/File Photo LONDON — Bank of England Governor Mark Carney thinks the jobs market is experiencing \"great disruption\" due to technology, and believes governments and corporations have a duty to help people manage the change.\nIn a wide-ranging speech on the economy in Liverpool on Monday, the governor said the world is \"in the midst of a technological revolution that is once again changing the nature of work.\" He highlighted a past speech from the Bank of England's Andy Haldane in which he said 15 million British jobs could be automated over time.\nThe World Economic Forum (WEF) believes we are in the midst of a \"Fourth Industrial Revolution,\" with robotics and artificial intelligence (AI) transforming economies around the world. WEF estimates that 5 million jobs will be destroyed by these forced by 2020. Research by Citi and Oxford University earlier this year estimated that 57% of jobs across the OECD are at risk of automation.\nTechnology optimists argue that developments like AI or robotics will create more jobs than they destroy — someone has to build the robots, train the AI, and there will be new jobs that we can't even image now.\nHowever, Carney told the audience at Liverpool John Moores University: \"The fundamental challenge is that, alongside its great benefits, every technological revolution mercilessly destroys jobs and livelihoods - and therefore identities - well before the new ones emerge.\n\"This was true of the eclipse of agriculture and cottage industry by the industrial revolution, the displacement of manufacturing by the service economy, and now the hollowing out of many of those middle-class services jobs through machine learning and global sourcing.\"\nCarney linked a growing \"anxiety about the future\" of work to a rejection of globalisation, free trade, and open societies. Others have made similar points: The CEO of Silicon Valley software company Zuora told Business Insider in a recent interview that people are \"lashing out\" because jobs are being destroyed by new technologies.\nCarney said: \"The commitment to reskilling all workers must be continual.\" He said that \"lifelong learning, ever-greening skills and cooperative training will become more important than ever\" as technology evolves.\nSpeaking on a panel of global chief executives earlier this year, Stuart Gulliver, the CEO of HSBC, said that it's \"unlikely that there will be the same number of jobs in today's skill set in five years time,\" and said that it is \"our responsibility is to manage that transition.\"\nHowever, Carney also flagged potential economic benefits from the rise of technology in Monday's speech. He said: \"In an age where anyone can produce anything anywhere through 3-D printing, where anyone can broadcast their performance globally or sell to China whatever the size of their business, there is an opportunity for mass employment through mass creativity.\n\"Technology platforms such as taskrabbit, Alibaba, etsy, and Sama can help give smaller-scale producers and service providers a direct stake in global markets. Smaller scale firms can by-pass big corporates and engage in a form of artisanal globalisation; a revolution that could bring cottage industry full circle.\"\nCarney's overall message was firmly downbeat, however. The governor said Britain is in the midst of \"the first lost decade since the 1860s\" as a result of stagnant real wages and poor productivity growth.","url":"https://www.businessinsider.com/bank-of-england-mark-carney-technology-jobs-market-fourth-industrial-revolution-2016-12"}
