{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 21:34:16","date_modify":"2018-10-30 21:34:16","date_publish":"2016-12-20 00:00:00","description":null,"filename":"data/vaneerConsumption/Banksfearexistingmarketparticipantsmost.json","image_url":"https://amp.businessinsider.com/images/58594e82a1a45e38468b68d2-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_banks-fear-existing-market-participants-most-2016-12_1540935256.html","title":"Banks fear existing market participants most","title_page":"    Banks fear existing market participants most - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Fintech Briefing\" subscribers. To learn more and subscribe, please click here.\nDespite the ongoing success of fintechs, and the continued proliferation of digitally focused challenger banks, global banks are more likely to see existing large incumbents as the biggest threat to their business, according to Temenos' annual banking survey.\nThe data highlights the ongoing evolution of the global banking landscape. Although most banks perceive incumbents to be a greater threat than fintechs, the margin between the two is slim — only 4%. This suggests that there is not yet a clear leader in the race to become the dominant provider of banking services in the future. We believe it unlikely that any one kind of provider will emerge as dominant alone, and that instead, we will continue to see partnerships form between market participants as they seek to leverage each other's strengths.\nThe survey results demonstrate that we've entered the most profound era of change for financial services companies since the 1970s brought us index mutual funds, discount brokers and ATMs.\nNo firm is immune from the coming disruption and every company must have a strategy to harness the powerful advantages of the new fintech revolution.\nThe battle already underway will create surprising winners and stunned losers among some of the most powerful names in the financial world: The most contentious conflicts (and partnerships) will be between startups that are completely reengineering decades-old practices, traditional power players who are furiously trying to adapt with their own innovations, and total disruption of established technology & processes:\nTraditional Retail Banks vs. Online-Only Banks: Traditional retail banks provide a valuable service, but online-only banks can offer many of the same services with higher rates and lower fees\nTraditional retail banks provide a valuable service, but online-only banks can offer many of the same services with higher rates and lower fees Traditional Lenders vs. Peer-to-Peer Marketplaces : P2P lending marketplaces are growing much faster than traditional lenders—only time will tell if the banks strategy of creating their own small loan networks will be successful\n: P2P lending marketplaces are growing much faster than traditional lenders—only time will tell if the banks strategy of creating their own small loan networks will be successful Traditional Asset Managers vs. Robo Advisors: Robo advisors like Betterment offer lower fees, lower minimums and solid returns to investors, but the much larger traditional asset managers are creating their own robo-products while providing the kind of handholding that high net worth clients are willing to pay handsomely for.\nAs you can see, this very fluid environment is creating winners and losers before your eyes…and it's also creating the potential for new cost savings or growth opportunities for both you and your company.\nAfter months of researching and reporting this important trend, Sarah Kocianski, senior research analyst for BI Intelligence, Business Insider's premium research service, has put together an essential report on the fintech ecosystem that explains the new landscape, identifies the ripest areas for disruption, and highlights the some of the most exciting new companies. These new players have the potential to become the next Visa, Paypal or Charles Schwab because they have the potential to transform important areas of the financial services industry like:\nRetail banking\nLending and Financing\nPayments and Transfers\nWealth and Asset Management\nMarkets and Exchanges\nInsurance\nBlockchain Transactions\nIf you work in any of these sectors, it's important for you to understand how the fintech revolution will change your business and possibly even your career. And if you're employed in any part of the digital economy, you'll want to know how you can exploit these new technologies to make your employer more efficient, flexible and profitable.\nAmong the big picture insights you'll get from The Fintech Ecosystem Report: Measuring the effects of technology on the entire financial services industry:\nFintech investment continues to grow. After landing at $19 billion in total in 2015, global fintech funding had already reached $15 billion by mid-August 2016.\nThe areas of fintech attracting media and investor attention are changing. Insurtech, robo advisors, and digital-only banks are only a few of the segments making waves. B2B fintechs are also playing an increasingly prominent role in the ecosystem.\nIt's not all good news for fintechs. Major hurdles, including customer acquisition and profitability, remain. As a result, many are becoming more willing to enter partnerships and adjust their business models.\nIncumbents are enacting strategies to ensure they remain relevant. Many financial firms have woken up to the threat posed by fintechs and are implementing innovation strategies to stave off disruption. The majority of these strategies involve some interaction with fintech firms.\nThe relationship between incumbents and fintechs continues to evolve. Fintechs are no longer viewed exclusively as a threat, nor can they be ignored. They are increasingly viewed as partners, but that narrative alone is too simple — in reality, a more nuanced connection is taking hold.\nThis exclusive report also:\nAssesses the state of the fintech industry.\nGives details on the drivers of its growth.\nExplains which areas of fintech are gaining traction.\nOutlines the range of current and potential models for fintech and incumbent interaction.\nThe Fintech Ecosystem Report: Measuring the effects of technology on the entire financial services industry is how you get the full story on the fintech revolution.\nTo get your copy of this invaluable guide to the fintech revolution, choose one of these options:\nSubscribe to an ALL-ACCESS Membership with BI Intelligence and gain immediate access to this report AND over 100 other expertly researched deep-dive reports, subscriptions to all of our daily newsletters, and much more. >> START A MEMBERSHIP Purchase the report and download it immediately from our research store. >> BUY THE REPORT\nThe choice is yours. But however you decide to acquire this report, you've given yourself a powerful advantage in your understanding of the fast-moving world of financial technology.","url":"https://www.businessinsider.com/banks-fear-existing-market-participants-most-2016-12"}
