{"authors":[],"date_download":"2018-10-22 21:57:43","date_modify":"2018-10-22 21:57:43","date_publish":"2014-06-06 00:36:51","description":"A growing movement to delete one key question from hiring forms now is law in more than 60 cities and 12 states, with other states lining up.","filename":"data/vaneerConsumption/BantheBoxMoreStatesandCitiesHelpExConsFinallyLandJobs.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/492666/140606-marilyn-scales-mn-1300_42b9d9db38428119fcf481fe1e2b8d4c.1200;630;7;70;5.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_economy_ban-box-more-states-cities-help-ex-cons-finally-land-n124151_1540245463.html","title":"'Ban the Box': More States and Cities Help Ex-Cons Finally Land Jobs","title_page":"'Ban the Box': More States and Cities Help Ex-Cons Finally Land Jobs ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA growing movement to delete one question from hiring forms –- the query about a job prospect’s criminal history -– is now law in more than 60 cities and 12 states, with New Jersey and Georgia perhaps next to join the pack.\nAdvocates have embraced a rallying cry: “Ban the Box.” They want employers to strip from applications the little square that asks about previous offenses or past convictions.\nAnd they're asking managers to wait until later in their assessment process to make that inquiry or to run criminal background checks, giving felons and ex-scofflaws a better shot at landing work.\nRoughly one in four Americans could ultimately benefit from that change, contend “Ban the Box” boosters, citing fresh U.S. census figures that show some 70 million U.S. adults now own a criminal record -– the product, advocates say, of mass incarcerations fueled by a flawed criminal justice system.\n“‘Ban the Box’ has gained enough momentum that it’s now lighting the fire in other places. Why is it catching on? It appeals to a core American value: This is about fairness,” said Michelle Rodriguez, staff attorney at the National Employment Law Project (NELP), which lobbies for the reform.\n“Punishing people for a lifetime isn’t working. And as Americans, we believe in second chances,” added Rodriguez. “It doesn’t mean you (automatically) hire the person. The idea is to just give more people a fair shot, an opportunity to work. If they have money in their pocket, they put more into the economy.”\nBut many merchants are fighting the movement.\nSome business owners complain that cutting the criminal-history question from applications and enacting such restrictions on employers adds unnecessary time, expense and liability to the hiring process, causing potentially long delays in filling open slots.\n“I feel like I’m still paying for my crime, still being punished. When can I say: I've finally done my time?\"\n“It’s a kind of one-size-fits-all, heavy-handed mandate that presupposes politicians and lawyers know better how to assess job applicants than the people who are doing the hiring,” said Jack Mozloom, a spokesman for the National Federation of Independent Business (NFIB). The advocacy group represents some 350,000 small and independent business owners.\n“Small business owners have much to lose here. They have their own customers to protect, their own financial information to protect, their own products and liability,” Mozloom said.\nIn April, NFIB surveyed business owners in Michigan –- where “Ban the Box” legislation has been proposed -– finding that 88 percent of the merchants there opposed delaying the background checks or blotting the criminal-history question in applications, Mozloom said.\n“A criminal history is a public record. Why shouldn’t employers be allowed to consider it when they’re making a very big decision? When you hire an employee, you have to able to do it right. This is one way to do it right,” Mozloom said.\nIn Maryland, the Greater Baltimore Committee, a regional organization of civic leaders, similarly denounced a “Ban the Box” law signed on May 28 by Baltimore Mayor Stephanie Rawlings-Blake. Business leaders there argued the law loads an administrative “burden” on employers and will convince any relocating companies to avoid that city, said Donald C. Fry, committee president.\nBaltimore joins 60-plus cities that have passed “Ban the Box” laws, including Louisville and Indianapolis, according to NELP. New York City is considering its own version, called the NYC Fair Chance Act.\nAmong the 50 states, four (Hawaii, Massachusetts, Minnesota and Rhode Island) passed laws that forced private employers to yank the conviction-history question from job applications, according to NELP. Illinois is soon expected to become the fifth such state as a similar law sits on the governor’s desk.\n“A criminal history is a public record. Why shouldn’t employers be allowed to consider it when they’re making a very big decision?\"\nAnother eight states (California, Colorado, Connecticut, Delaware, Illinois, Maryland, Nebraska, New Mexico) have removed that question from applications for public or state jobs. In Georgia, an executive order is under discussion that would pluck felony-conviction queries from state employment forms. And in New Jersey, where a “Ban the Box” bill is under scrutiny in the state legislature, Gov. Chris Christie has voiced support for the concept.\nAll of that is welcome news to Marilyn Scales, 51, who has applied for work at Target, Macy’s and “numerous” other businesses since serving time from 1995 to 1997 at an upstate New York prison. Scales was convicted of two felonies each related to selling heroin, she said.\nNo hiring manager, Scales said, will give her a look –- and she believes it’s solely because she always answers honestly on employment forms that she has a criminal history.","url":"https://www.nbcnews.com/business/economy/ban-box-more-states-cities-help-ex-cons-finally-land-n124151"}
