{"authors":["Anam Syed"],"date_download":"2018-10-30 23:18:52","date_modify":"2018-10-30 23:18:52","date_publish":"2014-08-13 20:31:15","description":"To say that the new Lifetime show BAPs is a class study is an understatement. While the show has earned some serious side-eye for its title, it is turning out to be a fascinating portrait of its characters, who we mustn't forget are real people.…","filename":"data/vaneerConsumption/BAPSStarRaiRaiIsCalledRatchetThatJustHighlightstheShowsManyIssues.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/8e4099e7-bbb1-4adf-bc44-801465e1faee.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35488-baps-star-rai-rai-is-called-ratchet-that-just-highlights-the-shows-many-issues_1540941532.html","title":"'BAPS' Star Rai Rai Is Called \"Ratchet\" & That Just Highlights the Show's Many Issues","title_page":"'BAPS' Star Rai Rai Is Called \"Ratchet\" & That Just Highlights the Show's Many Issues","title_rss":"NULL","source_domain":"bustle.com","text":"To say that the new Lifetime show BAPs is a class study is an understatement. While the show has earned some serious side-eye for its title, it is turning out to be a fascinating portrait of its characters, who we mustn't forget are real people. The second episode \"Life in the BAP Lane\" introduced the charged word anyone could have guessed would eventually rear its head on the show: ratchet. Essentially, the BAPs want to My Fair Lady Kendrick's niece Rai Rai and turn her from a \"hot ghetto mess\" to \"Cosby black,\" as Anisha describes the cast in the series premiere. The cast alternately praises her (Gina says she hangs out with Rai Rai because she is \"real\") and ostracizes her, with Anisha telling Kendrick she \"can't stand her.\"\nLast year, Essence Magazine listed \"ratchet\" amongst a list of problematic media stereotypes of black women. So why are the black women on the show so ready to label Rai Rai as a word that rubs many the wrong way? Anisha, Kendrick's beau, tangles with these issues often, both in her home life with him and Rai Rai, as well as the rest of the cast. In the same episode, she and entrepreneur James appear on a radio show to discuss the BAP lifestyle which results in a blowout fight between the two. James accuses Anisha of being ashamed of being black, while Anisha implies his ideas of blackness relate to black masculinity only.\nLifetime on YouTube\nSo let's backtrack to Anisha's reasons for throwing shade and unkind words towards her boyfriend's niece. Kendrick is caught in the middle as Anisha bailed Rai out of jail (for a traffic ticket-related infraction), but subsequently got mad when the bail money wasn't paid back. Rai does seem appreciative, but the two can't reach a common plane. Kendrick and Rai are the show's resident non-BAPs, and it's definitely played up for context.\nDuring a lunch with Gina, Rai's ignorance of fancy and foreign foods is presented as a sign of her lack of class in comparison to the BAP contingent. To her credit, Anisha does say she finds Rai smart and beautiful, just that she \"ruins it\" by opening her mouth. While the ladies are passing judgement like no tomorrow, Rai Rai is staunchly stating that she doesn't want to be a BAP and that they are \"lame.\"\nThat doesn't stop Anisha from introducing the idea that they \"BAP-tize\" her into a life of refinement (I'm guessing a Pretty Woman style montage is slated for the near future). Anisha's move to change Rai is an interesting one, considering she also dates outside of their BAP circle to \"keep humble,\" so you would think she would be more tolerant. Maybe she's internalizing more of James' assertion of \"the black brand\" and black maleness than she realizes. While it's acceptable for the men on the show to be \"real,\" Rai's uncensored attitude is greeted with head shakes at how unladylike it is. In the clip above, Anisha even says Rai needs \"a woman to continue to refine her.\"\nlee bailey on YouTube\nKendrick rightfully takes umbrage, because hearing your girlfriend and her friends nonstop imply your niece is \"ratchet\" and uncivilized is pretty messed up. The things we hate in others are the things we hate in ourselves; the women accept men who aren't part of the BAP scene, but expect women to conform to their BAP ideal, lest it break a facade. At their core, it seems these women, who have a certain degree of financial power, are afraid of losing their class status at all times. Can you blame them? They are not only established women, but established women of color, so I get that you sort of have to prove you belong in the room any given time, and Rai reminds them of the things they want to escape. They call Rai Rai ratchet before anyone else does to prove they see it too.\nIn the same breath, historically, women haven't been able to enjoy their success as independent individuals in a vacuum. They are simultaneously expected to be cultural torchbearers and not abandon \"their\" men with their progress, and be able to instill their values into future generations. While yes, it's just a reality show, the simultaneous struggle of class, gender, and race reminds me of Native Son author Richard Wright's harsh takedown of Zora Neale Hurston's Their Eyes Were Watching God. Wright took offense at the story, which has its heroine charged with her abusive husband's murder and finds opposition from black men but support from white feminists at her trial. Wright found it pandering, but at what point is cultural loyalty really an internal feminist struggle?\nIn that vein, Anisha and the rest of the cast are struggling with being independent, but also pushing up against the idea that their independence makes them \"less black.\" In the same vein, they've created their own rigid gender dynamic: men don't have to be BAPs because they can culturally contradict that perceived whiteness and \"balance\" the relationship. They don't challenge the BAPs because it's easy to gender code the two sets of behaviors. Rai, on the other hand, encompasses everything Anisha is afraid of becoming or being mistaken for.\nMakeovers are all well and good, but given how loaded the show is already, it will be fascinating to see how the characters ebb and flow together with their cultural differences as it examines the minutia of black relationships.\nImage: Lifetime","url":"https://www.bustle.com/articles/35488-baps-star-rai-rai-is-called-ratchet-that-just-highlights-the-shows-many-issues"}
