{"authors":["James Delingpole"],"date_download":"2018-10-30 19:18:30","date_modify":"2018-10-30 19:18:30","date_publish":"2018-08-22 15:52:17","description":"Obama's climate legacy is toast with the Clean Power Plan watered down to the point of irrelevance by the EPA.","filename":"data/vaneerConsumption/BarackObamasClimateLegacyIsToast.json","image_url":"https://media.breitbart.com/media/2017/01/baz.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_08_22__1540927110.html","title":"Barack Obama's Climate Legacy Is Toast","title_page":"Delingpole: Barack Obama's Climate Legacy Is Toast","title_rss":"NULL","source_domain":"breitbart.com","text":"Obama’s climate legacy is toast.\nThe Clean Power Plan – designed to be the centerpiece of his presidency-defining mission to combat climate change – has been watered down to the point of irrelevance by the Environmental Protection Agency (EPA).\nReplacing it is the snappily-named Affordable Clean Energy (ACE) rule.\nAdvance Notice of Proposed Rulemaking\nIn December 2017, EPA issued an Advance Notice of Proposed Rulemaking (ANPRM) to solicit information from the public about a potential future rulemaking to limit greenhouse gas emissions from existing electric utility generating units (EGUs), commonly called power plants. Repealing the Clean Power Plan\nIn October 2017, EPA proposed to repeal the Clean Power Plan because it exceeded EPA’s authority.\nOn August 21, 2018, the U.S. Environmental Protection Agency proposed the Affordable Clean Energy (ACE) rule which would establish emission guidelines for states to develop plans to address greenhouse gas emissions from existing coal-fired power plants. The ACE rule would replace the 2015 Clean Power Plan, which EPA has proposed to repeal because it exceeded EPA’s authority. The Clean Power Plan was stayed by the U.S. Supreme Court and has never gone into effect. The ACE rule has several components: a determination of the best system of emission reduction for greenhouse gas emissions from coal-fired power plants, a list of “candidate technologies” states can use when developing their plans, a new preliminary applicability test for determining whether a physical or operational change made to a power plant may be a “major modification” triggering New Source Review, and new implementing regulations for emission guidelines under Clean Air Act section 111(d).\nAs Daily Caller reports, the idea behind the Clean Power Plan was to implement Obama’s carbon dioxide emission reduction commitments made when he signed the Paris Climate Accord.\nThe Obama administration joined the Paris climate accord in 2016, promising to cut U.S. greenhouse gas emissions 26 to 28 percent by 2025. The CPP would have played a large role in meeting that goal, though more regulations were likely needed to cut emissions by that much. However, the CPP never went into effect. The U.S. Supreme Court issued a stay against implementing the rule in early 2016 after 27 states and a whole host of industries and conservative groups filed suit to have it overturned. The CPP required states to come up with plans to reduce carbon dioxide from existing power plants, aiming to cut emissions 32 percent below 2005 levels by 2030. EPA says ACE will achieve similar levels of emissions cuts once fully implemented.\nThis will indeed by good for U.S. industry, especially in the coal states which would otherwise have been hit hard.\nMyron Ebell, Director for Energy and Environment at the Competitive Enterprise Institute, has welcomed EPA’s replacement rule:\n“The EPA’s proposed replacement rule is a huge improvement over the so-called Clean Power Plan, which is almost certainly illegal and would be incredibly costly to consumers if implemented. The new rule provides minimal regulation of greenhouse gas emissions from existing power plants and will therefore result in only small increases in electric rates. It will also do no more harm to the coal industry, which still supplies 30% of America’s electricity at the lowest costs.”\nBut the situation is still not ideal.\nArguably the most damaging of all Obama’s climate policies is still live and dangerous: the EPA’s notorious 2009 CO2 Endangerment Finding.\nThe reason it is so dangerous is that it declares that CO2 – hitherto recognized as a harmless and often beneficial trace gas – as a hazard requiring government regulation. Thus it gives carte blanche to any future left-wing administration to hamstring the U.S. economy once more with onerous regulations like the ones Trump and the EPA have just rescinded.\nDaily Caller reports:\n“The one Obama era rule that still needs to be revisited is the endangerment finding that labels life-giving carbon dioxide as a threat to public welfare,” former Trump transition official Steve Milloy told The Daily Caller News Foundation.\nSo far, the EPA has shown itself reluctant to take on the Endangerment Finding. This suggests that the Trump administration doesn’t have the appetite to take on the “science” of global warming.\nBut according to the CEI’s Myron Ebell this may yet be necessary – if and when the the new ACE rule gets thrown out of court.\nThe Competitive Enterprise Institute (CEI) and Concerned Household Electricity Consumers Council (CHECC) petitioned EPA in 2017 to reconsider the endangerment finding. CEI hopes EPA will consider its petition. Moreover, CEI argues the Trump administration’s Affordable Clean Energy (ACE) rule, a more lenient alternative to the Clean Power Plan, will likely be challenged in court. “We think that granting the petition remains the best option if the court decides that the new rule doesn’t do enough to reduce carbon dioxide emissions from coal and natural gas power plants,” said Myron Ebell, director of CEI’s Center for Energy and Environment.\nAs one of Obama’s former EPA administrators Gina McCarthy said earlier this year, undoing all Obama’s climate policies will be a “difficult slog.”\nFor once she wasn’t wrong.","url":"https://www.breitbart.com/politics/2018/08/22/delingpole-obamas-climate-legacy-is-toast/"}
