{"authors":[],"date_download":"2018-10-30 14:27:31","date_modify":"2018-10-30 14:27:31","date_publish":"2014-12-09 00:00:00","description":null,"filename":"data/vaneerConsumption/BarackObamaMortalFleshLiketheRestofUs.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2014_12_barack_obama_mortal_flesh_like_the_rest_of_us_1540909651.html","title":"Barack Obama: Mortal Flesh Like the Rest of Us","title_page":"Barack Obama: Mortal Flesh Like the Rest of Us","title_rss":"NULL","source_domain":"americanthinker.com","text":"Thanks to the president’s compassion toward anyone who’s not an American, nowadays the simple act of grabbing a grocery cart is akin to licking a tainted Petri dish.\nBecause of Obama coaxing an invasion by beckoning into our midst millions of illegal aliens, every American is now vulnerable to bacteria and viruses that we lack the immunity to fight. That’s why it’s fair to say that the president is purposely subjecting the nation’s citizens to unnecessary sickness, disease and death.\nLet’s admit it: we the little people are essentially helpless.\nWhat’s frustrating for those stranded as a tsunami of doom approaches is the realization that the man responsible for our impending demise is well protected from the maladies we mere mortals are being purposely exposed to.\nNo one thinks for one moment that Barack Obama will get the respiratory infection Enterovirus D-68, the polio-like germ imported from Latin America that has claimed the lives of about a dozen people, most of whom were small children and infants.\nThe president can mosey on down to the CDC and there’s never a fear that he’ll come down with hemorrhagic fever, or contract MDR- TB or Chagas, or any other exotic import he’s determined to expose the rest of America to.\nAs Barack Obama looks the other way and ignores the mayhem, Border Patrol agents warn that M-13 and violent Chinese gangs are among those busting the border. Nor does the president need to worry that one of his so called “Dreamers” will take a shot at him during a high-speed chase like Alexander Gallardo did in Raleigh, North Carolina when he attempted to kill a police officer.\nThanks to Obama’s foolish immigration policy, Americans have things like that, and plenty more, to worry about.\nMeanwhile the man fomenting the atmosphere of dread has nothing to fear, because when Islamic barbarians, otherwise known as ISIS, whom some say have already infiltrated our border, eventually make a gory statement in an elementary school or a crowded mall, thank God, at least we know for sure that Obama’s daughters will be spared.\nNonetheless, exempt from the restrictions he’s inflicted on the rest of us via ObamaCare and free from the wait sick and dying veterans were forced to endure, recently the president was in need of emergency medical care.\nFor those of us gripped with Obama-imposed anxiety, it takes the president being popped in the lip and requiring twelve stitches, or being admitted to the hospital for a two-week old sore throat to remind us that all life is delicate, including Obama’s.\nThe 49th Psalm says that “man in his pomp will not endure; He is like the beasts that perish.” To the little guy, it may not feel like it, but experience has proven that no man endures, including pompous men with singed esophagi.\nAs we strain against Obama’s tightening grip around the nation’s throat, quite unexpectedly America finds out that the one who seemed impervious is not shielded after all, because he, like the rest of us, is frail and one day will perish too.\nThe president falling ill reminds us that position and power do not make one immune to sickness and death.\nIn other words, Obama may appear to be physically protected from the unwarranted peril and disease he’s exposing the rest of us to, but the truth is that Barack the Inflictor is also subject to the fragility and brevity of life.\nIn James 4:14 Jesus’s brother writes that like it or not, “no one knows what his or her life will be like tomorrow.” Take for instance our seemingly immortal president fundraising one day and the next day suffering through a fiber-optic endoscopy and CT scan.\nIt may not seem like it, but all of us, including dead ambassadors, innocents murdered by illegal aliens, those who have needlessly died of Third World diseases, Americans beheaded by ISIS, as well as the ostensibly impervious Obama, are all “just a vapor that appears for a little while and then vanishes away.”\nCould it be that there’s a lesson here for both the oppressed and the oppressor?\nPerhaps so, because for the record, acid reflux is when the stomach contents push back up into the esophagus, which causes symptoms such as heartburn and a sore throat.\nIs it a coincidence that Barack Obama forces down America’s craw a philosophy and ideology the majority of us cannot stomach and he’s the one who ends up with reflux? After garroting the nation and causing our heart to burn and turning our voices hoarse from crying out in pain, is it somehow fitting that Obama is the one who ends up with a swollen esophagus and burning gullet?\nSo, rather than thinking up new ways to inflict misery upon the American people, while he heals, it might do the president good to meditate upon the fact that regardless of our station in life, whether president or peon, we are all but flesh, a momentary “wind that passes and does not return.”\nAs for those of us who feel powerless because our fleeting lives are daily impacted by a man with a raging case of acid reflux, it’s good to be reminded that in the end, the one who holds the power over life and death is God, not Barack Obama.\nJeannie hosts a blog at www.jeannie-ology.com","url":"https://www.americanthinker.com/articles/2014/12/barack_obama_mortal_flesh_like_the_rest_of_us.html"}
