{"authors":["Morgan Brinlee"],"date_download":"2018-10-31 00:02:28","date_modify":"2018-10-31 00:02:28","date_publish":"2018-10-28 13:53:32","description":"Statements of grief, support, and frustration poured in from around the country after a gunman opened fire on congregants at a synagogue in Pennsylvania on Saturday, killing at least 11 people and wounding six others. Among them was President Barack…","filename":"data/vaneerConsumption/BarackObamaRespondsToThePittsburghSynagogueShootingWithAPowerfulCallToAmericans.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/10/28/320ec198-2351-404e-b643-d31995451b51-getty-1054045052.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_barack-obama-responds-to-the-pittsburgh-synagogue-shooting-with-a-powerful-call-to-americans-13009392_1540944148.html","title":"Barack Obama Responds To The Pittsburgh Synagogue Shooting With A Powerful Call To Americans","title_page":"Barack Obama Responds To The Pittsburgh Synagogue Shooting With A Powerful Call To Americans","title_rss":"NULL","source_domain":"bustle.com","text":"Statements of grief, support, and frustration poured in from around the country after a gunman opened fire on congregants at a synagogue in Pennsylvania on Saturday, killing at least 11 people and wounding six others. Among them was President Barack Obama, who responded to the Pittsburgh synagogue shooting with a call for Americans to fight \"the hateful rhetoric against those who look, love, or pray differently.\"\n\"We grieve for the Americans murdered in Pittsburgh,\" Obama said on Twitter late Saturday. \"All of us have to fight the rise of anti-Semitism and hateful rhetoric against those who look, love, or pray differently.\"\nPittsburgh police reported taking a suspect into custody late Saturday morning, shortly after responding to reports of an active shooter at The Tree of Life Synagogue in the city's Squirrel Hill neighborhood. According to police, the gunman yelled an anti-Semitic slur just prior to opening fire on congregants, who were gathered for Shabbat services and a bris. Four police officers were wounded as authorities worked to subdue the suspected shooter.\nBut along with urging Americans to reject anti-Semitism and hateful rhetoric directed against those who may be different than them, former President Obama also called for stricter gun safety laws. \"We have to stop making it so easy for those who want to harm the innocent to get their hands on a gun,\" he tweeted. According to The Washington Post, the gunman was armed with an with AR-15-style assault rifle and multiple handguns.\nIn contrast, President Donald Trump appeared to suggest the attack on Pittsburgh's Tree of Life Synagogue might not have been as deadly had the synagogue had armed security. \"[The shooting] has little to do with [gun laws], if you take a look,\" the president told reporters just hours after the shooting when asked if he thought it would renew debate on gun safety. \"If they had protection inside, the results would have been far better. This is a dispute that will always exist, I suspect, but if they had some kind of a protection inside the temple maybe it could have been a much better situation. They didn't.\"\nAs Democrats called for bipartisan legislation on common sense gun control measures, President Trump appeared to double down on his belief that good guys with guns may have thwarted the attack. \"This is a case where if they had an armed guard inside they may have been able to stop him immediately,\" Trump said later in the day while speaking in Illinois. \"Maybe there would have been nobody killed, except for him maybe.\"\nOn Twitter, however, Trump appeared to be more conciliatory, calling the shooting an \"evil anti-Semitic attack\" and \"an assault on humanity\" and noting \"we must unite to conquer hate.\"\n\"It will take all of us working together to extract the poison of Anti-Semitism from our world,\" he tweeted.\nAccording to The New York Times, the suspected shooter has been charged with 29 criminal counts, including using a firearm to commit an act of murder and obstructing an individual's free exercise of religious beliefs, which is considered to be a hate crime. The suspected gunman also faces 13 counts of ethnic intimidation, 11 counts of criminal homicide, and six counts aggravated assault, the paper has reported.","url":"https://www.bustle.com/p/barack-obama-responds-to-the-pittsburgh-synagogue-shooting-with-a-powerful-call-to-americans-13009392"}
