{"authors":[],"date_download":"2018-10-30 14:27:23","date_modify":"2018-10-30 14:27:23","date_publish":"2014-11-19 00:00:00","description":null,"filename":"data/vaneerConsumption/BarackObamaACompanionofFools.json","image_url":"https://www.americanthinker.com/images/bucket/2014-11/193539.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2014_11_barack_obama_a_companion_of_fools_1540909643.html","title":"Barack Obama: A Companion of Fools","title_page":"Barack Obama:  A Companion of Fools","title_rss":"NULL","source_domain":"americanthinker.com","text":"Take for example one foolish companion the president walks with: the prominent gay rights activist Terrence P. Bean , 66, who has been indicted for allegedly sexually abusing a 15-year-old boy. At a 2009 Human Rights Campaign dinner, Mr. Obama called the alleged child molester a “great friend and supporter.”\nIt seems that Barack Obama has a propensity to surround himself with some questionable friends. So, instead of trying in vain to slow the rising oceans and heal the planet, it might do the president some good to spend time in the Bible, contemplating verses like Proverbs 13:20, which says “Whoever walks with the wise becomes wise, but the companion of fools will suffer harm.”\nAs a matter of fact, Obama’s “great friend” Terrence has frequented the White House at least six times in the past couple of years. An ardent and influential supporter of many prominent Democrats, in addition to visiting 1600 Pennsylvania Avenue, Bean has also been a guest of the president on Air Force One flying around at $181K an hour.\nIt’s been said by former Oregon governor Barbara Roberts about Terrence Bean that “He has the president’s ear.” Word is that Mr. Bean was even instrumental in changing the president’s mind on same-sex marriage. Perhaps Terry is the one who fed Obama that “no matter who you love” line the president manages to inject into every speech.\nIn a 2012 interview with Proud Queer Monthly magazine, Mr. Bean said that Mr. Obama’s repeal of “Don’t Ask, Don’t Tell” was one of his proudest moments. And according to Bean, “Another standout moment was the election of Barack Obama” because, according to the indicted sex offender, he “knew from the beginning what an important advocate [Obama] would be for [the LGBT] community.”\nSo chummy were these two that at a 2012 re-election fundraiser in Portland, Mr. Obama publicly thanked and acknowledged Bean for arranging the event. That same year, Bean told PQ Monthly how Mr. Obama’s re-election was vital:\nI’d like to see a Supreme Court with a solid majority of progressives. Over the next few years, many LGBT cases will be heard at the highest level and it’s critical that President Obama is reelected so he can nominate judges who will treat our community’s concerns fairly and with an open mind.\nSorry, but for the average citizen concerned about the direction of the country, it’s a tad disturbing to realize that an alleged child molester has inserted himself so far into the political process that when he’s not sodomizing boys or filming himself having sex with young gay men, he’s influencing presidential Supreme Court picks.\nYet all this controversy is not surprising, because it’s fairly well known that Barack Obama has other gay friends, some of whom also happen to like introducing young people to dubious sexual activities.\nRemember Kevin Jennings, Lambda Literary Award winner, gay activist, and founder of GLSEN, the LGBT organization that familiarizes public school children as young as kindergarteners with the homosexual lifestyle?\nObama appointed Jennings to the esteemed position of Assistant Deputy Secretary for the Office of Safe and Drug-Free Schools at the U.S. Department of Education from 2009-11. In other words, Barack Obama felt comfortable assigning someone the job of overseeing our schoolchildren’s safety who promotes books like “Passages of Pride,” wherein the author muses about a 15-year-old boy's relationship with a grown man.\nThat’s why it’s no surprise that Mr. Bean, who raised more than a half-million dollars in 2012 to re-elect Obama, is more than welcome at the White House, where he meets with people like the first lady and Obama’s political advisor David Simas.\nIronically, on Mr. Bean’s May 30th visit with Mr. Obama, the president was also hosting a “My Brother’s Keeper” task force meeting. Hopefully the “Brother’s Keeper” activities didn’t include Mr. Bean “keeping,” so to speak, a minority boy looking for a mentor in an older gentleman eager to help him succeed in both school and life.\nEither way, an article in Portland’s Willamette Week noted that when not doling out advice to the president, Mr. Bean was allegedly secretly filming sexual encounters with up to six individuals, including his 25-year-old ex-lover Kiah Lawson.\nThe newspaper said that when Mr. Lawson learned that Mr. Bean had secretly taped him, he asked for money. Bean responded by paying his young lover a $1,600 monthly stipend and taking him to prestigious events, including one at the White House where the star of some of Terrence Bean’s sex tapes got to meet the president.\nLawson’s mother, Tim Nouanemany, maintains that Kiah, who, like Bean, was also charged with two counts of third-degree sodomy and one count of third-degree sex abuse, never had contact with the 15-year-old victim. According to Nouanemany, Terry Bean arranged the encounter, plied her son with alcohol and Viagra, and after “grooming” Kiah, used him to “get young kids.”\nAnd so, on behalf of political correctness and thanks to a stunning lack of wisdom, discernment, and plain common sense, Barack Obama has once again made himself a companion of fools. Unfortunately, in so doing the President of the United States has also jeopardized his own reputation and mortified those he’s supposed to be leading.\nJeannie hosts a blog at www.jeannie-ology.com","url":"https://www.americanthinker.com/articles/2014/11/barack_obama_a_companion_of_fools.html"}
