{"authors":[],"date_download":"2018-10-22 23:19:45","date_modify":"2018-10-22 23:19:45","date_publish":"2017-03-16 06:18:22","description":"Barack Obama arrived in French Polynesia where he will spend a month at a luxury resort frequented by Hollywood stars, according to local TV channel Tahiti...","filename":"data/vaneerConsumption/BarackObamatospendamonthinFrenchPolynesia.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/06/wire-226747-1489645104-903_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4318950_Barack-Obama-spend-month-French-Polynesia_1540250385.html","title":"Barack Obama to spend a month in French Polynesia","title_page":"Barack Obama to spend a month in French Polynesia | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Former US president Barack Obama landed on the tourist island Tahiti without his family for a month-long stay at a luxury resort, according to local TV channel Tahiti Nui TV\nBarack Obama arrived in French Polynesia where he will spend a month at a luxury resort frequented by Hollywood stars, according to local TV channel Tahiti Nui TV.\nThe former US president landed on the tourist island Tahiti without his family before going to Marlon Brando's privately owned retreat Tetiaroa atoll, which the Oscar-winning actor bought in the 1960s.\nObama has checked into the eco-friendly Brando resort, whose villas boast their own plunge pools and cost between 2,000 euros ($2,150) and 12,300 euros per night.\nNo political meetings have been announced during Obama's stay and it is not clear what he plans to do during the sojourn or whether his family will join him.\nBut the former leader of the free world and his wife Michelle have signed a bumper book deal with Penguin Random House estimated to be worth as much as $60 million.\nFrench Polynesia, a French territory in the South Pacific, is made of more than 100 islands and is best known for the French nuclear tests carried out there up to the mid-1990s.","url":"https://www.dailymail.co.uk/wires/afp/article-4318950/Barack-Obama-spend-month-French-Polynesia.html"}
