{"authors":[],"date_download":"2018-10-30 00:53:43","date_modify":"2018-10-30 00:53:43","date_publish":"2017-01-20 00:00:00","description":null,"filename":"data/vaneerConsumption/BarackObamasDismalEnergyLegacy.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2017_01_barack_obamas_dismal_energy_legacy_1540860823.html","title":"Barack Obama's Dismal Energy Legacy","title_page":"Barack Obama's Dismal Energy Legacy","title_rss":"NULL","source_domain":"americanthinker.com","text":"Barack Obama's Dismal Energy Legacy\nIn a laughable Wall Street Journal op-ed (\"How Using Less Oil Helps the Economy\"), two Obama advisers proclaim that forced reductions in energy usage benefit American consumers. Due to restrictions such as EPA fuel standards, drivers are using slightly less oil than they were in 2008. The Obama advisers, Brian Deese and Jeff Dients, claim that forced conservation has \"played an important role\" in keeping oil prices low. All in all, they argue that fuel economy mandates and other strong-arm tactics have been good for Americans. If you like your truck, forget about it – you can't keep it. Obama has already driven many of the large trucks and cars off the roads. The luxury Lincoln Towncar and Cadillac DTS are now distant memories, though in 2008 they were spectacular top-of-the-line vehicles. The EPA plans to continue tightening mileage standards on cars and trucks, ramping up mileage mandates on light-duty vehicles overall by 10 miles per gallon by 2025. If not reversed, these fuel standards will transform the nature of the American fleet, and not for the better. By 2025, Americans on average will be forced to purchase a Toyota Prius or smaller vehicle. Each large truck sale will have to be offset by something on the order of a Chevy Volt or Nissan Leaf.\nTen miles per gallon over twenty years is a lot, but it's just the beginning. Given free rein, EPA planners would have us all driving souped up golf carts. Plug-ins are the darling of the environmental movement at present, but even that may be too much. Why not bicycle to work? Why not walk? Obama officials believe that restrictions on consumption, accompanied by production cuts, will benefit consumers and the overall economy. Yet the oil price declines that Deese and Zients allude to are not the result of government policies; they are a predictable outcome of longstanding market cycles. When the global oil price rose to above $110 per barrel early in 2011 and remained high through mid-2014, drillers increased production. Excessive production led to a price collapse to $26 per barrel at the late 2015 low. In response to that collapse, drillers cut their rig count from nearly 2,000 rigs at the high in early 2015 to 400 by mid-2016. Significantly, that count has now risen to 659 as of mid-January 2017. As a result, U.S. production is increasing. The market cycle seems to be news to Obama energy officials, who seem to think that draconian restrictions on consumption can benefit consumers while the free market cannot. In reality, compulsory measures never work because they distort the market, and market forces, whether of consumption or production, always come back with even greater force. Attempts to pressure Americans out of large trucks and SUVs have only resulted in greater demand. The Ford F150 truck remains America's bestselling vehicle. Market coercion also has a devastating effect on fuel prices. At the same moment when Deese and Zients claim victory for lower oil prices, which they see as resulting from coerced vehicle selection, those prices are moving higher. No one can predict the future of energy prices, but it seems likely that they will not decline to recent lows any time soon. The U.S. Energy Information Agency predicts average WTI oil prices of $52.50 per barrel for 2017, rising to $55.18 in 2018. EPA fuel standards have not had a decisive effect on oil prices, partly because they have been offset and more by Obama administration restrictions on drilling. While prices are largely driven by market cycles, those restrictions have made prices for both oil and natural gas marginally higher than they should have been – and at the expense of consumer choice. Deese and Zients don't address the inconvenient truth that Obama's policies have impacted not just oil, but natural gas prices, which have doubled since early 2016. Natural gas prices are notoriously volatile, but if prices were to double again, the American people, who rely on natural gas for more than half of home heating as well as business and industrial uses, would suffer real pain, and the economy would take a hit. Who's to blame for these rapid energy price increases? As with all commodities, market forces play a major role. But the market price mechanism is not the only thing at work. Obama's restrictions on drilling and, equally important, on the construction of new pipelines, have suppressed production and distribution, thereby increasing long-term prices. Obama's energy policies are an additional tax placed upon American consumers and businesses – not just on home heating costs, but on the entire chain of goods and services that rely on energy for production and distribution. Hospitals and schools budget a significant amount of money for heating, lighting, and operation of equipment, and any increase in energy costs must be passed along to consumers and taxpayers. The same is true of every retail and service establishment, including non-profits and government. Purely for political reasons, Obama has blocked construction of the Keystone XL, Dakota Access, and other pipelines, all of them designed to exceed federal safety and environmental regulations. These pipelines would have lowered gas prices for Americans by transporting natural gas from remote locations such as the Bakken shale fields of western North Dakota to heavily populated areas in the East, Midwest, and South. Blocking pipeline construction means that gas, when available at all, must be transported in costlier ways. Moreover, Obama has blocked practically all new oil and gas exploration in Atlantic and Arctic offshore areas and on federal lands. The long-term effect of these policies, if not reversed, will be to drive up prices and put American energy independence at risk. Even with vast reserves on private lands, including those in the Bakken, Eagle Ford, and Woodford shale fields, and new discoveries in the Permian Basin region, America's oil and gas production will decline long-term if access to offshore and federal lands is denied. Finally, Obama's environmental regulation restricting methane release and litigating unsubstantiated claims of groundwater pollution has led to delays, cancellation, and greater costs for oil and gas production. These costs are also passed along to consumers. The shame is that Obama seems to have cared more for the support of a small number of well heeled environmentalists than he does for the well-being of ordinary Americans and for the economic and military security of his country. A Trump presidency holds out great promise for the energy sector and for the well-being of every American. Reversing Obama's restrictions on drilling and pipeline construction, scaling back fuel mandates, and eliminating fraudulent environmental obstructions will unleash greater production and restore choice for consumers. The American people can sleep more soundly – in the comfort of their warm homes – knowing that for decades if not centuries, they and their descendants will enjoy lower energy prices and that the American economy will benefit from this advantage. Trump has vowed to place America first, and his proposed reversal of Obama's energy policies are a prime example of this dramatic change in outlook. The next eight years should be good ones for American energy producers and, even more so, for American consumers and businesses. Jeffrey Folks is the author of many books and articles on American culture including Heartland of the Imagination (2011).","url":"https://www.americanthinker.com/articles/2017/01/barack_obamas_dismal_energy_legacy.html"}
