{"authors":[],"date_download":"2018-10-30 01:13:58","date_modify":"2018-10-30 01:13:58","date_publish":"2015-07-17 08:00:00","description":null,"filename":"data/vaneerConsumption/BarackandValeriesGreatCommunistPartyMarriage.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/07/Screen20Shot202015-07-1620at208.03.5120PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862038.html","title":"Barack and Valerie’s Great Communist Party Marriage","title_page":"Barack and Valerie’s Great Communist Party MarriageThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"In my current book, Takedown: From Communists to Progressives, How the Left Has Sabotaged Family and Marriage, I write of the phenomenon of Communist Party marriages. “Theirs was the first ‘party marriage’ that I observed,” wrote Whittaker Chambers in Witness, describing the decidedly non-sacramental marriage of two of his Communist Party comrades, before writing of his own “party marriages.”\nFrom Marx and Engels, to Herbert Marcuse and Wilhelm Reich, to Betty Friedan and Kate Millett, to Bill Ayers and Bernardine Dohrn, our comrades on the far left have bequeathed a legacy of noxious ideas on marriage and family. Their political-cultural wreckage is being felt today more than ever. In many ways, it has come to full fruition only now in a culture that gleefully redefines marriage and gives us the likes of Barack Obama and Valerie Jarrett in the White House, a damaging political marriage if there ever was one. For seven years now at their home-base at 1600 Pennsylvania Avenue, Obama and Jarrett have been politically and ideologically inseparable. Their White House wedding has fundamentally transformed the country.\nSure, Barack’s matrimonial vow might be to Michelle, but his ideological soulmate has long been Valerie Jarrett. And both Barack and Valerie hail from a truly remarkable line of mentors and family members with deep fidelity to the American Communist Party.\nThose political bloodlines are so stunning, so bizarre, especially when they intersect across the generations, that people often react dismissively when presented with the information. I’ve laid out the linkages probably more than anyone, mainly in a book on Obama’s mentor, Frank Marshall Davis, who was a hardcore member of Communist Party USA (card no. 47544) and in several major articles on Valerie Jarrett for The American Spectator, the first one running about 5,000 words and appearing in the July/August 2011 print edition.\nAgain, the common lines are just incredible—but they are real. And the connections get even more jaw-dropping when you toss in mentors for a third leg of the political trinity responsible for two presidential terms of Barack Obama, one David Axelrod. Axelrod was also influenced by comrades with fond commitments to Communist Party circles, and specifically in rotten, politically misbegotten Chicago. I’ve written of Axelrod’s background, too, for The American Spectator, including a cover piece in the March 2012 print edition.\nSo, why am I writing now? What’s the latest in this nightmarish political soap opera?\nMy latest offering here is prompted by the fine work of Judicial Watch, which has obtained by FOIA request the FBI files of three crucial figures who formed Valerie Jarrett, Obama’s most intimate adviser. The three are Jarrett’s father, James Bowman, her father-in-law, Vernon Jarrett, and her grandfather, Robert Rochon Taylor. Judicial Watch has posted these documents online, and I’ve suffered through them carefully with a mix of amazement, agony, and despair for what has happened in this country. They are at once disturbing and depressing, yet further confirmation that the most politically extreme individuals who once agitated and propagandized in our blessed country were able to place their political children as high as the White House in the 21st century. For the old comrades, it simply took time for the seeds to root and flourish—and only then with the harvest made possible by really oblivious American voters who don’t understand the ash-heap of ideological baggage they’ve permitted to be brought into the country’s first house.\nI’ll first highlight what’s new in the Judicial Watch cache and then delve into some further connections and insights unique to my knowledge of these individuals and their associations.\nWhat is new is that these files show the highly disturbing level of communist work and associations by no less than three men very close to Valerie Jarrett. They show beyond any doubt that our current president—who I’ve here described as our first Red-Diaper Baby President—has been steered by a longtime leading adviser who, without question, has the classic rearing of a red-diaper baby. Beyond that, the FBI files on Jarrett’s father, James Bowman, are the single biggest revelation. I was plainly not aware of the reservoir of radical activity by Bowman. In my previous research, I could find nothing on Bowman, though I found quite a bit on Vernon Jarrett and a small amount on Robert Rochon Taylor. The Bowman material is shocking.\nAnd finally, though I did not see the name of Frank Marshall Davis, Obama’s mentor, in these files, I’m now even further certain that Davis would have not only known these men but worked closely with each. They were all in Chicago at the exact same time and all operating in the exact same close-knit circles of the city’s Communist Party generally and of a much smaller group of African-American communists specifically. Even tinier still, they were Chicago-based African-American communist writers, journalists, Party activists, and agitators. There is simply no way—no way—that James Bowman, Vernon Jarrett, Robert Rochon Taylor, and Frank Marshall Davis did not know and work together. Unimaginable. And thus, here’s an equally intriguing thought: There is simply no way that our nation’s political-ideological first couple, Barack Obama and Valerie Jarrett, have not had fond conversations reminiscing about this common ancestry. Boy, to be a fly on the wall for one of those rosy reminiscences down the old Party lane….\nThat said, here is a person-by-person breakdown of what the Judicial Watch material has unearthed, courtesy of the now publicly viewable FBI files, sprinkled with my own observations:\nFirst, James Bowman. Born in Washington, D.C., February 5, 1923, Bowman eventually resided in Chicago and Denver before moving to Iran in 1955, where Valerie was born. The FBI files state that he attended Howard University from 1939-46, earning a bachelor’s degree in biology followed by a medical degree. He would work for at least two different hospitals in Washington before moving to Chicago to work for Provident Hospital. It was in Chicago that—like Frank Marshall Davis, like Barack Obama—Bowman earned his radical sea-legs and began his political path. He lived in Chicago from roughly 1947-53, precisely when Frank Marshall Davis launched his Chicago Star Communist Party-line newspaper.\nValerie’s father had numerous communist ties. He was a member of a front-group that is new to me, the Association of Internes [sic] and Medical Students, which Congress described as “an organization which has long been a faithful follower of the Communist Party line.” He was very active on the student front, including with the communist group, American Youth for Democracy, one of Frank Marshall Davis’ favorite organizations. Among other groups listed in Bowman’s file that were likewise favorites of Davis were the International Labor Defense and the awful American Committee for Protection of Foreign Born (ACPFB).\nA few words on ACPFB: This group had been so extreme that the Democratic Congress’s huge “Investigation of Un-American Propaganda Activities in the United States” (published in 1944) devoted a lengthy 15-page section just to ACPFB, atop innumerable added references elsewhere in the report. Key members included prominent African-American communists Langston Hughes and Paul Robeson, the gushing admirer of Joe Stalin, plus the usual assemblage of duped liberals/progressives, ranging from theologian Reinhold Niebuhr, to the great Orson Welles, to famed movie actor Edward G. Robinson.\nAs the Congressional report noted, ACPFB “was founded by the Communist Party in order to exploit racial divisions in the United States for its own revolutionary purposes.” Its modus operandi was to polarize Americans along racial lines in order to advance the Soviet agenda. Closely linked to International Labor Defense, the primary (concealed) intention of ACPFB was to protect foreign communists who came to America and agitated for the Soviet Comintern. The core objective was to prevent deportation of these foreign-born communists living in America. One such figure was German communist Gerhart Eisler, who became a major CPUSA cause, and whose name was omnipresent throughout Frank Marshall Davis’s Chicago Star.\nFew communist fronts so directly served Soviet interests. Quite deservedly, ACPFB was designated as a subversive group by the office of President Truman’s attorney general, Tom Clark.\nIt is no surprise that ACPFB remained the one group that Frank Marshall Davis embraced through his final stages of life. They were two peas in a pod. No other front so perfectly identified with Davis’s interests and public work, especially his shameless race-based political agitation on behalf of Moscow.\nAnd so, James Bowman, according to his FBI file, likewise was involved with this group in some capacity, the details of which are not clear.\nMore specifically, Bowman’s file also refers to his involvement with the Abraham Lincoln School in Chicago, where Frank Marshall Davis not only taught at the time but also met his future wife, Helen, who was also a Party member. And most alarming, Bowman’s file states that he was in communication with a paid Soviet agent named Alfred Stern, identified as “one of the principal subjects in the MOCASE,” which was a Soviet espionage ring in the late 1950s run by Jack and Myra Soble. After being pursued for espionage in the United States, Stern in 1957 fled to the USSR and later settled in Prague, finding safe haven behind the Iron Curtain. He would serve as an adviser to Fidel Castro while living in Cuba for a time. He died in Prague in June 1986.\nFinally, James Bowman appears to have been under special surveillance by the federal government because of his negative involvement with the European Recovery Program—i.e., the Marshall Plan. Most of the documents in his file list precisely the ERP as the subject of interest. A number of the documents are printed not only on letterhead from FBI headquarters, but apparently come directly from J. Edgar Hoover himself, including, for instance, a February 28, 1955 Hoover-signed memo and a March 2, 1955 “AIRTEL” cable from Hoover that is copied to a list of over a dozen of the highest-level bureau officials, including Clyde Tolson. Though I cannot be certain, they seem to suggest Hoover’s possible personal knowledge of Bowman.\nThis ERP/Marshall Plan association is very intriguing, and troubling. One of the most insidious forms of Communist Party agitation in the 1940s and 1950s was to frame the Marshall Plan as a form of vile American imperialism. It was the Kremlin line, pushed by Stalin and Molotov and mimicked by Communist Party USA. One of the worst peddlers of this line was Frank Marshall Davis, who characterized the Marshall Plan in his columns as a “device” to maintain “white imperialism.” The plan, by Davis’s rendering, was a disgusting “oppression of non-white peoples everywhere,” a slavery purchased by Secretary of State Marshall’s “billions of U.S. dollars… to bolster the tottering empires of England, France, Belgium, Holland and the other western exploiters of teeming millions of humans.”\nAgain, this was insidious, a crass communist smear of a historic act of American generosity, but it was what American communists like Davis, being loyal Soviet patriots, were pushing. Was James Bowman doing the same thing? I cannot tell from what Judicial Watch has released in his FBI file, but I can say that Bowman’s work for or position on the Marshall Plan was the item of special concern to the FBI.\nIn sum, Valerie Jarrett’s father had quite a political history, one that raises numerous questions.\nAlas, one of Bowman’s comrades in his FBI file described him as a “healthy liberal.” Yeah, right. Just like Valerie and Barack are a couple of moderates.\nSecond, Vernon Jarrett. Likewise portrayed by the left as a mere liberal/progressive, Vernon Jarrett was born in Knoxville, Tennessee, June 19, 1918. He, too, ended up in Chicago in the tumultuous 1940s.\nValerie’s later father-in-law is aptly described by Judicial Watch as having been a “big-time Chicago Communist.” How big? Vernon Jarrett, like Frank Marshall Davis, was actually placed on the federal government’s Security Index. This meant that he could have been immediately detained or arrested in the event of a national emergency, such as a war breaking out between the United States and USSR—out of fear he would fight for the wrong side. That is no small accomplishment. It took some pretty prodigious anti-American activity to end up on that list.\nAccording to the FBI file, Vernon Jarrett was a member of the Communist Party from at least 1946 through 1948. His file is so filled with communist groups and activities that it makes your head hurt. One 20-page FBI report, dated November 20, 1950, contains (on page 15) a claim from one informant “of known reliability” that Jarrett was even part of a “1946 Fund Drive” for the Communist Party.\nIf that claim is accurate, then Valerie’s father-in-law was not only a member of the Communist Party but helped raise funds for it.\nVernon Jarrett wrote for the Chicago Defender, a left-wing newspaper, and was even fired from the Defender in 1948 because of his blatant communist activities. Frank Marshall Davis also wrote for the Defender at this time, one of many places where he interacted with Valerie Jarrett’s later father-in-law. Other such places were American Youth for Democracy, the International Workers Order, the Progressive Citizens of America (which was an excellent magnet for communists to dupe naïve Hollywood liberals), the Progressive Party, the Civil Rights Congress, and ACPFB. In most to all such cases, Jarrett would have worked with Frank Marshall Davis and also with James Bowman, Valerie’s father. They were all in the same organizations in the same city at the same time, all portraying themselves as merry “progressives” when, in truth, they were hardcore communists. One more group where Jarrett worked with at least Davis (I’ve seen no evidence of Bowman in this group, at least not yet) was the communist-controlled United Packinghouse Workers Union, where the two worked on the publicity committee together.\nWhen I read old copies of the Chicago Star a few years back for my book on Frank Marshall Davis, I do not recall coming across the name of Vernon Jarrett, who the FBI file describes as a frequent “free lance writer for Negro publications,” especially in Chicago’s left-wing ones. I would bet my house, however, that Jarrett wrote for Davis’s newspaper under an alias, which was common for communists. (To cite just one instance, the famed author Arthur Miller, a communist, wrote for communist publications under at least two pseudonyms.)\nTellingly, one of Jarrett’s close political pals, Metz Lochard, was among the investors in the so-called “Progressive Publishing Company” that in September 1948 bought the Chicago Star from Frank Marshall Davis, clearing the way for Davis to immediately move to Honolulu, where he would continue his Party work there and eventually embrace a young man named Barack Hussein Obama.\nIt was glorious Chicago, where the American Communist Party was born in September 1919, that was the political fairyland that made these arrangements possible.\nBringing this back to Valerie Jarrett and her immediate kin, there were so many connections between her later father-in-law, Vernon Jarrett, and her father, James Bowman, that I’m prompted to wonder if the two comrades introduced their son and daughter, respectively. Was Valerie’s marriage to William Robert Jarrett, Vernon Jarrett’s son, a Party marriage of some sort? I concede my ignorance of how Valerie and her husband met (they divorced after only a few years), but I can say that their parents surely knew one another in Chicago’s Communist Party extended family.\nIn fact, the circle of commie match-makers was wider still: Vernon’s wife, Fern Jarrett, according to informants quoted in the FBI file, was also a Communist Party member.\nFinally, Robert Rochon Taylor. The maternal grandfather of Valerie Jarrett was the first African-American head of the Chicago Housing Authority. His wife, Dorothy, born in Berkeley, California, was active in Planned Parenthood, the organization founded by racial-eugenicist Margaret Sanger, who, as I’ve written about here before, spoke to the KKK in 1926 and had hideous racial views and programs.\nIn my past research, it was not clear to me if Robert Taylor was a communist or a liberal/progressive duped and exploited by communists. I did not have enough information. The information secured by Judicial Watch, however, shows Taylor to be another serious communist.\nA March 18, 1955 AIRTEL cable, included among the declassified FBI documents, connects Robert Rochon Taylor (as well as James Bowman, his son-in-law) to Alfred Stern, the Soviet agent accused of espionage who fled to the Communist Bloc. The cable states that Taylor “had been in contact with Stern on a number of occasions.” Another document, an FBI memo dated April 22, 1955, states that Taylor “had numerous contacts with Alfred K. Stern.” More than that, a March 31, 1955 AIRTEL cable describes Taylor as a “former business partner of Alfred K. Stern.”\nThe files also reveal Taylor’s connections to the likes of William Patterson, the prominent African-American communist—who was a mentor to Frank Marshall Davis, Obama’s mentor—and to the Abraham Lincoln School.\nI had already suspected Taylor’s link to Patterson, before reading the Judicial Watch material. A few years ago I found the name “Robert R. Taylor” of Chicago in Congress’s 1944 report “Investigation of Un-American Propaganda Activities in the United States.” On pages 609 and 2,100 of the voluminous report, Taylor was flagged for his participation in the “Arrangements Committee” that organized the July 1939 Chicago Conference on Race Relations. Congress investigated this conference because of the presence of nationally known communist figures, including William Patterson, who was also on the Arrangements Committee.\nTaylor’s FBI file confirms and amplifies such relationships. It lists him as no less than a member of the advisory board of the Chicago Civil Liberties Committee, a front-group which Frank Marshall Davis frequently worked for, and, interestingly, as a “member of the Sponsoring Committee for a reception of Howard Fast” that was held in Chicago in November 1944. The Fast item is a definite red flag—figurative and literal. Howard Fast was the illustrious Stalin Prize winning “journalist” who was the most common op-ed contributor to Frank Marshall Davis’s Chicago Star.\nOverall, the Judicial Watch collection has less on Taylor than it does on James Bowman and Vernon Jarrett, but what it does contain is eye-opening.\nSo, to sum up, what should we make of all of this? Historically, it is quite valuable. But how politically relevant is it today?\nI’ll conclude with my usual caveat essential for liberal readers and their flare for knee-jerk reactions: No, none of this—obviously—means that Barack Obama and Valerie Jarrett are closet card-carrying members of the Communist Party, even as their political ancestors literally were.\nYet, we can say this: These two political soulmates are farther to the left than any ideological couple ever to run the White House, making Franklin and Eleanor Roosevelt look like right-wingers by comparison. Why is that? Do we care to ask, to try to ascertain? The answer isn’t rocket science.\nIf you want to understand how Barack and Valerie got so far to the left, or, better, started so far to the left, then you need to look—as any historian would—to their biographical-political ancestry, and especially to some common roots in Chicago, original home of the American Communist Party and the political home of men like Frank Marshall Davis, James Bowman, Vernon Jarrett, and Robert Rochon Taylor. To ignore these radical backgrounds in the intellectual development of Barack Obama and Valerie Jarrett would be downright stupid, and would constitute the kind of willful blindness that liberals eagerly impose upon themselves when they dare not want to expose the nasty skeletons in the “progressive” closet.\nIn short, if you want to understand just how and why our political first couple’s politics are so skewed left, and where Barack Obama and Valerie Jarrett fully came from, you need to stop and gaze at this ideological car-wreck along their road to the White House. Their work at 1600 Pennsylvania Avenue is the consummation of lifetimes of political-ideological experience. The influence of these figures in their early lives can indeed be overstated, but they should not be understated. It would be ludicrous to ignore these disturbing backgrounds as if they were completely inconsequential.\nAll of this matters. Liberals, in their hearts, know that it does. If, say, a George W. Bush and Karl Rove had had political ancestors with this kind of baggage tilted to the extreme right, every liberal in America would know about it and would have used it to torpedo Bush’s election to the White House.\nAnd yet, the saddest thing of all is that the vast majority of Americans generally, let alone liberals, could not give a damn about this. Their eyes are willfully covered as they pull the lever. And as they remain blind, the fundamental transformation of America continues.","url":"https://spectator.org/63484_barack-and-valeries-great-communist-party-marriage/"}
