{"authors":["Dana Varinsky"],"date_download":"2018-10-30 21:13:17","date_modify":"2018-10-30 21:13:17","date_publish":"2016-12-21 00:00:00","description":"Former First Daughter Barbara Bush is the co-founder of Global Health Corps, a nonprofit working to develop a new generation of leaders in the health sector.","filename":"data/vaneerConsumption/BarbaraBushHealthcareshouldnotbepolitical.json","image_url":"https://amp.businessinsider.com/images/58597865ca7f0ce9478b6671-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_barbara-bush-health-care-political-2016-12_1540933997.html","title":"Barbara Bush: Health care should not be political","title_page":"    Barbara Bush: Health care should not be political - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Barbara Bush at the 2015 Aspen Ideas Festival Global Health Corps Former first daughter Barbara Bush (George W. Bush's daughter) has spent the last seven years trying to get more millennials involved with global health issues — a mission she doesn't believe should be associated with politics at all.\nBush, 35, is the CEO and co-founder of Global Health Corps, a nonprofit attempting to develop a new generation of leaders in the health sector. Each year, the organization selects a class of young people — who must be under 30 — and gives them 13-month fellowships, matching them with organizations promoting health equity. Bush describes the model as a public health version of Teach for America — participants are placed with with nonprofits, government agencies, and local health care providers, with the hope that the fellows' experiences inform their careers.\nThe mission of Global Health Corps, which was founded in 2009, is to mobilize a network of emerging leaders whose professional and ideological motivations stem from the belief that health is a human right. Bush was recently named one of GLG's Social Impact Fellows because of the group's innovative approach and quick growth (last year, the organization got roughly 5,600 applications for 140 spots).\nUnlike many global health nonprofits, which focus their work in the poorest regions of the planet, Bush has always felt it was important for fellows to address problems in the US in addition to those in other countries.\n\"We wanted to make sure that our own country was part of the conversation about global health issues in two ways — one, making sure that we're not thinking of it as issues that affect other people that don't have anything to do with us, but also acknowledging that we can learn so much from what has gone well or new models that are effective in other countries,\" Bush tells Business Insider.\nBush says many fellows who come to work in the US from other countries are surprised by the systemic problems they encounter in poor urban areas. However, she doesn't believe that figuring out how to serve people who fall through the cracks should be considered a political act.\nIt's an approach that differs from much of the current conversation around health care in the US — given Republican opposition to the Affordable Care Act (President-elect Donald Trump promised to repeal the law), many aspects of the American health care system have become enmeshed in partisan politics.\nBush says that's the wrong way to approach the conversation. \"I think it's interesting that health is political, because I don't think it should be,\" she says. \"It's such a basic need for every human to be able to live a full life.\"\nBush says she sees two major problems with the US health care system. First, many people don't have access to health care, whether that's because they have language barriers; lack proper transportation; or can't afford fees, premiums, and copays. And second, our system is built to treat people when they get sick, but not to help them prevent illness and stay healthy. Attempting to fixing those issues — as Global Health Corps does — should not be seen as political, Bush says.\n\"Our model is one focused on service,\" she says. \"I hope that that is where we can come in conversations around health, is just understanding that dignity should be something that everyone has and is afforded.\"\nBarbara Bush (right) with three Global Health Corps fellows Global Health Corps\nBush admits, however, that the motivations behind fellowship applications seem to change with the political climate. When the Affordable Care Act brought the US health care system's shortcomings into the spotlight, for example, Bush says applications for US positions surged. The next round of Global Health Corps applications are now open (the window closes January 18), so Bush says she's curious to see what impact the recent election will have on the next cohort of fellows.\nSince Global Health Corps places fellows in positions according to the needs of its partner organizations, political changes can also affect fellows' job responsibilities. If Donald Trump repeals the Affordable Care Act and nearly 30 million people lose health insurance, for instance, the organizations in which fellows will be placed might need to reorganize or create positions to help them confront the challenges of this rise in uninsured patients.\n\"Based on any changes that might happen, I anticipate that what our partners would need would be fellows to help them navigate those changes and navigate how they will respond in order to continue serving people as best they can,\" she says.\nRegardless of what's in store for the healthcare landscape, Bush says her organization's goal will remain the same: To try to ensure that good health is not a luxury.","url":"https://www.businessinsider.com/barbara-bush-health-care-political-2016-12"}
