{"authors":["Sarah Barns For Mailonline"],"date_download":"2018-10-22 23:07:06","date_modify":"2018-10-22 23:07:06","date_publish":"2016-01-29 10:54:01","description":"Barbie has found herself at the centre of a social media storm after the doll's creators, Mattel Inc., announced she was going to be given a serious makeover - the first in her 57-year history.","filename":"data/vaneerConsumption/Barbiesdiversemakeoverattackedbywomenasforcingadulthangupsonkids.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/10/30B183FF00000578-0-image-a-91_1454064311099.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3422410_Social-media-users-slam-Barbie-s-diverse-makeover_1540249626.html","title":"Barbie's diverse makeover attacked by women as forcing 'adult hang ups on kids'","title_page":"Barbie's diverse makeover attacked by women as forcing 'adult hang ups on kids' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Life in plastic isn't quite as fantastic as first thought. Barbie has found herself at the centre of a social media storm after the doll's creators, Mattel Inc., announced she was going to be given a serious makeover - the first in her 57-year history.\nAfter the news broke that the figurine's famously unreal shape is going to be changed to embrace tall, curvy and petite body types, many fans took to social media to rejoice at the positive move.\nHowever, others have hit back saying it's not the revolutionary leap forward it seems and the new labels are 'problematic'. One commenter claimed that 'adult hang-ups' shouldn't be forced on children and many said there's no need for the plastic doll to be 'politically correct'.\nBarbie has found herself at the centre of a social media storm after the doll's creators, Mattel Inc., announced she was going to be given a serious makeover - the first in her 57-year history\nTwitter user Ella Whelan commented: 'If a girl is still young enough to play with #Barbie, she's too young to care about body image - stop putting adult hang-ups on children'\nElina Tumoi wrote online: 'Diversity is good but labelling one doll curvy and another petite, still problematic for me. #barbie #mattel #labels'\nTwitter user Ella Whelan stressed that this might have a negative impact on kids, commenting: 'If a girl is still young enough to play with #Barbie, she's too young to care about body image - stop putting adult hang-ups on children.'\nOthers believed the new shapes were a step in the right direction but dividing the dolls by different body types is still an issue.\nElina Tumoi wrote online: 'Diversity is good but labelling one doll curvy and another petite, still problematic for me. #barbie #mattel #labels.'\nA user called Renee echoed her sentiments adding: 'Barbie creating new shapes - love it! Labelling them by how they look - still an issue. #Barbie.'\nThe new curvy, tall and petite figurines will be sold alongside the original doll, pictured left and right\nA user called Renee echoed her sentiments adding: 'Barbie creating new shapes - love it! Labelling them by how they look - still an issue. #Barbie'\nA user with the online name V&C said: 'I think the new #Barbie campaign is nice but when I was a child they were just \"toys\" I never needed them to be politically correct'\nWhile a contributor called ALIX added: 'So even #Barbie has given into political correctness. Wonder if the doll was anything else but a blonde white female, wud they ave to change'\nJennifer Gove believes the excitement around the doll's shapes highlights a bigger role model issue. She wrote: 'I played with #Barbie. I didn't look up to her. I knew she was a toy. I looked up to people. We need to redo people. Barbie is just a toy'\nBarbie has been given a curvy makeover, pictured left and right, although on commenter said she doesn't look 'curvy enough'\nMany said that Barbie's body is not a 'politically correct' problem and she should just be viewed as a toy.\nA user with the online name V&C said: 'I think the new #Barbie campaign is nice but when I was a child they were just \"toys\" I never needed them to be politically correct.'\nWhile a contributor called ALIX added: 'So even #Barbie has given into political correctness. Wonder if the doll was anything else but a blonde white female, wud they ave to change.'\nMeanwhile Jennifer Gove believes the excitement around the doll's shapes highlights a bigger role model issue. She wrote: 'I played with #Barbie. I didn't look up to her. I knew she was a toy. I looked up to people. We need to redo people. Barbie is just a toy.'\nIn addition to having a new physique, Barbie has been made in seven different skin tones, a whopping 22 different eye colours and 24 separate hairstyles.\nThe original Barbie, who has long been criticised for setting unattainable beauty standards, is still available to buy alongside the new models.\nA user called Rae SC slammed the news: 'No. I'd rather teach my daughters to not compare themselves to a doll because it's not a real human and it's made of plastic. #Barbie'\nKayla Gross agreed: 'Maybe instead of changing a doll, we should be changing how we talk to girls about self-esteem and self-worth. #Barbie'\nFans can now buy a petite-shaped Barbie, pictured left and right, with accompanying clothes and accessories\nMany contributors said the makeover hadn't gone far enough to represent 'real people'\n'Where's transgender Barbie?' questioned one person, while another said: 'Omg why don't have a Lesbian #Barbie?'\nEvelyn Mazzocco, Senior Vice President and Global General Manager Barbie said: 'We are excited to literally be changing the face of the brand - these new dolls represent a line that is more reflective of the world girls see around them - the variety in body type, skin tones and style allows girls to find a doll that speaks to them.'\nThe brand made the announcement on Thursday on Twitter with the hashtag #TheDollEvolves and writing: 'We proudly add three new body types to our line. Meet the new dolls.'\nHowever, the statement met with some resistance from members of the public.\nA user called Rae SC slammed the news: 'No. I'd rather teach my daughters to not compare themselves to a doll because it's not a real human and it's made of plastic. #Barbie.'\nKayla Gross agreed: 'Maybe instead of changing a doll, we should be changing how we talk to girls about self-esteem and self-worth. #Barbie.'\nMany contributors said the makeover hadn't gone far enough to represent 'real people'.\n'Where's transgender Barbie?' questioned one person, while another said: 'Omg why don't have a Lesbian #Barbie?'\nTall Barbie, pictured left and right, is one of three new body types to have been introduced to the range\nOthers weren't happy with the new body types. Lydia Smith commented: 'Glad #Barbie has had a much-needed makeover - but the \"curvy\" one doesn't look so curvy to me'\nWhile a user called a princess added there wasn't much variety between the dolls: 'they all still have hourglass figures... but I'm happy to see what they've done thus far #Barbie'\nOthers weren't happy with the new body types. Lydia Smith commented: 'Glad #Barbie has had a much-needed makeover - but the \"curvy\" one doesn't look so curvy to me.'\nWhile a user called a princess added there wasn't much variety between the dolls: 'they all still have hourglass figures... but I'm happy to see what they've done thus far #Barbie.'\nSome men joined in the conversation and joked that the Ken doll will be the next to have an appearance overhaul.\n'Next question is Ken going to have moobs and a beer belly #Barbie,' said one. While another added: 'Curvy #Barbie? That's good. Now, where's #DadBod Ken?'\nThe new dolls are available online now at Shop.Mattel.com and will subsequently be available in stores.\n'For more than 55 years, Barbie has been a global, cultural icon and a source of inspiration and imagination to millions of girls around the world,' said Richard Dickson, President and Chief Operating Officer of Mattel.\n'Barbie reflects the world girls see around them. Her ability to evolve and grow with the times, while staying true to her spirit, is central to why Barbie is the number one fashion doll in the world.'\n'Next question is Ken going to have moobs and a beer belly #Barbie,' said one male user","url":"https://www.dailymail.co.uk/femail/article-3422410/Social-media-users-slam-Barbie-s-diverse-makeover.html"}
