{"authors":["Ciara Farmer","Becky Freeth For Mailonline"],"date_download":"2018-10-23 02:04:45","date_modify":"2018-10-23 02:04:45","date_publish":"2016-01-29 16:19:29","description":"Due to tie the knot with her long-term partner Justin Scott on Saturday, Kimberley was spotted heading inside St James Parish Church to check over the venue late this week.","filename":"data/vaneerConsumption/BarbadosweddingvenuewhereKimberleyWalshissettowedJustinScottthisweekend.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B3F50200000578-0-image-a-12_1454083574672.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422987_The-stunning-Barbados-wedding-venue-Kimberley-Walsh-set-wed-Justin-Scott-weekend_1540260285.html","title":"Barbados wedding venue where Kimberley Walsh is set to wed Justin Scott this weekend","title_page":"Barbados wedding venue where Kimberley Walsh is set to wed Justin Scott this weekend | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kimberley Walsh is set to be wed in the oldest church in Barbados this weekend.\nDue to tie the knot with her long-term partner Justin Scott on Saturday, Kimberley was spotted heading inside St James Parish Church to check over the venue after touching down on Monday.\nThe cosy, antiquated building is romanesque in design and full of tradition Anglican touches; the perfect spot for romantic nuptials.\nScroll down for video\nPICTURED: Kimberley Walsh and her partner Justin Scott are thought to be getting wed at this antiquated Barbados Church in Holetown on Saturday\nA source confirmed to MailOnline on Friday that the mum-of-one, who has brought their one-year-old son Bobby over to the Caribbean too, was seen at the location on Thursday night after rehearsals.\nSuited to the 30C and above temperatures at this time of year, the building is made from light, local limestone, complete with mahogany beams.\nIt features just enough space for friends and family to gather, seating 550 and with 360 other guests available to stand.\nThe church was built originally in 1628 but has been reconstructed twice in its history and is thought to be among four of the last remaining Anglican churches on the island.\nHappy couple: Kimberley was spotted arriving at the venue for a rehearsal on Thursday\nRomantic: The oldest church in Barbados, the ceremony will no doubt be steeped in tradition\nRomanesque: The venue is steeped with mahogany beams and stain glass windows\nEnough room for all: It's expected to hold just enough room for friends and family\nMarried in the morning: The duo have been together for 13 years now\nBridesmaids thought to be acting in the ceremony are former Girls Aloud bandmates, Cheryl Fernandez-Versini and Nicola Roberts.\nPreviously, The Mirror reported that Kimberley was due to wed outdoors at the luxury Bellevue Plantation.\nShe obtained the wedding certificate, accompanied by boyfriend Justin, on Tuesday and is now thought to be sharing the big day between the two idyllic locations.\nTraditional: Their venue was first built in 1628 but has been rebuilt twice\nGetting wed: The duo are expected to share their vows in front of one-year-old son Bobby too\nLook of love: The couple arrived in Barbados on Monday ahead of their nuptials\nKimberley and Justin, who have been dating for 13 years, arrived in the Caribbean on Monday with their 18-month-old son, Bobby as they started prep for their nuptials at the plantation.\nThe island spot, which is said to cost £10,000-a-day to hire, boasts a main house with a host of luxury features including full staff and an array of optional treats including beauty treatments, hairdressing and massage therapy.\nThe main house on the island contains eight bedrooms, suggesting other guests, including Cheryl and Nicola, will be staying at guest cottages on the idyllic island.\nPhotographs of the venue revealed stunning views, dreamy white sand beaches with turquoise seas and the grand mansion at the centre of the home.\nExquisite: The main house on the island contains eight bedrooms, suggesting other guests, including Cheryl Fernandez-Versini and Nicola Roberts, will be staying at guest cottages on the idyllic island\nTaking care of business: Kimberley and Justin were spied taking care of practicalities on Tuesday as they picked up their marriage certificates at local government offices\nKimberley and Justin were spied taking care of practicalities on Tuesday as they picked up their marriage certificates at local government offices.\nThe blonde beauty's bridesmaids, Cheryl and Nicola were spotted touching down looking incredibly chic as they nailed jet-set style.\nAlso arriving on the same Barbados bound flight was Denise Van Outen and her partner Eddie Boxshall, and actress Kara Tointon.\nStunning: The main house on the island contains eight bedrooms, suggesting other guests, including Cheryl Fernandez-Versini and Nicola Roberts, will be staying at guest cottages on the idyllic island\nPerfect setting: The duo will no doubt love drinking in the exquisite beach views\nKimberley told HELLO! magazine that she will not be able to look at close pal Cheryl during her big day, as she'll break down in front of the altar.\n'I used to be good at keeping up an icy exterior but since I had Bobby, I'm so much more emotional,' she explained. 'I'm slightly worried about the wedding to be honest.\n'A few happy tears are fine, but I don't want to spend the whole day sobbing, so I'm going to have to be careful about even looking at Cheryl and my sisters, because they'll definitely cry and that will set me off.'\nLuxurious: The house boasts a host of luxury features including lavish dining facilities","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422987/The-stunning-Barbados-wedding-venue-Kimberley-Walsh-set-wed-Justin-Scott-weekend.html"}
