{"authors":["Associated Press"],"date_download":"2018-10-23 02:24:27","date_modify":"2018-10-23 02:24:27","date_publish":"2016-01-11 14:27:09","description":"MADRID (AP) — Barcelona can expect a heated reception when it travels to Espanyol without striker Luis Suarez for the return leg in the Copa del Rey. Suarez ...","filename":"data/vaneerConsumption/BarcelonawithoutSuarezatEspanyolCopareturnderbymatch.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:4569151f58734ebdafd7b65e3d717773-48qEJGFphM8d437f0aaf925d4b06-215_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393975_Barcelona-without-Suarez-Espanyol-Copa-return-derby-match_1540261467.html","title":"Barcelona without Suarez at Espanyol Copa return derby match","title_page":"Barcelona without Suarez at Espanyol Copa return derby match | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Barcelona without Suarez at Espanyol Copa return derby match\nMADRID (AP) — Barcelona can expect a heated reception when it travels to Espanyol without striker Luis Suarez for the return leg in the Copa del Rey.\nSuarez was handed a two-match suspension for insulting some Espanyol rivals in the tunnel during a post-match altercation after the first leg. Two Espanyol players had been sent off in the 4-1 loss to Barcelona.\nWednesday's match could see Arda Turan and Aleix Vidal — who debuted for Barcelona in the first round — return for the Catalan powerhouse.\nFC Barcelona's Lionel Messi, right, reacts after scoring against Granada with his teammate Neymar during a Spanish La Liga soccer match at the Camp Nou stadium in Barcelona, Spain, Saturday, Jan. 9, 2016. (AP Photo/Manu Fernandez)\n\"The return match will be intense and exciting,\" Barcelona defender Gerard Pique said. \"It'll be played in a fun environment.\"\nWith Real Madrid disqualified, the other two teams in the capital will meet when Atletico Madrid takes on Rayo Vallecano following a 1-1 draw in the first leg.\nAlso, Sevilla holds a 2-0 lead over crosstown rival Real Betis.\nHere are some things to know about this week's Copa del Rey matches:\n___\nMASTERFUL MESSI\nLionel Messi scored twice against Espanyol and set up the other goals in the first leg.\nOver the weekend, the Argentine forward scored three in Barcelona's 4-0 league win over Granada, hitting the back of the net with three of the five shots he took.\n___\nFEARLESS FOE\nAtletico coach Diego Simeone considers Rayo to be a dangerous rival because it will need to play all-out and has nothing to lose.\nSimeone said the draw in the first leg was \"fair\" because Rayo knew how to pressure his squad almost to a standstill.\n\"It is a very dangerous team, especially in this return leg, because the players will have no fear,\" Simeone said. \"They are always offensive and that gives them an edge.\"\n___\nGARY'S IMPETUS\nThe arrival of Gary Neville as coach at Valencia has yet to unleash the club's attacking potential.\nAlthough the team looked convincing in its 4-0 win over Granada in the first leg and managed to hold Madrid to a 2-2 draw in the league, Valencia's last match was a 2-0 loss at Real Sociedad.\nThe Copa del Rey could be Neville's best shot at a trophy this season if he can coax more goals from forwards Alvaro Negredo — who scored a hat trick in the Granada win — and Rodrigo Moreno.","url":"https://www.dailymail.co.uk/wires/ap/article-3393975/Barcelona-without-Suarez-Espanyol-Copa-return-derby-match.html"}
