{"authors":["Pete South For Mailonline"],"date_download":"2018-10-23 01:26:47","date_modify":"2018-10-23 01:26:47","date_publish":"2017-03-16 11:22:07","description":"Barcelona are planning to try and lure midfielder Thiago Alcantara back to the club, four years after he left to join Bayern Munich on the cheap.","filename":"data/vaneerConsumption/BarcelonaplanningmoveforThiagoAlcantara.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3D01C89F00000578-0-image-a-18_1489663219663.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319764_Barcelona-planning-Thiago-Alcantara_1540258007.html","title":"Barcelona 'planning move for Thiago Alcantara'","title_page":"Barcelona 'planning move for Thiago Alcantara' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Barcelona are planning to try and lure Thiago Alcantara back to the club, four years after he left to join Bayern Munich.\nAlcantara was snapped up by former Barcelona boss Pep Guardiola during his time with Bayern after the talented midfielder's release clause dropped to around £15million because he didn't play 60 per cent of Barcelona's matches.\nAccording to Spanish source Cadena Ser, Barca's Sporting Director, Robert Fernandez, was in attendance for Bayern's Champions League demolition of Arsenal ahead of a potential swoop for the 25-year-old.\nThiago Alcantara is reportedly wanted by Barcelona after starring against Arsenal\nHe is contracted with the German giants until 2019, and according to reports they have no intention of selling one of the key members of their squad.\nOne potentially key factor in negotiations could be the presence of his brother, Rafinha, at the Nou Camp.\nArsenal and Manchester City have also been tentatively linked with a swoop for Alcantara, who starred with a brace in the first leg of Bayern's 10-2 aggregate win against the Gunners.\nCatalan paper El Mundo Deportivo say they also had scouts at the Emirates Stadium for the game.\nHe left Barcelona four years ago on the cheap after Bayern activated his release clause","url":"https://www.dailymail.co.uk/sport/football/article-4319764/Barcelona-planning-Thiago-Alcantara.html"}
