{"authors":["Will Martin"],"date_download":"2018-10-30 21:28:00","date_modify":"2018-10-30 21:28:00","date_publish":"2016-12-20 00:00:00","description":"Barclays has consistently been the most pessimistic major bank in the aftermath of Brexit, but it no longer expects Britain to enter a recession in 2017.","filename":"data/vaneerConsumption/BarclaysrevisespostBrexitgrowthforecastsupwards.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_barclays-revises-post-brexit-growth-forecasts-upwards-2016-12_1540934880.html","title":"Barclays revises post-Brexit growth forecasts upwards","title_page":"    Barclays revises post-Brexit growth forecasts upwards - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Johann Konig/Flickr When Britain voted to leave the European Union on June 23, economists almost universally predicted one thing — a technical recession would happen within a couple of years, as the UK adjusts to realities of leaving the EU.\nBy September, virtually every major institution had rowed back on forecasts, following a slew of better than expected economic data coming out of the country.\nOne bank, Barclays, remained staunch in its belief that a recession was coming, arguing until the start of November that Britain would tumble into its first recession since the financial crisis in 2017 as the impact of Brexit takes hold.\nBarclays — which in the immediate aftermath of the referendum was the most bearish of all major banks on the UK economy — insisted that a \"slow fuse\" recession remained on the cards right up until Q3 GDP growth smashed expectations. According to the ONS' data, GDP grew by 0.5% in the quarter, above the consensus forecast of economists who saw growth increasing just 0.3%.\nThe GDP beat pushed the bank's UK economists Fabrice Montagne and Andrzej Stepaniak to reconsider that position and reassess their forecasts to suggest that instead of suffering a recession — two consecutive quarters of negative growth — Britain's economy would shrink for just one quarter, and grow by 0.7% across the whole 0f 2017.\nThe pair have now bumped up their forecasts once again, writing last Friday that they expect the British economy to grow every quarter next year, and for growth to run at 1% over the full year.\n\"The main reason for this change is ongoing resilience in sentiment and data, as well as new risks that the withdrawal process could be delayed even further,\" they wrote.\nIn the note, titled \"Drawn out slowdown replaces crash and bounce,\" Montagne and Stepaniak put much of the rebound in their forecasts down to the continuing uncertainty surrounding Brexit, meaning that businesses are delaying decisions about possibly moving operations away from the UK.\nHere is the key extract (emphasis ours):\n\"Uncertainty about the timing of Brexit has likely prevented companies from acting upon the risks that an exit from the EU entails. According to results of a survey we conducted with Barclays' corporate clients, Brexit is not universally perceived as a major disruptive event.\n\"However, conflicting surveys have highlighted that there can be substantial differences in views on the impact of Brexit for businesses. We believe that the difficulty in properly assessing the ramifications of Brexit, as well as the length of the process, means that downside risks will only materialise gradually and lead to growth being lower for longer, rather than seeing GDP crash and rebound.\"\nClearly, Brexit will be no economic cakewalk. Jobs are going to move out of the country, with Japanese banks, as well as Lloyd's of London both already saying they will almost certainly be moving some operations.\nOn top of that, UK investment collapsed by £15 billion between July and September, according to the ONS. That was only the fifth time there has been a quarterly decline in UK investment since 1987.\nBrexit will be tough on the British economy, no doubt, but do not expect a recession.","url":"https://www.businessinsider.com/barclays-revises-post-brexit-growth-forecasts-upwards-2016-12"}
