{"authors":["Ben Moshinsky"],"date_download":"2018-10-31 00:09:27","date_modify":"2018-10-31 00:09:27","date_publish":"2016-12-02 00:00:00","description":"There was 'a near-record net capital outflow' of $207 billion in the third quarter this year, according to a note from Barclays.","filename":"data/vaneerConsumption/BARCLAYSChinacapitaloutflowsatnearrecordlevels.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_barclays-note-on-china-capital-outflows-at-near-record-levels-2016-12_1540944567.html","title":"BARCLAYS: China capital outflows at 'near-record' levels","title_page":"    Barclays note on China capital outflows at 'near-record' levels - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A delegate from an ethnic minority group uses binoculars during the second plenary session of the National People's Congress (NPC) in Beijing March 9, 2009. REUTERS/China Daily (CHINA POLITICS SOCIETY) CHINA OUT. NO COMMERCIAL OR EDITORIAL SALES IN CHINA Reuters Money is flowing out of China again.\nSpurred on by a strengthening dollar and weakening Chinese currency, there was \"a near-record net capital outflow\" of $207 billion in the third quarter this year, according to a note from Barclays.\nBarclays analysts Jian Chang and Yingke Zhou said: \"Firmer expectations of a Fed rate hike and a stronger USD under President-elect Trump's expected fiscal and industrial policies point to continued capital outflow pressures for China, in our view.\"\n\"Other indicators, such as banks' cross-border payments and receipts, and banks' FX purchase and sales, also point to rising capital outflows,\" Barclays said.\nHere is the chart from Barclays:\nBarclays\nWhile the outflows are not quite as severe as those seen in the second half of 2015 after China's market crash, the country has a smaller reserve pile to deal with them.\nPropping up the Chinese currency by selling dollars has been a key policy to steady the ship, but it means dipping into the country's foreign exchange reserves.\nFX reserves \"have fallen by $530 billion since August 2015 to $3.12 trillion as of October this year, the lowest level since 2011,\" the Barclays analysts said.\nThis leaves policymakers with the option of tightening regulation rather than fiddling with market pricing. According to a Reuters report this week, the State Administration of Foreign Exchange is restricting foreign transfers worth $5 million or more and cracking down on big investment deals abroad.","url":"https://www.businessinsider.com/barclays-note-on-china-capital-outflows-at-near-record-levels-2016-12"}
