{"authors":["Press Association"],"date_download":"2018-10-23 02:35:09","date_modify":"2018-10-23 02:35:09","date_publish":"2017-03-10 11:47:04","description":"Barcelona fans literally made the earth move at the Nou Camp when Sergi Roberto's dramatic late goal saw them claim a remarkable win over Paris St Germain on Wednesday.","filename":"data/vaneerConsumption/BarcelonafanscauseEARTHQUAKEcelebratinghistoricwin.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E1548AE00000578-0-image-a-39_1489146217222.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4300948_Barcelona-fans-celebrating-create-mini-earthquake_1540262109.html","title":"Barcelona fans cause EARTHQUAKE celebrating historic win","title_page":"Barcelona fans cause EARTHQUAKE celebrating historic win | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Barcelona fans literally made the earth move at the Nou Camp when Sergi Roberto's dramatic late goal saw them claim a remarkable win over Paris St Germain on Wednesday.\nRoberto scored five minutes into stoppage time to complete a 6-1 win on the night as Barca, who trailed 4-0 after the first leg, progressed to the quarter-finals of the Champions League with one of football's greatest-ever comebacks.\nThe roar and celebrations from Barcelona's fans was recorded on the Richter scale - a measurement used to record earthquakes - at the Jaume Almera Institute of Earth Sciences (ICTJA-CSIC), which is 500 metres away from the stadium.\nBarcelona fans celebrating their late winner in the Champions League against Paris Saint-Germain created an earth tremor that measured one on the Richter scale\nThe Jaume Almera Institute of Earth Sciences near the Nou Camp picked up the tremor\nBarcelona's second and third goals nudged the centre's recordings slightly before the match-winning goal measured one on the Richter scale - making it a microearthquake.\nThe tremors were unlikely to be felt by people on the ground but are registered on seismographs.\nResearcher Jordi Diaz told AS.com: 'As the end of the game approached, everything changed. With the sixth goal, there is the greatest earthquake of its type recorded at ICTJA-CSIC.'\nThe micro-earthquake occurred when Sergi Roberto scored Barcelona's stoppage-time winner\nSergi's goal meant Barcelona beat PSG 6-5 on aggregate having trailed 4-0 after the first leg","url":"https://www.dailymail.co.uk/sport/football/article-4300948/Barcelona-fans-celebrating-create-mini-earthquake.html"}
