{"authors":["Michael Gadd For Mailonline"],"date_download":"2018-10-23 05:40:45","date_modify":"2018-10-23 05:40:45","date_publish":"2016-01-11 18:39:10","description":"Barcelona boss Luis Enrique claimed FIFA's top coaching award ahead of Bayern Munich's Pep Guardiola and Chile's Jorge Sampaoli at Monday night's Ballon dOr ceremony in Zurich.","filename":"data/vaneerConsumption/BarcelonasLuisEnriquenamedFIFAWorldCoachoftheYearatBallondOr2016.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/19/300DBAE900000578-0-image-a-29_1452538903946.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3394398_Barcelona-boss-Luis-Enrique-named-FIFA-World-Coach-Year-Ballon-d-gala_1540273245.html","title":"Barcelona's Luis Enrique named FIFA World Coach of the Year at Ballon d'Or 2016","title_page":"Barcelona's Luis Enrique named FIFA World Coach of the Year at Ballon d'Or 2016 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Barcelona boss Luis Enrique claimed FIFA's top coaching award ahead of Bayern Munich's Pep Guardiola and Chile's Jorge Sampaoli at Monday night's Ballon dOr ceremony in Zurich.\nUnder the club's former midfielder, Barca won the Champions League, La Liga, Copa del Rey and the Club World Cup during the judging window for this year's award.\nEarlier in the evening, four Barcelona stars were named in the FIFA World XI - Dani Alves, Andres Iniesta, Neymar, Lionel Messi - with Messi pipping Neymar to the top prize.\nLuis Enrique was named FIFA's World Coach of the Year at the Ballon d'Or ceremony on Monday night\nBarcelona congratulate their manager Enrique on his award after winning five of six possible titles in the year\nBarcelona technical secretary Robert Fernandez accepts the Coach of the Year award on Enrique's behalf\nEnrique celebrates with his staff after beating Juventus in the Champions League final in Berlin in June 2015\nBALLON D'OR 2015 WINNERS Ballon d'Or: Lionel Messi (Barcelona) Fifpro World XI: Manuel Neuer (Bayern Munich); Thiago Silva (PSG), Marcelo (Real Madrid), Sergio Ramos (Real Madrid), Dani Alves (Barcelona); Andres Iniesta (Barcelona), Luka Modric (Real Madrid), Paul Pogba (Juventus); Neymar (Barcelona), Lionel Messi (Barcelona), Cristiano Ronaldo (Real Madrid) Women's Coach of the Year: Jill Ellis (USA) Puskas Award: Wendell Lira (Vila Nova) Women's Player of the Year: Carli Lloyd (USA)\nEnrique was absent from the ceremony in Switzerland due to his 'busy schedule', said Barca technical secretary Roberto Fernandez who accepted the trophy on his behalf.\nA strong favourite before the ceremony, Enrique received 31.08 per cent of the votes, ahead of Guardiola's 22.97 per cent Sampaoli, who earned 9.47 per cent.\nBarcelona's official website congratulated their head coach: 'It comes in recognition of an incredible 2015 in which he led FC Barcelona to five out of six titles, and became the second manager of the club to win the treble of both domestic titles and the Champions League, rounding off a wonderful 12 months with the Club World Cup crown in Japan.'\nGuardiola, whose already announced he's leaving Bayern at the end of the season, won the same award in 2011 when boss of Barca.\nFernandez, also a former Barca player like Enrique, paid tribute to the coach and his fellow finalists\nEnrique gives a speech after leading Barca to the La Liga title at the Nou Camp in May 2015\nEnrique's Treble-winning year was capped off by beating River Plate in the final for the FIFA Club World Cup\nFour of Enrique's Barca players, Dani Alves, Andres Iniesta, Neymar, Lionel Messi made the World XI\nIn the past year he's led the Munich giants to their third Bundesliga title and the Champions League semi-final. His side are eight points clear at the top of the Bundesliga table with his next stop hotly tipped to be Manchester City.\nSampaoli won his place on the shortlist having been at the helm for Chile's first Copa America victory after they beat Messi's Argentina on penalties in the final in Santiago.\nThe Coach of the Year award is decided by votes taken from national team coaches, captains and journalists.\nOutgoing Bayern Munich boss Pep Guardiola was the only previous winner of the three-man finalist list","url":"https://www.dailymail.co.uk/sport/football/article-3394398/Barcelona-boss-Luis-Enrique-named-FIFA-World-Coach-Year-Ballon-d-gala.html"}
