{"authors":["Associated Press"],"date_download":"2018-10-23 00:32:21","date_modify":"2018-10-23 00:32:21","date_publish":"2016-01-29 13:42:24","description":"MADRID (AP) — Defending champion Barcelona will play Valencia in the Copa del Rey semifinals. Also in Friday's draw, Sevilla was selected to face Celta Vigo,...","filename":"data/vaneerConsumption/BarcelonatofaceValenciainCopadelReysemifinals.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:4423dacacf884afc8a361b45b4d920e6-3bmscybNe842cce83474b5630cee-150_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422684_Barcelona-face-Valencia-Copa-del-Rey-semifinals_1540254741.html","title":"Barcelona to face Valencia in Copa del Rey semifinals","title_page":"Barcelona to face Valencia in Copa del Rey semifinals | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Barcelona to face Valencia in Copa del Rey semifinals\nMADRID (AP) — Defending champion Barcelona will play Valencia in the Copa del Rey semifinals.\nAlso in Friday's draw, Sevilla was selected to face Celta Vigo, the only of the four remaining teams yet to win the tournament. The first leg will be in Seville.\nBarcelona, in the semis for the sixth straight year, will host the first leg at the Camp Nou next week.\nFC Barcelona's Gerard Pique reacts after scoring against Athletic Bilbao scored during a quarterfinal, second leg, Copa del Rey soccer match at the Camp Nou stadium in Barcelona, Spain, Wednesday, Jan. 27, 2016. (AP Photo/Manu Fernandez)\nValencia, coached by former England defender Gary Neville, is back in the semis for the first time since winning the 2008 title.\n\"It will be difficult,\" Barcelona captain Andres Iniesta said.\nThe teams drew 1-1 in the Spanish league this season. Valencia is struggling in the league with 10 straight games without a victory, but it won five of its six Copa del Rey matches.\n\"It's a difficult opponent but we are hopeful,\" Valencia midfielder Javi Fuego said. \"Our team has been improving, and hopefully playing the second leg at home at the Mestalla (Stadium) will help us.\"\nBarcelona eliminated Athletic Bilbao in the quarterfinals in a rematch of last year's final.\nValencia got past Las Palmas.\nSevilla eliminated second-division club Mirandes, while Celta Vigo upset Atletico Madrid.\n\"We know that we will be playing against a good team, it just defeated Atletico at their stadium, which is not something that is easy to do,\" Sevilla captain Jorge \"Coke\" Andujar said. \"It's an opponent that already beat us at home and it's having a great season.\"\nSevilla lost to Celta 2-1 at home in the fourth round of the Spanish league.\nThe teams will play each other three consecutive times over the next few weeks. In addition to the Copa del Rey encounters, they will also meet in a league game on Feb. 7 in Vigo.\nCelta is in the semis for the first time in 15 years. That 2001 team eliminated Barcelona before losing to Real Zaragoza in the final.\nSevilla is the only team to have won all of its six Copa del Rey matches this season.\nThe second-leg games will be on Feb. 10. The final is set for May 21, likely at Atletico's Vicente Calderon Stadium in Madrid.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3422684/Barcelona-face-Valencia-Copa-del-Rey-semifinals.html"}
