{"authors":["Ben Grounds For Mailonline"],"date_download":"2018-10-23 04:06:35","date_modify":"2018-10-23 04:06:35","date_publish":"2017-03-10 14:06:53","description":"Ivan Rakitic capped a memorable week in style as the Barcelona midfielder celebrated his 29th birthday with his wife Raquel Mauri after putting pen to paper on a new four-year contract.","filename":"data/vaneerConsumption/BarcelonamidfielderRakiticcapsweekwithbirthdaybash.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/3E2312BC00000578-0-image-a-209_1489154259757.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4301412_Barcelona-midfielder-Rakitic-caps-week-birthday-bash_1540267595.html","title":"Barcelona midfielder Rakitic caps week with birthday bash","title_page":"Barcelona midfielder Rakitic caps week with birthday bash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ivan Rakitic capped a memorable week in style as the Barcelona midfielder celebrated his 29th birthday with a surprise party laid on by his wife Raquel Mauri.\nThe Croatian played his part in the dramatic 6-1 win over Paris Saint-Germain in the Champions League on Wednesday night, before he extended his current contract at the Nou Camp until 2021.\nRakitic started the last 16 match against PSG but was substituted before the three late goals as Barcelona became the first team to overturn a 4-0 first leg deficit in the European competition.\nBarcelona midfielder Ivan Rakitic has thanked his wife after his 29th birthday party surprise\nThe Croatian has enjoyed his week after signing a new four-year contract at Barcelona\nThe former Sevilla midfielder then put pen to paper on a new deal in Catalonia which has a £109million (€125m) buyout clause - and Rakitic has taken to Instagram to update his followers on the latest dose of good news.\nThe Swiss-born schemer was dressed dapper in a black waistcoat and tie alongside his matching belle in front of two glasses of red wine and a large, layered cake with a miniature figure of the blond-haired birthday boy on top.\n'What a surprise last night!' wrote Rakitic, who has made 145 appearances for Barca since his 2014 move from Sevilla, scoring 23 goals.\n'Many thanks to my love @raquel_mauri for being so wonderful. To my family, teammates and friends to share it with me. And to all of you for the congratulations #29years #WhatAWeek.'\nRakitic played for 84 minutes of the enthralling 6-1 victory over Paris Saint-Germain\nThe former Sevilla midfielder celebrates with Luis Suarez after the Champions League win\nRakitic scored the opening goal in the Champions League final victory over Juventus in June 2015, but there had been speculation he would leave Barcelona this summer with several top Premier League clubs interested.\nThe player has previously spoken of his love for English football, stating that 'one day' he would like to play there, but having signalled his intentions to remain at the Nou Camp, that possibility is looking increasingly unlikely.\nAfter a week of highs, Rakitic will hope for a rather more straightforward weekend as Barcelona travel to face Deportivo on Sunday looking to maintain their position at the top of La Liga.\nRakitic married his Raquel Mauri back in 2015 and he often shares pictures on his Instagram","url":"https://www.dailymail.co.uk/sport/football/article-4301412/Barcelona-midfielder-Rakitic-caps-week-birthday-bash.html"}
