{"authors":["Alex Matthews For Mailonline"],"date_download":"2018-10-22 22:55:25","date_modify":"2018-10-22 22:55:25","date_publish":"2016-01-28 11:24:27","description":"U.S. Marines from 3rd Marine Expeditionary force larked about with South Korean marines while taking a quick break from a set of gruelling endurance drills in Pyeongchang-gun.","filename":"data/vaneerConsumption/BarechestedUSmarinesandKoreantroopsperformdrillsinsnow.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A9A2CE00000578-0-image-a-46_1453979377597.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420676_We-SNOW-hard-Bare-chested-marines-Korean-troops-perform-drills-mess-extreme-cold-preparation-North-Korea-attack_1540248925.html","title":"Bare-chested US marines and Korean troops perform drills in snow","title_page":"Bare-chested US marines and Korean troops perform drills in snow | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The thought of wrestling bare-chested in the snow-covered wilderness with your mates wouldn't cross many people as a great way to spend a winter's afternoon, but a unit of marines couldn't wait to cover themselves in the white stuff during an exercise in South Korea.\nU.S. Marines from the 3rd Marine Expeditionary force, deployed from Okinawa, Japan, larked about with a unit of South Korean marines while they took a quick break from a set of gruelling endurance drills in Pyeongchang-gun.\nThe troops were in the region to hone their skills, in temperatures below minutes 20 degrees Celsius, under a scenario where they must defend the country from a possible attack from North Korea.\nThe revealing images were captured by photographer Chung Sung-Jun and show the men marching around the wilderness in perfect formation, wearing just boots, combat trousers and woolly hats.\nThe marines are later seen embarking on skis, as they cross the frozen terrain, often carrying a large pack and holding rifles. In a number of the images the elite troops are barely visible as they use their camouflage to hide in the snow.\nFun run: Troops from a South Korean marine unit and the 3rd Marine Expeditionary force enjoy some bonding time during an excerise\nGood times: Troops from U.S. Marines from the 3rd Marine Expeditionary force and a South Korean unit muck about in the snow\nRoar: Troops link arms as they pose for a photo in temperatures below minutes 20 degrees Celsius, in Pyeongchang-gun, South Korea\nClearly unphased by the idea of landing in the freezing snow bare-chested, the troops lift each other up and wrestle in the brisk conditions\nWinter fun: U.S Marines, known for being an elite fighting force, show their softer side by making snowballs with their Korean colleagues\nWarm up: Marines from both units march bare-chested in formation as they take part in a series of drills in Pyeongchang-gun\nPreparation: The troops march during an exercise, based just 200 miles from Seoul, under the scenario that North Korea has invaded\nPlaytime over: On exercise the marines stand on skis in full tactical gear, complete with pure white jump suits to allow them to blend in\nOn Guard: The marines stay alert and look down the scopes of their rifles as they march through a small valley during the exercise\nEfficient: As well as crossing the frozen terrain on foot the expert troops use skis to move quietly and quickly to their destination\nThe 3rd Marine Expeditionary force has fought in both World War Two and Vietnam. Pictured, they stand on guard in South Korea\nWeight: As well as holding his heavy rifle this marine is also carrying a bulky pack as he stands with his unit on patrol\nHidden: Marines use a tarpaulin covered with snow to set up a sentry post on the banks of a hill in Pyeongchang-gun\nCamouflaged by their jumpsuits and given further shelter by the dark twigs of the forest the marines allow themselves to be barely visible\nAlert: A marine looks right into the lense of the camera as he holds his rifle during the winter training exercise in Pyeongchang-gun","url":"https://www.dailymail.co.uk/news/article-3420676/We-SNOW-hard-Bare-chested-marines-Korean-troops-perform-drills-mess-extreme-cold-preparation-North-Korea-attack.html"}
