{"authors":["Trent Baker"],"date_download":"2018-10-30 21:26:02","date_modify":"2018-10-30 21:26:02","date_publish":"2016-01-28 16:44:21","description":"Former NBA star and now TNT NBA analyst Charles Barkley appeared on the Wednesday broadcast of the \"Dan Patrick Show\" on NBC Sports. Barkley told host Dan |","filename":"data/vaneerConsumption/BarkleyESPNTurningSuperBowl50intoaBlackVersusWhiteRaceBattle.json","image_url":"https://media.breitbart.com/media/2015/09/barkley-e1480795450932.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2016_01_28__1540934762.html","title":"Barkley: ESPN Turning Super Bowl 50 into a 'Black Versus White' Race Battle","title_page":"Barkley: ESPN Turning Super Bowl 50 into a 'Black Versus White' Race Battle | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Former NBA star and now TNT NBA analyst Charles Barkley appeared on the Wednesday broadcast of the “Dan Patrick Show” on NBC Sports.\nBarkley told host Dan Patrick that he feels ESPN is “framing the narrative” of Super Bowl 50 into “black versus white, good versus evil” since the matchup’s starting quarterbacks are Peyton Manning and Cam Newton.\n“ESPN has already started their crap about black versus white, good versus evil and I know a lot of those fools over there got radio talk shows,” he said. “It really annoys the hell out of me. We really just can’t appreciate the greatness of Peyton [Manning]. And clearly, Cam is on the track to become one of the greatest players ever. You can already see them framing the narrative ‘black versus white, good versus evil.'”\nThe NBA Hall of Fame player also added he would not be a fan of how his fellow former Auburn star celebrates and enjoys himself on the field.\n“Let me tell you something, as much as I love Cam Newton, if I played against him, I would put a hit on him, no question,’’ Barkley stated. “They rub it in pretty good.”","url":"https://www.breitbart.com/video/2016/01/28/barkley-espn-turning-super-bowl-50-into-a-black-versus-white-race-battle/"}
