{"authors":[],"date_download":"2018-10-30 01:24:13","date_modify":"2018-10-30 01:24:13","date_publish":"2018-08-28 00:05:10","description":"Unfortunately, it has become all too common to see politicians choosing winners and losers when advancing policy and doling out government benefits on the taxpayer dime. However, it’s unusual for the winner and loser of a particular policy to be exactly the same group, yet that’s what’s happening to American farmers under the Trump administration’s trade policies.","filename":"data/vaneerConsumption/BarnyardFollyFarmerBailoutIsWrong.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/Fixed_it_front_bumper_fixed_with_duct_tape.jpeg.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862653.html","title":"Barnyard Folly: Farmer Bailout Is Wrong","title_page":"Barnyard Folly: Farmer Bailout Is WrongThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Unfortunately, it has become all too common to see politicians choosing winners and losers when advancing policy and doling out government benefits on the taxpayer dime. However, it’s unusual for the winner and loser of a particular policy to be exactly the same group, yet that’s what’s happening to American farmers under the Trump administration’s trade policies.\nI’m talking about the Trump Administration’s recent proposal to give $12 billion in aid to farmers who have been negatively affected by tariffs imposed by America’s trading partners in retaliation for Trump’s own recently imposed tariffs. Basically, the administration started a trade war, farmers suffered the consequences, and now the administration is using a taxpayer bailout to claim that they saved the farming industry.\nIf that sounds ridiculous, it’s because it is. It’s a bit like if a teenager crashed into your bumper, put it back together with duct tape, then asked for $100 for fixing your bumper.\nAnd try this on for size: the $12 billion bailout will include money for buying U.S. agricultural products to take them off the market to artificially increase prices. In the U.S. Government, price fixing never makes economic sense and no real conservative would touch it with a ten-foot stick.\nJust like a duct tape bumper, this one-time $12 billion “fix” is really no fix at all. That’s because the repercussions of the trade war go far beyond lost revenues. By damaging America’s trust and relationships with our trading partners, the supply chains that farmers depend on for business could be irreparably harmed, causing a ripple effect of price increases and decreased commerce across industries.\nTake, for instance, the recent testimony of Montana farmer Michelle Erickson-Jones before the U.S. Trade Representative. At one point, Erickson-Jones describes how she had intended to reinvest in her business through the building of a new storage facility on her farm. However, after the tariffs, the facility proved too expensive and she had to cancel the project. That means that a local builder didn’t get a new contract, and parts suppliers didn’t make a sale.\nWhat’s perplexing about this policy is that it comes at a time when American agriculture is booming. At the end of 2017, Trump’s own Department of Agriculture announced: “U.S. agricultural exports totaled $140.5 billion in fiscal year (FY) 2017, climbing nearly $10.9 billion from the previous year to the third-highest level on record.”\nThose aren’t just numbers on a page. Those numbers mean American jobs on American farms, a new storage facility for Michelle, and cheaper, more abundant food for all of us. We should be celebrating our massive exports, not threatening to destroy them.\nEven more perplexing is that all of a sudden, a Republican administration with the support of other Republicans is proposing a massive taxpayer bailout to fix a problem that they shouldn’t have caused in the first place.\nConservatives rightly denounced President Obama’s auto bailouts and subsidies for companies like Solyndra. We should be just as strong — or stronger — in our denunciations of President Trump’s New Deal-era protectionism and big-government spending.\nThe President’s mission to stop trade abuses is admirable. However, he shouldn’t be fighting this battle on the backs of American farmers who can least afford it.\nValerie Zombek is a Paralegal with a passion for the law and politics and a volunteer for grassroots campaigns.","url":"https://spectator.org/barnyard-folly-farmer-bailout-is-wrong/"}
