{"authors":["Tred Barta"],"date_download":"2018-10-30 20:31:06","date_modify":"2018-10-30 20:31:06","date_publish":"2017-02-27 19:04:54","description":"In the waning days of his administration, Barack Obama decided to seriously cripple the American fishing industry. By executive order, the former president designated a vast underwater expanse off the coast of New England as the nation’s first aquatic national monument. This decision, driven by evidence-free environmental concerns, effectively banned all commercial fishing in the area.","filename":"data/vaneerConsumption/BartaPresidentTrumpShouldStoptheObamaAttackonNewEnglandFisherman.json","image_url":"https://media.breitbart.com/media/2017/02/New-England-Fishermen-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_02_27__1540931466.html","title":"Barta: President Trump Should Stop the Obama Attack on New England Fisherman","title_page":"Barta: President Trump Should Stop the Obama Attack on New England Fisherman | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In the waning days of his administration, Barack Obama decided to seriously cripple the American fishing industry. By executive order, the former president designated a vast underwater expanse off the coast of New England as the nation’s first aquatic national monument. This decision, driven by evidence-free environmental concerns, effectively banned all commercial fishing in the area.\nIt’s well within President Trump’s powers to modify this decision, and he ought to do so immediately. Left alone, this designation will undermine the regional economy and deprive countless families of their livelihoods.\nThe monument, officially announced in September, covers about 5,000 square miles of ocean located 130 miles from Cape Cod. For over 40 years, commercial fishermen have harvested this area for crab, squid, swordfish, tuna, and other high-demand seafood. It’s particularly rich in lobster, of which some 800,000 pounds are caught every year.\nThis order ends all that activity. Some fishing companies had just 60 days to leave the area.\nThis exodus will bring economic ruin all along the coast. Bill Palombo, a Newport, Rhode Island lobsterman who runs three boats in the monument waters, says he expects to “just go out of business.” Jon Williams runs Atlantic Red Crab, which employs 150 workers in New Bedford, Massachusetts, and he says the drop in harvests will force him to “maybe sell my business”.\nThe central promise of the Trump White House is the protection of solid jobs for working families. This order kills exactly those positions: stable, well-paid, immune to outsourcing, and available to workers without a college degree. In the Maine lobster industry, which supports 6,300 local jobs, the average starting salary is over $50,000.\nAnd the collapse of fishing companies will send ripples throughout the rest of the regional economy. A vast array of support sectors depend on a robust seafood industry. Just consider the fate of Seafreeze Shoreside, a fish processing plant in Rhode Island. Seafreeze contracts with more than 20 boats that operate in monument waters. As bluntly explained by Eric Reid, the Seafreeze general manager, “If they can’t get fish, I’m not in the processing business.”\nOverall, this designation will destroy several million dollars in annual fishing industry revenues, according to research from the law firm Kelley Drye & Warren.\nThe chief justification for the order is environmental. The monument encompasses vast underseas canyons and mountains, prime habitat for coral, all manner of fish, and large species such a squid, octopus, and whale. Supposedly, fishing and other human activities such as energy development can damage these formations and compromise animal populations. The official White House announcement claims that “these habitats are extremely sensitive to disturbance from extractive activities.”\nAs a professional outdoorsman and nature show host, my livelihood depends on the conservation of the natural world. I fully support smart environmental rules that prevent commercial interests from damaging precious wildlife. So trust me when I say: the idea that fishing threatens the monument ecosystem is pure fiction.\nAn obvious fiction, in fact. The monument area has hosted commercial fishing since the 1970s and, by the government’s own account, it is still in pristine condition. In fact, the excellent quality of the underseas canyons and mountains was one of the main reasons the Obama administration issued the order at all: it wanted to lock in the status quo. The monument waters stand as proof positive that commercial fishing and environmental preservation can co-exist. As Jon Williams, the New Bedford crabber, puts it: “If we’ve been in there for 40 years and they still consider it pristine, where’s the emergency?”\nProtecting the New England fishing industry does not require fully rescinding the order. The Trump administration should simply allow commercial fishing in the area down to a depth of 450 meters. That’s the way to prevent any possible seafloor damage while still preserving the livelihoods of thousands of New Englanders.\nIf President Trump is serious about making America great again, he needs to protect these jobs and modify his predecessor’s misguided monument designation immediately.\nTred Barta is the author of Driven, outdoorsman, and former host of The Best and Worst of Tred Barta on the Versus Channel.","url":"https://www.breitbart.com/politics/2017/02/27/barta-president-trump-should-stop-the-obama-attack-on-new-england-fisherman/"}
