{"authors":["Gareth Davies For Mailonline"],"date_download":"2018-10-22 22:53:11","date_modify":"2018-10-22 22:53:11","date_publish":"2017-03-10 01:39:32","description":"The two men entered Cafe 56 in Basel at 8.15pm on Thursday and started spraying bullets before fleeing towards the direction of a local train station and are said to be still at large.","filename":"data/vaneerConsumption/BaselshootingGunmenkill2peoplebeforefleeingcafe.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/03/wire-193797-1489116552-949_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299710_Gunmen-kill-2-people-Swiss-cafe-fleeing_1540248791.html","title":"Basel shooting: Gunmen kill 2 people before fleeing cafe","title_page":"Basel shooting: Gunmen kill 2 people before fleeing cafe | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Two people have been shot dead and a third is fighting for their life after gunmen opened fire inside a Swiss cafe\nThe two men entered Cafe 56 in Basel at 8.15pm on Thursday and started shooting wildly at diners before fleeing.\nThey ran away towards the direction of a local train station and are said to be still at large having killed two customers at the cafe.\nA forensic team investigates the scene after deadly gunfire was unleashed in Cafe 56, Basel\nA bike is parked up outside the cafe where two men entered the building and started shooting\nA forensic analyst collects evidence outside the cafe where the deadly attack took place\nThe identity of the three male victims had yet to be determined, authorities said, who added nobody one else was hurt in the attack.\nIn a statement released late last night, police said the third man was in a life-threatening condition.\nInvestigations are still ongoing but a police officer said: 'This is a local incident. It has nothing to do with Islamists or terrorism.'\nHe spoke on condition of anonymity because he was not authorized to speak publicly.\nTwo men carry out their forensic duties at the back of the cafe which is in a residential area\nPolice cordoned off the crime scene and as a member of the forensic team stands near a van\nA bottle of water sits on the wall outside the cafe as a forensic team member prepares to enter\nForensic teams were seen in and out of the cafe overnight after the deadly shooting in Basel\nA blue Mercedes-Benz van is filled with evidence as forensics are taken at the site of the crime\nForensic teams could be seen going in and out of the cafe collecting evidence.\nThe attack comes a day after the town concluded celebrations of Fasnacht, the largest carnival in Switzerland.\nBulletholes could also be seen in the cafe which is located in a residential area of the city.","url":"https://www.dailymail.co.uk/news/article-4299710/Gunmen-kill-2-people-Swiss-cafe-fleeing.html"}
