{"authors":["Associated Press"],"date_download":"2018-10-22 22:12:57","date_modify":"2018-10-22 22:12:57","date_publish":"2017-04-26 04:00:19","description":"PITTSBURGH (AP) - Kyle Hendricks rediscovered his 2016 form, limiting the Pittsburgh Pirates to four hits over six innings to outduel Gerrit Cole and lead...","filename":"data/vaneerConsumption/BaseballCapsules.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/04/wire-463005-1493176223-785_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446188_Baseball-Capsules_1540246377.html","title":"Baseball Capsules","title_page":"Baseball Capsules | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"PITTSBURGH (AP) - Kyle Hendricks rediscovered his 2016 form, limiting the Pittsburgh Pirates to four hits over six innings to outduel Gerrit Cole and lead the Chicago Cubs to a 1-0 win on Tuesday night.\nHendricks (2-1) struck out two and walked three, and Wade Davis worked a perfect ninth for his fifth save as the Cubs won for the sixth time in seven games.\nAddison Russell doubled in the second off Cole (1-3) and scored when second baseman Alen Hanson airmailed first base on a Jason Heyward grounder, the Pirates' major league-high 20th error this season. Pittsburgh has lost six of eight.\nPittsburgh Pirates starting pitcher Gerrit Cole delivers during the seventh inning of the team's baseball game against the Chicago Cubs in Pittsburgh, Tuesday, April 25, 2017. The Cubs won 1-0. (AP Photo/Gene J. Puskar)\nASTROS 4, INDIANS 2\nCLEVELAND (AP) - Dallas Keuchel (4-0) pitched a six-hitter, allowing home runs to Austin Jackson in the third and Michael Brantley in the ninth that raised his ERA to 1.22.\nJosh Reddick gave Houston a 3-1 lead with a two-run single in the fifth. Josh Tomlin (1-3), then took a home run away from Jason Kipnis with a leaping catch at the center-field fence in the bottom half.\nHouston is 10-2 since April 11 and leads the AL West at 14-6.\nAstros second baseman Jose Altuve and outfielder Teoscar Hernandez collided in right while chasing Yan Gomes' eighth-inning popup, which dropped for a single. Altuve banged up his left shoulder and Hernandez bruised his left leg.\nRAYS 2, ORIOLES 0\nBALTIMORE (AP) - Austin Pruitt combined with four relievers on a two-hitter in his first big league start. Pruitt allowed one hit in three innings, Danny Farquhar got two outs, Jumbo Diaz went 1 1/3 innings, Chase Whitley (1-0) contributed three perfect innings and Alex Colome finished for his fifth save.\nJonathan Schoop had a second-inning double and Chris Davis a fourth-inning infield single.\nWade Miley (1-1) gave up four hits and six walks in seven innings. Tim Beckham hit an RBI single and Derek Norris added a run-scoring fly ball in the fourth, when Miley walked three.\nChicago Cubs shortstop Addison Russell, left, applies the tag on Pittsburgh Pirates' Josh Harrison, who was caught attempting to steal second during the third inning of a baseball game in Pittsburgh, Tuesday, April 25, 2017. The Cubs won 1-0. (AP Photo/Gene J. Puskar)\nChicago Cubs relief pitcher Koji Uehara celebrates in the dugout after pitching the seventh inning of the team's baseball game against the Pittsburgh Pirates in Pittsburgh, Tuesday, April 25, 2017. The Cubs won 1-0. (AP Photo/Gene J. Puskar)\nHouston Astros starting pitcher Dallas Keuchel (60) is congratulated by catcher Brian McCann (16) after the Astros defeated the Cleveland Indians 4-2 in a baseball game, Tuesday, April 25, 2017, in Cleveland. (AP Photo/Tony Dejak)\nHouston Astros' Josh Reddick reaches for a ball hit by Cleveland Indians' Jason Kipnis in the fifth inning of a baseball game, Tuesday, April 25, 2017, in Cleveland. Kipnis was out on the play. (AP Photo/Tony Dejak)\nHouston Astros' Norichika Aoki watches his ball after hitting a one-run double off Cleveland Indians starting pitcher Josh Tomlin in the fifth inning of a baseball game, Tuesday, April 25, 2017, in Cleveland. Yuli Gurriel scored on the play. (AP Photo/Tony Dejak)\nTampa Bay Rays' Derek Norris hits a sacrifice fly during the fourth inning of the team's baseball game against the Baltimore Orioles in Baltimore, Tuesday, April 25, 2017. Logan Morrison scored on the play. (AP Photo/Patrick Semansky)","url":"https://www.dailymail.co.uk/wires/ap/article-4446188/Baseball-Capsules.html"}
