{"authors":["Andrew Hutchinson"],"date_download":"2018-10-30 19:22:43","date_modify":"2018-10-30 19:22:43","date_publish":"2016-07-23 00:00:00","description":"SPRINGDALE -- Josh Staumont has always thrown hard, but he combined that speed with command Friday night at Arvest Ballpark.","filename":"data/vaneerConsumption/BaseballStaumontstrikesout10inNaturalswin.json","image_url":"https://media.arkansasonline.com/img/photos/2016/07/23/107080502_AN-BBM-SPRING-NATS-007_ORIG_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_jul_23__1540927363.html","title":"Baseball: Staumont strikes out 10 in Naturals win","title_page":"Baseball: Staumont strikes out 10 in Naturals win","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Northwest Arkansas Naturals center fielder Terrance Gore rounds third on his way to the plate Friday on a Corey Toups double against the Springfield Cardinals at Arvest Ballpark in Springdale. - Photo by Andy Shupe\nSPRINGDALE -- Josh Staumont has always thrown hard, but he combined that speed with command Friday night at Arvest Ballpark.\nPhoto by Andy Shupe\nNorthwest Arkansas Naturals catcher Cam Gallagher heads to first after connecting for an RBI single against the Springfield Cardinals on Friday.\nPhoto by Andy Shupe\nNorthwest Arkansas Naturals starter Josh Staumont delivers to the plate against the Springfield Cardinals on Friday during the third inning at Arvest Ballpark in Springdale.\nMaking just his second start for Northwest Arkansas, the right-hander used a fastball that touched 99 miles per hour and an effective curveball to strike out 10 batters in 5 2/3 innings, leading the Naturals to a 4-1 win over the Springfield Cardinals in front of 4,915 fans.\n\"He definitely had a lively fastball,\" Springfield manager Dann Bilardello said. \"That was our first time seeing him and he has a good arm. He expanded the zone and we kept extending it with him.\"\nStaumont, who had 67 walks in 73 innings at High-A Wilmington, walked the first batter of the game, but didn't allow another until the sixth. That inning followed a three-run fifth in which all nine Naturals went to the plate.\nThe long break didn't serve him well. He walked two of the four batters he faced in the inning before he was relieved. He finished with 92 pitches.\n\"His pitches were getting up there,\" Northwest Arkansas manager Vance Wilson said. \"When you sit that long, especially a young kid, he's not that seasoned, so we want to walk him through some situations.\"\nShort Hops\n• Corey Toups continued his hot hitting, going 1 for 2 with an RBI double in the first inning. He is batting .361 in July, with hits in 17 of the 18 games.\n• Terrance Gore stole two bases, giving him a Texas League-leading 31 on the season. His 70 career stolen bases is tied for third in Naturals history.\n• Gore and Carlos Garcia each went 1 for 3, extending their hitting streaks to six games.\nOn Deck: The Naturals continue their four-game homestand against the Springfield Cardinals today at 6:05 p.m. Northwest Arkansas will start left-hander Eric Skoglund (6-7, 3.64), while Springfield will send right-hander Luke Weaver (4-3, 1.31) to the mound.\nToday's Promotion: The Bullpen concession stand will offer half-priced drinks from 4:35 to 5:35 p.m. Country music star David Nail will perform a concert immediately after the game.\nOn The Air: KQSM-FM 92.1\nOn The Web: www.nwanaturals.com\nSports on 07/23/2016","url":"https://www.arkansasonline.com/news/2016/jul/23/baseball-staumont-strikes-out-10-in-nat/"}
