{"authors":[],"date_download":"2018-10-22 21:04:42","date_modify":"2018-10-22 21:04:42","date_publish":"2014-06-03 21:59:48","description":"Emergency sirens went off in Omaha, Nebraska, after the National Weather Service issued a severe thunderstorm warning in parts of the state.","filename":"data/vaneerConsumption/BaseballSizeHailHitsNebraskaasTornadoThreatLooms.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/485591/140603-hail-jms-1801_92cdfeb7a7bd7ea73005e2f36c6d7fb1.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_weather_baseball-size-hail-hits-nebraska-tornado-threat-looms-n121751_1540242282.html","title":"Baseball-Size Hail Hits Nebraska as Tornado Threat Looms","title_page":"Baseball-Size Hail Hits Nebraska as Tornado Threat Looms","title_rss":"NULL","source_domain":"nbcnews.com","text":"During a span of eight minutes around 5 p.m. local time (6 p.m. ET), the NWS recorded 1.08 inches of rain at the Omaha airport, which closed due to risk of flash flooding on the airfield. It reopened hours later.\nAcross the state, trees were uprooted, the exteriors of homes pummeled, roofs blown off, windshields shattered and hoods dented.\nThe National Weather Service has also issued a tornado watch warning that includes 11 counties In south central Iowa. The watch was to remain in place until 1 a.m. local time (2 a.m. ET).\nA derecho — a squall line of damaging winds along a path several hundred miles wide — was possible Tuesday night and through Wednesday afternoon along parts of eastern Nebraska, eastern Kansas, Iowa, Missouri and perhaps as far east as Illinois and Indiana, according to The Weather Channel.\nThe National Weather Service said considerable damage to mobile homes, roofs, windows, trees and vehicles could be expected.\nThe Weather Channel said more than 35 million Americans are in the risk zone. It said the chance of tornadoes would be lower Wednesday but they were still possible.\nThe severe weather threat arrives amid an unusually quiet late spring, with fewer documented tornadoes in May than in previous years.\n—Becky Bratu and The Associated Press","url":"https://www.nbcnews.com/news/weather/baseball-size-hail-hits-nebraska-tornado-threat-looms-n121751"}
