{"authors":["Chris Weller"],"date_download":"2018-10-30 22:39:59","date_modify":"2018-10-30 22:39:59","date_publish":"2016-12-12 00:00:00","description":"Donald Trump's best move to create economic prosperity isn't trying to salvage manufacturing jobs. It's to embrace basic income.","filename":"data/vaneerConsumption/BasicincomemakesmoresensethaneverintheTrumpera.json","image_url":"https://amp.businessinsider.com/images/58430c6dba6eb671018b769f-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_basic-income-trump-2016-12_1540939199.html","title":"Basic income makes more sense than ever in the Trump era","title_page":"    Basic income makes more sense than ever in the Trump era - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"U.S. President-elect Donald Trump speaks at a rally as part of their \"USA Thank You Tour 2016\" in Cincinnati, Ohio, December 1, 2016 . Reuters/William Philpott If Donald Trump maxes out his time in the White House, he'll leave office in 2024.\nBy that time, economists predict robotics and artificial intelligence will have begun their unstoppable march into American factories. People will start losing their jobs en masse, and it'll be up to President Trump and his cabinet to devise an economic escape plan.\nA growing band of advocates argue it doesn't have to turn out this way if Trump embraces a radical form of wealth distribution known as basic income.\nTrump's preparations (or lack thereof) for a future of robotic automation will begin with how he addresses the current concerns of middle America, where manufacturing jobs are already dying and people are desperate for change. Their demands aren't unreasonable. Plenty of people just want work that generates enough money to keep their family safe and healthy.\nSo far, Trump's solution has mostly involved penalizing companies that leave the US through higher taxes (his latest tweetstorm being the shining example of the strategy). The problem is that Trump can't stem the tide of automation no matter how many jobs he keeps within American borders — businesses simply have too many reasons to capitalize on it.\nWhat makes the most sense, according to some advocates, is for Trump to embrace this sea change — to take advantage of automation's economic benefits by laying the groundwork for universal basic income.\nRobots can be a force for good\nAccording to the latest forecasts, jobs in America are poised to disappear much faster than new ones will get created.\nA 2015 McKinsey report found that current technologies could feasibly replace 45% of American jobs right now. Two years prior to that, a report from Oxford University estimated half of all American jobs would fall to automation somewhere between 2023 and 2033. That's unsettling stuff when you consider unemployment rates would blow past those of the Great Depression.\nThat's why many basic income proponents say the system isn't just the most viable solution, but the only one. As more and more workers lose their jobs, advocates say it'll be up to federal and state governments to implement policies and reorganize tax codes that favor the out-of-work.\n\"There's a pretty good chance we end up with a universal basic income, or something like that, due to automation,\" Tesla CEO Elon Musk said i n a November 4 interview with CNBC.\nRobots can create far more wealth than humans ever could. Robots make more stuff, increasing the supply of those goods and thereby driving costs down.\nRobotics assemble a vehicle in the Tesla factory. YouTube/iPhone-Fan In the future, society could have a surplus of wealth and millions of people out of a job. Basic income advocates like Musk say the way to reconcile those two outcomes is obvious: Spread the surplus equally.\n\"I'm not sure what else one would do,\" he said to CNBC. \"That's what I think would happen.\"\nEach month, every citizen would receive a check to cover basic expenses like food, clothing, and shelter. They'd still have the option to work, but it wouldn't entirely be necessary.\nTo dispel the idea that basic income is a form of socialism, advocates point out there is no ceiling on how wealthy people can get. A basic income is a floor that helps ensure people don't slip into poverty.\nNo one expects all that to transpire within a Trump administration. But many proponents of basic income agree Trump is in a unique position to get it on people's minds, and perhaps on paper.\nOne of Trump's hallmarks is his penchant for radical ideas, however unfeasible or discriminatory they may be. Writer and basic income advocate Scott Santens says there are a host of programs Trump could launch that move toward a full basic income. Perhaps a new version of the earned income tax credit (EITC) that gives poor people a big tax refund, or maybe just a policy of helicopter money— cash that gets produced solely to stimulate the economy.\nGene Kim Whatever the case, Santens says Trump's loose-cannon approach to governance could play in basic income's favor. Trump is \"no incrementalist,\" he says.\n\"I think this outcome is potentially better than had Hillary won,\" Santens tells Business Insider. \"Hillary was already on record as perceiving basic income as 'giving up on people,' like somehow providing basic economic security is a sad thing to avoid if at all possible.\"\nNot all advocates believe Trump will help their cause. Shortly after the election, Rutger Bregman, Dutch basic income expert and author of \"Utopia for Realists,\" told Business Insider that \"the election of Trump as president is probably no good news for the basic income movement,\" given that Trump has fought so hard already to preserve manufacturing jobs.\nThe biggest hurdle for Trump will be convincing his supporters, and others, that basic income doesn't require a shift in their politics — that it's already American by nature. That might seem counter-intuitive, since Americans devote more time and energy to their work than just about anything else. But according to advocates, the system grants something even more precious than work: freedom.\n\"If you talk to lots of Americans, they feel very trapped — whether it's in their job or a relationship they feel unable to get out of,\" Jim Pugh, a San Francisco-based basic income expert, told Business Insider back in June. \"If you have a basic income, this is something that's going to provide you the freedom to look for new options.\"\nIf Trump gets middle-class Americans to cozy up to basic income, he'll get them to see that work and financial security are growing apart, and — crucially for basic income supporters — that that can be a good thing.\nPeople like Santens, Bregman, and Pugh emphasize that work should be a choice. They see labor less as a prequisite to paying your bills on time than as a way to find deep, existential satisfaction. So long as government officials recognize that value, they say, the impending AI revolution won't need to be a disruptive force, but a liberating one.","url":"https://www.businessinsider.com/basic-income-trump-2016-12"}
