{"authors":["Chris Weller"],"date_download":"2018-10-30 23:03:28","date_modify":"2018-10-30 23:03:28","date_publish":"2016-12-09 00:00:00","description":"A new study from two World Bank researchers finds people actually tend to spend less money on vices when their income goes up.","filename":"data/vaneerConsumption/Basicincomestudyfindspeopledrinkandsmokeless.json","image_url":"https://amp.businessinsider.com/images/57d18b8609d293e60b8b69b9-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_basic-income-study-people-drink-smoke-less-2016-12_1540940608.html","title":"Basic income study finds people drink and smoke less","title_page":"    Basic income study finds people drink and smoke less - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Thomson Reuters Free money doesn't have the greatest reputation.\nWhether it's the government giving handouts en masse or a stranger giving a crumpled bill to a homeless person, many people regard giving money for nothing as unfair and unproductive.\nIn a surprising new study, World Bank researchers David Evans and Anna Popova present data that challenge those assumptions: The consumption of so-called \"temptation goods\" actually goes down in certain cases when people in underdeveloped nations (including Honduras, Nicaragua, and Tanzania) receive free cash.\nThe findings come amid growing popularity for cash-transfer studies. Around the world, countries are designing experiments that try to better understand what happens on a macroeconomic scale if everyone gets a little extra money each month.\nBased on the years he's spent studying cash transfers, Evans says he expected the people who normally spend a small portion of their income on temptation goods to keep doing so. Alcohol is what economists call a \"normal good\" — people spend more money on it as their income increases. He never thought extra money would actually make them less interested in such indulgences.\nBut according to their review of 19 cash-transfer studies in 10 countries, alcohol and tobacco didn't behave like normal goods. Puzzled by the outcome, the co-authors sought to put a story to their results.\n\"We dug into what might be going on there,\" Evans tells Business Insider.\nUltimately, he and Popova came to see two possible mechanisms at play, one far more plausible than the other.\nThe first concerned who received the money. In most of the studies, cash transfers were given to the female head of the household. Evans says there is some evidence that women are more likely to spend the money on things that help children or the family than men are. This evidence isn't conclusive, however, and not all 19 trials stuck to that approach.\nMore likely is a psychological explanation known as the \"labeling effect,\" Evans says.\nEach transfer came with the verbal \"label\" that the money was intended for positive ends. Recipients were told \"This money is to improve the lives of your children\" or \"This money is to help your business.\" There were no threats of punishment, only the label.\n\"If you tell people money is for a certain thing, then they're much more likely to spend that money on that thing,\" Evans explains.\nThe findings are especially surprising given the wide variance between the transfer's value. In certain African countries, such as Tanzania and Kenya, the handouts represented roughly a 5% increase in people's income. In Latin America, meanwhile, the handout raised incomes by as much as 30%.\n\"It is striking that we don't see an average increase [in alcohol or tobacco use] in any of these cases,\" Evans says, because clearly the money meant more to different groups of people.\nHis hope is that governments will embrace the evidence on cash transfers as positive ways to rehabilitate people. The strength of the labeling effect may mean cash transfers could work in the US, Evans says, though he concedes that gets the policy into \"the realm of pure speculation.\" Hard evidence does not yet exist.\nAt least in underdeveloped countries, the research shows a little still goes a long way toward improved health and stability.","url":"https://www.businessinsider.com/basic-income-study-people-drink-smoke-less-2016-12"}
