{"authors":["Georgia Diebelius For Mailonline"],"date_download":"2018-10-23 01:01:42","date_modify":"2018-10-23 01:01:42","date_publish":"2016-01-28 15:07:50","description":"The new Bath Air Pillow Smartphone Holder, which was created in Tokyo, acts as a comfortable cushion and allows people to use their device with wet hands by placing it into a waterproof case.","filename":"data/vaneerConsumption/BathAirPillowSmartphoneHolderallowssmartphoneaddictstousemobileinBATH.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AB155700000578-0-image-a-61_1453993013651.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421080_Making-splash-Clever-waterproof-device-allows-smartphone-addicts-use-mobile-BATH_1540256502.html","title":"Bath Air Pillow Smartphone Holder allows smartphone addicts to use mobile in BATH","title_page":"Bath Air Pillow Smartphone Holder allows smartphone addicts to use mobile in BATH  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Smartphone users addicted to their gadgets can now safely use them in the bath without worrying about dropping them in the water.\nA new product, called the Bath Air Pillow Smartphone Holder, can be inflated and then placed at the top end of the tub.\nIt also acts as a comfortable pillow and the user can place their mobile into the waterproof case and use one hand to navigate their touchscreen.\nThe pillow, which allows you to use your mobile phone safely in the bath, can also be used in bed\nInflatable device also acts as a comfortable pillow and the user can place their mobile into a waterproof case\nThe product, which comes in white, pink and grey, means that people can use their phone in the bath without worrying about dropping it in the water\nAnd those in the tub do not need to use their hands to hold the device because the 'balloon' like product hooks around over your shoulder.\nThis means people only need to use their arms and hands when they want to change the screen on their smartphone.\nThe arm length is adjustable and the splash-proof cover should hold most standard-sized smartphones.\nIt can be bought in white, pink and grey for $39 (£27) and the designers are currently looking for dealers in the UK.\nDesigner Nory Fukuda, from Tokyo, Japan, said: 'There are a lot of people who like to read and wish to use digital devices while enjoying a relaxing bath.\n'People now like to read the news or watch and stream videos on their smartphones when in the bath.'\nThe designers, who are based in Tokyo, are currently looking for dealers in the UK to sell the product\nA protected pouch (left) which attaches to the inflatable pillow (right) keeps the phone dry so it can be used in the bath\nShe added: 'But in order to do this, the device must be put into a waterproof case to protect it - which is hard to hold [for] a long time.\n'This is how we came up with the idea of the Bath Air Pillow Smartphone Holder.\n'It's a great product because people can now use their smartphones in the bath without using their hands to hold it.\n'We believe it's the best and safest way to help people user their phone in the bath in a safe manner.\n'It could bring an end to people dropping their expensive smartphones in the water and it will prevent our arms from getting tired while holding it.'\nThe arm length is adjustable and the splash-proof cover has been built to hold most standard-sized phones","url":"https://www.dailymail.co.uk/news/article-3421080/Making-splash-Clever-waterproof-device-allows-smartphone-addicts-use-mobile-BATH.html"}
