{"authors":["Joey Millar For Mailonline"],"date_download":"2018-10-23 02:31:44","date_modify":"2018-10-23 02:31:44","date_publish":"2016-01-28 17:19:20","description":"Tourist chiefs hope the former coal rail line s will get a new lease of life as a subterranean cycle route but plans have come to a screeching halt. The project may be delayed to build roosting areas.","filename":"data/vaneerConsumption/BatsputahalttoplanstodevelopformerWelshcoaltunnelintocycleroute.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30ACC1E300000578-0-image-a-2_1454006949944.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421292_Bats-halt-plans-develop-former-Welsh-coal-tunnel-underground-cycle-route_1540261904.html","title":"Bats put a halt to plans to develop former Welsh coal tunnel into cycle route","title_page":"Bats put a halt to plans to develop former Welsh coal tunnel into cycle route | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A bid to open Britain's longest cycle tunnel could be put on hold - because of bats.\nTourism chiefs hope the former coal rail line under the hills of the Rhondda, south Wales will get a new lease of life as a subterranean cycle route but plans have come to a screeching halt while experts search for any current tunnel residents.\nIf officials find any bats in the 1,000-foot deep Victorian-era tunnel, the project will be delayed so that 'bat friendly' roosting areas can be built.\nTourism chiefs hope the former coal rail line in Rhondda, south Wales will get a new lease of life as a subterranean cycle route\nBats (including the common pipistrelle, pictured above left, and the lesser horseshoe, above right) are protected in the UK and planners must take their well-being when constructing the underground cycle route\nThe tunnel (pictured as it is today passing deep under Dunraven Forest) was approved for conversion by the Welsh Government last year\nBats are a protected species in the UK and planners must take their well-being into account when excavating the tunnel to create the cycle route.\nIt may be home to common pipistrelle, the UK's most common bat, or the rare lesser horseshoe bat, which surprised experts when it was found in nearby Margam Castle last year.\nDr Henry Schofield, conservation programme manager at the Vincent Wildlife Trust said: 'A lot of these tunnels have been shut off from humans and have become bat hibernation sites where they nest in the crevices and alcoves.\n'If you have lots of people cycling through the tunnel in winter then it's likely to disturb any hibernating bats.'\nHe suggested closing the tunnel to from cyclists between October and April when bats hibernate.\n'These mammals go into a deep hibernation and drop their body temperatures down to that of their surroundings.\n'It means they can eek out energy slowly over the winter - but if there were lots of cyclists with lights on their bikes then it will wake them up.\n'Waking up uses a lot of their energy and they are far less likely to make it through the winter.'\nThe tunnel's railway (pictured here while still in use in Rhondda) was opened in 1890 during the 'coal boom'\nDr Henry Schofield, conservation programme manager at the Vincent Wildlife Trust suggests closing the tunnel to from cyclists between October and April when bats (including the common pipistrelle, pictured) hibernate\nThe tunnel, pictured in its current state, extends to a depth of 1,000 feet beneath the Dunraven Forest but is currently closed to the public\nThe tunnel, which runs under the Dunraven Forest in the South Wales Valleys, was opened in 1890 during the 'coal boom'.\nThe tunnel's chief engineer was Sydney William Yockney - who was a pupil of fabled engineer Isambard Kingdom Brunel - oversaw the five-year project which began in 1885.\nThe tunnel used to see steam locomotives carrying coal from the coalfields of Rhondda Valley to the port city of Swansea.\nHowever, it last saw workmen in 1968 when it was closed as part of the 'Beeching cuts' which killed off thousands of stations and hundreds of rural lines.\nDr Richard Beeching, the then-chairman of British Railways, was responsibly for the wide-ranging restructuring of the country's railways in an effort to curb huge financial losses.\nIn May last year the Welsh Government gave the initial go-ahead for the tunnel to be reopened as a cycle track and tourist area.\nLeanne Wood, leader of Plaid Cymru, said: 'There is a real buzz about this project which could transform these valleys if the tunnel is opened up.'\nIf re-opened as a tourist attraction it would become the second longest cycle tunnel in the world behind the two-and-a-half mile long Snoqualmie Tunnel near Seattle in the USA.\nThe Rhondda Valley tunnel last saw workmen in 1968 when it was closed as part of the 'Beeching cuts', which saw thousands of stations and hundreds of rural lines scrapped in an effort to curb railway losses\nThe route (pictured above while still in use near Dunraven Forest) was used for transport from the coalfields of Rhondda Valley to the port city of Swansea\nThe proposed conversion of the tunnel beneath the south Wales hill to a cycle route is reliant on strict environmental conditions - including the preservation of bat habitats","url":"https://www.dailymail.co.uk/news/article-3421292/Bats-halt-plans-develop-former-Welsh-coal-tunnel-underground-cycle-route.html"}
