{"authors":["Darren Boyle","Katie French For Mailonline"],"date_download":"2018-10-23 00:21:09","date_modify":"2018-10-23 00:21:09","date_publish":"2017-04-26 09:55:26","description":"An au pair tried to save the life of a man who was stabbed in London last night, neighbours said. Today the area outside Wandsworth Prep School (pictured) has been cordoned off.","filename":"data/vaneerConsumption/BatterseastabbingisfourthdeaththisweekinLondon.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/18/3F9FA6DA00000578-0-image-a-6_1493227092413.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446712_Fourth-man-stabbed-death-far-week-London_1540254069.html","title":"Battersea stabbing is fourth death this week in London","title_page":"Battersea stabbing is fourth death this week in London | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An unnamed au pair desperately tried to save the life of a man who was stabbed outside an elite £13,000-a-year school in London last night.\nThe Australian nanny, 24, gave the young man CPR and attempted to stop the bleeding after he was attacked and collapsed in the street, outside Wandsworth Preparatory School.\nAn onlooker described how the victim died in the arms of a woman who tried to help him, tragically making the young man the fourth person to be killed from a knife attack in the last four days in London.\nCordoned off: The scene where an unnamed Australian nanny is said to have tried to save a young man's life has been cordoned off after the young man died from a suspected knife attack last night\nBrave: A man has told how his nanny, a 24-year-old from Australia, desperately tried to help by giving the young man CPR after he collapsed in a pool of blood on a street corner\nIt is thought the deceased man, who has not yet been formally identified, was slashed in the neck after two groups of young men became involved in a dispute near Wandsworth Common, at around 7pm on Tuesday.\nParamedics from the London air ambulance, which landed on Wandsworth Common, pronounced him dead at the scene 30 minutes later.\nA 45-year-old father-of-two told The Evening Standard how his nanny tried to save the victim's life.\nHe said: 'She saw the argument break out, there was lots of shouting and fronting up between the groups.\n'She didn't see the knife, it was so quick, but the man collapsed in a pool of blood. She stepped in to stop the bleeding and try CPR, she couldn't just stand there.\n'She came back home shaking and covered in blood which gave the kids a fright.\n'She's distraught that she couldn't save him, she had to coordinate a lot of people in a chaotic situation while calling the ambulance.\nHe added: 'It looked like he had been stabbed in the neck, his skin had gone so pale, he died in her arms.'\nToday the area has been cordoned off by the police who are investigating the incident.\nThe father-of-two said the murder is shocking in a traditionally quiet residential area where family homes fetch up to £4million. Members of a local knitting circle had been attending their weekly meeting in the church next door.\nHe said: 'It's unnerving and completely unexpected to happen right on your front door step. It's normally absolutely silent around here. It goes to show murders can happen anywhere these days.'\nThe young man was killed yesterday after he was allegedly attacked by two men\nThe young man was killed yesterday near Wandsworth Common in South London, file picture\nThe incident happened around 7pm yesterday.\nAccording to witnesses, the victim died after being chased by two men.\nAccording to the Evening Standard, one of the men shouted: 'I'll show you what will happen' before driving the knife into his throat.\nOne au pair who lives with a local family tried to give the dying man first aid.\nA man who employs the 24-year-old Australian said the man 'died in her arms'.\nHe said: ' She saw the argument break out, there was lots of shouting and fronting up between the groups.\n'She didn't see the knife, it was so quick, but the man collapsed in a pool of blood. She stepped in to stop the bleeding and try CPR, she couldn't just stand there.\n'She came back home shaking and covered in blood which gave the kids a fright.'\nPolice in Enfield investigating the murder of Damien McLaughlin, who was stabbed in Enfield at around 1.30pm on Saturday afternoon\nThe Metropolitan Police said they are investigating the stabbing.\nMeanwhile, a second man has been charged with the murder of Damien McLauglin in Enfield.\nOmar Warner, 18, of Marsh Lane, N9 was charged on April 25 with murder and possession of an offensive weapon.\nHe will appear in custody at Highbury Corner Magistrates' Court on Wednesday, 26 April.\nDamien McLaughlin, pictured, was stabbed to death in Enfield over the weekend\nA 17-year-old youth from Tottenham appeared in custody at Highbury Youth Court on 25 April charged with murder, possession of an offensive weapon and possession of cannabis.\nThe murder investigation is being led by Detective Chief Inspector Larry Smith of the Homicide and Major Crime Command.\nEarlier, a 17-year-old boy was killed just yards from Prince George's new nursery school, while another man, 60, died in Bow.\nThe teenager was stabbed to death at a housing estate in Ingrave Road, just five minutes from the young prince's new school.\nThe Evening Standard reports the victim was chased by a gang wearing balaclavas and carrying large knives who stabbed him several times and left him sprawled on the bonnet of a car.\nIn the early hours of Sunday morning a 17-year-old cyclist was stabbed to death at a housing estate in Ingrave road, just five minutes from the young prince's new school\nPolice officers at the police cordon in Bow Common Lane in Bow, east London, where a 60-year-old man was knifed to death\nPolice officers gather at the scene of the stabbing in Battersea this morning, with a murder investigation now underway\nDetectives have launched a murder investigation after a man, in his 20s, was killed after an altercation in Surrey Lane, Battersea on Tuesday morning\nNeighbours raised the alarm after being woken at 1.25am on Sunday when they heard the boy shout: 'Help me, I'm dying'.\n'The victim was taken to a south London hospital, where he was pronounced dead at 02:50hrs.\nDetective Inspector Tony Lynes said: 'This was a brutal attack on a young man.\n'We are still trying to establish the circumstances behind this incident, and we are appealing to anybody who was in the area at around the time of the attack - from 12.45am onwards - or who lives nearby and may have seen or heard something to come forward and speak to officers as soon as possible.'\nHe added: 'There have been no arrests and inquiries continue.'\nThe incident happened just yards from Thomas's School in Battersea, south London, where Prince George will enrol this September\nA 17-year-old has now been charged with Mr McLaughlin's murder, as well as possession of an offensive weapon and cannabis\nMr McLaughlin's grey van, seen here, has been parked in the middle of the road since Saturday afternoon in Enfield\nThe incident happened just yards from Thomas's where Prince George will enrol this September.\nThe youngster will be four years old when he starts at the £6,000-a-term school, which states that its most important rule is to 'be kind'.\nJust hours earlier, Damien McLaughlin was killed in Enfield after he clashed with a group of youths who had jumped out of his van on Saturday afternoon.\nPolice found another knife victim at a flat in Bow Common Lane in Bow, east London, after being called to reports of another injured man, aged 54, at 11.20pm on Sunday.\nBefore going to hospital for treatment to a head injury and a stab wound, the 54-year-old directed officers to an address in which a 'seriously injured' man aged 60 was found with stab wounds.\nOfficers desperately tried to carry out first aid while waiting for an ambulance, but the older man was pronounced dead at the scene shortly after midnight on Monday.","url":"https://www.dailymail.co.uk/news/article-4446712/Fourth-man-stabbed-death-far-week-London.html"}
