{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 21:43:21","date_modify":"2018-10-30 21:43:21","date_publish":"2015-02-14 18:55:46","description":"The Common Core battle in Arizona between newly elected state superintendent Douglas (R) and newly elected Gov. Ducey (R) is heating up.","filename":"data/vaneerConsumption/BattleLinesDrawnBetweenAntiCommonCoreSuperintendentandArizonaGovernor.json","image_url":"https://media.breitbart.com/media/2015/02/Diane-Douglas-AZ-Fox10.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_02_14__1540935801.html","title":"Battle Lines Drawn Between Anti-Common Core Superintendent and Arizona Governor","title_page":"Battle Lines Drawn Between Anti-Common Core Superintendent and Arizona Governor | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The battle in Arizona between newly elected state superintendent Diane Douglas (R) – who won her race on an anti-Common Core platform – and newly elected Gov. Doug Ducey (R) is illuminating the divide between conservatives who want local control of education and establishment politicians who espouse – whether openly or not – the nationalized standards.\nIn a press release from Douglas’ office following Ducey’s claim on Thursday that Douglas acted illegally when she fired two Arizona State Board of Education administrators the day before, Douglas shot back that the Governor is colluding with proponents of Common Core and “his corporate cronies” to undermine her campaign to abandon the controversial education initiative in Arizona.\n“Governor Ducey has refused to take calls or meetings with me personally since his swearing in,” Douglas stated in the release. “Clearly he has established a shadow faction of charter school operators and former state Superintendents who support Common Core and moving funds from traditional public schools to charter schools.”\nDouglas continued:\nIt is no surprise that his office supports retaining two liberal staff who have publicly stated they will block all efforts to repeal or change Common Core and backs the newly elected President of the Board of Education who is a charter school operator and stands to profit from the Governor’s policy of pushing through AzMerit to lower school scores so that more students can be removed to charter schools. I swore to uphold the Constitution and the laws of the State of Arizona with my hand upon the Bible. I take that oath very seriously and will continue to do so. I also promised the voters of the state to replace Common Core and will not falter in my best efforts to keep my promise, regardless of whether the Governor honors his campaign rhetoric to do the same.\nAs AZCentral reported, Douglas terminated Board of Education Executive Director Christine Thompson and Assistant Executive Director Sabrina Vazquez.\nRebecca Gau, director of the pro-Common Core lobbying group Stand for Children Arizona charged that Douglas’ move was “political” because the state superintendent has not been happy with the Board of Education’s continued work on the state’s new standardized assessment, known as AzMERIT, which is aligned to the Arizona College and Career Standards – a “rebrand” of the Common Core standards.\nIn her January 21 State of Education address, Douglas stayed true to her campaign pledge to eliminate Common Core by criticizing the standards in her state that are, in fact, the Common Core–just renamed with a “local flavor” title.\n“Our Arizona state standards were discarded and replaced with the unproven Common Core standards,” Douglas said in her address before the state’s House Education Committee, according to cronkitenewsonline.com.\nDouglas described Common Core as “a de facto mandate, only to be renamed Arizona’s College and Career Ready Standards,” and called the initiative “the latest fad, top-down approach or cure-all sold as the solution for student achievement.”\nAs Breitbart News reported in February of 2014, the notion of simply “rebranding” or renaming the Common Core standards to draw attention away from their increasing unpopularity was advertised by former Arkansas Gov. Mike Huckabee (R).\nSpeaking at a meeting of the Council of Chief State School Officers, one of the organizations that created and owns the copyright to the Common Core standards, Huckabee said the name “Common Core” had become “toxic,” and he urged state superintendents and education bureaucrats to “rebrand it, refocus it, but don’t retreat.”\nFormer Arizona Gov. Jan Brewer (R) used an executive order to purge the name “Common Core” from the standards, referring to them, instead, as Arizona’s College and Career Ready Standards.”\nSimilarly, the Common Core standards have been rebranded in states such as Iowa, Florida, and Indiana.\nIn her address, Douglas also said of the AzMERIT test, “The name is the only thing Arizonan about the test.” She added that the test was created and put to use in only 21 weeks and called upon Ducey and the state legislature to “stop the madness and put our children first.”\nThe AzMERIT will be taken by about one million third through eleventh-graders in the state.\nDouglas said the poor quality of education in Arizona (ranked 47th in the nation) must be dealt with in a different “collaborative” way.\nBoard of Education President Greg Miller expressed “surprise” at Douglas’ dismissals and that the state education department would be involved in firing Board of Education staff.\nAccording to AZCentral:\nArizona law states the schools chief may “direct the work of all employees of the board who shall be employees of the department of education” and “direct the performance of executive, administrative or ministerial functions by the department of education or divisions or employees thereof.\nRegarding Ducey’s claim that Douglas’ dismissal of the two Board of Education staffers was illegal, Douglas reportedly fired back, “Does the Governor also believe he controls all other elected officials created by the state Constitution? If so, the next ballot should only have one office to vote upon.”\nSoon after Douglas’ election in November, a PAC was organized to oust her.\nMaxwell Goshert, treasurer of the Coalition to Recall Diane Douglas, said he predicted the group would ultimately achieve a recall of Douglas within a year.\nThough during Ducey’s campaign he used anti-Common Core rhetoric to gain popularity, he subsequently appointed to his new subcommittee on education Common Core proponent Lisa Graham Keegan, who endorsed Douglas’ challenger and referred to Douglas as someone who was “promoting a sort of a paranoia.”\nAdditionally, Ducey included in his new education subcommittee Matthew Ladner, a close associate of Common Core champion Jeb Bush.","url":"https://www.breitbart.com/politics/2015/02/14/battle-lines-drawn-between-anti-common-core-superintendent-and-arizona-governor/"}
