{"authors":["Corey Charlton For Mailonline"],"date_download":"2018-10-22 23:16:24","date_modify":"2018-10-22 23:16:24","date_publish":"2016-01-28 11:58:27","description":"Batuli Lamichhane, from Nepal, was born in March 1903 and took up smoking when she was 17, a habit she has continued while outliving almost everyone else in her village.","filename":"data/vaneerConsumption/BatuliLamichhane112claimsthesecrettolonglifeistobestressfree.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30AA14AD00000578-0-image-a-43_1453982253755.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420819_112-year-old-woman-smoked-30-day-95-years-says-secret-long-life-stress-free-active_1540250184.html","title":"Batuli Lamichhane, 112, claims the secret to long life is to be stress free","title_page":"Batuli Lamichhane, 112, claims the secret to long life is to be stress free | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A 112-year-old Nepalese woman who has smoked 30 cigarettes a day for almost 100 years claims the key to a long life is to stay active and stress-free.\nBatuli Lamichhane was born in March 1903 and took up smoking when she was 17, a habit she has continued while outliving almost everyone else in her village.\nHer eldest son is 85-years-old and has great grandchildren, while the other four have passed away.\nBatuli Lamichhane smokes a cigarette - just one of 30 the 112-year-old has consumed every day for almost a century\nThe great-grandmother claims smoking has not hindered her and being stress-free is the key to a long life\nThe 112-year-old said she started smoking when she was 17 and consumes 30 cigarettes every single day\nShe said: 'I have been smoking for over 95 years. There is nothing wrong with smoking'\nDespite her age, the great-grandmother manages to do all her chores by herself and lives off donations from a local Hindu temple\nWhile her speech is mostly incoherent, the great grandmother manages to do her chores all by herself.\nShe said: 'People of this modern age have too much stress. And those who do not work or are idle in their old age won't live long.\nSo you have to be active and stress free. You should always be happy, then you will live a long life.'\n'I don't really care how old I am. But I am old nonetheless. I have seen a lot of things change during my lifetime.'\nDespite her age, she continues to be a chain smoker and consumes as many as 30 cigarettes a day.\n'I have been smoking for over 95 years. There is nothing wrong with smoking,' she says.\nMrs Lamichhane added advice is to avoid 'commercially made' cigarettes. Instead, she recommends locally made 'beedis' - tobacco wrapped in tendu leaf.\nHer husband deserted her eight decades ago after he migrated to India in search of a job.\nFollowing the devastating earthquake that hit Nepal earlier this year, the roof of her house caved in. Since then, she has refused to be relocated to a relative's.\nShe lives off donations made by a local Hindu temple.\nPictured is Batuli Lamichhane's passport, which it is claimed shows she was born in March 1903\nHere she is pictured with family members. She has outgrown all her children except one, who is now 84 himself","url":"https://www.dailymail.co.uk/news/article-3420819/112-year-old-woman-smoked-30-day-95-years-says-secret-long-life-stress-free-active.html"}
