{"authors":["Associated Press"],"date_download":"2018-10-22 23:19:50","date_modify":"2018-10-22 23:19:50","date_publish":"2017-03-10 02:34:28","description":"MIAMI (AP) - Jose Bautista homered and drove in four runs, and the Dominican Republic opened its bid for a second consecutive World Baseball Classic title...","filename":"data/vaneerConsumption/BautistashomerhelpsDominicansbeatCanada92inWBC.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/02/wire-193595-1489113273-323_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4299794_Bautistas-homer-helps-Dominicans-beat-Canada-9-2-WBC_1540250390.html","title":"Bautista's homer helps Dominicans beat Canada 9-2 in WBC","title_page":"Bautista's homer helps Dominicans beat Canada 9-2 in WBC | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MIAMI (AP) - Jose Bautista homered and drove in four runs, and the Dominican Republic opened its bid for a second consecutive World Baseball Classic title with a 9-2 victory against Canada.\nWelington Castillo hit a two-run homer for the Dominicans, who went 8-0 to win the 2013 title. Before the game, manager Tony Pena said his team looks better on paper this year.\nCarlos Martinez pitched four innings in first career WBC outing and allowed one run - when he balked with a runner at third. Jose Reyes had three of the Dominicans' 15 hits.\nDominican Republic's Gregory Polanco (25) greets Welington Castillo (35) after they scored on a two-run home run by Castillo during the second inning against Canada in a first round game of the World Baseball Classic, Thursday, March 9, 2017, in Miami. (AP Photo/Lynne Sladky)\nThe Dominicans were the home team and had the majority of support from a boisterous crowd of 27,388 at Marlins Park, with fans chanting, blowing horns and pounding drums throughout the game.\nRyan Dempster, a 16-year major league veteran who came out of retirement to pitch for the Canadians at age 39, lasted only two innings and gave up four runs. It was his first game since the 2013 World Series.\nThe Canadians are in danger of being eliminated in the opening round for the fourth time in as many WBCs.\nDominican reliever Fernando Rodney had the crowd roaring during pregame introductions when he struck his customary arrow-shooting pose while holding a large plantain.\nRodney struck out two in the ninth and celebrated by again striking his pose, this time without the plantain. Jeurys Familia got the final out.\nThe game also had a somber side for the Dominicans, who hung jerseys in their dugout honoring Kansas City Royals pitcher Yordano Ventura and former major leaguer Andy Marte. They died in separate traffic accidents on the same January morning in the Dominican Republic.\nCastillo's homer came in the second inning, when the Dominicans bunched six hits to score four runs off Dempster. Bautista singled home a run in the second, singled again in the fifth and hit a three-run homer in the sixth off Dustin Molleken.\nDominican Republic's Nelson Cruz hits a double against Canada during the second inning in a first-round game of the World Baseball Classic, Thursday, March 9, 2017, in Miami. (AP Photo/Lynne Sladky)\nDominican Republic pitcher Carlos Martinez throws during the first inning in a first-round game of the World Baseball Classic against Canada, Thursday, March 9, 2017, in Miami. (AP Photo/Lynne Sladky)","url":"https://www.dailymail.co.uk/wires/ap/article-4299794/Bautistas-homer-helps-Dominicans-beat-Canada-9-2-WBC.html"}
