{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 20:22:09","date_modify":"2018-10-30 20:22:09","date_publish":"2015-10-13 20:16:15","description":"California Democrats in the Bay Area are eagerly awaiting tonight's Democratic debate in Las Vegas.","filename":"data/vaneerConsumption/BayAreaDemocratsTuneintoDemocraticDebate.json","image_url":"https://media.breitbart.com/media/2015/10/Screen-Shot-2015-10-13-at-12.28.31-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_13__1540930929.html","title":"Bay Area Democrats Tune in to Democratic Debate","title_page":"Bay Area Democrats Tune in to Democratic Debate | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"California Democrats in the Bay Area are eagerly awaiting tonight’s Democratic presidential debates in Las Vegas, Nevada where Hillary Clinton and Bernie Sanders will duke it out as Martin O’Malley, Jim Webb and Lincoln Chafee seek to garner more national attention in their own bids for the coveted nomination.\nSilicon Valley for Bernie organizer Paul Huntley, 58, told the San Jose Mercury News that he is looking for Sanders, who is a socialist, to shine at the debates. “I’m not expecting him to get into a catfight, although I hope he will be able to draw contrasts with the other candidates.”\nSome have suggested that Clinton was given a much-needed boost thanks to statements made by House Majority Leader Kevin McCarthy’s on Sept. 29. His comments were interpreted by Clinton supporters, and many in the mainstream media, as alluding to a GOP political agenda behind the creation of a Benghazi select committee to investigate Clinton’s inaction in the 2012 terrorist attack there that claimed four lives, including U.S. Ambassador Christopher Stevens.\n“Kevin McCarthy gave her a political gift more valuable than gold,” University of Southern California political expert Sherry Bebitch Jeffe told the Mercury News. “So the debate is hers to lose.”\nThe debate, which is the first of six, is scheduled to take place tonight between 6 and 8 p.m. PST at the Wynn Las Vegas resort in Las Vegas and will be hosted by CNN.\nFollow Adelle Nazarian on Twitter @AdelleNaz and on Facebook.","url":"https://www.breitbart.com/politics/2015/10/13/bay-area-democrats-tune-democratic-debate/"}
