{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 21:31:56","date_modify":"2018-10-30 21:31:56","date_publish":"2015-12-01 18:29:26","description":"A Burlingame couple is renting out their children's one-bedroom, one-bathroom treehouse for $275 a night on Airbnb.","filename":"data/vaneerConsumption/BayAreaTreehouseGoesfor275aNightonAirbnb.json","image_url":"https://media.breitbart.com/media/2015/12/Screen-Shot-2015-12-01-at-10.26.43-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_12_01__1540935116.html","title":"Bay Area Treehouse Goes for $275 a Night on Airbnb","title_page":"Bay Area Treehouse Goes for $275 a Night on Airbnb | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A Burlingame couple is renting out their children’s one-bedroom, one-bathroom treehouse for $275 a night on Airbnb.\n“We had no idea that it would bring such joy to so many interesting people from around the globe, but we are delighted by this,” owners Linda and Doug Studebaker wrote on the Airbnb website, according to the San Francisco Chronicle.\nThe treehouse is nestled in a 150-year-old coast live oak and comes with cable TV, wireless Internet, heating, bathroom essentials and breakfast.\nAfter applying a “services fee” and “cleaning fee” the rental comes out to $358 a night. The Studebakers reportedly stand to make up to $100,000 annually on the property.\nIronically, the listing states there are “NO CHILDREN ALLOWED” and presents the treehouse as “a very special retreat for one adult or a couple.”\nOther Airbnb news is even more bizarre.\nFive hours south of Burlingame, in Ojai, the owner of the Acacia Mansion, Kristina Knapic, filed a lawsuit against a gay porn company named Lucas Entertainment, which was renting the property and allegedly left it in a state of utter disgust–with fecal matter on the walls, linens, carpets and ceilings.\nAccording to the Chronicle, the suit seeks compensation for property damage ($30,000), emotional damages and breach of contract, among other things. The owner has also demanded the film not be released.\nKnapic reportedly believed she was renting her beautiful home to a “group of friends” on summer vacation. Instead, it was rented to well-known gay porn actor/director Michael Lucas (Andrei Treivas). Part of the lawsuit reads:\nOn August 16, 2015, after Defendants vacated the Property, Plaintiff entered the Acacia and immediately noticed that the Property was filthy (enema kits were found throughout the house — on the floor, in the beds, in nightstand drawer and in the trash; various sexual devices were found in the beds and in the trash; the hot tub water was brownish in color; and the linens were stained brown.)\nLucas retorted against the allegations, issuing a statement to Queert refuting all of Knapic’s claims and alleging that she is a “professional extortionist” who maintains a “fairly well-equipped sex dungeon in the basement, complete with a sex swing, whips, chains and miscellaneous bondage paraphernalia.”\nPart of Lucas’s statement reads:\nMs. Knapic was a resident in a guest house on the premises during our entire stay. Our windows faced her windows, we shared the yard and garden, we shared laundry facilities. If there were any activity which would have resulted in the damage she now claims, it would have been evident.\nFollow Adelle Nazarian on Twitter @AdelleNaz and on Facebook.","url":"https://www.breitbart.com/local/2015/12/01/bay-area-treehouse-goes-275-night-airbnb/"}
