{"authors":["Joe Strange For Mailonline"],"date_download":"2018-10-23 03:04:53","date_modify":"2018-10-23 03:04:53","date_publish":"2016-01-29 17:50:48","description":"David Alaba says he understands why more players are choosing to move to the Premier League after admitting that talks over a new contract with Bayern Munich are not a priority.","filename":"data/vaneerConsumption/BayernMunichdefenderDavidAlabahintsatPremierLeaguemoveafterdescribingitasoneofthebestleaguesintheworld.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30B2523400000578-0-image-a-15_1454089280353.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422774_Bayern-Munich-defender-David-Alaba-hints-Premier-League-describing-one-best-leagues-world_1540263893.html","title":"Bayern Munich defender David Alaba hints at Premier League move after describing it as 'one of the best leagues in the world'","title_page":"Bayern Munich defender David Alaba hints at Premier League move after describing it as 'one of the best leagues in the world' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"David Alaba says he understands why more players are choosing to move to the Premier League after admitting that talks over a new contract with Bayern Munich are not a priority.\nItalian newspaper Gazzetta dello Sport claimed that Alaba was a target for Real Madrid earlier this month, but the Austria international has hinted that he could be interested in a move to England.\nThe 23-year-old, who has won four Bundesliga titles with Bayern, is out of contract in the summer of 2018 and describes the Premier League as 'one of the best leagues in the world'.\nDavid Alaba (right) has described the Premier League as 'one of the best leagues in the world'\nBayern Munich star Alaba has a contract at the Allianz Arena which runs until the summer of 2018\nDAVID ALABA THIS SEASON Appearances: 12 Goals: 0 Chances created: 9 Pass accuracy: 93 per cent *Bundesliga only\nAlaba told AZ: 'I was injured for a quite a long time, so I was only thinking about my recovery. Contract talks were never on my mind.\n'Could I stay at Bayern my entire career? I'm not the type of person who looks that far ahead. I am setting short-term goals instead.\n'A move to England? I understand why a lot of players are moving there. It's one of the best leagues in the world. But the same goes for the Bundesliga.\nAlaba goes up for a header with Hamburg's Nicolai Muller during Bayern Munich's 2-1 victory last week\nAlaba, pictured in training in Qatar earlier this month, says he is grateful to playing for Bayern Munich\n'I am not missing anything at Bayern. Everybody who has ever played for Bayern knows how good this club is for its players.\n'We are all grateful to be playing for Bayern. Munich is a great place for me.'","url":"https://www.dailymail.co.uk/sport/football/article-3422774/Bayern-Munich-defender-David-Alaba-hints-Premier-League-describing-one-best-leagues-world.html"}
