{"authors":["Kit Holden For Mailonline"],"date_download":"2018-10-23 01:31:00","date_modify":"2018-10-23 01:31:00","date_publish":"2017-04-26 11:54:56","description":"Worse things happen at sea, you might say, but in Germany, Borussia Dortmund and Bayern Munich's Champions League exits last week prompted a mini-wave of soul-searching.","filename":"data/vaneerConsumption/BayernandBorussiaDortmundbiddingtosavetheirseasons.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9F405F00000578-0-image-a-5_1493204798674.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4447258_Bayern-Borussia-Dortmund-bidding-save-seasons_1540258260.html","title":"Bayern and Borussia Dortmund bidding to save their seasons","title_page":"Bayern and Borussia Dortmund bidding to save their seasons | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"For the first time since 2005, there is no German club in the semi-final of a major European competition.\nWorse things happen at sea, you might say, but in Germany, Borussia Dortmund and Bayern Munich's Champions League exits last week prompted a mini-wave of soul-searching.\nNeither team's quarter-final defeat was embarrassing, of course. Bayern put up a spirited fight in an even tie with Real Madrid, while Dortmund fought bravely but hopelessly in the aftermath of an attack on their team bus.\nBayern Munich players look dejected following the Champions League defeat to Real Madrid\nBorussia Dortmund stars leave the pitch after the quarter-final defeat to Monaco\nYet the lack of a semi-final place in Europe has still left Germany smarting. And it has made a different semi-final - that of the German Cup - even more important.\nDortmund and Bayern will do battle on Wednesday evening for a place in the German Cup Final in Berlin next month. After the Champions League disaster, this is no longer just a domestic cup competition - this is about saving the season.\nWith Eintracht Frankfurt waiting in the final, whoever wins tonight will be favourites to win. For both Dortmund and Bayern, this is a must win.\n'Whether or not this is a good or a bad season depends on what happens in the cup,' said Bayern captain Philipp Lahm this week.\nThat is particularly important for Lahm, who will retire at the end of this season. Bayern may already be running away with the Bundesliga title, but for a man as well decorated as Lahm, nothing more than the double will suffice at this stage.\nPhilipp Lahm walks down the tunnel prior to Saturday's Bundesliga clash with Mainz\nLahm, though, is indicative of the wider significance of this game for Bayern. Carlo Ancelotti was hired to manage a generational shift in Bayern's ranks, and if he now fails to win the double, he will be off to a bad start.\nThe Italian coach admitted that he has tried in vain to persuade Lahm to play on for another year. He knows that the team will struggle to deal with losing their captain, and he doesn't want to be the one who takes the rap.\nThat he will, though, and particularly if his first season is deemed to be under par. 'The doubts over Ancelotti are going to grow,' declared Bild this week.\nBayern have reason to be optimistic about Wednesday evening, despite the pressure. They outclassed Dortmund a few weeks ago, thrashing them 4-1 at the Allianz Arena.\nIn the cup, though, their record is more shaky. The two teams have met in either the semi-final or final of this competition in four of the last five years. Bayern have won two finals against Dortmund, but they have also lost a final and a semi-final.\nCarlo Ancelotti will be off to a bad start if he fails to win the double this season\nStriker Robert Lewandowski applauds the fans after the loss at the Bernabeu last week\nWith Manuel Neuer out for the rest of the season, the Munich giants also have an injury concern which may become fatal should the clash go to penalties.\nFor Dortmund coach Thomas Tuchel, meanwhile, the familiarity of this clash is reason for optimism.\n'It's a good thing that we've been here before,' said Tuchel. 'It's like skiing: if you've gone down a black slope once, the likelihood is that it will be easier the second time.'\nDespite their Champions League exit, Dortmund are also on a mini-high after the return of Marco Reus. The star forward's strong performances have helped the team bounce back from the attack on the bus.\nDortmund hope that Reus, who is still yet to win a major trophy with Dortmund, will inspire them to victory this evening.\nMarco Reus (left) in action during Saturday's victory at Borussia Monchengladbach\n'He has developed a great strength,' said Tuchel. 'He is ready to do great things.'\nFor all the positive talk, there is also a lot of pressure on Tuchel's shoulders. According to a report in Bild, the coach's contract will be renewed if he wins the cup. In the midst of rumours about issues between him and the board, such job security would be a welcome relief.\nFor both Tuchel and Ancelotti, the situation is the same. The mood in which they begin next season will depend entirely on how this evening's clash turns out. Their relationship with the fans, with their employers over the next twelve months all hangs on this evening.\nThat, and the sheer quality of these two teams, should make for a gripping semi-final encounter. Even if it isn't in Europe.","url":"https://www.dailymail.co.uk/sport/football/article-4447258/Bayern-Borussia-Dortmund-bidding-save-seasons.html"}
