{"authors":["Sally Williams For The Daily Mail"],"date_download":"2018-10-22 21:29:49","date_modify":"2018-10-22 21:29:49","date_publish":"2016-01-11 00:49:20","description":"Dr Wajihi Abdullah, 32, from Catford, in South London, puts her two-year-old Zara in nursery from 7am to 8pm. Jenny Willett, 41, an MP for ten years, put her children to sleep in her office.","filename":"data/vaneerConsumption/BayTreeHouseNurseryinCatfordofferingextendedhourschildcare.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/3001A8FF00000578-0-image-a-113_1452474830469.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3392999_Mothers-leave-children-nursery-NIGHT-s-belief-women-face-pressure-work-longer-hours-taking-shocking-step_1540243789.html","title":"Bay Tree House Nursery in Catford offering extended-hours childcare","title_page":"Bay Tree House Nursery in Catford offering extended-hours childcare | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Naomi is getting ready for bed. At 14 months she has plump feet in pink stripy socks and wispy hair. It's half past six, she's had tea (cheese, crackers and raisins), her bath and a bedtime story - and now sleep awaits.\nBut Naomi is not at home. She's at Bay Tree House Nursery in Catford, South-East London, one of a growing number of UK nurseries providing extended-hours childcare, some even offering nights. By day the room is used for under-twos, by night it has two little wooden beds, barely two inches from the ground to meet with health and safety regulations. There is also a cot in the corner for small babies.\nThe room, with its wipe-clean surfaces and lullabies coming from an iPad, suggests brightness and efficiency. There are no curtains, darkness looms through the window. And it's nursery nurse Sam Newell, 27, reading Naomi the story because her mother, a 28-year-old social worker, is on a night shift. Naomi was dropped off at 4pm with her Mini Mouse cuddly toy and her polka-dot dressing gown, and will be picked up at 8am, 16 hours later.\nIn what is an increasingly 24 hour society, childcare also needs to be available 24/7 too (stock image)\nAnd she's one of three babies spending the night here: there's also Tara, who is 15 months and staying because her mother, a 24-year-old nurse, works nights at the local hospital. The third baby, who is not yet one, is also the daughter of a nurse.\nThis week it was revealed that the average worker spends just three-and-a-half hours a day with their family. Dropping a baby off at nursery has become a standard part of British family life. According to recent figures, fewer mothers are staying at home to raise a family than at any time since records began, with many being forced back to work because of financial pressures. Traditionally, nursery hours were 8am to 6pm. Now, with the rise of what is increasingly a 24-hour society, the need is growing for childcare to be available 24/7, too.\nAccording to a report by the Resolution Foundation think tank, unconventional hours are increasingly the new norm.\nAt least one partner in 75 per cent of families on low-to-middle incomes and in 91 per cent of families on higher incomes 'works outside the hours of 8am to 6pm'.\nThe UK, meanwhile, has the highest proportion of employees regularly working at night in the EU. That, combined with the rise of zero-hours contracts, where staff work only when needed by employers, often at short notice, is contributing to the need for out-of-hours childcare. As is the fact that many office workers operate on a knife-edge - racing to collect children from nurseries that impose fines for late pick-ups. One London nursery charges £5 for every minute a child stays after 6pm.\nIt doesn't help that many parents don't live close enough to family to ask relatives to help. 'There are an awful lot of people in this part of London who don't have an extended family to call upon,' says Janet Hogman, the owner of Bay Tree House Nursery, which only closes on Christmas Day and bank holidays.\nBay Tree House first introduced extended hours in 2012 and it's now open all day and all night seven days a week. Parents can drop children off from 6am and any child not picked up by midnight will stay the night.\nJenny Willett, 41, pictured above, an MP for ten years, had to put her children Toby, five, and Joshua, two, to sleep in her office in their pushchairs after they finished nursery from 9am to 6pm from three months old. She often had to 'dump' her children on the nearest MP to go to the House of Commons for an unexpected vote\nThere is no official limit for how long parents can leave children. 'The late service and the early drop off have really taken off,' says Janet. Uptake for nights is still small, with one to three children staying around two nights a week.\n'The service is to help,' says Maria Quiroga, the nursery's manager. On the day I visited, five other children, aged two to three, were staying late - one to 10pm (his mother was a police officer). Other parents who use the late service include a lawyer and teacher (who was putting on a play and had to stay late). Another little girl, whose mother is a midwife, is in the nursery from 7am to 9pm twice a week.\nSo far there have been two occasions when a child has had to stay for 48 hours. In one case the mother was in hospital and had no one to help; in the other, the mother was on business.\nCosts range from £47 to £51 a day depending on the age of the child; plus £6 for every hour after six during the week (and £7.50 for every hour after six at weekends). The night nursery costs £60 from 5pm to 9.30am.\nMany nurseries are introducing round-the-clock care for parents who work nights (stock image)\n'It's critical for me to have this nursery, otherwise I wouldn't be able to work, end of story,' says Dr Wajihi Abdullah, 32, who works in emergency medicine at King's College Hospital, London. 'There is no way I could find a nine to five job in the hospital at this point in my career.'\nDr Abdullah lives in Catford with husband, Abdullah Qurashi, 40, a security officer, who works from 7am to 7pm (and is out of the home from 6am to 8pm) and their daughter Zara, two. Dr Abdullah's aim is to become a consultant in emergency medicine, which requires several years of training and flexibility when it comes to night shifts.\nDr Abdullah took seven months off for maternity leave. But Zara is now dropped off at Bay Tree House around 7am and picked up at 8pm. 'During that time she's had breakfast, nap, lunch, nap, tea - and if she stays late - dinner,' says her mother.\n'We feel horrible about the fact we're missing 13 hours a day, when Zara's growing up,' Dr Abdullah admits. 'Sometimes [the nursery workers] are the ones telling us 'She said this word, she did this. She can dance, you should put her in a ballet class.' So we do feel bad but at least she's in a safe, very nurturing environment.'\nSMALL FORTUNE It costs an average of £6,000 a year to send a toddler to nursery part-time\nChristine Seasman, who has worked in the childcare business for 26 years, says it's important for nurseries to move with the times. That is why this year she is introducing round-the-clock care in one of her four nurseries - The Wendy House in Upton, in the Wirral - and if it's a success she'll extend it to at least one of the others.\n'If parents are being stopped from going back to work because they haven't got a support network, it's unfair on them,' she says. 'We've already had a couple of enquiries for 24-hour care from people who work for Jaguar near Liverpool.'\nBut what is the effect on babies and toddlers who spend so long away from their parents?\n'It might be good for job opportunities but this is getting priorities wrong,' says early years teacher Nancy Stewart. 'Raising children is one of the most important jobs there is and it can't be delegated.'\nShe believes too many of us put jobs first over the needs of children. 'Children need to settle to sleep and wake up knowing the person they trust is there for them, otherwise they can become anxious and stressed, which in turn can impact on their ability to stay healthy, to learn, and to feel good about themselves and other people.'\nExperts think that the institutional setting of nurseries and issue of the relationship the child has with its carers could prove problematic - children are at their most vulnerable when they are tired (stock image)\nFor Penny Tassoni, early years expert and author, it's not the institutional setting of a night nursery that's her greatest issue but the relationship the child has with the carers.\nThe bottom line is that when children are at their most vulnerable, most tired and most needing reassurance, will they be with somebody who cares about them?'\nAs parents know, some nurseries have a high turnover of staff, making it difficult for children to bond with one particular worker.\nWorking parents should also be conscious, she stresses, of the need to compensate for the time they've lost together.\nThe truth is we just don't know what the long-term impact will be. Several studies have flagged up that long hours in childcare (particularly before the age of two) are associated with feelings of insecurity and aggression when the child goes to school. Some researchers suggest these disappear by the age of ten. Others maintain the damaging effects can still be evident years later. It's unclear where the truth lies, especially as some of the young children I met were in a nursery 12 hours a day, meaning a potential 60 hours a week.\n'Some of these children bond with us. We're like a second parent because we see them more than their parents do. The parent is getting the weekend with them and that's about it'\n'This is new territory and we need to do more research,' says Kathy Sylva, Professor of Educational Psychology at the University of Oxford.\nCertainly, some nursery workers are worried. 'If it was my child, I don't think I'd have them in nursery for such long hours,' admits one employee who looks after under-twos at a nursery which has been registered for night care since 2002.\n'Some of these children bond with us. We're like a second parent because we see them more than their parents do. The parent is getting the weekend with them and that's about it.'\nJenny Willott, 41, mother of Toby, five, and Joshua, two, and an MP for ten years (she was a junior minister in the Department for Business, Innovation and Skills from 2013 to 2014) had the option of late hours at the House of Commons nursery, where her boys were cared for from 9am to 6pm four days a week, from the age of three months. She declined, partly because of the cost - around £30 per day for 6pm to 10pm.\n'But it also felt a bit wrong, since I took them in at nine in the morning. The nursery was absolutely fantastic and both of my kids were incredibly happy there, but it is different from being at home and in a bedroom. It is still a nursery, an institution, however loving and friendly it is.'\nInstead, her routine was to collect the boys from the nursery at 6pm and take them to her office where they would have supper together (with food from the parliamentary canteen).\n'Then I'd put them to sleep in their pushchairs. I have one child who goes to sleep fairly easily and the other was a total nightmare, so there was lots of pushing him up and down the corridors and shushing and trying to get him to sleep.'\nShe says the biggest challenge was voting because getting to the House of Commons from her office involved 'lots of lifts' - not easy with a buggy.\n'If you were expecting a vote that was fine, because you could get yourself ready, but quite often they'd catch you unawares and you'd have to grab one or both children and just run and dump them on the nearest MP while I went to vote.'\nGiven the growing number of nurseries offering extended childcare and the amount of anti-social hours we are being asked to work, it is inevitable the number of children in out-of-hours care will rise.\nLabour MP Tessa Jowell recently called for a 'revolution' in flexible childcare with nurseries and childminders offering their services around the clock, as a way of getting more mothers into work.\n'Seven-day-a-week working, 24-hour-working - it's not what many parents would choose,' says Penny Tassoni. 'So it's about how we help parents to feel confident their child is still being nurtured.'\nBut ultimately being in a nursery away from parents for such long periods isn't good for children, says child psychologist and author Penelope Leach. 'More and more of what we think of as parenting is being passed over to nurseries,' she laments.\n'We're asking small children to 'work' as it were - be away from home doing something they've got to do - for nearly twice as long as we would expect an adult to. Being in a group for all those hours is tricky. Most small children, like most people, including me, need some time when you can just be you and you're not having to get on and be with other people.\n'That's one of the dangers - no time to stand and stare, no time to suck your thumb - so, yes, very long hours are a pity.'","url":"https://www.dailymail.co.uk/femail/article-3392999/Mothers-leave-children-nursery-NIGHT-s-belief-women-face-pressure-work-longer-hours-taking-shocking-step.html"}
