{"authors":["Associated Press"],"date_download":"2018-10-23 03:14:21","date_modify":"2018-10-23 03:14:21","date_publish":"2017-04-26 14:40:51","description":"LOS ANGELES (AP) - In 2000, Dwayne \"The Rock\" Johnson was trying to break into Hollywood. He was off to an OK start. The pro-wrestler already had a...","filename":"data/vaneerConsumption/BaywatchsDwayneJohnsonjustwantstoentertainyou.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/14/wire-465515-1493214360-11_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447888_Baywatchs-Dwayne-Johnson-just-wants-entertain-you_1540264461.html","title":"'Baywatch's' Dwayne Johnson just wants to entertain you","title_page":"'Baywatch's' Dwayne Johnson just wants to entertain you | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"LOS ANGELES (AP) - In 2000, Dwayne \"The Rock\" Johnson was trying to break into Hollywood. He was off to an OK start. The pro-wrestler already had a following, a role in \"The Mummy Returns\" and high-wattage charm. He also had no acting experience, no idea how Hollywood worked, and, besides a few idols in Harrison Ford, Clint Eastwood and Arnold Schwarzenegger, no blueprint for success.\n\"I couldn't say, 'Oh, let me just follow the half-black and half-Samoan actor who was also a wrestler. Let me follow his path.' That wasn't an option, that wasn't there. So I was forced to create my own,\" Johnson said recently. \"I have an ideology that I always like to share with the inner group, and with some people on the outside, and I'll share it with you: I don't just want to play the game. I want to change the way the game is played.\"\nAnd he did, becoming one of the world's biggest movie stars in the process, with a booming production company, a year-round filming schedule, 84.4 million followers on Instagram, 11.2 million on Twitter and a reported $64.5 million salary in 2016 that put him at the top of Forbes' highest-paid actors list.\nThis image released by Paramount Pictures shows Dwayne Johnson, Left, and Zac Efron in a scene from, \"Baywatch,\" in theaters May 25. (Frank Masi/Paramount Pictures via AP)\n\"Alone among his generation, Dwayne Johnson has aimed for middle of the road, broad, appealing, leading man status,\" said Richard Rushfield, who runs the Hollywood newsletter The Ankler. \"While his peers have carved out more edgy, cool, of-the-moment profiles, Johnson has assiduously whittled down the rough edges of his early 'The Rock' wrestling persona.\"\nSimply, the 44-year-old superstar is an entertainment machine and, like Schwarzenegger before him, summer is his main stage. There's his pre-summer \"Fast and the Furious\" movies, which Johnson is credited as helping to revitalize. The latest is expected to cross $1 billion globally this week. But Johnson has also proven himself to be a summer draw on his own in leading roles in the disaster pic \"San Andreas\" in 2015 and the buddy comedy \"Central Intelligence\" in 2016. This summer, he's betting on \"Baywatch,\" out May 25, as a potential new franchise.\n\"I love being able to create big movies or TV shows that entertain people, that make them happy. I know what it's like to earn a dollar. I know what it's like to live paycheck to paycheck and wonder how you're going to pay the rent. I know what it's like to be evicted. Money doesn't fall out of the sky. So if you're going to pay for your ticket, that inspires me to want to make a great movie,\" said Johnson, who remembers being evicted at age 14. \"I always say to everyone, 'Hey, around the corner we're getting evicted. Get to work!' I drive everyone crazy with that.\"\nJohnson, who heads up the production company Seven Bucks with his ex-wife Dany Garcia, may be the purest expression of a global entertainer there is, aside from Tom Cruise or Will Smith. He thinks big. He thinks globally. The audience is king. And he's going to put in the work to make sure they're smiling.\nIt's that thinking that led him to the \"Baywatch\" movie. Johnson was a teenager when the show was at the height of its popularity. He appreciated the \"sexiness\" of it, but also considered it kind of cheesy. Then, about five years ago, he was told it was the most successful television show of all time - an unparalleled global hit. And that settled it. Johnson would have to don the red trunks.\nThe film is not the television show, nor is it trying to be. There are still red suits, and the babes and the bodies and some of the same names (Johnson is Mitch Buchannon, the role originated by David Hasselhoff), but he says their movie is funnier, raunchier, more action-packed and, well, more self-aware. The cast includes Zac Efron, Alexandra Daddario and Priyanka Chopra.\n\"I always say, I have one boss. Not the movie studios ... The audience. The people. They'll dictate if there's another one,\" Johnson said. \"I think we have a good shot.\"\nHis philosophy for what works is pretty simple, too. Balance great action with genuine humor and you will usually send the audience home not just happy, but \"floating.\"\n\"You know that cool feeling that you feel when you walk out of the theater thinking, 'That was the greatest movie!' And you're kind of floating and talking about it in the car? I like that kind of thing,\" he said.\nAnd he'll do whatever it takes to achieve that, even if it means 4 a.m. wake up calls, promoting projects with the vigor of P.T. Barnum and working a 12-month shooting schedule two years in a row all while maintaining a personal life with his partner, Lauren Hashian, and 1-year-old daughter, Jasmine. He's already filming the arcade game pic \"Rampage\" and will go straight on to \"Skyscraper,\" a hostage thriller from his \"Central Intelligence\" director. Suddenly, it'll be December and time to promote his big Christmas release \"Jumanji: Welcome to the Jungle.\"\n\"What is this 'break' thing you speak of,\" Johnson said with a chuckle. \"But it's a good time for me. There's a lot of good things going around.\"\n___\nFollow AP Film Writer Lindsey Bahr on Twitter: www.twitter.com/ldbahr\nIn this image released by Sony Pictures shows, from left, Kevin Hart, Dwayne Johnson, Karen Gillan and Jack Black from the film, \"Jumanji: Welcome to the Jungle,\" in theaters Dec. 20. (Frank Masi/Sony Pictures via AP)\nThis image released by HBO shows Dwayne Johnson from the HBO series, \"Ballers.\" Johnson is an entertainment machine. The 44-year-old former pro-wrestler turned global superstar had a 12 month shooting schedule last year, and is on track for another in 2017. It's no wonder he topped Forbes' highest paid actors list in 2016 with an estimated $64.5 million payday. (HBO via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-4447888/Baywatchs-Dwayne-Johnson-just-wants-entertain-you.html"}
