{"authors":["Martyn Ziegler","Press Association"],"date_download":"2018-10-22 20:34:27","date_modify":"2018-10-22 20:34:27","date_publish":"2016-01-28 01:52:38","description":"It is the third time a debate between the five candidates has had to be dropped in the space of a week as those in the running to succeed Sepp Blatter shy away from the public stage.","filename":"data/vaneerConsumption/BBCcancelsFIFApresidentialcandidateslivedebateascandidateswouldnotagreetoterms.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/3074801700000578-0-image-a-31_1453945927685.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_sportsnews_article-3420136_BBC-cancels-FIFA-presidential-candidates-live-debate-one-candidate-says-no-try-goalposts_1540240467.html","title":"BBC cancels FIFA presidential candidates live debate as candidates would not agree to terms","title_page":"BBC cancels FIFA presidential candidates live debate as candidates would not agree to terms | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It is the third debate between the hopefuls that has been cancelled\nPresenter Victoria Derbyshire said candidates would not agree to terms\nThe BBC has been forced to abandon its plans to hold a debate between the FIFA presidential candidates.\nIt is the third time a debate between the five candidates has had to be dropped in the space of a week as those in the running to succeed Sepp Blatter shy away from the public stage.\nESPN has also abandoned its attempt to host a debate, while one organised for the campaign group New FIFA Now in the European parliament on Wednesday saw only one candidate - Frenchman Jerome Champagne - attend.\nBBC have cancelled their debate between the potential successors of Sepp Blatter as FIFA president\nFrench candidates Jerome Champagne was the only one to show up to a FIFA debate in European Parliament\nBBC presenter Victoria Derbyshire said on Twitter: 'We've pulled our live head-to-head TV debate with FIFA Presidential hopefuls. After one declined, some others wanted to, um, move the goalposts.'\nConservative MP Damian Collins, one of the New FIFA Now founders, criticised Domenico Scala, the head of FIFA's independent audit and compliance committee, for not issuing a statement clearing the candidates to debate in the European parliament.\nCollins told a news conference in Brussels: 'This would have been the only debate between the FIFA presidential candidates, ESPN and the BBC had tried.\nFA-backed candidate Prince Ali Bin Al-Hussein of Jordan did not take part in the debate in Brussels\n'We are thankful and grateful to have Jerome Champagne who ignored the behaviour of the other candidates and decided to turn up.\n'There is one person who could have put this uncertainty to one side and that is Domenico Scala. It would be ridiculous to believe a debate in the European parliament could constitute political interference in football, he simply refused to give any guidance at all.'\nChampagne, who spent 11 years working at FIFA including as deputy secretary general, reiterated his promise to look to move the 2022 Qatar World Cup back to April or May of that year instead of the November and December dates decided last year.","url":"https://www.dailymail.co.uk/sport/sportsnews/article-3420136/BBC-cancels-FIFA-presidential-candidates-live-debate-one-candidate-says-no-try-goalposts.html"}
