{"authors":["Simon Kent"],"date_download":"2018-10-30 18:57:53","date_modify":"2018-10-30 18:57:53","date_publish":"2016-03-18 12:09:29","description":"BBC journalist and presenter Chris Rogers told radio listeners “Israel hasn’t really worked out” and has now been told to apologise.","filename":"data/vaneerConsumption/BBCJournalistWhoSaidIsraelHasntReallyWorkedOutToldToApologise.json","image_url":"https://media.breitbart.com/media/2016/03/rogers.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2016_03_18__1540925873.html","title":"BBC Journalist Who Said 'Israel Hasn't Really Worked Out' Told To Apologise","title_page":"BBC Journalist Who Said 'Israel Hasn't Really Worked Out' Told To Apologise","title_rss":"NULL","source_domain":"breitbart.com","text":"A BBC journalist who told radio listeners “Israel hasn’t really worked out” has been told to apologise. Chris Rogers (pictured), an award-winning presenter who has won acclaim for investigative work for Sky News, ITV and BBC’s Panorama programme, made the comments while taking a call from someone who said migrants to Britain should be shipped off to Africa.\nThe caller, named Ian, said: “Africa’s huge… Why can’t we put them there?” Rogers replied that many had fled Africa, before asking: “Is just dumping families from all over the world, lots of different cultures, and reasons for fleeing, is just dumping them in a new state, if we do Israel all over again, is that really the answer? I mean Israel arguably hasn’t really worked out, has it?”\nAt least one listener called to complain, prompting a spokesman for the Board of Deputies to intervene and say: “This off-hand, politically-loaded comment about Israel was most unfortunate… Mr Rogers was way off the mark.”\nHe added: “Considering the challenges it has faced from hostile neighbours, Israel has been a huge success, economically, culturally and politically, and is the only liberal democracy in the region. Mr Rogers should clarify or apologise for his comments.” The Board tweeted the outcome thus:\nBBC presenter apologises following @BoardofDeputies intervention https://t.co/1EAeQWpG6x — Board of Deputies (@BoardofDeputies) 17 March 2016\nThe Jewish News quoted a spokeswoman from the BBC as saying in response: “Chris Rogers was trying to challenge the caller’s point by finding a historical comparison and in the heat of a live program discussion. He picked the example of Israel. He accepts that his words might have implied criticism of the creation of the state of Israel which was not his intention. BBC Radio London apologizes if any listener was offended.”\nThis is not the first time a BBC radio show has been caught in an anti-Semitic controversy. In January the national broadcaster was forced to investigate a phone-in show that gave an anti-Semitic Londoner almost 15 minutes of airtime to air his views on the topic of Jewish world domination.\nAs Breitbart News reported, during the Simon Lederman show on 22 December, the caller, introduced as “Andy from St Margaret’s”, said: “The Rothschilds, the people who own the Bank of England, the people who own the Federal Reserve, they’re all Zionist Jews. The people who own corporate America, the media, you’ll find if you just do a little bit of research, they’re all Zionist Jews. We are ruled by Zionist Jews.”","url":"https://www.breitbart.com/the-media/2016/03/18/bbc-journalist-who-said-israel-hasnt-really-worked-out-told-to-apologise/"}
