{"authors":["Sarkis Zeronian"],"date_download":"2018-10-30 20:08:05","date_modify":"2018-10-30 20:08:05","date_publish":"2015-10-30 17:34:00","description":"E-petitions allowing the public to influence what is debated in Parliament are generating concern among the establishment such as the BBC.","filename":"data/vaneerConsumption/BBCQuestionsEPetitionsJustWeeksAfterMassiveAntiImmigrationCampaign.json","image_url":"https://media.breitbart.com/media/2015/10/Afghan-Interpreters-Petition-Delivered-To-Downing-Street-By-Winston-Churchills-Great-Grandson-Getty.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_10_30__1540930085.html","title":"BBC Questions E-Petitions Just Weeks After Massive Anti-Immigration Campaign","title_page":"BBC Questions E-Petitions Just Weeks After Massive Anti-Immigration Campaign","title_rss":"NULL","source_domain":"breitbart.com","text":"The re-introduction of e-petitions allowing members of the general public to influence what is debated in Parliament has generated concern among pillars of the establishment such as the BBC shocked by the scale of support for an anti-immigration debate.\nAlmost since the day it was created, the BBC has enjoyed a privileged position at the heart of British politics. The political agenda of the day has been drawn up in the broadcasting corporation’s news rooms, but the advent of a stronger system of e-petitions generated by the general public is now challenging that.\nThe BBC in particular is beginning to question the process with barely-veiled attacks on the new system. In an article at BBC Online titled “Are e-petitions a waste of time?” the author asks: “Will it improve engagement between the people and their representatives – or is it all just window dressing?”\nThe wide availability of internet access and ease of use of the government website means a small number of activists can assert their right to be heard, especially if their campaign goes viral on social media. The system has been simplified and now when a petition is supported with just 10,000 signatures, it receives a response from the government. When it receives over 100,000 signatures a cross-party committee of MPs considers it for a parliamentary debate.\nAnd that is what terrifies the agenda-setters in the establishment.\nOf course there are petitions which the likes of the BBC will support gleefully. Currently the most popular, backed by over 440,000 people, calls on the government to “accept more asylum seekers and increase support for refugee migrants in the UK”. The next two call for the sale and use of cannabis to be legalised and for a vote of no confidence in the Health Secretary.\nIn fourth place, however, is where it all goes wrong for the establishment. Over 200,000 people have signed up to a petition calling on the government to “stop allowing immigrants into the UK”. The petition begins:\nThe UK government need to prevent immigrants from entering the UK immediately! We MUST close all borders, and prevent more immigrants from entering Britain. Foreign citizens are taking all our benefits, costing the government millions! Many of them are trying to change UK into a Muslim country!\nThe government was forced to respond, which it did in bland terms in the form of a press release restating government policy and failing to address the concerns of the petitioners. A Parliamentary debate also took place earlier this month.\nAlthough Breitbart London will soon report fully on what was said in Parliament, the debate was all but ignored by the mainstream media who would rather not feed the sentiment behind it.","url":"https://www.breitbart.com/europe/2015/10/30/bbc-questions-e-petitions-just-weeks-massive-anti-immigration-campaign/"}
