{"authors":["Donna Rachel Edmunds"],"date_download":"2018-10-30 18:59:28","date_modify":"2018-10-30 18:59:28","date_publish":"2015-06-07 15:39:49","description":"The British Broadcasting Corporation (BBC) edited out all mention of Jewish people from a front-line report on the liberation of Belsen concentration camp |","filename":"data/vaneerConsumption/BBCsImpartialityCutReferencestoJewsFromConcentrationCampReports.json","image_url":"https://media.breitbart.com/media/2015/06/GettyImages-466582564-1024x683.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_06_07__1540925968.html","title":"BBC's 'Impartiality' Cut References to Jews From Concentration Camp Reports","title_page":"BBC's 'Impartiality' Cut References to Jews From Concentration Camp Reports | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The British Broadcasting Corporation (BBC) edited out all mention of Jewish people from a front-line report on the liberation of Belsen concentration camp in Germany at the end of World War II, it has emerged.\nThe corporation had not wanted to air the report at all, only conceding when veteran broadcaster Richard Dimbleby threatened to resign.\nOn April 15, 1945, the Nazi concentration camp at Bergen-Belsen was liberated. There, despite there being no gas chambers, at least 50,000 Jews, Poles, Soviets, Dutch, Czechs, Germans and Austrians had lost their lives. Allied forces entering the camp found 60,000 prisoners still alive in the camp, most of them emaciated. A further 13,000 dead bodies were scattered around the grounds, unburied.\nAmong the first to arrive at the camp to witness the scenes was the broadcaster Richard Dimbleby, one of the BBC’s small band of pioneering war correspondents. Millions of radio listeners back in Britain heard the horror in his voice as he described the scene:\n“Here over an acre of ground lay dead and dying people. You could not see which was which… The living lay with their heads against the corpses and around them moved the awful, ghostly procession of emaciated, aimless people, with nothing to do and with no hope of life, unable to move out of your way, unable to look at the terrible sights around them … “Babies had been born here, tiny wizened things that could not live … A mother, driven mad, screamed at a British sentry to give her milk for her child, and thrust the tiny mite into his arms, then ran off, crying terribly. He opened the bundle and found the baby had been dead for days. “This day at Belsen was the most horrible of my life”.\nBut the report they were hearing had been edited, from an original length of eleven minutes down to just six, and all reference to Jews had been taken out.\n“It was, I think, because the BBC needed more sources to support what had happened to the Jews, and worries that, if you mentioned one group of people and not others, it might seem biased or wrong,” Jonathan Dimbleby, Richard’s son has told the Sunday Times.\nMoreover, the report was originally rejected by BBC bosses, and was only broadcast after Richard Dimbleby threatened to resign.\nThe incident illustrates the inherent problem of putting a commitment to abstract impartiality ahead of objective reality, a problem which still dogs the BBC to this day. Jonathan Dimbleby says the corporation is still cautious when it comes to war reporting.\n“The broadcasters have a real problem with war,” he said. “You are subject to scrutiny and pressure which newspapers do not have. And at times the BBC reaches for the safety of a security blanket.”\nOne area in which this is problematic is the reporting of terrorism. In the BBC’s summary guidance on reporting terrorism, it states\nThere is no agreed consensus on what constitutes a terrorist or terrorist act. The use of the word will frequently involve a value judgement.\nAs such, we should not change the word “terrorist” when quoting someone else, but we should avoid using it ourselves\nIn case there was any doubt, the BBC’s Editorial Guidelines on use of language in terror situations state: “Terrorism is a difficult and emotive subject with significant political overtones and care is required in the use of language that carries value judgements. We try to avoid the use of the term “terrorist” without attribution.\n“The word “terrorist” itself can be a barrier rather than an aid to understanding. … We should not adopt other people’s language as our own; our responsibility is to remain objective and report in ways that enable our audiences to make their own assessments about who is doing what to whom.”\nBut in January 2015, the BBC came in for heavy criticism when it refused to label the Charlie Hebdo killers as “terrorists”.\nTarik Kafala, the head of BBC Arabic told the Independent: “We try to avoid describing anyone as a terrorist or an act as being terrorist. What we try to do is to say that ‘two men killed 12 people in an attack on the office of a satirical magazine’. That’s enough, we know what that means and what it is.\n“Terrorism is such a loaded word. The UN has been struggling for more than a decade to define the word and they can’t. It is very difficult to. We know what political violence is, we know what murder, bombings and shootings are and we describe them. That’s much more revealing, we believe, than using a word like terrorist which people will see as value-laden.”\nLord Tebbit said the only things “loaded” were the killers’ weapons.\n“I think the BBC would be well advised to look at the Oxford English Dictionary or any other good dictionary’s definition of terrorism,’ he said, adding: “I find it strange that the BBC should be trying to hide the nature of these people … They [the BBC] are as mad as rats, aren’t they?”","url":"https://www.breitbart.com/europe/2015/06/07/how-bbcs-committment-to-impartiality-led-it-to-edit-history-all-reference-to-jews-cut-from-belsen-report/"}
