{"authors":["Abe Hawken For Mailonline"],"date_download":"2018-10-23 02:22:45","date_modify":"2018-10-23 02:22:45","date_publish":"2017-04-26 13:28:52","description":"BBC presenter Jeremy Vine (inset) has been caught up in another road rage row after a motorist shouted 'f*** your mum' while he was cycling on a busy London street - but who was at fault?","filename":"data/vaneerConsumption/BBCsJeremyVineinnewroadragestorminKensington.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/14/3F9FCD4700000578-0-image-a-2_1493211785466.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447540_F-mum-BBC-s-Jeremy-Vine-new-road-rage-storm_1540261365.html","title":"BBC's Jeremy Vine in new road rage storm in Kensington","title_page":"BBC's Jeremy Vine in new road rage storm in Kensington | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BBC presenter Jeremy Vine has been caught up in another road rage row after a motorist shouted 'f*** your mum' while he was cycling on a busy London street.\nThe 51-year-old was abused and threatened in August last year by Shanique Syrena Pearson, 22, in Kensington, west London, and she is waiting to be sentenced.\nMr Vine, who hosts the popular quiz show Eggheads, has now revealed he suffered more abuse in the same part of the capital.\nThe driver of the Mercedes shouted 'F*** your mum' after Jeremy Vine asked him what he was doing\nIn his latest video, filmed on a headcam, the journalist was cycling past a bus along Kensington High Street.\nHe emerged from behind the vehicle and a black Mercedes 4x4 vehicle edged out in front of him - which prevented him from continuing along the road.\nMr Vine nearly ended up on the pavement and shouted 'what are you doing?' at the driver - who replied 'f*** your mum' before driving off.\nHe uploaded the video to his Twitter feed and quipped: 'You get a classier kind of person in Kensington.'\nBut the incident has caused a debate online with viewers torn as to who is at fault.\nTwitter user‏ @LadyVauxhall posted: 'The bus slowed down to let him cross but you tried to undertake when blind. Your fault, live with it.'\nMr Vine was cycling in Kensington when the car pulled out in front of him after he emerged from behind a bus\nBBC presenter and keen cyclist Jeremy Vine (pictured) has uploaded a video of a new road rage incident\nBut Ross Phillips defended the journalist and added: 'Bus had stopped to avoid blocking the junction but inside lane is clear so traffic should proceed, cars turning right do not have priority.'\nToby Edwards said: 'Bus blocking view of car. Car should've given way to cyclist. Cyclist was filtering through queuing traffic, which is perfectly legal.'\nSam Andrews added: 'I personally would have let the car go, but the abuse is not right!'\nIn February, Pearson was convicted at Hammersmith Magistrates' Court of driving without reasonable consideration for other road users and using threatening, abusive or insulting words or behaviour.\nShe was released on bail and will be sentenced at Isleworth Crown Court at a date yet to be set.","url":"https://www.dailymail.co.uk/news/article-4447540/F-mum-BBC-s-Jeremy-Vine-new-road-rage-storm.html"}
