{"authors":["Jake Wallis Simons","Associate Global Editor"],"date_download":"2018-10-23 03:48:29","date_modify":"2018-10-23 03:48:29","date_publish":"2017-04-26 15:20:22","description":"EXCLUSIVE: Speaking to Trade Unionists, Mr Loach said he regularly 'punished himself' by listening to 'biased' Nick Robinson present the Today programme.","filename":"data/vaneerConsumption/BBCsNickRobinsonBOOEDbyJeremyCorbynsupporters.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/14/3FA00EE600000578-0-image-a-24_1493215071574.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447396_BBC-s-Nick-Robinson-BOOED-Jeremy-Corbyn-supporters_1540266509.html","title":"BBC's Nick Robinson BOOED by Jeremy Corbyn supporters","title_page":"BBC's Nick Robinson BOOED by Jeremy Corbyn supporters | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BBC presenter Nick Robinson was booed by hundreds of far-Left Corbyn supporters last night as firebrand filmmaker Ken Loach slammed the broadcaster for criticising the Labour leader.\nSpeaking to a crowd of Trade Unionists at a Communication Workers Union event, Mr Loach – whose award-winning film I, Daniel Blake, was made in partnership with BBC Films – said he regularly 'punished himself' by listening to Nick Robinson present the Today programme.\nHe told the jeering crowd in Bournemouth: 'You have to take an extra blood pressure tablet when you listen to it.\n'Biased': Nick Robinson was booed by the crowd as director Ken Loach attacked his 'bias' against Jeremy Corbyn\n'They have a presenter called Nick Robinson. Nick Robinson. He showed his impartiality yesterday (sic).'\nAs he said the respected presenter's name the crowd booed loudly.\n80-year-old Mr Loach went on: 'Did anybody read this? His Twitter? He said – this is Nick Robinson, impartial BBC – this is what he says:\n'No-one should be surprised that Jeremy Corbyn is running against the Establishment and is long on passion and short on details. Story of his life.'\nHe concluded: 'That's Nick Robinson, ex-member of the Conservative Party. That's the partiality of the BBC. That's the bias we have to complain about. That's what we have to fight.'\nIn a comment partly drowned out by applause, he then appeared to add that 'people like Nick Robinson' aren't fit to 'lick [Jeremy Corbyn's] boots.'\nWhen MailOnline approached Mr Loach to confirm this, his spokesperson said: 'The important point is that Nick isn't fit to interview Jeremy.'\nDirector Ken Loach, left, apparently told an audience in Bournemouth that Nick Robinson shouldn't 'lick Jeremy Corbyn's boots'. Pictured right: Nick Robinson and his wife Pippa after he underwent treatment for cancer\nSpeaking to a crowd of Trade Unionists at a Communication Workers Union event, Mr Loach – whose award-winning film I, Daniel Blake, was made in partnership with BBC Films – said he regularly 'punished himself' by listening to Nick Robinson present the Today programme\nResponding to the attack, Mr Robinson, 53, told MailOnline: 'I judge Ken Loach by the quality of the work he produces. He is a great film maker.\n'I think he should judge me in the same way – by the interviews I do, which I endeavour to make both rigorous and impartial.'\nThe angry scenes at the Trades Union event in Bournemouth suggested frustration among Corbyn supporters after the Labour leader made a string of gaffes on the BBC.\nSpeaking on the Andrew Marr show last week, Mr Corbyn said that he was against Trident despite the fact that his party supported it. He also suggested that he would not kill the ISIS leader if he had him in his sights.\nResponding to the opprobrium that followed Thursday's tweet, Mr Robinson, who founded the Macclesfield Young Conservatives in the early Eighties and was president of the Oxford University Conservative Association in 1985, issued a clarification on Facebook last week.\n'When I tweeted earlier that people should not be surprised by Jeremy Corbyn's approach as it was 'the story of his life' some read it as being perjorative (sic) and evidence of that establishment sneering. I meant no such thing,' he wrote.\nKen Loach attacked Nick Robinson over a tweet in which he said Jeremy Corbyn was 'long on passion short on detail'\n'My point was that the Labour leader is doing what he has done for decades and what brought him huge and unexpected success in his party. So no-one should expect him now to change his approach.'\nThe broadcaster returned to work after beating cancer last year.\nMr Loach – who has worked regularly with the BBC over the last 50 years since it broadcast his iconic film Cathy Come Home – has previously railed against the corporation.\nIn an interview last year, the filmmaker described its news coverage as ‘manipulative and deeply political’ and said it was ‘a rotten place for a director’.\nSpeaking to an audience of Corbyn supporters at University College London in October, he labelled the corporation a ‘propaganda’ arm of the state which assumed a ‘pretense of objectivity’.","url":"https://www.dailymail.co.uk/news/article-4447396/BBC-s-Nick-Robinson-BOOED-Jeremy-Corbyn-supporters.html"}
