{"authors":["Tim Sculthorpe","Mailonline Deputy Political Editor"],"date_download":"2018-10-22 22:33:33","date_modify":"2018-10-22 22:33:33","date_publish":"2016-01-28 10:35:21","description":"The BBC programme poked fun at their presenter by tweeting out the clip - and suggesting Mr Davis may not have realised he had made the remark.","filename":"data/vaneerConsumption/BBCsEvanDavisintroducesLaboursHilaryBennbymanglinghisname.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A9E40100000578-0-image-a-2_1453980359548.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420656_A-little-earlier-spoke-Hilary-Big-Benn-BBC-s-Evan-Davis-makes-embarrassing-slip-live-air-introduces-Labour-politician-mangling-name_1540247613.html","title":"BBC's Evan Davis introduces Labour's Hilary Benn by mangling his name","title_page":"BBC's Evan Davis introduces Labour's Hilary Benn by mangling his name | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Newsnight presenter Evan Davis made an embarrassing gaffe last night as he introduced the shadow foreign secretary as 'Hilary Big Benn'.\nThe BBC programme poked fun at their presenter by tweeting out the clip - and suggesting Mr Davis may not have realised he had made the remark.\nMr Davis' slip of the tongue came as he introduced a pre-recorded interview with the senior Labour MP.\nBBC Newsnight drew attention to the slip up by tweeting a brief video of Mr Davis introducing the shadow foreign secretary as 'Hilary Big Benn'\nMr Davis did not appear to notice his error as he was speaking - and later insisted on air he had no recollection of it.\nBut he later apologised - insisting he was 'not quite sure' how the slip happened but blamed his tiredness.\nMr Benn, who was on the programme to talk about the crisis in Yemen and also discussed Labour's policy on the Trident nuclear deterrent, made light of the incident.\nAfter receiving an apology, he said: 'Don't fret Evan - it made me laugh!'\nTongue twisting gaffes have been common on the BBC - most famously when former Today programme presenter Jim Naughtie accidentally turned the airwaves blue while interviewing health secretary Jeremy Hunt.\nIn 2010, he called Mr Hunt 'Jeremy C***' - a slip sent a newsreader ‘under the table’ in fits of laughter.\nMr Naughtie later apologised to listeners and suggested the error came ‘courtesy of Dr Spooner’ - referencing an Oxford don known for muddling his words, and after whom a spoonerism is named.\nMr Davis swiftly apologised to the shadow foreign secretary following the gaffe on last night's live broadcast of Newsnight on BBC2\nMr Benn made light of the incident - insisting it had made him laugh\nAnd he told the Radio Times last August: ''I was there with lots of bits of paper and someone was shoving headlines in front of me and I said, \"After the news we’ll be talking to Jeremy C***\".\n'And all I could see behind the glass were arms going up in the air, as in \"We surrender\". And the guy who was passing the news bulletins to the late Rory Morrison went under the table [laughing].'\nAstonishingly, just one hour later Mr Naughtie’s Radio 4 colleague Andrew Marr made the same mistake when talking about the error - and both men later personally apologised to Mr Hunt.\nPoliticians are not immune - during the general election campaign David Cameron bizarrely claimed to be a West Ham supporter - despite previously stating that he followed Aston Villa.\n'You can support Man Utd, the West Indies and Team GB all at the same time - of course I'd rather you supported West Ham,' he said during a speech on ethnic minorities.\nThe Tory leader has since apologised, blaming a bout of 'brain fade' - perhaps he became confused since both sides wear claret and blue colours.","url":"https://www.dailymail.co.uk/news/article-3420656/A-little-earlier-spoke-Hilary-Big-Benn-BBC-s-Evan-Davis-makes-embarrassing-slip-live-air-introduces-Labour-politician-mangling-name.html"}
