{"authors":["Sarah Barns For Mailonline"],"date_download":"2018-10-23 03:24:05","date_modify":"2018-10-23 03:24:05","date_publish":"2016-01-11 16:03:44","description":"Outraged fans took to Twitter to rant about the 'graphic' childbirth scene, which saw the wife of Prince Andrei, played by London-born actor James Norton, 30, die giving birth to their son.","filename":"data/vaneerConsumption/BBCsWarandPeaceviewersshockedabouttheamountofBLOOD.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/18/300DA6B100000578-0-image-a-47_1452537625814.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3393894_Viewers-shocked-BLOOD-BBC-s-War-Peace_1540265045.html","title":"BBC's War and Peace viewers shocked about the amount of BLOOD","title_page":"BBC's War and Peace viewers shocked about the amount of BLOOD | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Shocked viewers have complained about the amount of blood in BBC1's new epic drama, War and Peace last night.\nOutraged fans took to Twitter to rant about the 'graphic' childbirth scene, which saw the wife of Prince Andrei, played by London-born actor James Norton, 30, die giving birth to their son.\nIn the compelling scene, Prince Andrei recovers from being stabbed on the battlefield just in time to see wife Liza Bolonskaya, portrayed by Milly Vitale, moments before she dies in Andrew Davies' new adaptation of Leo Tolstoy's masterpiece.\nShocked viewers have complained about the amount of blood in BBC1's epic drama, War and Peace last night\nThe distressing scenes saw character Liza Bolonskaya cry and scream out in pain during childbirth\nBut fans said the explicit clip, which showed her dead on the bed in a pool of blood, was too much.\nAghast Caroline Kinsella tweeted: 'The death in childbirth scene was rather graphic #warandpeace.'\nWhile a user under the name of Domestic Goddess added: 'Dear god do we need to see all that blood #WarAndPeace.'\nStunned Joanne Kane added: 'Right, well, they didn't hold back on the fake blood this week #WarAndPeace.'\nSocial media users found the shocking scenes quite upsetting and rushed to Twitter to air their views\nFans said the explicit clip, which showed Liza dead on the bed in a pool of blood, was too much\nIn the compelling scene, Prince Andrei recovers from being stabbed on the battlefield just in time to see wife Liza Bolonskaya moments before she dies in Andrew Davies' new adaptation of Leo Tolstoy's masterpiece\nGina Chapman complained the scene had made her think twice about having a baby. She commented: 'Well that has put me off childbirth forever #WarAndPeace'\nAghast Caroline Kinsella tweeted: 'The death in childbirth scene was rather graphic #warandpeace'\nWhile a user under the name of Domestic Goddess added: 'Dear god do we need to see all that blood #WarAndPeace.'\nStunned Joanne Kane added: 'Right, well, they didn't hold back on the fake blood this week #WarAndPeace'\nGina Chapman complained the scene had made her think twice about having a baby. She commented: 'Well that has put me off childbirth forever #WarAndPeace.'\nAs well as the distressing blood scene, other viewers took to social media to complain about the inconsistency of actors speaking with accents in the six-part adaptation.\nMost of the cast, who are playing Russians, speak with British accents, whilst those playing Austrians spoke with the correct accent last night.\nA confused Twitter user called Joanne tweeted: 'How do they decide in #WarAndPeace which nationality has an accent and which does not?'\nThe aftermath following Liza Bolonskaya's death in the BBC adaptation of War and Peace\nA confused Twitter user called Joanne tweeted: 'How do they decide in #WarAndPeace which nationality has an accent and which does not?'\nWhile a bemused contributor called James added: 'Watching War and Peace. Why does everyone in Russia in 1805 speak with a plummy English accent?'\nA perplexed viewer called Emily Lawson took to Twitter and wrote: 'Is the climax of this epic the grand unveiling of Jim's mysterious woodworking project? #WarAndPeace'\nOutraged fans took to Twitter to rant about the 'graphic' childbirth scene, which saw the wife of Prince Andrei, played by London-born actor James Norton, 30, die giving birth to their son\nPrince Andrei is seen talking to a nurse after the birth of his son in the BBC's epic drama, War and Peace\nWhile a bemused contributor called James added: 'Watching War and Peace. Why does everyone in Russia in 1805 speak with a plummy English accent?'\nMeanwhile, Alan Motley wrote: 'Why do the actors in War and Peace BBC speak with British accents as they play Russians? Just an observation.'\nFans were also curious to know what 66-year-old Lincolnshire-born actor Jim Broadbent's character, Prince Nikolai, was creating in his study, as he spent much of Sunday night's episode carving something out of wood.\nAfter hearing that his son Prince Andrei is presumed dead on the battlefield he gets back to his work carving.\nA perplexed viewer called Emily Lawson took to Twitter and wrote: 'Is the climax of this epic the grand unveiling of Jim's mysterious woodworking project? #WarAndPeace.'\nSocial media user Catherine Fallows joked: 'Woodwork - new cure for heartbreak - #warandpeace'\nWhilst Neverland Girl suggested he may be making a cot for his son's new baby: 'Is Jim Broadbent fashioning the baby's crib? #WarAndPeace'\nLeah Matcham tweeted: 'Husband came in .. Thought I was watching Harry Potter #WarAndPeace'\nWhile Rachel Stuart joked: 'What's Harry Potter doing in #WarAndPeace? #Pierre'\nSue Gosney wrote: 'I think the Count is Harry Potter's illegitimate brother #WarAndPeace Maggie Smith will be arriving soon'\nSocial media user Catherine Fallows joked: 'Woodwork - new cure for heartbreak - #warandpeace.'\nWhilst Neverland Girl suggested he may be making a cot for his son's new baby: 'Is Jim Broadbent fashioning the baby's crib? #WarAndPeace.'\nMany have revealed their favourite character in the ambitious series is Pierre Bezukhov, played by Paul Dano, 31, from New York, who becomes a count after inheriting his father's vast estate.\nFans have likened him to a grown-up Harry Potter, because he has tiny round glasses and even wore them in bed in last night's episode.\nLeah Matcham tweeted: 'Husband came in .. Thought I was watching Harry Potter #WarAndPeace.'\nWhile Rachel Stuart joked: 'What's Harry Potter doing in #WarAndPeace? #Pierre.'\nSue Gosney wrote: 'I think the Count is Harry Potter's illegitimate brother #WarAndPeace Maggie Smith will be arriving soon.'","url":"https://www.dailymail.co.uk/femail/article-3393894/Viewers-shocked-BLOOD-BBC-s-War-Peace.html"}
