{"authors":["Press Association"],"date_download":"2018-10-23 01:36:13","date_modify":"2018-10-23 01:36:13","date_publish":"2016-01-29 15:39:06","description":"Sir David Attenborough has said he is \"always fearful\" for the future of the BBC. The veteran naturalist was speaking during a visit to the Attenborough Arts...","filename":"data/vaneerConsumption/Bbcvaluablevulnerableandtakenforgrantedwarnssirdavidattenborough.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-2cba27c4-7490-4847-95fd-73f5735217ca-4PuZeKVXE7cd9005b2c876bc41e4-847_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3422854_BBC-valuable-vulnerable-taken-granted-warns-Sir-David-Attenborough_1540258573.html","title":"Bbc valuable, vulnerable and taken for granted, warns sir david attenborough","title_page":"Bbc valuable, vulnerable and taken for granted, warns sir david attenborough | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BBC valuable, vulnerable and taken for granted, warns Sir David Attenborough\nSir David Attenborough has said he is \"always fearful\" for the future of the BBC.\nThe veteran naturalist was speaking during a visit to the Attenborough Arts Centre in Leicester, which was championed by his late brother, the film-maker Lord Attenborough.\nHe described the national broadcaster - undergoing a Government review as part of its charter renewal - as \"vulnerable\" and said people take it for granted \"sometimes too often\".\nSir David Attenborough officially opens a gallery extension to the arts centre at the University of Leicester\nSir David, who celebrates his 90th birthday in May, said: \"The whole of the world of the media is changing in such a profound way, the way people see images, the way people hear talk, and the BBC has to change to match that.\n\"But at the same time, the fundamental founding principles of the BBC about providing a platform for as many views and aspects that the community has remains powerful and extremely valuable.\n\"You only really appreciate that when you go overseas and you look at it with the eyes of people from across oceans who look at the BBC as a beacon for thought and civilisation and we take it for granted in this country, sometimes too often.\"\nHe added: \"The BBC is a very vulnerable organisation, as well as being a very valuable one.\n\"And if you work at the BBC and care for the BBC, there is no moment when you shouldn't sink back and say 'Oh well, we're fine, nobody is going to damage us and you're quite wrong'.\"\nSir David returned to the place of his childhood in the East Midlands city to officially open the new £1.5 million gallery extension to the arts centre at the University of Leicester.\nThe renowned broadcaster also spoke of his concerns for the future of the planet.\nHe said: \"We have overrun it and we don't know what we are doing. We have already planted seeds for the future which are ineradicable.\n\"The temperatures are going to increase whatever we do. At the moment the question is whether, in fact, we can keep them down to a level which won't be disastrous.\n\"We are doing what we can but the problem is gigantic.\"\nSpeaking about the prospect of countries co-operating to find a solution, he said: \"Many people say it's an impossible ask. But unless we make some positive concession or some response to that task, we are in for serious trouble.\"\nHe also said that scepticism about climate change was \"bad thinking\".\nHe said: \"If it's so overwhelming, why do people deny it?\n\"The answer is for a lot of people the acceptance of climate change is very difficult for them because it may make a difference to their income or their business.\n\"It may damage their business, it may make them want to try and do things that will cost money, so it's more convenient to say 'no I don't believe it'.\n\"But to anyone who, as it were, doesn't have a vested interest I would have thought that the scientific evidence is beyond doubt.\"","url":"https://www.dailymail.co.uk/wires/pa/article-3422854/BBC-valuable-vulnerable-taken-granted-warns-Sir-David-Attenborough.html"}
