{"authors":["Nedra Rhone"],"date_download":"2018-10-30 17:53:41","date_modify":"2018-10-30 17:53:41","date_publish":"2018-07-19 18:09:00","description":"The BB&T Atlanta Open offers a variety of food, music and family fun during the eight-day tournament.","filename":"data/vaneerConsumption/BBTAtlantaOpenoffersmorethantennis.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/MyAJC/2018/07/19/Images/Bryan%20Brothers%20Band%202.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_talk-town_atlanta-open-offers-more-than-just-tennis__1540922021.html","title":"BB&T Atlanta Open offers more than tennis","title_page":"BB&T Atlanta Open offers more than tennis","title_rss":"NULL","source_domain":"ajc.com","text":"Each summer in July about 40,000 tennis fans attend the BB&T Atlanta Open at Atlantic Station for what has become one of the top ATP World Tour Tennis events in the country.\nThis year, the eight day event will draw fans hoping to catch US Open champs in action including Sloane Stephens, Jack Sock and the Bryan Brothers. While tennis is the big draw, the event also offers a ranges of entertainment options for attendees including upscale dining and live music.\n>>>MORE: Getting into the BB&T Atlanta Open, July 21 - 29\nHere are some of the entertainment highlights this year:\nFOOD AND BEVERAGE\nThis year, the BB&T Atlanta Open unveils “The Foodie Experience,” featuring upscale food and beverage choices from Concentrics catering in the food court. The offerings will include signature items from each of their Atlanta restaurants: Allora Ottimo Cibo, Molly B’s, Nexto, Parish, Room, Tap: A Gastropub and Two Urban Licks.\nIn the VIP Lexus Lounge, the Giving Kitchen will highlight a local chef on site each day of the tournament. Participating restaurants and chefs include:\nThe Shed at Glenwood, Chef Justin Dixon,\nFoundation Social Eatery, Chef/Owner Mel Toledo,\nChai Pani, Chef Meherwan Irani\nCity Pharmacy, Chef Christian Perez\nFarm Burger, Executive Chef Cameron Thompson\nOysters Co., Owner/Executive Chef Christopher Murphy\nO-Ku, Executive Chef Jordan Smith\nGusto!, Chef Shawn Grodensky\nBhojanic, Chef/Owner Archna Beckner\nCity Winery, Executive Chef Nick Anderson\nPorch Light Latin Kitchen, Chef/Owner Andre Gomez\nIn addition, guests will have the opportunity to enjoy cheeses from French Cheeses of Europe as well as choose beverages from vendors such as Premiere Beverages, Ketel One, Goose Island Beer Company, Stella Artois and Michelob Ultra along with wine, champagne, tequila, and frozen drinks.\nMUSIC & MORE\n6 - 8:30 p.m. Sat., July 21, $29 - $99, “Serving It Up” Charity Gala at Twelve Atlantic Station & Timeless World Tour 2018: The tournament kicks off with a gala event which benefits The Giving Kitchen and the Georgia Tennis Foundation. Tickets range from $29 (reserved seating) to $99 (premium seating). Following the gala from 8:30 - 10 p.m. is the Timeless World Tour 2018 concert by Home Free, the world’s first all-vocal country band. Premium ticket holders will have access to a meet and greet with the band before the show.\nOther performances on the music stage are as follows. Concerts begin when gates open for night sessions (6 or 6:30 p.m. depending on the day) except for the Bryan Brothers who will perform a 30-minute concert between the 7 p.m. and 9 p.m. matches on Wednesday, July 25.\nSun., July 22: MKC Jazz Trio\nMon., July 23: MKC Jazz Trio\nTues., July 24: Trey Broussard Duo\nWed., July 25: The Bryan Brothers\nThurs.,July 26: Trey Broussard Duo\nFri., July 27 - Sun., July 29: DJ Yvonne Monet ( Sunday at 3 p.m.)\nJUST FOR KIDS\n9 a.m. - 7 p.m., Sat., July 21. Free. Next Generation Kids Day: Kids of all ages can participate in free events including on and off court experiences at the Stadium Court, activities, player appearances, face painting, balloon artists and more from 9 - 10:50 am. From 11 a.m. - 7 p.m. each day of the BB&T Atlanta Open (12 - 5 p.m. on Sunday) kids can visit The Family Zone in Atlantic Station’s Central Park for free activities such as on site “mini” courts with tips from local tennis professionals and giveaways.\nDuring Kids Weekend (Sat. and Sun.) kids age 17 and under receive a free ticket to qualifying matches with the purchase of an adult ticket.\nSHOPPING\nBB&T Atlanta Open attendees can show their ticket stub at multiple retailers in Atlantic Station for discounts and savings. Signs located throughout the property will share participating retailers and deals happening all week.\nClick here for a full schedule of tournament events.","url":"https://www.ajc.com/blog/talk-town/atlanta-open-offers-more-than-just-tennis/bnE8eXkyFnjcDVBjaLJF1L/"}
