{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 21:44:31","date_modify":"2018-10-30 21:44:31","date_publish":"2016-12-19 00:00:00","description":null,"filename":"data/vaneerConsumption/BBVAsCEOdetailsimpactoffintechonincumbents.json","image_url":"https://amp.businessinsider.com/images/585804caa1a45e8b3f8b5c01-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bbvas-ceo-details-impact-of-fintech-on-incumbents-2016-12_1540935871.html","title":"BBVA's CEO details impact of fintech on incumbents","title_page":"    BBVA's CEO details impact of fintech on incumbents - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Fintech Briefing\" subscribers. To learn more and subscribe, please click here.\nCarlos Torres Vila, CEO of Spanish banking giant BBVA, shared his insights on fintech's impact on business strategies at incumbent banks, including BBVA, at a conference on Thursday.\nVila outlined several key ways that the rise of tech-savvy rivals has caused incumbents to adapt:\nAlthough attracting tech talent is a challenge for incumbents, the bigger problem comes after the talent is onboarded. This is because young tech developers find the staid nature of most incumbents' business environments jarring. In November, HSBC admitted it had to move its digital team out of its headquarters in corporate Canary Wharf to a separate building in London's trendy Southwark due to incompatible work ethics.\nFor many incumbents, upgrading legacy infrastructure might seem like the most pressing priority, but combating culture clash is arguably a more fundamental problem. Banks should address this issue by getting new innovation units and their core business working closely together, rather than segregating them.\nFintech regulations in the U.S. have been extremely restrictive thus far, but those in Europe have proven successful and allowed the region to become a hub of financial technology innovation. The U.S. would be wise to examine the policies in place across the pond and consider how to implement similar ones within its own borders.\nThe fintech industry is booming, with VC-backed fintech investment growing 106% to reach £10 billion ($13.8 billion) in 2015. But the new business models fintechs are bringing to market also need to be regulated, and the old models aren't sufficient. The approach regulators take will have a significant impact on how big fintech gets and how fast it gets there.\nSarah Kocianski, senior research analyst for BI Intelligence, Business Insider's premium research service, has compiled a detailed report on fintech regulation that explains how regulators in Europe are successfully growing fintech innovation and how it's becoming a model for regulators around the world.\nHere are some of the key takeaways from the report:\nThe financial technology sector is booming, and Europe is a leading region for growth. VC-backed fintech companies in Europe raised £1 billion ($1.5 billion) in funding across 125 deals in 2015.\nWith this boom in funding comes a need to regulate the nascent industry. There are a variety of approaches — active, passive, and restrictive — that regulators can take. The EU and the UK, in particular, have taken an active approach, in order to encourage growth.\nThe regulation that will have the most impact on the European fintech market is the Second Directive on Payments Services, known as PSD2. It will force banks to open up their systems to fintechs. This will allow fintechs to act as intermediaries between banks and their customers.\nThe UK regulator is actively promoting its approach to regulation as a model for other countries to follow. Some of its innovations are already being copied by other regulators around the world.\nIn full, the report:\nExamines the different approaches to fintech that regulators can take\nExplains the key EU laws that will affect the European financial services industry in the next two years and beyond\nExplores the potential impact of new regulations\nDetails the workings of the initiative central to the UK regulator's approach to fintech\nHighlights what can be achieved when regulators, governments, and fintech companies work together\nTo get your copy of this invaluable guide, choose one of these options:\nSubscribe to an ALL-ACCESS Membership with BI Intelligence and gain immediate access to this report AND over 100 other expertly researched deep-dive reports, subscriptions to all of our daily newsletters, and much more. >> START A MEMBERSHIP Purchase the report and download it immediately from our research store. >> BUY THE REPORT\nThe choice is yours. But however you decide to acquire this report, you've given yourself a powerful advantage in your understanding of fintech regulation.","url":"https://www.businessinsider.com/bbvas-ceo-details-impact-of-fintech-on-incumbents-2016-12"}
