{"authors":["Associated Press"],"date_download":"2018-10-23 03:22:06","date_modify":"2018-10-23 03:22:06","date_publish":"2017-03-16 14:14:59","description":"Good morning! Here's a look at how AP's general news coverage is shaping up today. Some plans are subject to change; see the 2 p.m. News Digest for updates....","filename":"data/vaneerConsumption/BCAPNewsCoverageAdvisory1015ADVISORY.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320430_BC-AP-News-Coverage-Advisory-10-15-ADVISORY_1540264926.html","title":"BC-AP News Coverage Advisory 10:15,ADVISORY","title_page":"BC-AP News Coverage Advisory 10:15,ADVISORY | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Good morning! Here's a look at how AP's general news coverage is shaping up today. Some plans are subject to change; see the 2 p.m. News Digest for updates. You can find our contact info at the bottom of this advisory. All times EDT.\n-------------\nHIGHLIGHTING:\n-------------\nAmong today's coverage highlights as we see them at 10:15 a.m. EDT:\n-- TRUMP TRAVEL BAN-LAWSUITS (sent; developing)\n-- TRUMP-BUDGET (sent; developing)\n-- BUDGET-IMMIGRATION (upcoming)\n-- BUDGET-AIR TRAFFIC CONTROL (sent)\n-- TRUMP-WORDS MATTER-ANALYSIS (upcoming)\n-- TRUMP-IRISH (upcoming)\n-- TRAVEL BAN-A REFUGEE'S JOURNEY (sent; may develop)\n-- NETHERLANDS-ELECTIONS (sent; developing)\n-- FAITH HEALING DEATHS (upcoming)\n-- THEATER-J.J. ABRAMS (upcoming)\n-- BOOK CRITIC AWARDS (upcoming)\n-------------\nWHAT WE'RE TALKING ABOUT:\n-------------\n-- YAHOO-SECURITY BREACH-EMAIL TIPS (upcoming)\n-- JOSE FERNANDEZ KILLED (sent; developing)\n-- MENINGITIS OUTBREAK (sent; developing)\n-- 3-PERSON BABY (sent)\n-- THEATER-TRUDEAU (sent)\n-------------\nHere are details of those stories, plus others we have in the works for today (all times EDT):\n-------------\nWASHINGTON/POLITICS\n-------------\nTRUMP TRAVEL BAN-LAWSUITS - President Donald Trump's revised travel ban has suffered another federal court setback after a judge in Maryland rejected a revised measure that bans travel targeting six predominantly Muslim countries. SENT: 1100 words, photos, videos. UPCOMING: Developing.\nTRUMP-BUDGET - Trump unveils a $1.15 trillion budget that slashes many domestic programs to finance a significant increase in the military and make a down payment on a U.S.-Mexico border wall. SENT: 990 words. UPCOMING: Developing throughout the day, 900 words by 4 p.m., photos. With TRUMP BUDGET-WINNERS AND LOSERS (sent) and other stories below.\nBUDGET-AIR TRAFFIC CONTROL - Trump would privatize the nation's air traffic control operations. SENT: 520 words, photo.\nBUDGET-IMMIGRATION - Trump's proposed budget would put money behind his core campaign promise to stop illegal immigration, boosting funding for Border Patrol and immigration courts while having U.S. taxpayers make a generous down payment on the border wall he said Mexico would pay for. UPCOMING: 700 words by 4 p.m., photo.\nTRUMP-WORDS MATTER-ANALYSIS - Trump is learning a harsh lesson: in the White House, words do matter. Judges are using his administration's words in rulings against his travel ban. UPCOMING: 800 words by 3 p.m., photo.\nCONGRESS-HEALTH OVERHAUL - The White House and Republican leaders are talking to rank-and-file lawmakers about revising the GOP health care overhaul, hoping to keep a rebellion by conservatives and moderates from snowballing and imperiling the party's showpiece legislation. SENT: 720 words. UPCOMING: Updates throughout the day, 800 words by 5 p.m., photo.\nTRUMP-IRISH - Taoiseach Enda Kenny makes his traditional St. Patrick's Day visit to White House; he'll talk with Trump about Brexit and Trump's immigration policies. SENT: 800 words. UPCOMING: Updates from 10:30 a.m. meeting, 12:05 p.m. lunch, remarks at Capitol, 700 words by 4 p.m., photos.\nTRUMP-TILLERSON - U.S. Secretary of State Rex Tillerson calls on North Korea to abandon its nuclear and ballistic missile programs, saying the isolated nation has no need to fear the United States. SENT: 780 words, photos.\nVETERANS AFFAIRS - The House votes on a proposal to make it easier for the VA to fire bad employees, part of a renewed Republican effort to fix what they see as mismanagement at the troubled agency. A second bill would protect the gun rights of veterans deemed incapable of handling their finances. UPCOMING: 500 words by 4 p.m., update from evening vote on gun rights bill.\nTRAVEL BAN-A REFUGEE'S JOURNEY - Just a week ago, an Iraqi woman and her family received news that refugees like them have been waiting to hear: They had seats on a flight bound for the United States, with an arrival just before the latest Trump administration travel ban was supposed to take effect. Though a federal judge temporarily blocked the ban - they feel lucky that they are no longer in limbo like so many other refugees waiting to get into America. SENT: 990 words, photos, video. UPCOMING: May develop.\n-------------\nWORLD\n-------------\nNETHERLANDS-ELECTIONS - Dutch political parties are preparing to start what will likely be a long process of coalition talks after Prime Minister Mark Rutte's right-wing VVD easily won national elections, defying polls that suggested a close race with anti-Islam populist Geert Wilders. SENT: 250 words, photos. UPCOMING: Developing\nFRANCE-SCHOOL SHOOTING - Officials say an armed high school student was arrested after a shooting in a school in southern France that left at least two wounded. SENT: 240 words, photos, video. UPCOMING: Developing.\nBRITAIN-BREXIT - A bill authorizing Britain to start its exit from the European Union received royal assent and became law Thursday, empowering Prime Minister Theresa May to begin divorce proceedings from the bloc. SENT: 200 words. UPCOMING: Developing.\nBRITAIN-BREXIT THRILLER - Fact to fiction: Boris Johnson's father pens Brexit thriller. SENT: 800 words, photos.\nFRANCE-IMF-LETTER BOMB - A letter bomb exploded Thursday at the French office of the International Monetary Fund, lightly injuring one person, according to Paris police. SENT: 370 words, photos, video. UPCOMING: Developing.\nTILLERSON-ASIA - U.S. Secretary of State Rex Tillerson calls on North Korea to abandon its nuclear and ballistic missile programs, saying the isolated nation \"need not fear\" the United States. SENT: 770 words, photos.\n-------------\nUS\n-------------\nFAITH HEALING DEATHS - For the first time, a pastor in a fundamentalist Christian sect that rejects medicine has been charged in the death of a child - his own granddaughter - from medical neglect. The novel prosecution is raising hopes among some advocates that it might spur change in a church that has resisted it. UPCOMING: 840 words by 11 a.m., photos.\nMENINGITIS OUTBREAK - Jurors are set to hear closing arguments in the trial of a former pharmacy executive charged in a deadly national meningitis outbreak traced to tainted steroids made by a Massachusetts compounding pharmacy. SENT: 130 words. UPCOMING: Developing.\nJOSE FERNANDEZ KILLED - Florida authorities say Miami Marlins star Jose Fernandez was likely operating a speeding boat when it crashed into a jetty, killing him and two other men. SENT:130 words. UPCOMING: Developing.\nDEPUTY MARSHAL KILLED-ARRESTS - The Georgia Bureau of Investigation says three suspects have been arrested in the November shooting death of a deputy U.S. marshal in southeast Georgia. SENT: 130 words. UPCOMING: Developing.\nOKLAHOMA-SENATOR-INVESTIGATION - Charges could be filed Thursday against an Oklahoma state senator who police say was found with a teenage boy in a motel room in the Oklahoma City suburb of Moore, according to a local prosecutor. SENT: 470 words, photo. UPCOMING: Developing.\nOFFICERS SHOT-DETROIT - A 60-year-old man suspected in the shooting of two Detroit police officers has been arrested and the officers are in stable condition, the police chief said Thursday. SENT: 300 words. UPCOMING: Developing.\n-------------\nHEALTH/SCIENCE\n-------------\n3-PERSON BABY - Britain's Newcastle University says its scientists have received a license to create babies using DNA from three people, the first time such approval has been granted. SENT: 330 words.\n-------------\nTECH\n-------------\nYAHOO-SECURITY BREACH-EMAIL TIPS - Among other things, the federal indictment of Russian hackers on Wednesday revealed that many people still aren't safeguarding their email accounts - and hackers are exploiting that. But there are a few simple ways you can make life more difficult for would-be hackers. By Mae Anderson. UPCOMING: 400 words by noon, photos.\n-------------\nBUSINESS /ECONOMY\n-------------\nNERDWALLET-THE ONE CARD SOLUTION - Some people make a hobby of juggling multiple credit cards to maximize rewards; others just want simplicity. Here's why carrying a single card may be right for you - and how to select that one card to get the most out of it. By Virginia C. McGuire of NerdWallet. UPCOMING: 785 words by 11 a.m., photos.\n-------------\nARTS AND ENTERTAINMENT\n-------------\nTHEATER-TRUDEAU - Canadian Prime Minister Justin Trudeau - along with first daughter Ivanka Trump as a guest - welcomed a new Broadway musical that celebrates Canadian compassion and openness to international travelers following the Sept. 11 attacks. SENT: 800 words, photos.\nTHEATER-J.J. ABRAMS - J.J. Abrams was in production on \"The Force Awakens\" in England when he, somewhat randomly, looking for a night off, bought tickets to a farce playing in the West End, \"The Play That Goes Wrong.\" Abrams was delighted by it and he's now, in his first time producing a play, brought it to Broadway. By Film Writer Jake Coyle. UPCOMING: 700 words by 4 p.m., photos.\nBOOK CRITIC AWARDS - Ann Patchett and Louise Erdrich are among the fiction finalists for the National Book Critics Circle awards, to be announced Thursday night. Margaret Atwood, whose \"The Handmaid's Tale,\" has returned to best-seller lists, will accept a lifetime achievement prize. By AP National Writer Hillel Italie. UPCOMING: 500 words by 10 p.m.\nFILM-BEAUTY AND THE BEAST-DAN STEVENS - \"Beauty and the Beast\" star Dan Stevens talks about creating a Beast worthy of Emma Watson's Belle. UPCOMING: 500 words by 2 p.m., photos.\nMUSIC-DEPECHE MODE - The gloomy British electronic band Depeche Mode is back this spring with the album and a summer U.S. tour and their timing seems impeccable: Their dozen new dark songs seem the perfect soundtrack to a world rocked by Brexit and Donald Trump. UPCOMING: 700 words, photos, video.\n-------------\nHOW TO REACH US\n-------------\nAt the Nerve Center, Alina Heineke can be reached at 800-845-8450 (ext. 1600). For photos, Alyssa Goodman (ext. 1900). For graphics and interactives, Phil Holm (ext. 7636). Expanded AP content can be obtained from http://www.apexchange.com. For access to AP Exchange and other technical issues, contact apcustomersupport@ap.org or call 877-836-9477.","url":"https://www.dailymail.co.uk/wires/ap/article-4320430/BC-AP-News-Coverage-Advisory-10-15-ADVISORY.html"}
