{"authors":["Associated Press"],"date_download":"2018-10-22 23:35:35","date_modify":"2018-10-22 23:35:35","date_publish":"2017-04-26 08:00:33","description":"Here are the AP's latest coverage plans, top stories and promotable content. All times EDT.--------------------------NEW &...","filename":"data/vaneerConsumption/BCAPNewsDigest3am.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/08/wire-463763-1493190037-815_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446544_BC-AP-News-Digest-3-am_1540251335.html","title":"BC-AP News Digest 3 am","title_page":"BC-AP News Digest 3 am | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Here are the AP's latest coverage plans, top stories and promotable content. All times EDT.\n--------------------------\nNEW & DEVELOPING\nProtesters hold letters reading \"NO THAAD\" during a rally to oppose a plan to deploy an advanced U.S. missile defense system called Terminal High-Altitude Area Defense, or THAAD, near U.S. Embassy in Seoul, South Korea, Wednesday, April 26, 2017. In a defiant bit of timing, South Korea announced Wednesday that key parts of a contentious U.S. missile defense system had been installed a day after rival North Korea showed off its military power. (AP Photo/Lee Jin-man)\n--------------------------\nIRAN-US - U.S. Navy fires warning flare at Iran vessel in Persian Gulf. SENT: 140 words.\n----------------\nONLY ON AP\n----------------\nSTOP AND FRISK-BOSTON - The gap between how often minorities are subjected to stops, searches and frisks by police than their white counterparts doesn't appear to be improving in Boston, according to an AP review of recent data. By Philip Marcelo. SENT: 700 words, photos.\n----------------\nTOP STORIES\n----------------\nTRUMP-TAX PLAN - President Donald Trump is proposing tax cuts for individuals and businesses even as Washington struggles with mounting debt and the populist president tries to make good on promises to bring jobs and prosperity to the middle class. By Stephen Ohlemacher and Josh Boak. SENT: 750 words, photos. TOP VIDEO: US Trump Foreign Policy (CR HFR) - Global challenges weigh down Trump's first 100 days. UPCOMING: 900 words after 1:30 p.m. announcement. With TRUMP-NATIONAL MONUMENTS - President seeks review of protected lands. UPCOMING: Announcement at 11:20 a.m.\nKOREAS-TENSION - In a defiant bit of timing, South Korea announces that key parts of a contentious U.S. missile defense system have been installed a day after rival North Korea showed off its military power. By Foster Klug. SENT: 730 words, photos, videos. With KOREAS-TENSION-THE LATEST.\nCONGRESS RDP - Republican lawmakers consider ways to restart the drive to repeal much of Barack Obama's health care law, while bipartisan bargainers edge toward agreement on a separate $1 trillion budget bill that would prevent a partial federal shutdown. By Alan Fram and Andrew Taylor. SENT: 800 words, photos, video. UPCOMING: 900 words after 9 a.m. House GOP meeting. With GRIDLOCK DEJA VU - Different president, same old government shutdown threats.\nSANCTUARY CITIES - For the third time in two months, a federal judge knocks down an immigration order by Trump and uses the U.S. president's own language against him. U.S. District Judge William Orrick cited statements by Trump in a ruling that blocked the president's order to withhold funding from \"sanctuary cities\" that do not cooperate with U.S. immigration officials. By Sudhin Thanawala. SENT: 620 words, photos.\nEGYPT-SPEAKING FOR ISLAM -As Pope Francis heads to Egypt this week, the country he will visit is embroiled in a blistering political feud over who speaks for Islam and how to bring reforms to counter Islamic militancy. At the center of it is Al-Azhar, one of the top institutions of clerics in the Muslim world and considered the bastion of moderate Islam. By Hamza Hendawi, Mariam Fam and Lee Keath. SENT: 1,200 words, photos, videos.\nTRUMP'S LANGUAGE - Campaign promises may have been have been reshaped and some self-imposed deadlines reset. But among the things kept intact in the opening months of the new administration is the unmistakably distinct style of Trump's speech. Those sometimes rambling, aside-filled bursts, full of definitive words and self-congratulatory bravado, have been a source of curiosity for linguists and laymen alike. By National Writer Matt Sedensky. SENT: 1,000 words, photos. TOP VIDEO: - US OH Trump Voters (CR) - Ohio Trump voter \"aggravated\" as 100 days nears. Also see TWITTER-NO TRUMP BOOST below.\n------------------------------------\nWHAT WE'RE TALKING ABOUT\n------------------------------------\nTHAILAND-FACEBOOK KILLINGS - Thai husband kills baby, self on Facebook Live. SENT: 330 words.\nJAPAN-MINISTER RESIGNS - Japanese official resigns over remark about 2011 tsunami. SENT: 430 words, photos.\nPEN-GALA - Sondheim an honoree, Trump a target at annual PEN gala. SENT: 710 words.\nJFK'S DIARY - JFK diary written in post-World War II Europe goes up for auction. SENT: 130 words, photo.\n--------------------\nINTERNATIONAL\n--------------------\nKASHMIR-VIRAL PROTESTS - Viral videos showing alleged abuse by Indian forces is renewing anger among Kashmiris and fueling demands for an end to Indian rule over the disputed territory. UPCOMING: 1,100 words by 3:30 a.m., photos.\nCUBA-VENEZUELA FALLOUT - So far Cuba is weathering the storm of political unrest rocking Venezuela, which is the island's greatest ally and source of hundreds of millions of dollars a year in highly subsidized oil, but Cubans are nervously watching the troubles for signs of a grimmer future. SENT: 980 words, photos, video. With VENEZUELA-POLITICAL-CRISIS - Venezuela threatens to exit OAS as pressure on Maduro mounts.\nSOUTH KOREA-POLITICS - South Korean presidential front-runner Moon Jae-in outrages persecuted sexual minority groups by saying during a television debate that he opposes homosexuality. SENT: 120 words.\nCHINA-AIRCRAFT CARRIER - China launches its first aircraft carrier built entirely on its own, in a demonstration of the growing technical sophistication of its defense industries and determination to safeguard its maritime territorial claims and crucial trade routes. SENT: 840 words, photos.\n---------------------------------------\nHEALTH/SCIENCE/TECHNOLOGY\n---------------------------------------\nTWITTER-NO TRUMP BOOST -Twitter's frequent presence in the news - as the preferred megaphone for Trump - has not translated into profit or meaningful user growth for the company. By Technology Writer Barbara Ortutay. SENT: 500 words, photo. UPCOMING: Developing from 7:45 a.m. earnings release.\nNET NEUTRALITY-BRACING FOR A FIGHT - Internet companies are readying for a showdown with a Republican-controlled government over threats to net neutrality, a key issue for them and their users. SENT: 700 words, photo.\nCHINA-DEER REVIVAL - The growth of a herd of milu deer - once vanished from China - marks a rare conservation success story in a country suffering from pollution and other environmental challenges. By Louise Watt. SENT: 660 words, photos.\n--------------------------------\nWASHINGTON & POLITICS\n--------------------------------\nTRUMP 100-FAMILY - Not since John F. Kennedy appointed his brother to be attorney general and his brother-in-law to head the Peace Corps has a president leaned as heavily on his family as has Trump. SENT: 970 words, photos. With TRUMP 100-FAMILY-HISTORY - Plenty of presidencies have been family affairs.\n------------\nNATIONAL\n------------\nMISSING STUDENT-TENNESSEE - A 15-year-old Tennessee girl who authorities say was kidnapped by her teacher had endured months of abuse at the hands of her mother, according to court documents, making her particularly vulnerable to an adult predator. SENT: 850 words, photo.\nPOLICE BARRACKS AMBUSH - Jury expected to begin weighing sentence for gunman who targeted Pennsylvania State troopers, killing one. SENT: 130 words, photo. UPCOMING: Trial resumes at 9 a.m.\n----------\nSPORTS\n----------\nNASCAR-AFTER EARNHARDT - Now that Dale Earnhardt Jr. plans to retire, NASCAR has its work cut out in developing new stars. By Auto Racing Writer Jenna Fryer. SENT: 950 words, photos.\nDRAFT-THE NEXT WATT - Fairly or not, T.J. Watt will draw comparisons to his big brother J.J., a star pass rusher for the Houston Texans, when he gets to the pros. By Sports Writer Genaro C. Armas. SENT: 750 words, photos.\nROCKETS ADVANCE - James Harden and his supporting cast help the Houston Rockets overcome a 47-point game by Russell Westbrook to get a 105-99 victory over the Oklahoma City Thunder and advance to the Western Conference semifinals. By Sports Writer Kristie Rieken. SENT: 700 words, photos.\n------------------------\nHOW TO REACH US\n------------------------\nAt the Nerve Center, Jerome Minerva can be reached at 800-845-8450 (ext. 1600). For photos, Toru Takahashi (ext. 1900). For graphics and interactives, Dien Magno (ext. 7636). Expanded AP content can be obtained from http://www.apexchange.com. For access to AP Exchange and other technical issues, contact apcustomersupport@ap.org or call 877-836-9477.\nIvanka Trump, daughter and adviser of U.S. President Donald Trump, touches a stellee when visiting the Memorial to the Murdered Jews of Europe after she participated in the W20 Summit in Berlin Tuesday, April 25, 2017. (AP Photo/Michael Sohn, pool)\nDale Earnhardt Jr. pauses as he speaks during a news conference at Hendrick Motorsports in Concord, N.C., Tuesday, April 25, 2017. Dale Earnhardt Jr. abruptly announced his retirement at the end of the season Tuesday, April 25, 2017, a decision that will cost NASCAR its most popular driver as the series scrambles to rebuild its fan base. (AP Photo/Chuck Burton)\nCity Attorney Dennis Herrera makes his way to a podium to talk about a federal judge's order blocking any attempt by the Trump administration to withhold money from \"sanctuary cities\" during a news conference at City Hall Tuesday, April 25, 2017, in San Francisco. A federal judge on Tuesday said the president has no authority to attach new conditions to federal spending. U.S. District Judge William Orrick issued the preliminary injunction in two lawsuits, one brought by the city of San Francisco, the other by Santa Clara County, against an executive order targeting communities that protect immigrants from deportation. (AP Photo/Eric Risberg)\nIn this photo taken Tuesday, April 25, 2017, Muslims perform devotional dance known as \"zikr\" during a religious festival, or Moulid, which commemorates of the birth of Muslim Prophet Muhammad's granddaughter Sayyeda Zeinab, outside the mosque and shrine named for her, in Cairo, Egypt. (AP Photo/Amr Nabil)","url":"https://www.dailymail.co.uk/wires/ap/article-4446544/BC-AP-News-Digest-3-am.html"}
