{"authors":["Associated Press"],"date_download":"2018-10-22 22:59:08","date_modify":"2018-10-22 22:59:08","date_publish":"2017-03-16 05:05:00","description":"The AP Service Guide is a summary of how the AP news report is organized. This guide will be repeated daily so it is always available to you. Please direct...","filename":"data/vaneerConsumption/BCAPServiceGuide.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318896_BC-AP-Service-Guide_1540249148.html","title":"BC-AP Service Guide","title_page":"BC-AP Service Guide | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The AP Service Guide is a summary of how the AP news report is organized. This guide will be repeated daily so it is always available to you. Please direct questions or suggestions on the guide to your AP chief of bureau.\nDIGESTS:\nAP digests are tables of contents for the most important parts of the news report. To help editors size up the report, the digests list what AP editors deem the top stories and multimedia. In addition to the main news stories, digests highlight features that are especially compelling or offbeat. Digests do not list every story, photo, graphic or interactive the AP offers. All content listed on digests can be obtained from http://www.apexchange.com\nBC-AP News Digest, the main spot news digest, lists the most important items sent by our main general news, technology, entertainment, arts, sports, lifestyles, photos, interactives, graphics, and video desks.\nThe top stories are listed on the digest with headlines and keywords , plus byline, photo, graphics, interactives and video information. More information on interactives are on the AP Interactive Digest and the AP Graphics Digest.\nDigests also list sidebars, glances, chronologies and other layering devices.\nBC-AP News Digest moves seven days a week. The first weekday digest, sent around 3 a.m. ET, starts the PMs news cycle. It is updated around 7 a.m. The first AMs digest moves around 2 p.m. and is updated around 6:30 p.m.\n- BC-News Advisory moves by 6 a.m. on Sundays, focusing on the top developing stories.\nOther digests include:\n- BC-AP Business News Digest (daily except Saturday), BC-AP Business Features Digest (Mon-Fri) and BC-AP Technology Digest(Wed-Fri).\n- BC-AP Sports Digest (daily), BC-AP Sports Features Digest (Wed-Fri), BC-CAR--Auto Package Digest (Wed).\n- BC-AP Newsfeatures Digest, lists takeouts and other comprehensive news feature stories (Mon-Fri).\n- BC-AP Lifestyles Digest: Stories about food, fashion, travel, homes and gardens, parenting, pets and culture (Weekly digest moves Mondays around 12:30 p.m. with updates as warranted)\n- BC-AP Entertainment & Arts Digest: Stories about movies, music, television, theater, books, art, dance, celebrities and pop culture (Mon-Fri around 12:30 p.m. and 7 p.m.)\n- BC-US-SPE-XXXXXXX Digest. Special Edition digests move monthly. They list a package of stories and photos that could be published in special edition or lifestyle sections. The digest keyword will include the name of the package, such as BC-SPE--Back-to-School Digest.\n- BC-AP Interactives Digest, sent to customers by email.\n- BC-AP Graphics Digest, Monday through Friday around 1 and 5 p.m.\nBREAKING NEWS:\nWhen a major event happens, a news alert, with the keyword BC-APNewsAlert, is sent. When an event of transcendent importance happens, the news alert also contains the word FLASH.\nNews alerts succinctly summarize the development, and clearly include the source of the information. A short story will follow quickly and will tagged URGENT at the top. If the event is big enough, the tag will say BULLETIN. These short stories, called APNewsNows, are written in way that can be used for broadcast, newspaper and online services.\nAs more information becomes available, developments are expedited as leads (BC-Keyword, 1st Ld). As soon as possible, a complete story with context will be sent as a writethru (BC-Keyword, 2nd Ld-Writethru).\nSeparate advisories may be sent with information about the AP's coverage plans in all formats and prospects for updating the story.\nIf the breaking story is important enough, it will be added to the next digest.\nAPNEWSNOWS:\nOther stories that can be told in 130 words or less are also sent in APNewsNow style.\n10 THINGS TO KNOW:\nA daily look at late-breaking news, upcoming events and stories that will be talked about. Sent Monday through Friday by about 6:30 a.m.\nEMBARGOED STORIES:\nOccasionally, material may not be published, broadcast or placed online before a certain time. Such stories are labeled with a hold-for-release (\"HFR\") designation in the keyword line and include an editor's note listing what time they may be released. Example: BC-US-MED--Alzheimer's-Weight Loss, HFR.\nPACKAGE ADVISORIES:\nFor especially big stories, a package advisory is sent. Example: BC-Tsunami, Package Advisory. It's a comprehensive list detailing the main story, sidebars, glances, texts, photos, video, graphics and information on accessing interactive presentations online.\nWORLD BRIEFLY: A briefs package of top AP stories runs as BC-World Briefly, Mondays through Saturdays at 6 a.m. It also is sent seven nights a week by about 6 and 9 p.m. and at midnight.\nREGIONAL IDENTIFIERS INDICATE CONTINENT OF ORIGIN:\nAA (Antarctica)\nAF (Africa)\nAS (Asia)\nCB (Caribbean)\nCN (Canada)\nEU (Europe)\nLT (Latin America)\nML (Middle East)\nUN (U.N.)\nUS (United States)\nSTORY TYPE IDENTIFIERS:\nADV (advance for listed date)\nFEA (Lifestyles)\nHFR (Hold for release)\nLOT (U.S. lottery roundups)\nMED (Medical)\nObit (Obituary)\nODD (strange news)\nPeople (celebrity news)\nREL (Religion)\nSCI (Science)\nSPE (Special Edition projects)\nTEC (Technology)\nTravel (Travel)\nWEA (Weather)\nYE (year-end and year-ahead items)\nFOR MORE INFORMATION:\nAP Stylebook Online?s section called Filing Text Stories contains detailed information on how stories are sent.","url":"https://www.dailymail.co.uk/wires/ap/article-4318896/BC-AP-Service-Guide.html"}
