{"authors":["Associated Press"],"date_download":"2018-10-22 23:30:52","date_modify":"2018-10-22 23:30:52","date_publish":"2017-03-16 06:59:15","description":"Here are the AP's latest coverage plans, top stories and promotable content. All times EDT.-------------------------------NEW &...","filename":"data/vaneerConsumption/BCAPNewsDigest6pm.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/22/wire-230949-1489701887-422_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319056_BC-AP-News-Digest-3-am_1540251052.html","title":"BC-AP News Digest 6 pm","title_page":"BC-AP News Digest 6 pm | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Here are the AP's latest coverage plans, top stories and promotable content. All times EDT.\n-------------------------------\nNEW & DEVELOPING\nA Federal Police soldier runs for cover during fighting against Islamic State militants in western Mosul, Iraq, Thursday, March 16, 2017. (AP Photo/Felipe Dana)\n--------------------------------\nADDS: USA GYMNASTICS-PRESIDENT RESIGNS;DEATH PENALTY-FLORIDA; HOVERBOARD FIRE-DEATHS; IRELAND-SLAVES-FACT CHECK; NCAA-KANSAS-INVESTIGATION; ITALY-ETNA ERUPTION; TARGET-VICTORIA BECKHAM;; FILM-BEAUTY AND THE BEAST-DAN STEVENS\n---------------\nONLY ON AP\n---------------\nTRAVEL BAN-A REFUGEE'S JOURNEY - Just a week ago, an Iraqi woman and her family learned that they had seats on a flight bound for the United States, with an arrival just before the latest Trump administration travel ban was supposed to take effect. Although a federal judge temporarily blocked the ban, they feel lucky that they are no longer in limbo like so many other refugees waiting to get into America. By Julie Watson, Malak Harb and Allen Breed. SENT: 990 words, photos, video.\nJUNGLE WARFARE - U.S. Army soldiers are training at the first jungle school the branch of the military has established in decades, one that comes as the American military renews its focus on Asia and the Pacific after years of war in the Middle East. By Audrey McAvoy. SENT: 770 words, photos.\n----------------\nTOP STORIES\n----------------\nTRUMP-BUDGET - President Donald Trump's new $1.15 trillion budget would reshape America's government with the broad, conservative strokes he promised as a candidate, ordering generous increases for the military, slashing domestic programs and riling both fellow Republicans and Democrats by going after favored programs. By Andrew Taylor. SENT: 970 words, photos, video. With BUDGET-WINNERS AND LOSERS; BUDGET-HIGHLIGHTS-GLANCE; AP EXPLAINS-BUDGET PROCESS; BUDGET-IMMIGRATION, BUDGET-NIH, BUDGET-EPA, BUDGET-ESSENTIAL AIR SERVICE, BUDGET-AIR TRAFFIC CONTROL.\nTRUMP-WORDS MATTER-ANALYSIS - President Donald Trump is learning a harsh lesson: In the White House, words do matter. Judges are using his administration's words in rulings against his travel ban. By White House Correspondent Julie Pace. SENT: 810 words, photos. With TRUMP-FACT CHECK - How strong is the U.S.-Mexico border? SENT: 1,140 words, photos.\nTRUMP-TRAVEL BAN-LAWSUITS - Federal judges in Hawaii and Maryland block President Donald Trump's revised travel ban targeting mostly Muslim nations. A look at how the two rulings differ and what the next steps might be for an administration that keeps losing in the court system. By Gene Johnson and Sudhin Thanawala. SENT: 1,110 words, photos, video. UPCOMING: 700 words with new approach by 6:30 p.m., photos, video. With TRUMP TRAVEL BAN-LAWSUITS-THE LATEST; TRUMP-TRAVEL BAN-EXCERPTS - A look at key points of the travel ban rulings in Hawaii and Maryland (upcoming by 6:30 p.m.).\nNETHERLANDS ELECTION - If Geert Wilders is looking for people to blame for his disappointing showing in Dutch elections, he could point to a couple of unlikely-sounding candidates: Turkish President Recep Tayyip Erdogan and U.S. President Donald Trump. By Mike Corder. SENT: 760 words, photos.\nYAHOO-SECURITY BREACH-MAKING EMAIL SAFE - Among other things, the federal indictment of Russian hackers reveals that many people still aren't safeguarding their email accounts - and hackers are exploiting that. By Technology Writer Mae Anderson. SENT: 690 words, photos.\n-------------------------------------\nWHAT WE'RE TALKING ABOUT\n-------------------------------------\nMCDONALD'S-TRUMP TWEET - McDonald's says it's investigating tweet at Trump. SENT: 130 words, photo.\nIRELAND-SLAVES-FACT CHECK - Hundreds of thousands of Irish people were not transported to the Americas as slaves, despite nearly decade-old claims circulating anew online in the run-up to St. Patrick's Day. SENT: 450 words.\nITALY-ETNA ERUPTION - 10 injured by volcanic explosion on Italy's Mount Etna. SENT: 650 words, photos.\nTARGET-VICTORIA BECKHAM - Target is counting on Victoria Beckham to spice up sales. SENT: 350 words, photos.\nNERDWALLET-THE ONE CARD SOLUTION - The one-card solution can swipe away credit card overload. SENT: 800 words, photo.\n--------------------------------\nWASHINGTON & POLITICS\n--------------------------------\nTRUMP-NATIONAL SECURITY ADVISER - Documenting more than $67,000 in fees and expenses paid to former national security adviser Michael Flynn by Russian companies, a Democratic congressman asks the Trump administration to provide a comprehensive record of Flynn's contacts with foreign governments and interests. SENT: 1,100 words, photo. With TRUMP-RUSSIA - The top two members of the Senate intelligence committee say there is no indication that Trump Tower was \"the subject of surveillance\" by the U.S. government before or after the 2016 election. SENT: 500 words, photo.\nCONGRESS-HEALTH OVERHAUL - Short of votes for their health care bill, Republican congressional leaders turn to President Trump to wrangle support. SENT: 910 words, photos. With TRUMP-HEALTH OVERHAUL - High stakes for Trump on GOP health care bill. SENT: 920 words, photo.\nTILLERSON-ASIA - Secretary of State Rex Tillerson calls on North Korea to abandon its nuclear and ballistic missile programs, saying the isolated nation \"need not fear\" the United States. SENT: 780 words, photos.\nTRUMP-IRISH PRIME MINISTER - Irish Prime Minister Enda Kenny urges President Trump to help Irish people living in the U.S. illegally, saying they just want to \"make America great.\" SENT: 520 words, photos, video.\n--------------------\nNATIONAL\n--------------------\nDEATH PENALTY-FLORIDA -Florida's governor reassigned a case involving the killing of a police officer Thursday, hours after an Orlando prosecutor said her office will no longer seek the death penalty in cases. SENT: 650 words, photos. UPCOMING: Developing. With DEATH PENALTY-FLORIDA-THE LATEST.\nHOVERBOARD FIRE-DEATHS - A second child has died from a fire in Pennsylvania that fire officials blamed on an exploding hoverboard, a coroner says. The deaths - if definitively linked to the two-wheeled, battery-powered scooter - would be the first in the United States caused by a hoverboard fire. SENT: 300 words.\nOIL PIPELINE - North Dakota officials appear poised to go after the U.S. government - and thus U.S. taxpayers - to recoup more than $38 million in state expenses related to months of protests against the Dakota Access pipeline. SENT: 750 words, photo.\nINFANT-LAKE - Two people are dead in what a coroner calls connected cases involving a fatal house fire near St. Louis, followed shortly by a baby found alive in a lake. SENT: 350 words, photos.\nOKLAHOMA SENATOR-INVESTIGATION - Oklahoma prosecutors file child prostitution charges against a Republican state senator after police found him in a hotel room with a 17-year-old boy. SENT: 440 words, photo.\n--------------------\nINTERNATIONAL\n--------------------\nFRANCE-SCHOOL SHOOTING - A 16-year-old student who had problematic relations with his peers opens fire at a high school in southern France, wounding two other students and the principal trying to intervene. SENT: 630 words, photos.\nTRUMP-REFUGEE CUTS - An AP analysis suggests that the people hurt most by Trump's planned deep cuts in refugee visas are from not any of the six Muslim countries listed in his travel ban, but Myanmar. SENT: 2,090 words, photos, video, interactive. A 1,130-word abridged version also moved.\n------------\nBUSINESS\n------------\nGLOBAL ECONOMY - President Donald Trump has vowed to get tough on trade partners like China, Mexico and Germany. Now his Treasury chief, Steven Mnuchin, will get his first opportunity to confront them all in one room. By Business Writers David McHugh and Martin Crutsinger. SENT: 790 words, photos. With BRITAIN-ECONOMY - UK central bank seems increasingly concerned about inflation (sent).\n-------------------------------\nHEALTH/SCIENCE/TECHNOLOGY\n-------------------------------\nBRAIN INJURIES-ELDERLY FALLS - Elderly people are suffering brain injuries from falls at what appear to be unprecedented rates, according to a new government report, possibly the result of more older people living at home. By Medical Writer Mike Stobbe. SENT: 400 words.\n----------\nSPORTS\n----------\nNCAA-KANSAS-INVESTIGATION - One day before top-seeded Kansas opens NCAA Tournament play, an affidavit says star Josh Jackson threatened to \"beat\" a women's basketball player during a confrontation in December. SENT: 450 words, photos. UPCOMING: 650 words, photos developing from late afternoon interviews with the team.\nUSA GYMNASTICS-PRESIDENT RESIGNS - Steve Penny resigns as president of USA Gymnastics following intensified pressure on the organization for its handling of sex abuse cases. SENT: 840 words, photos.\n-------------------------\nHOW TO REACH US\n-------------------------\nAt the Nerve Center, Alexandra Olson can be reached at 800-845-8450 (ext. 1600). For photos, ext. 1900. For graphics and interactives, ext. 7636. Expanded AP content can be obtained from http://www.apexchange.com. For access to AP Exchange and other technical issues, contact apcustomersupport@ap.org or call 877-836-9477.\nFormer French Economy Minister and candidate for the next presidential election Emmanuel Macron, addresses the media during a statement in front of the chancellery after a meeting with German Chancellor Angela Merkel in Berlin, Germany, Thursday, March 16, 2017. (AP Photo/Michael Sohn)\nNew York Stock Exchange Executive Floor Gov. Rudy Mass, center, calls out prices for the Canada Goose IPO on the floor of the New York Stock Exchange, Thursday, March 16, 2017. (AP Photo/Richard Drew)\nRussian President Vladimir Putin, center, receives credentials from Benin's ambassador to Russia Rene Coto Sounon at a ceremony in the Kremlin in Moscow, Russia, Thursday, March 16, 2017. At right is Presidential foreign affairs adviser Yury Ushakov. At right in the back is Russian Foreign Minister Sergey Lavrov. (Maxim Shipenkov/Pool Photo via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-4319056/BC-AP-News-Digest-3-am.html"}
