{"authors":["Associated Press"],"date_download":"2018-10-23 03:16:01","date_modify":"2018-10-23 03:16:01","date_publish":"2017-03-10 12:44:09","description":"ASIA:SKOREA-CONSTITUTION - South Korean politicians want to ensure that the country never again sees a leader like Park Geun-hye, who was booted from office...","filename":"data/vaneerConsumption/BCASAsianNewsDigestAS.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4301178_BC-AS-Asian-News-Digest-AS_1540264561.html","title":"BC-AS--Asian News Digest, AS","title_page":"BC-AS--Asian News Digest, AS | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"ASIA:\nSKOREA-CONSTITUTION - South Korean politicians want to ensure that the country never again sees a leader like Park Geun-hye, who was booted from office over an explosive corruption scandal. But they are far apart on whether doing so would require rewriting the country's 3-decade-old constitution, a treasured symbol of the bloody transition from dictatorship to democracy. By Kim Tong-Hyung. SENT: 950 words, photos.\nCHINA-DEATH PENALTY - China's chief justice is praising courts for severely punishing crimes against state security and violent terrorism. By Louise Watt. SENT: 480 words, photos. With CHINA-FIRE EXTINGUISHERS-PHOTO GALLERY.\nPHILIPPINES-COMMUNIST REBELS - The Philippine government and communist rebels say they have agreed to resume peace talks and restore separate cease-fires after an escalation of deadly clashes. SENT: 130 words. UPCOMING: 350 words by 0600 GMT.\n___\nHOW TO REACH US:\nThe editor in charge at the AP Asia-Pacific Desk in Bangkok is Hrvoje Hranjski. Questions and story requests are welcome. The news desk can be reached at (66) 2632-6911 or by email at asia@ap.org. The Asia Photo Desk can be reached at (81-3) 6215-8941. Between 1600 GMT and 0000 GMT, please refer queries to the North America Desk in New York at (1) 212-621-1650.\nExpanded AP content can be obtained from http://www.apexchange.com. For access to AP Exchange and other technical issues, contact apcustomersupport@ap.org or call (1) 877-836-9477.","url":"https://www.dailymail.co.uk/wires/ap/article-4301178/BC-AS-Asian-News-Digest-AS.html"}
