{"authors":["Associated Press"],"date_download":"2018-10-23 00:23:28","date_modify":"2018-10-23 00:23:28","date_publish":"2017-03-10 06:44:08","description":"South Korea's Constitutional Court removed President Park Geun-hye from office Friday over a corruption scandal that has roiled the country for months....","filename":"data/vaneerConsumption/BCSKoreaPoliticsADVISORY.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300120_BC-SKorea-Politics-ADVISORY_1540254208.html","title":"BC-SKorea-Politics,ADVISORY","title_page":"BC-SKorea-Politics,ADVISORY | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"South Korea's Constitutional Court removed President Park Geun-hye from office Friday over a corruption scandal that has roiled the country for months. Here's a rundown of the AP's coverage:\n___\nSKOREA-POLITICS\nSEOUL, South Korea - In a historic, unanimous ruling Friday, South Korea's Constitutional Court formally removed impeached President Park Geun-hye from office over a corruption scandal that has plunged the country into political turmoil and worsened an already-serious national divide. It capped a stunning fall for Park, the country's first female leader who rode a wave of lingering conservative nostalgia for her late dictator father to victory in 2012, only to see her presidency crumble as millions of furious protesters filled the nation's streets. By Hyung-Jin Kim and Foster Klug. SENT: 1,300 words, photos, video.\n___\nSKOREA-POLITICS-ANALYSIS\nThis was not supposed to happen in South Korea. It was too divided, too corrupt, too much in thrall to the rich and powerful who had always had their way. Four months ago, the idea that the most powerful person in the country, along with the cream of South Korean business and politics, would be knocked from command after sustained, massive, peaceful protests would have been ludicrous. Now a massive upending of the status quo has so shaken the country's foundations that it has left people here a bit stunned, and wondering if life has truly changed. By Foster Klug. SENT: 900 words, photos.\n___\nSKOREA-POLITICS-CRIMINAL DEFENDANTS\nSEOUL, South Korea - Formally removed from office by a historic Constitutional Court ruling Friday, Park Geun-hye has lost her presidential immunity from prosecution over a corruption scandal that has sent dozens of high-profile figures to face criminal trials. They include Park's friend of 40 years, Choi Soon-sil, Samsung's de-facto leader Lee Jae-yong, top presidential advisers, two former culture ministers and a music video director. By Hyung-Jin Kim. SENT: 690 words, photos.\n___\nSKOREA-POLITICS-SCRAMBLE FOR BLUE HOUSE\nSEOUL, South Korea - With South Korea's Constitutional Court stripping President Park Geun-hye of power, the country slips into a political whirlwind building up to a presidential election likely in early May. Here's a look at possible scenarios in the frantic weeks ahead and some of the potential presidential contenders vying for the presidential Blue House: By Kim Tong-Hyung. SENT: 870 words, photos.\n___\nSKOREA-POLITICS-HAIR ROLLERS\nHair rollers on a South Korean judge's head have become a symbol of dedication and a sign of hard-working women on the day South Korea legally dismissed its leader. SENT: 370 words, photos.\n___\nSKOREA-POLITICS-PARK'S PRIVILEGES\nSEOUL, South Korea - A South Korean court ruling that formally ended Park Geun-hye's presidency Friday has also stripped her of all the privileges she could have enjoyed as a former head of state, including the right to be buried alongside her late dictator father at a national cemetery. By Hyung-Jin Kim. SENT: 250 words, photos.\n___\nSKOREA-POLITICS-TIMELINE\nSEOUL, South Korea - The ouster of South Korean President Park Geun-hye by the country's Constitutional Court on Friday ends a power struggle that consumed the nation for months. Her removal from office over a corruption scandal has the potential to reshape a country whose politics have long been marred by fraud and ideological bickering. The changes may begin with a presidential by-election expected in early May. SENT: 650 words, photos.\n___\nSKOREA-PARK GEUN-HYE-TIMELINE\nSEOUL, South Korea - Key moments in the life of Park Geun-hye, who was ousted as South Korean president by the country's Constitutional Court on Friday: - Feb. 2, 1952: Park is born as the eldest child of Park Chung-hee and Yuk Young-soo.\nAP Photos TKMY504-1219121110, TKMY503-1219122348.\n___\nAP EXPLAINS-SKOREA-POLITICS: What's behind the ouster of South Korea's leader. SENT: 680 words, photos.\n___\nWe continue to monitor developments in all formats, including ongoing protests, any statement from Park and any movement from the presidential Blue House.\n___\nVIDEO:\nVideo pieces out now include:\n-Court reading out decision\n-Reaction from political parties\n-Several edits of anti- and pro-Park rallies\n-Reaction from Japanese foreign minister\n-Comments from Prime Minister/acting leader.\n-Stills of South Korean judge arriving with hair curlers.\nLive coverage:\n-We continue to offer live coverage from an anti-Park rally in Seoul.\n-We have a camera at the presidential Blue House awaiting Park's departure/possible live.\n___\nThe AP","url":"https://www.dailymail.co.uk/wires/ap/article-4300120/BC-SKorea-Politics-ADVISORY.html"}
