{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:07:31","date_modify":"2018-10-30 21:07:31","date_publish":"2016-05-17 22:22:43","description":"TEL AVIV – The Lebanese capital of Beirut will host a symposium Friday for the academic and cultural boycott of Israel.","filename":"data/vaneerConsumption/BDSConfabInLebanonToLaunchBoycottIsraelApp.json","image_url":"https://media.breitbart.com/media/2016/02/bdsgirls1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_05_17__1540933651.html","title":"BDS Confab In Lebanon To Launch Boycott Israel App","title_page":"BDS Confab In Lebanon To Launch Boycott Israel App","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – A symposium on the academic and cultural boycott of Israel will take place on Friday in the Lebanese capital of Beirut, the Jerusalem Post reported.\nThe symposium, organized by the Campaign to Boycott Supporters of Israel in Lebanon, will be attended by Lebanese celebrities and artists, including movie star Tarek Tamim and actor/singer Jahida Wehbe.\nA new smartphone app for boycotting Israeli products will be unveiled during the symposium.\n“As an artist, I can only see myself as a part of the resistance to the occupation,” Tamim said in a video posted on the campaign’s Facebook page.\nNidal Ashkar, a well-know Lebanese actress, stated: “I regard the art an obligation and resistance against Israel,” and finished by urging Lebanese citizens to “boycott Israel and resist it.”\nMeanwhile, Pierre Abi Saab, deputy-editor of the pro-Hezbollah Lebanese daily Al-Akhbar, said: “The resistance to Israel is not only military – it is first and foremost cultural and ideological, because after you can defeat the enemy several times and put an end to its military supremacy, it will try to enter from other places.”\nMajor local brands, including pro-Hezbollah newspapers Al-Akhbar and Al-Safir, are sponsoring the BDS confab.","url":"https://www.breitbart.com/middle-east/2016/05/17/bds-confab-lebanon-launch-boycott-israel-app/"}
