{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 21:58:28","date_modify":"2018-10-30 21:58:28","date_publish":"2015-11-26 14:05:06","description":"Leaders of the Boycott, Divestment​,​ and Sanctions (BDS) movement at the University of Denver's built their website using Wix.","filename":"data/vaneerConsumption/BDSLeadersUseIsraeliFirmWixToBuildTheirWebsites.json","image_url":"https://media.breitbart.com/media/2015/11/BDS-WIX.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2015_11_26__1540936708.html","title":"BDS Leaders Use Israeli Firm Wix To Build Their Websites","title_page":"Fail: BDS Leaders Use Israeli Firm Wix To Build Their Websites","title_rss":"NULL","source_domain":"breitbart.com","text":"JERUSA​LEM – Leaders of the Boycott, Divestment​ and Sanctions (BDS) movement at the University of Denver’s branch of Students for Justice in Palestine built their website using Wix, an Israeli company that provides a free platform for web development.\nWhen Israel website Israellycool.com noticed the ironic BDS fail, the website was taken down and replaced with an error message.\nIn a jab at the students behind the BDS misadventure, Israellycool wrote, “Oh BDSHole from Students for Justice in Palestine at the University of Denver, who was responsible for building their website – you had ONE JOB.”\nAs Israellycool points out, it is not the first time BDS supporters used Wix to convey their anti-Israel messages to the world. The Cornell University branch of Students for Justice in Palestine also use Wix as did the Palestinian Holocaust Museum. The latter has since taken down ​its website,​ but the discerning students at Cornell University have kept theirs despite being ​called out by Israellycool.CodePink, an organization that calls for an end to Israeli​ “​apartheid,​”​ also used Wix to build their fundraising website. Similarly, Max Blumenthal, a notorious hater of Israel​,​ supporter of Hamas​, and​ proponent of BDS, turned to Wix’s magic to make his own personal website.\nPerhaps most ironic of all, anti-Israel hackers – ostensibly ​internet mavens themselves – decided to use the Israeli site-developer specialists when ​they built a fake Hebrew University website back in May.","url":"https://www.breitbart.com/middle-east/2015/11/26/fail-denvers-bds-leaders-use-israeli-firm-wix-build-website/"}
