{"authors":["Jordan Gass-Poore For Dailymail.Com"],"date_download":"2018-10-22 23:13:55","date_modify":"2018-10-22 23:13:55","date_publish":"2017-03-16 06:09:51","description":"War Machine allegedly beat his ex-girlfriend Christy Mack (pictured) so brutally that a doctor told a Las Vegas Jury on March 8 that her injuries were similar to those seen in car crash victims.","filename":"data/vaneerConsumption/BeatingsufferedbyWarMachinesexcomparedtocarcrash.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/06/3E522C3000000578-0-image-a-50_1489644228323.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318832_War-Machine-s-ex-compares-injuries-car-wreck_1540250035.html","title":"Beating suffered by War Machine's ex compared to car crash","title_page":"Beating suffered by War Machine's ex compared to car crash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A former mixed martial arts fighter allegedly beat his porn star ex-girlfriend so brutally that a doctor likened her injuries to those seen in car crash victims.\nWar Machine, who legally changed his name from Jonathan Paul Koppenhaver, was on trial earlier this month for an alleged attack in August 2014 that left then-girlfriend Christine Mackinday hospitalized.\nMackinday, known by her stage name Christy Mack, suffered a broken nose, lost and broken teeth, a damaged liver, broken bones in her face and a fractured rib.\nJames Walker, the doctor who treated Mackinday in the emergency room, told a Las Vegas jury that her liver was severely ruptured from a kick to her side, the New York Post reports.\n'This is the first time in my career I’ve seen [the injury] not in a car accident - where there’s tremendous force involved,' said Walker during the trial on March 8. 'This is the first time I’ve seen one out of that context.'\nChristine Mackinday, known by her stage name Christy Mack, gives her testimony during her ex-boyfriend's sexual assault and attempted murder trial\nJames Walker, the doctor who treated Mackinday in the emergency room, told a Las Vegas jury earlier this month that her liver was severely ruptured from a kick to her side\nWar Machine is on trial for 34 felony charges against him, including kidnapping, attempted murder and multiple counts of sexual assault for the August 2014 attack on Mackinday and Corey Thomas, who was in her home at the time.\nWar Machine pleaded not guilty to all counts.\nIf found guilty, the 35-year-old could get life in prison without parole.\nMackinday, now 25, described to the courts how the violence in their relationship had escalated and sometimes ended in her being choked into unconsciousness.\nThe former adult actress said she became too scared to report the abuse because War Machine threatened to get his former Hells Angels friends to hurt her and her family.\n'He said he would send his Navy SEAL friends or Hells Angel's after me or my family,' Mackinday said, adding that she heard him on the phone giving them her and her mom's addresses.\nProsecutors said the incident was the culmination of violent abuse over 15 months that nearly killed Mackinday and Thomas.\nMack (left) met War Machine (right) while they were performers on an adult film shoot\nDuring Mackinday's testimony, she added that the former MMA fighter repeatedly kicked one of her legs, leaving it horrifically bruised.\n'There's no way I could physically overpower him,' Mackinday testified, 'I was limping for probably two weeks afterwards.'\nMackinday said she was forced to undergo cosmetic surgeries to repair damage to her lips, as well as other surgeries to her nose and teeth.\nKoppenhaver was arrested in the Los Angeles suburb of Simi Valley a week after the alleged attack in Las Vegas.\nHe has been in Nevada state custody since that time, serving one-and-a-half to four years in prison after his probation was revoked for a prior conviction in a 2009 attempted battery causing substantial bodily harm case involving a 21-year-old woman.\nKoppenhaver was arrested in the Los Angeles suburb of Simi Valley a week after the alleged attack in Las Vegas\nMackinday and Koppenhaver met as performers on an adult film shoot. Koppenhaver legally changed his name to War Machine during his 19-fight MMA career, and he started a clothing line he called Alpha Male.\nDuring their relationship, she was often spotted cheering ringside at his martial arts bouts, but he soon became jealous of her professional sexual encounters.\nKoppenhaver made his Ultimate Fighting Championship debut in 2007, and he had a 14-5 record as a welterweight. His final fight was in 2013.\nHe was dropped by his fight promoter and his clothing line after Mack's accusations became public.","url":"https://www.dailymail.co.uk/news/article-4318832/War-Machine-s-ex-compares-injuries-car-wreck.html"}
