{"authors":["Tammy Hughes For The Daily Mail"],"date_download":"2018-10-22 20:22:06","date_modify":"2018-10-22 20:22:06","date_publish":"2016-01-28 01:01:34","description":"The tensions between Miss Potter and artist Ernest Aris, who she had commissioned to illustrate a book in 1916, pictured, are explored in a display at the Victoria and Albert Museum, London.","filename":"data/vaneerConsumption/BeatrixPottersdisputewithErnestArisoverhisbolddepictionofhercharacters.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/3070D73400000578-0-image-a-33_1453942867075.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420216_Beatrix-Potter-feud-fellow-artist-Author-s-dispute-illustrator-bold-depiction-characters-book-never-published_1540239726.html","title":"Beatrix Potter's dispute with Ernest Aris over his 'bold' depiction of her characters","title_page":"Beatrix Potter's dispute with Ernest Aris over his 'bold' depiction of her characters | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"after his new book was released\nBeatrix Potter was involved in a creative dispute with an artist because she felt his paintings of her characters were too bold, an exhibition has revealed.\nThe tensions are explored in a display at the Victoria and Albert Museum, called The Tale of Beatrix Potter and Ernest Aris.\nIt describes how in 1916 Miss Potter, then aged 50, was struggling with her eyesight and decided to commission an artist to illustrate a book called The Oakmen, imagined by her niece.\nThis is one of the black and white drawings Bextrix Potter sent to artist Ernest Aris after deciding to commission him to illustrate her book - although she hid her idenitity\nShe sent Mr Aris a set of pencil designs with instructions for colour and composition but concealed both her own identity and the plot of the story.\nInitially, she seemed pleased with his efforts but at some point between receiving the paintings in September 1916 and Christmas 1916 she decided to ditch his work and do the illustrations herself.\nMr Aris, who probably knew he was corresponding with Miss Potter, told her that her proposed colour scheme was ‘a little on the sombre side’ and that bright colours were ‘essential for children’.\nMiss Potter had praised his work and did use some of suggestions when illustrating the book herself, such as giving the oakmen red clothes.\nBut the relationship between author and artist soured further the following year when Miss Potter’s publisher dramatically accused Mr Aris of plagiarism.\nMr Aris’s latest book, The Treasure Seekers, featured a rabbit called Peter.\nAt around the same time Miss Potter wrote to her publisher and referring to Mr Aris’s drawings she said his ‘animals are not good’.\nEmma Laws, Frederick Warne Curator of Children’s Literature at the V&A ,said: ‘Beatrix Potter’s drawings have a very distinct look and what she had in her mind was clearly very different to what Aris produced.\n‘Aris’s drawings are much bolder and more colourful than Potter’s and lack that all-important sense of place that characterises her best work.\n‘But I think he had a difficult job as he was working in the dark with only a few sketches and no knowledge of the story.’\nBut the relationship turned sour when Aris, who had produced six pictures for Potter, was accused of plagiarism by the famous author's pulbisher, after she decided not to use his work after all\nShe added: ‘If the book had been published it may have been an incongruous collaboration.’\nMiss Potter was forced to abandon The Oakmen over doubts about its originality and the book and both sets of illustrations have, until now, never been viewed by the public.\nDespite dying in 1943, Miss Potter remains one of the world’s best-loved children’s authors and illustrators.\nShe is best known for her Peter Rabbit books which she wrote between 1901 and 1913.","url":"https://www.dailymail.co.uk/news/article-3420216/Beatrix-Potter-feud-fellow-artist-Author-s-dispute-illustrator-bold-depiction-characters-book-never-published.html"}
