{"authors":["Lynn Neary"],"date_download":"2018-10-23 02:00:45","date_modify":"2018-10-23 02:00:45","date_publish":"2017-03-19 00:00:00","description":"All over the world there is folklore about animals and humans falling in love. Some think it could represent how people could value character more than appearance.","filename":"data/vaneerConsumption/BeautyAndTheBeastFollowsATraditionOfAnimalHumanLoveStories.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2017_03_19_520708209_beauty-and-the-beast-follows-a-tradition-of-animal-human-love-stories_1540260045.html","title":"'Beauty And The Beast' Follows A Tradition Of Animal-Human Love Stories","title_page":"'Beauty And The Beast' Follows A Tradition Of Animal-Human Love Stories : NPR","title_rss":"NULL","source_domain":"npr.org","text":"'Beauty And The Beast' Follows A Tradition Of Animal-Human Love Stories\nAll over the world there is folklore about animals and humans falling in love. Some think it could represent how people could value character more than appearance.\nLOURDES GARCIA-NAVARRO, HOST:\nDisney's new live action version of \"Beauty And The Beast\" opened this weekend. NPR's Lynn Neary wanted to know just how far back that story really goes.\nLYNN NEARY, BYLINE: \"Beauty And The Beast\" has surfaced in many forms over the years. In a 1980s TV show, The Beast lived not in a castle, but in an elaborate underground lair beneath New York City. His beauty was a lawyer.\n(SOUNDBITE OF TV SHOW, \"BEAUTY AND THE BEAST\")\nRON PERLMAN: (As Vincent) I knew then, as I know now, she would change my life forever.\nNEARY: That's the way the story usually goes. The beauty is the beast's salvation - not so in the classic 1930s film \"King Kong\" where beauty had the opposite effect.\n(SOUNDBITE OF FILM, \"KING KONG\")\nROBERT ARMSTRONG: (As Carl Denham) Oh, no. It wasn't the airplanes. It was beauty killed the beast.\nNEARY: But for all our fascination with the story, is it really, as the song says, a tale as old as time?\nMARIA TATAR: It is, for sure.\nNEARY: Maria Tatar should know. She studies and teaches folklore at Harvard. Tatar says there are folk tales about animal grooms...\nTATAR: They're bears and dogs and snakes and condors...\nNEARY: ...And animal brides.\nTATAR: ...Monkeys, toads, cranes, swans.\nNEARY: And pretty much anywhere you go in the world, says Tatar, you will find a story about animals and humans falling in love or at least entering an arrangement with the hope that love will come later.\nTATAR: You have Asian stories. You have Chinese tales. The Scandinavian countries love the swan maiden story. I found some terrific South American stories about a parrot prince and a fish.\nNEARY: Tatar has edited a new collection of these stories called, appropriately, \"Beauty And The Beast.\" She says brides in beastly forms usually have to complete impossible tasks to get to a happy ending. The animal grooms, on the other hand, are saved from a bestial existence by a beautiful young maiden.\nTATAR: Basically, she learns through her relationship with him to value character rather than appearances, though in some cases she just gets fed up. And she may throw him against the wall or burn his skin or, you know, do something terrible.\nNEARY: In Disney's version of the story, the beauty does not do anything so cruel, but in the beginning, the lovely Belle makes no attempt to conceal her disdain for the beast.\n(SOUNDBITE OF FILM, \"BEAUTY AND THE BEAST\")\nDAN STEVENS: (As Beast) I told you to join me for dinner.\nEMMA WATSON: (As Belle) And I told you no. I'd starve before I ever ate with you.\nSTEVENS: (As Beast) Well, be my guest. Go ahead and starve.\nNEARY: The Disney story follows the classic arc, says Tatar, wherein the beauty eventually finds something to love despite the beast's terrifying exterior.\nTATAR: One reason that we relate to this story, we love it so much, we embrace it as our cultural story is that it tells us about the other - about the other who can seem beastly and terrible. And it proposes that we make a move in the direction of empathy and understanding, rather than revulsion and horror and fear.\n(SOUNDBITE OF FILM, \"BEAUTY AND THE BEAST\")\nWATSON: (As Belle) Please - please don't leave. (Sobbing) I love you.\nNEARY: But even Tatar doesn't really know why we use animals to tell these romantic tales.\nTATAR: That is the enigma of the question, the puzzle, the mystery that I haven't quite figured out.\nNEARY: Then again, what's to figure? It is a love story, after all. Lynn Neary, NPR News, Washington.\nCopyright © 2017 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2017/03/19/520708209/beauty-and-the-beast-follows-a-tradition-of-animal-human-love-stories"}
