{"authors":["Siofra Brennan For Mailonline"],"date_download":"2018-10-23 00:25:15","date_modify":"2018-10-23 00:25:15","date_publish":"2016-01-28 14:15:43","description":"Vlogger Batalash Beauty, known as Dominique, has been pioneering the new trend for colourful fake freckles that's sweeping Instagram. The look is achieved by painting on liquid lipstick.","filename":"data/vaneerConsumption/Beautytrendseeswomenpaintingtheirfaceswithrainbowfakefreckles.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/27/17/30A3803F00000578-0-image-a-44_1453916751323.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3420016_Bizarre-new-beauty-trend-sees-women-painting-faces-rainbow-fake-freckles_1540254315.html","title":"Beauty trend sees women painting their faces with rainbow fake freckles","title_page":"Beauty trend sees women painting their faces with rainbow fake freckles | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The trend for faking sun kissed skin exploded last year, but now the faux freckle craze has gone one step further.\nBeauty fans are flooding Instagram with images of their faces covered in brightly coloured dots - and the more dramatic the better.\nThe trend has been pioneered by vlogger Batalash Beauty, also known as Dominique, who has shared colourful faux freckle tutorials on her YouTube page.\nScroll down for video\nVlogger Batalash Beauty, also known as Dominique, has been pioneering the new trend for colourful faux freckles which is sweeping social media\nThe beauty lover has also posted a range of selfies on Instagram, providing inspiration for fans.\nOne dramatic look sees Dominique pair a bold red lip with matching dots around her eyes, which she's painted on with a liquid lipstick, as well as a single freckle above the cupid's bow.\nShe's also experimented with white freckles, which she paired with smoky eye make-up and spiky false eyelashes.\nAnother more futuristic look involves matching freckles in shades of blue to her eyebrows, which are pencilled over in similar hues.\nThe vlogger created a dramatic look with red freckles to match her bold lip, and inspired Instagram user Saraa Smirks to recreate the same style when she was stuck at home during a snow storm\nDominique shared a futuristic look in which she teamed her navy and blue freckles with coloured eyebrows\nAccording to Dominique the look is achieved by painting liquid lipstick on the back of the hand and applying the shades with different precision liner or concealer brushes to create a variety of freckle sizes.\nShe gently dots it on to the face sporadically to mimic the pattern of real freckles.\n'I don't like the freckles to be completely symmetrical,' she explains.\nShe goes lower with the pattern on one side so they look more 'natural', and paints on the lighter freckles with a smaller brush.\nShe recommends a mixture of 20 per cent large freckles, 30 per cent medium and 50 per cent small.\nLiquid lipstick tends to stay put once it dries, but she advises a light layer of translucent powder to set for a longer-lasting finish.\nJacqueline B went make up free to allow the burgundy and silver freckles around her eyes do the talking\nA stunning model shows off a dusting of yellow, green and dark blue freckles\nFans have been eager to share their efforts at emulating Dominique's quirky style on social media.\nJessicaaa_mua posted an image of herself with yellow eyeshadow and a burst of beauty spots in purple, blue and orange spread across her nose and cheeks.\n'Fruity freckles inspired by @dominiqueldr,' she wrote.\nSophie Amor was also prompted to add a delicate sprinkling of white freckles around her eyes, while Jacqueline B said she'd 'dotted like Dom' with silver and burgundy beauty spots.\n'Today's look was inspired by @dominiqueldr,' she wrote. 'How can she be so perfect? Loved her coloured freckles look so i took my own twist on it.'\nJessicaaa_mua was brave enough to try yellow eyeshadow with dramatic lines and freckles in a riot of colours\nJenn Hudson went for a comparatively natural look with her dusting of pink, brown and white freckles\nSophie Amor kept it subtle with lightly dotted white freckles (left). Geenakay showed off an artistic arrangement of yellow and purple freckles around her eyes\nJenn Hudson took the look to the extreme, dotting her entire forehead, nose and cheeks with pink and red freckles.\nMeanwhile Saraa_Smirks admitted she'd tried out the trend while she had too much time on her hands during bad weather.\n'I wanted to do something \"weird\" today with makeup,' she said. 'I'm snowed in and bored.'\nIanurwegednier bucked the trend for painting on freckles and used coloured glitter to create her sparkling freckled visage.\nAlmighty Rui chose colours to complement her floral headband and denim shirt\nIanurwegednier went for a different approach, using coloured glitter to create her freckles","url":"https://www.dailymail.co.uk/femail/article-3420016/Bizarre-new-beauty-trend-sees-women-painting-faces-rainbow-fake-freckles.html"}
