{"authors":["Kirspencer For Daily Mail Australia"],"date_download":"2018-10-22 21:35:11","date_modify":"2018-10-22 21:35:11","date_publish":"2017-03-16 01:43:21","description":"Chatting to Nova FM's Michael 'Wippa' Wipfli during Thursday morning's show, the 31-year-old revealed his lighter locks were thanks to peroxide and his very helpful wife.","filename":"data/vaneerConsumption/BeauRyanrevealshowhegothisBieberblondelocks.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/05/3E507B1100000578-0-image-a-26_1489643380947.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318376_Beau-Ryan-reveals-got-Bieber-blonde-locks_1540244111.html","title":"Beau Ryan reveals how he got his 'Bieber' blonde locks","title_page":"Beau Ryan reveals how he got his 'Bieber' blonde locks | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It was the short-shaved, bleach-blonde haircut that shocked Justin Bieber fans across the world.\nAnd after he was spotted sporting the same style as the famed Canadian Singer while shooting a segment for The NRL Footy show on Wednesday, Beau Ryan has revealed how he got his new lighter locks.\nChatting to Nova FM's Michael 'Wippa' Wipfli during Thursday morning's show, the 31-year-old revealed he 'obviously got Bieber fever'.\nBieber boy: Beau Ryan has dyed his hair blonde to look like Justin Bieber\nPlatinum: The 31-year-old's new look is for a NRL Footy Show segment, with the former rugby star also attending the singer's Sydney concert\nWhen asked about his dyed hair by the host, Beau revealed his new peroxide look was thanks to help from his wife.\n'Some of the head honchos at (Channel) Nine came up with the idea to do the Bieber Fever thing,' Beau laughed before providing the finer details of his make-over.\n'It was first coat, wait and hour then a shower. Another hour, then shower and lay down for eight hours sleep, burning scalp, then repeat that twice more.'\nHe added: 'It was about four hours but it was worth it.'\nBieber fever: Beau posed with fans while filming a segment for The NRL Footy Show on Wednesday, sporting the same light locks\nThe former rugby player also discussed the concert experience, after joking he sold his tickets to his 'wife's sister's ex-boyfriend'.\n'Bieber's show was great,' blonde-haired Beau said before claiming, 'It started off a bit slow because he sort of just flew in, no soundcheck and walked straight on the stage similar to the footy show.\nDiscussing the concert's young audience with the hosts, Beau was quick to reply that he had never witnessed such ear-splitting noise.\n'I've never heard ANZ Stadium that loud. Unbelievable. And it was great to be a part of it,' he said.\nCirca 2010: Wearing a white t-shirt, sneakers and a black baseball cap, Beau seemed to model himself on Justin's early career look\nChanging colours: Beau, who retired from NRL in June 2014, hasn't always sported light locks, letting his wife peroxide his hair for the upcoming skit\nBeau shared a photo to 348,000 Instagra.m followers on Wednesday where he was dressed up as the Baby singer.\nWearing a white T-shirt with Beiber's face on it, as well as ivory sneakers and a dark baseball cap, he seemed to model himself on Justin's early career look, when the teenage singer released his debut album in 2010.\nPOsing for pictures with Justin's eager fans, he captioned the moment 'It doesn't end well. All is revealed on tomorrow's @nrlfootyshow'\nThe sporting variety show is set to return Thursday night, ahead of the 2017 season.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318376/Beau-Ryan-reveals-got-Bieber-blonde-locks.html"}
