{"authors":["Alex Kritselis"],"date_download":"2018-10-30 23:18:55","date_modify":"2018-10-30 23:18:55","date_publish":"2014-08-13 20:16:52","description":"On Tuesday, Bebe Rexha premiered the music video for \"I Can't Stop Drinking About You,\" and it's a simple but arresting treatment that proves, yet again, that the newcomer has the chops to make it big. Though I first wrote about \"I Can't Stop…","filename":"data/vaneerConsumption/BebeRexhasICantStopDrinkingAboutYouVideoBringstheSongtoLifeVIDEO.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/7/10/f3f4aa08-6b14-49ab-91a1-7ea94782ef74-getty-480342011.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35625-bebe-rexhas-i-cant-stop-drinking-about-you-video-brings-the-song-to-life-video_1540941535.html","title":"Bebe Rexha's \"I Can't Stop Drinking About You\" Video Brings the Song to Life - VIDEO","title_page":"Bebe Rexha's \"I Can't Stop Drinking About You\" Video Brings the Song to Life — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"On Tuesday, Bebe Rexha premiered the music video for \"I Can't Stop Drinking About You,\" and it's a simple but arresting treatment that proves, yet again, that the newcomer has the chops to make it big. Though I first wrote about \"I Can't Stop Drinking About You\" back in April, the song's just now beginning to impact Top 40 radio stations. In other words, you could (and should) be hearing the song on the airwaves soon. Additionally, Rexha recently shared a bunch of exciting details about her upcoming album and other projects with pop music website Idolator, and it sounds like her career is really about to take off!\nThe 24-year-old singer-songwriter is definitely an artist you should know.\nFirst, a brief primer on Rexha (if you're not already familiar with her work): According to Billboard, after a brief stint as the lead singer of Pete Wentz's side project, Black Cards, Rexha wrote \"The Monster\" — a song that was recorded by superstars Eminem and Rihanna and went on to hit the coveted number-one spot on the Billboard Hot 100 chart. That's a pretty impressive accomplishment! Last year, Rexha sang on EDM group Cash Cash's hit single, \"Take Me Home.\" Now, she's hoping to nab a little solo success for herself (and I think she's up to the task).\nIt seems like Rexha had one mission and one mission only while filming the \"I Can't Stop Drinking About You\" music video: Look stunning. Don't worry, she accomplished what she set out to do. In a series of shots set inside a creepy-looking empty house, Rexha serves viewers a variety of different looks: distraught and stunning, angry and stunning, half-naked and stunning, etc. The dark, emotionally charged video really brings \"I Can't Stop Drinking About You's\" lyrics to life. According to Billboard, the video was directed by Michael Mihail, who also directed the visual for rapper Kendrick Lamar's track, \"Bitch Don't Kill My Vibe.\"\nBebe Rexha on YouTube\nSo, after \"I Can't Stop Drinking About You\" (hopefully) takes off, what does the future hold for Rexha? Speaking to Idolator on Tuesday, Rexha revealed that she's worked with some really talented writers and producers for her upcoming debut album (which doesn't have a release date just yet). Though she's put in studio time with people she's dubbed \"big producers,\" like Max Martin (Britney Spears, Katy Perry), Fraser T. Smith (Adele's \"Set Fire to the Rain\"), Michael Busbee (5 Seconds of Summer's \"Don't Stop\"), and Martin Solveig (\"Hello\"), Rexha said that she really prefers to work with \"up-and-coming\" musicians who will \"accept\" her for who she is, as opposed to being caught up with churning out hits.\nWhen asked about what she's written for other artists lately, Rexha said that she's worked on songs for Usher and upcoming R&B star Tinashe (if you haven't heard her debut single, \"2 On,\" yet, you need to fix that). She also mentioned that she's done three tracks with French DJ David Guetta. Interestingly, one of the songs is about gay marriage (she's decided to keep it for herself). Finally, Rexha referenced a mysterious, \"super big\" upcoming single that she's featured on, but she didn't provide any more details. I can't wait to find out about that!\nAlberto E. Rodriguez/Getty Images Entertainment/Getty Images\nIt certainly sounds as if Rexha is laying the groundwork to make her big splash on the pop music scene in the coming months. I hope that she can make it work. Stay tuned!","url":"https://www.bustle.com/articles/35625-bebe-rexhas-i-cant-stop-drinking-about-you-video-brings-the-song-to-life-video"}
