{"authors":[],"date_download":"2018-10-30 01:13:56","date_modify":"2018-10-30 01:13:56","date_publish":"2014-05-22 00:00:00","description":null,"filename":"data/vaneerConsumption/BecauseTheyreNotHappyinIran.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_05_because_theyre_not_happy_in_iran_1540862036.html","title":"Because They're Not Happy in Iran","title_page":"Because They're Not Happy in Iran","title_rss":"NULL","source_domain":"americanthinker.com","text":"But apparently being happy in Iran is illegal and just not allowed according to England's The Guardian.\nPeople around the world are just a little bit happier thanks to Pharrell Williams and his most infectious Happy song . Families, students, co workers, colleagues, neighbors, friends, random strangers have all happily celebrated their happiness and then happily posted their happiness (as I said, Happy is infectious) to youtube.\nAfter six happy young Iranians, including burqaless, scarfless women, joined the world wide trend of dancing to Williams' Happy and dared to happily upload their happiness to youtube. (towards the end of this, at the 4 minute mark, read their now poignant message).\nBut, this being Iran, they weren't happy for long.\nTehran's police chief, Hossein Sajedinia, confirmed six people had been detained in connection with \"an obnoxious\" video released on social networking websites, according to the semi-official Isna news agency. \"We launched a police investigation in cooperation with the judicial authorities and identified and arrested the accused within six hours,\" he told Isna. Sajedinia said those arrested acknowledged what he described as a wrongdoing. (snip) On TV, Sajedinia warned Iranian youth that the police was vigilant and prepared to tackle those acting against the social norms.\nYes, being happy in Iran is \"against the social norms;\" expressing happiness in a video is \"obnoxious.\"\nHowever, a twitter campaign urging Iranian authorities to free those formerly happy Iranians has worked; Hassan Rouhani, Iran's president no less, tweeted\n\"#Happiness is our people's right. We shouldn't be too hard on behaviors caused by joy.\" 29/6/2013 — Hassan Rouhani (@HassanRouhani) May 21, 2014\nBut as the Guardian reported, and others bravely responded to Rouhani, the true situation is different.\n\"Iran is a country where being \"happy\" is a crime,\" tweeted Iranian journalist Golnaz Esfandiari, reacting to the arrests. Many Iranian users on Twitter were using #freehappyiranians to call on the Iranian authorities to release those arrested in connection with the video.\nThe normally happy Pharrell Williams was not happy with the news.\nPharrell reacted to the news by posting on Facebook: \"It is beyond sad that these kids were arrested for trying to spread happiness.\"\nContinuing their war on happiness, Iranian authorities condemned an Iranian actress who casually kissed an official of the Cannes Film Festival in France. (WARNING: Do NOT open if you believe in the chastity of Iranian women, if you do not believe an adult woman should do such a thing in public.)\nLeila Hatami's peck has been seen by fanatics as an affront to the 'chastity' of the Islamic republic's women.\nA photograph carried by Iranian media shows Hatami pecking 83-year-old Gilles Jacob at the opening of this year's festival.\n'Those who attend intentional events should take heed of the credibility and chastity of Iranians, so that a bad image of Iranian women will not be demonstrated to the world,' Deputy Culture Minister Hossein Noushabadi said, quoted by the website of state broadcaster IRIB.\n'Iranian woman is the symbol of chastity and innocence,' he said.\nBecause they're happy...","url":"https://www.americanthinker.com/blog/2014/05/because_theyre_not_happy_in_iran.html"}
