{"authors":["Cindy Tran For Daily Mail Australia"],"date_download":"2018-10-23 00:15:40","date_modify":"2018-10-23 00:15:40","date_publish":"2017-04-26 09:44:44","description":"The Australian midwife who delivered Rebecca Judd's children has revealed she can predict how a woman's labour will go down just by 'looking' at them.","filename":"data/vaneerConsumption/BecJuddsmidwifesaysshecanpredictwomenslabour.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F9D42DD00000578-0-image-a-36_1493195249578.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4446636_Bec-Judd-s-midwife-says-predict-women-s-labour_1540253740.html","title":"Bec Judd's midwife says she can predict women's labour","title_page":"Bec Judd's midwife says she can predict women's labour | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The midwife who delivered Rebecca Judd's children has revealed she can predict how a woman's labour will go down just by 'looking' at them.\nAustralian midwife Cath Curtin explained women who are 'tall and slim' are more likely to have easier births.\nSpeaking to Mamamia's pregnancy podcast Hello Bump, the nurse said she could pinpoint a linking factor that makes a good birth.\nMidwife Cath Curtin who delivered Rebecca Judd's twins Tom and Darcy (pictured with Cath) has revealed she can predict how a woman's labour will go down just by 'looking' at them\nThe midwife delivered all four of Chris and Rebecca Judd 's children - son Oscar, daughter Billie and twin boys Tom and Darcy\n'I can tell by looking at someone... I know that's weird. It's the tall, slim build [women],' midwife Cath said.\nAnother feature for an easy birth was a 'capacious pelvis' - a wide frame that contracts and pushes the baby through the birth canal with relative ease.\nHowever the feature is not obvious on first glance - and midwife Cath said only an x-ray could measure the size of a woman's pelvis.\n'When you've got some women who have a capacious pelvis, it's so wide that even if they're five foot tall, they can push through a nine pound baby,' she explained.\n'So you never say never. You never think \"oh well because you're tiny, you're never going to have a big baby in a natural childbirth.\n'But there is a look, it's hard to describe.'\nMidwife Cath explained women who are 'tall and slim' are more likely to have easier births\nThe glamorous mother with her twins Tom and Darcy - who were delivered by midwife Cath\nMidwife Cath helped the Judd family deliver their children, including twin boys Tom and Darcy\nPopular midwife Cath has delivered more than 10,000 babies in her 42-year nursing career\nMidwife Cath - who has delivered more than 10,000 babies in her 42-year career - said it was important for parents to be 'reasonable' when it comes to a birthing plan.\n'Things go wrong in pregnancy quickly. Everything could be going really smooth, and then bang. It's about being reasonable,' she said.\n'We all have a fantasy about birth and there's also reality - so I know about both because I understand where women are coming from and their fantasy of what we all think.\n'I have seen some amazing births. Really beautiful births... But when things happen quickly and if they go wrong, they go wrong quickly.'\nAnd midwife Cath said having either a positive or negative attitude during pregnancy makes no difference to giving birth.","url":"https://www.dailymail.co.uk/femail/article-4446636/Bec-Judd-s-midwife-says-predict-women-s-labour.html"}
