{"authors":["Kipp Jones"],"date_download":"2018-10-30 19:39:41","date_modify":"2018-10-30 19:39:41","date_publish":"2015-04-04 17:22:42","description":"Leonardo DiCaprio has plans to transform his uninhabited private island off the coast of Belize into an eco-resort and conservation area.","filename":"data/vaneerConsumption/BeEcoFriendlyatLeonardoDiCapriosNewEnvironmentalistResortfor2KaNight.json","image_url":"https://media.breitbart.com/media/2015/03/Leonardo-DiCaprio-AP-Photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_04_04__1540928381.html","title":"Be Eco-Friendly at Leonardo DiCaprio’s New Environmentalist Resort–for $2K a Night","title_page":"Be Eco-Friendly at Leonardo DiCaprio's New Environmentalist Resort--for $2K a Night | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Actor and environmentalist Leonardo DiCaprio has made plans to transform his uninhabited private island off the coast of Belize into an eco-resort and conservation area, with hopes of “healing” the property and pampering its guests.\nThe New York Times reports the island, now named Blackadore Caye, was purchased by the star in 2005 for $1.75 million with partner Jeff Gram, who owns Cayo Espanto Island Resort, a luxury vacation spot nearby.\nWhile scuba diving ten years ago, Leo fell in love with the property. “It was like heaven on earth,” he told the Times over the phone. “And almost immediately, I found this opportunity to purchase an island there.”\nThe project will restore the island from decades of over-fishing, deforestation, and coastline erosion, but the paper reports DiCaprio and his partners also plan to build 68 resort villas and 48 private houses, which are expected to be sold privately and cost between $5 million and $15 million each, with others to be available to guests.\n“I believe that it will be an incredible private island that will set the mark for all future island developments,” DiCaprio said. “My goal was always the fact that I wanted to create something not just environmental, but restorative,” he said. “A showcase for what is possible.”\nA team of scientists, designers, engineers, and landscape architects, who have spent the last 18 months planning the resort, will closely monitor its impact on the island’s environment.\n“The main focus is to do something that will change the world,” said The Wolf of Wall Street actor. “I couldn’t have gone to Belize and built on an island and done something like this, if it weren’t for the idea that it could be groundbreaking in the environmental movement.”\nBlackadore Caye’s guest villas will be built over a platform that stretches in an arc over the water and will cover artificial reefs and fish shelters underneath. The island will also house a nursery, which plans to grow indigenous marine grass to support a manatee conservation area, and mangrove trees will be planted to replace other invasive tree species.\nThe market for ecotourism is booming and now has eight billion ecotourist visits a year worldwide, according to the Center for Responsible Travel.\nEcotourism is described as travel that minimizes the negative impact on a location by guests and seeks to preserve its natural resources.\nNearby luxury resort areas generally cost around $2,000 per night.","url":"https://www.breitbart.com/entertainment/2015/04/04/be-eco-freindly-at-leonardo-dicaprios-new-environmentalist-resort-for-2k-a-night/"}
