{"authors":["Associated Press"],"date_download":"2018-10-23 03:18:54","date_modify":"2018-10-23 03:18:54","date_publish":"2016-01-29 18:08:07","description":"DALLAS (AP) — Ethan Couch was behind the wheel of a pickup truck, reeking of booze when police confronted him. He had no driver's license. Next to him was a ...","filename":"data/vaneerConsumption/Beforeaffluenzacaseteensfamilytangledwiththelaw.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:75459e52bb5d41609dbd639bf954de8d-4PuZeKVXE7cd9005b2c876cf93f3-479_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423227_Before-affluenza-case-teens-family-tangled-law_1540264734.html","title":"Before 'affluenza' case, teen's family tangled with the law","title_page":"Before 'affluenza' case, teen's family tangled with the law | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Before 'affluenza' case, teen's family tangled with the law\nDALLAS (AP) — Ethan Couch was behind the wheel of a pickup truck, reeking of booze when police confronted him. He had no driver's license. Next to him was a passed-out, half-naked girl, and an open vodka bottle lay on the backseat floor.\nStill, as one officer reported, the skinny, blond 15-year-old mouthed off as they questioned him. He said he had taken pre-law classes and knew what police could and couldn't do to him. The officer cautioned him about the perils of drinking and driving, according to court records obtained by The Associated Press.\n\"I spoke with him at some length about the various consequences of his driving and drinking,\" wrote Fort Worth, Texas, police officer W.E. Spakes, \"such as effects on (his) driver's license and his path in life, especially DWI and even killing someone in a DWI.\"\nIn this file photo made Wednesday, Feb. 5, 2014, Tonya Couch, left, and Fred Couch, parents of teenager Ethan Couch, arrive at juvenile court for a hearing about their son's future in Fort Worth, Texas. Long before Ethan Couch and his family became notorious for using an ¿affluenza¿ defense in a deadly drunken driving crash, they had multiple run-ins with the law, each time flouting authority or relying on their wealth to get them out of trouble. (AP Photo/LM Otero, File)\nCouch left that night in February 2013 with two citations and his mother, Tonya, who was called to the scene. Four months later, he drove drunk into a group of people helping a stranded motorist, killing four.\nLong before Couch and his family became notorious for using an \"affluenza\" defense in that crash, they had multiple run-ins with the law, often flouting authority or relying on personal wealth to get out of trouble. The incidents, totaling at least 20, ranged from speeding tickets and financial disputes to reckless driving and assault, a review of police and court records shows.\nOn Thursday, Couch returned to the United States from Mexico, where he and his mother had fled in December after a video surfaced online appearing to show him at a party where people were drinking — a potential violation of the terms of his probation for the fatal accident.\nA psychologist who evaluated Couch in 2013 introduced the \"affluenza\" term at trial in reference to Couch being coddled by his wealthy parents. He testified that Couch learned nothing from that first incident, court records show. The teen didn't think he had done anything serious, Dr. G. Dick Miller said, and his mother lied to his father about it.\nCouch also kept abusing substances, Miller testified. \"I think he thought, 'I can get away with this.'... That was what he was taught.\"\nMiller recommended that Couch be separated from his parents, who he said had \"taught him a system that's 180 degrees from rational. If you hurt someone, say you're sorry. In that family, if you hurt someone, send some money.\"\nFred Couch — the teen's father, who is in the midst of divorcing Ethan's mother for the second time — did not respond to multiple messages seeking comment. Tonya Couch spoke briefly to the AP, but declined to discuss the family's most recent problems.\nThe Couches legal woes date to at least the late 1980s, records show.\nFred Couch's roofing and construction company, Cleburne Sheet Metal, was sued in 1996 over a roughly $100,000 debt. Two plaintiff firms alleged he tried to move assets, and twice attempted to question him and Tonya Couch, court records show. The couple failed to show up for both depositions. A judge sanctioned them and gave them a deadline to pay, which they missed by several weeks.\nThree years later, Fred Couch punched a supervisor for a contractor that hired his company after the man told his workers to stop using an unsafe table saw, according to an arrest report. Couch drove off; he later received a few days in jail and two years' probation for the assault.\nAnd in 2009, Fred Couch faced accusations that he sexually harassed a female employee, then fired her when she complained. Court records show he denied touching her inappropriately and showing her sex videos, among other things. The case settled on undisclosed terms a year later.\nTonya Couch's encounters with the law include a 2003 reckless driving case in which court records say she intentionally forced a motorist off the road. She pleaded guilty, was fined and got probation, records show.\nIn early 2005, she lied about that charge on a form to renew her state nursing license. Regulators found out years later and took action. She failed to show for a 2012 disciplinary hearing and lost the vocational nursing license.\nIt was just a few months later when a Fort Worth police officer drove by a Dollar General store in Lakeside, a small town on the outskirts of Fort Worth, and saw a black pickup truck parked with its lights on.\nSpakes, the officer, found an intoxicated Ethan Couch with the girl. According to court records, Couch told Spakes that he'd stopped to urinate and had only one drink, maybe two. Spakes described him as \"very arrogant, a smart-mouthed kid that had a bit of an attitude with authority,\" records show.\n\"I verbally got onto him trying to get him to see how badly he was messing up,\" Spakes wrote in a report. \"He has a hard time listening and has come from a family with wealth, and he appears to believe he's privileged and entitled with no responsibility.\"\nCouch eventually acknowledged his behavior was wrong, Spakes wrote. Yet when a second officer, Lee Risdon of Lakeside police, handed Couch his citations, the teen replied, \"Thanks for ruining my life ... as though it was the fault of the police,\" according to the report.\nA month later, a municipal judge gave Couch six months' probation for possessing and consuming alcohol as a minor. The judge also ordered him to complete an alcohol-awareness course and 12 hours of alcohol-related community service by June 19.\nRecords indicate Couch did not comply and, four days before the deadline, organized a party at the family's second home outside the Fort Worth suburb of Burleson. Members of the crowd played beer pong and drank Miller Lite that some of them stole that night from Wal-Mart, according to an investigator's report.\nCouch, then 16, and a group of friends later piled into his family's truck and sped down the road. When one told him to slow down, he accelerated and nearly hit a vehicle head-on. He swerved back into his lane and then veered into a ditch, striking the roadside crowd that was helping a disabled driver.\nCouch's blood-alcohol content was three times the legal limit, records show. Investigators estimated his speed was around 70 mph in a 40 mph zone. As he walked away from the scene of the crash, Couch told witnesses: \"I'm Ethan Couch, I can get you out of this,\" according to court testimony.\nHe was charged with four counts of intoxication manslaughter and two counts of intoxication assault. His parents sent him to a treatment facility in California.\nThe center's director, Jamison Monroe Jr., told the AP that Couch \"had no structure, no proper role models and definitely no boundaries\" when he was growing up.\nCouch pleaded guilty to the charges. Then, during the punishment phase of his case, the \"affluenza\" defense emerged. Miller, the psychologist, testified that his parents had coddled him: \"When the rules get tough, the Couches find another way to get it done.\"\nBut with treatment, and separation from his family, Miller said he thought Couch could \"learn to behave in a way that's civil.\"\nTarrant County juvenile Judge Jean Boyd sentenced Couch to 10 years' probation after time in a state-run treatment facility. That decision drew outrage, but juvenile law experts say Texas emphasizes rehabilitating child offenders, in contrast to the state's much tougher adult courts.\nAfter sentencing, the family problems continued, records show. Fred Couch was charged in September 2014 with falsely identifying himself as a Lakeside police officer. He told an North Richland Hills, Texas, officer responding to a disturbance that he'd witnessed, \"I have my Lakeside police stuff in the truck,\" according to a report. He then displayed a shield-style badge. He has a March 18 court hearing.\nIn early 2015, Tonya Couch was cited after leaving the scene of a minor accident that she caused. Prosecutors later dismissed the case, according to court records.\nOn Friday, a judge ruled that Couch will remain in a juvenile detention center as he awaits a ruling on whether his case should be transferred to adult court, where probation violations could bring up to 40 years in prison. He returns to court Feb. 19.\nThe father of one survivor of the drunken-driving crash said he hopes the justice system will finally deliver the kind of \"tough love\" that Couch's family failed to provide.\n\"I don't think you're bound by your genetics or even your environment,\" said Kevin McConnell, whose teenage son Lucas was among those who were hurt. \"I think Ethan Couch could find redemption.\"\n___\nAssociated Press writer Emily Schmall in Fort Worth contributed to this report.\n___\nFollow Reese Dunklin on Twitter: https://twitter.com/ReeseDunklin .\nFILE - In this December 2013 image taken from a video by KDFW-FOX 4, Ethan Couch is seen during his court hearing in Fort Worth, Texas. The family of Couch, who killed four people in a drunken wreck, have reached a settlement of more than $2 million with the family of a teenage boy left disabled in the accident. Long before Ethan Couch and his family became notorious for using an ¿affluenza¿ defense in his deadly drunken driving crash, they had multiple run-ins with the law, each time flouting authority or relying on their wealth to get them out of trouble. (AP Photo/KDFW-FOX 4, File)\nIn this photo made Tuesday, Jan. 26, 2016, a truck drives past the area where teenager Ethan Couch caused a 2013 drunken-driving wreck that killed four, in Burelson, Texas. Long before Ethan Couch and his family became notorious for using an ¿affluenza¿ defense in his deadly drunken driving crash, they had multiple run-ins with the law, each time flouting authority or relying on their wealth to get them out of trouble. (AP Photo/LM Otero)\nIn this file photo made Wednesday, Feb. 5, 2014, Fred Couch, father of teenager Ethan Couch, collects his belt after clearing security as he arrives at juvenile court for a hearing about his son's future in Fort Worth, Texas. Long before Ethan Couch and his family became notorious for using an ¿affluenza¿ defense in a deadly drunken driving crash, they had multiple run-ins with the law, each time flouting authority or relying on their wealth to get them out of trouble. (AP Photo/LM Otero, FIle)\nIn this file photo made Wednesday, Feb. 5, 2014, Fred Couch, back to camera left, looks on as his son teenager Ethan Couch sits with his attorney Scott Brown before a hearing at juvenile court in Fort Worth, Texas. Long before Ethan Couch and his family became notorious for using an ¿affluenza¿ defense in a deadly drunken driving crash, they had multiple run-ins with the law, each time flouting authority or relying on their wealth to get them out of trouble. (AP Photo/LM Otero, File)\nIn this photo made Tuesday, Jan. 26, 2016, a cross stands marking the area where teenager Ethan Couch caused a 2013 drunken-driving wreck that killed four, in Burelson, Texas. Long before Ethan Couch and his family became notorious for using an ¿affluenza¿ defense in his deadly drunken driving crash, they had multiple run-ins with the law, each time flouting authority or relying on their wealth to get them out of trouble. (AP Photo/LM Otero)\nIn this photo made Tuesday, Jan. 26, 2016, the front entrance leading to the home of Fred Couch, father of notorious convicted teenage drunk driver Ethan Couch, is shown in Lakeside, Texas. Long before Ethan Couch and his family became notorious for using an ¿affluenza¿ defense in his deadly drunken driving crash, they had multiple run-ins with the law, each time flouting authority or relying on their wealth to get them out of trouble. (AP Photo/LM Otero)\nIn this photo made Tuesday, Jan. 26, 2016, a tractor lift sits next to the home of Fred Couch, father of notorious convicted teenage drunk driver Ethan Couch, in Lakeside, Texas. Long before Ethan Couch and his family became notorious for using an ¿affluenza¿ defense in his deadly drunken driving crash, they had multiple run-ins with the law, each time flouting authority or relying on their wealth to get them out of trouble. (AP Photo/LM Otero)\nIn this photo made Tuesday, Jan. 26, 2016, a tractor lift owned by Fred Couch's company with the saying \"Who's Your Daddy,\" sits next to the Couch home in Lakeside, Texas. Long before Ethan Couch and his family became notorious for using an ¿affluenza¿ defense in his deadly drunken driving crash, they had multiple run-ins with the law, each time flouting authority or relying on their wealth to get them out of trouble. (AP Photo/LM Otero)","url":"https://www.dailymail.co.uk/wires/ap/article-3423227/Before-affluenza-case-teens-family-tangled-law.html"}
