{"authors":["Aaron Klein"],"date_download":"2018-10-30 19:14:00","date_modify":"2018-10-30 19:14:00","date_publish":"2016-12-15 18:05:53","description":"TEL AVIV - While Hillary Clinton’s team is currently pushing the narrative that Russia interfered in the presidential election in favor of Donald Trump, | Politics","filename":"data/vaneerConsumption/BeforeBlamingRussiaHillaryClintonsCampaignConspiredtoElevateTrump.json","image_url":"https://media.breitbart.com/media/2016/10/wi/ap/19/333g3gb-photo-95.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_12_15__1540926840.html","title":"Before Blaming Russia, Hillary Clinton’s Campaign Conspired to ‘Elevate’ Trump","title_page":"Before Blaming Russia, Hillary Clinton’s Campaign Conspired to ‘Elevate’ Trump","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – While Hillary Clinton’s team is currently pushing the narrative that Russia interfered in the presidential election in favor of Donald Trump, it was Clinton’s campaign team who were actually caught red-handed – with a paper trail to prove it – strategizing how to interfere in the GOP presidential primaries with the goal of ensuring that Trump was the Republican nominee.\nLast month, Wikileaks published an email containing a document sent to the Democratic National Committee (DNC) from Clinton’s campaign detailing a strategy to help ensure that Clinton’s opponent would be a “Pied Piper” candidate and not a so-called mainstream Republican, like Jeb Bush or Marco Rubio.\nThe “Pied Piper” candidates, according to the Clinton campaign document, were Trump, Ted Cruz and Ben Carson.\nThe concept, which clearly failed miserably for Clinton, was to aid in the rise of one of these candidates, believing each of them to be “unpalatable to a majority of the electorate” and the weakest candidates against Hillary Clinton.\nThe underhanded scheme was outlined in a two-page document, dated April 7, 2015 and titled, “2016 GOP presidential candidates.”\nThe document, intended for the DNC, was contained in an email from Marissa Astor, Clinton campaign manager Robby Mook’s assistant, and sent to several Clinton staffers, including campaign chairman John Podesta. The correspondence was posted by Wikileaks, which published the contents of Podesta’s private Gmail account.\n“This memo is intended to outline the strategy and goals a potential Hillary Clinton presidential campaign would have regarding the 2016 Republican presidential field. Clearly most of what is contained in this memo is work the DNC is already doing. This exercise is intended to put those ideas to paper,” the document states.\n“We need to be elevating the Pied Piper candidates so that they are leaders of the pack and tell the press to them seriously,” the memo continued.\n“Our hope is that the goal of a potential HRC campaign and the DNC would be one-in-the-same: to make whomever the Republicans nominate unpalatable to a majority of the electorate,” stated the memo.\nThe subject line of Astor’s email was “Friday Strategy Call at 8:00 AM ET,” indicating the paper was to be used for a strategy phone call.\nThe Observer last month reported on the memo, noting that the plan seemed to have been put into action:\nAll the Clinton campaign had to do was push the mainstream media in the general direction of covering and attacking Trump as though he was the star of the Republican presidential primaries. As the presumed Democratic nominee, whomever she decided to dignify by responding to—whether the comments were directed at her or not—would be presumed to be the spokesperson, or nominee, of the Republican Party. “Clinton, Trump trade insults as rhetoric heats up between front-runners,” read the headline from a CNN article in September 2015. “Hillary Clinton Seizes On Donald Trump’s Remarks to Galvanize Women,” read a New York Times headline from December. Several media outlets criticized the mainstream media obsession with Trump, but despite a few concerns that the media was propping up his legitimacy as a candidate with their constant news coverage, it continued unabatedly. The mainstream media was more than willing to do the Clinton campaign and DNC’s work for them by creating a narrative that the 2016 presidential elections was about Hillary Clinton vs. Donald Trump.\nThe liberal Salon.com covered the memo in an article titled, “How the Hillary Clinton campaign deliberately ‘elevated’ Donald Trump with its ‘pied piper’ strategy.”\n“What was not often acknowledged in Trump’s heated race against Democrat Hillary Clinton, however, was how her campaign fueled his rise to power,” reported Salon.\nAaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio.” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.\nWith research by Joshua Klein.","url":"https://www.breitbart.com/politics/2016/12/15/forget-russia-hillarys-campaign-conspired-elevate-trump/"}
