{"authors":["Olivier Laurent","Photo Editor Focusing On France","Africa","Middle East"],"date_download":"2018-10-21 03:05:17","date_modify":"2018-10-21 03:05:17","date_publish":"2018-09-05 11:49:28","description":"For the last five years, photographer Alice Martins has documented Raqqa before and after Islamic State occupation.","filename":"data/vaneerConsumption/BeforeandafterISISWelcometofreeRaqqa.json","image_url":"https://www.washingtonpost.com/resizer/A-uff_JV6CHWPZRYVxAQN3hEhQ4=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UDDC6QHEC43A5EZTKGQAYCMLXI.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_09_05__1540091117.html","title":"Before and after ISIS: Welcome to ‘free’ Raqqa","title_page":"Before and after ISIS: Welcome to ‘free’ Raqqa - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"A woman covers her face as she waits in line to buy bread at a bakery run by the Islamic Movement Ahrar al-Sham in Raqqa during the holy month of Ramadan, in July 2013. (Alice Martins)\nThe woman covered her face as she turned around, looking behind her as she waited to buy bread in a small shop in Raqqa, Syria. It was July 2013, during the Muslim holy month of Ramadan. The Islamic State and the Free Syria Army both were present in the only major Syrian city captured, just a few weeks before, by the opposition.\nAnd yet, said Alice Martins, a photographer and frequent contributor to The Washington Post, there was already a sense that extremists of the Islamic State, also known as ISIS, were slowly solidifying their presence in Raqqa.\n“At the time, it was still uncommon for women to dress in a more conservative manner, by covering their faces,” said Martins. “By January 2014, ISIS had taken full control of the city and began enforcing their strict dress code, which demanded women cover themselves entirely.”\n[A photographer’s journey into the dying center of the Islamic State]\nThree years later, as Martins returned to Raqqa just weeks after the city was liberated from ISIS, “a surprisingly significant number of women still dressed according to ISIS rules,” she told In Sight. “Locals claim most still simply did not feel safe and feared the militants could capture the city again at any time.”\nThis is the story of Raqqa, a city destroyed during four years of occupation and the U.S.- and Kurdish-led military operation that freed it from the clutches of extremism.\nThat story, told in the pages of The Washington Post over the last year, is now the subject of an exhibition — “Welcome to Free Raqqa!” at Visa pour l’Image, the world’s largest photojournalism festival, held each year, and for the past 30 years, in Perpignan, France.\n[How American neglect imperils the victory over ISIS]\nIt’s the story of a city that continues to deal with the unprecedented destruction that befell it. “The city is still strewn with unexploded ordnance and improvised explosive devices, and the stench of decomposing bodies is all around,” Martins said after her latest excursion into Raqqa, in March 2018. “An underequipped and understaffed civil defense unit struggles to retrieve bodies from the rubble, unable to identify many of the remains and burying them in mass graves. Civilians who were displaced during the military operation remain in camps in the countryside, some making day trips to the city to begin rebuilding their homes, but most simply cannot afford it. Many are maimed or killed as they enter buildings that haven’t been cleared of explosives, to try and collect any valuables they may find.”\nA deep sense of injustice dominated the conversations among survivors and refugees who returned to the shattered city, said Martins. “Several people we spoke to question the way the operation was conducted: Was there any concern for civilian lives? Were the bombs used to take out a single sniper that often also caused the death of several civilians an acceptable choice?”\nThese are not the only questions that remain unanswered. Another one — a crucial one — is uncertain. Will Raqqa be free again?\nA sign put up by Islamic State militants on a square across from the offices of the former governor of Raqqa reads: “And then there will be the Caliphate upon the Prophetic method.” The frame formerly displayed a portrait of Syrian President Bashar al-Assad before the government lost control of the city in 2013. (Alice Martins/For The Washington Post)\nA shepherd walks by a sign indicating the direction to Raqqa city during the early stages of the military operation to expel ISIS militants from their de facto capital. (Alice Martins/For The Washington Post)\nManbij Military Council recruits rest during a combat training exercise. (Alice Martins)\nA woman walks by a building targeted in a U.S.-led coalition airstrike in which several civilians were killed during the operation to expel ISIS militants from Raqqa province. (Alice Martins/For The Washington Post)\nCivilians displaced by fighting in Raqqa city and surrounding villages drive to safety on a road in the Raqqa countryside, on May 22, 2017. (Alice Martins/For The Washington Post)\nA family displaced by fighting in a village outside Raqqa stands next to a small truck that contains all of their belongings moments after a hailstorm flooded their improvised tent at a camp in Ain Issa in the Raqqa province, on May 23, 2017. (Alice Martins/For The Washington Post)\nWorkers clear the rubble from what used to be the governorate building of Raqqa, occupied by Islamic State militants since shortly after the Syrian government lost control of the city in 2013. (Alice Martins/For The Washington Post)\nMembers of Raqqa’s civil defense bury 11 unidentified bodies in a mass grave on the outskirts of the city. (Alice Martins/For The Washington Post)\nNewly recruited candidates for the Raqqa Internal Police forces attend training in Ain Issa. The recruits were given camouflage uniforms for the training due to a shortage of police uniforms apparently caused by high demand. (Alice Martins/For The Washington Post)\nA Humvee, part of an Iraqi army convoy, drives through an area contaminated by smoke from oil wells set alight by Islamic State militants as they fled Iraqi security forces in Qayyarah, northern Iraq. (Alice Martins)\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\nCelebrating 30 years of photojournalism at Visa pour l’Image\nVoices of African photography: Reclaiming the black body\nWhat it was like in the nightclubs of Chicago’s South Side in the 1970s","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/09/05/before-and-after-isis-welcome-to-free-raqqa/"}
