{"authors":["Caroline May"],"date_download":"2018-10-30 18:20:19","date_modify":"2018-10-30 18:20:19","date_publish":"2016-05-25 19:25:23","description":"The State Department has admitted more than 800 Syrian refugees in less than a month but is still well behind schedule to meet the Obama administration’s goal of 10,000 admissions this fiscal year. | Immigration","filename":"data/vaneerConsumption/BehindScheduleSyrianRefugeeAdmissionsDramaticallyAccelerateto804inLessThanaMonth.json","image_url":"https://media.breitbart.com/media/2016/05/Syrian-Refugees-Darko-Vojinovic-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/immigration_2016_05_25__1540923619.html","title":"Behind Schedule, Syrian Refugee Admissions Dramatically Accelerate to 804 in Less Than a Month","title_page":"Behind Schedule, Syrian Refugee Admissions Dramatically Accelerate to 804 in Less Than a Month | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The State Department has admitted more than 800 Syrian refugees in less than a month but is still well behind schedule to meet the Obama administration’s goal of 10,000 admissions this fiscal year.\nAccording to the States Department’s Refugee Processing Center, so far this month 804 Syrians have been admitted to the U.S. as refugees, including 795 Sunni Muslims, seven identified as “Moslem,” and two Catholic refugees.\nThe Obama administration recently began to accelerate Syrian refugee processing and resettlement in order to meet its goal of 10,000 admissions this fiscal year, which started in October 2015 and will end come September 30.\nThe 804 Syrian refugees admitted during the month of May — as of Wednesday May 25 — busts previous records for single month Syrian refugee admissions.\nAccording to CNS News the previous record for Syrian refugee admissions was set in April with 451 admissions, followed by September 2015 with 389 admissions and March 2016 with 330.\nThe pace set in May could foreshadow months to come.\nWhile the State Department has cut down the resettlement time significantly — reportedly from nearly two years to just three months — the administration remains behind schedule to meet the 10,000 goal by September.\nSo far this fiscal year, 2,545 Syrian refugees have been resettled in the U.S. (just 21 of whom follow a religion other than Islam). If the administration wants to reach its goal, it will need to admit an average of some 1,800 Syrian refugees a month through September.\nThe move to accelerate the flow of Syrian refugees from Islamic terrorist hot spots comes despite multiple warnings from top security officials and Republicans that there are serious vulnerabilities in the vetting process for Syrian refugees.","url":"https://www.breitbart.com/immigration/2016/05/25/behind-schedule-syrian-refugee-admissions-dramatically-accelerate-804-less-month/"}
