{"authors":[],"date_download":"2018-10-30 01:22:43","date_modify":"2018-10-30 01:22:43","date_publish":"2016-07-18 01:00:19","description":null,"filename":"data/vaneerConsumption/BehindtheChosenOne.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/07/TrumpPenceIvanka.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862563.html","title":"Behind the Chosen One","title_page":"Behind the Chosen OneThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"It’s been a long week and maybe, just maybe, we’ve passed through the shadow of the valley of death. On Monday, which seems like two months ago, T told us that he was going with Mike Flynn as VP. Jesus, Mary and Joseph. Flynn’s a fine man with a good military record but, let’s be honest, he’s no Dwight Eisenhower. It was also clear from a one-hour whirligig with our policy guys that Flynn has no idea what he thinks about taxes, trade, gay marriage, abortion, energy independence, regulatory reform or various other subjects that just might pop up between now and November. A day and a half wasted. It took us 36 hours to squash that banana. T’s a stubborn guy. And maybe it’s a New York Military Academy thing, but he loves uniforms\nThen there were the finals with the Big Four — Christie, Newt, Pence, and Jeff Sessions. By Tuesday night it was clear that Sessions was included for sentimental reasons only. We owe him bigtime. He gave us the immigration issue. He gave us key staff. He gave us credibility in the Senate when the munchkins headed for the tall grass. But what can Sessions do for us now? Bukes, basically.\nBy Wednesday, the Big Three had become the Big Two against the Big One. Christie and Newt, the Big Two, crowded into a semi-final. If you want the pure-bred attack dog, which way would you go? Christie is fresher and blunter, Newt is smoother and sharper, but they both can be nasty pieces of business. A tough call. Turned out to be too tough. T went with solid and unifying — the Big One.\nT keeps saying that we need to be less predictable. Is that possible? Ten days ago, Pence would not have been even in the top five. And here he is today, a massive coronary from the Oval Office. How did it happen? Damned if I know. I just work here. But here are the arguments that survived one meeting to the next.\n• We have only two paths to victory. One is to win all of the swing states — Florida, Ohio, Virginia, Colorado, New Hampshire. Not even Melanie thinks we can do that and she still likes our chances in New York. The other way is to break through the blue wall by winning at least two and probably three of the lake states: Indiana, Pennsylvania, Michigan, Ohio, Wisconsin. If you’re looking for a solid Midwesterner — and Kasich won’t play, Snyder’s under water, and Walker’s candle got snuffed — who better than Mike Pence?\n• T’s family likes Mike and Karen and the Pence kids. I know, I know — what the kids think is never a factor in a political decision of this import. Even the chat with the spouse is usually no more than pro forma. In this case, however, as the lovely Ruth Bader Ginsburg would doubtless rule if she still had any marbles, we have set a precedent. The Trump kids, led by Jared and Ivana, made a real difference.\nWhy did that happen? I’m guessing here, but it may be, first, T is such an authentic outsider that he has no trusted political advisers. (T is still mixing up names of the campaign consultants. Paul lives in fear that T will refer to him on Hannity as “my campaign guy, Pete.”) And second, the kids in this case are not campaign props for touch-football-in-the-backyard photo ops. They are savvy and well-connected adults. T could do a lot worse, frankly.\n• Pence wanted the job and campaigned to get it. T’s a private-sector guy, a hierarchical guy. The aw-shucks DC game drives him bat-nuts: “Well I’d certainly hear him out. When my country needs me I find it hard to say no, but I love what I’m doing here for the people of Dansville.” Pence applied for the job and Trump hired him. It’s a deal, not a partnership.\nSo Pence is on board and ready to go. We administered the oath this morning. No, not the vice presidential oath. The Hippocratic oath.","url":"https://spectator.org/behind-the-chosen-one/"}
