{"authors":[],"date_download":"2018-10-23 02:08:48","date_modify":"2018-10-23 02:08:48","date_publish":"2016-01-11 13:56:28","description":"Beijing said Monday it did not need to notify Vietnam about flights to a disputed reef in the South China Sea, after Hanoi complained to a UN aviation body a...","filename":"data/vaneerConsumption/BeijingassertsrighttoflightstoSouthChinaSea.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z9qi-48qEJGFphM8d437f0aaf925a426e-394_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3393963_Beijing-asserts-right-flights-South-China-Sea_1540260528.html","title":"Beijing asserts right to flights to South China Sea","title_page":"Beijing asserts right to flights to South China Sea | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Beijing asserts right to flights to South China Sea\nBeijing said Monday it did not need to notify Vietnam about flights to a disputed reef in the South China Sea, after Hanoi complained to a UN aviation body about the controversial trips.\nVietnam accused Beijing of threatening regional safety by conducting \"unannounced\" flights through its airspace to a newly built runway on the Fiery Cross reef, which is claimed by both countries.\nChina has conducted several flights this year to the airstrip, one of several it has built on artificial islands is has constructed as its asserts its claim to nearly all of the disputed waterway.\nChina has been building artifical islands in disputed parts of the South China Sea, putting it at odds with regional neighbours the Philippines, Vietnam, Malaysia, Brunei and Taiwan, which also stake partial claims ©Department of Foreign Affairs (AFP/File)\nChina's foreign ministry said it had not been required to notify Vietnam, as the flights were \"state aviation activities\".\nThe trips \"are not bound by the Convention on International Civil Aviation and relevant regulations of the ICAO, are within sovereign states' independent hands to operate,\" spokesman Hong Lei told a regular briefing, referring to the UN body.\nHong added that in any case China's aviation administration had notified Vietnamese authorities of the flight, but \"received no response\".\nVietnam this year logged at least 46 incidents of Chinese planes flying without warning through airspace monitored by air traffic control in the southern metropolis Ho Chi Minh City, according to authorities cited by local media.\nState media also reported that Vietnam sent a protest letter about the flights to Beijing, as well as the United Nations' International Civil Aviation Organization (ICAO).\nBeijing began work in 2014 on a 3,000-metre (9,800-foot) runway on Fiery Cross reef in the disputed Spratly island group, around 1,000 kilometres (620 miles) from China's island province of Hainan.","url":"https://www.dailymail.co.uk/wires/afp/article-3393963/Beijing-asserts-right-flights-South-China-Sea.html"}
