{"authors":["Frances Martel"],"date_download":"2018-10-30 20:37:22","date_modify":"2018-10-30 20:37:22","date_publish":"2016-02-01 15:12:14","description":"The U.S. Navy has outraged the Chinese government once again by performing a legal \"freedom of navigation\" exercise in disputed South China Sea territory.","filename":"data/vaneerConsumption/BeijingCallsUSMissileDestroyerinSouthChinaSeaDangerousandIrresponsible.json","image_url":"https://media.breitbart.com/media/2016/02/USS-Curtis-Wilbur-in-South-China-Sea-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_02_01__1540931842.html","title":"Beijing Calls US Missile Destroyer in South China Sea 'Dangerous and Irresponsible'","title_page":"Beijing Calls US Missile Destroyer in South China Sea 'Dangerous and Irresponsible' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The U.S. Navy has outraged the Chinese government once again by performing a legal “freedom of navigation” exercise in disputed South China Sea territory, for which the Chinese Foreign Ministry accused America of seeking “maritime hegemony” in the region.\nThe USS Curtis Wilbur, a Navy missile destroyer, sailed within 12 miles of Triton Island in the Paracel Island chain on Saturday, beyond the limit of what China deems permissible for other nations. China claims most of the South China Sea, despite international law setting the parameters of Chinese sovereignty much more reservedly. To assert its sovereignty, Chinese officials have, for the past year, continued construction of artificial islands and, on top of them, military surveillance and civilian meteorological facilities in the region. China, Taiwan, and Vietnam all claim the Paracel Islands.\nThe Chinese government appeared particularly incensed that the United States sailed the missile destroyer through the Paracel Islands without first notifying Beijing. According to American officials, the passage was intended to “challenge excessive maritime claims of parties that claim the Paracel Islands.”\n“Its essence is to push the United States’ maritime hegemony in the name of freedom of navigation, which has always been resolutely opposed by most of the international community, especially certain developing nations,” Chinese Foreign Ministry spokesman Lu Kang said of the venture. “What the United States has done is dangerous and irresponsible.” The Ministry further alleged America had “severely violated Chinese law, sabotaged the peace, security and good order of the waters, and undermined the region’s peace and stability.”\nU.S. Defense Department spokesman Mark Wright told reporters that the freedom of navigation exercise is in line with America’s commitment to keeping the seas free. “The United States will fly, sail and operate anywhere international law allows,” Wright said, echoing almost verbatim the words of Defense Secretary Ashton Carter in October 2015. Then, the U.S. Navy sailed the USS Lassen ship within 12 nautical miles of the Spratly Archipelago, which China also claims. The Philippines and Taiwan also claim the Spratly Islands, and they have been the home to most of China’s illegal military development in the region.\nFollowing stern protests from the Chinese government, Defense Secretary Carter personally sailed through the region aboard the USS Theodore Roosevelt in November.\nIn addition to the significant artificial island construction in the region–which experts say has become an ecological disaster–Chinese ships have repeatedly attacked Vietnamese civilian fishermen who seek to exploit the resources of sovereign Vietnamese waters near the Paracel Islands.\nThe Vietnamese government has not objected to the presence of the USS Curtis Wilbur in the Paracel region. “Once again, Vietnam reiterates its indisputable sovereignty over Hoang Sa as well as Truong Sa [Spratly] archipelagoes,” Ministry of Foreign Affairs spokesperson Le Hai Binh said Sunday, adding that Vietnam “respects the right to innocent passage through its waters and proposes that other countries offer practical contributions to the preservation of peace and stability in the East Vietnam Sea.”\nBeijing, meanwhile, has once again accused the United States of violating international law. “Sending a warship to another country’s territorial waters without notice is hardly the right thing to do, regardless [of] protocols and codes,” a column in state-owned newspaper Xinhua protested on Sunday. “There is no logic that sending a warship to challenge China’s sovereignty and security will help … the situation, unless, peace and stability in the South China Sea is not the U.S. objective.” The Xinhua column goes as far as to claim China as the “de facto victim” in the South China Sea dispute.\nIn a separate article, Xinhua claims that the United States violated Chinese law, despite its presence in waters internationally recognized as outside of the scope of Beijing’s power. “According to China’s law on the territorial sea and contiguous zone enacted in 1992, foreign warships entering China’s territorial waters should obtain prior approval from the Chinese government,” states Xinhua.\nThe USS Curtis Wilbur’s presence in the Paracel Islands follows a demonstration of territorial sovereignty by Taiwanese President Ma Ying-jeou on Friday. Ma personally traveled to the Spratly Islands to assert Taiwan’s sovereignty over the region. The Chinese government interpreted this as acknowledgement that China owns the islands, as it does not respect Taiwan as a sovereign nation.\n“Many of his policies don’t live up to the expectations of the Chinese mainland, but his unwavering stance on the South China Sea regardless of Washington’s pressurizing is worth praise,” a column in the Chinese state-owned Global Times said of Ma’s trip.\nA representative of the United States in Taiwan described the visit as “extremely unhelpful” and said the United States government is “disappointed” in Ma.","url":"https://www.breitbart.com/national-security/2016/02/01/u-s-challenges-chinese-control-of-south-china-sea-again/"}
