{"authors":["Chris Pleasance For Mailonline"],"date_download":"2018-10-23 00:51:27","date_modify":"2018-10-23 00:51:27","date_publish":"2017-04-26 10:49:50","description":"Built in 1954, the Beira Grande Hotel in Mozambique was hailed as a jewel in Portugal's colonial crown, but never turned a profit and closed in 1963. Now it houses almost 3,000 refugees.","filename":"data/vaneerConsumption/BeiraGrandeHotelinAfricaisnowasquatforthousands.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9ED15300000578-0-image-a-68_1493199998520.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446794_Beira-Grande-Hotel-Africa-squat-thousands_1540255887.html","title":"Beira Grande Hotel in Africa is now a squat for thousands","title_page":"Beira Grande Hotel in Africa is now a squat for thousands | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"In its heyday, the Beira Grande Hotel was the most luxurious in Africa - kitted out with a helicopter pad, a bank, a post office, and decorated throughout with parquet flooring and opulent furnishings.\nNow, it has been reduced to a squat - the floors torn up to make fuel for fires to keep warm or cook, the furniture either burned or sold off for food, the plumbing and electrics also ripped out and flogged.\nThousands of people live within its hollow walls. Impoverished and with nowhere else to go, families rub shoulders with drug addicts and criminals. Disease and trash is everywhere.\nThis is all that is left of the Beira Grande Hotel, once the most opulent in Africa and held up as a jewel in Portugal's colonial crown when it was built in 1954. Now it is a slum for thousands of displaced families and refugees\nAt the peak of its grandeur, the Beira was filled with parquet flooring, luxurious furnishings and expensive wallpaper. That has all since been torn out and burned for fuel, or sold on the black market to afford food\nThe reception area (left), once used to greet the well-heeled businessmen who stayed there, is now used to dry laundry. Elsewhere, families and children exist alongside criminals and drug addicts\nWindows, furnishings, the floor and even hunks of concrete have been removed and sold by the desperate people living here, meaning the building could collapse at any moment\nPhotographer Eric Lafforgue, who captured these images, said the first thing you notice inside the hotel is the ever-present darkness. The power was switched off decades ago, and most of the wiring since ripped out\nThe hotel is estimated to house between 2,000 and 3,000 people - mostly refugees from the countryside who are not welcome in Beira society, and have nowhere else they can go\nDespite living in appalling conditions, Mr Lafforgue said there is a real sense of community among those forced to live here. They even have a 'secretary' who attempts to fix problems\nAt its most glorious, the hotel house a helipad, a bank, and a post office - effectively becoming its own town. But it never turned a profit, and closed a decade after opening\nMr Lafforgue said, for him, the ruin represents 'the folly of colonialism and the tragic legacy it left behind'\nFor a time the hotel was used as a military barracks, before being abandoned. The squatters moved in soon after\nMr Lafforgue said one of the most alarming sights he was confronted with was children playing on the roof, hundreds of feet in the air, with only rusting railings to stop them plunging to their deaths\nThe building has not only been torn apart by those living inside, but is also being brought down as nature moves back in. Trees and vines grip the outside, cracking the concrete with their roots\nRipping out windows, pipes, cables and even lumps of concrete to sell on the black market has left the building desperately unstable. It could collapse on those living there at any moment.\nBut despite the abhorrent conditions, photographer Eric Lafforgue found an element of community among those living there. They are poor, but poor together.\nNewcomers are always welcome and mutual respect is one of the few laws in this house of misery, he said.\nSpeaking about the hotel's past, he said: 'It was really the pinnacle of luxury, meant for wealthy businessmen and tourists. For its massive size, 120 rooms is really not much.\n'Turns out there was no demand so they shut it down in 1963. It never made a profit. After closing, the pool still remained open. The Mozambican Olympic Swimming Team trained there.\nBuilt in 1954 under Portuguese colonial rule and designed for wealthy businessmen, the hotel was never commercially successful, and shuttered in 1963 having never turned a profit\nThe hotel stood as a monument to colonial-era opulence, complete with swimming pools, a helipad, a bank, and a post office - virtually turning it into its own village\nThe swimming pool was once used by guests to relax around and take a dip in boiling temperatures. Now, it is used by those who live in the empty building to wash themselves and their clothes\n'Now it used by inhabitants for bathing or washing laundry. After the civil war, it became a refugee camp. The people who live there have mostly emigrated from the mine-filled countryside.\n'As of 2008, it housed 1,077 inhabitants with large families sharing one room. Now there are between 2,000 and 3,000 inhabitants about 350 families. They occupy not only the rooms but closets and even telephone booths laid on their side.\n'Some people have lived their entire lives there. It was built in an Art Deco style popular in Portugal since Mozambique was a Portuguese colony at the time.\n'Trees grow from the roof with their roots cracking the structure. Out of the anarchy a community and order emerges. They have a \"secretary\" whose job it is to resolve residents' problems.\n'The chief who guided us had an office in the abandoned restroom across from the building. A Muslim community group relocated many of the Muslim residents to new housing.\nMany of those living in the hotel were displaced by Mozambique's civil war, which lasted for 16 years and ended in 1992. For most of the children, this has been the only life they have ever known\nThe children here have virtually no access to education, or the outside world. The little they do acquire comes from a small TV in an outside shack, which shows only Chinese stations\nWhile the country's civil war is officially over, many believe a silent war is being carried out, away from prying eyes. This seems to be backed up by the numbers living in the hotel - which swelled from 1,000 in 2008 to almost 3,000 today\nWhile the hotel would be considered too dangerous to live in by most, the children who live here treat it as a playground, often playing on rooftops with no barriers, hundreds of feet off the ground\nDespite drugs, trash and disease being ubiquitous throughout the building, people here have managed to organise their own form of government. Chiefs who are responsible for looking after the residents have offices in an old toilet block\nThere are thought to be around 350 families living inside the building, occupying the old hotel rooms, along with closets and even telephone booths that have been tipped on their side\nA young child is photographed inside a corridor of the hotel. For him, and hundreds of other youngsters who live here, this is the only life they have even known\nAn economy of sorts has even developed inside the hotel to supply the residents. Food vendors dot the halls and there is an outdoor market, set up in an old courtyard\nDespite those living in the hotel forging a sense of community - sharing almost all aspects of their lives - Mr Lafforgue said another of the things they share is a determination to leave\nDespite the conditions that families here live in, they still share the concerns of many other parents. This graffiti reads: 'Smoking is harmful to health. Do not sell to minors under 18 years of age'\nThe spaces they left were not vacant for long. It is a self-sustaining community as the inhabitants, mostly refugees, are not welcome in Berias society.\n'There are vendors selling all sorts of food. In the canopy of trees above the outdoor market are thousands of giant spiders. In a makeshift room outside sit a few dozen teenagers and children, watching Chinese television on a small TV.\n'As we explored the roof, I was immediately concerned about the children playing on it. Two-year-old kids are learning to play tag a hundred feet high with no barrier preventing them from falling.\n'Walking through the Grande Hotel, you come face to face with the folly of colonialism and the tragic legacy it left behind. The grandeur and luxury has been left to rot into a nightmare. The hope of the independence era in Africa has long left this place.\n'Since there is no electricity, the darkness inside is overwhelming. Only the natural light coming through where windows used to be illuminates the hotel.\n'Clothes are hanging where the reception used to be. Drug addicts get high on the grand spiral staircase. You're only used to seeing emptiness and destruction like that in zombie movies. The one thing every resident shares is the desire to leave.'","url":"https://www.dailymail.co.uk/news/article-4446794/Beira-Grande-Hotel-Africa-squat-thousands.html"}
