{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:47:02","date_modify":"2018-10-22 23:47:02","date_publish":"2017-04-26 08:31:45","description":"The 19-year-old took to Snapchat on Tuesday to share footage from the beauty salon, where she was getting a rather painful - and graphic - waxing.","filename":"data/vaneerConsumption/BellaThornesharesvideofromherfirstbikiniwaxing.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/07/3F9CF58000000578-0-image-a-97_1493189803355.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446504_Bella-Thorne-shares-video-bikini-waxing_1540252022.html","title":"Bella Thorne shares video from her first bikini waxing","title_page":"Bella Thorne shares video from her first bikini waxing | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"There's a first time for everything.\nAnd Bella Thorne made sure to document a rite of passage as she shared images of her first bikini wax.\nThe 19-year-old took to Snapchat on Tuesday to share footage from the beauty salon, where she was getting a rather painful - and graphic - waxing.\nIn the video, Bella can be seen wearing a green fuzzy jacket, a black T-shirt - and not much else.\nOuch: Bella Thorne took to Snapchat to share footage of her first bikini waxing with fans on Tuesday\nHer back is to the camera and she is sitting on a white towel, which has been laid out on a massage table.\nIn her right hand are a pair of scissors, and she appears to be trimming her nether regions.\nAn aesthetician is later seen giving the Famous In Love actress a bikini waxing, as Bella cries out in pain.\nOnly a red scribbling - which the former Disney star later added - conceals Bella's private parts.\nCensored: Only a red scribbling - which the former Disney star later added - conceals Bella's private parts\nMaking the cut: In her right hand are a pair of scissors, and she appears to be trimming her nether regions\nGetting snippy: Bella was seen trimming the hair on her private lady parts before enduring a rather painful waxing\nAgony: An aesthetician is later seen giving the Famous In Love actress a bikini waxing, as Bella cries out in pain\nIt appeared to have been a day full of beauty treatments for the outrageous actress.\nShe also shared footage of herself getting her eyebrows waxed, as well as getting a somewhat more relaxing facial.\nBella is notorious for oversharing with her fans, and says she is regularly a target for trolls on social media as a result.\nBaring it all... The outrageous actress is notorious for oversharing with her fans, but makes no apologies for her behavior\nWax on, wax off... Bella didn't hesitate in sharing footage of her first bikini wax with the world via social media\nGoing all out... It appeared to have been a day full of beauty treatments for the Famous In Love actress\nMasking it: She also shared footage of herself getting her eyebrows waxed, as well as getting a somewhat more relaxing facial\n'It sucks, but there have been some times when I was getting so trashed that, yeah, it sucks scrolling through my Twitter feed,' she told Seventeen magazine this month.\nBut the Blended actress doesn't make any apologies, saying she's simply being herself.\n'I think that everybody knows my secret life is very public,' she added. 'I don't think that's ever in question.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446504/Bella-Thorne-shares-video-bikini-waxing.html"}
