{"authors":["Jennifer Pearson For Dailymail.Com"],"date_download":"2018-10-23 02:14:48","date_modify":"2018-10-23 02:14:48","date_publish":"2016-01-28 16:58:47","description":"The 19-year-old model just walked the runway for Chanel alongside her sister Gigi in Paris, France, and now this.","filename":"data/vaneerConsumption/BellaHadidwearsafeatheredblueandblacktopforthecoverofElleBrasil.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AC465200000578-0-image-a-18_1453999028755.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421273_Bella-Hadid-essence-ethereal-softly-feathered-blue-black-cover-Elle-Brasil_1540260888.html","title":"Bella Hadid wears a feathered blue and black top for the cover of Elle Brasil","title_page":"Bella Hadid wears a feathered blue and black top for the cover of Elle Brasil  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She just walked the runway for Chanel alongside her sister Gigi in Paris, France, and now this.\nIn the midst of her whirlwind travels, Bella Hadid took a moment to share her cover for the February 2016 issue of Elle Brasil.\nBella exudes youthful confidence and ethereal grace in the image which shows her wearing a low-cut feathery blue and black-edged top.\nScroll down for video\nEthereal: Bella Hadid took to Instagram to share a look at her February cover for Elle Brasil on Thursday that shows her in glowing form while clad in a feathery blue and black number\nThe 19-year-old daughter of Real Housewives Of Beverly Hills star Yolanda Foster is seen giving the lens a slant-eyed look with her hand at her mouth.\nHer hair is pulled back in a tight ponytail with the loose strands streaked with highlights and blunt-edged as they graze her bare shoulder.\nBella's make-up is understated with browns, beiges and ivory with a hint of rose.\nCouture cutie: The 19-year-old model walked the runway during the Chanel show as part of Paris Fashion Week on Tuesday\nStar trip: Bella looked chic and warmly outfitted in front of the George V Hotel in Paris on Tuesday\n'My new @ElleBrasil cover by the great @maxabadian 3 Loveliest team @FrankieFoye @Nina_Park @SusanaBarbosa @MarcellMaia Thank You,' Bella gushed alongside the social media share.\nThe fashion photographer echoed that sentiment as he posted the cover image along with his own message of gratitude.\n'My new #cover with the beautiful @bellahadid in @versace_official @donatella_versace for @ellebrasil,' Abadian wrote, adding: 'Thank you @luciano_schmitz @susanabarbosa @frankiefoye @nina_park @marcellmaia #bellahadid #bella #elle #fashionphotography #covershoot #nyc #model #shotbymaxabadian @sdmgmt'\nQuick turnaround: The daughter of Yolanda Foster beat a rapid trail as she left her Paris hotel for a photo shoot in London\nWhirlwind: Bella was seen arriving at Kings Cross St. Pancras Eurostar train station in London later on Tuesday ahead of her next assignment\nBella has had a hectic schedule of late, telling her Instagram followers that she had travelled across the channel to London immediately after her Paris show.\n'Just touched down in London for a few hours to shoot with two of my favorite humans,' the model wrote alongside a selfie with her team.\nBella was seen in transit, looking happy and fresh-faced as she left the Georges V hotel in Paris before arriving with a smile at the Kings Cross St. Pancras Eurostar train station in London later on Tuesday.\n'Struggle in silence': Bella's mom Yolanda Foster posted a picture of her daughter with an IV in her arm during treatment for Lyme disease\nThat same day, her mother Yolanda posted a photo on Instagram showing Bella receiving a treatment for Lyme disease with an IV line in her arm while they both reclined in bed.\n(Yolanda, who has documented her debilitating battle against Lyme disease on social media, revealed last year that both her daughter Bella and son Anwar were also suffering from the disease.)\n'Watching my brave babies stuffer in silence in order to support me in my journey has struck the deepest core of hopelessness inside of me,' Yolanda wrote in the caption.\nYolanda also sent a loving congrats to both Bella and Gigi, 20, who both walked the Chanel runway on Tuesday during Haute Couture Fashion Week in Paris.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421273/Bella-Hadid-essence-ethereal-softly-feathered-blue-black-cover-Elle-Brasil.html"}
