{"authors":["Jj Nattrass For Mailonline"],"date_download":"2018-10-23 01:12:32","date_modify":"2018-10-23 01:12:32","date_publish":"2016-01-11 11:47:36","description":"Heading to both the Instyle and HBO bashes, the 45-year-old actress flashed more than a hint of flesh thanks to her figure-flaunting, cutaway panel dress.","filename":"data/vaneerConsumption/BellamyYoungshowscleavageinacutoutgownatGoldenGlobes2016afterparties.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/3007C14700000578-0-image-a-92_1452512767109.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393707_Bellamy-Young-shows-curves-racy-figure-flaunting-black-dress-party-hops-Golden-Globes_1540257152.html","title":"Bellamy Young shows cleavage in a cut-out gown at Golden Globes 2016 afterparties","title_page":"Bellamy Young shows cleavage in a cut-out gown at Golden Globes 2016 afterparties  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She cuts a rather reserved figure on-screen as First Lady, Mellanie Grant, in ABC's Scandal.\nBut Bellamy Young's own fashion tastes are clearly world's apart from her character, as she showed at the Golden Globes afterparties on Sunday night, in Los Angeles.\nHeading to both the Instyle and HBO bashes, the 45-year-old actress flashed more than a hint of flesh thanks to her figure-flaunting, cutaway panel dress.\nScroll down for video\nRed carpet sizzle: Scandal star Bellamy Young sizzled sartorially at the Golden Globes afterparties on Sunday night, in Los Angeles, in a figure-flaunting, cutaway panel dress\nTreading the red carpet on her own, the Mission Impossible III star pulled out all the stops, as she showed off her racy sartorial streak.\nSlipping into the floor-length black number, the brunette beauty showed off her curvaceous figure and assets to the max.\nFeaturing a strappy top-section, which was further reduced by a cutaway keyhole panel, Bellamy flashed more than a hint of her cleavage.\nFlesh-flashing fashion: Heading to both the Instyle and HBO bashes, the Mission Impossible III star pulled out all the stops, as she slipped into the floor-length black number\nWhile the garment's figure-hugging lower section allowed the former Criminal Minds star to showcase her toned legs.\nShe rounded off her ensemble with a pair of understated towering stiletto heels, which served to further highlight her figure.\nBellamy carefully accessorised her look in a spartan yet stylish manner, adding dangling diamond earrings and some simple silver bangles to the equation, while she also carried a silver mirrored box clutch.\nhighlighting her assets: Featuring a strappy top-section, which was further reduced by a cutaway keyhole panel, Bellamy flashed more than a hint of her cleavage\nLegs on display: While the garment's figure-hugging lower section combined with her towering stiletto heels allowed the former Criminal Minds star to showcase her toned legs\nWearing her brown locks scraped back off of her face in a slick ponytail, the star accentuated and highlighted her pretty face.\nOpting for a minimal palette of make-up, she applied a liberal dose of black eyeliner and flash of red lipstick to shape her features.\nAnd while she stepped out at the InStyle party on her own, she was joined by her Scandal co-star, Tony Goldwyn, at the HBO bash.\nThe 55-year-old actor, who plays her on-screen husband President Fitzgerald Grant, looked dapper in a classic black two-piece suit, which he teamed with a shirt and black tie.\nThe pair have both starred in the ABC series, a political thriller set in the heart of Washington D.C., since 2012.\nThe drama has only received one Golden Globe nomination in its time, when in 2014 Kerry Washington was put up for Best Performance by an Actress in a Television Series - Drama.\nBrunette beauty: Wearing her brown locks scraped back off of her face in a slick ponytail, the star accentuated and highlighted her pretty face - which she subtly defined with a flash of lipstick and eyeliner\nCharming co-star: And while she stepped out at the InStyle party on her own, she was joined by her Scandal co-star, Tony Goldwyn, at the HBO bash","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393707/Bellamy-Young-shows-curves-racy-figure-flaunting-black-dress-party-hops-Golden-Globes.html"}
