{"authors":["Rebecca Lawrence For Mailonline"],"date_download":"2018-10-22 20:31:28","date_modify":"2018-10-22 20:31:28","date_publish":"2016-01-29 02:01:23","description":"She turns heads wherever she go. And Bella Hadid ensured all eyes would be on her at the De Grisogono jewellrey party at Rue de La Boetie in Paris on Thursday, flashing her toned abs.","filename":"data/vaneerConsumption/BellaHadidflasheshertonedabsatDeGrisogonojewellerypartyinParis.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/30AE568D00000578-0-image-a-115_1454031022750.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422042_Bella-Hadid-flashes-enviably-toned-abs-shredded-black-dress-puts-chic-display-Parisian-jewellery-party_1540240288.html","title":"Bella Hadid flashes her toned abs at De Grisogono jewellery party in Paris","title_page":"Bella Hadid flashes her toned abs at De Grisogono jewellery party in Paris | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She turns heads wherever she goes.\nAnd Bella Hadid ensured all eyes would be on her at the De Grisogono jewellery party at Rue de La Boetie in Paris on Thursday, flashing the flesh in a cutaway dress.\nHinting at her enviably toned abs beneath the shredded material, the 19-year-old managed to put a sultry spin on her ensemble whilst still remaining demure.\nScroll down for video\nOu la la! Bella Hadid ensured all eyes would be on her at the De Grisogono jewellery party at Rue de La Boetie in Paris on Thursday, flashing the flesh in a cut away dress\nSlipping into a slinky black midi dress, her hourglass figure was perfectly flattered by the gown.\nWith a halter top containing her ample assets, and the pencil skirt hem clinging to her pert posterior, every inch of her gym-honed body was on display.\nAdding to her modelesque height, she donned a pair of barely there black heels that perfectly complemented her dress.\nClaws out! Hinting at her enviably toned abs beneath the shredded material, the 19-year-old managed to put a sultry spin on her ensemble whilst still remaining demure\nTangerine dream! Slicking her hair back into a chic chignon bun, the model - who is the youngest sister of Gigi Hadid - ensured her pretty face was on full display, donning a heavy coverage of dewy foundation\nSlicking her hair back into a chic chignon bun, the model - who is the youngest sister of Gigi Hadid - ensured her pretty face was on full display.\nDonning a heavy coverage of dewy foundation and a sweep of bronzer to define her cheekbones, the star dazzled at the event.\nWith a slick of tangerine hued gloss accentuating her plump pout, she also wore a subtle sweep of bronze shadow which brought out the flecks of blue and green in her eyes.\nAdding to the glamour of her ensemble, she donned two large silver rings that glittered under the bright lights of the venue.\nBling ring: A halter top containing her ample assets, whilst she added to the glamour of her ensemble with two large silver rings that glittered under the bright lights of the venue\nFamous friends: Pouring her curves into the slinky black midi dress, her hourglass figure was perfectly flattered by the gown as she posed with Grisogono founder Fawaz Gruosi\nOnce inside, Bella rubbed shoulders with Irina Shayk, who also cut an elegant figure in all-black.\nDonning thigh high boots with a polo neck dress, the 30-year-old dazzled on the red carpet.\nAdding some glitz to her ensemble, she donned large sparkling earrings as she got into the spirit of the jewellery event.\nBack to black! Once inside, Bella rubbed shoulders with Irina Shayk, who also cut an elegant figure in black\nFigure-hugging: Concealing her enviable curves in a polo neck dress, the 30-year-old dazzled at the event\nEar-bling! Adding some glitz to her ensemble, she donned large sparkling earrings as she got into the spirit of the jewellery event\nMeanwhile, Bella seemed to be healthy and in good spirits, following her mother Yolanda Foster's Instagram post.\nIn a throwback photograph to 2015, the Real Housewives of Beverly Hills star shared a picture of her daughter in bed, attached to a drip as a result of her Lyme disease.\nIn the heartfelt caption she wrote: '2015-Watching my brave babies suffer in silence in order to support me in my journey has struck the deepest core of hopelessness inside of me, it is because of them that I continue to fight relentlessly.......\n'I will not allow them to live a life of pain and suffering……. I will prevail and walk to the end of the earth to find a cure for them and millions of others debilitated by this invisible disease!!!!\n'We all deserve to live a healthy life, don't you think?'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422042/Bella-Hadid-flashes-enviably-toned-abs-shredded-black-dress-puts-chic-display-Parisian-jewellery-party.html"}
