{"authors":["Jason Chester For Mailonline"],"date_download":"2018-10-23 02:41:11","date_modify":"2018-10-23 02:41:11","date_publish":"2017-03-10 11:57:14","description":"Embracing her leisure time after gracing the catwalks of New York, London, Paris and Milan, the supermodel, 20, looked typically stylish in a cropped Ramones T-shirt and skinny jeans.","filename":"data/vaneerConsumption/BellaHadidsportsTshirtandquirkyhatstepsoutinNY.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E2295D600000578-0-image-a-66_1489146539455.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300936_Bella-Hadid-sports-casual-cropped-T-shirt-quirky-hat_1540262471.html","title":"Bella Hadid sports T-shirt and quirky hat steps out in NY","title_page":"Bella Hadid sports T-shirt and quirky hat steps out in NY | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"With the dust slowly settling on a busy month of runway shows it was a relaxed Bella Hadid who stepped out in Manhattan on Thursday night.\nEmbracing her leisure time after gracing the catwalks of New York, London, Paris and Milan, the supermodel, 20, looked typically stylish in a cropped Ramones T-shirt from Cotton On and skinny jeans.\nScuffed Doctor Marten shoes gave the look a casual flourish, while a sweeping check winter coat kept her warm on a chilly night in the Big Apple.\nScroll down for video\nDown time: With the dust slowly settling on a busy month of runway shows it was a relaxed Bella Hadid who stepped out in Manhattan on Thursday evening\nRounding things off with a jaunty leather cap, Bella proved to be an engaging sight as she made her way onto the sidewalk after climbing from the rear of a car.\nAccessorising tastefully, the younger sister of fellow model Gigi clutched a pair of yellow tinted sunglasses in her right hand.\nBella's latest outing comes following a jet-setting month of couture shows on behalf of biannual fashion week.\nLooking good: Embracing her leisure time after gracing the catwalks of New York, London, Paris and Milan, the supermodel, 20, looked typically stylish in a cropped Ramones T-shirt from Cotton On and skinny jeans\nWhile her catwalk displays were largely consummate the model suffered a spill on the runway at the H&M Paris Fashion Week show - with the embarrassment deepened by the presence of her ex-boyfriend, The Weeknd, who was performing.\nBella was undoubtedly thrown off course by her former love, despite having come face to face with him at the Victoria's Secret show in November at which she also had to deal with another runway showdown with the singer.\nThe brunette heavily documented her jet-set lifestyle on her social media pages, sharing glamorous pre-catwalk preparations as well as her well-earned fast food breaks after the shows.\nAwkward: Bella recently suffered a spill on the runway at the H&M Paris Fashion Week show - with the embarrassment deepened by the presence of her ex-boyfriend, The Weeknd, who was performing\nMore recently Bella used her Instagram account to showcase a ranged of new designs from good friend and fashion designer Alexandre Vauthier's Fall 2017 collection.\nThe supermodel showcased her to-die-for figure in sultry backless gowns and body-hugging mini dresses for her 11.2 million followers.\nBella wore a number of outfits that highlighted her endless legs and long torso including a strapless tight leather dress, embellished with a sequined design around her waist and a draped bow on one shoulder.\nBehind the scenes: The brunette heavily documents her jet-set lifestyle on her social media pages, sharing glamorous pre-catwalk preparations as well as her fast food breaks after the shows\nLegs for days! Bella shared a series of snaps to Instagram on Thursday posing for Alexandre Vauthier's Fall 2017 collection","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300936/Bella-Hadid-sports-casual-cropped-T-shirt-quirky-hat.html"}
