{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:08:56","date_modify":"2018-10-22 23:08:56","date_publish":"2017-03-10 02:01:43","description":"Bella wore a number of outfits that highlighted her endless legs and long torso including a strapless tight leather dress, embellished with a sequined design around her waist.","filename":"data/vaneerConsumption/BellaHadidposesforAlexandreVauthieronInstagram.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/01/3E1F434A00000578-0-image-a-61_1489109861889.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299594_Bella-Hadid-shows-flawless-figure-Instagram_1540249736.html","title":"Bella Hadid poses for Alexandre Vauthier on Instagram","title_page":"Bella Hadid poses for Alexandre Vauthier on Instagram | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's been hitting the Parisian streets lately with eye-catching outfits during Fashion Week.\nAnd Bella Hadid continued the trend via Instagram on Thursday posing for her good friend and fashion designer Alexandre Vauthier's Fall 2017 collection.\nThe 20-year-old supermodel showcased her to-die-for figure in sultry backless gowns and body-hugging mini dresses for her 11.2 million followers.\nScroll down for video\nLegs for days! Bella Hadid shared a series of snaps to Instagram on Thursday posing for Alexandre Vauthier's Fall 2017 collection\nBella wore a number of outfits that highlighted her endless legs and long torso including a strapless tight leather dress, embellished with a sequined design around her waist and a draped bow on one shoulder.\nIn another look, the younger sister of Gigi Hadid oozed glamour in a backless navy blue gown that featured a thigh-high slit one one side, exposing her long limbs.\nShe had her dark tresses tied back in a wet ponytail as she went with a dramatic make-up look for all the shots.\nBlack-and-white vision: The 20-year-old model showed off her enviable figure in a backless gown that featured a thigh-high slit in one shot\nFierce: Embellished waist and strong patterns seemed to be the theme as she wowed in a corset strapless dress that featured a bold red waist decor\nSheer delight! The younger sister of Gigi Hadid cut a svelte figure in this sheer, polka-dotted patterned dress that featured a low neckline\nThe French haute couture fashion designer has dressed a number of A-list celebrities as well including Diane Kruger, Janelle Monae's Oscar red carpet look and Hailey Baldwin.\nMeanwhile, earlier in the week, Bella suffered a spill on the runway at the H&M Paris Fashion Week show - with the embarrassment deepened by the presence of her ex-boyfriend, The Weeknd, who was performing.\nThe stunner was undoubtedly thrown off course by her former love, despite having come face to face with him at the Victoria's Secret show in November at which she also had to deal with another runway showdown with the singer.\nClassy: Bella has been killing the fashion game as of late parading around Paris in high-end fashion pieces\nHot couture! The IMG model styled her dark tresses in a low, slick-back ponytail as she went with dramatic make-up\nBold and beautiful: The catwalk queen also posed in a dramatic red gown with intense fabric\nThe Weeknd, who has since moved on with Selena Gomez, was in attendance to serenade the fashion crowd with a rendition of new single Nothing Without You to close the presentation.\nBella has had a hectic few weeks jetting all round the world for various fashion weeks.\nShe has walked for the likes of Versace, Moschino and Anna Sui.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299594/Bella-Hadid-shows-flawless-figure-Instagram.html"}
