{"authors":["Kristie Rohwedder"],"date_download":"2018-10-30 23:47:26","date_modify":"2018-10-30 23:47:26","date_publish":"2014-08-13 07:47:45","description":"At last, Captain Lee and the Ohana crew pulled up the anchors and started the second season voyage, and you bet I have my sunscreen and lifejacket on. Let's do this, Below Deck Season 2. At the top of Monday night's premiere, Season 1 returning crew…","filename":"data/vaneerConsumption/BelowDeckAndrewForgetstoShutYourPortholeItGoesAboutAsWellAsOneWouldExpect.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/1eb3a1e0-12f6-4ce9-b0d2-5f096a06b896.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35558-below-deck-andrew-forgets-to-shut-your-porthole-it-goes-about-as-well-as-one_1540943246.html","title":"'Below Deck': Andrew Forgets to \"Shut Your Porthole\" & It Goes About As Well As One Would Expect","title_page":"'Below Deck': Andrew Forgets to \"Shut Your Porthole\" & It Goes About As Well As One Would Expect","title_rss":"NULL","source_domain":"bustle.com","text":"At last, Captain Lee and the Ohana crew pulled up the anchors and started the second season voyage, and you bet I have my sunscreen and lifejacket on. Let's do this, Below Deck Season 2. At the top of Monday night's premiere, Season 1 returning crew members Kat, Eddie, and Ben met newcomers Kate, Amy, Kelley, Jennice, and Andrew. Later, they would meet another noteworthy character: primary charter guest Georgia. Ben would learn that primary charter guest Georgia was not kidding about her love of all things chicken and fried. Amy would learn that primary charter guest Georgia only goes \"NUMBER TWO! NUMBER TWO!\" once a year. Someone give primary charter guest Georgia her own TV show.\nUh, back up. Who is Andrew? Did I miss part of the episode or something? I don't recall anyone named Andr— Oh, WAIT A SECOND. Is that the guy who looks like a blonde version of Jonah from VEEP? Aha. Okay. \"Blonde Jonah\" is Andrew. Got it. From the first moment I saw him, he was \"Blonde Jonah\" in my brain. When the other members of the crew said \"Andrew,\" I heard \"Blonde Jonah.\" Every note I took was \"Blonde Jonah called himself 'the X factor,'\" \"Blonde Jonah found those bottled water instructions really overwhelming,\" and so on. I will adjust my brain accordingly.\nWhat are we going to do with, Blonde Jonah, er, Andrew? That dude is a goddamned typhoon of a human. Why does he seem confused and/or put off by every single job duty? Does he actually want to be a deckhand? Are we sure he's done this before?\nHe's probably my favorite person on the show.\nA few Blonde Jonah highlights: He doesn’t know how to grocery shop (his mom does all of the shopping), won primary charter guest Georgia's heart, ignored his earpiece on the regular, and showcased a subpar work ethic.\nBut the porthole de résistance was presented to the humble viewing audience at the end of the episode. Andrew left a porthole open in the lower-level bathroom adjacent to his and Eddie's (I think that's who he's sharing a room with. Don't hold me to that) bunks. Because yachts do not hover above water, but actually sit in water (try not to be too impressed with all of this boat knowledge I'm dropping), water splashed into the open porthole as soon as the yacht kicked things into go-mode. The salt water drenched the bathroom and seeped into the carpet in the adjacent bunk room.\nCaptain Lee was PISSED OFF. Oh, Andrew.\nAndrew said there should be a reminder next to the portholes. You know, in case he's overcome by a sudden urge to unlatch one of those circular windows again. One would think looking out the porthole and seeing the ocean would be enough of a reminder, but who am I to say?\nI can't decide if this guy is hamming it up for the cameras, if he is actually this messy, or if he is flat-out lying about being a deckhand/having been on a yacht before. I'm pulling for the third option. It'd be really fun to have a Catch Me If You Can-esque plot this season.\nIn the final scene of the episode, Andrew got lost on the yacht while retrieving the Shop Vac.\n\"You’re starting to scare me, Andrew,” Captain Lee said over the headset.“I’m scared, too,” Andrew responded.\nDon't be scared, Andrew. If this deckhand career path fails, you can always run away with primary charter guest Georgia. You two could feast on fried shrimp and live happily every after. DON'T BE SCARED, ANDREW.\nImages: Bravo; veephbo/tumblr","url":"https://www.bustle.com/articles/35558-below-deck-andrew-forgets-to-shut-your-porthole-it-goes-about-as-well-as-one"}
