{"authors":["Rachael Levy"],"date_download":"2018-10-30 22:00:58","date_modify":"2018-10-30 22:00:58","date_publish":"2016-12-16 00:00:00","description":"Ben Axler's Spruce Point Capital is betting against Ultimate Software.","filename":"data/vaneerConsumption/BenAxlersSprucePointshortsULTIUltimateSoftware.json","image_url":"https://amp.businessinsider.com/images/585426e3a1a45e60398b60b1-750-375.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ben-axlers-spruce-point-ulti-ultimate-software-short-2016-12_1540936858.html","title":"Ben Axler's Spruce Point shorts ULTI Ultimate Software","title_page":"    Ben Axler's Spruce Point shorts ULTI Ultimate Software - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Ben Axler. Spruce Point Capital A small short-seller that says its reports have led to the resignations of several CEOs has a new big short.\nBen Axler's Spruce Point Capital Management, a stock-focused hedge fund, has released a new report on Ultimate Software, a tech company that provides cloud-based human resources software. Short-sellers bet that a company's stock will go down.\nAmong Spruce Point's reasons for betting against the company: Ultimate Software is \"in denial about changes in its competitive landscape\" and has the \"worst governance\" Spruce Point has ever seen, according to a presentation sent to Business Insider.\nAxler has been managing his own money for the past few years, but in August he started trading with outside money.\nA person familiar with the fund declined to provide exact performance figures but said the fund is up since August.\nThe New York-based firm, which has about $25 million under management, is a tiny player in the world of activist hedge funds. By comparison, as of midyear, Bill Ackman's Pershing Square Capital managed about $11.5 billion, and Jeff Ubben's ValueAct Capital managed about $16.2 billion, according to the Hedge Fund Intelligence Billion Dollar Club ranking.\nStill, the firm has drawn attention for its short bets. SumZero, a website for buy-side investors, previously ranked Spruce Point the No. 1 short-seller on its platform.\nMarkets Insider Spruce Point has previously released reports on several companies, including Greif, Caesarstone, and the Intertain Group. Spruce Point says its reports helped prompt the resignations of those firms' CEOs.\nGreif CEO David Fischer resigned in October 2015, Caesarstone CEO Yos Shiran resigned in May, and Intertain CEO John Fitzgerald resigned in June.\nSpruce Point has also targeted stocks that have subsequently dropped in value. Greif, for instance, dropped last year after Spruce Point posted its report in February 2015 (though the stock has since rallied). Caesarstone is down from its 2015 highs, as is Intertain.\nYou can view a sampling of the firm's 314-page presentation on its new short below.","url":"https://www.businessinsider.com/ben-axlers-spruce-point-ulti-ultimate-software-short-2016-12"}
