{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 18:57:37","date_modify":"2018-10-30 18:57:37","date_publish":"2017-01-27 18:58:04","description":"The pricey Prohibition-era gangster flick reportedly grossed just $16.5 million at the global box office since its release on Jan. 13.","filename":"data/vaneerConsumption/BenAfflecksLiveByNighta75MBombforWarnerBros.json","image_url":"https://media.breitbart.com/media/2017/01/BenAffleckLiveByNight.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2017_01_27__1540925857.html","title":"Ben Affleck's 'Live By Night' a $75M Bomb for Warner Bros","title_page":"Report: Ben Affleck's 'Live By Night' a $75M Bomb for Warner Bros","title_rss":"NULL","source_domain":"breitbart.com","text":"Warner Bros. is expected to take a $75 million bath on Ben Affleck’s pricey gangster drama Live By Night, according to a report.\nSources close to the film and rival studio executives told Variety that the film — a passion project for Affleck, who wrote, produced, starred in and directed —was shaping up to be a bona fide box office bomb for Warners after bad reviews and poor box office crippled the film’s financial prospects.\nAccording to Box Office Mojo, the film has grossed a paltry $10 million in the United States and another $6.5 million in international receipts since its wide release on January 13, a disappointing result for a film that reportedly cost $65 million to produce, not counting the studio’s marketing and distribution costs.\nThe film couldn’t crack the Top 10 in its opening weekend, opening to just $5.1 million from 2,822 theaters for a per-theater average of $1,809.\nLive By Night — based on the novel of the same name by Dennis Lehane — stars Affleck as Prohibition-era gangster Joe Coughlin, who spars with bootleggers and Ku Klux Klan members in 1920s Florida. The film also stars Elle Fanning, Sienna Miller, Brendan Gleeson, Chris Messina, Zoe Saldana and Chris Cooper.\nVariety reports that Warner Bros. is shielded from some part of its financial liability on the film through its partnership with RatPac-Dune Entertainment.\nLive By Night was Affleck’s directorial follow-up to his 2012 smash hit Argo, which won the Best Picture Oscar.\nThe actor-director is next set to helm a standalone Batman film, tentatively titled The Batman. Affleck played the character in Warner Bros. Batman vs. Superman: Dawn of Justice and will reprise the role in this year’s Justice League.\nFollow Daniel Nussbaum on Twitter: @dznussbaum","url":"https://www.breitbart.com/entertainment/2017/01/27/report-ben-afflecks-live-night-75-million-bomb-warner-bros/"}
