{"authors":["Kadeen Griffiths"],"date_download":"2018-10-30 23:44:29","date_modify":"2018-10-30 23:44:29","date_publish":"2014-08-13 12:24:10","description":"Good Will Hunting was not only one of the best movies of Matt Damon and Ben Affleck's careers, but one of the best movies of Robin Williams' career as well. That's why one of the first fan memorials to Williams cropped up at the Good Will Hunting…","filename":"data/vaneerConsumption/BenAffleckMattDamonsStatementsAboutRobinWilliamsGiveGoodWillHuntingEvenMoreCulturalResonance.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/20adac03-7d96-4aa3-bc64-4c48676c578e.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35568-ben-affleck-matt-damons-statements-about-robin-williams-give-good-will-hunting-even-more-cultural_1540943069.html","title":"Ben Affleck & Matt Damon's Statements About Robin Williams Give 'Good Will Hunting' Even More Cultural Resonance","title_page":"Ben Affleck & Matt Damon's Statements About Robin Williams Give 'Good Will Hunting' Even More Cultural Resonance","title_rss":"NULL","source_domain":"bustle.com","text":"Good Will Hunting was not only one of the best movies of Matt Damon and Ben Affleck's careers, but one of the best movies of Robin Williams' career as well. That's why one of the first fan memorials to Williams cropped up at the Good Will Hunting bench made famous by that scene from the movie; even now, 17 years later, the film still resonates strongly with its audience. The tragic death of Robin Williams will make watching the dramatic film even more painful than it already is, but that feeling will only intensify after the statements released by Affleck and Damon about their former costar. After all, for all the joy that Williams brought into the lives of his fans, it can be easy to forget that he also changed the lives of his famous friends as well.\nDamon released his statement exclusively to the Huffington Post Tuesday night, and in it he expressed the same views of many of Williams' friends and loved ones who are still finding it very hard to believe that such an icon is truly gone. \"Robin brought so much joy into my life, and I will carry that joy with me forever,\" said Damon in his statement. \"He was such a beautiful man. I was lucky to know him and I will never, ever forget him. I truly hope the people in the media can find it within themselves to give his family some privacy during this horrible time.”\nKevork Djansezian/Getty Images Entertainment/Getty Images\nHowever, it was Affleck's statement, which he made via his Facebook page early Tuesday afternoon, that really hits home for Good Will Hunting fans in particular. \"Heartbroken. Thanks chief - for your friendship and for what you gave the world,\" said Affleck. \"Robin had a ton of love in him. He personally did so much for so many people. He made Matt and my dreams come true. What do you owe a guy who does that? Everything. May you find peace my friend.\"\nWhile Good Will Hunting wasn't the first film role for Damon or for Affleck, it was the movie that marked their breakthrough to become national stars. They wrote the screenplay during the early 1990s, but it wasn't until 1997 that it finally made it to theaters and went on to earn them an Academy Award for Best Original Screenplay while Williams went home with an award for Best Supporting Actor. At the time, Williams was one of the biggest names attached to the film, so it really does feel like signing on to the project contributed to making the film such a huge success by ensuring people actually went out to see it.\nMiramax Films\nFor Affleck to acknowledge that Williams \"made Matt and my dreams come true\" really resonates because it's impossible at this point to imagine what Affleck and Damon's careers would have been like without the widespread recognition that Good Will Hunting earned them, not only as actors but as screenwriters. Imagine, for a moment, if Good Will Hunting had flopped; where would Affleck and Damon be now? If you, like me, can't imagine it, then Damon and Affleck's statements become all the more poignant for giving credit where credit is due and acknowledging Williams as the sun that allowed them to shine.\nGood Will Hunting is not a happy movie and it was pretty hard to get through without reaching for the Kleenex to begin with. Now we have two more reasons for this movie to truly tug at our heart strings — the passing of a great actor and comedian like Robin Williams and the heartwarming gratitude of the two men he helped make into stars.","url":"https://www.bustle.com/articles/35568-ben-affleck-matt-damons-statements-about-robin-williams-give-good-will-hunting-even-more-cultural"}
