{"authors":["Breitbart News"],"date_download":"2018-10-30 21:12:17","date_modify":"2018-10-30 21:12:17","date_publish":"2014-05-06 23:38:00","description":"Ben Bernanke, the former chairman of the Federal Reserve Board, has a book deal worth at least $1 million, The Associated Press has learned.","filename":"data/vaneerConsumption/BenBernankeInksBookDealWorthatLeast1Million.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Government/2014/05/06/0ab32baac2b46d11530f6a706700aaacjpg.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_05_06__1540933937.html","title":"Ben Bernanke Inks Book Deal Worth at Least $1 Million","title_page":"Ben Bernanke Inks Book Deal Worth at Least $1 Million | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"NEW YORK (AP) — Ben Bernanke, the former chairman of the Federal Reserve Board, has a book deal worth at least $1 million, The Associated Press has learned.\nBernanke’s agreement is with publisher W.W. Norton & Co. for a book that will cover his years at the Fed and his response to the economic crisis. Norton told the AP on Tuesday that the book, currently untitled, is scheduled for 2015.\nNeither Norton nor Bernanke’s literary representative, Washington attorney Robert Barnett, would comment on financial details. But two publishing officials with knowledge of the negotiations said bidding had reached seven figures. The officials were not authorized to discuss the deal and asked not to be identified.\nBarnett previously brokered a seven-figure deal for Bernanke’s predecessor at the Fed, Alan Greenspan.\nBernanke, 60, served on the Fed from 2002 until this year. He was appointed to two four-year terms as chairman, starting in 2006, and was succeeded by Janet Yellen.\nNorton president and chairman W. Drake McFeely said Bernanke, as Fed chairman and a leading economic historian, “has had an unequaled perspective on the American economy since 2006.”\n“For the first time, he will be recounting his experience in the troubling days of 2007 and 2008 as the world banking system seemed close to collapse, and then how, with an increasingly dysfunctional Congress preventing any significant fiscal policy options, it fell mainly to the Federal Reserve and to the Fed’s monetary policy to fight and remedy the biggest economic downturn since the Great Depression,” McFeely said in a statement.\nIn a proposal submitted to publishers, Bernanke said that his book would “be both personal and frank” and outline “the roles played by leading personalities” during the financial crisis, “from Congress to the media to Wall Street,” according to excerpts shared by Norton.\nBernanke was criticized by major political parties while at the Fed, with liberals believing he could have done more to fight unemployment and conservatives alleging he worried too little about inflation. At Norton, an employee-owned publisher with a long history of releasing books by authors from the left, his fellow writers will include two of the world’s most prominent liberal economists, Nobel Prize winners Paul Krugman and Joseph Stiglitz.\nNorton also publishes Michael Lewis, who has written a handful of best-sellers critical of Wall Street, most recently “Flash Boys.”","url":"https://www.breitbart.com/politics/2014/05/06/apnewsbreak-deal-for-bernanke-book-at-least-1m/"}
