{"authors":["Brakkton Booker"],"date_download":"2018-10-23 01:07:14","date_modify":"2018-10-23 01:07:14","date_publish":"2018-08-13 00:00:00","description":"The HUD secretary is moving to overhaul an Obama-era rule intended to strengthen the 1968 Fair Housing Act and combat housing segregation. It \"impeded development ... of affordable housing,\" he says.","filename":"data/vaneerConsumption/BenCarsonMovesForwardWithPushToChangeFairHousingRule.json","image_url":"https://media.npr.org/assets/img/2018/08/13/ben-carsonaffh_wide-2f9e61af45e2376ffa9939c17e6bb3227bf75201.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_08_13_638285344_ben-carson-moves-forward-with-push-to-change-fair-housing-rule_1540256834.html","title":"Ben Carson Moves Forward With Push To Change Fair Housing Rule","title_page":"Ben Carson Moves Forward With Push To Change Fair Housing Rule : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Ben Carson Moves Forward With Push To Change Fair Housing Rule\nEnlarge this image toggle caption Carlos Osorio/AP Carlos Osorio/AP\nBen Carson, the secretary of Housing and Urban Development, proposed on Monday new changes to an Obama-era rule aimed at combating segregation in housing policy.\nCarson wants the rule to focus more on reducing the regulatory burdens of local jurisdictions and on giving them more control, while encouraging actions that bolster housing choice and increase housing supply.\nIn a statement, Carson said the Affirmatively Furthering Fair Housing (AFFH) rule, enacted during the previous administration, \"often dictated unworkable requirements\" adding that the rule was also \"suffocating investment in some of our most distressed neighborhoods.\"\n\"We do not have to abandon communities in need. Instead we believe we can craft a new, fairer rule that creates choices for quality housing across all communities,\" Carson said.\nThe 2015 AFFH rule was implemented to strengthen the landmark 1968 Fair Housing Act. The rule, which required communities and local governments receiving federal funding to submit fair housing assessments, was a way for HUD to ensure recipients were following the law and actively working to eradicate historical discrimination and segregation practices in housing. The changes encompassed in the rule were recommended by the Government Accountability Office and by HUD itself.\n\"Since issuance of the final rule, however, HUD has concluded that the current regulations are ineffective in helping program participants to meet this obligation,\" according to a HUD's rule change proposal.\nAs it explores the rule change, HUD is also accepting comment from the public for the next 60 days.\nHUD officials also said informal listening forums will be held to get input from city planners, public housing authorities, housing advocates authorities and other stakeholders on the pending rule change.\nThe push by current HUD officials to undo the Obama-era AFFH rule has been expected for some time. In January, the housing agency announced it was suspending local governments' obligation to comply with the rule until late 2020.\nIn May, HUD nixed a computer assessment tool which was supposed to help municipalities submit housing data and ensure they were complying with the federal laws.\nHUD said at the time \"the Local Government Assessment Tool was confusing, difficult to use and frequently produced unacceptable assessments.\"\nEarlier that month, a group of fair housing advocates filed a suit to compel Carson and HUD to implement the 2015 AFFH rule.\nMadison Sloan is the director of Disaster Recovery and Fair Housing with Texas Appleseed, one of the plaintiffs in the suit against HUD. \"This notice is part of HUD's continuing attempt to gut the Fair Housing Act, allowing public money to fund discrimination and segregation in violation of the law,\" Sloan said in a statement.","url":"https://www.npr.org/2018/08/13/638285344/ben-carson-moves-forward-with-push-to-change-fair-housing-rule"}
