{"authors":[],"date_download":"2018-10-30 01:11:13","date_modify":"2018-10-30 01:11:13","date_publish":"2015-03-11 00:00:00","description":null,"filename":"data/vaneerConsumption/BenCarsonSoniaSotomayorandhomosexuality.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_03_ben_carson_sonia_sotomayor_and_homosexuality_1540861873.html","title":"Ben Carson, Sonia Sotomayor, and homosexuality","title_page":"Ben Carson, Sonia Sotomayor, and homosexuality","title_rss":"NULL","source_domain":"americanthinker.com","text":"Ben Carson, Sonia Sotomayor, and homosexuality\nAlthough homosexuality in America is today synonymous with the word gay, only anger and hostility result from questions about what actually defines it. Dr. Ben Carson stoked these flames last week while defending his position on traditional marriage. By now, most of us have heard Dr. Carson suggest that homosexuality in prison proves that being a homosexual comes down to choice, not genetics. Throughout history, the tolerance of any sexual practice has hinged on individual cultures. Dr. Carson’s uncomfortably honest assertion about prison certainly relates to this fact. Sex in prison is often coerced or worse, but that reality doesn’t explain the consensual practice of homosexual acts involving prisoners who identify strictly as heterosexual. Such inmates often pursue sexual relationships with willing feminine homosexual prisoners. In other instances, self-described straight inmates might coerce same-sex favors or commit same-sex rape for predatory reasons. But the bottom line is this: homosexual sex is culturally permissible in prison, and it is practiced willingly by many inmates who claim to be straight.\nThis sort of homosexual culture seems similar to homosexual practices in Afghanistan, where “Pashtun men interpret the Islamic prohibition on homosexuality to mean they cannot ‘love’ another man – but that doesn't mean they can't use men for sexual gratification.” According to an unclassified U.S. military study, “Pashtun men commonly have sex with other men, admire other men physically, have sexual relationships with boys and shun women both socially and sexually – yet they completely reject the label of homosexual.\" In America, I think the Pashtun culture is defined by the phrase on the down-low, not to be confused with the word gay. But as Hillary Clinton once said, “What difference at this point does it make?” Words now mean whatever liberals say they mean. With this sort of exotic logic being thrust upon us, are emotionally detached heterosexuals who use the opposite sex for lascivious gratification really heterosexuals, and how does anyone actually know? Come to think of it, if no childbearing is possible, would consensual sexual gratification between an adult child and biological parent still be incest? In fact, why has consensual homosexual gratification between an adult child and a biological parent ever been taboo? As disturbing as such thoughts might be, Supreme Court Justice Sonia Sotomayor has asked similar questions, and she wasn’t branded a dunce by all the critics who now seem to believe that they are smarter than the world-renowned neurosurgeon – who simply tries to answer uncomfortable questions honestly. Much of America continues to ignore the reality that open marriages and open relationships are mainstream in the homosexual community. So where is the new definition of marriage really headed? The unknown answer seems to be Dr. Carson’s concern. Will the new definition of marriage mean that the majority of American heterosexuals no longer expect their spouses to control their sexual impulses? Will heterosexual adulterers now demand that society condone their behavior and remove social stigmas associated with what they are – or with what they choose to do? More importantly, will married spouses who use another consensual adult for sexual gratification – without love or emotional connection – even be considered adulterers anymore? With the way language and everything else is going, America’s moral corruption may soon be defined as encouraging a culture where the ideal marriage involves expectations of impulse control, commitment, and emotional connection. On the other hand, viewing all other human beings as merely sexual objects might become the cure for all the world’s problems. Of course, liberals might ensure that straight white men are incarcerated for objectifying women, but all other objectification should be good to go. By the time the men serve their time, they would probably fit right in to our new society, especially if Dr. Carson’s assertion is actually true. Nevertheless, it does not take a brain surgeon to diagnose America’s vocabulary or logic problem. Reality is clear. Transformed Americans just choose to ignore it. Lee Culpepper is a recovering high school English teacher and former Marine officer. E-mail Lee Culpepper or contact him via Twitter @drcoolpepper.","url":"https://www.americanthinker.com/blog/2015/03/ben_carson_sonia_sotomayor_and_homosexuality.html"}
