{"authors":["Ben Shapiro"],"date_download":"2018-10-30 21:23:26","date_modify":"2018-10-30 21:23:26","date_publish":"2015-10-09 15:22:27","description":"On Thursday, Republican 2016 presidential contender Dr. Ben Carson stated on CNN that the Holocaust would have been less likely had Jews been armed.","filename":"data/vaneerConsumption/BenCarsonIsRightYesJewsShouldHaveHadGunsinTheHolocaust.json","image_url":"https://media.breitbart.com/media/2015/09/ben-carson-little-rock-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_10_09__1540934606.html","title":"Ben Carson Is Right: Yes, Jews Should Have Had Guns in The Holocaust","title_page":"Ben Carson Is Right: Yes, Jews Should Have Had Guns in The Holocaust | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Thursday, Republican 2016 presidential contender Dr. Ben Carson stated on CNN that the Holocaust would have been less likely had Jews been armed.\nIn his new book, A Perfect Union, Carson contends, “Through a combination of removing guns and disseminating propaganda, the Nazis were able to carry out their evil intentions with relatively little resistance.” He defended that argument on national television, explaining, “I think the likelihood of Hitler being able to accomplish his goals would have been greatly diminished if the people had been armed. I’m telling you there is a reason these dictatorial people take guns first.”\nThe media cynically objected to Carson’s language. Good Morning America labeled Carson’s comments “bizarre.” Politico accused Carson of “linking Hitler to gun control” – a ridiculous notion, given that Hitler is the one who linked Hitler with gun control.\nThe media quickly ran to its leftist allies in the Anti-Defamation League, a longtime opponent of gun rights. “Ben Carson has a right to his views on gun control, but the notion that Hitler’s gun-control policy contributed to the Holocaust is historically inaccurate,” National Director Jonathan Greenblatt told Yahoo! News. “The small number of personal firearms available to Germany’s Jews in 1938 could in no way have stopped the totalitarian power of the Nazi German state.”\nWell, of course the “small number of personal firearms available to Germany’s Jews” wouldn’t have prevented the Holocaust. That was the entire goal of prohibiting Jews from owning firearms over the course of years.\nThe Nazi genocide against Jews relied on two factors: a population that, understandably, believed no sane or rational force on the planet, let alone the highly civilized Germans, would systematically murder civilians for no discernable purpose; and disarming that population before they could recognize the truth. Gun control had a long history in Germany long before the Holocaust. In 1920, Germany essentially seized all firearms. In 1928, they liberalized their gun laws but still required licenses to purchase weapons (and banned gypsies from obtaining such licenses); until 1938, the law would be used as an excuse to confiscate weapons from Jews.\nIn 1933, upon Hitler’s assumption of power, “non-Nazis throughout Germany were disarmed as ‘Communists,’” according to legal scholar Stephen Halbrook; simultaneously, Nazis were armed. The Nazis banned ownership of any “military” firearms by non-Nazi civilians, but naturally put special emphasis on seizing any guns from Jews. Handgun importation was banned.\nFinally, in 1938, the Nazis enacted the Weapons Law, which banned weapons ownership without a license, just like the 1928 law; the law itself did not explicitly deny licenses to Jews. But the law did ban Jews from firearms businesses, and further required full government-available records of all gun sales. After Kristallnacht, the Nazis utilized the law to ban guns from all Jews after utilizing the media to blame “armed Jews” for unrest. The order issued by the government on November 10, 1938 read: “Persons who, according to the Nurnberg law, are regarded as Jews, are forbidden to possess any weapon. Violators will be condemned to a concentration camp and imprisoned for a period of up to 20 years.” In fact, all weapons were banned from Jews, including stabbing and cutting weapons, as well as swords, students’ rapiers, clubs, horsewhips, brass knuckles, and hunting knives. “The Jews must be warned,” the regulations said, “that they should interpret the new ordinance and the already existing Weapons Law strictly.” Foreign Jews were made subject to the regulations as well. The law was used as an immediate excuse to round up and ship off Jews to concentration camps.\nGerman Jewish leadership said that any failure to comply would only drive more brutality. This strategy, needless to say, led to catastrophe.\nNonetheless, the media continue to lay out arguments that Carson was wrong, and that presumably, the Jews should have avoided guns even as the Germans came for their children. Nick Baumann of The Huffington Post, for example, put up pictures of Jews murdered in the Holocaust for fighting the Nazis. “There was some armed Jewish resistance to the power of the Nazi war machine. But it often ended in death for the Jews involved,” he wrote today.\nYes, it turns out that the Nazis killed lots of people – including hundreds of thousands of Americans with guns, as well as millions of Soviet soldiers with guns. But those who had guns certainly made it harder for the Nazis. The Warsaw Ghetto uprising not only delayed the Nazi war machine for a month, it forced the Nazis to redirect military resources into a territory they had already conquered. The Warsaw Ghetto uprising also led directly to the Polish uprising against the Nazi regime, which forced massive redeployment of Nazi military resources. Similarly, revolts in death camps did redirect resources from the Nazi regime, allowed some fighters to escape, and in one case, even led to the Nazis razing a death camp.\nJust because the Nazis shot those who tried to resist them with armed force does not mean that Jews should not have had the ability to fight the Nazis. It is difficult to think of a more evil argument than the argument that you will undoubtedly be killed whether or not you have a gun, so we might as well remove your ability to defend your life. Defending your own life is a basic human right. Jews are human beings, even if the media would hope to treat them as less than that. Ask any Holocaust survivor whether they would, in retrospect, have preferred to have a gun rather than being forced at gunpoint onto a train and then into Auschwitz, separated from their soon-to-be-gassed families, and then forced into starvation for years. As Warsaw Ghetto fighter Emmanuel Ringelblum wrote:\nHusbands tore out their hair because they had let the Germans, unharmed, take away those dearest to them, their wives and children; children loudly reproached themselves for allowing their parents to be taken away. Oaths were sworn aloud: Never shall the Germans move from here with impunity; we will die, but the cruel invaders will pay with their blood for ours.\nAnyone who would deny such people guns because “it wouldn’t have mattered anyway” ought to be cut off from the class of decent human beings.\nThe argument against Carson has serious real-world consequences that extend beyond the argument against domestic gun seizures. The idea of armed Jewish resistance undergirded the establishment of the State of Israel. After ordering the bombing of Saddam Hussein’s Osirak nuclear reactor in 1981, former Soviet dissenter and Israeli Prime Minister Menachem Begin explained:\nWe chose this moment: now, not later, because later may be too late, perhaps forever. And if we stood by idly, two, three years, at the most four years, and Saddam Hussein would have produced his three, four, five bombs. … Then, this country and this people would have been lost, after the Holocaust. Another Holocaust would have happened in the history of the Jewish people. Never again, never again! Tell so your friends, tell anyone you meet, we shall defend our people with all the means at our disposal. We shall not allow any enemy to develop weapons of mass destruction turned against us.\nThe same people criticizing Carson today oppose the Jewish State’s right to defend itself. We shouldn’t be surprised that the media who cheer on President Obama’s empowerment and funding of the genocidal anti-Semitic Iranian regime and undermine Israel in its fight against genocidal anti-Semitic Palestinian terrorists also oppose the idea that Jews would have been better off armed facing the Nazis.\nToday’s Nazi enablers are yesterday’s Nazi enablers. And they have a strange preference for government disarmament of the populace.\nResistance to tyranny is a virtue, today and yesterday. Those who stand in the way of such virtue side with evil. And the left consistently sides with evil.\nBen Shapiro is Senior Editor-At-Large of Breitbart News, Editor-in-Chief of DailyWire.com, and The New York Times bestselling author, most recently, of the book, The People vs. Barack Obama: The Criminal Case Against The Obama Administration (Threshold Editions, June 10, 2014). Follow Ben Shapiro on Twitter @benshapiro.","url":"https://www.breitbart.com/the-media/2015/10/09/ben-carson-right-yes-jews-guns-holocaust/"}
