{"authors":["Jessica Taylor","Scott Detrow"],"date_download":"2018-10-23 01:07:18","date_modify":"2018-10-23 01:07:18","date_publish":"2016-03-02 00:00:00","description":"The accomplished neurosurgeon, a surprising presidential candidate, was a top-polling candidate in 2015 before the GOP primary race refocused on national security and foreign affairs.","filename":"data/vaneerConsumption/BenCarsonDoesNotSeeAPoliticalPathForwardForPresidentialCandidacy.json","image_url":"https://media.npr.org/assets/img/2016/02/09/gettyimages-508925434_wide-c36c903a82c9ab8183838f826eadc5327b2daf75.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_03_02_466207882_ben-carson-does-not-see-a-political-path-forward-for-presidential-candidacy_1540256838.html","title":"Ben Carson Does 'Not See A Political Path Forward' For Presidential Candidacy","title_page":"Ben Carson Does 'Not See A Political Path Forward' For Presidential Candidacy : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Ben Carson Does 'Not See A Political Path Forward' For Presidential Candidacy\nEnlarge this image toggle caption Matthew Cavanaugh/Getty Images Matthew Cavanaugh/Getty Images\nA day after he failed to crack 11 percent in any of the Super Tuesday presidential contests, retired neurosurgeon Ben Carson appears to be effectively ending his campaign for president.\n\"I do not see a political path forward in light of last evening's Super Tuesday primary results,\" Carson said in a statement Wednesday afternoon. While Carson did not explicitly say he was dropping out, he said he will not attend Thursday's Republican debate, and that he'll \"discuss more about the future of this movement\" on Friday during an appearance at the Conservative Political Action Conference in Maryland.\nThe announcement signals the end of an improbable run that saw the accomplished neurosurgeon rise from political neophyte to top-polling candidate for the Republican nomination.\nCarson had long been a celebrated figure in both black and conservative communities for his inspirational story, overcoming a poor urban upbringing to become one of the country's most accomplished doctors. He first became politically prominent in 2013, when he delivered a searing speech at the National Prayer Breakfast while President Obama sat just feet away.\nVideo of the speech quickly went viral and led to a \"draft Carson\" campaign. Once Carson entered the race, he moved to the top of national and Iowa polls, even briefly topping the Iowa polls for several weeks last fall.\nBut Carson, more than any other candidate, suffered when the November Paris terrorist attacks shifted the race's focus to foreign policy. It was a policy area he wasn't familiar with, and he appeared uncomfortable discussing terrorism and military issues in debates and campaign appearances. Poll numbers dropped, and despite a late December campaign shakeup, Carson was never able to fully recover.\nCarson finished fourth in Iowa, with less than 10 percent of the vote. Despite poor showings in other primary and caucus states, Carson had stayed in the race and participated in debates until now.","url":"https://www.npr.org/sections/thetwo-way/2016/03/02/466207882/ben-carson-does-not-see-a-political-path-forward-for-presidential-candidacy"}
