{"authors":["Alanna Bennett"],"date_download":"2018-10-30 23:10:00","date_modify":"2018-10-30 23:10:00","date_publish":"2014-08-13 22:32:16","description":"Somewhere in Great Britain, Benedict Cumberbatch is blushing hardcore right now. He just learned that the Benedict Cumberbatch brand can outsell Beyonce and Jay Z. That's some powerful magnetism.\nWith the exception of your elder relatives who don't…","filename":"data/vaneerConsumption/BenedictCumberbatchsHamletOutsoldBeyonceJayZsOntheRunTourBecauseTheresNoStoppingBen.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/a2ec8b62-b4c0-4098-a655-969ba3cc4d14.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35683-benedict-cumberbatchs-hamlet-outsold-beyonce-jay-zs-on-the-run-tour-because-theres-no-stopping_1540941000.html","title":"Benedict Cumberbatch's 'Hamlet' Outsold Beyonce & Jay Z's \"On the Run\" Tour Because There's No Stopping Ben","title_page":"Benedict Cumberbatch's 'Hamlet' Outsold Beyonce & Jay Z's \"On the Run\" Tour Because There's No Stopping Ben","title_rss":"NULL","source_domain":"bustle.com","text":"Somewhere in Great Britain, Benedict Cumberbatch is blushing hardcore right now. He just learned that the Benedict Cumberbatch brand can outsell Beyonce and Jay Z. That's some powerful magnetism.\nWith the exception of your elder relatives who don't know how to navigate the Internet, no one at this point doesn't know Benedict Cumberbatch is huge. But even the hardcore Cumberbatchians I relayed this news to were like \"whoa\" when they heard he'd outsold the Carter-Knowleses.\nSo what was the momentous occasion that enabled Cumberbatch to beat the ticket sales of the \"On the Run\" tour? That'd be the Bard — Cumberbatch is gearing up to star in a production of Hamlet at the Barbican Theater in London. I guess we now know where the loyalties of the British lie — they've already got their own queen.\nStill, this is an impressive feat for someone who hasn't headlined a Superbowl halftime show (yet). Cumberbatch is a brightly-shining star, for sure, but his Hamlet doesn't even open until Aug 5 — of next year. That's some hardcore devotion right there. He and Beyonce should definitely meet up. Can you imagine if they joined forces? The world as we know it would burn. It would be so wonderful.\nImage: Tumblr","url":"https://www.bustle.com/articles/35683-benedict-cumberbatchs-hamlet-outsold-beyonce-jay-zs-on-the-run-tour-because-theres-no-stopping"}
