{"authors":["Press Association"],"date_download":"2018-10-22 23:38:42","date_modify":"2018-10-22 23:38:42","date_publish":"2016-01-11 06:45:02","description":"A star of TV's original Benefits Street series is facing a possible jail term for drugs offences and illegal possession of ammunition. Samora Roberts, who wa...","filename":"data/vaneerConsumption/Benefitsstreetsblackdeecouldbejailedoverdrugsandammunition.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-6ab2c6e0-cf91-4d27-b4ac-1db502e92431-56CX32zFKLb7123928b84cb6471a-354_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3393449_Benefits-Streets-Black-Dee-jailed-drugs-ammunition_1540251522.html","title":"Benefits street's black dee could be jailed over drugs and ammunition","title_page":"Benefits street's black dee could be jailed over drugs and ammunition | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Benefits Street's Black Dee could be jailed over drugs and ammunition\nA star of TV's original Benefits Street series is facing a possible jail term for drugs offences and illegal possession of ammunition.\nSamora Roberts, who was known on the programme as Black Dee, was convicted in November of possessing heroin and two counts of possession of crack cocaine with intent to supply.\nThe 34-year-old, of James Turner Street, Winson Green, Birmingham, denied the charges brought after a haul of unfired bullets was discovered inside a lady's shoe during drugs raids.\nSamora Roberts, also known as Black Dee from Benefits Street, could be jailed for drugs offences and illegal possession of ammunition\nPolice also found cocaine worth more than £5,000 inside a Ford Focus parked in James Turner Street in June 2013, while a drug \"bulking\" agent and deal bags were found inside houses.\nRoberts, who was convicted at Birmingham Crown Court, is due to be sentenced by Judge Philip Parker QC.\nThe first five-part series of Benefits Street went on air in January 2014, attracting hundreds of complaints to broadcasting watchdog Ofcom.","url":"https://www.dailymail.co.uk/wires/pa/article-3393449/Benefits-Streets-Black-Dee-jailed-drugs-ammunition.html"}
