{"authors":["Keiligh Baker For Mailonline"],"date_download":"2018-10-23 00:57:52","date_modify":"2018-10-23 00:57:52","date_publish":"2017-04-26 11:00:46","description":"Mona Miller, 37, of Cardiff was caught out after she boasted on Facebook: 'I got my man and kids that's all that matters to me without them I'd have nothing.'","filename":"data/vaneerConsumption/Benefitscheatmotheroffivepretendedtobesinglemum.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9EF28A00000578-0-image-a-2_1493201857776.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446982_Benefits-cheat-mother-five-pretended-single-mum_1540256272.html","title":"Benefits cheat mother-of-five pretended to be single mum","title_page":"Benefits cheat mother-of-five pretended to be single mum | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Benefits cheat Mona Miller (pictured outside court) was caught out after she boasted online: 'I got my man and kids that's all that matters to me without them I'd have nothing'\nA mother-of-five fiddled £70,000 benefits by pretending to be a single parent despite living with her Nigerian toyboy lover.\nMona Miller, 37, of Cardiff was caught out after she boasted on Facebook: 'I got my man and kids that's all that matters to me without them I'd have nothing.'\nCardiff Crown Court heard she moved her young Nigerian boyfriend, Emmanuel Orji, 26, in to her home after they met online.\nThe court heard she lied to benefits officials that Orji would only visit her 'once or twice a week'.\nBut incriminating undercover footage showed they lived together and Orji regularly carried out DIY car repairs outside her home\nCardiff Crown Court heard Miller claimed Income Support between 2010 and 2016 which amounted to £53,465.03.\nShe also claimed £14,577.08 of housing benefit and £1,324.99 of council tax benefit.\nThe court heard the total amount Miller wrongly claimed was £69,367.10 after pretending that she was living alone as a single mum struggling to get by.\nBut the court heard Miller met her lover online as far back as 2011 while Orji was living with his sister in London and waiting to be granted UK citizenship.\nCardiff Crown Court heard she moved her young Nigerian boyfriend, Emmanuel Orji, 26, in to her home after they met online\nAndrew Jones, prosecuting, said: 'A review which followed in 2013 saw her say she was in a relationship but her partner lived in London.\n'That was an outright lie.'\nMr Jones said undercover surveillance carried out by the Department of Work and Pensions between August and September 2015 found that Orji was present at the address in Cardiff.\nThe court heard the total amount Miller wrongly claimed was £69,367.10 by pretending that she was living alone as a single mum struggling to get by\nIncriminating undercover footage showed they lived together and Orji carried out DIY car repairs outside their shared home\nHis car was registered in his name - but was even listed to Miller's address.\nMr Taylor said: 'GP records showed he was registered at the her home address from 2011.'\nOrji, who now works as a carer, was given permission to get a job in Britain in 2015.\nDefending, Catherine Flint, said the relationship was 'on and off' - and said Miller described Orji as 'very controlling.'\nMiss Flint said: 'There was an element of naivety. In many ways she was scared to let the DWP know about the living situation with Mr Orji. The relationship was still very unstable and very on and off.\nMiller has already repaid £1,809.88 from her benefits and the remainder will be deducted until the full amount is repaid\n'She got herself into a situation that she did not know how to get out of.'\nMiller, of Llanrumney, Cardiff, pleaded guilty to three charges of dishonestly failing to notify a change of circumstances.\nShe was sentenced to eight months prison suspended for two years.\nJude Neil Bidder QC said: 'If somebody took £70,000 in cash in one go then you would expect that person to go to prison. You effectively concealed the fact your partner was living with you. '\nThe court heard Miller has five children - including the latest two children with Orji.\nShe had not told her youngest children she was in court.\nMr Bidder said: 'They will be ashamed of you and you will be lowered in their estimation.'\nMiller has already repaid £1,809.88 from her benefits and the remainder will be deducted until the full amount is repaid.","url":"https://www.dailymail.co.uk/news/article-4446982/Benefits-cheat-mother-five-pretended-single-mum.html"}
