{"authors":["Brian Homewood"],"date_download":"2018-10-23 03:02:49","date_modify":"2018-10-23 03:02:49","date_publish":"2016-01-11 15:35:08","description":"The game was called off in the eighth minute on Sunday with fog cloaking Nacional's hillside stadium in Madeira, the fourth league game to be postponed on the island this season.","filename":"data/vaneerConsumption/BenficacompletefogdelayedmatchasJonashitshattrickagainstNacional.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300BCE5300000578-0-image-a-42_1452527965190.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3394106_Benfica-complete-fog-delayed-match-Jonas-hits-hat-trick-against-Nacional_1540263769.html","title":"Benfica complete fog-delayed match as Jonas hits hat-trick against Nacional","title_page":"Benfica complete fog-delayed match as Jonas hits hat-trick against Nacional | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jonas scored hat-trick in remaining 82 minutes as Benfica go second\nGame was originally postponed after eight minutes due to fog\nJonas scored a hat-trick, taking his tally to 18 in 17 league games, to give Benfica a 4-1 win at Nacional on Monday after they played out the remaining 82 minutes of a match abandoned due to fog the previous evening.\nThe game was called off in the eighth minute on Sunday with fog cloaking Nacional's hillside stadium in Madeira, the fourth league game to be postponed on the island this season and the second involving the Portuguese title holders.\nBenfica's win pulled them level on 40 points with second-placed Porto in the Primeira Liga, four behind leaders Sporting.\nJonas scored a hat-trick for Benfica as they completed their fog-postponed game against Nacional\nBenfica's 4-1 win sees them pull level with Porto in second place in the Primeira Liga\nThe match re-started at midday on Monday with only a few hundred people in the stands despite free admission, Portuguese media reported.\nJonas put Benfica ahead in the 23rd minute, the 15th after the re-start, with a looping header at the far post from Mehdi Carcela-Gonzalez's cross.\nSoares equalised five minutes into the second half with a weak shot which wrong-footed Julio Cesar and trickled over the line before the Brazil World Cup goalkeeper could clear it.\nThe match re-started at midday on Monday in front of only a few hundred people after Sunday's abandonment\nThe Portuguese league clash was abandoned after eight minutes due to heavy fog on Sunday night\nJonas, who made the last of his eight appearances for Brazil in 2012, put Benfica back in front from Raul Jimenez's cross in the 57th minute before heading in Andre Almeida's pass.\nGreek forward Kostas Mitroglou completed the scoring in the 89th minute as the mist again began to descend over the Choupana stadium.","url":"https://www.dailymail.co.uk/sport/football/article-3394106/Benfica-complete-fog-delayed-match-Jonas-hits-hat-trick-against-Nacional.html"}
