{"authors":["Trent Baker"],"date_download":"2018-10-30 21:25:55","date_modify":"2018-10-30 21:25:55","date_publish":"2016-01-11 19:03:23","description":"Cincinnati Bengals defensive back Adam \"Pacman\" Jones called in to NBC Sports Radio's \"The Dan Patrick Show\" Monday to speak with host Dan Patrick about |","filename":"data/vaneerConsumption/BengalsDBAdamPacmanJonesAccusesSteelersWRofFakingHeadInjury.json","image_url":"https://media.breitbart.com/media/2016/01/pacman-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2016_01_11__1540934755.html","title":"Bengals DB Adam 'Pacman' Jones Accuses Steelers WR of Faking Head Injury","title_page":"Bengals DB Adam 'Pacman' Jones Accuses Steelers WR of Faking Head Injury | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Cincinnati Bengals defensive back Adam “Pacman” Jones called in to NBC Sports Radio’s “The Dan Patrick Show” Monday to speak with host Dan Patrick about his team’s Saturday loss to the Pittsburgh Steelers.\nJones, who blasted the referees and Steelers assistant coach Joey Porter in a post-game Instagram rant, accused Steelers star wide receiver Antonio Brown of faking an injury on a hit to his head late in the game by Bengals linebacker Vontaze Burfict.\nBrown laid on the ground for several minutes after the shot to his head. He has since been diagnosed with a concussion.\nThe hit by Burfict resulted in a 15-yard penalty, as did the contact with an official by “Pacman” in an on-field skirmish right after the Brown injury. The two penalties set the Steelers up to kick the field goal to give them the win.\n“Man, Antonio Brown was not hurt,” Jones said. “I know he was faking. Go back and look at the play. You go back and slow motion the play and you tell me Vontaze hit him in the head or did his shoulder pads barely touch him?”\n“I think he needs a Grammy Award for that one,” he later added.\nAccording to Jones, Antonio Brown even winked at him on the field, letting him know he was not actually hurt.\nHe told Patrick, “I know if you just got knocked out you ain’t going to be able to wink and tell me you’re OK.”","url":"https://www.breitbart.com/video/2016/01/11/bengals-db-adam-pacman-jones-accuses-steelers-wr-of-faking-head-injury/"}
