{"authors":["Taylor Ferber"],"date_download":"2018-10-31 01:42:10","date_modify":"2018-10-31 01:42:10","date_publish":"2018-08-28 02:36:11","description":"Looks like this former Bachelor star isn't not interested in potentially getting back together with his ex. Ben Higgins's comments on Lauren Bushnell's reported recent breakup didn't quite say no when asked if he'd consider reuniting with her. After…","filename":"data/vaneerConsumption/BenHigginsResponseToLaurenBushnellsReportedSplitIsActuallyPrettyOptimistic.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/cbc11852-d33a-4712-8617-631897d2bad5-getty-609998992.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_ben-higgins-response-to-lauren-bushnells-reported-split-is-actually-pretty-optimistic-10257825_1540950130.html","title":"Ben Higgins' Response To Lauren Bushnell's Reported Split Is Actually Pretty Optimistic","title_page":"Ben Higgins' Response To Lauren Bushnell's Reported Split Is Actually Pretty Optimistic","title_rss":"NULL","source_domain":"bustle.com","text":"Looks like this former Bachelor star isn't not interested in potentially getting back together with his ex. Ben Higgins's comments on Lauren Bushnell's reported recent breakup didn't quite say no when asked if he'd consider reuniting with her. After all, all bets are off when it comes to romances in Bachelor Nation.\nBen and Lauren got engaged at the end of his Bachelor season in 2016 and they called off their engagement last May. About two months later, Lauren began dating Devin Antin and Entertainment Tonight recently reported their breakup on Aug. 21. According to People, Ben recently reacted to her rumored split to a group of reporters. In a coy and roundabout way, Ben made it seem like that door was still open for him:\n“Well, you’ve got to talk to her!... I’ve been asked about it a lot. It’s such an interesting place for me now to sit in, where all you hope for that person at first, that you’re, you’re angry and you’re hurt and you’re confused and then all of a sudden you turn to this thing where you’re like, 'There’s no good for me being mad.' Like there’s nothing good coming from me wishing any ill will on Lauren. So then you start to celebrate her new life. And then that ends, and I’m in a weird place where it’s like, 'What do I do now?'\"\nIsaac Brekken/Getty Images Entertainment/Getty Images\nThe pair released a neutral statement following their split last May, saying, “We wish nothing but the best for each other.\" But Ben later opened up about it, explaining it was much deeper in his podcast with Ashley Iaconetti. “It’s tough. It’s hard to say goodbye to somebody that you spent so much time with and... somebody that you really did believe was the one for you,\" he said. “I’m sad. I’m a little confused, a little lost... the joy that we felt toward our relationship at the beginning was — for some reason — slipping away.\"\nMeanwhile, Lauren also got candid about their split about a month later during a podcast interview with Reality Steve when she recalled the morning she got engaged:\n\"I kind of had an idea that I was possibly going to get engaged and I remember having so much anxiety about it, which looking back, I don't know if that was my gut being like, wait, timing-wise, this is too rushed or what... I remember locking myself in the bathroom and being so overwhelmed and anxious.\"\nIn July, Lauren also opened up about dating Devin Antin to Entertainment Tonight, perhaps foreshadowing their rumored breakup. She revealed she wish she took things slower after her breakup with Ben, sating, \"In hindsight, I wish I would have taken a little bit more time, but that's the way it went.\" The two friends reunited after Lauren was on the show. \"It naturally evolved. But I do feel bad, because I went through a very hard, public breakup,\" she explained. \"I do think I brought a lot of those emotions into me and Devin's relationship at the beginning. So it's definitely been, like, a roller coaster of a ride.\"\nLauren has yet to comment on whether or not she'd want to reunite with Ben, but at this point, would anyone really be surprised? As fans know, anything can happen in Bachelor Nation.","url":"https://www.bustle.com/p/ben-higgins-response-to-lauren-bushnells-reported-split-is-actually-pretty-optimistic-10257825"}
