{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-22 20:33:58","date_modify":"2018-10-22 20:33:58","date_publish":"2016-01-29 02:13:53","description":"The former van driver, 31 - who beat Fleur East to be crowned winner of The X Factor in December 2014 - penned a heartfelt letter to his 'loyal and loving fans' via his Twitter page late on Thursday night.","filename":"data/vaneerConsumption/BenHaenowconfirmshehaspartedwaysfromSimonCowellsrecordlabelSycoafterjustoneyear.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B20E0D00000578-0-image-a-44_1454069823793.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422050_X-Factor-2014-winner-Ben-Haenow-dropped-Cowell-s-record-label-Syco_1540240438.html","title":"Ben Haenow confirms he has parted ways from Simon Cowell's record label Syco after just one year","title_page":"Ben Haenow confirms he has parted ways from Simon Cowell's record label Syco after just one year | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ben Haenow has confirmed he and Simon Cowell's record label Syco have parted ways after just one year of working together.\nThe former van driver, 31 - who beat Fleur East to be crowned winner of The X Factor in December 2014 - penned a heartfelt letter to his 'loyal and loving fans' via his Twitter page late on Thursday night.\nAmid reports he had been dropped by the record company due to poor sales figures, the Croydon crooner wrote: 'Hey guys. Sorry I've been a bit quiet on here recently, been a crazy few weeks!\nScroll down for video\nThe dream is over: Ben Haenow has confirmed he and Simon Cowell's record label Syco have parted ways after just one year of working together\n'So I wanted to let you all know directly from me, that after what has been the most incredible experience working on my debut album, myself and Syco entertainment have decided to part ways.'\nBen added: 'Working with The X Factor and Syco has been the most amazing time of my life and has given me the best possible platform for the start of my career.\n'I have the upmost respect for them both and cannot thank them enough for all the help and everything they have done for me this past year.'\nHitting back at claims the label were unimpressed with the sales figures of his self-titled debut album, Ben expressed his pride at making the record and explained he is looking forward to the 'next chapter' and 'next album'.\nThe AXE factor: The former van driver, 31 penned a heartfelt letter to his 'loyal and loving fans' via his Twitter page late on Thursday night, explaining he and Cowell's Syco label are no longer working together\nHe continued: 'I have had the privilege of working with some incredible people, making some great friends and making a great record which I am still extremely proud of. (Which, thanks to you lot has gone on to sell over 100,000 copies and still going).\n'However, after discussions with the Syco team we both felt it was the right time to move on. I am very excited about this next chapter.\n'I'm already writing and in talks about about the next album. There are going to be a few changes to my upcoming tour dates, but I'll let you know all the details very soon.'\nMoving on: Hitting back at claims the label were unimpressed with the sales figures of his self-titled debut album, Ben expressed his pride at making the record and explained he is looking forward to the 'next chapter'\nRounding off with a message to his fans, Ben wrote: 'Most importantly I would like to say the biggest thank you to ALL OF YOU! You have all made my dreams come true and I owe YOU everything.\n'None of this would have been possible without you guys! The ongoing loyalty, love and support you have shown me this past year and beyond has made me the proudest and luckiest person alive.\nYou are the best fans anyone could ask for and I mean it when I say I really do love you all. I Cannot wait to see you all on the tour! Stay tuned!'\nBen's revelation comes amid reports Simon Cowell axed him from his roster of artists with 'a heavy heart'.\nAxed: X Factor 2014 winner Ben Haenow has been dropped from Syco records, making him the fastest winner to be dropped by music mogul Simon Cowell since series one champion Steve Brookstein\nA source told The Sun: 'Simon made the decision with a heavy heart. He was a big supporter of Ben but it’s simply down to business - Fleur East, who came second, has done much better.\n'And at the end of the day our winners, especially the blokes, never have the same success as the likes of One Direction and Olly Murs.'\nA source added: 'The relationship between Ben and Syco remains strong. Both agree that moving on is the best course of action but are on really good terms.\n'Everyone at Syco is very fond of Ben and wish him well.'\nBen was automatically signed to Simon Cowell’s record label after winning the show and released his debut single Something I Need in December 2014.\nRunner-up: Despite coming second to Ben in the competition, Fleur East has proved more commercially successful than the winner\nThe track shot to the top of the charts, and Ben followed it with Second Hand Heart, a duet with Kelly Clarkson that he released in October 2015.\nHowever, the song failed to crack the top 20 of the British charts.\nBut it was the poor performance of his track Slamming Doors, which he also performed on this year’s final of The X Factor, that was apparently the final nail in the coffin when it came to Simon's decision about his future with his label.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422050/X-Factor-2014-winner-Ben-Haenow-dropped-Cowell-s-record-label-Syco.html"}
