{"authors":["Press Association"],"date_download":"2018-10-23 00:48:51","date_modify":"2018-10-23 00:48:51","date_publish":"2016-01-11 10:37:50","description":"Bournemouth have announced the signing of striker Benik Afobe from Wolves on a four-and-a-half-year deal. The 22-year-old former Arsenal man signs for an und...","filename":"data/vaneerConsumption/Benikafobecompletesmovetobournemouthfromwolves.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-eb89880c-efc4-47ef-a4d5-48add18c9023-48qEJGFphM8d437f0aaf92391481-436_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3392786_Benik-Afobe-completes-Bournemouth-Wolves_1540255731.html","title":"Benik afobe completes move to bournemouth from wolves","title_page":"Benik afobe completes move to bournemouth from wolves | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Benik Afobe completes move to Bournemouth from Wolves\nBournemouth have announced the signing of striker Benik Afobe from Wolves on a four-and-a-half-year deal.\nThe 22-year-old former Arsenal man signs for an undisclosed fee having scored 10 goals for Wolves already this season.\nAfobe is a proven scorer outside of the Premier League - netting 32 times for MK Dons last season - and now has his top-flight chance.\nStriker Benik Afobe has scored 10 goals for Wolves this season and has joined Bournemouth\nBournemouth chief executive Neill Blake told his club's official website: \"We are absolutely delighted to secure the signature of another undoubted talent in Benik Afobe.\n\"It has been difficult to miss Benik's outstanding progress as a player, firstly with MK Dons and then Wolves, where he has been a consistent threat in front of goal. His pedigree as an Arsenal Academy product must also not be underestimated.\n\"Thank you to Jez Moxey and Wolverhampton Wanderers, who have been a pleasure to deal with throughout negotiations. We look forward to seeing Benik in an AFC Bournemouth shirt soon.\"\nBournemouth sit 16th in the Premier League table in spite of losing a host of attacking talent to season-long injuries.\nCallum Wilson started the campaign with five goals before injury struck, while Max Gradel is also sidelined.\nAs a consequence, Afobe's goals will be needed to secure survival.\n\"I'm delighted. It's been a long time coming and I am just very thankful the manager has given me this chance to be at this Premier League club - and I can't wait to get going,\" he told Cherries Player HD.\n\"I have done a lot for someone that's only 22. I've had injuries, I've been out on loan to six different clubs, so I've played for a lot of different clubs in my young career so far.\n\"I've learned a lot definitely - good things and bad things - and I'm just going to take it all on board and keep improving while I'm here at Bournemouth.\n\"The manager here is a young manager so he obviously understands how young players think.\n\"He just wants to get the best out of me and that's what I want to do.\"\nAfobe could make his debut in Tuesday's home clash with West Ham which kicks off a crucial spell for Howe's side.\nThey host relegation rivals Norwich on Saturday before going to second-bottom Sunderland a week later.\nHowe made 11 changes for Saturday's 2-1 FA Cup win at Birmingham and knows their Barclays Premier League future could hinge on the next few games.\n\"It is a big period coming us for us. We are well aware of the importance of the games and that's why on Saturday we felt it was prudent to make the changes we did,\" he said, with the Cherries 16th in the league.\n\"We can't under-estimate the importance of the next few weeks in terms of our destiny this season.\n\"We want to make sure the players we have are fresh enough to do themselves justice in the schedule coming up.\"\nAfobe's deal eclipses the £8million Bournemouth paid for Tyrone Mings with Howe looking for reinforcements.\n\"We would have had some real riches if we hadn't had the injuries we've had this season so we've had to battle on with the squad we have,\" he said.\nBut the club are still waiting on clearance for on-loan Roma forward Juan Iturbe after his move last week.","url":"https://www.dailymail.co.uk/wires/pa/article-3392786/Benik-Afobe-completes-Bournemouth-Wolves.html"}
