{"authors":["Associated Press"],"date_download":"2018-10-23 01:02:37","date_modify":"2018-10-23 01:02:37","date_publish":"2016-01-29 14:39:27","description":"NEW YORK (AP) — Tony Bennett really belongs in a different category at this year's Grammy Awards than the one he's dominated for the past quarter-century. Th...","filename":"data/vaneerConsumption/BennettshowcaseshisjazzartistryonGrammynominatedCD.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:5d712aa72cdc4d0fb8dfc44a7a877aa1-3bmscybNe842cce83474b56c1a44-307_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422866_Bennett-showcases-jazz-artistry-Grammy-nominated-CD_1540256557.html","title":"Bennett showcases his jazz artistry on Grammy-nominated CD","title_page":"Bennett showcases his jazz artistry on Grammy-nominated CD | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bennett showcases his jazz artistry on Grammy-nominated CD\nNEW YORK (AP) — Tony Bennett really belongs in a different category at this year's Grammy Awards than the one he's dominated for the past quarter-century.\nThe 89-year-old Bennett once again finds himself nominated for best traditional pop vocal album for \"The Silver Lining: The Songs of Jerome Kern,\" alongside Barry Manilow, Josh Groban, Seth MacFarlane and, surprisingly, Bob Dylan.\nIt's a category Bennett has won 12 times since it was established in 1992, including last year for \"Cheek to Cheek,\" his duets album with Lady Gaga.\nThis August 2015 photo released by Sony Music shows Tony Bennett, left, with pianist Bill Charlap in New York. Bennett is nominated for best traditional pop vocal album for \"The Silver Lining: The Songs of Jerome Kern.\" (Kelsey Bennett/Sony Music via AP)\nBut unlike his recent high-profile, chart-topping duets albums with Gaga and other contemporary pop stars, \"Silver Lining\" is a sublime, intimate collaboration with pianist Bill Charlap.\n\"I think it should be a jazz album because of Bill Charlap, who's a great jazz piano player. That's the reason I made the album,\" said Bennett, interviewed at his art studio overlooking Central Park. \"I just can't believe how much he understands the piano, knowing when to stop, when to go on a long run and when to keep it very simple.\"\nCharlap, the son of Broadway composer Moose Charlap (\"Peter Pan\") and pop singer Sandy Stewart, shares Bennett's devotion to the Great American Songbook. They decided to do a songbook album honoring Jerome Kern, who Bennett says inspired George Gershwin and all the other great American songwriters who came after him.\n\"Kern's the angel at the top of the tree of popular songwriters,\" said Charlap in a telephone interview. \"He's got one foot in Europe and one foot in America.\"\nThe album includes the 1914 ballad \"They Didn't Believe Me,\" which Bennett says \"still sounds like a brand-new song.\" There's also \"Make Believe\" from Kern and Oscar Hammerstein II's 1927 musical \"Show Boat,\" whose story-driven theme about racial prejudice transformed American musical theater.\nThe three piano-vocal duet tracks, including \"The Way You Look Tonight\" and \"All the Things You Are,\" evoke memories of Bennett's two classic 1970s albums with the introspective jazz pianist Bill Evans. Charlap and his wife, Renee Rosnes, play dual pianos on four tracks, including a poignant \"The Last Time I Saw Paris,\" written by Kern in 1940 after the Nazis overran France. Half of the 14 tracks feature Charlap's long-time trio with bassist Peter Washington and drummer Kenny Washington.\nCharlap says Bennett shares the quality of the great jazz singers because he doesn't sing on top of the accompaniment but instead becomes part of the band.\n\"On an expressive level, Tony's gotten deeper and deeper over the years. ... His singing has wisdom and experience in the most beautiful way yet it's very powerful.\"\nBennett says he doesn't know how to categorize himself. \"All I try to do when I perform is to try and make people happy,\" he said.\n\"I'm so fortunate because here I am going on 90 years old and my voice is in top shape. ... I have what I call a blessed life. I'm doing what I love and I'll never retire. Till the day I die I'm going to sing and paint and try to get better and better.\"\n___\nOnline:","url":"https://www.dailymail.co.uk/wires/ap/article-3422866/Bennett-showcases-jazz-artistry-Grammy-nominated-CD.html"}
