{"authors":["Breitbart News"],"date_download":"2018-10-30 18:21:19","date_modify":"2018-10-30 18:21:19","date_publish":"2015-11-19 00:14:49","description":"Breitbart News Senior Editor-at-Large and DailyWire.com Editor-in-Chief Ben Shapiro will be speaking at the University of Missouri.","filename":"data/vaneerConsumption/BenShapiroPreparestoCrashMizzouSafeSpace.json","image_url":"https://media.breitbart.com/media/2015/11/unnamed-10.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_11_18__1540923679.html","title":"Ben Shapiro Prepares to Crash Mizzou 'Safe Space'","title_page":"Ben Shapiro Prepares to Crash Mizzou 'Safe Space'","title_rss":"NULL","source_domain":"breitbart.com","text":"On Thursday night, Breitbart News Senior Editor-at-Large and DailyWire.com Editor-in-Chief Ben Shapiro will be speaking at the University of Missouri.\nHis lecture, sponsored by Young America’s Foundation, is scheduled to take place at Ellis Auditorium on the Columbia campus at 6 PM Central Time. The talk is titled “Truth Is A Microaggression.”\nShapiro vows to bring the fight for free speech to the heart of the beast.\n“I look forward to an honest and open discussion with students,” Shapiro told Breitbart News as he prepared to travel. “The administration caved to the bullies of the radical racial left; so did the political establishment. Somebody has to tell the truth to a group of spoiled college kids so fixated on their own self-appointed victim status that they’re willing to trample American rights.”\nStudents on campus tell Breitbart News that Concerned Student 1950, the group that pushed the ouster of the university president and chancellor, held an emergency meeting on Tuesday night.\nShapiro told Breitbart News that security officers will be present at the event in case of any attempted disruption. “I hope that the protesters of Mizzou abide by basic standards of decent behavior. So far they haven’t,” Shapiro said. “In any case, I look forward to being South Park-ian Reality crashing the Safe Space.”","url":"https://www.breitbart.com/the-media/2015/11/18/breitbarts-ben-shapiro-prepares-for-crashing-the-safe-space-at-mizzou/"}
