{"authors":["Dylan Gwinn"],"date_download":"2018-10-30 19:00:15","date_modify":"2018-10-30 19:00:15","date_publish":"2018-07-03 12:27:38","description":"Actor Ben Stiller has become goodwill ambassador to the United Nations refugee agency (UNHCR).","filename":"data/vaneerConsumption/BenStillerNamedGoodwillAmbassadortoUnitedNationsRefugeeAgency.json","image_url":"https://media.breitbart.com/media/2018/07/benStillerThunder1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2018_07_03__1540926015.html","title":"Ben Stiller Named Goodwill Ambassador to United Nations Refugee Agency","title_page":"Ben Stiller Named Goodwill Ambassador to United Nations Refugee Agency","title_rss":"NULL","source_domain":"breitbart.com","text":"Actor Ben Stiller has been named the newest goodwill ambassador to the United Nations refugee agency (UNHCR).\nThe appointment was made official on Monday after Stiller completed a tour to Guatemala with the UNHCR. On the trip, Stiller met with people from Central America who had fled rampant violence perpetrated by gangs and criminal organizations.\n“Here in Guatemala, the families, including children, that I met experienced fear and violence back home that is beyond imagination,” Stiller said. “They are vulnerable and have suffered immensely. They need help. UNHCR is on the ground here with its partners providing them with support, protection and shelter.\n“I for one will do what I can as a Goodwill Ambassador for UNHCR, to advocate for refugees and encourage others to join me,” the actor added.\nFilippo Grandi, the UN high commissioner for refugees, heaped praise upon Stiller’s appointment.\n“I have witnessed personally his commitment to the world’s refugees and his extraordinary capacity to talk about the complicated issue of displacement in a manner that is clear, passionate and convincing,” Grandi said. “And this is precisely the role of Goodwill Ambassadors: to raise awareness, generate support and give a voice to those who have been forced to leave their homes.”\nFollow Dylan Gwinn on Twitter @themightygwinn","url":"https://www.breitbart.com/entertainment/2018/07/03/ben-stiller-named-goodwill-ambassador-to-united-nations-refugee-agency/"}
