{"authors":["Jo Scrimshire For Daily Mail Australia"],"date_download":"2018-10-22 21:43:14","date_modify":"2018-10-22 21:43:14","date_publish":"2016-01-28 08:41:00","description":"The 50-year-old funnyman told radio show Hamish & Andy that he tried to get the Wikileaks founder to play a brief cameo role in an orgy scene, but he declined for security reasons","filename":"data/vaneerConsumption/BenStillerhadplansforJulianAssangecameoinZoolander2.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/04/30A6BFD000000578-0-image-a-96_1453955892919.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420418_Ben-Stiller-reveals-plans-controversial-Julian-Assange-cameo-Zoolander-sequel_1540244594.html","title":"Ben Stiller had plans for Julian Assange cameo in Zoolander 2","title_page":"Ben Stiller had plans for Julian Assange cameo in Zoolander 2 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"His new film is packed to the rafters with A-list celebrity cameos - from pop's comeback kid Justin Bieber to Anna Wintour, editor-in-chief of fashion bible Vogue\nBut funnyman Ben Stiller has revealed there's one famous face he couldn't get on board for the eagerly anticipated Zoolander sequel - controversial Wikileaks founder Julian Assange.\nIn an interview with Fox FM's Hamish and Andy on Wednesday, the 50-year-old revealed that he asked the Australian journalist to play a brief role in the follow-up to his 2001 cult comedy.\nScroll down for video\nSharply dressed: Zoolander No. 2 star Ben Stiller, 50, revealed on the Hamish & Andy Fox FM radio show on Wednesday that he offered Wikileaks founder Julian Assange a racy cameo in the comedy sequel\nHowever, Julian was unable to film the scenes because he 'couldn't get out' of the Ecuadorian Embassy in London, having been granted political asylum there in August 2012.\nBen, from New York City, told the radio station: '[We] tried to get Julian Assange in the movie. But he said he couldn't get out.'\nHe then explained Julian's proposed cameo to the Melbourne-based DJs, saying: 'We were going to have him, like, via satellite in the orgy.'\nCameo: Julian Assange, the founder of whistle-blowing service Wikileaks, was offered a cameo in Zoolander No. 2, but his 'security situation' didn't allow it. He currently resides in the Ecuadorian Embassy in London\nThe following day, Ben clarified his comments during an interview on KIIS 1065's The Kyle and Jackie O Show.\nHe told the hosts, '(Julian) would have been part of Hansel's orgy', referring to Owen Wilson's character, Hansel McDonald, a male model who participated in group sex in the original film.\n'We would have had him be a satellite on the monitor', Ben continued, confirming that Julian would only be an observer in the racy scene.\nJulian, from Queensland, applied to live under the diplomatic protection of the government of Ecuador in 2012 amid an investigation by Swedish prosecutors for accusations of sexual misconduct.\nJulian is also wanted for alleged espionage by United States authorities over his Wikileaks activities and fears if he goes to Sweden for questioning he will then be extradited to the US.\nOn Wednesday, Wikileaks gave the following statement to The Washington Times: 'Julian’s a fan of Ben’s films.\nRadio DJs: Melbourne-based Fox FM co-hosts Hamish Blake, 34, (left), and Andy Lee, also 34, (right) posed for a photo with Ben (centre), who directed, co-wrote and starred in Zoolander No. 2\n'The two spoke for half an hour but Julian’s security situation precluded the filming proposed. So no (Assange) cameo until his freedom and Zoolander 3.'\nMeanwhile, Ben has spent the last few days Down Under promoting Zoolander No. 2, which he co-wrote and directed.\nIn the comedy sequel, Ben reprises the title role as dim-witted male model Derek Zoolander, alongside a host of celebrities in cameo parts.\nHe even posed from the giddy heights of Sydney Harbour Bridge in character as part of a viral publicity stunt on Thursday.\nZoolander No. 2 is released in theatres February 11.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420418/Ben-Stiller-reveals-plans-controversial-Julian-Assange-cameo-Zoolander-sequel.html"}
