{"authors":[],"date_download":"2018-10-21 02:48:09","date_modify":"2018-10-21 02:48:09","date_publish":"2018-08-08 14:55:50","description":"Ben comes to us from Politico Magazine, where he has spent the past year and a half writing features, investigations and columns that focused on the intersection of sports, politics and media.","filename":"data/vaneerConsumption/BenStraussjoinsSports.json","image_url":"https://www.washingtonpost.com/resizer/ZIwdtFReqPMJh15-SBE1si-PDjE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/K745CI4HXM5QBLJKZWU3RUL5MU.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_08_08__1540090089.html","title":"Ben Strauss joins Sports","title_page":"Ben Strauss joins Sports - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Announcement from Sports Editor Matt Vita and Deputy Sports Editor Matt Rennie:\nWe’re excited to announce that Ben Strauss will be joining Sports to cover sports and media.\nBen comes to us from Politico Magazine, where he has spent the past year and a half writing features, investigations and columns that focused on the intersection of sports, politics and media. Before his work with Politico, Ben was the Chicago-based sports reporter for The New York Times, where he wrote sports and business stories, including several investigations. He broke several stories while at The Times, including Major League Baseball’s plans to allow the signing of Cuban players and efforts by the Northwestern University football team to unionize.\nWhile writing for The Times, Ben teamed up with columnist Joe Nocera on stories investigating the NCAA. Their efforts resulted in a co-authored book, “Indentured: The Inside Story of the Rebellion Against the NCAA,” which explored the movement to reform college athletics.\nBen, a 2008 graduate of Ithaca College, has also worked as a press secretary to Rep. Mike Quigley from Chicago and helped launch a local online sports magazine, ChicagoSide Sports. Ben lives with his wife, attorney Samantha Swietlikowski, in Northwest DC.\nBen’s first day in the newsroom will be Sept. 4. Please join us in welcoming him.","url":"https://www.washingtonpost.com/pr/wp/2018/08/08/ben-strauss-joins-sports/"}
