{"authors":[],"date_download":"2018-10-22 20:43:47","date_modify":"2018-10-22 20:43:47","date_publish":"2014-06-02 15:41:02","description":"The journalist, Sean Smith of the British newspaper The Guardian, was with the soldier in Afghanistan in 2009, days before he vanished.","filename":"data/vaneerConsumption/BergdahlFamilyIsLoyalandPatrioticSaysJournalistWhoMetThem.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/481631/140602-bowe-bergdahl-smokes-pipe-jsw-1131a_b0f425e54763b0e7479658e34a6fbbf7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_bergdahl-family-loyal-patriotic-says-journalist-who-met-them-n120331_1540241027.html","title":"Bergdahl Family Is 'Loyal and Patriotic,' Says Journalist Who Met Them","title_page":"Bergdahl Family Is 'Loyal and Patriotic,' Says Journalist Who Met Them","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA journalist who was embedded with Sgt. Bowe Bergdahl days before he disappeared in Afghanistan said Monday that the family “couldn’t be more loyal and patriotic” and believe “it’s their duty to express when they think something’s wrong.”\nThe journalist, Sean Smith, a staff photographer for the British newspaper The Guardian, was with the soldier in Afghanistan in 2009, little more than a week before he vanished from an outpost. Smith later spent time with Bergdahl’s father in Idaho.\nBergdahl, 28, the only American prisoner of war from the Afghan conflict, was released over the weekend in exchange for five Taliban prisoners being held at Guantanamo Bay, Cuba.\nU.S. military officials confirmed to NBC News that Bergdahl walked away from the outpost without his weapon, carrying only a compass and a bottle of water. Some soldiers have labeled him a deserter. A medic with Bergdahl’s unit told NBC News that he “willfully left.”\nSome Republicans in Congress have expressed outrage at the trade, and have promised hearings.\nSmith, the journalist, described Bergdahl as soft-spoken and thoughtful, and said he served with a group of reflective and intelligent young men. Some in the group questioned “what are we doing here” and thought that Afghans “just want to be left alone,” he said.\nSmith said he had no insight into the circumstances of Bergdahl’s disappearance, but he said he didn’t get the impression that anyone in the group was “manically depressed at all.”\n“Any sort of questioning of generally ‘what are we doing here,’ it wasn’t a unique thing,” Smith said by phone. “I felt pretty sure that they, and he in particular, would be able to come through the experience.”\nOver the weekend, The Guardian posted a 12-minute video, shot by Smith earlier this year, in which Bergdahl’s father, Bob, talks about his complex feelings about the Afghan conflict.","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/bergdahl-family-loyal-patriotic-says-journalist-who-met-them-n120331"}
