{"authors":[],"date_download":"2018-10-22 20:37:55","date_modify":"2018-10-22 20:37:55","date_publish":"2014-06-02 16:05:50","description":"Doctors at an American military hospital in Germany say they are paying special attention to Bergdahl’s diet.","filename":"data/vaneerConsumption/BergdahlStableatHospitalHasNotSpokenToParentsMilitary.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/479411/140531-bowe-bergdahl-mn-1350_3acc93b89b544e51781d7af92bddd3ca.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_bergdahl-stable-hospital-has-not-spoken-parents-military-n120351_1540240675.html","title":"Bergdahl Stable at Hospital, Has Not Spoken To Parents: Military","title_page":"Bergdahl Stable at Hospital, Has Not Spoken To Parents: Military","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSgt. Bowe Bergdahl, the prisoner of war released after five years in captivity in Afghanistan, was in stable condition Monday at a military hospital in Germany, where doctors are paying special attention to his diet, the military said.\nThe sergeant, 28, has not spoken to his parents, and will do so when he and his psychologists believe the time is right, military officials told NBC News.\nIn the meantime, Bergdahl is being interviewed by military and intelligence officials, who want to learn more about his time in captivity, the officials said.\nThey said that Bergdahl was receiving medical and psychological evaluation and treatment, and that it was not clear how long those steps would take. A military psychologist has also been assigned to the parents — all routine steps after a hostage return.\n“There is no pre-determined amount of time involved in the reintegration process,” the hospital, Landstuhl Regional Medical Center in Germany, said in a statement. The hospital said it would move “at a pace with which he is comfortable.”\nBergdahl was flown to the hospital Sunday after he was handed over by Taliban operatives near the Afghan-Pakistani border in exchange for the release of five suspected militants from the American prison at Guantanamo Bay, Cuba.\nPart of Bergdahl’s treatment is “attention to dietary and nutrition needs after almost five years in captivity,” the hospital said.\nThe next step would be reintegration into society, including a homecoming to the United States.\n— Jim Miklaszewski and Erin McClam","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/bergdahl-stable-hospital-has-not-spoken-parents-military-n120351"}
