{"authors":[],"date_download":"2018-10-22 21:42:35","date_modify":"2018-10-22 21:42:35","date_publish":"2014-06-06 08:24:01","description":"Soldier freed after years in Taliban captivity is getting medical treatment, and being debriefed by intelligence and assessed by psychologists.","filename":"data/vaneerConsumption/BergdahlIsTalkingandBecomingMoreEngagedHospitalSays.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/479431/140531-bowe-bergdahl-mn-1400_0_5060c22af3f093a5a6a0418209a24da0.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_bergdahl-talking-becoming-more-engaged-hospital-says-n124271_1540244555.html","title":"Bergdahl Is Talking and 'Becoming More Engaged,' Hospital Says","title_page":"Bergdahl Is Talking and 'Becoming More Engaged,' Hospital Says","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSgt. Bowe Bergdahl is talking and showing signs of daily improvement at the military hospital in Germany where he is recovering following nearly five years in Taliban captivity, the medical center treating him said Friday.\n\"Bergdahl is conversing with medical staff and becoming more engaged in his treatment care plan,\" said a statement from the U.S. military hospital in Landstuhl, Germany.\nHis health \"continues to improve daily\" and resting better, the statement added.\nIn addition to getting medical treatment in Landstuhl, Bergdahl was being debriefed by intelligence officers and assessed by psychologists. The Pentagon has said he is in stable condition, but officials have offered no clue about when he might come back.\nUpdates on his treatment come amid a fierce debate on Capitol Hill and inside the military on whether the Obama administration should have traded him for five Taliban commanders held at Guantanamo. Former members of Bergdahl’s platoon have described him as a deserter who walked away from his outpost.\nOn Thursday, The Associated Press reported that the Obama administration did not notify senators of the prisoner swap because the Taliban threatened to kill Bergdahl if the news was leaked.\nHis hometown of Hailey, Idaho, cancelled planned celebrations to mark his return after some town officials were deluged with angry calls from people who think Bergdahl is a deserter or traitor who doesn't deserve a hero's welcome.\n- F. Brinley Bruton","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/bergdahl-talking-becoming-more-engaged-hospital-says-n124271"}
