{"authors":[],"date_download":"2018-10-22 20:37:48","date_modify":"2018-10-22 20:37:48","date_publish":"2014-06-02 10:55:22","description":"\"Highly capable military health care providers will evaluate his condition, begin any necessary medical care and assist in his recovery process.\"","filename":"data/vaneerConsumption/BergdahlBeginsReintegrationatUSMedicalCenterinGermany.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/480786/140602-bowe-bergdahl-7a_ed5b1053ad4f00f780a33278616b0d16.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_bergdahl-begins-reintegration-u-s-medical-center-germany-n120066_1540240668.html","title":"Bergdahl Begins 'Reintegration' at U.S. Medical Center in Germany","title_page":"Bergdahl Begins 'Reintegration' at U.S. Medical Center in Germany","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThere was no telling how long Sgt. Bowe Bergdahl would spend at an American military medical center in Germany after having been freed by militants in Afghanistan over the weekend, according to U.S. officials.\n\"Trained and highly capable military health care providers will evaluate his condition, begin any necessary medical care and assist in his recovery process,\" according to a statement issued by Landstuhl Regional Medical Center in Germany on Sunday. \"There is no pre-determined amount of time involved in the reintegration process.\"\nOfficials did not release any information on Bergdahl's physical or mental state, although Defense Secretary Chuck Hagel told NBC's \"Meet the Press\" that Congress was not told earlier about the operation to free Bergdahl because it was believed the soldier's life was in danger.\nIntelligence suggested that the soldier's \"health was deteriorating,\" he said. \"This was essentially an operation to save the life of Sgt. Bergdahl.'","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/bergdahl-begins-reintegration-u-s-medical-center-germany-n120066"}
