{"authors":["Ian Hanchett"],"date_download":"2018-10-30 18:13:27","date_modify":"2018-10-30 18:13:27","date_publish":"2017-02-03 15:34:46","description":"On Thursday's broadcast of \"CNN Tonight,\" UC-Berkeley Professor of Public Policy and former Labor Secretary Robert Reich stated \"I've heard that there was | Video","filename":"data/vaneerConsumption/BerkeleyProfReichIWouldntBetAgainstBerkeleyRiotBeingAffiliatedWithTheRightWingThatsAffiliatedwithBreitbart.json","image_url":"https://media.breitbart.com/media/2017/02/Reich-22-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2017_02_03__1540923207.html","title":"Berkeley Prof Reich: 'I Wouldn't Bet Against' Berkeley Riot Being Affiliated With 'The Right Wing' That's Affiliated with Breitbart","title_page":"Berkeley Prof Reich: 'I Wouldn't Bet Against' Berkeley Riot Being Affiliated With 'The Right Wing' That's Affiliated with Breitbart | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Thursday’s broadcast of “CNN Tonight,” UC-Berkeley Professor of Public Policy and former Labor Secretary Robert Reich stated “I’ve heard that there was some relationship” between the rioters at Breitbart Editor Milo Yiannopoulos’ speech at UC-Berkeley and “the right-wing movement that is affiliated with Breitbart News.” Reich added that he “wouldn’t bet against” the riot being a strategy orchestrated by people on the right.\nReich said, “I was there for part of last, and I know what I saw, and those people were not Berkeley students. Those were outsiders, agitators. They — I’ve never seen them before. For — I — you know, there’s rumors that they actually were right-wingers. They were part of a, kind of a group that were organized and ready to create the kind of tumult and danger you saw that forced the police to cancel the event. So, Donald Trump, when he says Berkeley doesn’t respect free speech rights, that’s a completely distortion — that’s a complete distortion of the truth. I mean, Berkeley opened its biggest auditorium to this right-wing Breitbart News character, this hateful odious person, but said, free speech is the most important thing we stand for, and it was these outsiders who caused the police to finally come in and have cancel it.”\nWhen asked if he thought the strategy put on by people on the right, Reich answered, “I wouldn’t bet against it, Don. I — again, I saw these people. They were very — they all looked very, almost paramilitary. They were not from the campus. And I’ve heard — again, I don’t want to say factually, but I’ve heard that there was some relationship there between these people and the right wing, and the right-wing movement that is affiliated with Breitbart News.”\nReich later added that we don’t know who was behind the riots.\n(h/t Mediaite)\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/video/2017/02/03/berkeley-prof-reich-i-wouldnt-bet-against-berkeley-riot-being-affiliated-with-the-right-wing-thats-affiliated-with-breitbart/"}
