{"authors":["Caroline May"],"date_download":"2018-10-30 20:25:40","date_modify":"2018-10-30 20:25:40","date_publish":"2015-10-13 14:43:20","description":"Sen. Bernie Sanders Gets Second Congressional Endorsement for 2016 race","filename":"data/vaneerConsumption/BernieSandersGetsSecondCongressionalEndorsement.json","image_url":"https://media.breitbart.com/media/2015/10/GettyImages-488741492-ellison.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_13__1540931140.html","title":"Bernie Sanders Gets Second Congressional Endorsement","title_page":"Bernie Sanders Gets Second Congressional Endorsement","title_rss":"NULL","source_domain":"breitbart.com","text":"Bernie Sanders has scored his second congressional endorsement ahead of the first Democratic presidential presidential debate.\nRep. Keith Ellison (D-MN) threw his support behind the Vermont socialist in his bid for the presidency Monday, praising Sanders’ ability to rally voters to his progressive message.\n“I’m endorsing Bernie because he is talking about the issues that are important to American families,” Ellison said in a statement. “His candidacy is important for many reasons, but I believe the most important part of his candidacy is that it has the ability to create a renaissance in voter participation, which was at its lowest in decades this past election cycle.”\nEllison co-chairs the Congressional Progressive Caucus with Raul Grijalva, who became the the first House member to endorse Sanders last week. Sanders, an open socialist, founded the caucus in 1991.\nEllison pointed specifically to the large crowds Sanders has attracted in recent months, saying they are “a testament to his message connecting with people.”\nWe’ve all seen the massive crowds he is attracting, and I think that is a testament to his message connecting with people – people we will need to turn out in November.”\nSanders repaid the favor, and called Ellison one of the “great progressive leaders in the country.”\n“I look forward to working with him to create a government which represents all Americans and not just the billionaires,” Sanders said.\nWhile Sanders has received a couple congressional endorsements and has been gaining in the polls, his congressional backers pale in comparison to more than 100 House endorsements Hillary Clinton has received.\nTuesday evening both Sanders and Clinton will appear on stage in Nevada for the Democratic presidential debate, as will Jim Webb, Lincoln Chafee, and Martin O’Malley.","url":"https://www.breitbart.com/politics/2015/10/13/bernie-sanders-gets-second-congressional-endorsement/"}
