{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:47:14","date_modify":"2018-10-30 19:47:14","date_publish":"2016-01-24 17:21:08","description":"Gun control is a job for federal office-holders rather than state governments, Democrat presidential hopeful Bernie Sanders said during the January 24 airing of Face the Nation. |","filename":"data/vaneerConsumption/BernieSandersGunControlTheJoboftheFederalGovernment.json","image_url":"https://media.breitbart.com/media/2016/01/Bernie-shadows-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_24__1540928834.html","title":"Bernie Sanders: Gun Control The Job of the Federal Government","title_page":"Bernie Sanders: Gun Control The Job of the Federal Government | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Host John Dickerson brought up the issue via a quote from Howard Dean, whom he described as “another liberal Vermont Democrat.” Dickerson pointed out that in 2004 Dean said, “Just let the state’s do what they want and get it off the Democratic agenda.” Dickerson then looked at Sanders and asked, “Do you believe that in the end the gun control issue is not really one for the president but it’s something for the states to decide.”\nSanders responded:\nNo. I don’t believe that. I don’t believe that at all. And way back when, in 1988 when I first ran for Congress, I may have lost a statewide election by three points because I thought it was a bad idea for us to be selling military-style “assault weapons” in this country.\nLook, when we have these horrific mass killings. When people walk into a church and start shooting people [or] walk into a school, this is an issue that we’ve got to deal with. And I support what President Obama is trying to do in dealing with this gun show loophole. We have to try to strengthen the instant background checks. Our goal as a nation…is to make sure that guns do not fall into the hands of people who should not have them. People who have criminal backgrounds, who are mentally ill. The federal government does have a very important role.","url":"https://www.breitbart.com/politics/2016/01/24/bernie-sanders-gun-control-the-job-of-feds-rather-than-states/"}
