{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 20:24:22","date_modify":"2018-10-30 20:24:22","date_publish":"2015-10-14 14:04:13","description":"Bernie Sanders gave a victory speech to a crowded room of 300 supporters after the Democratic debate last night at the Wynn Las Vegas.","filename":"data/vaneerConsumption/BernieSandersandtheGOP.json","image_url":"https://media.breitbart.com/media/2015/10/GettyImages-492526812.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_14__1540931062.html","title":"Bernie Sanders and the GOP","title_page":"Democratic Debate's Big Losers: Bernie Sanders and the GOP","title_rss":"NULL","source_domain":"breitbart.com","text":"LAS VEGAS — Bernie Sanders gave a victory speech to a crowded room of 300 supporters after the Democratic debate last night at the Wynn Las Vegas.\nDespite a solid performance onstage, however, Sanders took the issue of Hillary Clinton’s emails off the table for the duration of the Democratic primary. And Republicans, by failing to push back hard enough in post-debate spin, have undercut their ability to bring up the issue in the general election.\nSanders won applause from the media with the so-called “line of the night”: “”The American people are sick and tired of hearing about your damn emails!”\nJournalists see the emails as a shiny object, a way to tell a story about Hillary Clinton’s weaknesses as a politician. But they are much more than that. The emails may reveal Clinton’s efforts on behalf of her family’s foundation, and may also hold the final clues to the lingering mystery of Benghazi.\nIf Sanders cares as much about corruption, cronyism and self-dealing among the political elite as he purports to do, then he should make the emails the focus of his campaign. He should argue that we can’t elect a president who uses public office as a way to enrich herself, and who hides the evidence that she has done so. Who knows what Wall Street favors are in those deleted emails?\nBut Sanders chose to make the emails about Republicans, not Hillary. He won the short-term applause of the media–and lost the one issue that would have given him long-term leverage.\nRepublicans have done their own part to make that easier. Certainly Kevin McCarthy did his party no favors by boasting that the Benghazi committee and the email issue had driven down Clinton’s poll numbers.\nBut they need to do so much more. They should be in front of the cameras each and every day telling the American people that the Democratic frontrunner belongs in prison, where any ordinary person would be if they did what she has done.\nSean Spicer of the Republican National Committee was on hand in the spin room at the Wynn to give his party’s take on the debate. But there should have been a full-court press. Democrats brought throngs of demonstrators to the Republican presidential debate in California last month, for example: there were no Republican protestors within sight of the Wynn. And Spicer doesn’t get in opponents’ faces the way Debbie Wasserman Schultz does.\nSay what you will about Wasserman Schultz’s demeanor, or her ridiculous talking points. She does what she needs to do to frame GOP debates in ways Democrats can exploit.\nAside from Donald Trump, who live-tweeted the debate, which Republican framed the debate to their advantage?\nIf this goes on, the GOP will lose to Hillary–badly.","url":"https://www.breitbart.com/politics/2015/10/14/democratic-debates-big-losers-bernie-sanders-and-the-gop/"}
