{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-31 00:03:52","date_modify":"2018-10-31 00:03:52","date_publish":"2016-12-05 00:00:00","description":"'The age of industrialization is coming to an end,' due to the rise of robotics and China's modernising economy, argues Bernstein.","filename":"data/vaneerConsumption/BernsteinChinarobotsandtheendofAdamSmithsWealthofNations.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bernstein-china-robots-and-the-end-of-adam-smiths-wealth-of-nations-2016-12_1540944232.html","title":"Bernstein: China, robots, and the end of Adam Smith's Wealth of Nations","title_page":"    Bernstein: China, robots, and the end of Adam Smith's Wealth of Nations - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Workers exchange spools of thread as a robot picks up thread made from recycled plastic bottles at the Repreve Bottle Processing Center, part of the Unifi textile company in Yadkinville, N.C., Friday, Oct. 21, 2016. AP Photo/Chuck Burton Analysts at global investment manager Bernstein believe the \"age of industrialization is coming to an end,\" with robots set to destroy manufacturing jobs globally.\nThat may not sound seismic. After all, the industrial revolution happened hundreds of years ago and manufacturing jobs have been the minority of all jobs in the West for decades. But Bernstein is arguing that the nature of capitalism is undergoing a fundamental change.\nAnalysts Michael W. Parker and Alberto Moel argue that Adam Smith's Wealth of Nations, the foundational textbooks of economics, is becoming redundant because of two trends: the rise of robotics and China's modernising economy.\nParker and Moel say Smith's book, published in 1776, \"remained broadly relevant to capital allocation decisions globally\" for the last 240 years but is fast becoming out of date. They say:\n\"Smartphones and online-to-offline apps give unskilled workers options for making a living that do not involve setting foot in developing market factories. Automation is making manufacturing activity cheaper and less labor intensive. Income inequality in developing markets will rise when work means competing against other unionizing.\"\nBernstein's central argument is that manufacturing jobs are effectively disappearing globally, replaced by robots. China is leading the way but the trend is global and it means promises made by politicians like Donald Trump to bring overseas industries back to America are unlikely to benefit working people generally.\n'China is not getting rid of the work. It is just getting rid of the workers.'\nParker and Moel's argument hinges on Adam Smith's Wealth of Nations, a key textbook for any economics course. To understand what they're saying you have to understand what Smith said.\nA bust of Adam Smith. Adam Smith Business School/Wikimedia Commons Smith argued that: \"If an individual, a company, or a country has an advantage in producing something, then that individual, company or country should specialize in producing that one thing, and trade for everything else,\" Parker and Moel summarise.\nThese forces of specialisation, combined with differing average wages globally, led to the industrialisation of Asia over the last 50 years as the production of more and more goods was outsourced to cheaper manufacturing bases. Where exactly depended on the stages of industrialisation and development. Bernstein says: \"Low-cost manufacturing has bounced around (mainly) Asia for decades to take advantage of this deep pool of low-cost labor.\"\nIt was this \"bouncing\" around that helped drive economic development in emerging markets as different countries became specialists in producing everything from radios to t-shirts.\nBut that bounce of labour could be coming to an end. Bernstein says: \"China is taking a different approach when it comes to how to deal with the mismatch between high-cost employees and low-cost manufacturing. Specifically, China is not getting rid of the work (or not all of it). It is just getting rid of the workers.\"\nParker and Moel point to this chart highlighting China's huge spending on robotics — around $3 billion annually: Bernstein\nThis investment is already filtering into fewer manufacturing jobs. Foxconn, a key manufacturing partner for Apple, Google, Amazon, and the world's 10th largest employer, has already replaced 60,000 workers with robots.\nBut Bernstein has been tracking the Chinese jobs market for the last year through a vacancy listings website. It says vacancies and wages have shot up — by around 68% and 4.5% over the last year. On the surface, that would be a positive thing for China. But Parker and Moel say, \"The more complex manufacturing tasks are being automated, and the workers are moving into the services sector\" and not the manufacturing sector. Manufacturing jobs simply aren't being created any more because they are all being taken by China's burgeoning army of factory robots.\nIn turn, that means roles that would have been shipped overseas to cheaper markets are being done by robots, domestically. Bernstein say: \"The ability of new emerging markets to grab these jobs and the export activity that comes with them will be eroded [and] ... will militate in favor of automation and staying in China.\"\nThat means other countries that once could have expected to add jobs that service the Chinese manufacturing sector will now never see those jobs — because they're being done by robots inside China.\n'The activity may come \"home\", but there are simply no jobs to steal'\nIt's not just emerging markets that will feel the change. Bernstein believes the rise of robotics will hit America too.\nPresident-elect Donald Trump has promised to on-shore many industries and bring back well-paid manufacturing jobs. But the economics simply aren't there, argue Bernstein.\nIf a company is forced to start making T-shirts in the US rather than, say, Bangladesh where the wage and other costs are cheaper, the company will look to cut costs to make it economically viable. Tariffs on competing imported goods would have to be huge to eliminate the benefit of both lower labour costs and increased automation going on abroad.\nSo what's the easiest way for a company to reduce costs? Invest in robotics and eliminate the need to pay wages. Automation is the easiest way to cut costs.\nParker and Moel say:\n\"It is still possible to force the relocation of production through the introduction of tariffs and quotas. However, if the point of the exercise is to restore well-paying, middle-class jobs in manufacturing in the process, the result is going to disappoint. Any such effort today is likely to result in greater and greater degrees of automation. The activity may come 'home', but there are simply no jobs to steal. Mandating a physical task be carried out in a high-cost labor market in 2017 is simply going to increase the chances the task is automated.\"\nTrump may struggle to fulfil his promise to bring well-paid manufacturing jobs back to the US — they don't exist anymore. AP Photo/Charles Krupa Increased automation and robotics are already happening in the US. Two of the world's ten largest employers globally — Walmart and the US Department of Defence — are using drones, for warehouse delivery and surveillance respectively.\nAmerica has lost more than 7 million factory jobs since manufacturing employment peaked in 1979, the Associated Press reported. At the same time, factory production more than doubled over the same time to $1.91 trillion last year, according to the Commerce Department.\nAll of this suggests that \"the widely-held belief that Adam Smith's 18th-century observation about specialization can be reversed,\" Bernstein say. In the new global economy, the winners will be those with the best robots who can serve all their domestic needs, not countries who can develop a marketable specialism.\nThe Fourth Industrial Revolution\nBernstein's analysis may seem alarmist. But is not a lone voice.\nThe World Economic Forum (WEF) predicted a \"Fourth Industrial Revolution\" at the start of this year as automation and robotics transform the global economy and the way we work.\nIt will likely be a painful change — WEF expects 5 million jobs to be destroyed by 2020 by the trends. An in-depth study by Citi and Oxford University predicted that 77% of all jobs in China are at risk of automation and 57% of all jobs across the OECD.\nIt's not simply manufacturing jobs either. IBM's artificially intelligent computer Watson is apparently better at diagnosing cancer than humans and the Associated Press is trialling automated reporting of company results, pointed to the automation of middle-class jobs once seen as unassailable by technology. Lord Adair Turner, the former vice chairman of Merrill Lynch Europe and ex-head of the Britain's financial watchdog, told Business Insider he believes we could be \"at a turning point in the nature of capitalism\" driven by technology.\nDeliveroo drivers protesting low wages outside the company's London headquarters. PA Images The key question that has not yet been answered is whether this \"Fourth Industrial Revolution\" simply changes the jobs market or leads to fewer jobs.\nPast industrial revolutions have destroyed jobs but also created better-paid roles: the horse and cart driver moved into the Ford factories to build cars. Bernstein's analysis of the Chinese jobs market is encouraging — more service sector jobs at higher pay.\nBut not everyone is so optimistic. The Citi and Oxford study found that: \"Today's technology sectors have not provided the same opportunities, particularly for less educated workers, as the industries that preceded them.\" They predicted that \"inequality between the 1 percent and the 99 percent may widen as workforce automation continues.\"\nLord Turner echoed these findings, telling BI: \"There's a certain sort of equality of citizenship that requires that everybody does OK. I think that may breakdown. I think it may breakdown because of the fundamental nature of technology.\"\nEconomist Guy Standing coined the term \"precariat\" to refer to people in precarious, low-benefit, and low-paid employment, often driven by technology. Think of Uber drivers and Deliveroo couriers.\nWhether the tech \"precariat\" becomes the new normal or simply a transitional phase during these economic ructions remains to be seen.","url":"https://www.businessinsider.com/bernstein-china-robots-and-the-end-of-adam-smiths-wealth-of-nations-2016-12"}
