{"authors":["Stephen Johnson For Daily Mail Australia"],"date_download":"2018-10-23 02:51:53","date_modify":"2018-10-23 02:51:53","date_publish":"2017-04-26 14:06:16","description":"Cory Bernardi's Australian Conservatives are amalgamating with Family First. He used an interview on the ABC to attack a senior minister in the Turnbull government 'as standing for nothing'.","filename":"data/vaneerConsumption/BernardisAustralianConservativesandFamilyFirstmerge.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9FB30800000578-0-image-a-34_1493210408434.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447382_Cory-Bernardi-Australian-Conservatives-merge-Family-First_1540263113.html","title":"Bernardi's Australian Conservatives and Family First merge","title_page":"Bernardi's Australian Conservatives and Family First merge | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Right-wing senator Cory Bernardi's Australian Conservatives party is amalgamating with Family First.\nThe outspoken senator left the Liberal Party in February after a decade with the party in federal parliament.\nHowever, only weeks after formally becoming an Australian Conservatives senator he has announced his party is merging with Family First.\nSenator Bernardi has refuted a suggestion from senior Turnbull government minister Christopher Pyne that the Australian Conservatives party was struggling to attract support.\nMr Pyne comes from the Liberal Party in South Australia, which Senator Bernardi was a member of for 30 years.\nScroll down for video\nSenator Cory Bernardi's Australian Conservatives are merging with Family First\nTurnbull government minister Christopher Pyne has questioned if the Australian Conservatives could survive without a merger with Family First\n'If there was no threat to Christopher Pyne, he wouldn't be making any comments whatsoever,' Senator Bernardi told ABC 7.30 host Leigh Sales on Wednesday.\n'Within these sort of troublemakers or power brokers, as they like to style themselves within the Liberal Party, they're responsible for the dysfunction that's there for the disillusionment by the public because people like Christopher Pyne don't stand for anything.'\nIn the same interview, Senator Bernardi had to awkwardly explain why a new Family First lawmaker born in Kenya didn't join his party.\nHis party merger plans were thrown into disarray in federal parliament after new South Australian senator Lucy Gichuhi announced that she would sit in parliament as an independent rather than as a member of the new, merged conservative minor parties.\nShe released a statement on Wednesday explaining her decision to stay away from the Australian Conservatives by quitting Family First.\n'Given the circumstances and the time frames, I have not been able to determine if joining the new entity is the best way for me to serve the people of South Australia,' she said.\n'It is on that basis that I have decided to serve as an independent senator for the time being.'\nNew South Australian senator Lucy Gichuhi will sit as an independent rather than joined the merger of the Australian Conservatives and Family First\nSenator Bernardi said Senator Gichuhi, a 54-year-old lawyer who migrated to Australia in 1999, was new to parliament.\n'Lucy was chosen or sworn in as a senator only recently and I know what it’s like to be a new senator even with the support of a party,' he said.\n'It’s a very challenging environment. You got to get your head around a lot and Lucy's made a lot of decisions this week and she wasn't prepared or able to make a decision in respect to this merger at this time but I noticed she left the door open today.'\nSenator Gichuhi was this month appointed as a senator after the High Court ruled that former Family First senator Bob Day's election to parliament in 2016 was invalid because he rented electorate office space which he owned.\nLeigh Sales, the host of 7.30, asked Senator Cory Bernardi why Lucy Gichuhi didn't join the merger of the Australian Conservatives and Family First\nAustralia's most senior judges ruled that he had breached Section 44 (5) of the constitution, which bans federal members of parliament from having a financial contract with the Commonwealth.\nMr Day quit as a senator in October after his Home Australia building company, based in Adelaide, collapsed.\nThis, in itself, would have made him ineligible to sit in parliament as a bankrupt.\nOn Wednesday, Senator Gichuhi left Family First to become an independent legislator but she has indicated she is open to joining the Australian Conservatives after she is formally sworn in as a senator.\nShe was the second name on the Family First Senate ticket in South Australia at last year's federal double dissolution election.","url":"https://www.dailymail.co.uk/news/article-4447382/Cory-Bernardi-Australian-Conservatives-merge-Family-First.html"}
