{"authors":["Peter Over"],"date_download":"2018-10-23 05:50:46","date_modify":"2018-10-23 05:50:46","date_publish":"2015-09-22 00:00:00","description":"The Public Interest Research Group came up with a matching-funds plan that would benefit candidates who have raised the most money from small donations.","filename":"data/vaneerConsumption/BernieSandersWouldBeTheBigWinnerInNewPublicFundingModel.json","image_url":"https://media.npr.org/assets/img/2015/09/22/ap_148398344905_wide-9775ef23cb29bd18ff9a7cda727ed2cba509e774.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_itsallpolitics_2015_09_22_442519808_bernie-sanders-would-be-the-big-winner-in-new-public-funding-model_1540273846.html","title":"Bernie Sanders Would Be The Big Winner In New Public-Funding Model","title_page":"Bernie Sanders Would Be The Big Winner In New Public-Funding Model : It's All Politics : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Bernie Sanders Would Be The Big Winner In New Public-Funding Model\nEnlarge this image toggle caption Jim Cole/AP Jim Cole/AP\nWhat would it take to make the White House wannabes stop chasing after big donors? From 1975 to 1999, the answer was federal matching funds — money that candidates could get by raising more money from small donors and spending less time schmoozing with the well-heeled.\nNow, the U.S. PIRG (Public Interest Research Group) Education Fund, an advocate of more limits on campaign money, has produced a model of how that would affect the early stages of the 2016 race. The analysis assumes a 6-to-1 match, so the match would turn a $200 contribution into $1,400 for the candidate.\nFirst the results, then the caveats.\nThe results:\nThe big winner — Sen. Bernie Sanders. In the first half of 2015, he got 77 percent of his money in small contributions, that is, $200 or less. Hillary Clinton raised about 3 1/2 times as much as Sanders, but just 13 percent came from small contributions. With matching funds, Sanders would end up with $83 million, Clinton with $89 million.\nThe big loser — Republican Jeb Bush. He would be the only contender to come out with less money. It reflects the top-heavy profile of Bush's fundraising: 88 percent of his money came from donors who gave $2,700, the legal limit. Republicans who would benefit most are Sen. Ted Cruz and retired neurosurgeon Ben Carson.\nThe caveats:\nIntriguing as this might be, the analysis is far from ironclad.\nSuperPACs: For one thing, it doesn't take into consideration superPACs. Every major candidate but Sanders has at least one backing them (that they endorse). SuperPACs have no contribution limits.\nA theoretical system with matching funds could also theoretically ban superPACs. But here in 2015, Bush raised $11 million for his campaign committee, and $103 million was raised for the superPAC. In most of the presidential campaigns, the small donors to the candidate's committee look a lot like window dressing.\nThere are cost-benefit questions: For the 12 candidates, who have reported their fundraising so far, the analysis estimates that $307 million in matching funds would have displaced $65 million in contributions greater than $200. Advocates of public financing say no one can gauge the true benefit: how many federal dollars would be saved if big donors had less sway over lawmakers.\nPublic financing is a long, long way from reality: The Watergate-era system was abandoned twice, first by candidate George W. Bush in the 2000 primaries, and then by candidate Barack Obama in the 2008 general-election campaign. It's not going to be resurrected — at least not in the short term.\nMatching funds programs are included in comprehensive campaign-finance bills proposed by Rep. John Sarbanes, D-Md., and Sen. Dick Durbin, D-Ill. They're better designed than the old presidential system. But unlike the 1970s — or even 2002, when the McCain-Feingold bill became law — campaign finance has become a partisan issue. The epithet \"welfare for politicians\" likely still has some punch.\nThis isn't to say the matching-funds idea should be ignored. The winning candidates this cycle are expected to spend well over $1 billion each. The influence of big money is a frequent topic on the campaign trail. And it's worth exploring what a different system might look like.","url":"https://www.npr.org/sections/itsallpolitics/2015/09/22/442519808/bernie-sanders-would-be-the-big-winner-in-new-public-funding-model"}
