{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:23:42","date_modify":"2018-10-30 20:23:42","date_publish":"2015-10-11 21:23:09","description":"Bernie Sanders: Gun Manufacturers May Need To Be Held Liable For Gun Crime","filename":"data/vaneerConsumption/BernieSandersGunManufacturersMayNeedtobeHeldLiableforGunCrime.json","image_url":"https://media.breitbart.com/media/2015/10/Bernie-pointing-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_11__1540931022.html","title":"Bernie Sanders: Gun Manufacturers May Need to be Held Liable for Gun Crime","title_page":"Bernie Sanders: Gun Manufacturers May Need to be Held Liable for Gun Crime | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"During the October 11 airing of Meet the Press, host Chuck Todd asked Democrat presidential hopeful Bernie Sanders where he stands on allowing shooting victims to sue gun manufacturers. Sanders made it clear that he is opposed to holding gun store owners liable, but he believes there is room to hold manufacturers liable to some degree.\nTodd’s question was based on the fact that Sanders voted for the Protection of Lawful Commerce in Arms Act (PLCAA), which President George W. Bush signed into law in 2005.\nSpeaking on Meet the Press, Sanders acknowledged his vote for the PLCAA, then said:\nThat was a complicated vote and I’m willing to see changes in that provision. Here’s the reason I voted the way I voted: If you are a gun shop owner in Vermont and you sell somebody a gun and that person flips out and then kills somebody, I don’t think it’s really fair to hold that person responsible, the gun shop owner. On the other hand, where there is a problem is there is evidence that manufacturers, gun manufacturers, do know that they’re selling a whole lot of guns in an area that really should not be buying that many guns. That many of those guns are going to other areas, probably for criminal purposes. So can we take another look at that liability issue? Yes.\nSanders’ admission that he is willing to reconsider his previous position on this topic comes nearly a week after Democrat presidential hopeful Hillary Clinton proposed changing current law to allow shooting victims and their families to sue gun manufacturers.\nCampainging in New Hampshire on October 5, NBC News reported Clinton saying, “What is wrong with us that we can’t stand up to the NRA and the gun lobby and the gun manufacturers they represent?” She did not mention any support of suing the politicians, municipal leaders, and school boards that render Americans of all walks of life defenseless via gun free zones.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/10/11/bernie-sanders-gun-manufacturers-may-need-held-liable-gun-crime/"}
