{"authors":["Whit Cook","Goodlife Report"],"date_download":"2018-10-30 20:46:06","date_modify":"2018-10-30 20:46:06","date_publish":"2016-12-27 00:00:00","description":"If you find yourself stuck in an airport this holiday season, hopefully it's one of these.","filename":"data/vaneerConsumption/Bestairportterminalsforfood.json","image_url":"https://amp.businessinsider.com/images/585d533fee14b61c008b51da-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_best-airport-terminals-for-food-2016-12_1540932366.html","title":"Best airport terminals for food","title_page":"    Best airport terminals for food - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"New York City's 3 major airports (JFK, Laguardia and Newark) may be the butt of many travel writers' jokes — and deservedly — but JFK's terminal 4 is certainly bucking that trend. Having seen several expansions and renovations in the 2000's and 2010's, T4 completed its biggest project yet in May 2013 with the culmination of the first phase of Delta's $1.4 billion project. Servicing all international, transcontinental, and many partner airline flights, Terminal 4 at JFK is now the only non-airline, privately owned terminal in the U.S. Nearly one out of every three passengers going through JFK goes through Terminal 4. Given its size, it's only natural that there should be plenty of dining options — and there are. Once past security, travelers can enjoy eats from big names in NYC dining like Danny Meyer's Shake Shack and Blue Smoke and Marcus Samuelsson's Uptown Brasserie, before boarding their flight. And it only gets better for travelers with lounge access: The new flagship Delta Sky Club has a modern design, complimentary booze, a Ciroc Vodka-sponsored VIP room, and a one-of-its-kind, outdoor Sky Deck, where you can order cocktails and watch the planes take off and land.\nAlso in the terminal 4: Le Grand Comptoir, The Palm Bar & Grille, Camden Foods.","url":"https://www.businessinsider.com/best-airport-terminals-for-food-2016-12"}
