{"authors":[],"date_download":"2018-10-30 21:10:37","date_modify":"2018-10-30 21:10:37","date_publish":"2018-08-24 14:25:00","description":"So, where do you go to find brunch bliss in Atlanta? Here are six spots, including the beloved Waffle House, that are serving waffles up hot and fresh.","filename":"data/vaneerConsumption/BestwafflesinAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/CmgSharedContent/2017/04/27/Videos/4049875.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_food--cooking_ba_f8290637f0ece7ff5d4e26aebcb6f459__1540933837.html","title":"Best waffles in Atlanta","title_page":"National Waffle Day: Best waffles in Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"There's nothing quite like taking a bite out of the perfect waffle. Crisp and golden on the outside, fluffy and light on the inside. Divots filled with warm maple syrup.\nYou can add fried chicken or berries, icing or whipped cream. A waffle can be savory or sweet.\n»RELATED: This under-the-radar breakfast spot offers a dish fit for champions\nSo, where do you go to find brunch bliss in Atlanta?\nHere are six spots that are serving waffles up hot and fresh.\nChick-a-Biddy\n264 19th St. NW, Atlanta, GA 30363; (404) 588-1888, www.chickabiddyatl.com/\nEvery chicken-and-waffles lover knows the key to an awesome dish is that the waffle has to be on point. Atlantic Station’s Chick a Biddy takes that to heart and offers five types of waffles: cinnamon roll, bourbon pecan, red velvet, bacon and the original cheddar.\nAll of the options are thick and fluffy. Add your choice of bone-in or boneless fried chicken. For those concerned with gluten, the chicken is always gluten-free.\nFolk Art Restaurant (Photo courtesy of Channel 2 Action News)\nFolk Art\n465 North Highland Ave. NE, Atlanta, GA 30307, http://folkartrestaurant.com/\nJason Hill of Wisteria opened Folk Art next door in Inman Park a few years ago to feed Atlanta’s insatiable need for breakfast. And feed it he has. Hill serves up a sweet potato waffle that diners can build on to create their dream dish.\nFor those with a sweet tooth, try the menu's banana nut foster style. And for something a bit more filling, try the foul play. That beauty is topped with fried chicken and whiskey peach compote.\nJoy Cafe\n1100 Peachtree St. NE, Atlanta, GA 30309; (404) 996-1377, http://joydelivered.com/\nThis hidden gem has been a beloved secret for years. Well, the secret is out.\nThe cafe is open only for breakfast, lunch and brunch. One of the more popular items for brunch is the Belgian waffle with fresh berries and a sprinkling of powdered sugar. It’s a classic presentation and hits the spot. Be sure to get there early: The cafe is small and has become increasingly popular.\nNana G’s\nLocation varies, http://nanagchik-n-waffles.com/\nSure, you can go to a restaurant. Or you can have the restaurant come to you. And though there are quite a few food trucks rolling around town, Nana G’s comes bearing waffles. Maplewood smoked bacon-infused Belgian waffles to be exact. They are topped with warm maple syrup & sprinkled with powdered sugar. Make it a Papa G with the addition of two chicken tenders.\nSeed Kitchen & Bar1311 Johnson Ferry Road #504, Marietta, GA 30068; (678) 214-6888, http://www.eatatseed.com/\nEast Cobb is quickly emerging as a thriving dining destination. Locals already know that Seed Kitchen & Bar is among those leading the charge. Their brunch is a great way to become acquainted with chef Doug Turbush’s menu. At the center is a wonderfully indulgent caramelized banana Belgian waffle with candied pecans, whipped cream, warm maple syrup. It’s served with your choice of bacon or sausage.\nWaffle HouseMultiple locations, www.wafflehouse.com\nOne cannot do a roundup of waffles in Atlanta without including homegrown Waffle House. It’s pretty much written into the charter for Atlanta.\nLong a late-night haunt for partiers, Waffle House has a place in many a food lover’s heart. Even the late, great culinary curmudgeon Anthony Bourdain swooned over the pecan waffle, proclaiming it \"better than the French Laundry.\"","url":"https://www.ajc.com/lifestyles/food--cooking/batter-where-satisfy-your-waffle-cravings-atlanta/0ne5rsKkVDIPX140Vd9qLK/"}
