{"authors":["Michael Patrick Leahy"],"date_download":"2018-10-30 19:27:53","date_modify":"2018-10-30 19:27:53","date_publish":"2016-01-28 19:24:30","description":"Steve Martini, an attorney and best-selling author of more than a dozen legal thrillers, tells Breitbart News that he is following the investigation of Democratic front runner Hillary Clinton's e-mail national security scandals very closely. |","filename":"data/vaneerConsumption/BestSellingAuthorSteveMartiniWonderingWhetherHillarysGoingtoBeIndicted.json","image_url":"https://media.breitbart.com/media/2015/03/hkg3854493.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_28__1540927673.html","title":"Best-Selling Author Steve Martini: ‘Wondering Whether Hillary’s Going to Be Indicted'","title_page":"Best-Selling Author Steve Martini: ‘Wondering Whether Hillary’s Going to Be Indicted' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Steve Martini, an attorney and best-selling author of more than a dozen legal thrillers, tells Breitbart News that he is following the investigation of Democratic front runner Hillary Clinton’s e-mail national security scandals very closely.\n“We’re all sitting here watching and wondering if Hillary’s going to be indicted, and if not, how they’re going to be able to justify it,” Martini tells Breitbart News.\n“I hate to say that but it’s true. I’m a lawyer. I can read statutes. So can other people. It doesn’t take a lawyer to understand what the statute says in this case,” Martini adds.\n“We see what they’ve done to other people who’ve gone afoul in those areas. The question is, ‘Why not her?’ Is she too big to be indicted? I don’t know,” he says.\n“The question is, every lingering month that goes by as we get closer to the election, the calamity grows bigger,” Martini observes.\nMartini’s latest book, The Enemy Inside, once again features Paul Madriani and his eccentric law partner, Harry Hinds. Martini has written sixteen novels, thirteen of which feature Madriani and Hines. Unlike his earlier Madriani novels, which focused primarily on events inside the courtroom, this one is set primarily outside that venue.\nOf interest to Breitbart News readers, the plot turns on the arrest of an investigative journalist at a website called “The Washington Gravesite,” who is arrested for the murder of a high powered Washington attorney. As the story unfolds, it becomes clear the dead attorney was at the center of a web of national political corruption.\nMartini, who is also a former journalist, has followed the growth of Breitbart News and the changes brought to the reporting of news by technology and new media.\n“You’re clearly a growing organization,” Martini says of Breitbart News, noting that he shares the site’s constitutionally limited government, anti-establishment world view.\n“I have to admit, I’m just to the right of Genghis Khan in terms of politics,” Martini tells Breitbart News.\nMartini also says that Supreme Court Justice Anthony Kennedy, who was his Constitutional Law Professor at the University of the Pacific’s McGeorge Law School in Sacramento, is probably his favorite Justice, though he has sided with the majority in several decisions that have disappointed the author.\n“I’ve been disappointed by some of his rulings,” Martini tells Breitbart News.\n“We all have different views on things, but the one that offended me the most was the Kelo v. New London case out of Connecticut, the confiscation case. That really offended me. It offended something deep inside of me,” he adds.\n“But I like Kennedy as a person. He’s a genuine person,” Martini notes.\nHere’s the full transcript of the Breitbart interview with best-selling author Steve Martini:\nQUESTION: On what media outlet did you base the Washington Gravesite muckraking website featured in your new book The Enemy Inside?\nMARTINI: You know, I didn’t pick one per se. All that stuff came out of my head, but it came out of my head with knowledge of what’s happening within the media, and the changes that technology are making every day, not only to book publishing but to the gathering of journalistic reportage and how it’s conveyed to the public. Who relies on what. What’s happening to the old press format that once existed.\nAll of that stuff.\nIt’s no mystery and no secret to anyone who either goes online or watches the cable stations that organizations like Breitbart and others are transitioning into a void that exists because the technology is so…. they’re picking up where the old newspaper paradigm can’t exist any more.\nQUESTION: In the book you have Paul Madriani, great character, and Tory Graves, the founder of the Washington Gravesite as key characters.\nMARTINI: It’s like the old Washington Merry-Go-Round but it’s a different medium. I don’t think anybody knows where this stuff is going to end or where it’s headed. Technology is moving so quickly.\nQUESTION: When you had Madriani and Graves meeting at the headquarters of the Washington Gravesite, you pictured a large, open bullpen with dozens of reporters hacking away at their keyboards. Did you model that on any specific media outlet headquarters?\nMARTINI: No, I’ve never been to any of these places. I’ve been in press rooms. I worked in one for awhile. I’ve seen them. The old press rooms that existed in the old newspapers . I came out of journalism in the 1970s. I haven’t been really near one since then.\nI was at the Wall Street Journal with a friend of mine who was their international editor for awhile. I was in their press offices at one point just to visit with her socially and got to see how they operated. I saw all these new… when I was there there were all these people with headsets taking stories over the phone dictated by the reporters who were out on the beat somewhere sending stories back in.\nIt all changed dramatically, because now we have people sitting and working at work stations. These were the people who were doing the online stuff for the Wall Street Journal. That was a whole new operation that I hadn’t even envisioned then. It is a new world. This was probably five or six years ago when I saw that.\nYou [at Breitbart] seem to be a growing organization. That’s the future. That’s where it’s at. And I have to admit, I’m to the right of Genghis Khan in terms of politics.\nQUESTION: The plot of The Enemy Inside focuses on massive corruption in Washington, DC. You create a world in which it appears that many, if not most, members of Congress in the House and Senate are corrupt.\nMARTINI: I had to temper it. [LAUGHTER]\nI didn’t want to cut too close to the bone. I’m sure that’s not the case, I’ll say that up front. But you know, this is fiction. The problem is, when you’re writing a novel and you’re inventing this stuff you have to be careful because the newspaper will outstrip you the next day in terms of what happened.\nWe’re all sitting here watching and wondering whether Hillary’s going to be indicted, and if not, how they’re going to be able to justify it. I hate to say that but it’s true. I’m a lawyer. I can read statutes. So can other people. It doesn’t take a lawyer to understand what the statute says in this case.\nWe see what they’ve done to other people who’ve gone afoul in those areas.\nThe question is, “Why not her?”\nIs she too big to be indicted? I don’t know.\nThe question is, every lingering month that goes by as we get closer to the election, the calamity grows bigger.\nQUESTION: This was the first book in which I noticed your very specific political ideology. You come across as a limited government constitutionalist, anti-establishment guy, the kind of guy that our readers at Breitbart love to read. Have I captured your world view accurately?\nMARTINI: Pretty much. Paul Madriani and Harry Hinds are my principle characters [in the Madriani series].\nHarry is where a lot of this comes from. I’m probably a lot closer to Harry’s philosophy than I am to Paul’s. Paul’s more middle of the road. Harry is more… he’s a contrarian. He might be a great liberal if the conservatives were in power and had a whip hand over everything. He’s just that way. He’s a contrarian.\nHe doesn’t like power that is in the hands of any dominant group. He will fight that battle every time, tilting at windmills, never winning, ultimately probably, because he’s fighting the powerful. That’s a bit of his background and philosophy.\nHe would probably be an anarchist in a different world. He just doesn’t like government.\nHe’s my sounding board for a lot of this stuff, Harry has been, from the inception of the Madriani series whey back when.\nThe first books weren’t very political. They were largely set in the courtroom and they were “whodunits.” They turn on trial tactics and things like this. Increasingly, I’ve painted the characters in the stories outside the courtroom. And a lot of it does turn on politics. It does turn on the great divide that faces all of us now.\nIt’s a genuine battle. It’s a cultural war in some ways.\nIt’s difficult. We all make generalizations about who we think the other side is. Most of them are wrong.\nThere’s not a doubt in my mind there were a lot of liberals when I was in journalism back in the 1980s.\nThese were people whose occupation was… they were politicians, and they were decent people.\nI didn’t agree with them on very many things, policy wise. But they firmly believed what they espoused. They felt like they were fighting for the underdog. And I think a lot of people on the other side felt they were fighting for the underdog in the wrong way. They were doing more harm than good.\nQUESTION: Here’s the question for me. You’re from California. You attended the University of California at Santa Cruz in the 1960s. You were a journalist in Sacramento. You went to law school. I put all those facts together and the word “liberal” comes to mind, not “conservative.” How did you become a conservative ?\nMARTINI: I worked for a law firm that was largely liberal. In fact, one of my senior partners that I worked for worked for [former San Francisco Mayor] Willie Brown at one time. Over a period of time he became very conservative. I think people change.\nI didn’t change. I started out pretty much that way. I was always the hold out. I was fighting the tide and the winds when I was in Santa Cruz.\nBack then, you have to remember, in the 1960s, Santa Cruz was a very small institution, we only had 1,300 students. We were still in the experimental stage at that point. It wasn’t the liberal university it became many years later. It was founded in 1965 and the first [graduating] class was in 1966. We were the second graduating class. I came in a transfer from Pasadena City College down in Los Angeles.\nIt wasn’t the institution people think of today. It was a different place back then. Very small. Most of the professors were people from Europe, and people from the Ivy League on the East Coast. They were young, very idealistic. Some of them were quite liberal, but there were others. Karl A. Lamb, who was a government professor was quite conservative. So they had a mix when it first started out. It was about cross-pollination . That all ended years after I left.\nQUESTION: Shifting gears a little bit, tell me about your writing process. In your typical day, where and how do you write? Do you sit down at a computer? Do you do it long hand?\nMARTINI: No, no. I probably would have never written my first novel but for computers.\nI bought one of the first luggable Compaqs way back. We bought our first computer, which was an Apple IIE way back when, and then we bought the Compaq after that. It had more storage capacity.\nI lugged that thing around. I did a lot of work on that Compaq. It’s probably where I started my first novel, The Simeon Chamber, and that would have been back in the 1980s. That book was published in 1987.\nBut I remember the day I started the first novel I took out an old card table and set it up in the living room and plunked this huge heavy Compaq computer on top of it and started whacking away at the keyboard and started the novel.\nI hit a lot of dead ends because I didn’t have an outline. I didn’t really know how to do this. I had done journalism for about ten years, but I had never written fiction. That was basically how the career started.\nI did a couple of sample chapters, then I went and took a class, an evening class out of the University of California at Davis, an extension course on fiction writing, which I had never done in college. Read a sample chapter. The professor liked it. A couple of students liked it, and that encouraged me to go on.\nI ended up basically tossing that whole story. I hate to even tell you what the working title was.\nQUESTION: What was it?\nMARTINI: The Shards of Margan. And it was going to be set in the Middle East, where I had never been and it was going to be about a treasure hunt of some kind. In any event the whole story morphed into a story set in the Bay Area, which I did know, because I was raised there. It was about a lawyer, basically, and he was involved in a murder.\nIt wasn’t a Madriani story, it was outside the series. I didn’t start with Madriani until my second novel. But it sold. It sold very quickly to a small publisher in New York, D.I Fine. I didn’t make enough money to quit my day job. But, he bought a two book contract. It’s sort of a long tortured story because I remember working on the second book, and I really didn’t like what they had done with the first book, it didn’t have much success. And you’re always fighting that battle.\nThe long and short of it is, I bought the book rights back from D.I. Fine, and sold it two more times and ended up at Putnam.\nBy the time that book was finished and published, I had broken on to the Best Sellers List with a much harder story, harder than your first person story, a story about a murder case, written in the first person voice. It had a lot of twists and turns in it. It took me a while to write the book, it took me a while to write the book it took me about four years actually, to produce that second novel. But it was a good story and it was well worth the time spent.\nIt’s tough to break out. There are a lot of good books that are written out there that nobody ever sees.\nQUESTION: What are the stages you go through in writing a book?\nMARTINI: They’ve changed over the years. You refine your technique. I’m still doing that.\nBut I start with an outline. It’s sort of a loose outline. I know that parts of it are going to be re-written, I know that parts are going to be changed. If you looked at an outline from one of my finished books you would probably say there’s very little correlation between this and the final product. Much of the process is in the invention of the story itself. Characters grow, they change, they morph.\nSituations which you couldn’t have conceived of all of a sudden present themselves.\nAnd then there’s a couple of the rules you learn about writing suspenseful fiction and that is when things start to lag kill somebody. It’s how it happens.\nQUESTION: The one character you killed off in The Enemy Inside that sort of saddened me was [REDACTED SO AS NOT TO BE A SPOILER].\nMARTINI: Yes, some of it is tragic. There’s always that aspect of it. I killed off characters in earlier books, and my secretary told me yesterday she cried when I killed one off in a story outside the Madriani series dealing with terrorist plots, dealing with what you could see developing back almost ten years ago now.\nI did several of those books and then I drew that whole syndrome into the Madriani series. That sort of transformed the series and got it out of the courtroom.\nWhat happened in the field of commercial fiction is that a genre starts to get cold. Legal fiction was very hot when we had Scott Turow who brought out Presumed Innocent, and then shortly after that you had Grisham jump on the horse and ride it, who had tremendous success. There were a number of us who were basically on his coat tails.\nHe and I published our first books about the same time and we had the same minimal success. We just sold 5,000 books I think.\nAnd then, he wrote that huge book, The Firm, and I was behind him by about six months with Compelling Evidence, the one that launched me on the Best-Sellers List.\nHe was cutting a swath, and a lot of us were sort of riding in his wake.\nWe rode pretty high for awhile, and then the genre started to cool off.\nQUESTION: I see you did an ebook, The Second Man: A Paul Madriani Novella, in 2015. Were you pleased with that?\nMARTINI: I was, yes. I liked the story. It was a different kind of story for me. I didn’t write in the short form very often. The publisher wanted it. The reason they wanted it is I had been out of print for about four years. Marketing. It sort of set the stage for this novel.\nAnd it actually did help the numbers on sales quite a bit. You do a short novella and you sort of whet the appetite of the readership and you come back behind it with the long form novel.\nQUESTION: When you’re not writing, what do you like to do?\nMARTINI: I like to travel. I have spent a lot of time in Southeast Asia. My wife is from Thailand. We’ve been together about five years, married for a little over two. We spend a lot of time over there with her family. I hang out with old friends, ex-pats and play golf.\nWhat do I do for hobbies? I guess a do a lot of shooting, target shooting, though I haven’t done that in a while. I still retain a lot of the equipment.\nI do woodworking when I can get to it.\nMy time seems to be…as I get older I have less and less of it.\nI spend a lot of time marketing these books.\nI’ve already set up traveling engagements in places around the country.\nWe have one in Boca Raton, Florida on March 2, two in Phoenix on March 13 and 14, and there’s a library event in Houston on April 21 and a bookstore event there in Houston at Murder By the Book on April 22.\nAnd then I’ve got other events the publisher is setting up at bookstores. Those are becoming more difficult, it seems like, since there are fewer stores.\nQUESTION: I know of one author who quit his day job to focus exclusively on writing, and did well with lots of events at these specialty mystery book stores, but now he’s back to holding a day job.\nMARTINI: It’s tough to break in. Once you get to the top of the list, it’s easier, but you’ve got to work hard to stay there.\nI don’t know if I’ll make it this summer, but for the last several years I’ve gone to New York for ThrillerFest. ThrillerFest is an event of the International Thriller Writers Association. They hold a convention basically in New York City on the first weekend after the 4th of July. It goes for about a week.\nIt’s wonderful. You can meet some heavy hitting authors that are on top of the best sellers list, and the organization is very well run by a group of writers. It started about 12 years ago by some fellows, Steve Berry was one of the founders. I met Steve at a book signing on the West Coast when they were just getting off the ground and he asked me to join and at the time I had just too many balls in the air. I didn’t do it. I wish I had. But I’ve gone for the last several years and had a great time.\nQUESTION: What do you see as the biggest difference between writing non-fiction and fiction?\nMARTINI: Non-fiction, the problem is, it’s an event, and it’s still unfolding. You’re tied into the timeline, the actual timelines of that event. For example, I had a friend who wrote a non-fiction book about a trial that was unfolding in Sacramento. He was a novelist, and he didn’t realize that this thing was going to have, especially when it revolves around the courtroom, there’s a long period of time when things germinate. It doesn’t happen immediately.\nWhen you sign a contract to deliver a book, it’s sort of open ended because you can’t deliver the book until the conclusion of the trial, and the trial gets delayed, and then after the trial there are often things you can’t anticipate in terms of an appeal. So he swore he would never write another non-fiction book.\nI guess if the event is totally over with you can write something about it historically.\nPeople are going to know. They’ll know if you don’t get it right.\nQUESTION: Have you ever thought about writing a non-fiction book?\nMARTINI: I’ve thought about it and dismissed the thought immediately. You can’t control your timeline.\nQUESTION: Do you have any advice for aspiring fiction writers?\nMARTINI: Two bits of advice. One is do it. You really need to see it on paper, see how the characters form. Learn the knack of writing dialogue.\nThe other [bit of advice] is do it young. Don’t wait.\nWhat I did is, I made a mistake, I started thinking about it in my twenties, but didn’t start until my thirties. I wish I had those ten years back.\nIn some ways I can look back at it and say, well, timing in life is everything, and my timing was perfect because I was ready to write the book I wrote at the time when the legal genre was hot.\nQUESTION: You once said something to the effect of “write until you’ve got a really great product and then hit the market with it.”\nMARTINI: That’s right. That’s true. You never want to put something out there that doesn’t reflect your best work. Because it will be critically evaluated by everybody that publishes. And they won’t buy it if they don’t feel it’s really polished. They might like the story but they’re not going to want to…when they buy a novel they’re buying the novelist.\nThere’s a story in there, and they really want you to right it over again.\n[After my first Madriani novel was acquired, my publisher] said “Can you do this again?” And I said “You mean write a novel?”\nAnd she said, “No, can you write these characters again?”\nShe wanted to see these characters again, which I had never thought of. My dream was to write stand-alone novels.\nBut at that time I was still at my day job and she was offering a contract to write three books, and I liked the terms she was offering.\nAnd I said, yes I can do it, I can do anything. And you can if you put your mind to it.\nWas it a smart move? I don’t know. It certainly ballooned sales. I think I climbed higher and faster on the Best-Sellers List. I’m not bemoaning it.\nBy the same token, it also handcuffed me a bit, because all the publishers ever wanted after that were those series of novels with the same characters.\nQUESTION: I think they gave good advice. Like most of your readers, I love those characters, Paul Madriani and Harry Hinds.\nMARTINI: We all get into that phase where we’re visiting old friends, whether it’s Madriani or Sherlock Holmes.\nQUESTION: What’s the secret to writing good dialogue? I’ve tried it, and I cannot make it sound authentic. You make your dialogue seem so real.\nMARTINI: I think part of it is developing an ear or having an ear. If you develop a voice, and an authentic voice, it sells your fiction. It will make people suspend disbelief.\nThe other thing is you want to make your characters sound sufficiently different. You don’t want to make it sound like everything is coming out of the mouth of the same person.\nWhen you’re trying to write women sometimes, it’s not just the tone of the voice that changes with gender, it’s what they say and how they say it and the thought process behind it. It’s different.\nIt helps to have a good female critic when you do that stuff. And I did.\nQUESTION: What books do you have in the works?\nMARTINI: I’ve got one finished already that’s in the hands of the publisher. It will be out in May, called Blood Flag. It’s a historic book, grounded in history. It’s a story about World War II, about an aging group of soldiers who fought in the war who are dying off and a flag that was–if you’re familiar in history and what happened in the war a blood flag … well I probably shouldn’t tell you too much, but there’s a search for it, both in terms of dollars it might be worth as a collectors item and in terms of a banner of anti-Semitism and much of the terror that is going on in the world today.\nQUESTION: In the video on your website you say you enjoy writing villainous characters. There’s one “more nuanced” villainous character from The Enemy Inside that really intrigued me. I got the sense that we may see this character again. I’m thinking of …\nMARTINI: [CHARACTER REDACTED SO AS NOT TO BE A SPOILER]?\nQUESTION: Yes, [CHARACTER REDACTED SO AS NOT TO BE A SPOILER].\nMARTINI: I’ve had a lot of comments from people who did like [CHARACTER REDACTED SO AS NOT TO BE A SPOILER]. I’m not sure my publisher would like me to go in that direction, but I’m sufficiently long in the tooth where I may do it anywhere. Yes, I like that character.\nQUESTION: On the one hand [the character] is a vicious killer. On the other hand, you’ve created a really great back story for [that character], almost a freedom fighter type, and then [the character] makes an intriguing choice at the climax of the book.\nEven before I got there you knew who I was talking about.\nMARTINI: Yes. That character has been in the back of my mind for some time now.\nQUESTION: Favorite Supreme Court Justice?\nMARTINI: It’s hard to say. Probably personally it’s [Anthony] Kennedy, and the reason for that is he was my Constitutional Law professor. But I’ve been disappointed by some of his rulings.\nWe all have different views on things, but the one that offended me the most was the Kelo v. New London case out of Connecticut, the confiscation case. That really offended me. It offended something deep inside of me.\nBut I like Kennedy as a person. He’s a genuine person.\nI knew him well enough as a student. I used to run into him in the building, in the Capitol [at Sacramento] when I was covering stories as a journalists. I went to law school at night, so during the day I’d be running into people who were doing lobbying, and he was doing lobbying for clients at that time, he had taken over his dad’s law firm.\nQUESTION: You mention as a child you loved reading encyclopedias. That resonated with me because as a kid I read the Golden Book Encyclopedia and then later, the Encyclopedia Britannica.\nMARTINI: We had the World Book Encyclopedia. We had the full set. I had it next to my desk. Whenever I got bored doing homework, I would open up a volume and start reading. You could get halfway through the volume before you would get back to homework.\nIt’s the same thing with searching the web. I end up doing the same thing now. I’ll be watching a movie or reading a book, and all of a sudden something will intrigue me that I’m reading and I’ll go searching the web. Two hours later you realize you’re still on the web.\nQUESTION. Two final questions. You’ve already been very generous with your time. What influence did your parents have on your career? Your dad was a rancher and a ranch manager. Your mom worked in a local public library.\nMARTINI: It was my mom more than my dad. She was fairly well read, liked reading. I began reading poetry, I guess, when I was seven or eight. She had more influence on me than he did.\nMy interest in writing came from a teacher in high school, a woman who, my junior year in high school really turned me around. I realized suddenly that I had a brain.\nI started writing, reinvented myself basically. After high school, I went off to community college. I took “Bonehead English” and scored an “A.” I realized that I had an aptitude then.\nIt’s amazing to realize how impressionable you are when you’re young.\nI remember the professor in the class said to everyone, “I’m going to read something to you ,” and he started reading. About half way through the first paragraph I realized it was mine.\nAfter he read it he asked the class “Do you have any idea who wrote this?”\nThe class said “I don’t know.”\nAnd he said “Well he’s sitting right here in class.”\nI realized that I had sort of wowed him a little bit and I didn’t know how I had done it. I had sort of been a bonehead up until then.\nI turned it around and made it a life.\nQUESTION: Final Question. You grew up in California and now you live in Washington. Was your move a lifestyle or a political choice?\nMARTINI: It was probably a little bit of both. Taxes were starting to get onerous. We had lived in a very hot and dry area in the Sierra Nevada. We came looking to the Pacific Northwest and Charlottesville, Virginia. We thought about that, but we had relatives on the West Coast.\nWe looked there, we looked in Colorado, we looked in three or four states. I had quit my day job in Sacramento, so we looked around a bit and decided the Pacific Northwest was the place for us.","url":"https://www.breitbart.com/politics/2016/01/28/best-selling-author-steve-martini-wondering-whether-hillarys-going-to-be-indicted-i-can-read-statutes/"}
