{"authors":[],"date_download":"2018-10-30 20:33:27","date_modify":"2018-10-30 20:33:27","date_publish":"2015-08-31 15:55:34","description":"Think your hometown’s a great place to live?For what it’s worth, Money says there’s only one best place in Georgia: Woodstock.","filename":"data/vaneerConsumption/BestplacestoliveinAmericaInGeorgiatheresonly.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/08/31/Images/photos.medleyphoto.8071392.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_best-places-live_b44418aad8cb5e288db66b4a693347af__1540931607.html","title":"Best places to live in America? In Georgia, there’s only...","title_page":"Best places to live in America? In Georgia, there’s only...","title_rss":"NULL","source_domain":"ajc.com","text":"Think your hometown’s a great place to live?\nFor what it’s worth, Money says there’s only one best place in Georgia: Woodstock.\nThe Cherokee County community, about 30 miles northwest of Atlanta, was the state’s lone small city to make the national magazine’s 2015 list of 50 Best Places to Live in America.\nWoodstock just made it, ranking No. 50.\nMoney says it looks for “places with great jobs, strong economies, affordable homes, excellent schools, and that special something that makes it a great place to live.”\nThe magazine found those attributes most prevalent in Apex, N.C., which ranked No. 1, just ahead of (2) Papillion, Neb., (3) Sharon, Mass., (4) Louisville, Colo., and (5) Snoqualmie, Wash..\nMoney put out a separate, shorter list of best big cities in America. Atlanta was not among them.\nThe magazine also came up with individual lists of best places for outdoor lovers, best places to be a kid and best places to be rich and single. No Georgia city made the grade in any of those categories. Buckhead apparently was not considered for the latter honor.\nBesides affordable housing and strong job growth, Money liked Woodstock for its “lively downtown.” It says locals have “plenty to see and do without needing to head into Atlanta. Outdoor recreational activities are a big draw as well.”\nIt lists Woodstock’s population at 26,059, median income at $71,715, job growth at 12 percent and median home price at $184,775.\nThe sources of its data? Standards like the U.S. Bureau of Labor Statistics, the U.S. Census Bureau, and … the White Book of Ski Areas.\nNow maybe that was Georgia’s undoing.","url":"https://www.ajc.com/news/local/best-places-live-america-georgia-there-only-woodstock/xQ4289dzI20SYytOI3892N/"}
