{"authors":["Madeline Stone"],"date_download":"2018-10-30 20:55:52","date_modify":"2018-10-30 20:55:52","date_publish":"2016-12-23 00:00:00","description":"Bronson van Wyck is an expert when it comes to entertaining.","filename":"data/vaneerConsumption/Bestdrinkforholidayparties.json","image_url":"https://amp.businessinsider.com/images/585c713af10a9a51098b4fae-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_best-drink-for-holiday-parties-2016-12_1540932952.html","title":"Best drink for holiday parties","title_page":"    Best drink for holiday parties - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Bronson van Wyck. Sarah Jacobs Bronson van Wyck knows how to throw a party.\nSince 1999, he and his mother, Mary Lynn, and sister, Mimi, have been putting their hosting skills to good use, planning events for the most high-end of clients — people like Beyonce, Madonna, and Presidents Obama, Bush, and Clinton — through their event production firm, Van Wyck & Van Wyck. Earlier this year, the Van Wyck team launched a new company out of their production firm. Called Workshop, the new company focuses on producing events for brands like Coach, Mercedes-Benz, Hermes, and Range Rover.\nVan Wyck clearly knows how to tailor a party's decor and activities to each client's individual tastes, whether that's with candle-lit decor, strong drinks, or fun photo booths.\nBut when it comes to the holiday season, he has a few tips that anyone can adapt for their own holiday parties.\nA Dark and Stormy cocktail. Brent Hofacker / Shutterstock \"I like to serve a Dark and Stormy this time of year,\" van Wyck told Business Insider. \"They can easily be made for large pitchers, and the dark rum with a healthy kick of ginger will warm you right up. With only three or four ingredients (dark rum, ginger beer, lime, a dash or two of bitters if you desire), it is a foolproof cocktail.\"\nClick here to watch van Wyck make his signature Dark and Stormy.\nVan Wyck has also created a line of all-natural cocktail mixes called Arrowhead Farms. The mixes come in eight different flavors, including a seasonally appropriate Spitfire Margarita, a spicy Serrano grapefruit margarita.\nAnd if you're not the one hosting the shindig, he has some suggestions for what to bring along with you.\n\"I've been whipping up Bloody Marys for friends and family for hostess gifts for as long as I can remember. Holiday parties often create holiday hangovers — your host will thank you for thinking ahead!\" he said. \"Pour your homemade batch into mason jars tied up with raffia or burlap and maybe a sprig or two of cedar and juniper.\"","url":"https://www.businessinsider.com/best-drink-for-holiday-parties-2016-12"}
