{"authors":["Madeline Stone"],"date_download":"2018-10-30 21:49:24","date_modify":"2018-10-30 21:49:24","date_publish":"2016-12-17 00:00:00","description":"These bottles strike a fine balance between quality and price.","filename":"data/vaneerConsumption/BestandmostaffordableChampagnebottles.json","image_url":"https://amp.businessinsider.com/images/55845af16bb3f7a433c71a0d-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_best-and-most-affordable-champagne-bottles-2016-12_1540936164.html","title":"Best and most affordable Champagne bottles","title_page":"    Best and most affordable Champagne bottles - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Getty Images/Clive Mason The holidays are a time to toast to friends, family, and good fortune in the new year. But first you'll need a great bottle of Champagne — and when it comes to the bubbly, there's a balance to be struck between quality and price.\nWe talked to Alison Napjus, Wine Spectator's senior editor and tasting director, to get her recommendations for bottles that will impress your peers without breaking the bank. Wine Spectator does blind taste tests of more than 18,000 wines a year, and Napjus personally reviewed about 2,500 wines in 2016, including 500 sparkling wines.\nShe also gave us some tips on what to look for when selecting a bottle.\n\"The really big divide in sparkling wine, in terms of price, would be between vintage versions and non-vintage,\" she said. \"Vintage is more expensive, and it's supposed to be symbolic of that year. Non-vintage is better for price, and it's the majority of what you'll see in the supermarket.\"\nNon-vintage wines are typically blends of several different vintages that a producer makes as a signature sparkling wine each year. Non-vintage bottles are not usually labeled as such — you can recognize one by the absence of the word \"vintage\" on its label.\nOther terms that might signify a higher price point: \"blanc de blancs,\" \"blanc de noirs,\" and \"rosé.\"\n\"Those are more expensive as well because they're using a specific type of grape, and they're often a small production, so there's a supply and demand situation,\" Napjus said. \"Production process also affects the price of the wine.\"\nHere are Napjus' best-value sparkling wine picks, arranged in ascending order according to Wine Spectator's ratings. While some of the more highly rated sparkling wines are Champagnes (meaning that they come from the Champagne region of France), others are Proseccos from Italy, Cavas from Spain, or sparkling wines from California.\nEach of these wines can be had for $55 or less.\nFreixenet Cordon Negro Extra Dry Cava ($12)\nWine Spectator score: 86/100\nRegion: Cava, Spain\nAccording to Wine Spectator's tasting notes, this Cava boasts flavors of \"smoke, plum, tangerine and spice.\"\nCa' Furlan Cuvée Beatrice Prosecco Extra Dry ($10)\nWine Spectator score: 87/100\nRegion: Prosecco, Italy\nWine Spectator describes this Italian Prosecco as \"balanced and lightly juicy.\"\n2012 El Cep Marques de Gelida Gran Reserva Brut Cava ($14)\nWine Spectator score: 87/100\nRegion: Cava, Spain\nProminent flavors in this sparkling wine include apple, almond, and lemon curd.\nNino Franco Brut Valdobbiadene Prosecco Superiore Rustico ($18)\nWine Spectator score: 88/100\nRegion: Prosecco, Italy\nNino Franco Brut Valdobbiadene Prosecco Superiore Rustico ($18) Facebook.com/ProseccoNinoFranco This Italian Prosecco has hints of white peach, Thai basil, sliced almond, and lemon pith.\n2011 Juvé y Camps Brut Nature Cava Gran Reserva de la Familia ($16)\nWine Spectator score: 89/100\nRegion: Cava, Spain\nAccording to Wine Specator, this Spanish Cava is \"a firm, focused version, with a smoky streak of mineral underscoring the flavors of fresh-cut pear, mandarin orange peel, vanilla biscuit, and pickled ginger.\"\nGloria Ferrer Blanc de Blancs Carneros ($22)\nGloria Ferrer Blanc de Blancs Carneros ($22) Facebook.com/gloriaferrervineyards Wine Spectator score: 90/100\nRegion: California\nIf you'd rather go for a California sparkler, this wine has both crisp and creamy flavors.\nFerrari Brut Trento ($26)\nFerrari Brut Trento ($26) Facebook.com/ferraritrento.global\nWine Spectator score: 90/100\nRegion: Trentino, Italy\nWine Spectator dubs this sparkling wine \"very drinkable,\" with notes of \"Asian pear, ground ginger, hazelnut and lemon zest.\"\nPloyez-Jacquemart Brut Champagne Extra Quality ($43)\nWine Spectator score: 91/100\nRegion: Champagne, France\nIt's a bit pricier than the sparkling wines that come before it on this list, but this Ployez-Jacquemart Champagne is said to have notes of apricot, orchard blossom, and pastry dough.\nLanson Brut Champagne Black Label ($45)\nLanson Brut Champagne Black Label ($45) Facebook.com/ChampagneLanson Wine Spectator score: 91/100\nRegion: Champagne, France\nAlso hailing from the Champagne region of France, this sparkling wine is minerally and smoky.\nPol Roger Brut Champagne Réserve ($50) Pol Roger Pol Roger Brut Champagne Réserve ($50)\nWine Spectator score: 92/100\nRegion: Champagne, France\nThis Champagne has flavors of poached pear and toast.\n2008 Moutard Père & Fils Brut Champagne Cuvée des 6 Cépages ($55)\nWine Spectator score: 92/100\nRegion: Champagne, France\nAccording to Wine Spectator, this Champagne is best enjoyed with a meal. They describe it as \"balanced and juicy, featuring smoke and spice notes on the plush finish.\"\nBérêche & Fils Brut Champagne Réserve ($46)\nWine Spectator score: 92/100\nRegion: Champagne, France\nThis Champagne is acidic, with notes of blackberry, toast, licorice, and mandarin orange peel.\nAlfred Gratien Brut Champagne ($50)\nWine Spectator score: 93/100\nRegion: Champagne, France\nThis Champagne is described as \"rich,\" with a \"firm acidity and an airy mousse.\"\n2009 Domaine Chandon Brut Yountville Vintage ($45)\nWine Spectator score: 93/100\nRegion: California\nWine Spectator calls this sparkling wine \"polished and graceful,\" with \"floral aromas of Asian pear, fresh ginger and brioche.\"","url":"https://www.businessinsider.com/best-and-most-affordable-champagne-bottles-2016-12"}
