{"authors":[],"date_download":"2018-10-30 20:06:36","date_modify":"2018-10-30 20:06:36","date_publish":"2016-01-07 05:00:00","description":"Check out a map of where to get cocktails OTP Read about the best spots to grab an after-work drink Cocktails have come a long way in the last decade.","filename":"data/vaneerConsumption/BestplacestoorderacocktailOTP.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/01/07/Images/photos.medleyphoto.8537562.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_dining_creati_9ff8e8f5533254772e5a7b2f4caeb1d2__1540929996.html","title":"Best places to order a cocktail OTP","title_page":"Best places to order a cocktail OTP","title_rss":"NULL","source_domain":"ajc.com","text":"Check out a map of where to get cocktails OTP\nRead about the best spots to grab an after-work drink\nCocktails have come a long way in the last decade. We’re now in the age of small-batch spirits, barrel-aged cocktails, house-made bitters, shrubs, tinctures and tonics, and, of course, fancy ice.\nAtlantans know Kimball House, Empire State South and H. Harper Station as reliable spots for a fine mixed drink, but there’s a world of cocktails to discover beyond I-285. Here are six places outside The Perimeter to grab a seat at the bar and order a round – or two.\nSeed, 1311 Johnson Ferry Road, Marietta. 678-214-6888, eatatseed.com.\nWhen Seed opened in east Cobb in 2010, there was nothing like it in the area. It bucked the trend of chain restaurants and committed to providing patrons with local, seasonal ingredients.\nBeverage director Chris McNeill takes Seed’s commitment to rebellious trendsetting seriously, and he has built a bar program around fresh ingredients, local bitters and small-batch spirits. His bold interpretations of the classics and frequent travels beyond Georgia mean Seed’s cocktail imbibers are constantly introduced to the latest bar trends from around the country.\nWhat to sip: Atlantic Flyer. This brandy- and ruby port-based cocktail is perfect for Manhattan lovers seeking a relaxed alternative. The brandy and port combination gives the drink a smoother quality than the spicy rye whiskey typically used as the base spirit for a Manhattan. However, there’s still that slight bitter bite Manhattan devotees crave. The citrusy aperitif Cocchi Americano livens up the drink with a quick kick of spice while its compatriot, Cocchi di Torino, adds a hint of rich sweetness and gives the Atlantic Flyer its deep red hue.\nStem Wine Bar, 1311 Johnson Ferry Road, Marietta. 678-214-6888, stemwinebar.com.\nHidden behind a door at Seed, Stem is east Cobb’s answer to a European wine bar. There is no shortage of seating at the dimly lit, question mark-shaped bar covered in sexy, dark wood and marble. While wine is Stem’s main purpose, it hasn’t left out the cocktail crew, with a menu of classic before- and after-dinner drinks as well as low-proof (dubbed “suppressor” these days) intoxicants.\nWhat to sip: fortified tonic. Concocted with Dow’s white port, small-batch tonic and lime, this light, bright, low-proof cocktail is incredibly refreshing, even on chilly day. There is a waking quality to this sipper, as it tickles the nose with the tonic bubbles and hits the palate with fresh, fruity flavor and a hint of tart lime.\nCommon Quarter, 1205 Johnson Ferry Road, Marietta, 678-809-4040, commonquarter.com.\nCommon Quarter aims to celebrate the South’s culinary heritage and hospitality with its “come as you are” approach to dining. Whether you’re rolling in with the ladies after yoga or bringing the family for dinner after soccer, you’ll find comfort in the familiarity of the food and drinks here.\nSourcing ingredients as close to the restaurant as possible, Common Quarter takes full advantage of the South’s long growing season. Beverage director Lindsay Ferdinand finds inspiration in the seasonal, familiar foods on the menu, but offers her guests a unique yet still approachable selection of cocktails.\nWhat to sip: It’s Complicated. First appearing in late August, this gin-based cocktail has lingered on the menu, but it has become, well, complicated, and much more than a cool refresher. Pairing the lush herbal vibe of the Italian liqueur Strega with Barr Hill gin’s touches of organic honey and juniper makes this drink approachable without being too sweet or herb-heavy. What gives this cocktail its name is the muddled jalapeno and how it allows the sipper to straddle the line between summer and fall. A slight bit of heat with a nice afterburn warms you while the mint cools and settles the drink back into the bright notes of lemon.\nFoundation Social Eatery, 1570 Holcomb Bridge Road, Roswell. 770-641-8877, foundationatl.com.\nA leap of faith. That’s how General Manager Nick Hassiotis characterized the decision by chef Mel Toledo (formerly of Bacchanalia) to go “off Canton” and park Foundation Social Eatery in a shopping center on the chain restaurant-ridden eastern side of Ga. 400.\nThe ai3-designed restaurant has a fresh approach to seasonal produce and local meats. Bar manager Jamie McDonough has taken a cue from Toledo, curating a program of creatively bright cocktails that, like the wine list, pair excellently with the menu. This lack of pretense in the drinks leads to an honest cocktail list of light sippers and playful riffs on classics.\nWhat to sip: FSE reviver. Don’t let that whiff of anise turn you off this riff on the classic corpse reviver. The decision to use St. George’s “botanical eater” Botanivore gin is spot on. The herbaceous nature of this spirit surrounds the absinthe, allowing the citrus of the Cocchi Americano and the artichoke and thistle notes of Italian digestif cardamaro to brighten the drink and tone down the anise flavor. Just as you’re about to slink into your chair, a hint of absinthe hits at the finish. Hence, the reviver portion of this boozy cocktail.\nEl Felix, 1130 Avalon Blvd., Alpharetta. 678-248-5239, theelfelix.com.\nNothing can stop the Ford Fry machine, and his bold move to open a restaurant OTP in the fledgling Avalon mixed-used development proves it. While Superica may be the darling of his Tex-Mex army of ITP followers, El Felix was birthed first, and paved the way for his Krog Street Market success.\nEl Felix feels much the same as Superica in both design and menu, but the bar program caters to a crowd of young regulars living above Avalon’s storefronts as well as office workers and shoppers. Beverage director Davis Pidgeon has developed his program to feature classic margarita and mojito cocktails as well as a few zingers, which include rye whiskey, horchata and a super sassy bloody mary.\nWhat to sip: the Fallen Aristocrat. A fun take on a French 75, the Fallen Aristocrat uses Atlanta’s own Old Fourth Ward Distillery vodka, Spanish wine sparkler cava and house-made velvet falernum — a rum-infused liqueur with lime zest. The rum element mellows the sharpness of the vodka but melds well with the sugar cane it contains. The tangy sparkle of the cava and lime help give this drink a crisp taste. Adding a wintery pear nectar to the mixture brings warmth and tones down what could be a very tart cocktail. This is a fantastic brunch sipper as well as a classy cold weather alternative to a margarita.\nColletta, 900 Third St., Alpharetta. 678-722-8335, collettarestaurant.com.\nWhen the Charleston-based restaurant group Indigo Road decided to move to Alpharetta’s Avalon, it changed the face of fine dining OTP. The fresh yet familiar northern Italian fare, coupled with Colletta’s casual sophistication, has filled a dining void in Alpharetta for those seeking to impress business clients or simply relax with a drink after a long day at the office.\nThe bar program offers quality ingredients of house-made shrubs, bitters and syrups, which further showcase the rich herb- and fruit-forward cocktail traditions of Italy.\nWhat to sip: negroni on tap. The love-hate relationship with the negroni (equal parts gin, Campari and sweet vermouth) has existed since its inception nearly a century ago. While its haters find the negroni too bitter, due to the heavy use of Campari, for its lovers the beauty of the cocktail is that first bite and how it mellows as you continue sipping. Colletta doesn’t mess with the classic, but enhances it by batching the cocktail on a Sunday and serving it on tap all week. What sets this beautifully-balanced negroni apart from all the others in Atlanta is its bottle-aged quality. It softens the cocktail slightly, while still retaining the boldness of the Campari and allowing the juniper of the gin to come forward.","url":"https://www.ajc.com/entertainment/dining/creative-cocktails-migrate-outside-the-perimeter/MxQkdEMNzJEh2QWY2aczKI/"}
