{"authors":[],"date_download":"2018-10-22 22:39:55","date_modify":"2018-10-22 22:39:55","date_publish":"2014-05-12 00:49:45","description":"Twin girls born with a rare condition were breathing on their own and their mom said she and her husband were able to hold them on Mother's Day.","filename":"data/vaneerConsumption/BestMothersDayPresentRareTwinsHoldHands.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/435301/140511-mono-twins-jms-2102_c3ef73752a3371eeed52e99c5f3c6508.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_health-news_best-mothers-day-present-rare-twins-hold-hands-n102731_1540247995.html","title":"'Best Mother's Day Present': Rare Twins Hold Hands","title_page":"'Best Mother's Day Present': Rare Twins Hold Hands","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nRare \"mono mono\" twin girls born in Ohio were breathing on their own, and their mom said she and her husband were able to hold them on Mother's Day.\nThe babies were born 45 seconds apart, and when the doctors put them next to each other, one grabbed the other's hand, hospital officials told NBC News.\nThe identical twin girls shared the same amniotic sac and placenta. Such births are called monoamniotic, or \"mono mono,\" and doctors say they occur in about one of every 10,000 pregnancies.\nThey were born Friday at Akron General Medical Center and grasped each other's hands when doctors lifted them up for their parents to see after delivery.\nSarah Thistlethwaite said babies Jillian and Jenna were removed from ventilators Sunday afternoon after they were able to breathe comfortably. She told The Associated Press that she and her husband Bill both held them for a while on Mother's Day.\n\"It's just hard to put into words how amazing it feels to know the girls are OK,\" she said. \"It's great to know that they're doing so well, and being able to hold them.\"\nThistlethwaite told the Akron Beacon Journal that was \"the best Mother's Day present ever.\"\n\"They're already best friends,\" said Thistlethwaite, 32. \"I can't believe they were holding hands. That's amazing.\"\nJenna was born first at 4 pounds, 2 ounces and 17 inches, with Jillian following 48 seconds later at 3 pounds, 13 ounces and 17.5 inches.\nThey were moved temporarily to Akron Children's Hospital because they needed breathing assistance. Thistlethwaite expects to be released from Akron General on Tuesday, while the girls will remain in the hospital two to four weeks.\nDr. Melissa Mancuso helped deliver the twins, one of several amniotic pairs she has helped deliver in 11 years. She said the twins are at risk during pregnancy of entanglement of umbilical cords, which can cause death. Another woman at Akron General is expected to give birth later this week to monoamniotic twins.\nThe Thistlethwaites, of Orrville, Ohio, also have a son, Jaxon, whose first birthday was Jan. 27.\n— The Associated Press contributed to this report.","url":"https://www.nbcnews.com/health/health-news/best-mothers-day-present-rare-twins-hold-hands-n102731"}
