{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:22:11","date_modify":"2018-10-30 21:22:11","date_publish":"2018-08-20 13:00:00","description":"These drinks -- and things to add to your drinks -- will keep you cool and refreshed through the summer.","filename":"data/vaneerConsumption/Bestthingstodrinkrightnow.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/16/Images/Cannonborough.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_bu_96011c1bf22a6fcd9d506a44190cbf4c__1540934531.html","title":"Best things to drink right now","title_page":"Best things to drink right now","title_rss":"NULL","source_domain":"ajc.com","text":"It’s still hot. We’re still thirsty. And we found three new ways to enjoy iced drinks as summer winds down.\nCraft soda from Cannonborough Beverage Co.\nOnce upon a time, all sodas were made locally by someone combining syrup and carbonated (seltzer) water either at a soda fountain or in a small bottling operation. It’s nice to know people like Mick Matricciano, Matt Fendley and Brandon Wogamon of Cannonborough Beverage Company in Charleston, South Carolina, are still handcrafting refreshing beverages. They produce a line of fruit sodas using fresh fruit, not artificial fruit flavors. There are seasonal flavors like Strawberry Jalapeno and Blueberry Vanilla, and year ‘round flavors like Ginger Beer and Grapefruit Elderflower. We sampled Honey Basil, a combination of lime juice, cane sugar, clover honey and basil. Delicious by itself or used as a mixer.\n$7.99 per 4-pack. Available August 30 at all Atlanta-area Whole Foods Markets and online at http://www.cannonbevco.com/ .\nSparkling Organic Soda from Sipp\nSparkling organic soda from Sipp\nYou have to love a product where each bottle is signed by the founder. Okay, Beth Wilson-Parentice of Chester, Penn. isn’t hand signing each label, but her signature is there telling you she’s proud of her creations. The flavors are so inventive. Zesty Orange = blood orange, lime and jalapeno. Ruby Rose = grapefruit, honey and rosemary. Lemon Flower = lemon, elderflower and tarragon. Our favorite? Mojo Berry. A mix of blackberry, mint and lime, it was like summer in a glass. Sipp sodas are delicious on their own, but they make great cocktails and there are lots of recipes on their website. What we particularly love is that the flavors are not in your face. Subtle, interesting combinations instead of knocking you over with fake flavors. We found we could drink glass after glass and never weary of the taste.\n$5.99 per 4-pack of 12-ounce bottles. Available at Target and on Amazon. http://www.haveasipp.com/\nSugar cubes from Teaspressa\nFlavored sugar cubes from Teaspressa\nPhoenix, Arizona-based Teaspressa makes four organic tea blends crafted to be brewed like coffee - in pour over or French press styles. But we tried their sugar cubes, a fun way to sweeten your iced tea or to use in mocktails and cocktails. The cubes are made of cane sugar, flavored with natural ingredients and sometimes with bits of freeze-dried fruit blended in. Drop a cube of lemon or Arcadia orange into your glass of tea, sparkling water or even just still water and get both the sweet and the citrus. Flavors include fruits, vanilla, ginger, peppermint and salted caramel. The result is pretty and lightly sweet and blending your own combinations is easy and fun. The tiny tubes would make perfect favors for a party or a sweet hostess gift.\n$9 for a stick of six cubes. Available at Citizen Supply at Ponce City Market or online at https://teaspressa.com/.\n﻿RELATED:\nThe best Atlanta bars and drinks for a last hurrah before summer ends\nMore must-buy food products\nTry these Made in Georgia food products\nGet a taste of the new fusion revolution with the 2018 AJC Spring Dining Guide: Global Mashup\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/buy-this-three-ways-stay-refreshed-til-fall-comes-around/jt0ZTRlqHHwrctTCcmI4yH/"}
