{"authors":["Christine Rendon For Dailymail.Com"],"date_download":"2018-10-23 04:01:31","date_modify":"2018-10-23 04:01:31","date_publish":"2016-01-29 19:30:44","description":"The 45-year-old was spotted with her five-year-old daughter in New York on Thursday just days after unveiling her candy red hair, which she admitted to E! was a wig. She credited Tokyo Stylez for the look.","filename":"data/vaneerConsumption/BethennyFrankelpicksupdaughterBrynfromschool.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/18/30B4B11200000578-0-image-a-22_1454090714959.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423251_Bethenny-Frankel-ditches-candy-apple-red-wig-picks-daughter-Bryn-school_1540267291.html","title":"Bethenny Frankel picks up daughter Bryn from school","title_page":"Bethenny Frankel picks up daughter Bryn from school | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She introduced her traffic-stopping candy red hair colour earlier this week.\nBut it was back to brunette on Thursday for Bethenny Frankel, who returned to her usual self as she picked up her little girl Bryn Hoppy from school in NYC.\nThe 45-year-old had her hands full as she carried her five-year-old daughter, her little girl's artwork, and several bags.\nScroll down for video\nBack to brunette: Bethenny Frankel kept it comfortable in sweats and a cardigan as she picked up her little girl Bryn Hoppy, five, from school on Thursday in NYC\nRed alert: The 45-year-old wore a candy red wig during a launch party for Skinnygirl Candy at Dylan's Candy in New York on Tuesday\nLuckily the reality star had some help, as an attentive man offered his assistance for the busy mom.\nThe on-the-go businesswoman was certainly dressed for comfort in her slouchy grey sweats and soft cardigan.\nBethenny - who was married to Bryn's father Jason Hoppy for two-and-a-half years before their marriage ended in December 2012 - also wore a lightweight white top and a green parka to protect against New York's weather.\nLittle Bryn smiled in her arms, bundled up in a baby pink jacket and soft grey boots.\nTop spirits: The businesswoman grinned brightly as she awaited her daughter just outside their car\nIt certainly was a radically different look from Bethenny's appearance for Tuesday, which saw her with bright red hair as she launched her Skinnygirl Candy line.\nSpeaking to E! at the kick-off at Dylan's Candy Bar, the reality star admitted that the look was indeed temporary.\n'It matches the candy and I just kind of needed a little pick me up to get into a good mood,' she told the website.\nCasual mama! The Bravo star mixed up her cosy look with a stylish leather purse\nThe businesswoman credited stylist Tokyo Stylez for her hair, who she said 'designed' and 'cut' the wig.\nWhile at the bash, Bethenny also addressed tweets she sent out on Friday that caused a Twitter storm.\nThe Real Housewives Of New York star was apparently frustrated at how long she'd been left queuing in the discount mega-retailer while trying to purchase shoes for her daughter.\n'Soon to come...': The reality star sat patiently for her stylists Tokyo Stylez and Kristofer Buckle as they worked their magic on Tuesday\n'Wow @Kmart has 2 registers open w 5 other employees standing around & two speak no English whatsoever. Shoes are sapatos right?' she tweeted.\nShe followed it up with: 'Not even attempting kids' snow boots in spanish'.\nSpeaking with Us Weekly at the party, she said: 'People don't always love me. They may even hate me, but they know that I’m telling it direct.\nEye for style: The star credited her hair stylist Tokyo for her vibrant red hair\n'I would never be one of those celebrities that just wants to please everybody and wants to say exactly what everybody wants to hear and tiptoes around.'\nMeanwhile, it seems there's no slowing down for the busy entrepreneur, who revealed on Twitter on Friday that she was back on another flight.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423251/Bethenny-Frankel-ditches-candy-apple-red-wig-picks-daughter-Bryn-school.html"}
