{"authors":[],"date_download":"2018-10-30 01:26:27","date_modify":"2018-10-30 01:26:27","date_publish":"2015-08-24 08:00:00","description":null,"filename":"data/vaneerConsumption/BeTruetoYourHomeschool.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/08/Homeschool2.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862787.html","title":"Be True to Your Homeschool","title_page":"Be True to Your HomeschoolThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"My brother has enough kids to field a baseball team.\nOne just earned her graduate degree from Notre Dame after getting her undergraduate from Boston College.\nAnother is graduating from Georgetown, which took one look at her grades and test scores and offered a full scholarship.\nAnother just entered West Point.\nBut it’s the younger siblings, the ones still in danger of braces, who really show promise. They devour books like Thin Mints and would destroy Donald Trump in the family Monopoly games.\nThese kids aren’t the products of elite schools; they don’t spend their summers in the Hamptons. My brother is a sports reporter, drives cars held together by NAPA and a prayer, and struggles to make ends meet.\nBut still, he started his kids off with an education that money could not buy. He sent them to a K-8 school with few resources and only a single teacher, one who possessed neither a teaching certificate nor a four-year degree.\nThe teacher is Nancy, Kevin’s wife.\nThey took a look at their public schools and were not impressed. And so Nancy taught herself to teach. She set high standards, compiled her own curriculum, and tolerated no disruptions in the classroom. After nine years in her one-room schoolhouse, her students are so academically advanced that a Jesuit college prep high school happily takes over from there with scholarship money and a bevy of Advanced Placement classes.\nThe per-pupil cost in Maine public schools exceeds $10,000 annually, not including capital expenditures. Multiply the number of my nieces and nephews times the nine years spent in Nancy’s homeschool, and she will wind up saving Maine taxpayers more than $800,000 in elementary and middle school funding. Her costs, which the family eats, will be a tiny fraction of that.\nThe quality of the education her kids receive is just as lopsided in the other direction.\nImpressive? Not according to the nation’s largest teachers union.\n“The National Education Association believes that home schooling programs based on parental choice cannot provide the student with a comprehensive education experience,’’ stated the organization in a 2014-15 resolution. “Instruction should be by persons who are licensed by the appropriate state education licensure agency, and a curriculum approved by the state department of education should be used.’’\nThat not only is laughable when juxtaposed against the real-life example of my brother’s family. It is laughable in the broader context of the growing homeschool movement, which now includes more than 2 million kids.\nThe liberal narrative pushed against homeschoolers once revolved around socially misfit children imprisoned by religiously zealous parents and fed a steady diet of the Old Testament in lieu of science and the three R’s.\nBut then came one analysis after another showing homeschooled children score higher on standardized tests. They are just as socially engaged as their peers. Colleges welcome them because they graduate at a higher rate and with a higher grade point average. As adults they are more likely to vote and engage in community service.\nSo why is the teachers union denying reality? Homeschooling is gaining in popularity at the same time more states are becoming receptive to funding more school choice options. For example, Nevada is offering education savings accounts to parents who withdraw their children from public schools, giving them $5,100 a year to pursue other education options.\nA public school couldn’t survive on that. Nancy wouldn’t know what to do with it all. Their decision to homeschool their kids meant a life of frugality. It meant Kevin taking on a second job and Nancy working fulltime without pay.\nThey should absolutely be compensated by the state for doing a much better job than the state could have done educating their children at a significant savings to taxpayers. And so should the Jesuits, who so nicely finished the job.\nIn fact, if Kevin and Nancy had received $5,100 for each kid and were allowed to compile unspent funds for college, they probably would be able to get all their children well into graduate school when taking scholarships into account.\nThe efficiency of homeschooling is staggering, which is why teachers unions fret so. Even more alarming is that the secular liberal parents are joining the movement.\nWriter Dana Goldstein bemoaned the trend in Slate in 2012. The headline: “Why teaching children at home violates progressive values.”\n“If progressives want to improve schools,’’ she wrote, “we shouldn’t empty them out. We ought to flood them with our kids, and then debate vociferously what they ought to be doing.’’\nTry selling that one in the Whole Foods checkout line.\nThis is not a rant against public schools, by the way. I send my kids to two of them because, while maybe not as good as Nancy’s one-room classroom, they are good enough to earn our business.\nDana has it backwards. You threaten to empty the schools out and let the school districts debate vociferously how to prevent that by offering a competitive product. It’s a debate the unions would rather avoid.","url":"https://spectator.org/63850_be-true-your-homeschool/"}
