{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 23:52:23","date_modify":"2018-10-30 23:52:23","date_publish":"2016-12-05 00:00:00","description":null,"filename":"data/vaneerConsumption/Bettermentsdiversificationplanpaysoff.json","image_url":"https://amp.businessinsider.com/images/5845854ee02ba7c45e8b678f-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_betterments-diversification-plan-pays-off-2016-12_1540943543.html","title":"Betterment's diversification plan pays off","title_page":"    Betterment's diversification plan pays off - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Fintech Briefing\" subscribers. To learn more and subscribe, please click here.\nIn an increasingly crowded market, many robo-advisors are venturing beyond generic, consumer offerings to increase their chances of success — a strategy that US-based Betterment has recently seen pay off.\nBetterment started as a standard consumer-oriented robo-advisor, but expanded earlier this year to provide a business offering.\nAnd on Thursday, the company announced that its Betterment for Business platform, which provides 401(K) plan management for businesses, has attracted about 300 customers. The firm also noted that its assets under management (AUM) are now $6.2 billion, an approximately $1 billion increase over eight months.\nBetterment for Business is targeting an underserved market. The firm has actively targeted tech startups, partnering with Uber to provide drivers with benefits in August, and it's said that Betterment for Business is particularly popular with mid-size firms. Likely behind Betterment's success is that businesses of this type are largely overlooked by legacy providers, with retirement plans out of budget for many firms. Betterment claims that it charges lower fees than legacy providers of 401(k) packages, which addresses the affordability problem for these companies. Given that approximately 99% of all US businesses are small or medium-size, Betterment has hit on a significant market.\nBetterment's approach might enable it to survive as legacy players roll out their own robo-advisor solutions. Targeting businesses enables Betterment to onboard larger numbers of customers at lower cost and faster than if it targeted individual consumers, enabling it to boost its volume of assets under management at greater speed. This will likely give it an edge in the evolving robo-advisor market as we see many startups outcompeted by legacy providers' offerings, which have the advantage of more resources and existing customer bases.\nRobo-advisors are threatening to upend the enormous global wealth management industry in several ways, and they are likely to arrive in full force within the next few years.\nSarah Kocianski, senior research analyst for BI Intelligence, has compiled a detailed report on robo-advising that looks at the market for robo-advisory services, the drivers behind consumer adoption of robo-advising, why the robo-advisor market presents an opportunity to traditional wealth management firms, and how startup robo-advisors can succeed as massive legacy companies begin offering their own services.\nHere are some of the key takeaways from the report:\nLarge incumbent wealth managers won't lose out to startups like Betterment and Wealthfront. Instead, they are embracing the technology and launching their own products,which are scaling quickly.\nConsumers across all asset classes are receptive to robo-advisors — including the wealthy. 49% of this group would consider investing some of their assets using a robo-advisor.\nThe majority of assets managed by robo-advisors will come from people who already have some investments. We estimate that the volume of assets that comes from people who don't currently invest will be less than 1% of the total by 2020.\nStartups are going to find it difficult to scale, and will need to differentiate their products to succeed. They are already doing this by providing white label services to wealth managers, and more customized stand alone solutions.","url":"https://www.businessinsider.com/betterments-diversification-plan-pays-off-2016-12"}
