{"authors":["Rachael Levy"],"date_download":"2018-10-30 23:52:31","date_modify":"2018-10-30 23:52:31","date_publish":"2016-12-05 00:00:00","description":"Betterment, which provides automated investing in index funds, is asking Trump to leave a new rule in place that is supposed to protect retirement money.","filename":"data/vaneerConsumption/BettermentsWallStreetJournalDonaldTrumpadonfiduciaryrule.json","image_url":"https://amp.businessinsider.com/images/5845c5c0ba6eb69a018b78a9-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_betterments-wall-street-journal-donald-trump-ad-on-fiduciary-rule-2016-12_1540943551.html","title":"Betterment's Wall Street Journal Donald Trump ad on fiduciary rule","title_page":"    Betterment's Wall Street Journal Donald Trump ad on fiduciary rule - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Betterment. Betterment, a startup that provides automated investing in index funds, is asking President-elect Donald Trump to leave in place a rule that's meant to protect Americans' retirement money from conflicted financial advisors.\nThe Department of Labor's fiduciary rule, which takes effect in April, mandates that all financial advisors serve in their client's best interest rather than their own. It is aimed at those who oversee retirement money.\nWithout the rule, some financial advisors can put their client's retirement money in funds and other financial products that serves them over their client's interests.\nFinancial advisors can be paid fees for directing client money toward funds, and they could recommend funds that pay more. These advisors are following the so-called suitability standard, whereby they only have to prove that an investment was a suitable choice.\nThe rule is meant to address that conflict, making it harder for advisors to not put their client's interests first.\nIn Monday's print edition of the Wall Street Journal, Betterment took out a full-page ad, addressed to Trump:\n\"Investing can be made intentionally complicated, and salesmen are clever. Left to its own devices, the investment industry for decades sold bad products to Americans.\nMany firms make hidden money selling funds and investments. They charge confusing fees that investors can't see. They push investments that are in their best interest — not in the best interests of investors.\nThe Dept. of Labor's fiduciary rule, which protects Americans from these bad practices, is under attack. This isn't your average lobbying against regulation. It's an attack against the biggest benefit for retirement savers in 40 years — since the deregulation of broker commissions brought down costs for everyone, and since the introduction of the 401(k).\"\n...\nThis rule is worth your time and attention, and worth your support. We hope that you will stand on the side of America's 75 million retirement savers, not the firms with deep pockets who are lobbying you to protect their bottom line.\"\nBetterment rolled out its first ad in the New York Times' Sunday edition (below). \"Do you trust your money manager?\" the ad read. \"Maybe you shouldn't.\"\nThe fiduciary rule is expected to help Wall Street firms that provide index funds, which are generally cheaper and easier to prove in the best interest of retirement savers than actively-managed mutual funds. Betterment thus would stand to benefit financially from keeping the rule in place, since it provides index funds.\nBetterment's ad for the New York Times Betterment. Indeed, Betterment has been a vocal supporter of the rule for some time. Last year, the firm added a public comment in support of the rule.\nBetterment took issue with a prominent criticism of the rule - that it would make those who advise on retirement accounts less likely to service lower-balance accounts, and that owners of such low-balance accounts wouldn't be able to access financial advice:\n\"We take issue with this misleading characterization of the status quo,\" Betterment wrote at the time. \"The implication that 'suitability'-governed salespeople are giving investors 'advice' deserves forceful and repeated debunking. Conflicts of interest should be prominently disclosed, and investors should be made fully aware of how their service providers are actually compensated.\"\nOther organizations like the AARP, which backs retirees, have supported the rule.\nTrump thus far has not made any public comment on the rule. However, industry analysts believe the rules are likely to be watered down under a Trump presidency.\n\"We expect the Department of Labor's (DOL) fiduciary standard rulemaking to be softened in 2017, but our sense is that it is unlikely to be fully reversed for a number of reasons,\" Compass Point said in a note in November.\nMany of the companies that would be most impacted by the rule have seen their stock price rally in the aftermath of Trump's election. One of Trump's advisors, hedge funder Anthony Scaramucci, is one of the rule's most public critics, and in October said Trump would repeal it.\nAt the time, he likened the new rule to the Dred Scott case, the 19th-century Supreme Court decision that upheld slavery (later explaining that he meant it was a sign of government dysfunction,) and in a subsequent Wall Street Journal op-ed, argued that the rule, while good intentioned, would ultimately hurt investors.","url":"https://www.businessinsider.com/betterments-wall-street-journal-donald-trump-ad-on-fiduciary-rule-2016-12"}
