{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:52:50","date_modify":"2018-10-30 19:52:50","date_publish":"2015-10-05 19:29:30","description":"Bette Midler: Americans Being Forced To Pledge Allegiance To NRA Or 'Shut The F**k Up'","filename":"data/vaneerConsumption/BetteMidlerAmericansHaveTwoOptionsPledgeAllegiancetoNRAorShutTheFkUp.json","image_url":"https://media.breitbart.com/media/2015/10/Bette-Midler-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_10_05__1540929170.html","title":"Bette Midler: Americans Have Two Options–Pledge Allegiance to NRA or ‘Shut The F**k Up’","title_page":"Bette Midler: Americans Have Two Options--Pledge Allegiance to NRA or 'Shut The F**k Up' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On October 2, entertainer Bette Midler lamented her belief that we have reached a point in time where we must show allegiance to the NRA or “shut the f**k up.”\nMidler did this via a tweet, in which she wrote: “Gee, I guess the USA is really governed by the NRA. The rest of us just have to live the way they let us and shut the f**k up.”\nThe tweet was clearly a reference to gun control’s failure to gain traction in the wake of the heinous attack that took place in gun free facilities at Umpqua Community College on October 1. Since that attack, the push to expand background checks to more gun sales has been taken up in earnest although the gunman–Chris Harper Mercer–already proved the impotency of this approach by passing background checks to acquire his weapons.\nMidler reacted in a similar fashion when expanded background checks failed to pass the Democrat-controlled Senate in the wake of the Sandy Hook Elementary attack. On April 17, 2013, she joined actor Jason Alexander, actress Rashida Jones, comedian Richard Lewis, and other Hollywood elites by lambasting the Senate’s failure to act and suggested that those who had voted against gun control would be voted out of office in coming elections.\nMidler’s exact words: “Today, US SENATE VOTED AGAINST 91% OF THE COUNTRY THAT WANTS BACKGROUND CHECKS. WE ARE TAKING NAMES, MOTHERF**KERS!!” Conversely, pro-gun Republicans enjoyed landslide victories in the House and Senate, as well as in gubernatorial races and state legislatures, during the 2014 mid-term elections. Democrat Senators from red states who supported the background check push were largely voted from from office.\nThose voted from office included Senators Mark Udall (D-CO), Kay Hagan (D-NC), and Mary Landrieu (D-LA). They also included anti-Second Amendment Democrats vying for open seats–candidates like Michelle Nunn (D-GA) and Bruce Braley (D-Iowa).\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com","url":"https://www.breitbart.com/entertainment/2015/10/05/bette-midler-americans-forced-pledge-allegiance-nra-shut-fk/"}
