{"authors":[],"date_download":"2018-10-22 21:29:18","date_modify":"2018-10-22 21:29:18","date_publish":"2014-05-07 14:14:43","description":"The City of Beverly Hills has voted unanimously to pressure the government of Brunei to divest the Beverly Hills Hotel.","filename":"data/vaneerConsumption/BeverlyHillsPushesBruneitoDivestHotelAmidShariaDustup.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/426026/140507-bhills_1009_1cc8b1b08b8e2fe941cde8349bd0aba5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_business-news_beverly-hills-pushes-brunei-divest-hotel-amid-sharia-dustup-n99206_1540243758.html","title":"Beverly Hills Pushes Brunei to Divest Hotel Amid Sharia Dustup","title_page":"Beverly Hills Pushes Brunei to Divest Hotel Amid Sharia Dustup","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe City of Beverly Hills has voted unanimously to pressure the government of Brunei to divest the Beverly Hills Hotel, the pink-hued haunt of the Hollywood set, after the small country's enactment of sharia law prompted protests.\nComedians Ellen DeGeneres, Jay Leno and British entrepreneur Richard Branson have been the most prominent figures to advocate shunning the hotel and its bungalows, a favored locale for the Hollywood elite since it opened a century ago.\nThe resolution Tuesday urges Brunei to divest its ownership of the hotel, and any other properties it owns within Beverly Hills, and condemns it and other countries that operate under Islamic criminal law.\nEmotions were high in the packed council chambers as scores of rank-and-file employees, as well as residents and others, expressed opposition to human rights abuses, support for the fabled property, as well as a reliance on the hotel for jobs.\n\"This is misguided,\" Robert Anderson told Reuters after the vote. \"We should be against human rights violations in all countries, not just the Brunei.\"\nBadrul Chowdhury, a waiter at the hotel for 14 years, said Brunei was far removed from the lives of hotel workers: \"We work. We take care of our families.\"\nThe council stopped short of taking direct action, such as a city-sanctioned boycott.\nIn the last few days, organizations have canceled events at the hotel, including the Motion Picture & Television Fund's annual \"Night Before the Oscars\" charity event and the Feminist Majority Foundation's annual Global Women's Rights Awards.\n-- Reuters","url":"https://www.nbcnews.com/business/business-news/beverly-hills-pushes-brunei-divest-hotel-amid-sharia-dustup-n99206"}
