{"authors":[],"date_download":"2018-10-30 18:49:36","date_modify":"2018-10-30 18:49:36","date_publish":"2015-03-02 18:49:00","description":"Beverly Hall, the former Atlanta schools superintendent whose renown as an education reformer dissolved amid the ignominy of the nation’s largest test-cheating scandal, died Monday of breast cancer. She was 68. Hall still faced criminal charges alleging a scheme to inflate achievement-test scores .","filename":"data/vaneerConsumption/BeverlyHalldiescriminalcaseandherlegacyunresolved.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/MyAJC/2015/03/02/Videos/4089012731001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_breaking-news_beverly-_e701d5d0adfa0ae25abdec3449d18c9a__1540925376.html","title":"Beverly Hall dies; criminal case - and her legacy - unresolved","title_page":"Beverly Hall dies; criminal case — and her legacy — unresolved","title_rss":"NULL","source_domain":"ajc.com","text":"Beverly L. Hall, the former Atlanta schools superintendent whose renown as an education reformer dissolved amid the ignominy of the nation’s largest test-cheating scandal, died Monday of breast cancer. She was 68.\nHall still faced criminal charges alleging she orchestrated a scheme to inflate achievement-test scores for thousands of Atlanta students, many of them the poor, minority children she professed to champion. Hall strongly denied wrongdoing — “to her dying breath,” her lawyers said Monday — but faced as much as 45 years in prison for racketeering and other offenses.\nNeither her lawyers nor her family released details about the circumstances of her death or about funeral plans. Hall, who remained in Atlanta after retiring in 2011, is survived by her husband, Luis, and a son, Jason.\nWith her criminal case unresolved, Hall’s death deprived her many admirers and critics of a final verdict on her legacy. To some, she was a visionary who raised standards and modernized Atlanta schools with a mantra of “no exceptions, no excuses.” To others, she most resembled a Mafia boss who demanded fealty from subordinates while perpetrating a massive, self-serving fraud.\nHall already was known as an innovator in urban education when she arrived in Atlanta in 1999, and she spent the next dozen years polishing that image. She spoke continually of her “data-driven” teaching strategies and the “remarkable turnaround” she led in the city’s long-struggling schools. In speeches in Atlanta and across the country, she depicted opponents, or even doubters, as cynics who believed poor, minority children could never learn. The Atlanta schools, she declared, were “debunking the American algorithm that socio-economics predicts academic success.”\nHall’s stature peaked in 2009, when she was named National Superintendent of the Year — for an American school administrator, the equivalent of a Nobel Prize. The award was largely based on the school district’s improved scores on standardized tests.\nThe same year, however, the authenticity of those scores came under withering scrutiny.\nThe Atlanta Journal-Constitution published the first of several statistical analyses showing the district’s scores on the Georgia Criterion-Referenced Competency Test, or CRCT, had increased at rates that were all but impossible. The newspaper also reported that school officials disregarded internal findings of testing irregularities and retaliated against whistleblowers who reported cheating. State officials later documented widespread tampering with test papers, and a team of special investigators appointed by the governor concluded that Hall stood at the center of a culture of corruption.\nIf she didn’t know that cheating was rampant, the investigators said, she should have.\nHall initially maintained that if cheating occurred, it did so in isolation. As evidence to the contrary accumulated, she insisted improprieties took place behind her back.\nBy then, however, a reputation so carefully constructed for so many years was irreparably ruined.\n‘YOU HAD TO ACHIEVE’\nHall really didn’t want the job at first.\n“I was not interested in Atlanta,” she said. “Never been South. Didn’t know anything about Atlanta. Everybody who I respected said don’t go — Atlanta does not treat its superintendents well.”\nHall made these comments in 2011, a few weeks before retiring as Atlanta’s superintendent. But she was not speaking in a moment of fond remembrance; she was under oath, undergoing a contentious interrogation by the governor’s special investigators.\nIt was an unlikely denouement for Hall, a soft-spoken Jamaican whose voice never quite lost its Caribbean lilt after almost five decades in the United States.\nBeverly La-Forte Clare was born July 7, 1946, in Montego Bay. Her father, Leslie, who worked on a sugar plantation, died when Beverly was 2. Her mother, Ivy, suddenly was the single mother of two children and was pregnant with a third. Hall would later tell a Jamaican newspaper that her mother insisted she get the best possible education. In her case, that meant an all-girls’ high school known for its rigorous academics.\n“You had no choice — you had to achieve,” Hall once said.\nAfter high school, she moved to New York City, where she earned a bachelor’s degree at Brooklyn College. She later received a master’s from City University of New York and a doctorate from Fordham University.\nThe time and place of her education, Hall would say later, imbued her with a sense of idealism.\n“I came out (of college, in 1970) at a time when people were making commitments to improve society,” she said. “I wanted to do something that was meaningful.”\nShe got a job teaching in a tough middle school in Brooklyn. She wasn’t sure she would last the first year. But once she got her bearings in the classroom, she soon moved into school administration, rising steadily to the city’s No. 2 education post: vice chancellor for instruction. That job lasted just a year.\nWhen her boss resigned, Hall said later, she knew her time was short. As it happened, the state of New Jersey was taking over the failing Newark school system, across the Hudson River from New York City, and needed a new superintendent. Hall got the job.\nFrom the start, Hall was seen in Newark as the field marshal of an occupying army. Educators and elected officials resented the state intervention and pounced on Hall’s every misstep. She was especially criticized for continuing to live in Queens for two years — and for commuting to work in a chauffeur-driven car (never mind that it was a Chevrolet Caprice).\nHall trimmed payroll and cleaned up filthy schools. But Newark’s test scores rose only modestly (“from very low to low,” as a Rutgers University professor told The New York Times), and Hall left the school district reeling from a $58 million deficit in its $572 million annual budget.\nStill, the head of the committee searching for Atlanta’s new superintendent in 1999 described luring Hall as “a real coup.”\nNewark didn’t put up a fight.\n“That lady,” said Newark Mayor Sharpe James, one of Hall’s most tenacious adversaries, “is getting out of here before you realize she hasn’t done anything.”\nEDUCATOR AS CEO\nHall established herself in Atlanta as a different kind of superintendent.\nEarly on, she gathered the district’s principals to announce she planned to replace most of them. Lest they consider a revolt, she warned, “I know how to swim with the sharks.”\nMeanwhile, she courted business executives in Atlanta and beyond. Her efforts resulted in millions of dollars in grants from corporations like General Electric and from nonprofits like the Bill and Melinda Gates Foundation. The money paid for reform programs and new technology.\n“She speaks our language,” John Rice, a GE vice chairman then based in Atlanta, said in 2009. “She understands investors have choices. She wants to deliver a return, in our language.”\nAs she nurtured her business relationships, Hall spent less time meeting teachers and parents and visiting schools. Often, she seemed to approach her job more as a CEO than an educator.\nAn entourage trailed Hall inside and outside the school district’s downtown headquarters; it included a full-time bodyguard whose overtime pay often doubled her $50,000-a-year salary. Most district employees needed special permission to enter the floor that housed Hall’s office, and some have said that if they encountered the superintendent in the building, they knew better than to engage her with more than a smile and a “hello.”\nHall’s compensation, too, grew to CEO-like levels, with a base salary that approached $300,000 a year. She also collected bonuses that, over 10 years, totaled $580,000. The bonuses were based mostly on student test scores.\nBy most accounts, Hall found little time for anything beyond her job. She sent emails to aides and allies in the business community late at night, early in the morning, throughout the weekend. She once told an interviewer she watched almost nothing on television besides CNN and “The Tonight Show.”\nIn 2009, School Administrator magazine asked Hall to relate her “biggest blooper.” It was, she said, “when a staff member planned a team-building exercise at our senior team retreat to play miniature golf at day’s end, only to find out it was actually 18 holes of regular night golf. Most of us were not golfers and were not happy with the surprise.”\nHer blunder, in other words, was leaving the details in the hands of an underling.\nWHAT SHE KNEW\nEven after reports of systematic cheating in Atlanta attracted national attention, Hall received one more major honor: the distinguished service award from the American Educational Research Association. In her acceptance speech, Hall spoke of “using data every day, every way” and of the charts and graphs that lined her conference-room walls, giving her real-time information about student achievement in each school.\nBut a year later, as the state investigation into Atlanta’s test scores got under way, Hall told a radio interviewer she had no idea that suspicious patterns had emerged in many schools.\n“There is no way for the system to know that,” she said.\nThis conflict — she knew everything versus she knew nothing — remains the core mystery of Hall’s time in Atlanta. If she didn’t know what was happening, should she have known? If she knew, was she a hapless bystander — or a criminal conspirator? If she so regretted letting an aide plan a miniature golf outing, would she have left the oversight of something as critical as achievement testing to anyone else?\nIn their July 2011 report, the governor’s special investigators concluded that Hall created an atmosphere that rewarded cheaters, punished whistleblowers and covered up wrongdoing. She set unrealistic targets for higher test scores, the investigators said, encouraging principals and teachers to use any means necessary to give the superintendent what she wanted.\nHall took the credit, the investigators said, while Atlanta’s students suffered the harm.\n“Hall became a subject of adoration and made herself the focus rather than the children,” the investigators wrote. “Her image had become more important than reality.”\nThis view of Hall sharpened after a Fulton County grand jury returned a racketeering indictment against the former superintendent and 34 other educators in March 2013.\nHall resolved to fight the charges, her lawyers said Monday.\n“She never doubted that in a fair trial, with the jury hearing the state’s contentions and her rebuttal, to include her own testimony, she would be acquitted,” the lawyers said. They added that her “tireless efforts to raise standards of education at APS for every child under her care starkly contradict the notion that she somehow conspired to orchestrate widespread cheating.”\nTwenty-one defendants eventually pleaded guilty and agreed to help prosecutors in exchange for lenient sentences. Except for Hall and an educator who died in 2013, the remaining defendants went on trial last September. Closing arguments are scheduled for later this month.\nToo ill to participate, Hall nonetheless remained the trial’s central figure.\nWitness after witness implicated her as the leader of what a prosecutor called a “cleverly disguised, widespread conspiracy” to manipulate test scores. One of her top aides testified last month that Hall lied to the public and to state officials about the findings of the district’s internal investigations. Another witness said when cheating reports surfaced in 2008, Hall told aides, “That will make me look bad.”\nWhen she spoke under oath to the special investigators in 2011, Hall subtly deflected blame for the scandal onto others, even as she denied the existence of “coordinated, district-wide, centrally orchestrated cheating.”\nShe spoke about “an error in judgment” by one aide.\nShe said she was “upset” with another’s improper behavior — “if it happened.”\n“If I’m guilty of anything,” she said, “I’m guilty of assuming that the teachers could teach so the students could learn. … The superintendent is accountable, but the superintendent is not responsible.”","url":"https://www.ajc.com/news/breaking-news/beverly-hall-dies-criminal-case-and-her-legacy-unresolved/kWdRFDoS3Cze42IQTfYJOK/"}
