{"authors":["Breitbart News"],"date_download":"2018-10-30 18:23:40","date_modify":"2018-10-30 18:23:40","date_publish":"2016-02-23 05:00:48","description":"On Monday evening, just three days before Breitbart News Senior Editor-At-Large was scheduled to give his speech at California State University Los Angeles (CSULA) titled “When Diversity Becomes a Problem,” the president of the university officially cancelled the lecture, citing the need to organize a more “inclusive event.” |","filename":"data/vaneerConsumption/BEWARETHISMANStateCollegePresidentBansBreitbartsShapiro.json","image_url":"https://media.breitbart.com/media/2016/02/Ben-pasted_image_at_2016_02_22_11_47_pm_480.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_02_22__1540923820.html","title":"BEWARE THIS MAN: State College President Bans Breitbart’s Shapiro","title_page":"BEWARE THIS MAN: State College President Bans Breitbart’s Shapiro | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Monday evening, just three days before Breitbart News Senior Editor-At-Large was scheduled to give his speech at California State University Los Angeles (CSULA) titled “When Diversity Becomes a Problem,” the president of the university officially cancelled the lecture, citing the need to organize a more “inclusive event.”\nIn an email to the Young America’s Foundation chapter at CSULA, university president William Covino wrote, “After careful consideration, I have decided that it will be best for our campus community if we reschedule Ben Shapiro’s appearance for a later date, so that we can arrange for him to appear as part of a group of speakers with differing viewpoints on diversity. Such an event will better represent our university’s dedication to the free exchange of ideas and the value of considering multiple viewpoints.”\nShapiro and YAF have vowed to take their event to campus anyway, without the permission of the school. “The campus fascists have taken over,” Shapiro told Breitbart News. “I pay taxes in the state of California; I’m paying for these whiny children to be indoctrinated by radical leftists. For CSULA to pretend that they’re trying to provide balance isn’t just stupid, it’s insultingly stupid. I am the balance, and they’re too afraid to let me speak. These aren’t diversity warriors. They’re jackbooted thugs. If they want to call the men with guns to shut down free speech, they’ll demonstrate clearly just who they are. I’ll see them on Thursday.”\nYAF announced in a statement, “In recognition of the school’s dire need for ideological diversity, Young America’s Foundation and CSULA YAF, in cooperation with Ben Shapiro, fully intend to hold the event, which is part of YAF’s Fred R. Allen Lecture Series, without the university’s approval. The Foundation is prepared to take legal action if the school fails to recognize these students’ rights.”\nCovino clearly had no problem with the university hosting radical leftists ranging from Dr. Cornel West to Angela Davis and Tim Wise without the need for a conservative counterpoint. “Balance at CSULA only runs one way,” Shapiro said. “This event obviously threatens the feelings of the precious snowflakes at the university. Tough.”\nThe shutdown follows weeks of controversy, after Professor Robert Weide threatened to wrestle students for sponsoring the event, and Black Lives Matter activist Professor Melina Abdullah, who took to Facebook to complain, “I say this event is a problem…What we go’n do y’all?!?!” One of the commenters, Ruben Martin, replied, “You want I should hoiwt’em bwoss? I’s got a fews ideas me n’d’fellas been kickin ‘round. Only ting iz he won’t be talking or lookin so nice no more. We’ll take the cannolies…” CSULA students have said the event poses a “threat to their lives” and is “damaging to their mental health.”","url":"https://www.breitbart.com/local/2016/02/22/beware-this-man-state-college-president-bans-breitbarts-shapiro/"}
