{"authors":[],"date_download":"2018-10-30 20:44:13","date_modify":"2018-10-30 20:44:13","date_publish":"2014-05-05 21:25:06","description":"If someone calls demanding payment because you missed jury duty, hang up and call the authorities. That advice came from the Cherokee County Sheriff’s Office today after a citizen called 911 after receiving a bogus call.","filename":"data/vaneerConsumption/BewareofjurydutyphonescamCherokeeCountyofficialssay.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_beware-jury-duty_377beae4626a0a653b94ba240647b621__1540932253.html","title":"Beware of jury duty phone scam, Cherokee County officials say","title_page":"Beware of jury duty phone scam, Cherokee County officials say","title_rss":"NULL","source_domain":"ajc.com","text":"If someone calls demanding payment because you missed jury duty, hang up and call the authorities.\nThat advice came from the Cherokee County Sheriff’s Office today after a citizen called 911 after receiving a bogus call.\nAuthorities are investigating after a suspect claiming to be a deputy called a citizen about failing to respond to a summons for jury duty, the sheriff’s office said in a news release. The caller claimed that an arrest warrant had been issued, but jail could be avoided if the citizen paid the warrant off over the phone.\nThat would never happen because the sheriff’s office does not receive any payments over the phone related to warrants or civil papers, Lt. Jay Baker said in the news release.\nOnly one case has been reported so far, but authorities are concerned that there could be victims who are unaware of the scam.\n“We’re just trying to get the word out there as quickly as possible,” Baker told The Atlanta Journal-Constitution.\nA phone scam in the area in August used traffic citations as the trap.\nBaker said anyone who receives a similar call should call 911 and report it, and “never give out your financial information over the phone.”","url":"https://www.ajc.com/news/local/beware-jury-duty-phone-scam-cherokee-county-officials-say/SgLdW8bjYcnuHumKUYnywI/"}
