{"authors":["George Odling For Mailonline"],"date_download":"2018-10-23 02:25:26","date_modify":"2018-10-23 02:25:26","date_publish":"2016-01-28 17:09:21","description":"Andy Brown and Mandy Jenner, from East Sussex, refused to pay for a door they said was different to what they ordered. The couple were then stunned to see workmen taking their front door.","filename":"data/vaneerConsumption/Bexhillcouplewerestunnedwhenworkmentooktheirfrontdooraway.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AB8B7500000578-0-image-a-98_1453999612403.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421300_Couple-Mandy-Jenner-Andy-Brown-rowed-building-firm-River-Windows-stunned-workmen-took-door-away_1540261526.html","title":"Bexhill couple were stunned when workmen took their front door away","title_page":"Bexhill couple were stunned when workmen took their front door away | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A couple who had a row over payment with their building company watched in horror as workmen came and took their front door.\nMandy Jenner and Andy Brown had ordered a new door and windows for their house, and paid the deposit to River Windows to fit them, promising they would shell out a further £599 when the job was done.\nBut when the company fitted something different to what they had ordered the couple, who live in Bexhill, East Sussex, asked for it to be replaced - and said they wouldn't pay any outstanding money until this was done.\nThe company said they'd fitted exactly what was ordered - and refused to back down.\nWhen Mandy Jenner and Andy Brown refused to pay for the wrong door a member of River Windows took it\nWhen they didn't receive their money they made off with the door - in broad daylight.\nThe shocked couple caught everything on their home CCTV - but are still involved in a tug-of-war with the company.\nMr Brown, who is a builder himself, described the incident as 'dumbfounding'.\nHe said: 'We wanted a new door and windows and we ordered what we wanted - and we wanted obscured glass in the door because obviously you don't want people seeing through your front door.\n'First of all the made a complete hash of fitting the window - and it's still not correct, it's an absolute eyesore.\n'Then they installed the correct panel for the door but the glass is wrong - and this is what the argument keeps coming back round to.\n'They offered to put some plastic film over the back of it but obviously that isn't what we wanted - no one wants a bit of plastic film over their door.'\nMr Brown said he noticed the door was missing when he started to feel cold in the kitchen, but River Windows refused to replace it\nAfter weeks of arguing the couple got a phone call from the company asking if they were in - and said they were sending some people round to sort things out.\nA salesman and a builder turned up - the builder saw to the door while the salesman discussed other options with Ms Jenner.\nMr Brown was standing in the kitchen when he started to feel a bit cold - and he noticed the door had disappeared.\nHe said: 'I looked outside and the next thing I knew the builder had put the door into his vehicle and driven off.\n'Then the salesman left in a hurry, got in his own car and also shot off down the road.'\nWhile this was happening the couple also received a phone call from the company - telling them they wouldn't get the door back until the outstanding balance had been paid.\nMr Brown explained that they weren't willing to pay for a door they hadn't ordered and said he just wanted the correct door fitted.\nThe pair didn't want to give in to the builders - but equally they knew they couldn't go for long without a door in the middle of winter.\nMr Brown said: 'I just had no idea what to do - it was a Catch 22 situation.\n'In the end it has escalated a lot - we have still got the door boarded up.'\nHe said it was completely surreal - and the fact the builder had taken his front door didn't even register with him at first.\nHe said: 'Then I put two and two together and I was totally dumbfounded.\n'I was just trying to comprehend what had happened - it beggars belief.'\nRiver Windows said they offered the couple various options when they said the door was not what they were expecting.\nWhen the couple didn't want the plastic film to be fitted, the company said they then offered to fit an alternative door panel.\nThe company claim Mr Brown wasn't happy with this and offered the company an ultimatum - to leave it completely and not take any more money from them, to refit the original door or to pay for a different panel.\nJoel Ufton from Team Frames (right) and Stuart Johnstone from Harbour Home Improvements (middle) donate a front door to Mr Brown (left) in Bexhill, East Sussex\nThey also claim that as the couple said the company wouldn't be receiving another penny from them, they were perfectly within their rights to remove the door and leave a hole.\nIn a statement, the company said: 'In accordance with our terms and conditions, River Windows is entitled to repossess the goods at any time.\n'Therefore we had no option but to remove the door.\n'We have explained that if the outstanding balance is paid, the door will be replaced within 30 minutes.\n'Mr Dawson & Ms Jenner have a porch to the front of their property and the property was not left unsecure.'\nThe statement also claims that Mr Brown threatened River Windows staff with physical abuse.\nThey said: 'River Windows is more than happy to resolve any situation, however we will not respond to threats.'\nMr Brown and his partner said they have continued trying to resolve the issue with River Windows, but they began to worry they have to sort the problem without the installation firm.\nThen two people who saw what the pair had been going through came to the rescue.\nJoel Ufton from Team Frames was so moved by the couple's plight that he offered to replace the door free of charge - and Stuart Johnstone from Harbour Home Improvements came in to install it for them.\nMr Brown said: 'At first you just think the world is against you, but when Joel and Stuart stepped in it was unbelievable.","url":"https://www.dailymail.co.uk/news/article-3421300/Couple-Mandy-Jenner-Andy-Brown-rowed-building-firm-River-Windows-stunned-workmen-took-door-away.html"}
