{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-23 02:00:01","date_modify":"2018-10-23 02:00:01","date_publish":"2017-04-26 12:49:55","description":"The A-list couple, who are already parents to five-year-old daughter Blue Ivy, are hoping to secure the sprawling modern property, which comes complete with servants' quarters and four pools.","filename":"data/vaneerConsumption/BeyonceandJayZput120mbidonBelAirmansion.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9FA00600000578-0-image-a-2_1493209558721.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4447426_PICTURED-Beyonce-Jay-Z-s-new-pad_1540260001.html","title":"Beyonce and Jay Z put $120m bid on Bel Air mansion","title_page":"Beyonce and Jay Z put $120m bid on Bel Air mansion | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They're preparing to welcome twins into the world this June so are naturally hoping to size up.\nAnd Beyonce and Jay Z have reportedly put in a bid of $120 million on a new 30,000 sq ft Bel Air mansion in a bid to relocate from New York to Los Angeles.\nThe A-list couple, who are already parents to five-year-old daughter Blue Ivy, are hoping to secure the sprawling modern property, which comes complete with servants' quarters, a 15 car garage and four pools.\nScroll down for video\nSizing up? Beyonce and Jay Z have reportedly put in a bid of $120 million on a new 30,000 sq ft Bel Air mansion in a bid to relocate from New York to Los Angeles\nMusic royalty: The hip-hop star and the pop princess are preparing to welcome twins into the world this June so are naturally hoping to size up\nThe hilltop complex, designed by architect Paul McClean, boasts eight bedrooms, a staggering 11 bathrooms and even a recording studio, spread across six separate structures.\nThe property will provide Bey and Jay with top security since it comes with bulletproof windows and metal security gates.\nThe high end mansion has the advantage of 10,000 square feet of outdoor space across two acres of land, as well as stunning views across the hills.\nLavish: The hilltop complex, designed by architect Paul McClean, boasts eight bedrooms, a staggering 11 bathrooms and even a recording studio, spread across six separate structures\nLuxury leisure facilities: In true Hollywood style, the house also has the luxury of a hot tub, sauna and steam room, as well as the four pools\nIn true Hollywood style, the house also has the luxury of a hot tub, sauna and steam room, as well as the four pools.\nIt is being sold off-market for an asking price of $135 million and has just been given an extensive remodel.\nA real estate source told Page Six: 'The house is beyond words. No expense was spared in design or execution.'\nOn high alert: The property will provide Bey and Jay with top security since it comes with bulletproof windows and metal security gates\nBeyonce and Jay-Z have rented mansions in LA, but never bought in the city; they've been outbid in previous attempts by fashion designer Tom Ford and Minecraft creator Markus Persson.\nThey've already been scoping out schooling for their daughter, Blue Ivy, in the area.\nAnd they were spotted in Malibu, California, on Sunday, after dining at a beachside venue.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4447426/PICTURED-Beyonce-Jay-Z-s-new-pad.html"}
