{"authors":[],"date_download":"2018-10-22 22:06:43","date_modify":"2018-10-22 22:06:43","date_publish":"2014-06-06 13:42:58","description":"A ubiquitous as Slender Man now seems, there's still plenty more on the Internet parents don't know about. Here's a drop in the bucket.","filename":"data/vaneerConsumption/BeyondSlenderManMoreInternetThingsYouKnowNothingAbout.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_26/491911/today-slenderman-140605-tease_d8f27da41122a1ef3d6ac6a3a6d58b51.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_slender-man-stabbing_beyond-slender-man-more-internet-things-you-know-nothing-about-n124421_1540246003.html","title":"Beyond Slender Man: More Internet Things You Know Nothing About","title_page":"Beyond Slender Man: More Internet Things You Know Nothing About ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe Internet can be a weird place.\nA vicious stabbing brought the Internet meme Slender Man to the attention of parents across the country – but the digital boogeyman is just one of many online creations popular among kids, but mostly unknown to their parents -- and therefore frighteningly mysterious. Like Slender Man, these online characters and communities aren’t dangerous for young minds. But it's always good for parents to keep connected with their kids online. Here are a few.\nPewDiePie\nJuvenile, profane and gut-bustingly hilarious, PewDiePie (real name Felix Arvid Ulf Kjellberg) is a Swedish video game commentator who, with more than 27 million subscribers, hosts the most popular channel on YouTube. And frankly, Mom and Dad, if this sweetly ridiculous 24-year-old is the worst thing your kids are obsessively re-watching on the video-sharing channel, breathe a sigh of relief.\nIn a community where potentially dangerous dares like the spice-chugging cinnamon challenge go viral, PewDiePie is an oasis of adolescent innocence. His shtick includes narrating video game play, either mocking the action or ad-libbing the interior thoughts of video game characters. PewDiePie’s pugs Maya and Edgar often appear as the long-suffering foils of his live-action skits.\nWith great Internet fame, PewDiePie's taken on great responsibility, engaging his \"25 Million Bros Strong Bro Army\" to raise money for charities including St. Jude Children's Research Hospital, the World Wildlife Fund and Save the Children.","url":"https://www.nbcnews.com/storyline/slender-man-stabbing/beyond-slender-man-more-internet-things-you-know-nothing-about-n124421"}
