{"authors":["Quinn Keaney"],"date_download":"2018-10-30 22:46:15","date_modify":"2018-10-30 22:46:15","date_publish":"2014-08-14 19:28:19","description":"In a dark, depressing world rife with rumors of an impending divorce between hip-hop power couple Jay Z and Beyoncé, there is not much to look forward to. The On the Run tour is coming to a close, and with it, the apparent end of a marriage made in…","filename":"data/vaneerConsumption/BeyonceJayZsDivorceWouldLeaveSpaceforaNewPowerCoupleWeHaveJustthePair.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/87941f31-397a-4512-9773-be6f4bdd6ec9.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35800-beyonce-jay-zs-divorce-would-leave-space-for-a-new-power-couple-we-have_1540939575.html","title":"Beyonce & Jay Z's Divorce Would Leave Space for a New Power Couple & We Have Just the Pair","title_page":"Beyonce & Jay Z's Divorce Would Leave Space for a New Power Couple & We Have Just the Pair","title_rss":"NULL","source_domain":"bustle.com","text":"In a dark, depressing world rife with rumors of an impending divorce between hip-hop power couple Jay Z and Beyoncé, there is not much to look forward to. The On the Run tour is coming to a close, and with it, the apparent end of a marriage made in music mogul heaven. Who will fill the deep void left by pair once so \"Crazy In Love?\" Which twosome will boldly put their \"Love On Top\" for the sake of a legion of fans left out to dry? Is there a couple out there who will finally put an end to me desperately squeezing out puns from Beyoncé song titles?\nWere these questions asked a few months ago, Big Sean and Naya Rivera might have been the answer. Both hot, both musically gifted, it could have been truly great. Fast forward a bit following their disastrous breakup, and she's now married to actor Ryan Dorsey, while Big Sean is cozying up to pint-sized pop star Ariana Grande. Knock them off the list. Next up: Future and Ciara. They each had one name, and one big love for each other. Well, that is until he reportedly cheated on her while she was caring for their 3-month-old baby. So, yeah. Scratch that.\nThe real answer to all of our prayers comes in the form of none other than low-key couple Wiz Khalifa and Amber Rose.\nYou might be reading this thinking, \"What is this BS? Isn't Wiz only famous for his passionate love of marijuana?\" Or maybe, \"Amber instead of Beyoncé? Who even is Amber Rose?!\" And yes, alright, I can definitely understand those complaints. After all, Queen Bey and Jay Z leave giant shoes to fill. Although these two are a bit of a dark horse when it comes to choosing a couple to usurp the illustrious Bey-Jay crown, there are quite a few reasons why Wiz and Amber might have what it takes.\n1. Watch out Blue Ivy, because Sebastian \"Bash\" Taylor Thomaz is the coolest celeb baby in the game right now\nBlue Ivy has experienced more amazing things in her short two years on earth than I will over the course of my entire life, but to be honest, I could gush about lil Bash for days. Have you seen those cheeks?\nOr his adorable little outfits?\nHe's by far the most underrated celebrity spawn out there, and I'm definitely not alone in thinking that. With his dad's infinitely chill demeanor combined with his mom's fierce style, there's no way he's going to grow up to be anything but a badass.\n2. They have a few pretty sick celebrity friends\nA power couple is only as good as their entourage, and these two have celeb friends in spades.\n\"It\" model Cara Delevingne\nRapper Snoop Dogg (or Lion? I can't keep track)\nJack-of-all-trades Nick Cannon\nHipster band The 1975\nAnd of course (of course?), superstar actor Johnny Depp.\n3. They pull off UH-MAY-ZING matching outfits\nAs soon as they stepped out at the SXSW festival in March of 2014 in these hilarious matching ensembles, the whole world made a collective \"awwww\" sound. OK, it might've been just me...\n4. Amber Rose has the self-deprecating humor we all wish Beyoncé did\nWhile Beyoncé is busy photoshopping her Instagrams and making sure her social media accounts are OCD perfect, Amber isn't afraid to poke a little fun at herself. When it comes to her trademark shaved head, girl has got jokes for days. She captioned the below photo on her Instagram account: \"Oh y'all didn't know I could pop it on a handstand?\" HAH!\n5. Wiz has a pretty hilarious Twitter account (whether it's on purpose or not)\nIf only Jay Z wasn't so private and closed off, he too could share epic thoughts with the world such as:\nOr maybe:\nWould Jay Z tell you if you were being a \"diccface?\" TRICK QUESTION! He wouldn't talk to you at all, because he doesn't associate with peasants.\n6. One time Wiz cradled a lion as if it was the most casual thing in the world\nThat's all.\n7. Their love seems really, really real. Like, ew-they're-so-cute-this-is-almost-gross, real.\nWhen every other celeb couple under the sun is calling it quits, their relationship is a breath of fresh air. Albeit that air might be full of smoke, but still. Super cute.\nLong may you reign, Khalifas!\nImages: Getty Images; Amber Rose (6), Wiz Khalifa/Instagram (8)","url":"https://www.bustle.com/articles/35800-beyonce-jay-zs-divorce-would-leave-space-for-a-new-power-couple-we-have"}
