{"authors":["Sarah Jane Tribble"],"date_download":"2018-10-23 00:51:48","date_modify":"2018-10-23 00:51:48","date_publish":"2016-02-18 00:00:00","description":"Bringing kids to a museum or zoo can be great — until lunchtime. Often those cafeterias offer few healthful food options, but there's a movement to change that.","filename":"data/vaneerConsumption/BeyondPizzaAndFrenchFriesMuseumsEyeMoreHealthfulMenus.json","image_url":"https://media.npr.org/assets/img/2016/02/12/amazoncafepizza_wide-2c29d1360cda50c65ed559dc0ca1d3af98b702fa.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thesalt_2016_02_18_466384938_beyond-pizza-and-french-fries-museums-eye-more-healthful-menus_1540255908.html","title":"Beyond Pizza And French Fries: Museums Eye More Healthful Menus","title_page":"Beyond Pizza And French Fries: Museums Eye More Healthful Menus : The Salt : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Beyond Pizza And French Fries: Museums Eye More Healthful Menus\nEnlarge this image toggle caption Sarah Jane Tribble/WCPN Sarah Jane Tribble/WCPN\nWhen Rachel Mollen strolls into the cafe at Phipps Conservatory and Botanical Gardens in Pittsburgh with her 5-year-old son, she knows exactly the kind of food they will eat.\n\"Will, he's the youngest of four, and he wanted to do something special today,\" Mollen says. \"I was trying to think of some place that we could go for lunch and have a healthy lunch and do something fun.\"\nThe boy sits quietly munching his vegan cheese pizza, fruit salad and low-fat white milk. He is a bit unhappy, Mollen says, that it is not chocolate milk. But that isn't even an option at the Phipps Cafe.\nIn 2011, the conservatory's cafe made it a mission to serve healthful food. It eliminated all junk food and sodas from the menu, says Richard Piacentini, Phipps' executive director. He says it was to reflect the museum's values.\n\"You see, a lot of people come here now because they know they can bring their kids in and they're not going to have to have a battle with their children over the kind of food they're going to eat,\" says Piacentini, who is the father of 10-year-old twins. \"Some [other] places like to give choices. We decided that choices create an opportunity for conflict.\"\nThe Phipps Cafe, as well as the Mitsitam Native Foods Cafe at the Smithsonian National Museum of the American Indian in Washington, D.C., are part of an emerging trend. Museums and zoos across the country are trying to replace the standard french fries and corn dog kids fare with healthier, more mission-oriented food, says Elizabeth Merritt, founding director of the D.C.-based Center for the Future of Museums, an initiative of the American Alliance of Museums.\n\"One of the things museums are very aware of is that they have a bigger responsibility to their communities. And part of those responsibilities are to be aware of issues like obesity and attendant diseases, like diabetes or high blood pressure,\" Merritt says.\nBut, she says, there is an inherent problem for the alliance's more than 4,000 members nationwide. Most do not have full control over the menus served in their eating areas, because their food service is done by contractors.\nUsually, the contract allows the food service company to take a percentage of the sales, \"which of course gives them an enormous incentive both to choose menu items that are very popular and sell well, and have as high as possible a profit margin,\" Merritt says.\nThat's even if the profit contradicts the museum's mission.\nThe marquee culture institutions in Cleveland provide a small Midwestern case study of what can happen when institutions try to change their menus.\nAt the Cleveland Museum of Natural History, one of the first things you notice when you walk into the revamped cafeteria is a bright red Coke machine.\nPopular local chef Zack Bruell took over the museum's food service contract last year and immediately began to rework the menu. The museum's leaders had given instructions to offer more healthful options.\n\"There is a process to this. You can't just hit people over the head with it in Cleveland, Ohio,\" Bruell says. \"There's a different mentality here, and we have to do it slowly. But I do believe that the food we're doing here is healthy, because we're doing it from scratch.\"\nThe menu still includes creamy mac and cheese, but there are also turkey sandwiches on whole wheat, and, Bruell says, \"nothing comes out of a can.\"\nAnd that Coke machine? It may be gone by the time the museum completes its five-year, $150 million expansion with an entirely revamped cafe, Bruell says.\nBut when another local institution, the Children's Museum of Cleveland, tried to sell fresh fruit, the produce just spoiled, says Maria Campanelli, director of the museum. And when they removed soda from the premises a few years ago, families complained, she says.\n\"Parents came back and said, you know, we'd like to have some type of caffeinated beverage,\" Campanelli says. With a laugh, she said that for a museum aimed at children age 8 and younger, it's understandable that tired parents might want a little boost from a high-sugar drink.\nAt the Cleveland Metroparks Zoo, executive director Chris Kuhar says \"we want to be a responsible citizen.\" Kuhar says the zoo tries to offer more healthful food options. For example, before hitting the pizza at the zoo's Amazon Cafe in the Rainforest, visitors are greeted with an updated salad bar. And across the park, he says, zoo cafes offer fruit juice, fruit cups and some deli sandwiches.\nBut, sometimes it's easier to persuade the animals to eat better than the human visitors. Facing some health challenges, the zoo's primates were put on a diet of more leafy greens and less processed pellets several years ago.\n\"We've got sort of a controlled experiment here with our animals,\" Kuhar says. \"So I can tell you exactly what happens when you go on a leafy greens diet. You lose weight, your blood pressure improves and your blood glucose-to-insulin ratio improves. All these sorts of things that we see in our animals, I'd love it if folks responded that way at our food service locations as well.\"\nThis story is part of a reporting partnership with NPR, WCPN and Kaiser Health News.","url":"https://www.npr.org/sections/thesalt/2016/02/18/466384938/beyond-pizza-and-french-fries-museums-eye-more-healthful-menus"}
