{"authors":["Jewly Hight"],"date_download":"2018-10-23 02:06:48","date_modify":"2018-10-23 02:06:48","date_publish":"2016-11-04 00:00:00","description":"The collaboration stirred up controversy, but in the room at the CMA Awards, the performance of Beyoncé's \"Daddy Lessons\" felt like a precise recalibration of pop for a country setting.","filename":"data/vaneerConsumption/BeyoncAndTheDixieChicksOfferUpLessonsOnCountryMusicsPastAndFuture.json","image_url":"https://media.npr.org/assets/img/2016/11/03/gettyimages-620680986_wide-f15ab271cc574fc99f1bd212e709001bb46228bb.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_therecord_2016_11_04_500562813_beyonc-and-the-dixie-chicks-offer-up-lessons-on-country-musics-past-and-future_1540260408.html","title":"Beyoncé And The Dixie Chicks Offer Up Lessons On Country Music's Past (And Future)","title_page":"Beyoncé And The Dixie Chicks Offer Up Lessons On Country Music's Past (And Future) : The Record : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Beyoncé And The Dixie Chicks Offer Up Lessons On Country Music's Past (And Future)\nEnlarge this image toggle caption Rick Diamond/Getty Images Rick Diamond/Getty Images\nIn honor of the 50th anniversary of the CMA Awards, show producers worked a truly impressive number of performers into the Nov. 2 telecast, utilizing everything from moving medleys to photo montages and mentions of legends seated in the audience.\nBut no other appearance received half the attention of Beyoncé's \"Daddy Lessons\" collaboration with the Dixie Chicks. As with just about anything Bey-related, the announcement that she would take the stage at Nashville's Bridgestone Arena during what's billed as \"Country's Biggest Night\" generated a flurry of social media responses voicing a wide array of opinions. At opposing extremes were those exultant about the superstar extending her dominance into an additional corner of the musical landscape and those who declared themselves country fans — but likely represented only a small but vocal minority of the genre's listenership — and insisted that she didn't belong there.\nThe day after the show, a number of blogs joined Beyhive diehards in accusing the Country Music Association of bowing to the more vitriolic, racially charged commenters by erasing all online promotion of the Bey/Chicks segment, a conversation which ultimately amplified the perception that such viewpoints represented the country audience en masse. (The plausible explanation offered by the CMA was that Beyoncé's representatives were simply selective about what photos and video clips they would approve.) Some of the complaints plucked from Twitter feeds and comment threads on the CMA's Facebook page had a territorial tone that echoed the \"Is it or isn't it country?\" debate that sprang up in some corners after \"Daddy Lessons\" was released on Lemonade in April.\nEven so, the feeling in the room when Beyoncé took the stage was that we were watching a precision entertainer consciously recalibrate her delivery for the setting. It was one of the few segments in the show through which the entire arena remained on its feet. The song kicked off with harmonica, rather than the album version's New Orleans-style horn intro, a down-home touch that hearkened back to country music's early, and incidentally African-American, harmonica hero Deford Bailey. Beyoncé struck up a \"Texas\" chant, then passed it off to Natalie Maines, Emily Robison and Martie Maguire, in acknowledgement of their shared geographical origins in a state rich in countrified storytelling. Between the tweaking of Beyoncé's usual live instrumentation — less low-end thump, more strumming and light-footed percussion — and the Chicks' bluegrass underpinnings, they leaned into a string band sound, even briefly veering into a stuttering, second line-ish adaptation of the Chicks' fiddle romp \"Long Time Gone,\" a No. 2 country hit in 2002. And it was no small gesture for an artist whose performances of physicality have become iconic in R&B and pop realms — from her leotards to her magnetic dance choreography — to don a sheer, floor-length gown whose puffy sleeves Loretta Lynn might appreciate and, in a visual display of solidarity, stand next to the Chicks, who were anchored to instruments and mic stands. Beyoncé certainly didn't squander her official country slot.\nFrom a historical angle, her country excursion represents something more like reclamation than invasion, since the genre's roots entwine with African-American folk, blues, string band and pop contributions. In more recent times, a precedent's been set for artists from other genres signaling their affinity for country music by making pilgrimages to Nashville writing rooms and studios, enlisting the talents of recognized Music Row pros or teaming up with country's resident stars. It's nothing new either for the CMA Awards to present crossover pairings that, in a sense, position major country acts to vouch for the country-friendliness of pop heavyweights. (See: last year's much-discussed collab between Chris Stapleton and Justin Timberlake, or 2013's between the Zac Brown Band and Dave Grohl.) But Beyonce's \"Daddy Lessons\" was written and recorded entirely independently of the country scene, and her performing partners, the Chicks — who'd been regularly covering her song — no longer have the ambassadorial heft of the format insiders they once were. They've kept a safe distance from the Nashville establishment ever since the radio rejection that followed lead singer Natalie Maines' 2003 on-stage comments about President Bush. Until a few months ago, they hadn't headlined Nashville in a decade.\nWhen Beyonce, the Chicks and their combined band took the stage deep in the awards show, some may have experienced it as an interruption in the honoring of country stars past and present, especially given that it came immediately before a lifetime achievement nod to Beyonce's fellow stadium-filler Kenny Chesney, comprised of a speech from Peyton Manning and an admiring tribute video; without a performing component, it couldn't help but seem subdued in comparison to the high-energy musical interlude that had come just before. But Beyonce's turn also brought a certain symmetry to the night.\nInteraction with other forms of popular music — as opposed to isolation from them — is a source of pride, not to mention one among many drivers of stylistic evolution, in the mainstream country world. Crossover impact has been one of the great achievements of the award show's penultimate honoree, Dolly Parton, who was feted with a medley of hits, like \"Here You Come Again\" and \"9 to 5,\" that landed her on the pop charts and a standard, \"I Will Always Love You,\" that's had a second life in reinterpretations by pop superstars of color, Beyoncé included. It's worth noting too that two of the five singers paying tribute to Parton, Reba McEntire and Jennifer Nettles, have also dipped into Beyoncé's catalog on occasion.\nThe \"Daddy Lessons\" performance was preceded earlier in the night by Maren Morris's explicit incorporation of African-American gospel stylings into her breezy country-pop gem \"My Church\" and Keith Urban's smolderingly stark rendition of his throwback soul single \"Blue Ain't Your Color.\" And shortly after Beyonce sang with the Chicks, Dwight Yoakam and Chris Stapleton revisited a successful country-soul collaboration with a cover of \"Seven Spanish Angels,\" a Willie Nelson and Ray Charles duet that became a country hit in the mid-'80s. That wasn't Charles's first foray into country music, of course, but it was his highest charting one. (The complexities of Charles's track record with the genre, and the impact of race on the categorization of American music in general is too much to wade into here, but there's plenty of important work on the subject.) To have Beyonce, a contemporary, southern-born, black R&B artist in the mix helped ensure the circle remained unbroken.","url":"https://www.npr.org/sections/therecord/2016/11/04/500562813/beyonc-and-the-dixie-chicks-offer-up-lessons-on-country-musics-past-and-future"}
