{"authors":["Christine Rendon For Dailymail.Com"],"date_download":"2018-10-22 21:47:31","date_modify":"2018-10-22 21:47:31","date_publish":"2016-01-11 01:35:59","description":"The 34-year-old and her husband Jay Z welcomed Blue Ivy in 2012. Next up, Beyonce is lined up to perform at the Super Bowl half time show.","filename":"data/vaneerConsumption/BeyoncecelebratesBlueIvysfourthbirthdaywithEllenPompeosdaughter.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/3001F63D00000578-0-image-a-6_1452476581504.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393163_Beyonce-celebrates-Blue-Ivy-s-fourth-birthday-two-festive-bashes-Ellen-Pompeo-s-daughter-Stella-joins-party_1540244851.html","title":"Beyonce celebrates Blue Ivy's fourth birthday with Ellen Pompeo's daughter","title_page":"Beyonce celebrates Blue Ivy's fourth birthday with Ellen Pompeo's daughter | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Her little girl turned four on Thursday.\nAnd Beyonce was determined to make sure the milestone was an unforgettable one for her daughter Blue Ivy, throwing not one but two birthday bashes.\nThe 34-year-old singer first celebrated Blue's birthday with a fairy-themed bash at a private home on Saturday as well as a second one that saw Ellen Pompeo attend with her family.\nSee latest photo updates on Beyonce as she celebrates daughter Blue Ivy's fourth birthday\nBirthday fun: Ellen Pompeo guided her daughter Stella Luna out of a second bash for Blue Ivy in Cake Mix in West Hollywood on Sunday\nHer tiny dancer: Beyonce recently Instagrammed a snap of herself twirling her little girl on the dance floor\nThe intimate party, which had less than 50 guests total, was located at a private home and was sectioned off with areas just for youngsters to play with toys, according to a report by E!online,.\nOf course the bash included plenty of food, which included ice cream and a birthday cake.\nFormer Destiny's Child singer Kelly Rowland and Coldplay singer Chris Martin were among the guests at the party, where Beyonce and Jay-Z were spotted being affectionate towards each other.\nGirl of honour: A bouquet of pink, light blue, and violet balloons is taken out of an awaiting car\nFestive: The bouquet of balloons livened up the party\nBut it wasn't the only party the couple threw for her little girl.\nThe couple also celebrated Blue Ivy's fourth birthday on Sunday at Cake Mix in West Hollywood, where Ellen Pompeo, her husband Chris Ivery, and their daughter Stella Luna, six, also attended.\nBeyonce and Jay-Z welcomed Blue Ivy into their family on January 7, 2012.\nCool customer: Ellen Pompeo's husband Chris Ivery was a stylish sight in his blue jeans and V-neck sweater as he headed outside of the establishment\nThe hitmaker and Jay Z tied the knot in 2008 and welcomed their daughter Blue Ivy in January 2012.\nBeyoncé found success in the late 1990s as lead singer of Destiny's Child. She later embarked on a solo career and is widely considered as one of the world's top entertainers.\nShe has won 20 Grammy Awards, performed during the Super Bowl and was listed by Forbes as the most powerful female musician of 2015.\nNext up, Beyonce is set to return to the Super Bowl's halftime show.\nThe Drunk In Love singer is lined up to join Coldplay on stage in February, Pepsi - the show's sponsor - confirmed to The Associated Press on Thursday.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393163/Beyonce-celebrates-Blue-Ivy-s-fourth-birthday-two-festive-bashes-Ellen-Pompeo-s-daughter-Stella-joins-party.html"}
