{"authors":["Nina Bradley"],"date_download":"2018-10-31 00:08:35","date_modify":"2018-10-31 00:08:35","date_publish":"2018-10-30 22:32:59","description":"Queen Bey reigns supreme on Halloween once again! Beyoncé dressed as Toni Braxton for Halloween 2018, totally slaying the holiday for another year in a row and Twitter couldn't be more in awe about the epic moment shared between the musical legends.…","filename":"data/vaneerConsumption/BeyoncesToniBraxtonHalloweenCostumePaidHomageToTheSingerInTheMostFlawlessWayPHOTOS.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/10/30/688ab0b6-5414-4c4d-b001-19c8523b3ce5-getty-946417964.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_beyonces-toni-braxton-halloween-costume-paid-homage-to-the-singer-in-the-most-flawless-way-photos-13039991_1540944515.html","title":"Beyonce's Toni Braxton Halloween Costume Paid Homage To The Singer In The Most Flawless Way - PHOTOS","title_page":"Beyonce's Toni Braxton Halloween Costume Paid Homage To The Singer In The Most Flawless Way — PHOTOS","title_rss":"NULL","source_domain":"bustle.com","text":"Queen Bey reigns supreme on Halloween once again! Beyoncé dressed as Toni Braxton for Halloween 2018, totally slaying the holiday for another year in a row and Twitter couldn't be more in awe about the epic moment shared between the musical legends. On Tuesday Oct. 30, Bey took to Instagram to share pics of herself dressed as the \"Breathe Again\" singer in a recreation of Braxton's eponymous debut album cover which Bey alternatively dubbed, \"Phoni Braxton.\" Beyoncé's replication of the look came complete with a pair of denim jeans, a white tank, and a chainlink belt almost identical to those worn by Braxton in the 1993 project's artwork — and her execution from head to toe was completely flawless — to say the least. The 37-year-old Lemonade star topped things off with a wig that channelled Braxton's signature cropped hairstyle from the early '90s.\nAlong with the photos, Bey shared an empowering message to both Braxton and her fans. She wrote,\n\"Sending love and adoration to one of our talented legends. Thank you for the countless bops. Your tone, your beauty, your range, and your God-given talent is treasured. Loving you always. Have a Happy Halloween my Kings and Queens.\"\nThroughout the years, Bey has become notorious for showcasing costumes that honor Black women in entertainment. Social media fans seemed to be completely in love with Beyoncé's recent salute to Braxton. The moment quickly turned into a trending topic on Twitter after its posting on Tuesday afternoon.\nBraxton was also taken aback by the honor, jumping to both Twitter and Instagram to thank Beyoncé for the \"love.\" In her tweet, which notably acknowledged and promoted support between women, the 7-time Grammy Award-winning entertainer wrote,\n\"Phoni Braxton!? NEVER!!! How do you look better than me on MY album cover? I LOVE IT, Such a superstar! Thanks for the love sis! Happy Halloween Who run the world...GIRLS! GIRLS!\"\nIt goes without saying that Beyoncé never disappoints when it comes to Halloween. Last year, Beyoncé honored Lil' Kim for Halloween 2017 by sporting five different costumes that were inspired by some the original Queen Bee's most iconic looks. Before that, Beyoncé collaborated with her daughter, Blue Ivy and her mother, Tina Knowles to recreate the all female rap group, Salt-N-Pepa in 2016. That same year, Bey and Blue Ivy also dressed as black Barbie dolls while JAY-Z went as Barbie's longtime bae, Ken. The Carter family also shared a collaborative costume moment in 2015, reenacting characters from Eddie Murphy's 1988 box office classic, Coming To America. The year prior, Bey dressed as the iconic Janet Jackson and Blue stepped into the role of the singer's big brother, Michael Jackson.\nIt is unclear whether or not this will be the only dress up moment fans will see from the superstar in 2018. In past years, Bey has done more than one costume and often shares the photos days after Oct. 31, so followers may be in for more surprises from the mother of three in the days to come. Perhaps, fans will be treated to another adorable sneak peek of she and JAY-Z's twin toddlers, Rumi and Sir Carter dressed up for a family photo on the holiday. Guess we'll all have to keep our fingers crossed.","url":"https://www.bustle.com/p/beyonces-toni-braxton-halloween-costume-paid-homage-to-the-singer-in-the-most-flawless-way-photos-13039991"}
