{"authors":["Kenya Foy"],"date_download":"2018-10-30 22:36:05","date_modify":"2018-10-30 22:36:05","date_publish":"2014-08-14 22:56:31","description":"Millions of Kim Kardashian fans follow her every move, and amongst her die-hard fans are probably those who douse themselves in her latest fragrance, and only wear clothes from the Kardashian Kollection while they lounge around playing Kim…","filename":"data/vaneerConsumption/BeyonceJayZDivorceRumorsAreFueledByKimKardashianButSheProbablyShouldHaveStayedSilent.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/7ebf60a8-daf9-4a8a-8b57-e36f231eb0fd.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35861-beyonce-jay-z-divorce-rumors-are-fueled-by-kim-kardashian-but-she-probably-should-have_1540938965.html","title":"Beyonce & Jay Z Divorce Rumors Are Fueled By Kim Kardashian - But She Probably Should Have Stayed Silent","title_page":"Beyonce & Jay Z Divorce Rumors Are Fueled By Kim Kardashian — But She Probably Should Have Stayed Silent","title_rss":"NULL","source_domain":"bustle.com","text":"Millions of Kim Kardashian fans follow her every move, and amongst her die-hard fans are probably those who douse themselves in her latest fragrance, and only wear clothes from the Kardashian Kollection while they lounge around playing Kim Kardashian: Hollywood all day. Frankly, that's not me. However, I do in fact, keep up with the Kardashians (that couldn't be helped), write about Kim from time to time, and there was that one time I perused the racks at DASH Miami. So I'm not her biggest fan, but that doesn't mean I can't be concerned about her, particularly because she spoke about Beyoncé and Jay Z's marriage during her recent appearance on Watch What Happens Live!\nKardashian kept her comments pretty PC when asked about the divorce rumors surrounding the couple, saying, \"I don't know...I mean...you just always hope that nothing like that's true and you just wish them the best.\" Even though those sentiments sound like they came from a genuine, heartfelt place, I'd hate to see Kardashian get caught up in the crossfires of those who are fully invested in what will happen with Beyoncé and Jay Z's marriage (read: Beyhive).\nSure, what Kardashian said sounds like she doesn't know anymore than the rest of us do, and if she wasn't Kim Kardashian, she might be in the clear with her statement. But it's been proven time and time again how a celebrity molehill grows into a mountain exponentially faster than its average counterparts. For example, Beyoncé changed the lyrics to \"Resentment\" during a concert spawned enough rumors to last a lifetime, but if someone with less popularity pulled the same stunt, we'd probably just think they were either being creative or forgot the words.\nSo it's nice that Kardashian felt comfortable enough to offer kind words to the couple without fueling the flames that are already spreading fast enough to engulf the entirety of Hollywood, but if she doesn't want to find herself having to perform a stop, drop and roll routine, she might want to back slowly away from that fire and take the silent route when it comes to answering questions about Beyoncé and Jay Z's marriage.","url":"https://www.bustle.com/articles/35861-beyonce-jay-z-divorce-rumors-are-fueled-by-kim-kardashian-but-she-probably-should-have"}
