{"authors":["Lily Waddell For Mailonline"],"date_download":"2018-10-23 00:59:04","date_modify":"2018-10-23 00:59:04","date_publish":"2017-03-16 10:40:55","description":"Beyonce's sister Solange Knowles wore a sexy purple one-shoulder top with matching loin-cloth hotpants and thigh-highs on Wednesday night.","filename":"data/vaneerConsumption/BeyoncessisterSolangeKnowlesgoesbralessonstage.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E53326B00000578-0-image-a-39_1489657301173.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319480_Beyonce-s-sister-Solange-Knowles-goes-braless-onstage_1540256344.html","title":"Beyonce's sister Solange Knowles goes braless onstage","title_page":"Beyonce's sister Solange Knowles goes braless onstage | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Beyonce's sister Solange Knowles wore a sexy purple one-shoulder top with matching loin-cloth hotpants and thigh-highs on Wednesday night.\nThe 30-year-old opted to go braless as she showed off some serious sass while on stage at a YouTube music showcase at the 2017 SXSW Conference and Festivals in Austin, Texas.\nShe wore her hair loose as she sported natural earthy tone make-up to perform to an eager crowd.\nScroll down for video\nWhat a diva! Braless Solange Knowles wore a sexy purple one-shoulder top to perform at a YouTube music showcase at the 2017 SXSW Conference and Festivals in Texas on Wednesday\nHot style: Beyonce's sister wore matching loin-cloth hotpants and thigh-highs to perform\nOn trend, she squeezed into a stylish lilac tube top flaunting her feminine curves.\nAll eyes were on the diva when she flashed a hint of her generous cleavage in her sexy ensemble.\nBeyonce's baby sister teamed the hot top with cherry-picked matching high waisted shorts and long knee-high socks.\nBreak out! The songstress couldn't be tamed when she stepped into the spotlight onstage for her live performance, with her raven curls roam loose as she pulled off a wild style\nBesties: Big sister Beyonce revealed she was the Feelin' You hitmaker's number one fan\nThe American songstress, who did several stints on-board Destiny's Child, sported a wild look as she wore her voluminous tresses in a loose style.\nThe Feelin' You hitmaker was in her element looked relaxed as she oozed confidence onstage.\nEarlier this year, the songstress revealed her feisty personality and ambition to succeed as she is determined to make a name for herself.\nTime of her life: She boldly went braless in a tight tube top flashing her feminine curves. She teamed the attire with matching high waisted shorts and knee-high socks\nShe told Beyonce in a chat for Interview Magazine: 'I always knew what I wanted. We damn sure know that I wasn't always right. But I'd sit firm, whether I was right or wrong.'\nAnd of course, the pregnant star told her little sister she is her biggest fan.\nIn full sister mode, she slammed this year's Grammy's when Beyonce lost out on the sought after title Album Of The Year to Adele.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319480/Beyonce-s-sister-Solange-Knowles-goes-braless-onstage.html"}
