{"authors":["Dan Cain For Mailonline"],"date_download":"2018-10-23 01:54:20","date_modify":"2018-10-23 01:54:20","date_publish":"2016-01-29 16:07:12","description":"Not only have Coldplay managed to persuade Beyoncé, 34, to lend her impressive vocal talents to their latest track Hymn for the Weekend; she also stars in their gloriously colourful video.","filename":"data/vaneerConsumption/BeyoncchannelsBollywoodbeautyinColdplaysHymnForTheWeekendvideo.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B403B100000578-0-image-a-34_1454082914029.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423029_Beyonc-channels-Bollywood-beauty-Coldplay-s-Mumbai-based-Hymn-Weekend-music-video_1540259660.html","title":"Beyoncé channels Bollywood beauty in Coldplay's Hymn For The Weekend video","title_page":"Beyoncé channels Bollywood beauty in Coldplay's Hymn For The Weekend video | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's a global superstar most music acts would kill to collaborate with.\nBut not only have Coldplay managed to persuade Beyoncé, 34, to lend her impressive vocal talents to their latest track Hymn for the Weekend; she also stars in their gloriously colourful video.\nFilmed in Mumbai, the video sees the R&B icon looking stunning in two pieces from Indian-based design duo Jani Khosla while she provides ethereal vocals to complement Chris Martin's.\nScroll down for video\nDouble whammy: Not only have Coldplay managed to persuade Beyoncé, 34, to lend her impressive vocal talents to their latest track A Hymn for the Weekend; she also stars in their gloriously colourful video\nSecuring Beyoncé's services was no doubt a major coup for the band, who have previously spoken of how much respect they have for the Single Ladies singer.\nThe singer looks sensational as she gazes intently into the lens while sensually dancing in an eye-catching and intricately patterned gold dress.\nAgainst a floral backdrop and wearing a large decorative headpiece, a blonde Beyoncé scintillates as she flashes plenty of cleavage in the plunging gown.\nChris Martin can be seen watching on in a bustling cinema as Beyoncé does her thing, before she changes into a red sari with ornate jewellery decorating her face.\nSee more on Beyoncé as she channels her inner Bollywood beauty for Coldplay's video\nA wall of colour: Filmed in Mumbai, the video sees the R&B icon looking stunning in two pieces from Indian-based design duo Jani Khosla while she provides ethereal vocals to complement Chris Martin's\nBeautiful! The singer looks sensational as she gazes intently into the lens while sensually dancing in an eye-catching and intricately patterned gold dress\nFlawless! The sexy star wore heavy eye make-up and dark berry lips for the shoot\nThe video was directed by Ben Mor and features a cameo from Bollywood superstar Sonam Kapoor.\nSpeaking about Beyoncé, Bassist Guy Berryman told Capital FM: 'It was amazing, she came in, she did her thing, she was unbelievably professional. I think she was in and out in five minutes.\n'And yeah, we’re just so blessed to have her sing on one of our songs. She really transformed it, and made it into something that we’re all incredibly proud of. It’s quite understated which I like. She’s just fab and she’s so sweet and down to earth.'\nIt's well-known that the American beauty is good friends with the Coldplay frontman and his ex-wife Gywneth Paltrow.\nThe big reveal: Against a floral backdrop and wearing a large decorative headpiece, a blonde Beyoncé scintillates as she flashes plenty of cleavage in the plunging gown\nIn awe: Securing Beyoncé's services was no doubt a major coup for the band, who have previously spoken of how much respect they have for the Single Ladies singer\nAnd the partnership between the two parties is set to continue in grand fashion now that it's been confirmed Beyoncé will star during Coldplay's Superbowl halftime performance which will take place at Levi's Stadium in Santa Clara, California on Sunday, February 7.\nThe star famously headlined the halftime show in 2013 and was briefly joined by her former Destiny's Child bandmates Kelly Rowland and Michelle Williams.\nShe dazzled the crowd with a hugely energetic medley of hits and an animated performance.\nScreen star: Chris Martin can be seen watching on in a bustling cinema as Beyoncé does her thing, before she changes into a red sari with ornate jewellery decorating her face\nEmbracing the culture: The singer sported intricate henna tattoos on her hands\nBeyonce is also close friends with Coldplay frontman Chris Martin and his ex-wife Gwyneth Paltrow.\nLast year Katy Perry took the stage for the most-watched halftime show in the history of the Super Bowl, with 118 million viewers tuning in.\nLike all halftime show headliners, the 31-year-old pop star was joined by special guests, in the form of Lenny Kravitz and Missy Elliott.\nCreating magic: The partnership between the two parties is set to continue in grand fashion now that it's been confirmed Beyoncé will star during Coldplay's upcoming Superbowl halftime performance\nPassionate: Chris wore his favoured blazer for the shoot and clearly put his heart into the performance\nOther stars to perform during the Super Bowl in recent years include Madonna, The Black Eyed Peas and The Who.\nColdplay's latest single is taken from their seventh album A Head Full Of Dreams.\nSince its December release, the album has reached Number One on iTunes in more than 90 countries and sold over 3 million copies.\nEarlier this month, it was announced that Coldplay have been nominated for Best British Album and Best British Group at the 2016 BRITs.\nThey have also been confirmed as the recipients of the Godlike Genius award at the 2016 NME Awards.\nStunning! The singer looks sensational as she gazes intently into the lens while sensually dancing in an eye-catching and intricately patterned gold dress","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423029/Beyonc-channels-Bollywood-beauty-Coldplay-s-Mumbai-based-Hymn-Weekend-music-video.html"}
