{"authors":["Alex Kritselis"],"date_download":"2018-10-30 22:26:43","date_modify":"2018-10-30 22:26:43","date_publish":"2014-08-15 17:16:14","description":"After releasing a surprise remix of her song \"Flawless\" with Nicki Minaj earlier in August, rumors are circulating online that Beyoncé is preparing to premiere another high-profile remix, this time of her track \"Blow\" — with Rihanna. You couldn't…","filename":"data/vaneerConsumption/BeyonceRihannaCouldBeCollaboratingTheResultingApocalypseWouldBeHilarious.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/c892502c-c72b-4266-b1ab-dd1fa99bcd9e.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35921-beyonce-rihanna-could-be-collaborating-the-resulting-apocalypse-would-be-hilarious_1540938403.html","title":"Beyonce & Rihanna Could Be Collaborating & The Resulting Apocalypse Would Be Hilarious","title_page":"Beyonce & Rihanna Could Be Collaborating & The Resulting Apocalypse Would Be Hilarious","title_rss":"NULL","source_domain":"bustle.com","text":"After releasing a surprise remix of her song \"Flawless\" with Nicki Minaj earlier in August, rumors are circulating online that Beyoncé is preparing to premiere another high-profile remix, this time of her track \"Blow\" — with Rihanna. You couldn't hear it, but I just made a tire screeching noise. Surely these rumors can't be true, can they?\nLook, despite their friendly photo op at the 2014 Met Gala (a calculated publicity stunt if I ever saw one!), I don't think anybody is under the impression that Beyoncé and Rihanna are besties. Hell, there are still rumors flying around that Bey's bae, Jay Z, cheated on her with Rih! So, the idea of these two pop superstars actually appearing on the same song together, especially a song as explicitly sexual as \"Blow\"? I just don't know if I buy it. But I kind of hope that the rumors end up being true. Not for the music, of course — \"Blow\" sounds just fine as it is — but for the meltdowns. The Internet would explode. Can you even imagine?\nThere are exceptions, but as a rule, Beyoncé fans and Rihanna fans can't stand each other. They are always, and I mean always, in each other's business. There's an old saying that goes: Who stays up all night thinking about Rihanna, lip synching to her old albums and obsessively googling her name as if their life depended on it?\nA Beyoncé fan.\nD Dipasupil/Getty Images Entertainment/Getty Images\n(The reverse could be said of Rihanna fans, so don't get mad!)\nIf an official confirmation of a Beyoncé/Rihanna rihmix were to be released, the sun outside would dim and the wind would begin to blow. The Internet would probably just shut down altogether, but if you did somehow manage to get online, Facebook, Twitter, Instagram, and website comment sections from The Drudge Report to Jezebel, would be absolutely stuffed to the gills with rabid Beyoncé and Rihanna stans, violently mashing their keyboards and ripping each other to shreds with ruthless caps-lock drags you wouldn't even wish on your worst enemy. It would be chaos. It would be hilarious.\nAfter they had tired themselves out, there may come a time for reconciliation: an acceptance of their situation and a decision to move forward as one united front. HA! I really doubt it, but it could happen! Meanwhile, Beyoncé and Rihanna, who may not be best buds but certainly know a controversial, headline-grabbing, lucrative business opportunity when they see one, would be toasting glasses on a tropical island somewhere.\nLarry Busacca/Getty Images Entertainment/Getty Images\nAs far as I can tell, this whole rumor started because of this recent entry on The American Society of Composers, Authors, and Publishers (ASCAP) website:\nNow, you can find legitimate songwriting and production credit information on the ASCAP website, but there are several suspicious things about this posting. First of all, who is Victoria Riddick Nikita? According to Complex, she had no part in creating \"Blow.\" Second of all, Rihanna's name is spelled wrong. Granted, it's spelled wrong in a few other entries on the website, too — but it's still weird. Finally, I have no idea who is allowed to submit entries to the ASCAP database. This whole thing could turn out to be a prank, a joke, or just some sort of misunderstanding.\nBeyoncé's \"Flawless\" remix with Minaj just dropped, so we may have to wait a little while to find out if these Rihanna collaboration rumors are true. Again, I really don't think that they are, but my fingers are still crossed.\nI want to see the meltdowns.\nImages: Getty Images (2); ASCAP","url":"https://www.bustle.com/articles/35921-beyonce-rihanna-could-be-collaborating-the-resulting-apocalypse-would-be-hilarious"}
