{"authors":["Nicole Fabian-Weber"],"date_download":"2018-10-30 23:13:22","date_modify":"2018-10-30 23:13:22","date_publish":"2014-08-13 21:33:45","description":"Another day, another Jay Z and Beyonce divorce story. Only this one is a good one, so don't slam down your laptop in an exasperated, depressed huff yet! Hear me out, friend! According to some reports, Beyonce and Jay Z already have \"lawyers…","filename":"data/vaneerConsumption/BeyonceJayZDivorceRumorsSquashedByOneAmazingLunchYouGuys.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/b0860dc3-b92d-4a49-a40b-e8542ce35f1c.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35684-beyonce-jay-z-divorce-rumors-squashed-by-one-amazing-lunch-you-guys_1540941202.html","title":"Beyonce & Jay Z Divorce Rumors Squashed By One Amazing Lunch, You Guys","title_page":"Beyonce & Jay Z Divorce Rumors Squashed By One Amazing Lunch, You Guys","title_rss":"NULL","source_domain":"bustle.com","text":"Another day, another Jay Z and Beyonce divorce story. Only this one is a good one, so don't slam down your laptop in an exasperated, depressed huff yet! Hear me out, friend! According to some reports, Beyonce and Jay Z already have \"lawyers involved,\" and if they do go through with a divorce, it will happen in Jay's hometown of New York — but, wait! I haven't gotten to the good part yet! I swear, there's a good part! Stay with me!\nHowever. Despite all rumblings of lawyers, and solo apartment-hunting, and what some may deem overcompensating Instagram photos trying depict that everything's a-okay, Beyonce and Jay Z were recently spotted having lunch with Blue Ivy in San Francisco, looking like everything was great. And this is all coming from random eyewitnesses. There were no cameras present, so clearly the couple wasn't putting on an act for the paparazzi. In fact, reports say that the couple was getting along like a \"house on fire,\" whatever the crap that means. Sounds good, though, right?\nUntil they get divorced or address the rumors directly, there's going to be speculation about their relationship. But as of now, this girl's going with the assumption that everything's copacetic in Beyonce and Jay Z-land. People don't get along like a house on fire when there aren't any cameras around for their health.\nImage: Global Grind","url":"https://www.bustle.com/articles/35684-beyonce-jay-z-divorce-rumors-squashed-by-one-amazing-lunch-you-guys"}
