{"authors":["Jewel Wicker"],"date_download":"2018-10-30 18:19:21","date_modify":"2018-10-30 18:19:21","date_publish":"2017-04-25 10:36:23","description":"BY JEWEL WICKER\nBeyonce is celebrating the anniversary of the release o...","filename":"data/vaneerConsumption/BeyoncetoawardFormationscholarshiptoSpelmanstudentamongoth.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/MyAJC/2016/04/28/Images/WPIMAGE_cmgajcmusic_6927.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_music_beyonce-award-fo_9f7bff3c3119acca7f63ce234d205bc7__1540923561.html","title":"Beyonce to award 'Formation' scholarship to Spelman student, among oth","title_page":"Beyonce to award 'Formation' scholarship to Spelman student, among oth","title_rss":"NULL","source_domain":"ajc.com","text":"BY JEWEL WICKER\nBeyonce is celebrating the anniversary of the release of her critically acclaimed album \"Lemonade\" by awarding scholarships to four \"Formation scholars,\" including one at a local college.\nThe singer announced the scholarships today on her website.\nAccording to the website, the scholarships were created to \"encourage and support young women who are unafraid to think outside the box and are bold, creative, conscious and confident.\"\nFour scholarships will be awarded for the 2017-2018 school year, including one at Spelman College.\nEligible students include women who are incoming, current or graduate students who are studying creative arts, music, literature or African-American studies.\nOne student at Berkelee College of Music, Howard University and Parsons School of Design will also be awarded a scholarship.\nWe've reached out to Spelman College for more details regarding the announcement and the application process, and will update when we hear back.\nUPDATE: Spelman College released the following statement regarding the news:\n\"Beyoncé Knowles-Carter's generosity could not have come at a better time. Spelman is brimming with talented admitted students who have distinguished themselves as leaders, high academic performers and change agents,\" Mary Schmidt Campbell, president of Spelman College said via email. \"Nonetheless, they face very real financial barriers to attendance. Her gift opens a door to a transformative Spelman experience for at least one of them. We are so grateful to this visionary artist for helping us build a future for our young people.\"\nApplications for the Spelman \"Formation Scholar\" are due by May 12. The recipient is expected to be announced in June. Read more about the application process here.","url":"https://www.ajc.com/blog/music/beyonce-award-formation-scholarship-spelman-student-among-others/0YJiBulZ0gtMv6bAKYaVnM/"}
