{"authors":["Quinn Keaney"],"date_download":"2018-10-30 22:28:58","date_modify":"2018-10-30 22:28:58","date_publish":"2014-08-15 15:52:04","description":"If the Beyoncé and Jay Z divorce rumors have been getting you down, here's something to lift your spirits: multiple sources have been reporting that a (shady) maternity lawsuit has been filed again Beyoncé and Jay Z in Manhattan by a(n even shadier)…","filename":"data/vaneerConsumption/BeyonceJayZDivorceRumorsAreHeatingUpAsAretheMaternityLawsuits.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/2ba4a08d-2fc2-4dd9-8427-d20d31c66aed.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35914-beyonce-jay-z-divorce-rumors-are-heating-up-as-are-the-maternity-lawsuits_1540938538.html","title":"Beyonce & Jay Z Divorce Rumors Are Heating Up As Are the… Maternity Lawsuits?","title_page":"Beyonce & Jay Z Divorce Rumors Are Heating Up As Are the… Maternity Lawsuits?","title_rss":"NULL","source_domain":"bustle.com","text":"If the Beyoncé and Jay Z divorce rumors have been getting you down, here's something to lift your spirits: multiple sources have been reporting that a (shady) maternity lawsuit has been filed again Beyoncé and Jay Z in Manhattan by a(n even shadier) woman named Tina Seals. If the closest you've come to studying legal jargon is binge watching Ally McBeal, just know that Seals' lawsuit alleges that she is, in fact, the proud mama of Blue Ivy.\n*pause for endless LOLz*\nStarcasm reports that the document apparently states Seals' intentions of trying \"to verify whether she is the biological mother\" of Blue Ivy, and that she was \"previously associated\" with the couple. It doesn't specify if her association with them was an actual connection, or if it was merely a crazed, obsessive fan hellbent on stealing Beyoncé's thunder (as if), but I think it's safe to assume the latter.\nWhile normally this news would basically be one giant laugh, the timing is unfortunately coinciding with the rumor mill running rampant with whispers of impending separation or divorce, and just adds fuel to the dissolving marriage's fire. If you happen to be one of the people who buy into the Beyoncé-pregnancy-conspiracy saga, this will no doubt carry some water, but be warned — Ms. Seals has a long, lengthy history of fabricating stories of celebrity spawn popping up in her womb.\nAfter digging into the matter further, it was additionally revealed that on top of claiming to have birthed Blue, Tina Seals has gone after Mariah Carey and Nick Cannon in regards to their twins, Kim Kardashian and Kanye West's little North, and even Prince William and Kate Middleton. Prince George, Tina? Have you no honor?!\nThe cases were all tossed out, and in the case of Seals' attempt at North's true maternity, Judge Loretta A. Preska ruled that it was \"one of the more than a dozen cases that Plaintiff has filed in this Court in the past month.\"\nSeems like you're safe, Knowles-Carters. Case dismissed.\nImage: Beyonce/Instagram","url":"https://www.bustle.com/articles/35914-beyonce-jay-z-divorce-rumors-are-heating-up-as-are-the-maternity-lawsuits"}
