{"authors":["Nina Bradley"],"date_download":"2018-10-31 01:44:18","date_modify":"2018-10-31 01:44:18","date_publish":"2018-09-06 18:22:49","description":"On the heels of her 37th birthday on Sept. 4, Beyoncé celebrated her birthday by sharing a montage of photos on her personal website and Instagram showing some of her many milestones from the past year. As an opening to the never-seen-before…","filename":"data/vaneerConsumption/BeyonceCelebratedHerBirthdayWithAnIntimateBlogPostAboutHerMonumentalYearPHOTOS.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/6/18ae7ed7-6d54-46cd-a659-374e8402e3db-getty-946416208.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_beyonce-celebrated-her-birthday-with-intimate-blog-post-about-her-monumental-year-photos-11774710_1540950258.html","title":"Beyonce Celebrated Her Birthday With An Intimate Blog Post About Her Monumental Year - PHOTOS","title_page":"Beyonce Celebrated Her Birthday With An Intimate Blog Post About Her Monumental Year — PHOTOS","title_rss":"NULL","source_domain":"bustle.com","text":"On the heels of her 37th birthday on Sept. 4, Beyoncé celebrated her birthday by sharing a montage of photos on her personal website and Instagram showing some of her many milestones from the past year. As an opening to the never-seen-before snapshots, which E! News notes included a moment with her eldest daughter, Blue Ivy Carter, as well as pictures from her birthday celebration, the superstar singer shared a message of gratitude with her fans that highlighted of some of the most \"monumental\" tidbits that occurred during her 36th year on Earth. In the post, which was titled \"Your B*tch at 36,\" Bey explained:\n\"At 36, I became a new mother of three. I breastfed twins. I renewed my vows with my husband of 10 years. I came back home to the stage to do Coachella, after pregnancy. Then my husband and I released our album together, Everything Is Love. And we've been touring with our family around the world, and loving it.\"\nAfter outlining notable peaks in both her personal and professional life, Beyoncé continued:\n\"This year has been monumental for me. I thank God for everyone in my life. Thank you for all the positivity and for the beautiful birthday wishes. I'm looking forward to continuing to learn from my past, living in the present, and surrendering to the future. I love you, Hive. B\"\nThe singer shared similar reflections during her interview in Vogue's September 2018 issue, in which she, amongst other things, discussed pregnancy, body acceptance, ancestry and her experiences while on the current OTR II tour alongside JAY-Z.\nIn the publication, which made history as the first Vogue cover shot by a black photographer, Beyoncé explained:\n\"I'm in a place of gratitude right now. I am accepting of who I am. I will continue to explore every inch of my soul and every part of my artistry. I want to learn more, teach more, and live in full. I've worked long and hard to be able to get to a place where I can choose to surround myself with what fulfills and inspires me.\"\nWhile Bey-day is not yet an official holiday, fans, family, and friends of the icon took to social media in masses to wish her a happy 37th birthday. In honor of the special day, Beyoncé's mother, Tina Knowles Lawson, posted a photo on Instagram which featured a throwback of Bey at four months old. In the heartfelt caption, Lawson shared that she was posting early because Bey's current time zone, writing:\n\"It’s already your birthday where you are. So Happy Birthday to the nicest, owner of the most beautiful, generous, loving hearts ever!!!! Brilliant too! Always thinking, planning, analyzing, strategizing, how you can make everything you touch better!\"\nAs the post went on, Lawson became more sentimental, expressing the love and pride she has for her first born child. She continued,\n\"On this day you were 4 months old and i couldn’t even control the excitement and pride and the all encompassing love i felt for you, my first born. I made a vow to love and cherish you everyday. For the rest of my life! Sometimes i can’t believe out of all the incredible people in the world i was chosen by God to be your mom!\"\nShe closed by sharing how grateful she is to have both Beyoncé and her sister, Solange as her children, adding:\n\"The day that you and your sister entered this world were the two best days of my life, hands down !! It is a privilege to have carried you two in this body. Enjoy your B-Day !!! No one deserves it more !! I love you Mom.\"\nIt goes without saying that Bey-day is always a monumental occasion. And with the release of these new photos, Beyoncé continues to prove that she just keeps getting better year by year.","url":"https://www.bustle.com/p/beyonce-celebrated-her-birthday-with-intimate-blog-post-about-her-monumental-year-photos-11774710"}
