{"authors":[],"date_download":"2018-10-23 04:48:18","date_modify":"2018-10-23 04:48:18","date_publish":"2016-01-28 21:00:25","description":"Jeff Bezos, the multibillionaire Amazon founder who bought The Washington Post in 2013, said Thursday the newspaper must look to the future with new technolo...","filename":"data/vaneerConsumption/BezossaysWashingtonPosttoleanintofuture.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h57x-4PuZeKVXE7cd9005b2c876130de8-565_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421676_Bezos-says-Washington-Post-lean-future_1540270098.html","title":"Bezos says Washington Post to 'lean into future'","title_page":"Bezos says Washington Post to 'lean into future' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bezos says Washington Post to 'lean into future'\nJeff Bezos, the multibillionaire Amazon founder who bought The Washington Post in 2013, said Thursday the newspaper must look to the future with new technology without losing its \"soul\" or journalistic traditions.\nBezos, speaking at the dedication of the new Post headquarters in the US capital in what was his first major public appearance as owner, said the future of the respected daily will depend on a strong technology team as well as its dedication to journalism.\nOne of the world's richest individuals with a fortune estimated at more than $50 billion, Bezos is under scrutiny in the media world as he seeks to guide the newspaper through a transition to digital.\nWashington Post owner Jeff Bezos speaks during the inauguration of the Washington Post Headquarters on January 28, 2016 in Washington, DC ©Mandel Ngan (AFP)\n\"I am a huge fan of leaning into the future,\" said Bezos, who snapped up the struggling newspaper in 2013 for $250 million in personal funds and has been investing in both the newsroom and in technology.\n\"It's a little risky to let nostalgia transition into glamorizing the past,\" he warned.\nAt the same time, Bezos said the Post should not lose sight of its great tradition and its historic role in American journalism.\nHe has previously stated he wanted to make the Post \"the new paper of record,\" in a direct challenge to The New York Times.\n\"It's important to recognize that you don't want everything to change,\" he said at a ceremony which included US Secretary of State John Kerry and recently freed Tehran correspondent Jason Rezaian.\n\"Important institutions like the Post have an essence, they have a heart, they have a core, what (executive editor) Marty (Baron) called soul. If you wanted that to change you would be crazy.\n\"That's part of what makes it so special.\"\nBezos, who created the online giant Amazon and later the space exploration firm Blue Origin, said the newspaper now has a vastly revamped technology team.\nUnder Bezos, the Post has ramped up its technology to allow its website to perform better, with improved analytics which gauge how readers are responding and deliver relevant advertising.\nIt has also made its articles more widely available through social network news services operated by Facebook and Google, and boosted its own social media efforts.\nPost publisher Frederick Ryan said the Post was now \"a media and technology company\" and that Bezos \"has given us runway to experiment with new ways to engage with readers and the resources to expand our newsroom and our engineering team.\"","url":"https://www.dailymail.co.uk/wires/afp/article-3421676/Bezos-says-Washington-Post-lean-future.html"}
