{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 20:00:40","date_modify":"2018-10-30 20:00:40","date_publish":"2015-09-27 13:42:32","description":"Celebrities warned of the dangers of climate change as tens of thousands gathered for the fourth annual Global Citizen Festival.","filename":"data/vaneerConsumption/BidenFLOTUSBeyoncandMoreBattleClimateChangePovertyatGlobalCitizenFestival.json","image_url":"https://media.breitbart.com/media/2015/09/global-citizen-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_09_27__1540929640.html","title":"Biden, FLOTUS, Beyoncé, and More Battle Climate Change, Poverty at Global Citizen Festival","title_page":"Biden, FLOTUS, Beyoncé, and More Battle Climate Change, Poverty at Global Citizen Festival | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Beyoncé and Coldplay rocked out, First Lady Michelle Obama launched a new girls’ education initiative, and Leonardo DiCaprio warned of the dangers of climate change as tens of thousands gathered for the fourth annual Global Citizen Festival in New York’s Central Park on Saturday.\nThe festival, held each year around the annual meeting of world leaders in the UN General Assembly, aims to raise awareness of and combat global poverty, climate change, and inequality.\nAn estimated 60,000 attendees gathered on the Great Lawn to hear musical performances from the likes of Pearl Jam, Ed Sheeran, and Common while Vice President Joe Biden, Facebook’s Mark Zuckerberg, and Late Show host Stephen Colbert addressed the audience between sets.\n“We have to move beyond, reach beyond ourselves. We have to be a light to the world, not just in the world,” Biden spoke from the stage, according to the Daily Mail. “I look out and I see lots of global citizens, optimistic, determined, absolutely determined, rejecting the false premise that our challenges are mere fate, with no solutions, and that protecting universal rights is equally universal, because it is.”\nCelebrities and entertainers were out in full force for the daylong event: Bono, Hugh Jackman, Jay-Z, Kerry Washington, Salma Hayek, Katie Holmes, Daniel Craig, and Usher were all in attendance, as were Bill and Melinda Gates and UN Secretary-General Ban Ki-Moon, reports CBS.\nAfter her hour-long headlining performance, Beyoncé introduced First Lady Michelle Obama, who used the event to launch the new 62MillionGirls education initiative. Obama urged attendees to use the hashtag #62MillionGirls on social media to raise awareness of the new campaign.\n#62MillionGirls do not have access to education. Share a photo & what you learned in school: http://t.co/A4AkZqxAuL https://t.co/LuDF85C8FC — The First Lady (@FLOTUS) September 27, 2015\n“Right now, 62 million girls are not in school… they deserve the same chances to get an education as my daughters and your daughters,” Obama told the audience.\nTeenage Pakistani activist and Nobel Prize winner Malala Yousafzai also addressed the festival, using her remarks to highlight the link between education and global poverty.\n“I want education to be the top priority because how can we end poverty… when we deny the right to education?” Yousafzai said, according to CBS. “It’s not that there is lack of money in this world… we have billions and trillions of dollars, but where the money goes is military, it’s things that are useless and that are not useful to society.”\nThe event featured a number of unique musical collaborations; Beyoncé joined Pearl Jam’s Eddie Vedder for a cover of Bob Marley’s “Redemption Song,” Ed Sheeran sang with Beyoncé on the pop star’s “Drunk in Love” and Ariana Grande joined Coldplay’s Chris Martin in a duet.\n“We could just appear as Coldplay, the English band, or we could take a moment in our set where we cross generations with someone much more talented and much more good looking and by association make us look better,” Martin joked to the crowd. “With that in mind, I talked to my kids and asked who would be the most awesomest person to come sing with us and with deliberation, the amazing young singer Ariana Grande came.”\nDuring his speech, actor and environmentalist Leonardo DiCaprio, who pledged last week to divest from fossil fuel holdings and increase investments in renewable energy ahead of the UN’s climate change conference in Paris later this year, linked the fight against climate change with the fight to end worldwide poverty.\n“The cause of our environment and the fight for the world’s poor are inherently linked. The planet can no longer wait,” the Wolf of Wall Street star said, according to the Daily Mail. “The underprivileged can no longer be ignored. This is truly our moment for action.”\nPearl Jam closed out the day’s performances with a set full of fan favorites, and frontman Eddie Vedder delivered an acoustic version of John Lennon’s “Imagine.”\n“Never before have we played for an audience full of activists and it’s an incredible feeling and we just want to thank you,” Vedder said.\nThe event was live-streamed online and can be viewed in its entirety here.","url":"https://www.breitbart.com/entertainment/2015/09/27/biden-flotus-beyonce-battle-climate-change-poverty-global-citizen-festival/"}
