{"authors":["Brakkton Booker"],"date_download":"2018-10-22 21:27:03","date_modify":"2018-10-22 21:27:03","date_publish":"2016-12-05 00:00:00","description":"Vice President Joe Biden turned 74 last month and would be 78 after the 2020 election. Biden decided against a presidential run this past cycle, after losing his son Beau to cancer in 2015.","filename":"data/vaneerConsumption/BidenHintsHesLeavingTheDoorOpenToA2020Run.json","image_url":"https://media.npr.org/assets/img/2016/12/05/biden-pic_wide-e7b61ccb36bbba8e00192c56c3696f496d11d90a.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_12_05_504500990_biden-hints-hes-leaving-the-door-open-to-a-2020-run_1540243623.html","title":"Biden Hints He's Leaving The Door Open To A 2020 Run","title_page":"Vice President Joe Biden Hints He's Leaving The Door Open To A 2020 Presidential Run : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Biden Hints He's Leaving The Door Open To A 2020 Run\nEnlarge this image toggle caption John Minchillo/AP John Minchillo/AP\nVice President Joe Biden teased Monday that he is leaving the door open to another presidential run in 2020.\n\"I'm going to run in 2020,\" Biden told a group of reporters on Capitol Hill.\n\"For what?\" one of the reporters asked.\n\"For president,\" Biden responded, adding later, \"What the hell, man.\"\nThe Associated Press described the vice president with \"only a slight smile on his face\" as he was leaving the small group of reporters in hallways of the U.S. Capitol.\nBiden was asked again by a reporter if he was serious about running. Biden, after all, does have a history of saying things off the cuff.\n\"I'm not committing not to run,\" Biden responded. \"I'm not committing to anything. I learned a long time ago, fate has a strange way of intervening.\"\nA Biden run is still highly unlikely. He just turned 74 last month and would be 78 in the weeks following the 2020 election. Arizona Sen. John McCain was re-elected this year at 80, but running for the Senate as an incumbent is quite a different thing from running a national presidential campaign.\nThe vice president decided against a presidential run this cycle after a long decision-making process following the death of his son, Beau. Speaking from the Rose Garden in October 2015, Biden, flanked by his wife, Jill, and President Obama, said his \"window\" for a White House bid \"has closed.\"\nBiden's son Beau died earlier that year from brain cancer. As NPR Politics reported, Biden said during that news conference:\n\"As my family and I have worked through the grieving process, I've said all along what I've said time and again to others, that it may very well be that the process by the time we get through it closes the window,\" Biden said. \"I've concluded it has closed.\"\nWhile he himself did not run in 2016, he was a willing campaigner for Democratic nominee Hillary Clinton.\nBiden did not hold back any punches warning against a Trump presidency. He at one point said during a campaign stop in Pennsylvania:\n\"I wish we were in high school so I could take him behind the gym.\"\nBiden was on Capitol Hill to make a rare Senate appearance, where he presided over a vote that ended debate on legislation known as the Cures Act. The bill, which passed easily in the House last week, ensures funding for biomedical research. The Senate named the cancer provisions of the bill after Biden's son.\nBiden is scheduled to meet with House Democrats at a closed-door meeting Tuesday morning.","url":"https://www.npr.org/2016/12/05/504500990/biden-hints-hes-leaving-the-door-open-to-a-2020-run"}
