{"authors":[],"date_download":"2018-10-22 22:58:54","date_modify":"2018-10-22 22:58:54","date_publish":"2014-05-13 13:32:50","description":"The Big Three automakers who helped build Detroit are giving back to the now bankrupt city, considering donating as much as $50 million to save art.","filename":"data/vaneerConsumption/Big3DetroitAutomakersMullDonationstoSupportArtInstitute.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_20/438796/140513-140513-gm-0957_6959b984626e7dec77ecc6407c68719b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_autos_big-3-detroit-automakers-mull-donations-support-art-institute-n104061_1540249134.html","title":"Big 3 Detroit Automakers Mull Donations to Support Art Institute","title_page":"Big 3 Detroit Automakers Mull Donations to Support Art Institute","title_rss":"NULL","source_domain":"nbcnews.com","text":"The car companies whose histories are inextricably linked to the Motor City, are at least open to the possibility of a cash donation.\n“Chrysler Group is committed to playing a positive role in Detroit's revitalization,” the company said in a statement. “Accordingly, we are reviewing the DIA's request.”\nGM is also mulling a possible contribution. “The DIA must be central to any plans for a revitalized Detroit,” according to a statement from the automaker. “Both GM and the GM Foundation are giving very careful consideration to how we can help preserve this treasure at such a critical time.”\nFord also confirmed it is contemplating a donation. “Ford has been a long-time supporter of the DIA and its contributions to southeast Michigan. We are having confidential discussions with the DIA and are considering the matter very carefully,” the company said in a statement.\nThe makers were approached about the idea of a donation to help the DIA, though none of them has committed to a specific dollar figure.\nDetroit, with $18 billion in debts, filed for bankruptcy protection last year -- the largest municipal bankruptcy in U.S. history.\n5 Years After Bankruptcy, Chrysler Aiming at Explosive Global Growth with Italian Partner Fiat\nMercedes-Benz Launches B-Class Electric, 1st US Battery Car\nElio Moving Ahead on 84 mpg, 3-Wheeled Car Coming in at $6,800","url":"https://www.nbcnews.com/business/autos/big-3-detroit-automakers-mull-donations-support-art-institute-n104061"}
