{"authors":["Aly Semigran"],"date_download":"2018-10-30 23:09:44","date_modify":"2018-10-30 23:09:44","date_publish":"2014-08-14 01:49:03","description":"Who would wanna vote out sweet little Nicole on Big Brother ? That's what her fellow kind companion-on-the-block Donny pondered during the end of Wednesday night's episode, which proved to be an emotionally draining one for Nicole. As it turns out,…","filename":"data/vaneerConsumption/BigBrothersNicoleWasBetrayedOnceAgainThisTimebyChristine.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/6784a0a1-4ff7-45ee-a9c9-de27ad49498a.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35712-big-brothers-nicole-was-betrayed-once-again-this-time-by-christine_1540940984.html","title":"'Big Brother's Nicole Was Betrayed Once Again, This Time by Christine","title_page":"'Big Brother's Nicole Was Betrayed Once Again, This Time by Christine","title_rss":"NULL","source_domain":"bustle.com","text":"Who would wanna vote out sweet little Nicole on Big Brother ? That's what her fellow kind companion-on-the-block Donny pondered during the end of Wednesday night's episode, which proved to be an emotionally draining one for Nicole. As it turns out, a few people might want to vote Nicole out of the house, including her former best friend Christine.\nIt was bad enough when the house flipped on Nicole last week, after the rest of the alliances did the math that if she got rid of Zach, their numbers would start to dwindle. In turn, Nicole's attempt to make a bold move in the house and get out power players was met with her housemates retaliation of voting out her \"boyfriend\" Hayden. It has not been the best week for Nicole, and it only got worse.\nOnce Zach won the Power of Veto, Christine had to put up a replacement nominee against Donny. Rather than stay true to her loyal friend, she allowed the Detonators to get in her ear. Caleb \"bent the truth\" that Nicole's back-up backdoor plan was to get Christine out and that Nicole had lied to all of them. Christine bought it hook, line, and sinker and came to the conclusion that she \"had to choose a side.\" Never mind that that side has no intention of taking her to the end. Heck, even Christine herself acknowledged if she goes next week, the Detonators weren't the right guys to trust. In the words of Zach: well, of course, you fruit loop dingus!\nBut Christine caved to the pressure from the Detonators to backdoor Nicole, and that's exactly what she did. No one — with the exception of the house's only other genuinely sweet person Donny — was more upset or blindsided by the latest betrayal than Nicole. During a tear-soaked diary room session Nicole said of her former Big Brother BFF, \"Oh gosh, I don't like her at all.\" She ended the episode with the understatement of the season: \"I don't even want to be around these people, to be honest.\"\nWith a week's worth of backstabbing from the likes of Zach, Caleb, and now Christine, can you really blame her? Nobody wants to see Nicole (or Donny) go, but it's almost getting too hard to watch at this point.\nImage: CBS","url":"https://www.bustle.com/articles/35712-big-brothers-nicole-was-betrayed-once-again-this-time-by-christine"}
