{"authors":["Allison Piwowarski"],"date_download":"2018-10-30 23:21:42","date_modify":"2018-10-30 23:21:42","date_publish":"2014-08-13 19:34:05","description":"There is no doubt that Derrick Levasseur is running the Big Brother house. Last Thursday's double eviction episode showed Derrick convincing the entire house to evict Zach, and then getting the entire house to save Zach. He has gone relatively…","filename":"data/vaneerConsumption/BigBrotherStarDerrickLevasseursWifeJanaIsTheMostSupportiveEverWeCanProveIt.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/d98f6ba5-240d-4c39-b288-0436da3f70df.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35451-big-brother-star-derrick-levasseurs-wife-jana-is-the-most-supportive-ever-we-can-prove_1540941702.html","title":"'Big Brother' Star Derrick Levasseur's Wife Jana Is The Most Supportive Ever & We Can Prove It","title_page":"'Big Brother' Star Derrick Levasseur's Wife Jana Is The Most Supportive Ever & We Can Prove It","title_rss":"NULL","source_domain":"bustle.com","text":"There is no doubt that Derrick Levasseur is running the Big Brother house. Last Thursday's double eviction episode showed Derrick convincing the entire house to evict Zach, and then getting the entire house to save Zach. He has gone relatively unnoticed in the game so far, although he has had a hand in most decisions that the house has made. Basically, Derrick is playing damn good game of Big Brother .\nInside the house, Derrick acts as the undercover cop, puppet master, and one part of \"The Hitmen\" alliance (one of the strongest in the house), but outside of the house, Derrick is a father, husband, and Police Office — Sergeant. If you watch the live feeds, you know that Derrick's main reason for being inside the Big Brother house is to win money to better his young daughter's life (although he doesn't bring it up as much as Devin did, thankfully). So who is the other half of this \"Dad-Bot\"? That would be Derrick's wife, Jana. Jana, who might just be the most supportive wife to ever have a husband play on reality television, has taken the time that Derrick has been in the Big Brother house to grow an extremely impressive fan-base for Derrick online. Check out the five times Jana was the most supportive wife ever:\nShe promotes \"Hitmen\" cupcakes with Derrick and Cody's faces on them\nI just have to get this out there: wow, those cupcakes look amazing. How can you not adore the fact that Jana is getting everyone in town (and Twitter) to love her hubby through these sweet treats?\nShe asks fans to vote for certain Team America missions\nWe saw Donny turn down a Team America mission because it was too risky for his overall game. Jana also knows that if Team America tries to perform certain missions it can blow up their game, so she calls upon Derrick fans to vote for the mission that is safer for his game.\nShe makes and sells Team Derrick t-shirts\nWhat better way to show your allegiance to Derrick's Big Brother game than wearing a t-shirt that promotes it? Jana makes and sells (and ships) these #TeamDerrick t-shirts around the country for fans all over to represent Derrick's awesome game play this far. If you're interested in purchasing a shirt, check out Jana's Twitter for details on ordering.\nShe throws back old photos of Derrick while he's inside the house\nIt wouldn't be easy to be separated from your loved ones while in the Big Brother house, but Jana makes the best out of the situation by sharing old photos of Derrick with fans. In the one above, it seems like Derrick has a little Beast Mode Cowboy in him...\nShe cannot wait to see him (Aww)\nWhile Jana is making the most of Derrick's time in the Big Brother house by selling t-shirts and promoting Derrick cupcakes, ultimately she cannot wait until they are reunited, making her officially the most supportive Big Brother wife ever.\nImages: Cliff Lipson/CBS","url":"https://www.bustle.com/articles/35451-big-brother-star-derrick-levasseurs-wife-jana-is-the-most-supportive-ever-we-can-prove"}
