{"authors":["Laura Rosenfeld"],"date_download":"2018-10-30 22:33:50","date_modify":"2018-10-30 22:33:50","date_publish":"2014-08-15 02:26:00","description":"It has been so dramatic, stressful, and emotional this week on Big Brother, I don't know about you, but I was sure in need of some levity. Thankfully, CBS knew that I needed that, too, and booked Rachel Reilly to briefly return to the Big Brother…","filename":"data/vaneerConsumption/BigBrotherWinnerRachelReillyLovesZankieToo.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/a83295d8-111c-4bc1-862e-176323f7e6f0.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35881-big-brother-winner-rachel-reilly-loves-zankie-too_1540938830.html","title":"'Big Brother' Winner Rachel Reilly Loves Zankie Too","title_page":"'Big Brother' Winner Rachel Reilly Loves Zankie Too","title_rss":"NULL","source_domain":"bustle.com","text":"It has been so dramatic, stressful, and emotional this week on Big Brother, I don't know about you, but I was sure in need of some levity. Thankfully, CBS knew that I needed that, too, and booked Rachel Reilly to briefly return to the Big Brother studio for a one-on-one with host Julie Chen. I have to tell you, I, like some Big Brother fans, find Rachel excruciatingly painful to listen to, so I tried to tune out her nails-on-a-chalkboard voice as best I could. But when Rachel started talking about how much she loves \"Zankie,\" my ears perked up.\n\"Don't we all love Zankie?\" Rachel asked the studio audience. \"I don't know what's going on with them, but I hope that they're friends forever, because they're adorable.\" Neither do we, although we pray to Otev every night hoping that one day the platonic couple takes things to a more romantic level. Alas, with their falling out this week, I don't think that's going to happen. Anyway, knowing that Rachel is on board with this lovable \"showmance,\" just as Julie and pretty much all of America is as well, makes her not so bad in my eyes.\nAnd Rachel knows a thing or two about \"showmances.\" Let's not forget about her man Brendon, who she met on Season 12 of Big Brother. I'm sure you didn't forget that though. None of us can ever erase that from our memories. The two went on to tie the knot in 2012 and compete on two seasons of The Amazing Race, as other Big Brother power couples have done.\nRachel, who won Season 13 of Big Brother, said Derrick is the houseguest she thinks is playing the best game and will win, if Caleb doesn't get him out first. Interesting. I never really considered Caleb that big of a threat to make it to the end of Big Brother, but I've got to give Rachel's expertise some credence here. Rachel also said she hopes that Nicole gets the chance to return to the house, which we soon found out could be a real possibility as Julie revealed that one of the last four evicted houseguests to be evicted from the house could return to the game. If Julie's hints for the past two weeks weren't big enough for you, there you go.\nIf Nicole does return to the house, she's going to have a lot of damage control to do. But Rachel said she has the opportunity to repair her friendship with Christine and possibly work with Donny, so that's something. At least Julie didn't say Rachel would be the former houseguest returning to the game.","url":"https://www.bustle.com/articles/35881-big-brother-winner-rachel-reilly-loves-zankie-too"}
