{"authors":["Aimée Grant Cumberbatch"],"date_download":"2018-10-31 01:46:32","date_modify":"2018-10-31 01:46:32","date_publish":"2018-09-14 11:07:40","description":"It's been a mainstay of British television since the early Noughties but has suffered from dwindling ratings in recent years, and after 19 series Channel 5 has finally decided to call it a day. On Friday, the broadcaster confirmed that Big Brother…","filename":"data/vaneerConsumption/BigBrotherAndCelebrityBigBrotherHaveBeenAxedByChannel5AndItReallyIsTheEndOfEra.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/2efbb2d1-71e6-4d83-9a91-091f309b0e45-getty-1030916012.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_big-brother-celebrity-big-brother-have-been-axed-by-channel-5-it-really-is-the-end-of-era-11916880_1540950392.html","title":"'Big Brother' And 'Celebrity Big Brother' Have Been Axed By Channel 5 And It Really Is The End Of Era","title_page":"'Big Brother' And 'Celebrity Big Brother' Have Been Axed By Channel 5 And It Really Is The End Of Era","title_rss":"NULL","source_domain":"bustle.com","text":"It's been a mainstay of British television since the early Noughties but has suffered from dwindling ratings in recent years, and after 19 series Channel 5 has finally decided to call it a day. On Friday, the broadcaster confirmed that Big Brother and Celebrity Brother are getting the axe. A statement from C5 read: \"The forthcoming series of Big Brother will be the last – of either celebrity or civilian versions – on Channel 5.\"\nIt continued: \"We'd like to thank Endemol and all of the production team who have worked tirelessly to make the show a success. We'd also like to thank our brilliant presenters – Emma on Big Brother and Rylan from Bit on the Side – for their consummate professionalism, Marcus [Bentley], the voice of Big Brotherand all of the housemates who have created so many memorable moments. Most importantly, we'd like to thank fans of the show for their support over the last seven years. We look forward to giving the final series a brilliant send-off.\"\nChannel 5 has been Big Brother's home since 2011, after it was dropped by Channel 4. It's not yet clear whether the Big Brother format will be picked up by another broadcaster. However, a second channel change seems unlikely and a tweet from Bit On The Side presenter Rylan Clark-Neal seems to suggest that the show \"won't be returning\" full stop. He thanked the series' guests, production company, and broadcaster for the opportunity to work on his \"favourite show\", writing: \"After 6 years working on one of the most iconic shows on television I'm saddened to hear the news Big Brother won't be returning. It has been the biggest privilege being a housemate, a winner and a host on my favourite show on the television.\"\nClark-Neal continued: \"To work with Emma, Marcus and the amazing team on BOTS every day and have made friends for life I'm truly the luckiest guy in the industry. I hope one day Big Brother will return but my focus now, as with the rest of the team is to make our last series the best yet. I'd like to thank all of our guests, Endemol and Channel 5 for having me and most of all the viewers for sharing this amazing journey.\"I learned how to host a show on the job here and I'll be forever grateful for the opportunity. R x\"\nMain show host Emma Willis is yet to share her take on the news, but Bustle has reached out to representatives of the presenter for comment. Big Brother's final civilian series will kick off on Sept. 14, while the last celebrity series finished earlier this month with ex Coronation Street star Ryan Thomas crowned the winner.\nJeff Spicer/Getty Images Entertainment/Getty Images\nI don't know about you but this really feels like end of a reality TV era. While BB has really struggled to keep up with new rivals like Love Island, the show has given viewers some seriously iconic moments over the years. Who could forget George Galloway pretending to be a cat, Nikki Grahame's \"who is she?!\" meltdown, Gemma Collins' strong opinions on hair styling tools, and the \"David's dead\" incident. There's been some serious TV gold among all that screaming, shouting, and smoking. So while it was probably time for Big Brother to go, it doesn't mean it won't be missed.","url":"https://www.bustle.com/p/big-brother-celebrity-big-brother-have-been-axed-by-channel-5-it-really-is-the-end-of-era-11916880"}
