{"authors":["Laura Rosenfeld"],"date_download":"2018-10-30 22:33:50","date_modify":"2018-10-30 22:33:50","date_publish":"2014-08-15 02:04:44","description":"Sometimes you start at the top and end up on the bottom. That's exactly what happened to Nicole this week on Big Brother . Nicole kicked off the week as one of the Heads of Household, but after her nominees Frankie and Caleb won the Battle of the…","filename":"data/vaneerConsumption/BigBrothersNicoleisEvictedShellMissDonnytheMostButWhatAboutHayden.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/d709b697-a1a9-4095-a146-262dd2c0bdb2.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35879-big-brothers-nicole-is-evicted-shell-miss-donny-the-most-but-what-about-hayden_1540938830.html","title":"'Big Brother's Nicole is Evicted & She'll Miss Donny the Most But What About Hayden?","title_page":"'Big Brother's Nicole is Evicted & She'll Miss Donny the Most But What About Hayden?","title_rss":"NULL","source_domain":"bustle.com","text":"Sometimes you start at the top and end up on the bottom. That's exactly what happened to Nicole this week on Big Brother . Nicole kicked off the week as one of the Heads of Household, but after her nominees Frankie and Caleb won the Battle of the Block and Zach won the Power of Veto to take himself on the block, Nicole's former bestie Christine backdoored her. It was a painful eviction, but really, I'm just so thankful Donny didn't go home.\nSpeaking of Donny, Nicole had some nice things to say about him when she sat down with Big Brother host Julie Chen when she walked out of the house. When Julie asked who out of the remaining hosueguests would Nicole even speak to again, if anyone, Nicole sweetly named Donny, citing how much of a good guy he was. All together now: Awww. And that was exactly how the studio audience responded in a collective sigh expressing how cute Nicole was in her fondness for Donny. I did the exact same thing from my couch at home, speaking to the TV, who also said \"Awww\" back. Okay, that didn't actually happen, but if TVs could talk, it totally would have. One more time, everybody: Awww.\nNicole of course couldn't name Hayden, one because she's going to see him in the Jury House in a matter of minutes, and two because her answer had to come from the houseguests remaining in the house. But don't worry. Julie of course had to ask Nicole about her \"showmance\" with Hayden. In response to a question about if she would pursue any type of relationship with him outside of the house, Nicole hesitated to answer. She said it would depend on what Hayden thinks and blah blah blah, not a real answer. But at least we can rest easy knowing that \"Haycole\" will still be \"offish\" in some form. \"I definitely think we'll stay best friends,\" Nicole said.\nJulie hinted yet again that an evicted houseguest may re-enter the house, and she asked Nicole what she would do differently if she were to return to the Big Brother house. Nicole said that she would change her strategy and probably not trust people so easily next time. I would say that would be a very smart thing to do, but I don't know if Nicole has it in her to actually follow through with her own advice.\nImage: Sonja Flemming/CBS","url":"https://www.bustle.com/articles/35879-big-brothers-nicole-is-evicted-shell-miss-donny-the-most-but-what-about-hayden"}
