{"authors":["Allison Piwowarski"],"date_download":"2018-10-30 22:56:56","date_modify":"2018-10-30 22:56:56","date_publish":"2014-08-14 15:44:34","description":"I get that the point of Big Brother is to do anything it takes — in the realm of legality — to get the the end of the game. This season of Big B rother , Christine has not taken those words lightly, but instead has proven she will do whatever it…","filename":"data/vaneerConsumption/BigBrothersChristineBetrayedNicoleSoManyTimesWeHadtoMakeaGuide.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/9e88fb9a-0803-4bf9-a100-951333141992.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35770-big-brothers-christine-betrayed-nicole-so-many-times-we-had-to-make-a-guide_1540940216.html","title":"'Big Brother's Christine Betrayed Nicole So Many Times We Had to Make a Guide","title_page":"'Big Brother's Christine Betrayed Nicole So Many Times We Had to Make a Guide","title_rss":"NULL","source_domain":"bustle.com","text":"I get that the point of Big Brother is to do anything it takes — in the realm of legality — to get the the end of the game. This season of Big B rother , Christine has not taken those words lightly, but instead has proven she will do whatever it takes to further her game by betraying her Big Brother BFF Nicole time and time again. Sure, Nicole may be the Big Brother \"Fruit Loop Dingus,\" but she certainly didn't deserve the betrayal Christine handed her on a silver platter.\nTheir friendship started out beautifully; they bonded over wearing glasses and not being crazy (unlike the other houseguests) and suddenly the Nicotine alliance was formed. Eventually, they brought in Nicole's love interest, Hayden, which makes the endings of this friendship even more upsetting to deal with. At first, Christine was straight up honest with Nicole about the other alliances she was thrown into. She told Nicole about The Bomb Squad and how she just happened to be in the right place (or wrong place) at the right time for Devin to invite her in. With this type of honest and open relationship between the two of them, I thought they had the chance to possibly make it really far in the game. Unfortunately, all good things must come to an end.\nWhen exactly Christine decided to officially turn on Nicole is hard to pin point. Around the time The Detonators, the offspring of the failed Bomb Squad, formed, is when I would guess Christine decided her allegiance was to the guys and not to Nicole anymore. During Week 6, the double eviction week, Christine wanted to evict Zach, while Nicole's target was Frankie all along. When Derrick and The Detonators decided it was Zach who needed to stay this week because Nicole and Hayden were playing them all, Christine went along with the plan to shock Nicole and Hayden during the live eviction and save Zach, and evict Jocasta.\nThat's when things started heating up. Outgoing Head of Household Nicole found it shocking that Zach was staying, because as far as she was concerned, the entire house planned to evict him. Christine, who used to share everything with Nicole, kept this huge secret from her, and that seems to be when the proverbial line in the sand was drawn. Then, as if that wasn't enough of a stab in the back, Christine and her alliance evicted Hayden during the double eviction, leaving Nicole completely alone in the house.\nHayden's eviction happened so fast, Nicole has even said she doesn't remember any of it. But what she does remember is that Christine betrayed her. After confronting her, asking if this was Christine's plan all along (to evict Hayden), it seemed like the two parts of Nicotine were \"offish\" done. How could they get past Christine having a huge hand in the eviction of Nicole's \"boyfriend\"? Especially when Christine clearly felt no regret about it. (Note: Hear MUAHAHAHA when you look at the below Tweet.)\nThen, Nicole and Christine become the HoHs. Maybe, just maybe, they could work through their issues and work together to assure each other's safety. NOPE. After Nicole was dethroned and The Detonators convinced Christine that Nicole was coming after her, Christine went back on their promise to not backdoor each other and replaced Veto-ed nominee Zach with Nicole. Essentially, Christine nominated the only person in the house who was her true friend. It's a tough pill to swallow, I know.\nSo, with Nicole and Donny nominated, it seems like Christine and The Detonators plan to evict Nicole Thursday, officially putting the final nail in the coffin of the Nicole/ Christine friendship, if that hasn't happened already.\nTo Christine and Nicole!\nImages: CBS; Giphy","url":"https://www.bustle.com/articles/35770-big-brothers-christine-betrayed-nicole-so-many-times-we-had-to-make-a-guide"}
