{"authors":["Laura Rosenfeld"],"date_download":"2018-10-30 22:33:51","date_modify":"2018-10-30 22:33:51","date_publish":"2014-08-15 01:44:37","description":"It's been quite a week in the Big Brother house, hasn't it? I mean, I still haven't recovered from all of the betrayals, changing alliances, and tears among the houseguests. Not to mention, that Frankie finally revealed his \"Grande\" secret that he…","filename":"data/vaneerConsumption/BigBrotherVictoriaWasntSurprisedtoLearnFrankieisArianaGrandesBrotherAfterAll.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/98c0f26d-b628-4ec8-9979-9d3a7af471e3.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35878-big-brother-victoria-wasnt-surprised-to-learn-frankie-is-ariana-grandes-brother-after-all_1540938831.html","title":"'Big Brother' Victoria Wasn't Surprised to Learn Frankie is Ariana Grande's Brother After All","title_page":"'Big Brother' Victoria Wasn't Surprised to Learn Frankie is Ariana Grande's Brother After All","title_rss":"NULL","source_domain":"bustle.com","text":"It's been quite a week in the Big Brother house, hasn't it? I mean, I still haven't recovered from all of the betrayals, changing alliances, and tears among the houseguests. Not to mention, that Frankie finally revealed his \"Grande\" secret that he is a famous YouTube personality and the brother of pop sensation Ariana Grande. When Frankie first revealed this bombshell, it seemed like no one was more surprised than Victoria. Or was she?\nDuring Thursday night's eviction episode, Big Brother host Julie Chen asked Victoria what the most shocking moment of the week was for her. Basically everyone realized that Julie was referring to Victoria learning about Frankie's relation to Ariana. It was kind of hard to ignore her reaction. Victoria's mouth dropped open and stayed that way for what seemed like forever. And then suddenly, she let out an ear-piercing scream. Her lips had a nice sparkly red lipstick on though. She really turned it out for that news.\nHowever, Victoria did not name Frankie's revelation as the most surprising moment of the week. She didn't even name a single event that went down this week. Victoria simply spoke about how what surprised her most was all of the emotion in the house and how stressful everything was for her. Mmmkay. Well that was a truly unexpected answer to a completely canned question.\nWhen Victoria was speaking, her fellow houseguests just looked around the room like they didn't know what she was talking about. Apparently even they knew that Julie was fishing for Victoria to name Frankie's revelation as the most shocking moment of the week. Alas, Victoria failed to pick up on Julie's hint.\nOr maybe, just maybe, Victoria wasn't so shocked by Frankie's news. I mean, she did kind of seem on to him all along. Earlier in the season, she said how much of an Ariana fan she is, and she often pressed Frankie about his family, especially details about his sister. Maybe Victoria's initial shock was surprise at actually being right?\nThen again, Victoria hasn't been the brightest houseguest on Big Brother this season. I mean, she did incorrectly use the phrase \"escape goat\" when she meant \"scapegoat.\" She also hasn't been very savvy to Derrick's scheming. Does she really think he's going to the final two with her when they barely talk game? Oh well. You always have next week's chat with Julie to redeem yourself, Victoria. Or make yourself look worse.\nImage: CBS","url":"https://www.bustle.com/articles/35878-big-brother-victoria-wasnt-surprised-to-learn-frankie-is-ariana-grandes-brother-after-all"}
