{"authors":["Allison Piwowarski"],"date_download":"2018-10-30 23:36:02","date_modify":"2018-10-30 23:36:02","date_publish":"2014-08-13 16:24:47","description":"There have been many flirtatious relationships on this season of Big Brother . First, you had Nicole and Hayden, who had the cutest relationship ever before being separated, then there is the now infamous Zankie, whose on again, off again…","filename":"data/vaneerConsumption/BigBrothersChristineCodyAreGettingALotofHateOnlineItsReallyNotFair.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/65483545-04b1-40f1-954c-3e837092d942.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35588-big-brothers-christine-cody-are-getting-a-lot-of-hate-online-its-really-not_1540942562.html","title":"'Big Brother's Christine & Cody Are Getting A Lot of Hate Online & It's Really Not Fair","title_page":"'Big Brother's Christine & Cody Are Getting A Lot of Hate Online & It's Really Not Fair","title_rss":"NULL","source_domain":"bustle.com","text":"There have been many flirtatious relationships on this season of Big Brother . First, you had Nicole and Hayden, who had the cutest relationship ever before being separated, then there is the now infamous Zankie, whose on again, off again relationship just makes them even more fun to watch. The other relationship that has been receiving a lot of attention via Twitter and the live feeds is the friendship between Cody and Christine. Actually, it hasn’t just been attention they’ve been getting; there's been a lot of hate.\nChristine, who is married to one of the coolest husbands ever, and fellow houseguest Cody, who is single, have struck up a very close friendship in the Big Brother house. Beyond emotional support inside the house, this friendship tends to consist of a lot of touching, cuddling, and stroking of arms. Many viewers have taken it upon themselves to cast hate at Christine for her relationship with Cody, saying it is inappropriate for a married woman to act the way she is toward another man. A handful of viewers have even gone as far to harass Christine’s husband, Tim, on Twitter for his wife’s actions, which is totally not OK.\nThe reason I take issue with this is because I think that there is a double standard in play. Christine, while being physically affectionate to Cody, has done absolutely nothing wrong since entering the house. Multiple Twitter users are accusing her of cheating on her husband because of her relationship with Cody. But maybe Christine is just someone who is very affectionate. We all have a friend like that, don’t we? It seems out of line to be accusing a woman of cheating because she likes to cuddle.\nAnd even if there was something more going on, it is important to remember that whether Christine’s actions qualify as being out-of-line is strictly between her and her husband. Luckily, Tim has a good sense of humor about the situation, and a heavy hand on the block button on Twitter for those who harass him about it. If Tim is OK with it, we should leave it alone. While some might argue that going on a reality show makes your life open to the public, Christine and her husband did not enter the reality show together, which doesn’t make their marriage public for all to judge.\nTim’s got the right attitude about the situation, and should continue to follow the lead of Vine superstar Brandon Bowen.\nImage: CBS","url":"https://www.bustle.com/articles/35588-big-brothers-christine-cody-are-getting-a-lot-of-hate-online-its-really-not"}
