{"authors":["Kadeen Griffiths"],"date_download":"2018-10-30 22:49:20","date_modify":"2018-10-30 22:49:20","date_publish":"2014-08-14 18:28:54","description":"Zach Rance is one of Big Brother's favorite house guests and there's a really good reason for that. Not only is he one half of the Zankie showmance whose ups and downs keep us all on the edge of our seats, but he's also a pot stirring comedic…","filename":"data/vaneerConsumption/BigBrotherZachsFruitLoopDingusCerealDreamIsNowaRealityPHOTOS.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/a214956a-fd04-4403-b507-6026aa96fc38.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35813-big-brother-zachs-fruit-loop-dingus-cereal-dream-is-now-a-reality-photos_1540939760.html","title":"'Big Brother' Zach's Fruit Loop Dingus Cereal Dream Is Now a Reality - PHOTOS","title_page":"'Big Brother' Zach's Fruit Loop Dingus Cereal Dream Is Now a Reality — PHOTOS","title_rss":"NULL","source_domain":"bustle.com","text":"Zach Rance is one of Big Brother's favorite house guests and there's a really good reason for that. Not only is he one half of the Zankie showmance whose ups and downs keep us all on the edge of our seats, but he's also a pot stirring comedic manchild who baffles and entertains his fellow house guests. From bringing the Gator Chomp to the forefront of the American mind to tossing out insults like \"fruit loop dingus busta fooligan\", Zach has made himself unforgettable and has a solid chance of making it to the finals if he can learn when and where to keep his mouth shut. However, maybe it's just me, but sometimes when I hear Zach call someone — usually poor Nicole Franzel, for whom the insult was invented — a fruit loop dingus, I get kind of hungry. I mean, seriously, fruit loop dingus? Is that an insult or a breakfast food?\nAs the label helpfully reminds us every time Zach is in the diary room, he's unemployed. Big Brother is his chance to win money for himself and, no doubt, his little brother over whom Zach is very fond and very protective. If Zach is looking for ideas on what he should do when he gets evicted from the Big Brother house and needs to look for a real job, he should probably consider making his own breakfast cereal. He's already got the name down if he can settle the inevitable lawsuit with Kellogg's. In fact, Kellogg's is a reasonable company. Why sue him when they can use Zach as advertisement for a special edition of Fruit Loops called Fruit Loop Dinguses?\nIt would be even more ironic considering that Nicole was usually the one who ended up being punished by being forced to wear ridiculous costumes for a week, like the time she was suck in frog costume and the time she had to wear lederhosen. Then again, Zach loves attention, so I don't think Kellogg's would have to negotiate too hard to get him into the Toucan Sam costume. Especially if they throw in a free year's supply of Fruit Loops.\nWe don't know when Zach will get evicted from Big Brother, but if he ever does then there's a good chance we might see him back on our television sets sometime soon. After all, he'll have become part of the Kellogg's family which means he'll have to do more than a few commercials alone and with the other mascots of Kellogg's brand cereals. Don't worry about job hunting when you get out, Zach. I've got it all planned out for you.\nImage: CBS; Kadeen Griffiths, Kellogg's","url":"https://www.bustle.com/articles/35813-big-brother-zachs-fruit-loop-dingus-cereal-dream-is-now-a-reality-photos"}
