{"authors":["Rich Tucker"],"date_download":"2018-10-30 19:23:14","date_modify":"2018-10-30 19:23:14","date_publish":"2014-12-18 15:23:44","description":"Career State Department diplomats didn’t want to give Estefanía Isaías permission to come to the U.S. from Ecuador, but she’s here anyway, after the Obama |","filename":"data/vaneerConsumption/BigDonorsGetBigBenefitsfromWhiteHouseDemSenator.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_12_18__1540927394.html","title":"Big Donors Get Big Benefits from White House, Dem Senator","title_page":"Big Donors Get Big Benefits from White House, Dem Senator | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Career State Department diplomats didn’t want to give Estefanía Isaías permission to come to the U.S. from Ecuador, but she’s here anyway, after the Obama administration intervened on her behalf.\nShe’s not the first member of her family to enjoy special treatment.\nThe Obama administration has allowed her father and uncle to remain in the U.S. even though Ecuador has asked for their extradition. They were sentenced two years ago to eight years in prison after their bank collapsed. Ecuador says they bilked the country out of some $400 million.\nMeanwhile, The New York Times reports the family has been active in Democrat party politics, giving hundreds of thousands of dollars to various candidates, especially President Obama and Sen. Robert Menendez (D-NJ).\nThe family’s donations seem to come at opportune times.\n“In 2012, the Isaías family donated about $100,000 to the Obama Victory Fund. Campaign finance records show that their most generous donations came just before a request to the administration,” the Times reports.\nA former federal prosecutor tells the paper that timing is suspicious. “When a donation happens and then something else happens, like the favor, as long as they are very, very close, that really paints a story,” Ken Boehm points out.\nIt’s also odd that, even though the family doesn’t live in New Jersey, it’s given to the Menendez reelection campaign and once donated $30,000 to a senate campaign committee he was running.\nAs the Times report adds, “the senator and his staff repeatedly made calls, sent emails and wrote letters about Ms. Isaías’s case to (then-Secretary of State Hillary) Clinton, (Clinton aide Cheryl) Mills, the consulate in Ecuador, and the departments of State and Homeland Security.” Menendez took the time to pen four letters supporting the family in the month of April 2012 alone.\n“Our office handled this case no differently than we have thousands of other immigration-related requests over the years, and to suggest that somehow the senator’s longstanding and principled beliefs on immigration have been compromised is just plain absurd,” Patricia Enright, the senator’s spokeswoman, told the newspaper.\nBut the former American ambassador to Ecuador thought the senator’s intervention was unusual. “Such close and detailed involvement by a congressional office in an individual visa case would be quite unusual, especially for an applicant who is not a constituent of the member of Congress,” Linda Jewell told the Times. “This example of inquiry is substantially beyond the usual level of interest.”\nEstefanía Isaías, at least for now, is free to remain in the United States.","url":"https://www.breitbart.com/politics/2014/12/18/big-donors-get-big-benefits-from-white-house-dem-senator/"}
