{"authors":["Akin Oyedele"],"date_download":"2018-10-30 23:29:34","date_modify":"2018-10-30 23:29:34","date_publish":"2018-07-19 00:00:00","description":"After the stock market's strong performance last year, many millennials and baby boomers are throwing more cash into the market in 2018. A $2 trillion wealth-management chief at Bank of America has some words of wisdom for them.","filename":"data/vaneerConsumption/Biggestinvestingmistakesaccordingtoa2trillionwealthmanager.json","image_url":"https://amp.businessinsider.com/images/5a997befaae605eb088b462a-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_biggest-and-most-common-investing-mistakes-2018-7_1540942174.html","title":"Biggest investing mistakes according to a $2 trillion wealth manager","title_page":"    Biggest investing mistakes according to a $2 trillion wealth manager - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Getty Images / Eduardo Munoz Alvarez\nFollowing the stock market's strong performance last year, many millennials and baby boomers are throwing more cash into the market in 2018, according to a Bank of America, US Trust survey of nearly 1,000 households.\nBut regardless of how the market does going forward, certain bad behavior can be more costly than sitting on cash.\nChris Hyzy, the chief investment officer of Bank of America Global Wealth and Investment Management, recently shared some of the most common errors he sees investors make. He oversees about $2 trillion in assets owned by ultra-high-net-worth individuals.\nThe first mistake is lumpy investing, or dipping your toes into the markets every now and then.\n\"You get a small bonus check or something like that in the early part of the year, you immediately put it to work, and you stop,\" Hyzy told Business Insider in a recent interview. \"You're not a consistent investor over the course of months and quarters and years, et cetera.\"\nInvestors with a long time horizon can take advantage of one the smartest strategies to invest in stocks: dollar-cost averaging. It involves putting a fixed amount of money in the market on a regular schedule, and helps reduce the risks that come with inevitable market declines.\nFor example, after a stock plunges, the same amount of money would purchase a greater number of shares, which represents a greater stake in the company. If and when the stock recovers, an investor would have spent less per share, on average, than if they had shelled out a lump sum to buy at the higher pre-crash price.\n\"The second one is waiting until the all-clear sign, being at your highest level of comfort before you invest,\" Hyzy said. \"You're technically never at your highest level of comfort and usually, when you are, it's when things are overvalued.\"\nEven a well-intentioned effort to enter the market at a \"good\" time can go awry, and Hyzy flagged one that some investors are entering head-on.\nThe Bank of America survey showed that more of the people who planned to increase their stock allocations were looking outside the US versus inside, with the end goal of diversification. Emerging-market stocks on aggregate are getting slammed this year, and so they are looking more attractive to some investors.\nBut in Hyzy's view, the US economy is breaking away from the rest of the world and is getting some fuel from tax cuts.\n\"A lot of people say 'I'm owning emerging markets this year because I want to diversify,'\" Hyzy said. \"You could have the greatest insight and training around the markets and investing, and your timing doesn't necessarily match the market's timing. So don't time the markets.\"\nThe final mistake Hyzy pointed out was overreaching, particularly for people with long time horizons who think they'd have time to recover from any bad bets.\n\"If you're overreaching, sometimes it means overconfidence.\"\nSee also:","url":"https://www.businessinsider.com/biggest-and-most-common-investing-mistakes-2018-7"}
