{"authors":["Logan Churchwell"],"date_download":"2018-10-30 20:43:02","date_modify":"2018-10-30 20:43:02","date_publish":"2016-11-15 21:25:48","description":"A western Texas oil and natural gas shale formation was labeled the “largest” of its kind by the U.S. Geological Survey on Tuesday.","filename":"data/vaneerConsumption/BigOilFedsCallWestTexasDepositLargestinHistory.json","image_url":"https://media.breitbart.com/media/2016/04/Oil_well.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_11_15__1540932182.html","title":"Big Oil: Feds Call West Texas Deposit ‘Largest’ in History","title_page":"Big Oil: Feds Call West Texas Deposit ‘Largest’ in History","title_rss":"NULL","source_domain":"breitbart.com","text":"A western Texas oil and natural gas shale formation was labeled the “largest” of its kind by the U.S. Geological Survey on Tuesday.\nFederal surveyors announced that the Wolfcamp shale in the Midland Basin portion of Texas’ Permian Basin now holds the record for most oil, natural gas, and gas liquid deposits that are “undiscovered, technically recoverable resources.”\nThe USGS notes that within its survey spanning from north of Lubbock to remote regions southwest of San Angelo, an estimated and previously unaccounted for 20 billion barrels of crude oil; 16 trillion cubic feet of natural gas; and 1.6 billion barrels of natural gas liquids are able to be extracted by means typically involving slant drilling and hydraulic fracturing, commonly known as “fracking”. The figures are based on official methods that project untapped resources amid formations already surveyed and exploited.\nA government spokesperson underscored the historic nature of the finding in a release.\n“The fact that this is the largest assessment of continuous oil we have ever done just goes to show that, even in areas that have produced billions of barrels of oil, there is still the potential to find billions more,” said Walter Guidroz, for the USGS Energy Resources Program. “Changes in technology and industry practices can have significant effects on what resources are technically recoverable, and that’s why we continue to perform resource assessments throughout the United States and the world.”\nNorth Texans for Natural Gas, an organization that bills itself as “a grassroots organization that aims to give a voice to those who support natural gas” and booster of Barnett Shale projects hailed the finding to Breitbart Texas Tuesday.\n“It’s no surprise that Texas has massive oil fields, but these new findings from USGS are jaw-dropping. Fracking and horizontal drilling have turned the United States into a global energy superpower, and the untapped potential in the Wolfcamp means we won’t be surrendering that status any time soon,” group spokesman Steve Everly said. “For the few remaining advocates of ‘Peak Oil,’ this certainly isn’t their lucky day.”\nThe USGS notes that it does not account for the profitability of new deposit extractions.\nThe previous discovery record dates back to 2013 for North Dakota’s Bakken-Three Forks oil accumulation. Texas’ latest discovery dwarfs the northern high plains state by a factor of three.\nThe Wolfcamp shale has been no stranger to extraction efforts over the past three decades. The USGS estimates that roughly 3,000 wells have been drilled using horizontal methods in later years alone.\nGiven the substantial jumps in local supply, the Petroplex is unlikely to be producing at pre-2014 levels in the months ahead. Brent Crude pricing has hovered in the low to mid-$40 range for weeks leading up to the 2016 Election. An unshackled Iran continues to speed past output benchmarks while OPEC has again advanced the question of cutting production among member states to stabilize markets, according to Bloomberg.\nLogan Churchwell is the Assistant Editor and a founding member of the Breitbart Texas team. You can follow him on Twitter @LCChurchwell.","url":"https://www.breitbart.com/border/2016/11/15/big-oil-feds-call-west-texas-deposit-largest-history/"}
