{"authors":[],"date_download":"2018-10-22 21:14:42","date_modify":"2018-10-22 21:14:42","date_publish":"2014-06-04 15:02:24","description":"General Motors has rebounded from bankruptcy and, with sales at a six-year high, the automaker appears to be accelerating away from a recall setback.","filename":"data/vaneerConsumption/BigSalesJumpSignalsGMisDrivingAwayFromRecallCrisis.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/487041/140604-140604-barra-1128_878136093f5ce07b99907d948aadcdee.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_gm-recall_big-sales-jump-signals-gm-driving-away-recall-crisis-n122376_1540242882.html","title":"Big Sales Jump Signals GM is Driving Away From Recall Crisis","title_page":"Big Sales Jump Signals GM is Driving Away From Recall Crisis ","title_rss":"NULL","source_domain":"nbcnews.com","text":"“The momentum we generated in April carried into May, with all four brands performing well in a growing economy,” GM’s VP of U.S. sales Kurt McNeil told reporters Tuesday.\nBut considering all the headlines, why does GM have so much momentum?\n“There are literally scores of ‘scandals,’ seemingly every day,” and consumers have become “oblivious by choice” to the headlines, suggests Art Spinella, chief analyst with automotive research firm CNW Research. Despite the criticism from pundits and politicians, he contends that recalls have become “nano-second concerns,” much like so many other stories that flush through the 24-hour news cycle.\nAccording to CNW’s Purchase Path studies, recall stories are among the least read by the general public, including those actually in the market to buy a new vehicle.\nAnd when shoppers do consider new products, they’re likely to discover a very different General Motors from the one in the headlines, adds George Peterson, head of consulting firm AutoPacific Inc.\nAll of the products affected by the GM ignition switch recall — such as the Chevrolet Cobalt, Pontiac G6 and Saturn Ion — are now out of production, he points out. In fact, the automaker abandoned the Pontiac and Saturn brands when it emerged from bankruptcy in July 2009.\nRecalls have become “nano-second concerns,” much like so many other stories that flush through the 24-hour news cycle.\nThe products now in the showrooms of GM’s four surviving U.S. brands are very different from those of the company prior to its run through Chapter 11, stresses Peterson. He noted that vehicles like the new Chevrolet Impala, Corvette and Silverado are generally garnering strongly positive reviews. The Corvette sports car and Silverado pickup, for example, were named North American Car and Truck of the Year in January. Meanwhile, the big Impala sedan has been highly touted by Consumer Reports magazine and last week was declared “superior” by the Insurance Institute for Highway Safety.\n“Consumers have confidence that what General Motors is producing today is pretty darned good,” adds Peterson, “and dramatically better than anything they built in the past.”\nOf course, it didn’t hurt that GM ramped up incentive spending in May by nearly 2 percent compared to April — and at an average $3,411 per vehicle, according to data compiled by TrueCar.com, it had the highest givebacks in an industry where the average incentive was a more modest $2,677. But GM’s spending on rebates and other lures was actually down nearly 7 percent from what it offered a year earlier.\nTrueCar data show that the Detroit maker had the second-highest Average Transaction Prices — what shoppers actually spend after factoring in incentives and options — of all full-line manufacturers, at $35,372, it came in just behind Volkswagen.\n“GM (was) able to command higher prices, while shrinking (its) incentive spend-to-price ratio,” notes TrueCar Executive Vice President Larry Dominique.\nA closer look at May’s numbers show that while GM’s overall sales were up nearly 13 percent, its retail volume rose a less robust 10 percent. In fact, it saw a big burst of activity on the fleet side of the ledger, with demand spiking among corporate and daily rental buyers. The maker discounted that surge, noting it is a common factor during the spring, but it clearly helps boost GM’s momentum in May.\nThat said, there are simply few signs to suggest that car buyers have had second thoughts about GM’s products in the wake of one of the worst recall crises in U.S. automotive history.\nMore from The Detroit Bureau:\nFormer GM CEO Claims Successor Didn't Know About Ignition Switch Problems\nTeen Drivers Face the 100 Deadliest Days of the Year\nTesla Won't be Able to Sell S-E-X, Says CEO","url":"https://www.nbcnews.com/storyline/gm-recall/big-sales-jump-signals-gm-driving-away-recall-crisis-n122376"}
