{"authors":["Minerva Canto","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:53:02","date_modify":"2018-10-30 22:53:02","date_publish":"2016-10-27 08:00:00","description":"First-graders at Belvedere Elementary plopped down on their assigned carpet squares, chattering in Spanish as the day's lesson got underway. Teacher Ivon","filename":"data/vaneerConsumption/BilingualbenefitProp58asksvoterstoundoEnglishfirstvote.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/Bilingual-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939982.html","title":"Bilingual benefit? Prop. 58 asks voters to undo \"English first\" vote","title_page":"Bilingual benefit? Prop. 58 asks voters to undo \"English first\" vote | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"First-graders at Belvedere Elementary plopped down on their assigned carpet squares, chattering in Spanish as the day’s lesson got underway. Teacher Ivon Rabago displayed the book “La Historia de Martin Luther King, Jr.” as she spoke to the San Bernardino County students—both fluent English speakers and those just learning English—entirely in Spanish.\nWelcome to the “dual immersion” classroom, where native English speakers learn side-by-side with English learners as both work to become proficient in both languages. The goal, unlike in the old days of bilingual education, is not simply to turn all students into English speakers, but to turn out students fluent in two languages simultaneously.\nIt’s an increasingly popular approach, with classes multiplying in California and nationwide in the past few years as research indicates they can result in academic gains. In Orange County alone, dual immersion classes are offered not only in Spanish but also in Vietnamese, Mandarin and Korean.\nThis is the ideal California classroom of the future as envisioned by proponents of Proposition 58—preparing students for what promises to be an increasingly globalized future. The ballot measure aims to throw open the possibilities of bilingual education for two kinds of students: the more than 1.3 million public school students whose primary language is not English, and native English-speaking students whose parents now like the idea of sending them to classrooms where they could learn to be bilingual, too.\n“This is about every California student, ensuring that every student here in California has an opportunity, if their parents choose, to put them in a multilingual dual immersion program,” said state Sen. Ricardo Lara, D-Bell Gardens, who unveiled the genesis of Prop. 58 at a Chinese-English dual immersion school in San Francisco.\nBut critics warn it could drag the state back to a time when children who needed to speedily learn English instead languished too long in classes where most of the teaching was in Spanish or another native tongue.\nThat was the argument that led Californians to reject bilingual education nearly two decades ago when they passed Proposition 227—a controversial measure that stipulated English learners receive a year of intensive English instruction and then be moved into regular classrooms and taught primarily in English. At the time, advocates of ending bilingual education were a mix of people resentful of an influx of immigrants into California, and others, including some Latinos, who believed the best way to help immigrant children to succeed academically was to transition them to English-only classrooms.\nProp. 58 would undo much of what Prop. 227 did. If it passes, it would represent a political shift in California politics since the 1990s, when voters made an emphatic “English first” declaration and approved a trio of measures that some perceived as hostile to minorities and immigrants. It also would mark a cultural shift as well, as parents—regardless of their native language—increasingly embrace the idea that children are little “knowledge sponges” and capable of mastering multiple languages at a young age.\nFour years ago, legislators made California the first in the nation to offer a state seal of biliteracy to indicate they had achieved proficiency in writing, reading and speaking more than one language (more than 20 states have followed suit.) Last spring, nearly 40,000 high school graduates in California received the state seal on their diplomas, according to the state Department of Education—a fourfold increase since the program’s inception. Almost 18,000 of those were former English learners.\nTop ten California counties awarding the State Seal of Biliteracy to high school grads\nProponents of dual immersion cite a few studies and many first-hand reports that dual immersion is a successful program whose students score as high and, in some cases, higher than their English-only counterparts on standardized tests.\nSo if dual immersion classes are growing in popularity across California, why the need for Prop. 58? Those classes only happen if enough parents complete paperwork asking that their children to be placed in multilingual classes. It may sound like a simple work-around, but not in households where parents aren’t fluent in English and may have trouble understanding all their options.\nThe ballot measure would abolish the requirement that parents sign such waivers. It’s expected to ease the way for educators statewide to allocate more resources to dual immersion classes—although they would still need to overcome a shortage of teachers qualified to teach in two languages.\nThe prime opposition to Prop. 58 comes from Silicon Valley entrepreneur Ron Unz, who spearheaded the drive against bilingual education two decades ago, and Ken Noonan, former superintendent of Oceanside Unified School District, who once defended bilingual education and then underwent a conversion after seeing the results of ending it. The two contend that Prop. 227 succeeded in “rescuing California Latinos from the Spanish-only education ghetto” and that within four years of its passage, the test scores of more than a million immigrant students increased by 30 to 100 percent.\nEnding bilingual education “worked so well in California schools that the whole issue was forgotten by almost everyone except the bilingual education activists,” they wrote in ballot arguments against Prop. 58. “Now they’re trying to trick the voters into allowing the restoration of mandatory Spanish-almost-only classes.”\nThe push for more dual immersion classes is coming primarily from educators buoyed by promising studies showing the potential benefits of this teaching method, particularly for English learners. But critics fear Prop. 58 would force English learners into a program that appears to be more popular among English-speaking students rather than students who need to learn English. Indeed, several Spanish-speaking parents said in interviews that they weren’t immediately sold on the idea of dual immersion because they worried whether their kids were learning English, not just Spanish.\nThat was initially a concern for Martha Flores, whose three children have attended Belvedere’s dual immersion program over the past 14 years. Her youngest is currently a sixth grader at Belvedere; her oldest is fully bilingual and studying computer programming at California State University, San Bernardino.\n“I saw them (my kids) interacting with English-speaking students and I noticed that they spoke English well. They had no problems communicating with each other. Really, they helped each other out, the English speaking kids and Spanish speakers,” Flores explained in her native Spanish.\nThat’s also a big part of the appeal for English-speaking parents who see a real advantage to helping their children become bilingual.\n“I think that we have a global economy and that we need to be able to communicate not only linguistically, but culturally,” said Linda Richards, whose two high school-age children were in dual immersion beginning in kindergarten and continue to work toward earning the seal when they graduate from Eleanor Roosevelt High School in the Corona-Norco School District within the next couple of years. She also runs a Facebook group for parents of students in dual immersion, where moms and dads post homework questions and see advice about Spanish-language tutors.\nA key component of dual immersion programs is that parents must commit to the program for at least a few years for their children to begin to achieve proficiency in their second language.\n“Sometimes, parents get nervous the first or second year, but we tell them that it’s important to keep going,” said Belvedere Elementary principal Ann Pearson.\nWho are California’s English learners, by native language?\nNearly half the students at Belvedere Elementary are classified as English learners, and most of those are in dual immersion classes. Instruction begins in kindergarten, with teachers speaking mostly Spanish and gradually teaching more in English each year until classes are about 50-50 in each language. The school is within the San Bernardino City Unified School District, the eighth largest school district statewide, and the district’s dual immersion program is one of the oldest and largest such programs in the state.\n“Many of the students that reclassify as former English learners after being in dual immersion are actually doing better than kids who have been in mainstream classes,” the principal said.\nUnz said he worries English learner students will suffer negative consequences once more. He spent more than $750,000 of his own money pushing Prop. 227, but he says he doesn’t plan to contribute to what he described as “an enormous amount of money” required to defeat Prop. 58 on the crowded ballot.\n“I think there’s a reasonable chance it will pass since no one is paying much attention,” he said. “Dual immersion programs have really increased in size, but I really doubt they’ll grow much larger than they are now.”\nUnz instead is manning a website where he uploaded articles, some written by him and dating back to 2002, touting the success of Prop. 227. Those reports indicated that standardized test scores for English learners in a few school districts showed impressive gains the years immediately after the measure took effect.\nBut the long-term effects of Prop. 227 remain something of a mystery, given all the variables that make a large-scale study difficult to conduct. The research that has been published is contradictory.\nToday, an achievement gap between English learners and other students continues. Only about 18 percent of English learners met or exceeded standards on the 2016 California Smarter Balanced Assessment in English language arts/literacy, compared to 53 percent of English speakers who did meet standards. The results for math standardized tests are equally dismal.\nSome see that as an indictment of English immersion, and they tout dual immersion as a promising alternative.\n“For Latino students in particular, two-language programs lead to better academic outcomes than English immersion programs in the long-term,” according to a 2014 report authored by Stanford University researchers who studied four different instructional programs for English learners. These researchers, however, steered away from making any policy recommendations, instead saying their report should be used to aid further research and discussion.\nA 2015 study of the dual immersion program in Portland, Oregon public schools tracked dual immersion students through middle school. “Immersion programs as implemented in Portland appear to be a cost-effective strategy for raising English reading performance of both native English speakers and native speakers of other languages,” the report stated.\nLaura Torres, parent of a third-grade English learner at Orange Unified School District, said she’s proud that her daughter will become fully bilingual.\n“I was a little concerned at first thinking she would only be learning Spanish, but each year my daughter comes home with more complicated books in English. It makes me so happy to see her switching back and forth from reading English to reading Spanish,” Torres said. “It’s the best of both worlds.”\nIf Prop. 58 passes, school districts wishing to add or expand dual immersion programs face some challenges. Studies note that their success depends primarily on having well-qualified teachers and administrators committed to devoting adequate resources.\nA significant obstacle will be finding those teachers: Today, fewer have bilingual certification.","url":"https://calmatters.org/articles/bilingual-benefit-with-prop-58-voters-asked-to-undo-english-first-vote/"}
