{"authors":[],"date_download":"2018-10-30 20:31:02","date_modify":"2018-10-30 20:31:02","date_publish":"2015-03-11 18:29:13","description":"Police departments that use speeding tickets to pad their budgets might have to let up on the gas, if a proposed bill becomes law.","filename":"data/vaneerConsumption/Billaimstoputthebrakesonspeedtraps.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/MyAJC/2015/03/11/Images/photos.medleyphoto.6914195.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_transportation_bill-aims-put-the-brakes-speed-traps__1540931462.html","title":"Bill aims to put the brakes on speed traps","title_page":"Bill aims to put the brakes on speed traps","title_rss":"NULL","source_domain":"ajc.com","text":"Police departments that use speeding tickets to pad their budgets might have to let up on the gas, if a proposed bill becomes law.\nThe measure, introduced by a Waynesboro lawmaker, would close a loophole in a law that limits how much of their budgets police departments can raise through speeding tickets. The bill, which passed out of the Senate this week, follows an Atlanta Journal-Constitution analysis that exposed numerous departments for raking in exorbitant amounts.\nGeorgia’s speed trap law says police departments cannot receive more than 40 percent of their budgets from speeding ticket fines. Otherwise, there is a presumption that those tickets are being doled out for purposes other than public safety. Departments that abuse their power can lose their right to use speed detection devices.\nHowever, there’s a huge loophole: Tickets issued to drivers for traveling more than 17 mph above the speed limit don’t count toward the 40-percent threshold.\nSB 134 would delete that exception, so that all speeding tickets are taken into account. That would presumably make more police agencies susceptible to sanctions.\nThe Georgia Municipal Association and Association County Commissions of Georgia are neutral on the bill. The Georgia Association of Chiefs of Police opposes it. Association members believe police departments shouldn’t be penalized for going after “egregious speeders,” said Executive Director Frank Rotondo.\nHowever, he said the group would like to work with legislators to tighten up the existing law, perhaps by lowering the cap to 30 or 35 percent of each police agency’s budget.\n“I look forward to some change, because what is basically happening now is that a lot of agencies are being painted with one brush,” said Rotondo. “Nobody likes to give a traffic ticket. But if there is so much publicity against over-policing, that is a shame.”\nAs it is, the state very rarely yanks a department’s speed detection permit. And when it does, it’s generally over another type of infraction, rather than the 40-percent rule. The last time a department’s permit was revoked over to the rule was in 1995.\nSen. Jesse Stone, R- Waynesboro, said he introduced the bill after seeing the AJC’s report (which looked at revenues from all types of traffic tickets, not just speeding). He said he’d also heard anecdotes from other lawmakers about “gamesmanship” local law enforcement agencies were engaging in to take advantage of the 17-mph loophole.\nFor example, Stone said he had heard about police departments targeting just speeders who were going over the 17-mph threshold.\n“Anytime you have a loophole, there is a tendency to use it,” Stone said.\nSome police chiefs interviewed by the AJC — including the police chief from the city of Doraville, which tallied the most traffic ticket fine revenue per capita in metro Atlanta — said they rarely write speeding tickets for less than 20 mph over the limit to give drivers the benefit of the doubt.\nThe AJC found other potential problems with the law. For example, local governments are not required to report how much income they generate from speeding tickets to the state. The Department of Public Safety only initiates an investigation if someone complains about a suspected speed trap.\nThe AJC also found that some police departments were skirting the speed-trap cap by ticketing drivers for trumped-up offenses such as tinted windows or following too closely. Such was the case in the tiny Southwest Georgia town of Warwick (pop. 416), which was No. 1 in the state for the amount of ticket revenue collected per capita between 2008 and 2012.\nWarwick’s former police chief, David Morris, was ousted last year amid a controversy about overzealous traffic enforcement. He told the AJC that he admonished his officers not to cite anyone for going slower than 63 mph in a 45-mph zone on the main route through town. But he encouraged them to cite drivers for other violations, such as suspended registration or expired tags.\nStone said he is considering introducing a bill next year that would require local governments to report speeding fine revenue to the state. Georgia police chiefs also support that idea, said Rotondo.\nSpeed traps have a long and storied history in Georgia. A notorious speed trap in the tiny town of Ludowici made headlines in the 1960s after then-Gov. Lester Maddox erected billboards warning motorists to stay away.\nIt was that town’s travails that prompted legislative reforms aimed at overzealous enforcement, including the 40-percent rule.\n“Whatever we do, I don’t think we’ll solve it completely,” said Stone. “Lester Maddox started with Ludowici 50 years ago. And they’ve never lived that down.”","url":"https://www.ajc.com/news/transportation/bill-aims-put-the-brakes-speed-traps/OzfWR2lGr5iA6txTPDThuO/"}
