{"authors":["Lisa Mcloughlin For Mailonline"],"date_download":"2018-10-23 04:45:51","date_modify":"2018-10-23 04:45:51","date_publish":"2017-03-10 14:51:31","description":"The 34-year-old showcased her slender shoulders in the striped loose-fitting midi dress which teased at her cleavage as she posed for photographs outside the event.","filename":"data/vaneerConsumption/BilliePiperarrivesatOlivierAwardsNominationsParty.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/15/3E238DB400000578-0-image-a-164_1489158685893.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4301540_Billie-Piper-arrives-Olivier-Awards-Nominations-Party_1540269951.html","title":"Billie Piper arrives at Olivier Awards Nominations Party","title_page":"Billie Piper arrives at Olivier Awards Nominations Party | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's earned critically acclaim for her turn in West End play Yerma.\nHaving earned herself an Olivier nomination, Billie Piper lead the nominee's at the awards special luncheon in a bardot style dress alongside fellow actress Ruth Wilson on Friday in London eatery Rosewood.\nThe 34-year-old showcased her slender shoulders in the striped loose-fitting midi dress which teased at her cleavage as she posed for photographs outside the event.\nScroll down for video\nNominees: Billie Piper lead the nominee's at the awards special luncheon in a bardot style dress alongside fellow actress Ruth Wilson (R) on Friday in London\nThe interesting piece oozed summer vibes as it featured flirty strap and ribbon detail.\nShe injected height into her petite frame with a pair of platform black heels that caged her feet with criss-cross straps.\nKeeping to her natural beauty look, she styled her hair into a side-parting working it into a loose wave which fell to her shoulders.\nBillie - who is mother to sons Winston, eight, and Eugene, four - accentuated her English rose complexion with a dusting of soft pink blush across her cheeks and a nude lip.\nChic: The 34-year-old showcased her slender shoulders in the striped loose-fitting midi dress which teased at her cleavage as she posed for photographs outside the event\nThe Penny Dreadful star was earlier in the day looking radiant as she left the BBC radio studios following an appearance on ex-husband Chris Evans' show.\nNow arriving to the Olivier Awards Nominees luncheon in style, she is currently a frontrunner for the Best Actress prize for her role in Yerma.\nBillie has already for ES Theatre awards, Critics Choice and What’s On Stage awards for the Young Vic production.\nShe has bewitched audiences and critics alike with her stage performance in the theatre show, about a woman driven wild by the desire to have a baby.\nNew heights: She injected height into her petite frame with a pair of platform black heels that caged her feet with criss-cross straps\nStripe to it! The interesting piece oozed summer vibes as it featured flirty strap and ribbon detail\nBoho babe: Billie oozed boho vibes in her off-the-shoulder number\nThe star is set to return to the West End this year with an extended stint in the acclaimed play.\nThe actress - who split from second husband Laurence Fox last year - and her ex Chris have remained on very good terms since their split, so it comes as no surprise she was a guest on his show.\nAn 18-year-old Billie married Chris - who is 16 years older than her - in 2001 following only six months of dating, but divorced in 2007.\nIn the nude: Billie - who is mother to sons Winston, eight, and Eugene, four - accentuated her English rose complexion with a dusting of soft pink blush across her cheeks and a nude lip\nAu natural: Keeping to her natural beauty look, she styled her hair into a side-parting working it into a loose wave which fell to her shoulders\nWhile Billie went for a boho vibe, fellow nominee Ruth Wilson oozed retro glamour in a figure-flaunting floral pencil skirt with peplum detail.\nThe 35-year-old British star teamed the look with a complementing shoulder pad equipped wool jumper that exhibited her buxom bust as she posed for photos at the bash.\nAccentuating her waist-cinching ensemble, she wrapped a thick black belt around her hourglass shape.\nPeplum pal: While Billie went for a boho vibe, fellow nominee Ruth Wilson oozed retro glamour in a figure-flaunting floral pencil skirt with peplum detail\nPad power: The 35-year-old British star teamed the look with a complementing shoulder pad equipped wool jumper that exhibited her buxom bust as she posed for photos at the bash\nChic: Accentuating her waist-cinching ensemble, she wrapped a thick black belt around her hourglass shape\nFlaunt it: The Affair star adorned her feet with a simple strappy heel as she welcomed the star-studded afternoon for the coveted awards\nThe Affair star adorned her feet with a simple strappy heel as she welcomed the star-studded afternoon for the coveted awards.\nNominated for best actress for her turn in Hedda Gabler, she worked her brunette tresses into a chic chignon.\nSpeaking to the Daily Mail's Baz Bamigboye, Ruth said that playing Hedda Gabler in Ivo van Hove's incendiary production at the National Theatre is like 'doing a workout on stage — every night'.\nShe added that van Hove's take on Henrik Ibsen's tragedy is like 'nothing I've ever been part of before'.\nHaving a chat: The actress stopped and chatted to theatre director Lindsay Posner\nAll smiles: Rafe Spall, Cherry Jones and Ruth (Pictured L-R) posed for pictures at the bash\n'A workout': Speaking to the Daily Mail's Baz Bamigboye, Ruth said that playing Hedda Gabler in Ivo van Hove's incendiary production at the National Theatre is like 'doing a workout on stage — every night'\nNeither actress nor director was interested in putting on another traditional version of the drama about a newlywed general's daughter who feels trapped in her marriage from the get-go.\n'From day dot Hedda was self-destructive. It's not that marriage has made her like that,' she said. 'It's that she grew up that way, wanting to burn people's hair!\n'Playing her is so physical that it's like a workout on stage every night, so I usually need a decent lunch to give me strength,' she said.\nAlso attending the star-studded luncheon was Take That's Gary Barlow, who officially opened his musical The Girl's with Tim Firth late last month.\nLet it shine: Also attending the star-studded luncheon was Take That's Gary Barlow, who opened his musical The Girl's with Tim Firth late last month\nDapper: The 46-year-old looked smart in his navy blue suit pants and waist coat which he teamed with a light blue shirt and silver tie\nSlick: Completing his ensemble, he slipped on a patent leather dress show, while placing a sunflower pin on his lapel\nThe 46-year-old looked smart in his navy blue suit pants and waist coat which he teamed with a light blue shirt and silver tie.\nCompleting his ensemble, he slipped on a patent leather dress show, while placing a sunflower pin on his lapel.\nThe singer - who recently wrapped his BBC talent show series Let It Shine - sported his usual scruff and quiffed coif.\nStylish: Freddie Fox looked smart in a navy suit with stylish pocket square\nParty people: Lord Julian Fellowes (L) and actress Emma Williams posed for a photo\nSuit you: David Baddiel and Tom Hollander (R) donnned suits for the afternoon's festivities\nEye-catching: Performer Tyrone Huntley donned a vibrant orange shirt for the bash\nDazzling: Stage stars Victoria Hamilton-Barritt and Haydn Gwynne (R) put their best foot forward at the luncheon\nWork it: British actress Clare Foster sported a pair of wide leg navy culottes for the day\nSmart: Nigel Havers and Ben Hunter (R) arrived at the exclusive event","url":"https://www.dailymail.co.uk/tvshowbiz/article-4301540/Billie-Piper-arrives-Olivier-Awards-Nominations-Party.html"}
