{"authors":["Patrick Howley"],"date_download":"2018-10-30 20:21:31","date_modify":"2018-10-30 20:21:31","date_publish":"2015-12-21 23:49:26","description":"Bill Clinton Stars As 'Fornicator' In Islamic State Propaganda Video","filename":"data/vaneerConsumption/BillClintonStarsAsFornicatorInIslamicStatePropagandaVideo.json","image_url":"https://media.breitbart.com/media/2015/12/Clinton-in-ISIS-image.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_21__1540930891.html","title":"Bill Clinton Stars As 'Fornicator' In Islamic State Propaganda Video","title_page":"Bill Clinton Stars As 'Fornicator' In Islamic State Propaganda Video","title_rss":"NULL","source_domain":"breitbart.com","text":"Democratic presidential frontrunner Hillary Clinton’s husband Bill Clinton is disparagingly featured as a “fornicator” in an Islamic State propaganda recruitment film.\nClinton is under fire for comments she made in Saturday’s Democratic debate, in which she claimed that the Islamic State is using videos of Donald Trump talking about Muslims in their terrorist propaganda videos. That statement turned out to be false.\nInstead, the group known as ISIS is recruiting people based on their hatred of Bill Clinton’s extramarital affairs and the marriage rights of American homosexuals.\nA recent Islamic State video “No Respite,” released in advance of the holiday season, calls for the creation of an Islamic caliphate. “Not a secular state built on man-made laws whose soldiers fight for the interests of legislators, liars, fornicators, corporations, and for the freedom of Sodomites,” the ad states, showing Bill Clinton as the “fornicator.”\nThe video tells the United States and other nations to “bring it on” because “we’re counting your banners, which our prophet said would reach 80 in number.”\n“And then the flames of war will finally burn you on the hills of Dabiq.”\nThe Islamic State was referring to the final apocalyptic battle between Muslim forces and what they imagine as the modern Roman empire, which they are scheduling in the northern Syrian city of Dabiq, in accordance with their prophet Muhammad’s supposed seventh-century edict to fight the Romans at that location.\n“The fact that Turkish Muslims, not infidel Romans, control Constantinople today and are working with the infidel Romans against the Islamic State makes the Dabiq prophecy a poor fit for contemporary events,” said William McCants of the Brookings Institution, referring to the ‘Dabiq Prophecy.’\n“The inevitable defeat of the Islamic State at Dabiq, should it ever confront ‘Rome,’ would also argue against the prophecy’s applicability. But in the apocalyptic imagination, inconvenient facts rarely impede the glorious march to the end of the world.”\n(h/t James Woods)","url":"https://www.breitbart.com/politics/2015/12/21/bill-clinton-stars-fornicator-islamic-state-propaganda-video/"}
