{"authors":["Jessica Taylor","Domenico Montanaro"],"date_download":"2018-10-23 05:48:40","date_modify":"2018-10-23 05:48:40","date_publish":"2016-01-23 00:00:00","description":"With a Ted Cruz or Donald Trump GOP nomination looking possible and Bernie Sanders gaining on the Democratic side, the former New York City mayor and billionaire is seriously eyeing a White house run.","filename":"data/vaneerConsumption/BillionaireFormerNYMayorBloombergEyeingPossibleWhiteHouseBid.json","image_url":"https://media.npr.org/assets/img/2016/01/23/ap_822983256235_wide-625b6657d8f376c8e0eeda80345cab23f8955107.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_01_23_464112456_former-n-y-billionaire-mayor-bloomberg-eyeing-possible-white-house-bid_1540273720.html","title":"Billionaire Former N.Y. Mayor Bloomberg Eyeing Possible White House Bid","title_page":"Billionaire Former N.Y. Mayor Bloomberg Eyeing Possible White House Bid : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Billionaire Former N.Y. Mayor Bloomberg Eyeing Possible White House Bid\nEnlarge this image toggle caption Thibault Camus/AP Thibault Camus/AP\nA divorced New York businessman billionaire with a mixed political history and knack for controversy and grabbing the spotlight might run for president. Another one.\nFormer New York City Mayor Michael Bloomberg is again weighing a possible independent bid for the White House after seeing an opening in a chaotic and unpredictable 2016 race.\nThe Democrat turned Republican turned independent is actively exploring a run, hiring consultants and commissioning a poll last month aimed at seeing whether there is an appetite for a third-party candidate, a source familiar with Bloomberg's plans told NPR.\nBloomberg plans to survey the race after next month's New Hampshire primary and is willing to spend up to $1 billion of his own money on such an effort. He has proved he is willing to spend money to win elections. He has spent more than $300 million between his three mayoral runs and his post-mayoral political projects. The $250 million he spent on his mayoral races is the most anyone has ever spent on his or her own elections in U.S. history.\nHe can afford it — Bloomberg is the 14th-richest man in America and estimated to be worth some $36 billion, according to Forbes' 2015 list of billionaires. To put that in context, Donald Trump claims to be worth almost $10 billion. (His wealth has been estimated at lower than that, somewhere between $2 billion and $5 billion, according to various counts.)\nBecause of deadlines to get on a general-election ballot, he will make a decision one way or another by March, sources close to the former New York mayor told NPR and WNYC.\nThis isn't the first time the former mayor and media mogul has flirted with a presidential bid, but the unique dynamics of the 2016 race make it more likely than ever he could actually pull the trigger this time.\nAccording to the New York Times, which first reported Bloomberg's interest, he is more likely to run if Trump or Texas Sen. Ted Cruz wins the GOP nomination and if Vermont Sen. Bernie Sanders topples former Secretary of State Hillary Clinton in the Democratic race.\n\"If Hillary wins the nomination, Hillary is mainstream enough that Mike would have no chance, and Mike's not going to go on a suicide mission,\" former Pennsylvania Gov. Ed Rendell, a Clinton ally and friend to Bloomberg, told the Times.\nThe problem that timeline presents for Bloomberg is that neither primary contest is likely to be decided in March.\nThe 73-year-old Bloomberg has remained active in politics since leaving office in 2013, most notably advocating for stricter gun control measures across the country through his \"Everytown for Gun Safety\" group, which spent nearly $400,000 on elections in 2014 with mixed results.\nEven though Bloomberg first won office in 2001 as a Republican, he holds some very liberal positions. He is outspoken on climate change, is pro-abortion rights and supports same-sex marriage, and his crackdown on trans fats along with his other healthful eating requirements in New York City drew backlash from many conservatives.\nBut his cozy relationship with Wall Street and anti-public-sector union efforts in New York City could similarly alienate liberals who might agree with him on social policy.\nThere's no telling how exactly Bloomberg could affect a general election featuring Trump and Sanders, but the race would feature two New York billionaires against an avowed socialist whose core message has been anti-Wall Street and the wealthy class.","url":"https://www.npr.org/2016/01/23/464112456/former-n-y-billionaire-mayor-bloomberg-eyeing-possible-white-house-bid"}
