{"authors":["Breitbart News"],"date_download":"2018-10-30 19:26:42","date_modify":"2018-10-30 19:26:42","date_publish":"2016-01-18 00:01:01","description":"Juanita Broaddrick says that within a few weeks after Clinton allegedly raped her, he started to call her repeatedly with the aim of meeting again.","filename":"data/vaneerConsumption/BillClintonCalledRepeatedlyAfterRape.json","image_url":"https://media.breitbart.com/media/2016/01/GettyImages-11404131.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_17__1540927602.html","title":"Bill Clinton Called Repeatedly After Rape","title_page":"Juanita Broaddrick: Bill Clinton Called Repeatedly After Rape","title_rss":"NULL","source_domain":"breitbart.com","text":"During a radio interview Sunday, Juanita Broaddrick revealed a shocking new detail about her history with Bill Clinton.\nShe says that within a few weeks after Clinton allegedly raped her, he started to call her repeatedly with the aim of meeting again.\n“I was shocked to say the least that he would have the audacity to call me after what he did to me,” Broaddrick said, speaking on “Aaron Klein Investigative Radio,” the popular Sunday night radio program.\nShe said that just a few weeks after the 1978 alleged sexual assault, “He called the nursing home that I owned and they patched the call through to my office and I didn’t know that it was him. And he immediately said, ‘Hi, this is Bill Clinton. I was just wondering when you were coming back to Little Rock again.’\n“This just caught me so off guard. I had not expected anything like this at all. And I told him I would not be coming back to Little Rock again and definitely would not ever be seeing him again. And I hung up.”\nBut that wasn’t the end of it. Broaddrick told Klein that Clinton, at the time the attorney general of Arkansas and candidate for governor, called the nursing home where she worked on numerous occasions throughout the next six months.\nAnd you would think that would have been the end of it. But it wasn’t. About two or three weeks later, I was in a meeting and my administrator came into the meeting and she said, “You are wanted on the phone.” And she said it was Mr. Clinton. And I told her, I said, “please tell him I’m not here.” She wasn’t aware of what had happened to me. Nor were the nurses. The two directors of nursings [sic] were the only two who had known what he had done to me. So she wasn’t aware, but she was very caught off guard why I wouldn’t speak to him. And I went into her office later and I said if there are ever any phone calls from him, I can’t explain but I do not want to have any phone calls from him. Whenever he calls please tell him that I’m not here. And then it happened a couple of more times. The board secretary answered the phone. And she said, “Mr. Clinton is on the phone.” And I just looked at her and I said please tell him that I’m not here. And I think there was probably a total of maybe four or five calls within a six-month period after the assault. And I think he finally figured out I wasn’t going to talk to him again.\nKlein asked Broaddrick what she thought Clinton wanted from her.\nBroaddrick replied: “I think he thought, well this is just a usual occurrence. I probably was with him and I am wondering whether I can get with this woman again. I was shocked to say the least that he would have the audacity to call me after what he did to me.”\nKlein revealed that he has separately heard similar stories off the air from two other Clinton sexual assault accusers, including one of the most famous of Clinton’s accusers. He said the accusers said they never made that part of the story public because they just didn’t focus on it.\nIn a follow-up conversation, Broaddrick told Klein, who doubles as Breitbart’s Jerusalem bureau chief, that she also didn’t think that part of the story was relevant.\nListen to Klein’s interview with Broaddrick:\nTwo weeks ago, Broaddrick tweeted about the alleged assault, generating a new flurry of news media activity.\nI was 35 years old when Bill Clinton, Ark. Attorney General raped me and Hillary tried to silence me. I am now 73….it never goes away. — Juanita Broaddrick (@atensnut) January 6, 2016\nThis after Hillary Clinton was repeatedly heckled about Broaddrick at a town hall event in Derry, New Hampshire by Katherine Prudhomme O’Brien, a GOP state representative from Rockingham.\nDonald Trump helped to skyrocket the issue of Clinton’s sex accusers to front-page status when the GOP frontrunner complained about the former president’s “terrible record of women abuse.” Trump was responding to Hillary’s claim that the billionaire exhibited a “penchant for sexism.”\nSpeaking for the first time in nearly a decade, Broaddrick broke her silence in November in an interview on Klein’s program.\nRape allegations. Bloody lip.\nBroaddrick’s story begins when she was a nursing home administrator volunteering for then-Arkansas attorney general Bill Clinton’s 1978 gubernatorial bid.\nShe told Klein in November that Clinton singled her out during a campaign stop at her nursing home. “He would just sort of insinuate, you know, when you are in Little Rock let’s get together. Let’s talk about the industry. Let’s talk about the needs of the nursing homes, and I was very excited about that.”\nBroaddrick said she finally took Clinton up on the offer in the spring of 1978 when she traveled to Little Rock for an industry convention along with her friend and nursing employee Norma Rogers. The two shared a room at the city’s Camelot Hotel.\nBroaddrick phoned Clinton’s campaign headquarters to inform him of her arrival and was told by a receptionist that Clinton had left instructions for her to reach him at his private apartment.\n“I called his apartment and he answered,” she recounted. “And he said, ‘Well, why don’t we meet in the Camelot Hotel coffee room and we can get together there and talk.’ And I said, ‘That would be fine.’”\nClinton then changed the meeting location from the hotel coffee shop to Broaddrick’s room.\n“Some time later, and I’m not sure how long it was, he called my room, which he said he would do when he got to the coffee shop. And he said, ‘There are too many people down here. It’s too crowded. There’s reporters and can we just meet in your room?’\n“And it sort of took me aback a little bit, Aaron,” she said of Clinton’s request.\n“But I did say, okay, I’ll order coffee to the room, which I did and that’s when things sort of got out of hand. And it was very unexpected. It was, you might even say, brutal. With the biting of my lip.”\nBroaddrick said she did not want to rehash the alleged rape, explaining that the painful details are fully available in previous news reports.\nShe told NBC’s Dateline in 1999 that she resisted when Clinton suddenly kissed her:\nThen he tries to kiss me again. And the second time he tries to kiss me he starts biting my lip. … He starts to, um, bite on my top lip and I tried to pull away from him. And then he forces me down on the bed. And I just was very frightened, and I tried to get away from him and I told him “No,” that I didn’t want this to happen, but he wouldn’t listen to me. … It was a real panicky, panicky situation. I was even to the point where I was getting very noisy, you know, yelling to “please stop.” And that’s when he pressed down on my right shoulder and he would bite my lip. … When everything was over with, he got up and straightened himself, and I was crying at the moment, and he walks to the door and calmly puts on his sunglasses. And before he goes out the door, he says, “You better get some ice on that.” And he turned and went out the door.\nIn the interview with Klein, Broaddrick recounted the aftermath of the incident, when her friend Rogers came back to the room after Broaddrick failed to show up at the convention.\n“I was in a state of shock afterwards,” an emotional Broaddrick said, clearly still impacted by the event. “And I know my nurse came back to the room to check on me because she hadn’t heard from me. … She came up and it was devastating to her and to me to find me in the condition that I was in.\n“We really did not know what to do. We sat and talked and she got ice for my mouth… It was four times the size that it should be. And she got ice for me and we decided then I just wanted to go home. I just wanted to get out of there, which we did.”\nThe detail about Clinton allegedly biting her lip is instructive. One woman who would later say she had a consensual affair with Clinton, former Miss America pageant winner Elizabeth Ward Gracen, also revealed that Clinton bit her lip when a tryst became rough.\nHillary encounter: ‘She knew!’\nBroaddrick initially said that she shouldered the blame since she allowed Clinton up to her room.\nThree weeks after the incident, Broaddrick says she was still in a state of shock and denial about what she said had transpired. She said she attended a private Clinton fundraiser at the home of a local dentist, where she had an encounter with the Clintons and was directly approached by Hillary.\nBroaddrick said a friend of hers who had driven the Clintons to the fundraiser from a local airport informed her that “the whole conversation was about you coming from the airport. Mostly from Mrs. Clinton.”\nShe recalled: “And so then about that time, I see them coming through the kitchen area. And some people there are pointing to me. He goes one direction and she comes directly to me. Then panic sort of starting to set in with me. And I thought, ‘Oh my God, what do I do now?’”\nBroaddrick told Klein that Hillary approached her “and said, ‘It’s so nice to meet you’ and all of the niceties she was trying to say at the time.\n“And said, ‘I just want you to know how much Bill and I appreciate the things you do for him.’ And I just stood there, Aaron. I was sort of you might say shell-shocked.\n“And she said, ‘Do you understand. Everything you do.’\n“She tried to take a hold of my hand and I left. I told the girls I can’t take this. I’m leaving. So I immediately left.”\nBroaddrick said that “what really went through my mind at that time is ‘She knows. She knew. She’s covering it up and she expects me to do the very same thing.’”\n‘I felt responsible until Bill came back’\nBroaddrick said the climate of women’s issues in 1978 was such that “I felt responsible. I don’t know if you know the mentality of women and men at that time. But me letting him come to my room? I accepted full blame.\n“And I thought, ‘This is your fault and you have to bear this. There’s nothing you can do. He’s the attorney general. And this is your fault.’”\nShe said all that changed in 1991, when she said she was at a meeting at the Riverfront Hotel in Little Rock and Clinton approached her there.\nClinton found out she was at the hotel “and they called me out of the meeting and pointed to an area to go down around the corner by an elevator area. And I walked around the corner and there he stands.\n“And he immediately comes over to me with this gushing apology. Like, ‘I’m so sorry for what happened. I hope you can forgive me. I’m a family man now. I have a daughter. I’m a changed man. I would never do anything like that again.’”\nBroaddrick said she thought Clinton was sincere until he announced his run for president the following week.\n“But still I have to thank him for that day, because the blame then went off of me and on to him. And I knew that it wasn’t my fault. I knew that I didn’t use good judgement, but I knew that the incident was no longer my fault.”","url":"https://www.breitbart.com/politics/2016/01/17/exclusive-juanita-broaddrick-says-bill-clinton-called-her-repeatedly-after-alleged-rape/"}
