{"authors":["Patrick Howley"],"date_download":"2018-10-30 21:39:13","date_modify":"2018-10-30 21:39:13","date_publish":"2015-09-29 13:29:44","description":"Emails obtained Citizens United show that Bill Clinton's underlings routinely conferred with Hillary Clinton's top aides about Bill's sked","filename":"data/vaneerConsumption/BillClintonAskedHillaryForPermissionToTakeMoneyLinkedToIranNorthKorea.json","image_url":"https://media.breitbart.com/media/2015/04/bill-and-hillary-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_09_29__1540935553.html","title":"Bill Clinton Asked Hillary For Permission To Take Money Linked To Iran, North Korea","title_page":"Bill Clinton Asked Hillary For Permission To Take Money Linked To Iran, North Korea | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Former President Bill Clinton asked his wife, then-Secretary of State Hillary Clinton, for permission to accept a paid speaking engagement involving North Korea. He also wanted to invite a suspected Iranian oil business partner to a Clinton event for money.\nThe North Korea-related request involved Hillary Clinton’s brother Tony Rodham, so Hillary’s top aide agreed to give it special consideration in a “secure” phone call “near a secure line.”\nEmails obtained by the group Citizens United show that Bill Clinton’s underlings at the Clinton Foundation routinely conferred with Hillary Clinton’s top aides in planning Bill’s high-dollar international speaking schedule.\n“Is it safe to assume USG would have concerns about WJC accepting the attached invitation related to North Korea?” Clinton Foundation director of foreign policy Amitabh Desai wrote to Mills on May 18, 2012 in an email with the subject line “RE: North Korea Invitation.”\n“Decline it,” Mills replied.\nBut Desai wrote back the next month to explain that the North Korea invitation “came from” Hillary’s own brother, Tony Rodham.\n“This came via Tony Rodham. So we would be grateful for any specific concerns that we could share, beyond just saying it would be concerning for USG. I’m at [redacted] if you are able to call. Tony is seeing WJC in a couple hours. Thanks and sorry to be a pain,” Desai wrote back on June 9.\nMills agreed to have a “secure” conversation about it, and told Desai that Bill’s “wife knows.”\n“If he needs more let him know his wife knows and I am happy to call him secure when he is near a secure line,” Mills wrote to Desai.\nRodham, a college dropout who allegedly failed to make child support payments, garnered scrutiny in 1999 for entering the hazelnut-growing business in the nation of Georgia with a rival of the Clinton White House’s ally in the country.\nThe Clinton Foundation also asked Hillary’s inner circle if it could squeeze money out of a suspected Iranian business partner in exchange for his invitation to a Clinton Global Initiative (CGI) event.\n“Petronas, the government owned Malaysian oil company, would like to send its CEO Shamsul Azhar bin Abbas to CGI as a paying member. For years they were shipping oil to Iran. Would the CEO attending CGI as a paying member be of concern for USG?,” Desai wrote to Cheryl Mills on August 9, 2012.\nMills seemed interested enough to try to challenge the “shipping oil to Iran” bit.\n“Can you check the facts – seems odd they would ship oil to Iran,” Mills replied. “Either way, is your point that they do business without a waiver?”","url":"https://www.breitbart.com/politics/2015/09/29/bill-clinton-asked-hillary-permission-take-money-linked-iran-north-korea/"}
