{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-23 02:19:01","date_modify":"2018-10-23 02:19:01","date_publish":"2017-03-10 11:17:26","description":"Billie Piper exuded confidence as she stepped out in style in London on Friday morning, looking radiant as she left the BBC studios after appearance on ex-husband Chris Evans' show.","filename":"data/vaneerConsumption/BilliePipergivesherflirtyfrockatomboyedge.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E223A4B00000578-0-image-a-26_1489144456176.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300832_Billie-Piper-gives-flirty-frock-tomboy-edge_1540261141.html","title":"Billie Piper gives her flirty frock a tomboy edge","title_page":"Billie Piper gives her flirty frock a tomboy edge | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's one of the frontrunners for the Best Actress role at the Olivier Awards.\nAnd Billie Piper exuded confidence as she stepped out in style in London on Friday morning, looking radiant as she left the BBC radio studios following an appearance on ex-husband Chris Evans' show.\nThe 34-year-old star looked incredible in a chic off-duty look, teaming a flirty and feminine frock with some tough, tomboy inspired accessories.\nScroll down for video\nRadio interview: Billie Piper exuded confidence as she stepped out in style in London on Friday morning, looking radiant as she left the BBC radio studios following an appearance on ex-husband Chris Evans' show\nBillie gave her white dress some serious edge thanks to a silver studded biker jacket.\nShe pulled the look together with a pair of chunky black heels, tying a matching sash around her waist.\nBillie looked a little windswept as she left the studios, her strawberry blonde hair blowing in the wind.\nBiker chic: The 34-year-old star looked incredible in a chic off-duty look, teaming a flirty and feminine frock with some tough, tomboy inspired accessories\nRock 'n' roll vibes: Billie gave her white dress some serious edge thanks to a silver studded biker jacket\nThe Penny Dreadful star will be heading to the Olivier Awards Nominees luncheon later in the day, where she is a frontrunner for the Best Actress prize for her role in Yerma.\nBillie has already for ES Theatre awards, Critics Choice and What’s On Stage awards for the Young Vic production.\nShe has bewitched audiences and critics alike with her stage performance in the theatre show, about a woman driven wild by the desire to have a baby.\nLooking good: She pulled the look together with a pair of chunky black heels, tying a matching sash around her waist\nFingers crossed: The Penny Dreadful star will be heading to the Olivier Awards Nominees luncheon, where she is a frontrunner for the Best Actress prize for her role in Yerma\nThe star is set to return to the West End this year with an extended stint in the acclaimed play.\nThe actress - who split from second husband Laurence Fox last year - and her ex Chris have remained on very good terms since their split, so it comes as no surprise she was a guest on his show.\nAn 18-year-old Billie married Chris - who is 16 years older than her - in 2001 following only six months of dating, but divorced in 2007.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300832/Billie-Piper-gives-flirty-frock-tomboy-edge.html"}
