{"authors":["James Tapsfield","Political Editor For Mailonline"],"date_download":"2018-10-23 04:06:42","date_modify":"2018-10-23 04:06:42","date_publish":"2017-03-10 14:07:13","description":"Problems with the overhaul of the 'Northern Estate' - a handful of buildings around the main Palace of Westminster - could derail the much bigger multi-billion pound restoration plan for parliament.","filename":"data/vaneerConsumption/BillforMPsofficerefurbsoarsby50percentto650m.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/123D7BD100000514-0-image-a-22_1489154789516.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301304_Bill-MPs-office-refurb-soars-50-cent-650m_1540267602.html","title":"Bill for MPs' office refurb soars by 50 per cent to £650m","title_page":"Bill for MPs' office refurb soars by 50 per cent to £650m | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The costs of a planned refurb MPs' offices has soared by more than 50 per cent to £650million and it is running years behind schedule.\nProblems with the overhaul of the 'Northern Estate' - a handful of buildings around the main Palace of Westminster - could also derail the much bigger multi-billion pound restoration plan for parliament.\nThe scale of the bill for the revamp has been revealed in tender documents issued by the House of Commons authorities.\nThe Norman Shaw, Derby Gate, 1 Parliament Street and Canon Row buildings are among those in need of major work after being left to deteriorate for four decades.\nThe parliamentary estate is said to be in desperate need of repair but the costs will run into billions of pounds and many MPs are unwilling to move out during work\nThe parliamentary authorities have issued photos of the dilapidated condition of the estate in an effort to demonstrate the need for an overhaul\nWhen the project was first mooted, it was expected to start in around 2016 and cost around £400million.\nHowever, the documents issue by the House now suggest it will begin in 2018-19, and put the value at £650million plus VAT.\nIt will not be completed until at least 2021-22, meaning the controversial £4billion Restoration and Renewal project for the wider parliamentary estate could not begin before 2023.\nThe apparent escalation in costs will also cause alarm amid fears the R&R scheme could suffer the same issues with disastrous financial consequences.\nThe 'scope and estimated costings' of the project on the Northern Estate - where around a thousand MPs and staff work - were discussed at a meeting of the ruling cross-party Commons Commission at the end of last month.\nAccording to the tender documents: 'The buildings require refurbishment due largely to the age and fragility of the buildings' mechanical and electrical services, poor environmental performance and fire safety improvement requirements,' the documents state.\n'The buildings are Grade 1, Grade 2 or Grade 2* listed, are situated within a Conservation Area and have not had any significant intervention in the past 40 years.\n'There is a responsibility to protect and preserve the heritage of these listed buildings and maintain their architectural and historical significance.'\nA House of Commons spokesman said: 'The cost estimates cover a range of values to cater for the potential range of outcomes for a listed buildings refurbishment programme of this scale.\n'The cost ranges will narrow as design detail is further developed and as such a budget has not yet been set.'\nWiring and utilities running through the fabric of the building are said to be a fire risk\nMany MPs would prefer to stay on the premises while work is carried out but a cross-party committee found that would be slower and more expensive\nThe details emerged amid a gathering row over the plans to restore the Palace of Westminster. Supporters are demanding a debate and vote in the Commons within weeks to avoid a 'catastrophic failure' in the fabric of the buildings.\nBut critics say the costs are unreasonable and many politicians are unwilling to abandon the historic chamber while work takes place.\nLabour MP Chris Bryan told MailOnline the restoration had to be given the go-ahead soon.\n'We cannot have the first 15 years after we leave the EU looking like we cannot even sort out our own accommodation,' he said.\nThe Commons spending watchdog today backed a plan for a 'full decant' of the building - home to the Houses of Parliament - with MPs and peers moving out for a period of around six years while the work is carried out at an estimated cost of £3.5 to £3.9 billion.\nIn a report, the Commons Public Accounts Committee (PAC) said the proposal put forward last year by a joint committee of MPs and peers represented the 'most economical, effective and efficient' option for restoring the palace to a proper state.\nAs a Unesco world heritage site, the committee stressed that ultimate responsibility for taking action lay with the Treasury while further 'delay and indecision' would simply add to the final cost.\n'This internationally-recognised building is in a state of extreme disrepair. The risk of a catastrophic failure is high and growing with every month that passes,' it said.\n'It must be repaired. For a world heritage site that is the home of the 'mother of parliaments', doing nothing is not an option.\n'The best value for money will be achieved by getting on with it. The Government should not delay any further in putting the proposal for a decision in principle before both Houses.'\nHowever, the position is complicated by the decision of another committee of MPs - the Commons Treasury Committee - to conduct its own inquiry into the renovation plan.\nLaunching the inquiry in January, the committee chairman Andrew Tyrie said the original joint committee proposal and the consultants' report on which it was based did not provide sufficient evidence to make even a 'preliminary decision' on the way forward.\nBut with the Treasury Committee yet to begin hearings on the issue, PAC chairman Meg Hillier warned they could not afford further hold-ups.\n'Delaying a decision on how that work should be carried out will only add to the costs and risks,' she said.\n'The longer the House of Commons spends mulling new or alternative options, the greater the chance that public money is wasted.'","url":"https://www.dailymail.co.uk/news/article-4301304/Bill-MPs-office-refurb-soars-50-cent-650m.html"}
