{"authors":[],"date_download":"2018-10-22 22:53:22","date_modify":"2018-10-22 22:53:22","date_publish":"2014-06-11 11:54:56","description":"Police and prosecutors have been after Yoo Byung-eu for weeks and are offering a $500,000 reward for tips about him.","filename":"data/vaneerConsumption/BillionairesCultCompoundStormedinSouthKoreaFerryCase.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/501421/140611-south-korea-ferry-mn-740_66d788f6c7bb8e3043b59c0e936efc74.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_south-korea-ferry-disaster_billionaires-cult-compound-stormed-south-korea-ferry-case-n128206_1540248802.html","title":"Billionaire's 'Cult' Compound Stormed in South Korea Ferry Case","title_page":"Billionaire's 'Cult' Compound Stormed in South Korea Ferry Case","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSEOUL, South Korea -- Thousands of South Korean police officers stormed a sprawling church compound Wednesday in their hunt for a fugitive billionaire businessman over April's ferry sinking that left more than 300 people dead or missing, officials said.\nAuthorities believe the businessman, Yoo Byung-eun, owns the ship and that his alleged corruption may have contributed to the sinking. Police and prosecutors have been after Yoo for weeks and are offering a $500,000 reward for tips about him.\nSign up for breaking news alerts from NBC News\nYoo, 73, is a member of a group called the Evangelical Baptist Church, which critics say is a cult.\nAbout 5,000 police officers, some wearing helmets and armed with plastic shields, raided the group's compound in Anseong, just south of Seoul, officers said on condition of anonymity, citing department policy.\nFour church members were detained for allegedly providing shelter to Yoo or helping him flee, police said. Another church member was detained for allegedly trying to obstruct the raid.\nIt was not clear whether Yoo was at the compound at the time of the raid. Police said they were still trying to find and detain more church members for allegedly aiding Yoo.\nThe compound, the size of about 30 soccer fields, is considered the church's headquarters and thousands of church members gather there for services on weekends.\nYoo, head of the now-defunct predecessor of the ferry's current operator, Chonghaejin, allegedly still controls the company through a complex web of holding companies in which his children and close associates are large shareholders.\nYoo's church made headlines in 1987 when 32 people, who critics suspect were church members, were found dead in the attic of a factory near Seoul in what authorities said was a collective murder-suicide pact. The church has denied involvement.\nYoo was investigated over the deaths after a probe into the dead people's financial transactions showed some of their money was funneled to him. He was cleared of suspicions that he was behind the suicides because of a lack of evidence, but was convicted on a separate fraud charge.\nThe sinking, one of South Korea's deadliest disasters in decades, has caused an outpouring of national grief. Nearly two months after the sinking, 292 bodies have been recovered — mostly students from a high school near Seoul — and 12 people are still missing.","url":"https://www.nbcnews.com/storyline/south-korea-ferry-disaster/billionaires-cult-compound-stormed-south-korea-ferry-case-n128206"}
