{"authors":["Kipp Jones"],"date_download":"2018-10-30 19:21:21","date_modify":"2018-10-30 19:21:21","date_publish":"2015-10-22 15:20:26","description":"Comedian Bill Cosby is now being used as a pawn in a political attack ad in Pennsylvania.","filename":"data/vaneerConsumption/BillCosbyUsedinPoliticalAttackAd.json","image_url":"https://media.breitbart.com/media/2015/10/cosby-sees-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_10_22__1540927281.html","title":"Bill Cosby Used in Political Attack Ad","title_page":"Bill Cosby Used in Political Attack Ad | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Comedian Bill Cosby is now being used as a pawn in a political attack ad in Pennsylvania.\nCosby, a Philadelphia native, has faced a long series of allegations he drugged and/or sexually assaulted dozens of women over the course of his decades-long career.\nThe comedian faced similar allegations in 2005, and testified during a deposition in Philadelphia, related to a civil suit brought by former Temple University basketball coach Andrea Constand.\nWith the Montgomery County, PA district attorney’s race heating up, Democrat Kevin Steele has began airing TV ads attacking former Republican D.A. Bruce Castor for failing to charge the comedian with sexual assault in 2005-2006.\nCastor previously served in the office from 2000-2008.\n“Kevin Steele, first assistant D.A. with a 98 percent conviction rate, and tough sentences for sexual predators, or Bruce Castor, a former D.A. who refused to prosecute Bill Cosby,” a voiceover artist says in the attack ad, which first aired Tuesday, TheWrap reports.\nThe add, which is titled “Tough,” also notes, ”Bruce Castor is not looking out for the victims,” and the former D.A. “didn’t even try” to charge Cosby.\nAccording to philly.com, Castor said in 2005 that the case against Cosby was “weak,” due to a lack of physical evidence and Constand’s delay in reporting the alleged assault.\nThe site also reports Castor now believes the comedian was being “deceptive” and he thought the former basketball coach would have more success in her civil case, which was later settled for an undisclosed sum.\nWatch the ad below:\nCastor responded to the ad on Facebook on Oct. 20, where he questioned his opponent’s judgement.\n“Hard to imagine Mr. Steele could have ever thought this attack would turn out to be a good political move for him. One really has to question the man’s judgement. Probably best to have good judgment when you hope to be District Attorney or, for example, Attorney General,” wrote Castor.\nCastor also said additional evidence came to light years after he left the office, writing, “though Mr. Steele was and is still empowered to arrest and prosecute Cosby.”\n“Why has he not done so, if there is all this new evidence? How was I to look YEARS into the future and divine the uncovering of additional evidence?” he asked.","url":"https://www.breitbart.com/entertainment/2015/10/22/bill-cosby-used-in-political-ad/"}
