{"authors":["Christine Rendon For Dailymail.Com"],"date_download":"2018-10-23 03:36:41","date_modify":"2018-10-23 03:36:41","date_publish":"2017-03-16 14:32:51","description":"The 61-year-old had an interview with Vulture when the topic of Lindsay was broached. Bill's upcoming live action version of Beauty And The Beast will be released in theaters on Friday.","filename":"data/vaneerConsumption/BillCondonrespondstoLindsayLohanspitch.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54CB9600000578-0-image-a-20_1489674697809.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320348_Bill-Condon-responds-Lindsay-Lohan-s-pitch_1540265801.html","title":"Bill Condon responds to Lindsay Lohan's pitch","title_page":"Bill Condon responds to Lindsay Lohan's pitch | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He was Lindsay Lohan's first choice for director when she expressed her desire to star in The Little Mermaid last month.\nAnd now Beauty And The Beast director Bill Condon has responded to Lindsay's request in a new interview with Vulture.\n'It was sweet, it was very sweet of her,' Bill, 61, said when the topic came up. 'I hope she gets to make that movie. [Laughs.] I feel like I was so lucky in getting this crown jewel, but I'll go see her in Little Mermaid, absolutely.'\n'I hope she gets to make that movie': Beauty And The Beast director Bill Condon has responded to Lindsay Lohan's request to be directed by him in a new interview with Vulture\nIn February, Lindsay shared a side-by-side Instagram photo of herself alongside the animated character Ariel when she made her desire to star in the film known.\n'I will sing again, as #ariel #thelittlemermaid,' she began.\nShe then pitched her sister Ali and Bill, and fitness expert Kristen Graham as Ursula.\n'@disney approve that #billcondon directs it along with my sister @alianamusic singing the theme song for the soundtrack. also @kgrahamsfb plays Ursula. Simply because, she is the best. ake one. @disneystudios' she wrote.\n'I will sing again': In February, Lindsay shared a side-by-side Instagram photo of herself alongside the animated character Ariel when she made her desire to star in the film known\nThe photo's caption appears to have been edited as it now simply reads, '#thelittlemermaid.'\nLast August, Deadline announced that Hamilton creator Lin-Manuel Miranda and Disney vet Alan Menken will be co-writing the score for the film.\nThe new movie, which is still in the working stages, will combine original songs from the 1989 feature and new material.\nPutting in the leg work! Lohan also pitched her sister Ali and fitness expert Kristen Graham as Ursula for The Little Mermaid (pictured in February in New York)\nThe film does not yet have a release date.\nMeanwhile, Bill's upcoming live action version of Beauty And The Beast will be released in theaters on Friday.\nIt stars Emma Watson as Belle, Dan Stevens as Beast, and Luke Evans as Gaston.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320348/Bill-Condon-responds-Lindsay-Lohan-s-pitch.html"}
