{"authors":["Snejana Farberov For Dailymail.Com"],"date_download":"2018-10-23 02:39:39","date_modify":"2018-10-23 02:39:39","date_publish":"2017-04-26 13:51:11","description":"Evin Cosby, 40, writes in an opinion piece for the National Newspaper Publishers Association that her father, 79, has been unfairly portrayed in media coverage as a rapist without any proof.","filename":"data/vaneerConsumption/BillCosbysdaughterEvinsaysdadisntarapist.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA0661000000578-0-image-a-29_1493221924366.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447712_Daughter-Bill-Cosby-not-abusive-violent-rapist_1540262379.html","title":"Bill Cosby's daughter Evin says dad isn't a rapist","title_page":"Bill Cosby's daughter Evin says dad isn't a rapist | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bill Cosby's youngest daughter has spoken out in defense of the embattled comedian ahead of his looming sexual assault trial, insisting that the 79-year-old has been wrongly maligned.\nEvin Cosby, 40, writes in an opinion piece for the National Newspaper Publishers Association published Wednesday and posted on Bill Cosby's official Facebook page that her father 'is not abusive, violent or a rapist.'\nThe single mother-of-two says the beleaguered star of The Cosby Show 'loves and respects women.'\nThe publication of Evin's opinion piece coincided with the release of Bill Cosby's first interview in two years, which also appeared on National Newspaper Publishers Association's Newswire, revealing that the actor has lost his sight but still hopes to perform on stage again.\nDefending dad: Evin Cosby, 40 (right), Bill Cosby's youngest daughter, has spoken out in defense of the embattled comedian ahead of his upcoming sexual assault trial\nBill Cosby and criminal defense attorney Brian McMonagle return to court for a pre-trial hearing at Montgomery County Courthouse on April 3, 2017\nIn her lengthy statement, Evin acknowledges that her 79-year-old father had affairs in the course of his decades-long career in show business, but says he and her mother Camille 'have worked through it and moved on.'\nBill Cosby is charged with drugging and molesting Andrea Constand, a former Temple University employee, in 2004. He has pleaded not guilty and remains free on $1million bail.\nDozens of other women have also made similar accusations against Cosby, who has vehemently maintained his innocence.\nJury selection in Cosby's high-profile case is set to get underway May 22 in Pittsburgh, but the trial will be held across the state in suburban Philadelphia, with opening statements to start June 5.\nEvin Cosby, the youngest of Bill and Camille's four surviving children, writes that the accusations are 'harsh and hurtful' and have been 'carelessly repeated as truth.'\nIn her nearly 900-word piece, Evin hits at what she calls 'the public persecution' of her father and 'the cruelty of the media.'\nHappy family: Evin (center) writes that her mother Camille and dad Bill have worked out their marital problems concerning his infidelities and have 'moved on'\nPower couple: Bill and Camille have been together since 1963 and had five children, with Evin being the youngest\nFULL STATEMENT FROM EVIN COSBY DEFENDING HER FATHER Evin Cosby (right) is pictured alongside her mother, Camille, at the launch of her clothing store in New York City in August 2008 'I am the youngest of 5. I remember our family trips and moving to NYC just so we could be closer to my father as he worked. From the times he worked in Las Vegas to the Cosby show in NYC, he always wanted us to be close, to be a part of his whole life, at home and on stage. I felt loved and remembered loving the moments that my parents shared with us by exposing us to all types of people from all walks of life. We grew up appreciating my father's success because we knew the prejudice and racism he endured getting to where he got and how hard he worked for our family. Because I loved my childhood, I couldn't wait to have a family of my own. 'I have two amazing children who love their grandfather. I already work hard as a single mother, with no full time help, and with a career in fashion design, I am lucky that I have supportive friends that I call family because my children and I need that support. The public persecution of my dad, my kids' grandfather, and the cruelty of the media and those who speak out branding my father a \"rapist\" without ever knowing the truth and who shame our family and our friends for defending my dad, makes all of this so much worse for my family and my children. When people are so quick to cast hate and make accusations of horrific violence against my dad, they are callous in their carelessness about the harm they are causing to others. 'I thought when my brother Ennis was murdered, that was the worst nightmare of all time. It's so hurtful to this day. I try to block out the day he was killed, but that pain has only worsened in these last years. For some reason, my family's pain has been a trigger for people to seize upon us harder. 'On the same day that Ennis was murdered, a woman came out claiming that my father had a \"love child.\" She was arrested for extortion. She was not my father's daughter. 'On the day I gave birth to my son, another women came out, but that case was dismissed too - the district attorney investigated her claims also and didn't press charges. 'Two years ago, and over ten years later, several women came out. Like the woman from 2005, they claimed to have been raped and drugged. But, like the one from 2005, their stories didn't match up. But instead of going through the criminal justice system, these stories never got investigated and just got repeated. They have been accepted as the truth. 'My dad tried to defend himself. His lawyers tried to defend him, but they all got sued. People were constantly reaching out to me about why doesn't your dad say something. I kept saying he's trying, but the media is only interested in the stories of the women. Friends of ours tried to help, but the media wouldn't print what they said or knew. Our friends that spoke up were pressured to shut up. No one wanted to print their supportive words. We live in a scandalous country where the more sexualized and provocative the story, the more attention it gets. 'We get all sorts of mixed up messages in our society. We are told that we have fundamental rights to be innocent until proven guilty. But, if enough people think you are a bad person, you are branded a bad person and the media just reinforces that. My dad, like anyone in this country, deserves to be treated fairly under the law. 'My dad broke barriers and raised the conscious of America on important topics, especially for the advancement of women. On the Cosby show he only depicted women as smart and accomplished. On the Cosby Show and on a Different World he took on then taboo subjects like menstrual cycles and rape, and even did a show on Aids before anyone else would bring it up. 'I am his 4th daughter. He raised me to go to college, start my own business, and be my own woman. He is helping me raise my children and teach them family values. I know that my father loves me, loves my sisters and my mother. He loves and respects women. He is not abusive, violent or a rapist. Sure, like many celebrities tempted by opportunity, he had his affairs, but that was between him and my mother. They have worked through it and moved on, and I am glad they did for them and for our family. 'The harsh and hurtful accusations of things that supposedly happened 40 or 50 years ago, before I was born, in another lifetime, and that have been carelessly repeated as truth without allowing my dad to defend himself and without requiring proof, has punished not just my dad but every one of us. They have punished the talented people who were still earning money and feeding their families from my dad's shows and work. I am pleased that finally we are seeing the whole picture and seeing cases and claims dismissed from court. I just hope that those who pre-judged my dad are now willing to admit that they were wrong.'\nThe mother-of-two fashion designer writes that her family and friends who have come to her father’s defense have been shamed by those who chose to brand Cosby '”a rapist” without ever knowing the truth.’\nShe then adds, ‘When people are so quick to cast hate and make accusations of horrific violence against my dad, they are callous in their carelessness about the harm they are causing to others.’\nEvin goes on to make a case that her father has been unfairly tried and convicted in the court of public opinion, having been denied a chance to tell his side of the story because 'the media is only interested in the stories of the women,' she said.\nEvin wrote of her father's infidelities: 'Sure, like many celebrities tempted by opportunity, he had his affairs, but that was between him and my mother' (Bill and Camille are seen above in 1982)\n‘My dad, like anyone in this country, deserves to be treated fairly under the law.’\nAfter listing Cosby's accomplishments as a trailblazing African-American entertainer, Evin directly addressed the ‘harsh and hurtful accusations’ against him, which she dismissed while praising Cosby as a loving, albeit fallible, husband and father.\n‘I am his 4th daughter. He raised me to go to college, start my own business, and be my own woman,’ she writes. ‘He is helping me raise my children and teach them family values. I know that my father loves me, loves my sisters and my mother.\n‘He loves and respects women. He is not abusive, violent or a rapist. Sure, like many celebrities tempted by opportunity, he had his affairs, but that was between him and my mother. They have worked through it and moved on, and I am glad they did for them and for our family.’\nThis marks the second time that Evin has publicly defended her father.\nIn December 2014, she issued a statement apparently drawing a comparison between her real-life dad and the beloved father character he played on The Cosby Show.\nCosby is charged with drugging and molesting Andrea Constand, a former Temple University employee, in 2004\n‘He is the FATHER you thought you knew. The Cosby Show was my today's tv reality show. Thank you. That's all I would like to say :),’ read Evin's statement to Access Hollywood at the time.\nCosby's wife of more than 50 years, Camille Cosby, also has staunchly stood by Bill, repeatedly condemning the way he has been portrayed in media coverage.\nThe publication of Evin's opinion piece coincided with the release of Bill Cosby's first interview in two years, in which the comedian revealed to NNPA Newswire that he has lost his sight but still hopes for a career reboot.\n'I miss it all and I hope that day will come,’ he said of his comeback. ‘I have some routines and storytelling that i am working on.'\nHe added, ‘I think about walking out on stage somewhere in the United States of America and sitting down in a chair and giving the performance that will be the beginning of the next chapter of my career.’","url":"https://www.dailymail.co.uk/news/article-4447712/Daughter-Bill-Cosby-not-abusive-violent-rapist.html"}
