{"authors":["Nikki Schwab","U.S. Political Reporter For Dailymail.Com"],"date_download":"2018-10-22 22:15:17","date_modify":"2018-10-22 22:15:17","date_publish":"2017-03-10 00:24:21","description":"Former President Bill Clinton made his first public address since his wife Hillary's November defeat.","filename":"data/vaneerConsumption/BillClintonmakesfirstmajorspeechsincewifesdefeat.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1E118300000578-0-image-a-40_1489105360486.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299438_Bill-Clinton-makes-major-speech-wife-s-defeat_1540246517.html","title":"Bill Clinton makes first major speech since wife's defeat","title_page":"Bill Clinton makes first major speech since wife's defeat | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Former President Bill Clinton made his first public address since his wife Hillary's November defeat.\nIn a coded speech, where he never once mentioned President Trump by name, the ex-POTUS suggested what Trump and like-minded politicians are selling isn't nationalism, but something even more sinister.\n'People who claim to want the nation-state are actually trying to have a pan-national movement to institutionalize separatism and division within borders all over the world,' said Clinton, according to Politico.\nScroll down for video\nEx-President Bill Clinton made his first public address today since his wife Hillary Clinton's loss in the 2016 presidential election\nBill Clinton addressed people at the Brookings Institution, a left-of-center think tank in Washington, D.C., at an event honoring the late Israeli Prime Minister Yitzhak Rabin\n'It's like we're all having an identity crisis at once – and it is an inevitable consequence of the economic and social changes that have occurred at an increasingly rapid pace,' Clinton added.\nClinton made his remarks at the Brookings Institution, a left-of-center think tank in Washington, D.C., as part of an event honoring the late Israeli Prime Minister Yitzhak Rabin.\nRabin was assassinated in 1995 by a Jewish Israeli who was against making peace with the Palestinians.\nClinton called the day of the assassination his worst day in office.\n'I remain convinced that has he lived we would have achieved a comprehensive agreement with the Palestinians by 1998 and we'd be living in a different world today,' the former president said.\nFeeling inspired by his old friend, Clinton said, 'We have to find a way to bring simple, personal decency and trust back to our politics.'\nThroughout the speech, he repeatedly warned against the 'us versus them' mentality that has engulfed not only American politics, but led to Brexit in Britain, and the rise of Trump-like candidacies in places like the Philippines and France.\n'The whole history of humankind is basically the definition of who is us and who is them, and the question of whether we should all live under the same set of rules,' Clinton said.\nThe former president suggested that leaders and voters try to look to Rabin as a model, despite being 'programmed biologically, instinctively, to prefer win-lose situations, us versus them,' he said, using the term again.\n'This is a very old story. It's as old as the Holy Land, and much older,' Clinton said of 'us versus them.' 'Ever since the first people stood up on the East African savannah, ever since the first families and clans, ever since people encountered each other.'\n'It is a very old story,' he said. 'And it always comes down to two things – are we going to live in an us-and-them world, or a world that we can live in together?' Clinton mused.","url":"https://www.dailymail.co.uk/news/article-4299438/Bill-Clinton-makes-major-speech-wife-s-defeat.html"}
