{"authors":["Pam Key"],"date_download":"2018-10-30 20:27:23","date_modify":"2018-10-30 20:27:23","date_publish":"2016-12-19 20:33:27","description":"In an interview with ATTN:, the HBO host of \"Real Time with Bill Maher,\" comedian Bill Maher said that the FBI and Russia were “both working to elect | Video","filename":"data/vaneerConsumption/BillMaherFBIRussiaWereBothWorkingtoElectDonaldTrump.json","image_url":"https://media.breitbart.com/media/2016/12/Bill-Maher.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2016_12_19__1540931243.html","title":"Bill Maher: FBI, Russia Were 'Both Working to Elect Donald Trump'","title_page":"Bill Maher: FBI, Russia Were 'Both Working to Elect Donald Trump' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"[Adult language warning]\nIn an interview with ATTN:, the HBO host of “Real Time with Bill Maher,” comedian Bill Maher said that the FBI and Russia were “both working to elect Donald Trump.”\nMaher said, “I mean if you ask me what I’m most scared about I would say the Russia thing. Again I said I went a little nuts before the election. I was screaming about this is a slow moving coup. When there are factions in the government like the FBI who are dead set against one candidate and they are actively working with apparently Putin — somehow Comey and Putin are on side— shouldn’t Comey the FBI, shouldn’t he be checking Putin instead of, they are both working to elect Donald Trump?”\nWhen asked if Russian interference changed the result of the election Maher continued, “I do because he won by such slim margins in a few states.”\nHe added, “I mean the Russia issue to me is the one that is going to show where the Republican Party is. Whether Paul Ryan and Mitch McConnell are willing to be patriots ahead of Republicans. I mean this is a foreign country — this is so beyond politics— that attacked us. Yes it’s a cyber attack but that is the world we live in now. If you can’t get behind opposing that you are not a patriot and you are certainly not a good American.”\nFollow Pam Key on Twitter @pamkeyNEN","url":"https://www.breitbart.com/video/2016/12/19/bill-maher-fbi-russia-were-both-working-to-elect-donald-trump/"}
