{"authors":["Jen Lawrence"],"date_download":"2018-10-30 21:47:17","date_modify":"2018-10-30 21:47:17","date_publish":"2016-06-06 17:19:53","description":"At a campaign event in East Los Angeles, Bill Clinton's speech was interrupted by a screaming group of Bernie Sanders' supporters.","filename":"data/vaneerConsumption/BillClintonHeckledInterruptedinLA.json","image_url":"https://media.breitbart.com/media/2016/06/bill-clinton-vid-facebook-Ed-HilleThe-Philadelphia-InquirerAP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_06_06__1540936037.html","title":"Bill Clinton Heckled, Interrupted in L.A.","title_page":"Bill Clinton Heckled, Interrupted in L.A.","title_rss":"NULL","source_domain":"breitbart.com","text":"Sunday at a campaign event in East Los Angeles former President Bill Clinton’s speech was interrupted by a screaming group of Bernie Sanders supporters. Once Clinton regained control of the room, according to Fox News’s Fin Gomez, Clinton responded, “If I were them, I’d be screaming too because they know they will be toast by election day.”\n.@billclinton to @BernieSanders hecklers: \"I'd be screaming too..bc they know they will be toast by election day.\" pic.twitter.com/odtaPYTUg1 — Fin Gomez (@finnygo) June 5, 2016\nBill Clinton’s wife, former Secretary of State Hillary Clinton, has been locked in a bitter battle for the all-important win in the California Primary on Tuesday.\nAt another campaign event for Hillary Clinton over the weekend, New Jersey Senator Cory Booker also took a shot across the bow at Sanders, when he said to a group of LBGTQ activists that “Bernie’s people will be shut down.” He went on to say, “We can’t let them [Bernie Sanders’ supporters] win CA because of optics. Hillary needs to have more delegates, more super delegates and more votes for optics.”\nAlthough Sanders has gained some very important ground in California, the narrative coming out of the left is that Hillary Clinton has all but sown up the nomination and now it’s time for Sanders supporters to get behind her. However, many in the Sanders camp are rejecting this notion and promising to fight until the convention. The outcome of the Tuesday primary election in California could determine the rest of the Democrat race for president. No matter the outcome, one thing that is for sure is that Sanders supporters are not warming to the idea of Clinton. Many are going as far as to say they will never vote for Hillary. From their perspective, the nomination has been stolen from Sanders by the Clinton machine.","url":"https://www.breitbart.com/politics/2016/06/06/bill-clinton-heckled-interrupted-in-l-a/"}
