{"authors":["Joshua Haigh For Mailonline"],"date_download":"2018-10-22 22:05:38","date_modify":"2018-10-22 22:05:38","date_publish":"2017-03-16 02:33:22","description":"The family's celebrations have been tragically cut short after news that their beloved great Grandmother, Margot, has passed away aged 90 on Wednesday.","filename":"data/vaneerConsumption/BillieFaiersheartbrokenashergreatGrandmotherdies.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/02/3E505CA800000578-0-image-a-35_1489631505231.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318580_Billie-Faiers-heartbroken-great-Grandmother-dies_1540245938.html","title":"Billie Faiers heartbroken as her great Grandmother dies","title_page":"Billie Faiers heartbroken as her great Grandmother dies | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sam and Billie Faiers have been left devastated following the death of their great grandmother.\nFormer Towie star Billie has been on top of the world this week after giving birth to her second child just a few days ago.\nBut the family's celebrations have been tragically cut short after news that their beloved great Grandmother, Margot, has passed away aged 90 on Wednesday.\nScroll down for video\nHeartbreaking: Sam and Billie Faiers' great Grandmother has tragically passed away just days after the TOWIE star gave birth\nA spokesperson for the family confirmed the tragic news to Now Magazine in a short statement.\n‘We can confirm that Samantha’s great Grandmother passed away this morning, we ask that Samantha and her family are given privacy at this very sad time.’\nBoth of the reality stars were close with their great nan up and fans will recognise her from occasional family snaps that were shared on the sisters' Instagram feeds.\nBack in 2014, Billie shared an adorable snapshot of the first time her great Grandmother got to hold her granddaughter Nellie in her arms for the first time.\nHands on: Billie's great Grandmother regularly doted on her adorable granddaughter, Nellie, and the TOWIE star shared a snap of them together back in 2014\nTough: The well-known TOWIE stunners were both incredibly closer with their great Nan, so they're taking their loss hard\nAt the time, the gorgeous reality star captioned the sweet post: ‘Awwww nelly and her great great nanny…. #family #love’.\nThe family have yet to speak out about their grief, but a source told OK Magazine that they are hoping for privacy during this tough time.\nIt's a bittersweet week for the family, who welcomed their latest addition just a week ago.\nBillie took to Instagram last week to reveal she had given birth to her second child with fiancé Greg Shepherd, adding to their brood with their three-year-old daughter.\nPosting a picture of her partner carrying a baby seat, she wrote the caption: 'Welcome to the world our beautiful baby boy we love you more then words can describe , you are truly perfect in every way ... 07/03/17'.\nClearly bursting with pride, she could not resist heading straight to the photosharing site to announce to her 1.3million followers that she was a mother once more.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318580/Billie-Faiers-heartbroken-great-Grandmother-dies.html"}
