{"authors":["Kipp Jones"],"date_download":"2018-10-30 19:19:15","date_modify":"2018-10-30 19:19:15","date_publish":"2015-05-02 19:56:44","description":"The list of women accusing Bill Cosby of rape is growing. Now, an actress he worked with on The Cosby Show is added to that list.","filename":"data/vaneerConsumption/BillCosbyAccusedofRapingFormerCosbyShowActressFourOthers.json","image_url":"https://media.breitbart.com/media/2015/01/cosby-standup-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_05_02__1540927155.html","title":"Bill Cosby Accused of Raping Former 'Cosby Show' Actress, Four Others","title_page":"Bill Cosby Accused of Raping Former 'Cosby Show' Actress, Four Others | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"More than six months after comedian Bill Cosby was first accused of being a serial rapist, his list of accusers continues to grow and now includes an actress he worked with on The Cosby Show.\nMore than 40 women have now come forward with varying accusations about the once-squeaky clean family icon, but they all have one thing in common: they alleged that he either drugged them, raped them, or both.\nDuring a press conference Friday in New York with attorney Gloria Allred, former Cosby actress Lili Bernard and writer Sammie Mays lodged allegations against the comedian, just one day after the conclusion of his national comedy tour, according to TheWrap.\nBernard appeared in an episode of the final season of The Cosby Show, and alleges after he drugged and raped her in 1992, she received death threats from him while she was preparing for a role.\n“After he had won my complete trust and adoration he drugged me and raped me,” Bernard reportedly said in her statement.\nAfter the assault, she says the last time she saw Cosby, he told her, “As far as I’m concerned, Bernard, you’re dead. Do you hear me? You’re dead, Bernard. You don’t exist, I never wanna see your face again. Now get the hell out of here!”\n“I interpreted that as a death threat and feared for my life,” Bernard said.\nShe now says the event left her feeling suicidal for months and that she continues to suffer from panic attacks and night terrors “as a result of what Mr. Cosby did to me.”\nTheWrap reports Mays then detailed an alleged encounter that she says occurred after she met Cosby while she was working as a writer in New Orleans, LA, covering the NATPE convention in the mid-1980s.\nAccording to Mays, she asked Cosby for an interview and invited him to walk with her from the convention center across the street to his hotel.\nInside his hotel room, she claims he mixed her a drink. After only two swigs, she asserted, “The next thing I remember when I awoke, from my state of unconsciousness I seemed to have been drooling, and was sloppily slouched in the chair with barely the edge of my bottom in it.”\nMays said she awoke to find her shirt and bra undone and her breasts exposed. She also says her belt had been “unhooked and re-hooked, left loose around my hips.”\nBernard and Mays join roughly 40 other women who have made similar accusations against Cosby, including three new accusers, who came forward a week ago with similar stories.\nWatch Bernard’s Cosby Show acting reel below, which begins with a scene alongside Cosby:","url":"https://www.breitbart.com/entertainment/2015/05/02/bill-cosby-now-accused-of-raping-former-cosby-show-actress-4-other-women/"}
