{"authors":["Press Association"],"date_download":"2018-10-23 00:52:22","date_modify":"2018-10-23 00:52:22","date_publish":"2017-03-16 10:23:25","description":"England are hoping to complete a second successive Six Nations Grand Slam in Dublin.","filename":"data/vaneerConsumption/BillyVunipolaandAnthonyWatsonrecalledbyEnglandtofaceIreland.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/21/wire-230785-1489699992-220_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4319558_Billy-Vunipola-Anthony-Watson-recalled-England-face-Ireland_1540255942.html","title":"Billy Vunipola and Anthony Watson recalled by England to face Ireland","title_page":"Billy Vunipola and Anthony Watson recalled by England to face Ireland | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Billy Vunipola and Anthony Watson will start England’s attempt at securing back-to-back Grand Slams when they face Ireland in Dublin on Saturday.\nVunipola replaces Nathan Hughes at number eight and Watson is recalled at the expense of Jack Nowell on the right wing in a straight swap between starting XV and bench.\nElliot Daly continues in the number 11 jersey after passing the return to play protocols for suspected concussion sustained in the 61-21 demolition of Scotland last Saturday.\nBREAKING | Your England team to face Ireland in Dublin on Saturday 🌹\nPREVIEW ➡️ https://t.co/R8Ug7lAnw7#IREvENG #CarryThemHome pic.twitter.com/jAH7E1DS77 — England Rugby (@EnglandRugby) March 16, 2017\nEngland retained their RBS 6 Nations title by routing the Scots at Twickenham, equalling New Zealand’s record of 18 successive Test victories in the process, but have still made the two changes against Joe Schmidt’s men.\nVunipola and Watson made try-scoring returns last weekend in their first appearances of the championship, the Saracens back row driving over from close range in the third quarter and the latter picking a superb line to finish a thrilling team move.\nBilly Vunipola will start at number eight\nTheir elevation off the bench sees England travel to the Aviva Stadium with their strongest possible starting XV, with only long-term injuries Chris Robshaw and George Kruis absent.\nJones said: “We’ve had a really good week’s preparation. The intensity of training has been good. It’s going to be quite an occasion in Dublin so we understand we have to be prepared emotionally, physically and mentally.\n“The mood in camp has been positive. We’re very excited ahead of what is a huge opportunity for the players. You sense the intensity has stepped up - it definitely has in training.”\nThe build up to the climax to the 2017 Six Nations has seen reports emerge of an approach made by England to world champions New Zealand with the aim of arranging a fixture this autumn.\nIt was would be a seismic showdown between the world’s top two teams, but Jones refuses to look beyond an Ireland side who have fallen far short of expectations this year.\n“The message to the players has been quite simple – we’re playing Ireland on Saturday and that is the only thing that counts,” the Australian said.\n“We are focusing on preparing well, the only thing we can control is our preparation. Ireland not having anything to play for means they have the courage to fail which frees them up mentally.\n“We are a little bit vulnerable because we have already been crowned champions and we had a big win against Scotland, so for us it’s about getting the right mind-set for the game.”","url":"https://www.dailymail.co.uk/wires/pa/article-4319558/Billy-Vunipola-Anthony-Watson-recalled-England-face-Ireland.html"}
