{"authors":["Rachel Eddie","Lucy Mae Beers For Daily Mail Australia"],"date_download":"2018-10-22 23:32:38","date_modify":"2018-10-22 23:32:38","date_publish":"2017-03-10 03:25:47","description":"High-profile friends are responding to the sudden death of controversial cartoonist Bill Leak, who suffered a heart attack and died on Friday.","filename":"data/vaneerConsumption/BillLeakdeathleadstoemotionaltributes.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/02/3E1F7F8000000578-0-image-a-2_1489114237047.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299800_Tributes-controversial-cartoonist-Bill-Leak_1540251158.html","title":"Bill Leak death leads to emotional tributes","title_page":"Bill Leak death leads to emotional tributes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A friend of controversial cartoonist Bill Leak has broken down on live television when news broke he died of a heart attack.\nHigh-profile friends are remembering the 61-year-old conservative - a resident artist at The Australia, News Corp's national broadsheet - as a defender of free speech.\nBut controversy has followed him even in death, with some on social media continuing to criticise him for 'racist' and 'homophobic' cartoons.\nControversial cartoonist Bill Leak has died of a heart attack aged 61\n'RIP Bill Leak – a true warrior for free speech,' Queensland MP George Christensen wrote on Facebook\nFormer Prime Minister Tony Abbott wrote a tribute on Facebook\n'One of the few brave enough to point out when the emperor had no clothes,' Pauline Hanson wrote on Twitter\nLeak's friend Simon Breheny, Director of Policy at the Institute of Public Affairs, learned of his death while on Sky News.\nBreheny was lined up on the program for a segment regarding free speech and section 18C of the Racial Discrimination Act.\nBreheny appeared visibly upset by the death and said it was 'shocking, shocking news'.\n'I think Bill Leak was one of the most fearless and insightful cartoonists this country has seen for a very long time,' Breheny said.\nPrime Minister Malcolm Turnbull said he couldn't believe Leak was dead in a Facebook post on Friday afternoon.\nSimon Breheny, Director of Policy at the Institute of Public Affairs, learned of his friend's death on television\nPrime Minister Malcolm Turnbull said he couldn't believe Leak was dead in a Facebook post on Friday afternoon\nABC 7.30 host Leigh Sales said she would miss him\n'Who had more life, more energy than him? So many more cartoons to draw, paintings to paint, politicians to satirise - so many more lives to enhance with his wit, his brilliance, his good friendship,' Mr Turnbull wrote.\nFormer Prime Minister Tony Abbott said Leak was a 'superb artist, fine mind, brave soul'.\n'No one better illustrated the great truth that a picture is worth a thousand words. We are all aesthetically, culturally and even spiritually impoverished to lose this wonderful man,' Abbott wrote.\nPauline Hanson said he was a champion of free speech.\n'#RestInPeace Bill Leak. Thanks for all the laughs while I've been in politics. Your Australian larrikinism will be missed,' Lambie wrote\nABC News Breakfast host Virginia Trioli also paid her respects to the cartoonist\nMost recently, Leak shot to headlines for a controversial cartoon of an Indigenous father holding a can of beer\n'One of the few brave enough to point out when the emperor had no clothes,' she wrote on Twitter.\nQueensland MP George Christensen, who recently splintered from the National Party, wrote on Facebook: 'RIP Bill Leak - a true for free speech.'\nTasmanian Senator Jacqui Lambie thanked Leak for the laughs.\n'#RestInPeace Bill Leak. Thanks for all the laughs while I've been in politics. Your Australian larrikinism will be missed,' Lambie wrote.\nABC 7.30 host Leigh Sales said she would miss him.\n'An absolute giant of Australian media but more importantly, a loyal, loyal friend.'\nProminent Indigenous man Nyunggai Warren Mundine shared pictures of himself with Leak on Twitter, and said he was 'devastated' to hear his friend and 'favourite cartoonist' had died\nCaroline Overington said he 'had the courage of a lion'\nABC News Breakfast host Virginia Trioli also paid her respects to the cartoonist.\n'Had some uproariously funny times with Bill Leak over the years, and he had a pen as sharp as a dagger. Vale #BillLeak,' Trioli wrote.\nTelevision presenter Dan Ilic said he was sorry to hear of Leak's death.\n'Had dinner with Bill Leak once, found him to be an intensely interesting and complex man. I'm sorry to hear of his passing,' Ilic wrote.\nCaroline Overington said he 'had the courage of a lion'.\n'No. No. No. How do we ever explain how much we loved him?'\nJoe Aston said he was a 'giant of his craft'\nTelevision presenter Dan Ilic said he was sorry to hear of Leak's death\nBill Leak's final cartoon was published in The Australian on Friday\nFairfax and Guardian writer Amy Gray said his 'vitriol' would live on\nJoe Aston said he was a 'giant of his craft'.\n'Didn't always like/agree with what he said but zero doubt that Bill Leak was a giant of his craft. Vale.'\nProminent Indigenous man Nyunggai Warren Mundine shared pictures of himself with Leak on Twitter, and said he was 'devastated' to hear his friend and 'favourite cartoonist' had died.\nControversy surrounding Leak lived on even after his death, with some on Twitter refusing to pay respects.\nFairfax and Guardian writer Amy Gray said his 'vitriol' world live on through 'hateful conservative media'.\nLeak had campaigned to repeal section 18C of the Racial Discrimination Act, which makes it illegal to insult, offend, or humiliate someone on the basis of their race.\nAustralian cartoonist Bill Leak has died of a suspected heart attack at age 61\nIn recent times, he had been widely criticised for cartoons which many called racist to Indigenous Australians and homophobic\nHe worked at The Australian for two decades, winning nine prestigious Walkley awards and 19 Stanley awards for his work.\nIn recent times, he had been widely criticised for cartoons which many called racist to Indigenous Australians and homophobic.\nLeak shot to headlines for a controversial cartoon of an Indigenous father holding a can of beer and asking a police officer what his son's name was.\nA race hate claim made against him to the Australian Human Rights Commission in response to the cartoon.\nBut the young woman withdrew in November, saying she did 'not want to continue with the complaint'.\nThe initial complaint was made under 18C of the Racial Discrimination Act.","url":"https://www.dailymail.co.uk/news/article-4299800/Tributes-controversial-cartoonist-Bill-Leak.html"}
