{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 21:31:32","date_modify":"2018-10-30 21:31:32","date_publish":"2014-06-08 23:10:00","description":"In an interview with the Washington Post that summarizes how Bill Gates pulled off the very","filename":"data/vaneerConsumption/BillGatesCommonCoreAttempttoCloseGapBetweenLowIncomeandWealthyStudents.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Government/2014/Education/bill-gates-meh-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_06_08__1540935092.html","title":"Bill Gates: Common Core Attempt to Close Gap Between 'Low-Income' and Wealthy Students","title_page":"Bill Gates: Common Core Attempt to Close Gap Between 'Low-Income' and Wealthy Students | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In an interview with the Washington Post that summarizes how Bill Gates pulled off the very “swift Common Core revolution,” the Microsoft founder stated, “The country as a whole has a huge problem that low-income kids get less good education than suburban kids get… and that is a huge challenge.”\nGates’s statement underscores further the notion that the Common Core standards initiative is a social engineering project that places education standards ahead of parental and family influences as the major cause of poor student performance in low-income and minority communities.\nRegardless of the push by various Gates-funded organizations to boast the Common Core standards’ “rigor,” the real motivation to correct what is viewed as societal injustices was underscored even by U.S. Secretary of Education Arne Duncan who said last November that it was “fascinating” that some of the opposition to the Common Core State Standards (CCSS) is coming from “white suburban moms who – all of a sudden – their child isn’t as brilliant as they thought they were, and their school isn’t quite as good as they thought they were.”\nAccording to the Post, Gates is “irritated” by the resistance to the standards from grassroots organizations who want to bar the federal government from overreaching into local education decisions.\n“These are not political things,” he said. “These are where people are trying to apply expertise to say, ‘Is this a way of making education better?'”\n“At the end of the day, I don’t think wanting education to be better is a right-wing or left-wing thing,” Gates said. “We fund people to look into things. We don’t fund people to say, ‘Okay, we’ll pay you this if you say you like the Common Core.'”\nNevertheless, the federal government did offer funding through competitive grants to the states in President Obama’s Race to the Top (RttT) stimulus program in 2009, as well as waivers from No Child Left Behind restrictions if states adopted “college and career ready” standards.\nIn addition, Common Core proponents have not provided any solid research that backs up their claims that the standards are indeed “rigorous” or have been “internationally benchmarked.”\nZe’ev Wurman, visiting scholar at the Hoover Institution and author of the Pioneer Institute report, “Common Core’s Validation: A Weak Foundation for a Crooked House,” demonstrated the shoddy research that was performed by Common Core Validation Committee members who signed off on the standards. In the pro-Common Core studies Wurman examined, he found the research had been poorly executed and failed to provide evidence that the standards are internationally competitive and reflective of college-readiness.\nSimilarly, the 2014 Brown Center report by the Brookings Institution found that the Common Core standards will have “little to no impact on student achievement.”\nDespite the lack of validity of the Common Core standards, the Post reports that after Gene Wilhoit, director of the Council of Chief State School Officers (CCSSO) and a former Kentucky education commissioner, and Common Core “architect” David Coleman met with Gates about funding the development of the standards, Gates’s foundation gave over $5 million to the University of North Carolina-affiliated Hunt Institute, led by former Gov. Jim Hunt (D). The Hunt Institute then coordinated more than a dozen organizations, including the Thomas B. Fordham Institute, National Council of La Raza, Achieve, Inc., the two national teachers’ unions, and the two groups that are the copyright owners of the Common Core standards – CCSSO and the National Governors Association (NGA).\nTalking points about the standards were then developed by GMMB, a communications firm owned by Jim Margolis, a top Democrat strategist and veteran of both of Obama’s presidential campaigns.\nIn Kentucky, where Common Core caught fire first, the state’s Chamber of Commerce provided the link to a Louisville stockbroker who organized a coalition of 75 company executives across the state who lent their names to ads in business materials that supported the nationalized standards.\nWithin months, states were signing on to the Common Core.\n“You had dozens of states adopting before the standards even existed, with little or no discussion, coverage or controversy,” said Frederick Hess of the American Enterprise Institute, which received $4 million from the Gates Foundation since 2007 to study education policy, including the Common Core. “People weren’t paying attention. We were in the middle of an economic meltdown and the healthcare fight, and states saw a chance to have a crack at a couple of million bucks if they made some promises.”\nSarah Reckhow, a philanthropy and education policy expert at Michigan State University, told the Post that the Gates Foundation’s decision to pay both for the standards themselves and their promotion was atypical.\n“Usually, there’s a pilot test – something is tried on a small scale, outside researchers see if it works, and then it’s promoted on a broader scale,” Reckhow said. “That didn’t happen with the Common Core. Instead, they aligned the research with the advocacy… At the end of the day, it’s going to be the states and local districts that pay for this.”\nAccording to the Post, however, Gates “sees himself as a technocrat trying to foster solutions to a profound social problem – gaping inequalities in U.S. public education – by investing in promising new ideas.”\n“I believe in the Common Core because of its substance and what it will do to improve education,” he said, though his children attend private schools that have not adopted the Common Core standards. “And that’s the only reason I believe in the Common Core.”\n“This is about giving money away,” he said of his support for the standards. “This is philanthropy. This is trying to make sure students have the kind of opportunity I had… and it’s almost outrageous to say otherwise, in my view.”","url":"https://www.breitbart.com/politics/2014/06/08/gates-common-core-attempt-to-solve-problem-that-low-income-kids-get-less-good-education-than-suburban-kids/"}
