{"authors":["John Hayward"],"date_download":"2018-10-30 21:12:27","date_modify":"2018-10-30 21:12:27","date_publish":"2014-05-23 18:31:32","description":"By now we've all enjoyed a few strolls on Memory Lane and relived moments in which liberals pointed to the VA as the idea future of health care reform. |","filename":"data/vaneerConsumption/Bindersfullofveterans.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/blog_2014_05_23__1540933947.html","title":"Binders full of veterans","title_page":"Binders full of veterans | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"By now we’ve all enjoyed a few strolls on Memory Lane and relived moments in which liberals pointed to the VA as the idea future of health care reform. (If you haven’t had enough yet, here’s one with some good quotes from Paul Krugman, one of the most dangerous imbeciles in the world.)\nThe Left will do a bit of squirming as more VA horror stories come out, but they’re not really going to change their mind about socialized medicine. In fact, if Democrats survive the political fallout through the next election or two, and there are some headline-friendly “improvements” they can tout, it won’t be long before you see exactly the same sort of column about how the VA is a wonderful model of our glowing single-payer future.\nIn their heart of hearts, socialists really aren’t all that upset about the VA scandal. They’re more… annoyed than anything else, because it’s hurting their Democrat Party politically. Pump them full of truth serum, and they’ll admit they don’t see any problem with the system. They just think the “wrong people” were running it. You can hear the same speech from any campus Marxist during one of his windy lectures about how “real communism” has never been tried, because the “wrong people” hijacked the Soviet Union. For purely political reasons, the socialist Left doesn’t think accountability for this scandal runs anywhere near the top – they’d sing a very, very, very different tune if this story was breaking under a Republican President – but that’s nothing new either; absolute loyalty to beloved best-and-brightest rulers is a standard characteristic of socialism. It’s never the fault of the anointed when things go wrong.\nIf you can get past all of Obama’s political posturing and buck-never-got-here evasions, what he’s saying about the VA scandal is that the system is terrific, and just needs to be left alone to fix itself. Notice how the very first thing he did, when he finally showed up for his scheduled press conference the other day, was extol the wondrous virtues of the “great service” the system provides to so many of its clients, along with all the great things he’s supposedly done for veterans. His defensive strategy includes two distinct memes:\n1. Government cannot be judged according to its failures, and\n2. The only real “crime” for a high government official is the failure to care enough, which Barack Obama obviously cannot be guilty of.\nSure, a lot of what Obama and his allies are doing right now is a bald-faced delaying tactic, playing for time until the scandal withers enough to be buried in a shallow media grave. I get why veterans’ groups were appalled when the President said he wanted to wait for some more reports to come off the bureaucratic griddle in a month or two before he does anything, but I don’t understand why anyone would be surprised by that.\nBut there is a consistent logic to the way Obama handles this, and every other, scandal that goes beyond his reliable I Didn’t Know / I’m Madder Than Hell / It’s a Phony Scandal damage-control cycle. It’s all about having faith in Big Government, which might be mistaken about a few little details, but can never really be wrong. The same logic drives Obama’s arguments about all of his other scandals too, from the IRS to the ObamaCare launch disaster. What he’s basically saying is that the almighty State can grow and evolve beyond any temporary stumble, if it’s just left alone. No dramatic reforms are needed; we should Hope for no Change. The bureaucratic priesthood will address all problems – there’s no need to let unbelievers and laymen run amok in the sacred temple of the State. You’ll notice that Obama is very insistent about leaving the very same people in charge, for as long as they wish to be. Nobody ever gets fired.\nIt’s bizarre to look back at the 2012 election now, and remember how it was shaped by so many trivial concerns and frivolous distractions. Remember “binders full of women?” That was supposed to be “proof” that Mitt Romney was out-of-touch and didn’t respect women, or something. They were just slips of paper in a notebook to him, not flesh-and-blood people. But what does the VA scandal prove more decisively than Barack Obama’s callous indifference, his inability to understand or sympathize with individual people? It’s all binders full of veterans to him. He made some campaign promises, forgot about them once he got elected, and got busy with the fun and rewarding stuff he really enjoys working on. He’s still defending a broken system that faked paperwork to make itself look better, while leaving actual people to suffer and die. It’s all a political exercise to him, right down to the advisers that showed him polls and told him voters expect him to say he’s angry. Everything bad that happens to us under socialized medicine will boil down to a political exercise for Obama’s successors, too. The people who claim to have a monopoly on compassion keep unleashing these heartless bureaucratic machines upon us.","url":"https://www.breitbart.com/blog/2014/05/23/binders-full-of-veterans/"}
