{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:38:54","date_modify":"2018-10-30 20:38:54","date_publish":"2016-08-22 14:03:45","description":"Hamza bin Laden, the son of the late al Qaeda leader, has urged young Saudis to train with al Qaeda to overthrow Saudi Arabia’s kingdom.","filename":"data/vaneerConsumption/BinLadensSonUrgesSaudistoTrainwithAlQaeda.json","image_url":"https://media.breitbart.com/media/2016/05/Hamza-bin-Laden-afp.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_08_22__1540931934.html","title":"Bin Laden’s Son Urges Saudis to Train with Al Qaeda","title_page":"Bin Laden’s Son Urges Saudis to Train with Al Qaeda","title_rss":"NULL","source_domain":"breitbart.com","text":"Hamza bin Laden, the son of the late al Qaeda leader, has urged young Saudis in a new audio message to train with al Qaeda in the Arabian Peninsula (AQAP) to “gain the necessary experience” to overthrow Saudi Arabia’s kingdom, a U.S. ally, according to the SITE Intelligence Group, which tracks jihadi activity online.\nThe message comes as a Saudi-led coalition, backed by the United States, is combating AQAP and other jihadi groups in Yemen.\n“Echoing his father Usama’s call to overthrow the Saudi regime, Hamza bin Laden incited Saudis to act and end American influence in the country, and to seek military training with al-Qaeda in the Arabian Peninsula (AQAP) in Yemen,” reports SITE.\nHamza’s audio message was published on Wednesday by As-Sahab, an al Qaeda-linked media outlet, reports Khaama Press (KP).\nHe urged young Saudis to join AQAP to “gain the necessary experience” in waging “intifada” to free Saudi Arabia from the ruling royal Al-Saud family, reveals the SITE Intelligence Group.\nHamza bin Laden Incites Saudis to Overthrow Regime, Train with AQAP https://t.co/D1rtCiIXTw — SITE Intel Group (@siteintelgroup) August 17, 2016\n1) Breaking: Hamza bin Laden echoes father’s call to overthrow Saudi regime, cut #US influence in country, & train w/ #AQAP — Rita Katz (@Rita_Katz) August 17, 2016\n2) This is Hamza bin Laden’s 4th speech since Aug 2015. Last from July threatened revenge on US for father’s death pic.twitter.com/sb9wwGon8S — Rita Katz (@Rita_Katz) August 17, 2016\n3) Hamza BinLaden’s messages continue focus on global jihad issues (Palestine, KSA, Syria) in an ongoing effort to unify & head the movement — Rita Katz (@Rita_Katz) August 17, 2016\n2) Drastic increase in messages from #AQ central (10 from Zawahiri, 3 from Hamza this year alone) to rally support amid competition w #ISIS — Rita Katz (@Rita_Katz) August 17, 2016\nOsama bin Laden’s young son, believed to be in his early 20s, has emerged as the next top al Qaeda leader.\nDubbed the “the Crown Prince of Terror” by British media, Hamza has recently called on jihadists to attack the United States and its allies.\nIn an audio message that surfaced in July, Hamza vowed that al Qaeda will take revenge against the United States for executing his father, the mastermind behind the 9/11 terrorist attacks against the U.S. homeland.\nKP notes:\nYemen is the ancestral home of Saudi-born Osama bin Laden, who was killed in Pakistan in 2011 by an elite team of US Navy Seals after a decade on the run. The audio message released on Wednesday was his fourth speech since August 2015, as he tries to assert his influence over the global terrorist network. While Al-Qaeda has been headed by Ayman Al Zawahiri since 2011, experts believe that Hamza is aiming for the top terrorist position.\nUntil this year, the Saudi-led Sunni coalition in Yemen had been primarily focusing on Iran-allied Shiite rebels known as Houthis since March 2015, while largely ignoring jihadists, namely members of AQAP and ISIS.\nAs a result both Sunni terrorist groups have grown, with AQAP emerging as the strongest jihadi organization in Yemen.\nAccording to the U.S. State Department, AQAP has expanded its reach in Yemen to unprecedented levels and quadrupled its manpower from “approximately 1,000 members” in 2014 to “4,000” last year.\nThe Saudi-led coalition this year began to attack AQAP and ISIS in Yemen.\nBrett McGurk, President Barack Obama’s special envoy to the U.S.-led coalition against ISIS in Iraq and Syria, told lawmakers in June that Syria’s Jabhat al Nusra, had become the “largest” al Qaeda affiliate “in history.”\nHis comments came after U.S. military officials had conceded that by largely ignoring al Nusra and focusing on ISIS, the coalition helped the Syrian group gain strength and become more potent.\nThat is what happened in Yemen when the Saudi-led coalition ignored AQAP.\nAl Nusra recently decided to sever its ties with al Qaeda, which means AQAP likely regained its title as the terror group’s largest affiliate.","url":"https://www.breitbart.com/national-security/2016/08/22/bin-ladens-son-urges-young-saudis-overthrow-kingdom-join-aqap/"}
