{"authors":["Dr. Sebastian Gorka"],"date_download":"2018-10-30 20:42:13","date_modify":"2018-10-30 20:42:13","date_publish":"2015-06-29 18:18:16","description":"After Friday's deadly jihadist attacks in France, Tunisia and Kuwait, Prime Mister David Cameron has stated that ISIS is an existential threat to the West. Today's anniversary of the re-establishment of the Caliphate give us good cause to assess the threat to America in this, the first part of a two part piece by Dr. Sebastian Gorka. |","filename":"data/vaneerConsumption/BirthdayforACaliphate.json","image_url":"https://media.breitbart.com/media/2015/06/smoke-raises-behind-an-islamic-state-flag-after-iraqi-security-forces-and-shiite-fighters-took-control-of-saadiya-in-diyala-province-from-islamist-state-militants-november-24-2014-reutersstringer.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_06_29__1540932133.html","title":"Birthday for A Caliphate","title_page":"Birthday for A Caliphate | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"After Friday’s deadly jihadist attacks in France, Tunisia and Kuwait, Prime Mister David Cameron has stated that ISIS is an existential threat to the West. Today’s anniversary of the re-establishment of the Caliphate give us good cause to assess the threat to America in this, the first part of a two part piece by Dr. Sebastian Gorka.\nOne year ago, a man unknown to most of the world achieved a feat that has eluded Islamic extremists for the previous 90 years.\nOn June 29, 2015 Abu Bakr al Baghdadi, after almost a century of absence, formally reestablished the theocratic empire of Islam in a sermon from the pulpit of the Grand Mosque in Mosul. In the last year, his terror group, ISIS, which today we should call by its new name of the Islamic State, has grown to become the most dangerous insurgency of the modern era.\nOn September 10th, 2001 it would have been impossible to imagine that humans would soon be crucifying each other again, or that there would be an anti-American terrorist group able to capture and hold territory in multiple nations of the Middle East without Washington or her allies and partners being able to stunt its growth. We are now living in such a world. A world where innocent prisoners are burnt or drowned alive, or unbelievably decapitated with the use of detonating cord. A world in which hundreds of thousands have been killed in a civil war in Syria and an insurgency in Iraq, both together driving millions of survivors into refugees camps or into the hands of human traffickers.\nThe Islamic State that is at the center of this tragedy is a unique threat for four reasons:\nFirstly, it is the richest group of its kind in modern history. No other sub-state actor has the resources available to IS. Since capturing city after city in Iraq it has netted close to a billion dollars from state coffers illicit oil sales ransoms sale of plundered antiquities 9/11 commission report,\nSecond, it is the first ever transnational insurgency. In the modern era of guerrilla warfare, the insurgent force was defined by its desire to defeat an incumbent government and replace it. This was true of Mao Tse Tung in China, or the FARC of Colombia, and all the other insurgencies of the 20th century. The Islamic State is an international insurgency recruiting as it does from Muslim communities all around the world and enjoying the sponsorship of more than one foreign government. However, it is also a transnational insurgency. Not only does it hold territory in both Iraq and Syria, with the intent of displacing both the Assad government and the government in Baghdad, it has the goal of destroying all regimes that it deems to be un-Islamic. The fact that Nigeria’s Boko Haram was recently accepted into IS and subsequently changed its name\nThird, in its ability to recruit jihadi fighters, the Islamic State has out surpassed Al Qaeda in every measure. Exact figures are impossible, but the best estimates are that, in the space of less than a year, the Islamic State has drawn 20,000 foreign fighters\nLastly, and most problematically for any hope we may have for defeating IS, the Islamic State has built a global Social Media-based propaganda platform that is very sophisticated and effective and that the nations its wishes to destroy – America included – have been impotent to combat.\nAlone, these four attributes would make any irregular threat like IS/ISIS a formidable enemy. Where it is located makes it a strategically deadly one.\nJust like Judaism and Christianity, Islam has a very deep eschatology. The Sunna, or traditions of Islam, go into great detail about how the world will end and how all humans will be finally judged on the final day by Allah. Before that end comes, the religion is explicit that there will be a great final holy war, or Jihad, in the land of Al Shaam, the Arabic word for Greater Syria and the Levant, or the territory in which Abu Bakr has successfully established his new Caliphate. In fact, between its origins as Al Qaeda in Iraq and its current name of the Islamic State, the group specifically referred to itself as The Islamic State of Iraq and Al Sham. As a result, Abu Bakr, the leader of the new Caliphate, has the eschatology of a faith followed by over 1 billion Muslims on his side. He knows that, by being successful on the ground that all Muslims know is the site of the last holy war before judgement day, he can rely on a steady stream of recruits for as long as there is no opposing ground force set against him in Al Sham.\nPlainly put, in the last 12 months since he declared the new Caliphate, Abu Bakr has achieved more than Al Qaeda did in the preceding 13 years. Also, instead of being the “JV team” to Ayman al Zawahiri’s professional team, it is America that has presented itself as the amateur foe.\nAfter Abu Bakr and his Al Qaeda in Iraq franchise was kicked out of the original terror group by Zawahiri for disobeying his orders, he took his small terrorist force in Syria from Iraq and used the civil war there to train and expand his force. As the bloodshed mounted both there and in an Iraq increasingly divided by the corruption and brutality of the Maliki regime, hundreds of thousands of local residents fell victim to the depredations of the competing fighting forces. Yet America decided not to respond. Having pulled our forces out of Iraq in 2011, we were unready and unable to respond to the growing threat. At the same time, President Obama made repeated statements about “red lines” that President Assad was not to cross. The lines were crossed but without triggering a US response. Not until thousands of Yazidis were hounded by ISIS up to the top of Mount Sinjar did the President decide to act by deploying air assets to target ISIS units on the ground.\nThe delay in an American response has cost America’s reputation in the Gulf dearly, perhaps more dearly than anything done by the administration of George W. Bush. As it was recently explained to me by a very senior U.S. General with responsibilities in the region: “Our Sunni allies just don’t trust us anymore. The region already runs on conspiracy theories, but after the Sunni see more than 200,000 of their people murdered in the last three years and we do nothing until a minority sect is attacked, they draw the conclusion that we are on the side of the mullahs and the Shia revival.”\nIf one agrees with the summary by Prime Minister Netanyahu that the violence on the Middle East and North Africa cannot be understood unless seen as “a game of thrones” for the crown of the caliphate between the Shia and Sunni extremists, then it is obvious that giving the impression that we have already chosen sides will only feed the flames of war. Especially when this impression is apparently confirmed by every additional concession made by the White House to Tehran in the hopes of closing a nuclear deal with the Revolutionary Republic.\nNor can these threats any longer be relegated to events happening far away. As the targeting of Pamela Geller’s free speech event in Garland, Texas by two armed jihadis demonstrates, those who wish to impose a puritanical and violent version of Islam upon America and her citizens are already here. And Garland is not a one-off. The FBI has confirmed that the Bureau already has ongoing IS-related investigations underway in every state of the Republic. Recently, the first IS recruiter was arrested in New Jersey. And in preparation for this article I had a research assistant simply collect all open-source reports of IS arrests and plots uncovered in the US in the last 24 months. We found 56!\nWhen will America take the threat of a hyper-violent organization with tens of thousands of adherents who wish to destroy America seriously? When did we take Al Qaeda seriously? On September 12th, 2001. At the moment, short of a mass-casualty attack occurring on US soil in a way that links the perpetrators directly to the Islamic State, it seems highly unlikely that the Obama administration will truly take the fight to IS. Of the 400+ troops the White House has decided to deploy to Iraq to help train the trainers, less than 150 will in fact work on that mission, with the rest providing security to the trainers. The Islamic State has more than 30,000 active jihadis, more than half of whom were recruited from abroad. And the most powerful nation in the world can only spare an extra 150 trainers? As another senior officer recently commented in front of a meeting of US generals: “Every day that ISIS still exists and the most powerful nation in the world does nothing, we can chalk another propaganda victory up to the jihadis.”\nConsequently, it seems unavoidable that IS will continue to grow and spread its barbarity until a new Commander-in-Chief is sworn in. The good news is that in an election campaign that is already underway and which almost each day sees the cornucopia of at least the Republic candidates increase, national security is at last back on the front burner, or rather both front burners. As a result we may have a chance after November 2016 to engage our newest enemy in the way the jihadists deserve.\nThe details of a possible strategy that could be used to measure the candidates will follow in Part Two.\nSebastian Gorka Ph.D. is the Major General Matthew C. Horner Chair of Military Theory at the Marine Corps University. You can see his briefing from the Global Counterterrorism Summit on Why ISIS is Much More Dangerous than Al Qaeda here and follow him on Twitter at: @SebGorka.","url":"https://www.breitbart.com/national-security/2015/06/29/birthday-for-a-caliphate/"}
