{"authors":[],"date_download":"2018-10-30 21:17:24","date_modify":"2018-10-30 21:17:24","date_publish":"2018-09-05 20:10:00","description":"Bishop Michael Curry, Episcopal Church leader also known for address at royal wedding, will speak Sept. 6 in Atlanta","filename":"data/vaneerConsumption/BishopMichaelCurryChristianityneedstoreclaimitssoul.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/09/05/Images/newsEngin.22959397_Episcopal-Church-Bishop.JPE-UW5YGACBYW3-680x383.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_bishop-michael-c_8ff08a4d0a8b252547fe9ca33d0fed77__1540934244.html","title":"Bishop Michael Curry: Christianity needs to ‘reclaim its soul’","title_page":"Bishop Michael Curry says Christianity needs to reclaim its soul","title_rss":"NULL","source_domain":"ajc.com","text":"The Most Rev. Michael Curry said on Wednesday that Christianity “must reclaim its soul.”\n“In our culture, in this country, particularly at this time, Christianity is often presented in such a way that it leaves Jesus of Nazareth and his love out of the equation,” said Curry, who in 2015 became the first African-American to lead the Episcopal Church. “I think we are certainly in danger of losing our way.”\nFollowing Jesus’ example and spirit is at the “center of what it means to be Christian,” he said.\nThat means unselfish, sacrificial love, compassion and justice for others, especially those who are downtrodden, poor and hurting.\nCurry, presiding bishop of the Episcopal Church, will be in Atlanta Thursday to speak at a sold-out benefit dinner for the Day1 media ministry at the Piedmont Driving Club.\nThe theme of Curry’s message is “We Need Some Witnesses to the Way of Jesus.”\nCurry hopes it hits home in a nation polarized along racial, cultural and political lines.\nCurry, who will be honored by the Atlanta City Council while here, received global attention this summer when he delivered a stirring address at the royal wedding of Meghan Markle and Prince Harry at Windsor Castle that resembled a traditional U.S.-style church sermon.\n>> RELATED: Read: Episcopal Church’s Michael Curry’s address at royal wedding\nDuring the royal wedding address, Curry quoted the words of slain civil rights leader the Rev. Martin Luther King Jr. and verses from an old spiritual.\n“I didn’t expect that response,” he said of the attention. “I had no idea. I really didn’t. That message was the same message I’ve been saying for a long time in a variety of ways.”\nEven before then, though, Curry’s influence was being felt in the U.S.\n“Bishop Curry has lit a fire under the Episcopal Church, I believe, in terms of helping us focus on some of the key issues of evangelism, racial reconciliation and creation care,” said the Rev. Peter Wallace, executive producer and host of the Day1 radio program and podcast. “His enthusiasm is contagious. It’s not about him, it’s about Jesus. He’s the real deal.”\n>> RELATED: Bishop Michael Curry discloses he has prostate cancer\nThursday’s event supports the Day1 ecumenical radio and internet ministry, formerly known as “The Protestant Hour,” which has broadcast sermons by preachers from the mainline denominations each week for 73 years. The program is produced by the Alliance for Christian Media.\nCurry was a regular voice on the radio program in the 1990s. He’s also a member of the Day 1 advisory board and a former member of the board of trustees.\nThe Episcopal Church has crafted an initiative called “Becoming the Beloved Community,” which is a long-term commitment to address racial healing, reconciliation and justice.\nChristians “do not demonize other people, whether they’re on the left or the right,” said Curry, a native of Chicago and son of an Episcopal priest. Followers of Jesus’ teachings don’t put down people who are of a different faith. They don’t put down Muslims. “If you follow Jesus, you don’t put down immigrants or people from Mexico or anywhere else.”\nRather, people should love the way Jesus loved.\nSo, while Curry wants to break down those walls that divide people, he doesn’t expect to change people’s politics. However, it may make them consider what is best for the common good.\nIn today’s political discourse, people may mask themselves in religion, but if you take careful notice, he said, “they don’t talk about love. They don’t talk about the parable of the Good Samaritan. … They don’t talk about the Sermon on the Mount or loving your enemy.”\nRecently, Curry revealed he had been diagnosed with prostate cancer and underwent surgery.\nCurry, 65, said he is doing fine. “I’ve been recovering,” he said. “I pretty much stayed home and recuperated in August. Things are starting up slowly, but starting up.”\nCurry is scheduled to return to Atlanta in November for the Diocese of Atlanta’s 112th Annual Council to be held at Holy Innocents’ Episcopal School. During the two-day diocesan legislative gathering, Curry will preside at an afternoon worship service on Nov. 9 that will be open to the public.\nIN OTHER NEWS:","url":"https://www.ajc.com/lifestyles/bishop-michael-curry-christianity-needs-reclaim-its-soul/5QYPqCz7P0XxdTTARuKAzJ/"}
