{"authors":[],"date_download":"2018-10-30 21:18:37","date_modify":"2018-10-30 21:18:37","date_publish":"2018-07-25 21:05:00","description":"The Most Rev. Michael B. Curry, presiding bishop of the Episcopal Church, disclosed on Wednesday that he was diagnosed with prostate cancer several months ago after an annual physical.","filename":"data/vaneerConsumption/BishopMichaelCurrydiscloseshehasprostatecancer.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/Statesman/2018/07/03/Images/newsEngin.22455942_Bishop-Curry.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_bishop-michael-c_e0bff15e988ca4c2dfe07230d08e42e6__1540934317.html","title":"Bishop Michael Curry discloses he has prostate cancer","title_page":"Bishop Michael Curry, who spoke at royal wedding, says he has cancer","title_rss":"NULL","source_domain":"ajc.com","text":"The Most Rev. Michael B. Curry, presiding bishop of the Episcopal Church, disclosed on Wednesday that he was diagnosed with prostate cancer several months ago after an annual physical.\n“After a variety of tests, consultations and conversations with my wife and daughters, I decided on a surgical treatment course,” he wrote in a letter, which was released by the church. Curry said he will undergo surgery on Tuesday to remove the prostate gland.\n“ I am happy to say that the prognosis looks very good and quite positive. I have spoken with several others who have gone through this, and who have offered both encouragement and helpful advice. I will be in the hospital for at least a day, then at home to recuperate. “\nRelated: Bishop Michael B. Curry to speak in Atlanta in September\nIn the letter, Curry said the recuperation time is between four and six weeks.\nCurry said he does not anticipate any significant changes in his commitments.\nCurry is scheduled to speak in Atlanta on Sept. 6 at a fundraiser for Day1 Media Ministry.\nPeter Wallace, president of the Alliance for Christian Media and executive producer of Day1, said the bishop has indicated that he plans to resume his duties in September.\n“We hold him in our prayers,” Wallace said.\nA spokeswoman for the Episcopal Church, however, said she could not confirm at this point whether the bishop will still attend.\nCurry delivered a stirring sermon during the wedding of Prince Harry and Meghan Markle in St. George’s Chapel at Windsor Castle in May.","url":"https://www.ajc.com/lifestyles/bishop-michael-curry-discloses-has-prostate-cancer/f50q1Wj0pBQd90xaluDfVN/"}
