{"authors":[],"date_download":"2018-10-23 05:16:00","date_modify":"2018-10-23 05:16:00","date_publish":"2014-10-19 00:00:00","description":"Catholic bishops finished a two-week gathering at the Vatican on Saturday. Their discussions focused on the family and controversial issues, including gays and divorcees. But many were disappointed.","filename":"data/vaneerConsumption/BishopsFailToAgreeOnSameSexUnions.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2014_10_19_357341824_bishops-fail-to-agree-on-gay-marriage-and-homosexuality_1540271760.html","title":"Bishops Fail To Agree On Same-Sex Unions","title_page":"Bishops Fail To Agree On Same-Sex Unions : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Bishops Fail To Agree On Same-Sex Unions\nCatholic bishops finished a two-week gathering at the Vatican on Saturday. Their discussions focused on the family and controversial issues, including gays and divorcees. But many were disappointed.\nRACHEL MARTIN, HOST:\nThis is WEEKEND EDITION from NPR News. I'm Rachel Martin.\n(SOUNDBITE OF CHORUS SINGING)\nMARTIN: At the Vatican today, Pope Francis and hundreds of bishops closed a two week long assembly on family issues by gathering together for mass. But there is discord in the church. The final report issued by the bishops last night revealed deep divisions within the Catholic Church on how to deal with gays and divorced and remarried Catholics. NPR's Sylvia Poggioli joins us on the line now from Rome. So Sylvia, this big meeting at the Vatican made headlines this past week when a draft report came out that included some surprisingly conciliatory language about civil and same-sex unions. But that didn't make it into the final document issued last night, right? What happened?\nSYLVIA POGGIOLI, BYLINE: Well, no. The - that unprecedented overture to gays was significantly watered down in the final report. Conservatives had vehemently criticized the draft report that called for welcoming homosexuals as individuals who have gifts to offer the church. The final revised version calls simply for pastoral attention towards persons with homosexual orientations. And even so, the final report's watered-down paragraph on gays as well as two other paragraphs on the other hot button issue at the Synod - whether divorced and civilly remarried Catholics can receive communion did not receive a two-thirds majority that indicates formal approval and church wide consensus. So there is a deep split here.\nMARTIN: So what's the upshot of this? I mean, Pope Francis has made clear he wants what he calls a more merciful and compassionate church. How does this report to fit into that vision?\nPOGGIOLI: Well, you know, at the start of the Synod, Pope Francis urged the bishops to speak freely and not worry about offending the Pope. The custom at previous Synods was more or less a rubberstamping of the views of the reigning pontiff. In his closing speech last night, Francis expressed satisfaction with the open debate. And in an unexpected move in the name of the transparency, the Pope insisted not only that the entire final report be issued immediately to the media, but also the voting tally, which revealed the deep divisions among the bishops over those two controversial issues - gays and divorced and remarried Catholics.\nFrancis had tough words for both the dogmatics and reformers when he said the church must chart a moderate course between what he called the hostile rigidity of traditionalists and the destructive do goodness of so-called progressives. So I think Pope Francis would see this Synod as an example of a much greater openness and courage to show and acknowledge the divisions that do exist within the church.\nMARTIN: So maybe no practical change, but for him, the idea that there was just open debate is a success. Who are his critics? If there are these conservatives who are speaking out during the Synod, who are they and what is their message?\nPOGGIOLI: Well, the traditionalist camp includes Africans, Americans and Asians who worry that any changes will cause confusion among Catholics and give the impression that the church is going soft on its moral teachings. One of the most outspoken participants was Cardinal Wilfrid Napier of South Africa, who at a Vatican briefing openly expressed his anger at the draft report. He said - which he said does not represent the positions of the bishops. He was very upset by the idea that homosexual unions could be presented as if they were a positive thing. Another very vocal conservative is American Cardinal Raymond Burke, who's been critical of Francis for quite a while. He went so far as to say Friday that the Synod seemed to have been designed to weaken the church's teaching and practice with the apparent blessing of the Pope. But, you know, however loud the conservatives are, the voting on the final report showed they were not the majority of bishops at the Synod.\nMARTIN: So what happens now with this report?\nPOGGIOLI: Well, this Synod was just phase one. The report now goes out into the Catholic world to be debated by clergy and laypeople over the next year in preparation for a second Synod on the family in October. And even if the final version was watered down, issues that had been taboo until this papacy have been put on the table and they will be debated by the Catholic public opinion.\nMARTIN: NPR's Sylvia Poggioli. Thank you so much Sylvia.\nPOGGIOLI: Thank you.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2014/10/19/357341824/bishops-fail-to-agree-on-gay-marriage-and-homosexuality"}
