{"authors":[],"date_download":"2018-10-22 22:17:04","date_modify":"2018-10-22 22:17:04","date_publish":"2014-05-09 19:16:05","description":"Love using bitcoin, the virtual currency? Now you can smell like it.","filename":"data/vaneerConsumption/BitCologneVirtualCurrencyNowHasItsVeryOwnFragrance.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/432796/bitcologne_bottle-2_d1db232bb8821afe14757bbd405ceda6.1200;630;7;70;5.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_gift-guide_bitcologne-virtual-currency-now-has-its-very-own-fragrance-n101691_1540246624.html","title":"BitCologne: Virtual Currency Now Has Its Very Own Fragrance","title_page":"BitCologne: Virtual Currency Now Has Its Very Own Fragrance","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nWhat do bitcoins smell like?\nAccording to BitCologne, an “aromatic blend of spicy, floral, oak and citrus notes.” Yes, bitcoin, the virtual currency accepted by everyone from gunmakers to members of Congress, has its own cologne.\nThe above ad would be funnier in black and white, possibly with two half-naked models and a voice-over saying something like, \"Bold. Unregulated. Anonymous. BitCologne, for men.\" But, hey, it's informative.\nApparently, BitCologne is \"handmade\" specifically for bitcoin enthusiasts. The website even throws in some innuendo, claiming that the scent is perfect for \"peer-to-peer interaction.\" See, when two nodes in a network love each other very much, they sometimes open their resources to each other, occasionally resulting in a brand-new bitcoin.\nThe company behind this fragrant venture, Eruditium, also makes environmentally friendly products like hemp T-shirts and bead necklaces, all available for purchase with bitcoin.\nEach 2-ounce bottle will set virtual currency enthusiasts back $26, currently about 0.058 bitcoins. Also accepted: PayPal.","url":"https://www.nbcnews.com/tech/gift-guide/bitcologne-virtual-currency-now-has-its-very-own-fragrance-n101691"}
