{"authors":["Frank Chaparro"],"date_download":"2018-10-30 23:04:29","date_modify":"2018-10-30 23:04:29","date_publish":"2018-07-25 00:00:00","description":"Action on some of the most notable crypto trading venues is spiking.","filename":"data/vaneerConsumption/Bitcoinpricesoarsover8000andvolumesarespiking.json","image_url":"https://amp.businessinsider.com/images/5b5873a34f00953f008b4655-1920-960.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bitcoin-price-soars-over-8000-and-volumes-are-spiking-2018-7_1540940669.html","title":"Bitcoin price soars over $8,000 and volumes are spiking","title_page":"    Bitcoin price soars over $8,000 and volumes are spiking - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Scott Olson/Getty Images\nAction on some of the largest trading venues in crypto is heating up as the price of bitcoin, the largest digital currency, approaches $8,500 a coin.\nBitcoin, which spent much of 2018 in the doldrums, has seen its price soar by nearly $1,000 over the last week, reaching a two-month high on Tuesday. At last check, the cryptocurrency was trading at $8,217 a coin.\nAt the same time, crypto volumes — digital currencies changing hands — on exchanges have seen a spike in activity. And bitcoin bull Tom Lee, head of research at Fundstrat, says it's a meaningful signal that the bitcoin bottom is behind us.\n\"It's more evidence supporting a bottom,\" Lee said in an e-mail to Business Insider.\nAccording to Bloomberg data, bitcoin bottomed out at $5,791 on June 29. As for how high bitcoin can go in 2018, Lee has stood by his $25,000 price target.\n\"A few weeks ago when bitcoin started to rally, skeptics dismissed the move saying there was no volume,\" he added. \"Now we have massive jumps in volume.\"\nAcross exchanges, volumes have increased to over $20 billion on Tuesday, according to data from CoinMarketCap.\nMeanwhile, BitMEX, the peer-to-peer mercantile trading venue, saw record volumes, with $8 billion worth of bitcoin traded over the past 24 hours, a spokesman told Business Insider.\nCME Group, the exchange behind one of the markets for bitcoin futures in the US, saw turnover for its contracts increase from 1,600 on July 3 to more than 12,800 contracts traded on July 24, according to the firm's data.\nCME Group\nBitcoin's breakout over $8,000 married with strong volumes is a sign that current price levels are sustainable, said eToro analyst Mati Greenspan.\n\"As with traditional markets when a breakout happens on strong volume, it's considered a more powerful move and is more likely to be sustained,\" Greenspan said in an e-mail.\nRohit Kulkarni, a managing director of private investment research at SharesPost, said fundamentals and technicals are pointing towards a continuation of the current rally.\n\"Technical analysis supports a bullish pattern as Bitcoin tends to rebound after it trades below its 200-day moving average,\" Kulkarni said. \"Plus, we have seen constructive commentary supporting Crypto ETF products, which could help unlock interest among institutional investors.\"\nOn Tuesday, the market for digital currencies saw the bitcoin ETF race gain another contestant with Bitwise Asset Management filing an application for a fund tied to 10 cryptos. Still, it's not clear when the Securities and Exchange Commission would approve such a fund.\nThe SEC postponed deciding on five crypto-linked funds by Direxion Investments on Tuesday.\nThis post has been updated to amend Kulkarni's title.","url":"https://www.businessinsider.com/bitcoin-price-soars-over-8000-and-volumes-are-spiking-2018-7"}
