{"authors":["Sam Jacobs","Business Insider Australia"],"date_download":"2018-10-30 23:05:00","date_modify":"2018-10-30 23:05:00","date_publish":"2018-07-24 00:00:00","description":"Bitcoin has rallied 35% off its June low and is back above the $8,000 level for the first time since the end of May.","filename":"data/vaneerConsumption/Bitcoinisbackabove8000forthefirsttimesinceMay.json","image_url":"https://amp.businessinsider.com/images/5b5726d97a85ad33008b4620-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bitcoin-price-back-above-8000-first-time-since-may-2018-7_1540940700.html","title":"Bitcoin is back above $8,000 for the first time since May","title_page":"    Bitcoin price back above $8,000 for the first time since May - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"HBO\nBitcoin climbed back above the $8,000 mark in Asian trade Tuesday afternoon for the first time since late May.\nThe world's biggest cryptocurrency has now rallied by about 35% since dipping below $5,900 at the end of June.\nPrices were holding just above $8,000 shortly after clearing the mark at about 5 p.m. AEST (3 a.m. ET):\nMarkets Insider\nIt follows a sharp rally last week, which some analysts said may have been driven by a short squeeze on traders who held bearish positions against bitcoin.\nOthers have speculated that the recent bounce may be stemming from continued interest in the space by big institutional investors.\nGoldman Sachs is setting up a crypto trading desk, offering clients exposure to bitcoin-related derivatives.\nAnd Business Insider's Frank Chaparro reported that the US exchange Coinbase was building out a prime brokerage platform to attract institutional capital, with the help of a $20 billion hedge fund.\nAnalysis of Google Trends data also shows searches for \"bitcoin etf\" (short for \"exchange-traded fund\") in the US spiking in July after interest tailed off following the height of the crypto bull market in late 2017.\nBusiness Insider Australia\nTuesday's gains follow another push higher for bitcoin overnight, which wasn't followed by other major cryptos such as Ethereum and litecoin, which lost ground.\nBut activity in the sector has been broadly bullish in Asian trade, with most major cryptos in the green.\nHere's a table of the latest price action:","url":"https://www.businessinsider.com/bitcoin-price-back-above-8000-first-time-since-may-2018-7"}
