{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 21:05:13","date_modify":"2018-10-30 21:05:13","date_publish":"2016-12-22 00:00:00","description":"The cryptocurrency broke through $800 for the first time in 2016 on Wednesday and is up over 5% on Thursday morning.","filename":"data/vaneerConsumption/Bitcoinissurging.json","image_url":"https://amp.businessinsider.com/images/585baad1dd0895bc7f8b48a3-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bitcoin-price-surges-on-december-22-2016-12_1540933513.html","title":"Bitcoin is surging","title_page":"    Bitcoin price surges on December 22 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The price of digital currency bitcoin continues to surge on Thursday, up over 5% against the dollar by mid-morning in London.\nThe digital currency broke through $800 a bitcoin on Wednesday and ended the day at $826.29. Bitcoin's rise is continuing on Thursday, up 5.7% at 10.10 a.m. GMT (5.10 a.m. ET) at $874.04.\nMarkets Insider Bitcoin is now at a fresh high for 2016, surpassing the peak's reached earlier in the week and the previous spike in mid-June, driven by Britain's vote to leave the European Union.\nBitcoin has behaved like a risk asset this year, with investors flocking to it in times of uncertainty. The price spiked around the Brexit referendum and Trump's shock election as US president.\nBut it's unclear what exactly is driving the sharp price spike this week. Other risk assets aren't spiking in line — gold, the traditional safe-haven asset, has fallen steadily since the start of November.\nMati Greenspan, a senior market analyst at eToro, says in an email on Thursday morning: \"Seeing it move this far this fast brings up fresh memories of 2013 when it surged from less than $5 a coin to $1,241 in just a few months.\n\"With those kind of gigantic swings, this is the most risky asset ever conceived so I certainly would not recommend putting your life savings in it. However, if indeed we are headed to $1 Million per coin, like some believe even a small investment could go a long way IF it pans out.\"","url":"https://www.businessinsider.com/bitcoin-price-surges-on-december-22-2016-12"}
