{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 20:57:51","date_modify":"2018-10-30 20:57:51","date_publish":"2016-12-23 00:00:00","description":"The cryptocurrency broke through $900 per coin for the first time in 2016 on Friday.","filename":"data/vaneerConsumption/Bitcoinisstillpopping.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bitcoin-price-breaks-900-on-december-23-2016-12_1540933071.html","title":"Bitcoin is still popping","title_page":"    Bitcoin price breaks $900 on December 23 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Bitcoin's rally continues on Friday, with the digital currency breaking through the $900 per coin mark.\nBitcoin is up over 5% against the dollar at just after 8.00 a.m. GMT (3.00 a.m. ET) in London to reach $913.13. It follows similarly strong gains on Wednesday and Thursday.\nFriday marks a fresh 2016 high for bitcoin against the dollar and the first time the cryptocurrency has been above $900 this year.\nHere is how bitcoin looks against the dollar over the last three months — note the sharp uptick at the end: Markets Insider It is unclear what's driving bitcoin's recent rally.\nBitcoin has behaved like a risk asset this year, spiking around the Brexit referendum in June and Trump's election in November. However, there has been no news trigger over the last few days to drive a fresh spike and other safe-haven risk assets, such as gold, aren't rising in-line.\nMati Greenspan, a senior market analyst at trading platform eToro, says in an email on Friday morning: \"Nothing is moving at the moment like the digital currency which is blowing right through the roof.\n\"Many reasons have been given for the sudden surge. Some say that Chinese investors are expecting another devaluation in the Renminbi and are trying to get their assets offshore. Some cite increasing political uncertainty around the globe. No doubt, the growing momentum and the pop of the $775 level has caused a snowball effect. When you see something moving this fast it's difficult not to be a part of it.\"\nBut he cautions investors: \"Please remember though that this is an incredibly high risk asset. We could easily see further jumps of $300 or more in either direction before the excitement fades.\"","url":"https://www.businessinsider.com/bitcoin-price-breaks-900-on-december-23-2016-12"}
