{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 20:40:55","date_modify":"2018-10-30 20:40:55","date_publish":"2016-12-28 00:00:00","description":"The digital currency has gained over $150 in the last week alone.","filename":"data/vaneerConsumption/Bitcoinisstillstorminghigher.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bitcoin-price-rises-against-the-dollar-on-december-28-2016-12_1540932055.html","title":"Bitcoin is still storming higher","title_page":"    Bitcoin price rises against the dollar on December 28 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Bitcoin's incredible rally continues on Wednesday, up close to 3% against the dollar in early trade in London.\nThe digital currency is up 2.8% to $958.52 at 9.40 a.m. GMT (4.40 a.m. ET). Bitcoin has shot up over $150 over the last week, with little obvious spur for the price rise. Bitcoin is now at its highest level since November 2013 when it reached $1000. Markets Insider Mati Greenspan, a senior market analyst at trading platform eToro, says in an email on Wednesday morning: \"We've been seeing an incredible surge since the price crossed $775 and it doesn't seem to be slowing down.\n\"The media continues to speculate what the reasons for the rise might be but enthusiasts already know. They're simply speculating about how high it will go.\" Greenspan previously suggested that bitcoin's recent surge could be down to fears in China of an impending devaluation of the renminbi.\nMaria Terekhova, BI Intelligence's fintech research analyst, says in an email on Wednesday morning: \"Bitcoin's continued growth will depend on the factors that have so far contributed to its success. On one hand, as the cryptocurrency gains more exposure and enters the mainstream, more investors may to flock to the asset.\n\"On the other hand, however, much of bitcoin's recent boom has resulted from uncertainty around events such as the US election and Brexit. As Trump enters office and Brexit negotiations begin, the resulting settling-down might impact bitcoin's momentum.\n\"Bitcoin's future success is tied to whether investors will embrace the asset on its own merits, rather than simply in response to geopolitics.\"","url":"https://www.businessinsider.com/bitcoin-price-rises-against-the-dollar-on-december-28-2016-12"}
