{"authors":[],"date_download":"2018-10-22 21:56:45","date_modify":"2018-10-22 21:56:45","date_publish":"2017-04-26 03:01:16","description":"Powerful Australian Olympic Committee head John Coates is facing a bitter campaign to oust him after 27 years, with his media chief stepping down Wednesday...","filename":"data/vaneerConsumption/BitterriftrocksAOCasCoatesfightsforjob.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/14/wire-465557-1493214696-664_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4446124_Bitter-rift-rocks-AOC-Coates-fights-Olympic-job_1540245405.html","title":"Bitter rift rocks AOC as Coates fights for job","title_page":"Bitter rift rocks AOC as Coates fights for job | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"John Coates is seen as one of the most powerful figures in world sport, courtesy of being IOC vice-president and chairman of the co-ordination committee of the 2020 Tokyo Olympics\nPowerful Australian Olympic Committee head John Coates is facing a bitter campaign to oust him after 27 years, with his media chief stepping down Wednesday amid bullying claims rocking the organisation.\nCoates, also International Olympic Committee vice-president, has never been challenged before but Olympic hockey gold medallist and businesswoman Danni Roche now wants his job, and reportedly has significant backing.\nShe claims the administration is dictatorial and bloated and plans to cut costs and redirect money to athletes and underfunded sports in a shake-up of AOC culture.\nOne contentious point is the more than Aus$700,000 (US$526,000) annual salary of a man seen as one of the most powerful figures in world sport, courtesy of being IOC vice-president and chairman of the co-ordination committee of the 2020 Tokyo Olympics.\nRoche, 47, has pledged to slash the salary to Aus$100,000 if she gets the job.\nA secret ballot of summer and winter sports representatives will take place on May 6 for a new four-year term for the presidency, vice-presidency and board.\nAs the deadline looms, allegations of bullying have been splashed across Australia's front pages, mostly linked to Coates' right-hand man and media chief Mike Tancred as the AOC faces rare public scrutiny.\nOne of the claims came from former AOC chief executive Fiona de Jong, who alleged Tancred issued a \"highly detailed and personal threat\" against her.\nTancred faced new allegations published by Fairfax Media on Wednesday that he harassed another former staffer for taking two days off during the Beijing Olympics in 2008 due to a miscarriage.\n- 'Vindictive' campaign -\nHe has denied any wrongdoing but in a statement the AOC said Tancred was \"standing down from (his) position of AOC director of media and communications pending the outcome of any investigation of the complaint made against (him) by Fiona de Jong\".\nIn a further attempt to get on top of the growing crisis, Coates called a extraordinary meeting of the executive board on Wednesday evening which announced an independent investigation into the bullying allegations.\n\"Further, the AOC will commission an independent review, overseen by the incoming CEO, into workplace practices to ensure the best possible environment for our staff,\" it said.\n\"The AOC supports an environment free from discrimination, harassment and bullying and will not tolerate behaviours that differ from this standard.\"\nIn a letter this week to national Olympic sports chiefs and the AOC executive, Coates, 67, said he was the victim of a \"co-ordinated and vindictive campaign\" to get rid of him.\nHe also rejected De Jong's allegations that he oversaw a culture of bullying.\n\"On the eve of the election for president, there is clearly a co-ordinated and sadly vindictive campaign to damage me personally and to tarnish all that has been achieved at the AOC,\" he wrote in the letter obtained by the Sydney Daily Telegraph.\n\"This campaign is as disappointing as it is unfounded.\"\nHe denied failing to act on complaints of bullying and said the executive board was confident \"that the current AOC proper processes were followed in respect of the complaint by Ms de Jong\".","url":"https://www.dailymail.co.uk/wires/afp/article-4446124/Bitter-rift-rocks-AOC-Coates-fights-Olympic-job.html"}
