{"authors":["Jake Polden For Mailonline"],"date_download":"2018-10-23 01:34:16","date_modify":"2018-10-23 01:34:16","date_publish":"2016-01-11 12:35:38","description":"Videos posted on social media websites show numerous people from around the world attaching CDs to the arms of their glasses and throwing their heads forward to record themselves 'disking'.","filename":"data/vaneerConsumption/BizarrenewCDdiskingcrazesweepstheinternet.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/300A2EA000000578-0-image-a-87_1452515659312.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393736_At-use-obsolete-CDs-Bizarre-new-disking-craze-sees-social-media-users-attach-CDs-specs-throw-heads-forward-create-huge-eyes_1540258456.html","title":"Bizarre new CD 'disking' craze sweeps the internet","title_page":"Bizarre new CD 'disking' craze sweeps the internet | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"CDs will be positioned in front of the eyes, causing them to look enormous\nIf successful, discs will turn on a 90 degree angle and tuck behind lenses\nTrick involves attaching CDs to arms of glasses and throwing head forward\nSocial media users around the world have posted 'disking' clips to internet\nSocial media users across the world have found a purpose for their old CDs in a bizarre new craze currently sweeping the internet.\nVideos posted on YouTube, Facebook and Twitter show numerous people with two CDs attached to the arms of their glasses recording themselves 'disking'.\nThe craze involves people throwing their heads forward, causing the discs to turn on a 90 degree angle so that they cover the eyes.\nA mother and daughter filmed themselves lip syncing to Taylor Swift track Shake It Off while 'disking'\nDawn and her daughter throw their heads forward so the CDs cover their eyes and make them look huge\nIf done correctly the CDs will be held in place behind the lenses and will resemble enormous eyes.\nThe person performing the trick is then merely required to throw their head backwards and the discs will return to their original place.\nMany people have given the craze a go and have posted their attempts online - some as expected are more successful than others.\nA mother and daughter filmed themselves lip syncing to Taylor Swift track Shake It Off while throwing their heads back and forth in order to cover and reveal their eyes.\nChuck Lopez posted footage of himself and his other half 'disking' while sitting next to each other at home\nThe pair throw their heads forward and giggle as the huge discs tuck behind their lenses and cover their eyes\nWriting alongside the video on Facebook, Dawn Ward, who lives in Mitchell, Ontario, Canada, said: 'We are #disking off the haters! Shake it off and yes disking is a thing lol. Mother and daughter too much time on hands lol.'\nCommenting on the video, one viewer wrote: 'You are killing me and I love it!'\nElsewhere on the internet a man named Chuck Lopez posted footage of himself and his other half 'disking' while sitting next to each other at home.\nThe humorous clip shows the pair looking at each other before turning to face the camera and throwing their heads forward.\nA woman named Sharon appeared in a video posted on Facebook, but failed to perform the trick on her first attempt\nThe discs cover their eyes as they giggle silently before they then throw their heads backwards and the CDs return to their original position.\nThe clip concludes with the couple laughing at the amount of success they seemed to have.\nSmart Vision Optometry, a behavioural optometry group based in Bondi, Mosman and Pennant Hills in Sydney, Australia posted footage of a woman named Sharon 'disking' on their Facebook page.\nTake two: Sharon tries the trick again and succeeds, causing the video maker to laugh in hysterics\nThe first attempt sees only one disc cover the woman's left eye before she tries again and has a lot more success - causing the video maker to laugh.\nA final successful attempt was also posted on Facebook by user Bee Caskenette who, in the clip, says: 'So you know, just sitting around disking'.\nShe then throws her head forward and giggles when the two large CDs cover her eyes.","url":"https://www.dailymail.co.uk/news/article-3393736/At-use-obsolete-CDs-Bizarre-new-disking-craze-sees-social-media-users-attach-CDs-specs-throw-heads-forward-create-huge-eyes.html"}
