{"authors":["Joe Ciolli"],"date_download":"2018-10-30 22:52:39","date_modify":"2018-10-30 22:52:39","date_publish":"2018-07-28 00:00:00","description":"BI PRIME: A strange, unorthodox stock market strategy has generated market-crushing returns this year. Here's what it is and what the future holds.","filename":"data/vaneerConsumption/Bizarrestockmarketstrategyhasbeenhugelyprofitablestillgoing.json","image_url":"https://amp.businessinsider.com/images/5b5771f2d30cd433008b4659-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bizarre-stock-market-strategy-hugely-profitable-not-slowing-2018-7_1540939959.html","title":"Bizarre stock market strategy has been hugely profitable, still going","title_page":"    Bizarre stock market strategy has been hugely profitable, still going - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters / Lucas Jackson\nInvesting in money-losing companies would seem to defy traditional logic. But if you've been doing it, chances are your portfolio is sitting pretty.\nThat's according to Leuthold Group, which finds that unprofitable companies in the 2,000-stock small-cap universe have surged 14.5% on average this year. That dwarfs both the 9.2% return seen by their money-making counterparts and the 10.9% return for the entire Russell 2000 index.\nIt's relatively easy to replicate this success. All you have to do is screen the Russell 2000 for the companies whose bottom lines have been in the red over the past 12 months and then load up on shares.\nAs the chart below shows, as of right now, 31% of companies in the Russell 2000 have lost money over that period — so you have quite the selection if you wish to adopt this strategy.\nLeuthold Group\nWith that in mind, the chart raises questions. Most notably: How has the percentage of money-losing companies stayed so high in an environment characterized by full employment and slow wage growth? Considering that the measure was in this rarefied air around the past two bear markets, this would seem to signal impending doom.\nNot so fast, says Leuthold, which believes we're dealing with a unique set of circumstances. For one, the number of listed companies has shrunk as profitable but underleveraged firms have been snapped up in acquisitions.\nSecond, the historically easy lending conditions that have underpinned the more than nine-year bull market have helped keep shares of unprofitable companies afloat.\n\"Extremely loose monetary policy has kept alive corporate 'zombies' which might have perished in a normal interest rate environment,\" Doug Ramsey, Leuthold's chief investment officer, wrote in a client note. \"While the term zombie might be an inappropriate one for, say, a small biotech with a high burn rate, there's certainly evidence that extremely low interest rates have subsidized (if not incented) the perennial money losers.\"\nSo what's next? Is this strategy sustainable over the longer term?\nLeuthold says the coast is clear, at least for now. To arrive at that assessment, the firm compared the share of money-losing companies in the Russell 2000 with the real three-month Treasury bill rate.\nThe two measures have exhibited an inverse relationship over time. Put differently, the lower three-year borrowing costs have been, the more unprofitable companies there have been.\nAccording to Leuthold's analysis, the three-month rate has to climb all the way to 3.5% for there to be a trough in money-losing stocks. Considering it's sitting below 2%, it should remain open season on the dogs of the Russell 2000 for a while longer.","url":"https://www.businessinsider.com/bizarre-stock-market-strategy-hugely-profitable-not-slowing-2018-7"}
