{"authors":["Joseph Curtis For Mailonline"],"date_download":"2018-10-23 03:15:08","date_modify":"2018-10-23 03:15:08","date_publish":"2017-03-16 13:57:59","description":"The history of UK confectionery giant Terry's is going on show in its home town of York as a special exhibit opens featuring some old favourites and some of its more bizarre treats.","filename":"data/vaneerConsumption/Bizarresweetsfromthepast250yearsgoonshow.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E545E5500000578-0-image-a-116_1489670280916.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320060_Bizarre-sweets-past-250-years-show_1540264508.html","title":"Bizarre sweets from the past 250 years go on show","title_page":"Bizarre sweets from the past 250 years go on show | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bizarre sweets from the past 250 years will go on show alongside some modern favourites to mark the anniversary of one of Britain's biggest confectioners.\nThe history of Terry's will be unveiled at York's Chocolate Story museum in North Yorkshire, with the public able to see a selection of the most interesting's products in the firms history.\nThese include opium-based throat sweets, theatre chocolates with 'rustle-free paper' and other 'tasty' treats that included ingredients such as mercury, leading to the firm producing cards warning their products were 'poison'.\nTerry's of York was set up in 1767 by partners William Bayldon and Robert Berry and began by selling lozenges, comfits and other simple sweets.\nThey were then joined by Joseph Terry in the 19th Century, who had experience working with sugared pastilles and pills, taking the firm in a new direction.\nIt has gone on to produce iconic treats such as the Chocolate Orange, Neapolitan, Spartan and Waifa.\nJenni Shepherd, exhibition coordinator, said: 'It has been such a joy putting together the exhibition. As well as collecting wonderful objects I have also had the opportunity to talk to so many people who worked at Terry's.\n'The company has a fascinating history, from chemists to confectioners, but the stories from the factories themselves and the pride of the people who worked there is what makes the company so interesting. These unique tales and memories are what ensures that Terry's will always have a legacy in the city of York.'\nThe exhibition also reveals some of the secrets of the firm over the years, such as how wasted stock would often be sold to local farms to feed livestock, while the factory room where Terry's All Gold was produced was painted entirely in the colour, even the ceiling.\n250 Years of Terry's begins tomorrow and runs at York's Chocolate Story until December 31.\nThe history of UK chocolate brand Terry's will be unveiled at a new exhibition in Yorkshire until the end of the year. The firm is celebrating its 250th anniversary this year and York's Chocolate Story museum is giving the public a chance to look back at some old favourites and some of its more bizarre products. Pictured is exhibition coordinator Jenni Shephard with some of Terry's luxury chocolates\nPerhaps the most famous of Terry's products is the Chocolate Orange, first created in 1932 at the firm's factory in York. The exhibiton features a look back at the history of the confectionery, including its many different versions such as white chocolate, mint flavour and the Chocolate Orange bar, pictured. Since the Terry's factory in York closed in 2005, the Chocolate Orange has been produced in Poland\nMany people will visit the exhibit to catch a glimpse of some of Terry's more rare offerings, such as the Musk Lozenges, pictured. They began being produced as medicines for sore throats because the special gum used to make them was believed to be an old cough cure when mixed with rose water and sugar. Terry's and other confectioners produced musk lozenges until the 1920s, although they replaced perfume ingredient musk, obtained from deer, with an artificial substitute\nTerry's Whipped Cream Walnuts were a rival to the famous Nestle Walnut Whip brand decades ago but could not keep up with the popularity of its competitor and have since vanished from shop shelves\nAlthough the Chocolate Orange, pictured bottom, is the company's most famous brand, it was actually preceded by Terry's Dessert Chocolate Apple, pictured top, which was released in 1926, six years before Chocolate Oranges hit the shelves. Only one would go on to become popular, however. Also pictured is a Terry's Spartan Barrell, part of the firm's dark chocolate range\nAnother of Terry's famous brands to last the test of time is the All Gold boxes, it's best-selling assorted chocolates. It is believed to have first been produced at the Yorkshire factory in 1931 and contain a variety of milk chocolates of different styles and flavours\nAnother favourite selection box and an alternative to the All Gold range was Terry's Spartan Hard Centres, pictured, a range of dark chocolates which have since been discontinued\nTerry's was founded in York in 1767 by William Bayldon and Robert Berry and was initially named Bayldon and Berry Confectionery. The company name changed after scientist and chemist Joseph Terry became involved in 1823, taking over from Mr Bayldon when he retired after marrying the niece of Mr Berry. Pictured is the firm's shop in St Helen's Square, York, during the 1910s\nUsing the skills he learnt as a chemist, Joseph Terry developed new lines of chocolate, confectionery, sugared sweets, candied peel, marmalade, and medicated lozenges, such as this pack of linseed, licorice and chlorodyne lozenges, pictured. The latter ingredient is actually a combination of chloroform and morphine that was used as a painkiller\nIn the 1800s packaging was a lot more practical and less flashy as the sweets were advertised for their primary use as 'throat protectors' in 'damp, foggy or cold weather'. This poster is just one of many from the past two centuries that shows the huge changes in advertising in the confectionery industry over the years, with the long-forgotten Cyclists Refreshers sweets, right, an example of how they became more colourful and eye-catching\nAs well as some rare sweets and chocolates produced over the years, the exhibition also focuses on the most popular brands created by Terry's before it was bought by Kraft Foods in 1993. They include Waifa, which were similar to Kit Kats, Neapolitans - individually wrapped chocolates of different flavours, and assorted pastilles that were a specialty of Joseph Terry\nPerhaps the biggest impact Terry's has had is on Yorkshire itself, with the company employing tens of thousands of workers at its shops and factory between the 1700s and 2005, when its Chocolate Works headquarters was closed by Kraft. Pictured are some of the staff in the 1960s enjoying some Terry's treats on a break from work\nThe iconic Chocolate Works, pictured from above, first opened in 1926 and was branded 'the home of good chocolate'. It was briefly taken over during the Second World War by the Government to produce propeller blades for aircraft but quickly returned to confectionery once the war ended. Its iconic clock tower stood out in York until its eventual closure in 2005, when 300 jobs were lost\nPictured is the packing room at the Chocolate Works in the 1930s, where dozens of women were employed to load the confectionery into their specially designed boxes and wrappers. These included special 'theatre sweets' that were designed with 'rustle-free' paper so as not to disturb audiences\nBy the 1960s, the products Terry's was putting out were beginning to change, with post-war rationing and limited imports of cocoa meaning the firm had to stop producing its Chocolate Apple in order to focus on the more popular All Gold and Chocolate Orange brands. Pictured are workers putting together selection boxes in the packing room in the 1960s\nBy the 20th Century mass production was in full flow at Terry's, with conveyor belts such as this one pictured able to send hundreds of sweets down the line to be packed away constantly. The site itself is now set to be redeveloped into a mix of houses and offices\nHundreds of people were employed at the Chocolate works and by the mid 20th Century there was as much need for office workers, pictured, as there was for staff working directly with the products\nThe majority of workers in the factory were women, pictured here in the Chocolate Works canteen sometime in the early 20th Century. Tens of thousands of local people were employed in the factory from when it opened in 1926 to when it closed in 2005 and it provided a huge boost to the economy\nOne of the more quirky moments in Terry's history were the 'poison warning cards', pictured, the firm was forced to put in with some of its sweets and lozenges following the 1908 Pure Food Act. Some products contained mercury and thus could be dangerous if consumed, meaning Terry's had to flag up to consumers just exactly what they were putting in their mouths. Pictured is Ms Shepherd with the cards\nPictured left is a Terry's factory worker in the late 20th Century sorting through sweets to go into selection boxes. Pictured right is another of the more rare examples of Terry's products - the Orchid Cachou which were sweets similar to lovehearts, only smaller, and flavoured with orange water","url":"https://www.dailymail.co.uk/news/article-4320060/Bizarre-sweets-past-250-years-show.html"}
