{"authors":["Richard Gray For Mailonline"],"date_download":"2018-10-23 00:37:59","date_modify":"2018-10-23 00:37:59","date_publish":"2016-01-28 14:46:32","description":"Christmas tree worms (pictured) stick colourful gills out of the tubes they live in but they also have unusual light-sensitive patches that scientists at the University of Lund in Sweden are studying.","filename":"data/vaneerConsumption/BizarreChristmastreewormslookoutforpredatorsusingGILLS.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30AA1C6A00000578-0-image-a-16_1453986219578.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3420918_Bizarre-Christmas-tree-worms-look-predators-using-GILLS-Primitive-eyes-help-spot-shadows-ocean-floor_1540255079.html","title":"Bizarre Christmas tree worms look out for predators using GILLS","title_page":"Bizarre Christmas tree worms look out for predators using GILLS | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Research shows they are primitive eyes but link to an odd part of the brain\nThey are some of the weirdest looking creatures in the ocean, but a worm that looks like a multi-coloured Christmas tree may also have some of the strangest 'eyes' too.\nScientists say the marine worms have primitive eyes on the underside of their gills, which are normally used for breathing underwater, to help them spot danger approaching.\nThe light sensitive patches on the gills, which stick out of the worm's burrow like tree branches, allow the creatures to keep a look out while remaining mostly in their burrow.\nBrightly coloured Christmas tree worms, also known as Spirobranchus giganteus (pictured), earn their name due to the spiral of feathery gills and tentacles they extend out of their tube. Researchers have found the underside of their gills contain light-sensitive molecules that may be the oddest 'eyes' in the animal kingdom\nResearchers explained that the eyes of Spirobranchus giganteus may help to shed light on how eyes in the animal kingdom have evolved.\nDr Michael Bok, a marine biologist at Lund University who is studying these unusual visual systems, has found the worms have a unique type of light-sensitive molecule in their gills.\nHe said: 'Instead of looking at the most complex and sophisticated eyes nature has produced, I have shifted my attention to some of life's poorest preforming eyes found in annelid worms and other aquatic invertebrates.\n'I am interested in unraveling the functions and behaviours that drove the evolution of these simple eyes and perhaps also influenced the origins of the very first visual systems.'\nThe light-sensitive molecules seen in Christmas tree worms (pictured) are unlike any seen in the eyes of other species. Instead they appear to be what's known as an opsin that is normally found only in the brain\nChristmas tree worms are commonly found growing on corals in many parts of the world.\nThey build tubes where most of the worm hides, but they have long feather-like tentacles, or crowns, that extend out of the top of this tube.\nThe worms use these to catch tiny plankton passing in the water, which they feed upon, but they also contain gills that draw oxygen from the water so the creatures can breathe.\nDr Bok added that while many worms have eyes that require them to stick their heads out of their burrows or tubes, Spirobranchus giganteus has evolved a way to avoid this.\nInstead, patches on their gills have become packed with light-sensitive molecules that act as rudimentary eyes.\nThe worms (pictured) use the light-sensitive patches under their gills to detect approaching danger, allowing them to quickly withdraw into the tubes which house the bulk of their bodies\nHowever, researchers have found the gill eyes are not linked to the vision part of the brain but instead appear to go to other areas not normally involved in sight.\nWhile it is too early to say why these worms have evolved to use these proteins as the basis of their vision system, further research may help to provide clues about the evolution of eyes in general.\nHowever, Dr Bok continued that while these eyes are an elegant attempt to solve the problem of seeing out of their tubes without sticking their heads out, they are still fairly basic.\nThey are only capable of detecting shadows rather than giving the creatures a good view of their surroundings.","url":"https://www.dailymail.co.uk/sciencetech/article-3420918/Bizarre-Christmas-tree-worms-look-predators-using-GILLS-Primitive-eyes-help-spot-shadows-ocean-floor.html"}
