{"authors":["Harriet Mallinson","Stephanie Linning For Mailonline"],"date_download":"2018-10-23 01:13:16","date_modify":"2018-10-23 01:13:16","date_publish":"2016-01-28 15:26:15","description":"Motorist Ian Howard, 48, from Manchester, captured the terrifying near miss while travelling home from Liverpool on the M57 late on Friday afternoon.","filename":"data/vaneerConsumption/BlackBMW4x4SportbrakedinfrontlargelorryonM57incrashforcashattempt.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB039E00000578-0-image-a-9_1453994696015.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420755_Black-BMW-4x4-Sport-braked-large-14-wheel-lorry-M57-near-Liverpool-crash-cash-attempt_1540257196.html","title":"Black BMW 4x4 Sport braked in front large lorry on M57 in 'crash for cash' attempt","title_page":"Black BMW 4x4 Sport braked in front large lorry on M57 in 'crash for cash' attempt | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An 'unhinged' BMW driver was caught on camera as he slammed on his brakes metres in front of a 14-wheel lorry in a suspected 'crash for cash' attempt.\nMotorist Ian Howard, 48, from Manchester, captured the terrifying near miss while travelling home from Liverpool on the M57 late on Friday afternoon.\nMr Howard believes the man behind the wheel of the BMW, which had a child in the back seat, made the dangerous manoeuvre in a bid to force the lorry to smash into him so that he could make an insurance claim.\nBut the lorry was able to make an emergency stop, narrowly avoiding a major motorway pile up.\nReckless driving: The BMW brake lights flash as the car comes to an abrupt stop just metres in front of a lorry. Motorist Ian Howard, who captured the near-miss on his dash cam, suspects in was a 'cash for crash' attempt\nThe dash cam footage shows the black BMW breaking sharply directly in front of the large 14-wheel lorry while travelling in the middle lane of the motorway.\nThe quick-thinking lorry driver immediately spots the danger and brings his vehicle to a halt. Drivers behind the lorry were also able to slow in time, avoiding further accidents.\nMr Howard, who has been a driving lorry for almost 30 years, said the BMW passengers were lucky the lorry was not carrying a load, otherwise it might not have been able to make the abrupt stop.\nHe also saw a woman and a child aged around 10 in the car. He believes the driver would have used them to try and claim even more money in the high-risk scam.\nAn estimated £400million in so-called 'crash for cash' claims are made in Britain each year.\nLorry driver Mr Howard said: 'It's hard to say definitively what the BMW driver was doing but it's clear that the stop was deliberate and ridiculously dangerous.\n'From what I saw, he could have been attempting a \"crash for cash\" scam by trying to cause the lorry to bump into the back of him so the whole family could make a claim for whiplash and so on.\n'To do something like this is very dangerous at any time but to do it with what looks like your wife and young child in the car is seriously unhinged.\n'No normal person would even attempt this on a motorway - it's stupidly dangerous.\n'It could also have been from them being annoyed at something the lorry driver had done and had been retaliation. I see that a lot.\nMoments from disaster: The lorry driver was able to make an emergency stop, narrowly avoiding a pile up\n'The lorry was so close to hitting the car. Everyone in the BMW is very lucky the lorry wasn't carrying a load otherwise it's unlikely he would have been able to stop - it would have quite possibly resulting in a multiple vehicle pile-up.\n'If he had done it to me, my lorry was loaded with 44 tonnes of liquid so I would never have been able to stop in time - it would have been a terrible crash.'\nMr Howard shared the footage on social media and the video has already been viewed more than 135,000 times.\nHe estimates that the woman in the car was around 35 years old, while the child in the backseat was around 10.\nSuspect manoeuvre: Lorry driver Mr Howard fears the BMW could have been a 'crash for cash' attempt\nMr Howard said: 'I had a similar thing happen to me in my lorry a few years ago and I went into the back of a driver. We don't know if it was a \"crash for cash\" but once they found out I had a personal dash cam it was dropped.\n'After that more than 300 lorries at our company had dash cams put in. It just happens quite a lot so it is better to be safe and be able to show what happened.\n'Whatever went on, the driver was very stupid and the whole family and the lorry driver is very lucky for it not to have resulted in a bad accident.'\nCrimestoppers claims that 'crash for cash' is worth roughly £400million a year nationwide.\nThe website states: 'Crash for Cash scams are not a victimless crime. As honest policyholders we pick up a collective bill for fraud through increased premiums.'\nThe 'crash for cash' hotspot top 10 postcode list is topped by Bradford BD9 followed by Birmingham B10. London N18 is just outside the top ten in 13th place.","url":"https://www.dailymail.co.uk/news/article-3420755/Black-BMW-4x4-Sport-braked-large-14-wheel-lorry-M57-near-Liverpool-crash-cash-attempt.html"}
