{"authors":[],"date_download":"2018-10-30 01:06:16","date_modify":"2018-10-30 01:06:16","date_publish":"2017-04-04 00:00:00","description":null,"filename":"data/vaneerConsumption/BlackLivesMatterPhillychapterbanswhitepeoplefrommeeting.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2017_04_black_lives_matter_philly_chapter_bans_white_people_from_meeting_1540861576.html","title":"Black Lives Matter Philly chapter bans white people from meeting","title_page":"Black Lives Matter Philly chapter bans white people from meeting","title_rss":"NULL","source_domain":"americanthinker.com","text":"In response to a concerned white person who didn't want to \"overstep,\" BLM tweeted that the meeting was \"black centered.\"\nThe Philadelphia chapter of Black Lives Matter have explicitly banned white people from an organizational meeting.\nDaily Caller:\n@BLMPhilly is it just your meetings that are black only spaces? or are all activities this way? I want to support but don't want to overstep pic.twitter.com/X5yvFBh9jU — Esther Greenwood (@_kevinjamesfan6) April 2, 2017 Our meetings are black centered https://t.co/Ew5Z5dEI5k — BLM Philly (@BLMPhilly) April 3, 2017 Anyone who identifies as \"African disapora\" is allowed to attend, the group explained over Twitter. \"If you identify as a person of the African Diaspora You can attend our meetings and become a member. If not you can support us in other ways,\" Philly BLM said in a tweet. \"African Disapora\" usually refers to people who were taken out of Africa during the Transatlantic Slave Trades.\nDoes that mean that a recent immigrant from Africa isn't welcome?\nOne Twitter user pointed out that Civil Rights leader Martin Luther King, Jr. worked side by side with whites to accomplish his goals. Philly Black Lives Matter responded by saying that was King's decision. He made that choice and we have made ours. White people can support us but they cannot attend our meetings. https://t.co/7FeZ4hW3CY — BLM Philly (@BLMPhilly) April 3, 2017 The group also referred to Malcolm X, saying he too had banned whites from his meetings on race.\nMalcolm X was heavily criticized by other black leaders for that policy. As it turned out, Dr. King was right, and Malcolm X and other black nationalists were wrong.\nRegardless, the Philadelphia BLM chapter is perfectly willing to take white people's money and embrace their support for the organization. But when it comes to planning and organization, whites are not wanted. It raises the question: why would anyone – white or black – sit still for this kind of discrimination? If blacks aren't expected to tolerate being excluded, neither should whites.","url":"https://www.americanthinker.com/blog/2017/04/black_lives_matter_philly_chapter_bans_white_people_from_meeting.html"}
