{"authors":["Lee Stranahan"],"date_download":"2018-10-30 20:59:04","date_modify":"2018-10-30 20:59:04","date_publish":"2016-07-06 14:13:37","description":"A police-involved shooting in Baton Rouge, Louisiana, is a case study in how social media platforms manipulate stories.","filename":"data/vaneerConsumption/BlackLivesMatterSpinHasAlreadyBeguninBatonRougeShooting.json","image_url":"https://media.breitbart.com/media/2016/07/Alton-Sterling-shooting-protest-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_07_06__1540933144.html","title":"Black Lives Matter Spin Has Already Begun in Baton Rouge Shooting","title_page":"Black Lives Matter Spin Has Already Begun in Baton Rouge Shooting","title_rss":"NULL","source_domain":"breitbart.com","text":"A police-involved shooting in Baton Rouge, Louisiana, has begun to make headlines across the world, and because the case is in its very beginning stages, it is a perfect case study in how social media platforms like Twitter have become an Institutional Left manipulation of how a story works. Already, protests have begun in Baton Rouge, and the story is making headlines in NBC News, New York magazine, The Huffington Post, and international outlets like the BBC and Al Jazeera.\nAs this article went to press, many facts in the shooting case of Alton Sterling by Baton Rouge police early Tuesday morning are still not known, but that has not stopped the activist left and the Black Lives Matter movement from immediately jumping on the story as what they claim is another example of the oppression of minorities in America and the murder of “innocent black men.”\nFor the Left, the timing could not be more perfect, as the story—complete with a dramatic but incomplete video of the shooting—has the potential to push Hillary Clinton’s email scandal off the front page, as well as agitating progressive activists across the country with the Republican National Convention in Cleveland only about a week away.\nThe Facts as We Know Them\nHere are a few relevant facts about the Alton Sterling shooting from Baton Rouge’s The Advocate:\n37 year-old Alton Sterling was shot “by a Baton Rouge police officer Tuesday morning after “some type of altercation” with two officers, officials said.”\n“Around 12:35 a.m., Baton Rouge police responded to the Triple S Food Mart at 2112 N. Foster Drive after an anonymous caller indicated that a man in a red shirt who was selling CDs outside the store pointed a gun at someone, telling them to leave the property.”\n“The initial results of an autopsy performed Tuesday show Sterling died due to a homicide and suffered multiple — meaning more than two — gunshot wounds to the chest and back.\nA 48-second cellphone video captured by a bystander — which circulated at a protest about the shooting later in the day — shows an officer firing at least one round into a man’s chest\n“He’s got a gun! Gun,” an officer says, prompting the lawman closest to the camera to draw an object from his holster.\n“You fucking movee, I swear to God,” says an officer, before the second officer, farther from the viewer, is seen pointing a weapon down at the man’s chest.\nBody cameras came loose and dangled from the officers’ uniforms during the incident.\nFriends and family of Sterling met outside the convenience store on Tuesday night to protest the shooting. At just about 6 p.m., about 40 to 50 people had gathered at the store, some carrying signs and chanting “Black lives matter” and “Hands up, don’t shoot.” The crowd swelled to more than 100 people by 7:30 p.m.\nOfficials in Baton Rouge are waiting for facts, and the story will continue to unfold as new details emerge and new protests are almost certain to occur, but the media, activists, and politicians on the Left never let a crisis go to waste.\nTwitter: The Institutional Left’s New Playground\nOne of the topics I discuss in my upcoming movie, The Bloody Road to Cleveland, is how the average citizen does not understand how the information they receive on stories is filtered and manipulated by the Institutional Left. In fact, many stories that make their way into the media are based on a “playbook” by the Left.\nFor our purposes, I’m defining the Institutional Left as the collection of groups such as attorneys, activist, politicians, and the media that share a common leftist ideology and work in concert as a political manipulation machine that promotes a wider narrative.\nIn this case, the broad narratives that provide the “moral of the story”are common ones for the left, which date back more than 50 years from groups like the Black Panther Party to the Occupy Wall Street and Black Lives Matter movements. The larger themes being promoted in the Alton Sterling case are:\nAmerica is a racist oppressor state.\nMinorities are constant victims of this oppression.\nPolice brutality is commonplace as a mechanism of this oppression.\nConservatives and Republicans are the ones behind this oppressive agenda.\nAt this early stage of the Alton Sterling story, we are already seeing the activists, media, and even some politicians get into the act, and they are using social media as the place they gather.\nIn the 2016 election cycle, previously neutral social media platforms like Twitter and Facebook have now developed ways to steer readers toward content that introduces a whole new frontier for media manipulation.\nTake Twitter’s “Moments” feature that is a showcase for curated tweets on subjects ranging from politics to pop culture. No credits are given for these Moments, so the reader has no way of telling who is presenting the information or what their bias might be.\nTwitter almost immediately posted a Moment about the Alton Sterling story, and for you to understand the way media bias on Twitter works, take a look at the information that Twitter chose to deliver to its users.\nYou’ll note that in addition to the video of the shooting and some factual material from a local reporter, the material also includes a tweet from Black Lives Matter activist DeRay Mckesson and a number of tweets presenting one-sided details about the victim, including that he was a father and a quote from someone who liked him. Both the tone and content of the tweets are clearly meant to elicit sympathy for the late Mr. Sterling and a combination of shock, sadness, and contempt for the police.\nThe tweets Twitter presented in its Moments leave out things like Mr. Sterling’s extensive criminal record.\nTwitter’s Moment on Alton Sterling Shooting\nCoroner: Man shot by BRPD multiple times to chest, back; 2 officers placed on leavehttps://t.co/uasn84zdgw pic.twitter.com/SvjlhyO8mM — WALB News 10 (@WALBNews10) July 6, 2016\n**TRIGGER WARNING**\nRemember his name – #AltonSterling\nWhen will it end? When is enough, enough? pic.twitter.com/7KxiOaOkny — Jessie K. (@JMKTV) July 6, 2016\nBRPD Cpl. McKneely says both body cams “dangled” off officers’ uniforms but didn’t fall off, still captured audio, in officer-inv. shooting — Maya Lau (@mayalau) July 5, 2016\nAbdullah Muflahi, owner of store where Alton Sterling killed in BR, describes seeing shooting by officer pic.twitter.com/08ABnQwr6a — Maya Lau (@mayalau) July 5, 2016\nStore owner said he heard one of the officers say, “Just leave him.” Updated story https://t.co/36IOgSZjuf Follow @BrynStole 4 more @ scene — Maya Lau (@mayalau) July 5, 2016\nAccording to Louisiana law, the officers who killed #AltonSterling can wait up to 30 days before being questioned. pic.twitter.com/POAOLiZJaV — deray mckesson (@deray) July 6, 2016\nBRPD spox Cpl. L’Jean McKneely said officers’ names will be released “first thing in the morning” Wednesday. https://t.co/36IOgSZjuf — Maya Lau (@mayalau) July 6, 2016\n“He was nice. He wasn’t a bad guy. He was respectable.” – Darian Gardner told The Advocate about #AltonSterling pic.twitter.com/PN997DT6En — Philip Lewis (@Phil_Lewis_) July 6, 2016\nAlton Sterling was the father of five. https://t.co/FRj3MRF6PV — E. Alex Jung (@e_alexjung) July 6, 2016\nEric Garner selling cigarettes.\nAlton Sterling selling CDs. Both tackled by cops. Both end up dead. — Alex Medina (@mrmedina) July 6, 2016\nMakeshift memorial for “Big Alton” feet from spot of shooting; security camera in top right (police took video) pic.twitter.com/urboAfcihL — Bryn Stole (@BrynStole) July 6, 2016\nProtestors now parking in street to block traffic, raising fiats & chanting “black lives matter” #AltonSterling pic.twitter.com/aGu463ZTN4 — Bryn Stole (@BrynStole) July 6, 2016\nWhat would’ve been the BRPD’s response to #AltonSterling tragic death had it not been caught on camera?!? My prayers are w/ his family. — ShakariSBriggs (@ShakariSBriggs) July 6, 2016\nWhat Twitter Is Leaving Out\nYou would not know it from reading Twitter’s Moments, but almost as quickly as the story began to spread on the social media network, a number of conservative and alt-right citizen journalists began to do their own quick research on the story and immediately found information they contradicted the narrative of Sterling as a good-natured father of five.\n\"Yet another fake example of a black man being gunned down by the police for doing nothing wrong…\" #AltonSterling https://t.co/RX0Gs0iJor — Mike Cernovich (@Cernovich) July 6, 2016\nThe facts about Sterling’s criminal history may be relevant to his shooting by showing that he had a good reason to resist arrest based on his possession of a gun and felony convictions, but their omission by Twitter and other media is significant because it does not allow the honest reader to form a full opinion based on the selective positive information they posted about him.\nThis pattern of the media presenting only a one-sided narrative was on full display in other modern American race issues, such as the Trayvon Martin and Michael Brown cases. Much of the American public has caught on to this, yet the Institutional Left continues this tactic in case after case because it has proven to get the activists into a frenzy.\nListen to the discussion of this article on Breitbart News Daily on SiriusXM:","url":"https://www.breitbart.com/politics/2016/07/06/black-lives-matter-spin-has-already-begun-in-baton-rouge-shooting/"}
