{"authors":["Lee Stranahan"],"date_download":"2018-10-30 22:08:41","date_modify":"2018-10-30 22:08:41","date_publish":"2015-07-24 01:48:42","description":"BlackLivesMatter—a group that demands a “racial justice agenda”—invokes the words of convicted cop killer Assata Shakur at “all its events.”","filename":"data/vaneerConsumption/BlackLivesMatterPaysHomagetoMarxistCopKilleratEveryEventItHolds.json","image_url":"https://media.breitbart.com/media/2015/07/CIh5Jf4UkAAulV4.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_23__1540937321.html","title":"BlackLivesMatter Pays Homage to Marxist Cop Killer at Every Event It Holds","title_page":"BlackLivesMatter Pays Homage to Marxist Cop Killer at Every Event It Holds | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"BlackLivesMatter—the activist group that demands a “racial justice agenda” that includes constant criticism and activism against police—invokes the words of convicted cop killer Assata Shakur at “all its events.”\nAt a recent event for female bloggers, BlackLivesMatter leaders had a crowd of thousands repeating lines from a letter written by Shakur that include an explicit reference to the Communist Manifesto.\nThe BlackLivesMatter group, which has met with President Obama and largely been given a free pass by the media, has skyrocketed to national prominence after its involvement with unrest and rioting in Ferguson, Baltimore, and a recent takeover of events the Netroots Nation conference for progressive Democrats in Phoenix, Arizona.\nAssata Shakur, who has been living in exile in Cuba for over thirty years, is a hero to communist revolutionaries for her involvement in the 1960s and 1970s with a violent, criminal Black Panther Party offshoot called the Black Liberation Army. Shakur and the group robbed several banks as a revolutionary act and eventually killed a New Jersey State Trooper with his own gun after a highway stop in 1973.\nAfter her conviction, Shakur escaped prison when other Black Liberation Army members visiting her pulled a gun and took guards hostage. Shakur lived on the lam for several years, as her associates refused to cooperate with authorities, until fleeing to Cuba in 1984. Shakur has also been lionized by ’60s radicals like the Weather Underground’s Kathy Boudin, who Breitbart News reported had named her son Chesa after Shakur’s real name, JoAnne Chesimard.\nA glowing article on the wildly popular website for women Blogher.com details a keynote event at the recent BlogHer conference in New York City, where Essence magazine Editor-in-Chief Vanessa De Luca interviewed BlackLivesMatter co-founders Patrisse Cullors and Opal Tometi, who described their respect for the convicted criminal communist.\nCullors said that an Assata Shakur quote, which the group recites at all its events, is perfect to symbolize that the #BlackLivesMatter should matter to everyone, regardless of race. Starting in a whisper, and ending in a shout, the nearly 2,000 attendees spoke as one. It is our duty to fight for our freedom\nIt is our duty to win.\nWe must love each other and support each other.\nWe have nothing to lose but our chains.\nThe lines come from a letter that Shakur wrote titled “To My People,” where she describes herself as a “Black revolutionary” who “declared war on the rich who prosper on our poverty, the politicians who lie to us with smiling faces, and all the mindless, heart-less robots who protect them and their property.”\nThe last line that BlogHer attendees repeated on command, about “nothing to lose but our chains,” is a reference by Shakur, an avowed Marxist, to the Communist slogan “Workers of the world, unite! You have nothing to lose but your chains!”\nNone of Shakur’s violent history or the context of the quote was explained to the crowd of female bloggers who were exhorted to repeat her words and honor her by BlackLivesMatter leaders.\nIronically, the company who brought the commies to the mommies is the very essence of corporate capitalism; a website conglomerate called SheKnowsMedia that bought BlogHer last year. As Bizwoman reported:\nSheKnows.com publishes multi-media content about fashion, entertainment, food, health and parenting. The company is headquartered in Scottsdale, Ariz., and is owned by the private equity firm Great Hill Partners. The company currently has advertisers like Macy’s, Pepsi, Clorox and Kellogg’s. And SheKnows.com’s CEO Philippe Guelton said he expects SheKnows to be “very close” to its goal of $100 million in revenue next year, according to Ad Age.\nOf course, one woman wasn’t mentioned at all during BlogHer’s profitable confab: Rosa Foerster, the woman whose husband was killed in the line of duty by the remorseless Shakur over forty years ago.\nHere’s what Assata Shakur said about the shooting in the same letter that BlogHer attendees were quoting from:\nI want to apologize to you, my Black brothers and sisters, for being on the new jersey turnpike. (sic) I should have known better. The turnpike is a checkpoint where Black people are stopped, searched, harassed, and assaulted. Revolutionaries must never be in too much of a hurry or make careless decisions. He who runs when the sun is sleeping will stumble many times. Every time a Black Freedom Fighter is murdered or captured, the pigs try to create the impression that they have quashed the movement, destroyed our forces, and put down the Black Revolution. The pigs also try to give the impression that five or ten guerrillas are responsible for every revolutionary action carried out in amerika. (sic)\nShakur feels no guilt for the “pig” she was convicted of murdering, no concern for the the people whose lives she altered forever. The BlogHer conference planners and BlackLivesMatter leaders showed no interest in the woman who was Shakur’s other victim. They ignored the woman who told the New York Times in 2013:\n“I hope that they can get (Shakur),” Trooper Foerster’s widow, Rosa, 72, said from her home in Florida. “She’s still there. She has her freedom, and I don’t have my husband. That’s what’s hard about it.”\nLike they did with the Occupy Wall Street protests, the media has presented their audience with a sanitized image of a radical, far-left group. BlackLivesMatter is not an organization of well-meaning activists; they are dedicated radicals with an anti-police agenda, paying homage to the violent Black Liberation Army gang–another frightening example of how Marx has gone mainstream during the Obama administration.","url":"https://www.breitbart.com/politics/2015/07/23/blacklivesmatter-pays-homage-to-marxist-cop-killer-at-every-event-it-holds/"}
