{"authors":["Associated Press"],"date_download":"2018-10-23 01:19:24","date_modify":"2018-10-23 01:19:24","date_publish":"2016-01-28 15:38:30","description":"NEW YORK (AP) — Special guests at this year's Rock and Roll Hall of Fame Induction Ceremony will include The Black Keys, Rob Thomas and Metallica's Lars Ulri...","filename":"data/vaneerConsumption/BlackKeysamongguestsatRockHallinductionceremony.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:37866ee6477a41018c3578f376b4a51a-4vVdYopwYQ7f641721b07aed2019-401_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421077_Black-Keys-guests-Rock-Hall-induction-ceremony_1540257564.html","title":"Black Keys among guests at Rock Hall induction ceremony","title_page":"Black Keys among guests at Rock Hall induction ceremony | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Black Keys among guests at Rock Hall induction ceremony\nNEW YORK (AP) — Special guests at this year's Rock and Roll Hall of Fame Induction Ceremony will include The Black Keys, Rob Thomas and Metallica's Lars Ulrich.\nN.W.A., Chicago, Deep Purple, Cheap Trick and Steve Miller are the Rock Hall's 2016 class and will be inducted on April 8 at Barclays Center in Brooklyn, New York.\nTickets for general public go on sale Feb. 5, the Rock Hall also announced Thursday.\nFILE - In this June 12, 2015, file photo, Dan Auerbach of The Black Keys performs at the Isle of Wight Festival in Newport, Isle of Wight, England. Special guests at this year¿s 2016 Rock and Roll Hall of Fame Induction Ceremony will include The Black Keys, Rob Thomas and Metallica¿s Lars Ulrich. (Photo by Jim Ross/Invision/AP, File)\nMore than 900 voters picked the soon-to-be inductees. Artists are eligible for inclusion 25 years after the release of their first recording.\nPerformers and presenters at the ceremony will be announced at a later date. The event will air on HBO in April.\n____\nOnline:","url":"https://www.dailymail.co.uk/wires/ap/article-3421077/Black-Keys-guests-Rock-Hall-induction-ceremony.html"}
