{"authors":["John Sexton"],"date_download":"2018-10-30 18:19:41","date_modify":"2018-10-30 18:19:41","date_publish":"2015-11-10 03:55:57","description":"University of Missouri's president bowed to pressure and resigned from his position. It was the end of a sometimes ugly pressure campaign.","filename":"data/vaneerConsumption/BlackUniversityofMissouriStudentsHadSomeGoodReasonstoBeUpsetandAlsoSomeBogusOnes.json","image_url":"https://media.breitbart.com/media/2015/11/university-of-missouri-student-protesters-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_09__1540923581.html","title":"Black University of Missouri Students Had Some Good Reasons to Be Upset and Also Some Bogus Ones","title_page":"Black University of Missouri Students Had Some Good Reasons to Be Upset and Also Some Bogus Ones | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The president of the University of Missouri bowed to pressure Monday and stepped down from his position. It was the end of a sometimes ugly pressure campaign which seemed to have only a tangential connection to the actual outrage that started students down this road.\nBack in September, Payton Head, the president of the Missouri Student Association was walking near campus when he was screamed at by someone in a passing truck. He later wrote about that on Facebook, saying, “I just want to say how extremely hurt and disappointed I am. Last night as I walking through campus, some guys riding on the back of a pickup truck decided that it would be okay to continuously scream NIGGER at me.”\nThe incident was apparently not reported to the police and may not have even involved other students, but Head rightly pointed out it was inexcusable behavior. “I don’t want to see the next freshman coming in from the south side of Chicago, you know, who’s black, who walks around and is called the N-word,” Head told the NY Times.\nThere was another incident just a couple weeks later, where black students preparing for homecoming were called the N-word by an apparently drunk student on campus. They reported that incident to police, and the student in question was reportedly identified and moved off campus pending an investigation. A group of black alumni wrote a letter, mentioning other incidents that had happened on campus over the past 11 years, including a 2011 incident when someone spray-painted the N-word on a statue at a residence hall.\nIt should be obvious this type of behavior is not acceptable. The fact that two incidents happened within as many weeks is reason for black students to wonder why people on campus (or off) feel it’s okay to demean black college students. The anger is understandable, and the students had cause to let the school know they were fed up and wanted something to change.\nWhat’s not clear is that anyone at University of Missouri, including now-resigned President Tim Wolfe, disagreed. The school’s chancellor wrote a letter and created a video about the second incident (he was out of the country when it happened). He wrote in part, “Racism exists at MU. I want to make it clear that we do not tolerate racism and prejudice on our campus. We will identify this individual from last night, and this person will be disciplined according to our campus conduct policies.”\nSome of the anger directed at President Wolfe seemed to stem from an incident in which a dozen protesters shut down a homecoming parade by blocking the car carrying Wolfe and his wife. The protesters say they were angered that Wolfe didn’t get out of his car to talk to them, but that reason seemed to merge with a more dubious claim that Wolfe’s driver hit protester Jonathan Butler with his car.\nThe supposed car incident was raised by one of the protesters in this video (she’s the person speaking on the phone), and it was in the list of demands put forth by the protesters. A portion of demand #1 read: “We want Tim Wolfe to admit his gross negligence, allowing the driver to hit one of the demonstrators, consenting to the physical violence of bystanders and lastly refusing to intervene when Columbia Police Department used excessive force with demonstrators.”\nExcept none of that is evident in videos of the incident.\nA video apparently shot by the protesters shows protesters blocking Wolfe’s car for about 10 minutes as hundreds of people line the street to see a parade. As one protester after another addresses the crowd with a bullhorn, the driver tries to inch past the group. When they move to block him, he stops. One protesters rests his rear end on the car, and at 4:00 in this video, the car inches forward and just touches him before backing away several feet. The protesters follow the car, and when it tries again to turn aside, one student, apparently Butler, leaps in front of it so his legs are touching the bumper. You can see it happen at 6:40.\nThis claim to be hit by a vehicle is a tactic we’ve seen before at Occupy protests. There was a lawyer in New York who claimed he was run over by a police scooter. In fact, video (and other reporters on the scene) showed the man in question stuck his own foot under the scooter after it had stopped and began screaming as if he were hurt.\nAs for violent demonstrators, there were a few people in the crowd who tried to intercede by getting between the car carrying President Wolfe and the protesters. One of them, a heavy man in a white shirt, was briefly shoving people backward with his rear end, but that was the extent of the “violence.” No one was injured. After 10 minutes, police showed up and moved everyone out of the street.\nDespite the fact that what the protesters claimed happened didn’t happen, Wolfe later apologized for his behavior that day, saying:\nI regret my reaction at the MU homecoming parade when the ConcernedStudent1950 group approached my car. I am sorry, and my apology is long overdue. My behavior seemed like I did not care. That was not my intention. I was caught off guard in that moment. Nonetheless, had I gotten out of the car to acknowledge the students and talk with them perhaps we wouldn’t be where we are today. I am asking us to move forward in addressing the racism that exists at our university – and it does exist. Together we must rise to the challenge of combatting racism, injustice, and intolerance.\nBut by that point, the protesters weren’t interested in dialog. Jonathan Butler, the alleged victim of the car bump at the homecoming parade, started a hunger strike, which he said would not end until University of Missouri President Wolfe resigned. Wolfe exchanged notes with Butler, but the strike went on. When Wolfe tried to meet with other students last week, a representative of the protest group replied, “I don’t want to talk to anybody. I want for you to resign. I need you to leave.”\nThe situation became more dire for Wolfe when the school’s football team suggested they might not play again until Wolfe resigned. This morning, Wolfe finally gave in to the demands, announcing his resignation and saying, “We have to respect each other enough to stop yelling at each other and start listening.”\nBlack students at University of Missouri had some genuine reasons to be angry and also some that seem more imaginary than real. Ousting President Wolfe will be seen as a victory for the protesters, but they only seem to have eliminated someone who was willing to be an ally.","url":"https://www.breitbart.com/politics/2015/11/09/black-university-missouri-students-good-reasons-upset-also-bogus-ones/"}
