{"authors":["Portia Crowe"],"date_download":"2018-10-30 23:34:46","date_modify":"2018-10-30 23:34:46","date_publish":"2016-12-06 00:00:00","description":"Blackstone CEO Steve Schwarzman is excited about President-elect Donald Trump's America.","filename":"data/vaneerConsumption/BlackstonesSchwarzmanonTrumpsAmerica.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_blackstones-schwarzman-on-trumps-america-2016-12_1540942486.html","title":"Blackstone's Schwarzman on Trump's America","title_page":"    Blackstone's Schwarzman on Trump's America - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Blackstone CEO Stephen Schwarzman. Thomson Reuters Blackstone CEO Steve Schwarzman is excited about President-elect Donald Trump's America.\nThe billionaire private equity executive, who was recently named chair of Trump's economic advisory forum, described the vast regulatory changes that could potentially come to Wall Street — and corporate America — under the new administration. He was speaking at a Goldman Sachs conference.\n\"If you look at the architecture of the world, it's going to change very substantially,\" Schwarzman said.\nHe described the different \"piles\" of regulatory changes to expect. The first, he said, are executive actions that can be reversed relatively quickly. The second are changes that will require hearings; those will take more like six or nine months.\nThen there are individuals heading regulatory agencies that will eventually turn over, which could take as long as a year and a quarter, Schwarzman said. Lastly, there are changes that can only be addressed through legislation, which are much less likely because they need to be passed in the Senate.\n\"But this is going to be very, very substantial,\" Schwarzman said.\nIn addition to regulatory changes, he said, we will see tax reform via reconciliation, which only requires a majority of Senate votes.\n\"It doesn't require any Democrats, assuming the Republicans vote as a block,\" he said. \"Both Republicans and Democrats have wanted tax reform but they couldn't do it for ideological reasons, and now don't have to worry about those ideological reasons because you get enough votes, you can just change the law.\"\nHe said the country needs to see both corporate and individual tax reform, as a large portion of US companies are registered as limited partnerships and other non-corporate entities.\n\"We also have the ability, under reconciliation, to bring back all this trapped cash abroad,\" Schwarzman said, adding that we could see a 10% tax rate on cash held abroad. \"So that will probably come back into the US economy.\"\nSchwarzman said there is no element of the current regulatory structure that won't undergo a \"significant\" change, and that the revamp will drive GDP, make the US a friendlier place for foreign capital, and help accelerate growth.\n\"I anticipate with a pretty high level of confidence that this stuff is going to happen,\" he said. \"And this is as big a change happening all at once — you know, I've been in finance for 45 years — this'll be the biggest.\"","url":"https://www.businessinsider.com/blackstones-schwarzman-on-trumps-america-2016-12"}
