{"authors":["Zoe Szathmary For Dailymail.Com"],"date_download":"2018-10-22 21:48:02","date_modify":"2018-10-22 21:48:02","date_publish":"2016-01-11 01:38:45","description":"The incident happened Friday at a Wells Fargo on Peachtree Road in Atlanta, Georgia. The rapper, whose real name is Sam Benson, has said that police apologized to him.","filename":"data/vaneerConsumption/BlacYoungstadetainedinAtlantaafterwithdrawalfromWellsFargobank.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/3001F55300000578-0-image-a-18_1452476548316.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393212_Rapper-Blac-Youngsta-confused-check-fraud-suspect-detained-Atlanta-police-withdrawing-200K-Wells-Fargo-bank_1540244882.html","title":"Blac Youngsta detained in Atlanta after withdrawal from Wells Fargo bank","title_page":"Blac Youngsta detained in Atlanta after withdrawal from Wells Fargo bank | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A rapper was arrested by police in the parking lot of an Atlanta Wells Fargo bank just moments after he withdrew $200,000 from his account to buy a supercar.\nBlack Youngsta - real name Sam Benson - posted an image to his Instagram account of Friday's incident which shows him in cuffs with an officer standing over him.\nThe caption on the photograph reads, 'Look at how they treat a young rich n*****'.\nAtlanta police apologized afterwards and claimed it was a case of mistaken identity after they initially thought that Benson was a fraud suspect.\nScroll down for video\nIncident: Rapper Blac Youngsta took out $200,000 at a Wells Fargo in Atlanta, Georgia, and was soon handcuffed by police, who had the wrong check forgery suspect\nPerformer: The rapper's real name is Sam Benson. Benson is with Collective Music Group\nBlac Youngsta was at a Wells Fargo on Peachtree Road (pictured) when the encounter took place\nBenson told WXIA: 'I come out the bank, I see the police, I'm walking to the car, I see one of them point to my bag like \"him.\"\n'They come bum rushing me at the car, and put me on the ground, put guns to my head, you know, so I'm like \"What I'd do?\"\n\"A lady was like I wasn't supposed to have... $200,000 on me.\n'So I'm like, \"I'm a millionaire. Like, how can I not have $200,000 on me?\"'\n'They said something about a bogus check, and they thought I did the bogus check too, but I'm legit.'\nPolice apologized to him, Benson told WXIA.\nAn image on Blac Youngsta's Instagram account shows $100 bills and a gun on a bed\nPolice apologized for what happened, Benson told local media. The caption for this image on Instagram said in part: 'WHEN U AINT GOIN TO THE TELLER NO MO & THEY GOTTA OPEN THE VAULT'\nOn Saturday, the Atlanta Police Department said in a statement: 'The 911 caller stated that a male was trying to cash a forged check valued at $24,000 .\n'The description of the male provided to police was limited and conflicting.'\nAuthorities wrote that: 'The Rapper, who identified himself as \"Blac Youngsta\", by coincidence happened to be at the bank at the same time.\n'Upon police officers arriving on scene, they made a brief detention of him until a positive identification by the caller was made.\n'This incident did not directly involved Blac Youngsta, nor was he accused of committing a crime.'\nAtlanta police said that: 'The caller identified Mr. Charles Darnell Edward as the male attempting to cash the fraudulent $24,000 CHECK.","url":"https://www.dailymail.co.uk/news/article-3393212/Rapper-Blac-Youngsta-confused-check-fraud-suspect-detained-Atlanta-police-withdrawing-200K-Wells-Fargo-bank.html"}
