{"authors":["James Dunn For Mailonline"],"date_download":"2018-10-23 00:24:59","date_modify":"2018-10-23 00:24:59","date_publish":"2016-01-28 14:20:41","description":"The American Civil Liberties Union (ACLU) study has called for action against racial bias after the study showed a huge disparity in the number of prosecutions in Florida.","filename":"data/vaneerConsumption/BlackFloridamotoristsarestoppedandticketedtwiceasmanytimesaswhites.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AAD7EF00000578-0-image-a-29_1453990833372.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421028_Black-motorists-stopped-ticketed-not-wearing-seatbelt-TWICE-times-white-drivers-Florida_1540254299.html","title":"Black Florida motorists are stopped and ticketed twice as many times as whites","title_page":"Black Florida motorists are stopped and ticketed twice as many times as whites | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Black motorist in Florida are stopped and ticketed for not wearing a seatbelt twice as many times as white drivers in Florida, a new study has found.\nIn urban areas, black people are punished for violations up to four times more than white people, revealed the American Civil Liberties Union (ACLU) study.\nThey are now calling for an investigation into the disparity from the Attorney General's Office of Civil Rights and County Commissions, which oversees the police.\nBlack motorist in Florida are stopped and ticketed for not wearing a seatbelt twice as many times as white drivers in Florida, a new study has found. File picture\nThe ACLU's analysis is based on publicly available data on the Florida Safety Belt Law which, legally, law enforcement agencies must report to state officials every year.\nThe analysis of the most recent statewide seatbelt citation data shows the law has been applied much more often to Black motorists than to white motorists.\nIn 2014, Black motorists across Florida were stopped and ticketed for seatbelt violations at nearly twice the rate as white motorists overall.\nSeatbelt enforcement by specific county sheriff's departments resulted in even greater disparities.\nThe study shows that black people are stopped:\n4 times more often than white motorists by the Escambia County Sheriff's Office in 2011 (the most recent year that this agency reported seatbelt citation data);\n3 times more often than white motorists by the Palm Beach County Sheriff's Office in 2014;\n2.8 times more often than white motorists by the Orange County Sheriff's Office in 2014\nIn some urban areas, black people are punished up to four times more than white people, the American Civil Liberties Union (ACLU) study shows\nThe report notes that the behaviour of black people and white people when it comes to wearing seatbelts is very similar and does not account for the differences identified in the report.\nA recent study by the Department of Transport for Florida revealed that 91.5 per cent of white people wore their seatbelts, compared to 85.8 per cent of black people.\nNusrat Choudhury, an attorney with the ACLU's Racial Justice Program and co-author of the report, said in a statement:'It raises a red flag when seatbelt enforcement by specific agencies leads to racial disparities that exceed even the dramatic statewide gap.\n'These agencies must take steps to address the disparities and promote fair and impartial policing.'\nIt also identifies law enforcement agencies that have failed to report their data to the relevant authorities, which is required to do so under the Florida Safety Belt Law.\nThe ACLU now wants new legislation that would penalize law enforcement agencies that fail to comply with the statute's reporting requirement,\nIt also recommends that law enforcement collect and analyze data for all traffic and pedestrian stops.","url":"https://www.dailymail.co.uk/news/article-3421028/Black-motorists-stopped-ticketed-not-wearing-seatbelt-TWICE-times-white-drivers-Florida.html"}
