{"authors":["Penny Starr"],"date_download":"2018-10-30 21:24:57","date_modify":"2018-10-30 21:24:57","date_publish":"2018-07-13 01:02:05","description":"A coalition of black pastors ask House Speaker Paul Ryan to censure Rep. Maxine Waters for \"inciting mob rule\" against Trump officials.","filename":"data/vaneerConsumption/BlackPastorsCallforMaxineWaterstoBeCensuredforIncitingMobRule.json","image_url":"https://media.breitbart.com/media/2018/07/Maxine-WatersMark-Burns-APGetty-Images.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_12__1540934697.html","title":"Black Pastors Call for Maxine Waters to Be Censured for Inciting ‘Mob Rule’","title_page":"Black Pastors Call for Maxine Waters to Be Censured for Inciting ‘Mob Rule’ |","title_rss":"NULL","source_domain":"breitbart.com","text":"A coalition of black pastors held a press conference on Thursday at the National Press Club to push House Speaker Paul Ryan to censure Rep. Maxine Waters (D-CA) for encouraging people to confront members of President Donald Trump’s administration.\nThe coalition is a network of some 800 pastors from across the country representing two million African Americans in their congregations.\n“Her call to extremism based on where another American citizen works or with whom they associate must be sternly addressed by Speaker Ryan,” Star Parker, president of the Center for Urban Renewal and Education (CURE) said at the press conference. “An apology is not enough.”\n“Maxine Waters’ actions are shameful,” Diante Johnson, president and founder of the Black Conservative Federation, said at the press conference.\nIn June, Waters told supporters in California to confront Trump administration officials wherever and whenever they could.\n“Let’s make sure we show up wherever we have to show up,” Waters said. “If you see anybody from that cabinet in a restaurant, in a department store, at a gasoline station, you get out, and you create a crowd, and you push back on them, and you tell them they’re not welcome anymore, anywhere.”\nHer remarks came after Department of Homeland Security Secretary Kirstjen Nelson was harassed while dining at a restaurant in Washington, D.C. and Press Secretary Sarah Sanders and her guests were denied service at a restaurant in rural Virginia.\nThe coalition sent several letters to Ryan’s office about the censure but have not heard back, according to Parker, who spoke to Breitbart News about the effort.\n“What Maxine Waters did was incite people to mob rule; to try to overthrow the will of Americans,” Parker told Breitbart News. “And that’s Third World.”\n“In fact, the beauty of America is that we are open and free; that we are civil in our discussions,” Parker said.\nBut, Parker said, as African Americans the coalition thought it important to speak out on behalf of the 1.4 million blacks who voted for Trump and who disagree with the left-wing agenda Waters and others are promoting.\nAnd, ironically, that agenda is marginalizing black people because of what they believe, Parker said.\n“For [Waters] to take us back to the point of Jim Crow because now instead of your ethnicity it’s your values,” Parker said. “This is not acceptable.”\nJohms Gool of the Christian Victory Center in Charlotte, N.C., said at the press conference that free speech for all Americans is at stake.\n“The liberty to disagree is under attack,” Gool said.\nFollow @PennyStarrDC on Twitter","url":"https://www.breitbart.com/politics/2018/07/12/black-pastors-call-for-maxine-waters-to-be-censured-for-inciting-mob-rule/"}
