{"authors":["Aaron Klein"],"date_download":"2018-10-30 20:57:06","date_modify":"2018-10-30 20:57:06","date_publish":"2016-08-05 16:03:11","description":"Black Lives Matter’s muscle-flexing across Britain on Friday is the latest sign the radical group has a significant international influence.","filename":"data/vaneerConsumption/BlackLivesMatterStokesGlobalChaos.json","image_url":"https://media.breitbart.com/media/2016/07/Black-Lives-Matter-Berlin.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_08_05__1540933026.html","title":"#BlackLivesMatter Stokes Global Chaos","title_page":"#BlackLivesMatter Stokes Global Chaos","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Black Lives Matter’s muscle-flexing across Britain on Friday is the latest sign the radical group has a significant international influence and is seeking to take its signature brand of troublemaking global.\nThe New York Times reported on the movement’s UK direct action on Friday, which included the shutdown of a road leading to the bustling Heathrow Airport:\nOn Friday morning, activists unfurled a giant banner and lay down on an access road near Heathrow, bringing traffic to a standstill for several hours. The police arrested 10 people.\nFive more people were arrested in Birmingham, Britain’s second-most populous city, after blocking traffic leading to the airport. Four activists were arrested in Nottingham, a city of more than 300,000 in the Midlands, after protesters blocked trams and buses by lying down in front of the Theatre Royal.\nThe excuse for the latest civil disobedience was the fifth anniversary of the police shooting a 29-year-old unarmed black man in Tottenham. BLM has latched onto such shootings to stoke racial tension ever since its founding in the U.S. in 2013 to protest the acquittal of George Zimmerman in the shooting death of teenager Trayvon Martin.\nBLM’s latest platform, ratified earlier this week, goes beyond anti-police sentiment and reaches into generalized, global Occupy-esque territory, including a call for “progressive restructuring of tax codes;” “public financing of elections and the end of money controlling politics;” and “universal access to the internet without discrimination and full representation for all.”\nThe new platform’s 40 policy proposals also demand free tuition to public universities, reparations to black people for slavery, and socialist-style “protections for workers in industries that are not appropriately regulated.”\nBLM further wades into the Israeli-Palestinian conflict, outrageously and baselessly accusing Israel of “genocide” against Palestinians, while calling for activists to “build invest/divestment campaigns that ends US Aid to Israel’s military industrial complex.”\nThe platform was unveiled one week after BLM activists came here to Israel ostensibly to protest the Jewish state’s alleged “occupation” of so-called Palestinian land.\n“In the fight for dignity, justice, and freedom,” BLM stated on its Facebook page last Friday, “the Movement for Black Lives is committed to the global shared struggle of oppressed people, namely the people of occupied Palestine and other indigenous communities who for decades have resisted the occupation of their land, the ethnic cleansing of their people, and the erasure of their history and experiences.”\nLast month, Washington Post foreign affairs writer Ishaan Tharoor noted at the newspaper’s “WorldViews” section that “Black Lives Matter is a global cause.”\nTharoor wrote:\nYet as events in recent days show, the language and politics of the Black Lives Matter movement have tremendous global echoes. Solidarity protests took place in Britain, Germany, the Netherlands and Canada.\nOn Sunday in London, WorldViews noted, “crowds packed Oxford Street, Brixton High Street and Westminster, holding signs that read ‘I do this for my brother’ and ‘No racist police.'”\nThat month saw Black Lives Matter solidarity rallies in the UK, Germany, the Netherlands and Canada. In Vancouver alone 500 people reportedly congregated at the Vancouver Art Gallery as part of a Black Lives Matter worldwide protest.\nWriting last August at The Root, Janaya Khan, co-founder of Black Lives Matter Toronto, recognized “Black Lives Matter Has Become a Global Movement.”\nIn the two years since its conception, the Black Lives Matter movement has transformed from a powerful, U.S.-based unifier to a globalized movement connecting black and oppressed people all over the world.\nLet’s be clear: The reach of anti-black racism is not confined to the borders of North America. Black Lives Matter has become a transformative outlet for all black people from different historical, cultural, socioeconomic and political identities. It is a source of solidarity for the survivors of colonization, exploitation, capitalism and police brutality.\nAaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio.” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.\nWith research by Brenda J. Elliott.","url":"https://www.breitbart.com/middle-east/2016/08/05/blacklivesmatter-stokes-global-chaos/"}
