{"authors":["Abc News","More Karma"],"date_download":"2018-10-30 00:54:46","date_modify":"2018-10-30 00:54:46","date_publish":"2018-10-29 02:36:51","description":"Blackburn said an \"angry mob\" of protesters interrupted her rally.","filename":"data/vaneerConsumption/BlackburnsaysangrymobinterruptedrallyinTennesseewithLindseyGraham.json","image_url":"https://s.abcnews.com/images/Politics/marsha-blackburn-trump-tenn-ap-ps-180730_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Politics_blackburn-angry-mo_2298a839b4b8c728438c377fad960441_story_id=58819868_1540860886.html","title":"Blackburn says 'angry mob' interrupted rally in Tennessee with Lindsey Graham","title_page":"Blackburn says 'angry mob' interrupted rally in Tennessee with Lindsey Graham - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"Tennessee Rep. Marsha Blackburn said an \"angry mob\" of protesters interrupted her senatorial campaign rally on Sunday during a moment of silence for the victims of this weekend's mass shooting.\nInterested in Midterm Elections? Add Midterm Elections as an interest to stay up to date on the latest Midterm Elections news, video, and analysis from ABC News. Add Interest\nSecurity officers forcibly removed several people from Blackburn's \"Get Out The Vote\" rally with Sen. Lindsey Graham, R-S.C., on Sunday evening after several \"appalling\" and \"despicable\" disruptions, according to the 2018 Senate candidate's campaign.\nBlackburn, the state's Republican nominee in the upcoming Senate race, said protesters threw punches and shouted in the midst of a moment of silence for the victims in Pittsburgh, where 11 Jewish worshipers were fatally shot Saturday.\nDrew Angerer/Getty Images\nShe blamed the protests on her Democratic opponent, former Tennessee Gov. Phil Bredesen, who rejected that assertion.\nAlyssa Hansen, a Breseden campaign spokeswoman, told ABC News the protesters \"have no association whatsoever with our campaign.\"\n\"Like Governor Bredesen said, it is time to turn down the partisan rhetoric and start acting as Americans and Tennesseans first and partisans second,\" according to a statement from the Bredesen campaign. \"This is happening from both sides -- it's a shame that people disrupted Congresswoman Blackburn's event and it is a shame that Congresswoman Blackburn's campaign staffers have been proudly screaming at 37 of Governor Bredesen's events.\"\nBlackburn, in her own statemend, added: \"The liberal angry mob made it clear they are active in Tennessee and will stop at nothing to disrupt civil political discourse. They resisted law enforcement, and they interrupted a moment of silence for the victims in Pittsburgh.\"\nBlackburn was interrupted more than once during her 11-minute presentation, which highlighted accomplishments by the Trump administration, including lower tax rates and better unemployment numbers.\nMark Humphrey, Pool via AP\nSome protesters jeered and yelled statements like \"Marsha Blackburn is a white supremacist\" and \"impeach Trump\" during the event, according to video posted on social media. Blackburn's supported tried drown out the protesters with cheers of their own -- some chanted \"U-S-A\" and \"jobs not mobs\" as the protesters were being removed.\nMark Brown, a spokesman for the Tennessee Democratic Party, said the protesters aren't affiliated with his organization or Bredesen for Senate \"in any way.\"\nABC News' Christopher Donato contributed to this report.","url":"https://abcnews.go.com/Politics/blackburn-angry-mob-interrupted-rally-tennessee-lindsey-graham/story?id=58819868"}
