{"authors":["Svea Herbst-Bayliss"],"date_download":"2018-10-30 21:12:52","date_modify":"2018-10-30 21:12:52","date_publish":"2016-12-20 00:00:00","description":"It's a rare move for the private equity titan, which invests roughly $70 billion in hedge funds.","filename":"data/vaneerConsumption/BlackstoneGroupiscallingitquitsonSenfina.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_blackstone-group-senfina-hedge-fund-2016-12_1540933972.html","title":"Blackstone Group is calling it quits on Senfina","title_page":"    Blackstone Group is calling it quits on Senfina - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Schwarzman, Chairman and CEO of The Blackstone Group, speaks during an interview with Bartiromo, on her Fox Business Network show; \"Opening Bell with Maria Bartiromo\" in New York. Thomson Reuters\nBlackstone Group is winding down its \"big bet\" hedge fund Senfina Advisors LLC after it faced mounting double-digit losses on its investments this year, a spokeswoman confirmed on Tuesday.\nIt is a rare setback for the private equity titan, which invests roughly $70 billion in hedge funds, and launched Senfina, which means \"everlasting\" in Esperanto, to great fanfare in 2014.\nThe fund was one of last year's top performers, gaining 20 percent, but is down 24 percent this year through November after wrong-way bets in its so-called center book where declines were most pronounced.\nOther \"multi-manager\" hedge funds, which make leveraged concentrated bets on a range of securities, have also suffered this year after being wrong-footed by the pace of U.S. interest rate hikes and the post-election rally in the United States.\n\"The market environment in 2016 for long/short hedge funds was unprecedented. We did what was in the best interest of our investors to preserve their capital,\" said Paula Chirhart, a Blackstone spokeswoman.\nThe ticker and trading information for Blackstone Group is displayed at the post where it is traded on the floor of the New York Stock Exchange. Thomson Reuters\nA number of Senfina's nearly one dozen portfolio managers, including Parag Pande, who joined Blackstone in 2014 and now heads Senfina, will be leaving the firm, said a source familiar with the decision who asked not to be named because the discussions are private.\nPande ran Senfina's so-called center book, featuring fund managers' best ideas.\nSome Senfina managers are expected to stay on at Blackstone and much of the $1.8 billion that Senfina invests for large clients, including state pension funds, is expected to stay at Blackstone, the source said.\nBlackstone's Alternative Asset Management arm (BAAM), headed by J. Tomilson Hill, saw inflows of $1.65 billion this year and overall performance for BAAM has been positive, Chirhart said.\nBAAM began laying the groundwork for Senfina years ago as demand for multi-manager funds picked up. Blackstone started hiring fund managers, including Pande, who came from Ziff Brothers, in 2014.\nBy the end of last year, Senfina was one of Blackstone's crown jewels. But after 2015's strong gains, some Senfina managers struggled early in 2016 as worries about slower growth in China and the pace of U.S. rate hikes sent stocks spiraling lower. Losses at the start of the year were deepest in the center book.\nStephen Schwarzman, chairman and CEO of the Blackstone Group. REUTERS/China Daily\nIn the January-June period, Senfina lost 15 percent after a 12 percent gain in the second half of 2015. Things appeared to stabilize some in the second quarter with a 2 percent gain. Adjustments were made in the center book.\nLosses mounted anew in November with a 6 percent drop. Again the majority of losses were seen in the center book which was caught off guard by Donald Trump's unexpected White House victory and the ensuing stock market rally. Some managers betting on industrial and consumer companies were also hurt as markets repositioned.\nSince its launch Senfina's performance has slightly negative but redemption requests have been minimal, the spokeswoman said.\nSenfina isn't the only multi-manager hedge fund to struggle this year. Folger Hill Asset Management, founded by former SAC Capital Advisors chief operating officer Sol Kumin, is off 15.3 percent through November.\nManagers like Senfina use large numbers of small investment teams and centralized risk oversight to keep bets on securities increasing in value, or long positions, roughly in balance with those on them declining, or shorts.\nThe strategy also uses leverage, or borrowed money, which can exacerbate losses if risks are not properly controlled. The so-called market-neutral approach is supposed to preserve client money in any market environment.\n(Editing by Carmel Crimmins and James Dalgleish)","url":"https://www.businessinsider.com/blackstone-group-senfina-hedge-fund-2016-12"}
