{"authors":[],"date_download":"2018-10-22 21:19:36","date_modify":"2018-10-22 21:19:36","date_publish":"2014-05-06 22:40:47","description":"It may not be particularly majestic, but the Black Knight combination ground vehicle and helicopter has gotten itself into the air.","filename":"data/vaneerConsumption/BlackKnightMilitaryTruckCopterTakesFirstTentativeFlight.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/424841/140506-dark-knight-jms-1939_79d660d3d5e87193159443010e96efa4.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_innovation_black-knight-military-truck-copter-takes-first-tentative-flight-n98666_1540243176.html","title":"'Black Knight' Military Truck-Copter Takes First Tentative Flight","title_page":"'Black Knight' Military Truck-Copter Takes First Tentative Flight","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIt may not be particularly majestic, but the Black Knight combination ground vehicle and helicopter has gotten itself into the air. The experimental transport platform faces an uncertain future, but it's fun to watch anyway.\nBlack Knight was originally designed for the Army, and later proposed for a Defense Advanced Research Projects Agency (DARPA) project aimed at creating \"transforming\" vehicles that could function both on the ground and in the air. The Defense Department later changed the focus of the program — meaning Black Knight would have to find funding elsewhere.\nIt's made by Advanced Tactics, one of the many military contractors that compete for money and attention from the Pentagon and its deep R&D pockets. And while DARPA ended up not backing the company's prototype, it's hardly the only one giving out money for projects like this. The company has continued developing Black Knight with money from Army, Marine and Air Force lab programs.\nAlthough the description sets the Black Knight up as a rugged, do-anything vehicle, it has to be said that the video gives the impression of a slow, rickety contraption that looks like it might be knocked over by a well-placed kick. The flight pictured, which took place in late March, actually was done with \"outrigger landing gear\" — essentially training wheels.\nOf course, it's only an early prototype, and for $2 million, a cheap one at that — by military standards, at least. That said, with a few more years of development it may yet be superior to Humvees, armored personnel carriers and helicopters when it comes to getting in and out of a crowded and broken battlefield. Whether the military thinks so is another matter; Advanced Tactics suggests it might be a good fit for an Office of Naval Research program, but judgment from that quarter is yet to come.","url":"https://www.nbcnews.com/tech/innovation/black-knight-military-truck-copter-takes-first-tentative-flight-n98666"}
