{"authors":["Daniel Martin Policy Editor For The Daily Mail"],"date_download":"2018-10-22 20:54:43","date_modify":"2018-10-22 20:54:43","date_publish":"2017-03-16 00:13:05","description":"There is little to stop a repeat of the Iraq War fiasco because official rules on ‘sofa government’ are so lax, MPs said last night.","filename":"data/vaneerConsumption/BlairwillnotfaceprobeintomisleadingParliament.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/3E19FDC800000578-0-image-a-29_1489622766236.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318398_Blair-not-face-probe-misleading-Parliament_1540241683.html","title":"Blair will not face probe into misleading Parliament","title_page":"Blair will not face probe into misleading Parliament | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"There is little to stop a repeat of the Iraq War fiasco because official rules on ‘sofa government’ are so lax, MPs said last night.\nIn 2003, Tony Blair sidelined his Cabinet and took his country into battle after telling US president George Bush: ‘I will be with you, whatever.’\nA Commons committee warned that 14 years on, there remains an absence of safeguards in place to prevent a prime minister from disregarding Cabinet procedures.\nHistory may repeat itself: The MPs said Tony Blair would not face an investigation into whether he misled Parliament before the Iraq War in 2003\nThe public administration committee also said Mr Blair would not face an investigation into whether he misled Parliament over the Iraq War unless ‘new and relevant’ evidence emerges.\nThey said the Iraq Inquiry, led by Sir John Chilcot, did not provide a ‘sufficient basis’ to hold such a probe.\nMr Blair developed a reputation while prime minister for cutting out his ministers and instead taking decisions with a small group of advisers – a practice known as ‘sofa government’.\nIn a critical report on the Chilcot Inquiry, the cross-party group of MPs warned that it would still be possible for a prime minister to disregard the proper Cabinet decision-making process.\nThey highlighted the example of the July 2002 note from Mr Blair to then US president Mr Bush.\n‘It is generally agreed that the prime minister of the day should never have written “I will be with you, whatever” in his letter, against the official advice and without the explicit agreement of his key ministers,’ the report said.\n‘This is just one of a number of examples identified by the Iraq Inquiry of the breakdown of collective ministerial decision-making over the development of UK policy on Iraq.\n‘It is no longer acceptable that the present arrangements should continue without stronger means to prevent key ministers, or even the whole Cabinet, from being sidelined.’\nOn his conscience: Mr Blair is pictured at last week's unveiling of a national memorial honouring the armed forces and civilians who served in Iraq and Afghanistan\nThe report said the Cabinet Secretary – the head of the civil service – should be able to object formally to a decision if it has not been taken following the correct procedure.\nCommittee chairman Bernard Jenkin said: ‘There is simply nothing even a Cabinet Secretary can do to stop a prime minister from doing this again, short of resignation.\n‘There was a lack of collective Cabinet decision-making, at a time when clear thinking and a culture of challenge was most needed. The failure to engage Cabinet on such decisions cannot be allowed to happen again, but there is no mechanism to ensure that.’\nThe committee also criticised the seven years it took the Chilcot Inquiry to complete its work and said for many it had failed to ‘provide some closure’.","url":"https://www.dailymail.co.uk/news/article-4318398/Blair-not-face-probe-misleading-Parliament.html"}
