{"authors":["Ari Bines"],"date_download":"2018-10-31 01:43:18","date_modify":"2018-10-31 01:43:18","date_publish":"2018-09-14 15:46:13","description":"In the history of fashion, wardrobe malfunctions, like Blake Lively's surprising see-through shirt, are always there to remind us that celebrities are people, too. The former Gossip Girl star has always been memorable for being a very put-together…","filename":"data/vaneerConsumption/BlakeLivelysSeeThroughTopMadeForAHilariousMisunderstandingWithAPhotographer.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/37f382e3-405c-4631-a2f9-d150a938eede-getty-1028936654.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_blake-livelys-see-through-top-made-for-a-hilarious-misunderstanding-with-a-photographer-11918361_1540950198.html","title":"Blake Lively’s See-Through Top Made For A Hilarious Misunderstanding With A Photographer","title_page":"Blake Lively’s See-Through Top Made For A Hilarious Misunderstanding With A Photographer","title_rss":"NULL","source_domain":"bustle.com","text":"In the history of fashion, wardrobe malfunctions, like Blake Lively's surprising see-through shirt, are always there to remind us that celebrities are people, too. The former Gossip Girl star has always been memorable for being a very put-together kinda gal. If there ever were an award for pulling off a plaid pant suit, there's no doubt Lively would steal it for the taking. However, it turned out that Blake's inexperience with men's mesh shirts is what put her in fashion malfunction territory when picking out a new look.\nHere's the background. Blake was about to strike the red carpet for the release of her new thriller A Simple Favor in New York City. The suit stunna suddenly noticed that instead of her ensemble being at the forefront of the premiere, her top was mistakenly giving her girls the center spotlight.\nGregory Pace/Shutterstock\n\"I didn't realize it was see-through the shirt, so that's not a look that I was going for because it's a men's shirt. I didn't know they made see-through [men's shirts],\" she told Jimmy Fallon on Thursday's episode of The Tonight Show.\nBut like any slinky suit dresser, she had a backup plan at the ready. As we could expect in true mishap emergency fashion, she hunted down some hotel duck tape. \"I'm in my hotel and I call and I say, 'Hey, can I have like the mechanical department...I need duck tape quick.'\"\nAs she reminisced to Fallon about approaching the red carpet, Lively, at the time, was worried there'd be a slip of the tape she'd set in place, paranoid that everyone was thinking what was only in her head...and then her fear was realized.\nThe Tonight Show Starring Jimmy Fallon on YouTube\n\"This guy goes, 'Blake, Blake, your bleep are amazing.' It sounded like he was saying \"tits.\" I was like, 'Are we saying that? Like have you been on Google in the past year. Like this is not ok,'\" she said. \"And the woman next to him goes, 'I mean they are.' I was like, 'Well, thank you.' And he's like, 'Your husband's bleep are even better!'\"\nBut before Lively could work herself up, believing the photographer to be crude and mannerless, that's when it dawned on the fashionista that he was making mention of something entirely different. \"I was like, 'Oh tweets. Twitter! My tweets. My tweets are amazing.'\"\nSumming up the cackle-induced story with a sign of relief, the actress was still left curious about one thing. \"I was so relieved that it was about my mind and then after, I was like, 'But how are my...how are they?\"\nIn this house, we never judge, because everyone's got a beautiful pair. But surely, Blake, your hot anti-superhero husband will remind you how they are. Need we remind you, you're perfect — and so are your tweets.","url":"https://www.bustle.com/p/blake-livelys-see-through-top-made-for-a-hilarious-misunderstanding-with-a-photographer-11918361"}
