{"authors":["Julia Emmanuele"],"date_download":"2018-10-31 01:41:19","date_modify":"2018-10-31 01:41:19","date_publish":"2018-09-14 19:20:50","description":"Blake Lively is a fashion icon who has rocked an insane amount of fashion-forward looks now, but when she was growing up, the only outfit that mattered was her Baby Spice-inspired mini dress and platform sneakers. And for good reason. Earlier this…","filename":"data/vaneerConsumption/BlakeLivelysCommentsOnDressingUpAsBabySpiceShowWhatAMassiveSpiceGirlsFanSheReallyIsVIDEO.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/8ab69671-1278-45f6-81c8-ca6cfe07dd64-getty-1020303656.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_blake-livelys-comments-on-dressing-up-as-baby-spice-show-what-a-massive-spice-girls-fan-she-really-is-video-11923544_1540950079.html","title":"Blake Lively's Comments On Dressing Up As Baby Spice Show What A Massive Spice Girls Fan She Really Is - VIDEO","title_page":"Blake Lively's Comments On Dressing Up As Baby Spice Show What A Massive Spice Girls Fan She Really Is — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Blake Lively is a fashion icon who has rocked an insane amount of fashion-forward looks now, but when she was growing up, the only outfit that mattered was her Baby Spice-inspired mini dress and platform sneakers. And for good reason. Earlier this summer, a photo showing Lively at a Spice Girls concert went viral, and Lively's new comments on dressing up as Baby Spice prove what a big fan she really is. In fact, she's such a major fan, she still has the exact outfit that made one young fan think she actually was Emma Bunton.\nIn an interview with Jimmy Fallon on Thursday's Tonight Show, Lively talked about the viral photo, which shows a young Lively dressed in full Baby Spice regalia, standing with a little girl. The actor revealed that she kept the outfit that she wore to a Spice Girls concert way back when she was a teenager. \"I sort of thought I was Baby Spice for a while,\" Lively said, adding, \"I still do! I'm a hoarder, so I still try to jam my feet into those shoes. I still have them, and I have the 'Baby' necklace.\" The actress' love of Baby Spice (and a baby blue dress with boa trim, made by her mother) resulted in Lively's first ever taste of fame, years before she was ever known as Serena van der Woodsen — hence the viral photo.\n\"I was so excited because somebody asked me to take a picture with their daughter, and this little girl was so happy because she thought I was Baby Spice. I didn't want to be famous when I was a kid, I didn't know what I was going to do, but in that moment, I was a superstar!\" Lively recalled. \"I was a Spice Girl! I always remember this moment where this little girl was just so excited to see me because she met Baby Spice, and then I saw the picture because this girl found it and she was really... nonplussed.\"\nThough the moment may have lost a little bit of its magic when Lively finally saw that fan's photo once again, there was one big upside to her decision to share that magical moment with the world: Her outfit was approved by Baby Spice herself, Emma Bunton, who commented on the photo when Lively reposted it on Instagram.\n\"So cute, you're rocking those pigtails, @blakelively,\" the Spice Girl wrote, to which Lively replied, \"@emmaleebunton I'm officially [four skull and bones emoji, aka \"dead\"]. Forever bowing down to you. I cannot believe you know who I am. This will never be normal.\"\nThe Tonight Show Starring Jimmy Fallon on YouTube\nAnd yes, Lively means every single word and emoji of that response: \"My only life goal as a kid was to marry Ricky Martin and meet all five Spice Girls,\" she joked to Fallon. \"I still haven't accomplished that, but I can't believe she knows who I am.\"\nBut even though she's a movie star now (and is married to one of the biggest actors in the world, Ryan Reynolds), Lively still gets starstruck all the time when interacting with her childhood icons. \"I was such a fangirl, and I still sort of am. But now I'm just a stalker! I get to meet these people and become friends with them and they have no idea that I have their posters on my wall,\" she told Fallon. \"I sit at home with my braces and my teddy bear, like 'Oh my god!'\" It turns out that no matter how famous or glamorous you become, your inner Spice Girls fangirl will truly never die.\nLively may finally get her chance to live her childhood dream of meeting the Spice Girls — and continuing to build her friendship with Bunton — when the iconic '90s girl group goes back on tour. In June Melanie Brown (a.k.a. Mel B) announced that the girls were planning to hit the road once more on another reunion tour, although she wasn't able to offer any possible time period for when fans can buy tickets.\nHowever, when they do go on sale, fans should try and take a photo with every single tall blonde rocking pigtails and platforms — you never know, it might actually be Blake Lively.","url":"https://www.bustle.com/p/blake-livelys-comments-on-dressing-up-as-baby-spice-show-what-a-massive-spice-girls-fan-she-really-is-video-11923544"}
