{"authors":["Meghan Demaria"],"date_download":"2018-10-31 01:41:17","date_modify":"2018-10-31 01:41:17","date_publish":"2018-09-14 19:36:42","description":"All's well that ends well in Bachelor Nation, apparently. Blake Horstmann and Jason Tartick didn't get Becca Kufrin's final rose, but that doesn't mean they're feeling down. Blake and Jason's new photo together hints that the two Bachelorette…","filename":"data/vaneerConsumption/BlakeJasonsPhotoTogetherProvesTheseBacheloretteAlumsWillBeJustFine.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/cff9a2ed-167c-4039-b055-5cc35063589a-149913_9596.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_blake-jasons-photo-together-proves-these-bachelorette-alums-will-be-just-fine-11924348_1540950077.html","title":"Blake & Jason's Photo Together Proves These 'Bachelorette' Alums Will Be Just Fine","title_page":"Blake & Jason's Photo Together Proves These 'Bachelorette' Alums Will Be Just Fine","title_rss":"NULL","source_domain":"bustle.com","text":"All's well that ends well in Bachelor Nation, apparently. Blake Horstmann and Jason Tartick didn't get Becca Kufrin's final rose, but that doesn't mean they're feeling down. Blake and Jason's new photo together hints that the two Bachelorette runners-up seem to have let go of any heartbreak, as well as any potential hard feelings about getting passed over for the coveted Bachelor lead spot.\nTo fans' delight, Blake shared the photo on Friday afternoon. In the image, both of them have wide grins and similar poses. Each man has one leg crossed over the other, with a drink in hand. If fans didn't know these were Bachelorette competitors, this could easily be an ad for whiskey, or whatever the two of them are drinking — and the red velvet couch they're sitting on adds a nice touch. And with his pocket square, Jason looks a bit like he's in a suit ad, too. Based on Blake's Instagram tag, it looks like the image was taken at the club Cube Toronto. Are he and Jason on a mini-vacation in Canada?\nAs for his caption, Blake came up with a simple message to go along with the photo, writing, \"I think we will be alright...\" Yup, it sure seems like it.\nWhen Becca chose Garrett Yrigoyen at the end of her Bachelorette season, fans wondered what would happen to Blake and Jason. Neither of the men appeared on Bachelor in Paradise after Becca sent them home, which led some fans to wonder whether one of them could be the next Bachelor. For his part, Jason said he'd be open to being The Bachelor, giving fans a brief glimmer of hope that the Buffalo native might return to TV. After Colton left Paradise, though, ABC announced that Colton will be the next Bachelor when the show returns in January.\nBut it looks like Blake and Jason are continuing their friendship off-camera — and they're supportive of Colton's journey, too. After ABC's announcement, Jason shared a message of support for Colton, writing on Instagram, \"Let the Bachelor Party Planning commence!\"\nBlake also offered congratulations on The Bachelor news, sharing a photo of himself with Colton and Jason. He wrote in his Instagram caption,\n\"I have nothing but respect for these two and I wanna wish @coltonunderwood luck on his Journey. I really truly hope you find the woman you wanna spend your life with! Good luck man! #thebachelor\"\nIn the same caption, Blake also thanked fans for supporting him after The Bachelorette's finale. \"I wanna thank you all for the support over the last few months,\" he wrote on Instagram. \"It has been incredibly humbling and it means the world.\"\nAfter Jason and Blake didn't make it to the end of the road with Becca, fans might have thought they were bummed about being sent home and not being chosen for The Bachelor. But judging by the recent posts and the new photo Blake shared, it looks like both of them are in a good place right now. Whatever the future holds — and whether or not that includes any more Bachelor franchise appearances — these two will be just fine.","url":"https://www.bustle.com/p/blake-jasons-photo-together-proves-these-bachelorette-alums-will-be-just-fine-11924348"}
