{"authors":["Maitri Suhas"],"date_download":"2018-10-31 00:11:01","date_modify":"2018-10-31 00:11:01","date_publish":"2014-08-12 20:27:27","description":"Ah, the beautiful people: Blake Lively and Ryan Reynolds are on the eve of their second wedding anniversary — for which, in perfect Pinterest fashion, Blake Lively and Ryan Reynolds will DIY their own gifts — and Lively candidly expressed her wishes…","filename":"data/vaneerConsumption/BlakeLivelyRyanReynoldsKidsWillProbablyLookSomethingLikeThisPHOTOS.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/3122392a-aef3-469a-a67f-eb03ee867d68.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35506-blake-lively-ryan-reynolds-kids-will-probably-look-something-like-this-photos_1540944661.html","title":"Blake Lively & Ryan Reynolds' Kids Will Probably Look Something Like This - PHOTOS","title_page":"Blake Lively & Ryan Reynolds' Kids Will Probably Look Something Like This — PHOTOS","title_rss":"NULL","source_domain":"bustle.com","text":"Ah, the beautiful people: Blake Lively and Ryan Reynolds are on the eve of their second wedding anniversary — for which, in perfect Pinterest fashion, Blake Lively and Ryan Reynolds will DIY their own gifts — and Lively candidly expressed her wishes for the future family Reynolds to Marie Claire: \"I gotta get started. If I could spit out a litter of kids, I would.\"\nWeird and visceral language from the former Gossip Girl, but after seeing her lifestyle website, Preserve, I don't think I can be surprised by anything Lively says. Girl's got a dark, strange side. That being said, who wouldn't want to see such beautiful beings like Reynolds and Lively procreate? If you've got such golden genes, why not pass them on to a litter or two of all American babies who will surely have more Instagram followers in their first breath of life than I could ever hope for in the rest of mine?\nLively and Reynolds still haven't gotten started, apparently, but they probably should soon, seeing as Lively has claimed she wants 30 kids. Get to gettin', you crazy lovebirds! Their will be plenty of time for flower-beard fiction and six pack abs later! Fueled by impatience and curiosity and the power of the Internet, I went ahead and morphed these two on Morph Thing, and to my chagrin, they produced not the creeps I was hoping for, but some actually decent, very human looking children.\nBaby Boy Reynolds\nThose eyes! That sweet coif of blonde hair that tumbles so carefree! That button nose! Usually Morph Things are terrifying and hideous, but this faux baby not only looks decently believable, it's cute.\nGossip (Baby) Girl\nLook at this little brunette punkin. Sure her eyes are a little lopsided, but don't we all have faults? And before you get on me for criticizing a child, let me gently remind you, she's an Internet morph of two celebrity stock photos, so judge fairly my cruelty. Still, she's got dimples. I am jealous of a fake baby for her dimples. I need to reconsider some things.\nWhat have I learned from this experiment? Even when celebrities have fake internet babies that are created by mashing two 2D photos of them together, the imaginary children are super good looking. I secretly hope that Lively and Reynolds do procreate and make more than a dozen little kids, if only so I can start a betting pool on what they'll name their litter(s). Judging by the Preserve site, there are going to be some Reynolds children that struggle through elementary school with some \"The X is silent.\" But at least they'll be adorable. And their dad will be Ryan freakin' Reynolds.\nImages: Morphthing.com","url":"https://www.bustle.com/articles/35506-blake-lively-ryan-reynolds-kids-will-probably-look-something-like-this-photos"}
