{"authors":["Nate Church"],"date_download":"2018-10-30 19:36:08","date_modify":"2018-10-30 19:36:08","date_publish":"2015-12-17 17:36:52","description":"In the spirit of Harry Potter bookstore trolls and generally irritating people the world over, lots of folks are scrambling to post spoilers for the newest episode of the epic Star Wars saga. Fortunately, there's help to be found in avoiding them.In the spirit of Harry Potter bookstore trolls and generally irritating people the world over, lots of folks are scrambling to post spoilers for the newest episode of the epic Star Wars saga. Fortunately, there's help to be found in avoiding them.","filename":"data/vaneerConsumption/BlastStarWarsTheForceAwakensSpoilerswithTheseApps.json","image_url":"https://media.breitbart.com/media/2015/11/Star-Wars-X-Wing-Dogfight-Screengrab-Lucasfilm.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2015_12_17__1540928168.html","title":"Blast 'Star Wars: The Force Awakens' Spoilers with These Apps","title_page":"Blast 'Star Wars: The Force Awakens' Spoilers with These Apps | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In the spirit of Harry Potter bookstore trolls and generally irritating people the world over, lots of folks are scrambling to post spoilers for the newest episode of the epic Star Wars saga. Fortunately, there’s help to be found in avoiding them.\nStar Wars is kind of a big deal. This weekend’s premier of Episode VII: The Force Awakens has crushed box office pre-sale records and promises to pack theaters around the world with people dressed as Boba Fett, Slave Leia, or “too-excited dad.”\nUnfortunately, the internet is full of people intent on spoiling other people’s enjoyment. It’s okay, though! You can protect both your iPhone and your browser from imminent Star Wars plot points, relegating your paranoia to the shady folks you hang about in the physical world.\nIf you use Google Chrome, the handy Force Block extension will not only scan pages you’re browsing for spoilers on the film, it will do so with a certain level of panache. “Spoilers lead to anger, anger leads to hate, hate leads to suffering…” and other co-opted quotes will darken your screen if you should wander too close to material that might reveal too much.\nSpoiler Shield represents a more dynamic option and can be configured to keep you from knowing about all sorts of juicy tidbits from a variety of your favorite shows. It’s available on Chrome as well as iPhone and Android.\nThey both seem like great safeguards, if not foolproof ones. Meanwhile, I’m halfway through the Sixth Sense, and I feel like something’s up with Bruce Willis’ character. Please, no spoilers.\nFollow Nate Church @Get2Church on Twitter for the latest news in gaming and technology, and snarky opinions on both.","url":"https://www.breitbart.com/tech/2015/12/17/blast-star-wars-the-force-awakens-spoilers-with-these-apps/"}
