{"authors":[],"date_download":"2018-10-22 20:55:06","date_modify":"2018-10-22 20:55:06","date_publish":"2014-06-01 06:30:18","description":"What does it feel like to blast off into outer space? It's not just one feeling, as future space tourists find out during simulated rocket rides.","filename":"data/vaneerConsumption/BlastoffAmateurAstronautsGetaSimulatedTasteofSpaceTravel.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/484491/1400603-virgin-galactic-1202p_09cf882bdcefe52d49f2cf2201988102.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_virgin-voyage_blastoff-amateur-astronauts-get-simulated-taste-space-travel-n119516_1540241706.html","title":"Blastoff! Amateur Astronauts Get a Simulated Taste of Space Travel","title_page":"Blastoff! Amateur Astronauts Get a Simulated Taste of Space Travel","title_rss":"NULL","source_domain":"nbcnews.com","text":"Getting into the swing\nThe centerpiece of the center's course is the centrifuge — a massive metal arm that swings around its axis with an enclosed capsule at the end. Once NASTAR's controllers get you strapped inside the capsule, light up the big-screen displays going and rev up the motors, they can twist and turn you to simulate any flight experience. Depending on how the capsule is oriented, you can even get a zero-G feeling.\nNASTAR's facility in a Philadelphia suburb has an assortment of centrifuges, ejection seats and other equipment for training jet pilots, and that still accounts for the bulk of its business. It's only been within the past decade that the company has been taking on civilian spacefliers-to-be as well.\n\"This is the most important thing I'll ever do in my life, and I'm going to plan this thing down to a gnat's ass.\"\nIn the classroom, Henwood explained that fighter jocks — and SpaceShipTwo's passengers — have to deal with two different types of rapid acceleration. One kind of force pushes you back in your seat, like the feeling you get when a roller coaster races down a track. That's called Gx (\"gee-ex\") because it pushes along the x-axis you learned about in algebra class.\nThe other force pushes you down, like the feeling you get when a high-speed elevator suddenly starts going up, or stops going down. That's called Gz (\"gee-zee\"), because it works along the z-axis. Gz is the one that causes the most trouble, because it pushes the blood down from your brain.\nIn extreme cases, the Gz force can cause fliers to lose consciousness. And the forces encountered on SpaceShipTwo — in the range of 3.5 G's, or 3.5 times the normal pull of Earth's gravity — could cause you to lose peripheral vision, or even black out if you're not careful.\nTo counter the Gz force, Henwood taught a technique called the anti-G straining maneuver, or AGSM. One part of the maneuver involves tensing the muscles of the legs, arms and abdomen, to counter the downward push of blood from the brain. Another part involves taking sharp, cyclic breaths, saying \"hook\" on the outtake.\nAs we practiced our breathing in the classroom, we sounded like expectant moms getting ready for natural childbirth. Henwood told us to put more force into the exercise. \"There have been a lot of polite 'hookers,' and I mean that in the best sense of the word,\" she joked.\nThen it was time to hook ourselves into the centrifuge.\nA roller coaster on steroids\nFor the next day and a half, we took turns climbing into the STS-400 centrifuge's capsule and going on simulated flights. At first, the ride gave us half the G's that would be experienced on SpaceShipTwo. Then we worked our way up to the full profile: 3.5 Gx and 3.5 Gz for blastoff, zero G in the middle, and then an elephant-sized push of 6 Gx on the way down.\nThe numbers don't really give you a sense of what it feels like. Bailey described it better after he took a few turns. \"A roller coaster on steroids ... it's just like a huge roller coaster, but very intense. And actually a lot of fun,\" he said.\nThe ride was no big deal for one of Henwood's students, but he had an unfair advantage. The \"student\" was Todd Ericson, an Air Force test pilot. Ericson, who has been trained to handle 9 G's of acceleration, hammed it up when it was his turn.\n\"Ah, that feels good,\" he said. \"Got my back all cracked.\"","url":"https://www.nbcnews.com/storyline/virgin-voyage/blastoff-amateur-astronauts-get-simulated-taste-space-travel-n119516"}
