{"authors":["Associated Press"],"date_download":"2018-10-23 01:03:12","date_modify":"2018-10-23 01:03:12","date_publish":"2016-01-29 14:42:44","description":"GENEVA (AP) — Sepp Blatter expects to attend the FIFA election on Feb. 26 even though his appeal against an eight-year ban is unlikely to be resolved by then...","filename":"data/vaneerConsumption/BlatterexpectstobeatFIFAelectionevenifstillbanned.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422457_Blatter-expects-FIFA-election-banned_1540256592.html","title":"Blatter expects to be at FIFA election even if still banned","title_page":"Blatter expects to be at FIFA election even if still banned | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Blatter expects to be at FIFA election even if still banned\nGENEVA (AP) — Sepp Blatter expects to attend the FIFA election on Feb. 26 even though his appeal against an eight-year ban is unlikely to be resolved by then.\nBlatter's spokesman, Thomas Renggli, told The Associated Press on Friday that the suspended FIFA president \"should be present at the congress.\"\nBlatter and his lawyers believe FIFA rules mean only a meeting of the 209 member federations who elect a president can formally remove one.\n\"Only the congress, according to the statutes, can put Mr. Blatter out of his mandate,\" Renggli said in a telephone interview.\nRenggli also clarified the legal timetable for Blatter to challenge his ban by the FIFA ethics committee.\nBlatter is scheduled to return to FIFA headquarters on Feb. 16 for an appeal committee hearing, and an immediate ruling is expected. However, if the appeal panel confirms Blatter's ban, it could take weeks to write the detailed verdict, Renggli said.\nCase documents are needed in hand before appeals to the Court of Arbitration for Sport can be filed and registered.\nThe FIFA ethics committee banned Blatter last month for a range of charges, including conflict of interest in approving $2 million of FIFA money for Michel Platini in 2011.\nPlatini is also appealing against his eight-year ban for accepting the money as uncontracted salary when working as Blatter's presidential adviser from 1999-2002.\nFIFA said Friday that Platini's appeal is scheduled on Feb. 15. The UEFA president did not attend his ethics committee hearing at FIFA last month, and said through his lawyers that he was focused only on his expected process at CAS.\nThe FIFA appeals committee — chaired by Larry Mussenden, the former attorney general of Bermuda — rarely overturns sanctions imposed by the governing body's ethics and disciplinary bodies.\nThe Blatter and Platini case, which emerged last September, knocked the former France great out of an election race he was favored to win.\nSwitzerland's attorney general opened criminal proceedings against Blatter for suspected mismanagement and misappropriation. The investigation relates to the Platini payment and FIFA selling undervalued 2010 and 2014 World Cup broadcasting rights for the Caribbean in 2005 to then-FIFA vice president Jack Warner.\nPlatini was also questioned in September and has a status of \"between a witness and an accused person,\" attorney general Michael Lauber has said.","url":"https://www.dailymail.co.uk/wires/ap/article-3422457/Blatter-expects-FIFA-election-banned.html"}
