{"authors":[],"date_download":"2018-10-22 23:39:21","date_modify":"2018-10-22 23:39:21","date_publish":"2016-01-28 12:45:47","description":"Charles Ble Goude, once the right-hand man to disgraced ex Ivorian president Laurent Gbagbo, was nicknamed \"the General of the Streets\" but insists he had no...","filename":"data/vaneerConsumption/BleGoudeaStreetGeneralwhocompareshimselftoMandela.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g5gn-4vVdYopwYQ7f641721b07ad477df-312_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420347_Ble-Goude-Street-General-compares-Mandela_1540251561.html","title":"Ble Goude: a 'Street General' who compares himself to Mandela","title_page":"Ble Goude: a 'Street General' who compares himself to Mandela | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ble Goude: a 'Street General' who compares himself to Mandela\nCharles Ble Goude, once the right-hand man to disgraced ex Ivorian president Laurent Gbagbo, was nicknamed \"the General of the Streets\" but insists he had no role in the deadly violence that has landed him at the International Criminal Court.\nThe 44-year-old firebrand, partial to bespoke suits, flashy neckties and African designer robes, faces four counts of crimes against humanity for his role in the bloody standoff that followed a 2010 presidential poll and left 3,000 people dead.\nThe pugnacious Ble Goude has defiantly told the Hague-based ICC that his notorious pro-Gbagbo youth group, the Young Patriots, always acted in the interests of their country and for peace.\nCharles Ble Goude, former ally of ex-Ivorian president Laurent Gbagbo, attends a press conference in Abidjan in July 2006 ©Sia Kambou (AFP/File)\n\"Where are the hate videos? I haven't seen any,\" the former student leader told the ICC as he and Gbagbo went on joint trial on Thursday.\n\"Where do I tell the Young Patriots to stand up and go and kill Ouattara supporters?\" he had said, referring to Gbagbo's election rival and current Ivory Coast President Alassane Ouattara.\n\"I always did everything to bring Ivorians together.\"\nBle Goude and his mentor Gbagbo, 70, are accused of hatching and implementing a plan to extend Gbagbo's 10-year rule -- which saw elections being repeatedly deferred -- through a brutal campaign of murders and rapes.\nAccording to French media reports, Ble Goude regularly receives visitors in his cell in The Hague, where he dresses immaculately and passes the time cooking Ivorian and African delicacies or playing football.\nAccording to reports, he sees prison as an obligatory rite of passage, comparing himself to the likes of Myanmar's Aung San Suu Kyi and anti-apartheid icon Nelson Mandela, whose autobiography he is reading in prison.\nHe has regularly invoked Indian independence hero Mahatma Gandhi, US civil rights icon Martin Luther King and Mandela when speaking.\nA slight man with a powerful command of rhetoric, Ble Goude is accused by ICC prosecutors of ordering his men to murder, rape and burn alive hundreds of people during the post-electoral crisis in 2010-11.\nHe came to Gbagbo's notice through his capacity to rally massive street crowds, bringing tens of thousands of people together for a 2004 protest against former colonial ruler France, whom he accused of siding with rebels trying to oust Gbagbo.\n\"Ivory Coast is not a French department,\" was his rallying cry. He also accused then French president Nicolas Sarkozy of planning a \"genocide\" in Ivory Coast.\nOne of Ble Goude's lawyers dubbed him a \"man more determined than ever for truth to emerge\".\n\"Mr Ble Goude is not a criminal like what one is trying to make people to believe,\" said Claver N'Dry.\nHis defence lawyer Geert-Jan Alexander added: \"We are defending a man of peace... The image that has been painted of him is not as we believe a true reflection of his character.\"\n\"This trial provides occasion for the truth.. and we trust that this court will find that Mr Charles Ble Goude didn’t commit crimes against humanity.\"\nAlexander said his client was \"a man of faith.\"\nBle Goude was arrested in January 2013 in Ghana after going on the run for more than a year and a half.","url":"https://www.dailymail.co.uk/wires/afp/article-3420347/Ble-Goude-Street-General-compares-Mandela.html"}
