{"authors":["Harvey Day For Mailonline"],"date_download":"2018-10-23 05:37:58","date_modify":"2018-10-23 05:37:58","date_publish":"2017-03-10 15:21:56","description":"Trish Vickers, 64, from Charmouth, Dorset, had spent six years writing the 110,000 word book Grannifer's Legacy by hand. The book is due to go on sale for the first time tomorrow.","filename":"data/vaneerConsumption/Blindauthorsnovelwassavedbyforensicexperts.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E234D2800000578-0-image-a-23_1489157108662.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301464_Blind-author-s-novel-saved-forensic-experts_1540273078.html","title":"Blind author's novel was saved by forensic experts","title_page":"Blind author's novel was saved by forensic experts | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A blind author whose novel was saved by police forensic officers after she carried on writing for 26 pages when her ink had run out has died on the eve of the book's publication.\nTrish Vickers, 64, from Charmouth, Dorset, had spent six years writing the 110,000 word book Grannifer's Legacy by hand.\nHer work was nearly ruined five years ago when she discovered she had written 26 pages of nothing because her ballpoint pen had run out of ink.\nBlind author Trish Vickers, whose novel was saved by police forensic officers after she carried on writing for 26 pages when her ink had run out, has died on the eve of publication\nBut forensics experts from her local police force used ultra-violet light to recover the lost work by examining the indentations she had made in the pages.\nMrs Vickers carried on and finally completed the novel in January, despite being diagnosed with terminal breast cancer.\nBecause of her failing health, a local publishing house offered to design the cover, proof-read her work and print the book in just two weeks.\nThe book is due to go on sale for the first time tomorrow, sadly too late for Mrs Vickers who passed away on Wednesday night.\nHOW POLICE DID IT... Forensic experts worked for weeks to recover the missing pages, using ultra-violet light to read indentations in Mrs Vickers' manuscript. It took five months of painstaking work, but the forensic team was able to recover the whole text. A Dorset police spokesman said at the time a member of staff completed the work during her lunch hours.\n... AND HOW SHE WROTE WHILE BLIND The grandmother lost her sight through diabetes seven years ago, and decided to take up writing to pass the time. She developed an elaborate technique, using elastic bands to keep lines separated on the page - and quickly raced through the opening chapters of her first novel.\nMs Vickers (left), 64, from Charmouth, Dorset, had spent six years writing the 110,000 word book Grannifer's Legacy\nFriends said she was aware her book had been completed and prepared for publication before she died.\nTrevor Chambers, a member of the Bridport Blind Club, who has written the forward for the book. He said: 'She was made aware of the fact the book was about to be released.\nGrannifer's Legacy has been published in record time by Magic Oxygen of Lyme Regis, Dorset\n'We hope that she took some pleasure in that.\n'The publishers did a tremendous job. They did in two weeks what would usually take several months.\n'We just wish it had been published a week earlier but these things never work out to plan.'\nGrannifer's Legacy is described as a gentle read and tells the story of a woman called Jennifer whose life implodes after she loses her job, her boyfriend and her great-grandmother in a short space of time.\nShe moves to a fictional village and begins to rebuild her life with a positive outcome.\nMr Chambers said: 'What makes this book a winner is the real background to it all.\n'Trish wrote it after going completely blind. Then she thought she had lost the work she had done and then there was the race to get it published.'\nThe book has been published in record time by Magic Oxygen of Lyme Regis, Dorset.\nTracey West, who runs the publishing house with her husband Simon, said: 'After six tumultuous and exhausting years of writing it, Trish's dream came true and the very first copy of her book arrived on day she slipped away.\nForensic experts worked for weeks to recover the missing pages, using ultra-violet light to read indentations in Mrs Vickers' manuscript (Stock image)\n'In a few short weeks, there will be copies on the shelves of the British Library, the Bodleian Libraries of the University of Oxford, Cambridge University Library, the National Library of Scotland, the Library of Trinity College Dublin and the National Library of Wales.\n'When Simon told Trish we would be sending them a copy, she beamed a smile back at him; she was a proper author.'\nThe book will be launched at the Lyme Regis Woodmead Halls tomorrow.","url":"https://www.dailymail.co.uk/news/article-4301464/Blind-author-s-novel-saved-forensic-experts.html"}
