{"authors":["Cameron Phelps For Daily Mail Australia"],"date_download":"2018-10-23 01:39:06","date_modify":"2018-10-23 01:39:06","date_publish":"2017-03-10 10:05:19","description":"Liam Haven, who lost his eyesight in a roadside bomb attack in 2008 was set upon by two men at his house in South Perth on Wednesday night as he took out the rubbish.","filename":"data/vaneerConsumption/BlindIraqwarveteranbashedoutsidehisPerthhome.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/08/3E21B75500000578-0-image-a-2_1489136035333.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300500_Blind-Iraq-war-veteran-bashed-outside-home_1540258746.html","title":"Blind Iraq war veteran bashed outside his Perth home","title_page":"Blind Iraq war veteran bashed outside his Perth home | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A blind Iraq war veteran has been bashed in a shocking attack outside of his home.\nLiam Haven, who lost his eyesight in a roadside bomb attack in 2008, was set upon by two men at his house in South Perth on Wednesday night as he took out the rubbish.\nThe 28-year old was returning back to the house about 9.30pm when he was punched in the face and kicked as he tried to stand up.\nScroll down for video\nBlind Iraq war veteran Liam Haven was bashed in a shocking attack outside of his South Perth home on Wednesday night\nMr Haven described the coward attackers as 'scum' and said he heard the men say they were going to 'f*** him up'.\n'I think they are scum really,' he told reporters at a press conference on Friday.\nMr Haven said he was worried the men were going to break into his house and steal his belongings including his guide dog.\n'I called out to my partner, not to have her come out but to have her shut the door,' he said.\n'I was just worried they were going to go in as all our belongings were inside including my guide dog.'\nPolice have appealed for anyone who witnessed anything in the area on Wednesday night to contact Crime Stoppers on 1800 333 000","url":"https://www.dailymail.co.uk/news/article-4300500/Blind-Iraq-war-veteran-bashed-outside-home.html"}
