{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 23:03:59","date_modify":"2018-10-30 23:03:59","date_publish":"2016-12-09 00:00:00","description":null,"filename":"data/vaneerConsumption/Blockchainplatformraceheatsup.json","image_url":"https://amp.businessinsider.com/images/582b380a46e27a1b008b6ab6-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_blockchain-platform-race-heats-up-2016-12_1540940639.html","title":"Blockchain platform race heats up","title_page":"    Blockchain platform race heats up - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Fintech Briefing\" subscribers. To learn more and subscribe, please click here.\nLikely in a bid to boost adoption and awareness, blockchain consortium R3 made its Corda platform open source last week.\nAnd on Wednesday, both IBM and Digital Asset Holdings, a blockchain startup backed by JPMorgan and Goldman Sachs, revealed their own plans for driving use of the technology.\nThis suggests that we are rapidly moving beyond the hype and into the adoption stage when it comes to blockchain.\nBoth IBM and Digital Asset Holdings have focused on promoting a particular blockchain product:\nIBM has launched a blockchain ecosystem to get more firms using the Hyperledger Fabric. The Hyperledger Project is a rival consortium to R3, and while its platform is designed for use by a wide range of industries, its financial services members are furthest along when it comes to testing. IBM is heavily involved in the platform, both in terms of investment and promotion of its use. The new ecosystem is designed to connect firms already using blockchain with companies that want to use the Hyperledger Project's code, making it easier to establish a network of businesses on the platform. Current members include EY, rewards firm Loyyal, and cybersecurity firm Sensify.\nDigital Asset Holdings wants to solve blockchain's privacy issues and increase adoption among traders. Most blockchain systems allow all participants access to the detail of each transaction the ledger records. This feature can be helpful in solving fraud and consistency issues, but it has put off securities market participants by forcing them to disclose their trading positions, according to the firm. Its Digital Asset Platform aims to solve this by offering users a \"private contract store\" (PCS) where they can store sensitive transaction data, as well as a public ledger seen by all. The platform will underpin the new infrastructure that Digital Asset Holdings is building for the Australian Stock Exchange and the Depository Trust and Clearing Corporation, a US post-trade services provider.","url":"https://www.businessinsider.com/blockchain-platform-race-heats-up-2016-12"}
