{"authors":["Wally Hall"],"date_download":"2018-10-30 14:30:42","date_modify":"2018-10-30 14:30:42","date_publish":"2015-11-22 00:00:00","description":"It was a magnificent shootout between senior quarterbacks, one that neither deserved to lose, but the Arkansas Razorbacks went for a game-winning field goal instead of leaving it in the hands of Brandon Allen.","filename":"data/vaneerConsumption/BlockedkicknowaytoendsuperQBduel.json","image_url":"https://media.arkansasonline.com/img/photos/2015/11/22/hogTHOR21_1_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2015_nov_22_blocked-kick-no-way-to-end-super-qb-due__page=1_1540909842.html","title":"Blocked kick no way to end super QB duel","title_page":"Blocked kick no way to end super QB duel","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Arkansas kicker Cole Hedlund (9) walks off the field after his field goal is blocked in the final minute of the Razorbacks' loss to Mississippi State on Saturday, Nov. 21, 2015, at Razorback Stadium in Fayetteville. - Photo by Stephen B. Thornton\nFAYETTEVILLE -- It was a magnificent shootout between senior quarterbacks, one that neither deserved to lose, but the Arkansas Razorbacks went for a game-winning field goal instead of leaving it in the hands of Brandon Allen.\nIt was blocked and Dak Prescott, who completed 38 of 50 passes for 508 yards and 5 touchdowns, he also ran for two, survived the Hogs 51-50.\nAllen finished 30 of 43 for 406 yards and a single-game school record 7 touchdowns.\nAn improbable start to the second half seemed exactly what the Arkansas Razorbacks needed and when Mississippi State gave up the ball with three consecutive turnovers, the Hogs cashed in three times and seemed to be in total control.\nIn the end, though, the Razorbacks didn't have an answer for Prescott.\nThe Hogs needed 12 plays for 102 yards after the Bulldogs lost two fumbles and suffered an interception as Brandon Allen passed to tight ends for three third-quarter touchdowns to go into the final period leading 42-31.\nThe first was 3 yards to Jeremy Sprinkle, and then touchdowns of 39 and 18 yards to Hunter Henry.\nThe Bulldogs settled down and Prescott passed for 39 yards and ran for 23, including the final 20 on four carries for a touchdown to cut it to 42-38 with 12:54 to play.\nArkansas went three and punt and Prescott completed 8 of 10 passes for 68 yards, including a 10-yarder to De'Runnya Wilson for a touchdown and a 44-42 lead with 6:58 to play. The Dogs missed the PAT.\nAllen answered with a 52-yard pass to Dominique Reed and a 10-yard touchdown to Sprinkle, his third of the game. Jared Cornelius passed to Allen for two points and a 50-44 lead.\nPrescott came right back with five completions, including a 14-yard touchdown to Fred Ross.\nAllen was ready, driving the Hogs 71 yards on five completions, but the Razorbacks ran three consecutive times to set up the field-goal attempt.\nArkansas trailed 31-21 at the half, but Allen and those Mississippi State turnovers were almost enough to overcome a first half that was flawed.\nThe Bulldogs scored on five of six possessions in the first half, and for the game punted just once.\nIn the first 30 minutes, they had 373 yards of total offense -- 305 through the air -- and 18 first downs\nPrescott had 21 completions for 305 yards and 3 touchdowns in the first half. It was obvious the Hogs needed to stop him to get the victory.\nNot every Mississippi State player was eligible to catch a pass, but eight had at least one in the first two quarters.\nSaying it was not the half that was expected would be like saying Saturday night's weather was on the chilly side, and it was downright freezing. The temperature was 37 degrees to start the game and 27 to start the second half.\nArkansas was coming off back-to-back road victories over ranked Ole Miss and LSU and had won four consecutive games to get bowl eligible and increase hopes of a playing a bowl game somewhere in the Sunshine State, which no doubt would have appealed to many including the Arkansas coaches, who are scratching and clawing to get a fingerhold in that state rich with recruits.\nInstead of playing inspired for a good crowd, the Hogs allowed State to score in less than three minutes five times.\nThe momentum swung as Prescott looked human with an interception, that was deflected, and a fumble. The second-half kickoff return also was fumbled, and with 6:56 to play in the third quarter the Hogs had scored 28 unanswered points and turned a 31-14 deficit into a 42-31 lead.\nThen the Hogs played for what appeared to be an easy winning field goal, only the snap wasn't clean, so the hold wasn't sharp and the kick was blocked.\nSports on 11/22/2015","url":"https://www.arkansasonline.com/news/2015/nov/22/blocked-kick-no-way-to-end-super-qb-due/?page=1"}
