{"authors":[],"date_download":"2018-10-30 14:33:56","date_modify":"2018-10-30 14:33:56","date_publish":"2015-04-12 00:00:00","description":null,"filename":"data/vaneerConsumption/BlogFoodstampsforablebodiedchildlessadultsdown80inMainefollowing6hr.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_04_foodstamps_for_able_bodied_childless_adults_down_80_in_maine_following_6_hrweek_work_requirement_comments_1540910036.html","title":"Blog: Foodstamps for able bodied childless adults down 80% in Maine following 6 hr","title_page":"Blog: Foodstamps for able bodied childless adults down 80% in Maine following 6 hr/week work requirement","title_rss":"NULL","source_domain":"americanthinker.com","text":"Foodstamp enrollment by able bodied childless adults in Maine (which has a conservative Republican governor) is down 80% after imposing a very modest requirement that recipients work at least 6 hours a week in a volunteer program. Of course, the media portrays this as an exercise in cruelty. The food pantry here, just off the main drag in this neat college town, gets busiest on Wednesdays, when the parking lot is jammed and clients squeeze into the lobby, flipping through books left on a communal shelf as they wait their turn to select about a week’s worth of food. The Mid Coast Hunger Prevention Program is intended to be a supplemental food pantry, but a growing number of clients here and at pantries around the state have little else to rely on because of a change in state policy this year. These are the leeches who don't want to even work 6 hours a week for their check. Last year, the administration of Gov. Paul R. LePage, a Republican, decided to... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/04/foodstamps_for_able_bodied_childless_adults_down_80_in_maine_following_6_hrweek_work_requirement_comments.html"}
