{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 21:44:35","date_modify":"2018-10-30 21:44:35","date_publish":"2016-12-19 00:00:00","description":"If you thought 2016 was bad, you might want to gird yourself for an even worse 2017.","filename":"data/vaneerConsumption/BloodofSanGennarofailstoliquefymeaning2017couldbedisaster.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_blood-of-san-gennaro-fails-to-liquefy-meaning-2017-could-be-a-disaster-2016-12_1540935875.html","title":"Blood of San Gennaro fails to liquefy, meaning 2017 could be disaster","title_page":"    Blood of San Gennaro fails to liquefy, meaning 2017 could be disaster - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The archbishop of Naples, Cardinal Crescenzio Sepe, with a flask believed to contain drops of liquefied blood of San Gennaro at Italy's Naples Cathedral in 2013. REUTERS/Ciro De Luca/Files If you thought 2016 was bad, you might want to gird yourself for an even worse 2017.\nThe dried blood of Saint Januarius failed to liquefy in a ceremony in Naples, Italy, on Saturday, according to a report in Italy's La Stampa, heralding disaster for next year.\nMonsignor Vincenzo De Gregorio, the abbot of the chapel, said: \"We must not think about disasters and calamities. We are men of faith, and we must continue to pray.\"\nThe ceremony of the blood of Saint Januarius, or San Gennaro, is performed several times a year. The blood is kept in special ampules and liquifies during the ceremony.\nThe miracle has been regularly recorded since 1389. San Gennaro was bishop of Naples in the third century and was beheaded in the persecution of early Christians by Roman Emperor Diocletian, who killed about 3,500 Christians.\nIf the miracle of liquefaction fails to occur, it can herald disaster for the coming months and years.\nThe blood failed to become liquid in 1939, the year in which World War II started, and in 1980, the year of the Irpinia earthquake, according to the Stampa report.\n2016 has been bad enough. Both the US and the UK have had a year of political turmoil, while a civil war in Syria has destroyed much of the city of Aleppo and resulted in indiscriminate killing.","url":"https://www.businessinsider.com/blood-of-san-gennaro-fails-to-liquefy-meaning-2017-could-be-a-disaster-2016-12"}
