{"authors":["Lucia Peters"],"date_download":"2018-10-31 01:49:15","date_modify":"2018-10-31 01:49:15","date_publish":"2018-09-06 13:44:42","description":"It may be September now, but the weather still feels like the hottest days of summer — so if you’re not ready to say goodbye to your rosé-all-day lifestyle yet, here’s something to pour yourself as you clutch your novelty pool float to yourself:…","filename":"data/vaneerConsumption/BloodOrangeRoseWineAtTraderJoesIsACitrusyTwistOnYourSummerFave.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/5/8abc73c3-6bb1-4645-b05e-f6325ac7a39f-img_2659.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_blood-orange-rose-wine-at-trader-joes-is-a-citrus-y-twist-on-your-summer-fave-11759340_1540950555.html","title":"Blood Orange Rose Wine At Trader Joe's Is A Citrus-y Twist On Your Summer Fave","title_page":"Blood Orange Rose Wine At Trader Joe's Is A Citrus-y Twist On Your Summer Fave","title_rss":"NULL","source_domain":"bustle.com","text":"It may be September now, but the weather still feels like the hottest days of summer — so if you’re not ready to say goodbye to your rosé-all-day lifestyle yet, here’s something to pour yourself as you clutch your novelty pool float to yourself: Blood orange rosé wine is a thing, and you can get it at Trader Joe’s. I know, I know — if there’s blood orange involved, is it really a rosé? My sense is that it’s probably closer to a bottled wine cocktail than a true rosé, but that’s just me; I might be wrong. This question might be one you’ll have to answer for yourself, depending on how much of a rosé purist you are.\nBustle Lifestyle Editor Emma Lord recently spotted this bright orange bottle on the shelf of one of New York’s Trader Joe’s locations, so that’s how I caught wind of it — although somewhat bizarrely, there is almost no information about this wine available, either online or elsewhere. I’m honestly not even sure what the brand is: The label is so nondescript that really any of the phrases on it could be the brand… or they could just be descriptors of the wine itself. Is the brand Blood Orange? Or is that just the kind of wine that’s in the bottle? Is the brand Grand Reserve? Or is that just a designation of a specific line of wine made by the brand under which this particular wine falls? It’s a mystery.\nBustle\nHere’s what I do know, based on the limited information I’ve been able to glean from the label, photos of the shelf at Trader Joe’s on which it was located, and the farthest corners of the internet:\nIt’s produced in France.\nAt Trader Joe’s locations in New York, it’s $9.99 per bottle; however, you’ll probably pay something closer to $12.99 for it online.\nIt has a “smooth and refreshing palate with lingering notes of blood orange,” per the lovely handwritten label on the shelf at the New York Trader Joe’s on which the wine currently sits.\n“Blood Orange” might be the brand, as well as the additional flavor included in the wine. New Jersey-based wine purveyor The Wine Rack lists the wine’s producer as Blood Orange on their item page for it.\nIf “Blood Orange” is, in fact, the brand, then “Grand Reserve” is probably a special designation the brand bestows upon some of its wines.\nIt’s apparently 50 percent cinsault (also spelled cinsaut) and 50 percent grenache, according to wine distributor Monsieur Touton.\nThe composition of the wine makes a certain amount of sense. The cinsault grape goes by many names — you might also know it as Cinq Sao or Ottavianello — and it can be used to make many kinds of wine, but in France, it’s frequently used in Provencal rosés. It’s primarily a blending grape, used to soften up certain reds and add aromatics, according to Wine Enthusiast. Grenache, meanwhile — which, not-so-incidentally, is one of the wines with which cinsault is often blended — produces a red with an “unmistakable candied fruit roll-up and cinnamon flavor,” per Wine Folly, but also frequently appears in Provencal rosés. As a rosé, its dominant flavors are strawberry, raspberry, watermelon candy, lemonade, and cucumber.\nIt’s not clear how Blood Orange Grand Reserve’s rosé incorporates the actual blood orange; all the label tells us is that the bottle contains “Rosé wine with natural orange flavors.” Still, though, it will likely pair well dishes that feature aromatic spices; that’s what’s usually recommended for grenache rosés, so you might consider serving this one alongside Moroccan, Middle Eastern, or Indian dishes.\nInterested in trying it? Hit up your nearest Trader Joe’s (as long as it’s the type that includes a wine store) — or ask around at your local wine and liquor stores. Various listings exist for it around the web, so it’s possible your wine purveyor of choice might carry it, too. Cheers!","url":"https://www.bustle.com/p/blood-orange-rose-wine-at-trader-joes-is-a-citrus-y-twist-on-your-summer-fave-11759340"}
