{"authors":["Bob Price"],"date_download":"2018-10-30 18:53:27","date_modify":"2018-10-30 18:53:27","date_publish":"2015-04-04 22:40:34","description":"Bluebell Creameries shut down its Broken Arrow operations after continuing problems relating to the listeria bacteria.","filename":"data/vaneerConsumption/BlueBellShutsDownOklahomaOperationsAfterCDCWarning.json","image_url":"https://media.breitbart.com/media/2015/03/Blue-Bell-3-oz.-Chocolate-IC-Cup.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_04_04__1540925607.html","title":"Blue Bell Shuts Down Oklahoma Operations After CDC Warning","title_page":"Blue Bell Shuts Down Oklahoma Operations After CDC Warning","title_rss":"NULL","source_domain":"breitbart.com","text":"Bluebell Creameries shut down its Broken Arrow operations after continuing problems relating to the listeria bacteria. The move from the 108-year-old Texas ice cream maker comes after products that are produced in the Oklahoma facility tested positive for the potentially deadly bacteria. The warning from the Center for Disease Control (CDC) Friday night advised consumers against eating “Any Blue Bell Creameries product manufactured in the company’s Oklahoma facility.”\n“I want to personally apologize for any anxiety or inconvenience caused by the recent recalls of certain Blue Bell products,” Blue Bell President Paul Kruse wrote in a letter to customers and consumers. “While the recalls include a limited number of items, we know that this type of event creates concern for our consumers and our retail partners, who for more than a quarter century, have come to trust us to provide quality ice cream products.”\nBlue Bell is suspending all production in its Broken Arrow, Oklahoma, facility, according to a press release obtained by Breitbart Texas. Blue Bell is bringing in a team of “expert consultants” to conduct a careful and complete examination. The company is still searching for the exact cause of the contamination in a limited number of its product line.\nThe effected products have product codes following the “code date” that begin with the letters O, P, Q, R, S, and T.\nOn March 24, Breitbart Texas reported that Blue Bell had recalled its 3 ounce products that were manufactured in Oklahoma. This announcement came two weeks on the heels of Blue Bell’s first ever product recall for products produced on one of its machines in Texas.\nAfter the Texas products recall, Blue Bell spokesman Joe Robertson told Breitbart Texas they had permanently shut down the machine and discontinued that particular line of products that are shown below.\n“Listeriosis is a life-threatening infection caused by eating food contaminated with the bacterium (germ) Listeria monocytogenes,” according to a statement posted on the CDC website. “People at high risk for listeriosis include pregnant women, adults 65 and older, and people with weakened immune systems.”\nBlue Bell stated that its Broken Arrow operation will remain closed out of an abundance of caution until the cause of the contamination is revealed in their investigation which is being fully coordinated with the CDC.\n“CDC searched the PulseNet database and identified six patients with listeriosis between 2010 and 2014 who had Listeria isolates with pulsed-field gel electrophoresis patterns indistinguishable from those of Listeria isolated from Blue Bell brand 3 oz. institutional/food service chocolate ice cream cups,” the CDC warning stated.\nInvestigation to determine whether these illnesses are related to exposure to Blue Bell products is ongoing. The website states that this particular pattern is very rare.\nNote: This article has been updated.\nBob Price is a senior political news contributor for Breitbart Texas and a member of the original Breitbart Texas team. Follow him on Twitter @BobPriceBBTX and on Facebook.","url":"https://www.breitbart.com/border/2015/04/04/blue-bell-shuts-down-oklahoma-operations-after-cdc-warning/"}
