{"authors":["Sinead Maclaughlin For Daily Mail Australia"],"date_download":"2018-10-22 23:30:29","date_modify":"2018-10-22 23:30:29","date_publish":"2017-04-26 07:52:56","description":"A man has been hailed a superhero after saving a drowning blue-tongue lizard named Dusty with CPR, who appeared to wink at his saviour on the Sunshine Coast.","filename":"data/vaneerConsumption/BluetonguelizarddrownedinpoolbacktolifewithCPR.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/06/3F9C80FE00000578-0-image-a-20_1493184671852.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446402_Blue-tongue-lizard-drowned-pool-life-CPR_1540251029.html","title":"Blue tongue lizard drowned in pool back to life with CPR","title_page":"Blue tongue lizard drowned in pool back to life with CPR | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A man and his nephews have been hailed 'superheroes' after saving a drowning lizard by giving it CPR after rescuing it from the bottom of a pool.\nDale Hall grabbed a leaf scoop and fished the lifeless blue-tongue lizard out of the water after he spotted the reptile on the bottom of the deepest end of the pool on Tuesday morning.\n'I was like, 'Oh no. Goner. First casualty for the pool,' he told ABC Sunshine Coast.\nDale Hall pictured with Dusty, who he helped bring back to life after the blue-tongue lizard was found drowning at the bottom of a pool\nHis nephews Jayden and Caleb helped to administer CPR to the lizard, now named Dusty, with the former pumping the lizard's chest.\nBut despite a little water coming out, and a further attempt to drain the lizard by holding him upside down, Dusty remained lifeless after 10 to 15 minutes and Dale went to dig the seemingly doomed reptile a grave.\nBut after spending 30 minutes crafting Dusty's final resting place, Dale spotted some signs of life.\n'I went to put it in the hole and it winked at me!\n'It was the only thing I saw - I thought 'Hang on: it might be a go-er still'.'\nHe tried once more to clear the lizard of water by holding him upside down and stroking its belly.\nBut after 20 minutes, Dusty once more appeared to be at death's door and Dale went to bury him a second time.\nDespite a little water coming out, and a further attempt to drain the lizard by holding him upside down, Dusty remained lifeless after 10 to 15 minutes\nDale kept Dusty warm until Wildlife Rescue Sunshine Coast volunteer, Kai, picked him up and took him to Australia Zoo Wildlife Hospital\nBut another twitch from the lizard halted Dale, and slowly Dusty 'came good' and was taken to Wildlife Rescue Sunshine Coast.\nThe group posted the experience on Facebook, detailed Dale and his nephew's heroic actions.\n'He [Dale] kept Dusty warm until one of our amazingly dedicated volunteers, Kai, picked him up and took him to Australia Zoo Wildlife Hospital,' the animal rescue organisation wrote.\n'Dusty is in care at AZWH on a nebuliser.\n'We are all keeping our finger crossed that he gets well and can be released back to the wild.'","url":"https://www.dailymail.co.uk/news/article-4446402/Blue-tongue-lizard-drowned-pool-life-CPR.html"}
