{"authors":["Stephen Bisset For Daily Mail Australia"],"date_download":"2018-10-23 02:39:33","date_modify":"2018-10-23 02:39:33","date_publish":"2017-04-26 13:54:26","description":"Comedian and artist Anh Do showed a different, darker side to Anthony Field on Ahn Do's Brush With Fame on Wednesday as The Blue Wiggle admitted he struggles with depression","filename":"data/vaneerConsumption/BlueWiggleAnthonyFieldrevealsstrugglewithdepression.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA062D200000578-0-image-a-12_1493219135888.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4447684_Blue-Wiggle-Anthony-Field-reveals-struggle-depression_1540262373.html","title":"Blue Wiggle Anthony Field reveals struggle with depression","title_page":"Blue Wiggle Anthony Field reveals struggle with depression | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"As an original Wiggle, he has brought joy, happiness and music to millions of children around the world.\nHowever, comedian and artist Ahn Do showed a different, darker side to Blue Wiggle Anthony Field on Anh Do's Brush With Fame on Wednesday.\nReflecting on his life and career, Anthony revealed to Anh that he had struggled with depression since he was a teenager.\nComedian and artist Ahn Do showed a different, darker side to Blue Wiggle Anthony Field on Anh Do's Brush With Fame on Wednesday\nThe 53 year old said said that the seeds of his depression were sewn during his teenage years while he was a student at St Joseph's College boarding school in Sydney.\n'For me it wasn't a great experience, I must admit. There was some really good people there and good teachers, but it just didn't work for me,' Anthony admitted.\nWhen Anh pressed Anthony on whether this was when his depression started, he replied: 'Yeah it was, actually. There were things happen there which I wouldn't go into but they were too much for a young teenager to cope with by yourself. As the years rolled on I started feeling bad about myself.'\nLifelong struggle: The 53 year old said said that the seeds of his depression were sewn during his teenage years while he was a student at St Joseph's College boarding school in Sydney\nBrave confession: As Ahn continued to paint Anthony's portrait, the Blue Wiggle revealed just what it was like, for him, struggling with depression.\nAs Anh continued to paint Anthony's portrait, the Blue Wiggle revealed just what it was like, for him, struggling with depression.\n'When you're in that zone, you feel like you shouldn't be on earth, basically. You're a waste of time. You're in a crowd with people and you feel like you're the only person who feels like that. They don't understand me, no one understands me, no one gets me,' a clearly emotional Anthony revealed.\n'I didn't ever resent anyone for being happy. Going to a wedding or things like that, I'd just sink. This stuff's not for me.'\nTragic: When you're in that zone, you feel like you shouldn't be on earth, basically. You're a waste of time,' Anthony admitted to Ahn\nAnthony continued saying that the depression didn't cease when first found fame with brothers Paul and John in the 80s pub rock outfit The Cockroaches, admitting that his father came on tour with them as he was worried about his son.\n'He was worried about me - I'd started gambling. That's when he saw how I was and got me some help.'\nAs the Wiggles' star continued to soar both here and globally, Anthony's depression didn't abate.\n'In the worst of my depression, I still love the shows,' he admitted. 'There's just no cares in the world.\nNo respite: As the Wiggles' star continued to soar both here and globally, Anthony's depression didn't abate.\n'It's just when you come off stage you were back to being \"Jeez!\" You know, I'd be in the dressing rooms bloody bawling my eyes out by myself, after you'd just played to, you know, a couple of thousand people.'\nAdmitting that all of his Wiggle bandmates had been more than supportive, Anthony told Anh that it was Murray Cook ( the Red Wiggle) who understood best of all.\n'Murray sort of understood what was going on probably better than most,' he said.'\n'He actually came up to me and went, \"Mate, are you OK? \"This is sort of happening a lot. There must be something going on.\" You know, so...I always acknowledge that Murray was the one that first said that, and it does help when people jump in and say, \"Are you OK?\" 'Cause the first time, I thought to myself, \"Why? So, this is not right? I mean, this is... \"There's another way?\nOpenness: Anthony went even further, divulging to Ahn that his depression had led to suicidal thoughts\nAnthony went even further, divulging to Ahn that his depression had led to suicidal thoughts.\n'Oh, a couple of times on the road, yeah,' he admitted.\n'The scariest side of it is that when you're in that zone and you're actually thinking about doing the... ..you know, the worst thing possible you could do to yourself, you actually think that that's a release and that it would be better.\n'I went on a drug that got me out of the loop of thinking that. Do you know, for two or three years, I was on that, and now I'm drug-free and really' good now.'\n'The scariest side of it is that when you're in that zone and you're actually thinking about doing the... ..you know, the worst thing possible', Anthony said\nRelief: 'I went on a drug that got me out of the loop of thinking that. Do you know, for two or three years, I was on that, and now I'm drug-free and really' good now,' Anthony said\nFor confidential support call the Lifeline 24-hour crisis support on 13 11 14.\nAnyone across Australia experiencing a personal crisis or thinking about suicide can contact Lifeline.\nRegardless of age, gender, ethnicity, religion or sexual orientation their trained volunteers are ready to listen, provide support and referrals.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4447684/Blue-Wiggle-Anthony-Field-reveals-struggle-depression.html"}
