{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 21:46:37","date_modify":"2018-10-30 21:46:37","date_publish":"2015-01-09 15:34:30","description":"By deflecting attention from the cartoons, Klein is actually trying to protect Western ideas about the state, the individual, and freedom. Yet he cannot bring himself to identify the threat to those ideas, because doing so would mean admitting that the multicultural project, to which the left is politically wedded, has failed. |","filename":"data/vaneerConsumption/BlueStateBluesWhyEzraKleinisMinimizingRadicalIslam.json","image_url":"https://media.breitbart.com/media/2014/12/Blue-State-Blues.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_09__1540935997.html","title":"Blue State Blues: Why Ezra Klein is Minimizing Radical Islam","title_page":"Blue State Blues: Why Ezra Klein is Minimizing Radical Islam | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Ezra Klein of vox.com has come in for some richly-deserved mockery for his attempt to argue that the terrorist attack at Charlie Hebdo had nothing to do with the newspaper’s provocative Muhammad cartoons, much less with radical Islam. Klein says that there was no motive—that the attack was simply “unprovoked slaughter,” perhaps a product of madness: “The fault lies with no one but them and their accomplices. Their crime isn’t explained by cartoons or religion.”\nIt is hardly worth debating such a ridiculous claim, which does irreversible damage to Klein’s effort to defend his brand as the whiz kid who explains the news. But it is worth taking a closer look at why Klein is trying to hard to minimize the radical ideology behind the attack. There is more here than the officious obfuscation of the Obama administration, which is constantly at pains to deny that terrorism exists at all, and typically refuses to call radical Islam by its name.\nKlein says—pardon the gratuitous profanity, which is evidently how the “cool kids” assert that they know more than the rest of us—that “we shouldn’t buy into the bullshit narrative of a few madmen that their murders were a response to some cartoons.” Why not? Because “Allowing extremists to set the limits of conversation validates and entrenches the extremists’ premises. That was true in the criticism of Charlie Hebdo’s covers, and it’s even truer in today’s crimes.”\nI think Klein is actually onto something here, though he obscures his own point with left-wing cultural relativism, either out of loyalty or laziness.\nWhat Klein is saying is that if you allow the terrorists to make the cartoons the problem, you are allowing them to cast themselves as the aggrieved party. The result is that we are having a debate about the limits of free expression, which is exactly where Islamic extremists like London’s Imam Anjem Choudary want to take us.\nThe fundamental problem precedes the Charlie Hebdo controversy, and is quite independent of it. It is that there are Muslims who wish to impose Islamic law on the Western world—not just in the insular world of family law, but in general.\nWhen that religious ambition is expressed as a desire to conquer the West from without, it is easy to dismiss. When that ambition is expressed as a demand to be achieved from within—and by terror if necessary—it is a more serious threat.\nIt is more serious because the West lacks the self-confidence or will to resist—particularly in Europe, but not uniquely so.\nWhen President Barack Obama, the “leader of the free world,” tells the United Nations that a video mocking Muhammad provoked the Benghazi attacks, and that “The future must not belong to those who slander the prophet of Islam,” he affirms the principle that blasphemy ought to be punished, and negates his other fine words about free speech.\nAt bottom, there really is a “clash of civilizations.” The West has, over the centuries, become more tolerant of iconoclasm because it has embraced the separation of church and state—an idea, ironically, that has its roots in Judeo-Christian thought. Islamic law rejects that distinction, posing instead an all-encompassing unity that binds the individual to Allah through the state. For Muslims in the West, it is necessary to adjust that vision—a compromise radical Islam rejects.\nBy deflecting attention from the cartoons, Klein is actually trying to protect Western ideas about the state, the individual, and freedom. Yet he cannot bring himself to identify the threat to those ideas, because doing so would mean admitting that the multicultural project, to which the left is politically wedded, has failed.\nA truly “liberal” approach would be to confront the ambitions of radical Islam, and to be honest about the compromises that Muslims in the West must make.\nSenior Editor-at-Large Joel B. Pollak edits Breitbart California and is the author of the new ebook, Wacko Birds: The Fall (and Rise) of the Tea Party, available for Amazon Kindle.\nFollow Joel on Twitter: @joelpollak","url":"https://www.breitbart.com/politics/2015/01/09/blue-state-blues-why-ezra-klein-is-minimizing-radical-islam/"}
