{"authors":["Abigail Miller For Dailymail.Com"],"date_download":"2018-10-22 22:37:16","date_modify":"2018-10-22 22:37:16","date_publish":"2017-04-26 05:11:47","description":"Blue Jays player Chris Coghlan shocked fans on Monday when he achieved flight to score an incredible run.","filename":"data/vaneerConsumption/BlueJaysplayerscoreswithspectaculardiveovercatcher.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/05/3F9BE46B00000578-0-image-a-78_1493179895236.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446226_Blue-Jays-player-scores-spectacular-dive-catcher_1540247836.html","title":"Blue Jays player scores with spectacular dive over catcher","title_page":"Blue Jays player scores with spectacular dive over catcher | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Blue Jays player Chris Coghlan shocked fans on Monday when he achieved flight to score a run.\nIt was the top of the seventh inning against the St Louis Cardinals when Blue Jays outfielder Kevin Pillar hit a deep shot into right field and Chris Coghlan took off sprinting from first base.\nAs the Cardinals retrieved the ball and threw it in an attempt to get him out, he rounded third and sprinted for home.\nScroll down for video\nIt was the top of the seventh inning against the St Louis Cardinals when Blue Jays outfielder Kevin Pillar hit a deep shot into right field and Chris Coghlan took off sprinting from first base\nAs the Cardinals achieved the ball and threw it in an attempt to get him out, he rounded third and sprinted for home\n\"I told you I wasn't gonna slide.\" - Chris Coghlan. pic.twitter.com/DQIG1qAYm2 — MLB (@MLB) April 26, 2017\nHe and the ball arrived at just the same time at the home plate.\nCardinals catcher Yadier Molina caught the ball and looked to tag Coghlan, but it was too late.\nCoghlan launched himself into a swan dive over the catcher's head, landing in a somersault, to score the go-ahead run in a risky, thrilling and dangerous play.\nThe exciting play will be marveled at for years by baseball fans all over, especially seeing as no one got hurt.\nHe and the ball arrived at just the same time at the home plate. Cardinals catcher Yadier Molina caught the ball and looked to tag Coghlan, but it was too late","url":"https://www.dailymail.co.uk/news/article-4446226/Blue-Jays-player-scores-spectacular-dive-catcher.html"}
