{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 19:13:39","date_modify":"2018-10-30 19:13:39","date_publish":"2015-06-12 11:35:28","description":"Obama goes through the motions when it comes to his fundamental responsibilities as the leader of the free world, so that he can focus his energy instead on the three \"R's\"--redistribution, race, and recreation. |","filename":"data/vaneerConsumption/BlueStateBluesObamaDoesntCareAboutFreeTrade.json","image_url":"https://media.breitbart.com/media/2014/12/Blue-State-Blues.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_12__1540926819.html","title":"Blue State Blues: Obama Doesn't Care About Free Trade","title_page":"Blue State Blues: Obama Doesn't Care About Free Trade | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In The Audacity of Hope, then-Sen. Barack Obama (D-IL) wrote:\nThere were some problems with the agreement, but overall, [the Central American Free Trade Agreement, or CAFTA] was probably a net plus for the U.S. economy… I ended up voting against CAFTA, which passed the Senate by a vote of 55 to 45. My vote gave me no satisfaction, but I felt it was the only way to register a protest against what I considered the White House’s inattention to the losers from free trade.\nReading that passage over Thanksgiving weekend in 2006, I began to distrust the man who represented my home state, and who it was still possible to believe might have something fresh to offer American politics.\nHere he was, conceding that free trade was good for the American economy, but voting against it to register a meaningless political protest. (More likely, he was just obeying his union backers, but with the 2008 election nearing, sought to cast his vote in more idealistic terms.)\nNow it is Obama who wants “fast-track” authority to negotiate free trade agreements–on a far greater scale. The Senator who consistently failed to support free trade–except, curiously, with the Sultanate of Oman–is now a lame duck president in need of a “legacy” issue.\nHe is also concerned–rightly–that we need to do more to compete with China in the Pacific, and eager–questionably–to use a separate agreement with the European Union to prop up that faltering bloc.\nIt is somewhat gratifying to observe Obama casting aside his old, spurious opposition to free trade–just as he has cast aside his opposition to broad surveillance powers to fight terrorism, and his opposition to war without United Nations approval. In his hapless hypocrisy, Obama has proven that there are some things American presidents simply have to do, because the U.S. is the world’s last superpower, “whether we like it or not,” and without us the world would be poorer and less free.\nYet Obama is failing to make the case for trade on its own terms–just as he has backed away from defending our national security infrastructure, and just as he abandoned intervention in Syria almost as soon as he had drawn that “red line.”\nHe doesn’t seem to care much about trade. He goes through the motions when it comes to his fundamental responsibilities as the leader of the free world, so that he can focus his energy instead on the three “R’s”–redistribution, race, and recreation.\nSo it is left to Republican leaders to argue for the Trade Promotion Authority bill. And the conservative base is furious–quite understandably, because they are seeing the Republican opposition do more to expand Obama’s power than they have ever done to resist it.\nOnce again, the Republican establishment is there to do what the country needs–pass the budget, raise the debt ceiling, re-authorize the wiretaps–without getting anything in return but more abuse from Obama.\nI understand the case against giving Obama fast-track authority. I’ve made it myself, to some extent, arguing that the process lacks transparency, and that Obama is such a poor negotiator (except against Republicans) that he is likely to bring home another bad deal.\nBut on the other hand, I still believe trade is good for the economy, for our security, and for liberty at home and abroad. I also detest the idea of doing what Obama did to Bush–namely, opposing free trade out of spite.\nSo I’d probably vote for fast-track and so-called ‘Obamatrade,’ because in the long run we will be better off, and Obama will be a memory.\nBut I’m not one of the Republicans in Congress, facing the prospect of re-election in a tough presidential year, knowing that the public is opposed to a new free trade agreement, that the conservative base sees the GOP leadership as a bunch of sellouts, and that even if we help Obama, he is still going to attack us.\nTurnabout is rotten, but it is fair play.","url":"https://www.breitbart.com/politics/2015/06/12/blue-state-blues-a-vote-for-obamatrade-despite-obamas-fraud/"}
