{"authors":[],"date_download":"2018-10-22 21:32:01","date_modify":"2018-10-22 21:32:01","date_publish":"2014-05-07 09:08:14","description":"\"We’re hoping it will get there later this week, possibly Friday,\" official says.","filename":"data/vaneerConsumption/Bluefin21toRejoinHuntforMissingMalaysiaAirlinesJet.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/399951/140425-bluefin-mh370-5a-cover_29f4daeb77ca5cad7e0d05f44a1e1f99.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-jet_bluefin-21-rejoin-hunt-missing-malaysia-airlines-jet-n98991_1540243921.html","title":"Bluefin-21 to Rejoin Hunt for Missing Malaysia Airlines Jet","title_page":"Bluefin-21 to Rejoin Hunt for Missing Malaysia Airlines Jet","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe robotic submarine that was taken out of action when an Australian ship returned to port is expected to rejoin the search for the missing Malaysia Airlines jet this week, officials said Wednesday.\nThe U.S. Navy-owned Bluefin-21 has been the only sub scouring the floor of the southern Indian Ocean for any signs of Flight MH370.\nAfter more than a month, the sub's mission was suspended late last week when Australian defense vessel Ocean Shield was forced to return to Perth to “replenish supplies and personnel.”\nHowever, officials confirmed the Ocean Shield will head back to the remote area which experts believe is the Boeing 777's final resting place.\n“We’re hoping it will set off later this week, possibly Friday,” a spokesman for Australia’s Joint Agency Coordination Centre said Wednesday.\nMeanwhile, a team of experts met in Australia on Wednesday to review all the data relating to the missing aircraft and to plan further underwater searches.\n- Henry Austin","url":"https://www.nbcnews.com/storyline/missing-jet/bluefin-21-rejoin-hunt-missing-malaysia-airlines-jet-n98991"}
