{"authors":["Lana Shadwick"],"date_download":"2018-10-30 21:48:05","date_modify":"2018-10-30 21:48:05","date_publish":"2016-03-29 13:35:41","description":"A Republican representative from Colorado has introduced a bill in Congress that would make it a hate crime to target a cop just because he or she is a police officer.","filename":"data/vaneerConsumption/BlueLivesMatterActof2016WouldMakeTargetingCopsaHateCrime.json","image_url":"https://media.breitbart.com/media/2016/03/Blue-Lives-Matter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_03_29__1540936085.html","title":"'Blue Lives Matter Act of 2016' Would Make Targeting Cops a Hate Crime","title_page":"'Blue Lives Matter Act of 2016' Would Make Targeting Cops a Hate Crime","title_rss":"NULL","source_domain":"breitbart.com","text":"A Republican representative from Colorado has introduced a bill in Congress that would make it a hate crime to target a cop just because he or she is a police officer.\nThe bill which has been named the “Blue Lives Matter Act of 2016,” was filed by Ken Buck, reported The Greeley Tribune.\nThe measure would enlarge federal hate crime laws to include law enforcement officers who are victims of violence and are targeted simply because they are peace officers.\n“I’ve been in law enforcement for 25 years before I started in this job,” Buck told The Greeley Tribune. “I’ve seen over and over both police officers on the street and federal agents, jail deputies and bureau of prison officials being threatened by very dangerous people. I have a passion for trying to protect those who protect us. That’s what this bill is about.”\nBuck told the publication that if the bill is passed, it would give federal prosecutors more ammunition against those who target a police officer just for what they do for a living. He used the December 2014 ambush and execution of two New York police officers as an example.\nBuck served as the Weld County District Attorney and prosecuted Allen Andrade in 2009 for the murder of a transgender woman, Angie Zapata.\nThe bill comes after ambush style attacks on peace officers have made headlines all over the nation. The Tribune reported that the National Law Enforcement Officers Memorial Fund said there were at least six such killings in 2015, and fifteen in 2014.\nBreitbart Texas reported extensively about the execution-style murder of Harris County Sheriff’s Deputy Darren Goforth in August 2015. The Texas deputy was at a gas station with his marked vehicle and in uniform when a man walked up behind him and unloaded fifteen rounds into his head and back. Officials say that he was targeted simply because he was a peace officer, as reported by Breitbart Texas. Shannon Miles has been charged with capital murder but is not presently facing trial because he has been found lacking the capacity to aid his lawyer in his defense.\nThe political director of a liberal organization called Progress Now Colorado, Alan Franklin, was reported by the local paper to question whether peace officers should be the subject of hate-crime statutes. “The question is whether or not a police officer is really appropriately covered by such a statute, especially when there are many laws that severely penalize violence against police officers already.”\nThe Colorado newspaper reported that several other Republicans asked to be added as co-sponsors of the bill. Trey Gowdy, Pete Sessions, Jason Chaffetz, and John Ratcliffe were named.\nLana Shadwick is a writer and legal analyst for Breitbart Texas. She has served as an associate judge and prosecutor in Texas. Follow her on Twitter @LanaShadwick2","url":"https://www.breitbart.com/border/2016/03/29/blue-lives-matter-act-of-2016-would-make-targeting-cops-a-hate-crime/"}
