{"authors":["Jo Tweedy For Mailonline"],"date_download":"2018-10-22 23:05:16","date_modify":"2018-10-22 23:05:16","date_publish":"2016-01-29 10:46:36","description":"If you thought the BMW was solely for city slickers, think again. The latest 7 series model - an eye-watering £96,000 - offers heated massage chairs, scented air and ambient lighting.","filename":"data/vaneerConsumption/BMW7seriescarhasmassageseatsandbespokeperfumes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/20/12/3060CC8300000578-0-image-a-12_1453292430734.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3405073_The-car-claims-relaxing-SPA-test-drive-new-BMW-7-series_1540249516.html","title":"BMW 7 series car has massage seats and bespoke perfumes","title_page":"BMW 7 series car has massage seats and bespoke perfumes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Reclining my head back on a plush pillow, I sink into the comfiest of leather seats. A warmth radiates around my shoulders and a gentle kneading pressure on my back begins.\nThe lighting is soft, the air fragrant and classical music is being piped through a surround sound system - and when I lift the cucumber slices from my eyes, there's a glinting nocturnal sky above me.\nNormally, at this point in the spa experience, you might expect a post-massage cup of chamomile in a 'chill-out' room, or a refreshing dip in a plunge pool.\nScroll down for video\nVehicular bliss: The interior is filled with plush Napa leather seats that can adjust to your body shape and recline at the flick of a switch\nSeats are heated and there are massage pads which can be programmed to gently pummel tired backs\nThe sixth generation BMW 7 series has extras including ambient lighting, massage pads and scented air\nStarry night: The car's two sunroofs can be opened with roller sunblinds on them, which when the light streams through looks a star-strewn galaxy\nWhat I actually get is a friendly nudge from Roger the chauffeur who tells me that we've reached our destination. While I've been rejuvenating my life-weary self, I've also been getting from A to B.\nSo lavish is BMW's new 7 Series that it promises you can emerge from a long drive feeling a million dollars - which, for those with the cash to spare, might argue is what makes this top-of-the-range BMW a snip at £96,000.\nMy morning spent with Roger Miller, who, in his role as a driver for BMW's top executives, gets to drive this baby everyday, offered a glimpse of what the cars of the future might look like.\nI watch in awe as he turns up the radio volume simply by whirling his finger in a circular motion above the music station.\nThere are detachable tablets everywhere; one in the back central armrest so passengers can control everything from the heat in the armrests to the lighting.\nTwo more touch-screens sit neatly on the back of the driver and front passenger seats so those in the rear can tune into the kind of television package you might enjoy at home.\nWelcome to tablet town: The car's features can be operated by using a detachable tablet which sits in the armrest on the backseat. There are two further tablets on the back of the driver and front passenger seats for telly watching on the go\nA glimpse of the future, you don't need to be in the vehicle to park it...the whizz-bang key fob will do it for you\nAmbient lighting in a variety of colours can give the interior of the car a different hue\nSo dedicated has BMW been to creating exactly the right sensory experience that they employed professional scent maker Annabelle Kanzow-Coffinet to 'ionize' the air in the car with a choice of up to eight different smells.\nIt took her, wait for it, three years to conjure up the scents, which are released via a cartridge in the glove box.\nRoger chooses Golden Suite, which emits a subtle fragrance throughout the car.\n'It has some grassy tones to it...' he suggests as if he's talking about a fine wine - it's hard not to chuckle, when most mothers' cars smell like Magic Tree and sticky children.\nHe's right though. There may be a layer of crisp frost outside but it smells like we're driving through a freshly-cut meadow in here.\nSo what about the big sky feeling that's promised? Well, it's a nice effect, created by two sunroofs peeling back to reveal patterned rollerblinds, which can then have the light colour of your choice flooded over it - but I'm not sure Brian Cox would be impressed.\nThe mercury is hovering around the zero mark outside but no worry; there are heated arm rests, heated seats and even a heated steering wheel.\nWhile much is made of the massage facility, it's actually a rather timid affair - don't expect a Thai-style pummelling, it's more of a gentle rise and fall sensation as pads sewn into the lining of the seat puff up with air and then deflate.\nA glass of prosecco and we're away! The new BMW offers a glimpse into just how the other half live\nRoger Miller, a chauffeur for BMW's top execs takes Jo through some of the car's futuristic features\nThe car's exterior is sleek but stays true to the classic BMW look...which may not appeal to those outside of the city slicker bracket\nNERVOUS ABOUT PARKING? YOU DON'T EVEN NEED TO BE BEHIND THE WHEEL... The BMW 7 Series is the first production car to allow owners to manoeuvre in or out of forward-parking spaces or garages without anyone at the wheel. It allows drivers to access tight parking spaces with ease and a lack of personal skill at the touch of a button on a smart key ring. While the car is carrying out the semi-automated manoeuvre, the driver simply has to watch out for obstacles...\nThere's also a 'vitality' programme available through the tablets, which offers passengers stretches that aim to rejuvenate/keep you feeling active while seated. Again, think gentle stretching more than Zumba in a car.\nFrom the outside, it looks like a classic BMW, the kind you'd expect a company director to wheel up motorways in, which may not float the boat of the super-car buying crowd.\nA timeless look but one that definitely belies the James Bond interior. Among the Saturday morning set at upmarket Syon Park in West London, we definitely blended in without standing out.\nWhen Roger finally hands over the steering wheel, I take to the open road and am surprised by how light it feels to drive.\nApparently it's some 130kg lighter than the five previous incarnations and the 'cell' - that's the seating area to you and me - is made of carbon-fibre-reinforced plastic, helping to keep the weight down.\nThe feature that actually astounds me the most? The remote parking. You can leave your car on your drive, hop out, press a button and the BMW moves on its own thanks to a web of sensors around it.\nWould I be tempted when it's been driven off the forecourt and dropped in price? Honestly, probably not. A girl can buy a lot of visits to real spas with that kind of money - and still drive a half-decent motor.\nIt's a tantalising glimpse into the future though, where drivers are relegated to the passenger seats and moving through traffic is a robotic affair. Flying cars? Judging by where we're at in 2016, it'll almost certainly happen.\nI'll admit I was cynical about whether you can really transfer the spa experience into a four-wheeler that's day-job is to do battle with traffic.\nAs I step out into the rat-race though, it's pretty clear that I wouldn't mind swapping Saturday afternoon at the supermarket for a seriously long drive, something that would normally fill me with a sense of tedium.","url":"https://www.dailymail.co.uk/femail/article-3405073/The-car-claims-relaxing-SPA-test-drive-new-BMW-7-series.html"}
