{"authors":["James Dunn For Mailonline"],"date_download":"2018-10-23 01:56:21","date_modify":"2018-10-23 01:56:21","date_publish":"2017-03-10 10:26:03","description":"The driver was holding the steering wheel with one hand and swigging from a can in the other when he pulled out of the junction in front of Jen Jackson, from Elsecar, South Yorkshire.","filename":"data/vaneerConsumption/BMWdriverpullsoutinfrontofamotheroftwo.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E21D19500000578-0-image-a-17_1489141559520.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300706_Moment-BMW-driver-pulls-mother-two_1540259781.html","title":"BMW driver pulls out in front of a mother-of-two","title_page":"BMW driver pulls out in front of a mother-of-two | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the terrifying moment a BMW driver races out of junction in front of a mother who is forced to slam on her brakes - and he was holding a beer can, she claims.\nDashcam footage shows the black saloon pulling out of a side road allegedly at 30mph with one hand on the steering wheel while swigging from the vessel.\nAfter slamming on the breaks to avoid a crash, Jen Jackson claims the 'antagonised' her for two miles despite initially appearing to be turning the other way.\nScroll down for video\nDashcam footage shows Jen Jackson driving at around 25mph when a BMW comes racing out of the junction on Sunday\nThe mother-of-two, from Elsecar, South Yorkshire, is forced to slam her brakes on as the driver pulls out, while holding a vessel that she claims was a beer can in one hand\nIt is not clear exactly what was in his hand but Mrs Jackson thinks it was a beer can because of his erratic driving\nThe mother-of-two claims the long can clearly visible in his hand is most likely beer and the driver looked to be in his 20s.\nMrs Jackson, from Elsecar, South Yorkshire, captured the footage as she drove home from work along Doncaster Road at 4.20pm on Sunday evening.\nShe said: 'I didn't see him coming. The first thing I saw was him coming out of the junction in that split second - it was really quick, it left me shaking.\n'At first I didn't know if I'd hit him or not until he reversed as I heard a bang from the ABS.\n'I called him a few blue words and said them animatedly so he could read my lips.\n'I was driving at 25mph so he must have been doing 30mph coming out of that access road and if you look closely you can see he's got a long can in his hand which looks like beer.\nMrs Jackson claims that he was initially planning to turn left but was 'antagonised' by the run-in then followed her for two miles\n'I would suggest he was drunk or smoking marijuana - it's disgusting that he decided to get behind the wheel.\n'He gave me a smile then reversed and proceeded to follow me for two miles before I turned into a housing estate which is a shortcut home - perhaps what I said antagonised him.'\nMrs Jackson, a retail assistant who has been driving for 23 years, said it was the worst near-miss she'd been involved in.\nShe said: 'We were both incredibly lucky. If I had hit him it would have been a full-on impact, the airbag would have been activated and I would have pushed him right into the metal railings.\n'He's a BMW driver and from what I've seen they seem to think they are invincible.\n'It's the worst near-on impact I've experienced and I'm an experienced driver, the standard of driving is shocking these days. I wish they would re-test every three years.'\n'I had jelly legs coming home - I'm just glad I had a dashcam on to capture it all.'","url":"https://www.dailymail.co.uk/news/article-4300706/Moment-BMW-driver-pulls-mother-two.html"}
