{"authors":["Sarah Palin"],"date_download":"2018-10-30 20:17:12","date_modify":"2018-10-30 20:17:12","date_publish":"2015-07-31 15:06:32","description":"Trump’s supporters are delightedly defying pithy prim “opinion makers” who think Americans are incapable of choosing our leaders without their dictates.","filename":"data/vaneerConsumption/BNExclusivePalinTrumpStumpsMediaKingmakers.json","image_url":"https://media.breitbart.com/media/2015/07/trump-palin-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_31__1540930632.html","title":"[*BN*]Exclusive[*] -- Palin: Trump Stumps Media Kingmakers","title_page":"[*BN*]Exclusive[*] -- Palin: Trump Stumps Media Kingmakers | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"What a hoot to watch pundits clutching their pearls and whimpering for smelling salts aghast over the latest “shocking” thing Donald Trump said, while The Donald ignores them and continues to soar. Silly kingmakers just don’t know what to make of this. Well, we do!\nThe elites are shocked by Trump’s dominance, but everyday Americans aren’t. Everywhere I’ve gone this summer, including motorsport events in Detroit full of fed up Joe Six-Pack Americans, the folks I meet commiserate about wussified slates of politicians, but then unsolicited, they whisper their appreciation for Trump because he has the guts to say it like it is.\nTrump’s unconventional candidacy is a shot in the arm for ordinary Americans fed up with the predictable poll tested blather of squishy milquetoast career politicians who campaign one way and govern another. But it’s not just how Trump says it, it’s what he’s saying.\nTrump has tapped into America’s great populist tradition by speaking to concerns of working class voters. He talks about fighting to bring back our factories. When was the last time a candidate talked passionately about reclaiming our manufacturing base (and knew what he was talking about)? What other candidate chooses American workers over the multinational corporations donating to their campaigns? Who other than Trump is talking about the dangerous trade deficits deindustrializing America and stealing our jobs? The old Arsenal of Democracy that allowed us to win World War II is now such a distant memory that we can’t even build the parts for our own military equipment – we need China to manufacture them for us. How can a great nation maintain its greatness without a manufacturing base? Or without secure borders for that matter?\nTrump focused in on two major populist grievances: the loss of working class jobs due to awful trade agreements, and the unfair competition for those jobs – along with security threats – due to the flood of illegal immigrants pouring across unsecured borders.\nNow throw in Trump’s candor about “winning” and you understand why his message catches fire. As General Patton said, “Americans play to win all the time.” But those of us outside the Beltway can see that America isn’t winning. Our enemies laugh at us. Our friends can’t rely on us. China is outpacing our military superiority. Putin thumbs his nose at us. ISIS seizes territory our sons and daughters fought and died to liberate. Iran gloats over the idiotic and ultimately catastrophic nuclear deal the White House caved on. Our friends in Israel shake their heads at our betrayal.\nTrump diagnoses our problems as incompetent leadership. Who can argue with that? How many politicians promised to secure our borders? So, why aren’t they secured? How many politicians promised to grow American jobs? So, why did they vote for Obamatrade? Is it any wonder that Americans are telling status quo politicians, “You’re fired”?\nFor everyday Americans the beauty of Trump’s candidacy is that he’s not a politician. There’s hope the guy who wrote “The Art of the Deal” can finally close the deal on all the broken promises of career politicians. Maybe the man who actually builds things, big things, can rebuild America’s entrepreneurial spirit with government put back in its proper place.\nThe average American doesn’t ask for much. We want security and the freedom to prosper. Many politicians are now offering solutions for security, but what about our prosperity? Trump boasts about his wealth, and average Americans cheer him on. This is the secret the chattering classes will never get. Americans don’t begrudge wealth honestly earned. We celebrate it! Trump made his money the old fashioned way with brick and mortar. He built big buildings and proudly stamped his name on them. He actually created jobs – lots of them. Like so many great American entrepreneurs, Trump has the flair of a showman but the sensibilities of an ordinary guy. He may be a billionaire, but refreshingly, there’s nothing elitist about him. He’s saying to the average Joe, “I worked hard and I succeeded and I want you to also.” That’s the fabric of our national character woven by work ethic and dreams and drive. That’s America!\nIt’s no surprise pundits and politicos are determined to destroy a candidacy they can’t control or shape with their mere words. Expect marginalization of anyone speaking well of Trump’s efforts. He’s a threat to the permanent political class. Non-traditional candidates always are because when they’re in touch with the people, they show their guts and just do the right thing. They go rogue — and take flak from all sides. Some of us have the scars to prove that.\nThankfully, Americans are on to the media’s games. The politics of personal destruction has lost its shock value. We have serious problems in this country. Ferreting through old divorce records and playing gotcha with past misstatements are just stupid distractions. Shouts of, “But he donated to Democrats!” won’t sway Trump enthusiasts. The man built a skyscraper in New York City – of course, he had donated to Democrats. If he was building it in Salt Lake City, I’m sure he would have donated to Republicans. “But he changed his mind on positions!” Reagan had been an FDR Democrat. Should we hold that against him or be grateful he saw the light?\nItty-bitty pundits thinking it’s clever to mock Americans’ opinions are finding the joke is on them. Cozy in their seat of judgment, blowing each other’s horns, protected by a glass screen. Ask yourself: just who ARE these windbags? And what do they build? Towers of paperclips? Lists of Twitter followers? Trump’s supporters are delightedly defying pithy prim “opinion makers” who think Americans are incapable of choosing our leaders without their dictates. The more the spotlight-seekers smear Trump, the more popular he gets. A friend emailed, “Tell those smart alecks bashing Trump on TV, ‘I love him because YOU hate him!'”\nThe GOP establishment would do well to listen to these voters and quit dismissing them. Reagan understood these blue-collar salt of the earth Americans. That’s why they gave him two landslide victories. If you want to win again, GOP, you need these good people.\nAnticipate more battering and bashing storms around Trump. It’s still very early in the game; folks are keeping their powder dry with candidate support but are quite happy Donald Trump is in the race. More power to you, Donald. Here’s to “Making America Great Again”!","url":"https://www.breitbart.com/politics/2015/07/31/bnexclusive-palin-trump-stumps-media-kingmakers/"}
