{"authors":["Thomas Colson"],"date_download":"2018-10-30 22:40:35","date_modify":"2018-10-30 22:40:35","date_publish":"2016-12-12 00:00:00","description":"Three-quarters of FTSE 350 company secretaries expect economic conditions to deteriorate in the next 12 months, according to the latest 'Boardroom Bellwether.'","filename":"data/vaneerConsumption/BoardroomBellwetherFTSEcompaniesgloomyabout2017economy.json","image_url":"https://amp.businessinsider.com/images/584e6c60dd089527558b49d2-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_brexit-boardroomthe-uks-biggest-companies-are-highly-pessimistic-about-the-economy-in-2017-2016-12_1540939235.html","title":"Boardroom Bellwether: FTSE companies gloomy about 2017 economy","title_page":"    Boardroom Bellwether: FTSE companies gloomy about 2017 economy - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Governor of the Bank of England Mark Carney. Reuters/Pool LONDON — The UK's biggest listed companies are highly pessimistic about the country's economic situation in the wake of its vote to leave the EU, according to a major new survey.\nThe bi-annual 'Boardroom Bellwether' Report, published in conjunction with the Financial Times, found that three-quarters of FTSE 350 company secretaries expected economic conditions to deteriorate in the next 12 months. 8% expected a \"slight\" improvement, and none expected a major improvement.\nCompanies were also pessimistic about the short-term prospects for the global economy. A third expected a decline in global economic conditions over the next year, 16% expected conditions to improve slightly, and none expected a \"significant\" improvement.\nThe gloom is not entirely related to Brexit, however. While 54% of companies surveyed said Brexit would have a damaging effect, only one company said that it intended to move a substantial part of its operations abroad as a consequence of Brexit. Fifty-four percent said Brexit was not among the \"principal risks\" they were worried about.\nCompanies were also significantly more positive about their own sectors. 21% expected an improvement in conditions for their industry while 36% expected no change.\nThe survey also registered a high level of opposition to Theresa May's pledge to make companies include workers on boards and remuneration committees, something she has already partially backed down from since becoming PM.\n85% of respondents said they did not want workers on their board or remuneration committee, while just four companies said they agreed with the idea.\nMay has now said that she will ask companies to involve workers in an advisory capacity, rather than at boardroom level.\nIn total, 32 companies from the FTSE 100 responded to the survey, while 47 companies from the FTSE 250 responded.","url":"https://www.businessinsider.com/brexit-boardroomthe-uks-biggest-companies-are-highly-pessimistic-about-the-economy-in-2017-2016-12"}
