{"authors":["Associated Press"],"date_download":"2018-10-23 01:36:30","date_modify":"2018-10-23 01:36:30","date_publish":"2016-01-29 15:41:30","description":"Iranian State television aired video on Friday that shows what purports to be drone footage of a US aircraft carrier with fighter jets visible on deck.","filename":"data/vaneerConsumption/BoastingIranairsfootagefromdroneitflewdirectlyoveraircraftcarrierUSSHarryTrumanbuttheNavysaysitchosenottoshootitdownbecauseitposednothreat.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/18/30B4A14000000578-0-image-a-75_1454091669023.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422278_Iran-says-flew-drone-US-aircraft-carrier_1540258590.html","title":"Boasting Iran airs footage from drone it flew 'directly over' aircraft carrier USS Harry Truman - but the Navy says it chose not to shoot it down because it 'posed no threat'","title_page":"Boasting Iran airs footage from drone it flew 'directly over' aircraft carrier USS Harry Truman - but the Navy says it chose not to shoot it down because it 'posed no threat' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Iran flew a surveillance drone over the American aircraft carrier USS Harry Truman and took 'precise' photographs of it as part of an ongoing naval drill, state media reported Friday.\nThe US Navy confirmed that an unarmed Iranian drone flew near a French and American carrier earlier this month, but did not say whether it was the same incident.\nThe reported overflight by the unmanned aircraft came after a series of naval incidents between Iran and the US in the greater Persian Gulf, including test rocket fire by the Islamic Republic and its brief capture of 10 American sailors who strayed into its territorial waters, and who were forced to apologize before being released.\nThe US Navy said it didn't open fire as the drone was unarmed and not threatening the ship's safety, but the incident again highlighted that tensions remain between America and Iran in Gulf waters despite their recent diplomatic detente.\nScroll down for video\nUnder surveilance: This still image made from video broadcast on Iranian State television Friday shows what purports to be drone footage of a US aircraft carrier\nIran claims it flew a surveillance drone over USS Harry S. Truman and took 'precise' photographs of it as part of an ongoing naval drill\nThe US Navy confirmed that an unarmed Iranian drone flew near USS Harry Truman (pictured) and a French carrier on January 12\nIranian state television and the semi-official Fars news agency, which has close ties to the Revolutionary Guard, released footage Friday that was purportedly taken from the unnamed drone.\nThe video shows an unidentified aircraft carrier with fighter jets on deck. The provenance of the clip has not been independently verified.\nCmdr. Kevin Stephens, a spokesman for the US Navy's 5th Fleet based in Bahrain, said an unarmed Iranian drone flew near the French aircraft carrier Charles de Gaulle and 'directly over' the USS Harry S. Truman on January 12 as the vessels were in international waters in the Persian Gulf.\nHe said the Navy launched a helicopter that determined the drone wasn't armed and 'posed no danger to the ship' as the carrier wasn't conducting flight operations at the time.\nHis comments implied that had there been active takeoffs and landings of U.S. aircraft, the situation might have changed.\nStephens panned the drone's overflight as 'abnormal and unprofessional.' He added that the US Navy was 'not in a position to verify the authenticity of the video as there are countless examples of similar footage to be found on the Internet.'\nThe report by state television said the drone flight occurred on the third day of the naval exercise, suggesting it happened Friday.\nAdm. Habibollah Sayyari, the commander of Iran's navy, called the drone overflight 'a sign of bravery.'\nIt 'allowed our men to go so close to the warship and shoot such a beautiful and accurate footage of the combat units of the foreign forces,' he told state television.\nState television and the state-run IRNA news agency said an Iranian light submarine also participated in the surveillance operation.\nWhen asked about the submarine report, Stephens said 'Iran has several submarines underway for its current exercise,' but declined to discuss specifics.\nThe Iranian report did not name the US vessel filmed by the unmanned aircraft. The nuclear-powered USS Harry S. Truman, based out of Norfolk, Virginia, is in the Persian Gulf region launching airstrikes and supporting operations against the Islamic State group in Iraq and Syria.\nIn Washington, US Navy spokesman Cmdr. William Marks stressed America remains ready to use force if necessary.\n'We are confident in our force's ability to respond appropriately as the situation dictates and will defend ourselves should that prove necessary,' he said.\nIn this January 12, 2016 file photo, France's flagship Charles de Gaulle aircraft carrier navigates in the Persain Gulf as part of the US- led coalition against ISIS\nSeparately, state television said Iran's navy successfully fired surface-to-surface Noor cruise missiles during the drill at mock targets. Iran has announced other military exercises in the past to demonstrate the capabilities of its armed forces.\nIran's navy began the naval drill this week over a '1.16-million-square-mile area including parts of the Strait of Hormuz, the Gulf of Oman and the Indian Ocean. Iran said Wednesday its navy warned a US warship to leave an area of the naval drill.\nThe US Navy later denied its operations were affected by the Iranian drill.\nWhile Iran recently struck a nuclear deal with world powers including the US, its naval forces have continued its maneuvers. Iran has more than 1,240 miles of shoreline facing the Persian Gulf and the Sea of Oman.\nThe US has criticized some of those maneuvers, including what it called a 'highly provocative' Iranian rocket test fire in December near its warships and commercial traffic passing through the Strait of Hormuz. Iran denied launching rockets, though the US later released footage showing the rocket fire.\nThe Strait of Hormuz, which sees nearly a third of all oil traded by sea pass through it, has been the scene of past confrontations between America and Iran.\nThis January, Iranian forces captured 10 American sailors who entered Iranian territorial waters near Farsi Island, an outpost in the middle of the Persian Gulf that has been used as a base for Revolutionary Guard speedboats since the 1980s.","url":"https://www.dailymail.co.uk/news/article-3422278/Iran-says-flew-drone-US-aircraft-carrier.html"}
