{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 20:17:09","date_modify":"2018-10-30 20:17:09","date_publish":"2015-08-18 20:49:23","description":"Jindal added, “It is frankly shocking that a Republican candidate for President would author a cradle to grave plan like this.”","filename":"data/vaneerConsumption/BobbyJindalBlastsScottWalkerOverCradletoGraveHealthcarePlan.json","image_url":"https://media.breitbart.com/media/2015/04/635609838991149571-AP556969415501-8.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_18__1540930629.html","title":"Bobby Jindal Blasts Scott Walker Over ‘Cradle to Grave’ Healthcare Plan","title_page":"Bobby Jindal Blasts Scott Walker Over ‘Cradle to Grave’ Healthcare Plan | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Wisconsin Gov. Scott Walker says, if elected president, he will “light a fire under Congress” to repeal Obamacare. But fellow GOP contender Louisiana Gov. Bobby Jindal calls Walker’s proposal yet another “cradle to grave” health reform plan.\nWalker’s proposal would create a system that eliminates federal mandates and offers tax credits for the uninsured based on age, rather than income or family status, similar to Obamacare. Those without employer-sponsored health insurance would be eligible to receive tax credits that could be used to buy insurance coverage on the open market.\nIn response, Jindal, who offered a health plan to repeal and replace Obamacare in April of 2014, said Walker’s plan essentially called for a new entitlement program.\n“In a health care plan that is light on specifics, Governor Walker endorsed the fundamental underpinning of Obamacare – the notion that America needs another entitlement program,” Jindal said according to a press release from his campaign. “In Governor Walker’s plan, a new entitlement is created for every single American human being from the time they are born right up until they grow old and become eligible for Medicare…”\nJindal added, “It is frankly shocking that a Republican candidate for President would author a cradle to grave plan like this.”\nThough Jindal admitted Walker’s proposal has some “good features,” he maintained that the Wisconsin governor did not include the costs of his plan. Walker, Jindal said, was not “standing on free market principles, but, rather, establishing ourselves as ‘cheaper Democrats.’”\n“Surely we as Republicans have more courage than this,” he continued. “Surely we can do better than simply producing our own versions of Obamacare lite.”\nJindal pointed to his own plan to repeal and replace Obamacare that “focuses on driving down the cost of health care by embracing free market reforms.”\nWhile Jindal’s proposal also includes guaranteed access for pre-existing conditions through a high-risk pool or some similar mechanism to assure care for the chronically ill, his plan would give all Americans the same standard deduction for health insurance – regardless of whether that insurance is obtained from an employer or independently.\nJindal’s plan would also provide states – as laboratories of innovation – a grant pool of over $100 billion over 10 years to develop their own cost-saving measures that still provide high-quality care. The proposal would provide additional incentives for health savings accounts and wellness plans, a “crack down” on fraud, and required transparency of health care costs to empower patients as consumers.\nIn addition to allowing the purchase of health insurance across state lines, the Louisiana governor would like to reform laws that oversee medical licensure – in order to provide greater options for lower health care costs – and encourage greater portability for people changing jobs.\nJindal’s plan addresses tort reform to bring down the costs of medical malpractice, and support for “freedom for seniors to choose” providers, unhindered by bureaucratic mandates.\n“When did conservatism die? When did we accept the idea of dependence on government?” Jindal asked. “Governor Walker is confused here. In his stump speech he has some clever lines about how the Fourth of July is about independence, not dependence. I like those lines. But with this Obamacare lite health care proposal, he’s going to have to drop those lines from his speech.”","url":"https://www.breitbart.com/politics/2015/08/18/bobby-jindal-blasts-scott-walker-over-cradle-to-grave-healthcare-plan/"}
