{"authors":["Bianca London For Mailonline"],"date_download":"2018-10-23 01:05:57","date_modify":"2018-10-23 01:05:57","date_publish":"2017-03-10 08:34:41","description":"FEMAIL called on Hannah Martin, a Senior Pro Artist at Bobbi Brown, from London, to showcase the face that will garner you respect in the office and may even lead to a promotion.","filename":"data/vaneerConsumption/BobbiBrownmakeupartistrevealsperfectofficelook.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/08/22/3E15B3D200000578-0-image-a-13_1489011379052.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4294966_The-face-land-promotion_1540256757.html","title":"Bobbi Brown make-up artist reveals perfect office look","title_page":"Bobbi Brown make-up artist reveals perfect office look | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"How much makeup a woman chooses to wear in the workplace can be a complex issue.\nIndeed, many ladies want to look polished and professional without being objectified.\nAnd according to research, women are more likely to land a job if they wear makeup to an interview, with more than two thirds of British bosses saying they'd be less likely to employ a female job applicant if she didn't wear makeup.\nSimilar studies found that there's a strong psychological element to wearing makeup in the workplace; with women noting they feel more poised, confident and 'put together' with their slap on.\nSo how can women achieve the polished, professional look without looking overdone? FEMAIL called on Hannah Martin, a Senior Pro Artist at Bobbi Brown, to showcase the face that will garner you respect in the office - and could even lead to a promotion.\nHannah Martin, a Senior Pro Artist at Bobbi Brown, has created the look she says will see you taken seriously in the office. Here she shows FEMAIL how to get the confidence-boosting look\nSpeaking ahead of her makeover, Hannah, from London, explained: 'Makeup that will get you that job is makeup that makes you look polished and like you're ready for business.\n'My suggestion is keep it classic so your makeup enhances your features. Making an effort to look polished will mean you are taken seriously.\n'Nothing is more alluring than a woman who radiates confidence and an attitude of self-assurance. Knowing you look good can be the most effective way of making sure you come across this way even if you don't feel it.\n'Avoiding common makeup faux-pas will ensure you look like you know what you're doing with your grooming and help you put your best foot forward.'\nSpeaking ahead of her makeover, Hannah, from London, pictured before her makeover without a scrap of makeup on, explained: 'Makeup that will get you that job is makeup that makes you look polished and like you're ready for business'\nHOW TO GET HANNAH'S OFFICE-READY FACE 1. Make sure your skin is hydrated. A lack of hydration in the top layer of skin can make foundation look dry and textured. 2. I brightened my under-eye, which is so important, with a corrector first then layered my concealer on top to make sure my eyes looked as bright as possible. 3. I then applied the Bobbi Brown Skin Foundation Stick through the centre of my face to even out my skin tone and conceal any redness in my skin. I used a deeper shade of foundation stick to bronze with. I love to bronze with a deeper foundation stick to keep my skin supple and avoid using too much powder. I set my t-zone with an oil free powder to lock my base in place and keep any unwanted shine at bay. 4. To keep me looking fresh, I applied the Pretty Powerful Pot Rouge III to the apples of my cheeks for a pretty, pink flush. I used the same product on my lips - so handy and makes sure that my cheek colour and lip colour don't clash! 5. I defined my brows using dark eye shadow - it keeps them looking full whilst framing my eyes. A filled in brow is so important for ensuring your eyes look lifted - some people call them the coat hanger of the face. Powder can be a little more natural looking than pencil; just brush through the brows following the direction of the growth of the hair for a natural look. 6. To make my eyes look smart but sexy I blended the Long-Wear Cream Shadow Stick in Rich Caviar all over my lid and blended with my finger up into the crease of the eye. 7. As I mentioned earlier, I like to keep my smokey eyes smart by just using one dark colour rather than blending multiple colours together. I took the same colour along my lower lash line to create that smokey look. I then applied three layers of mascara to complete the look. When creating a smokey eye you need to make sure you apply enough mascara that your lashes don't get lost so I suggest a few coats.\nHannah, who created the look for FEMAIL as part of Bobbi Brown's The Pretty Powerful Campaign for Women & Girls, which promotes confidence in women through natural beauty, claims that makeup doesn't have to be heavy to be sexy.\nShe explained: 'A common misconception, for example, is that foundation should be heavier but this can be less flattering than intended with skin looking dry and textured.\n'Sheer foundations that let your skin shine through will keep you looking glowing and fresh. Adding a little highlight to the top of your cheek can be a little extra to fake that glow and ensure the light lingers when it catches you.'\nShe also notes that something as simple as buffing out your eyeliner so it's a touch smokey rather than blunt can give an otherwise simple eye a sexy yet professional edge.\nShe explained: 'I love a dark smokey eye but to keep it smart I like to keep it matte and simple. One deep shade all over the lid, up into the crease and along the lower lash line with lashings of mascara will make for a modern, relaxed looking smokey eye. Just make sure all edges are blended!'\nHannah also notes that a bold lip can work for the office - as long as you pair it with a simple eye so you maintain a causal but smart look.","url":"https://www.dailymail.co.uk/femail/article-4294966/The-face-land-promotion.html"}
