{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 21:04:17","date_modify":"2018-10-30 21:04:17","date_publish":"2015-06-11 12:25:24","description":"A press release for the event states that the biblical response to a nation in crisis is “to gather in humility and repentance and ask God to intervene.” It describes the meeting as “a historic gathering of people from across the nation to pray and fast for America” that hopes to draw some 10,000 people to “worship God, seek repentance and pray for reconciliation, reformation and revival.” |","filename":"data/vaneerConsumption/BobbyJindaltoAttendMassiveSCPrayerRallyforaNationinCrisis.json","image_url":"https://media.breitbart.com/media/2015/06/GettyImages-473628764.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_11__1540933457.html","title":"Bobby Jindal to Attend Massive SC Prayer Rally for a ‘Nation in Crisis’","title_page":"Bobby Jindal to Attend Massive SC Prayer Rally for a ‘Nation in Crisis’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A Christian group called American Renewal Project will host a major prayer meeting this Saturday at the North Charleston Coliseum to “pray and fast for America.” The six-hour event, which is being billed as “The Response SC,” will feature South Carolina Governor Nikki Haley and Louisiana Governor Bobby Jindal as two of the day’s speakers.\nA press release for the event states that the biblical response to a nation in crisis is “to gather in humility and repentance and ask God to intervene.” It describes the meeting as “a historic gathering of people from across the nation to pray and fast for America” that hopes to draw some 10,000 people to “worship God, seek repentance and pray for reconciliation, reformation and revival.”\nThe encounter, which will be live-streamed by Breitbart News, is being billed as an inter-faith meeting to pray “for those in need, for life, for strong families and just laws.”\nThough some have suggested that Jindal will be using the occasion for “stumping,” organizers have insisted on the strictly spiritual nature of the meeting. Doug Stringer, a Houston minister who is helping to organize The Response SC, said the event will include music from three worship teams, but “no egos and no logos.”\nSimilarly, David Lane, president and founder of the American Renewal Project, said the meeting would focus on fasting and prayer to Jesus and would be non-commercial and non-political.\n“No DVD sales, no book sales, no T-shirt sales, no concession stand,” Lane said, just “fasting and prayer.”\n“Our goal is to restore America to a biblically based culture, and we recognize that only God can do it,” he said.\nJindal is expected to declare his White House plans on June 24.\nHaley’s press office said she agreed to attend because “faith has always been a source of strength for the governor and her entire family,” and added that Haley is inviting South Carolinians “of all backgrounds and faiths to join her.”\nHaley was raised in a Sikh family but later converted to Christianity, joining her Methodist husband.\nDetractors have criticized the governor for appearing in a promotional video for the event, suggesting that the Christian tone could infringe upon the separation of church and state.\nAmy Monsky of the group Secular Humanists of the Lowcountry complained that Haley’s participation amounts to an endorsement, “promoting one religion over another.”\n“This event of organizing a prayer is not the business for the governor,” Monsky said.\nProfessor Louise M. Doire of the College of Charleston defended Haley’s decision, noting that participation in such an event doesn’t necessarily violate the constitutional principle of separation of church and state since “politicians at all levels of government pray and worship in public spaces and their right to do so is protected under the law.”\nMany others have pointed out that First Amendment provisions regarding separation of religion and government strictly speaking “apply only to the federal Congress, which is thus prohibited from either establishing a federal religion or interfering with the existing established religions in some states.”\nIn fact, at the time the First Amendment was added to the U.S. Constitution in 1791, each of the thirteen states had its own church-state arrangement, running the gamut from established churches in Massachusetts to dis-establishment in Thomas Jefferson’s Virginia.\nThe framers of the Constitution chose to leave those arrangements in place, by barring the federal government from interfering with religious freedom, either by establishing a national church, or by restricting the free exercise of religion in any other way.\n“We are looking forward to thousands of Americans from all across the country joining us to pray for our nation at this important time,” said Stringer. “There is hope for America. It lies in heaven, and we will find it on our knees.”\nFollow Thomas D. Williams on Twitter @tdwilliamsrome","url":"https://www.breitbart.com/politics/2015/06/11/bobby-jindal-to-attend-massive-sc-prayer-rally-for-a-nation-in-crisis/"}
