{"authors":[],"date_download":"2018-10-30 14:33:38","date_modify":"2018-10-30 14:33:38","date_publish":"2015-03-24 00:00:00","description":null,"filename":"data/vaneerConsumption/BobbyJindalpledgednonewtaxesraisedtaxesthendenieddoingit.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_03_bobby_jindal_pledged_no_new_taxes_raised_taxes_then_denied_doing_it_comments_1540910018.html","title":"Bobby Jindal pledged no new taxes, raised taxes, then denied doing it","title_page":"Blog: Bobby Jindal pledged no new taxes, raised taxes, then denied doing it","title_rss":"NULL","source_domain":"americanthinker.com","text":"Governor Bobby Jindal of Lousiana, who pledged not to raise taxes, has raised taxes, aided by the radical Islam-loving Grover Norquist. Louisiana Gov. Bobby Jindal was caught in a jam. He had to plug a $1.6 billion projected deficit for next year — 20 percent of Louisiana’s general fund — and he had to do it without violating an anti-tax pledge he made to Americans for Tax Reform (ATR), the influential conservative group headed by Grover Norquist. Jindal’s solution: eliminating $526 million in tax rebates, most notably for the state’s business inventory tax. Norquist’s group blessed the decision, concluding that ending tax rebates would not amount to a tax increase. But that distinction has prompted ridicule from state lawmakers and political commentators on both the right and the left, who accuse Jindal of selling out the state’s tax policy to Norquist. The business inventory tax is a truly bizarre anti-business tax, taxing the... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/03/bobby_jindal_pledged_no_new_taxes_raised_taxes_then_denied_doing_it_comments.html"}
of course he has, even though Ayatollah Norquist has given his seal of approval. If you read the Washington Post article on the subject, they praise Jindal, saying he had already cut the budget to the bone. I won't repost their propaganda here but will instead post facts of a of a different nature :\nBetween fiscal years 2013 and 2014, total government spending in Louisiana increased by approximately $1.8 billion, from $26.9 billion in fiscal year 2013 to an estimated $28.8 billion in 2014. This represents a 6.8 percent increase.\nA nearly 7% increase in spending is a huge increase. This wasn't a situation where Jindal made huge cuts to the budget and had to fill a gap, as the Washington Post tried to paint the picture; this is a situation where Jindal presided over huge spending increases and paid for them by raising taxes.\nNow, I wouldn't be so tough on Jindal. Yes, he raised taxes now, but it's only 2015. If elected president, he won't be in office for another two years. That's plenty of time to evolve again on the tax issue, just as Marco Rubio and Scott Walker have evolved on amnesty in the past two years, and they are considered heroes by many in the conservative movement.","url":"https://www.americanthinker.com/blog/2015/03/bobby_jindal_pledged_no_new_taxes_raised_taxes_then_denied_doing_it.html"}
