{"authors":["Liam Deacon"],"date_download":"2018-10-30 20:29:01","date_modify":"2018-10-30 20:29:01","date_publish":"2016-06-04 16:33:36","description":"Bob Geldof has instructed every single Irish person living in the UK to vote against Brexit simply because they Irish.","filename":"data/vaneerConsumption/BobGeldofDemandsAllIrishPeopleInTheUKVoteRemain.json","image_url":"https://media.breitbart.com/media/2016/06/Screen-Shot-2016-06-04-at-17.22.19.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_06_04__1540931341.html","title":"Bob Geldof Demands All Irish People In The UK Vote Remain","title_page":"Bob Geldof Demands All Irish People In The UK Vote Remain","title_rss":"NULL","source_domain":"breitbart.com","text":"Bob Geldof, the Irish singer and political activist, has instructed every single Irish person living in the UK to vote against Brexit simply because they are Irish.\nThe Live Aid and Boomtown Rats start made the demand in a video released on YouTube and Twitter, put out by the group Irish4Europe for their #PhoneAFriend campaign.\nThe campaign says it is targeting around 600,000 Irish-born people living and working in Britain.\nIrish citizens aged 18 or over and resident in the Britain or Gibraltar can vote in the referendum, as can Commonwealth citizens.\nWATCH: I4E #PhoneAFriend video. Click the link for rest of video and a surpirse guest! https://t.co/Rh2TUigqbF pic.twitter.com/xBfgdocN3f — Irish4Europe (@Irish4Europe) June 2, 2016\nThe video features dozens of Irish people explaining where in the UK their Irish friends live, with the implication that they might have to leave in the event of a Brexit.\n“My mate Maguire in Birmingham, my sister Patty up in the Wye Valley, Ted in Islington, the kids in north, south and east London,” says Mr. Geldof.\n“Ah, every Irish person: Vote!” he adds.\nOn their website, Irish4Europe claim: “Irish people living in the UK have a lot to lose if the Brexit vote wins. For security, for the economy, and for the freedom to live, travel and work in the UK, we are better off with the UK as part of Europe.”\nthe Irish Prime Minister and the leaders of various Irish political parties including Fianna Fáil have made similar calls for the Irish to vote for remain.\nPrime Minister Enda Kenny attended a Gaelic football match between his home county of Mayo and London in northwest London on Sunday, where the campaign handed out leaflets to the 7,500-strong crowd.\n“Whether there would be border controls or custom controls, these things are a possibility but obviously they would require some very serious negotiations,” he said of the prospect of Brexit, or Britain exiting the EU.\nIreland and Britain entered the European Economic Community at the same time in 1973 and share a passport-free Common Travel Area.\n(AFP contributed to this report)","url":"https://www.breitbart.com/europe/2016/06/04/watch-bob-geldof-demands-irish-uk-vote-remain/"}
