{"authors":["Joshua Caplan"],"date_download":"2018-10-30 18:32:14","date_modify":"2018-10-30 18:32:14","date_publish":"2018-07-31 19:25:27","description":"Bob Woodward of Watergate fame will release his book about the Trump White House on the anniversary of the 9/11 terror attack.","filename":"data/vaneerConsumption/BobWoodwardBookonTrumpScheduledforReleaseon9.json","image_url":"https://media.breitbart.com/media/2018/07/bob-woodward-simon-schuster-fear-trump-white-house-9-11-attack.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2018_07_31__1540924334.html","title":"Bob Woodward Book on Trump Scheduled for Release on 9","title_page":"Bob Woodward Book on Trump Scheduled for Release on 9/11 Anniversary","title_rss":"NULL","source_domain":"breitbart.com","text":"Bob Woodward, the veteran Washington Post reporter of Watergate fame, is scheduled to release a new book — Fear: Trump in the White House — on the anniversary of the 9/11 terror attack.\nWoodward’s forthcoming book, published by Simon & Schuster, draws on “hundreds of hours” of interviews, along with notes, files and diaries to evoke the “harrowing life” within the Trump administration.\n“Fear is the most intimate portrait of a sitting president ever published during a president’s first years in office,” one source told CNN. “It will give readers a front row seat to Trump and his time in the White House,” the source added. “You are in the Oval office, the Situation Room, Air Force One and the White House residence. You are face to face with Trump and the book documents detailed conversations, meetings, policy debates and critical decisions.”\nWoodward’s title appears to reference a remark from a Trump interview that he conducted with colleague Robert Costa.\nWhen asked if he concurs with then-President Barack Obama’s definition of power — “[getting] what you want without having to exert violence” — Trump expanded on the definition. “Well, I think there’s a certain truth to that… Real power is through respect,” he said, adding, “Real power is, I don’t even want to use the word: ‘Fear.’”\nNearly 3,000 people were killed on September 11, 2001, when planes hijacked by jihadists hit the World Trade Center, the Pentagon, and a field near Shanksville, PA, hurling America into a new consciousness of the threat of global terrorism. The ceremony on the National September 11 Memorial & Museum plaza in New York strives to be apolitical, allowing politicians to attend but not to speak. While many Americans may no longer interrupt their days to observe the 9/11 anniversary, the ceremony remains a touchstone for many victims’ families and friends. At dusk, the annual “Tribute in Light” art installation beamed two giant towers of light into the lower Manhattan skyline as a visual memorial to those who perished in the terror attack.\nWoodward has repeatedly criticized President Trump on a variety of fronts, ranging from his cabinet selections to social media activities.\nIn an op-ed co-authored with veteran reporter Carl Bernstein, Woodward compared the president’s behavior towards special counsel Robert Mueller as “eerily similar” to Richard Nixon’s leading up to the “Saturday Night Massacre” of the Watergate scandal.\nHe has also given a thumbs-down to Trump’s Twitter habits. “Has he done and said things that even get his fans disturbed? Indeed he has. This tweeting habit interferes with the policymaking in a very serious way,” he told 10News WTSP in St. Petersburg, Flordia, in January.\nIn November 2016, Woodward attacked President-elect Trump’s cabinet picks of retired United States Army lieutenant general Michael Flynn as his national security adviser and Sen. Jeff Sessions (R-AL) for attorney general as “one dimensional” and a “giant mistake.”\nMonths ahead of the presidential election, Woodward expressed deep concern about the unpredictability of a Trump presidency. “In the case of Trump, I have really no idea what he might do if he ever became president,” he told Fox News on August 14. “If you look at the statements, the proposals, the ideas, it’s a kind of a garage sale and I don’t know that there’s a Rembrandt behind that lawnmower that won’t start.”\nOver the past 40 years, Woodward has written best-selling accounts of several administrations. He and Bernstein teamed up on two classics about President Nixon, All the President’s Men and The Final Days.\nThe Associated Press contributed to his report.","url":"https://www.breitbart.com/the-media/2018/07/31/bob-woodward-book-on-trump-white-house-scheduled-for-release-on-anniversary-of-9-11/"}
