{"authors":["Katie Louise Davies For Mailonline"],"date_download":"2018-10-23 01:08:04","date_modify":"2018-10-23 01:08:04","date_publish":"2016-01-28 15:21:27","description":"Emergency services and a specialist diving unit were called to Portland Basin, in Ashton-Under-Lyne, at around 8.30am today after a body was spotted in the river by a passer-by.","filename":"data/vaneerConsumption/BodyfoundinGreaterManchestercanal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB0C9200000578-0-image-a-6_1453994253985.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421145_Has-Pusher-struck-Man-s-body-Greater-Manchester-canal-fears-serial-killer-claimed-29th-victim_1540256884.html","title":"Body found in Greater Manchester canal","title_page":"Body found in Greater Manchester canal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The body of a man has been pulled from a canal in Greater Manchester. An astonishing 85 bodies - mostly men - have been pulled from the region's waterways in the last seven years.\nThe cause behind the majority of the deaths are believed to have been established, but 28 are still classified as 'unexplained', resulting in open verdicts.\nEmergency services and a specialist diving unit were called after a body was spotted in Portland Basin, in Ashton-Under-Lyne at around 8.30am today.\nScroll down for video\nA policeman stands on a footbridge near to Portland Basin, in Ashton-Under-Lyne, in Greater Manchester, after a body was spotted in the water\nOfficers cordoned off an area of the river following the discovery at around 8.30am today in Manchester\nPolice and a specialist diving unit pulled the body, believed to be that of a man in his 40s or 50s, from the river today\nThe man is white and believed to be in his 40s or 50s.\nA GMP spokesman said it was too early to establish how the man died or whether there are any suspicious circumstances.\nSome recent deaths have caused speculation that loved ones were the victims of a serial killer they dubbed The Pusher - a psychopath who murders his targets by bundling them into the icy waters.\nSome families believe their claim has considerable substance not only because of the disproportionately high numbers of people to have died in the rivers, but due to the suspicious circumstances surrounding the deaths of several men.\nSenior detective Tony Blockley appeared on a Channel 4 documentary titled 'Manchester's Serial Killer?' where he examined the evidence purporting to support the allegation that the same person may well be responsible for a catalogue of killings.\nHis probe focused on the deaths of three men: Souvik Pal, 18, and 21-year-olds David Plunkett and Nathan Tomlinson.\nSouvik Pal (pictured) was discovered in the Bridgewater Canal in 2012\nThe body of Mr Pal - a design student in Manchester - was discovered in the Bridgewater Canal three weeks after he had been ejected from a 2012 New Year's Eve party at the Warehouse Project nightclub in Trafford Park.\nA coroner recorded an open verdict into his death, admitting she did not know how he ended up in the water.\nDisturbingly, CCTV images recorded the teenager walking in the company of a man whose identity has never been confirmed minutes after leaving the club.\nDavid Plunkett had been at a concert at the Daytona Racetrack, also in Trafford Park, before he went missing in April 2004.\nHe was found dead in the Manchester Ship Canal. Police are adamant the 21-year-old drowned accidentally.\nThat view, however, is not shared by his parents Michael and Anne.\nThey are adamant evidence they experienced first hand points to David's death being the result of sinister and deadly act.\nThe third death being examined is that of trainee sports teacher Nathan Tomlinson, from Stockport.\nHis body was pulled from the River Irwell in February 2011. He had been out with friends two months before.\nDespite still being clothed, the 21-year-old was found without his coat, phone, passport and wallet.\nAn inquest into his death failed to establish if Mr Tomlinson died before or after hitting the water.\nCraig Jackson, a criminologist lecturing at Birmingham City University, previously said he believed that the high number of similar cases makes it unlikely that they are all either accidents or suicides.","url":"https://www.dailymail.co.uk/news/article-3421145/Has-Pusher-struck-Man-s-body-Greater-Manchester-canal-fears-serial-killer-claimed-29th-victim.html"}
