{"authors":[],"date_download":"2018-10-30 20:20:30","date_modify":"2018-10-30 20:20:30","date_publish":"2015-12-07 11:30:49","description":"Fire crews called to douse a fire in an outbuilding in northwest Atlanta found a man’s body in the rubble.","filename":"data/vaneerConsumption/BodyfoundinburningshedinNWAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/12/07/Videos/4649856562001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_body-found-burning-shed-atlanta__1540930830.html","title":"Body found in burning shed in NW Atlanta","title_page":"Body found in burning shed in NW Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"Fire crews called to douse a fire in an outbuilding in northwest Atlanta found a man’s body in the rubble.\nThe fire broke out about 9:30 p.m. Sunday in a wooden shed behind a home in the 600 block of Indigo Lane, in a neighborhood off Hamilton E. Holmes Drive.\n“Once they got a knockdown on it, they were knocking out some hot spots, just going through the building, and unfortunately, they did discover a body inside,” Atlanta fire spokesman Cortez Stafford told Channel 2 Action News.\nNeighbor Harold Seals said he was on his way to the store and could see the flames from his house.\n“I thought it was a house burning, and I came up the street and saw that it was my friend’s shed where he normally is staying,” Seals told The Atlanta Journal-Constitution Monday morning.\n“I called 911 and got the fire department over here, and I got his mother and sister out of the house because I was afraid that the house was going to catch on fire,” he said. “I came around to the top patio and looked, and the whole shed was engulfed.”\nAuthorities have not determined what sparked the fire or how the man died.\nThe Fulton County Medical Examiner’s office was working Monday to positively identify the body.","url":"https://www.ajc.com/news/local/body-found-burning-shed-atlanta/ooSA8Cya1UiKvq2Doj4ylL/"}
