{"authors":["Paddy Dinham For Mailonline"],"date_download":"2018-10-23 02:18:18","date_modify":"2018-10-23 02:18:18","date_publish":"2017-03-16 12:49:20","description":"Robbie Ryder, 20, was found by his mother in his bedroom in Driffield, East Yorkshire, but a police investigation was botched when ambulance crews took a week to tell them he had died.","filename":"data/vaneerConsumption/Bodybuilderdiedaftertakingsteroidsfromdarkweb.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E5435ED00000578-0-image-a-29_1489668503507.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319870_Bodybuilder-died-taking-steroids-dark-web_1540261098.html","title":"Bodybuilder 'died after taking steroids from dark web'","title_page":"Bodybuilder 'died after taking steroids from dark web'  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Robbie Ryder died in October after taking steroids believed to be form the dark web\nA bodybuilder died after taking steroids believed to have been bought on the dark web - but a police investigation was scuppered by ambulance crews taking a week to inform them of his death.\nRobbie Ryder, 20, was found slumped and unresponsive in his bedroom by his mother, who had told him just hours before to 'sort his life out'.\nA toxicology report found high levels of morphine and anti-anxiety tablets in his system after purchasing the illegal products off the internet's' 'black market.'\nAn envelope in his room that he is believed to have opened on the morning he died was key to the police investigation, but because the ambulance crews took a week to communicate with police, the scene had been entirely compromised.\nHull Coroner's Court heard Mr Ryder's mother, Yvonne Emerson, 46, said he struggled to come to terms with the death of his father and turned to bodybuilding.\nMother-of-two Ms Emerson had noticed a change in his behaviour weeks before his death and noticed he was 'on something'.\nShe told the hearing on Wednesday (March 15): 'In 2011, when Robbie was 14 years old his father was killed in a motorcycle accident.\n'That had a massive impact on Robbie and he struggled to cope. It affected his college work and he couldn't sleep.\nMr Ryder struggled to come to terms with the death of his father and turned to bodybuilding\n'He turned to cannabis to cope with his anxiety and grief. But then he started working out and this gave Robbie structure in his life - the training benefitted him.\n'He was trying to be more positive and deal with his problems sober.\n'A couple of weeks before his death, Robbie's demeanour changed and he seemed to be under the influence of something.'\nMrs Emerson told the inquest she had spoken to her son on the morning he died about sorting his life out.\nBut when she returned that evening on October 13, she found her son unresponsive in his bedroom.\nMr Ryder, pictured with his sister Emma, was found slumped and unresponsive in his bedroom by his mother, who had told him just hours before to 'sort his life out'\nShe called 999 and then asked a neighbour for help and he was taken to Hull Royal Infirmary - but died shortly after.\nAfter scouring Mr Ryder's bedroom at his home in Driffield, East Yorkshire, police tracked down an illegal operation in Cyprus - and passed on the address to Interpol.\nHowever, officers were annoyed that the ambulance crews notified them too late to look over the 'crime scene' - his bedroom - to trace an envelope linked to the dark web.\nPC James Gray, of Humberside Police, said: 'We found testosterone and other drugs in his bedroom - it seems he was heavily involved in taking body building steroids.\n'We found a number of suspicious packages containing white powder with no identification.\nPaying tribute to her child, his mother Yvonne Emerson, 46, said: 'We will remember Robbie as the cheeky, mischievous chap, with his gorgeous smile and gorgeous face.\n'The National Crime Agency sent a warning letter to the address over accessing goods on the dark web.\n'We discovered a name and address in Cyprus and we have shared our intelligence with Interpol.'\nBut the officer also expressed his frustration that the investigation was delayed a week because the Yorkshire Ambulance Service failed to inform the police about the death.\nPC Gray also told the inquest: 'There seems to have been a breakdown in communications by the ambulance service.\n'If we had been informed straight away we would have sealed off the scene and gathered all the evidence.\n'We are particularly disappointed we weren't able to get the envelope Mr Ryder opened the morning of his death as it could have contained DNA and fingerprints of the person who sent the drugs.'\nHull Coroner's Court (pictured) heard Mr Ryder's mother said he struggled to come to terms with the death of his father and turned to bodybuilding\nSenior coroner Professor Paul Marks, who ruled out suicide, says he will contact the ambulance service about its failure to alert the police to Mr Ryder's death.\nHe said: 'The police investigation was compromised and it is my intention to bring this to the attention of the ambulance service. After a week, the crime scene was decimated.'\nPaying tribute to her child, his mother said: 'We will remember Robbie as the cheeky, mischievous chap, with his gorgeous smile and gorgeous face.'\n'They say the best gift is the gift of laughter, he was very generous because everyone in his life has laughed out loud with his antics and sense of humour.\n'For the last 20 years, we have watched him grow physically stronger, and witnessed and supported him trying to face his demons and we are so proud of him.\n'To sum up Robbie would be hard to do, he was too big for any words, but we loved him so much and always will, he needed us and we needed him.\n'We will cherish our last happy family memory of Robbie which was one at his step-sister wedding just two weeks before he died.\n'We will look at the happy, full of love photos we all took that day, and remember him always as our loving, smiley son and brother.'","url":"https://www.dailymail.co.uk/news/article-4319870/Bodybuilder-died-taking-steroids-dark-web.html"}
