{"authors":["Karen Ruiz","Ariel Zilber For Dailymail.Com"],"date_download":"2018-10-22 23:00:05","date_modify":"2018-10-22 23:00:05","date_publish":"2017-03-16 05:16:03","description":"The body discovered inside of a submerged car on Friday was identified on Wednesday as that of the Kansas woman who went missing in January after sending a text saying she had been pulled over.","filename":"data/vaneerConsumption/BodyfoundinsubmergedcaridentifiedasToniAnderson.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/11/15/3E2A103F00000578-0-image-a-34_1489244572245.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318906_Body-submerged-car-identified-Toni-Anderson_1540249205.html","title":"Body found in submerged car identified as Toni Anderson","title_page":"Body found in submerged car identified as Toni Anderson | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The body discovered inside of a submerged car on Friday was identified on Wednesday as that of the Kansas woman who went missing in January after sending a text saying she had been pulled over.\nPolice had initially denied the woman, 20-year-old Toni Anderson of Wichita, was pulled over, but have admitted she was stopped by a North Kansas City officer that night.\nThe 2014 Ford Focus that was fished out of the Missouri River on Friday has been confirmed to belong to Anderson.\nScroll down for video\nMissing: Toni Anderson (pictured) was last seen during the early hours of January 15 in Kansas City while driving to meet with friends after work\nInvestigators found Anderson's body inside of her submerged Ford Focus in the Missouri River on Friday evening. Anderson was positively identified on Wednesday\nInvestigators found the vehicle near Anderson's last known location on her cellphone.\n'We just got the news, there’s a body in her car,' the woman's mother Liz Anderson told the Kansas City Star, sobbing. 'There is somebody inside.'\nAnderson's family had hired private investigators who used sonar to find the car.\nThe vehicle was found a few feet off a bank in Platte Landing Park, but her mother cannot understand how her daughter, who was last seen driving home from work in Kansas City, could have got there.\nPolice have not suspected any foul play and the body will be taken to the medical examiner's office to determine a cause of death.\nAnderson was last seen in the early hours of January 15 at a QuikTrip gas station over on 9-Highway, in Kansas City.\nThe young college student had been driving to meet with friends downtown after leaving her job at Chrome entertainment bar on 40-Highway around 4am.\nMoments later, she disappeared, her car GPS failed and her cellphone 'went dark'.\nFinal message: The officer stopped her for an improper lane change, but gave her a warning. Above is the text that Anderson sent to friend Roxanne Townsend saying 'OMG just just (sic) pulled over again'\nFailed to arrive: She left her job at Chrome (left) before she was stopped a short time later by a police officer who pulled her black 2014 Ford Focus over on 9-Highway near a QuikTrip gas station (above)\nJanuary disappearance: Authorities say Anderson drove from her job at Chrome before she was pulled over by a police officer around 4am. The officer then directed her to a nearby gas station, where she was last spotted\nThe young college student had been driving to meet with friends downtown after leaving her job at Chrome entertainment bar on 40-Highway around 4am\nAnderson, who went by the name Vanity, had been stopped by a North Kansas City police officer who pulled her car over on 9-Highway near the QuikTrip gas station.\nText messages show Anderson had messaged her friend Roxanne Townsend at 4.42am saying: 'Omg I just got pulled over again'. Townsend said her friend 'got pulled over all the time'.\nPolice said the woman had been stopped for an improper lane change, but was let off with a warning after she told the officer she was running low on gas.\nAnderson's ATM card was used and her GPS system in car stopped working shortly after she arrived at the QuikTrip.\nIt's unclear if the system malfunctioned or if someone tampered with it.\nAuthorities also have surveillance footage of the woman, but are not releasing it as it is part of their investigation.","url":"https://www.dailymail.co.uk/news/article-4318906/Body-submerged-car-identified-Toni-Anderson.html"}
