{"authors":["Chris Pleasance For Dailymail.Com"],"date_download":"2018-10-23 01:47:47","date_modify":"2018-10-23 01:47:47","date_publish":"2016-01-29 15:58:21","description":"The remains of Kyle Myrick, 28, were found yesterday afternoon around 25 miles from the bike store where he was last seen with Steven Hlebo, 39, a co-worker now accused of murder.","filename":"data/vaneerConsumption/BodyofmissingbikeshopworkerKyleMyrickisfoundsixdaysafterdisappearance.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/26/15/3098CDED00000578-0-image-a-26_1453821373543.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422997_Body-missing-bike-shop-worker-six-days-disappeared-colleague-charged-murder_1540259267.html","title":"Body of missing bike shop worker Kyle Myrick is found six days after disappearance","title_page":"Body of missing bike shop worker Kyle Myrick is found six days after disappearance | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"claimed in an interview from jail that he is being framed\nSevered ear and blood found at their workplace, and more blood found inside Hlebo's truck, led detectives to charge him\nCops said tip led them to body after they revealed evidence against Hlebo\nCo-worker Steven Hlebo, 39, had already been charged with his murder\nThe remains of a missing bike shop worker have been found in woods 25 miles away from the store where he was last seen a week ago.\nThe remains of Kyle Myrick, 28, were discovered near Jamison Creek Road in San Jose, California, at around 4pm yesterday, police told NBC Bay Area.\nOfficers said a tip led them to the body hours after they revealed the evidence that led them to charge Myrick's co-worker Steven Hlebo, 39, with his murder.\nScroll down for video\nThe remains of Kyle Myrick, 28, a bike store worker who went missing from the GP Sports store in San Jose a week ago, have been discovered in woods 25 miles away\nBret Myrick, Kyle's father, revealed the news at a candlelit vigil for his son yesterday evening, while thanking people for 'all the love that has been shown the last few days'\nPolice said a tip-off led them to Jamison Creek Road (pictured), a 45 minute drive from the bike shop, where they discovered Myrick's body at around 4pm yesterday\nDesperate family and friends had been searching for any sign of Myrick since he was last seen at the GP Sports bike store at around 2pm last Friday.\nFather Bret Myrick learned that his son's remains had been found while he was on the way to a candlelit vigil in front of the bike store.\nOnce there, he confirmed to crowds of loved ones that his son was dead, adding: 'All the love that has been shown the last few days for him, as his father has been overwhelming.\n'I did not realize how many people my son had touched.'\nLoved ones had been holding out hope of finding Myrick alive despite detectives saying they believed he had been killed by Hlebo on the day he vanished.\nCops said the men got in a fight while building ATVs before Hlebo killed Myrick, loaded his body into his truck, then disposed of it at an unknown location, the San Jose Mercury reports.\nOfficers believe Hlebo and Myick got into a fight after being asked to assemble ATVs together the the GP Sports store, before Hlebo loaded the body into his truck and disposed of it\nHlebo (pictured), who claims he is innocent of the crime and is being framed, had been working with Myrick at the store for just five days before he died\nLaying out their case, San Jose police Detective Sgt. Paul Hamblin and Detective Jason Tanner said that Myrick and Hlebo were last seen together on Friday afternoon after being sent to go and assemble two ATVs in a lot behind the GP Sports store.\nWhen an employee went to check on them later, he found the gate to the lot locked, which he described as 'highly unusual'.\nHlebo, who was working nearby, was asked to unlock the gate, and when he did there was no sign of Myrick inside. When asked where Myrick had gone, Hlebo claimed not to know.\nAround an hour later, the employee recalled seeing Hlebo's truck pulled up to the back entrance of an abandoned building on the site which had been gutted by a fire in 2014.\nWhen Hlebo was asked to explain what he was doing, he gave a 'nonsensical' answer, the employee told detectives.\nWhen the employee suggested that workers search the abandoned building for Myrick, Hlebo refused to go in, claiming there were 'ghosts' inside.\nAn employee at GP Sports told investigators that Myrick (pictured) and Hlebo were last seen together going into a lot behind the main store to assemble bikes, before the lot was found locked up later\nThe same employee told cops Hlebo's truck was later seen backed up against an abandoned building near the shop (right) and when asked about it he gave a 'nonsensical' answer\nThe other employees then began searching for Myrick, but at 6pm when the store was due to close, Hlebo signed out and took off in his truck, witnesses told police.\nAfter he had gone, the employee and another coworker decided to enter the burned-out building.\nInside, in a small 5ft by 5ft storage unit, they found a good deal of fresh blood spattered across the wall and floor and decided to call police.\nWhen officers arrived they found blood stains suggesting that a body had been dragged to where Hlebo's truck was parked, and a severed ear on the floor of the storage unit.\nOfficers then went to Hlebo's home, only to discover he was out, and staked the property out until 2am when he finally returned home.\nAt that point officers entered the property and searched for Myrick, who was not found, before inspecting Hlebo's truck.\nInside officers said they found more fresh blood in the vehicle's cab, and decided to arrest Hlebo.\nAccording to an unnamed relative, Hlebo also confessed to killing Myrick and dumping his body in the ocean, police said.\nAfter Hlebo went home for the night, that employee and another staff member said they checked the abandoned building and found the blood and ear which is believed to have belonged to Myrick\nDespite Hlebo being charged with murder, family members had been holding out hope of finding him alive and continued searching for him until yesterday afternoon\nHlebo had previously claimed during a jailhouse interview that he was being framed for the crime after somebody drugged his coffee.\nAccording to Hlebo he had been drugged 'for days' with an unknown substance that kept him awake at night, explaining why he was out until 2am the evening Myrick disappeared.\nHowever, Hlebo refused to say who he believes drugged him, or what motive they could have had for killing Myrick themselves.","url":"https://www.dailymail.co.uk/news/article-3422997/Body-missing-bike-shop-worker-six-days-disappeared-colleague-charged-murder.html"}
