{"authors":[],"date_download":"2018-10-22 22:46:34","date_modify":"2018-10-22 22:46:34","date_publish":"2014-05-12 18:55:04","description":"\"Listen, I can't predict what's going to happen,\" he said when asked if he will serve two full years if re-elected.","filename":"data/vaneerConsumption/BoehneronAnotherFullTermImLivingonBorrowedTime.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_20/437061/boehner_67e9d56d77adf27f42753273ea831818.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_congress_boehner-another-full-term-im-living-borrowed-time-n103446_1540248394.html","title":"Boehner on Another Full Term: 'I'm Living on Borrowed Time'","title_page":"Boehner on Another Full Term: 'I'm Living on Borrowed Time'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nHouse Speaker John Boehner says that if he has his way, he'll still be Speaker of the House one year from today.\n\"I'm running for reelection, I expect to be Speaker,\" Boehner, R-Ohio, told Texas Tribune CEO and Editor-in-Chief Evan Smith during an interview in San Antonio.\nBut asked if he would serve the full two years if he were to win a 13th term in November, Boehner would not commit.\n\"Listen, I can't predict what's going to happen,\" Boehner said. \"I'm going to be 65 years old in November, I never thought I'd live to be 60, so I'm living on borrowed time.\"\nBoehner is opposed by a small faction in the House Republican Conference who have publicly stated that they would like to see him replaced. Ten Republicans voted for someone other than Boehner when he was reelected as Speaker in 2013.\nBut any efforts by that group to force a change at the top of the party have yet to solidify into a serious challenge of Boehner's speakership. And while the past two years have been bumpy for both House Republicans and Congress as a whole, Boehner feels confident that his standing is strong.\n\"This issue comes up from time to time, probably more often than I'd like,\" Boehner said, \"I have a very good relationship with my colleagues on both sides of the aisle, and even in my own party -- even with some people who we have disagreements almost every day -- I have good relationships with them as well. It's open, it's honest, and it's straight forward, so I'm looking forward to it.\"\nWhile saying \"it's way too early\" to be discussing 2016 presidential politics, Boehner also reiterated his praise of former Florida Governor Jeb Bush as a possible contender for the Republican nomination.\n\"Jeb Bush is my friend, I think he'd make a great president, and I've been nudging him for some time,\" Boehner said.","url":"https://www.nbcnews.com/politics/congress/boehner-another-full-term-im-living-borrowed-time-n103446"}
