{"authors":[],"date_download":"2018-10-22 22:32:10","date_modify":"2018-10-22 22:32:10","date_publish":"2014-06-10 14:41:21","description":"\"There is not any doubt in my mind, there are going to be costs – of lost lives - associated with what came out of this,\" House Speaker says","filename":"data/vaneerConsumption/BoehneronBergdahlSwapWereGoingtoPayforThis.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/499206/boehner_veterans_health_care-jpeg-0a0cd_5824d30ed9c2ed82d0f87eb799723eb8.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_boehner-bergdahl-swap-were-going-pay-n127301_1540247530.html","title":"Boehner on Bergdahl Swap: 'We're Going to Pay for This'","title_page":"Boehner on Bergdahl Swap: 'We're Going to Pay for This'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nHouse Speaker John Boehner offered a grim outlook Tuesday on the consequences of the prisoner swap that resulted in the release of Sgt. Bowe Bergdahl, saying flatly that “we’re going to pay for this.”\n“There is not any doubt in my mind, there are going to be costs – of lost lives - associated with what came out of this,” Boehner told reporters at a press conference on the Hill.\nCritics allege that the exchange of Bergdahl for five Guantanamo detainees amounts to “negotiating with terrorists” and that the Taliban members transferred to Qatar are likely to return to the battlefield.\nBoehner also told reporters that he was \"never briefed about a five to one swap.\"\nLast week during a deep background briefing with a House GOP leadership aide, NBC's Kelly O'Donnell was told that House leaders were briefed in November of 2011 and told that part of the effort to build confidence between the Taliban and the United States could involve the exchange of Bergdahl and five detainees at Guantanamo Bay.\nPressed on the statement, Boehner spokesman Michael Steel said \"He was briefed on the possibility as one of range of measures in an overall confidence-building process - never on this specific one-off trade in and of itself.\"\nA closed-door briefing with White House officials Monday night did little to soothe those concerns. Republicans emerged from the meeting incensed, saying that as many as 90 administration officials knew about the imminent prisoner swap but no members of Congress had been informed.\n\"That to me is not following the law, it's not good practice,” said Republican Rep. Buck McKeon, chair of the Armed Services Committee.","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/boehner-bergdahl-swap-were-going-pay-n127301"}
