{"authors":[],"date_download":"2018-10-22 20:58:12","date_modify":"2018-10-22 20:58:12","date_publish":"2014-06-03 18:37:33","description":"House Speaker John Boehner on Tuesday called for Congressional hearings into the circumstances surrounding the release of Army Sgt. Bowe Bergdahl.","filename":"data/vaneerConsumption/BoehnerCallsforHearingsonBergdahlRelease.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/484861/140603-boehner_gop_bergdahl-1436_9e7651fcb60b43519e5f1bf1a194e12c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_boehner-calls-hearings-bergdahl-release-n121501_1540241892.html","title":"Boehner Calls for Hearings on Bergdahl Release","title_page":"Boehner Calls for Hearings on Bergdahl Release","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nHouse Speaker John Boehner on Tuesday called for Congressional hearings into the circumstances surrounding the release of Army Sgt. Bowe Bergdahl, adding that the prisoner exchange has “compromised” U.S. security overseas.\n“The administration has invited serious questions into how this exchange went down and the calculations the White House and relevant agencies made in moving forward without consulting Congress,” Boehner said in a statement.\nThe top House Republican said he supports calls from Rep. Buck McKeon, chair of the House Armed Services Committee, for Congressional hearings on whether the Obama administration violated the law by exchanging five Guantánamo Bay prisoners for Bergdahl.\nBoehner said members of Congress had been briefed on a possible prisoner swap two years ago and had “serious questions” that went unanswered. The Ohio Republican said he expected the White House to re-engage Congress with answers before taking action, but heard nothing.\nAdministration officials contend the deal had to be done swiftly because of Bergdahl’s failing health and concerns there was only a short time to rescue him.\nBoehner also said the exchange has put Americans currently serving overseas at risk.\n“One of their greatest protections - knowing that the United States does not negotiate with terrorists - has been compromised,” he said.","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/boehner-calls-hearings-bergdahl-release-n121501"}
