{"authors":[],"date_download":"2018-10-22 22:49:16","date_modify":"2018-10-22 22:49:16","date_publish":"2014-05-12 19:18:45","description":"House Speaker John Boehner says getting immigration reform done is not about politics, but a business leader says it is key to the GOP's future.","filename":"data/vaneerConsumption/BoehnerPoliticsisNotDrivingWhethertoDoImmigration.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_20/437146/20140512-tx-protests-boehner-sl-1533_0805f9c9f30f9fb2994f031507431110.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_boehner-politics-not-driving-whether-do-immigration-n103461_1540248556.html","title":"Boehner: Politics is Not Driving Whether to Do Immigration","title_page":"Boehner: Politics is Not Driving Whether to Do Immigration","title_rss":"NULL","source_domain":"nbcnews.com","text":"House Speaker John Boehner said getting immigration reform is not about politics, a few hours after the U.S. Chamber of Commerce president said blocking legislation on the issue would kill GOP chances in 2016.\nBoehner discussed immigration and several other issues in an interview with the Texas Tribune during a San Antonio Chamber of Commerce luncheon Monday. Donohoe spoke at the opening of U.S. Chamber of Commerce events this week in Washington, D.C. that are focused on transportation and infrastructure.\nBoehner was asked whether failure to deal with the issue of immigration reform presents an election problem for Republicans.\n\"This is not about politics. It's not about elections,\" Boehner responded. \"It's about doing the right thing for the American people. It's about doing the right thing for the country, period.\"\nPressed further and reminded the GOP only won 27 percent of the Latino vote in 2012, Boehner said the political impact is not going to \"drive me to do the right thing or the wrong thing.\"\nA few dozen people protested Boehner's appearance, urging he stop deportations. Boehner also made a fundraising stop in Texas.\nBack in Washington, chamber President and CEO Tom Donohue said during a panel discussion his organization is about to put \"a lot more heat\" on Congress to get immigration reform done.\n\"If the Republicans don't do it they shouldn't bother to run a candidate in 2016,\" Donohue said during a panel discussion. \"Think about that, think about who the voters are.\"\nThe country needs people it trains in universities, he said. If immigration reform is not done, \"you are going to go to the nursing home and pick up your mother-in-law and bring her home,\" Donohue said, alluding to immigrants who work at nursing homes.\nJay Timmons, president and CEO of the National Association of Manufacturers, said he also thinks immigration would get done this year, in the lame duck session that will follow November's mid-term elections. A pathway to citizenship, he said, is absolutely essential to manufacturers, \"because we work very hard to build communities.\"","url":"https://www.nbcnews.com/news/latino/boehner-politics-not-driving-whether-do-immigration-n103461"}
