{"authors":[],"date_download":"2018-10-22 21:03:51","date_modify":"2018-10-22 21:03:51","date_publish":"2014-05-05 11:29:14","description":"The new search phase will focus on 24,000 square miles of sea bed and is expected to last at least eight months.","filename":"data/vaneerConsumption/BoeingRollsRoycetoFaceBillOverHuntforFlightMH370.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_18/418316/tdy_jet-comp_140503_df28c0aa38fb70472c7b9a055ada9805.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-jet_boeing-rolls-royce-face-bill-over-hunt-flight-mh370-n97011_1540242231.html","title":"Boeing, Rolls-Royce to Face Bill Over Hunt for Flight MH370","title_page":"Boeing, Rolls-Royce to Face Bill Over Hunt for Flight MH370","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBoeing and Rolls-Royce could be asked to help fund a new $55-million phase of the hunt for missing Malaysia Airlines jet, Australia’s transport minister said Monday.\n“We will need to discuss with Malaysia and China and other parties who have an interest in how that or other costs might be shared,” Warren Truss told reporters in Canberra. Until now, individual countries have paid their own way with the Pentagon announcing late last month that the U.S. military had spent $11.4 million during the search.\nPlane manufacturer Boeing and and engine maker Rolls-Royce “also have a vested interest in understanding what happened to MH370 so they can be confident about the quality of their product or take remedial action if there was some part of the aircraft that contributed to this accident,” Truss added.\nHe said that \"increasing involvement\" would be sought from the firms and their host countries in the weeks ahead.\nThe new search phase will focus on 24,000 square miles of sea bed and is expected to last at least eight months.\nAuthorities also announced Monday that all data gathered in the hunt for the missing Boeing 777 will be re-examined by an international team of experts to make sure the correct area of the southern Indian Ocean is being scoured.\n- Henry Austin and Rebekah Smyth","url":"https://www.nbcnews.com/storyline/missing-jet/boeing-rolls-royce-face-bill-over-hunt-flight-mh370-n97011"}
