{"authors":["Benjamin Zhang"],"date_download":"2018-10-30 20:39:07","date_modify":"2018-10-30 20:39:07","date_publish":"2016-12-28 00:00:00","description":"Delta Air Lines announced on Wednesday that it has cancelled its order for 18 Boeing 787 Dreamliners valued at $4 billion.","filename":"data/vaneerConsumption/BoeingjustgotsomebadnewsfromDelta.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_delta-cancel-boeing-787-dreamliner-order-2016-12_1540931947.html","title":"Boeing just got some bad news from Delta","title_page":"    Delta has cancelled its $4 billion Boeing 787 Dreamliner order - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Boeing 787-8 Dreamliner. Wikimedia Commons On Wednesday, Delta Air Lines announced that it has reached an agreement with Boeing to cancel an order for 18 787 Dreamliners.\nThe order, worth roughly $4 billion at current list prices, was placed by Northwest Airlines prior to its 2008 merger with Delta.\n\"Delta is one of the world's largest operators of Boeing aircraft and our valued partnership with Boeing will remain strong as we safely and comfortably serve our customers across the world every day,\" Delta senior vice president for supply chain management and fleet Greg May said in a statement.\n\"This business decision is consistent with Delta's fleet strategy to prudently address our wide-body aircraft needs.\"\nIn an email to Business Insider, a Boeing spokesperson wrote:\n\"We've been working closely with Delta as their needs have evolved since inheriting the order from Northwest. Delta is a valued customer and we continue working with them to meet their future fleet requirements.\"\nWhile the vast majority of Delta's 800-plus aircraft are Boeing-made, the future of the airline's long-haul wide-body fleet leans heavily toward Airbus. Over the past three years, Delta has ordered no less than 60 A350-900, A330neo, and A330-300 wide-body jets from Airbus.\nWhile Boeing hasn't landed any new wide-body orders from Delta, the Seattle-based planemaker does boast an order for 120 737-900ER narrow-body jets from the carrier.\nPrior to its cancellation, Delta pushed back deliveries of the Dreamliner order to beyond 2020. Even with the Delta cancellation, Boeing still boasts a healthy backlog of more than 700 Dreamliners.","url":"https://www.businessinsider.com/delta-cancel-boeing-787-dreamliner-order-2016-12"}
