{"authors":["Associated Press"],"date_download":"2018-10-23 02:00:14","date_modify":"2018-10-23 02:00:14","date_publish":"2017-04-26 12:50:59","description":"CHICAGO (AP) - Boeing topped expectations for first-quarter profit, but the aerospace giant's sales fell short of forecasts, and the shares fell in...","filename":"data/vaneerConsumption/Boeingbeats1Qprofitforecastsbutrevenuefalls.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/16/wire-466121-1493220058-410_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447486_Boeing-beats-1Q-profit-forecasts_1540260014.html","title":"Boeing beats 1Q profit forecasts but revenue falls","title_page":"Boeing beats 1Q profit forecasts but revenue falls | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"CHICAGO (AP) - Boeing topped expectations for first-quarter profit, but the aerospace giant's sales fell short of forecasts, and the shares fell in Wednesday-morning trading.\nChicago-based Boeing Co. said Wednesday that it earned $1.45 billion in the first quarter. Excluding non-repeating gains, the profit came to $2.01 per share.\nThe average estimate of 10 analysts surveyed by Zacks Investment Research was $1.91 per share.\nFILE - In this Friday, March 31, 2017, file photo, Boeing employees walk the new Boeing 787-10 Dreamliner down towards the delivery ramp area at the company's facility in South Carolina after conducting its first test flight at Charleston International Airport in North Charleston, S.C. The Boeing Co. reports earnings, Wednesday, April 26, 2017. (AP Photo/Mic Smith)\nRevenue was $20.98 billion. Five analysts surveyed by Zacks expected $21.44 billion.\nBoeing blamed the disappointing sales number on delayed deliveries of commercial and defense aircraft. The company delivered 169 commercial planes in the quarter, down from 176 a year earlier. Boeing said it planned for fewer deliveries of its workhorse 737 plane as it prepares to launch a new version next month.\nRevenue from sales of military planes plunged 28 percent, to $2.64 billion.\nBoeing expects full-year earnings in the range of $9.20 to $9.40 per share, an increase of a dime per share, as the company now expects a full-year tax rate of 31 percent instead of 32 percent.\nIn morning trading, the shares were down $3.01, or 1.6 percent, to $180.50.\n_____\nElements of this story were generated by Automated Insights (http://automatedinsights.com/ap) using data from Zacks Investment Research. Access a Zacks stock report on BA at https://www.zacks.com/ap/BA\n_____\nKeywords: Boeing, Earnings Report, Priority Earnings","url":"https://www.dailymail.co.uk/wires/ap/article-4447486/Boeing-beats-1Q-profit-forecasts.html"}
