{"authors":[],"date_download":"2018-10-23 00:40:50","date_modify":"2018-10-23 00:40:50","date_publish":"2017-03-16 10:13:19","description":"Boko Haram Islamists have raided a town in restive northeast Nigeria, looting food supplies and burning homes after overwhelming troops, residents told AFP...","filename":"data/vaneerConsumption/BokoHaramraidNigeriatownlootfoodsupplies.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/10/wire-227641-1489659201-440_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4319546_Boko-Haram-raid-Nigeria-town-loot-food-supplies_1540255250.html","title":"Boko Haram raid Nigeria town, loot food supplies","title_page":"Boko Haram raid Nigeria town, loot food supplies | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Boko Haram's insurgency has triggered a major food emergency in northeastern Nigeria\nBoko Haram Islamists have raided a town in restive northeast Nigeria, looting food supplies and burning homes after overwhelming troops, residents told AFP on Thursday.\nThe attack late on Wednesday happened in Magumeri, some 50 kilometres (30 miles) northwest of the Borno state capital, Maiduguri.\nIt came after a lull in raids on major towns in the remote region following sweeping military offensives which Nigeria has claimed has severely weakened the jihadists to the point of defeat.\nScores of Boko Haram fighters arrived in Magumeri at about 6:30 pm (1730 GMT) in vans, motorcycles and on foot, firing heavy weapons and rocket-propelled grenades, forcing residents to flee.\n\"They (Boko Haram) broke into shops and homes and took away every food item they came across,\" said local resident Kulo Sheriff, who fled the town then returned on Thursday morning.\n\"They set fire to homes and shops as they looted them before heading into the bush hours later.\"\nBefore looting, the fighters attacked a military base and a police station where there was a shoot-out, according to a civilian militia member assisting troops with security.\nMilitants overpowered the security personnel who withdrew, allowing them to loot and burn down the base and the police station, he added.\n- 'Famine-like conditions' -\nNigeria's military, however, claimed to have repelled the attack and \"neutralised quite a number of the attackers\", recovering three vehicles and a \"large quantity of arms and ammunition\".\nIndependent verification was not possible given access restrictions for reporters to travel outside Maiduguri without military permission.\nEither way, the raid indicated that Boko Haram still has the capacity to attack major towns, despite claims it is in disarray since troops flushed them out of their Sambisa Forest stronghold.\nThe number of raids has decreased since the camps were routed last December, although there have been sustained attempts at suicide bombings in Maiduguri.\nA civilian militia member in the city maintained Boko Haram have been weakened and their attacks were designed to re-stock dwindling food supplies, as supply lines have been cut off.\n\"Boko Haram are starving in the bush, they live on very little food,\" said Babakura Kolo. \"They are pushed more by hunger to carry out raids than desire to fight.\"\nLast month Boko Haram fighters went door-to-door seizing food aid distributed days earlier in Gajiram, some 100 kilometres by road from Magumeri, after a battle with police and soldiers.\nBoko Haram's insurgency has triggered a major humanitarian crisis in northeastern Nigeria, where 7.1 million people are \"severely food insecure\", according to the UN.\nAid agencies say parts of Borno state are suffering from \"famine-like conditions\".\nPoor governance and climate change have also been powerful contributors to the crisis in the region.","url":"https://www.dailymail.co.uk/wires/afp/article-4319546/Boko-Haram-raid-Nigeria-town-loot-food-supplies.html"}
