{"authors":["Frances Martel"],"date_download":"2018-10-30 17:53:15","date_modify":"2018-10-30 17:53:15","date_publish":"2015-10-23 19:20:54","description":"Nigeria's police chief says there is evidence Boko Haram terrorists are making bombs disguised as iPads, iPhones, and laptops.","filename":"data/vaneerConsumption/BokoHaramEquippedwithiPadBombs.json","image_url":"https://media.breitbart.com/media/2015/10/ipad-afp.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_10_23__1540921995.html","title":"Boko Haram Equipped with 'iPad Bombs'","title_page":"Nigerian Police: Boko Haram Equipped with 'iPad Bombs'","title_rss":"NULL","source_domain":"breitbart.com","text":"Nigeria’s police chief is warning civilians to avoid any abandoned iPads, iPhones, or other expensive technology, as there is evidence that Boko Haram terrorists are making bombs disguised as these items and leaving them in populated city centers.\nThe Islamic State-affiliated terror group, which has since renamed itself to the Islamic State West Africa Province, has increased the number of bombings it has executed in recent weeks, using simple explosives to mostly target mosques during prayers times. Police Chief Solomon Arase warned Thursday that they are looking to diversify their attacks, however, and that they have discovered that five suspects arrested for bombings earlier this month were hiding an assortment of “high-tech gadgets” meant to be used as bombs.\n“Boko Haram extremists are building bombs in iPads and cellphones and leaving them for people to pick up,” he told reporters, warning civilians to ignore any of these “gadgets” if they find them in public lying around alone. He also mentioned laptops as potential bombs.\nPolice spokesman Olabisi Kolawole listed the full array of items found in the homes of suicide bombers they had definitively identified: “Engineering textbooks, laptops, phone, face mask, funnel, text tubes, iPad, 2 number plates, gloves, 27 pieces of detonators, and aluminum powder.”\nThe use of smaller bombs hidden in attractive and expensive objects to target random civilians is a change in strategy for Boko Haram. The Nigerian military has warned previously that they believe the terrorists are running out of conventional ammunition and fuel, forcing them to resort to more unorthodox measures. Last week, the military warned that Boko Haram terrorists may be in possession of cluster bombs, which are illegal under a number of international treaties. Without the aircraft necessary to drop the bombs, the terrorists may be hiding them in the shrubbery common to northern Nigeria, turning them into impromptu land mines.\nThe lack of ammunition has triggered a change in strategy from village raids to suicide bombings, often using brainwashed child hostages. On October 16, three female suicide bombers targeted a mosque and market in Maiduguri, the capital of northeast Borno state and Boko Haram hometown. The suicide bombers were believed to be between eleven and fifteen years of age.\nAnother mosque bombing hit Maiduguri Friday, killing at least 28 people, according to the latest reports. Nigeria’s Vanguard newspaper notes that this is the sixth suicide bombing in the city in October alone. This month, 76 people have died. In this Friday’s bombing, two men were arrested after being caught celebrating the bombing from some feet away, “hugging each other like a celebration” and “chanting Allahu Akbar.”\nThere are also unconfirmed reports of a mosque bombing in neighboring Adamawa state Friday, though the Adamawa State Emergency Management Agency told reporters they had not yet heard of the incident and would respond as soon as they had more information.\nBoko Haram terrorists often target rural villages, resulting in news of their massacres taking days to arrive to the cities, usually through a fleeing survivor.\nThe United States has recently expanded its efforts in west Africa to combat Boko Haram. On October 15, the Pentagon announced that American troops would be deployed to neighboring Cameroon to help combat the spread of Boko Haram to that country. This week, American military officials provided Niger, which is also experiencing a surge in Boko Haram attacks, two surveillance planes for use in monitoring the dense forests in which Boko Haram terrorists hide when not engaging in attacks.\nNigerian President Muhammadu Buhari has promised to eradicate Boko Haram by December, and has repeatedly insisted his military would be able to fulfill that promise. To that end, military sources tell Nigerian media that Buhari has employed a group of 250 South African mercenaries to fight Boko Haram in northern Nigeria, hired from South African private contractor Specialised Tasks, Training, Equipment and Protection (STTEP).","url":"https://www.breitbart.com/national-security/2015/10/23/nigerian-police-boko-haram-equipped-ipad-bombs/"}
