{"authors":["Frances Martel"],"date_download":"2018-10-30 17:52:06","date_modify":"2018-10-30 17:52:06","date_publish":"2017-01-20 17:42:44","description":"Boko Haram raided a refugee camp late Thursday night, little more than 48 hours after the Nigerian military conducted an airstrike on it.","filename":"data/vaneerConsumption/BokoHaramAttacksRefugeeCampThatNigerianAirForceBombed.json","image_url":"https://media.breitbart.com/media/2017/01/nigeria-bombs-refugee-camp-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_01_20__1540921926.html","title":"Boko Haram Attacks Refugee Camp That Nigerian Air Force Bombed","title_page":"Boko Haram Attacks Refugee Camp That Nigerian Air Force Bombed","title_rss":"NULL","source_domain":"breitbart.com","text":"The Islamic State affiliate Boko Haram raided a refugee camp in northeastern Nigeria late Thursday night, little more than 48 hours after the Nigerian military accidentally conducted an airstrike on the women and children housed in the facility.\nNigeria’s Premium Times reported Friday that the Rann camp for internally displaced persons (IDPs) – most women and children who lost their villages and families in Boko Haram raids – came under attack at around 6 p.m. Thursday evening. The siege continued for several hours, according to an unnamed source, who added that the Nigerian military succeeded in forcing the terrorists to flee and killed eight of the attackers.\nWhile the Premium Times indicated that only one Nigerian soldier was injured in the raid, Fox News and the Associated Press reported that “the death toll could be as high as 170,” though they appear to be including in the tally those killed on Tuesday. Those outlets estimated the number of Boko Haram terrorists attacking to be “over 100” people, who appeared to be specifically targeting individuals recovering from severe injuries obtained during the Nigerian military airstrike on Tuesday.\nNigerian officials said Wednesday that their airstrike was intended to target a Boko Haram base near the refugee camp, but accidentally hit the wrong location. Estimates range at between 76 and 120 people killed in the camp, and dozens more severely injured.\nThe Nigerian military has apologized for the incident, which appeared to harm more refugees than the Boko Haram attack. Abba Kyari, chief of staff to President Muhammadu Buhari, said in a statement, “This kind of incident happens occasionally in war.”\nThe Air Force also issued a statement: “The Nigerian Air Force (NAF) is saddened by today’s accidental air strike by its fighter jet at Rann in Kala Balge area of Borno State in which some innocent lives were lost.” The nation’s Senate, meanwhile, urged the military not to bomb refugee camps, while thanking the nation’s “gallant soldiers.”\nThe Nigerian military has faced many challenges with the Rann IDP camp, though the airstrike has caused by far the most damage. Human rights advocacy groups have accused Nigerian soldiers of exploiting the women in the camp – some women have claimed that soldiers have raped them, while others have alleged that they have been promised marriage and abandoned after soldiers have made them pregnant.\nWhile Nigerian officials have repeatedly claimed Boko Haram has been defeated, the group has continued to stage attacks, though none in recent memory as deadly as the Nigerian military’s own attack on the refugee camp. The day before the airstrike, two child suicide bombers attacked the University of Maiduguri in the capital of northeastern Borno state. Local outlets reported that the suicide bombers were seven and twelve years old. Boko Haram took credit for the bombing on Friday in an audio recording by a man who identified himself as Boko Haram leader Abubakar Shekau.\n“The bomb that exploded on Monday morning, it’s our brothers responsible for it,” the man claiming to be Shekau stated.","url":"https://www.breitbart.com/national-security/2017/01/20/boko-haram-attacks-refugee-camp-nigerian-air-force-bombed/"}
