{"authors":[],"date_download":"2018-10-22 21:17:33","date_modify":"2018-10-22 21:17:33","date_publish":"2014-06-04 19:26:20","description":"The Islamic fighters are making a comeback from a year-long military offensive aimed at crushing them.","filename":"data/vaneerConsumption/BokoHaramMilitantsSeizingVillagesinNigeriaWitnesses.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_22/447876/140516-boko-haram-abubakar-shekau-mn-1415_daa04a0780c15f8266bb57d5388d9e88.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_boko-haram-militants-seizing-villages-nigeria-witnesses-n122736_1540243053.html","title":"Boko Haram Militants Seizing Villages in Nigeria: Witnesses","title_page":"Boko Haram Militants Seizing Villages in Nigeria: Witnesses","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBoko Haram militants are taking over villages in northeastern Nigeria, killing and terrorizing civilians and political leaders, witnesses say, as the Islamic fighters make a comeback from a year-long military offensive aimed at crushing them.\nNigeria's military has insisted that the big influx of troops and a year-old state of emergency in three states which gives them the power to detain suspects, take over buildings and lock down any area has the extremists on the run.\nBut while Boko Haram has in large part been pushed out of cities in the northeast, they have been seizing villages with thatched-roof huts in the semi-arid region where they once held sway, boldly staking their claim by hoisting their black flags with white Arabic lettering, and making large swaths of Nigeria no-go regions for the military.\nNglamuda Ibrahim, a local government official, says the militants hoisted their flags in Ashigashiya, which borders Cameroon, several weeks ago without interference from the security forces.\nMuhammed Gavva, a member of one of the vigilante groups formed last year, named another dozen villages that also fell to Boko Haram, also close to the Cameroonian border, with no action taken by Nigerian security forces. He said one road to Maiduguri, the capital of Borno state where the military joint task force has its headquarters, is so dangerous that even soldiers don't dare to travel it.\n\"We have long informed the military officials about this. They are aware but we don't know what they are doing about that,\" Gavva said. The seized villages are near Gwoza, a regional political center whose emir was killed in a Boko Haram ambush on his convoy last week. Emirs are religious and traditional rulers who have been targeted for speaking out against Boko Haram's extremism.\n— The Associated Press","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/boko-haram-militants-seizing-villages-nigeria-witnesses-n122736"}
