{"authors":[],"date_download":"2018-10-22 22:45:51","date_modify":"2018-10-22 22:45:51","date_publish":"2014-05-12 10:16:34","description":"If genuine, the video would be the first confirmation that many of the missing students remain alive.","filename":"data/vaneerConsumption/BokoHaramVideoWellExchangeNigerianGirlsForPrisoners.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2015_03/435466/140512-boko-haram-girls-615a_3b1b1e9775136d2661af7e911428fe35.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_boko-haram-video-well-exchange-nigerian-girls-prisoners-n102841_1540248351.html","title":"Boko Haram Video: We'll Exchange Nigerian Girls For Prisoners","title_page":"Boko Haram Video: We'll Exchange Nigerian Girls For Prisoners","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe leader of Nigeria's Boko Haram said in a video Monday that he would free more than 200 kidnapped schoolgirls in exchange for the release of militant prisoners.\nDozens of the abducted girls were shown wearing full veils and praying in the video, which was obtained by French news agency AFP and which U.S. officials believe is genuine.\nThe recording is the first apparent confirmation that any of the missing students remain alive.\nBoko Haram's leader Abubakar Shekau appeared in the video, saying the girls had been converted to Islam.\n\"These girls have become Muslims,\" Shekau said in the 17-minute recording. \"We will never release them until after you release our brethren.\"\nIn one part of the recording, the girls recite “Al-Fatiha” -- the first chapter of the Quran -- in Arabic. \"Al-Fatiha,\" which comprises seven verses, is one of the first prayers taught to those learning Islam.\nAFP declined to release a word-for-word translation of the girls' comments because they were being held as hostages. It also reported that Nigeria's interior minister Abba Moro quickly rejected the idea of a prisoner release.\nInternational outrage has grown about the fate of the girls, who were seized on April 14 when militants from Boko Haram stormed a secondary school in the northeastern village of Chibok. The militants took 276 girls who were taking exams. Some managed to escape but around 200 remain missing.\nThe United States and Britain have flown in experts to help the search effort in Nigeria.\nNBC News counter-terrorism analyst Michael Leiter said Boko Haram had previously demanded the release of imprisoned members.\n“This [video] is consistent with the group’s goals,” he told TODAY’s Savannah Guthrie, adding that it was “unlikely” Nigeria’s government would meet the demand.\n\"My sense is that President Goodluck Jonathan is not someone who is interested in negotiation with Boko Haram. Given the level of aggression that the Nigerian government has used when countering Boko Haram I don't think any [prisoner] release is forthcoming.\"\nHe said the sign that many of the girls were in one group was welcome – but did not mean a rescue attempt was any closer.\n\"A rescue is always going to be very, very difficult,\" Leiter added. \"This is an extremely remote area and the Nigerians have not in the past taken a lot of assistance from the United States so the fact they are in one group makes it more possible but I wouldn't underplay how hard it would be for either the Nigerians alone or even with U.S. assistance.\"\nNBC News' Ghazi Balkiz contributed to this report.","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/boko-haram-video-well-exchange-nigerian-girls-prisoners-n102841"}
