{"authors":[],"date_download":"2018-10-22 21:10:40","date_modify":"2018-10-22 21:10:40","date_publish":"2014-05-06 01:40:02","description":"Long history of human trafficking in west African nation lends credence to Boko Haram leader's reported threat.","filename":"data/vaneerConsumption/BokoHaramCouldMakeGoodonThreattoSellNigerianGirls.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/422161/140505-nigeria-girls-jms-2155_337ed854892fcc2151897b4fe14f04d5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_boko-haram-could-make-good-threat-sell-nigerian-girls-n97796_1540242640.html","title":"Boko Haram Could Make Good on Threat to 'Sell' Nigerian Girls","title_page":"Boko Haram Could Make Good on Threat to 'Sell' Nigerian Girls","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIf Islamic terror group Boko Haram abducted more than 200 Nigerian schoolgirls, as its leader claims, the kidnappers could fulfill their reported threat to “sell” the girls into slavery by tapping that nation’s thriving human-trafficking market, experts say.\nOn Monday, the French news agency AFP reported that the leader of Boko Haram, Abubakar Shekau, had claimed responsibility for the gunpoint abduction of the schoolgirls from a secondary school in the village of Chibok in northeast Nigeria on April 14, and threatened to “sell them in the market.” The report, which AFP said was based on a videotaped address by Shekau, could not immediately be verified by NBC News.\nWhile the suggestion that slavery could be conducted so openly might strike some as outlandish, it is an unfortunate reality, said Brad Myles, CEO of the anti-human-trafficking group Polaris Project. The human-trafficking market in Nigeria has been well documented in a series of reports by governmental and non-governmental agencies, and the problem is by no means confined to the west African nation, he said.\n“What this particular case brings home is how shocking it is that this can happen in our modern world.”\n“I think the thing that is important for people to understand is that the International Labor Organization estimates that there are 21 million people held in modern slavery around the world, while other estimates put that number as high as 30 million,” he said.\n“What this particular case brings home is how shocking it is that this can happen in our modern world.”\nMyles said that while most trafficking does occur underground, his organization has received some reports “involving the direct trade or selling of human beings” in settings similar to the slave markets of old.\nBut even if Shekau did not threaten to literally auction off the girls, he would have little difficulty finding buyers willing to pay for them and “force them into the sex trade, labor or some other activity against their will,” he said.\n“It functions like a market, which is incredibly scary,” Myles said. “When you take a crime that involves violence against women and children, and then you add the market element, it makes the crime all the more heinous.”\nShekau’s videotaped taunting of Nigerian government officials has triggered demonstrations in Nigeria, Europe and in at least four U.S. cities.\n“I abducted your girls. I will sell them in the market, by Allah,\" Reuters quoted Shekau as saying, chuckling as he stands in front of an armored personnel carrier with two masked militants wielding AK-47s on either side of him.\n\"Allah has instructed me to sell them. They are his property and I will carry out his instructions,\" he said.\nThe video emerged days after reports emerged last week that some of girls had been forced to marry their abductors — who paid a nominal bride price of $12 — and that others have been taken to neighboring Cameroon and Chad. NBC News could not verify those reports.\nHuman trafficking has been a long-running problem in Nigeria, and the abduction of the schoolgirls,\nThe U.S. State Department’s 2013 Trafficking in Persons report lists Nigeria as “a source, transit, and destination country for women and children subjected to trafficking in persons, specifically conditions of forced labor and forced prostitution.”\nIt said most women and girls are forced into either the sex trade or domestic servitude. Those used for forced prostitution are often smuggled into European countries, it said.\nThe report categorized Nigeria as a “Tier 2” country, meaning it is not in full compliance with the minimum standards set forth by the federal Trafficking Victims Protection Act passed by Congress in 2000, but is making “significant efforts” to meet those standards. Among other things, it said, the government in 2012 had modestly increased the budget of the National Agency for the Prohibition of Trafficking in Persons.\nThe Global Slavery Index, an annual survey by the Australian anti-trafficking group the Walk Free Foundation, ranks Nigeria fourth on its list of nations with the highest number of people living in “modern slavery,” behind India, China and Pakistan.\nBy another measure in the index, however, which estimates prevalence of modern slavery by population, levels of child marriage and levels of human trafficking, Nigeria ranks 48th in the world.\nThe country’s efforts to combat human trafficking have been hampered by its continuing conflict with Boko Haram - whose name means \"Western education is sinful.\" The group has been waging an increasingly violent campaign to carve out an Islamic state in northern Nigeria over the last five years.\nThere have been reports that Nigerian officials are complicit in the human trafficking, allegations that Myles said match what the Polaris Project and other anti-trafficking groups have documented elsewhere.\n“There absolutely are instances of corruption happening, where there is a pimp of a young child paying off a government official not to come raid the brothel or a smuggler paying a border official to look the other way to bring people into the country,” he said.","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/boko-haram-could-make-good-threat-sell-nigerian-girls-n97796"}
