{"authors":["Frances Martel"],"date_download":"2018-10-30 17:53:19","date_modify":"2018-10-30 17:53:19","date_publish":"2015-08-06 14:32:29","description":"A new raid on several villages in northern Cameroon by Nigerian jihadist group Boko Haram has left at least eight dead and 135 others missing, believed kidnapped by the group.","filename":"data/vaneerConsumption/BokoHaramAbduct135inNewRaidinCameroon.json","image_url":"https://media.breitbart.com/media/2015/05/Boko-Haram-Fighters-in-Nigeria-NBC-News.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_08_06__1540921999.html","title":"Boko Haram Abduct 135 in New Raid in Cameroon","title_page":"Boko Haram Abduct 135 in New Raid in Cameroon","title_rss":"NULL","source_domain":"breitbart.com","text":"A new raid on several villages in northern Cameroon by Nigerian jihadist group Boko Haram has left at least eight dead and 135 others missing, believed kidnapped by the group. The news follows, and flies into the face of, multiple unconfirmed reports that the ISIS-linked organization is looking to lay down it weapons.\nWitnesses tell the Agence France-Presse that the overnight raid occurred in the village of Chakamari in Cameroon, and those who survive say 135 people have been abducted by the group, likely taken into the forest strongholds where Boko Haram typically keeps its hostages. “Men from Boko Haram attacked our neighbours in the village of Chakamari overnight Monday-Tuesday. They killed eight people, two women and six men,” said a member of a vigilante group to the news organization. In addition to this attack, nine fishermen were shot dead near Lake Chad by another cluster of Boko Haram jihadists. As is typical for the group, they burned down most of the village before leaving with their spoils.\nThe attack on Cameroon and the Lake Chad territory was followed by yet another attack– a raid on four villages in Borno State, Nigeria. At least seven are believed to have died in these raids. An anonymous member of an anti-Boko Haram vigilante group explained that Borno has been attacked so many times that villagers in neighboring areas could see the raids beginning nearby and fled, keeping the death toll low.\nThe total number of people kidnapped and held hostage by Boko Haram remains a mystery, as news of kidnappings and liberations by the Nigerian army change the total on a daily basis. Just days before the Cameroon raid, Nigerian military officials announced that they had rescued 178 people kidnapped in Borno state. As typically happens with these rescues, it will take weeks for the Nigerian military to positively identify the people and help them return home, or keep them under custody if they have been indoctrinated by Boko Haram and pose a threat to their own communities. A high number of those rescued are now-pregnant women and children.\nCameroon has become a target for Boko Haram following their commitment earlier this year to join the regional military coalition dedicated to eradicating the terrorist group. As a result, Cameroon has banned the Muslim full face veil in its northern territories, as it has been used to disguise explosives used in suicide bombings. Nigerian President Muhammadu Buhari traveled to Cameroon to meet with President Paul Biya last week, hoping to foment stronger ties and improve cooperation between the Nigerian and Cameroonian armies. “We recognise that none of us can succeed alone. In order to win this war we need the collective efforts of each one of us, standing together as a formidable force for good, to defeat and end these acts of terror against our people,” Buhari told Biya.\nCameroon has also been sending Nigerian refugees back to their homes, with Nigeria slowly working to repatriate and process them. It is believed that 12,000 Nigerians from northeastern Borno were forced to flee to Cameroon, now seeking to return home.\nThe attacks seem to contradict reports claiming Boko Haram is seeking dialogue with the Nigerian government in an attempt to put down their weapons. Reports began circulating in July that hundreds of Boko Haram members were tired of fighting and looking to put down their weapons, but refused to without some talks that would ensure their immunity from prosecution. As recently as this morning, the Nigerian publication Vanguard reports that alleged representatives of Boko Haram “have made several calls to the CCC claiming that hundreds of their members who were tired and now have contrary opinions to the destructive and murderous activities of the terrorist organization are willing to lay down their arms.”\nNigerian officials have confirmed that “some members of the group” have contacted them, but there is no course of action planned until officials can confirm who these people are and what they want.","url":"https://www.breitbart.com/national-security/2015/08/06/boko-haram-abduct-135-in-new-raid-in-cameroon/"}
