{"authors":["Frances Martel"],"date_download":"2018-10-30 17:53:21","date_modify":"2018-10-30 17:53:21","date_publish":"2015-11-03 20:00:19","description":"Boko Haram members have sent media outlets photos they claim prove the group is running a rocket factory deep in northeast Nigeria.","filename":"data/vaneerConsumption/BokoHaramReleasesPhotosofFakeRocketFactory.json","image_url":"https://media.breitbart.com/media/2015/11/IS-in-Africa.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_11_03__1540922001.html","title":"Boko Haram Releases Photos of 'Fake' Rocket Factory","title_page":"Boko Haram Releases Photos of 'Fake' Rocket Factory","title_rss":"NULL","source_domain":"breitbart.com","text":"Members of the ISIS-affiliated Nigerian terrorist group Boko Haram have sent media outlets photos they claim prove the group is running a rocket factory deep in northeast Nigeria. The Nigerian military has dismissed the images as fabricated.\nBBC Hausa, a Nigerian affiliate in the Hausa language, reported this week that their journalists received images from an unknown telephone number located in neighboring Cameroon, allegedly from members of Boko Haram. The images later surfaced on Islamic State propaganda outlets. The images show jihadis making rockets in what appears to be a college in Borno state, and the rockets bear the inscription “Government Technical College Bama (GTCB).” Bama is a city in Borno. The BBC suggests the images are designed to “indicate that members of the group have the technical know-how to manufacture weapons.”\nNigeria’s Boko Haram releases photos apparently showing rocket-making factory https://t.co/1Uov8mgkCc pic.twitter.com/S4YDqcxtwh — BBC News (World) (@BBCWorld) November 2, 2015\nNigerian news outlets report that the military has claimed the photos are fake, and there is no evidence that Boko Haram members have the capacity to build weapons of such caliber. The group made no indication of when the photographs were taken, though i24 News notes that members of Boko Haram have used rocket-propelled grenades in the past and have been recorded to possess them.\n“Boko Haram is looking for any means to remain relevant,” a source within the Nigerian military told newspaper Vanguard. “The truth is that Boko Haram have been seriously dealt with and decimated. They are running helter skelter. They are now powerless. Our troops are really empowered with enough arms and ammunition.”\nNigerian officials are growing tense regarding the campaign against Boko Haram, as President Muhammadu Buhari made a hard promise to voters that he would eradicate the terrorist group from the nation by December. Any evidence that the group’s potential for destruction is growing could render Buhari’s deadline meaningless. Shortly after reports first surfaced of the rocket factory, a former Defense Minister, General Theophilus Yakubu Danjuma, warned media that he believed Boko Haram’s capacity to spy on the Nigerian military was greater than the military’s tracking abilities the other way around. “Boko Haram’s ability to gather intelligence has become 100 percent better than that of the Nigerian military,” he allegedly told an audience at a Catholic event, adding that Boko Haram had changed tactics and developed sleeper cells in civilian communities to hide from attacks.\nIndeed, Boko Haram has increasingly begun to attack towns using young girls as suicide bombers, taking advantage of the inherent lack of suspicion police lend to children. In October, Boko Haram killed dozens in northeastern Nigeria by targeting mosques during prayer hours, sending girls to their deaths.\nChildren also feature prominently in the recently released list of Nigeria’s most wanted Boko Haram members. A senior military official speaking to Nigeria’s The Scoop explained that the boys whose faces were released on the list of wanted terrorists were all children who were sighted wielding deadly weapons and are considered armed and dangerous. Some have been seen carrying the limbs of victims they had killed, he added. “The military is going after them to arrest the minors, not to kill them. The motive is to prevent them from carrying out further acts against humanity,” another source said.","url":"https://www.breitbart.com/national-security/2015/11/03/boko-haram-releases-photos-of-rocket-factory-nigerian-military-claims-are-fake/"}
