{"authors":["Nick Enoch For Mailonline"],"date_download":"2018-10-23 02:45:07","date_modify":"2018-10-23 02:45:07","date_publish":"2017-04-26 13:56:24","description":"If you’ve ever considered bungee-jumping, this shocking video of a young woman in Florida province, Bolivia, might just make you think twice…","filename":"data/vaneerConsumption/Boliviabungeejumphitsriverbedafterleapingoffbridge.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/14/3F9FF07D00000578-0-image-a-15_1493214489989.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447232_Bungee-jump-hits-riverbed-leaping-50ft-bridge_1540262707.html","title":"Bolivia bungee-jump hits riverbed after leaping off bridge","title_page":"Bolivia bungee-jump hits riverbed after leaping off bridge | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"As an extreme sport, it should have proper safety checks - but something clearly went very wrong here.\nThis is the shocking moment a young woman bungee-jumped off a 50ft (15m) bridge in Bolivia and ended up crashing into a shallow river.\nThe horrific incident, caught on camera, shows her preparing to leap off La Negra bridge in the province of Florida, while a man positions her for one final check.\nIn front of several spectators, she jumps and, as the rope is too long, a loud splash can be heard as she hits the ankle-deep water hard.\nA young woman's bungee-jump off a 50ft (15m) bridge in Bolivia ended in disaster. Despite safety checks, the rope brake failed\nTwo people then rush to help the shocked woman, who is barely moving.\nShyrleny Cuchallo Ribera, who was in the area with her family, witnessed the terrible accident.\nShe said: 'It is not very common to see this kind of sport here. We saw the lady jumping and for unknown reasons she ended up crashing against the riverbed, as it was not deep enough.'\nThe horrific incident, caught on camera, shows her leaping from La Negra bridge in the province of Florida\nMs Ribera told local media that she and her family went to the nearest town to call an ambulance as the woman was not able to move on her own, and could only open and close her eyes.\n'It was so sad to see a young woman in such pain. They should have taken more care with this kind of risky activity', she added.\nLa Negra bridge lies on the road between Santa Cruz and Cocabamba, in the municipality of Samaipata.\nThe rope, which was too long, caused the woman to crash into the shallow riverbed, leaving her barely able to move\nAndean Trek, the company that organised the bungee jumping experience, transferred the woman to a private clinic.\nShe had a few minor injuries and was discharged a few days later.\nOscar Sandoval, the director of the company, said: 'The lady jumped from a 15m bridge. The company is paying the medical bills. She does not have fractures, according to the initial diagnosis, but we are awaiting further tests.'\nHe added: '[The accident] was a human mistake. Somebody did something wrong. We are checking the videos in order to know who or what released the brake of the rope.'\n'It is the first time something like this has happened to us; we have a lot of years of experience', he said.","url":"https://www.dailymail.co.uk/news/article-4447232/Bungee-jump-hits-riverbed-leaping-50ft-bridge.html"}
