{"authors":[],"date_download":"2018-10-22 21:56:33","date_modify":"2018-10-22 21:56:33","date_publish":"2016-01-29 08:35:25","description":"A hit Bollywood movie about the evacuation of more than 170,000 Indians from Kuwait in 1990 has angered the government with its portrayal of the country's di...","filename":"data/vaneerConsumption/BollywoodblockbusterAirliftirksIndiangovernment.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h7sn-3bmscybNe842cce83474b52ad0ce-2_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422367_Bollywood-blockbuster-Airlift-irks-Indian-government_1540245393.html","title":"Bollywood blockbuster 'Airlift' irks Indian government","title_page":"Bollywood blockbuster 'Airlift' irks Indian government | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bollywood blockbuster 'Airlift' irks Indian government\nA hit Bollywood movie about the evacuation of more than 170,000 Indians from Kuwait in 1990 has angered the government with its portrayal of the country's diplomats as selfish and unfeeling.\nThe foreign ministry took the unusual step of issuing a statement on \"Airlift\", a fictionalised account of the real-life rescue mission that was released last week to rave reviews.\nIt shows Indian diplomats leaving Kuwait soon after the Iraqi invasion that sparked the first Gulf war, and portrays the foreign ministry in New Delhi as apathetic to the desperate pleas of Indian migrant workers stuck there.\nIndian Bollywood actors Akshay Kumar (L) and Nimrat Kaur address a press conference to promote their upcoming movie 'Airlift', in New Delhi, on January 18, 2015 ©Sajjad Hussain (AFP/File)\n\"@AirliftFilm: Great entertainment but rather short on facts,\" foreign ministry spokesman Vikas Swarup tweeted late Thursday.\n\"Films often take liberties with actual events, with facts,\" said Swarup -- whose own novel was made into the hit movie \"Slumdog Millionaire\" -- in a recorded video statement.\n\"And this particular film has... taken a lot of artistic liberties in the depiction of events as they actually happened in Kuwait in 1990.\"\nThe 1990 mission, which lasted almost two months and required around 500 flights, remains India's biggest air evacuation ever and a source of pride to its diplomatic corps.\nThe foreign ministry decided to issue a statement after receiving requests to speak with a \"non-existent\" diplomat who was portrayed in the film, a senior official told AFP on condition of anonymity.\n\"Given Bollywood’s hold over the popular imagination, we thought it would be best to recount the facts -- that it was a stellar team effort of diplomats, bureaucrats, Air India pilots and active citizens in the region that ensured the biggest evacuation in history,\" the official said.\nSwarup added: \"We hope that the film will inspire the people to read about the actual events that took place.\"\nThe foreign ministry statement also reminded citizens of its recent evacuations of thousands of Indians from war-hit parts of Yemen, Syria and Iraq.\nHowever, around 40 Indian construction workers who were working in Mosul have been missing since June 2014, when the Islamic State group captured the Iraqi city.","url":"https://www.dailymail.co.uk/wires/afp/article-3422367/Bollywood-blockbuster-Airlift-irks-Indian-government.html"}
