{"authors":["Ekin Karasin For Mailonline"],"date_download":"2018-10-23 00:32:49","date_modify":"2018-10-23 00:32:49","date_publish":"2017-04-26 10:10:32","description":"Jane Roscoe, 48, of Bolton, stormed into a classroom and screamed at the boy to pick up a book which had fallen on the floor. When he refused, she grabbed his arm and twisted it upwards.","filename":"data/vaneerConsumption/Boltonheadteacherwhotwistedaboysarmavoidsjail.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9ED7F900000578-0-image-a-29_1493200400264.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446914_Bolton-headteacher-twisted-boy-s-arm-avoids-jail_1540254769.html","title":"Bolton headteacher who twisted a boy's arm avoids jail","title_page":"Bolton headteacher who twisted a boy's arm avoids jail | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jane Roscoe, 48, has avoided jail after forcing an 11-year-old pupil to pick up a textbook by twisting his arm\nAn assistant headteacher who forced an 11-year-old pupil to pick up a textbook by twisting his arm has avoided jail.\nJane Roscoe, 48, stormed into a new teacher's classroom and screamed at the boy to pick up a book which had fallen on the floor.\nWhen the student refused, Roscoe grabbed his wrist and twisted his arm upwards at Lever Park Special School in Bolton.\nRoscoe, who had worked up the ranks from a teaching assistant during an 18-year career, will never teach again, Bolton Crown Court heard.\nThe book handed to the boy fell on the floor and when he refused to pick it up, Roscoe forced the boy forward with the technique - not letting go until he obeyed her.\nThe incident occurred after the child had misbehaved and was told to do English work.\nRoscoe - whose husband is the headteacher - was suspended from the school after laying her hands on the pupil.\nThe boy's mother said she was glad Roscoe would never teach again following the hearing - but hoped that she would have gone to prison.\nProsecutor Charlotte Crangle told the court: 'On October 20, 2014, an 11-year-old boy was in the literacy class at the end of the day when he was handed a book.\n'The boy protested the book was not his and the defendant came into the classroom and immediately began to scream at him to pick the book up.'\nSam Wilson, a new teacher at the behavioural school, was in the classroom at the time and was so appalled by what he had witnessed that he reported Roscoe\nRoscoe's husband Colin Roscoe, who was also the school's headteacher, told her about the accusations and she was suspended and subsequently resigned.\nMr Roscoe also resigned from his figurehead role and is now retired.\nThe court heard that restraint techniques were taught to staff at the behavioural school - but added that twisting a child's arm was not an approved method.\nShe stormed into a new teacher's classroom and screamed at the boy to pick up a book which had fallen on the floor. When the student refused, Roscoe grabbed his wrist and twisted his arm upwards at Lever Park Special School in Bolton (pictured)\nRoscoe's husband Colin Roscoe, who was the school's headteacher, told her about the accusations and she was suspended. Mr Roscoe has since resigned from the school\nMiss Crangle told the court: 'They should only be used to keep everyone safe and not as a behaviour management technique.'\nRoscoe initially claimed that the allegations had been made maliciously by other teachers who were engaged in a campaign against her.\nWhen questioned by police, she admitted touching the child - but denied twisting his arm.\nHowever, Roscoe, of Bolton, pleaded guilty to cruelty to one of the pupils before trial and the court ordered the charge of cruelty to a second pupil to lie on file.\nPhilip Clemo, defending, said the defendant was now working a job providing plants to restaurants after handing back over her teaching certificate.\n'It was a standing she has lost in a way which is extremely shameful and embarrassing.\n'She has lost her career, she has lost her good standing. She had lost an awful lot already - the effects of this conviction have already punished her considerably.'\nRoscoe, who looked down at the floor during the hearing, was sentenced to 16 weeks in prison, suspended for two years and must undertake 80 hours unpaid work.\nJudge Richard Gioserano stressed that children with challenging behaviour are vulnerable and require extra levels of patience and care.\nHe told Roscoe: 'It was never likely to ever demonstrate to him what a proper standard of behaviour was.\nRoscoe, who had worked up the ranks from a teaching assistant during an 18-year career, will never teach again, Bolton Crown Court heard\n'You showed him [the pupil] no care, understanding and patience at all in the way you treated him.\n'Had the court been sentencing you for repeated acts of ill-treatment against pupils at this school the sentence of imprisonment would have been considerably longer -and there would have been no prospect of suspending it.'\nThe boy's mother was in court and speaking after the hearing said she was disappointed with the sentence - but pleased Roscoe will not be teaching again.\nAdding: 'I am glad she will not be able to do it to anyone else,'\nA spokesperson for Lever Park School said: 'The allegation occurred during the time that Lever Park School was part of the Lever Park Learning Trust.\n'The school has subsequently become an academy within the Bolton Impact Trust.\n'The individual was suspended at the time of the allegation coming to light and has not been in the employment of Lever Park Learning Trust since August, 2015.\n'An Interim Executive Board was appointed to oversee the running of the school and priority was given to safeguarding resulting in rigorous systems being implemented.\n'We would like to reassure parents that we take safeguarding matters seriously and any concerns are dealt with appropriately.'","url":"https://www.dailymail.co.uk/news/article-4446914/Bolton-headteacher-twisted-boy-s-arm-avoids-jail.html"}
