{"authors":["Press Association"],"date_download":"2018-10-22 20:27:19","date_modify":"2018-10-22 20:27:19","date_publish":"2016-01-29 01:37:39","description":"The Bolton Wanderers Supporters' Trust has approached Eddie Davies in an effort to buy the struggling Championship club. Bolton are bottom of the Championship table, five points adrift of safety.","filename":"data/vaneerConsumption/BoltonWanderersSupportersTrustwritetoEddieDaviesinbidtobuystrugglers.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/30AE560100000578-0-image-a-91_1454031399852.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422069_Bolton-Wanderers-Supporters-Trust-write-Eddie-Davies-bid-buy-strugglers_1540240039.html","title":"Bolton Wanderers Supporters' Trust write to Eddie Davies in bid to buy strugglers","title_page":"Bolton Wanderers Supporters' Trust write to Eddie Davies in bid to buy strugglers | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Bolton Wanderers Supporters' Trust has approached Eddie Davies in an effort to buy the struggling Sky Bet Championship club.\nDavies, Bolton's owner, has been mulling over a bid from Sports Shield consortium, led by former Trotters forward Dean Holdsworth, but no deal has yet been struck.\nThe BWST has now made its move, promising to 'raise sufficient funding to secure the future of the club for the benefit of the supporters'.\nThe Bolton Wanderers Supporters' Trust has approached Eddie Davies (left) in an effort to buy the club\nBWST has promised to 'raise sufficient funding to secure future of the club for the benefit of the supporters'\nWanderers' accounts were frozen when HM Revenue and Customs served them with a winding-up petition over £2.2million of unpaid tax, and their trip to the High Court last week resulted in a five-week adjournment over that matter.\nBolton, who revealed their staff were not paid on time in January, are currently bottom of the Championship table, five points adrift of safety.\n'We have written to the owner, Eddie Davies,' read a statement on bwfcst.co.uk.\nDavies has been mulling over a bid from Sports Shield consortium, led by former forward Dean Holdsworth\nBolton are currently bottom of the Championship table - five points adrift of safety after 28 fixtures\n'We have expressed our commitment to help lead an acquisition, in conjunction with local institutions and businesses, from whom we have received a very positive response.\n'Our objective is to raise sufficient funding to secure the future of the club for the benefit of the supporters, the community and the town.","url":"https://www.dailymail.co.uk/sport/football/article-3422069/Bolton-Wanderers-Supporters-Trust-write-Eddie-Davies-bid-buy-strugglers.html"}
