{"authors":[],"date_download":"2018-10-22 22:46:00","date_modify":"2018-10-22 22:46:00","date_publish":"2014-05-12 00:00:00","description":"The nuclear deal between Iran and six nations, including the United States, was a small step but historic nonetheless.","filename":"data/vaneerConsumption/BombsAwayInsidetheDetailsofIransNukeDeal.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/427596/140507-iran-nuke-tnc-1802_e9de3d34503c4ad65def1578164b93e7.nbcnews-fp-1200-630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/feature_twitter-diplomacy_bombs-away-inside-details-irans-nuke-deal-n99626_1540248360.html","title":"Bombs Away: Inside the Details of Iran's Nuke Deal","title_page":"Bombs Away: Inside the Details of Iran's Nuke Deal - NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"The deal agreed to in November between Iran and six nations — the United States, Russia, China, Britain, France and Germany — was a relatively small step toward ensuring that Iran won't build a nuclear bomb. But it was historic nonetheless.\nThe initial deal had Iran accept restrictions on its nuclear program and increased monitoring of it in return for some sanctions relief. The P5+1 group has been meeting again recently to hammer out longer-term specifics with hopes of security a long-lasting, final agreement: Iran accepts long-term caps on its enrichment program and other atomic activities in exchange for full sanctions relief and avoidance of future punishment. The two sides hope to reach full agreement by July but can extend negotiations if both wish to.\nPlay Facebook\nTwitter\nEmbed Chapter 6: The Art of the Deal 9:10 autoplay autoplay Copy this code to your website or blog\nThe very idea of allowing Iran to have a nuclear program is indicative of the the Obama administration’s reversal of the “Bush doctrine,” which held that Tehran was an “evil” regime must be prevented from doing any nuclear research, noted Hillary Mann Leverett, author of “Going to Tehran: Why the United States Must Come to Terms with the Islamic Republic of Iran,” and professor at American University’s School of International Service.\n“The key point is not the numbers of centrifuges or levels of enrichment,” Leverett told NBC News. \"The key point is a post-9/11 American recognition that a former member of President (George W.) Bush’s ‘Axis of Evil” can be treated like a normal state with rights and interests that need to be accommodated.”\nPlay Facebook\nTwitter\nEmbed A Breach of Trust 2:49 autoplay autoplay Copy this code to your website or blog\nHere are the major points agreed to in Geneva:\nLIMITING IRAN\n• From the existing uranium enriched to 20 percent, Iran can retain half as working stock to make fuel for the Tehran Research Reactor. The other half would be diluted to 5 percent enrichment.\n• Iran would not enrich uranium over 5 percent for 6 months.\n• Iran would not make any further advances of activities at its Natanz Fuel Enrichment Plant Fordow, or the Arak reactor.\n• No new locations for enrichment.\nMONITORING AND TRANSPARENCY\n• Iran will provide detailed information to the IAEA, including plans for nuclear facilities, a description of each building on each nuclear site, a description of the scale of operations for each location engaged in specified nuclear activities, information on uranium mines and mills, and information on source material.\n• This information would be provided within three months of the adoption of these measures.\n• Daily IAEA inspector access at major reactors, and managed access centrifuge assembly workshops and uranium mines and mills.\nSANCTION RELIEF\n• U.S. and EU sanctions would be suspended on Iran’s petrochemical exports, gold and precious metals and associated services.\n• U.S. sanctions would be suspended on Iran’s auto industry and associated services.\n• No new nuclear-related UN Security Council or EU sanctions.\n• The U.S., “acting consistent with the respective roles of the President and the Congress,” will refrain from imposing new nuclear-related sanctions.\n• The parties involved would establish a “financial channel to facilitate humanitarian trade for Iran's domestic needs using Iranian oil revenues held abroad.”\nBut all sides will be meeting over the next few months to hammer out the details, so many points may change – if any deal is agreed to at all.\n“The best case is that a nuclear deal becomes the catalyst for a 'Nixon to China'-like opening between the United States and Iran,” said Leverett. “The worst case is that President Obama listens to the same cadre of Middle East 'experts' that has misled the American people into disastrous military interventions—from Iraq to Libya.”","url":"https://www.nbcnews.com/feature/twitter-diplomacy/bombs-away-inside-details-irans-nuke-deal-n99626"}
