{"authors":["Camila Domonoske"],"date_download":"2018-10-22 21:40:10","date_modify":"2018-10-22 21:40:10","date_publish":"2018-08-15 00:00:00","description":"A suicide bomber reportedly struck a classroom in a Shiite neighborhood where teenagers, male and female, were studying for college entrance exams. Authorities say the death toll is at least 48.","filename":"data/vaneerConsumption/BombingInKabulTargetsEducationalCenterKillsDozensOfYoungPeople.json","image_url":"https://media.npr.org/assets/img/2018/08/15/ap_18227527532964_wide-393e7dfdffdcd41a9caca2968d2c71bbd12e515d.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_08_15_638953303_bombing-in-kabul-targets-educational-center-kills-dozens-of-young-people_1540244410.html","title":"Bombing In Kabul Targets Educational Center, Kills Dozens Of Young People","title_page":"Bombing In Kabul Targets Educational Center, Kills Dozens Of Young People  : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Bombing In Kabul Targets Educational Center, Kills Dozens Of Young People\nEnlarge this image toggle caption Rahmat Gul/AP Rahmat Gul/AP\nUpdated at 6:20 a.m. ET on Thursday\nA suicide bombing in Kabul on Wednesday killed dozens of teenagers studying for university entrance exams at an educational center in a Shiite neighborhood, according to wire reports.\nThe Islamic State on Thursday claimed responsibility. The bombing resembles previous attacks that have also been claimed by ISIS.\nThe blast comes less than a day after a Taliban attack in northern Afghanistan killed more than 30 police officers and soldiers, and less than a week after the Taliban launched a surprise attack on the city of Ghazni.\nThe explosion on Wednesday, \"targeting an educational center in the west of the Afghan capital, tore through a large tent set up as a classroom in the courtyard,\" Reuters reports.\nInitially, Reuters said that the blast killed at least 48 and wounded at least 67, but later reports said 34 students were killed and 56 hurt. The attack came after weeks of \"relative calm\" in Afghanistan's capital, according to the news agency. The Taliban denied responsibility, Reuters says.\nBoth male and female students were studying at the center, preparing for entrance exams. One witness told Reuters that the scene at the educational center was \"horrific.\" Another, a man whose 18-year-old daughter survived the attack, told the AP he saw blood and body parts covering benches and desks.\n\"The savage terrorists are targeting cultural and educational institutions, showing that they are against the teachings of Islam and the Prophet encouraging all Muslims, men and women, to seek knowledge and learning,\" Afghan President Ashraf Ghani said in a statement.\nThe attack targeted the Shiite neighborhood of Dasht-i-Barcha, the AP says:\n\"The bombing, blamed on the Islamic State group, was the latest assault on Afghanistan's Shiite community, which has increasingly been targeted by Sunni extremists who consider Shiites to be heretics. \"It also showed how militants are still able to stage large-scale attacks, even in the heart of Kabul, and underscored the struggles of the Afghan forces to provide security and stability on their own.\"\nThe attack comes after a bloody week in Afghanistan.\nEarly on Wednesday, the Taliban attacked a checkpoint in Baghlan, in northern Afghanistan, killing at least 30 police officers and soldiers, the AP says.\nReuters reports the death toll could be as high as 44:\n\"The defence ministry confirmed the incident early on Wednesday, but gave no details. Officials in the area said nine police and 35 soldiers were killed in the latest attack of a series that has killed dozens of security forces nationwide. \"A Taliban spokesman, Zabiullah Mujahid, said the group targeted a military base and two checkposts in Baghlan, killing 70 Afghan security forces, and seizing armoured vehicles and ammunition.\nAlso on Wednesday, the Taliban attacked a police checkpoint in southern Zabul province, killing several police officers, a police chief told the AP. And six young girls were killed after playing with an unexploded rocket shell, an official in the eastern province of Laghman told the wire service.\nOn Tuesday, the AP says, the Taliban killed 17 soldiers in northern Faryab province after besieging an army base for several days.\nThese bloody attacks come come less than a week after the Taliban launched a surprise attack in the city of Ghazni, not far from Kabul. That assault began last Friday.\n\"It took Afghan forces – assisted by U.S. advisors – five days to repel the insurgents,\" NPR's Diaa Hadid reports. \"The fighting killed more than 120 security forces and civilians and more than 200 insurgents.\n\"The Taliban's increasingly brazen attacks in recent weeks may be a way of strengthening their position ahead of widely-expected talks with the United States,\" Hadid says.\nNPR's Ayda Pourasad contributed to this report.","url":"https://www.npr.org/2018/08/15/638953303/bombing-in-kabul-targets-educational-center-kills-dozens-of-young-people"}
