{"authors":[],"date_download":"2018-10-30 21:14:11","date_modify":"2018-10-30 21:14:11","date_publish":"2015-08-17 15:04:07","description":"Once in a while an even more explosive remark is made: one that requires the evacuation of venues I'm speaking at, or bars I'm drinking in.","filename":"data/vaneerConsumption/BombThreatsAretheGreatestComplimentofAll.json","image_url":"https://media.breitbart.com/media/2015/08/hurt-locker-bomb.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_17__1540934051.html","title":"Bomb Threats Are the Greatest Compliment of All","title_page":"Bomb Threats Are the Greatest Compliment of All | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The words “Milo” and “bomb” are often seen together on internet forums and in comment sections. For instance, “Milo! You da bomb.” But once in a while an even more explosive remark is made: one that requires the evacuation of venues I’m speaking at, or bars I’m drinking in.\nWhen it happens, as it did again this weekend at the SPJ Airplay conference in Miami, I’m always secretly amused. You see, only amateurs care about making a grand entrance. Connoisseurs of attention-seeking pay closer regard to exits, and there’s no more dramatic way to swoosh off a conference stage than in the arms of a burly, dark-skinned security guard barking “EVACUATE!” to the audience as he — or she, in the case of a hefty lesbian bouncer — carries you off to safety.\nIt’s not easy to get a lecture hall evacuated. In the past, I’ve had to pay minions to smoke furiously in the public loos to set off the fire alarms. But my increasing fame means that anonymous members of the progressive left are happy to oblige free of charge. The Asian jeopardy set in particular is happy to stoke the flames of drama.\nNow, I should say that I’m only being flippant because there’s such a pathetically low chance that any of these social justice-inspired wastes of police time would ever actually produce any danger. Like any normal person I’m hugely annoyed by them, but let’s not kid ourselves that any of these threats have merit.\nThe likelihood of there actually being a pound of plastic under the table is about the same as Miss Universe not having the same in her bra, or GamerGate critic Arthur Chu ever uttering the phrase: “You know what, I think I’m fine with just the one slice.”\nBut bomb threats have become commonplace to those of us who are critics of the intersectional third-wave feminist hierarchy. Despite being branded violent misogynistic manbaby shitlords, it’s only ever us who get our events disrupted by furious harpies panicking that someone might tell the empress she’s wearing no clothes. And then ask her to please, for the love of God, put some on.\nOf course, it’s no surprise that social justice warriors use bombs as their threat of choice. Feminists and explosives have a lot in common: it’s always best to evacuate the building if one is detected, and by the time you hear one go off it’s probably too late to save yourself.\nHonestly, though, bomb threats are a blast because they show how utterly the other side has lost the argument. All that’s left for them is violence. Those of us on the side of common sense skip the impossibly gauche step of leveraging threats for sympathy and to demand money from useful idiots, but in the game of social status it’s all fair game, darling.\nAnd since the threats presumably come from women there’s an additional layer of protection, because for every ten threats received, you only need to treat one or two of them with any serious attention at all. I know that’s incendiary, but feminists do have a habit of exaggeration, don’t they? I mean, come on, am I wrong?\nFeminists literally phone their threats in, just like their lazy Jezebel blog posts about killing all white men, or whichever brand of psychotic exhibitionism is currently in vogue. Though not the most tech-savvy community on the internet, social justice warriors are at least practised in making urgent phone calls — for instance, to the local dog pound, clap clinic, or Domino’s Pizza.\n(They would deny this and tell you they only eat at their local vegan Thai takeout, but they’re omitting to mention their cheat days: Monday, Tuesday, Wednesday, Thursday, Friday, Saturday, and Sunday.)\nI know I should stop being so incendiary, but let’s be honest: who’s afraid of a feminist bomb threat? They can’t even come up with a decent piece of art or any good writers. At least homicidal Muslims have the Alhambra and Rumi; feminists have to make do with tinned spaghetti and urine as their contribution to world culture.\nIf there was a single STEM class on any gender studies course, feminists would be able to do the math and realise that every time they send a bomb threat, their enemies get ten times the free press they would otherwise have garnered.\nOf course, some ridiculous people have questioned how we can be sure that the threats came from feminist critics of GamerGate. To these folks I say: why would GamerGate send bomb threats to itself when we were dropping so many on stage? Besides, it’s inconceivable that any of the sweet-natured and decent people I’ve met in GamerGate could be responsible for calling in a threat to their own side. Not least because, unlike the opposition, no one in GamerGate is that stupid: they know what an own goal it would be.\nBut you can expect to read a dozen daft allegations online about how it was really all a false flag operation. The problem for the social justice brigade is: if this was done by GamerGate and there’s no way to prove it, how do we know professional provocateur Anita Sarkeesian didn’t make up the threats sent to her?\nOrwell wrote in 1984: “If you want a vision of the future, imagine a boot stamping on a human face – forever.” What he couldn’t have anticipated in 1949 is that the boot would be a second-hand Doc Marten on the hairy lower limbs of a misandrist lesbian Gawker blogger with half a dozen vaginal piercings and bright blue hair, spitting tacks because no one wants to read her 2,500 word essay on why video games should have fewer sexy blondes in them.\nJust don’t make the mistake I did this weekend and confuse a militant third-waver with a bomb-sniffing police pooch. Très embarrassing!\nFollow Milo Yiannopoulos (@Nero) on Twitter and Facebook. He’s a hoot! Android users can download Milo Alert! to be notified about new articles when they are published.","url":"https://www.breitbart.com/politics/2015/08/17/bomb-threats-are-the-greatest-compliment-of-all/"}
