{"authors":[],"date_download":"2018-10-22 22:03:16","date_modify":"2018-10-22 22:03:16","date_publish":"2014-06-07 20:58:39","description":"All of the attacks happened in a one-hour period and largely targeted commercial streets in Shiite neighborhoods, authorities said.","filename":"data/vaneerConsumption/BombsLeave52DeadAsIraqiMilitantsTakeStudentsHostageAmidViolence.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/494611/140607-anbar-university-1653_b53ff0bfdd21779f37d80d4a23bcccf0.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_bombs-leave-52-dead-iraqi-militants-take-students-hostage-amid-n125416_1540245796.html","title":"Bombs Leave 52 Dead As Iraqi Militants Take Students Hostage Amid Violence","title_page":"Bombs Leave 52 Dead As Iraqi Militants Take Students Hostage Amid Violence","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBAGHDAD — A series of car bombs exploded across Iraq's capital Saturday night, killing at least 52 people in a day of violence that saw militants storm a university in the country's restive Anbar province and take dozens hostage, authorities said.\nThe attacks in Baghdad largely focused on Shiite neighborhoods, underscoring the sectarian violence now striking at Iraq years after a similar wave nearly tore the country apart following the U.S.-led invasion that toppled Saddam Hussein. Now with U.S. troops gone, Iraq founds itself fighting on fronts across the country.\nThe first Baghdad attack took place Saturday night in the capital's western Baiyaa district, killing nine people and wounding 22, police said. Later on, seven car bombs in different parts of Baghdad killed at least 41 people and wounded 62, police said. A roadside bomb in western Baghdad also killed two people and wounded six, police said. All the attacks happened in a one-hour period and largely targeted commercial streets in Shiite neighborhoods, authorities said.","url":"https://www.nbcnews.com/news/world/bombs-leave-52-dead-iraqi-militants-take-students-hostage-amid-n125416"}
