{"authors":["Wally Hall"],"date_download":"2018-10-30 17:54:41","date_modify":"2018-10-30 17:54:41","date_publish":"2018-09-17 00:00:00","description":"Boos may have a target, but the target doesn't always know it was the target.","filename":"data/vaneerConsumption/Boobirdsfeathersruffledforalongtime.json","image_url":"https://media.arkansasonline.com/img/photos/2018/09/17/Boobirds_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_sep_18__1540922081.html","title":"Boobirds' feathers ruffled for a long time","title_page":"Boobirds' feathers ruffled for a long time","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Arkansas fans react after a North Texas score Saturday, Sept. 15, 2018, during the second quarter at Razorback Stadium in Fayetteville. Visit nwadg.com/photos to see more photographs from the game. - Photo by Andy Shupe\nBoos may have a target, but the target doesn't always know it was the target.\nFor instance, the boos heard Saturday during the University of Arkansas' loss to North Texas were not just aimed at Cole Kelley.\nNo doubt some of them were, and his teammate and wide receiver Jared Cornelius took exception to those boos. Maybe that will help the Arkansas Razorbacks find more cohesiveness. At this point, anything might help.\nLosing to the Mean Green isn't acceptable, and that was the main reason for some of the boos. Those were for the play-calling, coaching decisions or even aimed at a coach.\nMany fans who did not boo have written to say there is no place for booing at a college football game, especially at college players. Arkansas Athletic Director Hunter Yurachek said we live in a country that allows that, but he hopes fans will consider what they would do if that was their child or grandchild on the field.\nBooing certainly won't help recruiting.\nIt doesn't just happen at Razorback games, but at the UA it shows how frustrated the fan base has become.\nThis is the seventh season fans have been told to be patient. They have been told it is going to get better. They have been told better players are on the way.\nWhat those 44,000 fans saw Saturday was one of the worst performances in Razorback history. Right up there with the 10-3 loss to The Citadel that got Jack Crowe fired one game into the 1992 season.\nChad Morris is not getting fired.\nHe's trying to play hurry-up, no-huddle football with guys who were recruited to play smash-mouth, conventional football.\nArkansas fans went into this season thinking left lane, hammer down. What they got Saturday was a detour.\nMany believed they were going to see Ty Storey in the second half. That had been the pattern of the first two games: whichever quarterback wasn't moving the team sat down, and the other one got a shot. Storey didn't, and the fans got frustrated with interceptions and the lack of a running game -- again.\nYears of frustration boiled over as boos.\nMaybe it didn't sound good, but at least those fans were in the stands voicing that frustration. About 20,000 others bought tickets and didn't show.\nThe booing fans, as well as the ones who didn't boo, were not apathetic. If given the chance, they'll be at the next game and the one after that.\nThat's what real fans do: They show up and cheer until there's nothing left to cheer about. That's what happened Saturday when frustration roared through Reynolds Razorback Stadium.\nIt was just short of a miracle they didn't boo earlier, like when the Hogs got faked out of their shiny helmets on a punt that wasn't a fair catch -- the only people in the place who didn't think there had been a fair catch signal were wearing green or black and white stripes -- that went 90 yards for a touchdown.\nThat play was ESPN's No. 1 play of the weekend and was replayed Monday morning on Good Morning America. That's great publicity for the coaches at North Texas, but not so much for the Razorback coaches.\nThe worry now is how this will affect what looks like one of the better recruiting classes for the UA in the past decade.\nMorris and his staff have to let those kids know they are needed so badly they might play next year. On Saturday, six true freshmen saw action.\nBoos are not pleasant, but the ones Saturday were the culmination of years of frustration and were as much for the coaches as any one player.\nADVERTISEMENT\nMore headlines\nSports on 09/18/2018","url":"https://www.arkansasonline.com/news/2018/sep/18/boobirds-feathers-ruffled-for-a-long-ti/"}
