{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 20:39:12","date_modify":"2018-10-30 20:39:12","date_publish":"2016-12-28 00:00:00","description":"Boohoo says Nasty Gal is 'a bold and distinctive brand for fashion-forward, free-thinking young women.'","filename":"data/vaneerConsumption/Boohoocombids20millionforNastyGalbrand.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_boohoocom-bids-20-million-for-nasty-gal-brand-2016-12_1540931952.html","title":"Boohoo.com bids $20 million for Nasty Gal brand","title_page":"    Boohoo.com bids $20 million for Nasty Gal brand - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Sophia Amoruso, founder of fashion site NastyGal. REUTERS/Mario Anzuoni LONDON — British online fashion retailer Boohoo.com is bidding $20 million (£16.3 million) for the brand and customer list of bankrupt US clothing brand Nasty Gal.\nFounded in 2006 in Los Angeles, Nasty Gal began as an eBay shop for vintage clothing. It specialises in fashion for young women, marketing itself as an edgy brand indicative of LA's carefree attitude.\nNasty Gal's founder, Sophia Amoruso, has become a business icon in America, writing the New York Times best-selling book #Girlboss, which is being turned into a Netflix series. Amoruso has stepped back from the business in recent years.\nDespite strong early growth and popularity, venture capital-backed Nasty Gal has struggled in recent years. It had revenues of $77.1 million (£62.8 million) in the year to February 1, according to Boohoo, but made a loss of $21 million (£17.1 million) in the same financial year. It filed for bankruptcy protection in early November.\nIndustry blog the Business of Fashion suggested the company's demise was driven by over-ambitious investment in infrastructure such as warehouses and high fixed costs. Nasty Gal raised $65 million (£52.9 million) in total, with $49 million (£39.9 million) coming from well-known European VC house Index Ventures.\nBoohoo said in a statement to the market on Wednesday that Nasty Gal is \"a bold and distinctive brand for fashion-forward, free-thinking young women which the Board believes would complement boohoo's own inclusive and inspirational brand.\" Boohoo says it hopes the deal will accelerate its international expansion, particularly in the US.\nBoohoo.com was founded in Manchester in 2006, the same year as Nasty Gal, and offers own-brand \"fast fashion\" — cheap and trendy — to millennials online.\nThe deal is subject to US bankruptcy proceedings and requires court approval, which Boohoo.com said it will seek on January 5. Russ Mould, investment director at stockbroker AJ Bell, cautions in an email on Wednesday morning: \"Nasty Gal would add a well-established, global brand to the boohoo family but its bid may not result in a transaction if higher or more favourable offers are obtained by Nasty Gal during the auction process.\"\nBoohoo.com joint CEOs Mahmud Kamani and Carol Kane said in a statement: \"Should we be successful in acquiring Nasty Gal it would represent a fantastic opportunity to add such a well-established, global brand to the Boohoo family.\n\"Following our recent acquisition of PrettyLittleThing.com, we believe this would represent an ideal next step in inspiring an ever-growing range of young customers internationally.\"","url":"https://www.businessinsider.com/boohoocom-bids-20-million-for-nasty-gal-brand-2016-12"}
