{"authors":["Heller Mcalpin"],"date_download":"2018-10-21 03:27:53","date_modify":"2018-10-21 03:27:53","date_publish":"2018-08-23 20:07:20","description":"Susan Hand Shetterly explores seaweed’s uses and its threatened future.","filename":"data/vaneerConsumption/BookreviewofSeaweedChroniclesAWorldattheWatersEdgebySusanHandShetterly.json","image_url":"https://www.washingtonpost.com/resizer/Mr0LGEXLmmgpRd8vTWAhUBjNXio=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OZRP6QFEUMI6RLLPBADXBXG5YI.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_an-homage-to-seawee_0f7477c30ee60954dfa87abf8664f4f8_7a51a198-8909-11e8-a345-a1bf7847b375_story_1540092473.html","title":"Book review of Seaweed Chronicles: A World at the Water’s Edge by Susan Hand Shetterly","title_page":"Book review of Seaweed Chronicles: A World at the Water’s Edge by Susan Hand Shetterly - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Heller McAlpin reviews books for NPR, the Los Angeles Times, and The Washington Post.\nRockweed growing in Cape Elizabeth, Maine, provides food, shelter and habitat for a wide variety of creatures. It has many industrial uses as well, making it the most harvested seaweed in Maine. (AP Photo/Robert F. Bukaty)\nThere are books that change the way you see things. Nicholson Baker’s “The Mezzanine” brought a quirky new perspective to shoelaces. John McPhee’s “Annals of the Former World” forever altered my view of highways cut through cliffs of schist. Similarly, after reading Susan Hand Shetterly’s “Seaweed Chronicles,” chances are that you’ll look at sushi rolls and the brackish tangles of seaweed washed up on beaches in a new light.\nShetterly, who lives in rural Maine, is the author of the essay collection “Settled in the Wild.” “Seaweed Chronicles” is a fascinating portrait of this valuable, increasingly threatened resource and a passionate plea for its wise management. It’s a beautiful book, both educational and inspirational, though it would have been even better with illustrations and maps.\nShetterly is a wise, attentive observer, open to the wonders of nature. Although generally more lyrical than didactic, she helpfully frontloads the book with important facts about seaweeds: To wit, lacking roots, leaves and stems, they are not actually plants or weeds, but multi-celled macroalgae. These underwater “forests of unparalleled ecological value” anchor on rocks, shells and other rigid, stable surfaces, and supply the Earth’s atmosphere with “at least half its oxygen,” Shetterly writes.\nHer main focus is on the brown seaweeds, including Ascophyllum nodosum, which grows along rocky shores and provides habitats for many creatures, including vulnerable young fish and eider ducks. Also known as rockweed and knotted wrack, it is the most extensively harvested seaweed in Maine because of its many industrial uses, including in cosmetics and fertilizers.\nThe Japanese consume the most edible seaweed, mainly in the form of kelps like Alaria, Undaria pinnatifida (wakame), Laminaria japonica (kombu) and Sagassum fusiforme (hijiki). The red seaweed Porphyra, called laver in America, is raised in large aquaculture projects for nori. After the 2011 Fukushima nuclear disaster, concerns about contamination of Pacific seaweed led to increased seaweed farming in the North Atlantic, including Maine.\nDemand for all seaweeds, commercial and edible, is on the rise worldwide. Never mind sushi nori, “most of us cannot get through a day without meeting seaweeds in disguised and processed form in toothpaste, pudding, pie fillings, and other soft foods, in makeup, soaps, dog and cat foods, cattle feed, and farm fertilizers,” Shetterly writes.\nThe question is, what has the collapse of fisheries like Atlantic cod taught us? Shetterly reminds us that we have chowed our way down the food chain from whales all the way to “harvestable habitat” — seaweed. She asks urgently: “Now, faced with the loss of finfish as well as diminished populations of many other species, and with the ballooning effects of climate change and acidification, can we learn from what our oceans are still able to teach us? . . . Have we learned, for instance, how to take — but not take too much? And what’s too much?”\nIn pursuit of answers, Shetterly attends policy meetings and interviews an impressive array of phycologists (algae scientists), marine biologists, ecologists and purveyors of sea vegetables. She also accompanies seaweed harvesters and aquatic farmers to remote, rocky outposts, and makes it clear that their physically demanding, mainly solitary work is not for the weak or timid.\n“Seaweed Chronicles” is filled with delightful characters and adventures. One chapter describes a frigid February day when Shetterly visits Maine’s Flat Island, three miles offshore in the “wind whipped,” not-so-pleasant Pleasant Bay, where shepherd Donna Kausen tends her flock of saltwater sheep. Pastured year-round on the small, windswept island in a centuries-old manner brought over from Ireland and Scotland, the sheep require no fencing and get much of their nutrition and water from kelp; feeding at low tide, they consume up to 20 pounds daily.\nAnother captivating chapter, “Seaweed Stories,” includes instructions for an Irish farmer’s “lazy” potato bed, which uses storm-tossed kelps, knotted wracks and bladder wracks to line a sort of turf-and-potato sandwich. Even more enchanting is her mother’s recipe for blancmange custard thickened with carrageenan, an emulsifying phycocolloid (seaweed gel) extracted from clumps of “the cream-colored, sun-bleached blades” of Irish moss, which the author and her sister were sent to collect above the low-tide line. She notes that agar, another phycocolloid derived from red seaweeds, is widely used as a growth medium in petri dishes and to separate strands of DNA.\nMuch of the book focuses on efforts to protect seaweed — and the “living mosaic” ecosystem of which it’s an integral part — before it is too late. While scientists study the effects of harvesting to determine guidelines, a more primal issue is being fought in the courts between Maine locals and Acadian Seaplants, the Canadian “Goliath in the seaweed business”: Who owns the seaweed and the shoreline — landowners or the state? Shetterly believes that landowners are likely to be more protective of their resources and is heartened by the fact that, unlike fishermen of yore, “people who make their livelihoods out on the flats” recognize that nature’s supply is limited and are increasingly becoming “dedicated stewards.”\nShetterly begins and ends this book by extolling her often “bone cold” but magnificent chosen habitat, with its “mudflats that glisten like a harbor seal’s wet pelt, low-tide rocks covered in layer upon layer of seaweeds,” and migrating purple sandpipers and harlequin ducks. “Seaweed Chronicles” adds up to a persuasive and loving argument for “a new model of how to manage ocean resources that doesn’t edge them toward oblivion.”","url":"https://www.washingtonpost.com/outlook/an-homage-to-seaweed-and-a-plea-for-wise-management-of-this-valuable-resource/2018/08/23/7a51a198-8909-11e8-a345-a1bf7847b375_story.html"}
