{"authors":["Valerie Edwards For Dailymail.Com"],"date_download":"2018-10-23 03:26:22","date_modify":"2018-10-23 03:26:22","date_publish":"2016-01-29 18:20:39","description":"A psalm book once owned by a judge in the Salem witch trials could be sold for more than $40,000. The 300-year-old book once belonged to Jonathan Corwin, a judge during the trials.","filename":"data/vaneerConsumption/BookonceownedbyjudgeinSalemwitchtrialscouldsellfor40k.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:e40c8afc7c414bd98648ecb5b48001b7-3bmscybNe842cce83474b58b05f1-340_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422897_Book-connection-Salem-witch-trials-auctioned_1540265182.html","title":"Book once owned by judge in Salem witch trials could sell for $40k","title_page":"Book once owned by judge in Salem witch trials could sell for $40k | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A psalm book once owned by a judge in the Salem witch trials more than 300 years ago is being auctioned.\nThe previously unknown seventh edition of 'The Bay Psalm Book' that once belonged to Jonathan Corwin could sell for $40,000 when it is auctioned on Thursday by Swann Auction Galleries.\nCorwin was a judge during the 1692 trials, when 19 innocent people were hanged and another one was crushed to death. Corwin's home, now owned by the city of Salem, is known as the Witch House.\nScroll down for video\nThe inside cover of the seventh edition of The Bay Psalm Book that once belonged to Jonathan Corwin, a judge during the 1692 trials when 19 accused witches were hanged and another was crushed to death in Salem\nAuction director Rick Stattler told Salem News that the first edition dates to 1640, when it was printed in Cambridge, but the version up for auction was printed in 1693.\nThe book has a second connection to the witch trials, as it was also owned by the descendants of John Proctor, who was tried, convicted and hanged as a witch in 1692.\nStattler said: 'Knowing it came from one of the judges of the trial, they kept it as an heirloom and called it The Witch Book.'\nThe book, which was printed in 1693, could auction for as much as $40,000\nEarlier this year, a team of researchers used historical documents and 21st-century archaeological techniques to confirm the site where the 19 innocent people were hanged during the Salem witch trials.\nThe site, known as Proctor's Ledge, is a small city-owned plot of woods nestled between two residential streets and behind a Walgreens pharmacy, according to Salem State University history professor Emerson 'Tad' Baker, a member of the seven-person team.\nHistorian Sidney Perley had pinpointed Proctor's Ledge nearly a century ago as the site of the hangings by using historical documents, but his findings were lost to time and myth, misconceptions and conspiracy theories had taken their place, Baker said.\nThe top of nearby Gallows Hill had long been thought of as the site of the hangings, but there was no evidence to support that. Proctor's Ledge is at the base of Gallows Hill.\nSalem State University history professor Emerson Baker walks through an area that he and a team of researchers said is the exact site where 19 innocent people were hanged during the 1692 witch trials in Salem\nTo determine the spot, the team looked at eyewitness accounts of the hangings, then used modern-day aerial photography and ground penetrating radar that wasn't available a century ago.\nThe team made other interesting discoveries when they determined there probably never was a gallows at the site and more than likely, the executioners tossed a rope over a large tree.\nBaker stressed that there is no evidence that any of the victims were buried at Proctor's Ledge because it's too rocky and the soil is too shallow.\nTHE SALEM WITCH TRIALS In 1692, mass hysteria swept through Salem, Massachusetts. Superstitious townspeople, fearful of the devil, began accusing men and women of witchcraft and hounded scores of 'witches' to put on trial. The hysteria began after a group of young girls claimed to be possessed by the devil and accused several local women of witchcraft. As hysteria spread throughout Massachusetts, a court convened in Salem to hear the cases. The first convicted witch, Bridget Bishop, was hanged that June. Eighteen others followed and some 150 more men, women and children were accused over the next several months. Trials continued until early 1693, but by that May, the governor of Massachusetts had pardoned and released all those in prison.","url":"https://www.dailymail.co.uk/news/article-3422897/Book-connection-Salem-witch-trials-auctioned.html"}
