{"authors":["Meara Sharma"],"date_download":"2018-10-21 03:32:08","date_modify":"2018-10-21 03:32:08","date_publish":"2018-08-09 21:37:15","description":"Two books probe the water supply crisis and how officials failed local residents.","filename":"data/vaneerConsumption/BookreviewofWhattheEyesDontSeeAStoryofCrisisResistanceandHopeinanAmericanCitybyMonaHannaAttishaandThePoisonedCityFlintsWaterandtheAmericanUrbanTragedybyAnnaCl.json","image_url":"https://www.washingtonpost.com/resizer/kYfwKjYZMqcy7-uSRi6KqaNbkNo=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7FAXXGE2MMI6RNQLDSEX6F7BQU.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_how-a-web-of-racism_ff070650e6a19136a7d84ae1ac0c1024_3920e37c-95b2-11e8-a679-b09212fb69c2_story_1540092728.html","title":"Book review of What the Eyes Don't See: A Story of Crisis, Resistance, and Hope in an American City by Mona Hanna-Attisha and The Poisoned City: Flint’s Water and the American Urban Tragedy by Anna Cl","title_page":"Book review of What the Eyes Don't See: A Story of Crisis, Resistance, and Hope in an American City by Mona Hanna-Attisha and The Poisoned City: Flint’s Water and the American Urban Tragedy by Anna Clark - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Meara Sharma writes about culture and the environment.\nNiko Goodrum of the Detroit Tigers looks over thousands of water bottles that he donated in June to residents in Flint, Mich. (Jake May/The Flint Journal via AP)\nIn every age, there are places that in their very names come to signify a nation’s gravest problems. Sandy Hook. Ferguson. San Bernardino. They stand in for America’s mass-shooting crisis, racist police violence, radicalization and domestic terrorism. But there are risks in this kind of metonymy — what writer Chimamanda Ngozi Adichie has called “the danger of a single story.” If we reduce a place to the outlines of its tragedy, we disempower its people. We fail to see its depth and specificity, as well as the larger stories it may hold.\nTwo new books take distinct approaches to flesh out the picture of such a place: Flint, Mich. The headlines of the Flint water crisis — in which residents suffered contaminated water in the face of official neglect for years — are widely known. But “The Poisoned City” by journalist Anna Clark provides the first thorough account of the saga and positions it within a more expansive narrative of unjust urban policy, the vicissitudes of industry and the history of American infrastructure. “What the Eyes Don’t See” by Flint pediatrician Mona Hanna-Attisha is a far more intimate and subjective memoir about her pursuit of medical evidence to prove that children were being poisoned by city water.\nIn 2014, under the aegis of a state-appointed emergency manager, the city of Flint decided to switch its water source from a Detroit-controlled Great Lakes supply to its own system. Clark explains that there was some logic to this: Flint’s water rates were among the highest in the country, and residents — nearly half of whom live below the federal poverty line — were fed up. If Flint was in control of its own water, the city claimed, it could ensure its affordability and “build self-sufficiency” over its most fundamental resource.\nDuring the transition, the city turned to a temporary source of water: the Flint River. After decades of chemical and sewage dumping, the river water had vastly improved, but it was still corrosive. Michigan’s Department of Environmental Quality (DEQ) failed to treat it effectively or employ federally mandated corrosion control. As a result, when it coursed through Flint’s aging pipes, metals began to flake off and taint the water with lead, a toxin that can lead to brain damage.\nResidents immediately discerned a problem. Their water flowed orangey-brown and murky, sometimes “dark as coffee.” It stank. People started developing strange rashes, losing hair, getting aches and pains. But when they complained to the city, they were rebuffed. In the face of a leaked Environmental Protection Agency memo raising alarm, an independent water test revealing a city veined with poison and even their own disconcerting data, authorities said the same thing, again and again: The water was fine.\nFor a long time, Hanna-Attisha repeated that line to her patients, too. “Flint was literally in the middle of the Great Lakes region, the largest source of freshwater in the world,” she writes. “Why doubt the safety of what was coming out of the tap?” But when a trusted friend and former EPA employee tells her there’s talk of lead in Flint’s water, she is horrified. Lead exposure is especially dangerous for children: It can lead to a drop in IQ, memory and attention issues, and aggressive behavior. Within hours, Hanna-Attisha transforms into a “renegade and detective,” determined to find the “proof of impact” that would shake the authorities out of their stupor.\nHanna-Attisha’s quest is full of drama and suspense: late-night number-crunching, slimy government figures, inspired breakthroughs. She’s a breezy, charismatic raconteur prone to feisty character descriptions (a DEQ spokesman is a “rabid pit bull”; a turn-of-the-century anti-lead activist is a “stubborn badass”). And while she paints herself as relentlessly righteous, she also opens up about the toll of this crusade: Her health deteriorates, her kids resent her absence, and her research prompts a psychologically crushing backlash.\nIt’s hard to believe that officials intended to poison residents with bad water, but the strength of the state’s refusal to acknowledge the truth for so long is staggering. In “The Poisoned City,” Clark constructs a bleak portrait of a government marked by opacity, greed and a kick-the-can-down-the-road culture of willful negligence in a city where residents are mostly poor and mostly black. Hanna-Attisha sees that firsthand as she confronts the state: “They made no attempts to get to the bottom of anything; their only goal was to recast and massage their lies.”\nBoth authors conclude that structural racism and inequality allow this culture to thrive. Clark in particular traces the rise and fall of the auto industry, as well as segregation, white flight, redlining, austerity and incursions on democracy that disproportionately affect African American communities. “If you wanted to kill a city, that is the recipe,” she writes. This lattice of context underscores the point that Flint’s water crisis isn’t an isolated event but rather a result of calculated disinvestment and racist policies. Consider what one EPA official said, evincing an attitude that impairs so many American cities: “I don’t know if Flint is the kind of community we want to go out on a limb for.”\n“The Poisoned City” is meticulously researched. But in pursuit of comprehensiveness, the book can feel tedious and distant, missing a human element. Clark relies heavily on document dumps and local reporting, so it’s hard to tell what she witnessed and what she gleaned secondhand. She is critical of how the media “tended to single out one or two figures” — like Hanna-Attisha — at the expense of community organizers, often black, who were speaking out long before. However, her narrative doesn’t fill that gap meaningfully. Her efforts to reveal Flint’s multitudes would have been bolstered by a deeper engagement with the local leaders who she rightly claims have been sidelined.\nWhile “What the Eyes Don’t See” can veer into sentimentality and self-congratulation, Hanna-Attisha, too, is wary of the “single story.” She threads the book with tales of her immigrant family’s journey from Saddam Hussein’s Iraq to the suburbs of Detroit. As a child, her father showed her images of the regime gassing children. “We were taught not to look away,” she writes. “We understood that leaders could be dangerous, that civilizations sat on the delicate edge of a precipice, and that injustice must be challenged.” These recollections, as well as stories of crusading figures from public health lore, turn the book into a condemnation of groupthink and a clarion call to live a life of purpose.\nIn recent years, there has been some justice for Flint. Admissions of failure. A class-action lawsuit obligating the state to invest nearly $100 million in lead-free infrastructure. A Medicaid expansion. A slew of criminal indictments against state officials for misconduct, violations of the Safe Drinking Water Act and involuntary manslaughter. A report by the Michigan Civil Rights Commission stating plainly that the crisis was “the result of systemic racism that was built into the foundation and growth of Flint.”\nBut for those who now hold toxins in their bodies, our skewed public health approach offers little to celebrate. “Children become the proverbial canaries in the coal mine, as we use their bodies, their lives, as instruments to test the world around them,” Hanna-Attisha writes. “If they test high, that means there’s lead in their environment. This is useful to know, but for the child, it’s already too late.”\nAs for the state’s shift from spin doctor to advocate for the public good? As Clark points out in a footnote, for all of Gov. Rick Snyder’s apologies, for all of his rhetoric about putting people first, the person he appointed to take over Michigan’s environmental agency is a former oil and gas lobbyist whose previous job was to save face for BP after the Deepwater Horizon disaster. It is — dare I say — hard to swallow.\nWhat the Eyes Don't See A Story of Crisis, Resistance, and Hope in an American City By Mona Hanna-Attisha One World. 364 pp. $28","url":"https://www.washingtonpost.com/outlook/how-a-web-of-racism-and-lies-poisoned-flint/2018/08/09/3920e37c-95b2-11e8-a679-b09212fb69c2_story.html"}
