{"authors":[],"date_download":"2018-10-21 03:29:30","date_modify":"2018-10-21 03:29:30","date_publish":"2018-06-28 20:06:38","description":"Alan Lightman argues that if you don’t unplug sometimes, you will lose yourself.","filename":"data/vaneerConsumption/BookreviewofInPraiseofWastingTimebyAlanLIghtman.json","image_url":"https://www.washingtonpost.com/resizer/fe3YiHK75tkpywYt4fCx3VmsQpk=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2WDUIKCPT4I6NPZHIBIQNA3PSY.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_put-down-the-phone-_567ac4a1df2524fcbd7853d4f0799e14_a2de9170-6023-11e8-9ee3-49d6d4814c4c_story_1540092570.html","title":"Book review of In Praise of Wasting Time by Alan LIghtman","title_page":"Book review of In Praise of Wasting Time by Alan LIghtman - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Debra Bruno is the author, with Bob Davis, of “Beijing from A to Z: An Expat Couple’s Adventures in China.”\nDo you do calf stretches while you are brushing your teeth? Listen to a podcast if you take a 10-minute walk? Scroll through Twitter while you are on the phone with your mother?\n(These are random examples. I haven’t the slightest idea how I came up with them.)\nWe see the multitasking, hyper-connected struggle against wasting time all around us in Washington. This is a city where mothers and nannies pushing little ones in strollers talk nonstop to friends on their cellphones and ignore the child gazing out at the world with fresh eyes. A place where it’s more important to take a selfie with the art at the blockbuster show than it is to actually look at the works.\n“We are losing ourselves,” writes Alan Lightman in his new book, “In Praise of Wasting Time.” The physicist, novelist and essayist says that without downtime, our minds have no time to rest, to rejuvenate and, even more profoundly, to foster an internal sense of identity, “a deeply rooted and constant manner of honoring your inner self, affirming your values, and arranging your life so as to live by those values.”\nAt first glance, it seems more than a little ironic to read a case for wasting time from a man like Lightman. The MIT professor, TED talker and writer is as prolifically and comfortably at home in the fanciful world of novels as in the awe-inspiring world of astrophysics. Lightman’s obsession with time and its place in our universe goes way back. In his acclaimed 1992 novel, “Einstein’s Dreams,” Lightman imagines Albert Einstein when he was living in 1905 Bern, Switzerland, dreaming of various ways that time could be conceived, stopped, sliced and set in motion. It’s probably no coincidence that Lightman did his undergraduate work at Princeton, where generations of students learn that after Einstein finished his mornings at his desk, he spent many peaceful afternoons sailing on Carnegie Lake.\nLightman also recalls his own childhood, when he spent hours messing around in the little laboratory he created in a large closet next to his bedroom or watching tadpoles in the shallows of a pond. But now he acknowledges that he, too, is guilty of the same mistake he sees in all of us. “For any unexpected opening of time that appears during the day, I rush to patch it, as if a tear in my trousers.” He adds, “Unconsciously, without thinking about it, I have subdivided my day into smaller and smaller units of efficient time use, until there are no holes left, no breathing spaces remaining.”\nI can’t help thinking that Lightman is probably trying to convince himself as much as his readers. But that might mean being a little less prolific. This is the second book he’s come out with this year. In March, he released “Searching for Stars on an Island in Maine,” a meditation on religion and science. And he’s turned out an additional 20 or so books, ranging from the whimsical to the profound, over the past 30 years.\nIt’s ironic that this is a short book, just 90 pages of text (along with colorful illustrations), under the imprimatur of TED Books: “small books, big ideas,” which are, as the publisher explains, “long enough to explore a powerful idea but short enough to read in a single sitting.” So, perfect for the truncated attention span.\nLet’s also keep in mind that this might be an argument aimed more at those with the luxury to waste time. In other words, not the single mother who commutes an hour to a job, oversees homework and runs a few loads of laundry before she collapses into bed.\nEver the scientist, Lightman constructs a careful and well-sourced argument, citing the anecdotes of artists, scientists and writers to build his case methodically and convincingly. Not only does the creative mind need rejuvenation and rest to develop the habit of divergent thinking, he says, there’s also a larger, more spiritual loss: Those of us who never unplug from the wired world will “die psychologically, emotionally, spiritually,”he warns. He compares this to our destruction of the natural world.\nLightman admits that even though he believes his message, he’s also lost part of his inner self. “By inner self, I mean that part of me that imagines, that dreams, that explores, that is constantly questioning who I am and what is important to me. . . . When I listen to my inner self, I hear the breathing of my spirit. Those breaths are so tiny and delicate, I need stillness to hear them, I need slowness to hear them.”\nHis solution is that we should all start to develop the habit of mind that allows for contemplation and reflection. “We need a mental attitude that values and protects stillness, privacy, solitude, slowness, personal reflection; that honors the inner self; that allows each of us to wander about without schedule within our own minds.” Even just a half-hour a day of wasted time is a gift we give ourselves, he says. And no, this does not mean scrolling through Facebook, catching up on Colbert or commenting on the latest ridiculous tweet. No notifications. No cellphone. Just sit on the porch and listen to the birds chirping.","url":"https://www.washingtonpost.com/outlook/put-down-the-phone-look-at-the-world-around-you-waste-a-little-time/2018/06/28/a2de9170-6023-11e8-9ee3-49d6d4814c4c_story.html"}
