{"authors":["Roger Lowenstein"],"date_download":"2018-10-21 03:30:31","date_modify":"2018-10-21 03:30:31","date_publish":"2018-07-20 04:39:54","description":"Benjamin Carter Hett shows how Hitler preyed on fears and defeated ineffectual politicians.","filename":"data/vaneerConsumption/BookreviewofTheDeathofDemocracyHitlersRisetoPowerandtheDownfalloftheWeimarRepublicbyBenjaminCarterHett.json","image_url":"https://www.washingtonpost.com/resizer/q3RFHXiUcItu92UrB5HAMCQQtO8=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/YKTBESULMAI6RI2FUG7XQR5TOU.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_how-a-hypernational_24a9e01ee0b88075c2fa39acbeb93d3c_fedb41c8-8475-11e8-8553-a3ce89036c78_story_1540092631.html","title":"Book review of The Death of Democracy: Hitler's Rise to Power and the Downfall of the Weimar Republic by Benjamin Carter Hett","title_page":"Book review of The Death of Democracy: Hitler's Rise to Power and the Downfall of the Weimar Republic by Benjamin Carter Hett - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Roger Lowenstein, a Washington Post Sunday business columnist, is writing a book on the economic upheaval of the Civil War.\nAdolf Hitler, surrounded by his bodyguards arrived at Saarbrucken, Germany, in May 1932. (AP Photo)\nAt a time of deep distress over the stability of democracy in America and elsewhere, Benjamin Carter Hett’s chronicle of the collapse of the Weimar Republic and the rise of Adolf Hitler could not be more timely. “The Death of Democracy” makes for chilling reading precisely because it deals with Hitler’s early years, when he was a fringe politician exploiting disaffection with German democracy to gain an institutional foothold and then leveraging the bitter divisions among the established political parties.\nWere it not for the partisan rivalries that prevented mainstream leaders from acting in concert, it is hard to fathom Hitler’s ascension. Even when he was named chancellor and asked to form a government in January 1933, his hold on power seemed tenuous. Four previous chancellors had served since 1930; none had been able to resolve the festering political crisis. The Nazis did not have a majority in the Reichstag, and the majority of Germans did not anticipate anything like an absolute dictatorship, much less gas chambers or a second world war. Indeed, Hett writes on the very last page, “When he [Hitler] became chancellor . . . millions expected his time in office to be short and ineffectual.”\nThe aura of evitability haunts this tale; so does, contrariwise, the mounting helplessness of those who were deeply offended by the Nazis but unable to stop them. Most Germans hadn’t voted for Hitler; most, if Hett can be believed, were either horrified or becoming deeply worried by the Nazis’ extremism and penchant for violence. They were aware that Hitler’s propaganda was fabulist — stitched from a cloth of lies — and yet, millions of Germans who heard his rants came away feeling that he was their authentic voice.\nAt a more intimate level, politicians close to Hitler saw him react to criticism by descending into a fury. Yet they saw that he also was a cool operator who could charm and mislead political rivals. In particular, German nationalists, generals, businessmen and others on the right came to believe they had no better option than to work with Hitler. They imagined they could corral him and use him to achieve their own purposes, such as checkmating labor unions and reasserting German strength.\nHett, a professor of history at Hunter College, clearly intends his book to serve as a warning to the West’s imperiled democracies. In another era, the title “The Death of Democracy” would seem bland and uncompelling; today it feels fraught with foreboding. Hett dedicates the book “to everyone who fights for freedom, human rights, democracy, peace, and tolerance.” As if afraid his message will be lost, he adds in the acknowledgments, “Given the theme of this book and the times we live in, the dedication speaks for itself.”\nGerman democracy in the 1920s was far newer than America’s today; yet, Hett reminds us, universal voting (for men) was well-established, in place longer even than in England. But it was beset with serious problems. World War I had saddled Germany with forced reparations and a need for foreign credit. The only way it could work its way out of debt was to cooperate with the international powers — the United States, Britain and France — and join in the global system of trade and finance.\nOrdinary Germans naturally did not comprehend the complexities of such arrangements, only that the system was one for which they had never, knowingly, voted. And it had bequeathed to them first runaway inflation, then the Depression. To make matters worse, the war had released into central Europe millions of refugees, many of whom settled in the Reich, including approximately 80,000 “Eastern Jews” from the former Russian Empire.\nFrom the beginning, opposition to immigration was a central point in Nazi ideology. By the early 1920s, the refugee flow had abated, but Germany’s eastern border remained porous. The party’s founding platform, written in 1920, included a “demand” that immigration be halted and that all “non-Germans” who had entered the country after the start of the war be expelled “without delay.”\nA parallel sentiment was opposition to free trade — indeed, opposition to the entire framework of international capitalism. Since Germany was dependent on trade for food, Hitler promoted the notion that land to the east (such as Poland and Ukraine) could be Germany’s breadbasket. Some suggested that Germany could preside over a trade federation with such countries, although what Hitler ultimately did was invade them.\nMuch of the Nazi ideology was anti-capitalist — almost pre-capitalist. It favored rural Germans and targeted supposed forces of modernity: liberal media members, Jews, cosmopolites. As Hett writes, although the term “globalization” did not exist, the concept was familiar, and the Nazis wanted out of it. In an example that could almost have been ripped from the headlines today, Hitler wrote, “The German people have no interest [in] a German financial group or a German shipyard establishing a so-called subsidiary shipyard in Shanghai to build ships for China with Chinese workers and foreign steel.” Joseph Goebbels, his future propaganda minister, invoked another trope from modern times: “Certainly,” said the defiant Goebbels, “we want to build a wall, a protective wall.”\nAlthough some of the issues the Nazis addressed were real, they were distorted by a prevailing myth — that Germany hadn’t been defeated on the battlefield but, rather, “stabbed in the back” by Jews, socialists and others. Hitler’s associates differed as to whether he believed such lies. A Social Democratic reporter and early Hitler biographer named Konrad Heiden concluded that “at the highpoints of his speeches, he is seduced by himself.” Yet in “Mein Kampf,” Hitler made no bones about lying, candidly elucidating that “in the greatness of the lie there is always a certain element of credibility [to] the broad masses of a people.”\nNationalism was a powerful weapon, especially to reach the “humble people.” As Hett reflects, “The instability of borders and the diversity of borderlands often provokes hypernationalism as a response.” This is evident today not only in the United States but in Britain, in Poland, in Hungary — even in Germany.\nAs in the 1930s, the contemporary Western world has suffered a lingering economic trauma: the mortgage and international debt crises and associated recessions. Also as then, economic upheaval has divided the masses from the elites. Hett cites an anti-democratic impulse in Weimar Germany among people who thought the established parties were not working in their interest. In modern times, the trade rules designed by bureaucrats in Brussels have turned off many Europeans and Britons, and the bank bailouts in America felt, to many, like a stab in the back. Resentment against the international economic order has been a result. Such anxieties have been exploited, in country after country, with emotional promises to build walls and strengthen borders and, however implausibly, to reset the economy to a simpler, less interdependent age. People who do not want to live in a world that is ruled by impersonal market forces (or by Goldman Sachs) may rally to a strongman if they perceive it to be their only alternative.\nWhat determined Germany’s fate, ultimately, was the bankrupt response of traditional parties. Hitler, at first, seemed anything but a success. As Hett writes, a year after the Nazis came to power, the movement seemed to be losing steam. However wobbly, German democracy was not yet extinguished. As late as 1934, Franz Von Papen, an army officer who was vice chancellor, stirred a large audience at Marburg University with a call for humanitarianism and freedom of conscience, and a warning that Germany must remain “a people among peoples in the middle of Europe.” But opposition on the right could never coalesce, nor would any of its members form a majority with Social Democrats on the left — nor could the left overcome its own ruinous divisions. As Hett notes, “Few members of Weimar’s insurgent groups wanted a lawless and barbaric dictatorship ruled over by someone like Hitler.” But “they were deeply unwilling to compromise with their opponents.” This gave Hitler the breathing space to appear to respect democratic norms until he could crush everyone else.\nHett’s tale does not so much change our view of demagogues as it highlights the crucial role of those who would halt their progress. Faced with jingoist politicians who resort to poisonous lies, his book fairly proclaims, the forces of democracy can prevail only if they muster courage, resolve and cooperative spirit.","url":"https://www.washingtonpost.com/outlook/how-a-hypernationalist-crafty-liar-exploited-political-divisions-in-1930s-germany/2018/07/19/fedb41c8-8475-11e8-8553-a3ce89036c78_story.html"}
