{"authors":["Carla Anne Robbins"],"date_download":"2018-10-21 03:30:18","date_modify":"2018-10-21 03:30:18","date_publish":"2018-07-05 22:26:45","description":"Nic Cheeseman and Brian Klaas reveal how despots set up successful fradulent elections.","filename":"data/vaneerConsumption/BookreviewofHowtoRiganElectionbyNicCheesemanandBrianKlaas.json","image_url":"https://www.washingtonpost.com/resizer/PZlmaTDdKgFy6VeDF8lpSQd5XKI=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/AJXXDJD6EQI6RNTAJUHZ6A2R6E.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_election-rigging-by_953a2dbfbce992658caea014c79bcc88_d2898ddc-53bf-11e8-a551-5b648abe29ef_story_1540092618.html","title":"Book review of How to Rig an Election by Nic Cheeseman and Brian Klaas","title_page":"Book review of How to Rig an Election by Nic Cheeseman and Brian Klaas - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Carla Anne Robbins is a former deputy editorial page editor for the New York Times and chief diplomatic correspondent for the Wall Street Journal. She is now an adjunct senior fellow the Council on Foreign Relations and Marxe Faculty Director of the MIA program at Baruch College’s Marxe School of Public and International Affairs.\nSupporters of Turkish President Recep Tayyip Erdogan celebrate his reelection last month. (AP Photo/Emrah Gurel)\nIn their book “How to Rig an Election,” Nic Cheeseman and Brian Klaas issue a plea to American and European leaders: Take a more skeptical look at fraudulent elections and recognize the danger of endorsing rigged votes. The book is an instructive, though thin, primer showing that sham elections are depressingly common. Today, “more elections are being held, but more elections are also being rigged,” write Cheeseman, a professor at the University of Birmingham, and Klaas, a fellow at the London School of Economics (and a contributor to The Washington Post’s DemocracyPost blog). The authors warn that “counterfeit democrats” have figured out not only how to rig elections but also how to dupe Western observers and governments into accepting the outcome — and often emerge stronger.\nThe book details rigging strategies from the outrageous (disappearing ballot ink in Ukraine and three candidates with the same name on a St. Petersburg ballot) to the familiar (gerrymandering and voter suppression). In 23 percent of recent elections, violence, intimidation or harassment was found to have played a role; vote buying occurred in nearly 40 percent. The “smartest way” to rig, according to the authors, is to start early, “when observers are likely to be thin on the ground, and [questionable tactics] can be presented as technical or legal decisions as opposed to political skulduggery.”\n(Yale University Press)\nCheeseman and Klaas argue that Western democracies either have not looked hard enough for election abuses or have willingly looked away. “Despite the wide range of rigging strategies that have been documented,” the authors write, “Western observation missions only raised the problem of fraud in 20 percent of the elections, and foreign aid was only stopped in the aftermath of around 6 percent.”\nThe payoffs for autocrats that successfully rig elections can include reinvigorated ruling parties, fractured opposition groups, and increased foreign financing, investment and aid. The “unsettling reality at the heart of this book,” the authors note, is that “their regimes have a better chance of survival if they hold elections and rig them than if they avoid holding elections altogether.”\nThe argument is provocative, and the authors’ plea would be more persuasive if the book contained a comprehensive list of the counterfeit democracies that have gotten a new lease on life after rigged elections and the Western governments and financial institutions that have helped prolong the reigns of the despots.\nCheeseman and Klaas criticize the United States as well as a number of other countries. They describe the role of former congressman Michael McMahon in monitoring the 2013 presidential election in Azerbaijan. Although the Organization for Security and Cooperation in Europe (OSCE) detected serious problems at 58 percent of the polling locations it visited, the New York Democrat deemed the election “honest, fair, and really efficient,” enthusing that unlike at U.S. polling sites, there were no lines in Azerbaijan. Cheeseman and Klaas write that while it is tempting to attribute McMahon’s comments to the naivete “of a single deluded Western official,” a European parliamentary delegation also declared that the vote in Azerbaijan represented a “free, fair and transparent electoral process.” According to the authors, Western governments were more concerned about access to the “energy rich Caspian region” than a clean vote.\nIn another telling incident, the authors recount Turkey’s 2017 constitutional referendum that granted sweeping new powers to President Recep Tayyip Erdogan. The OSCE described an “unlevel playing field,” and a member of the Council of Europe mission said 2.5 million pro-government votes could have been manipulated. Nonetheless, President Trump phoned Erdogan to congratulate him on his victory, prompting Cheeseman and Klaas to ask: “Why would Erdogan care about a report from the OSCE” after receiving “unfettered praise from the most powerful man in the West?”","url":"https://www.washingtonpost.com/outlook/election-rigging-by-dictators-is-too-easy-and-the-west-often-looks-the-other-way/2018/07/05/d2898ddc-53bf-11e8-a551-5b648abe29ef_story.html"}
