{"authors":["Joe Nocera"],"date_download":"2018-10-21 03:27:48","date_modify":"2018-10-21 03:27:48","date_publish":"2018-09-13 03:29:21","description":"Mark Leibovich assesses pro football’s problems and the prospects for its future.","filename":"data/vaneerConsumption/BookreviewofBigGameTheNFLinDangerousTimesbyMarkLeibovich.json","image_url":"https://www.washingtonpost.com/resizer/l47vJ5XOEO5KNf6yGTPKJQzC5EQ=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PEOJ6NVWTEI6RJ5VVWVKLMVFP4.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_are-these-the-last-days-of-the-nfl_2018_09_12_44738218-af91-11e8-a20b-5f4f84429666_story_1540092468.html","title":"Book review of Big Game: The NFL in Dangerous Times by Mark Leibovich","title_page":"Book review of Big Game: The NFL in Dangerous Times by Mark Leibovich - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Joe Nocera is a columnist for Bloomberg Opinion and a co-author, with Ben Strauss, of “Indentured: The Inside Story of the Rebellion Against the NCAA.”\nI entered college with a very high opinion of my prose — so high that I felt sure I could write term papers with minimal research by simply “slinging it.” Then I got a professor who had no patience for my personal asides and my clever avoidance of the assigned topic. In the margins, he would write “who cares?” and grade me accordingly.\nMark Leibovich could have used a professor like mine. As evidenced first in “This Town,” his 2013 examination of Washington’s political culture, and now in “Big Game: The NFL in Dangerous Times,” Leibovich is the king of sling. The New York Times Magazine’s chief national correspondent has a book-reporting strategy that consists of attending events (Tim Russert’s funeral; an NFL owners meeting), hanging around the periphery and writing what he sees, with plenty of snark and personal asides for good measure. He’s a good enough writer to keep you from wanting to throw the book against the nearest wall. But if you look closely, you’ll realize he has nothing to say.\nActually, you don’t even have to look that closely. With the National Football League’s current problems — notably, the “taking a knee” controversy and the knowledge that playing football can inflict brain damage — “Big Game” is ostensibly an attempt to answer the question of whether pro football has peaked. As Leibovich writes in the book’s preface: “Are we witnessing the NFL’s last gasp as the great spectacle of American life? I’d probably put the game’s long-term survival as a slight favorite over the doom scenarios.”\nThen he adds, “Beyond that, I’m punting.” He spent four years going to football games, interviewing owners and various NFL pooh-bahs, attending draft days and owners meetings, and writing a more than 350-page book, and he’s punting? He is, and he does.\nThe book’s genesis, Leibovich tells us, came on July 2, 2014, when — are you sitting down for this? — the author got an email from the New England Patriots’ star quarterback, Tom Brady. As he tells us many, many times in “Big Game,” Leibovich is a Pats fan (“fanboy” might be a more appropriate term), and he’d been wanting to profile the great Brady for years; in the email, Brady informed him that he was willing to talk to the author. The email led to a few conversations, and though Brady rarely said anything interesting — you’d be hard-pressed to find a less forthcoming athlete — Leibovich became friendly enough with Brady’s father and his trainer that he was able to squeeze out a Times Magazine profile in early 2015.\nAlthough Brady gets the star treatment in “Big Game,” it’s not really a book about the players. The real focus is on the NFL’s 32 owners — Leibovich claims to have interviewed half of them, including a drunken go-round with Dallas Cowboys owner Jerry Jones — as well as Commissioner Roger Goodell, whom he mocks mercilessly. Still, his problem is that they aren’t much more forthcoming than Brady; they don’t really tell him anything they wouldn’t tell any other journalist on the business-of-football beat.\nThus, at the first owners meeting Leibovich writes about, in Boca Raton, Fla., he does the same thing as everyone else covering the meeting: He waits around with the pack of reporters for the owners — or anyone else of interest — to stop and talk to them. Astonishingly, this meeting consumes three full chapters.\nIn the first chapter we learn that the owners are unhappy with their accommodations in Boca — which Leibovich uses as a strained metaphor for “something being off-kilter with America’s beloved blood sport.” He reports that New York Giants Chairman Steve Tisch has a gorgeous girlfriend who speaks five languages. And he repeats Goodell’s infamous remark, when asked about young football players who had recently died: “There is risk in sitting on the couch.”\nMuch of the second chapter is spent describing a handful of owners as they parade through the media gauntlet. Jones is “brash and rascally.” Mark Davis, the owner of the Oakland Raiders — who is determined to move the franchise to greener pastures — is treated by the other owners “like their pet rock.” Leibovich gives Woody Johnson, the Jets owner (and current ambassador to Britain), the nickname “Wood Man.”\nThe third chapter is padded with an eight-page description of the other reporters working the meeting, searching for nuggets they can deliver to their readers or viewers. “The Nugget Industrial Complex,” he snarks, even though he is looking for his own nuggets.\nAnd so it goes. Leibovich tackles the concussion issue by going to Hall of Fame ceremonies and talking to retired players about their physical and mental problems. Nothing wrong with that, except that the serious discussion is overwhelmed by pages of pointless narration. At the 2017 Super Bowl, Leibovich describes the parties he went to. He actually offers a sentence that reads, “And this explains everything about everything — or perhaps nothing at all.”\nTo be blunt, I learned nothing about the state of pro football from reading “Big Game” that I didn’t already know. But oh, what I learned from Leibovich’s slinging it! I know that Goodell doesn’t like pizza. I know that Brady speaks Portuguese to his kids. I know that Leibovich hates the Washington Redskins almost as much as he loves the Patriots. I know that Jones was once a shoe salesman.\nAs my old professor might have put it: Who cares?","url":"https://www.washingtonpost.com/outlook/are-these-the-last-days-of-the-nfl/2018/09/12/44738218-af91-11e8-a20b-5f4f84429666_story.html"}
