{"authors":["Allan Fallow"],"date_download":"2018-10-21 03:30:42","date_modify":"2018-10-21 03:30:42","date_publish":"2018-07-13 03:13:11","description":"Daniel de Visé captures the personal and professional struggles of a cycling standout.","filename":"data/vaneerConsumption/BookreviewofTheComebackGregLeMondtheTrueKingofAmericanCyclingandaLegendaryTourdeFrancebyDanieldeVise.json","image_url":"https://www.washingtonpost.com/resizer/9WT25iczNjjnR-BSEjFkGhBgvOo=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VMFBDWUDUAI6RHUAIA5CEGKGU4.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_how-greg-lemond-ove_133136e960d3ba95a348581155aed81e_1ad81370-69bd-11e8-bf8c-f9ed2e672adf_story_1540092642.html","title":"Book review of The Comeback: Greg LeMond, the True King of American Cycling, and a Legendary Tour de France by Daniel de Vise","title_page":"Book review of The Comeback: Greg LeMond, the True King of American Cycling, and a Legendary Tour de France by Daniel de Vise - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"correction: An earlier version of this review incorrectly said that LeMond was the first American to enter the Tour de France. Jonathan Boyer was the first American to compete in the Tour. This version has been corrected.\nAllan Fallow is an avid cyclist and freelance book editor in Alexandria, Va.\nGreg LeMond, left, clasps hands with Claudio Chiappucci of Italy going into the final stage of the Tour de France in 1990. LeMond went on to win the race for the third time. (Laurent Rebours/AP)\nA rider training for the 21-stage, 2,000-mile Tour de France may look “like a POW,” as a shaken Kathy LeMond said of her gaunt husband, Greg, before the 1981 season. But once the tour starts rolling — as this year’s 105th edition did from Noirmoutier-en-l’Île on July 7 — it takes no prisoners: An overeager photographer who knocked a rider off his bike one year received a retaliatory wheel to the face.\nCompare that reaction with LeMond’s upon colliding with a spectator during his three-peat tour in 1990, as recounted in Daniel de Visé’s “The Comeback”: “He leapt up to aid the woman, asking, ‘Are you okay?’ For the moment, he cared more about her welfare than the outcome of the Tour. Her husband did not.\n“ ‘Go on, get out of here,’ the husband cried. ‘Don’t worry about her.’ ”\nLeMond reluctantly complied. Pausing only to push a dislocated finger back into its socket “with the dispassion of someone adjusting his cap,” LeMond remounted his bike and sped off after the vanishing peloton.\nThat blend of chaos, kindness and cruelty typifies the scenes that journalist de Visé brings to life in this sympathetic-verging-on-reverential retelling of LeMond’s trailblazing career — and his standing as the first American to win the Tour.\n(Atlantic Monthly Press)\nTo parse LeMond’s competitive edge and capacity for suffering, de Visé points us first to his father, Bob, who went from being “a six-pack-a-day man” with a paunch to placing fifth in the 1978 Red Zinger Bicycle Classic. We meet his mother, Bertha, blithely removing cookie sheets from a hot oven with her bare hands. And we follow young LeMond as a “tow-headed whirlwind” roaming the wilderness of Nevada’s Washoe Valley near Lake Tahoe, displaying reflexes “so quick he could catch fish without a pole.” De Visé writes: “He was a natural athlete . . . driven, and utterly tireless.” And he perfectly embodied the wide-eyed, cycling-mad Dave Stoller in “Breaking Away”: “His sky-blue eyes and sunny smile radiated a disarming sweetness and a puppy-dog zeal for life.”\nNine months after surviving the cynical treachery of French teammate Bernard Hinault to win the 1986 tour — a story arc telegraphed by the chapter titles “The Deal” and “The Betrayal” — LeMond nearly died in a turkey-hunting accident on his uncle’s remote ranch. Only the serendipitous appearance of a California Highway Patrol helicopter — “part of a long chain of small miracles” — saved his life.\nEight months pregnant with their second child, Kathy arrived at the hospital to find LeMond’s body “a colander,” stippled with 60 holes dripping blood. (LeMond still carries more than 30 iron shotgun pellets in his body, five in his heart.) Later on, their 3-year-old son, Geoffrey, spied the circular scabs on his father’s back and cried out: “Oh, Daddy. Why do you have spots?” That night the boy insisted that his aunt add spots to his back, too; she obliged with a felt-tip marker.\nThat anecdote and countless others suggest that de Visé, a former Washington Post reporter, enjoyed unfettered access to the LeMond family. The shooting’s aftermath, he reveals, was carefully stage-managed: “If anyone in the professional cycling community learned the full extent of his injuries, there was little chance he could return. . . . Without telling any untruths, Greg’s doctors and his loved ones did what they could to spin the narrative as a minor setback in his career.”\nMinor it was not — news that soon leaked across the Atlantic. A letter from La Vie Claire team owner Bernard Tapie, the Svengali of 1980s French cycling, appeared in LeMond’s mailbox a month after the mishap, “politely apprising Greg that he was fired.”\nHaving escaped death thanks to the “massive cardiovascular engine [that] had powered him to victory in the Tour” the year before, LeMond now engineered a miraculous resurrection — an uphill slog that would make the 21 switchbacks of L’Alpe d’Huez look flat as a crepe. Starting over on his old training route, LeMond got dropped (cycling slang for “left in the dust”) on a climb by a passing recreational cyclist. And in a delayed replay of his first exposure to Eurocentric cycling, LeMond found himself defending his uniquely American lifestyle choices: Cheeseburgers. Ice cream. Race-day sex. Playing golf — even going hunting — on rest days. (The latter was apostasy enough, but his most treasonous act was to break cycling’s omertà, “speaking openly and disapprovingly of doping and shady deals.”)\nThe capstone of the comeback was Le­Mond’s razor-thin victory margin — eight seconds, the smallest in race history — in the legendary 1989 tour. It came at the expense of his perfectly matched rival and near-nemesis, the blond-ponytailed, college-professor lookalike Laurent Fignon. Already the winner of two tours himself, Fignon (who would die of lung cancer at age 50 in 2010) will forever be remembered as the rider who lost the climactic time trial by shunning the use of tri-bars and aero helmet, both revolutionary at the time. “The Comeback” claims one of its many stage wins by elevating Fignon from cardboard Gallic villain to complex human being: If he “greeted the world with the surly indifference of a bistrot waiter,” writes de Visé, it was only because the clinically shy Fignon hid his “private angst” behind a facade of “public prickliness.”\nLeMond prevailed again in the 1990 tour, this time by a luxurious margin of 2 minutes 16 seconds. And unlike a certain now-disgraced Texan who would use strong-arm tactics to co-opt the media and accuse LeMond of doping, LeMond was “cycling’s Mr. Clean” his entire career. (It was a principled stand but also a phobic one: LeMond feared needles, once pacing a hotel room like a caged badger before letting the team doctor administer a gluteal iron shot.) All of which crowns LeMond “the True King of American Cycling” in the author’s eyes (and my own). “Upon his retirement” in 1994, writes de Visé, “LeMond stood as the unrivaled and unblemished icon of professional cycling in the United States.”\nFor decades, LeMond’s goofy smile and conflict-averse nature camouflaged a dark shadow that fell across his adolescence: A Tahoe neighbor named Ron had wormed his way into the family’s confidence and sexually abused the 13-year-old LeMond — a secret he hid from even his wife until his drinking and depression threatened their marriage in 2002. After breaking down and disclosing “his darkest secret,” LeMond grew closer still to Kathy. Their union survived.\nAs a reporter, de Visé skates lightly over the objective facts of that ordeal. As an author in quest of his protagonist’s motivation, though, he subjects it to extreme torque: “Greg found, in cycling, the ultimate distraction from his own demons, the pain of guilt and sorrow and humiliation that still roiled his brain from the months of sexual abuse.”\nWith “The Comeback,” LeMond appears to have finally dropped his demons.","url":"https://www.washingtonpost.com/outlook/how-greg-lemond-overcame-his-demons-and-injuries-to-win-the-tour-de-france/2018/07/12/1ad81370-69bd-11e8-bf8c-f9ed2e672adf_story.html"}
