{"authors":["Blaine Harden"],"date_download":"2018-10-21 03:32:42","date_modify":"2018-10-21 03:32:42","date_publish":"2018-08-16 20:13:23","description":"Michael Pembroke’s polemic skewers the United States but also reveals its military and political failures.","filename":"data/vaneerConsumption/BookreviewofKoreaWheretheAmericanCenturyBeganbyMichaelPembroke.json","image_url":"https://www.washingtonpost.com/resizer/AW1aB-DQ2l-eaxVkuJ-1bMUWi90=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OHQJ4ZVAVII6RI65FIMZD4DV2U.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_how-the-korean-war-_3ad2e5805ac114321b66b9d688891ac6_e73e6526-93ee-11e8-810c-5fa705927d54_story_1540092762.html","title":"Book review of Korea: Where the American Century Began by Michael Pembroke","title_page":"Book review of Korea: Where the American Century Began by Michael Pembroke - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Blaine Harden, a former Washington Post correspondent in Northeast Asia, is the author of three books about North Korea, most recently “King of Spies.”\nAn American tank blasts at enemy positions in South Korea on Aug. 12, 1950, as a soldier crouches to watch. Decisions by U.S. generals would end up prolonging the war and increasing the bloodshed. (AP Photo/Max Desfor)\nAmerican militarism was born in the blood and rubble of the Korean War. During that famously forgotten conflict in the early 1950s, the United States became a self-righteous bully. It overreacted to trifling threats and bumbled into an endless series of distant conflicts, waging war in the name of peace.\nThat is the provocative argument Michael Pembroke, an Australian historian and high court judge, makes in “Korea: Where the American Century Began.” Pembroke, whose father fought in a pointless battle at the end of the Korean War, has written an anti-American diatribe that is alive with disturbing facts sure to discomfort readers who know little about the Korean War and its legacy. His book is timely, readable and deeply researched.\nIt is also exasperating. Pembroke all but ignores the spectacularly prosperous and democratic state South Korea has become — with the steady help of the United States. He mostly sidesteps the cruelty and incompetence of North Korea’s founding dictator, Kim Il Sung, who sweet-talked Joseph Stalin into backing the surprise invasion that sent Soviet-made tanks and North Korean troops into South Korea on a Sunday morning in June 1950.\nWith a polemicist’s distaste for ambiguity, Pembroke cherry-picks events of the Korean War, emphasizing American outrages that support his argument while omitting successful U.S. efforts to confine the conflict’s savagery to the Korean Peninsula and prevent it from becoming World War III. A case in point: During the first year of the war, American pilots fought and died in the world’s first all-jet dogfights. Their lethal adversaries were ace Russian pilots pretending to be Chinese. They wore Chinese flight uniforms and painted their Soviet-made MiG-15 fighters with Chinese or North Korean markings. If shot down, the Russians were under orders to explain their white skin by saying they were European Chinese of Soviet extraction. Americans, of course, knew who their enemy was, having overheard them speaking Russian on aircraft radio. Still, the Truman administration kept this information secret. It worried that if the public learned Russians were blasting American boys out of the sky, popular pressure would increase for a retaliatory war against the Soviet Union, which by then had the atomic bomb. Washington’s coverup served a global peace.\nYet Pembroke’s book — appearing at a time when President’s Trump’s hot-headed threats and self-absorbed peacemaking have focused global attention on the two Koreas — does deliver crucial information that Americans need to understand the permanent crisis in northeastern Asia.\nFor starters, Pembroke shows how the 1945 division of Korea was an all-American idea and a bone-headed blunder that all but guaranteed war. Trying to stop Stalin’s armies from occupying all of the Korean Peninsula at the end of World War II, the U.S. government drew an arbitrary line along the 38th parallel, offering the north to the Soviet Union and taking control of the south. The border became a flash point for skirmishes between two aggressive puppet states, each led by egocentric dictators, one financed and armed by Moscow, the other by Washington.\nThe United States, to be sure, did not start the Korean War; North Korea did, with the connivance of the Soviet Union. But once the conflict was underway, as Pembroke explains with considerable precision, the Americans made the war two years longer and incalculably more murderous than it should have been. It took little more than three months for the United States, fighting with a United Nations mandate and with troops from South Korea and many other countries, to repulse the invasion. U.S. forces destroyed most of the North’s army and returned to the American-invented border between the two Koreas. But they did not stop there. Washington’s anti-communist blood was up, Pembroke explains, and it “lost sight of the limitations implicit in the moral principle of repelling aggression.”\nUnder the command of Gen. Douglas MacArthur and with the backing of President Harry Truman, U.N. forces occupied all of North Korea and marched north to the Chinese border. At the same time, the U.S. government ignored repeated back-channel warnings from China that it would not tolerate an American army along its northeast border.\nUnder Mao Zedong, China was true to its threat. As winter approached in 1950, it sneaked about 200,000 troops into North Korea — a mobilization that MacArthur’s intelligence team completely missed. The Chinese then humiliated the United States in what Pembroke accurately characterizes as “an epochal horror” of relentless attacks, horrific American losses and the longest retreat in U.S. military history. MacArthur had bumbled into what he called “an entirely new war.” Soon, the Chinese clawed back all of North Korea’s territory.\nIn its last two years, the war settled into a blood-soaked stalemate during which the United States conducted a pitiless — and often pointless — bombing campaign that devastated North Korea, blowing up cities with conventional explosives, burning them down with napalm and killing countless civilians. Pembroke accurately says America’s bombing “lacked any sense of proportionality.” It also gave North Koreans an enduring reason to hate and fear the United States, sentiments that have been stoked by decades of propaganda under three generations of dictators named Kim.\nPembroke completed his book months before Trump’s unprecedented meeting with Kim Jong Un in Singapore — a meeting that produced vague commitments that North Korea may someday dismantle its nuclear arsenal. In early August, Trump’s national security adviser, John Bolton, acknowledged that North Korea had not taken any steps toward denuclearization. For readers capable of looking beyond an America First understanding of how the world works, Pembroke’s analysis is chillingly relevant.","url":"https://www.washingtonpost.com/outlook/how-the-korean-war-set-the-stage-for-permanent-crisis-in-northeastern-asia/2018/08/16/e73e6526-93ee-11e8-810c-5fa705927d54_story.html"}
