{"authors":[],"date_download":"2018-10-23 05:15:57","date_modify":"2018-10-23 05:15:57","date_publish":"2014-10-12 00:00:00","description":"NPR's Ari Shapiro gets schooled in the art of being interesting by Benjamin Errett, the author of the new book, Elements of Wit.","filename":"data/vaneerConsumption/BookOffersAGetWitQuickWorkout.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=355564145_1540271757.html","title":"Book Offers A Get-Wit-Quick Workout","title_page":"Book Offers A Get-Wit-Quick Workout : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ARI SHAPIRO, HOST:\nThis is WEEKEND EDITION from NPR News. I'm Ari Shapiro. What do Jay-Z, Oscar Wilde and Cary Grant have in common? According to the author Benjamin Errett, they all possessed extraordinary wit. His new book asks how they got that way.\nBENJAMIN ERRETT: Can you try to be a wit? The answer is a definite yes. Will your efforts come to anything? The answer is decidedly less certain. The inverse law of repartee has it that the hard-earned individual attempts to be funny in social situations, the stronger stink of flop-sweat that wafts off that poor soul. Effort and effervescence simply can't share the same room. It takes hard work to get those bubbles in the champagne, but you don't want to think about that when you're popping a bottle.\nSHAPIRO: Benjamin Errett's book is called \"Elements Of Wit: Mastering The Art Of Being Interesting.\" He says it's not as effortless as it looks. Wit takes work.\nERRETT: It's a muscle. If you don't use it, it'll go slack. But if you are in the wit-equivalent of a gym every day, you're going to get better.\nSHAPIRO: What is the wit-equivalent of a gym?\nERRETT: Well, I think it starts with my book.\nSHAPIRO: (Laughter).\nERRETT: My book is like the six-minute abs of which. But all of these sort of people that I've referenced and the things that they've written and performed in and created, these are sort of the exercise machines, to strain this metaphor. How, I got to this book in the first place was basically thinking, what is it that makes all the stuff that I love good? What makes good stuff good?\nSHAPIRO: Yeah.\nERRETT: You know, like the essays of Christopher Hitchens or the poems of Patricia Lockwood or the music of Kanye West, the persona of Fran Lebowitz, all of these things that I just find fascinating. They're not funny. You can't say that, you know, Hitchens was funny, but he was definitely witty.\nSHAPIRO: Well, this may sound like an obvious question, but why should people aspire to be witty? What good does it do?\nERRETT: Well, I think, you know, humans are social animals, and that is what makes us happy, to be in social situations. So if you are perennially worried that you're not going to have something to say at a dinner party or in an elevator or at a family reunion, you're really depriving yourself of one of the main joys in life. I mean, when you're sort of able to go into those situations with a little bit more comfort, a little bit more ease and awareness that you are well-equipped to deal with whatever happens to be thrown at you, then it's just a more rewarding way to live.\nSHAPIRO: One of the quintessential wits who you write about in this book is Oscar Wilde, and many people, I think, would assume that his wittiest lines came trippingly off the tongue. You write that, in fact, that's not the case.\nERRETT: He's an interesting case because a lot of what he's done was lifted and borrowed and recycled. You can even see in some of his most famous works, there are lines that reappear. So he was always honing and fine-tuning everything that he was doing. And one of the interesting things about him that I really find admirable is that he had this persona in sort of salon society in Victorian London as this guy who was a great talker, but what has he ever done? And he was sort of known in society - he was sort of a Kardashian of his time. But he went on to do works of great substance and lasting value.\nSHAPIRO: I wonder whether the story of Oscar Wilde suggests that in order to be profoundly witty, you also in some way have to be profoundly unhappy or damaged in some way.\nERRETT: That's interesting 'cause that comes back to the idea of wit as being a facet of creativity and the sort of eternal stereotype of the creative as a miserable person.\nSHAPIRO: Or wit as a defense mechanism.\nERRETT: That's true, exactly. And, you know, I looked at it as basically being two sides of a coin. You could have snide wit, cruel wit or you could have - and I've chosen to put the emphasis on - the compassionate side of the coin, the idea that wit can make you resilient and bounce back. And one of my favorite examples of that is Nora Ephron who, of course, was a journalist in the tough, very male newspaper days of the '60s and '70s, came up in that world. She had her famous divorce that led to the book and then the movie \"Heartburn.\" And I really liked that as an example of someone sort of taking the lemons that life gave her and - however you want to twist that metaphor, either making limoncello or throwing them back or using them to garnish a martini - but just using what she got and using her quick-wittedness to prosper from it.\nSHAPIRO: In this book, you don't write about yourself. But I was curious, what inspired you as an author to write a book about wit? Was it a sense that you wanted to impart your wisdom to others, or was it a sense that you were looking in on this club that you weren't a part of and wanted to learn how to be part of it?\nERRETT: Yeah, I came into this with next to no wisdom, so I won't...\nSHAPIRO: (Laughter) Were you good at a dinner party before you wrote this book?\nERRETT: I'm much better at it now. Let me put it that way. The reason I wrote the book was there was all of these people I find so amazing, these people who just seem to have a mastery over life. And what I came down to was wit. It is they have a certain spontaneous creativity, an ability to be funny when called for, but to be trenchant when necessary. And from that, I would think I was able to provide a book that would help people just sort of seeing the man behind the curtain and knowing that there is a man behind the curtain, knowing there is a lot of hard work in these personas that seem so effortless.\nSHAPIRO: Benjamin Errett is the author of \"Elements Of Wit: Mastering The Art Of Being Interesting.\" Thanks for joining us.\nERRETT: Thank you.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=355564145"}
