{"authors":["Katherine S. Newman"],"date_download":"2018-10-21 03:30:43","date_modify":"2018-10-21 03:30:43","date_publish":"2018-07-26 19:07:38","description":"Alissa Quart assesses the setbacks millennials suffer in the new world of work.","filename":"data/vaneerConsumption/BookreviewofSqueezedWhyOurFamiliesCantAffordAmericabyAlissaQuart.json","image_url":"https://www.washingtonpost.com/resizer/ytbRi8r544Nhvg-Vf6H1GV5Lmm8=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/LZBWDQEQLUI6RAZCWVECX5PA6U.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_how-the-new-economy_045c4dbf9380ecce2dc7d3f23a730d7a_fc4ed854-7e0b-11e8-bb6b-c1cb691f1402_story_1540092643.html","title":"Book review of Squeezed: Why Our Families Can't Afford America by Alissa Quart","title_page":"Book review of Squeezed: Why Our Families Can't Afford America by Alissa Quart - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Katherine S. Newman is the Interim Chancellor of the University of Massachusetts, Boston, the Torrey Little Professor of Sociology, and author of the forthcoming book, “Downhill From Here: Retirement Insecurity in the Age of Inequality.”\nThe Great Recession — which lasted years longer than earlier downturns — wreaked havoc with the expectations of middle-class millennials. It accelerated the disruption of professions like law and made more painful the long-term erosion of working conditions in academia and journalism. As these ascendant generations came into their prime child-bearing years, the double whammy of the increasing costs of raising a family and the declining prospects for professional careers produced what Alissa Quart terms in her book, “Squeezed,” the “Middle Precariat.”\nThe boomer parents of the Middle Precariat raised their children to desire meaningful work and the benefits that were supposed to be attached: reliable salaries, home ownership, the financial wherewithal to provide a good education for the next generation. From “Squeezed,” we learn that those expectations have been dashed by a new economic reality: the spread of contingent work into professions that were once stable, the erosion of salaries and the disappearance of benefits (including fixed work schedules), and stunning increases in the costs of child care and housing.\nThese bald facts are already well known. What “Squeezed” adds to the familiar picture is a keen understanding of the bewilderment, shame and self-doubt that millennial parents now feel as they are forced to reckon with the fallout of their choices and the betrayal of the American promise that each generation will do at least as well as, if not exceed the fortunes of, the previous one.\nThat these experiences are not universally shared, even among millennials themselves, is testimony to the impact of economic inequality on the fortunes of young parents. Those who heeded the siren call of Wall Street have reaped outsize salaries and the wealth accumulation that goes with them. It is their sisters and brothers who entered the world of arts and letters, racked up enormous debts to complete a law degree, or followed their calling into teaching who now confront the gap between what they were raised to expect and what they can provide. The book portrays adjunct professors who must rely on food stamps, nurse unreliable cars, live in down-market neighborhoods and shop at Goodwill while they drown in debt from their college years.\nThey wonder whether they made mistakes in following their career dreams, whether they should have subordinated the desire for work they love to the security that follows from jobs that pay. And underlying their disappointment is a hint that they were sold a bill of goods, though it isn’t clear by whom: their parents, their generation, their society? Did they just miss the signals that these careers were doomed and that the debts they acquired to pursue them would weigh them down indefinitely?\nParticularly infuriating, as the book documents, are the setbacks encountered by millennials when they discover that combining work with pregnancy and childbirth exposes women to criticism, implied or expressed; loss of opportunities for advancement; wage penalties; and in many instances a push right off the career track. There is little celebration to be had over gender equality when fathers who take an active role in raising their kids are subjected to similar losses. They too are regarded as “not serious” and discover that they can be easily replaced by others who have no (or have not taken) family responsibilities. It is hard to fathom that in 2018, we are still having to fight these battles and that the legislation designed to stop this kind of discrimination has been so ineffective.\nAmerica has been down this road before. Indeed, with every major depression or long-term recession comes the toll of lost dreams and constraints on upward mobility. Sociological and journalistic accounts of the Great Depression are full of an abiding fear that the promise at the core of our society — of prosperity and security — was no longer in effect. We are suffused with the political consequences of these disappointments, from resurgent nationalism and xenophobia to a saber-rattling trade policy, all of which are designed to reassert dominance and obscure the evidence of decline. These sentiments are never the stock and trade of the poor. They are, instead, the emotional cry of the middle and working classes at risk for so much loss, who can feel their fingernails sliding down the chalkboard but cannot stop the descent.\n“Squeezed” captures well the toxic combination of American individualism and the disrupted evolution of particular professions that has left millions of millennials in a more fragile financial condition than they expected would be their lot in life. Hardened readers may find the stories it contains the self-absorbed accounts of people who should have known better. The storytellers themselves may feel the same way.\nAnd it may turn out, over time, that once these young parents clear the hurdle of getting their kids into school, they can leave behind the crushing financial toll of preschool and child care, and begin to see their way forward. They will have to contend with the costs of after-school care, but the options become marginally less expensive. Still, as Quart notes, if her interviewees were living in France, the Netherlands or Chile, they would not rack up insane medical bills to have a baby, nor would they have to bankrupt themselves to find quality child care for any age group.\nEconomists tell us that technological innovation leads to higher productivity and growth. The costs, along the way, of jobs that become obsolete or outsourced to countries with lower wages are what we must endure to reap the benefits of progress. It is little comfort to learn that the economy is growing, that new professions are emerging in the tech world that leave the professor, the journalist, the editor, the paralegal or the radiology technician behind. Aggregate success does little to relieve the pressure on the individuals whose career choices are subjecting them and their children to downward mobility.\n“Squeezed” could just as easily have been titled “Duped” because the underlying assumption that millennials should have seen this disaster coming is palpable throughout. It is hard to avoid the sense, so ubiquitous in American society, that each individual is to blame for the error of their ways because somehow they should have known. And hence it is their fault, their problem and their burden. It is the special genius of American culture to create a powerful sense of agency in people who are, as the sociologist C. Wright Mills observed, living at the painful intersection of history and biography.","url":"https://www.washingtonpost.com/outlook/how-the-new-economy-leaves-millennials-saddled-with-debt-and-doubt/2018/07/26/fc4ed854-7e0b-11e8-bb6b-c1cb691f1402_story.html"}
