{"authors":["Meara Sharma"],"date_download":"2018-10-21 03:30:39","date_modify":"2018-10-21 03:30:39","date_publish":"2018-07-20 17:41:36","description":"Eliza Griswold recounts a region’s health horrors in the face of corporate indifference.","filename":"data/vaneerConsumption/BookreviewofAmityandProsperityOneFamilyandtheFracturingofAmericabyElizaGriswold.json","image_url":"https://www.washingtonpost.com/resizer/W4kc-RZOkVTSutcfINyBGlepiaU=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/B5HSLMUMHII6RCXKQ3UIVZ3A3A.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_a-mothers-battle-to_8909848f60d9fbf16ca1922973ed81e7_d0cfeca6-7fbc-11e8-b0ef-fffcabeff946_story_1540092639.html","title":"Book review of Amity and Prosperity: One Family and the Fracturing of America by Eliza Griswold","title_page":"Book review of Amity and Prosperity: One Family and the Fracturing of America by Eliza Griswold - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Meara Sharma writes about culture and the environment.\nA fracking rig in 2012 in southwest Pennsylvania, which saw a natural-gas boom in the early 2000s. (MLADEN ANTONOV/AFP/Getty Images)\nIt is hard to imagine now, but there was a moment, in the late 1960s, when the environment wasn’t a partisan football but rather an intensely popular concern. Americans were dying from smog, oil spills were ruining beaches, rivers were catching on fire, and some 20 million people participated in the first Earth Day, in April 1970. In response to public pressure, Richard Nixon created the Environmental Protection Agency. “Restoring nature to its natural state is a cause beyond party and beyond factions,” the president said. “. . . Clean air, clean water, open spaces — these should once again be the birthright of every American. If we act now, they can be.”\nBut in time, the demands of industry turned the once-humane notion of environmental “protection” into big bad “regulation.” During his campaign, Donald Trump called the EPA “job killing,” a bloated bureaucracy that strangles progress. These buzzwords lodge themselves in the mind and lead to policy. But they’re also abstract. In her new book, “Amity and Prosperity,” journalist Eliza Griswold provides a deeply human counterpoint to this political fray. She takes on the decidedly fraught issue of energy extraction through a vivid, compassionate portrait of one family living in the long shadow of industry.\n(Farrar, Straus and Giroux)\nWhen Stacey Haney was looking for a house in rural Washington County, Pa., her main criteria were a well and good water. She grew up filling jugs from a neighbor’s pump or waiting for storms, and she didn’t want her two children to have to go through that. But she did want them to grow up on the land, so she found a farmhouse in the rolling hills near the town of Amity where the family could keep animals. A single mother, Haney managed on her nurse’s salary, but she needed a little more to build a barn.\nThe book’s title, “Amity and Prosperity,” refers to two towns in Washington County, the southwestern-most region of Pennsylvania, the borderlands of Appalachia. Amity, where Haney grew up, is a former steel-mill town where community is wholesome but precarious. In Prosperity, a village polluted by industrial coal mining, abandoned houses have been stripped for parts.\nFor generations, locals in this resource-rich region have endured extractive industries — coal, iron, oil — flowing in and out like waves, leaving trails of environmental and economic devastation behind. In the early 2000s, another boom promised to transform the area: hydraulic fracturing, better known as fracking, a process that shoots pressurized chemical fluid into the ground to release natural gas embedded in deep shale rock.\nHaney’s farmhouse sat atop such rock. When a company called Range Resources offers Haney and her neighbors bonuses and royalties in exchange for permission to frack on their land, Haney thinks she might finally be able to build that barn. She’s also intrigued by the idea that natural gas could give America energy independence and help revive her impoverished region. “These new leases sprang from the ground — a rare win in a place that had been losing for generations,” Griswold writes.\nBut the “win” soon sours. Massive trucks start rumbling by constantly, sending up dust that burns the Haneys’ eyes and catches in their throats. Haney’s son Harley develops a mysterious illness — stomach pains, canker sores, diarrhea — so bad he misses most of seventh grade. A rank smell (like bad “beef jerky”) blankets the farm. Sludge and black water spew from the taps. Range Resources tells her the water is fine; just boil it. Her neighbor’s horse dies from what appears to be arsenic poisoning. Then Harley is diagnosed with arsenic poisoning. Haney begins putting 2 and 2 together, and embarks upon a passionate quest to understand what is happening to her family and who is to blame.\nThe Haneys’ sick goat delivers a baby in three pieces. Harley becomes ashen and skeletal. Haney does her own tests on the air and water and finds carcinogens, as well as ethylene glycol — antifreeze. Range’s tests come back negative. It’s harrowing, observing Haney stretched increasingly thin as she struggles to keep her kids safe and accumulate evidence of harm. Members of her community doubt her, thinking she’s looking for money or just hysterical. She’s repeatedly disappointed by investigators from the EPA and Pennsylvania’s Department of Environmental Protection (DEP), who seem to vanish and then resurface as oil and gas industry employees. Her farmhouse becomes so unlivable that the family has to vacate. Miraculously, Haney persists, seemingly never breaking.\nGriswold chronicles these escalating horrors with disarming intimacy. She is a poet as well as a reporter, and her prose is lucid and distilled. Having spent seven years reporting this book, she’s able to render her characters with a novelistic fullness. It is particularly refreshing, given the glut of recent attempts to explain rural America, to read characters who are permitted nuanced and contradictory opinions, who despite health hazards cannot fully reject the industry that employs their neighbors, who may have heard in candidate Trump’s calls to gut the EPA a vindication, because the agency failed them when it mattered.\nInitially, Haney is against speaking publicly — she’s wary of being labeled an activist. But when a neighbor persuades her to share her family’s story at a community meeting on fracking, her journey takes a notable turn. She meets attorneys John and Kendra Smith, partners in law and life, who emerge as another set of heroes in the book. They take up Haney’s case, and those of her neighbors facing similar issues, with remarkable energy and tenacity. As they comb through stacks of raw data late into the night, scour legal history for the perfect arguments and front hundreds of thousands of dollars — all the while coaching their three kids’ sports teams — the book morphs into a cinematic legal drama.\nIn Griswold’s deft hands, the intricacies of interlocking cases and the slow work of legal research read like a thriller. The Smiths discover a litany of disturbing issues, including evidence that Range doctored test results to hide the presence of certain chemicals and that the company long knew the frack ponds were leaking poison. While building Haney’s case against Range, they also manage to break open the state’s pandering relationship with oil and gas companies, suing the DEP for withholding data from homeowners about contaminated water and successfully defending the constitutionally mandated environmental rights of Pennsylvanians before the state Supreme Court. It’s a whirlwind.\nTo ride along on Stacey Haney’s journey is to remember a core truth: “Exploiting energy often involves exploiting people.” Usually, it’s the people whose hardships are already manifold, who were told they’d be rewarded, who never wanted to put up a fight. While the Haneys and their neighbors eventually reach a settlement agreement with Range Resources, they have, in a sense, lost their lives. Youthful dreams reduced to ashes. Plans perpetually put on hold. Looming health issues. These are the casualties of reckless industry, of politics and greed and warped notions of progress undermining basic rights to clean air and water. These stories, chronicled with such grace and care in “Amity and Prosperity,” evince a shameful reality about what we are willing to protect and what we are not.","url":"https://www.washingtonpost.com/outlook/a-mothers-battle-to-save-her-family-from-frackings-environmental-poisons/2018/07/20/d0cfeca6-7fbc-11e8-b0ef-fffcabeff946_story.html"}
