{"authors":["John Domini"],"date_download":"2018-10-21 03:30:17","date_modify":"2018-10-21 03:30:17","date_publish":"2018-07-05 22:28:27","description":"John Domini recounts how women battled Mafia clans at great personal risk.","filename":"data/vaneerConsumption/BookreviewofTheGoodMothersTheStoryoftheThreeWomenWhoTookontheWorldsMostPowerfulMafiabyAlexPerry.json","image_url":"https://www.washingtonpost.com/resizer/8E5lumcMJLUbE_AZDroRAoykMzw=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RZ5DNRD7AYI6RMHP776KX37ZIY.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_facing-down-the-maf_03634199cc1d8d73afec65a6940838ef_2be650e4-5a06-11e8-8836-a4a123c359ab_story_1540092617.html","title":"Book review of The Good Mothers: The Story of the Three Women Who Took on the World's Most Powerful Mafia by Alex Perry","title_page":"Book review of The Good Mothers: The Story of the Three Women Who Took on the World's Most Powerful Mafia by Alex Perry - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"John Domini’s latest book is “Movieola!.” In 2019, he’ll publish his fourth novel, “The Color Inside a Melon.”\nA crowd attends the funeral of Lea Garofalo in Piazza Beccaria in Milan in 2013. After denouncing her ’Ndrangheta mobster husband and others, Garofalo attempted to reconcile — but was murdered. (Photo by NurPhoto/Corbis via Getty Images)\nDown in the toe of the Italian boot, in rustic Calabria, a criminal subculture thrives: The ’Ndrangheta, it’s called. If the word seems unpronounceable, that’s in keeping with this gang’s shadowy ways. In “The Good Mothers: The True Story of the Women Who Took On the World’s Most Powerful Mafia,” Alex Perry takes care to sound out the name: “un-drung-get-a.” The term derives from the Greek, the original tongue in what Perry calls a land of “hard beauty.” It means “society of men of honor and valor.”\nPerry’s book, however — an essential addition to the growing library on organized crime — puts the women, not the men, at the center of a story that is both harrowing and heartening.\nCalabria, when Perry begins his tale at the turn of the 21st century, remains “bandit country,” in the grip of the same mob families who ruled at the end of the 19th century. The machismo is deeply ingrained. Wives and mothers have nothing like the influence enjoyed by the fictional Carmela Soprano, whose husband’s associates have ties to Calabria. Rather, “the severity of the misogyny,” Perry writes, “prompted some prosecutors to compare the ’Ndrangheta with Islamic militants. Like ISIS or Boko Haram, ’Ndranghetisti routinely terrorized their women” in the service of “an immutable code.”\nMountains of illicit cash, largely from drugs, extortion and weapons smuggling, sustained the code. The economics of the syndicate are spelled out in the opening chapters, a grim accounting that runs to tens of billions of dirty euros. But Perry, while never lax about the bookkeeping, keeps the emphasis on matters of heart and conscience: the risks taken by a brave few Calabrian women. At great personal cost — the ultimate cost, in two cases — these women took down vicious clans and shattered the myth of Mafia invulnerability.\nOne of the women, Lea Garofalo, has achieved the status of martyr in Italy; there’s even a movie about her. Garofalo first denounced her mobster husband, as well as others, in 1996, then spent a dozen difficult years in witness protection with her daughter, Denise. In the end, the state let her down, failing to deliver on a better life, and Garofalo attempted a rapprochement with her old crowd. This ended in her disappearance — a lupara bianca, a “white shotgun,” in local parlance, although in her case it was strangulation and a bonfire (a change of plans from a vat of acid). Lea’s vanishing provides “The Good Mothers” with a suspenseful kickoff, her last days alive as observed by a teenage Denise. The mystery’s solution waits till the closing chapters. Thus human drama shapes the narrative; it ends with the daughter’s tearful farewell at a massive 2013 rally in the mother’s memory.\nStill, “The Good Mothers” is casting a wider net, indicting an entire pestilent culture. Another protagonist is the magistrate and investigator Alessandra Cerreti, southern Italian herself, with a lifelong dedication to fighting the Mafia. Like the others, she benefits from Perry’s deep research, so that a couple of the episodes featuring her have the moment-to-moment intensity of Garofalo’s final night alive.\nThe same is true of events involving a pair of other ’Ndrangheta women. These are Maria Concetta Cacciola, an abused wife who can’t take any more, and Giuseppina Pesce, who’s something else again; a character worthy of Elena Ferrante, Pesce has gotten her own hands dirty (though not bloody), yet while fearless about mob work, she’s a jelly donut when it comes to her kids.\nThe children, for all three “good mothers,” afford leverage for the bad guys. The women don’t do well under state protection; in a motel up north, with no one but cops for company, the old crowd down south starts to look appealing. The kids especially suffer, and one by one, the women cave, recanting their testimony and falling back into ’Ndrangheta clutches. The results aren’t always fatal, thanks in particular to Cerreti, but the sorry pattern creates a problem for the book, a touch of the predictable. The same quality sometimes afflicts the closing courtroom sequences.\nYet it’s good to go step by step, as Perry does, through the destruction of these clans. It’s good to linger over the women’s triumph, since theirs is but one battle in the war against what Perry calls a “global mafia.” So his book celebrates how a few heroes made a significant change for the better — in a “display of adamant and unyielding femininity.”","url":"https://www.washingtonpost.com/outlook/facing-down-the-mafia-and-misogyny-in-southern-italy/2018/07/05/2be650e4-5a06-11e8-8836-a4a123c359ab_story.html"}
