{"authors":["Jill Leovy"],"date_download":"2018-10-21 03:29:31","date_modify":"2018-10-21 03:29:31","date_publish":"2018-06-28 03:38:28","description":"Journalist Alfredo Corchado offers insight into the arc of immigration over the years.","filename":"data/vaneerConsumption/BookreviewofHomelandsFourFriendsTwoCountriesandtheFateoftheGreatMexicanAmericanMigrationbyAlfredoCorchado.json","image_url":"https://www.washingtonpost.com/resizer/vaedu2ulRRc7SgNYHKdhZbxRXyU=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/XEPQFDDU3II6RPNBDDSTUREKCQ.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_a-personal-perspect_9681bc9201ac675b493507c22423f1fc_54c82afa-7568-11e8-805c-4b67019fcfe4_story_1540092571.html","title":"Book review of Homelands: Four Friends, Two Countries, and the Fate of the Great Mexican-American Migration by Alfredo Corchado","title_page":"Book review of Homelands: Four Friends, Two Countries, and the Fate of the Great Mexican-American Migration by Alfredo Corchado - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Jill Leovy is the author of “Ghettoside: A True Story of Murder in America” and a senior fellow at the University of Southern California Annenberg Center on Communication Leadership & Policy.\nAsylum seekers from Central America get bus tickets in McAllen, Tex. last month. They were allowed to travel while awaiting hearings. (Photo by Jahi Chikwendiu/The Washington Post)\nBeneath the current headlines on family separation, a larger story of long-term population shifts is unfolding. Alfredo Corchado, a reporter with the Dallas Morning News, addresses what was once the most conspicuous portion of that shift — the diaspora from Mexico into the United States — in his timely new book about immigration.\nThough migrants from Mexico have lately been overshadowed by their counterparts from countries farther south, who are bearing the brunt of new “zero tolerance” policies at the border, Corchado offers broad insight into the arc of immigration over the years. His narrative makes clear that U.S. immigration policies have long been rife with contradictions and prone to backfire, and that migrations tend to proceed regardless, following their own highly complex logic. They are events with their own story line, with a beginning, middle and, perhaps, an end.\nThe latest story of Mexican migration spans about four decades, and this roughly coincides with Corchado’s career reporting from both sides of the border. In “Homelands” Corchado tells two stories at once — that of his life as a bicultural, naturalized American reporter and the larger saga of a migration surge that occurred at the same time.\nThe approach mostly works because Corchado’s personal reflections genuinely inform the broader issues. He rises in his profession as the exodus of migrants from Mexico into the United States hits its peak, and as he reaches middle age, we sense that the migration phenomenon is aging with him. Birthrates in Mexico plunge and the border tightens, reducing the flow of people moving north. Toward the end, Corchado returns to the Midwest meatpacking plants where he once met scores of Mexican laborers and finds Middle Eastern and African refugees instead. “We just ran out of Mexicans,” a poultry plant worker tells him.\nCorchado was brought to the United States in 1966, when he was 5, from the Mexican state of Durango. His father picked cantaloupes in California’s Central Valley as part of the bracero guest worker program, which, for more than two decades, beginning in the 1940s, allowed Mexican men to work in the United States legally on temporary contracts. Exploitative as the arrangement was — with its poor housing and dawn-to-dusk work — Corchado argues that it afforded the participants a dignity unavailable to later generations of immigrants who came illegally and that it was less ravaging for rural Mexico, since those left behind could count on the braceros to return.\nCorchado, his mother and his siblings were eligible for green cards, and he soon realized that Mexico existed for him only in impressions from childhood — memories of geraniums and parrots. By his teens, he spoke English, and when he tried to strum the songs of pop icon Juan Gabriel on his guitar, the Eagles sprang to mind.\nCorchado dropped out of high school but recovered his path when his family moved to Texas to open a restaurant. He enrolled in community college, and after the University of Texas at El Paso, he joined the El Paso Herald-Post. Recruited by the Wall Street Journal as part of a diversity initiative in 1987, Corchado relocated to Philadelphia. There, lonely and homesick, he found solace with the friends mentioned in his book’s subtitle.\nTwo are fellow Mexicans: David ­Suro-Piñera, a restaurateur who dreamed of introducing Americans to the urbane culture of Mexico through its incomparable cuisine and spirits, and “Primo” Rodríguez Oceguera, a Jesuit-educated human rights activist. The third is a Latino, New Mexico-born, Ivy League-educated lawyer, Kenneth I. Trujillo, who is “casually floating” in the mainstream in ways that elude the uneasy outsider Corchado.\nThe friends are regulars at Suro-Piñera’s restaurant, downing tequila after hours and arguing about the big questions of cross-border interactions. Corchado’s sympathies are with the political left, but in their late-night confabs, the foursome ranges across the ideological spectrum. Corchado, a budding free trader, is optimistic that American democracy and rule of law will boost both countries. But his activist friend wants to build a wall on the Mexican side to keep Mexicans in. “America is a myth,” he says.\nCorchado’s progressive leanings and preoccupation with cultural identity mercifully leave light traces on his narrative. Mostly, he reports rather than pontificates. Covering a Trump rally, he notes people of all colors in the crowd and finds a father and son who chat cordially with him. When the crowd chants against immigrants and journalists, Corchado, who is both, simply relates how it makes him feel: “scared s---less.”\nThough critical of the fickleness of U.S. immigration policy, Corchado also touches on the inconsistencies of Mexico — a nation where family is revered yet bigamy thrives, and where corruption thwarts investment. But he also insists on the sophistication of our southern neighbor. He recounts the belief of his friend Suro-Piñera that Mexico “was cloaked in elegance.”\nCorchado reminds us of the ever-present contradictions of U.S. immigration policy. After all, it was Ronald Reagan who approved amnesty for illegal immigrants and wanted to liberalize trade with Mexico, and Bill Clinton and Barack Obama who doubled down on deportations. The consequences of these efforts were mostly unintended, Corchado argues. Drug imports to the United States mushroomed with NAFTA, and after amnesty, which was supposed to slow migration, a flood of sponsored relatives of immigrants poured north. Meanwhile, in Mexico, a brutal drug war erupted, villages emptied, and even ­dietary habits were altered, unleashing a diabetes epidemic.\nAmong those most affected by these changes, he notes, were earlier U.S. migrants, who competed with newcomers for wages.\nContrarian impulses and nice phrasing keep the book interesting. Corchado detests social media, which says has weaponized journalism — allowing robot propaganda to manipulate voters — and he calls NAFTA a “loveless marriage.” Occasionally, he’s scathing, as when his lawyer friend seeks a medical-marijuana license. Corchado, whose previous book dealt with drug corruption, cringes. Legalization will push the Mexican cartels toward meth, heroin and bloodshed, he writes. But it’s the casualness of the shift that gets him. Americans’ drug fixation has visited untold horrors on Mexico, he writes bitterly. “And now — hundreds, thousands, tens of thousands of deaths later — Americans wanted their marijuana to be legalized.”\nCorchado’s stabs at poetic language sometimes fall short, and some digressions are confusing. But his book explains broad trends with engaging ease. He shows that the early movement out of Mexico was driven by environmental rather than strictly economic forces — Corchado’s family was fleeing drought — and that more recent migrants have been more concerned with finding safety than fleeing poverty.\nWhat’s clearest throughout is the extent to which sweeping global economic forces overwhelm the best-laid plans. His account suggests that no one, no government or corporation, has a grip on the broad changes that move populations and create identities.\nThose historical forces are still at work by the book’s end. Corchado reports that one of his brothers has done well in the United States as a delivery driver and has no worries that immigrants will take his job. But he still feels insecure. “How long before robots drive my truck?” he asks.","url":"https://www.washingtonpost.com/outlook/a-personal-perspective-on-mexicos-mass-exodus-to-the-united-states/2018/06/27/54c82afa-7568-11e8-805c-4b67019fcfe4_story.html"}
