{"authors":["Clifford Thompson"],"date_download":"2018-10-21 03:27:52","date_modify":"2018-10-21 03:27:52","date_publish":"2018-08-23 20:02:19","description":"Kwame Anthony Appiah seeks to inspire a rethinking of who we are.","filename":"data/vaneerConsumption/BookreviewofTheLiesThatBindRethinkingIdentitybyKwameAnthonyAppiah.json","image_url":"https://www.washingtonpost.com/resizer/H6aqx8pIRujkRCZXXba7dKmy__0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MG7VWRVHAEI6RF6OZSIEEJZPA4.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_myths-that-shape-our-notion-of-identity_2018_08_23_46d3430a-969a-11e8-a679-b09212fb69c2_story_1540092472.html","title":"Book review of The Lies That Bind: Rethinking Identity by Kwame Anthony Appiah","title_page":"Book review of The Lies That Bind: Rethinking Identity by Kwame Anthony Appiah - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Clifford Thompson’s nonfiction book “What It Is: Race, Family, and One Thinking Black Man’s Blues” will be published next year.\nIn his excellent new book, “The Lies That Bind: Rethinking Identity,” Kwame Anthony Appiah takes on an estimable, if — at first glance — naive pursuit. In an era of Brexit, the 2017 Charlottesville incident, and “I Really Don’t Care, Do U?,” Appiah hopes to inspire a rethinking of our restrictive and therefore divisive notions of who we are. But if that seems an impossible task, should the massive obstacles stop us from trying? Appiah, a professor of philosophy and law at New York University and the author of eight previous books, brings to the task a number of insights and the mind of a realist.\n“There’s no dispensing with identities, but we need to understand them better if we can hope to reconfigure them, and free ourselves from mistakes about them that are often a couple of hundred years old,” Appiah writes. “We are living,” he notes, “with the legacies of ways of thinking that took their modern shape in the nineteenth century, and . . . it is high time to subject them to the best thinking of the twenty-first.” He insists it’s time for such an examination because we now live “with 7 billion fellow humans on a small, warming planet,” and “the cosmopolitan impulse that draws on our common humanity is no longer a luxury; it has become a necessity.”\nAppiah devotes a chapter to each of the five bases of modern identity: creed, country, class, color and culture. In these areas, he writes, “we fall into an error . . . of supposing that at the core of each identity there is some deep similarity that binds people of that identity together. Not true, I say; not true over and over again.” In each area, Appiah details the ways a particular conception of identity is built not on solid ground but on shifting sands or, in some cases, pure illusion.\nHe begins with creed. At a time of ceaseless conflict between the radical Islamic fundamentalism represented by groups such as the Islamic State and the Judeo-Christian values of nations in the West, few things would seem to be more fixed and rigid than religious beliefs steeped in traditions dating back millennia. But as Appiah explains, traditions not only change — they survive by doing so, in response to the realities each generation confronts. That might suggest that religions deviate over time from rock-solid beginnings, except that a close examination of many of those beginnings reveals a fluidity of beliefs. In just one example Appiah cites, biblical scholars doubt that Saint Paul wrote the first of the Epistles to Timothy; for this and other reasons, there is room for debate about which books belong in that bedrock of Western civilization: the Holy Bible.\nAppiah also takes on the very concept of “the West” on the grounds that its meaning is alternately slippery and racist. During the Cold War, for example, the West meant the opposite of everything behind the Iron Curtain, making for a dichotomy that ignored most of the globe. Often, however, the West encompasses societies with little or nothing in common, even as it “delicately carves around nonindigenous Australians and New Zealanders and South Africans, so that ‘Western’ . . . can look simply like a euphemism for white.” The concept of “Western civilization,” Appiah writes, is “at best the source of a great deal of confusion, at worst an obstacle to facing some of the greatest political challenges of our time.”\nAppiah exposes cracks in the foundations of other fiercely defended sources of identity, such as nationality. While the dividing of land according to ethnicity may seem as old as land itself, it was only in the 19th century, the author maintains, that political movements attempted to bring national borders into alignment with identities of peoples, who had previously been defined more by culture and language than by location. He cites the example of Aron Ettore Schmitz — better known by the name under which he wrote novels, Italo Svevo — who was born in 1861 to a German father and an Italian mother in Trieste, which was part of the Austrian empire at the time of his birth but had become an Italian city by the time he died. Schmitz, the author writes, “was a citizen of one country who became a citizen of another without leaving home.”\nAppiah also explores the meaning of class. Status and wealth, two indicators of class, are not always linked, as demonstrated by the fact that “a penniless graduate student is differently situated from the janitor of his dormitory.” Appiah quotes the work of an American sociologist of the 1970s who “discusses a Boston pipefitter who makes twice as much as the schoolteacher next door: ‘when they meet, the pipe fitter calls the schoolteacher “Mister” and is called in turn by his first name.’ ” At the same time, Appiah finds that the apparatus with which America has sought to replace the class system — meritocracy — has instead entrenched that system’s worst features. Our supposed tendency to focus on talent and hard work rather than birthright may seem to be our escape route from the class system, until another tendency — the handing down of our success to our children — puts some ahead of others from the moment they’re born. The difference between a traditional class system and our so-called meritocracy, Appiah notes, is mainly that the latter is free of guilt, providing little argument or incentive for changing it.\nThe author takes issue with those who jealously guard the language and creations of their own cultures and regard the use of such cultural expression by others as theft. He argues that the sharing of culture elevates us all and is, in any case, inevitable; he also suggests that the very basis of cultural guardianship — the notion that any given creation is solely the work of one people — is itself suspect. We “should resist using the term ‘cultural appropriation’ as an indictment,” he writes. “All cultural practices and objects are mobile; they like to spread, and almost all are themselves creations of intermixture.” Once an object, concept or form of expression is introduced, it belongs to the larger world, and in some cases what might be called cultural appropriation certainly benefits society. The works of Aristotle might have been lost to us but for the commentaries of the 12th-century Muslim scholar ibn Rushd, also known as Averroes and frequently called “the Commentator,” whose works were in turn translated into Latin. In fact, as Appiah writes, “a good deal of what we now know of the texts of classical philosophy and how to read them we know only because that knowledge was recovered by European scholars in the Renaissance from the Arabs.”\nClosely related to the impulse to restrict cultural achievements to specific groups is the idea that certain groups are genetically disposed to certain kinds of achievement — a notion that exposes the mistakes of racism. With regard to race, Appiah notes, as have others, that while genes help determine one’s abilities, “those genes,” contrary to 19th-century ideas still embraced by some today, “are not inherited in racial packages.”\nHaving both acknowledged the necessity of identity and demolished some notions of it, “The Lies That Bind” has little specific to say about how to awaken the world to a more productive understanding of what makes up our identities. But perhaps that will be the subject of Appiah’s next book. In the meantime, if the solution to the fracturing of our world remains elusive, this book at least helps us think clearly about the problem.","url":"https://www.washingtonpost.com/outlook/myths-that-shape-our-notion-of-identity/2018/08/23/46d3430a-969a-11e8-a679-b09212fb69c2_story.html"}
