{"authors":["Gregory S. Schneider","Reporter Covering Virginia The Richmond Bureau","Greg Schneider Covers Virginia The Richmond Bureau. He Was The Washington Post'S Business Editor For More Than Seven Years","Before That Served Stints As Deputy Business Editor","National Security Editor","Technology Editor. He Has Also Covered Aviation Security","The Auto Industry","The Defense Industry For The Post."],"date_download":"2018-10-21 03:30:34","date_modify":"2018-10-21 03:30:34","date_publish":"2018-07-20 03:40:24","description":"Andrew Lawler delves into what happened to 115 early American settlers.","filename":"data/vaneerConsumption/BookreviewofTheSecretTokenMythObsessionandtheSearchfortheLostColonyofRoanokebyAndrewLawler.json","image_url":"https://www.washingtonpost.com/resizer/fupE3qwKCicHn6UFe2u_uMKsIEQ=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FFBL6GULMMI6RI2FUG7XQR5TOU.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_the-confusing-impos_19e1619e36e3a2b0ee4ce4318bb388dc_045eb2c0-4f19-11e8-84a0-458a1aa9ac0a_story_1540092634.html","title":"Book review of The Secret Token: Myth, Obsession, and the Search for the Lost Colony of Roanoke by Andrew Lawler","title_page":"Book review of The Secret Token: Myth, Obsession, and the Search for the Lost Colony of Roanoke by Andrew Lawler - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Reporter\nGregory S. Schneider covers Virginia from The Washington Post’s Richmond bureau.\nArchaeologists excavate a site known as Site X, in Bertie County, N.C., in 2015 (Nicholas Luccketti/First Colony Foundation via AP)\nThe lost colony of Roanoke Island will always be one of the weirdest episodes in American history. It has managed to stay in the news, off and on, for 431 years: the case of 100-plus English settlers vanishing in the woods and marshes of coastal North Carolina. But most Americans who know the basic mystery have no idea of the deep, tantalizing layers of strangeness that underlie almost every aspect of the tale.\nThings were off-kilter from the beginning. Sir Walter Raleigh had bankrolled a settlement for the shores of the Chesapeake Bay. But when the ship containing some 115 settlers arrived in the New World in July 1587, the captain and pilot mysteriously dumped them at Roanoke Island instead. Tucked behind today’s Outer Banks, the island was reachable through some of the most dangerous waters of the East Coast. The native inhabitants had already been insulted and mistreated by other Englishmen, so this wasn’t the most welcoming location.\nThe man Raleigh chose to lead the colony, John White, was an artist, not an explorer. He brought his pregnant daughter and her husband. A few weeks after landing, daughter Eleanor gave birth to the first English baby born in America, Virginia Dare. At which point White — who was supposed to be running things — sailed all the way back to England to ask for more supplies.\nHe didn’t return for three years. By then, the settlers were gone. There were intriguing clues to their whereabouts carved on a tree and a post, including the name of a nearby native village. But rather than check that out, White sailed again for England.\nAnd the colony has been lost ever since.\nIt’s human nature to wonder what happened to those men, women and children. Capt. John Smith tried to figure it out after arriving at Jamestown in 1607. But it seems that every effort to solve the mystery has spun out strange tendrils of its own.\nAndrew Lawler warns in his new book, “The Secret Token: Myth, Obsession, and the Search for the Lost Colony of Roanoke,” that Lost Colony fever is a kind of madness. Happily, that doesn’t stop him from plunging into the wild terrain of theories and conflicting evidence where so many others have disappeared. Lawler manages to do this in a clear-eyed way, conscious of whether he, too, is getting lost. He makes a good case that the search itself goes to the heart of what it means to be American. Plus, it’s just plain fascinating.\nAs a writer for Science magazine, National Geographic and Smithsonian, Lawler has a polished, pop-history writing style — informative without seeming dense, entertaining but not pandering.\nOne of the strengths of the first section of the book is its depiction of the civilizations that had already been clashing for generations when Raleigh sent out his settlers. Not only were the sophisticated nations of native peoples disrupted by European colonization, but the Spanish had explored and settled along the East Coast for decades before the English arrived. The city of St. Augustine, Fla., boasted 250 houses more than a century before any English colony could claim such a number.\nOne of Lawler’s most fascinating points — which he touches on too briefly — is that the English pirate Sir Francis Drake may have left a large group of formerly enslaved workers on the Carolina coast in the year before the Lost Colony. Drake had captured the Africans and native South Americans during a raid on the Spanish port of Cartagena. If he left them at Roanoke, as some accounts suggest, they would “form a mysterious other lost colony,” Lawler writes. “Their presence on Roanoke would mean that the bulk of the first permanent settlers of England’s initial New World colony were neither Christian nor European but North African Muslims as well as followers of West African and South American traditions.”\nLawler also does a good job conveying the strangeness of one of the central figures of the Lost Colony mystery: the wayward governor, John White. After describing White’s return to find the colony abandoned and no sign of his daughter or granddaughter, Lawler puts his finger on something that by now has been nagging at the reader. “The record White left behind has a hallucinatory quality unlike almost anything in early American literature,” Lawler writes. “Bonfires ignite as if by ghosts. There are footprints in the sands of a silent forest. . . . There is an otherworldly detachment to his tale, as if the governor were a disembodied witness rather than the main character in an emotionally wrenching journey.”\nHe’s right. White’s narrative seems like a surreal dream. It brings to mind another strange account of adventures: Edgar Allan Poe’s novel “The Narrative of Arthur Gordon Pym of Nantucket,” which reads as though written by someone who never traveled the seas and made it up as he went along. Possibly while taking laudanum.\nSo, what does it all mean? That’s part two of the book, where Lawler tries to mop up the historical mess with centuries of theories about what really happened. He roams from John Smith’s sighting of white children among the Indians, to the mid-20th-century craze for messages supposedly left on stones by Eleanor Dare, to the collection of misfits and competing scholars who toil away at the question today.\nIt’s frustrating stuff. Every idea that seems to have merit — complete with secret details discovered on ancient maps — either evaporates or remains unresolved. There have been intriguing recent developments, but we won’t spoil some of the book’s juicy tidbits.\nThough he presents himself as a skeptical arbiter who will hold any charlatans accountable, Lawler falls into the habit of ending chapters with suggestive cliffhangers. It works, for a while, but gets distracting.\nThe third and final section of the book aims for a cultural reckoning with the legacy of the Lost Colony. The heavier tone — who knew that Virginia Dare was once a symbol for white supremacists? — is a bit of a comedown after the crazy fun of the conspiracy theories.\nBut the themes of mingled races, of cultures clashing to create something new, are surprisingly fresh and powerful. The issues raised by the Lost Colony are still playing out. It’s a mystery in which all Americans have a stake.","url":"https://www.washingtonpost.com/outlook/the-confusing-impossible-mystery-of-the-lost-colony-of-roanoke/2018/07/19/045eb2c0-4f19-11e8-84a0-458a1aa9ac0a_story.html"}
