{"authors":["Jerry A. Coyne"],"date_download":"2018-10-21 03:32:48","date_modify":"2018-10-21 03:32:48","date_publish":"2018-08-24 01:10:18","description":"David Quammen argues another perspective on genetic inheritance.","filename":"data/vaneerConsumption/BookreviewofTheTangledTreeARadicalNewHistoryofLifebyDavidQuammen.json","image_url":"https://www.washingtonpost.com/resizer/TBUis8jilBo5MsrTmIqUZ2wUPKM=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CVMUJCVEUII6RLLPBADXBXG5YI.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_is-darwin-wrong-on-_0c6627251cb0e3df1bbc14e471b1e69b_cfb3374a-8f6d-11e8-8322-b5482bf5e0f5_story_1540092768.html","title":"Book review of The Tangled Tree: A Radical New History of Life by David Quammen","title_page":"Book review of The Tangled Tree: A Radical New History of Life by David Quammen - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Jerry A. Coyne is professor emeritus in the department of ecology and evolution at the University of Chicago. He is the author of “Speciation” (with H. Allen Orr), “Why Evolution Is True” and “Faith vs. Fact: Why Science and Religion Are Incompatible.”\nCharles Darwin’s sketch of the “Tree of Life” illustrates his theory that species evolved from a common ancestor. (Photo by Mario Tama/Getty Images)\nLong before he published “On the Origin of Species,” Charles Darwin jotted down his evolutionary ideas in pocket notebooks. One of the most famous of his notes is a drawing from 1837, not long after Darwin returned to England from the voyage of the Beagle. Below the words “I think” is his sketch of how new species could arise by a branching process — explaining how species are descended from a common ancestor. This was a revolutionary idea that remains central to evolutionary biology.\nKey to this idea is vertical inheritance. Traits are passed down from generation to generation: Your DNA comes from your parents, just as, on a larger time scale, humans and chimpanzees inherited their DNA from a common ancestor that lived about 7 million years ago. We can reconstruct the evolutionary past by comparing the sequences of this passed-down DNA because, occasionally, copying errors — mutations — occur between generations, so that within any lineage the DNA sequences change slowly over time. Because the human and orangutan DNA sequences had longer to accumulate differences than did the human and chimpanzee ones (15 million vs. 7 million years, respectively), the DNA of chimpanzees and humans is more similar than is the DNA of orangutans and humans. These comparisons are how we make evolutionary trees similar to Darwin’s.\nBut in his new book, “The Tangled Tree,” science writer David Quammen sees Darwin’s tree image as simply “wrong,” for inheritance may sometimes be horizontal. Imagine that a chunk of orangutan DNA somehow got incorporated into human DNA, perhaps transferred by a virus that first infected an orangutan and then a human. This would be horizontal, not vertical, transmission of DNA, or horizontal gene transfer (HGT). If you looked only at that one piece of DNA in comparing humans, chimpanzees and orangutans, you’d falsely conclude that orangutans are closer relatives to humans than are chimpanzees. The one transferred piece of DNA would be identical or, at least, very similar between orangutans and humans, suggesting that the two had a very recent common ancestor.\nQuammen is right that the horizontal transfer of genetic information does complicate our effort to understand the evolutionary past, but he goes too far in claiming that HGT essentially undermines any and all attempts to reconstruct the evolutionary past: “The tree of life is not a true categorical because the history of life just doesn’t resemble a tree.” Before accepting this radical conclusion, we must answer two questions: How in practice can horizontal genetic transmission occur, and how common is it?\nViruses are, in effect, genetic parasites that insert themselves into the DNA of other species. They can thus move their own genes from species to species, and sometimes they can also act as couriers, transferring DNA from one host species to another. More remarkably, more-complex species can simply incorporate genes from the environment. Microscopic rotifers, for instance, dehydrate in dry conditions; when they rehydrate, the absorbed water can contain bits of DNA from nearby species, so that the rotifer genome can become riddled with “found” DNA segments from groups like fungi and plants. This process of incorporating environmental DNA is also practiced extensively by microbes. Indeed, the vital feature of many approaches to genetic engineering is the willingness of bacteria to take on board and use pieces of foreign DNA. This allows scientists to “program” bacteria simply by inducing them to take up designer genes.\nHorizontal genetic transmission, then, can and does occur, especially among microbes. The second question is empirical: Is it so common, so rampant, that it prevents us from reconstructing the evolutionary family tree? Here it is useful to think of vertically transmitted DNA as providing the evolutionary signal, while horizontally acquired DNA in the same species is evolutionary noise, potentially obscuring the signal. When we look at the natural world, what do we see? Does noise drown out the signal? In terms of Quammen’s title, is the tree of life tangled?\nWhen it comes to microbes, where horizontal genetic transmission is common, reconstructing evolutionary trees is undeniably messy. But it’s not that messy. For instance, Quammen highlights the discovery in 1977 by biologist Carl Woese, the book’s central figure, of a major new group of organisms, the microbes placed into the domain of Archaea. Once considered to be regular bacteria like E. coli, Archaea, often denizens of extreme environments like hot springs and salty ponds, are genetically far removed from “true” bacteria.\nWoese pointed out that Archaea are so genetically distinct from the known domains of life that they should inhabit a third domain alongside the two traditional ones: the Eubacteria (regular bacteria like E. coli) and organisms like us with cells that have a nucleus (Eukarya). Woese’s revolutionary “Three Domain” idea depends upon our ability to accurately reconstruct the family tree of these groups. Yes, it’s messy — there’s plenty of noise there; but it’s not so messy that the signal — that Eubacteria, Archaea and Eukarya are distinct groups — is swamped. Thus Quammen’s thesis is contradicted by one of the important discoveries he highlights.\nHorizontal gene transfer is most common in microbes, but evolutionary reconstruction still works for them. We’ve therefore already answered our second question: When reconstructing the past, HGT noise does not overwhelm the evolutionary signal.\nBut what about the situation in complex, multi-celled species like our own? As we’ve learned from recent work, HGT is much less common here: You are far less likely than an E. coli to pick up and incorporate into your genome a piece of DNA you find lying about. However, these HGT events, often mediated by viruses, do occur in complex species. (Some of the key genes in the evolution of the mammalian placenta, for instance, were borrowed from a viral intruder.) But we can again ask the same question: Does HGT frequently obscure the evolutionary past? Let’s go back to our earlier example: a piece of orangutan DNA that’s been horizontally transferred to human DNA. If we base our evolutionary tree on that DNA segment, we will conclude, incorrectly, that humans are more closely related to orangutans than to any other species.\nNow consider a second, different DNA segment that has been horizontally transferred into human DNA from a weasel; analysis of this will suggest that our closest relatives are weasels. Finally, we take a third segment of DNA — a vertically transmitted one — that shows us to be most closely related to chimpanzees. Which of the three conclusions should we trust?\nThe solution is to investigate that question using many independent segments of human DNA. Let’s say we analyze 100 segments, finding one showing orangutans to be our closest relatives, one showing weasels and 98 showing chimpanzees. The conclusion: Our closest relative is the chimpanzee, despite the orangutan and weasel noise. And this, in fact, is the way evolutionary trees are constructed: Biologists use many genes that reflect the ancestry of populations and species, not the occasional gene transferred horizontally between distantly related groups.\nIn the end, Quammen provides us with a lucid guide to a lot of interesting science, but he overstates the impact of horizontal genetic transmission on our ability to reconstruct Darwin’s diversifying evolutionary tree. Today, that sketched-out tree of Darwin still looks good, even if, à la Quammen, we should add a couple of faint dashed lines showing HGT between its spreading branches.","url":"https://www.washingtonpost.com/outlook/is-darwin-wrong-on-how-we-pass-our-dna-from-one-generation-to-the-next/2018/08/23/cfb3374a-8f6d-11e8-8322-b5482bf5e0f5_story.html"}
