{"authors":[],"date_download":"2018-10-21 03:32:31","date_modify":"2018-10-21 03:32:31","date_publish":"2018-08-09 21:46:56","description":"John F. Ross recounts the impact on the American West of the soldier-explorer-geologist.","filename":"data/vaneerConsumption/BookreviewofThePromiseoftheGrandCanyonJohnWesleyPowellsPerilousJourneyandHisVisionfortheAmericanWestbyJohnFRoss.json","image_url":"https://www.washingtonpost.com/resizer/qCQh4dOGYHjgBuH2AA92XoGr7X0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KZJC4YU2N4I6RKGYTNGBGKDNNM.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_the-big-personality_d346ff61806abc597f62b2afb18db62a_673c8f5c-8475-11e8-8553-a3ce89036c78_story_1540092751.html","title":"Book review of The Promise of the Grand Canyon: John Wesley Powell's Perilous Journey and His Vision for the American West by John F. Ross","title_page":"Book review of The Promise of the Grand Canyon: John Wesley Powell's Perilous Journey and His Vision for the American West by John F. Ross - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Debra Bruno is the author, with Bob Davis, of “Beijing from A to Z: An Expat Couple’s Adventures in China.”\nIn 1869, John Wesley Powell led a successful expedition along the Colorado River through the Grand Canyon. (ERIC BARADAT/AFP/Getty Images)\nPicture this: Near starvation, barely clothed, banged up with gashes and bruises, a handful of men in three wooden boats undertake a journey down the Colorado River in 1869, not knowing what they would see around each bend or whether they would survive to tell the story.\nThe men didn’t even reach the beginning of the Grand Canyon until 74 days into their trip, after their remaining source of food — flour — got so wet they had to sift it through mosquito netting to get rid of the moldy lumps. It was about then that they faced a run of 360 whitewater rapids including, on one day, a 14-mile gauntlet of 35 rapids.\nThis ragtag group was led by a man with one arm.\nIf any man is the perfect subject for a new biography, it has to be John Wesley Powell. The Civil War hero who lost most of his right arm at the Battle of Shiloh and went on to be the first person to lead a successful boat expedition through the roaring Colorado River in the Grand Canyon makes for a great story.\nAnd that’s just what readers get in the first half of John F. Ross’s “The Promise of the Grand Canyon: John Wesley Powell’s Perilous Journey and His Vision for the American West.”\nYes, there have been several other comprehensive biographies of Powell, including Wallace Stegner’s “Beyond the Hundredth Meridian.” Stegner’s book, though, is at times overwritten and self-important, full of exposition and comparison, losing narrative momentum again and again. (Not to mention Stegner’s dated references: “Like a teasing woman the river dawdled, meandered, surprised them with new forms.”)\nRoss tells Powell’s story more powerfully, sprinkled with quotes from the explorer-geologist’s diary and a feeling of dramatic suspense — will he survive? — even though we know the outcome. The rip-roaring story of the one-armed veteran who risked life and (remaining) limbs to power through gorges and rapids, all while carefully recording evidence of the canyon’s ancient geology and gathering flora and fauna to take back East, never gets old.\nWhat makes the story more nuanced is that Powell didn’t seem to be especially likeable: didactic at times, refusing to dramatize his dramatic life, yet saddled with an almost reckless ambition. Disciplined. Bossy. Unbending.\nThat drive comes through before the young man is 30, when he led a battery into Shiloh, facing the bloodiest action so far in the Civil War, and got a musket ball through his forearm, which shattered the bones of his arm and hand.\nBefore antibiotics, amputation was the only real way to save a life. Powell’s arm was sawed off just below the elbow, leaving him with neuralgic pain for the rest of his life.\nIt didn’t stop him from pursuing his real passion: mapping the contours and lands of the American West, and cajoling, lobbying, arguing and talking his way into enough government and private funds to supply him with men, materials and time to explore.\nIt was also a way to prove himself. “He faced a lifetime of people patting him on his shoulder with a pitying look in their eyes,” Ross, a former editor of American Heritage magazine, writes. Add to that an ambition to finish what Lewis and Clark had started in their western explorations, along with plenty of naysayers arguing that exploring the Grand Canyon was both worthless and impractical.\nEven so, Powell had no idea what lay ahead. Long before the expedition’s three boats arrived at the beginning of the Grand Canyon, traveling through the canyons of the Green River in the territories of Wyoming and Utah, the group lost one boat, smashed to bits in violent rapids, its three men nearly lost over the falls.\nAnd although there is very little explanation of how Powell managed to hang on during these rapids, there is one comically terrifying moment when having just one arm was a major problem. Powell often used the free hours during their overnight camps to gather geologic evidence in the rocks that loomed over the canyons. In this case, Powell had scrambled to a point 800 feet above the river but realized he was stuck. If he lost his grip with his one arm, he’d fall. George Bradley, on the ledge above him, tore off his long-underwear bottoms and dangled them over the edge. It’s not clear that Bradley was wearing anything else.\n“Leaning backward, Powell let go and — while falling — grabbed the formless rag with his one hand. The underwear sagged and stretched, but miraculously held.” Bradley managed to swing Powell up to his ledge, proving that 19th-century clothes were better made than ours — and that it may be hard to have a sense of humor about being rescued by some stretchy woolens and a naked man. “In moments, characteristically without discussion, they resumed their climb,” Ross writes, missing his own chance to riff on this unforgettable scene.\nThe stories of Powell’s 1869 and 1872 expeditions have been told many times, but who can resist descriptions of Powell sitting on a chair bolted to the boat and bellowing arias from “The Marriage of Figaro” as they approached a rapid? The second half of “Promise” almost by definition loses the cliffhanging drama.\nPowell knew he had become a celebrity, and he used his influence to bring the West into the national consciousness, warning planners that “in a very few decades all the water of the arid region of the United States would be used in irrigation” and arguing that there just wasn’t enough to support every last farm. He went on to found the Smithsonian’s Bureau of American Ethnology and help found the U.S. Geological Survey and the National Geographic Society.\n“More perhaps than anyone else, he would shape the newly emerging American West and, in so doing, help cast the national identity,” Ross writes. “So much of what he preached — of limited water, of the threat of monopolies, of the importance of steady measurement and analysis, of the critical importance of topographical mapping and the indispensible role of federal science, and perhaps most broadly, of the necessity of ecological stewardship, remains presciently to the point, clearing the way for debates to the present day.”","url":"https://www.washingtonpost.com/outlook/the-big-personality-and-big-contributions-of-john-wesley-powell/2018/08/09/673c8f5c-8475-11e8-8553-a3ce89036c78_story.html"}
