{"authors":["Margaret Wertheim"],"date_download":"2018-10-21 03:32:12","date_modify":"2018-10-21 03:32:12","date_publish":"2018-08-09 21:43:06","description":"Anil Ananthaswamy takes on the “double-slit” experiment that challenges our sense of reality.","filename":"data/vaneerConsumption/BookreviewofThroughTwoDoorsatOnceTheElegantExperimentThatCapturestheEnigmaofOurQuantumRealitybyAnilAnanthaswamy.json","image_url":"https://www.washingtonpost.com/resizer/GF7-FhKBCk-FXxD5P1Zj9APrmJk=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MRQTFSU2MMI6RKGYTNGBGKDNNM.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_the-fascinating-que_7c83e084cb9e5d6ab62635709e8941d6_386a248a-85f3-11e8-9e80-403a221946a7_story_1540092732.html","title":"Book review of Through Two Doors at Once: The Elegant Experiment That Captures the Enigma of Our Quantum Reality by Anil Ananthaswamy","title_page":"Book review of Through Two Doors at Once: The Elegant Experiment That Captures the Enigma of Our Quantum Reality by Anil Ananthaswamy - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Margaret Wertheim is a science writer and author of books on the cultural history of physics, including “Pythagoras Trousers” and “Physics on the Fringe.”\nEvery so often, like cicadas that mass-hatch once in a decade, science books on a specific topic burst upon us in a flock. A few years ago, there was a horde of books about mathematical symmetry and the role it plays in the laws of physics. This year, we are being graced with a flock about quantum mechanics and the meaning it might have for our understanding of reality.\nWe have already in 2018 seen the publication of Adam Becker’s “What Is Real?” and Philip Ball’s “Beyond Weird” (out now in Britain and soon to be released in the United States), both reviewed in these pages. In 2017, we got Paul Halpern’s magisterial study, “The Quantum Labyrinth: How Richard Feynman and John Wheeler Revolutionized Time and Reality,” while next year we can look forward to acclaimed Caltech physicist Sean Carroll’s “Something Deeply Hidden,” about quantum mechanics and “the emergence of spacetime.” Now comes science writer Anil Ananthaswamy’s “Through Two Doors at Once,” which focuses on quantum conundrums by examining the history and many variations of its most canonical experiment, the “double-slit” experiment.\nIt’s not only physicists and science writers who are being inspired by things quantum. September sees the release of “Quantum Economics: The New Science of Money,” by mathematician David Orrell, which argues that our “money system has quantum properties of its own.” (Full disclosure, I’ve written a cover blurb for it.)\nThis year, the prestigious international Biennale of Sydney, which finished up in June, took as its theme “Superposition,” a central quantum term. As the exhibition’s curatorial statement explained: “Microscopic substances like electrons are said to be dualistic in nature: they paradoxically exist in the form of waves and granular particles simultaneously. The state of superposition lies across all conceptual levels: from different climates and cultures to views of nature and the cosmic orders . . . [to] the history of modern and contemporary art, and the meaning of abstractions.”\nMore than a century after its birth, quantum mechanics remains a source of fascination unlike any other field of science. Almost infinitely interpretatively malleable, its veins of mathematical symbolism and embodied wonderment can be minded by artists, physicists, philosophers and just about anyone with a sense of imaginative play. There is still no end in sight to the magic “quantum” contains, nor a consensus explanation for its mysteries.\nOne reason for the current spate of books is that experimental science has finally advanced to a state where arcane theoretical ideas about the quantum world can be put to the test. What we now know is that the quantum domain is even stranger, more intractable and more of an assault on common sense than hitherto imagined. The more we actually get to see of the quantum world, the less it seems to mesh with our visceral experience of the real, and the more we are left in the lurch about what “reality” is — or at least that part of reality where the smallest things reside.\nAnanthaswamy’s book guides us through the quantum lair by focusing on the double-slit experiment, in which a beam of light is passed through two thin slits in a piece of card, creating a ripple-like interference pattern on a screen. How hard could that be to explain?\nThe experiment predates the advent of quantum theory by 100 years and was first performed in 1801 by the English polymath Thomas Young. Young used it to demonstrate that light is a wave phenomena, thereby refuting Newton, who had believed it was a stream of particles. It turns out that light is both things at once, and the double-slit experiment allows us to see the wave- and particle-like nature not only of light but also of matter. Versions of the experiment have been performed with electrons, atoms and even molecules, showing that wave-particle duality is a ubiquitous feature of the world at the microscopic scale.\nSince the 1970s, and spectacularly in the past decade, sophisticated versions of the double-slit experiment have revealed that quantum dualism and its attendant specters haunt reality to its core. Recent versions conducted by Austrian physicist Anton Zeilinger, with light beams traveling more than 100 miles between the islands of La Palma and Tenerife, demonstrate that quantum particles can be “entangled” with one another, seemingly enabling communication between them faster than the speed of light. According to special relativity, that isn’t possible. But there it now stands as a brute embodied fact.\nExperimentalists like Zeilinger have entered territory truly hard for nonexperts to comprehend, and it’s extraordinary that they’ve been able to push things to this edge. Nothing like these experiments happens in the natural world. These are products of hand-made human craft. At a time when popular physics writing so valorizes theory, a quietly welcome strength of Ananthaswamy’s book is how much human construction comes into focus here. This is not “nature” showing us, but us pressing “nature” for answers to our increasingly obsessional questions.\nThe great puzzle, as Ananthaswamy stresses, is what is doing the waving in the wave aspect of the quantum world? The waves we see in the double-slit experiment are not a simple analog of water waves, for they represent patterns of information that play out over time as well as space. The mathematics describing these waves is the Schrodinger “wave equation,” also called the “wave function,” and to this day, no one can agree on what it means.\nOne interpretation, attributed to Einstein’s contemporary Max Born, is that the waves described are waves of probability mapping out the likelihood of where a particle might be found when we do a quantum measurement. The “Born interpretation” has been argued over ever since it was first proposed in 1926. Some physicists love it, others can’t stand it. Whatever your stance, it works in practice as a mathematical tool for calculating where and how often we measure particles to be found. Which is why it is so hard to dismiss.\nBut what are these probability waves? Do they physically exist? Are they just a useful calculating tool? Are they pointing us to deeper physics? These are the waves that quantum philosophers have been arguing about for a century and that have forced increasingly bizarre notions about reality, such as the idea that every time a quantum event happens, the universe splits into multiple, slightly different copies of itself. This “many worlds interpretation” of the wave equation is an extravagant — some say desperate — attempt to make sense of quantum waving-ness.\nAnanthaswamy sums up this philosophical debate neatly: “Is the wavefunction ontic (meaning it is something), or is it epistemic (in that the wavefunction represents our knowledge about something).” In other words, is the wavefunction a part of objective reality, or is it a subjective tool that we see and use, but ultimately just a descriptive device?\nAnanthaswamy ends his book without resolving these issues. And when so many people are so assuredly proffering answers, this is an honest, courageous move. Rather, he suggests, the double-slit experiment will continue to deliver surprises.","url":"https://www.washingtonpost.com/outlook/the-fascinating-questions-of-quantum-mechanics-that-perpetually-elude-answer/2018/08/09/386a248a-85f3-11e8-9e80-403a221946a7_story.html"}
