{"authors":["Shane Harris","Intelligence","National Security Reporter","Shane Harris Covers Intelligence","National Security For The Post. He Has Been A Writer At The Wall Street Journal","Foreign Policy","Other Publications. He Also Has Written Two Books","The Watchers"],"date_download":"2018-10-21 03:32:43","date_modify":"2018-10-21 03:32:43","date_publish":"2018-08-16 20:04:09","description":"Craig Unger argues that Trump may have given Putin information on Russian oligarchs’ activities in the U.S.","filename":"data/vaneerConsumption/BookreviewofHouseofTrumpHouseofPutinTheUntoldStoryofDonaldTrumpandtheRussianMafiabyCraigUnger.json","image_url":"https://www.washingtonpost.com/resizer/mmuYiZ2ius7McXITwBegYaCYZ0s=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PJ5QHKUWIAI6RAML5G3TJDGYPU.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_is-there-a-case-for_1581e429968500affaed6e315833b010_00578f1e-9440-11e8-80e1-00e80e1fdf43_story_1540092763.html","title":"Book review of House of Trump, House of Putin: The Untold Story of Donald Trump and the Russian Mafia by Craig Unger","title_page":"Book review of House of Trump, House of Putin: The Untold Story of Donald Trump and the Russian Mafia by Craig Unger - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Reporter\nShane Harris is a staff writer at The Washington Post. He covers intelligence and national security and the Russia investigation.\nProtesters outside the White House last month give their assessment of President Trump’s relationship with Vladi­mir Putin. (Photo by Michael S. Williamson/The Washington Post)\nOf all the allegations contained in the “Steele dossier,” the urtext of President Trump’s possible ties to Russia, one has long stood out as the most compromising, because it would be evidence of a political and business relationship between Trump and Russia that predated his campaign for the White House.\n“An intelligence exchange,” former British intelligence officer Christopher Steele writes, “had been running between” Trump’s team and the Kremlin, with the direct knowledge of Russian President Vladimir Putin. “Within this context Putin’s priority requirement had been for intelligence on the activities, business and otherwise, in the US of leading Russian oligarchs and their families. Trump and his associates duly had obtained and supplied the Kremlin with this information.”\nThe precise nature and location of that “intelligence exchange” have never been fully explained. But journalist Craig Unger thinks he may have found it, running out of the offices of Bayrock Group, a real estate development company that operated in Trump Tower in Manhattan in the early 2000s and partnered with the Trump Organization.\nBased on his own reporting and the investigative work of a former federal prosecutor, Unger posits that through Bayrock, Trump was “indirectly providing Putin with a regular flow of intelligence on what the oligarchs were doing with their money in the U.S.”\nAs the theory goes, Putin wanted to keep tabs on the billionaires — some of them former mobsters — who had made their post-Cold War fortunes on the backs of industries once owned by the state. The oligarchs, as well as other new-moneyed elites, were stashing their money in foreign real estate, including Trump properties, presumably beyond Putin’s reach.\nTrump, knowingly or otherwise, may have struck a side deal with the Kremlin, Unger argues: He would secretly rat out his customers to Putin, who would allow them to keep buying Trump properties. Trump got rich. Putin got eyes on where the oligarchs had hidden their wealth. Everybody won.\nThus Trump succeeded in business with Russia by what could most charitably be described as willful ignorance. Take the money. Don’t ask too many questions.\nAnd he’d had a lot of practice at that, Unger writes. Trump’s burgeoning real estate empire was fueled in the 1980s by another privileged class, Russian gangsters who appear to have used Trump properties to launder their ill-gotten gains, Unger alleges.\nIt is this nexus between Trump, Putin, and wealthy mobsters and oligarchs — often the same people — that is Unger’s fixation in his latest book, “House of Trump, House of Putin: The Untold Story of Donald Trump and the Russian Mafia.”\nThat subtitle is a bit misleading. There is much in Unger’s thoroughly researched narrative that has been told, including in the pages of The Washington Post. Close followers of the byzantine Trump-Russia saga will recognize many of the names and events that fill the pages of Unger’s book.\nAnd yet the story Unger weaves with those earlier accounts and his original reporting is fresh, illuminating and more alarming than the intelligence channel described in the Steele dossier.\nUnger believes that Trump was compromised by Russia as early as the 1980s, when the Russian money laundering through his properties probably began. “It’s hard to imagine Donald Trump had no knowledge whatsoever about what was going on,” Unger writes, as hundreds of millions in Russian investment flowed into Trump’s coffers. Trump evinced an “eagerness to turn a blind eye to practices that allowed the Russian mob to launder money,” Unger continues.\nThere’s never been a proven allegation that Trump was involved in or knew of money laundering through his businesses. But remember, Unger implores, Trump worked at the upper end of Manhattan real estate development. That’s not to say he engaged in organized crime, but he certainly knew what it looked like.\nThe richer Trump got, the deeper he sank into the Russian criminal underworld, which after the fall of the Soviet Union rose up to form the ruling class, now under Putin’s control.\nUnger spends much of his story connecting the dots between Trump and individual alleged Russian mobsters, such as David Bogatin, the pioneer of a gas tax scam, who bought five apartments in Trump Tower in 1984 for $6 million.\nNot all the connections run so directly. One famous gangster, Semion Mogilevich, who was renowned for his talent of making dirty money look clean, looms over the entire narrative like an orchestra conductor. Mogilevich, whom FBI agents have called the “boss of bosses,” directed the expansion of the Russian mob into the United States in the early 1990s. And although there is no definitive evidence connecting him directly to Trump, according to Unger, a mountain of facts places him in Trump’s corner of the real estate business.\nAs Unger tells it, Trump can’t be totally unaware of the criminality surrounding him, and even if he were, that ignorance is no defense. Trump allowed himself to become compromised by Russia, years before he seriously entertained running for public office.\nThe men who used Trump for their illicit purposes ensnared him. “They had ensured that he was beholden to Russia’s money, and its power,” Unger writes. “All largely unseen. With deniability.”\nThere is abundant evidence in Unger’s book that Trump made his business infrastructure — his condos, his developments, his very name — available to criminals and oligarchs trying to hide their ill-gotten gains, whether from tax collectors, investigators or the president of Russia. And that’s a form of collusion, too.\nUnger sees the Kremlin’s intervention in the 2016 presidential election, which U.S. intelligence officials have said was ordered by Putin himself, as the latest manipulation of Trump by Russia, and the most consequential. Again, readers will find no evidence that Trump knew of or participated in the Russian campaign, which every U.S. intelligence agency has concluded aimed to help Trump win.\nBut Unger is convinced that the Russians succeeded in their goal because they had a willing target, who seized on false news stories, propaganda and unflattering Democratic emails that Russia disseminated. Trump weaponized Russian disinformation without ever questioning its provenance. He even asked for more when he publicly told Russia to “find” Hillary Clinton’s personal emails.\n“Given Trump’s narrow victory in states such as Wisconsin, Pennsylvania, and Michigan — states that were predicted to vote Democratic but were won by Trump with a margin of less than 1 percent, and which put him over the top in the electoral college, it is more than likely that the Russian interference made the difference,” Unger writes.\nIf that’s true, then Trump the politician has replicated his business model with profound results: Both he and Putin have come out winners.","url":"https://www.washingtonpost.com/outlook/is-there-a-case-for-trump-putin-collaboration-years-before-the-campaign/2018/08/16/00578f1e-9440-11e8-80e1-00e80e1fdf43_story.html"}
