{"authors":["Amy Goldstein","Reporter Covering Health-Care Policy","Other Social Policy Issues","Amy Goldstein Is The Washington Post S National Health-Care Policy Writer. During Her Years At The Post","Her Stories Have Taken Her Homeless Shelters To Air Force One","Often Focused On The Intersection Of Politics","Public Policy. She Is The Author Of The Book","Janesville","An American Story."],"date_download":"2018-10-21 03:30:29","date_modify":"2018-10-21 03:30:29","date_publish":"2018-07-13 01:50:33","description":"Dan Kaufman explores how a rightward shift has swamped years of progressive policies.","filename":"data/vaneerConsumption/BookreviewofTheFallofWisconsinTheConservativeConquestofaProgressiveBastionandtheFutureofAmericanPoliticsbyDanKaufman.json","image_url":"https://www.washingtonpost.com/resizer/r5mtADzJXAXebtLq3kkCTjUQ9Cs=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UVR4JQEEQUI6RHUAIA5CEGKGU4.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_charting-wisconsins_047d09ceebdfed34ea8ff2efaea965f7_e92ea4ac-7302-11e8-9780-b1dd6a09b549_story_1540092629.html","title":"Book review of The Fall of Wisconsin: The Conservative Conquest of a Progressive Bastion and the Future of American Politics by Dan Kaufman","title_page":"Book review of The Fall of Wisconsin: The Conservative Conquest of a Progressive Bastion and the Future of American Politics by Dan Kaufman - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Reporter\nAmy Goldstein is a Washington Post national reporter and the author of “Janesville: An American Story.”\nDemonstrators gather inside the Wisconsin State Capitol on March 4, 2011, to protest Gov. Scott Walker’s attempt to push through a bill that would restrict collective bargaining for most public employees in the state. The bill passed. (Justin Sullivan/Getty Images)\nThe afternoon that Wisconsin’s Republican state senators rushed through “right to work” legislation, an ironworker and labor activist rose to his feet in the Senate gallery and shouted in protest. “This bill is turning Wisconsin into a banana republic,” Randy Bryce yelled out as state troopers closed in to remove him from the balcony.\nIt was the second day Bryce had taken off from a new job, forfeiting wages from unloading truckloads of steel beam to testify against the soon-to-be-law that forbade union contracts from compelling workers to pay dues — a strategy to undermine labor unions in the private sector four years after the state weakened union rights for most public employees. The day before, he drove to the capitol in Madison and, finding the hearing room already jam-packed, waited in the hallway with hundreds of fellow opponents until early evening. As Bryce’s time to testify finally neared, the chairman of the Senator Labor and Government Reform Committee, told that a protest would soon break out, abruptly ended the hearing and called for the vote.\nThis moment of political strife in the winter of 2015 is one of the dramatic high notes of Dan Kaufman’s “The Fall of Wisconsin,” an account of the sharp rightward shift lately in a state that, more than a century ago, was a taproot of the progressive movement. Bryce, a Democrat now running for the congressional seat that GOP House Speaker Paul Ryan is vacating, is the protagonist of Kaufman’s story. Depicted as a Mustang-driving, mustachioed everyman with ailing parents and bouts of unemployment, he is, in the author’s telling, heir to the tradition of Robert M. “Fighting Bob” La Follett Sr., a congressman, governor, senator and progressive presidential candidate who championed liberal reforms.\nJuxtaposing Wisconsin’s 20th-century history of progressive policies — think workers’ compensation and unemployment insurance — with its recent conservative bent, “The Fall of Wisconsin” is a timely if not especially original portrayal of a state that, arguably more than any other, illustrates the acrid political divide that besets the nation. The account shows Wisconsin’s polarizing current governor, Republican Scott Walker, benefiting from outside money and legislative blueprints to gain ascendency with policies that harm the environment, education and voting, along with union rights. Conservatives “have been wildly successful,” Kaufman argues, in “the transformation of Wisconsin into a laboratory for corporate interests and conservative activists, a process that continues unabated.”\nKaufman is a Brooklynite who grew up in Madison and has written articles from his liberal perspective about his home state, including a 2012 New York Times Magazine piece, “How Did Wisconsin Become the Most Politically Divisive Place in America?” Some of his book’s material is drawn from this and other pieces.\nMany readers may be unfamiliar with the events detailed in Kaufman’s book, though they were reported by the Wisconsin press as they unfolded. To those who have closely followed these goings-on, little here feels like a revelation. To his credit, the author did a lot of his own interviewing, though his prose would have benefited from fewer references to that fact. There are many interview mentions (“Over coffee at the tribal casino . . .”) that do little to add substance to his storyline. Kaufman introduces us briefly to a lot of people, some of whom never reappear in the pages.\nDespite his evident research, Kaufman commits small errors of fact. Protesters who heckled Ryan during a Labor Fest parade in his southeast Wisconsin hometown, Janesville, were not teachers, as Kaufman writes. I learned from my own book research that they were members of Wisconsin Jobs Now, a group funded by the Service Employees International Union. And Kaufman writes that the Parker Pen Company “closed its Janesville plant” in 2009. The last workers’ jobs actually ended the following year; by then, the factory had moved a mile from the company’s longtime Arrow Park headquarters and, after successive ownership changes, had not been called Parker Pen for years.\nThese are among minor factual defects. The book’s larger flaw is that Kaufman seems so eager to press his thesis from his own prismatic view that his story suffers from distortions by omission. He exaggerates Wisconsin’s centrality in the environmental movement’s origins by hanging that assertion mainly on a noted governor and U.S. senator, Gaylord Nelson, who founded Earth Day. And in arguing that Democrats have been anemic in the face of a unified conservative broadside, Kaufman faults President Barack Obama for not stepping in to help Milwaukee Mayor Tom Barrett try to win an unsuccessful recall election against Walker in 2012; Kaufman neglects to point out that, when Barrett won a Democratic primary less than a month before the recall vote, his real problem was that he was not the candidate unions preferred.\nAs for Kaufman’s central argument — that “Wisconsin’s dramatic transformation from a pioneering beacon of progressive, democratic politics to the embodiment of that legacy’s national unraveling” — it is true that the state in 1959 became the first to pass a law guaranteeing collective bargaining for public employees. So, Act 10, the surprise “budget repair” bill ending most of that guarantee that Walker unleashed just after taking office, was unwinding a piece of the Badger State’s history. But Kaufman obscures the reality that Wisconsin has long had political strength on both the right and the left. More than a half-century before Walker emerged, the state elected Sen. Joseph McCarthy, the rabid anti-communist. Until Donald Trump’s unexpected victory in 2016, Wisconsin had favored Democratic presidential candidates since the mid-1980s; but looking back to 1900, Wisconsin has voted about an equal number of times for Democrats and Republicans in presidential elections.\nThe only acknowledgement of this dual history comes in passing, as Kaufman is interviewing a conservation biologist and writer, who tells him that the state has alternated politically, with “these deep channels of Wisconsin political culture that weave back and forth.” Kaufman never makes the point in his own voice or in framing his argument. If he had, the rightward shift he documents would appear as a strong pendulum swing — not a repudiation of the state’s political tradition.\nThere are similar omissions regarding Bryce, the hard-hat union guy and congressional aspirant dubbed Ironstache. Only late in the story does Kaufman reveal that this “ordinary citizen,” as he calls him — who has insisted in interviews with other journalists and on his campaign website that he is not a politician — is a failed candidate from three previous attempts at elective office. And Kaufman makes no mention of Bryce’s Democratic primary opponent, a teacher who has attracted less notice but is regarded as a substantive candidate.\nMost striking, Kaufman tells us that he was with Bryce in New York at a fundraiser “at an East Village wine bar” and that “waiters in Los Angeles and New York recognized him.” Despite these brief observations, Kaufman never makes explicit that his protagonist has something in common with his conservative foes: While excoriating the Koch Brothers and their ilk for funding candidates on the right, the author does not explain that Bryce, too, has been relying on outside money — for 90 percent of his campaign contributions. Democrats nationally began last year to salivate at the notion of trying to knock off the GOP House speaker. Taken together, Californians and New Yorkers have donated nearly five times as much to Bryce’s campaign as have Wisconsinites, according to campaign finance reports not mentioned in the book.\nIn a quick reference to Ryan’s announcement this spring that he would retire from Congress, Kaufman leans on a claim that Bryce himself has advanced, writing that “there is little doubt that Bryce’s success” contributed to the House speaker’s “shocking decision” that he’d had his fill of Capitol Hill. Kaufman does not mention that the last polling for Ryan’s team suggested that, if he had run for an 11th term, he would have won a matchup against Bryce by 21 percentage points.\nIn his epilogue, Kaufman pivots. After lamenting all along that conservative forces are in control, unabated, he muses in his final paragraph that several people who oppose Walker’s agenda, Bryce chief among them, “might reclaim the state they knew and loved.”\nThe prediction belies his book’s internal logic, but it illuminates Kaufman’s hope for the state where he grew up.","url":"https://www.washingtonpost.com/outlook/charting-wisconsins-turn-from-progressive-politics-to-sharp-conservatism/2018/07/12/e92ea4ac-7302-11e8-9780-b1dd6a09b549_story.html"}
