{"authors":["Robin Marantz Henig"],"date_download":"2018-10-21 03:32:30","date_modify":"2018-10-21 03:32:30","date_publish":"2018-08-09 21:49:51","description":"Peter Lovenheim seeks to unlock the mysteries of our behavior.","filename":"data/vaneerConsumption/BookreviewofTheAttachmentEffectExploringthePowerfulWaysOurEarliestBondShapesOurRelationshipsandLivesbyPeterLovenheim.json","image_url":"https://www.washingtonpost.com/resizer/3qyX1iGpzD3DuWcpY8Ha6WzOJe0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VACJCPUZSYI6RBB3G3QXP4YIDQ.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_want-insight-into-y_025fae76e9cdd60b2fa35075f4962fc8_27e0a0d8-8f5f-11e8-8322-b5482bf5e0f5_story_1540092750.html","title":"Book review of The Attachment Effect: Exploring the Powerful Ways Our Earliest Bond Shapes Our Relationships and Lives by Peter Lovenheim","title_page":"Book review of The Attachment Effect: Exploring the Powerful Ways Our Earliest Bond Shapes Our Relationships and Lives by Peter Lovenheim - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Robin Marantz Henig is the author of nine books, including “Pandora’s Baby” and, with her daughter, Samantha Henig, “Twentysomething.”\nOkay, I’ll admit it right off the bat: I took the quiz. Who can resist a quiz in the back of a book that promises to unveil unparalleled insight into how your marriage, friendships, love affairs and every other relationship will unfold? Find out your attachment style, according to journalist Peter Lovenheim’s “The Attachment Effect,” and you’ll understand all sorts of relationships in your life: with bosses and co-workers, with teammates and coaches, with spouses and children, even with politics, illness and God.\nSo I spent 20 minutes taking the quiz, only to find that my attachment style is . . . preoccupied? That’s not even one of the three basic styles first laid out in the 1960s by John Bowlby, the British psychologist who invented attachment theory. (Bowlby focused mostly on attachment states, but it turns out the quiz looks at traits as well.) According to Bowlby, the way your primary caregiver responds to your needs in the first two years of life — sensitively, erratically or not at all — determines whether you grow up securely, anxiously or avoidantly attached. That relationship with your first caregiver becomes the template against which all your subsequent relationships are formed.\nTake people with the avoidant attachment style, who Lovenheim explains “tend to deny their feelings about a threatening situation — be it illness, job loss, or grief — and rather than rely on others to help, they will be inclined to try to fix it themselves.” If that sounds a bit like the vague, something-for-everyone language of astrology, that’s because a lot of the book feels like a horoscope, with attachment style filling in for a Zodiac sign.\nThis book began six years ago, the author tells us, when he was in his late 50s and stumbled on Bowlby’s attachment theory in his daughter’s college psych textbook. He decided to investigate, hoping it would help him understand why the romantic relationship he was in at the time was so volatile. His mother had not been especially nurturing — maybe that explained things? She was a polio survivor who apparently took to bed after the birth of her third child, leaving Lovenheim to the care of his father and a nanny, who was fired on the advice of the child psychiatrist his parents consulted when Lovenheim was 3. “This child doesn’t know who his mother is,” the shrink said. “You have to get rid of the nanny and be the mother.”\nAs Lovenheim sets out to investigate his own attachment style, he travels to a lecture hall at the University of Rochester, an MRI scanning lab at the University of Virginia, the Boston office of former presidential candidate Michael Dukakis and more. You have to admire his persistence and ingenuity, as he tries to make the case that attachment style affects people in every aspect of their lives.\nHe acts as matchmaker between a pretty young student in his creative-writing class at the Writer’s Center in Bethesda, whose attachment style, according to the same quiz I took, is “insecure anxious,” and a good-looking guy whom he calls “a poster child for secure attachment” — literally, because of the young man’s appearance in a widely used training video made when he was 3 years old. This slightly creepy experiment ends with a second date and then, basically, a shrug. As the pretty student put it, “This was all an experiment, so no love lost.” But to the reader, the whole thing reads like one more bit of evidence that trying to use attachment style as an explanation for everything can be a Procrustean task.\nThat’s how it feels in the chapter on politics, too, when Lovenheim travels to Dukakis’s office to administer the Adult Attachment Interview, which will then be scored by an expert. Dukakis is a good sport about it, but I feel bound to report that his attachment style is “insecure avoidant,” not an especially flattering look. Lovenheim thinks that avoidant attachment, which is found in about one-quarter of adults, is probably overrepresented among politicians. He offers no hard data, just the observation that avoidants are, among other things, “reluctant to trust others — a trait that could confer an additional advantage in a field seemingly rife with double-dealing and betrayal.” Oddly, though, he manages to write nearly 20 pages on attachment style and politicians with only a single — and singularly unenlightening — paragraph about our current president.\nSometimes Lovenheim comes up with interesting research, such as links between attachment style and pain. “In various studies,” he writes, “those with attachment insecurity — both anxious and avoidant — reported more intense pain during the early stages of labor, greater suffering after whiplash injuries, and more severe headaches after performing a distress-inducing task than those with secure attachment.”\nSimilarly, regarding friendship, “in various studies, friends with secure attachments compared with those with insecure attachments have been found more willing to self-disclose (but to do so appropriately), more comfortable with emotional intimacy, more trusting and trustworthy, better able to commit to a friendship, better able to have smoother and more stable interactions with friends, better conflict resolution skills, and overall greater satisfaction with their friendships.”\nBut attachment styles apparently can be changed over the course of a lifetime, which seems to undermine the book’s whole argument. If you can change your attachment style by having a meaningful relationship with a teacher, relative or other adult, combined with “deep reflection” later in life, either through therapy or on your own — well, if all that can happen, doesn’t that mean that the attachment style you develop in your first two years of life isn’t all that determinative? And if that’s true, why work so hard to draw a line between attachment style and relationships throughout a lifetime?\nI believe Lovenheim is sincere in his belief that discovering something about his own attachment style (which, by the way, is deemed “earned secure”) helped him, among other things, deal with the sudden death of his beloved older sister and to finally find a happy romantic relationship “with a woman with — of all things! — secure attachment.” He seems like a nice guy, and I’m glad his story has ended happily. But he hasn’t made a convincing case that attachment style — for his story or for others’ in this book — had all that much to do with it.","url":"https://www.washingtonpost.com/outlook/want-insight-into-your-relationships-study-your-first-two-years-of-life/2018/08/09/27e0a0d8-8f5f-11e8-8322-b5482bf5e0f5_story.html"}
