{"authors":["Steven V. Roberts"],"date_download":"2018-10-21 03:29:26","date_modify":"2018-10-21 03:29:26","date_publish":"2018-06-28 19:20:24","description":"A collection of essays imagines an alternate history of sports and its impact on the nation.","filename":"data/vaneerConsumption/BookreviewofUponFurtherReviewTheGreatestWhatIfsinSportsHistorybyMikePesca.json","image_url":"https://www.washingtonpost.com/resizer/Nrv9POw8tNxbOnNKDNErKa_h4sk=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VP5XJRTYX4I6RAF6NUZODAVDXQ.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_what-if-nixon-had-e_852560ea880c96b1cb253b9e74217108_ab67107c-6b60-11e8-bea7-c8eb28bc52b1_story_1540092566.html","title":"Book review of Upon Further Review: The Greatest What-Ifs in Sports History by Mike Pesca","title_page":"Book review of Upon Further Review: The Greatest What-Ifs in Sports History by Mike Pesca - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Steven V. Roberts teaches politics and journalism at George Washington University.\nThe New York Yankees’ Bucky Dent hits a three-run home run against the Boston Red Sox on Oct. 2, 1978, during the seventh inning of a one-game playoff for the American League East title in Boston. (Ray Stubblebine/AP)\nWhat if? What if Bucky Dent’s home run over Fenway’s Green Monster, leading the New York Yankees to the 1978 American League East title, had gone foul? What if Muhammad Ali had gotten a draft deferment as a conscientious objector? What if Richard Nixon had been good at football?\nThese are a few of the intriguing questions posed in this collection of 31 essays edited by Mike Pesca, a former sports reporter for NPR. It’s a clever premise, and as New Yorker writer Malcolm Gladwell notes in a foreword: “Counterfactual history is, in a way that real history is not, a true test of the imagination. . . . The what-if forces us to think.”\nAt their best, these essays are genuinely thought-provoking. But as with any collection, the contributions are wildly uneven. Jesse Eisenberg, who played Mark Zuckerberg in the movies, proves he’s a better actor than he is a writer, offering a dollop of witless whimsy about a childhood letter he wrote to basketball star Dan Majerle. And a piece by Jon Bois of the sports news website SBNation, “What If Basketball Rims Were Smaller Than Basketballs?” is plain silly.\nSome of the fantasies are delightful, however. L. Jon Wertheim of Sports Illustrated asks, “What If There Had Always Been Sports PR Flacks?” and produces an edited version of Lou Gehrig’s famous farewell speech, which includes the line, “I consider myself the luckiest man on the face of this Earth.” Homogenized by corporate communications, the “luckiest man” phrase is edited out because it “may be a touch arrogant.” As for Vince Lombardi’s timeless adage, “Winners never quit and quitters never win,” the Green Bay Packers front office issues a statement saying, “Coach Lombardi apologizes to any quitters he may have offended.”\nWriter Stefan Fatsis’s amusing riff on Dent’s dinger offers an alternative ending: The Red Sox win the game and the title, and the result is a reversal of fortune for both teams. The Sox, not the Yanks, become the Evil Empire, “a corporation, as dominant and as personable as IBM,” leaving fans with “nothing lyric left to love [or] to moan about the way they once did.”\nThe best essays are serious attempts at counterfactual history that take a pivot point in the national narrative and examine it from a different and illuminating perspective. A fine example comes from Princeton historian Julian E. Zelizer, who contemplates the impact of Richard Nixon’s ineptitude at football, which the future president played — badly — at Whittier College. “A change in Nixon’s football fortunes might have set American political history on a different trajectory,” he writes. “At the most obvious level, a robust football career might have pushed Nixon away from an interest in politics, a combative arena in which he very much hoped to demonstrate the manful prowess he lacked on the football field.”\nZelizer digs deeper, however, positing that Nixon’s athletic futility helped shape his flawed character. A man who succeeded at sports might have been “imbued with a self-worth derived from bona fide achievements on the fields of play in his youth.” Instead his failure produced an insecure, even paranoid, personality and taught “the grim lesson that he had to be ruthless to get by.” As Zelizer concludes: “The Nixon we got was never the star, never even the starter. He was the tackling dummy. He was cannon fodder, the victim of constant beatings and humiliation. And for that we all paid the price.”\nLeigh Montville, who has written for the Boston Globe and Sports Illustrated, examines the career of Ali, the heavyweight champion who became a heroic symbol of antiwar sentiment and racial pride after refusing to join the Army in April 1967. That defiance triggered his banishment from boxing at the height of his prowess, and Montville asks: “How many more victories might he have accumulated? How much more history could he have made?”\nAnd yet, Montville insightfully points out, without his martyrdom Ali would have been just another athlete, not a cultural icon. The draft board’s decision cost him victories inside the ring but amplified his voice outside it. If his deferment had been granted, writes the author, “the rest of Ali’s career would have been perfunctory, simply about boxing. He would have made noise, no doubt, showman that he was, but it wouldn’t have been the same important noise. The bite, the edge, would have been gone.”\nSeveral of these essays focus on race and gender and the reluctance of organized sports to move away from its white male paradigm. Mary Pilon, who has written for the New Yorker and Bloomberg Businessweek, assesses the impact of Title IX, the federal law mandating equality in college athletic programs. “Even the slightest amount of sports participation among young men and women,” she writes, “instills a sense of self-esteem that is applicable to other arenas. Though without a Title IX you can strike the ‘and women’ part from that last sentence.”\nAuthor and historian Claude Johnson unearths the story of the New York Rens, an all-black basketball team in the late 1940s, when pro hoops was an obscure hodge-podge of competing leagues and mismanaged teams. The Rens lost the “World Championship” game in 1948 to the Minneapolis Lakers when their star center, Nat “Sweetwater” Clifton, threw an errant pass on a fast break that could have tied the score in the final seconds. If Clifton made the pass and the Rens won, the team probably would have been included in the National Basketball Association, which was formed the next season. “The league’s racial integration would have unfolded at a quicker and smoother pace,” writes Johnson. “Dozens of forgotten African-American ballers would have made the grade or arrived much sooner.”\nSo what if this book had never been published? Readers would be deprived of many resounding base hits. And a few real foul balls.","url":"https://www.washingtonpost.com/outlook/what-if-nixon-had-excelled-in-college-football-what-if-ali-hadnt-been-banished/2018/06/28/ab67107c-6b60-11e8-bea7-c8eb28bc52b1_story.html"}
