{"authors":["Alexis Coe"],"date_download":"2018-10-21 03:30:24","date_modify":"2018-10-21 03:30:24","date_publish":"2018-07-13 04:12:56","description":"Joyce Lee Malcolm strives to understand the personality and times of America’s first traitor.","filename":"data/vaneerConsumption/BookreviewofTheTragedyofBenedictArnoldAnAmericanLifebyJoyceLeeMalcolm.json","image_url":"https://www.washingtonpost.com/resizer/2CjPNwqvXHPS_2RpuRTKY-p3eVo=/1484x0/www.washingtonpost.com/pb/resources/img/twp-social-share.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_what-drove-benedict_2a5b88966bf5cf8ac27b30177795bfc4_0dbb97c6-6b47-11e8-bea7-c8eb28bc52b1_story_1540092624.html","title":"Book review of The Tragedy of Benedict Arnold: An American Life by Joyce Lee Malcolm","title_page":"Book review of The Tragedy of Benedict Arnold: An American Life by Joyce Lee Malcolm - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Alexis Coe is the author of a forthcoming biography of George Washington called “You Never Forget Your First,” and “Alice+Freda Forever: A Murder in Memphis.”\n‘I wish it had been my heart,” the wounded soldier cried out on a late afternoon in 1777. The bullet had, instead, shattered his leg during the second and final battle at Saratoga, a crucial victory for the Continental Army. The soldier was just 36, a widower with three young sons at home. He had fronted his fortune for the patriot cause, even though he was a moderate, and was one of the most impressive officers on either side during the Revolutionary War, despite having enlisted without any military training.\nHad the British officer who shot him aimed higher, the soldier would have surely died a hero. The nation would have erected monuments in his likeness, named military bases after him and sung ballads about his daring feats on the field of battle. (He was known to charge first himself, inspiring his men to follow his lead whether he called for them or not.) Had he died a year into the revolution, he would never have been dumped in Albany, N.Y., where he endured a painful and lengthy hospital stay while Gen. Horatio Gates — who could not even see the battlefield at Saratoga, because that would have required that he leave his tent — took credit for the remarkable victory.\nAnd if that hadn’t happened, he might not have betrayed the patriot cause, nor would his clearly innocent wife, Peggy, be widely regarded as a temptress to rival Eve. Benedict Arnold would never have earned the name that turns you against him at first glance.\n“Since the fall of Lucifer,” Nathanael Greene, a general in the Continental Army, wrote after the Revolutionary War, “nothing has equaled the fall of Arnold.”\nJoyce Lee Malcolm knows this story, and yet she has embraced the thankless, if not Sisyphean, task of contextualizing America’s first traitor in her new and aptly named biography, “The Tragedy of Benedict Arnold.” “The aim is not to condone Arnold,” she assures readers in the introduction, “but to understand why a man who had risked everything for the patriot cause took that desperate decision to turn against it, earning not the success he had hoped for, but lasting opprobrium.”\nTo understand how Arnold the hero became Arnold the turncoat, we must consider the moderates, an overlooked segment of the early American population who were neither patriot nor loyalist but rather neutral (or, like the prominent Americans who rode out the war years as profiteers, something altogether different). And we must take a good hard look at the American Revolution, as Holger Hoock did so convincingly last year in “Scars of the Independence,” and admit that it wasn’t exactly the democratic lovefest we read about in grade school. The Marquis de Lafayette complained to George Washington that there were “parties [in Congress] who hate one another as much as the common enemy,” and he was not being hyperbolic. The revolution should be taught as America’s first civil war: violent, partisan and, for a sizable part of the country, by their own fault or none at all, ruinous.\nMalcolm, a professor at George Mason University School of Law, is no revisionist. That victorious lot has already come and gone, shaping the perception of Arnold as the most infamous man in American history, rotten to the core, altogether different than the high-minded patriots who nobly rose up in total uniformity against a tyrannical ruler. In a brief historiography, Malcolm points to Jared Sparks’s 1835 biography, “The Life and Treason of Benedict Arnold,” as setting “the tone for this wholesale blackening of Arnold’s entire life,” in which “no tale of Arnold’s sinfulness as a child [is] too bizarre to be believed.” As Sparks tells it, Arnold had all the markings of a sociopath; his pasttimes included snatching baby birds out of their mothers’ nests “to maim and mangle.” Sparks, who would go on to become the president of Harvard, took the opposite approach with Washington, sanitizing his papers when he should have been editing them. He successfully reduced both men to two dimensions — God above and Lucifer below.\nWashington and Arnold were different, to be sure, but Malcolm enables readers to see the very real similarities between the two men. Washington receives much sympathy from historians over the loss of his father and how it deprived him of a carefree boyhood: He became the head of his mother’s house far before 18 and received none of the opportunities afforded to his elder half-brothers, including boarding school in London. Arnold’s early tale of woe — that he was yanked out of boarding school when his alcoholic father’s business collapsed and that he was forced to give up college for an apprenticeship — has often been used to point to the origin of personal bitterness. Malcolm does well to delay that point until the revolution, when Arnold’s grievances are as plentiful as they are verifiable. Instead of playing psychiatrist, she does the work of scholarship, writing that “the loss of his mother [at 18] was a terrible blow” and acknowledging, not as praise but as fact, that Arnold “immediately assumed responsibility for the care of his father and sister,” even arranging his mother’s funeral and writing, on her gravestone, “a pattern of patience, piety, and virtue.”\nOnce young Washington and Arnold entered the world of men, they became obsessed with honor and found success on the battlefield. Both were extremely sensitive to slights, and neither was much of a natural or studied orator, lacking the education afforded to so many of the founders.\nFrom there, though, they differ significantly. Arnold bragged about his beautiful wife’s prowess in bed and complained constantly, calling his doctors in Albany “ignorant pretenders” and politicians far worse. All successful military men were micromanaged and court-martialed by a Continental Congress that fundamentally distrusted them, fearful that the national heroes would emulate Oliver Cromwell and seize power.\nBut while Washington learned to hold his tongue, Arnold never did. He accused Congress of “stamped ingratitude as a current coin” and made his displeasure known when lawmakers, before reimbursing Arnold (less than he thought fair) for the fortune he had staked to train and outfit his men, painstakingly audited his account of public funds during military campaigns. He was summoned before what Malcolm describes as “more of a kangaroo court than impartial military tribunal,” judged by his “enemies and friends of enemies.” They blocked his best witness, only to call his protests “illegal, illiberal and ungentlemanlike.” When Congress demanded that Arnold apologize, he refused, offering instead to duel — and that was one of his better hearings.\nArnold was strongly disliked long before he bore the mark of Cain, and the years he spent in England and Canada after his fall from grace were no different. Americans unified around his vilification, the British never trusted him, and a spate of Arnold biographies in the past decade have failed to tempt readers to reconsider him as anything but destined for treason. “The Tragedy of Benedict Arnold” benefits from Russell Lea’s collection of Arnold’s war correspondence, published in 2008, and a relatively recent discovery of a cache of primary sources in Quebec.\nMalcolm has written a fine biography — the best in recent memory, in fact. But what Arnold really needs now is a miracle. Or a Lin-Manuel Miranda.","url":"https://www.washingtonpost.com/outlook/what-drove-benedict-arnold-to-give-up-the-patriot-cause-and-turn-treasonous/2018/07/13/0dbb97c6-6b47-11e8-bea7-c8eb28bc52b1_story.html"}
