{"authors":["David Greenberg","David Greenberg Is A History Professor At Rutgers University. His Books Include","Republic Of Spin","An Inside History Of The American Presidency","Nixon S Shadow","The History Of An Image."],"date_download":"2018-10-21 03:30:22","date_modify":"2018-10-21 03:30:22","date_publish":"2018-07-13 03:47:22","description":"Dan Pfeiffer, Obama’s former communications director, combines lighthearted memories with media critiques.","filename":"data/vaneerConsumption/BookreviewofYesWeStillCanPoliticsintheAgeofObamaTwitterandTrumpbyDanPfeiffer.json","image_url":"https://www.washingtonpost.com/resizer/QIxxzxeIo755IQY-YT_NJUTexVY=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/XMSSCCBUMUI6FEXQJFVPECF7EM.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_a-breezy-memoir-on-_63439a535732e13528f320ba9bf3461d_a51ef03c-8239-11e8-b851-5319c08f7cee_story_1540092622.html","title":"Book review of Yes We (Still) Can: Politics in the Age of Obama, Twitter, and Trump by Dan Pfeiffer","title_page":"Book review of Yes We (Still) Can: Politics in the Age of Obama, Twitter, and Trump by Dan Pfeiffer - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"President Barack Obama celebrates election night in Chicago in 2012. (Nikki Kahn/The Washington Post)\nAfter a president leaves office, there’s a certain eagerness to harvest the memoirs of administration officials that sprout like crocuses — or maybe toadstools — in the post-presidential soil. We look forward to the reminiscences and reflections, the disclosures and the dish, the settling of scores and the priming of histories yet to be written. But this season’s spate of Obama look-backs feels oddly joyless. For the roughly 50 percent of America that sorely misses our last president, the ritual exercise of revisiting his rise, struggles, triumphs and failures is more likely to induce discomfort and nausea than smiles and delight. With Donald Trump as president, everything just feels different.\n“Yes We (Still) Can,” a breezy memoir by former Obama communications director Dan Pfeiffer, is a victim of bad timing. Had Hillary Clinton won the 2016 election and then built on Obama’s achievements, Pfeiffer’s unspectacular, jokey apologia might have gone down easy — a champagne flute of fizzy recollections. But with so many people waking each day to read the news with fear and loathing, the book’s flamboyantly wacky tone and dearth of interesting disclosures will, I imagine, encourage most readers right now to pass it over.\nFans of Pfeiffer’s podcast, “Pod Save America,” may still revel in the book’s affected sitcom zaniness. He devotes a brief chapter to recounting the time he split his pants in the Oval Office and had to slink out sidewise. The book is full of the standard set pieces of the campaign-memoir genre: the ritual self-deprecation; the lucky breaks and twists of fate; the tales of early flubs, boners and fiascoes that our hero thought would ruin his career but can now be safely recounted. There’s little here, though, that sheds light on an important question lurking within its pages: How did the same country that elected its first black president, a man who reflexively appealed to the better angels of our nature, then proceed to choose its first president without any political experience or commitments, who appeals ceaselessly to our basest selves?\nA self-declared “Obama loyalist through and through,” Pfeiffer states up front that he had no wish to write a “history,” an “inside account” or a “tell all” — because, he says, he’s not a jerk (he uses a more colorful synonym). So what has he written instead? Unlike previous generations of spinmeisters dating to Theodore Roosevelt’s time, Pfeiffer and Obama aides such as David Plouffe, Tommy Vietor and Ben Rhodes never had careers except as operatives; they didn’t come up through local politics, work as journalists, or master policy in universities or think tanks. Born after the dawn of the permanent campaign, they knew how to run campaigns and, once in the White House, worried about winning the week, the day or the hour.\nPerhaps as a result, “Yes, We (Still) Can” has the jerry-built feel of a statement from the White House communications shop that Pfeiffer used to run. It’s as if its raison d’etre were decided on by a team of consultants trying to calculate what sort of book would land with the right splash. Pfeiffer writes that he intended the book to be a no-nonsense “conversation about politics in the era of Obama, Trump, and Twitter.” (Again, he uses a colorful synonym for “no-nonsense.”) Although Pfeiffer reminds us that “the cleverest idea in the world won’t work unless it is authentic to the person,” he doesn’t heed his own wisdom. More candor and greater depth would have helped the reader see beyond Pfeiffer’s bro persona and glimpse his authentic self.\nOne of Pfeiffer’s goals is to explain how recent changes in the media of communication have altered the political landscape. Many of these ideas are familiar by now, such as the challenge presidents face in capturing the public’s attention when viewers have nearly infinite cable and Internet choices. And he notes that by allowing citizens to react immediately to events, Twitter has confounded the spin doctors’ work; he argues — unpersuasively to my mind — that in the 2012 campaign, Obama lost his first debate with Republican Mitt Romney because of bad real-time Twitter reviews from Andrew Sullivan and other pundits. ­\nPfeiffer is more convincing when he calls Twitter a “high risk, high reward” medium, noting that most politicians are risk-averse in using new tools — and thus failed to exploit it. These included Obama, who, despite having a White House account, never used the new medium effectively. He regarded it, Pfeiffer says, as “some sort of dystopian hellhole.” Trump, in contrast, had nothing to lose and “managed to use the platform to dominate the political conversation.” More important, “Twitter facilitated a coarser, less substantive political culture that significantly benefited Trump, who is at his very core a Twitter troll.”\nAs for journalists, he argues that Twitter has blurred the time-honored and useful distinctions between reporting, analysis and opinion. When the medium debuted, reporters bound to stick to the facts on the air or in the newspaper would abandon their professionalism on social media. “Reporters opined and even the most junior reporter was free to offer their political analysis of the most complex situations,” ­Pfeiffer writes. This blurring of lines, he further suggests, “provides an opening for those who view facts as obstacles” — namely “Trump and his MAGA minions.”\n“Yes We (Still) Can” won’t take its place with the memoirs of men like Leon Panetta and Robert Gates as vital references for historians of the Obama presidency. But it’s not without its moments. The best ones come from Obama, who may not have been the best president of recent times but was almost certainly the funniest. Toward the end of the book, Pfeiffer, having departed the White House in 2015, returns for a final visit after Trump’s election. Plaintively, he looks at his former boss for a reed of hope to cling to, only to have the president reply, with his well-known deadpan understatement, “Look, this isn’t an ideal situation to say the least.” They both laughed. Sometimes that’s all you can do.","url":"https://www.washingtonpost.com/outlook/a-breezy-memoir-on-white-house-zaniness-and-national-politics/2018/07/12/a51ef03c-8239-11e8-b851-5319c08f7cee_story.html"}
