{"authors":["Sam Quinones"],"date_download":"2018-10-21 03:29:22","date_modify":"2018-10-21 03:29:22","date_publish":"2018-06-28 00:58:13","description":"Charlie LeDuff travels the nation taking the weakening pulse of the American Dream.","filename":"data/vaneerConsumption/BookreviewofShtshowTheCountrysCollapsingandtheRatingsAreGreatbyCharlieLeDuff.json","image_url":"https://www.washingtonpost.com/resizer/ZI3cAIqjd_MizupMx9IgjrGlzZE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2DX5IODWKQI6RNFXGCCAAJBMFY.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_a-gonzo-tour-of-what-ails-america_2018_06_27_955755ea-6060-11e8-9ee3-49d6d4814c4c_story_1540092562.html","title":"Book review of Sh*tshow!: The Country’s Collapsing . . . and the Ratings Are Great by Charlie LeDuff","title_page":"Book review of Sh*tshow!: The Country’s Collapsing . . . and the Ratings Are Great by Charlie LeDuff - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"The Zenith assembly plant, or maquiladora, in Reynosa, Mexico, in 1992. Even before international trade deals, some U.S. companies were moving operations abroad. (Joe Cavaretta/AP)\nSam Quinones is the author of “Dreamland: The True Tale of America’s Opiate Epidemic.”\nIn my younger days, I had a fierce love affair with punk rock. The music was raw, uneven and jagged as a broken beer bottle; it was exuberant, effervescent, boneheaded and simplistic, presuming to know the answers and that they could be found on the street, far from power — and along the way it told some necessary truths, sometimes in spite of itself.\nI was not quite midway through Charlie LeDuff’s “Sh*tshow” when I realized the book was all that — a punk-rock look at modern America and the toxic media circus described by the title.\nLeDuff is a Pulitzer Prize-winning newspaper reporter, television journalist and author of “Detroit: An American Autopsy,” an investigation into the decline of his home town. But “Sh*tshow!” is not the deep dive that “Detroit” was. Rather, LeDuff skips wide across America, and therein lies the book’s bounty and its burden.\nHe sets off in search of what is killing the American Dream — which he says has been “mortgaged down the river” — with a visit to Roger Ailes, the late former head of Fox News. There, he proposes a TV show called “The Americans,” about the corroding American heart — this, by the way, is two years before Donald Trump glided down that escalator. Ailes, according to LeDuff, pauses only to wonder whether he can control this reporter before greenlighting his show.\nSo off he goes, LeDuff with his TV crew, to slog through a country that is “bankrupt and on high boil,” believing that his reporting requires accuracy but also “style and presentation, hyperbole and humor, ostentation and outrage.”\nLeDuff’s gonzo reporting is nothing if not braggadocious, intent on establishing the author’s first-person street-and-barroom cred. Throughout “Sh*tshow!,” LeDuff faces off with rent-a-cops and real ones, sleeps on the floor of fleabags, eats wild-rabbit stew with Wonder Bread and margarine.\nHe visits rancher Cliven Bundy’s clan as it takes over federal grazing land in Nevada with claims of ancestral rights and protests against tyranny, with hangers-on like a “high-strung ex-Marine from Arizona with a shaved head [who] wandered around the campfire quoting Thomas Paine.” LeDuff pairs the Bundys’ campaign with a poignant portrayal of Carrie Dann, a nearly 80-year-old Shoshone woman fighting for grazing rights as hard as the Bundy clan, but without the media attention or the crackpots. Bundy said he would consider giving his land to the Indians. “But he never actually did,” LeDuff writes.\nLeDuff’s episodes range from brilliant storytelling to pointless. In one evocative scene, LeDuff warns a black rental-car clerk that his customers, a Ku Klux Klan leader and his assistant, are members of America’s oldest hate group. Later the assistant acknowledges the unexpected, saying of the clerk: “He was just an average guy doing his job. You can’t hate all the time.” In a less revelatory tale, LeDuff recounts his attempt to find the two protagonists in an iconic photo from the civil rights struggle in Alabama — a pursuit that ends fruitlessly.\nLeDuff disrupts smugglers on the Rio Grande, visits Ferguson, Mo., and reports on Black Lives Matter. He encounters a working-class man in Alabama who has lost faith in unions. “The union might have had its purpose way back when, but so did he,” LeDuff writes. “Now he didn’t count.”\nBut LeDuff seems to spend little time with this fellow. We don’t even learn the guy’s name, much less his full story. Too often LeDuff is there and gone. So “Sh*tshow!” begins to feel thin, even when you’re pretty sure he’s nailing it. America has some deep stories to tell right now, but LeDuff’s approach can feel as distracted as the Twitterverse.\nThe analytical depth to which LeDuff aspires is hard to achieve when he’s hopscotching the country at a three-to-six-page clip: from the Bundys to McAllen, Tex., to Flint, Mich., rural Oregon, death row in Texas, Detroit and back to Flint.\nIn this, though, I feel for him. I can almost hear LeDuff asking, “How the hell am I going to tell this story to a country with a culture of distraction and a 140-character brain?” It’s the conundrum of every nonfiction writer.\n“Sh*tshow!” is a book for our time — quick, raging, easily devoured, prone to populist formulations. It can be exhilarating for the originality of its take on where we are, and then it can dump on us fluffy, pompous pronouncements that feel way too easy.\nLeDuff blames international trade deals for job losses that began well before NAFTA and GATT. He visits Reynosa, Mexico, and discovers maquiladoras (assembly plants) of companies that once had factories in New York (Corning), Illinois (Caterpillar) and Michigan (Delphi, the auto parts maker). Sounds bad. It is — for those states.\nThe process he describes reflects the world gradually coming to compete with us with cheap labor after languishing for most of the past century in either pre-industrial impoverishment or totalitarian straightjackets. Reynosa is one place to see that. The city’s first large industrial maquiladora belonged to Zenith, which by the late 1970s was employing thousands of Mexicans making TVs that had once been assembled in Chicago — a harbinger of what was going to happen, international trade deals or no.\nBut if you’ve read this far, you probably know not to open “Sh*tshow!” expecting Brookings Institution nuance. This is kick-in-the-crotch storytelling, and a good part of the time, it works.","url":"https://www.washingtonpost.com/outlook/a-gonzo-tour-of-what-ails-america/2018/06/27/955755ea-6060-11e8-9ee3-49d6d4814c4c_story.html"}
