{"authors":["Sibbie O'Sullivan"],"date_download":"2018-10-21 03:29:28","date_modify":"2018-10-21 03:29:28","date_publish":"2018-06-28 20:40:57","description":"The composer-conductor’s children grew up in a raucous, confusing, sexually charged world.","filename":"data/vaneerConsumption/BookreviewofFamousFatherGirlAMemoirofGrowingUpBernsteinbyJamieBernsteinreviewedbySibbiOSullivan.json","image_url":"https://www.washingtonpost.com/resizer/aIAw5nAV--_Il_se2TZsMnQdEvc=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3FOIFADWKII6RNFXGCCAAJBMFY.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_daughters-loving-bu_bdf2fba36e4476cdf5eb20d097996801_2232fec8-5941-11e8-8836-a4a123c359ab_story_1540092568.html","title":"Book review of Famous Father Girl: A Memoir of Growing Up Bernstein by Jamie Bernstein, reviewed by Sibbi O'Sullivan.","title_page":"Book review of Famous Father Girl: A Memoir of Growing Up Bernstein by Jamie Bernstein, reviewed by Sibbi O'Sullivan. - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Sibbie O’Sullivan, a former teacher in the Honors College at the University of Maryland, has recently completed a memoir on how the Beatles have influenced her life.\n(Leonard Bernstein works on a new musical score in his West Side apartment in New York in 1945. (AP))\nLet us now praise ordinary fathers, ones who don’t constantly smoke and drink, or French-kiss their daughters, or pound the table while yelling, “Everyone shut up but me.” An ordinary father who watches his daughter receive her diploma from Harvard instead of hanging out with the Russian cellist Mstislav Rostropovich. One who doesn’t show off “his cute teenage daughter” at discos.\nBut ordinary fathers rarely become global cultural heroes or change how orchestral music is received by the masses. In “Famous Father Girl,” Jamie Bernstein’s memoir of her father, conductor-composer Leonard Bernstein, we learn that she “longed to be like the ‘normal’ people we saw on TV,” despite loving the “raucous, confusing world” of her parents. At the center of this world stands her father, a compelling mix of intellect, warmth, charm, sexiness and immense energy. Seduction might have been his greatest talent, one countered by his daughter’s aptitude for truth-telling. Her memoir portrays a man whose weaponized ego fits perfectly into American celebrity culture, but it’s also a story of how his daughter survived that ego to become her own woman, even as she remains intent on keeping her father’s legacy alive.\nBetween 1943, when he made his conducting debut with the New York Philharmonic, and his death in 1990, Bernstein was never out of the public eye. But at home he’s not always a glamorous figure: Jamie remembers him sitting at the breakfast table smoking and farting. The constants of Jamie’s childhood were “a bluish haze of cigarette smoke,” the clink of late-afternoon ice cubes, household servants, word games, and frequent parties attended by artists and intellectuals. Everybody loved Lenny — as he was known to his friends and family — none more so than Jamie herself. Singing, playing and exchanging numerous hugs with him created a strong bond between them. But even her sunniest memories are tempered with shadows.\nAs Jamie moved from childhood into adulthood, navigating her father’s exhibitionist tendencies became a challenge. Jamie’s telling omits the yuck factor, so prominent in “Priestdaddy,” Patricia Lockwood’s recent memoir about her eccentric father, a priest by papal dispensation. Bernstein offers instead a one-size-fits-all explanation for her father’s exuberance: It was just the way he was. Describing a dinner with a Russian actor, for example, she writes that her father kissed her “fully on the lips, then [pushed] his tongue into my mouth. Daddy tried this tongue-kissing stunt on almost everyone, usually late at night, after much drinking (and possibly an orange pill).” Though his actions embarrassed and sometimes hurt her, she’s reluctant to fully consider their implications. At her 28th birthday party, before a group of people, Bernstein “gestured to a crease in his forehead and said to [Jamie,] ‘You see this line here that runs right down the middle? That’s the Line of Genius. You don’t have one.’ ” Assessing this humiliation, Jamie simply writes that “it did seem unusually mean.”\nThinking more deeply about her father’s behavior might lead to unpleasant conclusions, and though Jamie denies there was any abuse, she writes that “it was hard not to feel my father’s sexuality. . . . Everybody felt it. Tricky stuff for a daughter.” She even writes that her father’s music would bring her to a “state of ecstasy,” something many of Bernstein’s audiences have experienced, though she acknowledges that, for her, “a subliminal discomfort” accompanied it.\nThough we may wonder about Jamie’s generosity toward her father, her brother, Alexander, had no difficulty directly expressing how he felt about his father’s controlling nature. In Jamie’s account, during a party to celebrate Alexander’s graduation from Harvard, a school Bernstein insisted his son attend, guests found his diploma “impaled on the front door with a kitchen knife.” This is just one of many punchy details in the book that reveal the ugly reality of what Jamie calls “the Lenny Show.” There’s also the moment when Jamie’s mother, Felicia, forced a separation after one of Bernstein’s homosexual affairs became too visible. Across the dinner table, in “her biggest, scariest actress voice,” she tells her husband, “You’re going to die a lonely, bitter old queen.” When the affair ended, she took him back and “things were sort of back to normal.”\nJamie writes lovingly about her mother, an actress whose main function was being “Mrs. Maestro,” a job that entailed “a slow descent into a mute, existential despair.” Fun-loving but deeply depressed, Felicia self-medicated by chain-smoking and drinking, just like her husband. Jamie feared becoming like her mother, a woman dedicated to her husband at the expense of her own talent. This fear partly explains Jamie’s attempts to become “a rock star” with an album of her own songs. She never pulled this off, and given her admission that she has no musical “chops,” her efforts just feel silly, rather than brave or risky, though they do put some distance between her and her father.\nTentative as Jamie is about her father’s excesses, she is fiercer still in defending him. She explodes at Tom Wolfe’s treatment of her family in his article “Radical Chic,” which mocked the cocktail party/fundraiser her parents hosted for the Black Panthers in 1970. Felicia organized the event to raise money for families of jailed Panthers. Wolfe upbraids all who attended, especially the rich and famous. Though she was not at the party, Jamie remains enraged over Wolfe’s article and the damage it caused. She goes so far as to write, “It doesn’t seem like such a stretch to lay Mummy’s precipitous decline, and even demise, at the feet of Mr. Wolfe.”\n“Famous Father Girl” is a good book that strives to keep Leonard Bernstein before the public eye. Short on psychological insight, it is long on love and acceptance: love for a father of boundless energy and acceptance of one who sometimes crossed boundaries a father shouldn’t cross. By preserving his legacy, Jamie honors her father as both a great talent and a complex human being.","url":"https://www.washingtonpost.com/outlook/daughters-loving-but-unsettling-portrait-of-leonard-bernstein/2018/06/28/2232fec8-5941-11e8-8836-a4a123c359ab_story.html"}
