{"authors":["Lisa Zeidner"],"date_download":"2018-10-21 03:32:45","date_modify":"2018-10-21 03:32:45","date_publish":"2018-08-16 19:13:17","description":"“This Is No Dream” is an illustrated history of Roman Polanski’s first Hollywood film, “Rosemary’s Baby.”","filename":"data/vaneerConsumption/BookreviewofThisIsNoDreamMakingRosemarysBabybyJamesMunnandBobWilloughby.json","image_url":"https://www.washingtonpost.com/resizer/4b-mZ34vEv9kfcSUMDzYpDEcq_8=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7TVNQFU754I6RI65FIMZD4DV2U.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_celebrating-50-year_34b93ef7375ad87318236407619a6067_4d91a0a4-8e72-11e8-bcd5-9d911c784c38_story_1540092765.html","title":"Book review of This Is No Dream: Making Rosemary’s Baby by James Munn and Bob Willoughby","title_page":"Book review of This Is No Dream: Making Rosemary’s Baby by James Munn and Bob Willoughby - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Lisa Zeidner’s last novel was “Love Bomb.” She teaches creative writing and film at Rutgers University-Camden.\nMia Farrow starred in Roman Polanski’s “Rosemary’s Baby” in 1968. (Bob Willoughby/MPTV Images/Reel Art Press )\nIn a bit of unfortunate timing, director Roman Polanski was expelled from membership in the Academy of Motion Picture Arts and Sciences this summer for violating its standards of conduct, a month before his film “Rosemary’s Baby” celebrated its 50th anniversary. Polanski, who had pleaded guilty to unlawful sex with a minor in the late 1970s, fled the United States before going to court. The #MeToo movement has generated a great deal of debate about the wisdom of conflating the artist with his art — whether we should reject the work because of the maker’s misdeeds or ignore the personal life because, as critic Camille Paglia has said: “Great art has always been made by bad people. So what?” In any case, no one debates the artistry of Polanski’s first Hollywood film, “Rosemary’s Baby” (1968), which director Ang Lee has called “an absolute masterpiece” and which continues to influence filmmakers half a century later.\n“This Is No Dream: Making Rosemary’s Baby” is an illustrated history of the film, with text by James Munn and photos from set photographer Bob Willoughby. The tribute provides a fascinating look at the inspired choices — and lucky breaks — that made the film iconic, starting with the fact that Alfred Hitchcock, given first dibs to direct Ira Levin’s best-selling novel about a woman bearing Satan’s progeny, turned down the job.\nPolanski almost declined, too, assuming that the novel was “a kind of ridiculous Doris Day comedy.” But he was hooked by what, in his version, would become the spooky-funny ambiguity at the story’s heart: Was Rosemary indeed the victim of a satanic conspiracy or just lost in a hormonal haze? (Critic Penelope Gilliatt dubbed the movie “gynecological Gothic.”) His script was scrupulously faithful to the novel, with the major exception that, unlike in the book and the many inferior devil-spawn imitators that have followed, he never reveals the progeny’s cloven hoofs or reptilian pupils. He only shows us horrified Rosemary, peering into the crib: “What have you done to his eyes, you maniacs?” Even while retaining the central dream sequence of Rosemary’s rape and impregnation as Levin detailed it, Polanski radically changes the tone, offering only fragmentary glimpses of the sex act and the devil’s scaly hands, a departure that an included page from the original manuscript of the novel makes clear. (Levin’s version reads like soft porn.)\nThe set photographs reinforce how religiously Polanski cleaves to a subjective view. Waif-like, naive Mia Farrow is in every scene, reacting. Polanski would often walk an actor through the shot with himself in character, step by step, as if rehearsing a dance move. John Cassavetes, the actor-director cast as the horrible husband and devoted to improvisation, did not take well to such detailed directives. He and Polanski hated each other. How much different the movie would have been, though, if Robert Redford had gotten the part as originally hoped.\nSome of the juicy tidbits on the casting and production in “This Is No Dream” will be familiar to those who have watched the documentary that accompanies the 2013 remastered Criterion Collection DVD. Mia Farrow’s husband, Frank Sinatra — 29 years her senior; they were the tabloid Brangelina-esque duo of the moment — was furious when the movie ran over budget and schedule, because Farrow was supposed to begin shooting “The Detective” with him. After Farrow refused to abandon her role as Rosemary, Sinatra served her with divorce papers on the set. Producer Robert Evans arranged for “The Detective” and “Rosemary’s Baby” to be released on the same day—and Farrow was delighted that her film did better box office.\nIncidentally, her legendary short haircut in the film was not created by Vidal Sassoon, though Sassoon is credited for the movie’s hair design (and gets product placement in the novel). Farrow had already cut her hair herself on the set of “Peyton Place.” In the first scenes of “Rosemary’s Baby,” she’s wearing a wig. Also, that is real raw liver the iron-starved Farrow wolfs down in the kitchen, although she was a longtime vegetarian — a less dangerous bit of method-acting than Polanski making her race into frantic oncoming Manhattan traffic, with the promise that no one would run over a pregnant woman. Farrow isn’t complaining about her treatment. “I think it’s a great movie,” she has said. “I know I didn’t get another role as fine, that asked as much of me. . . . It was the happiest work experience, the most fulfilling, that I ever had.”\nWilloughby’s still photographs capture the soul of the performance and the director’s vision of Rosemary. Gazing off-camera, diaphanous as a Vogue model in her hippie clothes, Farrow is the perfect film victim, especially because there’s nothing obviously menacing, because she’s so easy to dismiss as a ditz in her fuzzy blue slippers. Perhaps no filmmaker has been as deeply empathetic to female isolation and vulnerability, or with the bizarre alien occupation that is even an average, unsatanic pregnancy. That Polanski’s films are essentially feminist makes his position in the crosshairs of #MeToo even more ironic.","url":"https://www.washingtonpost.com/outlook/celebrating-50-years-of-a-controversial-directors-frightening-masterpiece/2018/08/16/4d91a0a4-8e72-11e8-bcd5-9d911c784c38_story.html"}
