{"authors":["David Steele"],"date_download":"2018-10-21 03:32:37","date_modify":"2018-10-21 03:32:37","date_publish":"2018-08-16 15:49:47","description":"Casey Sherman and Dave Wedge recount Patriot scandals and exploits on the gridiron.","filename":"data/vaneerConsumption/Bookreviewof12TheInsideStoryofTomBradysFightforRedemptionbyCaseyShermanandDaveWedge.json","image_url":"https://www.washingtonpost.com/resizer/zwiPo5VjHGqFmt3v4455bzhWcZY=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/H4JKSCVAVQI6RI65FIMZD4DV2U.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_how-tom-brady-surmo_36c6bac2061b29fe384573903164f484_b548aec2-8909-11e8-a345-a1bf7847b375_story_1540092757.html","title":"Book review of 12: The Inside Story of Tom Brady's Fight for Redemption by Casey Sherman and Dave Wedge","title_page":"Book review of 12: The Inside Story of Tom Brady's Fight for Redemption by Casey Sherman and Dave Wedge - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"David Steele is a senior writer for Sporting News, covering the National Football League.\nNew England Patriots quarterback Tom Brady was accused of cheating in 2015. (Photo by Patrick Smith/Getty Images)\nCasey Sherman and Dave Wedge’s “12: The Inside Story of Tom Brady’s Fight for Redemption” delivers what the title promises. The quarterback’s redemption reaches its climax when the New England Patriots pull off a historic comeback victory over the Atlanta Falcons in Super Bowl 51 in February 2017. NFL fans, die-hard and casual, will easily get swallowed up in the retelling of Brady’s stunning performance. (Warning: If the Falcons’ 28-to-3 lead in the third quarter still causes you to flinch, read this book with caution; five chapters are devoted to the astonishing Patriots comeback and eventual win in overtime.)\nThe climax was capped by the after-game celebration and the presentation of the championship trophy by NFL Commissioner Roger Goodell to Brady, team owner Robert Kraft and the Patriots. In the book, Goodell emerges as nothing less than the Patriots’ nemesis and the villain of the story.\nThe centerpiece of the tale is the fight between Goodell and the league, and Brady and the Patriots, over “Deflategate,’’ the scandal that resulted in Brady’s four-game suspension at the beginning of the 2016-17 season over his role in deflating footballs used in a game against the Indianapolis Colts. Brady’s sentence was one of the highest-profile punishments in the history of America’s most popular sport.\nThe case consumed the NFL for 18 months; introduced many to the intricacies of collective bargaining, the federal court system and the laws of physics; and was on track to go before the Supreme Court before Brady gave up on his final appeal months before the 2016-17 season.\nSherman and Wedge, Boston-based journalists who co-wrote “Boston Strong: A City’s Triumph Over Tragedy,” on the 2013 marathon bombing, did their homework to illuminate the inconsistencies in the NFL’s case against Brady and the Patriots. Besides digging through court filings and transcripts and media accounts (as well as social media postings), they interviewed 24 people, including Brady and Kraft. Among other crucial interview subjects were union leaders of the NFL Players Association, who spearheaded Brady’s defense.\nNotably absent is Goodell, who declined to be interviewed for the book.\nAs Sherman states in the acknowledgements: “ ‘12’ is as much a story about institutional power and corruption as it is about the game of football.’’\n“12” shows how Goodell and the NFL failed to prove their case against the Patriots and Brady, arguing that the investigation Goodell commissioned was significantly flawed. The authors contend that based on precedent and the NFL’s bylaws and procedures, the punishment was out of proportion to the crime. The book quotes the union’s first federal appeal of the suspension, claiming that Goodell “acted arbitrarily as an employer seeking to justify his own disciplinary decision rather than as a neutral arbitrator.” Sherman and Wedge then observe: “It was a fancy way of saying that Goodell had presided over a kangaroo court in which he served as judge, jury, and executioner.”\nOver the years, many NFL fans have attacked the Patriots, Brady, Kraft and coach Bill Belichick for their behavior. Few forget an earlier scandal, Spygate, a decade ago, when the Patriots violated league rules on videotaping opposing coaches. Yet the NFL’s machinations over Deflategate defused some of the acrimony toward the Patriots and focused it on Goodell and his penchant for overreach.\nFirst-timers to the absurdity of the endlessly baffling Deflategate investigation should be able to follow it easily. That was no small feat in real time. Sherman and Wedge steer readers through it all without leaving anything essential out or dumbing things down. They smoothly and simply tell the backstories of Brady, Kraft, the franchise and Goodell. As Deflategate unfolds, Goodell’s behavior becomes increasingly unflattering. “The commissioner kept a mental list of his enemies,” the authors write, “and was morphing into a Nixonian type of leader.”\nSherman and Wedge also give us the silliest moments that emerged during these bizarre events. We’re reminded of the hilariously bad Brady courtroom sketch that lives on in Internet memes, and of the Patriots equipment staffer who wound up bearing the nickname the Deflator, and of the Patriots’ comical explanation for awarding him that title.\nSherman and Wedge don’t shy from revealing the ways Brady aggravated his own cause with his remarks and decisions throughout the controversy. As they point out, he hurt himself at the outset by talking publicly, against the advice of the union, and wound up talking himself right into a corner. When asked at the first news conference after the infamous Colts playoff game, “Is Tom Brady a cheater?,” Brady answered: “I don’t believe so.” And later he destroyed his cellphone rather than turn it over to NFL investigators.\nBut at the core of the case, and of this book, are the abuses of power by the NFL’s top leadership and the willingness to assert that power against the game’s marquee superstar and its signature franchise. Though Brady’s name, face and jersey number grace the book’s cover, the lasting image of this tale is Goodell, the giver of trophies and the target of scorn.","url":"https://www.washingtonpost.com/outlook/how-tom-brady-surmounted-deflategate-and-redeemed-himself-on-the-field/2018/08/16/b548aec2-8909-11e8-a345-a1bf7847b375_story.html"}
