{"authors":["Michael Mewshaw"],"date_download":"2018-10-21 03:31:48","date_modify":"2018-10-21 03:31:48","date_publish":"2018-07-26 19:41:06","description":"Andrea di Robilant on the muse who sparked the author’s late creative burst.","filename":"data/vaneerConsumption/BookreviewofAutumninVeniceErnestHemingwayandHisLastMusebyAndreaDiRobilant.json","image_url":"https://www.washingtonpost.com/resizer/O97jaPTCucMZDhAkSy1yTE8dnkc=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/TTXGYZUPNEI6RN3J4P77C7YGRE.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_the-venetian-teenag_936b5d165857a66b1af5d906d18ca0eb_ea707b52-3f4e-11e8-a7d1-e4efec6389f0_story_1540092708.html","title":"Book review of Autumn in Venice: Ernest Hemingway and His Last Muse by Andrea Di Robilant","title_page":"Book review of Autumn in Venice: Ernest Hemingway and His Last Muse by Andrea Di Robilant - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Michael Mewshaw has lived off and on in Italy for 45 years. His memoir, “The Lost Prince: A Search for Pat Conroy,” comes out in 2019.\nErnest Hemingway in a gondola on the Grand Canal in Venice in the fall of 1948 when he made his first extended visit to Italy in many years. His reacquaintance with the city provided the inspiration for \"Across the River and Into the Trees.\" (AP Photo)\nErnest Hemingway influenced generations of writers with his terse, understated prose, his stoic code of grace under fire and his commitment to producing a strict number of pages each day. In his private life, he showed no such discipline. Married four times and chronically unfaithful, a prodigious drinker and gourmand whose weight ballooned to 240 pounds, a man of savage mood swings, alternately bellicose and sloppily sentimental, a blowhard and relentless self-promoter who claimed to crave privacy, he passed himself off as an icon of machismo, yet wrote a novel, “The Garden of Eden,” rife with cross-dressing and gender fluidity. It would have taxed Sigmund Freud and all his psychoanalytic acolytes to tease out the implications of Hemingway’s rigorous literary standards and his slovenly personal style.\n“Autumn in Venice: Ernest Hemingway and His Last Muse” focuses on the final turbulent decade of a life, but Andrea di Robilant captures the full panoply of quirks and conflicts that often made Papa and those closest to him miserable. Lovers, ex-wives, friends, publishers, even complete strangers were forced to dance to the tune he piped. (Di Robilant portrays a hilarious scene of Hemingway hounding the man beside him on an airplane to read his manuscript and agree that it was a masterpiece.) Still, di Robilant, an Italian American with deep roots in Venice and relatives who were part of Papa’s crowd, never fails to empathize with the aging author’s predicament. Staring down the gun barrel of his 50th birthday, Hemingway brooded about his health, his eroding powers and the opinion of critics that he was finished. Younger writers — Norman Mailer, James Jones, Irwin Shaw — were poised to beat him to the punch with their big, best-selling novels about World War II.\nAs usual when under attack, Hemingway didn’t retreat; he charged off to Europe, the source of his earlier successes. Setting sail in 1948 with more than 30 pieces of luggage and a royal-blue Buick convertible, Papa and his wife, Mary, planned to tour Provence and cap off the trip with a stay in Paris. Instead, circumstances conspired to keep them in Italy, and Hemingway impulsively decided to revisit the Veneto region where, during World War I, he was wounded.\nUnlike the raw adolescent who arrived in 1918 and departed from Italy without anyone noticing, Hemingway was now world-famous, and journalists and photographers mobbed his every move. Viewed as larger than life, the great man, one Italian newspaper reported, was two meters tall (78.74 inches) — which exaggerated his height by almost seven inches. This was a mistake he didn’t object to, but it rankled him that people demanded to know when he would finish his next novel. He didn’t admit it, but he was mired in a sprawling trilogy, “The Land,” “The Sea” and “The Air,” which would remain unpublished.\nHe and Mary settled in Venice, living at the luxurious Gritti Palace Hotel and dining almost daily at Harry’s Bar. They were lionized by the local aristocracy, and Papa spent more time shooting ducks than working at his desk. It was on a hunt at a private reserve that he encountered Adriana Ivancich and fell in . . . “love” doesn’t begin to describe his state of besottedness. He lost his heart, his head and his vaunted artistic detachment to a teenage girl. She was intelligent and pliable, an embryonic artist and poet, and Hemingway made her his muse. There’s no evidence they were ever sexually intimate, but they exchanged heartfelt letters and paired off in public, scandalizing Venetian society. Through it all, Mary Hemingway hung onto her husband, swallowed his insults and her own humiliations, and forgave him his outbursts of rage. She allowed Adriana to accompany them to their ski chalet in Cortina and, later, to Finca Vigia in Cuba, where Adriana and her mother spent months living in the tower where Hemingway worked.\nTo round off the cast of characters that suggested a French farce, Adriana’s brother Gianfranco also lived in Havana and appears to have struck up an affair with Mary. Papa responded by breaking his wife’s typewriter. Lord knows what he would have broken if he had learned that his majordomo, René Villarreal, was romantically embroiled with Adriana and led her on late-night skinny-dipping escapades.\nA diligent researcher of primary and secondary texts, di Robilant demonstrated in his first book, “A Venetian Affair,” a gift for weaving fascinating narratives from letters, diaries, archives (including those of the di Robilant family) and previously published work. In this instance he has a treasure trove of material. Chatty as magpies, Mary, Adriana, Gianfranco and even the majordomo René all published memoirs, offering a stereoscopic depiction of events.\nBut the crystallizing point of view, the one that raises this story far above idle gossip, belonged to Hemingway himself. He not only transmuted the May-December romance into art in an interesting if flawed novel, “Across the River and Into the Trees.” He drew from his devotion to Adriana “the creative release that had been eluding him for years” and produced “The Old Man and the Sea,” for which he won the 1953 Pulitzer Prize. (The next year he won the Nobel Prize.) He also finished a major part of “A Moveable Feast” and drafts of “Islands in the Stream” and “The Garden of Eden,” published posthumously. Though not the equal of his early work, these books contradicted F. Scott Fitzgerald’s contention that there are no second acts in American lives.\nSadly, the story doesn’t end in triumph. Hemingway continued to deteriorate. Drinking did much of the damage. A lifetime of reckless adventure broke down his body — two airplane crashes in Africa accelerated his decline — and paranoia and depression addled his brain. After several bouts of convulsive shock treatment, Ernest Hemingway committed suicide at the age of 61. In the estimation of some critics, he had betrayed his famous code of honor and courage. But Norman Mailer, not generally noted for his kindness to competitors, speculated that Papa’s “inner landscape was a nightmare” and wrote, “The final judgment on [Hemingway’s] work may come to the notion that what he failed to do was tragic, but what he accomplished was heroic, for it is possible he carried a weight of anxiety with him from day to day which would have suffocated any man smaller than himself.”","url":"https://www.washingtonpost.com/outlook/the-venetian-teenager-who-stirred-hemingways-heart-and-art/2018/07/26/ea707b52-3f4e-11e8-a7d1-e4efec6389f0_story.html"}
