{"authors":["Quinta Jurecic","Quinta Jurecic Is The Deputy Managing Editor Of Lawfare."],"date_download":"2018-10-21 03:32:03","date_modify":"2018-10-21 03:32:03","date_publish":"2018-08-02 21:54:02","description":"Alan Dershowitz offers his argument against impeaching the president.","filename":"data/vaneerConsumption/BookreviewofTheCaseAgainstImpeachingTrumpbyAlanDershowitz.json","image_url":"https://www.washingtonpost.com/resizer/z_OcMMYs1WUioJeRUFj4HzVcqhs=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UOXHZNT6XQI6RO3LYHFWSHYUAI.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_a-book-about-impeac_7dda5df24782236d8e531984d2838683_83550bac-919e-11e8-bcd5-9d911c784c38_story_1540092723.html","title":"Book review of The Case Against Impeaching Trump by Alan Dershowitz","title_page":"Book review of The Case Against Impeaching Trump by Alan Dershowitz - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Quinta Jurecic is the managing editor of Lawfare.\nIn the past year, three books have made the case that President Trump has committed offenses so dire that he might constitutionally be impeached and removed from office. The authors differ in how they approach the question: Allan J. Lichtman (“The Case for Impeachment”) tackles it head-on; Laurence Tribe and Joshua Matz (“To End a Presidency”) build a case against the president but caution against moving too hastily; Cass Sunstein (“Impeachment: A Citizen’s Guide”) weighs a range of hypotheticals but fastidiously refrains from mentioning Trump’s name.\nNow comes Alan Dershowitz with his book “The Case Against Impeaching Trump.” From the title, the reasonable reader might expect the former law professor — whose television appearances defending the president, or at least criticizing his detractors, have become increasingly unavoidable — to present a sustained response to the arguments of his fellow authors.\nThis is true for roughly the first 30 pages. The rest of the 150-page book is bulked out by copies of Dershowitz’s op-eds and columns, transcripts of his various television appearances, and — strangest of all — a series of his tweets. The result is an odd jumble that is less a legal argument against impeaching Trump and more a scrapbook of what Dershowitz has been up to for the past year.\nDershowitz has lightly edited his short writings in the interest of linking them together into a volume. He refers to them here as “essays,” which is something of an overstatement: Most are no more than two or three pages in length. (By my count, only one of the 28 pieces, in addition to the introduction, appears to have been written originally for this book.) Relatively few of them are about impeachment per se, and some have nothing to do with the Russia investigation at all. One, first published as a Wall Street Journal op-ed, was written in response to Trump’s comments on the violence in Charlottesville.\nSome chapters involve reflections on evergreen topics — Dershowitz’s desire for a nonpartisan congressional commission to investigate election interference, for example, and his belief that civil libertarians (except him) have sold out their ideals because they want to bring down the president. But others are so closely pegged to developments that were in the news when Dershowitz first penned them that they make for odd reading in the summer of 2018. In one piece, originally written in July 2017, Dershowitz points to the overturning of Sheldon Silver’s corruption conviction to argue against “an extraordinarily broad definition of corruption capable of being expanded to fit nearly everything Trump has done.” But Silver, former speaker of the New York State Assembly, was found guilty again on the same set of charges in May. This isn’t necessarily fatal to Dershowitz’s argument, but it’s a glaring omission.\nTo the extent that the body of the book speaks to any coherent theme, Dershowitz expresses consistent concern over alleged overreach on the part of the special counsel’s office, as well as what he sees as a loss of civility in American political discourse. These two concerns often bleed into one another. A chapter on why Dershowitz distrusts allegations of Trump’s “corrupt motive” in dismissing FBI director James Comey — something prosecutors would need to show in bringing an obstruction case — somehow transforms into a list of angry emails he has received for his defense of the president. The overall impression is that Dershowitz understands his own martyrdom (yes, there is mention of Martha’s Vineyard, where, Dershowitz has argued, his friends now snub him) as a proxy for the supposed injustices of the Mueller investigation. But “McCarthyism,” which Dershowitz likes to invoke, is a long way from the social opprobrium he claims to experience.\nSome of the writings Dershowitz includes speak to his theory that the president cannot obstruct justice solely by exercising powers within his constitutional authority. (So firing Comey could not in itself constitute obstruction, for example; firing Comey in exchange for a bribe could.) His is certainly a minority position, though it could be brought within the realm of reasonable disagreement by writers more careful and nuanced than Dershowitz.\nThe same is true of the arguments set forth in the book’s opening essay on impeachment. The Constitution mandates that a president may be impeached only for “high Crimes and Misdemeanors” — but what exactly does that mean? The vast majority of scholars and jurists who have tackled the topic have argued that while a criminal act may be an impeachable offense, an impeachable offense need not be a crime. Dershowitz takes the opposite approach, which, in combination with his limited reading of the obstruction statutes, has the effect of severely constraining the universe of offenses for which Trump could be removed from office. To Dershowitz’s credit, he recognizes the bizarre outcomes his position would generate: Even if a hypothetical president chose to stand by while Vladimir Putin reclaimed Alaska as Russian territory, Dershowitz argues, that president could not be impeached. (Compare this with the constitutional scholar Charles Black, who in 1974 defined “high crimes and misdemeanors” as offenses that “corrupt or subvert the political and governmental process” and that are “plainly wrong in themselves to a person of honor.” Handing over Alaska would seem to fall into this category.)\nWhat if the House were to impeach and the Senate to convict a president for an offense that was not itself a crime? In that case, Dershowitz argues, the Supreme Court would be constitutionally empowered to overturn the impeachment. Most scholars have rejected this argument on the grounds of absurdity; the exception is the scholar of impeachment Raoul Berger, whose detailed study of the matter is a far better introduction to the constitutional question than Dershowitz’s glib treatment.\nThe president, of course, is not going to read Berger’s study of impeachment anytime soon. What he has done instead is tweet an endorsement of Dershowitz’s “new and very important book . . . which I would encourage all people with Trump Derangement Syndrome to read!” What is there to be said about the fact that the president of the United States is providing free advertising for a book that argues against his removal from the White House? What guidance, if any, can or should the Constitution provide at the point when the mismatch between man and office becomes so obvious as to be grotesque? There are serious questions to be asked about how to understand the relationship between Trump and the founding documents of this country, but Dershowitz is not serious about answering them.","url":"https://www.washingtonpost.com/outlook/a-book-about-impeachment-that-donald-trump-likes-so-much-he-tweeted-about-it/2018/08/02/83550bac-919e-11e8-bcd5-9d911c784c38_story.html"}
