{"authors":["Associated Press"],"date_download":"2018-10-22 21:50:48","date_modify":"2018-10-22 21:50:48","date_publish":"2016-01-29 08:11:01","description":"MOBILE, Alabama (AP) — Noah Spence has to repeatedly address the troubled past that took him from Ohio State to college football exile and then to Eastern Ke...","filename":"data/vaneerConsumption/BootedfromBigTenNoahSpenceremainsstrongprospect.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:e75b2d3afcbb4f6cbe0be9aed55ae839-4PuZeKVXE7cd9005b2c8766dd604-598_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422308_Booted-Big-Ten-Noah-Spence-remains-strong-prospect_1540245048.html","title":"Booted from Big Ten, Noah Spence remains strong prospect","title_page":"Booted from Big Ten, Noah Spence remains strong prospect | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Booted from Big Ten, Noah Spence remains strong prospect\nMOBILE, Alabama (AP) — Noah Spence has to repeatedly address the troubled past that took him from Ohio State to college football exile and then to Eastern Kentucky.\nLike every other Senior Bowl player, Spence is trying to answer any questions potential NFL employers might have about his game during the weeklong proving session. Then, there are the team interviews, during which Spence must explain those past misdeeds.\nA rising star as a pass rusher, he was banned from the Big Ten Conference after two failed drug tests, later admitting he used Ecstasy.\nEastern Kentucky defensive end Noah Spence runs through drills during NCAA college football practice for the Senior Bowl, Thursday, Jan. 28, 2016, at Ladd¿Peebles Stadium, in Mobile, Ala. (AP Photo/Brynn Anderson)\nThus the questions, and Spence said there's only one way to face them.\n\"Just tell them the truth,\" he said. \"You can't make up any stories. You can't lie about it. It feels better just telling the truth and letting them know everything and to get past it and start talking about football again.\"\nHe said that transition comes pretty quickly and that he's met with too many teams to name. The New Orleans Saints were among them. General manager Mickey Loomis said such meetings are about collecting information and forming a \"first impression.\"\n\"Every guy you have questions about,\" Loomis said. \"Obviously, there are things that they have to answer, in terms of an event that may have happened. But the process really is the same, I think, for each player.\"\nPast troubles can be the factor that drops a first-round talent in the draft, but Spence feels like he has put his problems behind him.\nNow the challenge is convincing prospective employers.\nSpence was suspended for the entire 2014 season when the Buckeyes won the national championship. The Big Ten permanently banned him, denying his appeal in November 2014.\nOn the field, the 2013 all-conference pick didn't miss a beat after transferring to FCS Eastern Kentucky. He was a first-team All-American after collecting 11 1/2 sacks.\n\"I've grown up a lot,\" Spence said. \"I've matured like no other. It's been a great experience just going through all this and feeling how it feels to be at the bottom and then having to work my way back up. It feels great.\"\nSpence said he has changed a great deal since the behavior that led to his ouster from the Big Ten. He said he wallowed for a couple of days after the league's decision before getting back to training for his next destination, at the encouragement of his father, Greg.\n\"I'm not the same as I was,\" Spence said. \"I don't think the same. I've got a better focus about me. I know what I want in life now.\"\nSenior Bowl executive director Phil Savage, a former NFL general manager, said Spence has the talent to become an NFL starter. He said honesty is the best route for the player.\n\"I think the advice that I would give Noah is that even though they may be asking some softball questions, give truthful answers, because they've got their security team and their investigators that are going out and painting a portrait of what they think happened, and documenting their version of events,\" Savage said.\n\"So they want to see, coming through the backdoor, do the two stories mesh? Does it match?\"\nFormer Ohio State teammate Braxton Miller, who also played quarterback for the Buckeyes, recalled going against Spence in practices.\n\"He's a great pass rusher,\" said Miller, who is now on the opposite sideline from his teammate as a receiver. \"He's fast off the line and a gifted defensive end. I think he can play linebacker, I feel like, but we had our times when I'd get him and he'd get me.\"\nThey've had dinner together during Senior Bowl at the team hotel and stayed in touch since Spence left.\n\"I never lost my faith in Noah,\" Miller said. \"He probably just got caught up in the young years and partying, just being immature. But he's a great guy. He's a great kid.","url":"https://www.dailymail.co.uk/wires/ap/article-3422308/Booted-Big-Ten-Noah-Spence-remains-strong-prospect.html"}
