{"authors":["Brandon Riddle"],"date_download":"2018-10-30 19:22:02","date_modify":"2018-10-30 19:22:02","date_publish":"2015-11-06 00:00:00","description":"Arkansas' two U.S. senators Wednesday said they respected President Barack Obama's right to nominate Justice Antonin Scalia's successor but questioned the Supreme Court nomination and its timing during an election year.","filename":"data/vaneerConsumption/BoozmanCottonsaySenateshouldntconsiderSupremeCourtnominee.json","image_url":"https://media.arkansasonline.com/img/photos/2015/11/06/FotorCreated_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_mar_16_boozman-co_786405d7d9c90ee99551e08a057c7dee__page=5_1540927322.html","title":"Boozman, Cotton say Senate shouldn't consider Supreme Court nominee","title_page":"Boozman, Cotton say Senate shouldn't consider Supreme Court nominee","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Arkansas' two U.S. senators Wednesday said they respected President Barack Obama's right to nominate Justice Antonin Scalia's successor but questioned the Supreme Court nomination and its timing during an election year.\nU.S. Sens. Tom Cotton and John Boozman in separate statements said the Senate should not consider the nominee, adding that American voters should be afforded the opportunity to voice their opinions on the court's future.\nTheir comments came after Obama earlier in the day nominated appeals court Judge Merrick Garland to serve on the nation's highest court.\n[RELATED STORY: Obama nominates Judge Merrick Garland to Supreme Court]\nBoozman said \"the Senate has made it clear that we do not intend to move forward on it\" and that Obama's role \"ends with selecting a candidate for the vacancy.\"\nIn his statement, Boozman also called Senate Minority Leader Harry Reid's view that the Senate should vote on the nominee \"a display of constitutional ignorance\" and \"highly hypocritical given the words and actions of Senate Democrats in previous election years.\"\nCotton said in his statement that \"the stakes are high and we cannot rush this decision.\"\nHe added: \"Why would we cut off the national debate on the next justice? Why would we squelch the voice of the populace? Why would we deny the voters a chance to weigh in on the make-up of the Supreme Court? There is no reason to do so.\"\nBoozman's Democratic challenger in the Senate race, former prosecutor and U.S. Attorney Conner Eldridge, said Boozman \"doubled down on his refusal to meet with the nominee\" shortly after Obama's nomination announcement.\n“The American people deserve to have this nominee fully vetted so they can make an informed decision and have their voices heard. But, Senator Boozman won’t even listen,\" he said.\nU.S. Rep. French Hill of Arkansas in a statement Wednesday reiterated his view that the Supreme Court nomination should be left to the next president.\n“I am confident that the leadership of our Senate will do what is in their best judgment in regard to the nominee,\" he said.\nArkansas Attorney General Leslie Rutledge also reacted to Obama's nomination Wednesday, echoing Boozman and Cotton's views regarding the timing of the justice recommendation.\nRutledge said: \"In the midst of a highly contested presidential election, Americans deserve their chance to weigh in on the appropriate direction for the [Supreme] Court.\"\nRead Thursday's Arkansas Democrat-Gazette for full details.","url":"https://www.arkansasonline.com/news/2016/mar/16/boozman-cotton-denounce-presidents-supreme-court-n/?page=5"}
