{"authors":["Associated Press"],"date_download":"2018-10-23 03:46:39","date_modify":"2018-10-23 03:46:39","date_publish":"2016-01-28 19:29:02","description":"SUNLAND PARK, N.M. (AP) — Sunland Park thought it was shedding the taint from a series of scandals and bad headlines, including a fight during a city council...","filename":"data/vaneerConsumption/Bordercityworkstoputscandalsbehindamidnewones.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:045a0726bab44b46822216ea19a0ea16-4PuZeKVXE7cd9005b2c8760bd5ad-53_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421358_Border-city-works-scandals-amid-new-ones_1540266399.html","title":"Border city works to put scandals behind amid new ones","title_page":"Border city works to put scandals behind amid new ones | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Border city works to put scandals behind amid new ones\nSUNLAND PARK, N.M. (AP) — Sunland Park thought it was shedding the taint from a series of scandals and bad headlines, including a fight during a city council meeting and a former mayoral candidate secretly recording an opponent receiving a lap dance from a stripper.\nThen, the elected leaders of the city along the U.S.-Mexico border started getting in trouble again.\nA councilor was arrested during a council meeting on drug charges in September. Ten days later, another was arrested on allegations he gave beer to his 19-year-old girlfriend and another person. A third was evicted from his home by U.S. Marshals.\nIn this Jan. 4, 2016 photo, a U.S. Border Patrol agent patrols Sunland Park along the U.S.-Mexico border next to Ciudad Juarez. The New Mexico border town, next to El Paso, Texas, has struggled to put a series of national scandals behind it until two city councilors were recently arrested. (AP Photo/Russell Contreras)\nThe troubles have prompted renewed calls to disband the city along with an effort by leaders to transform the town, going so far as to hold a recent meeting to encourage residents to run for office in March and discuss different forms of city government.\n\"It's very hard to talk about all the positive things we are doing when this happens,\" said Mayor Javier Perea, who is seeking another term. \"It's like we can't move on from the past.\"\nSome residents have called for the city to adopt a code of ethics for elected officials. \"I think many of us feel we aren't being represented,\" said Orla Arguelles. \"A lot of us feel we've been disempowered.\"\nNearly 40 percent live below the poverty line in the city, where the main source of income comes from the Sunland Park Racetrack & Casino. It's the only American border city that sits south of the Rio Grande.\nThe city drew national attention in 2012 after former mayoral candidate Daniel Salinas was arrested for recording an opponent receiving a lap dance from a topless woman. Salinas pleaded guilty to extortion earlier this year.\nThe year before, former Mayor Martin Resendiz admitted he was drunk when he signed contracts with a California company.\nWhen later confronted after his lack of attendance at council meetings, Resendiz and Salinas, then mayor pro-tem, nearly came to blows in the council chambers as a crowd urged them to fight it out.\nJerry Pacheco, president of the Border Industrial Association, the group that helps operate the nearby unincorporated booming border town of Santa Teresa, New Mexico, said the instability of Sunland Park makes some investors nervous.\n\"If you have $75 million invested in a warehouse in a town near Sunland Park, all you have to do is go to Google to see what is happening around the corner,\" Pacheco said.\nBut Pacheco said he hopes the upcoming Sunland Park elections in March finally will stabilize the city.\nPerea said that's why he's trying to get more residents involved in shaping the city's future. He recently announced that he would be forming various committees to develop policies and projects.\n\"The ethics committee is one of the first ones I want to form,\" Perea said.\nFernando Clemente, a wildlife biologist, said he also intended to seek a council seat. Asked about the previous city's scandals, Clemente shook his head and said, \"I don't want to think about that. I'm running to focus on education.\"\nPerea said he hopes a new council will help the city focus on projects that could generate revenue and tourism, such as developing an area around the Rio Grande and possibly build a port of entry in Sunland Park.\n\"There are a lot of exciting things happening in Sunland Park,\" Perea said. \"We just have to get away from the past.\"\n___\nFollow Russell Contreras on Twitter at http://twitter.com/russcontreras . His work can be found at http://bigstory.ap.org/content/russell-contreras .\nIn this Jan. 4, 2016 photo, Sunland Park Mayor Javier Perea listens to a session on different forms of city government during a meeting to encourage more civic participation in Sunland Park, N.M. The New Mexico border town, next to El Paso, Texas, has struggled to put a series of national scandals behind it until two city councilors were recently arrested. (AP Photo/Russell Contreras)\nIn this Jan. 4, 2016 photo, Sunland Park residents listen to a session on different forms of city government during a meeting to encourage more civic participation in Sunland Park, N.M. The New Mexico border town, next to El Paso, Texas, has struggled to put a series of national scandals behind it until two city councilors were recently arrested. (AP Photo/Russell Contreras)","url":"https://www.dailymail.co.uk/wires/ap/article-3421358/Border-city-works-scandals-amid-new-ones.html"}
