{"authors":[],"date_download":"2018-10-22 22:43:18","date_modify":"2018-10-22 22:43:18","date_publish":"2014-06-10 19:46:01","description":"The summer was supposed to be a chance to wait for the GOP to enact immigration reform, but the crisis on the border puts a new wrinkle on the debate.","filename":"data/vaneerConsumption/BorderChildrenCreateNewWrinkleinImmigrationReformDebate.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/500231/140610-arizona-immigration-jms-1556_a27e392da81158085b27923d764a12bb.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_border-children-create-new-wrinkle-immigration-reform-debate-n127676_1540248198.html","title":"Border Children Create New Wrinkle in Immigration Reform Debate","title_page":"Border Children Create New Wrinkle in Immigration Reform Debate","title_rss":"NULL","source_domain":"nbcnews.com","text":"Just as the president has been trying to show his immigration enforcement policies are working, the situation has become more complicated with the increase of thousands of unaccompanied minors crossing into the U.S. border.\nPresident Barack Obama has tagged the childrens' arrivals at the U.S.-Mexico border a humanitarian crisis and his administration has been adamantly emphasizing the children still can be deported, even after being taken to shelters and released to parents or relatives.\nSign up for breaking news alerts from NBC News\nBut the childrens' arrivals already have been tagged by House Judiciary Committee Chairman Rep. Bob Goodlatte, R-Va., as “administration-made” and are happening at a critical time. These summer months were to be the last chance for the House GOP to act on immigration reform before Obama took some presidential action on immigration.\nEven so, members of Congress got a briefing on the situation Monday afternoon from Department of Homeland Security, Health and Human Services, State Department and other administration officials, according to an agenda of the meeting provided by a congressional source.\nWhite House Press Secretary Josh Earnest was adamant Tuesday when asked whether the White House was concerned the children _ many who have arrived on their own, have been crowding Border Patrol processing centers and forced the opening of three emergency shelters _ would derail immigration reform efforts.\n“No, we’re not,” Earnest said Tuesday.\nThe Senate passed a comprehensive immigration bill a year ago June 27. But the GOP House has been delaying action on any of a handful of individual bills approved in committees, on grounds their rank and file don't trust Obama to enforce immigration laws and that the border is not secure.\nA spokesman for House Democratic Leader Nancy Pelosi said the administration’s steps are proactive to provide humanitarian assistance to the children.\n“House Republicans who are standing in the way of immigration reform should avoid politicizing this urgent situation and instead immediately enact bipartisan comprehensive legislation that secures our borders, protects and unites our families,” said spokesman Jorge Aguilar.\nAguilar said that in fact the situation points out the need for changes to the current asylum process to reduce the inflow of unaccompanied children and unite them with families.\nA request by email for comment from House Speaker John Boehner was not immediately returned.\nDemocratic Rep. Henry Cuellar, whose district includes part of the Rio Grande Valley where many of the children are entering the U.S., said the effect on immigration reform “depends on how our Republican friends take this” but added the children are a unique situation.\n“No matter if you are a liberal or a conservative or a tea party member, if you sit down with those kids, no matter how conservative you are, it has to pull at your heartstrings,” Cuellar said.\nChildren are arriving largely from Central American countries and Mexico. Some are caught crossing the border illegally, others present themselves to Border Patrol agents and others slip in the U.S. without notice.\nBy law Mexican children can be returned to their country, while the Central American children have to be processed in 72 hours and then sent on to temporary shelters and eventually reunited with a parent or sponsor. Those without relatives or sponsors go to foster care. Each still must go through deportation proceedings.\nCuellar, who serves on the House Appropriations Committee, said the situation demands attention because the two hours or so that agents are spending processing each child, is two hours of time not spent at the border.\nObama had been willing to wait out the primary season for immigration reform, in which many incumbent GOP members have been drawing anti-immigration reform, tea party opposition. But now the kids are here, and many are speculating it’s because word has gotten back to the countries they are fleeing that they are treated well when they arrive and are released to their parents while awaiting deportation hearings.\nOthers say a combination of factors are at work. Some cite previous releases and good treatment of immigrants as well as violence, gangs and cartels preying on children in Central American countries. Others have stated crackdowns on immigration in Arizona have shifted routes to the U.S. to south Texas.\nSen. Marco Rubio, R-Fla., said the humanitarian concerns should come first.\n“I think we are struggling to find how to handle the situation because it’s a serious one involving children, the most vulnerable of all people,” Rubio said in an interview with CBS. He said he can relate to the situation having seen mass migrations from Haiti and Cuba.\nThe issue is related to immigration reform, which he said is right for the country. But he added that allowing 47,000 children or more to stay in the country legally sets a precedent for another 147,000 to come.\nMaryland Rep. Steny Hoyer, the No. 2 House Democrat, said passing immigration reform as the Senate did would strengthen border security and provide resources to handle processing backlogs.\n\"The humanitarian crisis occurring at the border is a reflection not of inadequate border security, but of Congress' failure to reform a broken immigration system that is responsible for the processing backlog that the administration is now working to correct,\" Hoyer said.\nDemocrats of the House Homeland Security Committee sent a letter expressing concerns about whether DHS has adequate resources. They said recent requests from the administration for additional money for dealing with the children and DHS \"underscores the compelling need for more resources.\"\nThe Senate Appropriations Committee approved a spending bill for the next fiscal year starting Oct. 1 that includes nearly $2 billion for the children Tuesday.\n\"The plight of unaccompanied children is a humanitarian crisis that demands our immediate attention,\" said Sen. Barbara Mikulski, D-Md., the committee's chairwoman.","url":"https://www.nbcnews.com/news/latino/border-children-create-new-wrinkle-immigration-reform-debate-n127676"}
