{"authors":[],"date_download":"2018-10-22 22:58:57","date_modify":"2018-10-22 22:58:57","date_publish":"2014-06-11 16:00:43","description":"Secretary Jeh Johnson said Wednesday that the influx of children from Central America is overwhelming the border.","filename":"data/vaneerConsumption/BorderFloodStrainingResourcesHomelandSecurityChief.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/502356/border-ejo-61114_5ad517a7b6bc045585fe5f7781642ab3.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_border-flood-straining-resources-homeland-security-chief-n128511_1540249137.html","title":"Border Flood Straining Resources: Homeland Security Chief","title_page":"Border Flood Straining Resources: Homeland Security Chief","title_rss":"NULL","source_domain":"nbcnews.com","text":"Homeland Security Secretary Jeh Johnson called the influx of children from Central America into the U.S. a “problem of humanitarian proportions,” and told lawmakers Wednesday that resources are being strained addressing immigration on the border.\n“We’ve had to surge resources normally dedicated to things like border security,” Johnson told the Senate Judiciary Committee.\nHis appearance before Congress comes a day after a Senate appropriations panel voted to approve an Obama administration request for $2 billion to handle the increase.\nThe number of children without parents crossing the border has grown rapidly in recent years — and government facilities are overwhelmed trying to process them all and temporarily care for them.\nFederal statistics show about 6,000 to 7,500 children arrived illegally from 2008 to 2011 — but the number jumped to 13,625 in 2012 and to more than 24,000 in 2013, The Associated Press reported.\nThis year, the number could swell to an estimated 90,000.\nThe Obama administration is asking Congress for another $116 million to deal with the surge.\nJohnson said the surge of children from countries such as Honduras, Guatemala and El Salvador is being driven by violence and poverty in their home nations.\nRepublican senators told Johnson that one of the big factors leading to the surge of children arriving at the border is the administration's failure to be clear that illegal immigration of any kind will not be tolerated.\n\"We're having a humanitarian disaster, caused by a legal disaster. You and the president have failed to send a message that people cannot come here lawfully,\" said Sen. Jeff Sessions, R-Ala.\nThe government is still looking for more space — beyond the three military facilities already being used to process the children before they are turned over to the Department of Health and Human Services.\nJohnson said he called Arizona Gov. Jan Brewer over the weekend to tell her that some of the unaccompanied children are being taken to Nogales, Arizona, for processing, but that none of them will be released into the state.\nCharities, meanwhile, have been pitching in: The Red Cross has provided blankets and the Texas Baptist Men is supplying shower trailers.\nThe U.S. is also running Spanish-language radio, print and TV ads in Central America to talk about the dangers of sending children over the border and into the hands of criminal smugglers.\n— Pete Williams","url":"https://www.nbcnews.com/news/latino/border-flood-straining-resources-homeland-security-chief-n128511"}
