{"authors":["Elizabeth Aguilera","Julie Cart","David Gorn","Felicia Mello"],"date_download":"2018-10-30 23:12:20","date_modify":"2018-10-30 23:12:20","date_publish":"2017-02-22 00:00:00","description":"Hundreds of companies have submitted bids on building prototypes of President Trump’s Mexico border wall in San Diego—although but no contracts have been awarded yet for the project that was supposed to begin this month.","filename":"data/vaneerConsumption/BorderwallprototypestogoupthissummerinSanDiego.json","image_url":"https://calmatters.org/wp-content/uploads/Screen-Shot-2017-02-22-at-10.44.23-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles_trump_california__1540941140.html","title":"Border wall prototypes to go up this summer in San Diego","title_page":"Border wall prototypes to go up this summer in San Diego | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Hundreds of companies have submitted bids on building prototypes of President Trump’s Mexico border wall in San Diego—although no contracts have been awarded yet for the project that was supposed to begin this month, according to federal reports obtained by the San Diego Union-Tribune.\nU.S. Customs and Border Protection said the prototypes will be done by September in Otay Mesa. Congress has not yet approved funding for the full wall, but it did approve $20 million for the prototypes, taken from funds set aside for mobile video surveillance.\nAbout a third of the miles along the border are already fortified with walls and barriers and it’s unclear of the new Trump wall will build around what is already standing or if it will tear down and replace.\nThe project will include four to eight 30-foot tall walls that will be built in 30 days. The prototype walls must also be unable to be climbed and must prevent digging underneath to a depth of at least 6 feet. The agency said the prototypes could stay up and act as barriers in the future.\nWhile it’s a win for Trump if this begins soon, California lawmakers are considering legislation that would punish those who build the wall by prohibiting them from doing business with the state of California and by requiring state pension funds to divest from those companies.\nCritics of the president’s plan say there hasn’t been enough information released about the cost and the environmental impact along the border. Two pending lawsuits attempt to extract more information about the wall—including its construction schedule, analysis of eminent domain, environmental impact and what will happen related to the Tohono O’odham Nation.\nTrump’s 2018 budget sets aside $3.6 billion for the border wall.","url":"https://calmatters.org/articles/trump_california/border-wall-prototypes-go-summer-san-diego/"}
