{"authors":["Stephen Glover For The Daily Mail"],"date_download":"2018-10-22 20:30:09","date_modify":"2018-10-22 20:30:09","date_publish":"2016-01-28 01:35:29","description":"Boris wants to be loved. He shuns unpopularity. Unlike Churchill, he does not seem prepared to put principle and belief and conviction before his overweening ambition. He wants to play it safe.","filename":"data/vaneerConsumption/BorisJohnsonmustemulateWinstonChurchillscourageandleadtheOutcampaign.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/309842D400000578-0-image-a-106_1453944896117.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/debate_article-3420269_STEPHEN-GLOVER-Boris-emulate-hero-Churchill-s-courage-lead-campaign-forget-PM_1540240209.html","title":"Boris Johnson must emulate Winston Churchill's courage and lead the 'Out' campaign","title_page":"Boris Johnson must emulate Winston Churchill's courage and lead the 'Out' campaign | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Boris Johnson's great hero is Winston Churchill. To a large degree he models himself on him, and in his own mind compares himself to the great war leader. A little over a year ago, he wrote a biography extolling him.\nThere are certainly some striking similarities. From an early age Churchill was convinced that he would be a man of destiny. Boris also believes that the gods have fashioned him to do something great for this nation.\nChurchill had Promethean energies. So does Boris. Churchill had a way with words. So, albeit not as remarkably, does Boris. Churchill was an outsider who was accused by his enemies before his passage of glory of being an insufferable egotist. So is Boris.\nBoris wants to be loved. He shuns unpopularity. Unlike Churchill, he does not seem prepared to put principle and belief and conviction before his overweening ambition\nBut if the two men have much in common there is at least one startling point of difference. Winston Churchill was a man of boundless political courage. Boris — I hate to say it — has the look of a political coward.\nAdmiration\nThe distinction may be that the man who saved our country nearly 76 years ago did not crave love and admiration from his peers. Again and again, he was prepared to put himself in an unpopular, and often very small, minority.\nSometimes he was right, sometimes he was wrong. He was wrong to oppose home rule for India during the early 1930s, and wrong, too, in the context of the times to plead that Edward VIII should delay his abdication after marrying the divorced Wallis Simpson. He was right, in a visionary way, when warning of the dangers of German rearmament even before Adolf Hitler came to power.\nBoris, by contrast, wants to be loved. He shuns unpopularity. And, unlike Churchill on a number of crucial occasions, he does not seem prepared to put principle and belief and conviction before his overweening ambition. In short, he wants to play it safe.\nWinston Churchill was a man of boundless political courage. Boris has the look of a political coward\nHow else can we explain his refusal so far to place himself at the head of the Brexit campaign to take Britain out of the EU? As a journalist, Boris was a true Eurosceptic, whereas Prime Minister David Cameron applied the description to himself in order to keep the Tory Right on side.\nUnlike Cameron and Chancellor George Osborne and most of the Cabinet, Boris is not frightened by the prospect of Britain leaving the EU. He has recently said this country could have a 'great, great future outside the EU'. He knows the organisation is economically sclerotic, and he has confidence in the British people to flourish if our national sovereignty is restored.\nWhy doesn't he seize the opportunity? Because he is frightened the Brexit movement may lose. He is perfectly aware that David Cameron is going to extract some very paltry concessions from the EU yet attempt to represent them as significant.\nBut Boris doesn't fancy standing up to the great and the good — the Cabinet ministers, BBC, CBI, governor of the Bank of England and the titans of 'big business' who will be filling our ears with scare stories.\nBoris. Churchill was an outsider who was accused by his enemies before his passage of glory of being an insufferable egotist. So is Boris\nWhat would Boris's hero, Winston Churchill, do? It is surely obvious. He would put his country and his principles before narrow ambition, and take on dull orthodoxy with a vengeance\nHere, I submit, Boris is in danger of making two grave mistakes. The first is that he underestimates the growing chances that Brexit will happen as more and more people realise that staying in the EU will render us incapable of controlling our borders against the ever increasing torrent of migrants.\nThe second mistake is perhaps even more serious. Boris believes, as do many political pundits, that being part of an unsuccessful Brexit campaign would tar him with failure, and amount to virtual political suicide. I'd say that the opposite is much more probable.\nIf Boris Johnson led a Brexit campaign that fought an honest fight and went down to an honourable defeat, he would enhance his reputation in the country.\nAnd by attracting the admiration of the Tory Right, and the respect of his opponents in the Conservative Party, he would increase his chances of succeeding Mr Cameron when he steps down (which I suspect may turn out to be later than 2019, the date indicated by the Prime Minister before the last election).\nIn other words, by showing courage and leadership even in a failed cause (and, as I say, it may not fail), Boris would transform himself from the transparently calculating and over-cautious politician he is at the moment into an almost Churchillian figure.\nLet me also inform Boris that if he follows the Cameron-Osborne line, and enthusiastically endorses pretty meaningless concessions, he will find himself shunted into some unglamorous Cabinet post where he will grow quickly bored. He will be their creature rather than his own man. They will patronise him.\nRudderless\nSo I am not asking Boris to go over the top only to be cut to pieces. I am suggesting that if he embraces the cause in which he believes he will, whatever the outcome, do his political standing no end of good — and his country a great and vital service.\nIrreverent though I may have sometimes been towards Boris, it's surely obvious that I believe there is no one else who can pull together the at present rudderless movement to leave the EU, dominated as it is by a motley collection of fairly obscure and not very formid-able individuals.\nIf Boris Johnson led a Brexit campaign that fought an honest fight and went down to an honourable defeat, he would enhance his reputation in the country\nNor are there any other plausible big beasts lurking in the undergrowth. Nigel Farage is too manifestly associated with Ukip, and therefore a potentially divisive figure who is not trusted by many Tory-voting Eurosceptics. Besides, he is growing ever more eccentric and unpredictable.\nAmong the diminishing band of Cabinet Eurosceptics, Theresa May would hardly be convincing heading a national campaign of this sort, effective Home Secretary though she has been.\nThe Justice Secretary, Michael Gove, seems to me to have lost the will to fight, though I hope I am wrong.\nDestiny\nAnd although I'm sure that Iain Duncan Smith will go down in his history as a great welfare reformer, I don't think he has the necessary leadership qualities for this task, though he can still make a valuable contribution within the Brexit camp.\nNo, it has to be Boris. There is no one else but him. Of course he has his flaws — a tendency not to be on top of the detail of an argument, and sometimes too much larkiness — but he has the inestimable virtue of reaching out far beyond the Tory tribe. That, of course, is why Cameron and Osborne still fear him.\nThe more I think about it, the surer I am that the choice in front of Boris is not really a choice at all. He can trudge along supporting a cause in which he does not really believe, and accept whatever ministerial bauble the Prime Minister and Chancellor deign to toss in his direction.\nOr he can establish himself as a statesman far above the common run, not merely concerned with petty calculations of personal advancement, as I am afraid nearly all modern politicians are.","url":"https://www.dailymail.co.uk/debate/article-3420269/STEPHEN-GLOVER-Boris-emulate-hero-Churchill-s-courage-lead-campaign-forget-PM.html"}
