{"authors":["Michael Cunningham"],"date_download":"2018-10-30 19:16:29","date_modify":"2018-10-30 19:16:29","date_publish":"2018-09-13 17:12:00","description":"It’s only Week 3 of Weekend Predictions, but already some trends have emerged.","filename":"data/vaneerConsumption/BoringBulldogsrollTechandFalconsbouncebac.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/28/Videos/4449615.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_mike-check_weekend-pre_a64b3255160519f59cf932cbe02d9e29__1540926989.html","title":"Boring Bulldogs roll, Tech and Falcons bounce bac","title_page":"Weekend Predictions: Boring Bulldogs roll, Tech and Falcons bounce bac","title_rss":"NULL","source_domain":"ajc.com","text":"It’s only Week 3 of Weekend Predictions, but already some trends have emerged. The Falcons still can’t score from the red zone, Georgia Tech still can’t hold a lead and, as one sharp reader noted, my picks still are bad. Nothing gets by that guy.\nMeanwhile, Georgia is ... kind of boring, which is new. I mean that as a positive for the Bulldogs. They were a machine in that third quarter against South Carolina, and they should easily roll over Middle Tennessee (plus-33.5 points).\n» How to watch: Week 3 college football schedule\nLet’s say Tennessee is as bad it looked in that loss to West Virginia and Vanderbilt isn’t as good as it seems. That would mean a worthy opponent won’t visit Sanford Stadium until Nov. 10 vs. Auburn. That’s good for Georgia’s chances of navigating its schedule, not so good for entertainment value at home games.\nBut I like big favorites when they are ruthlessly efficient against lesser foes, so I’m taking the Bulldogs and giving the points.\nGeorgia Tech (minus-4 1/2) at Pittsburgh\nGeorgia Tech is not boring, and I don’t mean that as a positive for the Yellow Jackets. They blew a 10-point lead over the final 12-1/2 minutes at South Florida and lost by 11, this despite gaining 602 yards. Impressive, but Tech is the gold standard for empty yards and blown leads so it wasn’t nearly bad enough to qualify for worst loss.\nThe Jackets gained 655 yards against Tennessee last season (605 in regulation) and lost after leading by two touchdowns in the second half. That Tech meltdown featured special-teams gaffes, a lost fumble and a defensive surrender. Same thing happened at South Florida but at least Paul Johnson’s offense gained lots of yards.\nYou can make the case that USF’s two kickoff returns for TDs are outliers and that losing the fumble was bad luck. I’ll buy that, if only because I’m admittedly biased in favor of the metrics, which peg the Jackets as a two-touchdown favorite at Pitt.\nTech wins and covers. At least I know I’ll probably feel good about that pick for three quarters.\nPanthers (plus-5 1/2) at Falcons\nMatt Ryan seemed weirdly off at Philadelphia last week. Does he not trust his protection? Does he lack faith in the play calls? Is his arm tired from counting all that money? (Sorry, that’s a bad joke because obviously Ryan doesn’t literally count his cash. He has people for that.)\nRyan offered his usual deep insights this week, such as: “We have to find a way to get the job done.” Ryan did say the Falcons need to be more balanced after they had 43 passes vs. 18 runs against the Eagles. Sounds like he needs more help from the game plan, a message that coordinator Steve Sarkisian is sure to receive just as soon as he gets comfortable in his job.\nThe narrative is that the Falcons must be great on offense after Pro Bowl defenders Keanu Neal and Deion Jones went on injured reserve. My take is that the Panthers are one of several middling offensive teams on the schedule, so the defense can regress a bit and still get it done.\nFalcons win by a field goal.\nNFC South\nBrowns (plus-9) at Saints\nFun fact: The Saints have lost their opening game in five consecutive seasons. This time they managed to lose at home to Ryan Fitzpatrick, who was subbing for suspended QB Jameis Winston. This development provides a rare chance for me to say I believe in Tyrod Taylor and it’s not a joke. Browns cover.\nEagles (minus-3) at Bucs\nDirk Koetter was remembered fondly by Falcons faithful when Kyle Shanahan was bad, then forgotten when Shanahan became the best offensive coordinator the league (until he wasn’t). Time to remember Koetter again after his offense crushed the Saints a few days after Sarkisian’s Falcons group flopped. Bucs cover.\nOther NFL games of interest\nPatriots (minus-1) at Jaguars\nOn the one hand, I believe the Jaguars are overvalued because their offense remains suspect. On the other hand, it just feels wrong to back the Evil Empire. Then again, the Jaguars deserve to lose because of their dumb legal dispute over the trademark “Sacksonville.” Pats cover.\nChiefs (plus-4 1/2) at Steelers\nHoldout Steelers running back Le’Veon Bell was spotted at a Miami Beach nightclub this week. That caused a stir among people with sad, boring lives. Maybe he was out celebrating Pittsburgh’s big tie against the Browns. I like the Chiefs as a ’dog.\nChargers (minus-7.5) at Bills\nNo truth to the rumor that the NFL ordered the Bills to bench Nathan Peterman because he’s hurting its defense in the Colin Kaepernick collusion case. Rookie Josh Allen will start at QB after Peterman was awful again in Week 1. Now the Bills have a chance, so I’m taking them with the points.\nSEC games of interest\nLSU (plus-10.5) at Auburn\nAuburn blew a 20-point lead in a loss to LSU last season. Said Gus Malzahn: “There's really not going to be a whole lot of motivation and rah-rah stuff as far as last year.” That’s a big surprise. Who knew Malzahn’s range of human emotions went that far? Auburn wins, but LSU covers.\nAlabama (minus-21.5) at Ole Miss\nTrue story: A guy at my barber shop argued this week that Jalen Hurts is a better quarterback for Alabama than Tua Tagovailoa. Suddenly Nick Saban suddenly burst through the door and accused him of stirring up controversy, pleasing those Crimson Tide fans so bored that they need to be mad about something. Tide cover again.\nVanderbilt (plus-13.5) at Notre Dame\nLast week I joked about Vandy being Vandy, then the Commodores beat up on a decent Nevada team. I guess that makes me the Vandy of football predictions. Life comes at you fast. Commodores muck up the game and cover.\nColorado State (plus-20.5) at Florida\nI joked about Kentucky’s 31-game losing streak to Florida, then the Wildcats beat the Gators in the Swamp. I guess that makes the Gators the Kentucky of the SEC. Life comes at Dan Mullen fast. Colorado State is awful, though, so Gators cover the big number.\nACC games of interest\nGeorgia Southern (plus-33) at Clemson\nLife in FBS has been tough for the GSU since coach Willie Fritz left town. But they earned two victories in November and beat South Carolina State and UMass to start this season. That should give the Eagles just enough confidence for Clemson to crush their spirits. They’ll still cover.\nFlorida State (minus-3) at Syracuse\nThe Seminoles nearly lost to Samford last weekend. That wouldn’t have been as embarrassing as FSU’s Turnover Backpack, the lamest entry in the sideline-trophy trend. Syracuse covers.\nDuke (plus-6) at Baylor\nThe Blue Devils earned an impressive victory at Northwestern last week to move up in the Elite Private Schools in Big Boy Football rankings. Notre Dame remains in the lead. Duke beats the spread.\nLast week’s picks\nAgainst the spread: 5-6 (9-11-1 season)\nAJC pick ’em contest (straight up): 8-7 (14-16 season)","url":"https://www.ajc.com/blog/mike-check/weekend-predictions-boring-bulldogs-roll-tech-and-falcons-bounce-back/G6vLYrqY91sArj1mZJIcCJ/"}
