{"authors":["Associated Press"],"date_download":"2018-10-23 01:57:21","date_modify":"2018-10-23 01:57:21","date_publish":"2016-01-11 13:22:34","description":"SARAJEVO, Bosnia-Herzegovina (AP) — Police in Bosnia on Monday detained a high-ranking official of the Ministry for Security who is suspected of obstructing ...","filename":"data/vaneerConsumption/Bosnianpolicearresthighrankingofficial.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393924_Bosnian-police-arrest-high-ranking-official_1540259841.html","title":"Bosnian police arrest high-ranking official","title_page":"Bosnian police arrest high-ranking official | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bosnian police arrest high-ranking official\nSARAJEVO, Bosnia-Herzegovina (AP) — Police in Bosnia on Monday detained a high-ranking official of the Ministry for Security who is suspected of obstructing the investigation against an alleged drug lord who is currently on trial in Kosovo and who apparently ran his business out of Sarajevo.\nA statement from the Bosnian prosecutors' office said Bakir Dautbasic, the ministry secretary, had tried — together with a woman who was also arrested — to persuade a witness to make false statements in the case against Naser Keljmendi, who is charged with murder, organized crime and sale and production of drugs.\nBosnia's authorities have pledged to step up their fight against terrorism, organized crime and corruption, announcing that operations will include public figures. The state prosecution office lodged a record number of charges in 2015.\nOf the 195 cases against 431 suspects, 59 were related to crimes committed during Bosnia's 1992-95 war and the rest were for organized crime and corruption.\nThe office pledged in a statement on Monday it will work even harder in 2016 \"in the interest of the rule of law and all citizens.\"\nHowever, not all are happy with the work of the office, courts and police.\nBosnian Serb leader Milorad Dodik has launched several campaigns against the state prosecutor and court, accusing them of arresting too many Serb war crimes suspects. His opponents claim he is just trying to protect himself and his allies.\nLast week state police raided a bank looking for evidence in a case against Dodik. Prosecutors suspect he and the bank were involved in money-laundering.","url":"https://www.dailymail.co.uk/wires/ap/article-3393924/Bosnian-police-arrest-high-ranking-official.html"}
