{"authors":[],"date_download":"2018-10-22 21:29:35","date_modify":"2018-10-22 21:29:35","date_publish":"2014-06-05 15:16:05","description":"Three Bosnian Serb former soldiers have been arrested on suspicion of war crimes following the discovery last year of possibly the largest mass grave of Bosnia's 1992-95 conflict.","filename":"data/vaneerConsumption/BosnianSerbExSoldiersArrestedonSuspicionofWarCrimes.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/489681/140605-bosnia-mass-grave-11a_a85b3e8fd65a87c5cd5050e77e21ae40.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_bosnian-serb-ex-soldiers-arrested-suspicion-war-crimes-n123571_1540243775.html","title":"Bosnian Serb Ex-Soldiers Arrested on Suspicion of War Crimes","title_page":"Bosnian Serb Ex-Soldiers Arrested on Suspicion of War Crimes","title_rss":"NULL","source_domain":"nbcnews.com","text":"Thousands of Bosniaks and Croats perished in Bosnian Serb detention camps in Prijedor as part of bid to drive non-Serbs from the land.\nAround 100,000 people died in the war, the large majority of them Muslim Bosniaks.\n\"The men were part of the Serb Republic army and are suspected of killing seven Bosniaks in the area of Kozarac,\" the prosecutor's office said in a statement. It said the killings took place between May and June 1992.\nLast year, Bosnian forensic experts unearthed the remains of 435 people from the Tomasica mass grave near Prijedor.\nIt is believed to contain the remains of around 1,000 victims, which would make it the largest mass grave in the Balkan country. Experts are working on identifying the victims.\nSo far, 178 have been identified through DNA analysis, among them a man and his six sons.\nThe youngest son was 18 and the oldest 29 when they were killed, said Lejla Cengic, a spokeswoman for the government's Institute for Missing Persons.\nIn 2001, forensic experts found 373 victims they believe were originally buried at Tomasica, then reburied at a second site as part of a bid to conceal evidence of atrocities.\nExhumations halted over the winter but are expected to resume soon.\nAround 1,200 people are still registered as missing in the Prijedor area.\nThe Hague-based United Nations war crimes tribunal has sentenced 16 Bosnian Serbs to a total of 230 years in prison for atrocities in the Prijedor area.\n- Reuters","url":"https://www.nbcnews.com/news/world/bosnian-serb-ex-soldiers-arrested-suspicion-war-crimes-n123571"}
