{"authors":["David Bossie"],"date_download":"2018-10-30 21:51:55","date_modify":"2018-10-30 21:51:55","date_publish":"2015-07-27 11:59:08","description":"After more than four and half years, grassroots conservatives have grown tired of waiting for John Boehner to pass the conservative agenda.","filename":"data/vaneerConsumption/BossieTheJohnBoehnerProblem.json","image_url":"https://media.breitbart.com/media/2015/07/john-boehner-speaker-of-house-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_27__1540936315.html","title":"Bossie: The John Boehner Problem","title_page":"Bossie: The John Boehner Problem | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"After three election cycles and more than four and half years, grassroots conservatives have grown tired of waiting for John Boehner to pass the conservative agenda he’s repeatedly promised.\nTime and time again, Boehner has failed to provide a vision or use the robust majority in the U.S. House—which conservatives provided him—to advance our policies. Instead, Speaker Boehner has allowed President Obama to set the debate, set the terms, and summarily clean our clocks. Meekly, Boehner drifts along aimlessly and legislates by cliff and crisis, instead of bringing forward an optimistic agenda of bold colors that the American people crave.\nIt looks as though his empty promises and inaction may be catching up to him. Citizens United recently surveyed a cross-section of our members nationwide about congressional approval and whether their member of Congress should vote to re-elect John Boehner as Speaker of the House. Of the 4,025 polled, less than 6 percent would want their Representative to re-elect Boehner as House Speaker if the election were held today. Grassroots conservatives are through being patient with John Boehner.\nAvailable public polling of all Americans indicates that congressional approval averages a feeble 15 percent. Our survey—which polled our grassroots conservative members—has congressional approval at just over 2 percent, with 95 percent disapproving. These percentages are truly alarming, and they confirm once again the anti-Washington, anti-establishment sentiment that has become palpable in America, and with good reason. What has the Boehner-led Congress done to combat this general distrust in our government institutions? What has he done to contrast the Obama agenda? The short answer is nothing. It is his inaction, incompetence, and utter lack of a conservative agenda that has created the undercurrent visible in Donald Trump’s rise in the polls.\nOf course, it doesn’t have to be this way. Speaker Boehner could simply live up to his promises by holding votes on the bold and popular reforms that the American people want. Then the 247 members of the Republican caucus could go home, stand tall, and promote these reforms against the failed status quo agenda of the left. The U.S. House, led by conservatives, should be the driver of our nation’s public policy debate. Instead, Boehner allows others to fulfill this critical function.\nSpeaker Boehner could be forcing President Obama to choose a veto pen over the popular reforms that the American people are demanding. Obama would be forced to explain those vetoes as the economy limps along, families struggle, illegal immigrants flood our southern border, and aborted baby parts are sold by Planned Parenthood. The Republican Congress must restore trust in government. Boehner can start that process by voting on items such as a balanced budget amendment, congressional term limits, ending congressional pensions, and simplifying the tax code. Conservatives could put their stamp on these reforms like Speaker Newt Gingrich’s “Contract with America” in the mid-1990’s.\nInstead, John Boehner has a problem with members of his conference, because they feel they’ve been used. Conservatives see Boehner moving Obama’s agenda on issues like funding Obamacare, funding Obama’s illegal amnesty, and passing trade promotion authority. Now, Boehner is apparently siding with Obama again by handing out corporate welfare by reauthorizing the Export-Import Bank for their cronies. As Americans who watched Sen. Ted Cruz call the Senate Majority Leader a liar can attest, there is little difference in his mind between the way Reid and McConnell and Pelosi and Boehner run Congress.\nWhen pressed by conservatives for answers, Boehner lashes out at those who question his decisions. He’s attempted to punish conservatives in his caucus such as Mark Meadows, Ken Buck, and Alex Mooney for voting their conscience. As history tells us, strategies such as this don’t work for long.\nIt was grassroots conservatives who put John Boehner in power, and we haven’t seen a positive conservative agenda for America as promised in the last several elections. Because of Boehner’s failure of leadership and a track record of broken promises, conservatives are ready for new leadership in the U.S. House now. Maybe newly empowered conservatives like Congressman Meadows will lead a revolt and finally take back the people’s House.\nDavid Bossie is president of Citizens United.","url":"https://www.breitbart.com/politics/2015/07/27/bossie-the-john-boehner-problem/"}
