{"authors":[],"date_download":"2018-10-22 23:04:21","date_modify":"2018-10-22 23:04:21","date_publish":"2014-05-13 15:47:12","description":"The young men accused of tampering with evidence will be tried in Massachusetts between June and September.","filename":"data/vaneerConsumption/BostonMarathonBombingSuspectsPalsWillbeTriedSeparately.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_16/152271/140710-boston-bombings-330p_0_9854c98323315cfe004ec666a3c21a73.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_boston-marathon-bombing-suspects-pals-will-be-tried-separately-n104266_1540249461.html","title":"Boston Marathon Bombing Suspect's Pals Will be Tried Separately","title_page":"Boston Marathon Bombing Suspect's Pals Will be Tried Separately","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThree college friends of the Boston Marathon bombing suspect will be tried separately, but those trials do not need to be moved out of Massachusetts, a federal judge ruled Tuesday.\nJudge Douglas Woodlock ruled that Azamat Tazhayakov will stand trial on June 30, followed by Dias Kadyrbayev on Sept. 8 and Robel Phillipos on Sept. 29.\nTheir lawyers had asked the federal judge to move the trial out of state, saying that overwhelming media coverage of the case would mean that their clients won't receive fair trials in Massachusetts.\nWoodlock said the defendants could receive fair trials in Boston, or if need be, in Springfield, 80 miles west of Boston. He pointed to the trial of Boston mobster James \"Whitey\" Bulger, which was held in Boston despite the case's high profile.\nProsecutors opposed the venue change but didn't object to severing the trials. Kadyrbayev and Tazhayakov are Kazakhstan nationals who are charged with tampering with evidence for removing Tsarnaev's laptop and a backpack containing fireworks from his college dorm room shortly after last year's fatal bombing.\nKadyrbayev also faces conspiracy and obstruction of justice charges. He and Tazhayakov have been held without bail for more than a year. Phillipos, of Cambridge, is charged with lying to investigators. He has been held under house arrest. Each pleaded not guilty.\n— Associated Press","url":"https://www.nbcnews.com/news/us-news/boston-marathon-bombing-suspects-pals-will-be-tried-separately-n104266"}
