{"authors":["Associated Press"],"date_download":"2018-10-23 04:25:54","date_modify":"2018-10-23 04:25:54","date_publish":"2016-01-28 20:28:34","description":"BOSTON (AP) — Hundreds of newly released court documents in the case of Boston Marathon bomber Dzhokhar Tsarnaev shed little new light on the 2013 attack, bu...","filename":"data/vaneerConsumption/BostonMarathonbombingdocumentsshedlittlenewlight.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421645_Boston-Marathon-bombing-documents-shed-little-new-light_1540268754.html","title":"Boston Marathon bombing documents shed little new light","title_page":"Boston Marathon bombing documents shed little new light | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Boston Marathon bombing documents shed little new light\nBOSTON (AP) — Hundreds of newly released court documents in the case of Boston Marathon bomber Dzhokhar Tsarnaev shed little new light on the 2013 attack, but hundreds more could stay secret for years while he appeals. Tsaranev, 22, was convicted last year and sentenced to death in the bombings, which killed three people and injured more than 260.\nHere's a look at the documents that were unsealed, the documents that remain sealed and why:\n___\nDOCUMENTS RELEASED\nMore than 600 court filings and exhibits were released publicly Wednesday. The filings included defense and prosecution motions to limit the testimony of certain trial witnesses, reports from experts, lists of proposed questions to ask prospective jurors during the selection process, fingerprint reports and FBI lab reports. The documents had been filed and sealed in the two years leading up to and including Tsarnaev's trial but were ordered unsealed by U.S. District Court Judge George O'Toole Jr. after prosecutors and Tsarnaev's lawyers agreed they could be released publicly.\n___\nDOCUMENTS STILL UNDER SEAL\nMore than 300 additional filings and exhibits remain sealed because prosecutors or Tsarnaev's lawyers argue that they should not yet be made public. This list of disputed filings is believed to include statements Tsarnaev made to authorities after his arrest, documents related to a state investigation into a triple murder in Waltham that Tsarnaev's brother, Tamerlan, was a suspect in and other documents that could pertain to intelligence gathering and national security. The judge has asked both sides to submit a list of filings they cannot agree on by Feb. 12. He has also asked for a list of court filings that both sides agree can be released but with some material redacted.\n___\nWHY WILL CERTAIN DOCUMENTS BE KEPT SEALED?","url":"https://www.dailymail.co.uk/wires/ap/article-3421645/Boston-Marathon-bombing-documents-shed-little-new-light.html"}
