{"authors":[],"date_download":"2018-10-23 03:04:33","date_modify":"2018-10-23 03:04:33","date_publish":"2016-01-29 17:45:26","description":"Boston bomber Dzhokhar Tsarnaev on Friday filed an appeal against his death sentence and conviction, handed down last year over one of the deadliest assaults...","filename":"data/vaneerConsumption/Bostonbomberappealsdeathsentenceconviction.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i49w-3bmscybNe842cce83474b5868ae6-738_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3423218_Boston-bomber-appeals-death-sentence-conviction_1540263873.html","title":"Boston bomber appeals death sentence, conviction","title_page":"Boston bomber appeals death sentence, conviction | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Boston bomber appeals death sentence, conviction\nBoston bomber Dzhokhar Tsarnaev on Friday filed an appeal against his death sentence and conviction, handed down last year over one of the deadliest assaults on US soil since the 9/11 attacks.\nThe 22-year-old is currently behind bars in America's harshest maximum security prison, ADX Florence in Colorado, until he can be moved to federal death row.\nIn documents sent to the US federal court in Boston, his lawyers also appealed against a court's decision earlier this month denying his motion for a new trial.\nBoston bomber Dzhokhar Tsarnaev on Friday filed an appeal against his death sentence and conviction handed down last year\nA jury unanimously imposed the death sentence on May 15 after finding the US citizen guilty on all 30 counts related to the bombings, the subsequent murder of a police officer and other crimes carried out while on the run.\nThree people, including a child, were killed and 264 others were wounded in the April 15, 2013 bombings that ripped through the finish line of Boston's marathon.\nTsarnaev apologized to his victims for the first time during a highly emotional court hearing on June 24 when a US federal judge formally imposed the death sentence on six counts related to the bombings.","url":"https://www.dailymail.co.uk/wires/afp/article-3423218/Boston-bomber-appeals-death-sentence-conviction.html"}
