{"authors":[],"date_download":"2018-10-22 21:34:11","date_modify":"2018-10-22 21:34:11","date_publish":"2016-12-01 00:00:00","description":"Boston's Christmas tree is a thank-you gift from Canada for help the city provided a century ago, a reminder not just that it's time to get into the holiday spirit but also what that's really about.","filename":"data/vaneerConsumption/BostonsChristmasTreeTraditionRootedInACanadianThankYou.json","image_url":"https://media.npr.org/assets/img/2016/11/30/tree_on_common1_wide-3fb28fe399d1233f442f8c2ea8b27256efe4b82c.jpeg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=503907535_1540244051.html","title":"Boston's Christmas Tree Tradition Rooted In A Canadian Thank You","title_page":"Boston's Christmas Tree Tradition Rooted In A Canadian Thank You : NPR","title_rss":"NULL","source_domain":"npr.org","text":"STEVE INSKEEP, HOST:\nIt was Election Day when I saw my first Christmas tree of the year. It was in a neighborhood coffee shop. Now, the big Christmas tree in New York's Rockefeller Center is lit. Other trees are up around this country. The city of Boston's official tree has a story behind it. The tree is a gift from the Canadian city of Halifax. Edgar B. Herwick III of member station WGBH reports on the connection between those two cities.\nEDGAR B HERWICK III, BYLINE: On a brisk fall morning, a group of Boston schoolchildren gather on Boston Common. Curiously, in this central city park once traversed by American titans like Paul Revere, they wave an enormous Canadian flag.\nUNIDENTIFIED CHILDREN: (Chanting) Canada, Canada.\nHERWICK: As a flatbed truck rolls by carrying a 47-foot Canadian white spruce, excitement boils over.\n(SOUNDBITE OF TRUCK HORN)\nHERWICK: Moments later, Nova Scotia's chief town crier, James Stewart, unfurls a scroll.\nJAMES STEWART: Nova Scotia proud, Boston strong, may this tree welcome all this Christmas season. Made woke up all.\nHERWICK: This is Boston's official 2016 Christmas tree and a gift from the people of Nova Scotia, a thank you for events a century ago in the Canadian province's coastal capital of Halifax. On December 6, 1917, a French ship, the Mont Blanc, was preparing to head overseas to fight in World War I, when it ran into trouble.\nPETER DRUMMEY: In Halifax Harbor, the Mont Blanc collides with another ship and catches on fire.\nHERWICK: That's Peter Drummey, librarian at the Massachusetts Historical Society. The Mont Blanc was fully loaded with high-powered explosives. And 20 minutes after the fire ignited, so did the munitions. More than a thousand people were killed instantly. Whole neighborhoods were destroyed. Later that morning, word reached Massachusetts. The governor dispatched a train carrying doctors, Red Cross nurses and medical supplies, which fought its way 700 miles through a blizzard to reach a devastated Halifax.\nDRUMMEY: Their presence is felt almost immediately. And of course, that very rapid response saved lives.\nHERWICK: The aid workers set up hospitals, built shelters and combed the snowy rubble for survivors. As Christmas approached, with children orphaned, thousands in tent hospitals and thousands more homeless, Drummey says Bostonians helped keep spirits up.\nDRUMMEY: The medical personnel putting Christmas trees up in the hospitals and decorating, even when there's shambles of the town remaining. They were sent out sort of as Santa Claus' helpers to distribute presents and gifts to local children.\nHERWICK: Boston would continue to support the aid effort for months. The next December, Nova Scotia offered a poignant thank you to the people of Boston - a Christmas tree. And the story might have ended there, but...\nDRUMMEY: In the 1970s, I think there was a feeling that the generation who had lived through and experienced this was starting to disappear.\nHERWICK: And so in 1971, the city of Halifax renewed the bond with another Christmas tree. They have done so every year since. The tree gets lit tonight and will glow on Boston Common until early next year.\nFor NPR News, I'm Edgar B. Herwick III in Boston.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=503907535"}
