{"authors":["Michael Patrick Leahy"],"date_download":"2018-10-30 21:43:03","date_modify":"2018-10-30 21:43:03","date_publish":"2016-01-26 13:36:02","description":"The Boston Globe is endorsing Ohio Governor John Kasich for the Republican nomination for president, one week before the Iowa Caucuses and two weeks and before the first-in-the nation primary in neighboring New Hampshire. |","filename":"data/vaneerConsumption/BostonGlobeEndorsesJohnKasich.json","image_url":"https://media.breitbart.com/media/2016/01/AP_30005519853.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_26__1540935783.html","title":"Boston Globe Endorses John Kasich","title_page":"Boston Globe Endorses John Kasich | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Boston Globe is endorsing Ohio Governor John Kasich for the Republican nomination for president, one week before the Iowa Caucuses and two weeks and before the first-in-the nation primary in neighboring New Hampshire.\nNew Hampshire Republicans can do their party a critical service on Feb. 9 by voting for an experienced political figure with a record of results, and thus dealing a blow to the divisive, demagogic candidates running on nativism and other political simplicities. The Globe urges them to support John Kasich, whose record as governor of Ohio shows him to be a pragmatic, fiscally responsible executive, but one who is also concerned with helping the poor. His success in that important swing state, and his record as a moderate conservative who is willing to compromise in pursuit of results, suggests he is the Republican hopeful most likely to be successful on the national stage. By voting for Kasich, New Hampshire can reward a candidate whose politics have been largely positive — and rebuke those candidates who have spent their campaign appealing to voters’ fears and biases.\n“This will have the usual effect of any Globe endorsement — nothing,” Boston talk radio host Howie Carr tells Breitbart News.\n“The Globe is advising Republicans, in a different state, many of whom left Massachusetts because of the toxic effects of policies espoused by the newspaper, how to vote? The Globe should stick to something they’re good at, like sucking up to Brady and Belichick,” Carr adds.\nThe Globe’s endorsement of Kasish is not good news for Florida Sen. Marco Rubio, who lost the New Hampshire Union Leader endorsement to New Jersey Governor Christ Christie in November, and lags behind Trump, Cruz and Kasich in the most recent New Hampshire polls.\nFacing what recent polls anticipate will be a likely third place place finish in next Monday’s Iowa GOP caucuses, Rubio strategists have been hoping for a breakout performance in New Hampshire.\nOn Monday, just before the announcement of the Globe’s endorsement of Kasich, Politico reported “here in New Hampshire, four contenders [are] vying to be the mainstream alternative to Donald Trump or Ted Cruz still have a fighting chance.”\n“Even with the Iowa caucuses less than a week away,” the Politico reporters wrote, “John Kasich, Marco Rubio, Jeb Bush and Chris Christie are dedicating significant time to the first primary state because for at least two of them, a finish outside of the top three could spell the end.”\nThe Real Clear Politics average of the five most recent polls conducted in New Hampshire since January 13 show Donald Trump in first place at 32 percent, a 20 percent lead over his nearest rival. Sen. Ted Cruz is in second with 12.8 percent and Kasich is in third with 12 percent. Rubio lags behind in fourth with 10.7 percent. Former Florida Governor Jeb Bush is fifth with 8 percent and current New Jersey Governor Chris Christie is in sixth with 7.3 percent.\nChristie recently lowered expectations for his own performance in New Hampshire when he declared “I want to be the number one governor coming out of New Hampshire. So you can read through that what you will.”\nChristie has set the bar he needs to cross to get a ticket out of New Hampshire fairly low– all he beat Kasich and Bush. He could accomplish that lower objective while finishing no higher than fourth. On the bright side for Rubio, newspaper endorsements of presidential candidates in 2016 do not carry the weight they once did.\nThe Globe took a shot at GOP front runner Donald Trump, who they say “has exploited anti-immigrant and anti-Muslim sentiment to build a populist campaign that polls show attracts a hard-core segment of Republican voters.”\n“His bigotry is toxic — and it requires a resounding electoral defeat,” the Globe wrote of Trump.\nOne of Kasich’s best qualities, the Globe says, is his willingness to compromise.\n“Democrats who knew him in Congress,” the Globe writes,” considered him collegial and willing to compromise. And his strong gubernatorial reelection results — he won 64 percent of the vote — show that whatever his temperamental shortcomings, he’s not a polarizing figure.”\nThe Globe picks Kasich over the four other candidates in what they call “the sanity bracket.”\nRoughly speaking, Kasich is competing for the same pool of voters as New Jersey’s Governor Chris Christie, Florida senator Marco Rubio, and former Florida governor Jeb Bush. (Former CEO Carly Fiorina briefly looked like a viable candidate in the sanity bracket, but has faded in polls.) There’s a good chance that whichever of those four men performs best in New Hampshire — even if he doesn’t come in first overall — will emerge as leader of the party’s reality-based wing, and will then shoulder the responsibility for going head-to-head with Trump or Cruz.\nThe Globe editorial writers seem to wish former Massachusetts Governor Mitt Romney, who was defeated soundly by President Barack Obama in 2012, was an option for Republicans in 2016.\n“Republicans can pine for a choice that doesn’t exist — noncandidate Mitt Romney recently led a hypothetical poll of New Hampshire voters — but the GOP ballot is what it is,” the editorial notes mournfully.\n“The New Hampshire primary historically serves to winnow down the field, and that has never been more important than it is this year. The GOP needs to settle on one candidate to take the fight to Trump and Cruz, and Kasich is the best bet,” the Globe concludes.","url":"https://www.breitbart.com/politics/2016/01/26/boston-globe-endorses-john-kasich/"}
