{"authors":[],"date_download":"2018-10-22 20:43:00","date_modify":"2018-10-22 20:43:00","date_publish":"2014-05-02 17:16:47","description":"Robert James Campbell is due to be put to death May 13, the first execution since the death of Clayton Lockett in Oklahoma.","filename":"data/vaneerConsumption/BotchedExecutionFalloutTexasInmateEyesChallenge.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_44/310606/140408-execution-chamber-jms-1632_cc91c3c1bdc66ae1d35c51a852bf257e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_lethal-injection_botched-execution-fallout-texas-inmate-eyes-challenge-n95796_1540240980.html","title":"Botched Execution Fallout: Texas Inmate Eyes Challenge","title_page":"Botched Execution Fallout: Texas Inmate Eyes Challenge","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe Texas death row inmate slated to be the next prisoner executed in the United States may try to use the lethal injection debacle in Oklahoma to win a reprieve.\nRobert James Campbell, 41, is due to be put to death May 13, for the 1991 rape and murder of a young bank teller who was abducted from a gas station and shot to death.\n\"We are still considering what steps we might take to ensure the torture that occurred in Oklahoma will not take place on May 13,\" said Maurie Levin, one of Campbell's lawyers.\nTexas uses different execution drugs than the ones involved in Tuesday's execution of Clayton Lockett, which was so badly botched that even President Obama spoke out about it.\nIt's still unclear exactly what went wrong in Lockett's procedure, which was halted when he appeared to regain consciousness and writhe in pain.\nPrison officials were trying out a new protocol — midazolam, vecuronium bromide and potassium chloride —after running out of their previous execution drug.\nThey struggled for an hour to find a good injection site in Lockett's arms or legs before running an IV line into his groin, they said.\nThey contend his vein collapsed, stopping all the drugs from getting into his bloodstream. Lockett had a faint heartbeat when the execution was called off, but he died 10 minutes later.\nNo official cause of death has been given, but if it turns out a vein failure was to blame, that could mute the impact of the bungle on the growing debate over lethal-injection drugs nationwide.\nAfter Lockett's death, a spokesman for the Texas Department of Criminal Justice said the agency has no plans to change its protocol.\n\"The Oklahoma incident does not appear to be related to the choice of drugs,\" he noted.\nLevin said that regardless of why Lockett's lethal injection went wrong, executions in Oklahoma and Texas have something in common: Both states refuse to say where they obtain their execution drugs.\nShe also noted that while Texas has been using pentobarbital to kill prisoners, it has a stockpile of midazolam, the sedative used on Lockett and in the controversial execution of Dennis McGuire in Ohio earlier this year.\n\"I think if the states, including Texas, insist on opacity — a lack of transparency — then this is inevitably going to happen again,\" Levin said.\nIn the past, the Texas attorney general's office has told corrections officials they must disclose the source of their drugs.\nBut a specialty pharmacy that was publicly identified last fall as a supplier demanded a return of its products for fear of protests, hate mail and lawsuits.\nNow, the suppliers' names are being kept secret and the courts have refused to stop any executions while defense lawyers fight to make the details public.","url":"https://www.nbcnews.com/storyline/lethal-injection/botched-execution-fallout-texas-inmate-eyes-challenge-n95796"}
