{"authors":["Camila Domonoske"],"date_download":"2018-10-22 21:49:23","date_modify":"2018-10-22 21:49:23","date_publish":"2016-06-17 00:00:00","description":"A day after recovering the plane's cockpit voice recorder, a ship has also found and retrieved the flight data recorder, Egypt's Civil Aviation Authority says.","filename":"data/vaneerConsumption/BothFlightRecordersFromEgyptAirCrashNowRecoveredOfficialsSay.json","image_url":"https://media.npr.org/assets/img/2016/06/17/egyptair_wide-ddd5f38d6af6e6d03e6fca683d644db8da58882d.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_06_17_482441749_both-flight-recorders-from-egyptair-crash-now-recovered-officials-say_1540244963.html","title":"Both Flight Recorders From EgyptAir Crash Now Recovered, Officials Say","title_page":"Both Flight Recorders From EgyptAir Crash Now Recovered, Officials Say : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Both Flight Recorders From EgyptAir Crash Now Recovered, Officials Say\nBoth of the flight data recorders from EgyptAir Flight 804, which slammed into the Mediterranean Sea last month, have now been recovered, raising hopes that the cause of the crash can be determined.\nThe crash on May 19 killed all 66 people aboard the Airbus A320.\nOne of the recorders — which are sometimes called \"black boxes,\" though they are no longer black — records the audio in the cockpit. Egypt's Civil Aviation Authority announced its recovery Thursday. The second records technical details of the flight, and the Civil Aviation Authority announced Friday that that device, too, had been recovered.\n\"Like the cockpit voice recorder, a vessel contracted out by the Egyptian government retrieved the flight data recorder in several stages from deep in the sea,\" NPR's Leila Fadel reports from Cairo. She says both recorders are on their way to Cairo for analysis.\n\"Investigators hope the two recorders will help unpack the mystery of what caused that plane en route from Paris to Cairo to crash,\" Leila tells our Newscast unit. \"Just before it fell from the sky, radar images showed that the plane suddenly jerked to the left and then made a full circle to the right. Smoke was also detected on the plane.\"\nThe recorders were recovered by the ship John Lethbridge, the Civil Aviation Authority says.\nAs we reported Thursday, the vessel is operated by the U.S. company Deep Ocean Search and arrived at the search area on Sunday, according to The Associated Press. The ship is equipped with underwater detection equipment, such as sonar, that can explore up to 6,000 feet below the sea's surface.","url":"https://www.npr.org/sections/thetwo-way/2016/06/17/482441749/both-flight-recorders-from-egyptair-crash-now-recovered-officials-say"}
