{"authors":[],"date_download":"2018-10-30 14:31:59","date_modify":"2018-10-30 14:31:59","date_publish":"2018-08-20 22:45:00","description":"The de facto leader of Atlanta’s stadium authority has been hired by the city to provide legal services on the Gulch development.","filename":"data/vaneerConsumption/Bottomsallyandrecauthorityleaderhiredaslawyer.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/08/14/Videos/4461215.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_w_e25e9f4c16b76dce09d67af6c44580e3__1540909919.html","title":"Bottoms ally and rec authority leader hired as lawyer","title_page":"Atlanta Gulch: Bottoms ally and rec authority leader hired as lawyer","title_rss":"NULL","source_domain":"ajc.com","text":"The city of Atlanta has hired the stadium authority’s de facto leader to help negotiate a multi-billion dollar deal to develop the Gulch, raising questions about whether he can fairly look out for the best interest of both.\nThe city and the Atlanta Fulton County Recreation Authority own land in the downtown area that a California developer is looking to turn into offices, retail and hotel space. Alvin Kendall, a lawyer with close ties to Mayor Keisha Lance Bottoms, has billed the city more than $48,000 as the city’s “special counsel” on the Gulch deal.\nKendall, through two related companies, also has billed the recreation authority nearly $300,000 in consulting fees since late 2015.\nThough described as a consultant, Kendall’s actual role at the authority is to run its daily operations, giving rise to a possible conflict, two local elected leaders and ethics watchdogs say.\nBob Ellis, a Fulton County commissioner who serves on the recreation authority board, said the board was not informed of Kendall’s legal work for city on the Gulch deal.\n“On the face of it, I think that’s a conflict that should have been disclosed to us,” Ellis said, adding that the matter “makes me uncomfortable.”\nAtlanta Fulton County Recreation Authority Chairman William K. Whitner, left, and board member Bob Ellis, listen during a Monday, Aug. 20, 2018, hearing of the authority. J. SCOTT TRUBEY/STRUBEY@AJC.COM. (The Atlanta Journal-Constitution)\nBecause the recreation authority owns land in the Gulch and Philips Arena, its interests in redevelopment or a land sale could come into conflict with those of the city and Gulch developer CIM Group.\n“There may be some of those roles that he needs to relinquish to eliminate the appearance of a conflict of interest,” said Felicia Moore, Atlanta City Council president. “Our code speaks not only to actual conflicts, but also the appearance of conflicts.”\nOn Monday, Kendall said that a conflict does not exist and referred questions about the Gulch and his relationship to Bottoms to the mayor’s office.\nBottoms’ office described Kendall as a former employer and mentor of the mayor. In an email, the mayor’s office said there is no personal or professional conflict of interest in Kendall’s dual roles.\nRELATED CONTENT: COSTS TO TAXPAYERS\nThe city of Atlanta is negotiating a deal to bring a $3.5 billion to $5 billion development to the Gulch, the weedy stretch of parking lots and rail lines near the Five Points MARTA station. CIM is seeking potentially $1 billion or more in public financing.\nCIM has proposed more than 9 million square feet of office space, 1,000 residences, 1,500 hotel rooms and 1 million square feet of retail space in a project aimed at Amazon’s second headquarters. Amazon executives are said to have visited the site in March.\nCIM controls some of the land, and other parts are owned by the city, the state and other interests.\nThe recreation authority’s land in the Gulch could become part of the deal with CIM.\n“All of that is on the table,” Ellis said.\nAlvin Kendall, left, an Atlanta area attorney, is a consultant who runs the daily operations of the Atlanta Fulton County Recreation Authority. Kendall also serves as special counsel for the city of Atlanta on the Gulch redevelopment. Ethics watchdogs say the roles could present a conflict of interest. J. SCOTT TRUBEY/STRUBEY@AJC.COM (The Atlanta Journal-Constitution)\nEven if Kendall isn’t acting as an attorney for the recreation authority, he has duties to the authority as a consultant and has a substantial personal interest based on the amount of money he is making by working for the board, said Clark Cunningham, a Georgia State University law professor who holds the W. Lee Burge Chair of Law and Ethics.\n“In my opinion, the possibility that Mr. Kendall is in violation of the rules of professional conduct is in question,” Cunningham said. “In my opinion, the city should halt further use of his services until the issue has been thoroughly investigated and resolved.”\nIn Georgia, a lawyer may not represent or continue to represent a client if there is a significant risk the lawyer’s own interests or duties to a third party will materially and adversely affect the representation of that client, Cunningham said.\nThere is an exception if the client provides informed consent, he said. Before asking a client for consent, the lawyer must provide the client in writing reasonable and adequate information about the risks of the representation as well as reasonable alternatives to representation by that lawyer.\nA potential conflict could be avoided by hiring another lawyer or law firm.\nKendall’s representation of the city isn’t the only one drawing scrutiny in the Gulch deal. CIM is represented by Robert Highsmith, a partner at high-powered law firm Holland & Knight, who has represented the city as a lawyer and lobbyist.\nHolland & Knight attorney Robert Highsmith. J. SCOTT TRUBEY/STRUBEY@AJC.COM (The Atlanta Journal-Constitution)\nHighsmith, an ally of former Mayor Kasim Reed, donated $5,400 to Bottoms’ campaign. Highsmith did not respond to a message seeking comment.\nBottoms said no conflict exists and hailed Highsmith “as one of Georgia’s leading authorities on governmental ethics, open records and transparency, campaign finance and election law.”\n‘He’s done great work for us’\nExperts contacted by The Atlanta Journal-Constitution also raised concerns about Kendall’s past criminal conviction and professional censures. Kendall was disciplined by a state board in 1992 and his law license was suspended in 1998.\nThat same year, Kendall was convicted and sentenced to five years in federal prison for conspiring to tip off a client, who was part of a drug ring, to a pending DEA search, according to articles in the AJC. Kendall was later disbarred.\nCunningham questioned whether Kendall is the best person to represent the city.\nRELATED CONTENT: GULCH PROJECT\nKendall served his time and had his civil rights restored in 2012. In October 2015, the Georgia Supreme Court unanimously reinstated Kendall’s law license, noting he’d taken responsibility for his actions.\nWeeks later, Kendall went to work for the authority as a consultant, aiding Bottoms, who served then as both a member of City Council and as the executive director of the authority.\nThe recreation authority had its hands full at the time negotiating the sale of Turner Field and a new Philips Arena lease and renovation deal with the Atlanta Hawks.\nThe AJC requested copies of Kendall’s legal invoices to the city as well as his engagement letter on the Gulch project. The AJC also requested his contract and all invoices to the recreation authority.\nHeavily redacted invoices show his firm, the Kendall Law Firm, billed the city for legal work including conference calls and document review. At least twice, Kendall met with a lawyer who does work for the recreation authority.\nKendall billed the city $400 per hour, not including a 10 percent government discount, with invoices totaling $48,640 through July 15.\nAlvin Kendall, right, an Atlanta area attorney, is a consultant who runs the daily operations of the Atlanta Fulton County Recreation Authority. Kendall also serves as “special counsel” for the city of Atlanta on the Gulch redevelopment. Ethics watchdogs say the roles could present a conflict of interest. Photo by RICHARD BELCHER/WSB-TV (The Atlanta Journal-Constitution)\nThe recreation authority said no contracts with Kendall existed. Two firms related to Kendall were paid at least twice a month in all but two months from December 2015 to July of this year, totaling more than $295,000.\nNo hours or specific duties were listed in the documents. In a statement, the authority said since January, Kendall’s “consulting duties have included the day-to-day operations of the authority.”\nKendall’s law firm has made contributions of $5,200 Bottoms’ mayoral campaign to date.\nThe Bottoms campaign, meanwhile, paid Kendall or his law firm $53,825. The expenditures included $15,000 for legal fees, and $38,825 to reimburse Kendall personally for yard signs, printing and magnets, campaign finance records show.\nKendall is listed as the registered agent for Keisha Lance Bottoms for Mayor Inc., as well as for the nonprofit committee for her inaugural. Bottoms serves as the CEO of both groups, state records show.\nRELATED CONTENT: ETHICS QUESTIONS\nMarvin Arrington, a recreation authority board member and Fulton commissioner, said he was not overly concerned about a potential conflict, though he said he would follow up with the board’s chairman and legal counsel.\n“It’s always good to avoid the appearance of impropriety,” he said. “I believe that Alvin has represented us in a great fashion. He’s done great work for us, and I hope he will continue to do good work for us.”\nIt’s unclear if Kendall has experience with multibillion-dollar real estate deals. His firm doesn’t appear to have a website.\nWilliam Perry, who runs Georgia Ethics Watchdogs, said he is concerned about potential conflicts on both ends of the deal.\nBottoms pledged in the heat of last year’s runoff election that donors to her campaign would receive special scrutiny before winning city work. Since taking office, she backed off that promise in relation to legal services.\n“Keisha Lance Bottoms promised to bring a new day, and this is the same old same old,” he said.\n>> COMPLETE COVERAGE: Latest Atlanta City Hall investigative content","url":"https://www.ajc.com/news/local-govt--politics/watchdogs-question-rec-authority-leader-hiring-for-gulch-legal-work/QOvTwH6RnByIyAzlXvfRfL/"}
