{"authors":[],"date_download":"2018-10-30 00:55:04","date_modify":"2018-10-30 00:55:04","date_publish":"2014-10-16 08:00:00","description":null,"filename":"data/vaneerConsumption/BottleHymnoftheRepublic.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2014/10/1024px-The_Willard_Hotel.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860904.html","title":"Bottle Hymn of the Republic","title_page":"Bottle Hymn of the RepublicThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Long before there was a Four Seasons or a Mayflower or a Hay Adams, Washington, D.C. had only one grand hotel: the Willard. The prime spot it now occupies on Pennsylvania Avenue has housed one sort of caravanserai or another ever since 1818, when a string of modest row houses was leased for use as a hotel. By 1833 it had become the City Hotel but, like the young capital city itself, it was still cutting its teeth. In 1842, four years before it was acquired by Henry Willard, Charles Dickens described it in less than glowing terms in his American Notes:\nThe hotel in which we live, is a long row of small houses fronting on the street, and opening at the back upon a common yard, in which hangs a great triangle. Whenever a servant is wanted, somebody beats on this triangle from one stroke up to seven, according to the number of the house in which his presence is required; and as all the servants are always being wanted, and none of them ever come, this enlivening engine is in full performance the whole day through. Clothes are drying in the same yard; female slaves, with cotton handkerchiefs twisted round their heads, are running to and fro on the hotel business; black waiters cross and recross with dishes in their hands; two great dogs are playing upon a mound of loose bricks in the center of the little square; a pig is turning up his stomach to the sun, and grunting “that’s comfortable!”; and neither the men, nor the women, nor the dogs, nor the pig, nor any created creature, takes the smallest notice of the triangle, which is tingling madly all the time.\nRoom service, like everything else at the Willard, has improved considerably since 1842, as has the city itself. But Dickens, although he was a bit of a fusspot when it came to travel, can be forgiven for his pessimism about Washington as it then was—laid out by architect Pierre-Charles L’Enfant, yet still incomplete. “It is sometimes called the City of Magnificent Distances,” he wrote:\nBut it might with greater propriety be termed the City of Magnificent Intentions; for it is only on taking a bird’s-eye view of it from the top of the Capitol, that one can at all comprehend the vast designs of its projector, an aspiring Frenchman. Spacious avenues, that begin in nothing, and lead nowhere; streets, mile-long, that only want houses, roads, and inhabitants; public buildings that need a public to be complete…are its leading features….Such as it is, it is likely to remain.\nBah humbug. Both Washington, D.C. and the hotel have flowered far beyond anything Dickens could imagine. Most of the credit for the maturing of the city should go to the Civil War. Besides housing the command center for the Union, Washington was also on the front lines, with only the Potomac River separating it from the Confederacy. The resultant hundreds of thousands of troops, camp followers (political as well as military), journalists, newly enlisted civil servants, and a supporting cast of merchants, restaurateurs, and hoteliers forced the growth of the city, converting it into a major metropolis.\nForemost among the hoteliers was Henry Willard, whose property soon became the destination of choice for the rich and famous, thanks to its central location and growing reputation for fine food, drink, and service. Among early celebrity visitors was the “Swedish Nightingale,” Jenny Lind, the most celebrated operatic soprano of her time; P.T. Barnum was another. Abraham Lincoln slept there the night before his first inaugural, and General Ulysses S. Grant, who enjoyed lounging in the lobby, drink and cigar in hand, was a repeat guest during wartime visits to confer with his commander in chief. And it was while she was staying at the Willard that Julia Ward Howe penned the words to one of the most stirring lyrics in American history, “The Battle Hymn of the Republic.”\nFrom its earliest days, the Willard has had strong connections to drink. While the term “lobbyist” can be traced as far back as eighteenth-century London, when influence peddlers and MPs mingled in the lobbies of Parliament, the mid-nineteenth century wheeler-dealers who crowded the foyer of the Willard became known as the first American “lobbyists,” precursors of a pestilential Washington specie that, alas, is still anything but endangered.\nPolitics and the art of the pour may have first met at the Willard when, according to local tradition, Kentucky Senator Henry Clay introduced the mint julep to the nation’s capital there. It’s still a trademark cocktail at the Willard’s Round Robin Bar today, where master bartender Jim Hewes has perfected the perfect julep: not oversweet and with just the right amount of perfectly “bruised” fresh mint leaves. A trim, lively figure who could pass for a retired gentleman jockey, Hewes has tended bar at the Round Robin for nearly thirty years now and is always happy to share his wealth of Willard anecdotes and cocktail lore with visitors. He has even compiled a catalogue of presidential tipples, some documented and some imaginatively reconstructed, for every first executive from No. 1 to No. 44. Washington, quite accurately, is listed as a drinker of Madeira, which he regularly imported to his Mount Vernon plantation, and rye whiskey, which he actually distilled there. For Hawaii native Obama, Jim had to use a little more imagination, creating the “Blue Pacific” cocktail, a nicely-balanced blend of tequila, lime juice and blue Curaçao. “You feel like you’re looking at the beautiful waters of the Pacific,” he says.\nSome presidents proved more of a challenge than others. FDR was a pushover, on the record as a heavy consumer of Plymouth Gin martinis. So was Ike, who developed a known taste for Johnny Walker Black on the rocks while serving as Allied Commander based in London, and LBJ, who, emulating two of his Texas role models—“Cactus Jack” Garner and House Speaker Sam Rayburn—went for Cutty Sark and Branch water. And don’t forget Jimmy Carter, who, accurately but rather pathetically, is tagged with the sparkling non-alcoholic wine substitute he forced on innocent reception guests at the White House. President Garfield was an easy call too, since he is on record as having accepted a case of Dewar’s Scotch from industrialist Andrew Carnegie as an inaugural gift. As for First Lush Andrew Johnson, Hewes is on solid ground when assigning him that potent reviver of beleaguered presidential spirits, the Brandy Toddy.\nThe palatial Willard Hotel that greets visitors today is an expanded, beautifully restored version of the twelve-story Beaux Arts palace erected on the original site in 1901. If, at first glimpse, it reminds you of a scaled-down version of New York’s towering Plaza Hotel, there’s a good reason. Both structures were the work of celebrated architect Henry Janeway Hardenbergh, who also created the Waldorf Astoria; he reproduced the latter’s elegant promenade, popularly known as “Peacock Alley,” at the Willard.\nMany years ago, at the bar of the National Press Club, which overlooks the east facade of the Willard on 14th Street, I was chatting with a dapper, silver-haired old gentleman who, appropriately enough, was sipping a mint julep. It turned out that, as a young boy, he had accompanied his father on a visit to Washington and stayed at the “new” Willard shortly after it had opened. He particularly remembered the—for the time—high-tech cooling system, which used electric fans and large blocks of ice to circulate cold air during sultry Washington summers.\nTime eventually took its toll on the Willard. Bigger, newer luxury hotels with more banqueting space and more modern conveniences skimmed off the cream of its clientele and the grand old place began to fade. By 1968, it seemed doomed to die. Closing its doors to the public, the Willard lingered briefly as headquarters for Citizens for Nixon, an umbrella group of volunteer campaign organizations—ethnic, professional, and regional—during the 1968 presidential campaign. I was present at what then was thought to be the Willard’s last boozy hurrah, an election night reception that turned into a manic victory celebration as it became clear that Richard Nixon had, indeed, risen from his political grave to become the 37th President of the United States. Not long after, all of the Willard’s fraying finery—furniture, chandeliers, and the like—was auctioned off and the grand old dowager was shuttered, seemingly forever.\nFortunately, “forever” only lasted eight years. After a lengthy period of neglect, gutted and deteriorating, the Willard was brought back to life as an authentically restored but thoroughly modernized luxury hotel under the Intercontinental banner, complete with a lovingly recreated and beautifully appointed Round Robin Bar, presided over by Jim Hewes. He in turn, is watched over by the portraits of ghostly former guests lining its walls, a brilliant but motley mix of characters including all those mentioned earlier, plus Mark Twain, Walt Whitman, Calvin Coolidge (who, as newly minted President, stayed at the Willard until Warren Harding’s widow had time to pack up and leave the White House), Buffalo Bill Cody, the Rev. Martin Luther King, Jr. (who finished drafting his immortal “I Have a Dream” speech at the Willard in 1963), and countless others.\nI like to think that if Julia Ward Howe’s spirit could return to the Willard today, she might scribble a little addendum to “The Battle Hymn of the Republic” on one of the Round Robin Bar’s cocktail napkins. It might go something like this:\nMine eyes have seen the glory of the Willard’s bar anew;\nWhere they serve the finest vintages, cocktails and whiskeys too;\nJim has loosed the fearful lightning of his terrible corkscrew;\nHis drinks go pouring on!\nAlas, poor Julia. Wherever she is she probably has no idea of the fun she’s missing out on.","url":"https://spectator.org/60671_bottle-hymn-republic/"}
