{"authors":["Associated Press"],"date_download":"2018-10-23 00:13:07","date_modify":"2018-10-23 00:13:07","date_publish":"2016-01-11 09:14:02","description":"SYDNEY (AP) — Eugenie Bouchard provided relief from a deluge of bad injury news in the women's game ahead of the Australian Open, as the Canadian won 6-2, 6-...","filename":"data/vaneerConsumption/BouchardwinsinHobart1stround.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:df39aff611e24351986daf89e0904819-56CX32zFKLb7123928b84ccaef79-804_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393572_Bouchard-wins-Hobart-1st-round_1540253587.html","title":"Bouchard wins in Hobart 1st round","title_page":"Bouchard wins in Hobart 1st round | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bouchard wins in Hobart 1st round\nSYDNEY (AP) — Eugenie Bouchard provided relief from a deluge of bad injury news in the women's game ahead of the Australian Open, as the Canadian won 6-2, 6-1 against Bethanie Mattek-Sands at the Hobart International on Monday.\nThe former No. 5 is on the comeback trail since sustaining a concussion when she fell in the dressing room during last year's U.S. Open, with the Shenzhen Open last week being her first tournament since.\nBouchard said before her first match in Hobart she had \"zero expectations\" for the tournament as she eases back into competitive tennis after the four-month layoff.\nAngellque Kerber of Germany prepares to play a shot in her match against Elina Svitolina of Ukraine at the Sydney International Tennis tournament in Sydney Monday, Jan. 11, 2016. (AP Photo/Rob Griffith)\nHowever she was impressive against American veteran Mattek-Sands, just as many leading Australian Open deal with injuries.\nDaria Gavrilova, who teamed with Nick Kyrgios to win Australia's first Hopman Cup title in Perth last week, became the latest player to withdraw from the Sydney International on Monday, due to an abdominal injury.\n\"If I had a bit more time, I would be fine,\" Gavrilova said. \"But it's just a bit sore, so it's a bit of a precaution.\n\"It's not great timing, but I'm not too worried because it's early days. I should be fine for Australian Open.\"\nDefending champion and world No. 5 Petra Kvitova withdrew from the tournament on Sunday due to a stomach virus and was joined a few hours later by No. 2-seeded Agnieszka Radwanska, who cited a leg injury.\nLast week, the world's four top-ranked women retired or withdrew from tournaments due to injuries: No. 1 Serena Williams (Hopman Cup/knee), second-ranked Halep (Brisbane/ankle), No. 3 Garbine Muguruza (Brisbane/foot) and fourth-ranked Maria Sharapova (Brisbane/forearm). The addition of Kvitova and Radwanska leaves the six top-ranked women all under injury clouds ahead of the Australian Open which starts Jan. 18.\nGermany's Angelique Kerber, ranked 10, won her first round match in Sydney, beating Ukraine's Elona Svitolina 4-6, 6-0, 6-3, while former U.S. Open champion and local favorite Sam Stosur beat Roberta Vinci 4-6, 7-5, 7-5.\nIn the men's draw, fifth-seeded Andreas Seppi beat Uzbekistan's Denis Istomin 6-4, 4-6, 6-2.\nMeanwhile, Britain's Andy Murray is also in Melbourne hoping a long lead-in to the Australian Open will help him in his quest to win the tournament at last, after four appearances in the final.\n\"I love playing here and I've played some of my best tennis here,\" Murray said on Monday. \"If I keep working hard and giving myself opportunities, hopefully I'll be able to win.\"\nAt the ASB Classic in Auckland, American Jack Sock took only 43 minutes to beat Victor Estrella Burgos 6-0, 6-4 to claim his place in the second round. World No. 26 Sock took the first set in only 17 minutes, finishing it with his fifth ace, then won the second set with a single service break and without facing a breakpoint.\n\"I came out in difficult conditions today for everyone, with the wind swirling a little bit and the court fast, and I'm happy to get through.\"\nCanada's Vasek Pospisil ousted seventh-seed Ivo Karlovic 7-6 (4), 7-5.","url":"https://www.dailymail.co.uk/wires/ap/article-3393572/Bouchard-wins-Hobart-1st-round.html"}
