{"authors":["Associated Press"],"date_download":"2018-10-23 04:33:07","date_modify":"2018-10-23 04:33:07","date_publish":"2017-03-16 15:49:42","description":"GREENUP, Ky. (AP) - A boulder that was at the center of a three-year dispute between Kentucky and Ohio officials may be getting a new home where the public...","filename":"data/vaneerConsumption/Boulderthatcausedrockyrelationscouldbecomeexhibit.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320784_Boulder-caused-rocky-relations-exhibit_1540269187.html","title":"Boulder that caused rocky relations could become exhibit","title_page":"Boulder that caused rocky relations could become exhibit | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"GREENUP, Ky. (AP) - A boulder that was at the center of a three-year dispute between Kentucky and Ohio officials may be getting a new home where the public can view it.\nThe Independent (http://bit.ly/2mMIel2) reports that officials in eastern Kentucky voted on Wednesday to seek grant money to build a gazebo in South Shore where the 8-ton boulder known as Indian Head Rock can be placed.\nThe rock was a well-known landmark on the Kentucky side of the Ohio River before it was removed in 2007 by a group who took it to Portsmouth, Ohio, saying it needed to be protected. Kentucky sued to get it back. The rock was returned to Kentucky in 2010 and was put in storage.\nGreenup County Judge-Executive Bobby Carpenter says officials want to exhibit the rock in a safe place.\n\"I'd love to have it somewhere people could see it,\"?Carpenter said. \"I get calls about it all the time.\"\nThe rock needs to be enclosed or covered and put in a spot where it can be observed to protect it from vandals and souvenir hunters, Carpenter said.\nBefore the rock was removed, residents on both sides of the Ohio River had watched for it as far back as the 1800s. People often visited the rock - some even carved their initials into it - when the water level dropped and it became visible. The rock also bears a stick-figure carving of a face on it that some believe is part of an ancient petroglyph.\n___\nInformation from: The Independent, http://www.dailyindependent.com","url":"https://www.dailymail.co.uk/wires/ap/article-4320784/Boulder-caused-rocky-relations-exhibit.html"}
