{"authors":["Pa Reporter"],"date_download":"2018-10-23 02:01:01","date_modify":"2018-10-23 02:01:01","date_publish":"2017-03-10 10:34:54","description":"Ibrahimovic received a three-match ban for his subsequent elbow on Mings, but the Cherries man was given a longer suspension following an independent regulatory commission hearing.","filename":"data/vaneerConsumption/BournemouthbossEddieHowestandsupforTyroneMings.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3DF26F9700000578-0-image-a-7_1489141673048.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4300724_Bournemouth-boss-Howe-stands-gentle-giant-Mings_1540260061.html","title":"Bournemouth boss Eddie Howe stands up for Tyrone Mings","title_page":"Bournemouth boss Eddie Howe stands up for Tyrone Mings | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bournemouth boss Eddie Howe feels 'gentle giant' Tyrone Mings has been hard done by after being hit with a five-match ban.\nDefender Mings was suspended by the Football Association for standing on the head of Zlatan Ibrahimovic during Saturday's 1-1 draw at Manchester United.\nIbrahimovic received a three-match ban for his subsequent elbow on Mings, but the Cherries man was given a longer suspension following an independent regulatory commission hearing.\nTyrone Mings trod on Zlatan Ibrahimovic's head during Bournemouth's 1-1 draw at Old Trafford\nBournemouth defender Mings has been banned for five matches by the Football Association\nCHERRIES GAMES MINGS WILL MISS All fixtures are Premier League March 11: West Ham United (H) March 18: Swansea City (H) April 1: Southampton (A) April 5: Liverpool (A) April 8: Chelsea (H)\nThe FA stated the standard punishment of three matches would have been 'clearly insufficient', but Howe and Bournemouth maintain the clash was an accident.\n'We are disappointed for Tyrone, we feel it was accidental,' Howe said at his press conference ahead of Saturday's home meeting with West Ham.\n'I don't think he has that kind of streak in him. Although he is a beast in stature he is certainly a gentle giant on and off the pitch. It's a real shame for him.\n'I see a defender who has made a very good tackle trying to get back to his goal as quickly as possible. His focus is on the ball, not on what lies beneath him.\n'You can make any interpretation you want, you can see what you want to see, but I think people who understand the game to a really high level - especially being a defender myself - will know that your only priority is to defend your goal.'\nBournemouth manager Eddie Howe feels 'gentle giant' Mings has been hard done by\nBournemouth cannot appeal against the suspension so Howe will now be without Mings until the trip to Tottenham on April 15.\n'We've looked at several options, but at the end of it we have to take the decision and move on,' he added.\nMeanwhile Mings has reiterated that he did not intentionally tread on the United striker and revealed his disappointment and hurt at the decision.\nThe 23-year-old posted on Twitter: 'I am extremely disappointed at the FA's decision to ban me for five matches, following what was an accidental collision with Zlatan Ibrahimovic.\nThe pair clashed in the fiery draw in which Andrew Surman was sent off for Howe's side\n'At no time was there any intentional stamp, or a movement to suggest that. My foot did not change course and at no point did I try and move my foot towards his head.\n'My only focus was to get back in and defend, conduct like that is not part of my game. So for people to deem that I could intentionally stamp on a fellow professional's head is upsetting.\n'It is an action that would not be acceptable in any walk of life, let alone on a football pitch, and one that would never cross my mind.\n'I would like to thank AFC Bournemouth and all the club's fans for their unwavering support this week. I can't wait to get back to playing again and help the team retain our Premier League status for another season.'","url":"https://www.dailymail.co.uk/sport/football/article-4300724/Bournemouth-boss-Howe-stands-gentle-giant-Mings.html"}
