{"authors":["Pa Reporter"],"date_download":"2018-10-23 01:47:11","date_modify":"2018-10-23 01:47:11","date_publish":"2016-01-29 15:52:47","description":"Pompey have fallen down the divisions since establishing themselves in the Premier League under Harry Redknapp, winning the FA Cup in 2008.","filename":"data/vaneerConsumption/BournemouthbossEddieHowetellshisplayerstheirmentalitymustberightaheadofFACupclashagainstPortsmouth.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/308069D800000578-0-image-a-45_1454082224536.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3423014_Bournemouth-boss-Eddie-Howe-tells-players-mentality-right-ahead-FA-Cup-clash-against-Portsmouth_1540259231.html","title":"Bournemouth boss Eddie Howe tells his players their 'mentality' must be right ahead of FA Cup clash against Portsmouth","title_page":"Bournemouth boss Eddie Howe tells his players their 'mentality' must be right ahead of FA Cup clash against Portsmouth | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bournemouth manager Eddie Howe has warned his Barclays Premier League players risk getting dumped out of the FA Cup by Portsmouth if their focus is not right at Fratton Park.\nThe Cherries now find themselves as a prized top-flight scalp following promotion last season.\nPompey have fallen down the divisions since establishing themselves in the Premier League under Harry Redknapp, winning the FA Cup in 2008.\nBournemouth manager Eddie Howe wants focus from his players for the FA Cup clash against Portsmouth\nHowe confirmed captain Tommy Elphick would be involved having returned to action in an Under 21s game\nNevertheless, Howe knows full well what reception will await the Bournemouth players when they travel up the M27, having joined the Fratton Park club in March 2002 as Redknapp's first signing only to suffer a serious knee injury.\n'The Fratton Park pitch is quite close to the stands there and the Portsmouth crowd really stick with their players, so if we don't start well, it will be difficult for us,' Howe said.\n'The mentality from when we arrive at the stadium will be key for us.\n'We want to progress and coming into the third round now is still a new experience for us, a couple of wins and you are looking at the latter stages, so we will take it very seriously.\n'The magic is there, if you want it to be, and the FA Cup can still be a huge competition in English football.'\nCurrent Pompey boss Paul Cook has taken his side up into the top six of Sky Bet League Two, and knocked Championship side Ipswich out in round three after a replay back at Fratton Park.\n'They have been hugely impressive this season with a good work rate and Paul Cook has them well organised, they have every chance of going up,' Howe said at a press conference, published on the club's official website.\n'We know that away from home, in a cup tie, which is a derby, that we will have to be at our best to progress.'\nHowe confirmed captain Tommy Elphick would be involved in the squad having returned to action in an Under 21s match following recovery from ankle surgery which sidelined the defender since mid-September.\nCherries boss Howe was linked with the vacant Chelsea managerial position earlier this week\n'I am really pleased to have Tommy back, he was our leader on and off the pitch for so long, a key player at the football club,' the Bournemouth boss said.\n'He has been a modern professional behind the scenes to get back as soon as he can.\n'You can't have enough people like that in your dressing room.'\nHowe was linked with the vacant Chelsea managerial position earlier this week, reportedly on a contingency short-list including Leicester's Claudio Ranieri, Mark Hughes at Stoke and Tottenham's Mauricio Pochettino should Blues owner Roman Abramovich fail to land a big name coach to permanently succeed Jose Mourinho in the summer\nHowever, the 38-year-old says he has nothing else on his mind other than taking Bournemouth forwards. He added: 'My focus is here. I have heard about the story but you look at it and then it's forgotten. It's just gone, it doesn't mean anything so it's work, Portsmouth and making sure we progress in this cup competition.","url":"https://www.dailymail.co.uk/sport/football/article-3423014/Bournemouth-boss-Eddie-Howe-tells-players-mentality-right-ahead-FA-Cup-clash-against-Portsmouth.html"}
