{"authors":["Will Martin"],"date_download":"2018-10-30 20:43:41","date_modify":"2018-10-30 20:43:41","date_publish":"2016-12-28 00:00:00","description":"Shares in FTSE 250-listed housebuilder Bovis are crumbling on Wednesday after the company dropped a profit warning.","filename":"data/vaneerConsumption/Bovissharescrashaftercompanyissuesprofitwarning.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bovis-shares-crash-after-company-issues-profit-warning-2016-12_1540932221.html","title":"Bovis shares crash after company issues profit warning","title_page":"    Bovis shares crash after company issues profit warning - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"REUTERS/Marko Djurica Shares in FTSE 250-listed housebuilder Bovis are crumbling after the company dropped a profit warning early on Wednesday morning.\nBovis — which has a market capitalisation of around £1.1 billion — said in a statement that it will produce fewer than expected homes in 2016 and sell 180 fewer homes than previous forecasts.\nHere's the key extract from Bovis' statement (emphasis ours):\n\"We expect the volume delivery for 2016 will be lower than previously anticipated at between 3,950 and 4,000 homes, the exact number depending on the extent of legal completions in the remaining days of the year. We have experienced slower than expected build production across the Group's sites during December, resulting in approximately 180 largely built and sold private homes which were expected to complete in 2016 being deferred into early 2017. The average sales price of the homes legally completing in 2016 is expected to increase by around 10% (2015: £231,600), driven by improved mix and increased underlying market pricing.\"\nUnderstandably, the few investors who are around in the period between Christmas and New Year have not taken well to Bovis' unexpected profit warning, and shares sold off sharply as markets opened. The company's stock dropped 5.2% at the open, before pulling a little higher, however it has now dropped to fresh lows for the day. Just before 3.55 p.m. GMT (10.55 a.m. ET) the stock is trading at £8.11 per share, down from £8.56 at the open.\nHere's the chart:\nInvesting.com\nCommenting on Bovis' profit warning, a statement from investment services firm AJ Bell notes: \"A profit warning from FTSE 250 firm Bovis is another crack in the wall when it comes to the house builders sector, especially as it comes so soon after Berkeley's decision to refine its shareholder cash return programme by potentially mixing in share buybacks with dividends.\n\"Bovis has today stated that legal completion volumes will rise by just 1% to 2% in 2016 year, rather than the targeted 5% as the sale of 180 homes has slipped from this year to next, owing to slower-than-expected build production in December.\"\nBovis' profit warning comes on the same day that the latest numbers from the British Bankers' Association showed that the overall number of people getting mortgages fell by 9% in November compared to 2015, but the amount of people remortgaging increased by 14%.\nDr Rebecca Harding, the BBA's Chief Economist, said: \"The reduction in interest rates in August may have boosted remortgaging approvals, with consumers looking to take advantage of the current economic conditions and lock-in lower interest rates.\"\nHere's the BBA's chart:\nBritish Bankers' Association\nEarlier on Wednesday, new research by estate agents Hamptons showed that housebuyers in the capital are fleeing at the fastest rate for 10 years. During the last 12 months, 77,500 Londoners bought houses outside the city, 22% more than in 2015, but below the 2007 peak, the report showed.","url":"https://www.businessinsider.com/bovis-shares-crash-after-company-issues-profit-warning-2016-12"}
