{"authors":[],"date_download":"2018-10-22 20:28:48","date_modify":"2018-10-22 20:28:48","date_publish":"2014-06-01 19:47:05","description":"The parents of American prisoner of war Bowe Bergdahl said that they love him and that he will need time to readjust.","filename":"data/vaneerConsumption/BoweBergdahlsParentsFreedomIsYours.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_22/480361/140601-jai-bob-bergdahl-jms-1612_db9cdf7dc8e779d5fd8a3ba796604288.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_bowe-bergdahls-parents-freedom-yours-n119771_1540240128.html","title":"Bowe Bergdahl's Parents: 'Freedom Is Yours'","title_page":"Bowe Bergdahl's Parents: 'Freedom Is Yours'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe parents of American prisoner of war Bowe Bergdahl told their newly-released son Sunday that they love him — and they told everyone else that he will need time to readjust.\n\"I love you Bowe, I'm so very proud of you, and of course all of your very large family would like me to tell you that they love you also,\" said his mother Jani, getting choked up by tears. \"We've been working very, very hard for your release these last five years.\n\"Freedom is yours, I will see you soon my beloved son, I love you Bowe.\"\nAn Army sergeant, Bowe Bergdahl had been held by the Afghan Taliban for nearly five years before his release this weekend. Bergdahl, 28, was handed over at about 6 p.m. local time on Saturday, and on Sunday morning arrived at a U.S. military hospital in Germany.\nBergdahl's father thanked friends, family, the government and the \"biker dudes and dudettes\" that have been supporting them through the years, but also cautioned that Bowe would need time to adjust to his new life of freedom.\n\"We’re talking like this because we haven’t talked to Bowe yet — we haven’t called him on the phone, although we all know we have the capability to do that,\" said Bob Bergdahl. \"That’s because that Bowe has been gone so long that it’s going to be very difficult to go back. It’s like a diver going deep on a dive and has to stage going back up because of compression ... If he comes back up too fast it could kill him.\"\nHe said the \"reintegration\" of Bowe into normal society would be a\"long process.\"\n\"Some day there will be a time for interviews, and books and whatever — I have a lot to say about this, I know Bowe is going to have a lot to say about this. But that’s still a distant future thing, and I won't let things get in the way of Bowe’s recovery.\"","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/bowe-bergdahls-parents-freedom-yours-n119771"}
