{"authors":[],"date_download":"2018-10-22 20:31:50","date_modify":"2018-10-22 20:31:50","date_publish":"2014-06-01 20:46:19","description":"Hometown pride and joy is at a high in Hailey, Idaho, now that their son is coming home.","filename":"data/vaneerConsumption/BoweBergdahlsHometownHaileyIdahoCelebratesRelease.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_22/480421/140601-bergdahl-hometown-jms-1724_10e5684f80af6e353841b80a17f24238.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_bowe-bergdahls-hometown-hailey-idaho-celebrates-release-n119821_1540240310.html","title":"Bowe Bergdahl's Hometown Hailey, Idaho, Celebrates Release","title_page":"Bowe Bergdahl's Hometown Hailey, Idaho, Celebrates Release","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nHAILEY, Idaho — Clusters of bright yellow balloons sway merrily in the breeze in front of Zaney's River Street Coffee Shop; signs exclaim “Our prayers have been answered!” and American flags adorn the shop's red wooden facade.\nThis is the hometown of Army Sgt. Bowe Bergdahl.\nInside Zaney's, shop owner Sue Martin smiles ear to ear in her colorful kitchen. When Bergdahl was captured by the Taliban in 2009, she turned on a light that she still calls \"a ray of hope.\" It has been switched on ever since as she has waited for him, and Martin — who employed young Bergdahl in her coffee shop for two years — said, \"I'll let Bowe turn it off.\"\nBergdahl, 28, was released from captivity by the Afghan Taliban Saturday in exchange for five Guantanamo Bay detainees.\n\"I really have never experienced anything as consistent and strong as the hope that Bowe would come home,\" said Martin, wearing a bright yellow shirt and American flag pin.\nLast summer, the town hosted its first annual \"Bring Bowe Back\" event and planted four trees in a local park, one for every year the soldier spent in captivity.\nThis weekend, as soon as word began to spread that Bergdahl had been released, Hailey residents renamed the June 28 event: \"Bowe is Back.\"\n\"We were in the process this week of obtaining the fifth tree and getting that planted and we don't need that tree now,\" said event organizer Stephanie O'Neill.\nMore than 2,500 people attended last year and raised money for the Bergdahl family, according to BringBoweback2014.com.\nIn a press conference Sunday, Bergdahl's mother and father, Jani and Bob, thanked the residents of Hailey for standing by their son.\nJani Bergdahl, teary-eyed, spoke directly to her son from the podium: \"I think you may be very surprised at the number of people who have gathered you into their hearts, at home in the Valley here, all over Idaho, across the country, and around the world.\"\nBob Bergdahl, who grew a long beard in solidarity with Bowe, compared his son's return to a scuba diver coming up for air after a dive.\n\"Bowe has been gone so long that it's going to be very difficult to come back,\" said his father. \"If he comes up too fast, it could kill him.\"\nJani encouraged her son to follow all the instructions given to him by the hospital staff at Landstuhl Regional Medical Center in Germany, where Bergdahl is currently being treated.\n\"Give yourself all the time you need to recover and decompress. There is no hurry. You have your life ahead of you,\" his mom said.","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/bowe-bergdahls-hometown-hailey-idaho-celebrates-release-n119821"}
