{"authors":[],"date_download":"2018-10-22 23:01:58","date_modify":"2018-10-22 23:01:58","date_publish":"2014-06-11 19:08:52","description":"Bergdahl was given an unspecified discharge after 26 days, a Coast Guard official said.","filename":"data/vaneerConsumption/BoweBergdahlTriedCoastGuardBasicTrainingBeforeJoiningArmy.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/479431/140531-bowe-bergdahl-mn-1400_0_5060c22af3f093a5a6a0418209a24da0.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_bowe-bergdahl-tried-coast-guard-basic-training-joining-army-n128736_1540249318.html","title":"Bowe Bergdahl Tried Coast Guard Basic Training Before Joining Army","title_page":"Bowe Bergdahl Tried Coast Guard Basic Training Before Joining Army","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBowe Bergdahl was discharged from the Coast Guard after 26 days of boot camp in 2006, two years before he enlisted in the Army, a Coast Guard official told NBC News on Wednesday.\nThe official would not confirm the nature of Bergdahl’s discharge from the Coast Guard. The Washington Post, citing close friends, reported that he was let go for psychological reasons.\nSign up for breaking news alerts from NBC News\nThe Post also published excerpts from Bergdahl’s handwritten journal, stories and essays that show a fragile mental state. “I’m so tired of the blackness, but what will happen to me without it,” he wrote at one point.\nBergdahl was never sworn in to the Coast Guard. He enlisted in the Army in June 2008. A year later, he disappeared from an outpost in Afghanistan and was captured by the Taliban, which held him for five years.\n— Courtney Kube and Erin McClam","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/bowe-bergdahl-tried-coast-guard-basic-training-joining-army-n128736"}
