{"authors":[],"date_download":"2018-10-22 21:29:53","date_modify":"2018-10-22 21:29:53","date_publish":"2014-06-05 15:42:34","description":"Sgt. Bowe Bergdahl's condition was described as stable.","filename":"data/vaneerConsumption/BoweBergdahlImprovingDailyatGermanHospitalPentagonSays.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2016_02/480376/140601-bergdahl-jms-1627_676968e97715c7a5836864bd70755b58.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_bowe-bergdahl-improving-daily-german-hospital-pentagon-says-n123601_1540243793.html","title":"Bowe Bergdahl 'Improving Daily' at German Hospital, Pentagon Says","title_page":"Bowe Bergdahl 'Improving Daily' at German Hospital, Pentagon Says","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSgt. Bowe Bergdahl is improving daily at the military hospital in Germany where he is recovering, and psychologists there are helping him “regain control of his emotions,” a Pentagon spokesman said Thursday.\nBergdahl’s medical condition was described as “stable and improving daily.”\nThe spokesman, Col. Steve Warren, would not elaborate on the psychologists’ work.\nObama administration officials have said that Bergdahl’s health was deteriorating rapidly, forcing them to move quickly in making a deal with the Taliban to secure his release after five years in captivity.\nOn Wednesday night, senators were shown a Taliban video from December that the administration says demonstrated his poor health.\nMost senators who spoke to NBC News after the briefing disagreed that the video provided proper justification for making the swap without consulting Congress.\nBergdahl is recovering at Landstuhl Regional Medical Center in Germany before returning to the United States.\n— Jim Miklaszewski, Katie Wall and Erin McClam","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/bowe-bergdahl-improving-daily-german-hospital-pentagon-says-n123601"}
