{"authors":[],"date_download":"2018-10-22 20:49:44","date_modify":"2018-10-22 20:49:44","date_publish":"2014-06-02 22:52:06","description":"The soldier remains in Germany, and the Pentagon will say little about him or his 2009 disappearance. Here's what what we do know.","filename":"data/vaneerConsumption/BoweBergdahlWhatWeKnowAboutSoldierCapturedbyTaliban.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/483166/140603-bowe-bergdahl-4a_03c60ba2c2703d51267a81d3169f67ab.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_bowe-bergdahl-what-we-know-about-soldier-captured-taliban-n120731_1540241384.html","title":"Bowe Bergdahl: What We Know About Soldier Captured by Taliban","title_page":"Bowe Bergdahl: What We Know About Soldier Captured by Taliban ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nNot even his parents have yet been able to talk to Bowe Robert Bergdahl, the 28-year-old Army sergeant from Hailey, Idaho, who was exchanged for five Afghan detainees Saturday after five years as a prisoner of the Taliban.\nBergdahl remains under treatment at Landstuhl Medical Center in Germany. The Defense Department not only won't say much about his condition, but it also refuses to say what it knows about the circumstances of Bergdahl's disappearance in 2009.\nHere's what we've learned so far:\nDid he desert?\nMany people think so — including fellow members of Bergdahl's infantry division.\nBergdahl had been out of infantry school at Fort Benning, Georgia, for just a few months when he disappeared from his unit's combat outpost in Paktika province in Afghanistan in June 2009. U.S. military officials said Bergdahl is believed to have intentionally laid down his weapon and walked away, carrying only a compass and bottle of water.\nFormer Army Spec. Joshua Cornelison, a medic in that unit, said Bergdahl's disappearance had to be \"premeditated.\" The remote outpost was heavily guarded around the clock, so he couldn't have been snatched by the Taliban, and he couldn't have simply wandered off by accident without having been spotted.\n\"He deserted not only the Army, but he also left myself and my platoon and my company to clean up his mess,\" Cornelison told NBC News.\nBut the Defense Department has \"never confirmed such a narrative,\" Col. Steve Warren, a Pentagon spokesman, said Monday.\n\"There have been several looks into the circumstances surrounding his disappearance, but we've never publicly said anything, primarily because we haven't had a chance to speak with Sergeant Bergdahl himself,\" Warren said.\nIn interviews Sunday, Defense Secretary Chuck Hagel called Bergdahl a \"prisoner of war.\" President Barack Obama's national security adviser, Susan Rice, not only described him as \"an American prisoner of war captured on the battlefield,\" but even said on ABC's \"This Week\" that \"he served the United States with honor and distinction.\"\nHow was he returned, and who knew about it?\nEighteen Taliban figures turned Bergdahl over to U.S. special forces on Saturday evening (10:30 a.m. ET) in eastern Afghanistan in exchange for five Afghan prisoners held at the U.S. detention center at Guantanamo Bay, Cuba. Officially, the deal was brokered through an entity described only as a Muslim country sympathetic to the Taliban, but U.S. officials have confirmed that the third party was the emirate of Qatar.\n\"No shots were fired. There was no violence,\" Hagel said. \"It went as well as we not only expected and planned, but I think as well as it could have. ... The timing was right.\"\nThat timing is turning out to be controversial. U.S. law requires the president to give Congress 30 days' notice before transferring anyone out of Guantanamo Bay; that notice wasn't given.\n\"This is not a partisan issue,\" Rep. Buck McKeon, R-Calif., chairman of the Armed Services Committee, told MSNBC on Monday. \"It's just a matter of the law and breaking the law and not informing the Congress according to the law.\"\nHagel said on NBC's \"Meet the Press\" that he would \"stand by that decision.\"\n\"We couldn't afford any leaks anywhere, for obvious reasons,\" he said. \"We found an opportunity. We took that opportunity.\"\nWho are the freed detainees?\nThe Defense Department identified the five Taliban members exchanged for Bergdahl — all in their 40s and assessed in Pentagon detention records as \"high\" risks to the U.S. and its allies:\nMullah Mohammad Fazl, described in Pentagon records as the Taliban's \"deputy defense minister\" and chief of staff of the Taliban army.\nKhirullah Said Wali Khairkhwa, described by the Pentagon as a \"senior Taliban official ... directly associated to Usama Bin Laden (UBL) and Taliban Supreme Commander Mullah Muhammad Omar.\"\nMullah Norullah Noori, a \"senior Taliban military commander in Mazar-e-Sharif during hostilities against U.S. and Coalition forces in late 2001.\" The Pentagon records say he is associated with Omar, other senior Taliban officials and senior al-Qaeda members.\nAbdul Haq Wasiq, described as the Taliban's \"deputy intelligence minister,\" with direct access to Taliban leaders.\nMohammad Nabi Omari, a \"senior Taliban official\" who served in \"multiple leadership roles\" and was directly involved in attacks on U.S. and coalition forces.\nOmar, the Taliban leader, called their release a \"great victory\" at the \"hands of the enemy.\"\nFor once, Republicans in Congress agreed with him.\n\"Have we just put a price on other U.S. soldiers?\" Sen. Ted Cruz of Texas asked in an interview with ABC News. \"What does this tell terrorists — that if you capture a U.S. soldier, you can trade that soldier for five terrorists?\"\nSen. John McCain of Arizona, a prisoner of war during the Vietnam conflict, objected that the detainees were \"hardened\" terrorists likely to return to the fight.\nThey “have the blood of Americans and countless Afghans on their hands,” McCain said in a statement.\nUnder the terms of the deal, the detainees will remain under the control of the government of Qatar for one year and \"will be subject to restrictions on their movement and activities,\" a senior U.S. official told NBC News — restrictions that include a one-year travel ban.\n\"These five have been identified as potential transferees as part of this release of Sergeant Bergdahl for some time,\" White House press secretary Jay Carney said Monday.\n\"It was the assessment of the secretary of defense, in consultation with the full national security team, that there were sufficient mitigation steps taken by Qatar and assurances received by the United States that these detainees do not pose a threat to U.S. national security,\" he said.\nHow is Bergdahl doing?\nU.S. officials will say only that Bergdahl is \"stable\" with \"health issues\" at Landstuhl, where he is under the care of physicians and psychologists.\n\"He's got some nutrition problems. He hasn't eaten well over the last five years, so we're focusing on that,\" Warren, the Pentagon spokesman, said Monday. \"There are other matters, but for obvious reasons, I'm not going to get into the details.\"\n\"There's no specific timeline\" on assessments of Bergdahl's condition and future treatment, but the plan right now is to send him to Brooke Army Medical Center in San Antonio, Texas, Warren said.\nCol. Hans Bush, a spokesman at Brooke, said \"phase three\" of Bergdahl's reintegration into society would begin there — phase one was his release, phase two is the assessment and debriefing at Landstuhl.\n“With a returnee who's been living captive or living hostage, they have been basically held against their will for months or years,\" Bush told NBC station KTVB of Boise, Idaho, near Bergdahl's hometown of Hailey.\n\"That has a very deep psychological effect, and going from that to being back in the United States with complete freedom, that can cause some mental whiplash,\" Bush said.\nWhat comes next?\nAs part of his \"soft landing,\" Bergdahl will continue to be debriefed by military officials not only to assess his condition but also for any intelligence he can provide on his captors, Warren said Monday. Any discussion of whether Bergdahl could be charged with desertion is \"way, way\" premature, he said.\nCongressional Republicans, however, want more answers, more quickly.\nLindsey Graham of South Carolina and Jim Inhofe of Oklahoma, two Republicans on the Senate Armed Services Committee, demanded Monday that the committee throw open the doors on its closed meeting June 10 with senior Pentagon officials about the circumstances surrounding Bergdahl's disappearance and return.\nMcKeon, the House Armed Services chairman, also promised hearings, citing the importance of \"our responsibility of oversight of the administration and our national security.\"\nIn Hailey, Idaho, however, the mood is very different. Residents who rejoiced at news of Bergdahl's release plan for now to go ahead with a \"Bowe Is Back\" celebration June 28.\nMayor Fritz Haemmerle acknowledged that the town has been flooded with calls and emails opposing the celebration in light of the questions being raised about Bergdahl's disappearance — some of them raising \"very important points,\" he said.\nBut \"we are very happy to let the process unfold,\" he said, and \"in the meantime, our celebration will focus on Bowe Bergdahl's release and the relief of his family and those who live here.\"\nJim Miklaszewski, Andrea Mitchell, Kelly O'Donnell, Polly DeFrank and Katie Wall of NBC News contributed to this report.","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/bowe-bergdahl-what-we-know-about-soldier-captured-taliban-n120731"}
