{"authors":[],"date_download":"2018-10-22 21:23:08","date_modify":"2018-10-22 21:23:08","date_publish":"2014-06-05 01:22:58","description":"Top-ranking defense and intelligence officials held the closed-door meeting as the White House faces withering criticism from Capitol Hill.","filename":"data/vaneerConsumption/BoweBergdahlProofofLifeVideoFailstoSatisfySenateCritics.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/488751/140605-saxby-chambliss-330a_9835b2ae5a0827148a210c5ac8082cb5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_bowe-bergdahl-proof-of-life-video-fails-satisfy-senate-critics-n123106_1540243388.html","title":"Bowe Bergdahl Proof-of-Life Video Fails to Satisfy Senate Critics","title_page":"Bowe Bergdahl Proof-of-Life Video Fails to Satisfy Senate Critics","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nWASHINGTON — At a classified briefing Wednesday, senators watched a proof-of-life video of Army Sgt. Bowe Bergdahl recorded by the Taliban in December 2013 that the Obama administration said would help explain its decision to act quickly to secure the release of the captive soldier.\nTop-ranking defense and intelligence officials held the closed-door meeting as the White House faces withering criticism from Capitol Hill for its decision to free five Taliban commanders in exchange for Bergdahl's release without first notifying Congress.\nThe video was cited by the White House officials as one of the many reasons they believed they needed to move swiftly, saying Bergdahl's health required urgent intervention.\nBut most senators who spoke to NBC News after the briefing disagreed that the video provided proper justification for making the deal without consulting Congress, with many saying they believed Bergdahl was drugged in the footage.\n\"There is no intelligence that indicated that from a medical standpoint his life was in danger,\" said Saxby Chambliss, R-Ga., the ranking member of the Senate Intelligence Committee. Chambliss said Tuesday the White House broke the law by not informing Congress before the prisoner exchange was secured.\nRepublicans who have been critical of the White House in the wake of Bergdahl's release said they were not satisfied with the content of the briefing and that they remain concerned that the released Taliban members could return to the fight against the United States.\nSen. Dianne Feinstein — a critical Democratic voice Tuesday — refused to comment on the closed-door briefing, citing its classified nature.\nSenate Majority Whip Dick Durbin, D-Ill., was a notable exception in his quick defense of President Obama.\n\"I know more now, I feel more confident now in the decision that was made,\" Durbin said.\nHe added: \"They went into more detail about what led up to it, what they were faced with.\"\nObama has said Bergdahl's deteriorating health condition was one reason for the need to act promptly — at the expense of informing Congress in the legally required time frame.","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/bowe-bergdahl-proof-of-life-video-fails-satisfy-senate-critics-n123106"}
