{"authors":[],"date_download":"2018-10-22 22:10:47","date_modify":"2018-10-22 22:10:47","date_publish":"2014-06-08 19:02:12","description":"Army Sgt. Bowe Bergdahl is in “good enough physical condition to allow him to return to the United States” — but he’s “not ready psychologically or emotionally.”","filename":"data/vaneerConsumption/BoweBergdahlNotEmotionallyReadytoComeHome.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/488881/140605-bergdahl-mn-720_6ab6166fa1ea83e4ffdc55456148d83c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_bowe-bergdahl-not-emotionally-ready-come-home-n125716_1540246247.html","title":"Bowe Bergdahl Not Emotionally Ready to Come Home","title_page":"Bowe Bergdahl Not Emotionally Ready to Come Home","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nArmy Sgt. Bowe Bergdahl is in “good enough physical condition to allow him to return to the United States,” but he’s “not ready psychologically or emotionally,” U.S. officials confirmed to NBC News on Sunday.\nFor now, Bergdahl will remain at the U.S. military hospital at Landstuhl Germany for treatment.\nAlthough he’s been permitted to talk to his parents, Bergdahl has so far chosen not to call his family in Idaho, the officials said.\nNo specific reason for Bergdahl’s mindstate were given except that he continues treatment for psychological and emotional problems as a result of his five years in captivity.\nBergdahl, who was captured by the Afghan Taliban in 2009 after straying from his base for unclear reasons, has become a controversial figure since he was released in exchange for five terrorists who were being held in Guantanamo Bay.\nAfter an initial wave of support, many people, both civilians and military, have labeled Bergdahl a deserter.\nHis family has since received death threats, the FBI confirmed with NBC News on Sunday.\n\"We are aware of the threats and are working with our local law enforcement partners to investigate,\" a Bureau spokeswoman told NBC News while declining to give any additional details.\nThe Obama administration has adamantly defended the move to bring Bergdahl home.\n\"It would have been offensive and incomprehensible to consciously leave an American behind, no matter what,\" Secretary of State John Kerry said.\nOfficials on Sunday also addressed reports that Bergdahl was “tortured” and “locked in a small cage” while captive.\nDefense officials told NBC News that \"Bergdahl was locked up (and had) his movements restricted” after at least one reported attempt to escape. But \"it’s not clear whether it was a small cell or a box, but he was apparently closely confined.\"\nOne senior defense official told NBC News, “he was clearly treated more harshly at some times” but could not say if it rose to the level of torture. The official said Bergdahl, 28, is not suffering any permanent physical injuries from his treatment.\nTaliban spokesmen could not be immediately reached for comment.\nOn Friday, Taliban spokesman Zabihullah Mujahid told The Associated Press by telephone that Bergdahl was held under \"good conditions.\" The claim could not be independently verified.\n— with Hasani Gittens and The Associated Press","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/bowe-bergdahl-not-emotionally-ready-come-home-n125716"}
