{"authors":[],"date_download":"2018-10-22 21:04:26","date_modify":"2018-10-22 21:04:26","date_publish":"2014-06-03 22:01:05","description":"Bowe Bergahl is caught in a pitched national debate over whether five Taliban militants were too much to swap for a troubled dreamer from Idaho.","filename":"data/vaneerConsumption/BoweBergdahlIsTheFreedSoldieraHeroorDeserter.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2016_02/480376/140601-bergdahl-jms-1627_676968e97715c7a5836864bd70755b58.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_bowe-bergdahl-freed-soldier-hero-or-deserter-n121756_1540242266.html","title":"Bowe Bergdahl: Is The Freed Soldier a Hero or Deserter?","title_page":"Bowe Bergdahl: Is The Freed Soldier a Hero or Deserter? ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nWho is Army Sgt. Bowe Bergdahl, and why does he matter?\nThe part-time barista, Buddhist and ballet dancer vaulted from Idaho’s backwoods to the hands of the Taliban. But Bergdahl's strange saga only got stranger this week, following the Obama administration’s decision to swap five Taliban militants for the 28-year-old soldier.\nNow free of the Taliban, he’s caught in a pitched national debate over who, exactly, he is and what he should be called, let alone whether President Barack Obama was right—and within legal bounds—to release prisoners from Guantanamo Bay, Cuba, in exchange for an apparently troubled dreamer.\nWhile some critics—including former soldiers—say Bergdahl is a deserter who cost other Americans their lives, his father and hometown supporters call him a hero and patriot, who risked his life to help the Afghan people. Obama, for his part, defended his actions on Tuesday, citing a “sacred” obligation not to leave American soldiers behind, regardless of how they fell into enemy hands. But that’s far from the last word on the subject.\nHouse Speaker John Boehner on Tuesday called for congressional hearings into the circumstances surrounding Bergdahl’s release. Meanwhile, military officials told NBC News that they are preparing a high-level inquiry into the personal conduct of Bergdahl and the details of his capture.\nWhat do we know so far about this long-shot protagonist on the international stage? Here, answers to questions about Bergdahl the man—including his family life, his path to the Army, and his post-war future in America.\nWhere is Bergdahl from?\nBorn in March 1986, Bergdahl was brought up in Hailey, Idaho, a sleepy town of gravel roads and horse farms. Bergdahl’s parents, Bob and Jani, moved to the area in 1980, drawn to the promise of jobs driven by the tourist industry in nearby Ketchum.\nIt was a Walden-esque household, a two-bedroom cabin on 40 acres of farmland; there was no phone but 5,000 books. His father, a dropped-out anthropology major from the University of California, Santa Barbara, worked odd jobs like waxing skis and pouring concrete, and ended up a driver for the United Parcel Service. He also devoted himself to family. As staunch Calvinists, the Bergdahl’s home schooled their son, and later his sister, filling their minds with the work of religious thinkers like Thomas Aquinas and St. Augustine. Sunday was reserved for church.\nHe learned to shoot and ski, and took lessons in fencing and martial arts. In his late teens, he was lured into ballet by a girlfriend, landing the lead male role in The Nutcracker, according to a 2012 New York Times article. She also introduced him to Buddhism, according to a report by BBC News, and Bergdahl later spent time in a monastery in the Pacific Northwest.\nAfter his release, residents—many of whom recall Bowe as a sensitive free-spirit and earnest patriot—announced plans to go ahead with a \"Bowe Is Back\" celebration June 28.\nHow did he end up in the Army?\nBy his teens, Bergdahl was itching for bigger adventures than those available in Hailey, friends say. At 20, he traveled to France, hoping to join the French Foreign Legion, whose members, according to the group’s website, want “to start a new life.” His application was denied.\nBut Bergdahl stayed committed to a rootless, wild-edged life. He returned to Hailey and started to drift. He joined construction jobs, mowed lawns, house sat, and worked part-time at a local shooting club. When he saved enough money, he was off again. On one trip he sailed through the Panama Canal.\nOn another he biked to California. By 2007, he was back in Hailey, whipping up lattes at a local coffee shop, and looking to refocus.\nHe considered going to Uganda as a missionary, then jettisoned the idea, enlisting in the Army instead in early 2008. He was reportedly drawn to the chance to help the Afghan people. “I’m thinking about joining the Army,” he told in parents, according to a 2012 profile in Rolling Stone. “You’re thinking about joining,” his father asked. “Or you already signed on the dotted line?”\n“Well, yeah,” Bowe admitted.\nWhat kind of soldier was he?\nHe was, by almost all accounts, an unusual soldier. While at infantry school in Fort Benning, Georgia, his comrades used their weekend passes to hit up local strip clubs, according to Rolling Stone. Bergdahl hung out at Barnes & Noble instead. After training, he was assigned to the 25th Infantry Division in Fort Richardson, Alaska, arriving in October of 2008, and quickly developing a reputation as both a marksman and an earnest student of military life. He was never far from his Ranger Handbook.\nHe also read Three Cups of Tea, about a humanitarian mission to educate girls in Afghanistan, and surrounded himself with the tracts of his youth, including the writings of Kant and Aristotle.","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/bowe-bergdahl-freed-soldier-hero-or-deserter-n121756"}
