{"authors":["Laura Wagner"],"date_download":"2018-10-23 05:47:10","date_modify":"2018-10-23 05:47:10","date_publish":"2015-12-22 00:00:00","description":"In his first appearance before a military judge on charges of desertion and misbehavior before the enemy, Bergdahl did not enter a plea. \"The accused wishes to defer for reflection,\" his lawyer said.","filename":"data/vaneerConsumption/BoweBergdahlDefersEnteringPleaAtArraignment.json","image_url":"https://media.npr.org/assets/img/2015/12/22/gettyimages-502244514_wide-a36c294d27e7fba52170806a12889458e60a1aac.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2015_12_22_460694035_bowe-bergdahl-defers-entering-plea-at-arraignment_1540273630.html","title":"Bowe Bergdahl Defers Entering Plea At Arraignment","title_page":"Bowe Bergdahl Defers Entering Plea At Arraignment   : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Bowe Bergdahl Defers Entering Plea At Arraignment\nEnlarge this image toggle caption Sara D. Davis/Getty Images Sara D. Davis/Getty Images\nU.S. Army Sgt. Bowe Bergdahl made his first appearance before a military judge today. Bergdahl walked away from his post in Afghanistan in 2009 and was held captive by the Taliban for five years. He faces charges of desertion and misbehavior before the enemy.\nDuring the arraignment at Fort Bragg in North Carolina, Bergdahl deferred entering a plea. He also did not indicate whether he wants to face a court-martial with a jury or one with just a judge, The Associated Press reports. If found guilty of the charges, Bergdahl could face life in prison.\n\"The accused wishes to defer for reflection,\" said Lt. Col. Franklin Rosenblatt, Bergdahl's lawyer, according to a Reuters report. His next hearing is scheduled for Jan. 12.\nEarlier this month, head of the Army Forces Command Gen. Robert B. Abrams ordered that Bergdahl face a court-martial for desertion. Abrams' decision overrode a recommendation from Army lawyer Lt. Col. Mark Visger, who said Bergdahl should face a \"special court-martial\" where the most severe punishment would be a one-year sentence.\nBergdahl, now the subject of the Serial podcast, disappeared on June 30, 2009, from an outpost in Paktika province, Afghanistan; he left the compound voluntarily and was then captured by the Taliban. He was held for five years until President Obama arranged a prisoner swap in 2014. Bergdahl was released in exchange for five Taliban detainees who were being held at Guantanamo Bay. As we previously reported, the deal for Bergdahl's release has been controversial because of the circumstances surrounding his disappearance.","url":"https://www.npr.org/sections/thetwo-way/2015/12/22/460694035/bowe-bergdahl-defers-entering-plea-at-arraignment"}
