{"authors":[],"date_download":"2018-10-22 21:19:43","date_modify":"2018-10-22 21:19:43","date_publish":"2014-06-04 21:11:34","description":"Cancellation follows controversy over how the Army sergeant wound up as a Taliban captive.","filename":"data/vaneerConsumption/BoweBergdahlsHometownCancelsWelcomeHomeBoweRally.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_22/479591/140531-bowe-bergdahl-idaho-ef-1740_5f8fd32f329fccb04f03ef26e79aee83.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_bowe-bergdahls-hometown-cancels-welcome-home-bowe-rally-n122841_1540243183.html","title":"Bowe Bergdahl's Hometown Cancels 'Welcome Home, Bowe' Rally","title_page":"Bowe Bergdahl's Hometown Cancels 'Welcome Home, Bowe' Rally","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA celebration in Bowe Bergdahl's hometown of Hailey, Idaho, planned for later this month has been cancelled in the wake of a firestorm of controversy over how the Army sergeant wound up as a Taliban captive.\nThe event on June 28 was already planned as the second annual \"Bring Back Bowe\" rally even before the news broke on Saturday that Bergdahl had been released in a prisoner swap for five Taliban commanders. The event was changed to a \"Welcome Home, Bowe\" rally — Bergdahl wasn't expected to attend since he will likely still be recovering.\nA release from the City of Hailey on Wednesday said the \"community members who worked during March and April of this year to organize their annual Bring Bowe Back event in Hailey have asked to cancel the event.\"\nTown officials on Tuesday told NBC News that they had been deluged with hateful calls from people who don't think Bergdahl should be celebrated as a hero.\nIn the Wednesday statement, the town said they had received about \"100 correspondences\" per day on the issue, both positive and negative.\nHailey officials say they aren't cancelling because of any threat, but because of the numbers of people that might have turned up.\n\"The organizers and Hailey expect a significant increase in attendance to this event, by people who both want to support or protest against it,\" they said. \"In the interest of public safety, the event will be cancelled. Hailey, a town of 8,000, does not have the infrastructure to support an event of the size this could become.\"\nSue Martin, a spokeswoman for the Bergdahl family in Hailey, said it was the right move.\n\"For me personally I think it’s just too soon in this process, I think there’s a lot of emotions involved here and I think that the family needs some time to heal,\" she told NBC News.\n\"I’m happy that it’s cancelled, it would also be very difficult for our community to host that many people, we’re rather remote here.\"\nShe added, \"we can celebrate privately, we can celebrate with friends and family — our celebration doesn't need to be denied.\"\nAs more details have come out about the circumstances surrounding Bergdahl's walking off of his base in 2009, many people, both military and civilian, have labeled him a deserter. The Army has said that it will open an investigation.\nLee Ann Ferris, a next-door neighbor of the Bergdahls, said she wasn't surprised by the cancellation, but noted the community still supports the family and wants to hear Bowe’s story when he’s ready.\n\"He deserves his say, there’s a lot to come out on his side — we can’t judge him and lynch him in one day,” Ferris told NBC News. \"It’s been very shocking, I think, how vicious the attacks have been. We knew there would be a little bit but I was shocked at just how much.\n\"They’re really good people,\" she said of the Bergdahls. \"They have good hearts, Bowe has a good heart, and something’s going to come out to exonerate him I believe.\"\n— Hasani Gittens and John Boxley","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/bowe-bergdahls-hometown-cancels-welcome-home-bowe-rally-n122841"}
