{"authors":[],"date_download":"2018-10-22 21:01:45","date_modify":"2018-10-22 21:01:45","date_publish":"2014-06-03 20:08:30","description":"The road home may be long and hard for Army Sgt. Bowe Bergdahl as he undergoes \"reintegration.\"","filename":"data/vaneerConsumption/BoweBergdahlCouldFaceaLongRoadtoReintegration.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_bowe-bergdahl-could-face-long-road-reintegration-n121636_1540242105.html","title":"Bowe Bergdahl Could Face a Long Road to 'Reintegration'","title_page":"Bowe Bergdahl Could Face a Long Road to 'Reintegration'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe road home may be long and hard for Army Sgt. Bowe Bergdahl, who remains at a military base in Germany, probably still unaware of the controversy swirling around his release in an exchange for five Taliban militants.\nThe military hasn't said yet how long Bergdahl will remain at Landstuhl Regional Medical Center as specialists work to help him with his \"reintegration.\"\n\"An inherent and critical part of the reintegration process is the decompression period that has been established to maximize returnee health and welfare,\" hospital officials said in a statement. \"The decompression process begins in earnest at LRMC.\"\nThat decompression process has many purposes, said Dr. Elspeth Ritchie, a retired Army colonel who oversaw the reintegration of Korean prisoners of war. A big part of it is to prepare the soldier for \"the blast of media publicity,\" said Ritchie, who is currently the chief medical officer in the District of Columbia's department of behavioral health.\nIn Bergdahl's case, \"he's been in captivity for four to five years presumably with very little stimulation,\" Ritchie said. It's easy to lose your sense of self under those circumstances. And Bowe has come under particular scrutiny for the circumstances of his disappearance.\n\"What's happened when I've been involved with other soldiers is there's been a deliberate period of waiting before reintroducing them to the media so they can get themselves together and make sure they don't run out and tell the world something they may regret later,\" Ritchie said. \"Also there is the question of intelligence. What has the POW learned about the other side. And determining what is useful to our government. There is a careful process of briefings and talk about what is useful and what is not.\"\nIn Ritchie's experience, the decompression period has generally lasted around 72 hours. There could be many reasons why Bergdahl's could take longer.\n\"He could be medically compromised,\" Ritchie said. \"Remember medical health was the reason for the swap happening now. Or could he be psychologically compromised. Or it could be an intelligence issue.\"\nHospital officials said Tuesday that Bergdahl is in stable condition and receiving treatment \"for conditions requiring hospitalization after almost five years in captivity.\" They said they would not release specifics because of medical privacy laws.\n\"I think there's a real danger of people pressuring him to get his story out, and making him feel that there's something wrong with him if he doesn't become a fully functioning individual back in society.\"\nThe reintegration process involves hundreds of people, officials said, including not just medical professionals but attorneys, chaplains and public affairs specialists. There is no predetermined timeline for the process.\nThe next step for Bergdahl will be transfer to the San Antonio Medical Center in Texas, accompanied by at least one doctor and one psychologist trained in survival, escape, resistance and evasion.\nSERE — or survival, escape, resistance and evasion — is a formal training that is given to pilots and others who are considered to be at risk for capture, Ritchie said. In Bergdahl's case, any of that will be given ex post facto.\nBergdahl's return to \"normal\" life may also be affected by the controversy over how he came to be captured by the Taliban and the details of the swap, Ritchie said.\n\"His return is going to be complicated by those questions and also the fact that he was exchanged for five detainees,\" she said. \"People will ask, are we putting other soldiers at risk because of that?\"\nOnce he returns, Paula J. Caplan, a clinical and research psychologist and associate at Harvard's DuBois Research Institute, said there's enormous pressure on veterans to \"get past\" their experience, no matter how complicated their service.\n\"I think there's a real danger of people pressuring him to get his story out, and making him feel that there's something wrong with him if he doesn't become a fully functioning individual back in society,\" said Caplan, author of \"When Johnny and Jane Come Marching Home: How All of Us Can Help Veterans.\"\nThe controversies may mean that Bergdahl will have similar problems to those experienced by Korean POWs who were greeted with suspicion when they came back to the United States. At that time there was a lot of talk about possible brain washing, a la \"The Manchurian Candidate,\" Ritchie said.\n\"I think he'll be a lot more like them than the POWs who returned from Vietnam,\" she said.\nSome of those POWs from the Korean War ended up defecting — though it is hard to say whether that's because they developed Stockholm Syndrome and sympathized with their captors, or simply struggled under the doubt and suspicion they faced at home. \"In general, the second-guessing makes the return difficult,\" Ritchie said.\nSoldiers then and now face the danger of post-traumatic stress disorder, though there wasn't a term for it at the time. No one followed those POWs closely enough to say how long it took to get \"back to normal,\" Ritchie said. \"However, the short answer is that some never did.\"\nOne advantage the Korean POWs had over Bergdahl is that they all came back around the same time so they had a natural support group. Beyond that, Ritchie said, is the fact that Bergdahl's situation is more like that of a hostage than a POW.\nAnger from those who think the trade should never have happened may make Bergdahl's reintegration especially tough, Ritchie said. She cautioned the critics, \"Don't judge someone until you've been in their shoes. Any kind of rush to judgment is premature.\"","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/bowe-bergdahl-could-face-long-road-reintegration-n121636"}
