{"authors":[],"date_download":"2018-10-22 21:01:51","date_modify":"2018-10-22 21:01:51","date_publish":"2014-06-03 18:27:09","description":"But the expert says the military, in announcing an inquiry into Sgt. Bowe Bergdahl, could just be buying time.","filename":"data/vaneerConsumption/BoweBergdahlCouldGetFiveYearsforDesertingExpertSays.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_29/480706/140602-bowe-bergdahl-5a_e20985afeeb9871b9348fa6c867e3fee.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_bowe-bergdahl-could-get-five-years-deserting-expert-says-n121496_1540242111.html","title":"Bowe Bergdahl Could Get Five Years for Deserting, Expert Says","title_page":"Bowe Bergdahl Could Get Five Years for Deserting, Expert Says","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSgt. Bowe Bergdahl could face up to five years in prison if he is found to be a deserter, but an expert in military prosecutions says a planned inquiry by the Army could just be an attempt to buy time.\nEugene R. Fidell, who teaches military justice at Yale Law School, said by phone Tuesday that the military may want to wait for temperatures to cool on Capitol Hill and for Army leaders to “get their head wrapped around this situation.”\nMilitary officials told NBC News on Tuesday that they are preparing a high-level inquiry into the personal conduct of Bergdahl, freed over the weekend after five years in Taliban captivity, and into the circumstances of his disappearance.\nNew witnesses may come forward, but Fidell said the military almost certainly has already spoken to the other people involved. The Associated Press has reported that the Pentagon concluded in 2010 that Bergdahl had walked away from his unit.\n“They have a thick file on this case,” Fidell said.\nArmy Secretary John McHugh said the Army would conduct a “comprehensive, coordinated” review including speaking to Bergdahl himself.\nOne further step could be an Article 32 hearing, the prelude to a possible court-martial. That would result in a recommendation to a commander about whether Bergdahl should be punished.\nIf the military can prove that he deserted with the intent to shirk hazardous duty, the penalty could be as stiff as five years, either in civilian or military prison, Fidell said. The lightest penalty would be nothing.\nThe military says 466 service members deserted or went AWOL in 2012, the most recent year for which figures are available. That figure has declined since the mid-2000s, at the height of the Iraq and Afghan conflicts. It was 1,866 in 2004.\nThere are wrinkles in Bergdahl’s case: He has already spent five years in captivity, and “you typically don’t throw the book at people” who have been prisoners, Fidell said.\nIn 1965, a soldier named Charles Robert Jenkins deserted the Army because of fear of combat in Vietnam. He walked from the Demilitarized Zone into North Korea, where he lived until 2004.\nHe turned himself in at an Army based in Japan, was court-martialed at age 64 and was given 30 days. He served 24 days and was set free.\n— Erin McClam and Courtney Kube","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/bowe-bergdahl-could-get-five-years-deserting-expert-says-n121496"}
