{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 19:28:34","date_modify":"2018-10-30 19:28:34","date_publish":"2016-12-06 13:47:40","description":"Outgoing Sen. Barbara Boxer is challenging fellow California Senator and liberal Democrat Sen. Dianne Feinstein over a bipartisan water bill.","filename":"data/vaneerConsumption/BoxervsFeinsteinoverBipartisanFederalWaterBill.json","image_url":"https://media.breitbart.com/media/2016/03/Dianne-Feinstein-Barbara-Boxer-Chris-Pizzello-Associated-Press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_12_06__1540927714.html","title":"Boxer vs. Feinstein over Bipartisan Federal Water Bill","title_page":"Boxer vs. Feinstein over Bipartisan Federal Water Bill","title_rss":"NULL","source_domain":"breitbart.com","text":"Outgoing Sen. Barbara Boxer (D-CA) is challenging fellow California Senator and liberal Democrat Sen. Dianne Feinstein (D-CA) over the Water Resources Development Act (WRDA), which emerged from bipartisan compromise in both houses.\nThe new version of the bill, McClatchy reports, “authorize[s] $558 million for desalination, recycling and storage projects, among other proposals,” and eases access to water for farmers in the Central Valley when fish species would not be affected.\nHouse Majority Leader Kevin McCarthy (R-CA) praised the bill, and Sen. Feinstein’s role in negotiating it: “The agreement could not have been finalized without Senator Dianne Feinstein, and I am proud to have worked with her on this legislation,” he said in a statement on Monday. “Our work on California water is by no means complete, but this deal signals that there is a path to getting more done to restore California’s greatness.”\nHowever, Sen. Boxer rejected the bill and vowed to resist it — especially a drought-related provision that would allow federal and state water project managers to “exceed the environmental pumping limits to capture more water during storms,” the Los Angeles Times reports. “There is no place for that as long as I am breathing … They are not playing a game with someone who will not play hardball. I will not allow this to come forward without a fight,” Boxer said on Monday, according to the Times.\nIt is not clear what leverage Boxer hopes to exert, given the bipartisan push to pass the bill before the Trump administration takes office — which Democrats fear will put them at a greater disadvantage. Trump has promised to deliver more water to farmers in the Central Valley and to reduce the emphasis that is currently placed on the endangered delta smelt. “Ninety-eight percent of the time we see everything the same way. We don’t see (this) the same way,” Boxer said of her rift with Feinstein, McClatchy reports.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. His new book, See No Evil: 19 Hard Truths the Left Can’t Handle, is available from Regnery through Amazon. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/local/2016/12/06/boxer-vs-feinstein-bipartisan-federal-water-bill/"}
