{"authors":["Jenny Awford For Daily Mail Australia"],"date_download":"2018-10-23 00:07:04","date_modify":"2018-10-23 00:07:04","date_publish":"2016-01-11 08:42:13","description":"Boxer Kyron 'Hitman' Dryden (pictured) has been found guilty of grabbing his ex-girlfriend by the throat, pushing her head into a mirror and throwing her onto the floor of a home in Newcastle.","filename":"data/vaneerConsumption/BoxerKyronHitmanDrydenfoundguiltyofassaultingmodelgirlfriend.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/08/300659C400000578-0-image-a-22_1452501570020.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393564_Boxer-Kyron-Hitman-Dryden-guilty-assaulting-model-girlfriend_1540253224.html","title":"Boxer Kyron 'Hitman' Dryden found guilty of assaulting model girlfriend","title_page":"Boxer Kyron 'Hitman' Dryden found guilty of assaulting model girlfriend | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A world champion boxer has been found guilty of grabbing his bikini model ex-girlfriend by the throat and throwing her to the ground, before posting a video of her lying injured on the floor to Snapchat.\nKyron 'Hitman' Dryden, 22, pushed Tori-Lee Hillery's head into a mirror and 'choke-slammed' her onto the bedroom floor after he found her at another man's home in Newcastle, a court heard.\nHe posted a video of his ex-partner lying 'concussed' on the floor to social media site Snapchat in which he could be heard talking about his 'missus cheating on me' before calling her a 'stupid s***'.\nThe International Boxing Organisation youth welterweight world champion pleaded not guilty to assaulting Ms Hillery, causing her actual bodily harm, but he was found guilty on Monday.\nWorld champion boxer Kyron 'Hitman' Dryden (left) has been found guilty of choke slamming his bikini model ex-girlfriend Tori-Lee Hillery (right)\nThe boxer posted a video of his ex-partner lying 'concussed' on the floor to social media site Snapchat\nHe admitted to posting the Snapchat video, but claimed that he had not touched Ms Hillery during the incident in Newcastle, NSW, the Daily Telegraph reported.\nIn the video entitled 'ex-missus', the boxer could be seen outside a man's house in Mayfield where he says he has found his ex-partner has been allegedly cheating on him.\n'She's been lying to me the whole time,' Dryden said in the 10-second clip, according to the Newcastle Herald.\n'Here is her car in front of his house.'\nThe International Boxing Organisation youth welterweight world champion pleaded not guilty to assaulting Ms Hillery, causing her actual bodily harm, but he was found guilty on Monday\nThe court previously heard that Ms Hillery (right) suffered concussion during the incident in September last year as well as a strained shoulder and bruising around her neck\nThe video clip then showed Dryden inside the house after he had found his ex-girlfriend.\nThe court previously heard that Ms Hillery suffered concussion during the incident in September last year as well as a strained shoulder and bruising around her neck.","url":"https://www.dailymail.co.uk/news/article-3393564/Boxer-Kyron-Hitman-Dryden-guilty-assaulting-model-girlfriend.html"}
