{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:29:57","date_modify":"2018-10-30 21:29:57","date_publish":"2016-07-17 17:05:22","description":"Sony/Village Roadshow's female-led Ghostbusters reboot failed to scare up enough business to be considered a hit in its opening frame, while Universal/Illumination's latest animated offering The Secret Life of Pets looked to be on track for a $50M+ weekend to retain the top spot and Bryan Cranston's undercover caper The Infiltrator fell flat at the box office this weekend. | Entertainment","filename":"data/vaneerConsumption/BoxOfficeFemaleLedGhostbustersUnderwhelmswith2ndPlaceFinish.json","image_url":"https://media.breitbart.com/media/2016/07/ghostbusters-slimed.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_07_17__1540934997.html","title":"Box Office: Female-Led 'Ghostbusters' Underwhelms with 2nd-Place Finish","title_page":"Box Office: Female-Led 'Ghostbusters' Underwhelms with 2nd-Place Finish | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Sony/Village Roadshow’s female-led Ghostbusters reboot failed to scare up enough business to be considered a hit in its opening frame, while Universal/Illumination’s latest animated offering The Secret Life of Pets looked to be on track for a $50M+ weekend to retain the top spot and Bryan Cranston’s undercover caper The Infiltrator fell flat at the box office this weekend.\nThe Paul Feig-directed Ghostbusters is projected to finish the weekend with $46 million, according to Deadline. While that result does not represent an outright bomb for Sony and Village Roadshow, the film will need to pull out a strong second weekend in the U.S. and will need to open well overseas if it is going to recoup its roughly $244 million price tag (including a reported $100 million in marketing costs) and turn a profit.\nThe film — starring Melissa McCarthy, Kristen Wiig, Leslie Jones and Kate McKinnon as the ghost-hunting heroes — earned solid reviews (B+ CinemaScore, 73% Rotten Tomatoes), so it could technically finish out the weekend a tad higher. It’s already guaranteed to be Paul Feig and Melissa McCarthy’s biggest opening weekend to date, besting the $39.1 million the director and star earned with their 2013 collaboration The Heat and easily topping the $29 million earned by last year’s Spy.\nHowever those films cost significantly less to make ($65 million before marketing for Spy, $45 million for Heat).\nFeig’s R-rated comedies have a good track record when it comes to week-over-week audience retention (Spy finished with $110M domestic after opening to $29M, and The Heat finished with $159.6M domestic after opening to $39.1M). But Ghostbusters is a PG-13 family-friendly comedy, and the film’s targeted audience, women, didn’t exactly love it, giving it a tepid B+ CinemaScore (males gave it a B), while audiences that said they came out specifically to see the four women in the lead roles also gave it a B+, according to Deadline. Only the under-25 and under-18 crowds gave the film an A.\nThe film will also face plenty of competition next weekend when three new wide releases hit: 20th Century Fox’s animated Ice Age: Collisions Course, New Line’s horror flick Lights Out and Star Trek Beyond, which early tracking suggests could open to around $60 million. Ice Age and Star Trek will almost certainly eat into Ghostbusters‘ family and male audiences, respectively.\nThe bottom line is that Ghostbusters will need to pull out a strong showing at the international box office to be considered a hit, which will be tough to do. The film opens in English-speaking territories and in Brazil this weekend, with Russia and Japan set to follow in two weeks. But according to reports, the film will not be released theatrically in China, the world’s second-largest film market and an increasingly important chunk of revenue for big-budget tentpoles.\nAnd, as a general rule, American comedies don’t fare nearly as well overseas as action-packed blockbusters, like say, last year’s record-breaker Jurassic World, do.\nMeanwhile, Universal/Illumination Entertainment’s The Secret Life of Pets is projected to hold on to the No. 1 spot at the box office this weekend with an opening north of $50 million. That is a fantastic result for the studio behind the Despicable Me and Minions movies, after Pets shattered expectations with a $104 million opening frame last weekend. The well-reviewed family flick, with Louis C.K. and Kevin Hart leading the voice cast, cost $75 million before marketing.\nBroad Green Pictures’ The Infiltrator, starring Bryan Cranston as an undercover Customs agent who penetrates Pablo Escobar’s money-laundering operation, is estimated to earn $4.8-$5 million through Sunday for a five-day total of $6.1 million (the film opened on Wednesday) from 1,600 theaters. The adult-targeted film earned an A- CinemaScore and a 65% rating on Rotten Tomatoes.\nHoldovers The Legend of Tarzan, Finding Dory and Mike and Dave Need Wedding Dates are expected to take the Nos. 3, 4 and 5 slots at this weekend’s box office, respectively.\nFollow Daniel Nussbaum on Twitter: @dznussbaum","url":"https://www.breitbart.com/entertainment/2016/07/17/box-office-feminist-ghostbusters-underwhelms-finishes-2nd-behind-pets/"}
