{"authors":["Amie Gordon For Mailonline"],"date_download":"2018-10-22 23:54:45","date_modify":"2018-10-22 23:54:45","date_publish":"2017-03-16 08:17:54","description":"Brandon Morris, 16, died after the Ford Focus he was the passenger in collided with another vehicle during a police pursuit in Middlesborough, and his brother has been left in a coma.","filename":"data/vaneerConsumption/Boy16diesinhighspeedpolicechaselikehisuncle.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/08/3E527B1A00000578-0-image-a-23_1489652270694.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319098_Boy-16-dies-high-speed-police-chase-like-uncle_1540252485.html","title":"Boy,16, dies in high speed police chase like his uncle","title_page":"Boy,16, dies in high speed police chase like his uncle | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A teenage boy has been killed and his brother is in a coma following a high speed police chase.\nBrandon Morris died after the Ford Focus he was the passenger in collided with another vehicle during a pursuit in Middlesborough on Tuesday.\nIn a further devastating blow for his family, Brandon's brother Declan, 17, has been left in a coma - and the tragedy comes after his 18-year-old uncle died in a similar manner 12 years ago.\nBrandon Morris, 16, died after the Ford Focus he was the passenger in collided with another vehicle during a pursuit in Middlesborough on Tuesday\nCraig Morris died 12 years ago when the Vauxhall Vectra he was in refused to stop for police and hit trees\nThe Ford Brandon was travelling in crashed into a Nissan Qashqai in central Middlesbrough at around 8pm on Tuesday.\nCleveland Police said officers chased the Focus after it refused to pull over.\nBrandon was taken to the James Cook University Hospital, where he died from his injuries.\nSix people were taken to James Cook University Hospital following the crash.\nA 29-year-old man has been charged with causing death by dangerous driving and will appear at Teesside Magistrates' Court today.\nThree other people who were also arrested in connection with the incident have been released without charge.\nThe male driver of the Nissan, the only person in the vehicle, was taken to hospital but has since been released.\nA 29-year-old man has been arrested on suspicion of causing death by dangerous driving.\nJust 12 years ago, Brandon's 18-year-old uncle Craig died after the car he was in crashed during a police chase.\nAccording to The Sun, Craig died when the Vauxhall Vectra he was in refused to stop for police and hit trees.\nThe Ford Brandon was travelling in crashed into a Nissan Qashqai in central Middlesbrough at around 8pm on Tuesday\nCraig, a back seat passenger, died at the scene.\nA relative told The Sun: 'It is 12 years since Craig's death and that's still hard to take. This family has been through so much.'\nTributes have since poured in on social media for Brandon, with one friend writing: 'God only takes the best.'\nAnother wrote: 'Fly High brother - never forgotten.'\nA GoFundMe page has now been set up to help with the teenager's funeral costs.\nA spokesman added: 'A short pursuit ensued, during which the Ford Focus was subsequently in collision with a Nissan Qashqai which was being driven near the junction of Park Road North and Park Vale Road in Middlesbrough.\n'A 16-year-old boy in the Focus suffered serious injuries during the collision. Sadly he was later pronounced deceased at James Cook University Hospital.'\nThe force say inquiries are ongoing and have asked for anybody who witnessed anything to call 101 quoting event 043723.\nThe Independent Police Complaints Commission has also launched an investigation.","url":"https://www.dailymail.co.uk/news/article-4319098/Boy-16-dies-high-speed-police-chase-like-uncle.html"}
