{"authors":["Matilda Rudd For Daily Mail Australia"],"date_download":"2018-10-23 00:28:39","date_modify":"2018-10-23 00:28:39","date_publish":"2017-03-10 06:57:15","description":"Melbourne boy Rian Webster, 13, was mistaken for a girl after growing his hair for four years. But he has never wavered from wanting to participate in the World's Greatest Shave.","filename":"data/vaneerConsumption/Boy13hasbeengrowinghishairforFOURyears.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/05/3E20481300000578-0-image-a-3_1489125031311.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4299988_Boy-13-growing-hair-FOUR-years_1540254519.html","title":"Boy, 13, has been growing his hair for FOUR years","title_page":"Boy, 13, has been growing his hair for FOUR years | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Melbourne boy, Rian Webster, 13, was mistaken for a girl after growing his blonde locks for four years.\nBut despite the upsetting mix ups he has never wavered from wanting to participate in the World's Greatest Shave this March.\n'I told him to just cut it off. If his hair was making him this upset it wasn't worth it. But he didn't,' his mother, Nikki Webster, told Daily Mail Australia.\nRian Webster, 13, has always been a firm believer in social justice and mental health, particularly since he lost his dad to suicide in 2013\n'Rian lost his father to suicide when he was nine years old. He became heavily involved with Feel The Magic, an organisation that helps kids deal with grief.\n'I think going through his own kind of grief made him really aware of other people in need. He is always wanting to help,' she said.\nRian's age and lack of income makes it difficult for him to make any 'groundbreaking' contributions or participate in other charity fundraisers because the minimum age of signing up is usually 16.\nLook at that hair! With blonde locks as luscious as these Rian has often been mistaken for a girl. But he won't let that stop him raising money for blood cancer\nThe World's Greatest Shave was something small but powerful he could do himself.\n'He can control his hair and decide whether or not to cut it so this was a way he could get involved,' said Ms Webster.\nBut his mother had one condition for her son. She wasn't going to raise the money for him.\n'I told Rian he had to commit to it. I could take him to places but ultimately he had to be the one to talk to people and ask them to support him,' Miss Webster said.\nAnd that he did. The eager 13-year-old regularly did tin shakes down at the local supermarket, making signs and standing out the front for hours at a time waiting to speak with passers by.\nMs Webster remembers one particularly quiet day she suggested he make a different call to action so Rian decided to write a new sign that read 'If shaving my head isn't enough I give hugs for $1.'\nMs Webster remembers one particular quiet day she suggested he make a different call to action so Rian decided to write a new sign that read 'If shaving my head isn't enough I give hugs for $1'\nRian, 13, has shaved his hair once before when he was eight years old. He enjoyed the experience so much he decided to grow his hair for four years before shaving it again\n'This was pretty huge for Rian. He hates cuddling normally so I knew he was really putting himself outside his comfort zone. And people were happy to oblige!' she said.\nAfter growing his locks for almost four years Rian was mistaken for a girl in public.\n'Rian is a beautiful, quiet gentle boy and has received no end of comments and negative attention since he started growing his hair,' Ms Webster told Kidspot.\n'It has increased as the length has grown and the first few times it happened he was shattered.\n'He is very sensitive and came home in tears more than a few times, and we had a long talk about his feelings and what his goal was.\n'I explained to him that most people don’t even pay attention - they see long hair and assume he is a girl.'\nMs Webster said her son was not deterred, even with the struggles he faced.\nNikki Webster (right) says her son has raised more than five times the amount he raised the first time he shaved his head\nRian, also known as 'Chicken' to his family because of his resemblance to Chicken Little when he first got his glasses, has almost reached his target of $5,000 on his official World's Greatest Shave page.\nIt's more than five times the amount he raised the first time he shaved his hair at age eight.\n'His school is actually allowing him to collect a $2 collection from students so they can wear mufti the day after he shaves his head. So when he goes around the classrooms to collect the money he can show his classmates exactly what their money is going towards,' said Ms Webster.\nYou can donate to Rian's cause here.","url":"https://www.dailymail.co.uk/femail/article-4299988/Boy-13-growing-hair-FOUR-years.html"}
