{"authors":[],"date_download":"2018-10-22 20:42:53","date_modify":"2018-10-22 20:42:53","date_publish":"2014-05-02 13:33:20","description":"The 8-year-old boy died, and his sister remains in the hospital. The male teenage suspect has been caught, Richmond, Va., police said.","filename":"data/vaneerConsumption/Boy8KilledDefendingSisterFromRapistCops.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_18/417086/140502-brother-killed-mn-1545_5f35fbdde2fd1f91b95421b43560ea18.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_crime-courts_boy-8-killed-defending-sister-rapist-cops-n95571_1540240973.html","title":"Boy, 8, Killed Defending Sister From Rapist: Cops","title_page":"Boy, 8, Killed Defending Sister From Rapist: Cops","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"I'm still trying to make sense of this senseless crime,\" Pitchford said. \"I couldn't fathom the thought of this ever happening.\"\nThe neighborhood's calm was shattered Thursday, when police rushed to the home at 6:30 p.m. The brother and sister had been playing on train tracks behind the family home's backyard.\nThe suspect approached the pair, who often played together, and attempted to sexually assault the girl, police said.\nMartin tried to help his sister, and the suspect struck him in the head with a brick, NBC station WWBT reported. He died at the scene.\nHis sister was recovering Friday at VCU Medical Center and was feeling \"OK,\" the family told NBC News.\nPolice hunted for the suspect Thursday night. Initially, he was described as a white male with scraggly facial hair. But Dionne Waugh, a spokeswoman for the Richmond police, told NBC News the description was false because the victim was told her family would be harmed if she gave a true description.\nWith the help of outraged neighbors, police identified a male teenage suspect. He was being medically evaluated Friday with a warrant for his arrest pending.\n\"The community's response has been tremendous,\" Waugh told NBC News. \"They played a very important role in gathering information to lead us to this point.\"\nWaugh called the assault and killing grisly and heartbreaking — \"probably one of the most tragic cases\" she's ever encountered.\n\"Every loss of life here is tragic, [but] whenever it's a case involving juveniles, it's especially hard for everyone involved, from our detectives to our fire and ambulance personnel, who are often first on scene,\" she said. \"So it's been a challenge, I think, for a lot of people here.\"\nMartin was a first-grader at Elizabeth D. Redd Elementary School. A picture released by the family shows the boy in a matching gray vest and pants, his hands stuffed into his pockets.\n\"He was a lovely little boy. He didn't deserve this.\"\nHe played with cars and collected keys. He and his older sister were inseparable and were often the last ones to go back inside because they loved playing together, the family said.\n\"There was not one person around here who didn't know him,\" Pitchford added.\nNeighbor Tracy Lightsey said Martin was trying to fight off the suspect during the attack, his family told her.\n\"He felt like he was his sister's protector,\" Lightsey told the Richmond Times-Dispatch. \"He was his sister's keeper till his death.\"\nA vigil is planned for 7:30 p.m. Saturday at Abundant Life Church in Richmond. A memorial fund called the Keys for Marty Foundation has been established; donations can made by at any Wells Fargo bank branch.\nErik Ortiz and M. Alex Johnson of NBC News contributed to this report.\nCorrection: An earlier version of this story incorrectly reported the victims' ages as 9 and 11.","url":"https://www.nbcnews.com/news/crime-courts/boy-8-killed-defending-sister-rapist-cops-n95571"}
