{"authors":["Amie Gordon For Mailonline"],"date_download":"2018-10-22 22:48:54","date_modify":"2018-10-22 22:48:54","date_publish":"2016-01-28 11:13:29","description":"A boy has been arrested on suspicion of making a copycat hoax bomb threat after similar calls were made to schools across London and Birmingham, leading to thousands of pupils being evacuated.","filename":"data/vaneerConsumption/BoyarrestedafterLondonBirminghamandParisschoolsevacuatedoversecuritythreat.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/30A9D3B100000578-0-image-a-47_1453983917378.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420720_Schools-London-Paris-evacuated-security-threat-just-two-days-wave-Russian-linked-bomb-hoaxes-Britain-France_1540248534.html","title":"Boy arrested after London, Birmingham and Paris schools evacuated over 'security threat'","title_page":"Boy arrested after London, Birmingham and Paris schools evacuated over 'security threat' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A 14-year-old boy has been arrested on suspicion of making a copycat hoax bomb threat after dozens of similar calls were made to schools around the country.\nWest Midlands Police said the youth was detained by officers after a call made to a school in the Great Barr area of Birmingham on Wednesday was traced to a nearby phone box. CCTV inquiries then identified the teenager - who is not being linked to other hoax calls - as a suspect.\nThousands of students were evacuated from schools across Birmingham, south-west London, Paris, Amsterdam and Tokyo today following reports of 'security threats'.\nScroll down for video\nSecurity scares: Ricards Lodge High School in West London (pictured) was evacuated for a second time following a bomb hoax. A Met Police spokesman said the threats were being treated as 'malicious communications'\nHoax bomb threats at schools across London (shown in the map) and Birmingham have caused chaos, with thousands of pupils evacuated to other locations or sent home\nSCHOOLS CLOSED ACROSS PARIS, LONDON AND BIRMINGHAM LONDON: Bishop Gilpin Primary School Ricards Lodge High School Harris Academy Merton Ursuline High School, Wimbledon BIRMINGHAM: Bristnall Hall Academy Sandwell City Academy Perryfields High School Oldbury Academy Ace Academy George Salter High School Ormiston Academy Handsworth Grammar School St Paul's Girls School Harborne Academy Windsor High School Sandwell College Shireland Collegiate Academy Colley Lane Primary School PARIS: Louis-le-Grand (5th arrondissement), Charlemagne (4th), Condorcet (9th), Hélène Boucher (20th), Victor-Hugo (3rd)\nToday signalled the third wave of school bomb scares in just over a week, and comes just two days after a Russian Twitter group was thought to be behind a series of bomb threats which saw thousands of pupils evacuated from 14 schools in Britain and six in Paris.\nAt least five Paris high schools were evacuated after bomb threats were made for the second time this week.\nAccording to local reports, callers claimed to be threatening to turn up at schools armed with bombs and guns.\nPolice are investigating calls made to 14 schools in the West Midlands this morning making bomb threats – but officers said there was 'no credible threat to schools receiving bomb hoax calls in the West Midlands'.\nJust after 8am dozens of calls were made to schools and colleges across the region making the threat.\nIt follows similar phone threats to schools in the West Midlands in the past week.\nDetective Inspector Colin Mattinson from West Midlands Police, added: 'At this stage there is nothing to suggest there is any credible threat to any of the schools.\n'Our response officers have been sent to the locations to ensure there is no threat to anyone's safety and support the schools.\n'A police investigation is on-going to find the person responsible for these calls.'\nA spokesman for the Met Police said the bomb threats were warning of 'suspicious devices' being placed in schools - but the calls were being treated by officers as 'malicious communications'.\nUrsuline High School in Wimbledon confirmed a bomb threat had been made this morning and all students had been evacuated before sixth form pupils were sent home.\nPolice are investigating calls made to 14 schools in the West Midlands making bomb threats – but officers believe they are 'false and malicious'. Pictured, the schools which closed across the Birmingham area\nAccording to the Dutch Telegraaf, false bomb threats closed three schools in the capital today, causing mayhem.\nOne source told the Telegraaf up to five schools in the Dutch capital were threatened, however 'no explosives were found'.\nIn Tokyo's busy Shibuya Ward, some 800 people were evacuated from the British School and neighboring buildings according to theJapan Times.\nLocal reports claim an emergency evacuation order was issued at the international school.\nTeachers at a school which was targeted by a bomb hoax evacuated pupils to a Premier League football stadium. While most students were evacuated to car parks and playgrounds, pupils from Sandwell Academy were sent to the home of nearby West Bromwich Albion\nA total of 14 schools in the West Midlands received the threats which have caused chaos across Britain in recent days.\nBut while most students were evacuated to car parks and playgrounds today, pupils from Sandwell Academy were sent to the home of nearby West Bromwich Albion.\nOne student tweeted pictures of his classmates sat in their uniform in one of the stands of The Hawthorns ground.\nIn the images teachers can be seen standing near the pitch while the pupils sit in the seats usually reserved for supporters of the Premier League club.\nHe tweeted: 'Bomb scare at my sixth form! We got evacuated to the west brom stadium.'\nTaking to its Twitter account the school, which is situated across the road from the West Brom stadium, also confirmed students were sitting in the stands.\nThey tweeted: 'Sandwell Academy safely evacuated all staff and students are safe in the Hawthorns stadium.'\nOn Tuesday, children were removed from six schools in Birmingham, four in London and four in Cornwall.\nExactly one week earlier, three West Midlands schools were evacuated when they received what turned out to be hoax calls.\nA group using the Twitter handle @Ev4cuati0nSquad appeared to be behind the false threats.\nA Twitter account called 'Evacuators 2k16' claimed responsibility for the threats, saying they intend to cause 'mayhem'.\nThe profile for @Ev4cuati0nSquad, which has now been suspended, says: 'We are 6 individuals based internationally.' Despite the account being closed down, the threats continued today.\nA Department for Education spokesperson said: 'We are aware of the ongoing incident, police are looking into it and we are monitoring the situation.\n'Nothing is more important than the safety of our children, where any school is subject to such a threat, real or otherwise, there are clear emergency arrangements in place that have been agreed with police and the local authority.\n'We trust schools to follow those.'\nPeople took to Twitter to warn people about the closures. The Department for Education said it was 'aware of the ongoing incident' and was monitoring the situation\nOn Tuesday, children were removed from six schools in Birmingham, four in London and four in Cornwall. Exactly one week earlier, three West Midlands schools were evacuated when they received what turned out to be hoax calls\nA statement on the Ursuline High School website said the Year 11 parents' evening had to be cancelled following the closure: 'We have had a bomb threat at the school this morning. All students have been safely evacuated.\n'We ask that parents do not attend or collect students. All student have been informed of the current situation.\n'We are awaiting the police dog team to search the school.'\nWhile it re-opened later in the afternoon, a statement on Bishop Gilpin's website said this morning: 'Bishop Gilpin is closed this morning due to a threat made against Ricards Lodge.\n'We have received official clearance to reopen this afternoon. Children will be welcome in school from 1.30pm onwards.\n'Children should make their way to class as they would in the morning. Gates will be staffed.'\nSecurity scares: Police checked Ricards Lodge High School (left) and several other schools, including Bishop Gilpin (right), which has closed\nThe Harris Academy in Merton, London, which closed to students following more bomb scares for the second time in one week\nA spokesman for the National Police Chiefs' Council said: 'Police take hoaxes extremely seriously.\n'They divert police resources and cause disruption and alarm to the public.'\nCouncillor Martin Whelton, Merton Council Cabinet Member for Education and Pollards Hill Labour councillor took to Twitter to update his followers on which schools which had been evacuated.\nHe tweeted: 'I understand three schools in Merton have been evacuated following a security alert - [Ricards, Ursuline and Harris].\n'Everyone has been safely evacuated & the police are investigating.\n'Hopefully it will be resolved shortly.'\nWith Paris still on high alert following November's terror attacks, threats in the city are being taken seriously. This map shows the schools around the city which have been evacuated\nThe Victor-Hugo School in the 3rd arrondissement, Paris (left) and the Condorcet high school in the 9th arrondissement","url":"https://www.dailymail.co.uk/news/article-3420720/Schools-London-Paris-evacuated-security-threat-just-two-days-wave-Russian-linked-bomb-hoaxes-Britain-France.html"}
