{"authors":["Abc News","More Genevieve"],"date_download":"2018-10-30 00:57:55","date_modify":"2018-10-30 00:57:55","date_publish":"2018-10-29 12:58:48","description":"Carter is suffering from leukemia, and his mom wanted to cheer him up.","filename":"data/vaneerConsumption/Boybattlingcancerreceives300Halloweencardsmomsfaithinhumanityrestored.json","image_url":"https://s.abcnews.com/images/GMA/carter-mcpherson-06-ht-jc-181029_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/GMA_Family_boy-battling-can_0266595aa5b01b72e410352fbe40d230_story_id=58829975_1540861075.html","title":"Boy battling cancer receives 300 Halloween cards, mom's 'faith in humanity' restored","title_page":"Boy battling cancer receives 300 Halloween cards, mom's 'faith in humanity' restored - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"Carter McPherson is four years old, and he loves Halloween.\nThis year will be one for the books. Carter, who is fighting pre-B cell acute lymphoblastic leukemia, has received more than 300 Halloween cards and gifts from people all over the country.\nHis mom Tiffany McPherson told \"Good Morning America\" she posted to Nextdoor, a site that connects people to their neighbors, at the end of September asking for Halloween cards to cheer Carter up.\nCourtesy Tiffany McPherson\n\"The response was overwhelming, I have had so many cards overflowing in our mailbox,” said McPherson. “Carter just started pre-K and he can recognize his name and he always loves to check the mail and find his name on the cards.\"\nSince that initial post, the \"cheer cards\" have been pouring in from all over the country, in addition to \"about 10 Amazon boxes a day,\" the Orlando, Florida-based McPherson said.\nCourtesy Tiffany McPherson\nCarter was diagnosed with cancer on Feb. 10, 2017, something Tiffany describes as \"a day I will never forget.\"\nCourtesy Tiffany McPherson\nRight now, McPherson said, Carter is in remission and \"doing wonderful. He has a three-year treatment plan scheduled to end in 2020.\nThe cards and gifts have “encouraged” Carter, McPherson said. \"I did this for my son to see pure joy, pure happiness. It's not about the gifts he has received -- which is more than I could ask -- it's the excitement on my son's face, which is all I wanted.\"\nCourtesy Tiffany McPherson\n\"The fact that pure strangers across the world have taken the time to send my son something has been amazing,\" McPherson told \"GMA.\" \"It has made me a stronger momma. This has definitely restored my faith in humanity for sure.\"","url":"https://abcnews.go.com/GMA/Family/boy-battling-cancer-receives-300-halloween-cards-moms/story?id=58829975"}
