{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 18:34:30","date_modify":"2018-10-30 18:34:30","date_publish":"2016-09-11 09:10:25","description":"The UN Department of Public Information held a media seminar in Pretoria, South Africa earlier this month on peace in the Middle East","filename":"data/vaneerConsumption/BoycottIsraelActivistsParticipatedinUNMideastSeminar.json","image_url":"https://media.breitbart.com/media/2016/02/bdsgirls1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_09_11__1540924470.html","title":"Boycott Israel Activists Participated in UN Mideast Seminar","title_page":"Boycott Israel Activists Participated in UN Mideast Seminar","title_rss":"NULL","source_domain":"breitbart.com","text":"Arutz Sheva reports: The United Nations Department of Public Information held a media seminar in Pretoria, South Africa earlier this month on peace in the Middle East.\nThe stated goal of the three-day seminar was to bring together “politicians, academics and other experts exploring new ways to narrate the complex and evolving story of the Israeli-Palestinian conflict.”\nWhile the UN is meant to be an objective body, no official Israeli representatives were invited to participate. The current Palestinian representative to the UN and their former representative to the European Union both took part in the seminar.\nMoreover, most of the speakers at the event are known for their anti-Israel views including Professor Steven Friedman from the University of Johannesburg who attacked Israel and defended the BDS movement. Other officials affiliated with the BDS movement took part in the seminar and were quoted on the official UN website.\nIsrael’s Ambassador to the Danny Danon wrote a letter to Secretary General Ban Ki-moon harshly criticizing the fact that the UN sponsored an anti-Israel event. “The UN has a moral obligation to act in accordance with the values and purposes of its charter, and events like this undermine the integrity and impartiality of the UN,” wrote Ambassador Danon. “It is unfortunate that approximately 6.5 million dollars annually are diverted from those in dire need of humanitarian assistance to bodies whose only function is to serve as public relations departments for the Palestinian cause,” the Ambassador continued.\nRead more here.","url":"https://www.breitbart.com/middle-east/2016/09/11/boycott-israel-activists-participated-un-mideast-seminar/"}
