{"authors":["Deborah Danan"],"date_download":"2018-10-30 18:35:42","date_modify":"2018-10-30 18:35:42","date_publish":"2016-03-01 11:47:23","description":"SodaStream, the carbonated drinks manufacturer attacked by anti-Israel boycotters two years ago, fired the last of its Palestinian workers Monday.","filename":"data/vaneerConsumption/BoycottedSodaStreamFiresPalestinianWorkersAmidPermitTroubles.json","image_url":"https://media.breitbart.com/media/2015/07/scarlett-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_03_01__1540924542.html","title":"Boycotted SodaStream Fires Palestinian Workers Amid Permit Troubles","title_page":"Boycotted SodaStream Fires Palestinian Workers Amid Permit Troubles","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – SodaStream, the carbonated drinks manufacturer attacked by anti-Israel boycotters two years ago, fired the last of its Palestinian workers Monday after Israeli authorities refused to grant them work permits, the company said.\nA total of 74 Palestinian staff, many of whom worked at the Israeli company for over half a decade, were embroiled in a permit battle between the company and Israeli authorities since the anti-Israel boycott forced SodaStream to relocate its main factory from the West Bank to Israel proper.\n“Today is their final day working with the company, sadly,” SodaStream spokesman Maayan Nave told AFP.\nThe Editor-in-Chief of the Times of Israel, David Horovitz, penned an op-ed lamenting the lay-off, saying that rather than marking a win for the Boycott, Divestment, and Sanctions (BDS) movement, all it did was leave hundreds of Palestinians jobless and shatter SodaStream’s remarkable model of coexistence, which could have been emulated by other businesses.\n“Well done, BDS campaign. A great victory for Palestine. A great step forward on the way to… what, exactly?” Horovitz asked.\nAt the SodaStream factory in Mishor Adumim, day after unremarkable day, stereotypes were being broken down without anybody even noticing. Jews and Arabs were working together, were treated equally, were able to support their families honorably. Now it is shuttered. And as of Monday, all of its Palestinian employees are out of work. What a challenge now, for them, to feed their families, to keep their children safe and prevent them from succumbing to the prevailing hatreds.\nIn late 2014, SodaStream announced that it was shutting down its factory in the West Bank after a ferocious boycott campaign that included personal attacks against Hollywood actress Scarlett Johansson, who served as the company’s brand ambassador.\nIn October 2015, the plant closed, leaving more than 500 Palestinians without jobs.\nAround 1,200 people work at the factory, the majority of whom are Israelis. The Israeli government then failed to provide 74 Palestinian workers with permits. As a result, the company threatened to halt manufacturing.\nBut the Times of Israel reports that SodaStream later backed down and made the Palestinian laborers redundant instead.\nHowever, Nave says that SodaStream would continue the fight to secure permits for them.\n“It is a tough day for us and all the SodaStream workers, but this is not the end of the road,” she said.\nAccording to COGAT, the Defense Ministry body that coordinates Israeli government activity in the Palestinian territories, 58,000 Palestinians hold permits to work in Israel and another 27,000 work for Israeli businesses in West Bank settlements and industrial zones.\nCOGAT declined to comment on the recent layoffs, but emphasized its assistance in relocating the factory to Israel proper.\nIn his column, Horovitz asserted, “Proponents of BDS purport to act in the interests of Palestinians, specifically their quest for independence. It is doubtful that the hundreds of unemployed former Palestinian workers of SodaStream see it that way.”","url":"https://www.breitbart.com/middle-east/2016/03/01/bds-fail-boycotted-sodastream-fires-palestinian-workers-amid-permit-troubles/"}
