{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 21:04:15","date_modify":"2018-10-30 21:04:15","date_publish":"2015-02-05 18:14:44","description":"An eighth-grade boy who spent 15 minutes underwater after falling through ice and was “dead” for 45 minutes, resuscitated after his mother began praying |","filename":"data/vaneerConsumption/BoyDeadfor45MinutesafterFallingthroughIceMiraculouslyRecovers.json","image_url":"https://media.breitbart.com/media/2015/02/john-smith.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_02_05__1540933455.html","title":"Boy ‘Dead’ for 45 Minutes after Falling through Ice, Miraculously Recovers","title_page":"Boy ‘Dead’ for 45 Minutes after Falling through Ice, Miraculously Recovers | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"An eighth-grade boy who spent 15 minutes underwater after falling through ice and was “dead” for 45 minutes, resuscitated after his mother began praying out loud in his hospital room.\nThree 14-year-olds fell through the ice of Lake Ste. Louise, Missouri, on Martin Luther King Day. A rescue crew found one of the boys by shore almost out of the water and the second teen clinging to the ice. The third boy, John Smith, was still under water.\nBy the time they pulled his body from the rocky bottom of the lake, the teen had been submerged for 15 minutes and had no pulse. En route to the hospital, emergency workers performed CPR on the boy, to no effect. When they finally arrived, the attending physician, Dr. Kent Sutterer, had little hope for the boy’s survival, he recalls.\n“I remember his temperature was 88 degrees when we checked it,” said Sutterer, “and in my mind, this is a very grim, very poor chance of survival.”\nThe doctor and his team continued CPR on John for another 27 minutes with no response, and at that point they decided to call John’s mother into the room to give her the news.\n“He was dead for 45 minutes,” says Dr. Sutterer.\nBut then something completely unexpected happened. According to the doctor, when Joyce Smith entered her son’s room, she “started praying loudly.”\n“I don’t remember what all I said,” she recalls, “but I remember, ‘Holy God, please send your Holy Spirit to save my son. I want my son, please save him.’”\nAnd then, something happened. Apparently Smith’s heart began beating again, and doctors announced that he now had a pulse.\n“And they hadn’t been getting a pulse at that time,” Mrs. Smith said, and “all of a sudden I heard them saying, ‘We got a pulse, we got a pulse.’”\nAccording to Dr. Sutterer, “Within a matter of a minute or two, his heart started again.”\nThe doctors are having a hard time explaining exactly what happened, and his complete recovery has them perplexed.\n“The only factors medically that were really in John’s favor is that this was a cold water drowning,” says Dr. Jeremy Garrett, the physician who oversaw John’s recovery, though he admits, “this really shouldn’t have worked in John’s case.”\nHis family is calling it the answer to their prayers, and the attending doctors seem to concur.\nAccording to Dr. Sutterer, “His heart was jump-started by the Holy Spirit listening to the request of his praying mother.”\nDr. Garrett is calling it “a bona fide miracle.”\nJohn’s recovery has continued in a remarkable fashion, and doctors have allowed him to return home, though he still requires some physical therapy to help regain some of the movement in his hands.\nJohn himself has nothing but gratitude to his rescuers, and to God. “I thank God I’m alive,” he said, “and there’s a reason I’m alive, so I’m just going to kind of follow what God has in store for me throughout my life.”\nFollow Thomas D. Williams on Twitter @tdwilliamsrome.","url":"https://www.breitbart.com/politics/2015/02/05/boy-dead-for-45-minutes-after-falling-through-ice-miraculously-recovers/"}
