{"authors":["Anna Hopkins For Dailymail.Com"],"date_download":"2018-10-23 02:59:22","date_modify":"2018-10-23 02:59:22","date_publish":"2017-04-26 14:17:05","description":"Xavier Davis, a sixth grader at Cedar Bayou Junior School in Baytown, Texas, was told he'd face disciplinary action if he didn't fix his haircut, after he shaved two lines in the side of his head.","filename":"data/vaneerConsumption/Boyfacessuspensionaftershavingtwolinesinhishead.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/14/3F9FEB5D00000578-0-image-a-28_1493213158542.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447812_Boy-faces-suspension-shaving-two-lines-head_1540263562.html","title":"Boy faces suspension after shaving two lines in his head","title_page":"Boy faces suspension after shaving two lines in his head | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Xavier Davis shaved two lines on the side of his head, which he was told offended his school's dress code\nA sixth grade boy faced school disciplinary action after his teacher decided his new haircut was 'disruptive to the educational process'.\nXavier Davis shaved two lines on the side of his head, which landed him in inner school suspension at Cedar Bayou Junior School in Baytown, Texas.\nHis father, Matt Davis, said he and the child's mother have been forced to color in one of the lines on his son's head in order to comply with the school's disciplinary code.\n'It's nonsense. We send him here to get an education. We send him here to learn. It's not about his haircut,' Mr Davis said.\nHe was also confused, because he said his son has had the haircut for six months, but it was only an issue when his teacher noticed last Thursday, Click 2 Houston reported.\nXavier reportedly has had the haircut for six months, but was only disciplined last Thursday when his teacher at Cedar Bayou Junior School noticed and sent him to the front office\nShe promptly sent him to the front office, and told him that if he didn't fix the offending cut by Monday, he'd face further in-school suspension.\n'I was walking into class, and she saw my hair and said \"You can't have two lines in your hair. Go to the office\",' Xavier said.\n'I don't think it's fair,' he continued.\nHis father, Matt Davis, said he and the child's mother have been forced to color in one of the lines on his son's head in order to comply with the school's disciplinary code\nXavier was promptly sent to to the front office, and was told that if he didn't fix the offending cut by Monday, he'd face further in-school suspension\nThe school's dress code states that 'letters, symbols or designs beyond a straight line which draw attention to an individual will not be permitted. The administrator/supervisor reserves the right to determine if a hairstyle is disruptive to the educational process.'\nFor now, the Davis's will have to fill in one of their son's hair lines with a Sharpie so that he doesn't face suspension again.\nMatt Davis continued: 'In order for him to get an education we have to treat his hair like a coloring book, I guess.'","url":"https://www.dailymail.co.uk/news/article-4447812/Boy-faces-suspension-shaving-two-lines-head.html"}
