{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 21:03:18","date_modify":"2018-10-30 21:03:18","date_publish":"2016-09-07 04:19:41","description":"A photo of a Texas kindergartner praying and reciting the Pledge of Allegiance has gone viral after his mother posted the photo on Facebook.","filename":"data/vaneerConsumption/BoyRunningLateforSchoolStopstoSayPledgeofAllegiance.json","image_url":"https://media.breitbart.com/media/2016/09/texas-boy-stops-to-pray-say-pledge-of-allegiance-before-school-facebook.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_09_06__1540933398.html","title":"Boy Running Late for School Stops to Say Pledge of Allegiance","title_page":"Boy Running Late for School Stops to Say Pledge of Allegiance","title_rss":"NULL","source_domain":"breitbart.com","text":"A photo of a Texas kindergartner praying and reciting the Pledge of Allegiance has gone viral after his mother posted the photo on Facebook.\nRoyce Thompson was almost late for school at Wollam Elementary School in Santa Fe when he stopped running to put his hand on his heart and recite the Pledge of Allegiance, WJW reported.\nHis mom, Heather Nelson, urged her son to go into the building when a police officer explained what he was doing.\n“I couldn’t believe that he acknowledged that that was a moment of, you know, you need to stop do the pledge and he just did. He just ignored all the kids around him and kept doing it. And it was awesome,” Officer Cibby Moore told FOX 26 in Houston.\nRoyce also stopped to pray silently to himself before entering the building.\n“I was so proud that he stopped when the Pledge of Allegiance came and stood his ground and did not move as the other kids were going in and then took time out and prayed and did not even care or think twice about it,” Nelson wrote in her Facebook post.\nThe photo has been shared over 2,000 times.","url":"https://www.breitbart.com/politics/2016/09/06/boy-late-school-stops-pledge-allegiance/"}
