{"authors":["Press Association"],"date_download":"2018-10-22 22:32:52","date_modify":"2018-10-22 22:32:52","date_publish":"2016-01-11 03:18:16","description":"A 16-year-old boy who was stabbed to death in an east London park after leaving a friend's birthday party was described as an \"extrovert\" who was \"fun to be ...","filename":"data/vaneerConsumption/Boystabbedtodeathafterpartypraisedasfuntobearound.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-61bf81fe-de7c-4daf-9d55-a45bedd99b09-56CX32zFKLb7123928b84c99312b-636_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3392762_Teenager-stabbed-death-park-birthday-party_1540247572.html","title":"Boy stabbed to death after party praised as 'fun to be around'","title_page":"Boy stabbed to death after party praised as 'fun to be around' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Boy stabbed to death after party praised as 'fun to be around'\nA 16-year-old boy who was stabbed to death in an east London park after leaving a friend's birthday party was described as an \"extrovert\" who was \"fun to be around\".\nThe teenager, named locally as Charlie Kutuyampo, had been celebrating a girl's 16th birthday on Saturday with around 100 other young people at a social club on the Ashton playing fields in Woodford.\nHe got into a confrontation with four male youths outside the club before one stabbed him, police said. They then fled towards nearby Chigwell Road.\nA police officer at the entrance to Ashton playing fields, where a 16-year-old boy was stabbed to death, in Woodford Bridge\nFriends at the party tried to save him before police and paramedics arrived at around 9.40pm, but he died just over an hour later at Whipps Cross University Hospital.\nIt is the first murder of a teenager in the capital this year. Nineteen were murdered in 2015, of whom 15 were stabbed.\nForensics officers recovered two knives from near the scene today, one a silver kitchen knife and the other a black-handled knife, but it is not yet clear whether either was involved in the stabbing.\nThe boy has not been formally identified but next of kin have been informed. A post-mortem examination will take place on Monday.\nNo arrests have been made and the murder is being investigated by detectives from the Homicide and Major Crime Command.\nDCI Ken Hughes, leading the investigation, said: \"There were around 100 young people at this party and we are appealing for anyone with information or any witnesses to come forward as soon as possible.\n\"The victim's family are naturally devastated and in shock by what has happened and we need the help of those at the party that night to progress our investigation.\"\nCharlie is reported to have attended or recently left King Solomon High School on Forest Road in Ilford, Essex.\nGrieving friends of the murdered teenager this afternoon brought flowers to the social club and tonight gathered to remember him in a vigil.\nA former pupil at King Solomon school, Jodeci Joseph, who was a few years older than Charlie, told Sky News: \"I built up quite a good relationship with him, like when I would see him I would always say, 'Hello, how are you?', see how he is, always catch up with him, sometimes spend a lunch time or break time with him just walking around with him.\n\"He was a very nice boy, very good intentions, very very good intentions. He was very extroverted, very loud, but that is normal for a child to be quite loud.","url":"https://www.dailymail.co.uk/wires/pa/article-3392762/Teenager-stabbed-death-park-birthday-party.html"}
