{"authors":[],"date_download":"2018-10-22 22:37:30","date_modify":"2018-10-22 22:37:30","date_publish":"2014-06-09 22:53:00","description":"Just in time for Fathers Day, British researchers say they have genetically engineered mosquitoes so they only produce male offspring.","filename":"data/vaneerConsumption/BoysOnlyExperimentCouldEndBitingMosquitoes.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/497906/140609-anopheles-gambiae-mosquito-1806_a7f26fc758bc9b748edaae69ffeddfb7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_health-news_boys-only-experiment-could-end-biting-mosquitoes-n126806_1540247850.html","title":"Boys Only: Experiment Could End Biting Mosquitoes","title_page":"Boys Only: Experiment Could End Biting Mosquitoes","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nJust in time for Fathers Day, British researchers say they have genetically engineered mosquitoes so they only produce male offspring.\nMale mosquitoes don’t bite, so they hope they could use their lab-produced mosquitoes to make populations of the insects plummet in mosquito-ridden areas.\nTheir lab-engineered mosquitoes are fertile. But the scientists damaged the X chromosome that the father mosquito would normally pass along to its offspring, so that the only young mosquitoes that would hatch alive would be male.\nLab tests showed these altered mosquitoes virtually bred themselves out of existence after a few generations, researchers reported in the journal Nature Communications.\n\"Essentially the mosquitoes carry out the work for us.\"\nJust like people, mosquito sex is determined by the X and Y chromosomes. Males have one X — inherited from the mother, and one Y — inherited from the father. Females have two X chromosomes, one inherited from each parent. So if one is damaged, the female offspring cannot survive.\nUsually, about half a male’s sperm will carry an X and the other half will carry a Y. Female eggs carry one X.\nThe team at Imperial College London has been working for years to create male-only mosquito families, but the method they used to damage the X chromosome ended up killing all the mosquito larvae. Now they’ve perfected the method, Roberto Galizi, Andrea Crisanti and colleagues report.\nThe researchers spliced a gene into the mosquitoes that slices up the X chromosome when sperm is produced.","url":"https://www.nbcnews.com/health/health-news/boys-only-experiment-could-end-biting-mosquitoes-n126806"}
