{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:47:07","date_modify":"2018-10-30 22:47:07","date_publish":"2016-11-10 08:00:00","description":null,"filename":"data/vaneerConsumption/BoystownCaliforniajustsentevenfewerwomentoitsCapitol.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/IMG_9591sm-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939627.html","title":"Boys' town? California just sent even fewer women to its Capitol","title_page":"Boys' town? California just sent even fewer women to its Capitol | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"On a night many believed would be a milestone for women in politics, Cristina Garcia donned a Hillary Clinton T-shirt and a gray pantsuit and left her house in southeast Los Angeles.\n“Buenas noches,” the Democratic assemblywoman from Bell Gardens greeted her neighbors as she walked to an election-night party. Garcia was hopeful not only that voters would send a woman to the White House, but also that they would propel a bumper crop of women to the California Capitol.\nWomen make up one-quarter of the Legislature, and their numbers have been slipping for the last five years. Garcia, who takes over next month as chair of the Legislature’s women’s caucus, worked this year to get more women Democrats elected. She recruited several women, raised money for them and campaigned by their sides.\nYet by the end of the evening, Donald Trump had been elected president and the number of women in the California Legislature would drop even further. When lawmakers are sworn in next month, women will hold 27 of 120 seats—just 22 percent, and four less than serve in the session now ending.\n“Certainly it’s a mixed bag and not everything we hoped for,” Garcia said a day later. “But we shouldn’t diminish the successes we’ve had.”\nThough the total number of women lawmakers is down, the number of women Democrats is up in the Assembly—a victory for Garcia. She’s also pleased the lower house will include more Latinas.\nThe overall decline is due to fewer women Democrats in the Senate and fewer women Republicans in the Assembly. “We need to work harder at recruiting women to run for state office and helping them succeed,” outgoing GOP Assemblywoman Kristin Olsen said by text message.\nWomen in the California Legislature\nGarcia had hoped to add even more Democratic women but several of the candidates she backed lost in races against fellow Democrats, contests where outside interests poured millions of dollars into independent advertising campaigns. Business interests backed male Democrats who prevailed over women in districts based in San Francisco, Napa, Concord, Palo Alto and the San Fernando Valley.\n“The large sum of money from…the business industry had a lot to do with that,” Garcia said of the losses. “We were outspent in some races 7 to 1.”\nThe outcome points to the need for women to take bigger roles in the money side of politics, said Rachel Michelin, who heads California Women Lead, a nonpartisan group that trains women for public service. She said most of Sacramento’s political operatives deciding how interest groups spend campaign money are men.\n“We need to make sure we have women as decision makers in that part of the political arena, not just as candidates,” Michelin said. “It’s still very much a good old boys’ game.”\nGarcia, 39, grew up in the city she still lives in, one of five children of two immigrants from Mexico. She spent her childhood with her “face in a math book,” she said, and eventually became a math teacher.\nWhen she was first elected four years ago, it was an upset against an entrenched political dynasty of men. She beat Tom Calderon, one of three brothers who had represented southeast L.A. in the Legislature over the last two decades. As Garcia gained footing in the Capitol, two of the Calderon brothers were indicted on corruption charges, and ultimately sent to prison.\nShe takes the helm of the women’s caucus after a year of carrying high-profile bills. One—inspired by a notorious sexual assault at Stanford University—expands the definition of rape to include penetration by hand. Another sought to repeal sales taxes on tampons and other menstrual products. Gov. Jerry Brown vetoed it, but the bill earned Garcia national attention.\nWhen a Democratic colleague—Assemblyman Roger Hernandez of West Covina—was accused of domestic violence, Garcia was among the first to call for him to take a leave of absence.\n“She is a headline chaser,” said Hernandez, who denies the abuse allegations. He chaired the labor committee—made up entirely of men—and helped kill a family leave bill that was a priority to the women’s caucus. Though the legislation was later revived, Garcia says women need greater numbers to exert more power in the law-making process.\nSpeaker Anthony Rendon of Paramount said he worked with Garcia to try to get more Democratic women elected this week and is disappointed by the outcome.\n“When you have better representation of more groups of folks, you get better public policy,” he said, pointing to the role the women’s caucus played in advocating for more child care funding this year. “We are moving in the right direction and are not going to stop those efforts at all.”\nThis election marked the beginning of Garcia’s long-term plan to bring more gender parity to the California statehouse. She’s already grooming women candidates for city councils and school boards, and looking toward political openings for them years down the line.\nAt the election-night party in her hometown—a festive ballroom decorated with “Latinos for H” signs—Garcia sipped a beer as it became clear that, once again, a man was heading to the White House. A constituent approached to say she’d had tears in her eyes while voting that day.\n“I just voted for four women in a row,” Nadine Barragan said, recounting the candidates she picked for president, U.S. senate, Congress and state Assembly. “This is crazy.”\nBarragan said she’d never thought of running for office herself, until she got to know Garcia. Now she’s thinking she might take a stab at city council.","url":"https://calmatters.org/articles/boys-town-california-just-sent-even-fewer-women-to-its-capitol/"}
