{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:55:35","date_modify":"2018-10-30 19:55:35","date_publish":"2017-01-07 23:09:13","description":"On January 7--the day after the heinous attack in the Ft. Lauderdale-Hollywood international gun-free zone--the Brady Campaign to Prevent Gun Violence Tweeted that you can \"carry a gun and ammo in a checked bag\" when you fly. | Politics","filename":"data/vaneerConsumption/BradyCampaignYouCanCarryaGunandAmmoinCheckedBagWhenYouFly.json","image_url":"https://media.breitbart.com/media/2017/01/Ft-Lauderdale-airport-shooting-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_01_07__1540929335.html","title":"Brady Campaign: You Can 'Carry a Gun and Ammo' in Checked Bag When You Fly","title_page":"Brady Campaign: You Can 'Carry a Gun and Ammo' in Checked Bag When You Fly | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On January 7–the day after the heinous attack in the Ft. Lauderdale-Hollywood international gun-free zone–the Brady Campaign to Prevent Gun Violence Tweeted that you can “carry a gun and ammo in a checked bag” when you fly.\nOf course, anyone who flies knows that if they actually try to carry a gun onto a plane–checked or not–they will never make it through security and may never make it out alive.\nIn fact, the process for traveling with a gun is to unload the weapon, put it in an airline approved container, lock the container, and declare the weapon when checking in for your flight. The airline ticket counter representative then takes the locked container and you are not near the gun again until you get your luggage at your destination.\nYet the Brady Campaign, in an apparent attempt to spin the reality of another shooting in a gun-free zone, is telling their Twitter followers that you “can carry a gun and ammo in a checked bag” when you fly:\nNote: It's perfectly legal to carry a gun and ammo in a checked bag when flying. –> https://t.co/Bnc0vCy5Kj — Brady Campaign (@Bradybuzz) January 7, 2017\nThe Tweet is well nuanced and makes it seem like you can keep the gun with you, but you can’t. Instead, you must declare and surrender it when checking in for your flight (as noted above).\nNow, it is interesting to note that checking guns for hunting trips, target shooting excursions, or self-defense at your final destination is nothing new. In fact, many types of hunts would be severely hampered if hunters lacked the ability to transport their guns to the spot of the hunt via an airline. But instead of pointing these things out and instead of highlighting the fact that Ft. Lauderdale-Hollywood International has 100 percent gun control–i.e., it is a gun-free zone–the Brady Campaign acts like it discovered something new and frames it in a way that gives the gun control community one more loophole they can seek to close.\nYes, that’s it. It is the “check-your-unloaded-gun-in-your-luggage-and-declare-it-to-the-airline-ticket-counter-representative” loophole.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and host of “Bullets with AWR Hawkins,” a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2017/01/07/brady-campaign-you-can-carry-a-gun-and-ammo-in-checked-bag-when-you-fly/"}
