{"authors":["Jo Tweedy For Mailonline"],"date_download":"2018-10-23 04:13:29","date_modify":"2018-10-23 04:13:29","date_publish":"2017-04-26 15:47:14","description":"Michael Bolton superfan Christine, 29, from County Down, wanted to win enough to have lunch with her idol in LA. However, when she failed to win the cash host Bradley Walsh had a plan B.","filename":"data/vaneerConsumption/BradleyWalshfixesupChasequizzerwithMichaelBolton.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3FA0418E00000578-0-image-a-26_1493217610491.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4447850_Bradley-Walsh-fixes-Chase-quizzer-Michael-Bolton_1540268009.html","title":"Bradley Walsh fixes up Chase quizzer with Michael Bolton","title_page":"Bradley Walsh fixes up Chase quizzer with Michael Bolton | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Money can't buy you love but it can buy you dinner with a global superstar.\nMichael Bolton superfan Christine, 29, from County Down in Northern Ireland, who appears on tonight's edition of The Chase, told host Bradley Walsh that she hoped to leave the show with enough money to buy a £4,000 encounter in LA with the star.\nHowever, her bid to jet across the Atlantic failed when she answered a string of questions on the popular quiz show incorrectly.\nScroll down for video\nThe Chase contestant Christine, 29, revealed she was a Michael Bolton superfan to host Bradley Walsh...telling him she was hoping to win enough to buy lunch with the singer\nKind-hearted Walsh arranged for Christine to have dinner with her idol after realising that the US crooner was making an appearance on The Nightly Show, which Walsh was hosting in early April\nWith the dinner date in mind, Christine faced Paul 'The Sinnerman' Sinha but found herself beaten by The Chaser and going home penniless.\nHer dream may have temporarily stalled but Bradley Walsh was to prove her knight in shining armour.\nDuring her appearance on The Chase, she told Walsh: 'I like a bit of crosswords and quizzing, and Michael Bolton – a big love of mine.\n'I’ve seen him live twice and touched his hand both times', she cooed.\nFor a while, Christine's dream seemed to have faded...and she left the quiz show empty handed\nCash cow: Bolton charges fans £4,000 to have dinner in LA with them...but made an exception for Christine, much to her delight\nHero! Bradley Walsh, who took the helm at The Nightly Show earlier this month, saw an opportunity to set up Christine with her dream date\nFans of The Nightly Show will remember Christine sat opposite the How Can We Be Lovers crooner at the end of his stint presenting the late night chat show.\nThe encounter happened only after 56-year-old presenter Bradley spoke with The Nightly Show producers and arranged for a candlelit dinner on set between the once-mulleted singer and the quiz contestant.\nA chuffed-looking Christine, wearing a bright pink top, sat opposite her idol while musician The Vixen serenaded them with a version of one of Bolton's biggest hits, How Am I Supposed to Live Without You?","url":"https://www.dailymail.co.uk/femail/article-4447850/Bradley-Walsh-fixes-Chase-quizzer-Michael-Bolton.html"}
