{"authors":[],"date_download":"2018-10-30 19:51:09","date_modify":"2018-10-30 19:51:09","date_publish":"2017-02-07 00:50:09","description":"HOUSTON (AP) — Tom Brady doesn't want to talk about \"Deflategate.\" He'd rather reflect on a night he will never forget and how much it meant to his mother. | Sports","filename":"data/vaneerConsumption/BradyGivesCredittoHisMomWhiteforSuperBowlMVPWin.json","image_url":"https://media.breitbart.com/media/2017/02/brady-balls.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2017_02_06__1540929069.html","title":"Brady Gives Credit to His Mom, White for Super Bowl MVP Win","title_page":"Brady Gives Credit to His Mom, White for Super Bowl MVP Win | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"HOUSTON (AP) — Tom Brady doesn’t want to talk about “Deflategate.” He’d rather reflect on a night he will never forget and how much it meant to his mother.\nThe New England quarterback spoke Monday hours after he won his fifth Super Bowl ring and fourth MVP trophy. He called the 34-28 overtime victory over the Atlanta Falcons a “hell of a game” for his mother, who has been dealing with an undisclosed health issue and was not able to attend any other games this season.\n“It was great. She’s been through a lot,” Brady said. “Way harder than I went through last night. Way harder than everyone on our team went through last night. My dad’s been there every step of the way. They set such a great example for me.\n“All families go through challenging times personally. But she has a lot of support and a lot of love. I’m just happy last night to be able to celebrate with her.”\nWhat was missing from the celebration was Brady’s game jersey, which he said disappeared in the locker room afterward and he still cannot find. But he joked that he expects to spot it soon in an online auction.\nHe would not say whether his fifth championship meant more to him than the others because of his four-game suspension stemming from the Deflategate scandal.\nCoach Bill Belichick said it would be “inappropriate” to suggest that Brady put in more effort this season for any reason.\n“To insinuate that this season was somehow different, that this year he competed harder or did anything to a higher degree than anything he has in the past I think is insulting to the tremendous effort and leadership and competitiveness that he’s shown for the 17 years that I’ve coached him,” Belichick said.\nBrady had another uneventful interaction with NFL Commissioner Roger Goodell during a photo with the MVP trophy.\nHe said teammate James White was more deserving of the award because of his three touchdowns in Sunday’s win.\nTwo years ago, Brady gave the truck he received for winning MVP honors to Malcolm Butler for the rookie cornerback’s game-saving interception in the Patriots’ Super Bowl win over the Seahawks.\nHe hinted Monday that he may not keep the next vehicle either.\n“I think James White deserves it. It would be nice for him,” Brady said. “It took a real team effort. … We faced a lot of adversity this year and overcame it with a lot of mental toughness.”\nThat said, he is definitely keeping the trophy.\nWhen the news conference concluded, Brady looked down and grasped the silver football and cradled it under his arm as he walked off the stage.\n“I’m taking it home,” Brady said.","url":"https://www.breitbart.com/sports/2017/02/06/brady-gives-credit-mom-white-super-bowl-mvp-win/"}
