{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 21:04:51","date_modify":"2018-10-30 21:04:51","date_publish":"2016-12-22 00:00:00","description":null,"filename":"data/vaneerConsumption/Branchbankingstillplaysanimportantrole.json","image_url":"https://amp.businessinsider.com/images/585beadff10a9a6c008b4c8f-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_branch-banking-still-plays-an-important-role-2016-12_1540933491.html","title":"Branch banking still plays an important role","title_page":"    Branch banking still plays an important role - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Payments Briefing\" subscribers. To learn more and subscribe, please click here.\nNew data from a Fiserv study shows that, despite massive growth in digital and mobile banking usage, bank branches still matter to users, and they're still seeing consistent engagement.\nPreference between branches and digital channels is split — 44% of users surveyed prefer branch banking, while a combined 53% prefer online or mobile channels.\nBut customers are still actively using both types of banking offerings, which is important for banks as they develop their strategies moving forward.\nCustomers use branches and digital channels differently.\nEighty percent of customers logged into online banking services in the last month, according to Fiserv. On average, they did so 11.2 times in the month — pointing to considerable habitual usage — generally for functions like checking balances, paying bills, and transferring money.\nBranch banking isn't quite as popular, but it's used for functions that can't be completed online. Sixty-one percent of users visited a branch in the past month, on average just under three times. Even more, millennials visited branches more frequently than other groups. And these users are largely attending to deposit checks, withdraw cash, and speak to representatives — functions that, as it currently stands, can't effectively be replaced by digital or remote offerings.","url":"https://www.businessinsider.com/branch-banking-still-plays-an-important-role-2016-12"}
