{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:03:34","date_modify":"2018-10-31 00:03:34","date_publish":"2017-01-11 22:44:17","description":"The sandwich baggie brimming with buds is gradually becoming a thing of the past in California. In its place, an era of name-brand marijuana is","filename":"data/vaneerConsumption/BrandingBudMarijuanacompanieswantCaliforniatoissuetrademarksforpot.json","image_url":"https://calmatters.org/wp-content/uploads/favicon-150x150.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944214.html","title":"Branding Bud: Marijuana companies want California to issue trademarks for pot","title_page":"Branding Bud: Marijuana companies want California to issue trademarks for pot | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"The sandwich baggie brimming with buds is gradually becoming a thing of the past in California. In its place, an era of name-brand marijuana is emerging.Celebrities—including actress Whoopi Goldberg, rapper Snoop Dogg, rocker Melissa Etheridge and the family of reggae legend Bob Marley—are branding their own herb. Law firms have sprouted to help marijuana sellers brand their goods. Pretty packages of cannabis-infused products bear labels like “Highland Pantry” (almond butter), “Madame Munchie” (cookies) and “Sweet ReLeaf” (skin cream).\nBranded pot products gained footing in recent years as California sanctioned medical use of marijuana, and other states began permitting recreational use. Now that California voters have approved a ballot measure allowing all adults to use the drug, cannabis businesses want more authority to brand their products.\nBut officially trademarking marijuana is a tricky legal task. The federal government still considers it an illegal drug, and won’t grant patents or trademarks for pot or anything made from it. Cannabis brands fear they are at risk of being copied. So marijuana businesses in California—eyeing what could become a $6.4 billion industry—have turned to the state government for help.\n“Not being able to trademark your brand is a huge setback if you’re trying to get capital investment,” said Nate Bradley, who lobbies for marijuana sellers as the executive director of California Cannabis Industry Association. “If you’re not able to protect what you’re asking people to invest in, you’re not likely to get investments.”\nA bill recently introduced in the Legislature would create a state-level trademark for California cannabis products, providing marijuana businesses new legal protections and greater access to cash from investors as the state ushers in a sanctioned commercial marketplace.\nThe California Secretary of State already has the power to register state-level trademarks, but only for items recognized by federal trademark law. Assembly Bill 64 would change that by allowing the Secretary of State to register trademarks for cannabis goods and services.\n“Cannabis businesses are like other businesses, lawful and regulated. They should be able to protect their intellectual property,” said bill author Assemblyman Rob Bonta, a Democrat from Alameda.\nTrademarks will help bring marijuana vendors “out of the shadows,” he said, and also help consumers by assuring that “you’re going to get a certain quality or product when you purchase these goods.”\nThe secretary of state’s office has not yet taken a position on the bill.\nSo far law enforcement groups, many of which opposed the ballot measure to legalize marijuana, are not speaking out against the move toward branding. Lauren Michaels, a lobbyist for the California Police Chiefs Association, said her group is focused on making sure that branded products aren’t advertised in a way that appeals to children. Police chiefs are supporting Bonta’s bill because it would restrict marijuana billboards near freeways. (AB 64 also would speed up funding to establish standards for impaired driving and allow recreational marijuana to be sold through web-based delivery services—both contentious points in the initiative campaign.)\nThe bill already has some bipartisan support, including a Republican co-author. Still, some GOP lawmakers are wary. Senate Republican leader Jean Fuller of Bakersfield said she doesn’t yet have a position on the bill, but cautioned that “it’s always precarious for a state to take on the federal government and make laws that are in conflict.”\nThe policy is being considered in Sacramento as the nation prepares for a new federal government that could be more hostile to states that have permitted marijuana. U.S. Sen. Jeff Sessions of Alabama, who is Republican President-elect Donald Trump’s nominee for Attorney General, has criticized the Obama Administration for its hands-off approach. In a confirmation hearing this week Sessions stopped short of saying he would go after states that have regulated pot, leaving marijuana advocates and state officials unsure of his plans.\nAsked how Sessions as U.S. attorney general could impact marijuana policy in California, Democratic Gov. Jerry Brown said he had “no idea.”\n“Sometimes you take a step forward and then a step back,” Brown said during a Capitol budget press conference this week. “I think people will continue to be able to satisfy this particular need.”\nColorado and Washington—two states that legalized recreational marijuana a few years ago—already offer state-level trademarks for pot products, said attorney Amanda Conley, a founder of the National Cannabis Bar Association. Her Brand and Branch law firm in Oakland helps cannabis businesses navigate legal issues related to branding and trademarks.\nWithout a state-level trademark in California, businesses that want to sell cannabis under a brand name here must find a legal hack around the federal ban on trademarking pot. Conley said she advises companies to seek a federal trademark for the federally lawful goods and services they offer that do not themselves include marijuana. For instance, an entrepreneur could seek to trademark an informative website about the medical uses of marijuana, or the rechargeable batteries used with vaping pipes.\nSleek cases holding such pipes and batteries were on display at a Sacramento dispensary, where bottles of “Cannabis Quencher” juices and packages of “Heavenly Sweet” cookies stood near aromatic jars of indica and sativa.\nMost patients ask for products based on the desired effect—a sleep aide, or something to relieve pain—said Kimberly Cargile, who runs the dispensary called A Therapeutic Alternative. But, she said, “they’re starting to more and more ask for brand names.”\nCargile said she expects to see more of that as the shop prepares for newly required state packaging rules. Plastic zip-locks will be phased out.\n“In the future,” she said, “it will all be packaged and branded.”","url":"https://calmatters.org/articles/branding-bud-marijuana-companies-want-california-to-issue-trademarks-for-pot/"}
