{"authors":[],"date_download":"2018-10-30 18:03:44","date_modify":"2018-10-30 18:03:44","date_publish":"2018-08-14 20:24:00","description":"The Battery Atlanta, a dining, entertainment and shopping development around the Atlanta Braves' SunTrust Park, is growing, but retail leases are lagging.","filename":"data/vaneerConsumption/BravesBatteryParkaroundSunTrustParkboomsbutfacesgaps.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/MyAJC/2018/08/14/Images/newsEngin.22671282_080718-Battery-Atlanta-2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_one-piece-missing-_84ad45e638cc17d1d6b5e6c729118841__1540922624.html","title":"Braves Battery Park around SunTrust Park booms but faces gaps","title_page":"Braves Battery Park around SunTrust Park booms but faces gaps","title_rss":"NULL","source_domain":"ajc.com","text":"Even on nights when the Atlanta Braves aren’t swinging, some bars and restaurants just outside SunTrust Park are hitting home runs.\nEnough so, in fact, that 23-year-old Jimmy Hutchinson moved into an apartment inside the The Battery Atlanta mixed-use development adjacent to the ballpark in Cobb County to enjoy the scene.\n“We thought it was the most happening place to be,” Hutchinson said. “We like coming here more than Buckhead. It’s a better crowd and cheaper drinks.”\nWhile The Battery Atlanta is attracting diners and partyers, its pull as a shopping destination hasn’t panned out as expected. Deep in its second year of operation, only about 65 percent of The Battery’s already built retail and dining spaces are actually occupied, according to the Braves which owns and manages most of The Battery.\nTayler Moosa (left) and Reid Gan say they often visit the restaurants and entertainment spots at The Battery Atlanta, a mixed-used development beside the Atlanta Braves’ SunTrust Park in Cobb County. Both work within a couple miles of the project. MATT KEMPNER / AJC (The Atlanta Journal-Constitution)\nAbout 20 retail spots — most already built — remain vacant, particularly those farther from the stadium. And an early plan to draw day-time shoppers with women’s fashion stores fell flat.\nA variety of other tenants have committed but are not yet open, according to the Braves. The organization reports 82 percent of the development’s existing retail space is leased, though some of that may not be occupied for another year.\nA lot is riding on the 1.5-million-square-foot Battery project.\nThe development was an unusual build timed to hit the market at the same time as the ballpark in 2017. Besides restaurants, bars and stores, it includes apartments, offices, a music venue and a hotel. It was considered crucial both by Braves leadership, who wanted to boost the team’s financial muscle (and left intown Atlanta to do so), and by Cobb County commissioners, who expected a tax-generator that would help justify hundreds of millions of dollars in public subsidies over time for the adjacent baseball stadium.\nIn some ways, the gamble of building The Battery is working.\nMany visitors and tenants interviewed are generally happy with how it’s turned out.\nInitial worries about horrible game-day traffic have eased. Offices and apartments have filled, including space for Comcast.\nRestaurateurs and bar owners have signed on — there are about 15 of them, including ones that are partly attached to the stadium — and some say business so far has met or beaten their expectations.\n“We are knocking it out of the park, no pun intended,” said Giovanni di Palma, who owns Antico Pizza, which opened in The Battery last year.\nSales are trending 30 to 40 percent above expectations, he said, largely because of hungry crowds heading into SunTrust Park for games or concerts. Even non-game weekends are doing a bit above projections.\nRecently, Thyssenkrupp Elevator choose The Battery for its Americas headquarters, promising nearly 900 jobs there by sometime in 2021 and an elevator test tower that will be the tallest building in Cobb. Its two top floors will be available for the public to rent for special events, complete with vistas of the stadium and miles more.\nCobb County leaders said an important factor in subsidizing the cost of the Atlanta Braves’ SunTrust Park was the team’s plans for The Battery Atlanta, a tax-generating development of restaurants, bars, shops, apartments, offices and a hotel beside the ballpark. Battery visitors include some who came hours early for a recent Braves’ game on a summer week night. MATT KEMPNER / AJC (The Atlanta Journal-Constitution)\n“When we first met with the Braves organization, we were very impressed their vision and what they actually had achieved there” at The Battery, said Rich Hussey, the CEO of the unit making the move.\nAnn Kim, the executive chef at new Battery restaurant Garden & Gun Club, moved from her intown Atlanta home to the suburban complex and said she’s pleased with the business on non-game days.\nBefore a major concert at the stadium, The Battery “looked like an amusement park. People were in line for everything.” Still, she said, “I wish they had a few more shops.”\n“It’s a great place to walk around and be outside,” said Rob Porter, who had a townhouse built within a seven-minute stroll of the project. “But if you want regular people there during the week, you need regular things for people.”\n“They are missing some of the hooks that they need,” he said, including stores that attract a broad array of shoppers.\nThe Battery’s retail lineup includes about eight permanent stores, two or three of which are largely focused on baseball. Among the other outlets is a small Harley-Davidson apparel shop, one clothing store aimed at women and a home and gifts shop.\nConstruction is supposed to start soon for a nearby Silverspot Cinema movie theater and a Savi Provisions, a small grocery, which are likely to open in 2020, according to the Braves. And the organization recently announced plans for the development’s second hotel, an Aloft with 140 rooms.\nRELATED: First Look: El Super Pan debuts at The Battery Atlanta next to SunTrust Park\nALSO: Celebrity chef Todd English opening restaurant at the Battery Atlanta\nOutside of food and beverages, Antico’s di Palma said he isn’t surprised more retailers haven’t come to The Battery. The retail industry is in a state of flux and for 81 days of Braves home games, many stores would struggle to attract serious shoppers, he said.\n“It’s really not a retail-friendly environment, and I think the Braves found that out early on,” he said.\nJonathan Brimer’s Select Shades sunglasses store opened in April, later than he anticipated, and still there are no other stores open in the building he’s in. That has cut into the foot traffic he expected.\n“We will go several days when no one comes in the store all day long,” he said. “Zero.”\nHe is still “highly optimistic” about his shop’s potential, but he said stores expected elsewhere in The Battery never materialized. “It doesn’t seem from a retailer’s perspective that there’s a lot of enthusiasm in the project.”\nMike Plant, the chief executive of Braves Development Co., said The Battery has thrived and that the project’s retail picture is brighter than it might appear. He predicted that 90 percent of existing retail spaces will have operating tenants a year from now.\nPresident and CEO of Braves Development Co Mike Plant talks about the ongoing development of The Battery Atlanta in his office at SunTrust Park. STEVE SCHAEFER / SPECIAL TO THE AJC (The Atlanta Journal-Constitution)\nOverall, Plant said, “We are really pleased.”\nAccording to Plant, the Braves had anticipated that only about 25 percent of the first phase of the mixed-use project would be open by opening day last year.\nThere were signs of other expectations, though. An executive who previously headed up the search for retailers said the project would be effectively leased up by the end of 2016, according to a report in The Atlanta Journal-Constitution.\nThat executive, Jeff Fuqua, a previous part owner in retail portion of the project, was later bought out by the Braves, Plant said.\nThe retail emphasis of The Battery shifted because of broader shifts in consumer habits and the overall retail industry, Plant said — a change that set back retail plans by only about six months.\n“When we started, women’s fashion was our number one strategy,” he said. Now, the emphasis is on trying to find businesses offering consumers experiences beyond just shopping for items, such as the Mizuno store that tests customers’ bat or golf club swings.\n“It doesn’t concern me,” Cobb County Commissioner Bob Ott said of The Battery’s unoccupied retail spaces, “because I see a very successful operation.”\nHe credits the Braves’ move for helping to boost business confidence and development in the general area and for Braves construction that has already generated far more in taxes than when the property was undeveloped. The value of the Braves’ land — and, now, buildings — that taxes are based on has grown from $19 million in 2013 to more than $400 million this year, the Braves report.\nCobb officials recently approved an increase in overall property tax rates to fill a gap in county finances. While public money spent on the Braves stadium represents only a fraction of Cobb’s annual $450 million general fund budget, it was a hot point for some supporters of parks, libraries and public safety who worried about funding shortfalls.\nKennesaw State University economics professor J.C. Bradbury said he isn’t surprised The Battery is drawing restaurant and bar crowds, as have other metro Atlanta developments that didn’t benefit from hundreds of millions in public subsidies for an adjacent stadium.\nAnd while he has criticized the ballpark subsidies, Bradbury said the public doesn’t need to worry much about The Battery’s retail space because the Braves organization has an incentive to make it succeed and the team is on the hook to contribute toward stadium construction costs regardless.\nMeanwhile, it doesn’t look like the Braves are done building. Almost a fourth of the nearly 80 acres the Braves control there remain undeveloped, with no announced proposals.\n“We have kicked around a few plans…,” Plant said. “There’s no rush.”","url":"https://www.ajc.com/business/one-piece-missing-from-party-scene-around-braves-suntrust-park-stadium/34C4I8RrCviCE3X4xXQDyM/"}
