{"authors":[],"date_download":"2018-10-30 21:53:53","date_modify":"2018-10-30 21:53:53","date_publish":"2018-09-07 13:28:00","description":"Taxpayers’ obligation on the publicly-subsidized ballpark already tops $400 million. But now the Braves are seeking more than $4.6 million they say the county owes them.","filename":"data/vaneerConsumption/BravesCobbinlegaldisputeovermillionsinstadiumcosts.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/04/Images/030517%20braves%20sod%20HS03.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_b_f6e1ed957f38d7608167f45dfd01b58f__1540936433.html","title":"Braves, Cobb in legal dispute over millions in stadium costs","title_page":"Braves, Cobb in legal dispute over millions in stadium costs","title_rss":"NULL","source_domain":"ajc.com","text":"Cobb County and the Atlanta Braves are in a legal dispute over millions of dollars in costs associated with SunTrust Park.\nTaxpayers’ obligation on the publicly-subsidized ballpark already tops $400 million.\nBut now the Braves are seeking more than $4.6 million they say the county owes them.\nThe issue began back in May when the county approached the team about paying $1.5 million for water infrastructure at the stadium, according to legal correspondence.\nThe county said the Braves had agreed to pay for all costs above the defined county contribution, which had already been paid.\nThe Braves in turn pointed to a section of the development agreement they say exempts the company from such infrastructure fees on the stadium itself, as opposed to The Battery development.\nWhen the county declared the Braves in default on the agreement, the team responded with a demand for immediate payment from Cobb for what they characterized as outstanding obligations.\nThose include $2.6 million for what the team said were improperly assessed building permit fees; $1.5 million for transportation improvements; and $500,000 for project management costs.\nCobb’s response called the demand for payment “retaliatory” and slammed the Braves for “excessive, inflammatory rhetoric.”\nBoth sides have agreed to seek mediation, per their contract.\nDespite the heated tone of the exchange, Cobb Chairman Mike Boyce downplayed the rift, saying he had a great relationship with Braves executives.\n“I’m going to let the lawyers play their games, but I’m going to deal with my counterparts once we get to mediation,” Boyce said.\nThe chairman recently led a successful campaign to raise property taxes on residents who were told the county didn’t have enough money to cover its expenses.\nOn Friday, Boyce rejected any connection between the tax hike and the disputed stadium costs, calling the comparison “apples and oranges.”\nThe Braves said in a statement that they were “working in good faith with the County to close out a handful of minor project related items.”\nSteven Labovitz is a partner at Dentons law firm who has negotiated stadium deals in the past, including for the city of Atlanta. He said everything will come down to the details of the development agreement.\n“There may be things that were not discussed and not put in the document,” he said, recalling the expedited deal. “That is because of the nature and how rushed it was.”\nLabovitz said both the county and the Braves have strong incentives to settle as quickly as possible, and that’s what he expects to happen.","url":"https://www.ajc.com/news/local-govt--politics/braves-cobb-legal-dispute-over-millions-stadium-costs/2YIk3CNNOfhtaKPhYu6z3K/"}
