{"authors":[],"date_download":"2018-10-30 19:53:45","date_modify":"2018-10-30 19:53:45","date_publish":"2017-01-19 17:39:00","description":"Atlanta Braves unveil second part of the team’s traffic management plan to the new stadium in Cobb County with Uber and Waze partnerships.","filename":"data/vaneerConsumption/BravespartnerwithUberWazeasparkofSunTrustParktrafficplan.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/MyAJC/2016/12/29/Images/newsEngin.17268593_SunTrust-Park.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_b_15dfb8c889743f7ec03a47ffe5e9b1e7__1540929225.html","title":"Braves partner with Uber, Waze as park of SunTrust Park traffic plan","title_page":"Braves partner with Uber, Waze as park of SunTrust Park traffic plan","title_rss":"NULL","source_domain":"ajc.com","text":"The Atlanta Braves unveiled the second part of the team’s traffic management plan to the new stadium in Cobb County, including partnerships with ride sharing service Uber and Waze, a navigation app.\nSunTrust Park will open to season ticket holders on March 31 for an exhibition game, with first pitch set for April 14.\nTransportation to and from the stadium has been of paramount concern for Braves fans, local residents and commuters. The Cumberland area where the ballpark is located sits at the notoriously congested I-285/I-75 interchange.\nLast summer, the team announced it was pushing start time for games from 7:10 to 7:30 at the new field in order to accommodate traffic.\nRELATED: Punch Bowl Social to join Braves’ Battery lineup at SunTrust Park\nOn Thursday, representatives for the team reiterated the 14 access points to the stadium and the approximately $1 billion in local and state transportation infrastructure projects to mitigate traffic congestion.\nThey also disclosed new details of the Braves mobile app, where patrons can buy and download their ticket, as well as receive real-time navigation to their assigned parking lot through the team’s partnership with Waze.\n“One of the key elements to this is no longer will you necessarily have to open two different apps,” said Braves President of Business Derek Schiller. “It’s all an integrated application.”\nRELATED: SunTrust Park rules of open-container tailgating at Braves games\nCounty law enforcement will control 30 intersections on game days to help direct traffic.\nThe new stadium will feature a lot reserved for Uber drivers to pick up and drop off passengers. Other ride sharing services, including Lyft, will not have access to the lot.\nBraves President of Development Mike Plant said the team has secured 11,000 parking spaces and is on track to strike more deals with private lots in the coming months.\nRepresentatives for the team also said it was exploring shuttle service from across the metro area, but declined to offer details, saying that such an announcement would be made at the third and final phase of the team’s traffic plan.\nIn response to a question about local residents’ traffic concerns, Schiller said traffic would flow more easily once the many construction projects in the area are complete.\n“We appreciate their patience in this process,” he said.","url":"https://www.ajc.com/news/local-govt--politics/braves-announce-uber-waze-partnerships-part-traffic-plan-for-new-stadium/9pD2Znds2RYVtMPh3JrruL/"}
