{"authors":["Associated Press"],"date_download":"2018-10-23 04:45:11","date_modify":"2018-10-23 04:45:11","date_publish":"2017-03-10 14:49:10","description":"RIO DE JANEIRO (AP) - Germany and Brazil will meet next year on the soccer field for the first time since the 7-1 rout in the World Cup semifinals.The game,...","filename":"data/vaneerConsumption/BraziltoplayGermanynextyearfor1sttimesince71loss.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4301518_Brazil-play-Germany-year-1st-time-7-1-loss_1540269911.html","title":"Brazil to play Germany next year for 1st time since 7-1 loss","title_page":"Brazil to play Germany next year for 1st time since 7-1 loss | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"RIO DE JANEIRO (AP) - Germany and Brazil will meet next year on the soccer field for the first time since the 7-1 rout in the World Cup semifinals.\nThe game, announced by the Brazilian soccer confederation on Friday, is scheduled for the Olympic Stadium in Berlin on March 27, 2018, only a few months before the next World Cup in Russia.\nBrazil coach Tite has said he wants his team to play some of the tournament favorites. He also mentioned wanting to play at Italy and at Spain.\nSince losing to Germany in 2014, Brazil has rebuilt its national team under the new coach and could become the first team to qualify for the World Cup in the next few weeks.\nGermany will also play Spain in Duesseldorf four days before the game against Brazil.\nGerman soccer federation president Reinhard Grindel said the games \"will certainly be a little appetizer for the World Cup in Russia, where our coach Jogi Loew's team will give everything to defend the title a few months later.\"\nGermany leads Group C in World Cup qualifying with 12 points from four games, five ahead of Northern Ireland and Azerbaijan.\nGermany will play England in a friendly in Dortmund in 12 days.","url":"https://www.dailymail.co.uk/wires/ap/article-4301518/Brazil-play-Germany-year-1st-time-7-1-loss.html"}
