{"authors":["Associated Press"],"date_download":"2018-10-23 05:42:42","date_modify":"2018-10-23 05:42:42","date_publish":"2016-01-29 21:33:41","description":"SAO PAULO (AP) — Former Brazilian President Luiz Inacio Lula da Silva has been subpoenaed as part of an investigation into a suspected money laundering schem...","filename":"data/vaneerConsumption/BrazilianprosecutorsubpoenasformerPresidentdaSilva.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:79009f36135644f890749bcbd695c286-3bmscybNe842cce83474b5a1d192-150_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423314_Brazilian-prosecutor-subpoenas-former-President-da-Silva_1540273362.html","title":"Brazilian prosecutor subpoenas former President da Silva","title_page":"Brazilian prosecutor subpoenas former President da Silva | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Brazilian prosecutor subpoenas former President da Silva\nSAO PAULO (AP) — Former Brazilian President Luiz Inacio Lula da Silva has been subpoenaed as part of an investigation into a suspected money laundering scheme involving an apartment he once thought of buying, the Sao Paulo state prosecutor's office said Friday.\nThe office of prosecutor Cassio Conserino said Silva and his wife, Marisa Leticia, would be questioned Feb.17.\nEarlier this week, prosecutors said they were investigating whether some of the money from the big corruption scandal buffeting state owned-oil company Petrobras was laundered through illegal real estate transactions involving the OAS construction company.\nFILE - In this May 1, 2015, file photo, Brazil's former President Luiz Inacio Lula da Silva delivers a speech during a May Day rally in Sao Paulo, Brazil. The prosecutor for the Brazilian state of Sao Paulo said Friday, Jan. 29, 2016, that the former President has been subpoenaed as part of an investigation into a suspected money laundering scheme involving an apartment Silva once thought of buying. (AP Photo/Andre Penner, File)\nOAS constructed the building where Silva considered buying the apartment. Conserino's office said there were \"indications that there was an attempt to hide the identity of the apartment's owner, which if proven would mean the crime of money laundering had been committed.\"\nSilva has said that he and his wife had an option to buy the apartment in the coastal city of Guaruja but they never purchased it. The Sao Paulo-based Lula Institute said on its website that the prosecutor's suspicions of alleged concealment of assets by Silva were unfounded and frivolous.","url":"https://www.dailymail.co.uk/wires/ap/article-3423314/Brazilian-prosecutor-subpoenas-former-President-da-Silva.html"}
