{"authors":["Associated Press"],"date_download":"2018-10-23 05:00:24","date_modify":"2018-10-23 05:00:24","date_publish":"2016-01-28 21:00:55","description":"RIO DE JANEIRO (AP) — Brazil's state-run oil company Petrobras said Thursday it will slash management jobs as part of an efficiency drive approved by its boa...","filename":"data/vaneerConsumption/BrazilsPetrobrasoverhaulscorporatestructure.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421447_Brazils-Petrobras-overhauls-corporate-structure_1540270824.html","title":"Brazil's Petrobras overhauls corporate structure","title_page":"Brazil's Petrobras overhauls corporate structure | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Brazil's Petrobras overhauls corporate structure\nRIO DE JANEIRO (AP) — Brazil's state-run oil company Petrobras said Thursday it will slash management jobs as part of an efficiency drive approved by its board of directors.\nThe plan calls for a 30 percent reduction of management jobs in non-operating areas. The company has about 7,500 approved management positions, of which 5,300 are in non-operating areas.\nPetrobras said the reforms are a response to the lower gas and oil prices and mark a shift to more profitable activities. It hopes the restructuring will trim about 1.8 billion reals — now $440 million — from its annual costs.\nOffshore pre-salt projects remain a core activity for the company, it said in emailed comments emailed to The Associated Press. It said the pre-salt fields have \"a fantastic magnitude\" and are \"its most valuable assets.\"\nThe measures come as the company struggles with a corruption scandal in which managers and politicians face investigations of alleged bribery.\nIn view of that, Petrobras also said the overhaul will target procurement processes, which now will necessarily involve three areas of the company in a bid for economies of scale and spreading responsibility. Previously, procurement was decentralized.","url":"https://www.dailymail.co.uk/wires/ap/article-3421447/Brazils-Petrobras-overhauls-corporate-structure.html"}
