{"authors":["Sadie Whitelocks For Mailonline"],"date_download":"2018-10-23 02:39:54","date_modify":"2018-10-23 02:39:54","date_publish":"2017-03-16 13:16:50","description":"Images have surfaced of the sunken remains of the 76-foot long Mar Sem Fim, a Brazilian boat that was used for scientific and educational expeditions in Antarctica.","filename":"data/vaneerConsumption/BrazilianboatshownsubmergedinAntartica.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E5412F400000578-0-image-a-38_1489667146544.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-4320104_Photo-shows-ghostly-illuminated-shipwreck_1540262394.html","title":"Brazilian boat shown submerged in Antartica","title_page":"Brazilian boat shown submerged in Antartica | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ghost ships have long inspired spine-tingling stories from the oceans and beyond.\nAnd a newly-surfaced image of a sunken boat in Antarctica embodies the eeriness of tales gone by.\nLurking under the water's surface, the carcass of a wrecked Brazilian research vessel seemingly glows in the freezing cold.\nImages have surfaced of the sunken remains of the 76-foot long Mar Sem Fim, a Brazilian boat that was used for scientific and educational expeditions in Antarctica\nAfter battling winds of more than 60 miles an hour, the 76-foot long Mar Sem Fim subsequently got trapped in ice in Maxwell Bay, King George Island, around about 745 miles south of tip of South America\nAfter battling winds of more than 60 miles an hour, the 76-foot long Mar Sem Fim subsequently got trapped in ice in Maxwell Bay, King George Island, around about 745 miles south of tip of South America.\nAt the time there were four crew members on board, who were voyaging off the Antarctic coast to film a documentary.\nLuckily the men were able to radio for help and their call was received by the Chilean naval base Antarctica.\nAfter a two-day delay due to more bad weather, they were finally rescued.\nDescribing the evacuation process, crew member João Lara Mesquita wrote in his blog: 'Then, with strong winds and high waves, the boat Frei came to us. Our evacuation was epic.\nAt the time there were four crew members on board, who were voyaging off the Antarctic coast to film a documentary - luckily they were all saved after calling for help\nDescribing the evacuation process, crew member João Lara Mesquita wrote in his blog : 'Then, with strong winds and high waves, the boat Frei came to us. Our evacuation was epic'\nOver time, due to a process known as compression, the Mar Sem Fim was crushed by the ice and sent to the floor of the shallow bay\n'Waves of more than 1.5 meters and winds over 40 knots made the boat jump from one side to another, like a bucking bronco.\n'When it got close, each of us... threw ourselves into the arms of three Chilean crew members. Fortunately all went safely.'\nOver time, due to a process known as compression, the Mar Sem Fim was crushed by the ice and sent to the floor of the shallow bay.\nWhile the ship incident took place on April 7, 2012, its rescue didn't come about for almost a year.\nDuring that time the liner lay corroding in around 30 feet of icy water.\nAccording to Charismatic Planet, Mar Sem Fim's owner João Lara Mesquita eventually returned to the site in warmer weather and divers retrieved the boat using inflatable buoys.\nThe vessel was towed back to shore. It was reportedly insured for $700,000, however, damage from the incident indicated the vessel was beyond repair.\nWhile the ship incident took place on April 7, 2012, its rescue didn't come about for almost a year\nMar Sem Fim's owner João Lara Mesquita eventually returned to the site in warmer weather and divers retrieved the boat using inflatable buoys\nThe vessel was towed back to shore - it was reportedly insured for $700,000, however, damage from the incident indicated the vessel was beyond repair\nThe boat was finally taken to shore with its windows seen smashed in and lichen on the body work","url":"https://www.dailymail.co.uk/travel/travel_news/article-4320104/Photo-shows-ghostly-illuminated-shipwreck.html"}
