{"authors":[],"date_download":"2018-10-22 22:12:43","date_modify":"2018-10-22 22:12:43","date_publish":"2014-05-09 12:36:08","description":"\"Frankly, our party is all about more jobs and better pay and I think communicating that is important to us,\" he said on MSNBC's Morning Joe.","filename":"data/vaneerConsumption/BreakingwithGOPRomneyBacksMinimumWageHike.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/431396/mitt_romney_minwage_0ea4039963e5b625edea8deacb540b5d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_politics-news_breaking-gop-romney-backs-minimum-wage-hike-n101221_1540246363.html","title":"Breaking with GOP, Romney Backs Minimum Wage Hike","title_page":"Breaking with GOP, Romney Backs Minimum Wage Hike","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFormer Republican presidential nominee Mitt Romney said Friday that Republicans should drop their opposition to a minimum wage hike, joining two fellow former GOP presidential contenders in breaking with his party on the issue.\n“I think we oughta raise it,” Romney said on MSNBC’s Morning Joe. “Because, frankly, our party is all about more jobs and better pay and I think communicating that is important to us.”\nRomney , who reiterated that he’s not interested in another bid in 2016, was the third high-profile Republican in the past two weeks to say that resistance to a minimum wage increase is hurting the party’s brand. All three men are Republicans previously elected in states – Massachusetts, Minnesota and Pennsylvania – with heavy Democratic populations.\nFormer Minnesota governor and 2012 presidential contender Tim Pawlenty, now the CEO of the Financial Services Roundtable, said last month that the GOP should back a “reasonable” increase in the wage.\n“For all the Republicans who come on and talk about, ‘we’re for the blue-collar worker, we’re for the working person,’ there are some basic things that we should be for,” he said. “One of them is reasonable increases from time to time in the minimum wage.” (He later clarified that he does not support the version of such legislation being pushed by the White House and Senate Democrats because it goes “too far and too fast.”)\nAnd earlier this week, former Pennsylvania senator Rick Santorum – a past and perhaps future presidential hopeful – said the GOP stance on the issue “makes no sense.”\n“Let’s not make this argument that we’re for the blue-collar guy but we’re against any minimum wage increase ever,” he said on MSNBC’s The Daily Rundown.","url":"https://www.nbcnews.com/politics/politics-news/breaking-gop-romney-backs-minimum-wage-hike-n101221"}
