{"authors":[],"date_download":"2018-10-30 19:43:59","date_modify":"2018-10-30 19:43:59","date_publish":"2018-08-23 09:00:00","description":"Atlanta woman's breast cancer fight inspires her to wear pink throughout October to raise awareness","filename":"data/vaneerConsumption/BreastcancersurvivorwearspinksallthroughOctober.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/23/Images/newsEngin.22824191_Pink-pose.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_health_another-o_7b5a593e7c8ffcc996de2758b0389b99__1540928639.html","title":"Breast cancer survivor wears pinks all through October","title_page":"Breast cancer survivor wears pinks all through October","title_rss":"NULL","source_domain":"ajc.com","text":"On average, every two minutes a woman is diagnosed with breast cancer, and one woman will die of breast cancer every 13 minutes, according to the National Breast Cancer Foundation.\nThat moment arrived four years ago for Bonnie Ross-Parker of Atlanta, just two months shy of her 70th birthday.\nShe’d gone in for an annual checkup and there it was. A lump just under her nipple.\nWhat You Need To Know About Breast Cancer\nAn MRI confirmed something was there, and after the biopsy, there were no more questions.\nRoss-Parker had breast cancer.\n“I never would’ve imagined I would be diagnosed with cancer at that age,” she said.\nActually, breast cancer is still a disease of older women. Half of newly diagnosed women are over 60, and more than a fifth are over 70.\nIf there’s any consolation in that, it is this: While the risk of being diagnosed with breast cancer increases with age, the chance of dying from it declines steadily.\nRoss-Parker will soon be 74 and cancer-free.\nRELATED | A mother and her daughters bare all to help prevent breast cancer\nEvery year, I introduce you to a woman like Ross-Parker who has had to confront the C-word. And every October, we trot out our pink ribbons in hopes of raising awareness and funds.\nRoss-Parker has been there, done that, too.\nNearly 20 years before her own diagnosis, she signed up for the annual Avon Breast Cancer Walk, a 60-mile stretch over three days, to show her support for a dear colleague.\n“It was tough,” Ross-Parker said. “It was very tough. There were days I wanted to quit.”\nBonnie Ross-Parker of Atlanta dons her pink cap and signature pink boots during October, which is Breast Cancer Awareness Month. CONTRIBUTED (The Atlanta Journal-Constitution)\nBut she didn’t. When she arrived at Piedmont Park that day, it was pregnant with women dressed in pink shirts.\n“I never lost sight of that experience,” Ross-Parker said.\nThen in 2014, she was forced to deal with the same reality, the best change agent there is.\n“Like anything else, our awareness increases relative to what’s going on in and around us,” Ross-Parker said.\nSure enough, something clicked inside Ross-Parker, and she wanted to remember all those sisters who’d already been diagnosed and those who would follow, while at the same time celebrate the survivors, herself included.\nRELATED | Newnan mother battles breast and ovarian cancer\nHer own cancer journey increased her compassion for others and helped her realize how uncertain and precious life is. It’s why she signed up to volunteer at Northside Hospital, where she underwent chemotherapy and radiation treatment; wrote an e-book titled “Discovery and Recovery”; and continues doing whatever she can to raise awareness about the disease.\nEach week, Gracie Bonds Staples will bring you a perspective on life in the Atlanta area. Life with Gracie runs online Tuesday, Thursday and alternating Fridays. (The Atlanta Journal-Constitution)\nBut unlike some, Ross-Parker’s fight isn’t just a one-time event in the month of October. She has made it a monthlong cause, wearing pink — the ever-present watch with a pink ribbon on the dial that her husband gave her, or pink cowboy boots, hat with pink sequins, pink blouse — every day.\nHer pink parade is both a reminder that Ross-Parker is a breast cancer survivor and a handy signal to the rest of us that breast cancer awareness and the annual walks to raise money for research is a cause that begs our support.\nShe knows she’s not alone.\nAccording to the National Breast Cancer Foundation, 1 in 8 women in the United States will be diagnosed with breast cancer in her lifetime. Each year, it is estimated that over 252,710 women in the United States will be diagnosed with breast cancer and more than 40,500 will die.\nThanks to improved treatment and early detection, fewer of us are dying from breast cancer. Death rates, according to an American Cancer Society study, fell 39 percent between 1989 and 2015, saving about 322,600 lives.\nThat’s why stories like Ross-Parker’s are so important. That’s why this one is a month early.\nFind Gracie on Facebook (www.facebook.com/graciestaplesajc/) and Twitter (@GStaples_AJC) or email her at gstaples@ajc.com.","url":"https://www.ajc.com/lifestyles/health/another-october-another-pink-month-for-this-breast-cancer-survivor/oKoCLLqUAOK0MxkHHH3PzM/"}
