{"authors":["Anthony Joseph For Mailonline"],"date_download":"2018-10-23 03:07:59","date_modify":"2018-10-23 03:07:59","date_publish":"2017-03-16 13:52:55","description":"Ian Paterson (pictured), from Manchester, allegedly carried out 'unnecessary' private operations over a 14-year period in order to boost his earnings and reputation.","filename":"data/vaneerConsumption/Breastsurgeontoldamanhewasontheroadtocancer.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E3ABA4800000578-0-image-a-115_1489672600374.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320386_Breast-surgeon-told-man-road-cancer_1540264079.html","title":"Breast surgeon 'told a man he was 'on the road to cancer'","title_page":"Breast surgeon 'told a man he was 'on the road to cancer' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ian Paterson, from Manchester, allegedly carried out 'unnecessary' private operations over a 14-year period in order to boost his earnings and reputation\nA leading surgeon accused of creating bogus illnesses in his patients told a man he was 'on the road to cancer' and performed a double mastectomy on him - despite tests showing he was suffering from a harmless condition, a court heard today.\nIan Paterson, from Manchester, allegedly carried out 'unnecessary' private operations over a 14-year period in order to boost his earnings and reputation.\nIt is claimed that he removed hospital worker John Ingram's breasts after suggesting it was 'inevitable' he would develop the disease.\nBut Nottingham Crown Court has been told the 53-year-old, who had a phobia of surgery and believed his mother had died from breast cancer, was in fact only suffering from a 'common problem' that affects men - with Paterson allegedly 'lying' to him in order to justify the procedure.\nMr Ingram, who is Paterson's only male alleged victim, said the 2006 operation left him in agony, as though a 'lit cigarette was being held on his nipple' - adding that he has to take pain medication to this day.\nPaterson, who worked for the NHS and had a practice at two Spire Healthcare hospitals in the Birmingham area, denies 20 counts of wounding with intent to cause grievous bodily harm on nine female patients and Mr Ingram between 1997 and 2011.\nMr Ingram told jurors how he was referred to Paterson, whose word he took as 'gospel', by his GP after discovering a lump under his right nipple.\nHe said the consultant sent him for an ultrasound scan, then took some cells from the lump by 'ramming' a needle into his breast in 'one of the most painful things I have ever undergone.'\nMr Ingram added that when he returned for the results a week later, a 'grim-faced' Paterson claimed there were some 'worrying features' in the cells and 'described a condition he termed 'pre-cancer'.'\nHe told the court: 'Mr Paterson drew a diagram, an analogue line. At one end there was cancer, at the other end there was no cancer, and I was part-way along the line.\n'He said the line only went in one direction, towards cancer, and once you went away from the non-cancer end you did not go backwards, just forwards.\n'He said the best thing to do would be to have the whole thing out under a procedure he called a 'lumpectomy'.'\nMr Ingram said he was 'anxious, unhappy and very, very scared' at the thought of undergoing surgery after a previous operation to remove his gall bladder went 'horribly wrong,' adding: 'I was phobic at the thought of handing over control... losing consciousness.'\nBut he agreed to the lumpectomy after Paterson allegedly suggested he would then be 'done and dusted and the scare would be over.'\nHowever, when Mr Ingram went in to have the procedure, he became so distressed he was unable to go under the knife, and 'ended up sitting behind a cupboard in tears.'\nJohn Ingram, an ex-patient of Ian Paterson's, leaves Nottingham Crown Court, with his wife Katherine, after giving evidence\nHe said an 'incredibly reassuring' Paterson persuaded him to return a week later and be sedated as soon as he entered the hospital so he would be able to undergo the operation.\nMr Ingram, who worked as an orthotist, which involved treating disabled people with external devices, added no alternatives to surgery were offered by Paterson - despite him writing a letter to his GP claiming he'd suggested 'the conservative approach of waiting for a further scan.'\n'I would have grabbed it with both hands,' said Mr Ingram, then 42.\nThe court heard Mr Ingram did return - and this time the procedure 'ran like clockwork.'\nHe said: 'Mr Paterson came in shortly after I came round and reassured me the operation had gone well, there were clear margins, he had taken the tissue out and that was it. I had dodged a bullet, that was the general thrust of the conversation. That I could stop worrying now, and it was over.'\nRetired Caroline Johnson (pictured left) underwent six operations on her breasts between 2000 and 2007, following the advice of her surgeon Ian Paterson (pictured right)\nBut Mr Ingram said that when he returned to see for the results, there were 'grim faces' once more, with Paterson, 59, claiming they were 'worse than expected.'\nHe added: 'More treatment would be needed to get rid of any potential for developing breast cancer, and (Paterson) strongly recommended I have both breasts removed, then I would not have any breast tissue left to have breast cancer in.\n'He said he had shared my slides with other surgeons at a conference in Edinburgh, and there was a mix of opinions but the general consensus was I should proceed with the double mastectomy.\n'I was kind of floored. Shocked. I expected to be told it was fine, stitches out, 'you're fine, bye'. It was quite a shock.'\nJurors were told the operation went ahead with no problems, with Mr Ingram saying Paterson told him: 'I had had my brush with cancer that one in four people have, that I could go away and be at peace.'\nBut Mr Ingram added pain in his breasts slowly began to develop. He said: 'There were two distinct types. One is a sharp pain that radiates from the centre of my left breast into my armpit, and the other is a 'phantom nipple' as I describe it, because I no longer have one.\n'It was like an itch I could not scratch and developed into a burning pain, like someone was holding a lit cigarette over my nipple.\n'I had to try various medications from my doctor, and to some extent I am still on those medication today, 10 years later.'\nUnder cross-examination from Nicholas Johnson QC, defending Paterson, Mr Ingram said he was 'given the impression' that it was 'inevitable' he would develop cancer.\nHe added: 'Pre-cancer were the exact words he used. I had never heard that phrase before, which kind of befuddled me.\n'I took as gospel everything he said. He is very plausible. He has an excellent bedside manner. I had no reason no to believe everything he said, and I did so until 2011.'\nReferring to Paterson's claim he'd shown his results to colleagues at the Edinburgh conference, Mr Ingram said: 'He said he'd had a lot of eminent\nbrains looking at my problem, which I swallowed hook, line and sinker.'\nJulian Christopher QC, earlier told the court Mr Ingram's original ultrasound scan showed 'minor gynaecomastia on the right side', which involved the 'enlargement of a man's breasts - a common problem.'\nHe said the results from the needle test on the lump had come back benign, adding: 'There had been no justification for carrying out the mastectomies or even proposing them to Mr Ingram, whose agreement to the operation had been obtained by lying about the pathological findings.'\nPaterson, of Altrincham, Greater Manchester, denies performing any unnecessary surgery, and when interviewed by police said any suggestion he had done so in order to boost his earnings was 'abhorrent'.\nEarlier this week the court heard that Paterson convinced a woman to have five operations she didn't need, a court heard.\nRetired publican Carole Johnson, 64, told the judge said she followed the advice of surgeon Ian Watson because she felt like he was 'God'.\nThe mother broke down in tears while giving evidence as she recalled how she had hidden details of a lump from her family because she was worried about spoiling their Christmas in 2003.\nShe said she even ignored the advice of her doctor - telling her GP, 'Mr Paterson is the specialist, not you.'\nMrs Johnson believed a series of lumps she had found in her breast were 'borderline cancer' with Mr Paterson allegedly saying they had to be 'whipped out'.\nShe underwent six operations between October 2000 and 2007, with the prosecution claiming all but one of the procedures was unnecessary.\nThe trial continues.","url":"https://www.dailymail.co.uk/news/article-4320386/Breast-surgeon-told-man-road-cancer.html"}
