{"authors":["Kenneth Dickerman","Photo Editor","Salwan Georges"],"date_download":"2018-10-21 02:56:46","date_modify":"2018-10-21 02:56:46","date_publish":"2018-07-03 10:00:48","description":"Post photographer Salwan Georges's arresting images of fireworks.","filename":"data/vaneerConsumption/Breathtakingimagesofcolorfulexplosionscreatedbyfireworks.json","image_url":"https://www.washingtonpost.com/resizer/ER5R5GqNilVvNoGyvu6BwKd0zes=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/IR5UU3CR6I655PQUASC6QJ25XE.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_07_03__1540090606.html","title":"Breathtaking images of colorful explosions created by fireworks","title_page":"Breathtaking images of colorful explosions created by fireworks - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Fireworks go off during the Shenandoah Apple Blossom Festival show on May 4, 2018, in Winchester, Va. (Salwan Georges/The Washington Post)\nMichael Richards, 31, left, and Tim Jameson, 48, the owner of Innovative Pyrotechnic Concepts, do a final round of checks on the fireworks ahead of the show. (Salwan Georges/The Washington Post)\nEvery July 4, millions of Americans celebrate Independence Day. Although July 4 has only been a federal holiday since 1941, we’ve been celebrating since 1776. Over the years, those celebrations have come in many forms, including parades and family barbecues. But the real crowd-pleaser has always come in the form of fireworks displays. Independence Day is just around the corner, but there are other events happening around the country where you can get a little taste of the huge fireworks displays that will be taking place in places such as Washington, D.C., and New York City.\nFireworks displays have long been associated with Independence Day here in the United States, but we also use them to celebrate other events, such as New Year’s and various festivals around the country. Washington Post staff photojournalist Salwan Georges recently visited the Shenandoah Apple Blossom Festival and caught the fireworks display, which takes place roughly a month before the nation celebrates Independence Day. The festival takes place over the course of 10 days and is replete with various events including parades, dances, a wine festival and a 10K race. More than 200,000 people attend the event each year.\nTo make the photographs here, Georges arrived a few hours before the fireworks started to plan his position. He told In Sight how he made the images: “I used my wide-angle lens, 24mm and put my camera on a tripod. I set my shutter very low, closed my aperture and started to play with zooming in and out as I take the photos. As the first fireworks went up in the sky I started to make quick adjustments until I think the settings are close before playing around.”\nGeorges said his biggest challenge was just trying to get his settings right, and also trying to keep his camera dry because it started raining midway through the show. He also gives some advice to those who might be setting out to take their own fireworks pictures. “I think the most important item to photograph fireworks is a steady tripod,” he said. “And to not forget to experiment and play around with slow shutter with fireworks — the results will always be surprising!”\nFireworks light up the sky. (Salwan Georges/The Washington Post)\nPart of a remote firing system is seen ahead of the firework show during the Shenandoah Apple Blossom Festival. (Salwan Georges/The Washington Post)\nFireworks spread across the sky. (Salwan Georges/The Washington Post)\nTim Jameson, 48, owner of Innovative Pyrotechnic Concepts, checks with his employees ahead of the firework show. (Salwan Georges/The Washington Post)\nFireworks burst during the show. (Salwan Georges/The Washington Post)\nFireworks. (Salwan Georges/The Washington Post)\nFireworks streak through the sky. (Salwan Georges/The Washington Post)\nPart of the firing system is seen ahead of the fireworks show. (Salwan Georges/The Washington Post)\nFireworks burst in a riot of color during the show. (Salwan Georges/The Washington Post)\nFireworks before the show. (Salwan Georges/The Washington Post)\nFireworks illuminate the night sky during the show. (Salwan Georges/The Washington Post)\nPeople watch the fireworks show. (Salwan Georges/The Washington Post)\nOne of the many colorful explosions during the show. (Salwan Georges/The Washington Post)\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\nWhat life is like in the coal-mining boomtowns of Appalachia\nHaunting landscapes taken from thousands of hacked surveillance cameras\nInside the U.S.’s ‘National Radio Quiet Zone’ where there’s no WiFi or cellphone service","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/07/03/breathtaking-images-of-colorful-explosions-created-by-fireworks/"}
