{"authors":["Breitbart News"],"date_download":"2018-10-30 21:19:52","date_modify":"2018-10-30 21:19:52","date_publish":"2016-02-25 21:40:44","description":"On the February 26, Breitbart News Daily show, broadcast on Sirius XM Patriot channel 125 from 6AM to 9AM EST weekdays, host and Breitbart News executive chairman Stephen K. Bannon will discuss the Republican debate in Houston, Texas, and the state of the presidential primary race going into Super Tuesday. |","filename":"data/vaneerConsumption/BreitbartNewsDailyTexasShootoutSenSessionsandSuperTuesday.json","image_url":"https://media.breitbart.com/media/2016/02/SiriusXM-satellite-logo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_25__1540934392.html","title":"Breitbart News Daily: Texas Shootout, Sen. Sessions, and Super Tuesday","title_page":"Breitbart News Daily: Texas Shootout, Sen. Sessions, and Super Tuesday | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On the February 26, Breitbart News Daily show, broadcast on Sirius XM Patriot channel 125 from 6AM to 9AM EST weekdays, host and Breitbart News executive chairman Stephen K. Bannon will discuss the Republican debate in Houston, Texas, and the state of the presidential primary race going into Super Tuesday.\nBannon will also have an important interview with Sen. Jeff Session (R-AL) on the issues of trade and immigration — both topics of critical importance in the 2016 presidential race.\nFormer Senator John Sununu will call in to discuss Ohio Gov. John Kasich’s presidential run, the GOP debate, and Super Tuesday.\nColumnist Red Jahncke of the the New York Sun will speak about how Trump will likely lock up the Republican presidential nomination if he wins the Florida primary.\nWar correspondent Michael Yon will be interviewed about the rise of China as a military power.\nDonald Trump’s campaign manager Corey Lewandowski will talk about Trump’s campaign and the Houston debate.\nPolling Company President and CEO Kellyanne Conway, who runs a Ted Cruz-aligned SuperPAC, will come on the show to talk about the Cruz candidacy and the state of the race.\nJoshua Green from Bloomberg will be interviewed about the GOP debate and the run-up to Super Tuesday.\nBreitbart Texas corespondents will also be calling into the show to discuss the state of the race in Texas.\nBreitbart News Daily is the first live, conservative radio enterprise to air seven days a week. Sirius XM Vice President for news and talk Dave Gorab called the show “the conservative news show of record.”\nFollow Breitbart News on Twitter for live updates during the show. Listeners may call into the show at: 866-957-2874","url":"https://www.breitbart.com/politics/2016/02/25/breitbart-news-daily-texas-shootout-sen-sessions-and-super-tuesday/"}
