{"authors":["John Hayward"],"date_download":"2018-10-30 20:47:06","date_modify":"2018-10-30 20:47:06","date_publish":"2015-11-16 14:49:50","description":"As Duncan pointed out, no less than FBI Director James Comey has admitted to Congress that checking the background of these refugees is nearly impossible.","filename":"data/vaneerConsumption/BreitbartNewsDailyRepJeffDuncanOnGrowingResistancetoObamasSyrianRefugeeProgram.json","image_url":"https://media.breitbart.com/media/2015/07/jeff-duncan-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_16__1540932426.html","title":"Breitbart News Daily: Rep. Jeff Duncan On Growing Resistance to Obama's Syrian Refugee Program","title_page":"Breitbart News Daily: Rep. Jeff Duncan On Growing Resistance to Obama's Syrian Refugee Program | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Rep. Jeff Duncan (R-SC) discussed the growing resistance to President Obama’s massive Syrian refugee resettlement program on Breitbart News Daily, expressing grave doubts that tens, or hundreds, of thousands of Syrians could be properly vetted for security concerns on a tight timetable.\nAs Duncan pointed out, no less than FBI Director James Comey has admitted to Congress that checking the background of these refugees is nearly impossible.\n“In the Homeland Security Committee, two or three weeks ago, we had FBI Director Comey, and Secretary Jeh Johnson with DHS in our committee, as well as the director of the National Counter-Terrorism Center,” Duncan recalled. “And I asked them, on the record, because we were hearing that some of these Syrians could come to South Carolina… I asked them, ‘Tell me something I can go home to my folks who are concerned about the Syrians, are we able to properly vet these individuals?’ And they said no, we’re doing better, but we can’t.”\nHe said part of the problem is that so many records were destroyed or stolen in Syria during the civil war, and its legal records were of dubious quality to begin with. “You can actually get a false passport when you cross over into Turkey for about $200, because there are so many false documents and things that have been stolen in Syria, and are now available for these migrants who want to change their identity as they flow into Europe,” he said.\nDuncan added that it would not surprise him if the refugee suspect currently sought by the police in connection with the Paris attacks was traveling with stolen or forged documents, given how pervasive the use of such documents has been.\nHe also highlighted the dangers Europe’s open borders pose to the movement of terrorists throughout the Western world, noting that easy movement across Europe gives potential terrorists many possible points of departure for journeys to the United States.\n“Radical Islamic jihadists have a long-term vision,” Duncan warned. “And if they have to stay in Europe to obtain a citizenship, to ultimately travel to the United States, and if it takes them five years or ten years, they’re okay with that. History has proven that.”\nThe demographics of the incoming refugee population are also a point of concern. “You’re not seeing women and children and families,” Duncan pointed out. “You’re seeing a lot of military-age males… Be alarmed, America, about that. Be alarmed.” He credited Breitbart News for its role in getting out video of who the refugees really are, penetrating media illusions that conceal the overwhelming percentage of fighting-age single men in the migrant tide.\nDuncan encouraged his colleagues to use the upcoming December omnibus spending bill to halt Obama’s reckless Syrian resettlement plans, by standing behind an amendment to use the congressional “power of the purse” to defund the billion-dollar program. He is a co-sponsor of Rep. Brian Babin’s (R-TX) bill to pause resettlement.\nHe applauded the efforts of governors such as Rick Snyder in Michigan, Robert Bentley in Alabama, and Bobby Jindal in Louisiana to resist Syrian resettlement until security concerns can be properly addressed, and encouraged the governor of his own state, Nikki Haley, to follow suit.\n“We need to hit pause, and possibly reset, as we think about this whole Syrian refugee resettlement issue,” said Duncan.\nHe noted that President Obama’s poor record on national security inspires no confidence that security threats from a wave of Syrian refugees would be handled properly, noting the Administration’s incredible decision to proceed with releasing five terrorist from Guantanamo Bay the day after the Paris attacks, along with statements from the White House that nothing will change their minds about ushering in thousands of Syrian refugees.\n“One way that we can help them back off on it is – that’s the voice of the American people,” said Duncan. “If we can get the American people engaged to call Congress, call their elected representatives and Senators, and call the White House… I really believe in that home-field advantage of the American people being engaged, and letting their voice be heard. They really need to be engaged on this. It is a national-security issue that could affect their own neighborhoods.”","url":"https://www.breitbart.com/politics/2015/11/16/breitbart-news-daily-rep-jeff-duncan-growing-resistance-obamas-syrian-refugee-program/"}
