{"authors":["Breitbart News"],"date_download":"2018-10-30 21:20:28","date_modify":"2018-10-30 21:20:28","date_publish":"2016-02-04 04:04:46","description":"On the February 4, Breitbart News Daily show, on Sirius XM Patriot channel 125 from 6AM to 9AM EST, host and Breitbart News Chairman Stephen K. Bannon will discuss the most important news of the day, especially the presidential primary races and President Barack Obama's appearance at a radical Mosque. |","filename":"data/vaneerConsumption/BreitbartNewsDailyZikainTexasObamaatMosqueWarinNewHampshire.json","image_url":"https://media.breitbart.com/media/2015/11/Sirius-XM.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_03__1540934428.html","title":"Breitbart News Daily: Zika in Texas; Obama at Mosque; War in New Hampshire","title_page":"Breitbart News Daily: Zika in Texas; Obama at Mosque; War in New Hampshire | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On the February 4, Breitbart News Daily show, on Sirius XM Patriot channel 125 from 6AM to 9AM EST, host and Breitbart News Chairman Stephen K. Bannon will discuss the most important news of the day, especially the presidential primary races and President Barack Obama’s appearance at a radical Mosque.\nBreitbart Texas editor Brandon Darby will come on to talk about border issues and the two Zika virus cases in Texas that could start a “transmission cycle.”\nBreitbart News’ Jordan Schachtel will come on the program to talk about his latest article on Donald Trump’s proposed better relations with Russia.\nBreitbart News’ Matthew Boyle, Michelle Fields, and Alex Swoyer will come on the program to speak about the Republican primary race in New Hampshire.\nBreitbart News’ Michael P. Leahy will talk about his latest exclusive on how Ann Coulter claims that the Obama administration will not indict Hillary Clinton.\nFollow Breitbart News on Twitter for live updates during the show. Listeners may call into the show at: 866-957-2874.","url":"https://www.breitbart.com/politics/2016/02/03/breitbart-news-daily-zika-in-texas-obama-at-mosque-war-in-new-hampshire/"}
