{"authors":["Neil W. Mccabe"],"date_download":"2018-10-30 19:54:25","date_modify":"2018-10-30 19:54:25","date_publish":"2016-08-01 00:38:00","description":"Breitbart News Network announced Sunday it is launching a new partnership with Gravis Marketing to create the Breitbart/Gravis poll series.","filename":"data/vaneerConsumption/BreitbartGravisPollsWillBringRealTimeActionableInformation.json","image_url":"https://media.breitbart.com/media/2016/04/breitbart-google-amp.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_07_31__1540929265.html","title":"Breitbart/Gravis Polls Will Bring 'Real-Time, Actionable Information'","title_page":"Breitbart/Gravis Polls Will Bring 'Real-Time, Actionable Information' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Breitbart News Network announced Sunday it is launching a new partnership with Gravis Marketing — the Florida-based polling firm recognized July 1 by Bloomberg Politics as the most accurate for the 2016 primary season — to create the Breitbart/Gravis poll series.\n“The explosive growth of Breitbart News rests on our ability to provide real time, actionable information to our community,” said Stephen K. Bannon, the Executive Chairman of Breitbart News Network. “Our partnership with Gravis is focused on just that — quantifying where the American people are on the issues of the day and the trends of tomorrow. Breitbart/Gravis will become a significant voice in the 2016 campaign and beyond.”\nBreitbart News Editor-in-chief Alexander Marlow asserted: “It is not enough to grouse about bias and corruption. The best way to fight back is to get in the game ourselves, and that’s exactly what we’ve done.”\nDoug Kaplan, the managing partner of Florida-based Gravis Marketing, said,”We are all very excited to team up with Breitbart News.”\nKaplan said, “Andrew Breitbart was a conservative icon. He liberated millions of Americans from the mindlock of the mainstream media and the news platform he created, Breitbart News Network, is the biggest source of breaking news and analysis, thought-leading commentary, and original reporting curated and written specifically for the new generation of independent and conservative thinkers.”\nGravis Marketing polls are part of the Real Clear Politics basket of polls and are also published by the Huffington Post. Bloomberg Politics ranked Gravis as the most accurate pollster in the 2016 primary season in its July 1 look back report, which found that Gravis had predicted the winner 95 percent of the time. Gravis was judged against 12 other national polling firms and beat out such names as Emerson College, Opinion Savvy, the Marist College/NBC News/Wall Street Journal polls, as well as online pollster SurveyMonkey.","url":"https://www.breitbart.com/politics/2016/07/31/breitbart-gravis-polls-launching/"}
