{"authors":["Breitbart News"],"date_download":"2018-10-30 21:25:30","date_modify":"2018-10-30 21:25:30","date_publish":"2015-12-03 01:30:43","description":"On the November 3, Breitbart News Daily show on Sirius XM Patriot channel 125 from 6AM to 9AM EST, host and Breitbart News Executive Chairman Stephen K. Bannon will interview a number of guests and discuss the most important news topics.","filename":"data/vaneerConsumption/BreitbartNewsDailySenRandPaulGovMikeHuckabeeEdKlein.json","image_url":"https://media.breitbart.com/media/2015/11/Sirius-XM.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_02__1540934730.html","title":"Breitbart News Daily: Sen Rand Paul; Gov Mike Huckabee; Ed Klein","title_page":"Breitbart News Daily: Sen Rand Paul; Gov Mike Huckabee; Ed Klein | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On the November 3, Breitbart News Daily show on Sirius XM Patriot channel 125 from 6AM to 9AM EST, host and Breitbart News Executive Chairman Stephen K. Bannon will interview a number of guests and discuss the most important news topics. The program is the first live, conservative radio enterprise to air seven days a week. Sirius XM Vice President for news and talk Dave Gorab called the show “the conservative news show of record.”\nRepublican Presidential candidate Sen. Rand Paul will be interviewed.\nBannon will interview Former Arkansas Governor and Republican presidential candidate Mike Huckabee.\nBestselling author Ed Klein will be interviewed about his new book, Unlikeable: The Problem with Hillary. The book is an expose on Democratic presidential candidate Hillary Clinton, a “highly unlikeable presidential candidate and a woman more associated with scandal than with accomplishments, with lying than with truth, with arrogance than with compassion.”\nBreitbart London’s Raheem Kassam will come on the show to give updates on the massive shooting in San Bernardino.\nBreitbart London’s James Delingpole will come on the show to talk about the COP21 Paris summit.\nBreitbart New’s Brandon Darby and Aaron Klein will come on the show to discuss a deadly virus that is rapidly spreading in Mexico.\nBreitbart News’ Michelle Fields will be interviewed about defunding the efforts to bring Syrian refugees into the United States.","url":"https://www.breitbart.com/politics/2015/12/02/breitbart-news-daily-sen-rand-paul-gov-mike-huckabee-ed-klein/"}
