{"authors":["Breitbart News"],"date_download":"2018-10-30 18:23:44","date_modify":"2018-10-30 18:23:44","date_publish":"2015-11-16 20:31:57","description":"Breitbart News Senior Editor-at-Large Ben Shapiro is heading to campus to challenge students at the University of Missouri.","filename":"data/vaneerConsumption/BreitbartsBenShapiroInvadesMizzouThursdayNight.json","image_url":"https://media.breitbart.com/media/2015/11/GettyImages-496421764-mizzou.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_11_16__1540923824.html","title":"Breitbart's Ben Shapiro Invades Mizzou Thursday Night","title_page":"Breitbart's Ben Shapiro Invades Mizzou Thursday Night","title_rss":"NULL","source_domain":"breitbart.com","text":"As the University of Missouri continues to simmer with racial unrest and students continue to crack down on free speech in the name of stopping “white privilege” and “microaggression,” Breitbart News Senior Editor-at-Large Ben Shapiro is heading to campus to challenge the students.\nShapiro will lecture on the topic, “Truth Is A Microaggression,” at an event sponsored by Young America’s Foundation, Thursday night, November 19, at 6 PM CT in Ellis Auditorium.\nStudent leaders at Mizzou’s conservative club rushed to organize the event with YAF after hearing Shapiro speak at the Fall Conference at the Reagan Ranch in California.\n“As an organization that works with students every day, we know how desperately the University of Missouri’s needs leaders on the ground to articulate a strong argument against the reckless actions of its progressive student body,” YAF President Ron Robinson said. “There is no better candidate for the job than Ben Shapiro. He will provide the education on free speech and political correctness the school’s liberal professors have clearly failed to administer.”\nShapiro told YAF, “I look forward to an open and honest debate about fundamental issues like free speech and racism and phantom ‘white privilege’ in the United States. I also look forward to microaggressing people through such debate. Toughen up, spoiled children.”\nShapiro’s appearance on campus will signify the first conservative event on campus since the outbreak of racial protest that culminated in the resignation of the university’s president. Shapiro tells Breitbart News, “The national student movement driven by the events at Mizzou signify the death of basic American values.\n“I’m not much older than these kids, but we’re not preparing kids for life – we’re preparing them for a future of whining pantywaist fascism. We need to fight that trend tooth and nail. Liberty is not a safe space.”","url":"https://www.breitbart.com/the-media/2015/11/16/toughen-spoiled-children-breitbarts-ben-shapiro-invades-mizzou-thursday-night/"}
