{"authors":["John Nolte"],"date_download":"2018-10-30 21:14:59","date_modify":"2018-10-30 21:14:59","date_publish":"2015-06-02 20:33:15","description":"Zack Arnold currently edits the hit television show \"Empire,\" was an editor for years on \"Burn Notice,\" and is also my brother.  He has had an amazingly |","filename":"data/vaneerConsumption/BreitbartNewsInterviewEmpireEditorReleasesFaithBasedDocGoFarTheChristopherRushStory.json","image_url":"https://media.breitbart.com/media/2015/06/053015shooting3wm.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_06_02__1540934099.html","title":"Breitbart News Interview: 'Empire' Editor Releases Faith-Based Doc 'Go Far: The Christopher Rush Story'","title_page":"Breitbart News Interview: 'Empire' Editor Releases Faith-Based Doc 'Go Far: The Christopher Rush Story' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Zack Arnold currently edits the hit television show “Empire,” was an editor for years on “Burn Notice,” and is also my brother. He has had an amazingly successful career in his chosen field, is just getting started, and pours his passion into every project he’s involved in. His Passion Project for the last 7 years, though, has been a feature-length documentary about a close friend of his from college.\nChristopher Rush died a very young man in 2007. He was only 30. The miracle is that he wasn’t supposed to live past the age of 2. Chris lived an amazing life — one filled with jaw-dropping accomplishments, faith in God, and love for his family. Just as cool is the fact that Chris was a huge “Star Wars” fan and no less than Luke Skywalker himself (Mark Hamill) narrates his story.\nChristopher Rush’s life is inspiring and moving, and so is the “Go Far,” Zack’s film which has won all kinds of documentary awards and is available today on DVD, digital download, and via the miracle of streaming.\n—\n—\nFirst off, thanks so much for doing this Q&A. Let’s start by telling Breitbart News readers about “Go Far,” and why you — and I — believe they would love it.\nThis is a story about a former national poster child for the Muscular Dystrophy Association (i.e. one of “Jerry’s Kids”) who’s parents were told, “Your son will be nothing more than a dishrag and will be dead by the age of 2.” He lived until age 30, and achieved more than most able-bodied people do in a lifetime, including becoming the first quadriplegic licensed as a scuba diver.\nThat’s a universal story, an inspirational one for everyone.\nOn top of all that, including graduating from law school, Chris created GO FAR (while he was studying for the Bar Exam).\nShortly before his death, Chris developed a motivational program called GO FAR. My intention for this film is to continue that work while telling the story of his life.\nTo your first question, specifically, your readers will appreciate this film because Christopher’s unflinching optimism largely came from his faith in God, and his belief there was much more to life waiting for him beyond his time here. This film is not only inspirational but also a roadmap for anyone hoping to overcome obstacles to achieve their goals.\n—\n—\nAs a film and television editor, you’ve been involved with all kinds of amazing projects, not just “Empire” and “Burn Notice,” but editing the theatrical marketing campaign for ‘The Passion of the Christ.’\n“Go Far” is something you have been working on for the last seven years as more than an editor — you are producer, director, writer. This is a project you conceived of and brought to life. Where did it all begin?\nThe inspiration for GO FAR came in the most unfortunate of places – Christopher’s funeral in 2007.\nAs I sat in church and listened to friends and family eulogize Christopher’s life, I began hearing about all of these things Christopher had accomplished that I knew nothing about when he and I were friends. He was very humble and never boasted about his achievements, to me he was just a fun person to spend time with and talk about movies. I had no idea the scope of his accomplishments. And then someone began talking about a motivational program that Christopher was developing called GO FAR, and I said, “that is the title of a film.”\nThat sounds a little like divine inspiration.\nWhether it was divine inspiration or otherwise, I realized instantly that his work could not be left incomplete and I took it upon myself to find a way to make sure his story and legacy would live on.\nI had NO IDEA what I had committed to that day.\nI can’t believe it’s been seven years. What a struggle.\nIronically, the journey to make a film about overcoming obstacles was a journey paved with nothing but obstacles. In 2007 I was anything but an accomplished editor, I was more often unemployed than otherwise, jumping from one low paying independent film to another.\nWhat was the first step to making the film — your first leap of faith?\nRaising the money necessary to travel to the Cayman Islands to document the ceremony where Christopher’s ashes would be spread at sea. This was before Kickstarter and just when Facebook was starting to go mainstream, so the only way I had to raise money was calling and e-mailing family and friends. I raised just enough to fly a crew of three people to Grand Cayman to shoot the ceremony and gather interviews.\nAs soon as I returned (this was August of 2008) the economy collapsed, I lost over $150,000 equity in my home, and I couldn’t find work to save my life. So my footage sat on a hard drive untouched for over a year as I struggled to find work and just survive.\nBut after my trip to the Caymans I was convinced I had a powerful story, so I begged an editor colleague to help me edit together a 7-minute sales reel and I used that to launch my first Kickstarter campaign.\n—\n—\nOver the next three years I ran four Kickstarter campaigns that funded the production one small phase at a time, and simultaneously my career took off as an editor once I landed a job editing ‘Burn Notice.’\nI parlayed my involvement on the show and used it to build a fan base via Twitter and Facebook, and that’s partly how I was able to raise the money to make the film.\nThe people you work with at “Burn Notice” and “Empire,” including the stars, have been wonderful about helping this project.\nI simply couldn’t have done it without the support of my colleagues on ‘Burn Notice’ and now ‘Empire,’ but most importantly, I would not be this far without the undying support of my family, all of whom have believed in me every step of the way.\nAnd then there’s the incredible story of Mark Hamill, “Go Far’s” narrator.\nVery early in the process I knew I would need a narrator, but for a long time I couldn’t figure out who the right voice would be. I didn’t want “The Voice of God” because the narration had to feel genuine as if it was Christopher himself. So that meant Morgan Freeman and James Earl Jones were off my shortlist. All joking aside, the idea of James Earl Jones did make me think, “Hmmm, someone from Star Wars would be cool, “ and I immediately thought of Mark Hamill. It seemed like an impossible task at the time.\nWorst he could say was ‘no,’ right?\nExactly. Luke Skywalker was Christopher’s hero, and one of the main driving factors that propelled Christopher forwards in life was his belief in The Force. So I thought I’d give it a try. It just so happened that my producer had a colleague who had worked with Mark Hamill in the past, so we took a shot in the dark and passed along a one-page pitch asking if he’d like to do the voice over. And he agreed! Not long after we recorded the voice over in a recording booth together, he was very gracious, and I handed him a screener of the rough cut on DVD.\nYou told me Hamill donated his entire fee to the project.\nA couple of weeks later I received an e-mail from Mark saying he wasn’t fully aware of the scope of this project and its power to inspire. And because of that he donated his entire fee right back to the film to cover other production costs. Since then he has been our biggest fan and a great asset in helping to market the film via social media. He also facilitated our connection with Lucasfilm who granted us the rights to all of the Star Wars material used in the film, a feat I was told by countless people would be impossible. We wouldn’t be here without Mark Hamill.\nThat’s right, Lucasfilm let you use their materials. It add so much to the movie.\nPlus he’s friggin’ Luke Skywalker. C’mon.\nI only met Chris that one time. He didn’t wear his faith on his sleeve but I wasn’t surprised to learn of it through “Go Far.” Considering his circumstance, other than his undeniable charisma, there was a serenity about him and his family.\nChris absolutely did not wear his faith on his sleeve, I knew very little about that side of him. But as I began researching his past, and interviewing his family and friends, it became very clear that the primary reason Chris was able to live with such optimism was his faith in God.\nOne of his favorite quotes was from Joseph Dunning and stated, “For those who have faith, no explanation is necessary. For those who do not, none will suffice.”\nIn the final page of his unfinished autobiography Christopher stated, “I only pray that my loved ones find comfort in knowing that I am of the former category.”\nChris was also cool, a guy’s guy. We hold your bachelor party at one of the hottest hotels on Sunset Boulevard, pay a fortune for the room, and the cheap bastards won’t even let us bring in a case of beer. I’ll never forget Chris coming up with the idea of using his wheelchair to sneak liquor in. “They won’t search a guy in a wheelchair,” he said. He, I, and his dad probably made five trips racing back and forth across Sunset with our contraband — laughing the whole time.\nWhether it was a beer run or a law degree, this was a man who figured out a way. He also had a joy for life.\nFor someone dealt the crappy hand of cards that Christopher was, he had every excuse to lament his life and feel sorry for himself. But it was his faith in knowing there was a better place after his life on earth that kept him moving forward.\nHow is the Rush family doing today?\nRemarkably well. I have been so inspired by their resilience and strength, and I have come to realize that it is because of them that Christopher was the strong person he was. The first year after his passing was incredibly difficult for them, but they’ve told me numerous times that once they were able to lay Christopher’s remains to rest in the Cayman Islands, they felt a tremendous sense of closure and acceptance.\nThey must love the film.\nThrough the process of making this film with me, they have said it has helped to keep Christopher’s spirit alive. That is one of the main reasons I have kept going for the last seven years despite the daily obstacles.\nWhere is the best place for people to see “Go Far?”\nAll you have to do is visit www.gofarmovie.com. The film is available worldwide to stream, purchase a digital download compatible with all major devices, or they can also buy a DVD.\nIn September the film will be launching on all major digital platforms including iTunes, Google Play, Amazon Prime, Roku, Vudu, as well as various ‘On Demand’ services.\nAnd sites that agree to host “Go Far” can earn a commission, correct?\nThe best part about our release is that organizations and charities can become a GO FAR affiliate and earn a 20% commission on all gross sales of the film (after September 1st the commission drops to 10%). Part of the reason it took seven years to complete this film is I have been waiting for a platform to exist that would allow others to share this film with their audience and raise money while doing so. And once I discovered Yekra, I knew I had everything I needed to market this film to the audience it could benefit the most.\nWhat a world we live in. For going on a decade, you and I have been excited about the distribution possibilities that have come with the Internet and all things digital. Your “Go Far” rollout is ingenious in that respect.\nI’ll be happy to consider this rollout ‘ingenious’ after it works.\nStill, the digital revolution is supposed to be part of my beat and you’ve found avenues I had no idea existed.\nWell, as I mentioned earlier, the reason I am so enthusiastic about our distribution strategy is we can use nationwide organizations like MDA and Special Olympics to target our core audience by becoming GO FAR affiliates.\nI’ve told every team member that has come on board this film, including my sales agent and distributors, that if Harvey Weinstein paid me $1 million dollars to release GO FAR in 20 theaters, then release it on DVD, then it sits in the bargain basement at Wal-Mart, I would turn him down in a second because the goal of the film is to reach those with disabilities and family members of those with disabilities.\nThe way to make that happen is to use the existing network of charities and faith-based organizations (like The Dove Foundation, GodTube, and GodVine) to share the film with their networks. I’m happy to give away 20% of the gross proceeds if it means reaching the right people.\nTalk about the work and planning that went into the roll-out. Just because the Internet has made distribution accessible to everyone, that doesn’t mean it’s easy. You have to be determined and resourceful.\nThe first five years of this process, my only focus was making a great film. There is no point in worrying about distribution, getting into festivals, or any of the other noise associated with making a film if it isn’t a great film.\nOnce I locked picture and felt confident I had done my best, my producer and publicist Tracy Balsz started shopping the film around to TV networks, sales agents, studios, and major distributors. We were universally rejected and told, “There is no money in documentaries. Best of luck.”\nOvercoming rejection, muscling on, is a big part of the process.\nThere was one sales agency (Imagination Worldwide) that saw the “Go Far” trailer and were very moved. After requesting a screener they asked to meet with us, and in that meeting they told us how they would love to help represent the film even though they had no idea how to sell it and they didn’t think there was any money to be made. But they knew there was a higher purpose associated with the film and enthusiastically jumped on board.\nThen for the next year we endured a second round of universal rejection as Imagination shopped the film around to every major cable network as well as at international sales conferences like Cannes and EFM (European Film Market). So we decided it was time to think seriously about an all-digital distribution model.\nImagination connected us with Syndicado, who saw the same potential for this film we all did, and they have since facilitated our connections to all of the major digital distribution platforms including Yekra.\nSwitching gears for a moment… You work at a level in Hollywood legions of people aspire to. Because it could help others, I have to ask you to tell the story of how you got where you are.\nThis is probably a separate article in and of itself, but the short version is that I took a very unconventional path to get where I am. Most people look at my resume on paper and ask, “How in the world did you get a job on ‘Empire’?”\nLess than a week out of college I got a job as an assistant editor for a small movie trailer company and within 5 months became promoted to editor. I won a ‘Golden Trailer Award’ for the very first trailer I ever cut and my career as a trailer editor took off from there. But I realized very quickly that my true passion was cutting feature films and television, and if I stayed on the path that I was on I would end up 40 years old chained to a job I hated. So I abandoned my six-figure job to edit an independent film for $600 a week flat.\nYou gotta take risks. Sometimes big ones.\nThe next five years of my life was juggling freelance jobs editing trailers for money and also editing independent films for little (or zero) pay for months at a time. Then after editing a web series called ‘The Bannen Way‘ I began Facebook-stalking (I don’t endorse Facebook stalking) anyone I could find that worked on the show ‘Burn Notice’ because I knew if there was one job I was perfect for, it was that show.\nAn opportunity opened where they needed someone to cover one episode, and I talked myself into the job. After viewing my first cut they told me I couldn’t leave and I spent four years editing the series through its final season. From there one connection led to another and I am now editing ‘Empire.’\nWhat advice do you have for anyone looking for any kind of career in Hollywood.\nWhenever I am asked the million dollar question, “How can I make it?” I tell everyone the same three things. First, you have to pick a direction from day one. That direction can change along the way, but everyone has to start at the bottom of the ladder and climb upwards, but if you’re climbing the wrong ladder you are going nowhere. So be specific about what you want to do and make your career choices accordingly. But also be willing to be flexible along the way. Building your career is a game of Chess, not Checkers.\nSecondly, you are only going to move forwards and succeed if you are good at whatever craft or job you choose. So learn everything you can about your specific field, and most importantly, DO IT. Don’t talk about making a film, make one. Don’t talk about editing a trailer, edit one. Technology is at the point where filmmaking can virtually be done for free if you’re scrappy and willing to endure some challenges along the way, so there are no more excuses. Get your hands dirty and make stuff.\nLastly, if you have chosen the right ladder to climb and you are good at what you do but nobody knows you exist, you are wasting your time. So get out and meet people. Network. Go to user groups, introduce yourself, engage with other people in your chosen field on Twitter, Facebook, or LinkedIn. I used to mail hand-written letters to editors I admired and request to meet with them for lunch. Those days are over, now you can reach out to people instantly. Make sure people know you exist and you are good at what you do, and your chances of being successful will increase exponentially.\nWhat if anything can you tell ‘Empire’ fans about next season. I’m primarily interested in the number of episodes. The network obviously wants as many as possible. For quality purposes, I’ve read the creators are fighting for fewer.\nSeason 2 will be 18 episodes. There was a lot of debate about whether or not to increase the number beyond the 12 episodes we did for season 1. From a creative perspective, I believe the industry has defined the “magic number” for creating an engaging scripted drama at around 13 episodes per season, but the standard network show is usually 22 episodes.\nSo I think they chose 18 as a nice balance between the ideal and the unrealistic given the high production demands of a show that includes so much originally produced music. Time will tell if 18 is a format that will work for the show but I am optimistic it will allow us more time to tell more stories as we have so many strong characters and possible storylines.\nI’m sorry but I’ve been told by my editor that without a big “Empire” scoop, we can’t publish any portion of this interview.\nTell your editor he’s a jerk.\nOkay, my editor didn’t say that, I did.\nI knew that.\nI’m telling mom.\n—\nYou can rent or purchase “Go Far: The Christopher Rush Story” here.","url":"https://www.breitbart.com/entertainment/2015/06/02/breitbart-news-interview-empire-editor-releases-faith-based-doc-go-far-the-christopher-rush-story/"}
