{"authors":["Breitbart News"],"date_download":"2018-10-30 19:47:20","date_modify":"2018-10-30 19:47:20","date_publish":"2017-01-10 14:05:53","description":"Joshua Green of Bloomberg writes that Breitbart News has hired John Carney, a veteran finance journalist, to run a news vertical on the economy. | Media","filename":"data/vaneerConsumption/BreitbartNewsHiresfromWallStreetJournalVeteranJournalistJohnCarneytoLeadFinanceEconomicsCoverage.json","image_url":"https://media.breitbart.com/media/2016/11/andrew-breitbart.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2017_01_10__1540928840.html","title":"Breitbart News Hires from Wall Street Journal; Veteran Journalist John Carney to Lead Finance, Economics Coverage","title_page":"Breitbart News Hires from Wall Street Journal; Veteran Journalist John Carney to Lead Finance, Economics Coverage | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Joshua Green of Bloomberg writes that Breitbart News has hired John Carney, a veteran finance journalist, to run a news vertical on the economy.\nFrom Bloomberg:\nIn a bid to expand its influence in the era of Donald Trump, Breitbart News, the crusading populist-right website that was an early champion of the incoming president, has hired veteran financial journalist John Carney of The Wall Street Journal to lead a new finance and economics section set to launch soon after the Jan. 20th presidential inauguration.\n“Breitbart was way ahead of the curve on politics and the rise of Trump,” Carney said in a telephone interview. “I think there’s an opportunity to do that for business, finance and economic news.”\nIn his new role, Carney will manage a roster of news contributors that includes former CNBC personality Larry Kudlow.\n…\n“There simply isn’t a better person in media to lead the economics section of an anti establishment, center-right, global news outlet,” Larry Solov, chief executive of Breitbart News Network, said in a statement. Carney, a former attorney and veteran of CNBC and Business Insider, writes about finance with a populist bent that often mirrors Breitbart’s outlook on politics.\n“We’re going to both break news and provide analysis and commentary as it happens,” he says.\nWhile Carney describes the site’s new contributors as having a variety of ideological backgrounds, he says all have become “converts to the cause of economic nationalism and populism.”\nRead the rest of the story here.","url":"https://www.breitbart.com/the-media/2017/01/10/breitbart-news-hires-wall-street-journal-veteran-journalist-john-carney-lead-finance-economics-coverage/"}
