{"authors":["Mike Flynn"],"date_download":"2018-10-30 21:25:02","date_modify":"2018-10-30 21:25:02","date_publish":"2016-02-05 15:26:45","description":"Republican presidential candidate Carly Fiorina said there was \"no doubt\" Hillary Clinton broke the law with respect to her private email server and handling of classified intelligence. |","filename":"data/vaneerConsumption/BreitbartNewsDailyCarlyFiorniaSaysTheSystemIsRigged.json","image_url":"https://media.breitbart.com/media/2016/01/AP_801347982714.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_05__1540934702.html","title":"Breitbart News Daily: Carly Fiornia Says 'The System Is Rigged'","title_page":"Breitbart News Daily: Carly Fiornia Says 'The System Is Rigged' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Appearing Friday on Breitbart News Daily, Republican presidential candidate Carly Fiorina said there was “no doubt” Hillary Clinton broke the law with respect to her private email server and handling of classified intelligence.\n“I’ve chaired the advisory board at the CIA,” Fiorina told Breitbart Executive Chairman Stephen K. Bannon. “I’ve looked at this kind of information. There is no doubt she broke the law. There is no doubt she should be prosecuted.\n“And, she’s been lying about it all along,” Fiorina noted about Clinton’s explanations for her use of a private email server while she was Secretary of State. “This is the Clinton way. Lie about it as long as you can get away with it. Say whatever you’ve got to say to get elected.”\n“She’s escaped prosecution more times than ‘El Chapo’,” Fiorina said. “Sean Penn should interview her.” El Chap is a notorious Mexican drug lord who repeatedly escaped from prison and was recently apprehended after sitting for an interview with actor Sean Penn.\nBannon asked Fiorina why “many people think you are best to really take the wood to Hillary one-on-one in debates and across the country in a general election.”\nFiorina noted that she has been highly critical of Clinton and her record even before she had decided to run for President. “I have not been afraid to say the truth about Hillary Clinton,” Fiorina said and noted the attacks she has withstood from the media for her criticism.\n“Did I back down,” Fiorina asked. “No, I did not.”\n“She has not accomplished anything,” Fiorina added. “She is corrupt, and so is her husband. She lied about Benghazi. She is not fit for the office.”\nFiorina, however, also turned her fire on the news media and officials with the Republican National Committee for excluding her from the upcoming Republican debate on Saturday. The RNC and debate host ABC recently announced Fiorina would not participate in the debate, even though the field of candidates has been reduced in 8 following the Iowa caucuses.\n“The fact that I’m not on that debate stage is proof positive that the game is rigged,” Fiorina said. “The game is rigged.”\nFiriona observed that, early in the campaign, RNC officials said they had to use polls as a benchmark because of the number of candidates. Fiorina noted that, with the Iowa caucus behind us, there have now been actual votes in the nominating contest.\n“We had a real vote in Iowa,” Fiorina said. “And I beat a couple of the people on that debate stage. And I have delegates. The last time I looked at election was supposed to matter.”\nIn the Iowa caucus on Monday, Fiorina finished ahead of both New Jersery Gov. Chris Christie and Ohio Governor John Kasich. Both Christie and Kasich have been invited to participate in the Republican debate on Saturday. Fiorina has not been invited.\nFiriona said Republican officials can’t justify not including her in the debate, but they are sticking to their decision. It shows, Fiorina said, how much the game is rigged.\n“This isn’t just about me on the debate stage. Its about the voters of this nation,” Fiorina said. “In particular its about the voters of Iowa who’ve basically been told your vote doesn’t count.”\nBannon noted that one of the reasons many voters, particularly readers of Breitbart News, like Fiorina is that she is known as a fighter. Bannon said he expected Fiorina would continue her fight up to and beyond Saturday’s debate.\n“I’m at my best in a fight and its been a fight all along,” Fiorina said. “Its why I’m running for President. It is time to take our country back. It is time to take our politics and our government back.”\n“Our country is being taken away from us by the establishment and the elite,” Fiorina added. “This is proof positive we’ve got to get our government under control.”\n“The American people must demand now a leader,” Fiorina said, “a Commander in Chief, a President who will challenge the system.”\nListen:","url":"https://www.breitbart.com/politics/2016/02/05/breitbart-news-daily-carly-fiornia-the-system-is-rigged/"}
