{"authors":["Breitbart News"],"date_download":"2018-10-30 20:20:02","date_modify":"2018-10-30 20:20:02","date_publish":"2015-12-21 00:30:17","description":"On the December 21, Breitbart News Daily show, on Sirius XM Patriot channel 125 from 6AM to 9AM EST, host and Breitbart News Executive Chairman Stephen K. Bannon will interview a number of guests and talk about the Democrat presidential debate, Paul Ryan's omnibus bill, and the threat of radical Islam among other important current events.","filename":"data/vaneerConsumption/BreitbartNewsDailyPaulRyansBudgetandAmericasDemise.json","image_url":"https://media.breitbart.com/media/2015/11/Sirius-XM.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_20__1540930802.html","title":"Breitbart News Daily: Paul Ryan's Budget and America's Demise","title_page":"Breitbart News Daily: Paul Ryan's Budget and America's Demise | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On the December 21, Breitbart News Daily show, on Sirius XM Patriot channel 125 from 6AM to 9AM EST, host and Breitbart News Executive Chairman Stephen K. Bannon will interview a number of guests and talk about the Democrat presidential debate, Paul Ryan’s omnibus bill, and the threat of radical Islam among other important current events.\nHarvard Law School professor Larry Lessig will be interviewed about the Democratic debate, and Bernie Sanders lawsuit against the DNC. Lessig most recently wrote, Republic, Lost: The Corruption of Equality and the Steps to End It.\nDirector of Communications and Public Education of the Parents Television Council, Melissa Henson, will come on the show to talk her Breitbart News article on the poor state of television programming for children.\nInez Feltscher, the Director of the Education and Workforce Task Force at the American Legislative Exchange Council, will be interviewed about her Breitbart News article on how the recent omnibus bill failed to reauthorize one of America’s most successful school choice programs.\nBannon will interview anti-illegal immigration leader Maria Espinoza.\nBreitbart News’ Jerome Hudson will talk about his article a Black Lives Matter Leader being silent on the death of hero Zaevion Dobson.\nBreitbart News’ Dr. Susan Berry will talk about a Muslim group in Georgia characterizing criticism of their group as attacks.\nBreitbart News’ Michael P. Leahy will come on the show to talk about the latest in Virginia’s Islamic school lesson controversy.\nBreitbart Texas’ Merill Hope will come on the program to talk about the terror threats across Texas.\nThe program is the first live, conservative radio enterprise to air seven days a week. Sirius XM Vice President for news and talk Dave Gorab called the show “the conservative news show of record.”\nFollow Breitbart News on Twitter for live updates during the show. Listeners may call into the show at: 866-957-2874.","url":"https://www.breitbart.com/politics/2015/12/20/breitbart-news-daily-paul-ryans-budget-and-americas-demise/"}
