{"authors":["Breitbart News"],"date_download":"2018-10-30 19:55:04","date_modify":"2018-10-30 19:55:04","date_publish":"2016-06-27 02:07:14","description":"On the Monday edition of Breitbart News Daily, broadcast live on SiriusXM Patriot Channel 125 from 6AM to 9AM EST, Breitbart Executive Chairman Stephen K. | Radio","filename":"data/vaneerConsumption/BreitbartNewsDailyEliteGlobalismvsPopulistNationalism.json","image_url":"https://media.breitbart.com/media/2016/05/Radio-Daily2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/radio_2016_06_26__1540929304.html","title":"Breitbart News Daily: Elite Globalism vs. Populist Nationalism","title_page":"Breitbart News Daily: Elite Globalism vs. Populist Nationalism | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On the Monday edition of Breitbart News Daily, broadcast live on SiriusXM Patriot Channel 125 from 6AM to 9AM EST, Breitbart Executive Chairman Stephen K. Bannon will continue to break down the aftermath of the Brexit vote and what it means for populist/nationalist movement in the November election.\nHe’ll be joined by Breitbart London editor Raheem Kassam and Breitbart Editor in Chief Alex Marlow.\nSpecial guests include Paul Nehlen, the Wisconsin businessman and Congressional candidate challenging Speak Paul Ryan, who will discuss the Brexit vote and TPP.\nBreitbart’s Legal Editor Ken Klukowski will discuss the latest Supreme Court rulings.\nLive from London, Rome, and Jerusalem, Breitbart correspondents will provide updates on the latest international news.\nBreitbart News Daily is the first live, conservative radio enterprise to air seven days a week. SiriusXM Vice President for news and talk Dave Gorab called the show “the conservative news show of record.”\nFollow Breitbart News on Twitter for live updates during the show. Listeners may call into the show at: 866-957-2874.","url":"https://www.breitbart.com/radio/2016/06/26/breitbart-news-daily-elite-globalism-vs-populist-nationalism/"}
