{"authors":["Associated Press"],"date_download":"2018-10-23 03:18:09","date_modify":"2018-10-23 03:18:09","date_publish":"2016-01-28 18:42:25","description":"MECHANICSBURG, Pa. (AP) — A fire has destroyed a central Pennsylvania home where Poison lead singer Bret Michaels once lived as a child. Upper Allen Township...","filename":"data/vaneerConsumption/BretMichaelschildhoodhomedestroyedinfire7escape.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:d9e32a2990f348c1a56453fb428886fd-2vdWmEltwXfba0ce28e632bb195e-65_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420438_Bret-Michaels-childhood-home-destroyed-fire-7-escape_1540264689.html","title":"Bret Michaels' childhood home destroyed in fire, 7 escape","title_page":"Bret Michaels' childhood home destroyed in fire, 7 escape | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bret Michaels' childhood home destroyed in fire, 7 escape\nMECHANICSBURG, Pa. (AP) — A fire has destroyed a central Pennsylvania home where Poison lead singer Bret Michaels once lived as a child.\nUpper Allen Township Fire Chief Jim Salter says firefighters had trouble battling the Mechanicsburg fire Wednesday afternoon because nearby hydrants were buried in snow.\nFive children and two adults were able to escape safely. Salter says one family member was taken to a hospital for an evaluation.\nFILE - In this Oct. 27, 2011 file photo, Poison frontman Bret Michaels talks about the designs for a music room he will be funding and decorating at St. Joseph's Hospital and Medical Center Barrow Neurological wing in Phoenix. A fire has destroyed a central Pennsylvania home where Michaels once lived as a child. Upper Allen Township Fire Chief Jim Salter says firefighters had trouble battling the Mechanicsburg fire Wednesday, Jan. 27, 2016 because nearby fire hydrants were buried in snow. Mechanicsburg is about 8 miles southwest of Harrisburg, Pennsylvania¿s capitol. (AP Photo/Ross D. Franklin)\nAn official with Bret Michaels Entertainment tells The Sentinel of Carlisle (http://bit.ly/1NCnCzK ) says the singer lived at the house between the ages of six and 17.\nFirefighters say a cooking accident is thought to have ignited the blaze at the ranch-style home.","url":"https://www.dailymail.co.uk/wires/ap/article-3420438/Bret-Michaels-childhood-home-destroyed-fire-7-escape.html"}
