{"authors":["Molly Longman"],"date_download":"2018-10-31 01:46:56","date_modify":"2018-10-31 01:46:56","date_publish":"2018-09-06 15:11:58","description":"The information available about Supreme Court nominee Brett Kavanaugh just got more interesting. The New York Times obtained a leaked email about Roe v. Wade by Kavanaugh where he challenged the accuracy of a statement that the abortion rights…","filename":"data/vaneerConsumption/BrettKavanaughsEmailAboutRoeVWadeIsRaisingQuestionsAtHisHearing.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/6/10c21d64-534c-4023-8e34-71814cdcc04b-getty-1027351346.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_brett-kavanaughs-email-about-roe-v-wade-is-raising-questions-at-his-hearing-11774030_1540950416.html","title":"Brett Kavanaugh's Email About Roe V. Wade Is Raising Questions At His Hearing","title_page":"Brett Kavanaugh's Email About Roe V. Wade Is Raising Questions At His Hearing","title_rss":"NULL","source_domain":"bustle.com","text":"The information available about Supreme Court nominee Brett Kavanaugh just got more interesting. The New York Times obtained a leaked email about Roe v. Wade by Kavanaugh where he challenged the accuracy of a statement that the abortion rights decision was “settled by law of the land.” The email was from March 2003, during his time serving as White House lawyer in the Bush administration. Sen. Dianne Feinstein pressed Kavanaugh on the abortion-related email during the hearings on Thursday morning.\nThe email in question had to do with Kavanaugh’s note about a draft opinion piece that Bush officials wanted to persuade anti-abortion women to submit under their names, The Times reported. The draft said: “It is widely accepted by legal scholars across the board that Roe v. Wade and its progeny are the settled law of the land.”\nKavanaugh then proposed via email that they should delete the line. According to The Times, he wrote: “I am not sure that all legal scholars refer to Roe as the settled law of the land at the Supreme Court level since Court can always overrule its precedent, and three current Justices on the Court would do so.”\nOn Thursday morning, Feinstein asked Kavanaugh about the email. \"Do you believe Roe v. Wade is correctly settled?\" Feinstein asked.\n\"It was referring to the view of legal scholars,” Kavanaugh said. \"The broader point is simply that I think it was overstating something about legal scholars and I'm always concerned with accuracy.”\nHe went on to call Roe v. Wade “an important precedent” that’s been “reaffirmed many times.” He referred to several cases such as Planned Parenthood v. Casey that have reaffirmed and set precedent for the law.\nKavanaugh mentioned then-Justices William Rehnquist and Antonin Scalia, who each had dissented in the 1992 Planned Parenthood v. Casey case.\nThe email doesn't say whether or not Kavanaugh personally believes that the abortion rights precedent should be \"settled law of the land.\"\nOne of President George W. Bush’s lawyers turned over thousands of documents over to the Senate Judiciary Committee for the confirmation hearings, and this email was one of them. The emails were supposed to be kept confidential and not discussed by Senate members during Kavanaugh’s confirmation hearings. But things have a way of getting out, and after an unknown source provide the emails to The Times late Wednesday — here we are.\nMany Democrats — such as Sen. Kamala Harris, who'd questioned Kavanaugh about abortion at length late Wednesday — drew some conclusions from the wording of the email.\n\"Now the American people know what we know. We have every reason to believe Kavanaugh will overturn Roe v. Wade,\" Harris tweeted.\nThere are about 189,000 other documents that Judiciary Committee Chairman Chuck Grassley, an Iowa Republican, has deemed \"committee confidential,\" The Huffington Post reported. Democrats have begrudged this fact, and have fought over how many documents regarding the Kavanaugh's time in the Bush White House will be released. They're also not happy about the fact that many documents provided to the Senate came from a Bush lawyer, rather than the National Archives, The Times reported.\nAs the Senate takes the heat up a notch as they grill Kavanaugh at his hearings, the leaking of this document and others can only mean more protests and more leading questions from Democrats.","url":"https://www.bustle.com/p/brett-kavanaughs-email-about-roe-v-wade-is-raising-questions-at-his-hearing-11774030"}
