{"authors":["Press Association"],"date_download":"2018-10-23 01:16:43","date_modify":"2018-10-23 01:16:43","date_publish":"2017-03-16 11:08:29","description":"Invoking Article 50 will start the clock on a two-year countdown to Britain leaving the European Union.","filename":"data/vaneerConsumption/BrexitBillgrantedroyalassentgivingPMpowertotriggerArticle50.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/13/wire-228665-1489671492-626_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4319740_Brexit-Bill-granted-royal-assent-giving-PM-power-trigger-Article-50_1540257403.html","title":"Brexit Bill granted royal assent giving PM power to trigger Article 50","title_page":"Brexit Bill granted royal assent giving PM power to trigger Article 50 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Theresa May has been given the legal power to start Brexit talks after the Queen granted royal assent to the Article 50 Bill.\nSpeaker John Bercow told MPs that the European Union (Notification of Withdrawal) Bill, which was passed by MPs and peers on Monday, had received its final sign off, prompting cheers from the Conservative benches.\nMrs May has said she will invoke Article 50, the legal mechanism for withdrawal from the EU, by the end of the month in what will be a “defining moment” for the country.\nIt's on. PM will trigger Article 50 by the end of the month, starting two-year countdown to Brexit. https://t.co/PU6KT5YVPI — David Hughes (@DavidHughesPA) March 16, 2017\nThis will start the clock on a two-year countdown to Britain leaving the EU and launch the country into what are set to be the most complicated negotiations since the Second World War.\nBritain’s future trading relationship with the bloc and any exit bill which it may have to pay are both set to be highly contentious issues in the forthcoming negotiations.\nThe Queen has granted royal assent to the Article 50 Bill\nThe Government managed to get the two-clause Bill through Parliament unamended despite opposition from the House of Lords after a threatened Tory rebellion in the Commons fizzled out.\nLabour has vowed to continue the battle to guarantee the rights of EU nationals living in the UK and give Parliament a meaningful vote on the deal, despite failing to get these pledges attached to the Bill and on to the statute book.\nDelighted to be in Chamber of @HouseofCommons as Speaker announces Royal Assent has been given to Brexit Bill — David Nuttall (@DNuttall) March 16, 2017\nAfter 9 months of delays, every obstacle to Article 50 has been removed. Can we now please get on with it! — Nigel Farage (@Nigel_Farage) March 13, 2017\nThe party has tabled two new motions to be debated in the Lords at the end of this month.\nThe first, tabled by Baroness Hayter of Kentish Town, would require a minister to report back to peers at an early stage on the progress being made in guaranteeing the rights of EU nationals.\nThe second, tabled by Labour Lords leader Baroness of Smith of Basildon, demands the establishment of a joint committee of the Commons and the Lords “to consider and report on the terms and options” for a vote in Parliament on the Brexit deal.","url":"https://www.dailymail.co.uk/wires/pa/article-4319740/Brexit-Bill-granted-royal-assent-giving-PM-power-trigger-Article-50.html"}
