{"authors":["Lianna Brinded"],"date_download":"2018-10-30 20:53:33","date_modify":"2018-10-30 20:53:33","date_publish":"2016-12-24 00:00:00","description":"An expert pointed out that Britain is most likely to be liable for pension payouts even in light of a 'hard brexit.'","filename":"data/vaneerConsumption/BrexitreportBritainpayingformerEUworkerspensionsdespiteBrexit.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_brexit-report-britain-paying-former-eu-workers-pensions-despite-brexit-2016-12_1540932813.html","title":"Brexit report: Britain paying former EU workers pensions despite Brexit","title_page":"    Brexit report: Britain paying former EU workers pensions despite Brexit - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters LONDON — Britain could still be forced to pay the pensions of former workers of the European Union despite Brexit.\nThat's according to Professor Iain Begg from the LSE's European Institute. Professor Begg made the prediction in a new report titled \"Brexit: Six months on,\" which was jointly released by The UK in a Changing Europe and the Political Studies Association this week.\nIn a section entitled \"The EU budget and public finances\" he warned that contributions to the EU — despite Britain leaving the EU — is going to be the most \"toxic\" issue during upcoming talks and said the UK will still be forced to fork out billions of pounds in pensions to former EU workers.\nHere is a key excerpt from his passage in the report (emphasis ours):\n\"...the German Finance Minister has hinted that such payments could last until 2030, although beyond 2023 any lingering payments would be small, so his warning is exaggerated. These are transitional problems which will gradually fade, although the UK could remain liable indefinitely for a proportion of the pensions of former employees of EU institutions.\n\"All these issues will be part of the Article 50 negotiations. While the implications are relatively insignificant in macroeconomic terms - the question of who pays for a few billion of pension liabilities is trivial compared to broader issues relating to the single market, trade, the City and migration - there is obvious potential for these issues to become high-profile politically, further complicating an already difficult negotiation. Moreover, in 2018 the rest of the EU will start negotiations on its next seven-year budget deal, a process that invariably becomes very fractious.\"\nEU officials have repeatedly said that the UK will face a £50 billion ($62.1 billion) bill as soon as Prime Minister Theresa May triggers Article 50 and starts the official two-year Brexit negotiation process.\nThe figure is derived from the fact that the UK has to keep contributing to the EU budget until the end of 2020, as well as meet \"outstanding pensions liabilities, and other payments associated with loan guarantees.\" Begg says in the \"Brexit: Six months on\" report:\n\"Figures emerging from the European Commission negotiating team suggest the [obligated EU contributions] bill could be as high as €60 billion (around £50 billion). Ironically, some UK beneficiaries from EU programmes will contribute to this problem: a professor at a British university securing one of the prestigious European Research Council grants in 2017, lasting the usual five years, could expect funding until 2022.\n\"This could mean cash flow from the UK to the EU not only for the duration of the 2014-20 period, but — because beneficiaries can still claim for EU regional development projects three years after the end of the budget planning period — well into the 2020s, and thus a new UK Parliament.\"\nBritain voted for a Brexit by a slim majority on June 23 and, since then, there has been much speculation on when the new prime minister, Theresa May, will trigger Article 50. March 2017 is the current target date but a Supreme Court case will rule in January 2017 whether she will have to get permission from parliament to do this. This could slow things down.\nMay says she will not give a \"running commentary\" on how negotiations are going but she has made it clear in various speeches that her government is prioritising immigration restrictions. This would imply a \"hard Brexit\" because the EU's official line is that it will not allow the UK to curb immigration and keep membership of the single market at the same time.","url":"https://www.businessinsider.com/brexit-report-britain-paying-former-eu-workers-pensions-despite-brexit-2016-12"}
