{"authors":["Lianna Brinded"],"date_download":"2018-10-30 20:55:38","date_modify":"2018-10-30 20:55:38","date_publish":"2016-12-22 00:00:00","description":"Economic experts Professor Iain Begg and NIESR's Jonathan Portes warn in a new report that Britain has not shrugged off the Brexit impact just yet.","filename":"data/vaneerConsumption/BrexitanalysisbyacademicexpertsUKeconomyspendingGDPjobsinflation.json","image_url":"https://amp.businessinsider.com/images/585c6940dd089571208b4a01-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_brexit-analysis-by-academic-experts-uk-economy-spending-gdp-jobs-inflation-2016-12_1540932938.html","title":"Brexit analysis by academic experts: UK economy, spending, GDP, jobs, inflation","title_page":"    Brexit analysis by academic experts: UK economy, spending, GDP, jobs, inflation - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Wile E Coyote, outsmarted yet again by the Road Runner. Warner Bros. LONDON — The effects of Britain voting to leave the European Union may have not fully hit the economy just yet, but two economic experts warn in a new report that the country could feel damaging effects soon.\nIn the report jointly launched by The UK in a Changing Europe and Political Studies Association on Friday, titled \"Brexit: Six months on,\" two experts likened the highly plausible and impending negative economic impact to a famous cartoon.\nHere is the key passage from Professor Iain Begg at the LSE European Institute and Jonathan Portes, a research fellow at the National Institute of Economic and Social Research (emphasis ours):\n\"The small cut in interest rates in August and the limited boost to spending recently announced by the Treasury are unlikely, on their own, to have induced higher consumer spending, but they arguably boosted economic prospects by underpinning business and consumer confidence.\n\"However, most forecasters (including the OBR) ... predict that in the short term the main impact of the pro-Brexit vote will be via the exchange rate: the fall in sterling will boost exports (and reduce imports), supporting growth, but it will also lead to a significant rise in inflation, which will reduce real wages and depress real consumer spending.\n\"Growth will slow, although the probability of a recession in the short term remains low. Unemployment may rise, although not rapidly. It would thus be bold to claim that the economy has already shrugged off the referendum.\n\"It may have — but the alternative image that comes to mind is of Wile E Coyote, legs spinning furiously as he speeds off the cliff before realising that there is nothing but air beneath him. Once again, this is the central view; there are, as always, risks to both the upside and downside.\"\nWile E Coyote always falls to earth in the Loony Tunes shorts and Begg and Portes' point is that Britain may similarly face a sharp economic shock around the corner as the realities of Brexit Britain began to bite real wages and growth.\nWhen Britain voted to leave the European Union on June 23, economists almost universally predicted one thing — a technical recession within a couple of years, as the UK adjusts to realities of leaving the EU.\nBy September, virtually every major institution had rowed back on forecasts, following a slew of better than expected economic data coming out of the country.\nOne bank, Barclays, remained staunch in its belief that a recession was coming, arguing until the start of November that Britain would tumble into its first recession since the financial crisis in 2017 as the impact of Brexit takes hold. But it has now upped its expectations.","url":"https://www.businessinsider.com/brexit-analysis-by-academic-experts-uk-economy-spending-gdp-jobs-inflation-2016-12"}
