{"authors":["Breitbart London"],"date_download":"2018-10-30 22:03:11","date_modify":"2018-10-30 22:03:11","date_publish":"2017-02-20 09:30:27","description":"Britain's House of Lords is to begin debating a bill empowering Prime Minister Theresa May to kickstart Brexit -- a potentially tricky test given her Conservatives do not hold a majority there.","filename":"data/vaneerConsumption/BrexitBillSetforRoughRideThroughHouseofLords.json","image_url":"https://media.breitbart.com/media/2016/11/GettyImages-532098874-e1478261729472.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_02_20__1540936991.html","title":"Brexit Bill Set for Rough Ride Through House of Lords","title_page":"Brexit Bill Set for Rough Ride Through House of Lords","title_rss":"NULL","source_domain":"breitbart.com","text":"LONDON (AFP) – Britain’s House of Lords is to begin debating a bill empowering Prime Minister Theresa May to kickstart Brexit — a potentially tricky test given her Conservatives do not hold a majority there.\nDiscussions in the unelected upper house of parliament get underway after the lower House of Commons overwhelmingly approved the draft legislation earlier this month.\nThe bill gives May the right to trigger Article 50 of the European Union’s Lisbon Treaty, the formal procedure to start negotiations on leaving the bloc.\nThe government presented the short bill after losing a high-profile court battle in which judges ruled May must consult parliament before beginning divorce proceedings with Brussels.\nThe legislation sailed through the Commons this month by 494 votes to 122.\nBut the government could face greater challenges in the Lords, where only 252 of the more than 800 members are Conservatives.\nPeers are proposing changes to the bill that include measures to guarantee the rights of EU nationals in Britain, and defining how parliament votes on a final Brexit deal.\nPeter Mandelson, a peer with the opposition Labour party and former European commissioner, said there was a “strong body of opinion” on the seriousness of the two issues.\nBut he doubted the unelected chamber — whose members are appointees, many of them career politicians — would seek to derail the Brexit bill entirely.\n“At the end of the day, the House of Commons must prevail because it is the elected chamber,” Mandelson told BBC television on Sunday.\n“But I hope the House of Lords will not throw in the towel early.”\n– March deadline –\nAhead of the debate, Justice Minister Liz Truss said the upper house should support the outcome of the June referendum in which 52 percent of voters opted to leave the EU, sending shockwaves around Europe.\n“The British people voted for that, they were clear in the referendum and the House of Lords now needs to get on with it,” Truss told the BBC.\nHer view was echoed by Conservative MP Dominic Raab, who warned that voters would not look kindly on unelected peers seeking to block the Brexit bill.\n“Peers would be wise to consider this clear democratic mandate, and their own futures, when debating the Article 50 Bill this week,” he said.\nThe Lords will debate the bill on Monday and Tuesday, before two further days of discussions next week and the final reading scheduled for March 7.\nIf they vote to amend the bill it will pass back to the Commons for further debate, drawing the process out further.\nBut Brexit minister David Davis said he expects the government to meet its self-imposed deadline of triggering Article 50 by the end of next month.\n“I expect it to be resolved in good time before the end of March,” Davis told a news conference in Stockholm on Tuesday.\n“So I’m confident we’ll do it before our timetable.”","url":"https://www.breitbart.com/europe/2017/02/20/brexit-bill-set-rough-ride-house-lords/"}
