{"authors":["Lianna Brinded"],"date_download":"2018-10-30 21:55:07","date_modify":"2018-10-30 21:55:07","date_publish":"2016-12-16 00:00:00","description":"Britain will have to pay around €50-60 billion (£42 billion-£50 billion) to settle 'outstanding liabilities.'","filename":"data/vaneerConsumption/BrexitEUtochargeBritain50billionwhenArticle50istriggered.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_brexit-eu-to-charge-britain-50-billion-when-article-50-is-triggered-2016-12_1540936507.html","title":"Brexit: EU to charge Britain £50 billion when Article 50 is triggered","title_page":"    Brexit: EU to charge Britain £50 billion when Article 50 is triggered - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Michel Barnier, Chief Negotiator for the Preparation and Conduct of the Negotiations with the United Kingdom under Article 50 of the Treaty on European Union. Reuters LONDON — Britain will be given a £50 billion ($62.1 billion) bill as soon as Prime Minister Theresa May triggers Article 50 and starts the official two-year Brexit negotiation process.\nThat is according to one of the European Union's chief Brexit negotiators, Michel Barnier, and other EU officials, says Sky News.\nSky News cited Barnier as saying that Britain will have to pay around €50 billion-€60 billion (£42 billion-£50 billion) to settle \"outstanding liabilities.\" He has allegedly already mentioned the figure to EU leaders in recent weeks and in a meeting with 27 EU leaders last month.\nAnother source told Sky News: \"We were told €50 billion-€60 billion. We were told informally at sherpa level.\"\nThe figure is believed to be derived from the fact that the UK has to keep contributing to the EU budget until the end of 2020, as well as meet \"outstanding pensions liabilities, and other payments associated with loan guarantees.\"\nIt has been widely reported that the EU will serve Britain a Brexit bill and the Sky News report only reinforces that the bloc is set on enacting it when Article 50 is triggered. In November, t he Financial Times was briefed by senior EU negotiators on plans for talks with Britain once Article 50 is triggered, which begins the official process of Britain leaving the 28-nation bloc. Those sources mentioned a hefty Brexit bill too.\nLast month, European negotiators said they are unwilling to discuss transition arrangement or trade deals until a divorce settlement is reached, by mid-2018 at the latest. If Article 50 is triggered early next year, as Theresa May has signalled, this would leave Britain with just 6 months to negotiate a transition and trade deal.\nBritain voted for a Brexit by a slim majority on June 23 and, since then, there has been much speculation on when the new prime minister, Theresa May, will trigger Article 50. March 2017 is the current target date but a Supreme Court case will rule in January 2017 whether she will have to get permission from parliament to do this. This could slow things down.\nMay says she will not give a \"running commentary\" on how negotiations are going but she has made it clear in various speeches that her government is prioritising immigration restrictions. This would imply a \"hard Brexit\" because the EU's official line is that it will not allow the UK to curb immigration and keep membership of the single market at the same time.","url":"https://www.businessinsider.com/brexit-eu-to-charge-britain-50-billion-when-article-50-is-triggered-2016-12"}
