{"authors":["Press Association"],"date_download":"2018-10-22 22:32:19","date_modify":"2018-10-22 22:32:19","date_publish":"2016-01-11 03:18:43","description":"David Cameron has insisted a British exit from the EU is not \"the right answer\" as he said he was \"close\" to securing a renegotiation deal. The Prime Ministe...","filename":"data/vaneerConsumption/Brexitnottherightanswersayspminsistingheisclosetosecuringdeal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-b277c981-1d82-4adb-b77d-304e55a351f9-3bWLCvS3pZb5eb4fce05c5f88f60-23_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3392487_Brexit-not-right-answer-says-PM-insisting-close-securing-deal_1540247539.html","title":"Brexit not 'the right answer' says pm, insisting he is 'close' to securing deal","title_page":"Brexit not 'the right answer' says pm, insisting he is 'close' to securing deal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Brexit not 'the right answer' says PM, insisting he is 'close' to securing deal\nDavid Cameron has insisted a British exit from the EU is not \"the right answer\" as he said he was \"close\" to securing a renegotiation deal.\nThe Prime Minister made clear that his preference was to hold an in-out referendum on reformed membership terms this summer - but hinted he could delay it until next year if a new package is not finalised in the coming weeks.\nHe also refused to rule out applying restrictions on in-work benefits to young Britons in a bid to stop the \"almost unnatural draw\" of the UK's welfare system for European migrants.\nPrime Minister David Cameron appearing on the BBC One current affairs programme, The Andrew Marr Show.\nIn an interview on the BBC's Andrew Marr Show, Mr Cameron was asked whether the Government was preparing contingency plans for a so-called Brexit.\n\"I don't think that is the right answer for the reasons I have given. Were that to be the answer we would need to do everything necessary to make that work,\" he said.\n\"The civil service are working round the clock to support my negotiation.\"\nMr Cameron said he was \"confident we can get a good outcome\" from the haggling with EU counterparts, and he still \"hoped\" a package could be finalised by the next Brussels summit on February 18.\nIf that timetable slipped the referendum may be delayed from summer and could take place \"later\" than September, he indicated.\nMr Cameron said his proposal of a four-year ban on in-work benefits for migrants - viewed as the toughest element to secure - was \"still on the table\", but he was open to any alternative that would be \"equally powerful\".\nAsked if there could be a compromise where Britons were also subject to the restriction and then compensated with a \"social\" payment, Mr Cameron replied: \"I am in the middle of a negotiation. I have got hard work to do and when I have an announcement to make I will make it.\"\nThe Prime Minister also said he would not resign if the country voted for the UK to leave the EU.\nMr Cameron said it had \"always been my intention\" to allow Eurosceptic ministers to campaign for Brexit in a \"personal\" capacity.\nStressing that he had not ruled out supporting an \"out\" vote if his renegotiation goals were not achieved, he said: \"Obviously I want to have as many people supporting the side that I am on, whatever side that is when the time comes.\n\"The Government is not going to be neutral on this issue, with people on one side or the other. My intention is that at the conclusion of the negotiation the Cabinet has a discussion and reaches a clear recommendation to the British people of what we should do. I hope that will be staying in a reformed EU.\"\nMr Cameron said he was aiming to change the things about the EU that drove the public \"up the wall\".\n\"At the moment our welfare system acts as an extra additional, almost unnatural draw for people to come to Britain and we need to be able to address that,\" he said. \"We have a welfare system, unlike many in Europe, that you have immediate access to and it is that that creates many of the difficulties.\"\nHe added: \" I think the best answer for Britain is to stay in a reformed EU if we can get those changes.\"\nMr Cameron said the \"prize\" of an improved membership package was \"closer than it was\".\n\"I am hopeful of a deal in February and if we do that we can go ahead and hold the referendum,\" he said.\nAsked if that meant the referendum could take place in the summer, Mr Cameron said: \"That is what I would like to see, a deal in February and then a referendum that would follow.\"\nResponding to the suggestion that failure to get a deal at the next EU summit would mean the referendum being delayed until September, Mr Cameron said: \"Or later. I have to have this referendum by the end of 2017. To me the substance matters much more than the timing, so if I can't get the right deal in February I will wait and I will keep going.\"\nMr Cameron said the Government had already made clear that parliament was sovereign, and that would be the case whether or not the UK remained in the EU.\n\"If we need to reaffirm that even more, if we need to put that up in lights - absolutely happy to do so,\" he said.\nTory backbencher David Davis told the BBC's Sunday Politics he expected up to half the parliamentary party and \"five or six\" Cabinet ministers to campaign for Brexit.\nHe also called the lack of planning for the UK leaving the EU \"disgraceful\".\n\"This is actually disgraceful. Because you know, you've got two moderately likely outcomes, we don't know which it will be,\" he said.\nMatthew Elliott, chief executive of Vote Leave, said: \" Cameron has never asked for serious changes from the EU, he gave up before he started. He's asked for trivia and he'll get everything he's asked for.\n\"It's spin and nobody should believe him. If you want British laws to be made by people you can vote out, the only way is to Vote Leave and take back control.\"","url":"https://www.dailymail.co.uk/wires/pa/article-3392487/Brexit-not-right-answer-says-PM-insisting-close-securing-deal.html"}
