{"authors":["Oliver Jj Lane"],"date_download":"2018-10-30 22:01:47","date_modify":"2018-10-30 22:01:47","date_publish":"2018-07-09 09:53:07","description":"Dominic Raab has been chosen as the replacement for David Davis, the senior Brexiteer who stood down from his position as Brexit Secretary.","filename":"data/vaneerConsumption/BrexitSupportingDominicRaabChosenasNewBrexitSecretaryAfterDavidDavisResignation.json","image_url":"https://media.breitbart.com/media/2018/07/Dominic-Raab-Getty.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_07_09__1540936907.html","title":"Brexit-Supporting Dominic Raab Chosen as New Brexit Secretary After David Davis Resignation","title_page":"Brexit-Supporting Dominic Raab Chosen as New Brexit Secretary After David Davis Resignation | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Commons Committee on Exiting the European Union member and housing minister Dominic Raab has been chosen as the replacement for David Davis, the senior Brexiteer who stood down from his position as Brexit Secretary in Theresa May’s cabinet Sunday evening.\nFormer lawyer Raab, who has been Housing Minister since January and was a Justice Minister in 2017 was chosen to become Brexit Secretary Monday morning after Brexiteer David Davis stood down, stating it was not “plausible” that he be able to defend the government’s Brexit strategy.\nSpeaking Monday morning, Mr Davis said the Prime Minister’s plan would hand a “sword of Damocles” to the European Union, which they could dangle over the House of Commons. The effect of this, he said, would be ” illusory rather than real [power]. It’s painting something as returning sovereignty, returning control to the House of Commons but in practice it isn’t doing so.”\nUPDATE: 'David Davis says European Union will wield 'Sword of Damocles' over Britain in May's plan' https://t.co/3LmYuEC7s2 — Breitbart London (@BreitbartLondon) July 9, 2018\nIncoming Brexit Secretary Dominic Raab was a known face in the Vote Leave campaign during the Brexit referendum and has since spoken out in support of the “clear mandate” given by the British people for the UK to “take back control of our borders, laws, money and trade.”\nDespite his previous comments, the fact that Mr Raab has been chosen to lead the Department for Leaving the EU suggests he may have to renege on those principles, as Theresa May’s plan would not entail regaining many of those powers.\nThe selection of Raab has, however, angered those in favour of Britain staying in the European Union. Prominent Labour MP Chuka Umunna dismissed the choice as “replacing one hard Brexiteer with another”.\nThis story is developing\nOliver JJ Lane is the editor of Breitbart London — Follow him on Twitter and Facebook","url":"https://www.breitbart.com/europe/2018/07/09/brexit-supporting-dominic-raab-chosen-as-new-brexit-secretary-after-david-davis-resignation/"}
