{"authors":["Brian Viner For The Daily Mail"],"date_download":"2018-10-22 22:38:45","date_modify":"2018-10-22 22:38:45","date_publish":"2017-03-10 01:09:44","description":"'It is testament to Isabelle Huppert’s memorable performance in Elle that she was not only a nominee this year, but was considered a viable rival to the eventual winner, Emma Stone'","filename":"data/vaneerConsumption/BrianVinerreviewsdisturbingFrenchnailbiterElle.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/01/3E01A23100000578-0-image-a-76_1489108091260.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299652_Brian-Viner-reviews-disturbing-French-nail-biter-Elle_1540247925.html","title":"Brian Viner reviews disturbing French nail-biter Elle","title_page":"Brian Viner reviews disturbing French nail-biter Elle | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Elle (18)\nRating:\nNot many women down the years have received a Best Actress nomination at the Academy Awards for a performance in a foreign-language film. And only two have gone on to lift the Oscar: Sophia Loren in 1962, and Marion Cotillard in 2008.\nSo it is testament to Isabelle Huppert’s memorable performance in Elle that she was not only a nominee this year, but was considered a viable rival to the eventual winner, Emma Stone.\nHad she won, there would have been few complaints; she gives a brilliant but disturbing portrayal of a woman who, in the film’s opening scene, is violently raped by a masked man on the parquet floor of her own handsome Paris apartment.\n'It is testament to Isabelle Huppert’s (pictured) memorable performance in Elle that she was not only a nominee this year, but was considered a viable rival to the eventual winner, Emma Stone'\nThis is Michele Leblanc, the well-heeled boss of a video-games company, a tough divorcee whose composed demeanour seems barely ruffled by the attack. To the audience, her equilibrium comes as a challenge. Rape in the movies, as in the real world, tends to leave lives shattered. But Michele’s still seems entirely together. The only threats to her sang-froid come from her ineffectual son, who has a domineering, pregnant girlfriend, and from her embarrassing, elderly mother, planning to marry her gigolo boyfriend.\nThen another threat materialises, in the form of a series of sinister texts from the unknown rapist, although even these Michele takes in her calculating stride. By now we have also learnt something else about her; that she is the daughter of one of France’s most notorious serial killers, still languishing in jail.\nSo to understand how she ticks there is quite a psychological jigsaw to piece together, but veteran Dutch director Paul Verhoeven, showing a mastery of tension that recalls one of his best films, 1992’s Basic Instinct, never overlooks the most heart-thumping question of all: who is the mysterious assailant? Is it her ex-husband? Her lover? One of her employees? The dishy neighbour with the devout wife? A stranger? And once she knows his identity, how will she get even?\nElle has been lauded by some as a work of genius, and certainly Verhoeven and his screenwriter David Birke, working from a novel by Phillipe Dijan, very cleverly keep us from wholly rooting for Michele even as we yearn for revenge. Her own best-selling video game features a nasty rape scenario, and she is brazenly having an affair with the husband of her business partner and best friend. She is not a likeable woman.\nBut there is a further layer of dubious morality about this film that I found uncomfortable. It has been hailed as a feminist story of female empowerment in a male-dominated world, but its particular attitude to rape seems to me more of a male than a female fantasy. It has also been described as a comedy, but I can’t say I found it even slightly amusing. Its one overt stab at humour – when Michele’s son doesn’t realise that his girlfriend’s black baby might not be his - is discordantly silly.\nOn the other hand, there can be no denying that Elle is intriguing, unpredictable and gripping. It also has the wonderful Isabelle Huppert in towering form. That should be recommendation enough.","url":"https://www.dailymail.co.uk/news/article-4299652/Brian-Viner-reviews-disturbing-French-nail-biter-Elle.html"}
