{"authors":["John Nolte"],"date_download":"2018-10-30 20:04:19","date_modify":"2018-10-30 20:04:19","date_publish":"2015-02-07 20:39:44","description":"UPDATE: A blogger who goes by the name of SooperMexican was the first to report this discrepancy.  Per this CNN Money report, a Brian Williams' Katrina |","filename":"data/vaneerConsumption/BrianWilliamsFromHeardOfToWeWatchedKatrinaSuperdomeSuicide.json","image_url":"https://media.breitbart.com/media/2015/02/ss-141126-brian-williams-19-550x367.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_02_07__1540929859.html","title":"Brian Williams: From 'Heard' Of To 'We Watched' Katrina Superdome Suicide","title_page":"Brian Williams: From 'Heard' Of To 'We Watched' Katrina Superdome Suicide | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"UPDATE: A blogger who goes by the name of SooperMexican was the first to report this discrepancy.\nPer this CNN Money report, a Brian Williams’ Katrina tale appears to have evolved somewhat dramatically over the course of just one year. In 2005, Williams reported in a documentary that he had “heard the story” of a man killing himself in the Superdome. The following year, during an interview with Tom Brokaw at Columbia Journalism School, Williams said, “We watched, all of us watched, as one man committed suicide.”\nReporters have noted another possible inconsistency in Williams’ reporting in New Orleans — references he has made to a suicide inside the Superdome. In the 2005 documentary “In His Own Words: Brian Williams on Hurricane Katrina,” Williams indicated that he wasn’t a witness to the suicide. “We’d heard the story of a man killing himself, falling from the upper deck,” he said. But in an interview last year at Columbia Journalism School, Williams told his NBC predecessor, Tom Brokaw: “We watched, all of us watched, as one man committed suicide.” Williams was lauded for his coverage of Hurricane Katrina. In the interview at Columbia, Brokaw said the story “elevated” Williams, who had become anchor of “NBC Nightly News” less than a year before the storm.\nThe report does have some good news for the embattled reporter regarding his claim of watching a dead body float past his five-star hotel in the French Quarter. Witnesses in the hotel at the time back up the anchor’s claim that there was deep enough flooding around the hotel for a dead body to float in.\nFollow John Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/the-media/2015/02/07/brian-williams-from-heard-of-to-we-watched-katrina-superdome-suicide/"}
