{"authors":["John Nolte"],"date_download":"2018-10-30 20:04:12","date_modify":"2018-10-30 20:04:12","date_publish":"2015-02-07 16:01:30","description":"The New York Post reports that Brian Williams can't even keep his puppy-saving tales straight. In October of 2011, Williams spoke of the time he saved a |","filename":"data/vaneerConsumption/BrianWilliamsPuppySavingTaleChangedOverTime.json","image_url":"https://media.breitbart.com/media/2015/02/williams.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_02_07__1540929852.html","title":"Brian Williams' Puppy-Saving Tale Changed Over Time","title_page":"Brian Williams' Puppy-Saving Tale Changed Over Time | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The New York Post reports that Brian Williams can’t even keep his puppy-saving tales straight. In October of 2011, Williams spoke of the time he saved a puppy as a teenage volunteer firefighter:\n“I remember one such house fire . . . conducting a search on my hands and knees, when I felt something warm, squishy and furry on the floor of a closet,” Williams said. “I instinctively tucked it in my coat. When I got outside, I saw two small eyes staring up at me, and I returned the 3-week-old and very scared puppy to its grateful owners,” he said.\nAccording to the Post, in 2005, he said he had saved not one but two puppies.\nThis is a small thing but the kind of scrutiny a busted and confessed liar like Brian Williams can expect to face for however much longer his career lasts. Anything he has ever said to puff himself up is going to be checked, double-checked, reported widely and then ridiculed until the sun flames out.\nWilliams repeatedly lied for over a decade about being in a Chinook helicopter that was shot down over Iraq by an enemy RPG. And anyone who has spent any time in the real world knows that a guy who told a self-aggrandizing whopper like that is a guy that almost certainly has and will tell others.\nJohn Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/the-media/2015/02/07/brian-williams-puppy-saving-tales-changed-over-time/"}
