{"authors":["Sarah Mooney For Mailonline"],"date_download":"2018-10-23 02:46:58","date_modify":"2018-10-23 02:46:58","date_publish":"2017-03-10 11:59:58","description":"Emma Meek's dream day was made possible when Cwmbran villagers raised £3,000 to help foot her wedding day bill. The 30-year-old has been diagnosed with a cancerous brain tumour.","filename":"data/vaneerConsumption/Bridewithbraintumourfulfilsdreamofgettingmarried.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E229ECA00000578-0-image-a-26_1489146668997.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4300906_Bride-brain-tumour-fulfils-dream-getting-married_1540262818.html","title":"Bride with brain tumour fulfils dream of getting married","title_page":"Bride with brain tumour fulfils dream of getting married | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Villagers in Cwmbran, Gwent, raised £3,000 to help foot her wedding day bill\nA tragic bride-to-be was given her dream wedding - after kind-hearted villagers chipped in to pay for her big day before she dies.\nEmma Meek, 30, doesn't know how long she has left to live but will 'happily' go to her grave as married woman after villagers raised £3,000 to help foot her wedding day bill.\nThe mother-of-one, from Cwmbran, Gwent, was diagnosed with a cancerous brain tumour in June 2013 and told she had two years to live.\nAfter having radiotherapy and chemotherapy she was given a glimmer of hope - and told she was in remission.\nHowever, she was dealt the devastating blow that her cancer had returned earlier this year, and there was nothing more doctors could do.\nEmma Meek, 30, doesn't know how long she has left to live but will 'happily' go to her grave as married woman\nEmma said of her wedding: 'It was exactly how I had imagined it. It couldn't have gone better'\nEmma said: 'I don't know how long I have left and I don't want to know. I just live in the moment of each day and appreciate every moment I have.'\nNow she has fulfilled her dying wish of marrying her partner Paul Meek, 33, in a dream wedding at Newport Register Office.\nEmma said: 'It was exactly how I had imagined it. It couldn't have gone better.\n'My sister had done a lot of the organising as my memory is terrible. We had a lot of stuff donated to us, like the cake.\n'It was everything I had hoped it would be.'\nEmma fulfilled her dying wish of marrying her partner Paul Meek, 33, at Newport Register Office\nEmma was handed a £3,000 check to help pay for her wedding and reception after the donation from members of Pontypool Round Table.\nChairman Niall James, 29, said: 'We wanted to help Emma after hearing about her.\n'She doesn't know how long she has got left but it could be just months.\n'We wanted to grant her wish and we want to make her last few months as nice as possible.'\nEmma now wants to complete her remaining 'to-do' list including enjoying a family holiday away and a theme park weekend at Alton Towers.\nShe said: 'I have a gorgeous 14 month old baby son, Loki. He is dubbed a miracle child because I was told I would never conceive after having chemotherapy and radiotherapy. He is a ray of sunshine and so beautiful.\nThe couple shared a romantic first dance as husband and wife at their reception\n'Now I want to make some lovely memories with him - I would love to go on holiday. We haven't been on holiday together yet as a family so that would be nice.\n'I also really want to go to Alton Towers. I have never been before and I love the scary rides. I'm a bit of a thrill seeker so that would be ideal.\n'The first thing I asked my doctor when I was told it (the cancer) was coming back was 'can I still go to Alton Towers?' and he said 'whatever you need to do you can do'.'\nEmma and her family are now continuing to raise money towards the cost of her funeral and her family's future.","url":"https://www.dailymail.co.uk/femail/article-4300906/Bride-brain-tumour-fulfils-dream-getting-married.html"}
