{"authors":["Rachel Simon"],"date_download":"2018-10-30 22:52:33","date_modify":"2018-10-30 22:52:33","date_publish":"2014-08-14 17:48:20","description":"Of all the many great friendships between characters in books, the most memorable bonds tend to be the ones created in novels about children: Charlotte and Wilbur; Frodo and Sam; Harry, Ron, and Hermione. The names Jesse and Leslie, though, rarely…","filename":"data/vaneerConsumption/BridgetoTerabithiaTheBelovedYATearJerkerInspiredaSongPlus6OtherThingsYouDidntKnow.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/971c7a04-2f22-4d68-91e7-d0451bf56e15.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35706-bridge-to-terabithia-the-beloved-ya-tear-jerker-inspired-a-song-plus-6-other-things-you-didnt_1540939953.html","title":"'Bridge to Terabithia,' The Beloved YA Tear-Jerker, Inspired a Song, Plus 6 Other Things You Didn't Know","title_page":"'Bridge to Terabithia,' The Beloved YA Tear-Jerker, Inspired a Song, Plus 6 Other Things You Didn't Know","title_rss":"NULL","source_domain":"bustle.com","text":"Of all the many great friendships between characters in books, the most memorable bonds tend to be the ones created in novels about children: Charlotte and Wilbur; Frodo and Sam; Harry, Ron, and Hermione. The names Jesse and Leslie, though, rarely pop up, but fans of Katherine Paterson's Bridge to Terabithia know that no list would be complete without the inclusion of those pre-teen best friends. The author's 1977 novel is beloved by generations for its depiction of friendship, childhood, and the power of imagination, not to mention its heartbreaking ending that at least one adult reader (meaning: me) can attest still manages to elicit tears no matter how many years have passed since that first, life-changing read.\nAnd thanks to decades on middle school reading lists and a 2007 Disney movie, Terabithia breaks more and more hearts every year. It may have been written nearly 40 years ago, but the novel's effects seem only to magnify as reader after reader discovers its magic. Yet like any powerful book, there's still a lot about it that even its most devoted fans might not be aware exists.\nSeven things you didn't know about Bridge to Terabithia:\nIt's — Kind Of – Based Off The Chronicles of Narnia\nClick here to buy.\nFantasy lovers might've noted that the name of Jesse and Leslie's imaginary kingdom, Terabithia, sounds oddly close to Terebinthia, the island featured in C.S. Lewis' The Chronicles of Narnia, and the similarity is no accident — well, sort of. In 2005, Paterson said that she thought she had made the name up, but realized, while re-reading The Voyage of the Dawn Treader, that she'd been inspired by the Lewis creation. Even still, she said, both authors likely got the name from the biblical Terebinth tree, so the Terabithia author isn't entirely at fault.\nIt Was Inspired by a Real-Life Event\nIn 1974, Paterson's son's 8-year-old female best friend was struck and killed by lightning. The tragedy, along with a creek that ran through her town, inspired the author to write a children's novel about friendship and loss.\nIt's No Stranger to Censorship\nThings in Terabithia that people have taken issue with: death, religion, language, use of the word \"lord,\" and, most confusingly of all, allusions to occultism and Satanism. The novel has been a frequent name on the lists of most frequently challenged books, and despite its prevalence on classroom reading lists, some people still have a problem with Paterson's book being read by kids.\nA Rock Band Wrote a Song Inspired by The Book\nThe song \"Leslie Burke\" by Texas band The Sour Notes was inspired by the (spoiler alert!) tragic accident that befell the book's lead character. Listen at the link.\nPaterson's Son Wrote the Movie\nAn actor, producer, and screenwriter, David L. Paterson, Katherine's son, produced and co-wrote the script for the 2007 Disney film. A major box office success, the movie got generally good reviews, with most praise aimed at the visual effects and the faithfulness to the source material.\nBut The Disney Movie Wasn't the First Time It Was Adapted\nWhile the Josh Hutcherson-AnnaSophia Robb film is the only adaptation most Terabithia fans know exists, the novel was actually made into a Canadian TV movie way back in 1985. Starring Annette O'Toole, Julian Coutts, and Julie Beaulieu, the film was co-written by Paterson but failed to garner much attention or praise. Said her son, this early version of Terabithia is \"like the crazy cousin that nobody talks about.\"\nPaterson Didn't Think Anyone Would Like It\nStephen Shugerman/Getty Images Entertainment/Getty Images\nIn a 2010 interview, the author said that she didn't even think the book would be published, let alone turn into the classic it soon became, and she initially had difficulty accepting the book's reach. \"At first it was very hard for me to accept the fact that this was going to be a book that was loved by many, many people,\" she said, \"but through the years I have just seen how people bring their own lives — especially their own grief — to the book.\"\nImages: Buena Vista (3); Getty Images","url":"https://www.bustle.com/articles/35706-bridge-to-terabithia-the-beloved-ya-tear-jerker-inspired-a-song-plus-6-other-things-you-didnt"}
