{"authors":[],"date_download":"2018-10-22 21:03:37","date_modify":"2018-10-22 21:03:37","date_publish":"2014-05-05 20:19:34","description":"The fireball is concurrent with, but may not be related to, the Eta Aquarid meteor shower set to peak May 5.","filename":"data/vaneerConsumption/BrilliantDaytimeFireballStreaksOverCanadaNewYork.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/421571/fireball-dashcam-toronto_1_46d57ae73d2ea83892fa77ae62a05dd1.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_brilliant-daytime-fireball-streaks-over-canada-new-york-n97551_1540242217.html","title":"Brilliant Daytime Fireball Streaks Over Canada, New York","title_page":"Brilliant Daytime Fireball Streaks Over Canada, New York ","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"There was a fireball that came down and burned up,\" one of the people recorded by David Narciso's dashcam said after the fireball streaked through the daylight sky. \"See that line of puff? There was, like, something on fire and then it just stopped.\" [See five amazing fireballs caught on video]\nThe fireball is concurrent with, but may not be related to, the Eta Aquarid meteor shower set to peak tonight (May 5) and into the wee hours of tomorrow (May 6) morning. The annual shower happens when Earth passes through debris left behind by Halley's Comet. This year, the meteors will probably appear low on the horizon, but even if you don't have ideal viewing conditions, you can still watch the shower live on Space.com via webcasts from NASA and the Slooh community telescope.\nSo far, the American Meteor Society has received about 84 fireball sightings, with some claiming to have heard a sound concurrent with or after the fireball streaked through the sky. This daytime fireball also marks the third event of its kind in the last few days, according to the AMS.\n\"Oddly, this event, marks the third significant fireball in the last three days, following a relative slow season for fireballs so far this year,\" Mike Hankey wrote on the AMS website. \"A large fireball with numerous sonic booms fell over Arkansas on Friday night. Another bright fireball was seen over North Carolina Saturday night and this daytime fireball over Ontario marks the third significant event for this weekend.\"\nMeteor showers are created when particles or dust from cosmic objects (like asteroids or comets) enter Earth's atmosphere, burning up and producing a streak that some people call a \"shooting star.\" Some meteors are known as fireballs because their larger size causes them to splatter, making a more noticeable flash.\nWhen a piece of asteroid or comet is in space, it's known as a meteoroid. If that bit of cosmic dust burns up in Earth's atmosphere, it's known as a meteor, and any bits of meteor that impact the planet's surface are called meteorites.\n-- Miriam Kramer, SPACE.com\nThis is a condensed version of a report from SPACE.com. Read the full report. Follow Miriam Kramer @mirikramer and Google+. Follow @Spacedotcom on Twitter, Facebook and Google+.\nCopyright 2014 SPACE.com, a TechMediaNetwork company. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","url":"https://www.nbcnews.com/science/space/brilliant-daytime-fireball-streaks-over-canada-new-york-n97551"}
