{"authors":["Lucy Mae Beers","Freya Noble For Daily Mail Australia"],"date_download":"2018-10-22 22:53:50","date_modify":"2018-10-22 22:53:50","date_publish":"2016-01-11 04:06:05","description":"Thousands have gathered at a public rally in King George Square on Monday to pay tribute to Cole Miller, who tragically lost his life after a one-punch attack in Brisbane on January 3.","filename":"data/vaneerConsumption/BrisbaneremembersColeMillerwhowaskilledinaonepunchattack.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/04/3004CD8900000578-0-image-a-67_1452486372515.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393320_No-place-senseless-acts-violence-Thousands-gather-public-rally-remember-Cole-Miller-just-18-killed-one-punch-attack-night-Brisbane_1540248830.html","title":"Brisbane remembers Cole Miller who was 'killed in a one-punch attack'","title_page":"Brisbane remembers Cole Miller who was 'killed in a one-punch attack' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Cole's father, Steven, was hugged by a friend as he broke down while walking into King George Square\nMr Miller's brother, Billy, gave a heartbreaking speech to to crowd saying it was 'Cole's\nThousands have gathered at a public rally to pay tribute to Cole Miller, who tragically lost his life after a one-punch attack in Brisbane.\nRugby league legend Wally Lewis led the rally in sweltering heat in King George Square on Monday, calling for an end to violence and Mr Miller's brother, Billy, made a heartbreaking speech, saying it was 'Cole's time to shine.'\n'There's certainly no place whatsoever in this city or anywhere else for senseless act(s) of violence in our community,' Mr Lewis told the crowd.\nSteven Miller was comforted by a friend as he broke down on attending a rally on Monday for his son, Cole, who tragically lost his life after a one-punch attack in Brisbane on January 3\nA devastated Mr Miller had support from sons Mitchell and Billy as he listened to rugby league legend Wally Lewis address the crowd.\nCole, 18, died in hospital on January 4 from massive brain trauma a day after allegedly being hit in Brisbane's Fortitude Valley.\nHis father, Steven, was hugged by a close friend as he broke down while walking into King George Square for Monday's rally and was later seen being comforted by sons Mitchell and Billy as the trio listened intently from the front row.\nDespite the tragic circumstances, Mr Miller was able to show a small sign of togetherness, giving a thumbs up during the address.\nThe crowd all donned green shirts to remember the talented water polo player.\n'We should not and never have to worry about a loved one going out and having a good time with friends,' Billy Miller said during his address, with his father standing directly behind him for support, The ABC reported.\nRugby league legend Wally Lewis led the rally in sweltering heat in King George Square on Monday, calling for an end to violence\nDespite the tragic circumstances, Mr Miller was able to show a small sign of togetherness, giving a thumbs up during the address\nThousands of members of the public respectfully watched on, despite the sweltering heat\nMr Miller's brother, Billy, made a heartbreaking speech, saying it was 'Cole's time to shine'\nAt one point during the service, Billy needed the comfort of his brother Mitchell as he broke down\nSpeaking one week earlier, Mr Miller (pictured behind his son Billy) revealed his heartbreak over his son who had his 'whole life yet to be lived'\nRally attendees stood in silence as they listened to addresses from both Billy Miller and Mr Lewis\nCole Miller, 18, has died after a one-punch attack in Brisbane's Fortitude Valley in the early hours of Sunday\nThousands donned green shirts to remember the talented water polo player and surrounded the square as the sun beat down\nThe rally was put together by Gold Coast teenager Paris Wood who, although did not know Cole personally, felt 'devastated that someone so young can die just so suddenly.'\n'He's gone with his friends to have a good time, and this has just happened and it's just really, really sad,' she said.\nMs Woods says she has friends who are too terrified to go out after the 18-year-old's death.\nSpeaking one week earlier, Mr Miller revealed his heartbreak over his son who had his 'whole life yet to be lived'.\n'It is with deep sadness that I announce that our 18-year-old son Cole has today passed away as a result of massive brain trauma,' Steven Miller said.\n'He has struggled bravely in the intensive care unit of the Royal Brisbane Hospital and our family and many close friends have been by his bedside since the incident'.\n'Cole was a beautiful, brave, young man with his whole life yet to be lived,' the teenager's father said.\n'We should not and never have to worry about a loved one going out and having a good time with friends,' Billy Miller said\nMr Miller held Mitchell's hand as his son's wrapped their arms around their father to comfort each other\nThe remaining family members sought comfort from each other as braved the sweltering temperatures to listen to tributes for Cole\nSteven Miller and his two remaining sons stood with their heads hung in sadness as they remembered their lost family member\n'The Miller family would like to sincerely thank the support provided by Cole's school friends from Brisbane State High, and the water polo community, and the many many many others who have sent messages of love and hope.'\nSteven Miller also thanked emergency services and the doctors and staff at the hospital where his son was cared for.\nCole's funeral will be held later in the week.\nMembers of the public showed compassion to the devastated family by hugging them close as they entered the service\nMitchell wiped tears away from under his sunglasses as they trio greeted family and friends at the rally\nFlower bouquets were laid beneath a picture of Mr Miller as his older brother Billy addressed the crowd, with Mr Miller standing just behind\nAttendees were seen standing on a balcony overlooking the rally and struggling to hold back tears as they listened to the touching words about Mr Miller","url":"https://www.dailymail.co.uk/news/article-3393320/No-place-senseless-acts-violence-Thousands-gather-public-rally-remember-Cole-Miller-just-18-killed-one-punch-attack-night-Brisbane.html"}
