{"authors":["Bryant Hevesi For Daily Mail Australia"],"date_download":"2018-10-23 01:04:03","date_modify":"2018-10-23 01:04:03","date_publish":"2017-04-26 11:07:00","description":"Cameras have captured the romantic moment a Brisbane woman's fiance proposed to her after riding a horse to her work while wearing a knight's armour.","filename":"data/vaneerConsumption/Brisbanemanproposeswearingcustommadeknightsuniform.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F9D84C600000578-0-image-a-2_1493196560137.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446638_Brisbane-man-proposes-wearing-custom-knight-s-uniform_1540256643.html","title":"Brisbane man proposes wearing custom made knight's uniform","title_page":"Brisbane man proposes wearing custom made knight's uniform | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the romantic moment a woman began her own 'fairy tale.'\nThe unsuspecting Brisbane woman was sitting with a group of workmates this week when she was told someone was waiting for her outside.\nThe woman's soon-to-be husband rode a horse to the woman's office building, clad in his own custom made knight's uniform.\nScroll down for video\nA Brisbane man has proposed to his partner while dressed as a knight in shining armour\nThe man knew how to make an entrance - he had approached his partner's workplace while riding a horse\nHe walked towards his fiancee, who was captured on camera visibly excited by the shinning light before her eyes.\nThe man took off his helmet to reveal himself and delivered a 'Hello baby!'\n'Our romance has been nothing but a fairy tale,' he said.\n'And I thought I'd like to make it one.'\nHe then got down on my knee and, giggling uncontrollably as he almost tipped over from the weight of the armour, asked his partner 'could you please marry me', to which she replied 'I would love to'.\nThe couple then embraced while rose petals were thrown over them by the woman's workmates.","url":"https://www.dailymail.co.uk/news/article-4446638/Brisbane-man-proposes-wearing-custom-knight-s-uniform.html"}
