{"authors":["Peter Devlin For Daily Mail Australia"],"date_download":"2018-10-23 00:28:00","date_modify":"2018-10-23 00:28:00","date_publish":"2017-04-26 10:09:01","description":"Brisbane primary schools are sending their students to class with 40km/h speed signs stuck to their backpacks to improve road safety in school zones just in time for the new term.","filename":"data/vaneerConsumption/Brisbaneschoolsendchildrentoclasswith40kmhsign.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F9D8CA200000578-0-image-a-11_1493196021105.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446736_Brisbane-school-send-children-class-40km-h-sign_1540254480.html","title":"Brisbane school send children to class with 40km/h sign","title_page":"Brisbane school send children to class with 40km/h sign | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Primary schools are sending their students to class with 40km/h speed signs stuck to their backpacks to improve road safety.\nThe bags, called Safely Backpacks, are part of a campaign put together by the Australian Road Safety Foundation (ARSF) to remind Brisbane drivers to stick to the school zone speed limit.\n'We understand that people are often in a rush to get somewhere, but it's not worth risking the life of anyone to get to work on time,' said Founder and CEO of the ARSF Russell White.\nScroll down for video\nPrimary schools are sending their students to class with 40km/h speed signs stuck to their backpacks to improve road safety (video pictured)\nThe bags called Safely Backpacks are part of a campaign put together by the Australian Road Safety Foundation (ARSF) to remind Brisbane drivers to stick to the school zone speed limit (video pictured)\n'Every year thousands of motorists are caught speeding in school zones and endangering our communities, so take a moment, slow down and pay attention to your surroundings.'\nIn the past year alone, more than 170 pedestrians have been killed in road incidents.\nAs part of the campaign ARSF have released a video in time for the new school term.\nThe video shows primary school children getting ready for school.\nThe children are seen folding over a flap on their backpacks reading 40km/h, before walking to school and crossing a pedestrian crossing.\nAs part of the campaign ARSF have released a video in time for the new school term (video pictured)\nThe video shows primary school children getting ready for school (video pictured)\nJunction Park State School in Brisbane have made the Safely Backpacks compulsory for students.\nPrincipal of Junction Park State School Christine Wood said: 'We're excited to be a part of this new initiative which will help save kids' lives.\n'We want parents to feel safe when they send their child to school and are thrilled to be able to offer these to our students at no cost.'","url":"https://www.dailymail.co.uk/news/article-4446736/Brisbane-school-send-children-class-40km-h-sign.html"}
