{"authors":["Erica Tempesta For Dailymail.Com","Carly Stern For Dailymail.Com"],"date_download":"2018-10-23 01:09:07","date_modify":"2018-10-23 01:09:07","date_publish":"2016-01-29 14:58:28","description":"The 25-year-old mother-of-two posted a picture of her one-month-old daughter on Instagram. She is currently embroiled in a custody battle with her Marine ex Dakota Meyer over Sailor.","filename":"data/vaneerConsumption/BristolPalinsharesaphotoofonemontholddaughterSailorGrace.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/30B2F36200000578-0-image-a-3_1454077842419.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3422816_Trying-not-smile-Bristol-Palin-shares-precious-photo-one-month-old-daughter-Sailor-Grace-hours-celebrating-late-great-grandmother-s-life-family_1540256947.html","title":"Bristol Palin shares a photo of one-month-old daughter Sailor Grace","title_page":"Bristol Palin shares a photo of one-month-old daughter Sailor Grace | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bristol Palin said she's gone back to work after one month of maternity leave, but the 25-year-old mother-of-two is still finding plenty of time to spend with her new daughter.\nThursday night, Bristol shared an up-close picture of her baby girl Sailor Grace, who looked to be swaddled in a floral blanket in her arms.\n'Lookin' like she's trying not to smile!' Bristol wrote on Instagram about her little bundle of joy, whose birth she announced just five weeks ago.\nScroll down for video\nMom's love: On Thursday, Bristol Palin shared a sweet image of her newborn daughter, Sailor Grace\nUnbreakable bond: Bristol (left) posed with her sisters Willow (center), 21, and Piper, 14, at their great-grandmother's memorial service on Wednesday\nMeanwhile, her ex Dakota Meyer - whom she is currently embroiled in a custody battle with - has been sharing mostly cryptic messages on Instagram, including a new one just hours after Bristol's photo of Sailor went up.\n'Kindness is a language that the deaf can hear and the blind can see,' read his post, a quote attributed to Mark Twain.\nBristol has not acknowledged Dakota's messages, uploading the new snapshot of her daughter just hours after posting another one of her seven-year-old brother Trig and her 14-year-old sister Piper at their great-grandmother's memorial service.\nTheir father Todd's grandmother, Helena 'Lena' Andree, passed away last Wednesday at the age of 95, and the family spent time this week 'celebrating' her life with a joyous gathering.\nOn Wednesday, Bristol's sister Willow, 21, shared her own picture of herself, Bristol, and Piper smiling brightly at the camera as they wore Alaskan kuspuks, colorful tunic-length hooded overshirts that are commonly worn among Alaska Natives.\nLong life: Their father Todd's grandmother Helena 'Lena' Andree (pictured) passed away last Wednesday at the age of 95\nFamily time: Bristol shared this photo of her Piper and her seven-year-old brother Trig, who has Down syndrome, pursing his lips at the memorial service\n'Celebrating our Great Grandma's 95 years of life,' Willow captioned the picture, which also sees people milling about and smiling in the background.\n'We loved and cherished every moment spent with you Gg, and know you were smiling ear to ear looking down at everyone being together today. See you soon Gg. [sic]'\nTrig is also a blur in the shot, seeming to be jumping in to hug Piper just as the photo was taken.\nThe day after Lena's death Bristol, took to her blog to show her gratitude for having her great-grandmother, 'one of the most unique women in Alaska', in her life.\n'I always admired my great grandmother GG. This week, she passed away at the age of 95,' she wrote. 'She is in a better place and feels no more pain. We’re all at peace at having witnessed a life lived to the fullest.\nHonoring tradition: Bristol, Willow, and Piper wore kuspuks, hooded overshirts that are commonly worn among Alaska Natives\nBristol also took to Instagram to share an old picture of herself with Willow and Piper as they posed with Lena, writing: '5 generations under my beautiful great grandma Lena, rest in paradise we love you GG [sic].'\nBefore Lena's memorial service, Bristol's mother, former Republican vice presidential candidate Sarah Palin, shared old photos of Lena, a picture of the program from the event, and a snapshot of her daughters on her Facebook page.\n'Celebrating a Great life tonight in Alaska [sic],' she captioned the series of four images.\nIn the images, Lena can be seen wearing a buffalo plaid vest as she happily holds a large fish that has been caught.\nHappy family: Before the memorial service, former Republican vice presidential candidate Sarah Palin shared this photo of her younger self with her grandmother-in-law\nFive generations: Bristol took to Instagram to post this old photo of herself (far right) and her sisters Willow (far left) and Piper (second from left) with their great-grandmother after she passed away last week\n'Thanks, GG, for all of the lessons you taught us… most of those lessons which were taught without any words at all.'\nAt the bottom of the post, she plugged her mom Sarah Palin's new devotional, Sweet Freedom.\nAnother photo sees a young Sarah and two of her children posed with Lena.\nIt has been a busy week for Bristol, who returned to work on Monday only a month after announcing that she had birth to her daughter Sailor Grace.\nThe mother-of-two revealed earlier this week that she was leaving her daughter for the entire day for the first time since her birth in order to head back to work.\nTo commemorate the end of her short maternity leave, Bristol shared a photo of herself holding her newborn in a car seat as she posed with Tripp, her seven-year-old son with her ex-boyfriend Levi Johnston.\n'Back to real life today! I was fortunate enough to take the last month off to stay home with my babies, today marks the first time I've left SailorG, but I could not be more thankful she's in the best of hands!! [sic],' she captioned the family photo.\nPaying homage: Sarah snapped this photo of the memorial service program that details Lena's long life and death\nRemembering: Helena was the grandmother of Sarah's husband Todd. The pair are pictured together at Billy Graham's 95th birthday celebration in 2013\nIn the image, Bristol is wearing a black long sleeve shirt, black pants, taupe ballet flats, and a chunky gold necklace. Her hair is pulled half-way up while her Louis Vuitton bag sits open in front of her with her water bottle peeking out.\nTripp is pictured in a neon green Nike sweatshirt, camouflage cargo pants, and red Nike sneakers, presumably heading off to school, while Sailor is bundled up in her pink carrier with only a bit of her head peaking out.\nAnd while some people may think a one-month long maternity leave is too short, Brisol's mother Sarah Palin only took three days off after her youngest son Trig was born with Down syndrome in 2008.\nDespite her reality show and appearances on Dancing with the Stars, the daughter of the former Republican vice presidential candidate has apparently been working at Dr. Michael L. Cusack's office at Alaska Dermatology Laser and Skin Cancer Center in Anchorage for years.\nFamily photo: Bristol shared this snapshot of herself posed with her son Tripp, seven, and her daughter Sailor Grace on Monday to commemorate her return to work one month after giving birth to her baby girl\nPretty in pink: The 25-year-old posted this precious photo of Sailor sitting in her pink car seat a week ago\nBristol is currently in the midst of a custody battle with her ex-fiance and Medal of Honor recipient Dakota, 27, who is making a bid to get joint custody of her one-month old daughter Sailor.\nThe former reality star, who often shares photos of her children and family adventures on Instagram,announced her daughter's birth on social media on December 24 with a photo of her cuddling her newborn in bed.\nMeanwhile, her ex-fiance shared his own precious snap of the mother with her newborn on his Twitter account on Christmas Eve, after months of speculation over whether he is in fact Sailor's father.\nDakota is now being forced to take a paternity test as part of the former couple's increasingly bitter custody battle over her new baby.\nOverjoyed: Bristol announced the birth of her daughter in December by sharing this photo on Instagram, however, some believe the baby was actually born on November 4 because of the date scribbled on her IV line\nBroken romance: Bristol got engaged to marine Dakota Meyer (pictured), 27, in March, but eventually called off their wedding. They are now in a custody battle over Sailor Grace\nCourt documents seen by Daily Mail Online reveal that Meyer's bid for joint custody in a suit filed in Kentucky and Alaska has stalled pending the results of the paternity test. A question has also been raised over the actual birth date of Bristol's baby.\nThe Instagram photo posted by Bristol announcing the birth of Sailor on December 24, places the birth date one day earlier. The date of birth on court papers filed in the custody case is also given as December 23.\nBut the same Instagram picture posted by Dakota with the caption 'Best Christmas present ever!!' reveals a detail whited out in Palin's account – the date scribbled on her IV line.","url":"https://www.dailymail.co.uk/femail/article-3422816/Trying-not-smile-Bristol-Palin-shares-precious-photo-one-month-old-daughter-Sailor-Grace-hours-celebrating-late-great-grandmother-s-life-family.html"}
