{"authors":["Khaleda Rahman For Daily Mail Australia"],"date_download":"2018-10-23 02:34:50","date_modify":"2018-10-23 02:34:50","date_publish":"2017-03-16 13:15:42","description":"Baden Bond was last seen at his family's Wagawn St home in Woodbridge, south of Brisbane, on March 27, 2007.","filename":"data/vaneerConsumption/Brisbanemanandwomanarrestedoverdisappearanceofboy.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/15/04/3E48F1EA00000578-0-image-a-7_1489553294033.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319934_Man-woman-arrested-disappearance-baby-boy_1540262090.html","title":"Brisbane man and woman arrested over disappearance of boy","title_page":"Brisbane man and woman arrested over disappearance of boy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A mother and father have appeared in court after being charged with the murder of toddler Baden Bond, who vanished from his family home a decade ago .\nThe 43-year-old mother from Woodridge, south of Brisbane, and the 49-year-old father, from Toormina on the NSW north coast, appeared briefly in the Brisbane Magistrates Court on Friday morning charged with the murder of 22-month old Baden.\nIt is alleged the toddler was killed sometime between March 26 and May 17 2007 at Woodridge or elsewhere in the state of Queensland after he vanished from his family's Wagawn St home in Woodbridge, south of Brisbane, on March 27, 2007.\nHis family never reported him missing.\nThe mother and father were remanded in custody, their case adjourned to April 10.\nScroll down for video\nBaden Bond (pictured) was just 22-months-old when he was last seen, but would be 12-years-old if he was still alive today\nThe charges follow an a public appeal for information on Wednesday in a bid to solve the case and revealed it is likely the boy was murdered.\nBaden was in the care of his parents when he disappeared.\nThe family then relocated to New South Wales six months later in August 2007.\nBut the child's disappearance only came to light nine years later in January 2016 when a magistrate hearing a case involving the family demanded to know where he was.\nThe boy's parents, who have a number of other children, told the magistrate that Baden had gone to live with relatives.\nHowever, repeated attempts to find him failed.\nDetective Inspector Damien Hansen said on Wednesday police had been unable to 'find any evidence of Baden existing' after March 2007.\nAlthough Baden Bond (pictured) was last seen in 2007, his family never reported him missing\n'We do know that he was alive on that date,' he told media.\n'Someone out there must know what happened to a 22-month-old child.'\nDet Insp Hansen said there was no record of the toddler attending any school or medical centre in the past 10 years.\nHe confirmed court proceedings surrounding the case had resulted in the investigation being returned to Queensland police last November, which led to the fresh appeal for information.\nBaden's family had told investigators their son was being looked after by other family members and friends.\nHomicide investigators searched the family home at 23 Wagawn Street, Woodridge in Queensland in 2016 where he was last seen\nInspector Hansen said there was no sign of the toddler enrolled in schools or any records of him attending medical appointments\n'They've given us a number of versions but none of them have resulted in Baden being located,' Det Insp Hansen said.\nPolice also confirmed bones had been found in the backyard of the family's former Woodbridge home during a forensic search a year ago.\nBut Det Insp Hansen said he believed it would be another few months before the lab came back with the results about whether they were human bones.\nPolice would not confirm if Baden had ever been in the care of child services, but said the toddler had not been there since his disappearance.\nDet Insp Hansen urged any former neighbours, friends or anyone who saw anything out of the ordinary at the property between March and August 2007 to call Crimestoppers on 1800 333 000.","url":"https://www.dailymail.co.uk/news/article-4319934/Man-woman-arrested-disappearance-baby-boy.html"}
