{"authors":["Press Association"],"date_download":"2018-10-23 02:19:16","date_modify":"2018-10-23 02:19:16","date_publish":"2017-03-10 11:18:05","description":"British Cycling is facing more questions about its governance.","filename":"data/vaneerConsumption/BritishCyclingShaneSuttoninvestigationtimeline.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/11/wire-195549-1489144692-425_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4300838_British-Cycling--Shane-Sutton-investigation-timeline_1540261156.html","title":"British Cycling - Shane Sutton investigation timeline","title_page":"British Cycling - Shane Sutton investigation timeline | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"British Cycling is facing more questions about its governance after a leaked report in the Daily Mail said its board appeared to deliberately reverse the findings of an internal investigation into Jess Varnish’s complaints against former technical director Shane Sutton.\nHere, we outline the timeline of events.\n– Jess Varnish and Katy Marchant finish fifth in the two-woman, two-lap team sprint at the Track World Championships in London and fail to qualify for the Rio Olympics. Both riders blamed selection errors during the two-year qualification period. “I feel sick,” said Varnish, who was disqualified at the London 2012 Olympics when competing with Victoria Pendleton. “This is through absolutely no fault of our own. We’re fifth in the world, we’ve beaten so many of the teams, this is the best we’ve ever competed and we’re not going to the Olympics.” Sutton said: “We need to put to bed any crisis between the coaches and the riders. There’s no repercussions for anybody.”\nJess Varnish\n– Sutton reveals in the Daily Telegraph that Varnish has been dropped from British Cycling’s elite squad. He said: “Since her gold medal at the London World Cup in (February) 2012, Jess had not made the necessary gains in performance compared to the rest of the world. The decision was based on a projection of medal competitiveness at Olympic Games level.”\n– Varnish responds in an interview with the Daily Mail. The 25-year-old alleges Sutton told her to “just move on and go and have a baby”. Varnish, whose boyfriend Liam Phillips is Britain’s leading BMX rider, added: “After 2012 I was told that, ‘with an ass like mine I couldn’t change position within the team sprint’. It basically implies the stronger woman has to go in ‘man one’ position because I’m quite glute dominant, shall we say.” Sutton denied making the comments.\n– Funding body UK Sport calls for Varnish’s allegations to be investigated.\nShane Sutton\n– Olympic champions Pendleton and Nicole Cooke publicly give Varnish their support. Varnish issues a statement outlining, from her perspective, how events unfolded and why she spoke out. British Cycling announces an independent review, in conjunction with UK Sport, into the culture of the world class performance programme.\n– Sutton is suspended following further allegations, this time that he called para-cyclists “gimps” and “wobblies”, and resigns later in the day. In a statement, he says: “I reject the specific claims that have been made against me in recent days, and I look forward to taking a full part in the review process so I can respond to the allegations in detail.”\n– British Cycling chief executive Ian Drake insists he was not aware of the allegations of discrimination towards para-cyclists which were followed by Sutton’s suspension and then resignation.\nBritish Cycling and UK Sport announce the review into allegations of bullying and discrimination will conclude after the Rio Olympic and Paralympic Games and be led by Annamarie Phelps, the chair of British Rowing.\nBritish Cycling\n- British Cycling upholds Varnish’s complaint following an internal investigation and the national governing body’s board apologises to her. The internal report is passed on to the independent review team.\n– Varnish says she is “shocked and upset” after learning only one of her nine complaints against Sutton had been upheld. A leaked document shows the British Cycling board upheld the complaint that it was probable Sutton used the term “bitches”, but that further claims were not accepted. Varnish says she has asked her solicitor to appeal against the findings.\n– Lawyers acting for Varnish accuse British Cycling of withholding information relating to her removal from the Olympic programme and the investigation into her bullying complaint against Sutton.\n– Leaked details of the independent review findings are published in the Daily Mail. The draft review reportedly shows British Cycling’s grievance officer Alex Russell found “considerably more” than one of the nine claims against Sutton by Varnish could be proven, and that board members at the organisation made a “shocking and inexcusable” decision to reverse the findings.","url":"https://www.dailymail.co.uk/wires/pa/article-4300838/British-Cycling--Shane-Sutton-investigation-timeline.html"}
