{"authors":["Anneliese Cooper"],"date_download":"2018-10-30 22:35:53","date_modify":"2018-10-30 22:35:53","date_publish":"2014-08-15 00:27:50","description":"When most people think of early-2000s Britney Spears, their minds likely jump to \"Oops! . . . I Did It Again\" and its accompanying red vinyl bodysuit — maybe also a dash of love for \"Stronger,\" \"Lucky,\" any of those radio-ready hits that would come…","filename":"data/vaneerConsumption/BritneySpearsWhatUSeeIsWhatUGetistheDecadeOldFeministAnthemYouForgotAbout.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/46a3e27c-cfb4-4908-9b00-e8b57dbcbd8a.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35847-britney-spears-what-u-see-is-what-u-get-is-the-decade-old-feminist-anthem-you_1540938953.html","title":"Britney Spears' \"What U See (Is What U Get)\" is the Decade Old Feminist Anthem You Forgot About","title_page":"Britney Spears' \"What U See (Is What U Get)\" is the Decade Old Feminist Anthem You Forgot About","title_rss":"NULL","source_domain":"bustle.com","text":"When most people think of early-2000s Britney Spears, their minds likely jump to \"Oops! . . . I Did It Again\" and its accompanying red vinyl bodysuit — maybe also a dash of love for \"Stronger,\" \"Lucky,\" any of those radio-ready hits that would come to sonically encapsulate our younger years. But for those of us who bought the Oops!...I Did It Again CD and listened to it in full, on repeat, for days on end — much to the chagrin of anyone around us with functioning eardrums — we are well aware that the title track was just the beginning.\nRevisiting those oft-forgotten B-sides serves as a reminder not only that pop artists' packing peanut songs can be pretty damn great, but also that Britney apparently encountered a lot of unenviable dating situations in her day. All told, there was the frustration with an unrequited crush in \"Can't Make You Love Me\"; the emotional (or literal?) restraining order prescribed by \"Don't Go Knockin' on My Door\"; the chiding of an uncommunicative douchewad in \"Don't Let Me Be the Last to Know\"; even the breathy indignation espoused by her cover of the Rolling Stones' \"(I Can't Get No) Satisfaction.\" (To all who had blissfully blocked said cover from their memory, I apologize for dredging it up; let's work through this difficult time together.)\nStill, upon reflection, perhaps Britney's most surprisingly righteous, feminist, kicking-ass-and-taking-names-iest track is the mid-album lingerer \"What U See (Is What U Get)\" — not to be confused with the Xzibit song of the same name. (For the record, I now desperately want to hear some sort of mash up of these two — please, Internet, help a girl out.)\nmileylockhart on YouTube\nLet's break this one down, starting with the first verse:\nYou used to say that I was special; everything was right.\nBut now you think I'm wearing too much makeup, that my dress is too tight.\nYou got no reasons to be jealous; I've never been untrue.\nSo what's it really matter if they're looking? I'm only looking at you.\nRight off the bat, we've got a scenario all too familiar to any number of people who've experienced a sudden and uncomfortable shift in the attitude of a once sweet-seeming partner, and who've thus found themselves sucked into the undertow of a toxically jealous relationship. Also, it should be noted that the specific examples of \"too much makeup\" and \"too tight clothing\" are the prime go-tos of any practiced slut-shamer, exceedingly frustrating for those of us who know that you don't automatically trade in your personhood when you pop on some lipstick.\nSo, what does Britney do? Why, she lays the smackdown, of course:\nYou should never try to change me:\nI can be nobody else,\nAnd I like the way I am.\nJust, yes. So much yes. Mountains of yes, stretching on into a yes-filled horizon where a skywriter is repeatedly scribing YES.\nI mean, sure, everyone can always aspire toward certain types of self-improvement, lest we stagnate, etc., but when it comes to the kind of scenario the song has laid out so far — i.e., a significant other who is possessively getting on your case — these words and the sentiment behind them are vitally important. And Brit just keeps on hammering it home:\nWhat you see is what you get;\nThis is me — hey, you, if you want me, don't forget.\nYou should take me as I am, 'cause I can promise you,\nBaby, what you see is what you get.\nI cannot snap hard enough along with this chorus, but that doesn't mean I won't break my hand trying.\nBecause so often, when young women are praised or affirmed, it's with some kind of qualification — \"Sure, you're great, but you'd be even better if you followed this makeup tip / if you smooshed your body into this Platonic ideal / if you don't know you're beautiful,\" etc. — and while this strategic cultural negging certainly sells more cosmetics/SlimFast/boy band albums, it often ravages, or at least severely complicates, our system of self-esteem. I'm sure boys get it, too — \"man up\" and all that awful, overdetermined gender bullshit — but the added sense of possessiveness threaded through Britney's tale smacks particularly of the female experience, à la street harassers' insistence that we smile.\nPut plainly, it sucks, and not in the least because it leaves us particularly vulnerable to exactly these kinds of crappy relationships — that is, with folks who are more interested in the idea of having a partner than they are in who that partner actually happens to be, and will thus end up reducing a fully realized human individual to how well they do or do not measure up to an intricate set of personal fantasies.\nIf there's anything that 16-year-old me needed to hear, and loudly, it's that attempting to change yourself significantly in order to be more attractive to someone else — from the music you like to the clothes you wear to the cigarettes you're suddenly stoked on smoking — is not only futile, it's harmful, and no matter how cool that person may seem at the time, they are simply not worth the trouble. You will never get back all those hours of acoustic Decemberists covers you pretended to love — not ever.\nPlus, zooming out a bit, it's hard not to retroactively relate these lyrics to Britney's career situation — the \"you\" to whom she's singing an allegory for the media who insisted that she be sexy-but-not-too-sexy, both a role model and a piece of eye candy, on and on until blue in the face (and possibly, other anatomy parts). 2007's \"Piece of Me\" picks up on this theme in exactly those terms, calling out those who would \"put a picture of my derriere in the magazine\" and telling them to \"get in line with the paparazzi who's pissing me off.\" But it began here, in \"What U See (Is What U Get),\" and far more universally, relatably so, at least for those of us who've never been to the Philippines. It was yet another peek behind the curtain, a line of empathy to the ever-contradictory hardships for those put on a pop cultural pedestal.\nFrom there, the rest of the song continues to hammer these same points home — the next verse describing said creeper watching her obsessively while she dances, her subsequent assertion that \"I can't have these chains around me,\" followed by a distinctly Britney-ish multisyllabic filler noise (\"bay-bay, huh-now-now\"). But for me, it's ultimately all about that one plain pre-chorus assertion — \"and I like the way I am\" — such a simple statement that's still so hard, some days, to muster. So, until we can know it for ourselves, I say we find it here — with, yes, this admittedly goofy pop B-side from the year 2000. Whatever it takes, y'all. This is me, hey, you!","url":"https://www.bustle.com/articles/35847-britney-spears-what-u-see-is-what-u-get-is-the-decade-old-feminist-anthem-you"}
