{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 22:27:59","date_modify":"2018-10-30 22:27:59","date_publish":"2016-12-13 00:00:00","description":"The state-owned British Business Bank lends to small businesses over Funding Circle, MarketInvoice, and RateSetter.","filename":"data/vaneerConsumption/BritishBusinessBanksinvestmentinpeertopeerplatformsafterFCAreview.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_british-business-banks-investment-in-peer-to-peer-platforms-after-fca-review-2016-12_1540938479.html","title":"British Business Bank's investment in peer-to-peer platforms after FCA review","title_page":"    British Business Bank's investment in peer-to-peer platforms after FCA review - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Rhydian Lewis, RateSetter CEO. RateSetter LONDON — £85 million of taxpayer money is invested in the peer-to-peer (P2P) lending sector, an industry where the financial regulator identified \"evidence of potential investor detriment\" in a report last week.\nThe state-owned British Business Bank (BBB) has £60 million invested on Funding Circle, £15 million invested on MarketInvoice, and £10 million on RateSetter, according to a Freedom of Information request seen by Business Insider.\nThe Financial Conduct Authority (FCA), Britain's finance regulator, on Friday flagged \"concerns\" around the growing complexity of the peer-to-peer market. The FCA writes in its report: \"Firms' desire to maintain confidence in platforms has occasionally led to firms acting in a nontransparent manner, masking true loan performance and exposing investors to risks.\"\nWhile the FCA does not identify any specific firms in its report, it flags certain practices such as intervention by peer-to-peer lenders to influence loan performance and lending to provision funds (special vehicles meant to pay for a certain amount of investor losses). RateSetter has both made an on-balance loan to a business it crowdfunded a loan for and restructured its provision fund to allow bail-ins.\nPeer-to-peer lending platforms are marketplaces for loans, connecting borrowers with people willing to invest their own money in those loans for good returns. The BBB invests platforms that allow it to extend loans to small businesses.\nThe BBB began investing on Funding Circle and MarketInvoice in 2013 and RateSetter in 2014. It undertook extensive due diligence on each platform before committing the money. But FCA CEO Andrew Bailey told Business Insider in an interview last week: \"It's a fast-moving, evolving industry. Some of the directions in which it's going off are posing some quite big challenges in terms of transparency and fairness.\"\nJohn O'Connell, Chief Executive of the TaxPayers' Alliance, told Business Insider over email: \"This is extremely concerning and taxpayers will want to know how this can be good use of their money.\n\"The wider question is why taxpayers are funding loans to begin with. There are answers to be found on how to increase lending from commercial banks, but the Government stepping in with a taxpayer-funded alternative should not be one of them.\"\nThe British Business Bank was set up by the government in 2012 with £1 billion of funding to increase funding to small and medium enterprises (SMEs). It does not finance SMEs directly but works through partners and intermediaries to extend funding.\nA spokesperson for the British Business Bank told Business Insider: \"Peer-to-peer lending platforms have the potential to be a successful delivery model for small business finance. Investing in these, and other kinds of platforms is a vital part of our remit to foster a more diverse small lending market for smaller businesses; indeed more than 10,000 smaller businesses across the country have already benefited from our partnership with Funding Circle.\n\"One of our four strategic objectives is to manage taxpayer resources efficiently and within a robust risk management framework. The return across the British Business Bank programmes between 2015-16 was over 2%.\"\nConrad Ford, CEO of small business finance marketplace Funding Options, said the British Business Bank is now focusing on putting money into more traditional lending businesses. He told Business Insider: \"The kind of people getting financing now are very broker-led, traditional asset finance businesses. It's really quite marked how that's where the money is going right now.\"\nFunding Options works closely with the BBB as one of three platforms chosen by it for the bank referral scheme, which requires banks to refer small businesses to alternative financing sources if they turn them down for loans.\nBut Ford added: \"I personally don't think that's a reflection that [the British Business Bank is] worried about peer-to-peer, I think it's more that they think it's job done with peer-to-peer. In the early days, it had an enormous positive impact on building confidence in the sector. There's plenty of capital right now coming into peer-to-peer from the private sector and the better thing to do now is actually to hive it out through more traditional lenders.\"\nRateSetter declined to comment on its relationship with the BBB when contacted by Business Insider. However, the company said in a statement to BI on Friday: \"We provide more disclosure around our Provision Fund than any other platform, and are proud of its track record of ensuring that no individual investor has ever lost a penny on RateSetter, although of course, this is not a guarantee for the future.\"\nA spokesperson for Funding Circle told Business Insider: \"The British Business Bank continues to play an important role in promoting competition in the small business lending market by lending directly through platforms like ourselves. To date, the lending through Funding Circle has helped more than 10,000 businesses to access finance.\n\"We welcome the FCA's review and support the focus on investor protection. Platforms must fully disclose information about risk and returns which is why Funding Circle publishes performance data on every single loan.\"\nMarketInvoice did not respond to Business Insider's request for comment.","url":"https://www.businessinsider.com/british-business-banks-investment-in-peer-to-peer-platforms-after-fca-review-2016-12"}
