{"authors":["Bianca London For Mailonline","Unity Blott For Mailonline"],"date_download":"2018-10-23 00:34:48","date_modify":"2018-10-23 00:34:48","date_publish":"2017-03-16 10:06:21","description":"The 22-year-old, from Burton-Upon-Trent, says that not only has appearing on the show boosted her confidence but it's helped her family come to terms with her sex change.","filename":"data/vaneerConsumption/BritainsNextTopModelsfirsttransgenderspeaksout.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E533E1300000578-0-image-a-9_1489658748677.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4319344_Britain-s-Model-s-transgender-speaks-out_1540254888.html","title":"Britain's Next Top Model's first transgender speaks out","title_page":"Britain's Next Top Model's first transgender speaks out | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's been making headlines as the first-ever transgender contestant to appear on Britain's Next Top Model - and appearing on the show hasn't just boosted Talulah-Eve Brown's career prospects.\nThe 22-year-old, from Burton-Upon-Trent, says that not only has appearing on the show boosted her confidence but it's helped her family come to terms with her sex change.\nSpeaking to Fearne Cotton on Lorraine, the beauty queen, who will compete against 11 other girls for a coveted contract with Models 1, said: 'Doing it so publicly has really helped my family accept me because they're seeing the support from people. My grandma thinks I'm crazy to be honest.'\nTalulah-Eve Brown is one of the 12 contestants in Britain's Next Top Model 2017 - she is the first transgender contestant\nShe spoke candidly on Lorraine about her decision to go on the show and said it has helped her family to accept her\nAnd whilst she says that putting her on the show was a 'big thing', she explained that the judges treated her just like all the other girls.\nSpeaking about her decision to join the show, she said: 'I'm Miss Transgender Birmingham; it was a warm up for me. I thought if I can handle being in a pageant with 100 b***** trans people, I can do Britain's Next Top Model.\n'It wasn't an easy ride, it was an eye opener doing the pageant.'\nThe model also spoke candidly about her 'difficult' teenage years as she came to terms with her sexuality.'\nWhilst she says that putting her on the show was a 'big thing', she explained that the judges treated her just like all the other girls\nBorn Aaron, right, Talulah-Eve, from Burton-Upon-Trent, Staffordshire, came out as gay at 13 before being diagnosed with gender dysmorphia in her teens and later decided to undergo gender reassignment surgery, left\nHer comments followed an awkward slip-up when Fearne introduced Talulah-Eve as the modelling contest's first 'transgester' rather than 'transgender.' Viewers took to Twitter to dub her mistake 'the slip up of the year'\nShe explained: 'Growing up it was difficult for me. I didn't really understand what I was, there was no education about it - not even being gay, let alone trans.\n'I read a story about Nadia from Big Brother and I realised - this is me.'\nShe went on to explain that she felt as though people at school wouldn't understand so she thought it would be easier to come out as gay.\n'As I got older, I thought: \"This is me\" and I came out as a woman.'\nHer comments followed an awkward slip-up when Fearne introduced Talulah-Eve as the modelling contest's first 'transgester' rather than 'transgender.'\nViewers took to Twitter to dub her mistake 'the slip up of the year'.\nSpeaking to MailOnline about the stumble, Talulah-Eve said: 'I found it funny! It's only one letter out. Don't see why people have gotten upset about it! I felt bad for Fearne, she was so apologetic afterwards.’\nTalulah-Eve took to Instagram to say: 'I never thought a girl like me would find a place on a show like this and compete against such beautiful girls'\nThe 22-year-old, third from left, says that not only has appearing on the show boosted her confidence but it's helped her family come to terms with her sex change\nSpeaking to Fearne Cotton on Lorraine, the beauty queen said: 'Doing it so publicly has really helped my family accept me because they're seeing the support from people'\nBorn Aaron, Talulah-Eve, from Burton-Upon-Trent, Staffordshire, came out as gay at 13 before being diagnosed with gender dysmorphia in her teens and later decided to undergo gender reassignment surgery.\nInspired by public figures like Caitlyn Jenner and Big Brother winner Nadia Almada, Talulah-Eve, who grew up playing with Barbies, started hormone treatment in 2015 to widen her hips and soften her voice.\nShe later paid £800 to freeze her sperm so that she could have babies once her transition was complete.\nCalling herself a 'strong, independent woman', Talulah-Eve said she was prepared to one day raise a child on her own just like her own mother had done.\nBut her transition has been fraught with difficulties, with Talulah-Eve, who holds a black belt in karate, once admitting to receiving 'daily' death threats and being 'fetishized' by men.\nTalulah-Eve came out as gay at 13 before being diagnosed with gender dysmorphia in her teens and later decided to undergo gender reassignment surgery\nInspired by public figures like Caitlyn Jenner and Big Brother winner Nadia Almada Talulah-Eve, who grew up playing with Barbies, started her hormone treatment in 2015\nTalulah Eve's transition has been fraught with difficulties, admitting to receiving 'daily' death threats and being 'fetishised' by men\nThe 5ft 8in model and blogger, who competed in the UK's first transgender beauty pageant, first revealed her plans to crack the modelling industry and become a role model for young girls in 2015.\nA self-styled trans activist, Talulah-Eve, who has never been in a relationship, has spoken out on discrimination including one 'disgusting' incident when she was thrown out of a bar for using the ladies' toilets in 2016.\n'The trans community is where the gay community was 10 to 15 years ago – we need to be celebrated not tolerated and this pageant is a massive step forward,' she said in an interview with the Burton Mail.\nThe 5ft 8in model and blogger, who competed in the UK's first transgender beauty pageant, first revealed her plans to crack the modelling industry in 2015\nTalulah-Eve added: 'I understand people may not be sure but it is only because being transgender is considered a taboo but I want to break that and be a role model which can empower people who may feel trapped.\n'People are talking openly about transgender issues now and hopefully some of the stigma attached to trans people will fade.'\nIt is perhaps for this reason that appearing on BNTM holds such a special significance for Talulah-Eve, who yesterday took to Instagram to say: 'I never thought a girl like me would find a place on a show like this and compete against such beautiful girls.\n'But I guess all you have to do is believe! Life isn't about finding a label that fits you best. Life is about finding you! And it's that journey that is incredible. Appreciate the bad just as much as the good!'","url":"https://www.dailymail.co.uk/femail/article-4319344/Britain-s-Model-s-transgender-speaks-out.html"}
