{"authors":["Ross Parker For The Daily Mail"],"date_download":"2018-10-23 03:08:58","date_modify":"2018-10-23 03:08:58","date_publish":"2017-03-10 12:38:02","description":"For hundreds of years they have been a staple part of almost every British dinner. But it appears that we are finally falling out of love with the potato. Sales have fallen by a fifth in the last ten years.","filename":"data/vaneerConsumption/Britainfallsoutoflovewiththepotato.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/043119E9000003E8-0-image-a-49_1489149466213.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301134_Britain-falls-love-potato_1540264138.html","title":"Britain falls out of love with the potato","title_page":"Britain falls out of love with the potato | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"For hundreds of years they have been a staple part of almost every British dinner.\nBut it appears that we are finally falling out of love with the potato.\nSales have fallen by a fifth in the last ten years – with a recent dive in figures being fuelled by 'carb-free' diets.\nPotato sales have fallen by a fifth in the last ten years – with a recent dive in figures being fuelled by 'carb-free' diets\nIn the last three years alone sales have dropped by almost 7 per cent, according to figures published in the annual Food Report by the Department for Environment, Food and Rural Affairs.\nDespite the fact many are shunning the great British spud in an effort to drop a few pounds, it appears that some potato-based treats just prove far too tempting to ignore as sales of chips and crisps remained steady.\nThe report suggests that a change in taste may also be behind the fall in sales, which would explain why the fried potato snack is holding steady.\nIt said: 'About four fifths of the purchases of processed potatoes were chips and crisps and these have been relatively stable over the last ten years.\n'The reduction in recent years is driven by a decline in purchases of fresh potatoes.'\nSales of chips and crisps remained steady\nIt is thought that the average Brit eats around 220lbs (100kg) of potato each year and that it is still the most popular vegetable to hit our kitchen tables by far.\nCharlie Greenslade, of the British Potato Trade Association, believes that the fall has also been a result of an increase in popularity towards other carbohydrates such as pasta and rice.\n'People don't have the time they used to for food preparation,' he told The Times.\n'There is a perception that potatoes are not convenient. It is a fallacy because many potatoes you don't need to wash or peel and in fact the skin is full of fibre.\n'There is also a fad pushed by so called dieting experts that potatoes are not good for you and fattening. It is nonsense. My parents' generation fought the war on potatoes and none of them were obese.\n'More and more people around the globe are eating them. Consumption in China is rocketing, because they recognise the benefits, but not in Britain.'\nThe report also found that Brits are buying less meat, milk and bread and that sales in ready meals were again on the rise, although there had been a steep increase in the amount of home-grown fruit and vegetables.","url":"https://www.dailymail.co.uk/news/article-4301134/Britain-falls-love-potato.html"}
