{"authors":["Donna Rachel Edmunds"],"date_download":"2018-10-30 18:35:24","date_modify":"2018-10-30 18:35:24","date_publish":"2015-11-20 09:51:37","description":"A British Christian has been attacked on the streets of Bradford because he converted from Islam to Christianity over a decade ago.","filename":"data/vaneerConsumption/BritishChristianBrutallyBeatenOutsideHomeByMuslimNeighboursWhoLabelledHimaBlasphemer.json","image_url":"https://media.breitbart.com/media/2015/11/Churches-Celebrate-The-Beginning-Of-Lent-Getty.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_11_20__1540924524.html","title":"British Christian Brutally Beaten Outside Home By Muslim Neighbours Who Labelled Him a 'Blasphemer'","title_page":"British Christian Brutally Beaten Outside Home By Muslim Neighbours Who Labelled Him a 'Blasphemer'","title_rss":"NULL","source_domain":"breitbart.com","text":"A British Christian man has been attacked on the streets of Bradford, England, by men wielding a pickaxe handle – because he converted from Islam to Christianity over a decade ago. The attack is the latest incident in a long campaign of violence and intimidation directed against the man and his family, who have been labelled “blasphemers” by their Muslim neighbours.\nFather of six Nissar Hussain was brutally beaten by two hooded thugs outside his home in Mannigham in an unprovoked attack, at about 5pm on Tuesday, suffering a broken kneecap, a fractured forearm and a concussion. Police have confirmed that they are investigating the incident as a targeted attack and a religious hate crime.\nThe violent beating was captured on Mr Hussain’s own CCTV, set up in response to a sustained campaign of intimidation wielded against the family over the last few years.\nIt shows Mr Hussain walking towards his car parked just outside his house as two men waiting by a car on the other side of the road start moving towards him. As he tries to retreat to the safety of his home they set upon him, raining down blows with the weapon, as well as punches and kicks.\n“I felt like I was holding on for dear life,” Mr Hussain, a professional landlord, told the Daily Mail.\n“It all happened so fast that I was unable to react. I remember just walking out of the gate and putting my foot off the kerb. Next thing I saw was a pickaxe coming towards me. On instinct I tried to cover my head with my arms but the force of the blow knocked me back and my heel clipped the kerb to send me to the ground.\n“I also hit my head on the wall which gave me a concussion but I was still conscious. I continued to block their shots to my head with my arms while on the ground but as soon as they realized that, they just began attacking my legs.”\nWhile the two assailants set about Mr Hussain, a third accomplice pulled their car into the middle of the road, allowing the pair to make a quick getaway as onlookers start running towards them.\nAccording to Mr Hussain, he and his family have been living in fear ever since they converted to Christianity in 1996. Forced from their home, they enjoyed a few peaceful years until in 2008 they appeared in a Channel 4 documentary highlighting the difficulties faced by converts from Islam to Christianity. Since then, they have been subject to continuous persecution which Mr Hussain says is reminiscent to the suffering of Christians in his native Pakistan.\nHe said: “This last year has been the most terrifying. My family has to be brave as soon as they leave the front door. This country is a civilised society and we are not in Pakistan. We have the right to go about our daily lives and not be threatened because of our religion.”\nMr Hussain says he does not regret taking part in the documentary as “this is an issue for converts up and down the country,” adding “we should not be subjected to such abuse.”\nIn May, Mr Hussain wrote an impassioned plea to newly elected MP Naz Shah, begging for help after completely losing faith in West Midlands Police.\nMr Hussain wrote: “In short my family and I endured ‘hell’ by my fellow Pakistani young men in the form of persecution which entailed assault, daily intimidation, criminal damage to property: smashing house windows and also 3 vehicles written off whilst the community looked on and even endorsed this. One of vehicles was torched outside my home.\n“Despite witnessing another vehicle being rammed deliberately by a man who I knew, the Police did not even take a statement never mind an arrest.\n“Finally after being threatened to be burnt out of my home these young men deliberately set the neighbours’ house (which was vacant) on fire in the hopes that our house would catch fire.”\nMr Hussain said that when he reported the intimidation to Police, he was told: “Stop trying to be a crusader and move out!”\n“In short,” he said, “the Police had wilfully failed us so as not to be labelled racists or seem to cause the Muslim community offence at our suffering and expense.\n“Over the last several years I have been diagnosed with PTSD [post-traumatic stress disorder] and my wife and family also suffer stress and anxiety.\n“Clearly we cannot go on living like this.”\nAccording to the Barnabas Fund, a Charity working with persecuted Christians who is supporting Mr Hussain, no reply to the letter was forthcoming.\nWitnesses to the attack or anyone with information should contact police on 101 and quote reference number 13150 471087.","url":"https://www.breitbart.com/europe/2015/11/20/british-christian-brutally-beaten-outside-home-muslim-neighbours-labelled-blasphemer/"}
