{"authors":["Gerard Couzens For Mailonline"],"date_download":"2018-10-23 03:14:00","date_modify":"2018-10-23 03:14:00","date_publish":"2017-04-26 14:38:52","description":"Irish tourist, 29, is released from Palma cell after being accused of raping British woman, 22, on balcony of Magaluf's HM Martinique Hotel - but reports suggest he still has restraining order.","filename":"data/vaneerConsumption/BritishwomanrapedonMagalufhotelbalconybytourist.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/14/3F9FE58100000578-0-image-a-49_1493213393061.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447598_British-woman-raped-Magaluf-hotel-balcony-tourist_1540264440.html","title":"British woman ‘raped on Magaluf hotel balcony by tourist’","title_page":"British woman ‘raped on Magaluf hotel balcony by tourist’ | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An Irish tourist spent a night in jail after being accused of rape by a British tourist he met on holiday in the Majorcan resort of Magaluf.\nThe 29-year-old was freed by an investigating judge - after being arrested and hauled to court - when investigators found no evidence to back up the alleged victim's claims.\nLast night it emerged the unnamed tourist faced having to find another hotel for the rest of his stay on the Spanish island after reportedly being served with a restraining order, stopping him from going within 500 metres of the 22-year-old British woman, despite being convicted of no crime.\nThe man, 29, was alleged to have raped the 22-year-old British woman on a balcony at the HM Martinique Hotel (shown in a stock image above) in Magaluf\nInvestigators released the man without charge after failing to find any evidence of the alleged rape. Both the man and the woman were staying at the HM Martinique Hotel (shown in a stock image above)\nThe holiday pair, who were staying in HM Martinique Hotel in Magaluf, are understood to have met on Sunday night.\nThe alleged sex attack was said to have taken place on the balcony of the Irishman's room around 6am on Monday.\nCivil Guard officers arrested him on Monday afternoon and threw him in a cell ahead of his private court hearing yesterday.\nHM Martinique Hotel This is not the first time the HM Martinique Hotel has been in the news. British holidaymaker Adam Atkinson, 20, from Castleford, west Yorkshire, died after falling from a fourth-floor stairwell while drunk at the hotel in April 2012. His father Alan hit out afterwards at cheap alcohol deals, saying tougher laws were needed to govern the sales of cheap booze in tourist resorts popular with young people. Last August a 19-year-old British woman cheated death at the hotel after plunging from the fourth floor of the three-star hotel. She hit a ledge over some stairs on the way down.\nThe holidaymaker accused of forcing himself on the Brit told investigating judge Piedad Martin during his court hearing they had sex but insisted it was consensual.\nA source close to the investigation said: 'The woman admitted consenting to kisses but said she had not consented to sex.'\nThe Irishman's version of events is understood to have been strengthened by the testimony of witnesses who said they had seen the pair 'holding hands and kissing' before the alleged sex attack as well as hotel CCTV footage which showed them being affectionate with each other as they returned to their hotel in the early hours of Monday morning.\nNo evidence of a sex attack is said to have been found by experts who examined the British woman after she went to police.\nAnd although she said it happened on his balcony, no-one could be found who confirmed they saw or heard anything out of the ordinary.\nThe Irishman at the centre of the confusing episode was released from custody without charge yesterday.\nHe left the court building in the island capital Palma dressed in the same red shorts, white vest top and black baseball cap that he had been wearing when he was arrested.\nReports emerged after the man was released that he was given a restraining order and banned from going within 500 metres of the woman, despite not being found responsible for any crime. Above, a file picture of Magaluf beach and bay\nNo-one from the courts or the police was available early this morning to confirm local reports he had been banned from going within 500 metres of the British holidaymaker despite his court release.\nOfficers said they were not aware of a restraining order but insisted it was a matter for the courts to discuss.\nThe measure would mean he would have to find another hotel in the resort for the rest of his stay, as well as making it very difficult for him to go out in Magaluf's party strip of Punta Ballena where most foreign holidaymakers pack into bars within a few hundred feet of each other.","url":"https://www.dailymail.co.uk/news/article-4447598/British-woman-raped-Magaluf-hotel-balcony-tourist.html"}
