{"authors":["Steve Doughty","Social Affairs Correspondent For The Daily Mail"],"date_download":"2018-10-22 22:39:33","date_modify":"2018-10-22 22:39:33","date_publish":"2017-03-10 01:21:30","description":"The UK as the least equipped among wealthy nations for mental well-being and the ability to deal with the problems posed by everyday life, according to the Office for National Statistics.","filename":"data/vaneerConsumption/BritonsareamongthemostmiserablepeopleinEurope.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/01/3E1F2BF100000578-0-image-a-36_1489108886438.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299676_Britons-miserable-people-Europe_1540247973.html","title":"Britons are among the most miserable people in Europe","title_page":"Britons are among the most miserable people in Europe | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The mental health of Britons is the worst in western Europe, an official analysis revealed yesterday.\nA report suggests we are suffering stress by choosing careers that cause us to lose touch with family, friends and neighbourhoods.\nA table ranked the UK as the least equipped among wealthy nations for mental well-being and the ability to deal with the problems posed by everyday life.\nAt 59 per cent, Britain was just three points above the Baltic republic of Latvia – which had the lowest score in the European Union.\nBritons trailed far behind the Germans at 66 per cent, the Spanish on 65 per cent and the Dutch on 65 per cent. The Danes were the happiest of all, at 70 per cent.\nOverall, Britain was placed 19th out of the 28 EU countries for mental health, according to an analysis by the Office for National Statistics based on the happiness and life satisfaction among developed countries.\nIn an assessment of how attached Britons feel to their neighbourhood, the UK was second from bottom of all 28 EU member states. Only Germans felt less firm connections to their localities.\nThe report drew on figures from an EU-wide survey that examined levels of calmness, cheerfulness, interest in life, activity and restfulness.\nRankings were based on a scale drawn up by the World Health Organisation to measure mental well-being.\nThe results suggest the increasingly successful British economy is tearing millions of workers from their home areas in the search for the highest paid jobs.\nFamilies also move to find good schools or hunt out affordable homes.\nBut there were warnings from mental health experts yesterday of the damaging effects on levels of stress and well-being that the pace of modern life can bring.\nThe report drew on figures from an EU-wide survey that examined levels of calmness, cheerfulness, interest in life, activity and restfulness\nMental health and well-being – a range of factors including our emotions, thoughts and feelings – is not to be confused with mental illness. Dr Heather O'Mahen, of the University of Exeter's Mood Disorders Centre, said stress is related to our level of social support.\n'This can affect everyone, including high achievers at the top of their game at work,' she said. 'If you don't know your neighbours and have no one to share your accomplishments with – whether it be family, friends, or people in the neighbourhood – the chances are you may feel isolated, and this can lead to feeling stressed, anxious and unhappy.'\nDr Paul McLaren, of the Priory's Wellbeing Centre in London, said: 'Companies downsizing, the longest working hours in Europe, slow wage growth and an expectation to be always 'on' in a highly competitive culture drives up levels of stress that can easily tip into distress.'\nThe consultant psychiatris said a place to live is essential to mental health but many youngsters feel 'exposed and insecure'. 'We have become stressed nomads without roots or community,' he said. 'That is not good for our mental health.'","url":"https://www.dailymail.co.uk/news/article-4299676/Britons-miserable-people-Europe.html"}
