{"authors":["Jack Montgomery"],"date_download":"2018-10-30 22:06:06","date_modify":"2018-10-30 22:06:06","date_publish":"2018-06-28 12:22:31","description":"New population estimates from the ONS suggest Britain's population passed 66 million in 2017, driven largely by immigration.","filename":"data/vaneerConsumption/BritainsExplodingPopulationTopped66Millionin2017.json","image_url":"https://media.breitbart.com/media/2018/06/London-Population.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_06_28__1540937166.html","title":"Britain's Exploding Population Topped 66 Million in 2017","title_page":"Britain's Exploding Population Topped 66 Million in 2017","title_rss":"NULL","source_domain":"breitbart.com","text":"The latest population estimates from the Office for National Statistics (ONS) suggest Britain’s burgeoning population passed 66 million in 2o17, driven largely by immigration.\nThe new figures indicate that net migration accounted for some 59 per cent of population growth, with so-called natural growth — births minus deaths — declining compared to 2016.\nNet migration was also somewhat lower, partly due to increasing wages in Central Europe and the looming prospect of Brexit discouraging some EU migrants — but still very high in historical terms, with the Head of the ONS Population Estimates Unit noting that “the population is still growing faster than at any time since the post-war ‘baby boom’ and the expansion of the EU in 2004”.\nAll in the all, the population increased by 392,000 in the year to mid-2017.\nFigures sympathetic to demographic changes transforming Britain’s population pointed out that the increase in the year to mid-2016 was significantly greater — but the mid-2016 increase was the highest by number of people since mid-1948, and so possibly exceptional.\nOne in three babies born in England and Wales had at least one foreign parent. https://t.co/7gLoXHFhXP — Breitbart London (@BreitbartLondon) August 24, 2017\n“Yet another record population at 66 million,” commented Lord Green of Deddington, chairman of MigrationWatch UK, in a statement Thursday.\n“This is an increase in [one] year alone greater than the population of either Cardiff or Newcastle and more than half of it is down to immigration.\n“When will the government realise that this simply cannot be allowed to go on?”\nMeanwhile, outlets such as The Guardian — the house newspaper of Britain’s establishment left — appeared to suggest that the fact the population is expanding slightly slower than previously would be a problem for “industries that rely on migrant labour”.\nThe positive impact of a decrease in cheap migrant workers on wages and investment in greater productivity was not discussed.\nFollow Jack Montgomery on Twitter: @JackBMontgomery","url":"https://www.breitbart.com/europe/2018/06/28/britains-exploding-population-topped-66-million-2017/"}
