{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:01:41","date_modify":"2018-10-30 21:01:41","date_publish":"2016-09-12 15:00:12","description":"TEL AVIV – A Member of Parliament from the British Labour Party has called on the Home Secretary to bar a senior Palestinian official.","filename":"data/vaneerConsumption/BritishLabourMPCallsToBarPalestinianTerrorPromotingOfficialFromEnteringUK.json","image_url":"https://media.breitbart.com/media/2016/07/wi/afp_80268dbf8b648109f90d445df128c917c28c9f06.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_09_12__1540933301.html","title":"British Labour MP Calls To Bar Palestinian 'Terror Promoting' Official From Entering UK","title_page":"British Labour MP Calls To Bar Palestinian 'Terror Promoting' Official From Entering UK","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – A Member of Parliament from the British Labour Party has called on the Home Secretary to bar a senior Palestinian official and election contender from entry into the UK for inciting to terrorism.\nMP Joan Ryan, who chairs the Labour Friends of Israel, requested that Amber Rudd prohibit entry to Jibril Rajoub, a member of Fatah’s Central Committee and leading candidate to replace Palestinian President Mahmoud Abbas, over charges that Rajoub is guilty of promoting terrorism against Israelis.\nIn a letter to Rudd, Ryan said Rajoub should be denied entry because of his “long and consistent history of making statements which seek to incite terrorism and glorify its perpetrators.”\nIsraeli NGO Palestinian Media Watch documented more than 20 pages of examples of Rajoub’s inciting comments, including a recent declaration that Muhammad Halabi was a “hero” and “a crown on the head of every Palestinian” for attacking an Israeli family in Jerusalem in October, murdering two men and injuring a mother and a two-year old.\nRajoub, who previously served as head of Palestinian security in the West Bank under Yasser Arafat, was in charge of organizing attacks against Israeli forces as far back as the 1960s.\nHowever, according to the London Jewish News, he is also seen as a pragmatist, and during the Oslo Peace Process in the 1990s, Rajoub initiated crackdowns on terror activity by Hamas and Islamic Jihad.\nRyan reminded the Home Secretary that she “has the power to deny entry to Britain to any non-UK national who seeks to foment, justify or glorify terrorist violence or seeks to provoke others to terrorist acts.”\n“I believe that a statement from your department making clear that Jibril Rajoub will be prohibited from entering the UK will send an unequivocal message that Britain does not and will not tolerate the promotion of terrorism,” her letter read.\nRudd’s office has yet to issue a response.\nRajoub made a recent comeback after being out of the political game for years following an IDF raid on his security compound during the Second Intifada. He returned to political life as the head of the Palestinian Football Federation and the Palestinian Olympic Committee, as well as rising in the ranks of the Fatah movement.\nRajoub has voiced sharp criticism of the Palestinian leadership and is hailed as a leading contender in the run-up to elections in the West Bank and Gaza next month.","url":"https://www.breitbart.com/middle-east/2016/09/12/british-labour-mp-calls-to-bar-palestinian-terror-promoting-official-from-entering-uk/"}
