{"authors":["Breitbart News"],"date_download":"2018-10-30 20:54:18","date_modify":"2018-10-30 20:54:18","date_publish":"2014-11-05 11:16:26","description":"LONDON (Reuters) - Britain is not putting enough pressure on China to stick to its side of a pact on the transfer of Hong Kong's sovereignty because it is |","filename":"data/vaneerConsumption/BritainLoathtoPressureChinaoverHongKongBecauseofTradeFormerGovernor.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-London/2014/11/05/a04bdd55-a30a-4b9a-89b0-3ff032e42380jpg.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2014_11_05__1540932858.html","title":"Britain Loath to Pressure China over Hong Kong Because of Trade: Former Governor","title_page":"Britain Loath to Pressure China over Hong Kong Because of Trade: Former Governor | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"LONDON (Reuters) – Britain is not putting enough pressure on China to stick to its side of a pact on the transfer of Hong Kong’s sovereignty because it is worried about damaging trade links, former Hong Kong governor Chris Patten said on Tuesday.\nChina took back control of the former British colony in 1997 through a “one country, two systems” formula that allows wide-ranging autonomy and specifies universal suffrage as an eventual goal.\nBut Beijing said in August it would effectively screen candidates who want to run for city leader, a decision that has prompted weeks of street protests by pro-democracy activists who said it rendered the notion of democracy meaningless.\nLast month, British Prime Minister David Cameron said it was important the people of Hong Kong were able to enjoy the freedoms promised to them, drawing criticism from China.\nCameron has not directly criticised China publicly, however, and the Foreign Office has not escalated the matter.\n“When China asserts that what is happening in Hong Kong is nothing to do with us, we should make it absolutely clear publicly and privately that is not the case,” Patten told a panel of British lawmakers holding an inquiry into Hong Kong’s progress towards democracy.\n“There has always been quite a strong group in government and the business community which believes that you can only do business with China if you carefully avoid in all circumstances treading on China’s toes or saying anything the Chinese disagree with,” he said.\n“It encourages China to behave badly that we go on doing that.”\nRead more at Reuters","url":"https://www.breitbart.com/europe/2014/11/05/britain-loath-to-pressure-china-over-hong-kong-because-of-trade-former-governor/"}
