{"authors":["Associated Press"],"date_download":"2018-10-22 23:28:40","date_modify":"2018-10-22 23:28:40","date_publish":"2016-01-28 12:24:36","description":"LONDON (AP) — The British government, pressured by major charities to do more to help migrant children in dire need, announced plans Thursday to allow an uns...","filename":"data/vaneerConsumption/Britainannouncesplanstotakeinmigrantchildren.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420826_Britain-announces-plans-migrant-children_1540250920.html","title":"Britain announces plans to take in migrant children","title_page":"Britain announces plans to take in migrant children | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Britain announces plans to take in migrant children\nLONDON (AP) — The British government, pressured by major charities to do more to help migrant children in dire need, announced plans Thursday to allow an unspecified number of vulnerable children to come live legally in Britain.\nBritain also said it will provide more funding to the European Asylum Support Office to help Greece and Italy reunite migrants, including children, with family members already in Europe.\nThe government's latest measures to help with the migrant crisis challenging much of Europe comes after charities led by Save the Children and opposition leaders urged it to accept 3,000 children immediately because they are already in Europe and living in harsh conditions. The children are judged to be at risk of traffickers and sex abusers.\nImmigration Minister James Brokenshire said under the new program Britain will work with the United Nations refugee agency to identify \"exceptional cases\" in which unaccompanied children would benefit by receiving shelter in Britain. He said in most cases, however, a child displaced by the war in Syria would be better off staying close by their home country.\n\"The vast majority are better off staying in the region so they can be reunited with surviving family members,\" he said. \"So we have asked the UNHCR to identify the exceptional cases where a child's best interests are served by resettlement to the UK and help us to bring them here.\"\nKitty Arie of Save the Children said support for reuniting families in Europe could potentially benefit thousands of children.","url":"https://www.dailymail.co.uk/wires/ap/article-3420826/Britain-announces-plans-migrant-children.html"}
