{"authors":["Kenya Foy"],"date_download":"2018-10-30 22:35:57","date_modify":"2018-10-30 22:35:57","date_publish":"2014-08-15 00:06:40","description":"Too bad predicting the lottery numbers isn't as easy as predicting that plans for a Lifetime biopic about Brittany Murphy wouldn't be welcomed by the late actress' family. The project was just announced earlier in the week along with a premiere date…","filename":"data/vaneerConsumption/BrittanyMurphysFatherPlansToSueOverLifetimeBiopicNoOnesSurprised.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/662ff378-fe50-45e1-98e3-03ec3ecfb073.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35869-brittany-murphys-father-plans-to-sue-over-lifetime-biopic-no-ones-surprised_1540938957.html","title":"Brittany Murphy's Father Plans To Sue Over Lifetime Biopic & No One's Surprised","title_page":"Brittany Murphy's Father Plans To Sue Over Lifetime Biopic & No One's Surprised","title_rss":"NULL","source_domain":"bustle.com","text":"Too bad predicting the lottery numbers isn't as easy as predicting that plans for a Lifetime biopic about Brittany Murphy wouldn't be welcomed by the late actress' family. The project was just announced earlier in the week along with a premiere date of Sept. 6. However, Murphy's father has wasted no time publicly voicing his objections to the film.\nAccording to the Daily Mail, Angelo Bertolotti is prepared to sue Lifetime because, like some of its other biopics, this one is also unauthorized by the subject's family. Reportedly in a statement to Radar Online, Bertolotti stated, \"Lifetime has not been authorized to produce the true story of Brittany Murphy.\" He also added, \"I intend to litigate Lifetime in a court of law.\"\nThat is absolutely not a good sign, but it's also not surprising. A Brittany Murphy biopic would most certainly be of interest considering her film roles, in particular her portrayal of Tai in the cult-classic \"Clueless,\" along with the mystery surrounding her untimely passing in 2009. But if Bertolotti goes through with his plans, production on this film about his daughter's life could come to a halt. Unlike some of the other controversial biopic subjects that have been met with resistance from loved ones, what makes filming a movie about the late actress' life even more touchy are reports that Bertolotti is still actively investigating Murphy's death.\nLifetime has yet to back down from pleas by the families of Whitney Houston or Aaliyah to stop production on those respective projects, but that doesn't mean that they'll get away with steam-rolling the Murphy family. Even though they don't seemed to be concerned with having a bad reputation for disregarding the families' wishes, in the end, they stand to lose more than fans who might miss out on the chance to see Brittany Murphy's life story on TV.","url":"https://www.bustle.com/articles/35869-brittany-murphys-father-plans-to-sue-over-lifetime-biopic-no-ones-surprised"}
