{"authors":["Hannah Hudson"],"date_download":"2018-10-23 00:01:28","date_modify":"2018-10-23 00:01:28","date_publish":"2016-01-11 08:25:22","description":"From how to stay hydrated during long-haul flights to the must-have beauty products to ensure you always look fresh-faced, British Airways' crew reveal their top rejuvenating skin tips.","filename":"data/vaneerConsumption/BritishAirwayscrewrevealhowtolookfiveyearsyoungeraftera12hourflight.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/08/14/2FEA106400000578-0-image-a-7_1452261988994.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3390375_British-Airways-crew-reveal-look-five-years-younger-12-hour-flight-sorry-means-ditching-make-up_1540252888.html","title":"British Airways crew reveal how to look five years younger after a 12-hour flight","title_page":"British Airways crew reveal how to look five years younger after a 12-hour flight | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Even if you step off the plane feeling less than your best, there's no need for anyone else to know.\nAnd who better to ask for tips on how to keep yourself fresh and fashionable than those who spend most of their lives in the air?\nTheclub.ba.com asked British Airways' crew members to share their top tips and products that help them look the part as they travel and their must-haves may surprise you...\nTheclub.ba.com asked British Airways' flight crew to share their top tips for arriving at your destination looking - and feeling - refreshed (stock photo)\nFirst Officer Chloe Harrison, Airbus A320 fleet\n'While I wouldn't say I look 100 per cent fresh at the end of a flight, I do have a few tricks. Dry shampoo is fantastic because it stops my hair from going flat. You can buy it in small cans so it fits nicely in your hand luggage.\n'My luxury indulgence is my MAC eyebrow pencil; it helps me look pulled together in less than a minute. I don't wear a lot of make-up while I'm flying, as my skin feels cleaner without it. Plus, I can splash water on my face to freshen up without mascara running down my cheeks.\n'Before I land, I might put on a slick of MAC lipstick and a dusting of Bare Minerals powder. It's easy to pack because it's not a liquid product, and is available in [the onboard duty free magazine] High Life Shop.\n'My travel essential is coconut oil, which I use everywhere from my lips to my scalp. It's solid at room temperature, so I can carry it with me in an old Vaseline tin.'\nJennifer Forest, Cabin Crew\n'My secret to looking fresh on arrival is to make sure I'm properly hydrated. I stick to plain warm water or herbal non-caffeine teas, and try to drink at least one cup every hour. It's great for your digestive system as well as your skin.\n'I never travel without facial oil. It cleans skin by dissolving dirt and grime, and doesn't leave your face dry. I like it because I don't have to pack a separate cleanser and toner.\nMany flight attendants recommend making every effort to stay hydrated - it's good for skin and digestion (stock photo)\n'I would also recommend bringing a mini bottle of your favourite scent on board – I find dabbing a little on my pulse points during a long flight gives me that little pep-up to get me through.\nIf I want to indulge, I'll pre-book a relaxing massage for after a long flight. It helps with circulation and eases achy muscles. It also seems good for jetlag as I always sleep like a baby afterwards.'\nGilly Comfort, Senior Cabin Crew\n'My beauty must-have is a really hydrating moisturiser to combat dry and dull skin. I'm currently using Rodial Dragon's Blood Moisturiser.\n'Blusher is a must for work, as aircraft lighting tends to wash out my complexion. I use Chanel Joues Contraste in 64 Pink Explosion. My other saviour is the old classic – Yves Saint Laurent Touche Éclat. It really is unbeatable at hiding dark circles.\nA must-have travel essential is coconut oil, as it's a solid at room temperature - meaning you can take it through security (stock photo)\n'Laura Mercier Long Lash Mascara and Shu Uemura eyelash curlers both do a miraculous job of making me look awake when I'm tired. Estée Lauder's Double Wear is my go-to foundation. I've tried so many but this one looks the same as when I applied it 15 hours before.'\nFirst Officer Aoife Duggan, Airbus A320 fleet\n'The best way to look fresh at the end of a long flight is to remove your make-up when you get on board. The cabin air is very dry and old make-up can look cakey – it's much better to reapply it rather than topping it up. I actually prefer a tinted moisturiser to foundation, as it seems to keep my skin more hydrated.\n'My wonder product is Bio-Oil. I use it as eye cream, on dry skin patches and on breakouts to reduce scarring. When I'm flying long-haul I carry a facial mist, which I spray to keep my skin hydrated. I also drink a lot of water.\n'My luxury must-have is Elemis Pro Collagen Marine Cream. It's expensive, but my skin really seems to appreciate the rich moisture it delivers.'","url":"https://www.dailymail.co.uk/travel/travel_news/article-3390375/British-Airways-crew-reveal-look-five-years-younger-12-hour-flight-sorry-means-ditching-make-up.html"}
