{"authors":["Sadie Whitelocks For Mailonline"],"date_download":"2018-10-22 21:52:31","date_modify":"2018-10-22 21:52:31","date_publish":"2017-03-10 00:01:46","description":"Reykjavik saw the biggest price increase in 2016 with visitors paying an average of £130 for hotels compared to £96 in 2015. Other pricier destinations included Lanzarote and Malaga.","filename":"data/vaneerConsumption/Britishholidaymakershitbyhikesofupto35inEurope.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/12/3E1A8A4A00000578-0-image-a-4_1489062184969.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-4297130_British-holidaymakers-hit-hikes-35-Europe_1540245151.html","title":"British holidaymakers hit by hikes of up to 35% in Europe","title_page":"British holidaymakers hit by hikes of up to 35% in Europe | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"British holidaymakers in Europe paid up to 35 percent more for their hotel rooms in 2016 compared to the previous year as a result of the deflated pound, new research has revealed.\nReykjavik saw the biggest price increase in 2016 with visitors paying an average of £130 for hotels compared to £96 in 2015 - a 35 percent leap.\nOther popular European destinations which became considerably pricier for Brits as a result of the Brexit-hit sterling included Lanzarote, Dusseldorf, Cork, Dublin, Malaga and Copenhagen.\nReykjavik saw the biggest price increase with visitors paying an average of £130 for hotels compared to £96 in 2015 - a 35 percent leap\nThe research around European price increases for Brits was conducted by Hotels.com as part of the booking site's annual Hotel Price Index.\nIt found that prices for accommodation in Gran Canaria were hit by a similar hike due to the poor pound to euro exchange rate, with a 26 percent increase for Brits from £82 to £103.\nIn the wake of the Brexit vote, the pound sunk 11 per cent to its lowest level against the US dollar for 31 years. The euro exchange rate also plunged nine percent during that time.\nSpooked by the chaos, some major travel money firms suspended online offers and savvy customers started cashing in on the crumbling pound.\nEUROPEAN DESTINATIONS THAT BECAME MORE EXPENSIVE FOR BRITS IN 2016 TABLE TITLE EUROPEAN CITY PRICE PAID FOR HOTEL BY BRITS IN 2015 PRICE PAID FOR HOTEL BY BRITS IN 2016 YEAR-ON-YEAR PERCENTAGE INCREASE Reykjavik £96 £130 35% Gran Canaria £82 £103 26% Lanzarote £78 £97 24% Cork £74 £92 24% Dublin £95 £114 21% Malaga £83 £69 19% Santorini £142 £121 18% Barcelona £97 £112 16% Copenhagen £107 £124 16% Lisbon £78 £89 14% Source: Hotels.com\nPrices for accommodation in Gran Canaria were hit by a similar hike due to the poor pound to euro exchange rate, with a 26 per cent increase for Brits from £82 to £103\nDespite price increases for British travellers, the findings reveal that Brits continued to travel to all corners of the globe with New York, Bangkok and Dubai among the most popular destinations visited.\nParis was the number one destination for Brits to visit in 2016. .\nIsabelle Pinson, Vice President, EMEA for Hotels.com, commented: 'While the British Pound didn't stretch as far in 2016 compared to 2015, that clearly hasn't stopped UK travellers from spreading their wings rather than burrowing in until the currency's fortunes improve.'\nAnalysts highlighted that those looking for bargain when it comes to holidaying in 2017 should head to Asia.\nIn Pattaya, Thailand, Brits paid as little as £33 for four star accommodation last year.","url":"https://www.dailymail.co.uk/travel/travel_news/article-4297130/British-holidaymakers-hit-hikes-35-Europe.html"}
