{"authors":["Oliver Jj Lane"],"date_download":"2018-10-30 22:04:31","date_modify":"2018-10-30 22:04:31","date_publish":"2018-07-09 14:09:08","description":"Prominent Brexiteer and senior government minister Boris Johnson has resigned his cabinet post on Monday afternoon, following his colleague David Davis who departed as Brexit Secretary Sunday evening.  | London / Europe","filename":"data/vaneerConsumption/BritishForeignSecretaryBorisJohnsonResignsGovernmentAmidBrexitRebellion.json","image_url":"https://media.breitbart.com/media/2018/05/wi/afp/06/3b0nu9_britain-foreign-secretary-boris-johnson-has-travelled-washington-speak-e1531145223146.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_07_09__1540937071.html","title":"British Foreign Secretary Boris Johnson Resigns Government Amid Brexit Rebellion","title_page":"British Foreign Secretary Boris Johnson Resigns Government Amid Brexit Rebellion | Breitbart Boris Johnson Resigns UK Govt Amid Brexit Rebellion","title_rss":"NULL","source_domain":"breitbart.com","text":"Prominent Brexiteer and senior government minister Boris Johnson resigned his cabinet post Monday afternoon, following his colleague David Davis who departed as Brexit Secretary Sunday evening.\nThe development will leave Theresa May looking increasingly vulnerable, as a growing Brexit rebellion attempts to face off her move to lead Britain into a so-called Brexit in name only, where Britain will remain mostly tied to the European Union.\nThe Prime Minister’s office responded quickly, and curtly, with a Downing Street spokesman remarking: “This afternoon, the Prime Minister accepted the resignation of Boris Johnson as Foreign Secretary. His replacement will be announced shortly. The Prime Minister thanks Boris for his work.”\nReaction to the departure in Westminster was instant, with British Conservative veteran Iain Duncan Smith remarking it was “inevitable” while talking down Theresa May’s plan. Labour figure David Lammy also weighed in, saying that after the latest developments the government and Brexit were both now “on the ropes”, suggesting remain-backing politicians were looking to seize the opportunity to kill off the Brexit process altogether.\nThe political editor of Conservative-leaning British magazine The Spectator took to Twitter to reveal what he had come to understand of the resignation from sources, stating that Boris Johnson now beleieves that a so-called no-deal hard Brexit would be better for the country than the Prime Minister’s soft Chequers plan. It has been the long-standing contention of key Brexiteers like Jacob Rees-Mogg and Nigel Farage that no deal must be, by definition, better than a bad deal.\nUPDATE: 'David Davis says European Union will wield 'Sword of Damocles' over Britain in May's plan' https://t.co/3LmYuEC7s2 — Breitbart London (@BreitbartLondon) July 9, 2018\nTheresa May faced the House of Commons less than an hour after Johnson’s resignation to make a scheduled statement on the Brexit process and answer questions. Although May thanked Johnson and David Davis at the beginning of her statement, she moved quickly on and batted away questions about her leadership and the changes in her cabinet.\nThe departure of Boris Johnson comes less than 24 hours after his cabinet colleague David Davis, the leave-supporting Brexit Secretary, walked away from Theresa May’s governing team, arguing it was not “plausible” that he be able to defend the government’s Brexit strategy. Noting Theresa May’s proposal of a soft Brexit, with the United Kingdom being dictated to by the European Union through a ‘common rulebook’ would hand Brussels the “Sword of Damocles” to hang over the head of the British government, Davis said it would not be a true Brexit at all.\nSpeaking Monday morning after his departure, Davis said May’s Brexit would give Parliament “illusory rather than real [power]. It’s painting something as returning sovereignty, returning control to the House of Commons but in practice it isn’t doing so.”\nThis story is developing","url":"https://www.breitbart.com/europe/2018/07/09/british-foreign-secretary-boris-johnson-resigns-government-amid-brexit-rebellion/"}
