{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 22:10:54","date_modify":"2018-10-30 22:10:54","date_publish":"2016-12-15 00:00:00","description":"The taxpayer-backed British Business Bank has financed £93.2 million-worth of loans on the platform, out of a total of over £1 billion made by the platform.","filename":"data/vaneerConsumption/BritishBusinessBankfunds9ofpeertopeerMarketInvoicesloans.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_british-business-bank-funds-9-of-peer-to-peer-marketinvoices-loans-2016-12_1540937454.html","title":"British Business Bank funds 9% of peer-to-peer MarketInvoice's loans","title_page":"    British Business Bank funds 9% of peer-to-peer MarketInvoice's loans - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"MarketInvoice co-founders Anil Stocker, left and Ilya Kondrashov. MarketInvoice LONDON — The taxpayer-backed British Business Bank is providing a major boost to fintech MarketInvoice, new figures show.\n9% of loans by value made over MarketInvoice's platform to date have been financed by money from the government-backed British Business Bank, according to a Freedom of Information request seen by Business Insider.\nThe bank has provided the cash for £93.2 million-worth of loans on the platform, out of a total of just over £1 billion made by the platform.\nThe British Business Bank was set up by the government in 2012 with £1 billion of funding to increase funding to small and medium enterprises (SMEs). It does not finance SMEs directly but work through partners and intermediaries to extend funding.\nThe MarketInvoice lending figures show the bank has played a major role in the development of the peer-to-peer business lending sector.\n\"For us, it's a good relationship,\" Aman Mehra, MarketInvoice's head of investor development, told Business Insider. \"The fact that we're working with them [the British Business Bank], it definitely gives more confidence to everyone involved.\"\nMarketInvoice's online platform applies the peer-to-peer lending model to invoice financing, a form of business lending where companies can borrow money against unpaid invoices. It is effectively a way for businesses to get hold of money they're due in the future today, although at a discount. The platform is only open to professional investors.\nThe British Business Bank has been lending businesses money through MarketInvoice since 2013 and has financed 9,108 loans. The biggest was worth £857,098.\n\"When we look at that volume it shows how much we're able to channel through to small businesses today,\" Mehra says. \"The motivation for them [the British Business Bank] is to channel funds to SMEs. The last time I checked the stats, 80% [of SMEs on the platform] are ones that don't get access to finance anywhere else.\"\nWhile the £93.2 million lending figure may seem high, the British Business Bank has only £15 million invested on the platform. MarketInvoice's loans typically mature after 40 days and the money is reinvested on the platform.\nMehra says: \"If you look at the amount they have committed and if you look at the cumulative amount they have funded, the amount of impact they have versus someone like Funding Circle, it's a lot higher when they work with us.\"\nThe Freedom of Information request shows that the British Business Bank has £60 million committed to lending over Funding Circle's platform but longer loan times on the platform means it has only funded £64 million worth of loans. The figure equates to less than 1% of the value of all loans made on Funding Circle.\nThe British Business Bank also lends money to businesses over RateSetter, another peer-to-peer platform. However, it has funded just £9.1 million of loans, less than half a percent of the total value of lending on the platform.\nMehra says: \"Sector-wise we're pretty diversified but a lot of it is high-tech and new businesses that are looking for growth capital. These are small businesses that go to the bank and they are maybe not able to give them a loan or price the loan appropriately. They don't know how to measure their risk. They come to us and we give them funding.\"\nWhile the British Business Bank's investment on these platforms is helping to finance small businesses, the Taxpayer Alliance raised concerns about the practice with Business Insider earlier this week and said it is \"extremely concerning.\" It comes after the Financial Conduct Authority (FCA), Britain's financial regulator, warned last week of \"evidence of potential investor detriment\" in the sector, although no firms were named.\nMarketInvoice declined to comment on the FCA report. The BBB declined to comment on its relationship with MarketInvoice.","url":"https://www.businessinsider.com/british-business-bank-funds-9-of-peer-to-peer-marketinvoices-loans-2016-12"}
