{"authors":["Joe Ridge For Mailonline"],"date_download":"2018-10-23 03:09:46","date_modify":"2018-10-23 03:09:46","date_publish":"2016-01-11 15:51:39","description":"The British and Irish Lions coaching team for next year's tour to New Zealand will be announced late in the summer. Wales head coach Warren Gatland is the favourite to take charge of a third tour.","filename":"data/vaneerConsumption/BritishandIrishLionscoachtobenamedinlatesummerwithWarrenGatlandfavourite.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300B530900000578-0-image-a-88_1452527394358.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-3394128_British-Irish-Lions-coach-named-late-summer-Warren-Gatland-favourite_1540264186.html","title":"British and Irish Lions coach to be named in late summer with Warren Gatland favourite","title_page":"British and Irish Lions coach to be named in late summer with Warren Gatland favourite | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The British and Irish Lions coaching team for next year's tour to New Zealand will be announced late in the summer, with chief executive John Feehan insisting that events between now and then will be the deciding factor on who is given the task.\nWales head coach Warren Gatland is the favourite to take charge of a second successive tour, having overseen the triumph in Australia in 2013. He was assistant coach in South Africa in 2009.\nBut Feehan, who also confirmed that the Lions will not be making a stop-off despite offers from the United States, the Far East and the Middle East, insists that no decision has been made yet with the Six Nations around the corner.\nBritish and Irish Lions Ambassadors Gregor Townsend, Keith Wood, Shane Williams and Martin Johnson\nThe former Lions were joined by chief executive John Feehan (third left) and Standard Life CEO Keith Skeoch\nBritish and Irish Lions f ixtures 2017 June 3 - Provincial union team (Toll Stadium, Whangarei) June 7 - Blues (Eden Park, Auckland) June 10 - Crusaders (AMI Stadium, Christchurch) June 13 - Highlanders (Forsyth Barr Stadium, Dunedin) June 17 - Maori (International Stadium, Rotorua) June 20 - Chiefs (Waikato Stadium, Hamilton) June 24 - New Zealand (First Test, Eden Park, Auckland) June 27 - Hurricanes (Westpac Stadium, Wellington) July 1 - New Zealand (Second Test, Westpac Stadium, Wellington) July 8 - New Zealand (Third Test, Eden Park, Auckland).\n'We have got to work to our own schedule,' said Feehan at Monday's Lions launch, where Standard Life Investments were confirmed as the tour's sponsors. 'What happens with individuals unions, or indeed at clubs, will happen. Results will go different ways and you'll get changes - those things happen.\n'We have got be sure that we have sufficient time and that the coach has enough time to properly prepare for the tour. So we have a timeframe which we kind of have to adhere to and obviously anybody who is in situ as an international coach, particularly in the home unions, will come into consideration.\n'We're not going to make any decisions today, it's too early, we'll see what happens over the next six or seven months.'\nThe Lions stopped off in Hong Kong for a match en route to Australia in 2013 but next year's tour will be confined to the home of the world champions, with 10 matches scheduled in June and July.\n'We don't have the time for it (a stop-off),' added Feehan. 'We'd love to have done it but we don't have the time.\nChief Executive John Feehan said the Lions coaching team would be named late in the summer\nLeigh Halfpenny celebrates the British and Irish Lions' series victory over Australia in 2013\n'We have 10 games in New Zealand this time, more than in Australia, and we just don't have the time for an 11th game. It's a shame but it's one of those things.\n'We had looked at it but, we've had huge interest from various regions around the world including the States, the Far East and the Middle East. There are lots of places that would have loved to have entertained the Lions but frankly we felt there was just too much involved in dragging people from place to place in this instance, given the sheer difficulty of this tour.'\nFeehan is confident that the Lions will avoiding a repeat of the logistical and rugby nightmare which was the whitewash in New Zealand in 2005.\n'We learned a lot from 2005,' he added. 'We learned a lot about how not to do it.\n'We really did make quite a lot of changes for South Africa and it nearly came off, we could easily have won that series. Then we did win the series in Australia, so we have learned some lessons from our last tour of New Zealand that should give us a chance.\n'It's a chance. It's a better chance.'","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-3394128/British-Irish-Lions-coach-named-late-summer-Warren-Gatland-favourite.html"}
