{"authors":["Richard Shears For The Daily Mail"],"date_download":"2018-10-22 23:50:36","date_modify":"2018-10-22 23:50:36","date_publish":"2016-01-11 07:41:59","description":"The friends and family of backpacker Lucy Hill, 21, a who is holidaying in Thailand, are asking travellers with a negative blood type to donate and after a car crash left her in critical condition.","filename":"data/vaneerConsumption/BritishbackpackerLucyHillsfamilyappealforrarebloodtypedonations.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/07/3005577500000578-0-image-a-93_1452496182085.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393404_Family-British-backpacker-21-appeal-desperately-rare-blood-type-fights-life-Thai-hospital-following-moped-crash_1540252236.html","title":"British backpacker Lucy Hill's family appeal for rare blood type donations","title_page":"British backpacker Lucy Hill's family appeal for rare blood type donations | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Family and friends of a young British backpacker have launched a social media campaign to source donations of the rare blood type she needs as she fights for her life in a Thai hospital after a moped crash.\nLucy Hill, 21, from Berry, was at the start of a ‘trip of a lifetime’ in the Far East when her fun gap year holiday ended with a horrific crash in the northern town of Chiang Mai.\nThe young graduate was said by a friend today to be in the Rajavej Chiang Mai hospital in a critical condition after suffering a brain haemorrhage and a broken pelvis when her moped was involved in an accident with a car.\nLucy Hill, 21, is fighting for her life after suffering a brain haemorrhage and a broken pelvis when her moped was involved in an accident with a car\nHer friends have launched a social media campaign to source donations of the rare blood type she needs\nShe was rushed to the hospital on Saturday and has since had three blood transfusions, and was fitted with titanium plates in her pelvis.\nToday her family and friends made an international appeal to help find the rare A-negative blood she needs.\nHer brain injury and the failure to find A-negative blood locally is causing her family the greatest concern.\nIn a Facebook post today a friend wrote:\n‘Calling All Travellers in Chiang Mai or Coming to Chiang Mai in Thailand.\n‘Help is needed. Yesterday my friend and I were out for the day when Lucy suffered an accident being hit by a car whilst on a moped.\n‘She is now in intensive care and has had emergency surgery but is needing blood transfusions.\n‘Negative blood is rare in Thailand and sourcing the blood is difficult...My friend wore a helmet and did nothing wrong.'\nThe 21-year-old was rushed to the hospital on Saturday and has since had three blood transfusions, and was fitted with titanium plates in her pelvis\nMiss Hill's family and friends made an international appeal to help find the rare A-negative blood she needs\nHer brain injury and the failure to find A-negative blood locally is causing her family the greatest concern\nMiss Hill’s mother, Alison is flying out to Thailand to begin a vigil by her daughter’s bedside vigil with her travelling friend, 19-year-old Lauren Hall.\nThe young graduate from Leeds Beckett University was just one week into her gap year when her moped was hit by a car early on Saturday morning.\nDoctors have told her friend Lauren that fewer than one per cent of Thai people have negative blood types, which has resulted in Miss Hill’s family and friends launching the social media campaign to try to find Western travellers or ex-patriates who might have the same blood type.\nFriends said the search for the right blood group has become ‘a race against time.’\nThe young graduate from Leeds Beckett University was just a week into her gap year when her moped was hit\nThe young graduate was said by a friend today to be in the Rajavej Chiang Mai hospital in a critical condition after suffering a brain haemorrhage\nMiss Hill’s holiday plans included travelling through Thailand, Vietnam, Cambodia and Australia\nMiss Hill’s holiday plans included travelling on the ‘backpacker trail’ through Thailand, Vietnam, Cambodia and Australia.\nHer father, Phil Hill, 54, told the Manchester Evening News that the family had been told the driver of the car involved in the crash had been travelling on the wrong side of the road and knocked Lucy off her moped.\n‘She is in a bit of a mess,’ he said. ‘It is early days to see how she progresses. We don’t know how serious it is.’\nMr Hill said he had been nearly physically sick when he heard the ‘upsetting’ news.\nHer father, Phil Hill, 54, told the Manchester Evening News that the family had been told the driver of the car involved in the crash had been travelling on the wrong side of the road\nTragically Miss Hill (left) follows a large number of Britons who have come to grief in Thailand and neighbouring countries during the warm summer months of the southern hemisphere\nThe family had been running around trying to find flights to Thailand, he said.\n‘It is my daughter. You would do anything for your own child. We want her to be well.\n‘As soon as she gets home, the better. Not knowing is hard.’\nTragically Miss Hill follows a large number of Britons who have come to grief in Thailand and neighbouring countries during the warm summer months of the southern hemisphere.\nThe Foreign and Commonwealth Office has issued warnings to British travellers to exercise great care in those countries - but it appears that in Miss Hill’s case taking care was no protection against an allegedly careless car driver.\nLucy Hill is fighting for her life after her moped was hit by a car in Thailand. Here she is pictured (left) with her friend Lauren Hill","url":"https://www.dailymail.co.uk/news/article-3393404/Family-British-backpacker-21-appeal-desperately-rare-blood-type-fights-life-Thai-hospital-following-moped-crash.html"}
