{"authors":["John Hutchinson For Mailonline"],"date_download":"2018-10-23 03:02:39","date_modify":"2018-10-23 03:02:39","date_publish":"2016-01-11 15:32:35","description":"Jim Sharland, 87, who has cancer of the bladder and prostate, as well as diabetes and glaucoma, contracted pneumonia on a Cunard cruise in the West Indies with a friend.","filename":"data/vaneerConsumption/BritishAirwaysshowedlackofcompassiontoseriouslyillpensioner.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/3007125700000578-0-image-a-19_1452520849491.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3393855_BA-blasted-showing-lack-compassion-quoting-ill-pensioner-son-4-200-emergency-flights-UK-site-charging-1-500_1540263759.html","title":"British Airways showed 'lack of compassion' to seriously ill pensioner","title_page":"British Airways showed 'lack of compassion' to seriously ill pensioner | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"British Airways has been accused of showing a 'lack of compassion' by the son of a seriously ill octogenerian who claims the family were quoted £4,200 for emergency flights back to UK when another site was charging £1,500.\nJim Sharland, 87, who has cancer of the bladder and prostate, as well as diabetes and glaucoma, contracted pneumonia on a Cunard cruise in the West Indies with a friend.\nBut the family had to book emergency flights for the pensioner as well as his son who had to fly out to Antigua to care for him.\nJim Sharland, left, fell ill when on a cruise in the West Indies. Hos son Ian (right) flew out to care for him, and both had to pay over £4,000 on emergency BA flights back to the UK\nMr Sharland was enjoying a peaceful cruise in the West Indies with companion Joan Thornton, 82, when he fell ill and had to leave the ship.\nThe ship was docked in St. John's, Antigua and Mr Sharland was admitted to Mount St. John's Medical Centre, while the Queen Elizabeth cruise ship left for Southampton without them.\nMrs Thornton was forced to find her own accommodation while Mr Sharland was being treated for six days at the centre.\nThe two octogenarians had no idea what to do next, despite being in contact with cruise liner Cunard's Californian Care Team, and were stuck in a hotel room following his discharge on December 8.\nThe costs escalated as Jim's son Ian had to fly out to Antigua to tend to his 87-year-old father and bring the pair back. But after booking emergency flights with British Airways, the family claim to have been left thousands out of pocket due to inflated ticket costs, and have hit out at the airline for their 'lack of compassion'.\n'When I arrived, my fears were the worst,' said Ian, 65, a retired butcher.\n'I thought I was going to be taking him back in a box. He was just sat there in a room at The Heritage Hotel. My dad had been given a week's worth of antibiotics and discharged to this hotel, which Joan found herself.'\n'At first we didn't know what hospital he was at and did not know the full extent of his condition as both Joan and my dad are not good with mobile phones. We thought the best way was for myself to go over there and bring them both back. Even though Cunard were in touch with them, there was no one in Antigua to help. They were just left in a strange land on their own.'\nAfter he was said to be too ill to fly home, Mr Sharland was forced to spend Christmas day abroad\nIan's brother Keith, of Huddersfield, West Yorkshire, said: 'Ian flew out with the aim of booking my dad and Joan onto extra seats on his return flight. 'Instead Ian had to give Joan his seat on the flight back as my dad was just too ill to fly.\n'We rang Cunard to find out where he was but they refused to tell us anything because we were not listed as his next of kin. In fact, he had left it blank. Luckily their American office in California was great and managed to track them down for us but the time difference made everything go very slowly.'\nIan was charged £750 for Joan to fly back in his seat - £118 more than the original price of the ticket, which had already been paid. Keith, 59, said: 'They were there over Christmas because my father was too ill to fly, so we had to spend it apart.\n'Eventually they were given the go-ahead to fly back.' Booking through the British Airways website, Ian, 65, was quoted $6,225 for the pair to return to the UK, the equivalent of £4,244.\nKeith said: 'They were shocked - especially as the flights were only £1,551 on Tripsta (a budget flight booking website).\n'My father is extremely ill and it was Christmas: don't they care?\n'He did take out insurance, but he has been told he'll only be covered for 40 per cent of the costs.'\nThe pensioner was finally able to fly back to the UK from Antigua, but his family believe BA's flights were over-inflated\nIan, 65, of Beaumont Park, said: 'It's been extremely stressful.'\nIan added his credit cards had also been cancelled while he was in Antigua, adding to the stress of the trip.\nA spokeswoman for British Airways declined to comment on the flight ticket prices, and said the charge for Joan's seat was part of the airline's policy.","url":"https://www.dailymail.co.uk/travel/travel_news/article-3393855/BA-blasted-showing-lack-compassion-quoting-ill-pensioner-son-4-200-emergency-flights-UK-site-charging-1-500.html"}
