{"authors":["James Tozer For The Daily Mail"],"date_download":"2018-10-22 22:00:19","date_modify":"2018-10-22 22:00:19","date_publish":"2016-01-11 01:58:19","description":"The interfering mother-in-law has been a staple of British humour for generations. But now it is her French equivalent who is being blamed for what is said to be an epidemic of cross-Channel divorces.","filename":"data/vaneerConsumption/BritishwivesbeingdrivencrazybytheirFrenchmothersinlaw.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/1B121DCE000005DC-0-image-a-111_1452477351347.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393265_British-wives-driven-crazy-French-mothers-law_1540245619.html","title":"British wives being driven crazy by their French mothers-in-law","title_page":"British wives being driven crazy by their French mothers-in-law | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The interfering mother-in-law has been a staple of British humour for generations.\nBut now it is her French equivalent – the belle mère – who is being blamed for what is said to be an epidemic of cross-Channel divorces.\nBritish women who marry French men have increasingly been driven to walking out by their mother-in-laws’ overbearing and nit-picking manner, it was claimed yesterday.\nThe interfering mother-in-law has been a staple of British humour. But now it is her French equivalent – the belle mère – who is being blamed for what is said to be an epidemic of cross-Channel divorces (file photo)\nOne, named only as Sally, a 46-year-old lawyer originally from London, left her businessman husband Jean-Claude shortly before Christmas, taking their five-year-old daughter with her.\nShe had concluded he always cared more about his mother Matilde than her, the Sunday Times reported.\n‘He never really left his maman,’ she said. ‘Matilde came on all our holidays as well as for Christmas.\n‘She would sit there criticising my cooking, the way I ironed his shirt. But she would never lift a finger to help.’\nBut when Sally complained to Jean-Claude it made things worse, she told the newspaper: ‘He couldn’t see what the problem was. He got really angry with me.’\nAnother British woman referred to as Claire said she had become estranged from Michel, her husband of 12 years, in large part down to her mother-in-law, Sonia.\n‘She arrived for our wedding without anything to wear and my husband spent two days before the event going round shops with her to look for an outfit,’ she told the paper.\nBritish women who marry French men have increasingly been driven to walking out by their mother-in-laws’ overbearing and nit-picking manner, it was claimed yesterday (file photo)\nClaire also recalled a family dinner during which Sonia, without looking at her, casually asked her son: ‘Does she dye her hair?’\nThere are no statistics available for the divorces of British women and French men, but anecdotal evidence suggests an epidemic, according to the Sunday Times.\nInternet chat sites for foreign residents regularly feature questions about how to get on better with their new family.\nJill Bourdais, a therapist for American couples in Paris, said mothers who dote on their sons and criticise their wives are part of a ‘Latin culture’ that ‘Anglo-Saxon’ brides without their own support system can struggle to cope with.","url":"https://www.dailymail.co.uk/news/article-3393265/British-wives-driven-crazy-French-mothers-law.html"}
