{"authors":["Joseph Curtis For Mailonline"],"date_download":"2018-10-23 05:24:14","date_modify":"2018-10-23 05:24:14","date_publish":"2017-03-16 16:14:37","description":"Lance Corporal Ronald Blackham, who was killed in action in southern Italy during the Second World War aged 22, was finally laid to rest 73 years after his death at a funeral today.","filename":"data/vaneerConsumption/BritishsoldierkilledinWWIIlaidtorest75yearslater.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/18/3E578CA900000578-0-image-a-2_1489690112406.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320770_British-soldier-laid-rest-75-years-death_1540272254.html","title":"British soldier killed in WWII laid to rest 75 years later","title_page":"British soldier killed in WWII laid to rest 75 years later | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The devoted sister of a British war hero was finally able to bid an emotional farewell to her brother - as his body was buried almost 75 years after he died storming a German-held hill during the Second World War.\nAlma Williams, 80, watched on as her sibling Ronald Blackham was given a soldier's burial, two years after his remains were discovered in a shallow grave and DNA tests confirmed he had been found after a 71-year search.\nSurrounded by four generations of her family, Ms Williams clung on to a portrait of her long-lost brother and a Union flag, while little Conan, 2, playfully donned the cap of the brave great-grand-uncle he will never meet.\nIn a heartwarming ceremony, the lance corporal was finally put to rest with full military honours at Salerno war ceremony, a few hundred feet from the Italian village where he lifeless body would lay undisturbed for three-quarters of a decade.\nThe 22-year-old, who served in the 3rd Battalion Coldstream Guards, was killed fighting for king and country during a fierce battle on September 25, 1943, as he fought to liberate Hill 270 from the Nazis.\nAfter an agonising wait stretching over seven decades, his family received the news in 2014 that his remains had been found by a group of voluntary historians, the first official confirmation that he had even died in battle.\nLance Corporal Ronald Blackham, of the 3rd Battalion Coldstream Guards, who died in southern Italy during the Second World War, was buried today 73 years after his death. He was killed near Capezzano in 1943 trying to take a hill from Axis forces. His coffin is pictured here being carried to his grave at the Commonwealth War Graves Commission (CWGC) Salerno War Cemetery\nHis sister Alma Williams, 80, pictured left at the funeral and right with a picture of her brother, was his only sibling to attend the service. She was just six years old when he died and said it devastated her family and left her mother 'unable to speak for six weeks'\nEven though the occasion was a sad one, L/Cpl Blackham's great-grand-nephew Conan, centre, brought a smile to his relative's faces, including his great-great-grandmother Alma, left\nThe body of the 22-year-old, pictured left and right in uniform, was found in a shallow grave near Salerno in 2014, alongside a Coldstream Guards cap badge. A DNA test later confirmed his identity after the Ministry of Defence was able to track down his brother Douglas\nAround 19 members of his wider family travelled to the cemetery in Salerno, Italy, today to witness the soldier finally being laid to rest seven decades after his death\nAmmunition from an Enfield rifle and the Coldstream Guards cap badge indicated the remains were of a British soldier, and tests confirmed his identity after the Ministry of Defence tracked down his brother Douglas.\nNow, 73 years on, 19 members of his family have travelled to Salerno to see him buried at the war cemetery, along with the remains of two other unknown Coldstream Guards soldiers found nearby.\nMrs Williams, the only sibling attending the funeral, said the discovery of the remains was the first official confirmation that her brother had died, and had left her 'speechless'.\nShe said: 'Our first thoughts, my brother and I, we thanked God at last he's not roaming the world not knowing who he is, and at last they've found him.\n'It's just amazing, it's shock. It's turmoil in your brain - you don't know whether you're coming or going, whether it's true or whether it's false.'\nL/Cpl Blackham was born in Weaverham, near Northwich in Cheshire, on October 6, 1920, the eldest of four boys and two girls.\nJill Morris, British Ambassador to Italy and San Marion, pictured at the lectern, attended the ceremony today to read a poem during the service, which was also attended by Italian veterans\nThe youngest member of the Cheshire-based family to attend was L/Cpl Blackham's great-grand-nephew Conan, two, who remained unaware of the seriousness of the occasion and enjoyed wearing a military hat, pictured\nAfter leaving school he worked for the Imperial Chemical Industry until he joined the army, enlisting at 19 in the Coldstream Guards, on June 18, 1940.\nDespite being just six when he died, Mrs Williams remembers her brother as a tall man of 6ft 4in who kept pigeons and enjoyed snooker and football with friends.\nOnce, when he returned to the army from leave, her mother Florence pointed out horse chestnut candle blossoms on the trees - a lifelong memory that still brings a tear to her eye.\nMrs Williams, also from Weaverham, said: 'She took me to the window, looked out and said: 'When the candles come back on the tree, Ron'll be back home on leave, so it's all right.'\n'Now, every time you see the candles growing it sticks in your mind - your mum said he'll be home, but he never came.'\nIn September 1943 the Allies landed on the Salerno beaches in Italy, their first major landing in occupied Europe.\nAt noon on September 25, the Coldstream Guards were brought in to mount an attack on Hill 270, north of Salerno, using thick trees as cover to infiltrate the bottom of the hill.\nVeterans and family members stood solemnly as his coffin was laid into the ground, pictured, and his body was finally placed in a proper resting place at the Italian cemetery\nThe family, including Ms Williams, centre, and L/Cpl Blackham's nephew Michael, second right, also stood to observe the last salute during the burial service\nA specially commissioned tombstone, left, described L/Cpl Blackham, who grew up in Northwich in Cheshire, as a 'beloved son and brother'. Pictured right are some of the items found with his body, including a Coldstream Guards badge\nNo 1 company - including L/Cpl Blackham - and No 3 company of the 3rd Battalion began advancing from the nearby Capella Ridge, but as they left the sheltered woods German machine gunners opened fire, hurling mortars and grenades among their barrage of bullets.\nDuring the battle the Guards suffered 120 casualties, including L/Cpl Blackham.\nMrs Williams remembers how a man on a bike came to the house to deliver the fateful news.\nShe said: 'I was with mum at the front door, she opened this envelope and collapsed on the stairs with a stroke after reading it - 'missing presumed dead'.\n'For the simple reason, she knew what had happened.\n'Apparently the week before she had had a dream, that she was swimming in a river with Ron and the water was red, and she said: \"Something's happened to my lad.\"\nMs Williams and Michael Blackham also attended a press conference in Italy today to commemorate the funeral, at which Ms Williams said she remembered her brother as a '6ft 4ins man who kept pigeons and enjoyed snooker and football with friends'\nL/Cpl Blackham was buried alongside two unknown Coldstream Guards, coffins pictured, whose bodies were found nearby\n'I had to go and get dad out of bed. He came and carried her up the stairs and she didn't speak for six weeks.'\nThe service was organised by the MOD’s Joint Casualty and Compassionate Centre (JCCC), part of the Defence Business Services, and was conducted by The Reverend Jacob Caldwell CF, Chaplain to the 1st Battalion Coldstream Guards.\nSue Raftree, of the JCCC said: 'These brave men fought for their country to make our lives better. The service today was to honour all three and to enable the family of Lance Corporal Ronald Blackham to have closure after over 70 years.\n'It has been a privilege to be able to identify L/Cpl Blackham and we will continue with our investigations to identify the two unknown soldiers.'\nNic Andrews, of the CWGC, added: 'Lance Corporal Ronald George Blackham along with two of his fellow Coldstream Guards, whose identities are not known, have been laid to rest at the Commonwealth War Graves Commission’s Salerno War Cemetery.\n'Today’s burial ceremony is an opportunity to give thanks for their service and to remember the sacrifices made by all who died during the Second World War.\n'The CWGC is honoured to care for them and all those Commonwealth servicemen and women who died during the two world wars, in perpetuity.'\nDuring the fierce battle near Capezzano, the Guards suffered 120 casualties, including L/Cpl Blackham. Here the coffin of one of the unknown soldiers is pictured being carried to his grave\nMs Williams and Michael Blackham also laid poppy wreaths in memorial to L/Cpl Blackham as other family members watched on in solemn silence","url":"https://www.dailymail.co.uk/news/article-4320770/British-soldier-laid-rest-75-years-death.html"}
