{"authors":["Press Association"],"date_download":"2018-10-23 01:12:07","date_modify":"2018-10-23 01:12:07","date_publish":"2017-03-10 09:03:05","description":"The review´s damning indictment of its \"dysfunctional\" and \"inept\" leadership came in a draft report leaked to the Daily Mail.","filename":"data/vaneerConsumption/BritishCyclingtofightbackafterleakedreportlandsstingingblows.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/23/wire-198481-1489186990-169_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4300436_Leaked-report-questions-British-Cycling-s-board-fit-govern_1540257127.html","title":"British Cycling to fight back after leaked report lands stinging blows","title_page":"British Cycling to fight back after leaked report lands stinging blows | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"British Cycling’s board is preparing a robust response to the stinging criticism it has received from an independent review into its “culture and climate”.\nThe review’s damning indictment of its “dysfunctional” and “inept” leadership came in a draft report leaked to the Daily Mail.\nCo-commissioned by British Cycling and elite funding agency UK Sport, the 10-month inquiry into allegations of bullying and discrimination has been conducted by a five-strong panel led by British Rowing chair Annamarie Phelps.\nPlease see my statement in response to British Cycling here: https://t.co/vrHZjAzS3S — Jessica Varnish (@JessVarnish) October 28, 2016\nAlready months late, its publication is being held up by a process known as Maxwellisation, a legal procedure which gives individuals criticised in an inquiry the right of reply.\nAn anonymised version of the report was sent to all concerned parties last week and they have until next week to respond with objections, although those involved – British Cycling, UK Sport and the Cycling Independent Review Panel – have expressed their “disappointment” at the publication of the draft.\nA joint statement on Friday night said each page had been marked as ‘strictly private and confidential’ and watermarked with ‘draft’. The statement added the contents may change and that all relevant participants had been reminded of that.\nPress Association Sport understands the key players, such as former British Cycling performance director and current Team Sky boss Sir Dave Brailsford and British Cycling’s ex-technical director Shane Sutton, have pushed back hard against the draft findings, which were written by the panel’s legal expert John Mehrzad.\nAccording to the Mail, the draft report describes an organisation so fixated on medals that “a culture of fear” exists, where dissenting voices are shown the door, bullying and sexism is tolerated and dominant personalities like Brailsford and Sutton are left unchecked by a board unfit for purpose.\nShane Sutton gives evidence to the Culture, Media and Sport select committee\nBut even more damaging than these general findings – based on submissions from more than 80 individuals linked to the Great Britain cycling team over the last decade – are the specific criticisms related to the incident that sparked the review.\nThat was the decision to not renew Jess Varnish’s lottery-funding contract last April, a month after she criticised British Cycling coaches for a muddled approach to Olympic qualifying in the women’s team sprint event.\nThe 26-year-old sprinter and her team-mate Katy Marchant came up short of what was needed at the 2016 track world championships but only Varnish was released, with Marchant going to Rio and winning a bronze medal in the individual sprint.\nVarnish, however, did not go quietly, telling the Mail that Sutton had used sexist language towards her and told her to “go and have a baby” – claims he denies.\nBut within days, other former riders had come forward to make similar allegations and Sutton, an Australian with a matter-of-fact approach, resigned.\nGreat Britain's Jess Varnish (Tim Ireland/PA)\nThat prompted both the Phelps review and an internal investigation led by British Cycling director Alex Russell, an exercise that eventually found Sutton guilty of one of nine charges – a conclusion that left both Sutton, who expected to be exonerated, and Varnish, who wanted vindication, threatening legal action.\nThe review’s initial take on this process makes for excruciating reading for British Cycling, as it accuses the board of “sanitising” and even “reversing” Russell’s findings in an attempt to clear Sutton, a man who even his critics acknowledge is a fine coach.","url":"https://www.dailymail.co.uk/wires/pa/article-4300436/Leaked-report-questions-British-Cycling-s-board-fit-govern.html"}
