{"authors":["Nick Hallett"],"date_download":"2018-10-30 20:58:42","date_modify":"2018-10-30 20:58:42","date_publish":"2015-07-27 12:12:02","description":"Britain has wasted a fortune on funding schemes for foreign police forces that have increased crime, corruption and political repression. Over the past |","filename":"data/vaneerConsumption/BritishAidMakingForeignPoliceEvenMoreCorrupt.json","image_url":"https://media.breitbart.com/media/2015/07/GettyImages-465206620-1024x711.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_07_27__1540933122.html","title":"British Aid 'Making Foreign Police Even More Corrupt'","title_page":"British Aid 'Making Foreign Police Even More Corrupt' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Britain has wasted a fortune on funding schemes for foreign police forces that have increased crime, corruption and political repression.\nOver the past four years, Diana Good, who was appointed to scrutinise Britain’s foreign aid funding, found numerous examples of how it was making things even worse for developing countries.\nThe Times reports that in Bangladesh, for example, Britain funded a project allowing police to collect the fingerprints of 40,000 criminals even though fingerprint evidence is not admissible in court. Police were also given software to help them track phones, despite concerns they were using this suppress political opposition groups.\nBritish taxpayers’ money also helped set up victim support units in Malawi but women were too scared of the police to use them. Meanwhile, in the Democratic Republic of Congo, the conduct of police officers under a UK-funded reform programme deteriorated to such an extent that the Department for International Development (DfID) was forced to cancel it.\nLocals reported police officers were involved in crime, and presence of police often made security worse. In one incident, police killed eight men and a boy in a campaign against delinquency.\nMs Good was one of the first members of the Independent Commission on Aid Impact. She told the Times: “Security and justice is an area that lacks an overall strategy. It lacks management attention… It’s an area that DfID used to lead the way in but they seem to have lost that position.”\nA spokesman for the department said: “These are the most challenging sectors we work in but [they] offer the biggest reward for creating a safer, wealthier and more secure world — all of which are in the UK’s interest. We have no hesitation in shutting programmes down where concerns about human rights and instability become too high.”\nLast week, Breitbart London reported how Britain “dumped” £500m on a controversial aid charity just to meet an arbitrary government target. Officials sent the money to Swiss-based Global Fund, which almost collapsed in 2011 amid allegations of fraud and in-fighting.\nThe group’s staff receive annual remuneration packages in excess of $200,000 while spending $13 million a year on renting office space.\nJonathan Isaby, chief executive of the TaxPayers’ Alliance, said: “The question must be asked: is our aid policy designed to improve the lives of people in the developing world, or simply for feel-good headlines?”","url":"https://www.breitbart.com/europe/2015/07/27/british-aid-making-foreign-police-even-more-corrupt/"}
