{"authors":["Ben Spencer Medical Correspondent For The Daily Mail"],"date_download":"2018-10-22 20:09:13","date_modify":"2018-10-22 20:09:13","date_publish":"2016-01-29 00:34:38","description":"Only one in every 200 children in the UK – just 0.5 per cent – is breastfed until the age of 12 months, placing us bottom of a global league table published in The Lancet medical journal last night.","filename":"data/vaneerConsumption/Britishmumsbreastfeedingratesaretheworstinworld.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/00/23B5215C00000578-0-image-a-44_1454027654889.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3421956_British-mums-breastfeeding-rates-worst-word_1540238953.html","title":"British mums' breastfeeding rates are the worst in world","title_page":"British mums' breastfeeding rates are the worst in world | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rates of breastfeeding in Britain are the lowest in the world, a major study reveals.\nOnly one in every 200 children here – just 0.5 per cent – is breastfed until the age of 12 months, placing us bottom of a global league table published in The Lancet medical journal last night.\nBy comparison, 27 per cent in the US, 35 per cent in Norway, 44 per cent in New Zealand and 92 per cent in India are breastfed until they are one year old.\nOnly one in every 200 children in the UK – just 0.5 per cent – is breastfed until the age of 12 months, placing us bottom of a global league table published in The Lancet medical journal last night (file image)\nThe study, led by experts from the World Health Organisation and Unicef, said that child obesity, diabetes and infections could all be significantly reduced if more mothers could be persuaded to breastfeed.\nWomen themselves would also benefit, with breast cancer rates reduced among those who had breastfed their children. It is also said to make it easier for mothers to regain their pre-pregnancy figure.\nThe NHS suggests that women should feed their babies exclusively with breast milk until they are at least six months old, and then continue breastfeeding while gradually introducing other food.\nWomen are advised by the NHS: ‘The longer you breastfeed, the longer the protection lasts and the greater the benefits.’\nSome 80 per cent of British mothers breastfeed at some point. But it seems most turn to formula very early in their child’s life.\nAccording to the Lancet study, only 34 per cent of British children are breastfed until six months, compared to 49 per cent in the US, 50 per cent in Germany and 62 per cent in Switzerland.\nIn many developing nations, including India, Ghana and Bhutan, rates of breastfeeding exceed 95 per cent at six months and 90 per cent at 12 months.\nThe NHS suggests that women should feed their babies exclusively with breast milk until they are at least six months old, and then continue breastfeeding while gradually introducing other food\nThe researchers wrote: ‘In the UK, the milk formula market is the 11th largest in the world and growing, with sales projected to reach $907million (£631million) in 2019.’ They estimated that breastfeeding in high-income countries such as Britain reduces the risk of sudden infant deaths by more than a third. It also may increase intelligence, they said.\nThe research team estimates that 800,000 children’s lives around the world could be saved each year if breastfeeding levels could be raised to ‘near-universal’ levels.\nAn extra 20,000 women’s deaths from breast cancer could also be saved, they found.\nThe team did not break down their life-saving predictions for individual countries.\nBut separate recent research by Unicef UK estimated that if breastfeeding rates in Britain were to double, 865 breast cancer cases would be averted each year, saving the NHS £21million.\nDr Martin Ward-Platt, consultant paediatrician at the Royal Victoria Infirmary in Newcastle upon Tyne, said: ‘We have to go back to the 1960s to see high rates of breastfeeding across the country. There was a huge cultural change after the Second World War, when it was thought to be modern, scientific and desirable to use formula feed instead.’\nProfessor Russell Viner, of the Royal College of Paediatrics and Child Health, said: ‘The benefits of breastfeeding have been widely publicised yet it’s clear that efforts are still falling far too short and the grave reality is that this is costing children’s lives.’\nProfessor Viv Bennett, chief nurse at Public Health England, said: ‘There is strong evidence which tells us that breastfeeding provides benefits for babies.\n‘We recognise however that not all mothers choose, or are able, to breastfeed and infant formula is the only alternative to breast milk for babies under 12 months old.’\nTHE BENEFITS FOR MOTHER... Women can get their pre-pregnancy figures back by breastfeeding – a fact that doctors use to tempt mothers to avoid formula milk. Feeding a baby with breast milk burns up to 500 calories a day – the same as a typical gym session – and also helps the uterus return to its normal size after birth. Liverpool Women’s Hospital, on a web page promoting the practice, says: ‘Breastfeeding doesn’t just provide wonder food for babies, it helps a woman regain her shape more quickly. ‘Being free, it is also far less expensive than bottle feeding, leaving mum cash to buy clothes for her newly regained figure.’ Oxford University researchers have calculated that for every six months a woman gives her baby breast milk, she can expect to lose around 2lb, depending on her initial weight and height. As well as the initial benefits, academics estimate that this could prevent deaths from cancer, heart problems and other illnesses related to obesity. Doctors and midwives are increasingly concerned that many women become obese by gaining weight during pregnancy, which they never manage to shift after the birth.","url":"https://www.dailymail.co.uk/health/article-3421956/British-mums-breastfeeding-rates-worst-word.html"}
