{"authors":["Kadeen Griffiths"],"date_download":"2018-10-30 23:44:28","date_modify":"2018-10-30 23:44:28","date_publish":"2014-08-13 12:45:54","description":"It has only been five years since Brittany Murphy passed away, but for some it can feel like just yesterday that the Clueless and Girl, Interrupted star was tragically taken from us — especially since her last film, Something Wicked, was just…","filename":"data/vaneerConsumption/BrittanyMurphyBiopicComingtoLifetimeThisOneCouldBeDisrespectfullyUnauthorizedToo.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/e1a0aecc-8b04-4855-9e3a-e53a5807ffb4.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35570-brittany-murphy-biopic-coming-to-lifetime-this-one-could-be-disrespectfully-unauthorized-too_1540943068.html","title":"Brittany Murphy Biopic Coming to Lifetime & This One Could Be Disrespectfully Unauthorized Too","title_page":"Brittany Murphy Biopic Coming to Lifetime & This One Could Be Disrespectfully Unauthorized Too","title_rss":"NULL","source_domain":"bustle.com","text":"It has only been five years since Brittany Murphy passed away, but for some it can feel like just yesterday that the Clueless and Girl, Interrupted star was tragically taken from us — especially since her last film, Something Wicked, was just released in April 2014. However, Lifetime endeavors to keep her legacy alive by releasing a Brittany Murphy biopic in September 2014 starring Amanda Fuller of Last Man Standing fame. This kind of news should probably be good news, because Murphy's legacy is definitely worthy of honoring. However, Lifetime doesn't exactly have the best track record with biopics right now and its tendency toward controversy might reduce our enjoyment of the biopic a bit.\nIts most recent controversial biopic was the one about Aaliyah that Zendaya Coleman backed out of. You see, Lifetime decided to green-light that project without the permission of Aaliyah's family and, suffice it to say, they don't approve. At all. The reason that they don't approve is that they feel that Aaliyah's legacy would be best honored on the big screen with a feature film that truly does her justice, but another key component of their disapproval is that Lifetime didn't approach them for their input in the TV film about their daughter's life. Obviously this doesn't sit right with the family and it doesn't sit right with the fans as well, some of whom even got together to make a petition to get the Aaliyah biopic shut down. Despite that controversy, Lifetime has replaced Zendaya Coleman with Alexandra Shipp, and the biopic is powering forward.\nThe other biopic that has been causing a lot of negative press to be thrown Lifetime's way is the Whitney Houston one that they have planned. Much like the Aaliyah biopic, Houston's family doesn't approve of the film. In fact, Houston's mother spoke out about the insensitivity of appearing in a film made by people who didn't know Houston and begged people to just \"let her rest.\" Despite that, Lifetime has shown absolutely no signs of halting production on the film and have even cast Yaya DaCosta of America's Next Top Model fame as the headlining star.\nNow Lifetime has revealed that they have a Brittany Murphy biopic coming up and, according to the Wrap, \"Lifetime has not revealed the source material for the script, so it is unknown if the film is authorized at this time.\" Considering Lifetime's track record with these kinds of things, it's probably safe to say that it hasn't been authorized. In fact, I wouldn't be surprised to hear Murphy's family speak out in the next few months about their lack of involvement in the project. Why Lifetime continues to cross lines by making films about icons without input or involvement from the people who actually knew them is beyond me, but it's incredibly insensitive.\nFor a network that proclaims itself to be for women, Lifetime could at least do these women the honor of not profiting off their deaths unless their families are on board with the project and it's done in an incredibly respectful way. No matter how true to life they try to make these biopics, the sheer fact that they are disregarding the wishes of the families involved is disrespectful.\nImage: Rebloggy (2)","url":"https://www.bustle.com/articles/35570-brittany-murphy-biopic-coming-to-lifetime-this-one-could-be-disrespectfully-unauthorized-too"}
