{"authors":["Lianna Brinded"],"date_download":"2018-10-30 22:17:36","date_modify":"2018-10-30 22:17:36","date_publish":"2016-12-14 00:00:00","description":"Officials working for the Department for Exiting the EU are complaining that the government has yet to draw up a clear plan over how it is pursuing a Brexit","filename":"data/vaneerConsumption/BritainsDepartmentforExitingtheEUDEXEUofficialscomplainonstrategy.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_britains-department-for-exiting-the-eu-dexeu-officials-complain-on-strategy-2016-12_1540937856.html","title":"Britain's Department for Exiting the EU (DEXEU) officials complain on strategy","title_page":"    Britain's Department for Exiting the EU (DEXEU) officials complain on strategy - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The UK economy has taken a huge hit from the EU referendum. Lewis Whyld / PA Archive/Press Association Images LONDON — Officials that work for the Department for Exiting the EU (DEXEU), led by David Davis, are allegedly complaining that the government has yet to draw up a clear plan over how it is pursuing a Brexit, yet it is asking it to draw up departmental plans for 2019.\nThe Financial Times reported one \"Whitehall figure\" saying: \"At the moment, departments are writing up their core assessments on how Brexit might affect their operations after we leave. But it is all proving chaotic because none of us actually knows what kind of deal the government is aiming at.\"\nThe comment falls neatly in line with a report released on Wednesday about how there is \"uncertainty and concern\" within the department that is charged with the task of helping manage Britain breaking away from the EU.\nThe think tank, the Institute for Government said in a report that while \"there are clear signs of progress in preparations,\" it also found \"uncertainty in departments about what they are required to do before Article 50 is triggered, concerns about capacity, and a lack of preparation for what life will be like outside the European Union.\"\n\"Some of the departments most affected will have to work out how to meet the demands imposed by Brexit with a shrinking budget,\" it added.\nYou can read the full report here.\nDEXEU is between a rock and a hard place\nBut this is just the latest in reports that Britain's government is struggling to manage the Brexit process.\nIn November, the former head of the Foreign Office in Britain, Sir Simon Fraser, told a House of Commons Committee that the British government's lack of a clear Brexit plan is prompting senior officials to think about quitting.\nHe said \"civil servants don't feel they have clear political direction at the moment,\" and some are thinking of quitting their posts.\nIn another report by the Financial Times, several civil servants backed up Fraser's claim by saying they are preparing to quit. One told the paper: \"I've done my best.\"\nDEXEU is between a rock and a hard place.\nBritain voted for a Brexit by a slim majority on June 23 and, since then, there has been much speculation on when the new prime minister, Theresa May, will trigger Article 50 and start the official two-year negotiation process for Britain to leave the EU. March 2017 is the current target date.\nTechnically negotiations do not start until Article 50 has been triggered. Therefore it would be incredibly difficult for the department to understand what it needs to prepare for.\nMay said she will not give a \"running commentary\" on how negotiations are going but she has made it clear in various speeches that her government is prioritising immigration restrictions. This would imply a \"hard Brexit\" because the EU's official line is that it will not allow the UK to curb immigration and keep membership of the single market at the same time.\nThe Institute for Government said that there a few things that the government can do, however, to solve some of the issues at DEXEU. This includes:","url":"https://www.businessinsider.com/britains-department-for-exiting-the-eu-dexeu-officials-complain-on-strategy-2016-12"}
