{"authors":["Michael Gadd For Mailonline"],"date_download":"2018-10-23 04:25:13","date_modify":"2018-10-23 04:25:13","date_publish":"2016-01-11 17:32:12","description":"Brixham centre Tom McLean will think twice before beginning his try celebrations after the ultimate gaffe in Saturday's all-Devon National League 3 South West clash with Barnstaple.","filename":"data/vaneerConsumption/BrixhamrugbysTomMcLeanslidesinforatryoverthewronglineinDevon.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/20/300D6A0E00000578-0-image-a-5_1452543718452.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-3394274_Worst-bombed-try-Brixham-rugby-player-slides-five-pointer-finds-s-dived-wrong-line-smashed-Barnstaple-defenders_1540268713.html","title":"Brixham rugby's Tom McLean slides in for a try over the wrong line in Devon","title_page":"Brixham rugby's Tom McLean slides in for a try over the wrong line in Devon | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Brixham centre Tom McLean will think twice before beginning his try celebrations after the ultimate gaffe in Saturday's all-Devon National League 3 South West clash with Barnstaple.\nMcLean, who according to his profile on the club website is nicknamed The Gift, gave his opponents a late Christmas present when he stylishly slid over what he thought was the tryline, only to soon discover he'd come up several yards short.\nTorrential rain before and during the match at Pottington Road provided The Fishermans' No 13 with the ideal conditions for a memorable finish for the try, and after his slide McLean began celebrations as expected.\nBrixham's Tom McLean (left) begins celebrating what he believes is a try against Barnstaple on Saturday\nThe outside centre goes for a stylish sliding finish for his 'try' in the National League 3 South West clash\nBut instead of his Brixham teammates running to help him celebrate, he was smashed by a wall of Barum defenders who couldn't believe their luck.\nIn such quagmire conditions, tries were as expected hard to come by and McLean's break only came about when the hosts chanced their hand after forcing a turnover with the centre claiming the intercept.\nOnly making matters worse, Brixham ended up losing the match 6-0, meaning a converted try would have been enough to reverse the result against the top of the table side - Brixham are fourth.\nHaving left Chiefs defenders in his wake, McLean in fact put the ball down several metres short of the line\nAs the centre nicknamed The Gift gets up to celebrate, Barnstaple players realise his incredible gaffe","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-3394274/Worst-bombed-try-Brixham-rugby-player-slides-five-pointer-finds-s-dived-wrong-line-smashed-Barnstaple-defenders.html"}
