{"authors":["Allyson Koerner"],"date_download":"2018-10-31 01:42:39","date_modify":"2018-10-31 01:42:39","date_publish":"2018-09-14 16:21:51","description":"After much speculation, the news Hills fans have been waiting for is finally official. Brody Jenner announced his return to The Hills on Instagram on Thursday. That's right, Brody is joining MTV's reboot of the reality TV classic The Hills: New…","filename":"data/vaneerConsumption/BrodyJennerAnnouncedHisHillsReturnWithAnInstagramPhotoThatllMakeFansLaugh.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/73cafedd-33f6-4146-a25b-e506cfeffe7c-getty-502986024.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_brody-jenner-announced-his-hills-return-with-instagram-photo-thatll-make-fans-laugh-11919689_1540950159.html","title":"Brody Jenner Announced His 'Hills' Return With An Instagram Photo That'll Make Fans Laugh","title_page":"Brody Jenner Announced His 'Hills' Return With An Instagram Photo That'll Make Fans Laugh","title_rss":"NULL","source_domain":"bustle.com","text":"After much speculation, the news Hills fans have been waiting for is finally official. Brody Jenner announced his return to The Hills on Instagram on Thursday. That's right, Brody is joining MTV's reboot of the reality TV classic The Hills: New Beginnings. Of course, he shared the exciting news in a way that will probably make fans say, \"Yep, that's Brody.\"\nAre you ready for this? The 35-year-old posted a photo of his face on a massive billboard on Sunset Boulevard in Hollywood, California. Along the bottom of the picture, the show's title \"The Hills\" with MTV's logo can be seen. Then, in the top right corner, there is a plane flying a banner reading: \"New Beginnings.\"\nYep. That sounds about right. Brody captioned his Instagram:\n\"Don't call it a comeback. THE HILLS: New Beginings [sic] coming soon to @mtv #haterswillsayitsphotoshopped.\"\nThe photo and caption is just so Brody. He also tagged his wife, Katilynn Carter, in the picture. She will most likely also be part of the show. In addition to Kaitlynn, Brody tagged Heidi and Spencer Pratt, Audrina Patridge, Frankie Delgado, Stephanie Pratt, Justin Bobby, and Whitney Port, who are also all set to return for more reality TV action, per Us Weekly. The outlet reports that Jason Wahler will also reportedly be seen on the reboot.\nAs for Lauren Conrad and Kristin Cavallari, it appears they are both steering clear from the reboot. That said, Kristin's E! reality series, Very Cavallari, scored a renewal, so at least you can get your fill of her whenever it returns for Season 2.\nUpon Brody's big news, two of his Hills costars commented on his IG in hilarious ways. Spencer wrote, \"So many prayers answered.\" Then, Frankie replied to Spencer, \"it's gotta be the crystals.\" Frankie is obviously referring to Spencer's passion for crystals and The Hills Season 6 episode when he declared, \"I'm trying to keep it in my crystals.\"\nBrody Jenner/Instagram (screenshot)\nPrior to his confirmation, The Hollywood Reporter shared on Thursday that Brody \"reached a deal with MTV\" for New Beginnings. At the time, MTV declined to comment on the report. Bustle also previously reached out to Jenner's reps, but did not receive an immediate response.\nMTV on YouTube\nDuring the 2018 MTV Video Music Awards held on Aug. 20, fans got excited upon seeing Spencer, Heidi, Audrina, Justin Bobby, Stephanie, Jason, and Frankie all walking the pink carpet together. Later that evening a teaser for The Hills: New Beginnings dropped confirming the revival. In the teaser, Stephanie is heard saying, \"It’s like we’re all growing up. It’s weird.\" A new version of Natasha Bedingfield's \"Unwritten,\" the original Hills theme song, also plays.\nIn late August, Cosmopolitan reported New Beginnings had already started filming, based on photos shared by the publication of Audrina and Stephanie being filmed.\nWith the addition of Brody, the reboot seems to have a solid cast. It will be interesting to see if any other familiar faces join or make cameos once the series airs.","url":"https://www.bustle.com/p/brody-jenner-announced-his-hills-return-with-instagram-photo-thatll-make-fans-laugh-11919689"}
