{"authors":[],"date_download":"2018-10-30 19:51:39","date_modify":"2018-10-30 19:51:39","date_publish":"2016-12-26 16:33:49","description":"KANSAS CITY, Mo. (AP) — Ten months ago, confetti rained down on the Denver Broncos after they won the Super Bowl. | Sports","filename":"data/vaneerConsumption/BroncosGetBouncedfromPlayoffContentionbyChiefs.json","image_url":"https://media.breitbart.com/media/2016/12/broncos-chiefs.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2016_12_26__1540929099.html","title":"Broncos Get Bounced from Playoff Contention by Chiefs","title_page":"Broncos Get Bounced from Playoff Contention by Chiefs | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"KANSAS CITY, Mo. (AP) — Ten months ago, confetti rained down on the Denver Broncos after they won the Super Bowl.\nOn Sunday night, the only thing coming down was rain.\nThe Kansas City Chiefs dashed all Denver’s remaining hopes of a repeat with a 33-10 rout at wet, sloppy Arrowhead Stadium that knocked the Broncos from postseason contention.\n“We can’t win all the time,” Denver cornerback Chris Harris Jr. said. “We had a great run. Five straight AFC titles. I guess it’s time for somebody else to win.\n“It’s frustrating, but I mean, the way we played today, we don’t deserve to go in the playoffs.”\nIt wasn’t always that way for Denver.\nThe Broncos started the season 4-0 and went into their bye week with a 7-3 record. But in their ensuing game against Kansas City, they blew an eight-point lead with 3 minutes remaining, and the Chiefs wound up getting two field goals in overtime for the victory.\nThat loss sent the Broncos into a downward spiral, and they have lost four of their last five games.\n“We’re not playing well enough offensively,” Broncos coach Gary Kubiak said. “I’m responsible for that. I’ve got to do a better job. Obviously we’re not getting enough out of our opportunities. I take responsibility for that. We’ve all got to work on it, but I take responsibility for that.”\nThe Broncos (8-7) aren’t used to preparing for an offseason in December. They had played in five straight playoffs and reached two Super Bowls since the last time they were eliminated early.\nDenver isn’t used to losing to the Chiefs, either. The last time Kansas City won both games against its longtime divisional rival was in 2000.\n“It stinks,” Broncos quarterback Trevor Siemian said. “There’s no other way to put it. It’s frustrating right now, but this is part of the deal. We knew we had to win the next two to give ourselves a chance and we didn’t get it done. Regroup this week and give it our best against Oakland.”\nNext week’s game has playoff implications as well, just not for the Broncos. If Denver upsets the Raiders and the Chiefs beat San Diego, it will be Kansas City that wins the AFC West.\nIf Oakland wins or Kansas City loses, the Raiders will earn the No. 2 seed for the playoffs.\n“It’s been a tough one, but 2016 has been great to us as a whole,” said Broncos linebacker Von Miller, trying to put a positive spin on it. “We lost some, but we won some. … I can’t sit here at the end of the season like, ‘Man, this year’s been bad for us.’ You got to be able to take the good with the bad (and) 2016 had some good stuff for us. We got to let 2016 go and start working on 2017.”","url":"https://www.breitbart.com/sports/2016/12/26/broncos-get-bounced-playoff-contention-chiefs/"}
