{"authors":["Rebecca Lawrence For Mailonline"],"date_download":"2018-10-23 05:41:23","date_modify":"2018-10-23 05:41:23","date_publish":"2016-01-29 21:24:21","description":"He's forged a successful career in front of the camera. But Brooklyn Beckham has decided to step behind the lens for his latest job, working as a photographer for Burberry.","filename":"data/vaneerConsumption/BrooklynBeckhamlandsjobasphotographerforBurberryfragrancecampaign.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/21/30B56B0A00000578-0-image-a-4_1454103587898.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423380_Brooklyn-Beckham-prepares-step-camera-lands-job-photographer-Burberry-fragrance-campaign_1540273283.html","title":"Brooklyn Beckham lands job as photographer for Burberry fragrance campaign","title_page":"Brooklyn Beckham lands job as photographer for Burberry fragrance campaign  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's used to appearing in front of the camera thanks to his famous parents.\nBut Brooklyn Beckham has decided to step behind the lens for his latest job, working as a photographer for Burberry.\nAnnouncing the news on Instagram, the 16-year-old son of David and Victoria Beckham revealed he'd been hired by the luxury brand to shoot their latest fragrance, which will be live-streamed on Saturday.\nScroll down for video\nBehind the lens: Brooklyn Beckham has decided to step behind the lens for his latest job, working as a photographer for Burberry to shoot their latest fragrance campaign\nPosting a black and white photograph of himself holding onto a camera, the model wrote: 'Excited to photograph the @Burberry campaign tomorrow. Watch it live on their Instagram & Snapchat #THISISBRIT'.\nThe high profile shoot will be the first professional photography job Brooklyn has worked on.\nBut the star will no doubt be in safe hands with the brand who have a history with the famous family.\nGoing professional: Amateur photographer Brooklyn frequently treats his Instagram followers to snapshots he takes in his spare time, but now he has a chance to turn his skills into a career\nCamera shy! Last year, David Beckham revealed his oldest son had developed a love of photography and would not be following in his footsteps to follow a career as a professional footballer\nAt the age of 10, Brooklyn's younger brother Romeo made his modelling debut with the brand, and has continued to work with the company on several occasions.\nLast year, David revealed his oldest son had developed a love of photography and had turned down offers to star in Hollywood films in favour of a life behind the lens.\n'He actually loves photography. That is one of his passions,' he said.\n'I have always said to my children, as long as they have a passion for something, we will encourage it.'\nKeeping it in the family! Brooklyn's younger brother Romeo made his modelling debut with the brand, and has continued to work with the company (pictured with Edie Campbell and Cara Delevingne in 2013)\nExplaining that Brooklyn wouldn't be following in his athletic footsteps, he added: 'He loves football, but has a passion for photography as well.'\nMeanwhile, Brooklyn showed off his fashion forward style on Wednesday, sharing a picture of his bold new hairstyle with his six million Instagram followers.\nWearing his chestnut coloured locks in a plait, the star showed he wasn't afraid to play around with fashion.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423380/Brooklyn-Beckham-prepares-step-camera-lands-job-photographer-Burberry-fragrance-campaign.html"}
