{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:26:51","date_modify":"2018-10-22 23:26:51","date_publish":"2017-03-10 03:03:33","description":"She's graced countless fashion magazine covers. But on Thursday, Brooke Burke-Charvet decided to keep things casual as she worked her way through LAX with her family.","filename":"data/vaneerConsumption/BrookeBurkeskipsmakeupanddonsleatherjacketatLAX.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/01/3E1F3F6500000578-0-image-a-48_1489109546745.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299678_Ageless-Brooke-Burke-skips-make-dons-leather-jacket_1540250811.html","title":"Brooke Burke skips make-up and dons leather jacket at LAX","title_page":"Brooke Burke skips make-up and dons leather jacket at LAX | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's graced countless fashion magazine covers.\nBut on Thursday, Brooke Burke-Charvet decided to keep things casual as she worked her way through LAX with her family.\nThe 45-year-old television presenter and model looked amazingly youthful in her laid-back ensemble.\nScroll down for video\nHappy landings! on Thursday, Brooke Burke decided to keep things casual as she worked her way through LAX with her family\nOn top, the beauty opted for a striking white top with black diagonal stripes and a low v-neck.\nOver that she layered a classic black leather biker jacket\nBlack track pants with red and white stripes down the outside of each leg and some black sneakers rounded out her comfortable look.\nAccessories included some oversize shades with dark rose lenses and a large black leather handbag.\nEdgy: On top, the beauty opted for a striking white top with black diagonal stripes and a low v-neck paired with a black biker jacket\nFresh-faced! Her brunette tresses were pulled back into a functional bun, and she seemed to forgo make-up with the exception of a dash of light rose lipstick\nShe also toted a high-style Louis Vuitton rolling carry-on bag.\nHer brunette tresses were pulled back into a functional bun, and she seemed to forgo make-up with the exception of a dash of light rose lipstick.\nThe multi-talented stunner was accompanied by her hunky husband David Charvet, 44, who brought up the rear with a luggage cart towering with baggage.\nHeavy hauler: The multi-talented stunner was accompanied by her hunky husband David Charvet, 44, who brought up the rear with a luggage cart towering with baggage\nTo each their own: Everyone seemed to carry their own bags\nIt seems the former Wild On! host was returning from a trip to Dallas, as revealed by an Instagram post from earlier in the day.\nIn that post, her cryptic caption of '[heart emoji] about Dallas | muse fashionista,' was accompanied by a sizzling shot of her famous cleavage.\nHer decolletage was on full display in the green frock which also featured a print of stylized leopards.\nA massive bejeweled pendant necklace also drew the eye to her ample assets.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299678/Ageless-Brooke-Burke-skips-make-dons-leather-jacket.html"}
