{"authors":["Mallory Schlossberg"],"date_download":"2018-10-30 22:46:11","date_modify":"2018-10-30 22:46:11","date_publish":"2014-08-14 19:39:42","description":"Aaannnd, I've already started busting out my pajamas, 'cause this is the year of staying IN. Splitsider reports that the singular item responsible for The Year of The Sweats, aka my favorite thing, Netflix, has announced a series of stand-up special…","filename":"data/vaneerConsumption/BrooklynNineNineStarChelseaPerettisNetflixStandUpSpecialIsOneofManyToWatchThisFall.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/8f1894e8-4381-4352-8c9b-32143e6f22c0.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35827-brooklyn-nine-nine-star-chelsea-perettis-netflix-stand-up-special-is-one-of-many-to-watch-this-fall_1540939571.html","title":"'Brooklyn Nine-Nine' Star Chelsea Peretti's Netflix Stand-Up Special Is One of Many To Watch This Fall","title_page":"'Brooklyn Nine-Nine' Star Chelsea Peretti's Netflix Stand-Up Special Is One of Many To Watch This Fall","title_rss":"NULL","source_domain":"bustle.com","text":"Aaannnd, I've already started busting out my pajamas, 'cause this is the year of staying IN. Splitsider reports that the singular item responsible for The Year of The Sweats, aka my favorite thing, Netflix, has announced a series of stand-up special premieres, from an impressive list of comedians that includes Chelsea Handler, Bill Cosby, Bill Burr, Jim Jefferies, and Brooklyn Nine-Nine star Chelsea Peretti. Don't know all of those names? I'll tell ya what ya need to know: they're FUNNY.\nYou may have already known about Handler's stand-up special, Uganda Be Kidding Me, which was announced at the same time we all learned that she'd be getting a Netflix series. Pour yourself a vodka and prepare ye for her stand-up special's date: Oct. 10 at precisely 12:01 a.m. Very specific, Netflix!\nYou'll have to don your favorite sweater for Bill Cosby's special, Bill Cosby 77, when it airs on Nov. 28 at 12:01 a.m. Jim Jefferies: BARE will hit your Netflix queue on Aug. 29 at 12:01 a.m., and Chelsea Peretti's special, One of The Greats, will be available to watch on Nov. 14 at 12:01 a.m. You can round out your months of stand-up viewing with Bill Burr's special, I'm Sorry You Feel That Way on Dec. 5 at 12:01 a.m.\nSo if you dig comedy, then Netflix is going to become your new BFF for the next couple of months.\nNetflix is equally as amped, as Lisa Nishimura, an exec from the streaming service, said in a statement:\nJim Jefferies, Chelsea Handler, Bill Cosby, Bill Burr and Chelsea Peretti are some of the funniest comedians of our time who will have our viewers in stitches...We are thrilled to bring this diverse slate of talent and their unique, multi-faceted and hilarious points of view exclusively to our members around the world.\nAmen to that, Netflix. And BTW — I'll be wearing flannels.","url":"https://www.bustle.com/articles/35827-brooklyn-nine-nine-star-chelsea-perettis-netflix-stand-up-special-is-one-of-many-to-watch-this-fall"}
