{"authors":["Loretta Donelan"],"date_download":"2018-10-30 22:24:29","date_modify":"2018-10-30 22:24:29","date_publish":"2014-08-15 19:23:06","description":"Like Gina's would be, Chelsea Peretti's Instagram is super active. And that's good news for all of us hungry Brooklyn Nine-Nine fans, as she's been posting a ton of photos from the set. While they don't reveal much about what's going down in the…","filename":"data/vaneerConsumption/BrooklynNineNineSeason2PhotosShowJustHowFunTheCastReallyIsPHOTOS.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/0dac1f01-56a5-4e4a-8fb2-1c7dedd5fc7a.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35964-brooklyn-nine-nine-season-2-photos-show-just-how-fun-the-cast-really-is-photos_1540938269.html","title":"'Brooklyn Nine-Nine' Season 2 Photos Show Just How Fun The Cast Really Is - PHOTOS","title_page":"'Brooklyn Nine-Nine' Season 2 Photos Show Just How Fun The Cast Really Is — PHOTOS","title_rss":"NULL","source_domain":"bustle.com","text":"Like Gina's would be, Chelsea Peretti's Instagram is super active. And that's good news for all of us hungry Brooklyn Nine-Nine fans, as she's been posting a ton of photos from the set. While they don't reveal much about what's going down in the next season, they do show the relationship between the cast that translates well into the show itself. Brooklyn Nine-Nine Season 2 will air on Sept. 28. Remember, it's on Sundays at 8:30 p.m. now. The trailer is pretty fantastic, and we know that Kyra Sedgwick and and Jenny Slate are going to guest star.\nAnd these behind-the-scenes photos are a further sign of good things to come. One of the best parts of Brooklyn Nine-Nine is the rapport of the characters; while they tease each other to no end, there's also a lot of love there. The fact that the cast seems to get along so well in real life is an important element for a comedy that's built so heavily on relationships.\nSo, doesn't being a cast member on Brooklyn Nine-Nine look like a ton of fun? Individually, it has a great cast full of talented comedians. Wouldn't you want to hang out with Andy Samberg? But collectively, it looks like the goofiest, most friendly, cast you can imagine.\nHere are Joe Lo Truglio (Boyle), Andy Samberg (Peralta), and Stephanie Beatriz (Rosa) just chillin'\nTrue to character, Peretti kicks Truglio in the face\nSamberg is credited with this gem\nMelissa Fumero, who plays Santiago, manages to be simultaneously goofy and beautiful\nImage: chelsanity/instagram","url":"https://www.bustle.com/articles/35964-brooklyn-nine-nine-season-2-photos-show-just-how-fun-the-cast-really-is-photos"}
