{"authors":["Ariel Zilber For Dailymail.Com"],"date_download":"2018-10-22 23:07:40","date_modify":"2018-10-22 23:07:40","date_publish":"2017-03-16 05:47:08","description":"The body of Trevon Dickens, a 19-year-old man who was shot and left for dead, was discovered in the middle of a Brooklyn street by a snow plow on Wednesday.","filename":"data/vaneerConsumption/Brooklynsnowplowfindsmanwhoshotandleftfordead.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/05/3E45347C00000578-0-image-a-161_1489643027278.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318974_Snow-plow-finds-man-shot-left-dead_1540249660.html","title":"Brooklyn snow plow finds man who 'shot and left for dead'","title_page":"Brooklyn snow plow finds man who 'shot and left for dead' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The body of a 19-year-old man who was shot and left for dead was discovered in the middle of a Brooklyn street by a snow plow on Wednesday.\nNew York police are investigating the circumstances surrounding the death of Trevon Dickens, according to the New York Post.\nDickens’ body was found at approximately 6:15pm on East 91st Street in the East Flatbush section of Brooklyn.\nA snow plow clears snow from a road in the Brooklyn Heights neighborhood on Tuesday\nAs much as seven inches of snow were recorded in Brooklyn and the New York City area on Wednesday. People above are seen walking on a deserted street in Brooklyn during the storm\nPolice said that he had suffered a gunshot wound to the head.\nThe body was discovered by a Sanitation Department snow plow that was clearing the street of snow.\nDickens, a resident of East New York, Brooklyn, was pronounced dead at the scene.\nNo arrests have been made thus far.\nAs much as seven inches of snow were recorded in Brooklyn and the New York City area on Wednesday.","url":"https://www.dailymail.co.uk/news/article-4318974/Snow-plow-finds-man-shot-left-dead.html"}
