{"authors":["Abigail Miller For Dailymail.Com"],"date_download":"2018-10-23 00:23:13","date_modify":"2018-10-23 00:23:13","date_publish":"2017-03-10 06:42:33","description":"Brooklyn Congressman Hankeem Jeffries recited lyrics to notorious B.I.G.'s 'Juicy' on the House floor on Thursday in a tribute to the rapper on the 20th anniversary of his death.","filename":"data/vaneerConsumption/BrooklyncongressmanrecitesBiggielyricsonhousefloor.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/06/3E2069C000000578-0-image-a-45_1489127748555.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300114_Brooklyn-congressman-recites-Biggie-lyrics-house-floor_1540254193.html","title":"Brooklyn congressman recites Biggie lyrics on house floor","title_page":"Brooklyn congressman recites Biggie lyrics on house floor | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A New York City congressman recited Biggie lyrics on the House floor on Thursday in a tribute to the rapper on the anniversary of his death.\nThursday was the 20th anniversary of the legendary Biggie Smalls' murder, and Brooklyn Congressman Hankeem Jeffries took the opportunity to honor him on the Congress floor.\nJeffries recited the lyrics to Biggie's 1994 song 'Juicy', which is one of the rapper's most quoted songs.\nThursday was the 20th anniversary of the legendary Biggie Smalls' murder, and Brooklyn Congressman Hankeem Jeffries took the opportunity to honor him on the Congress floor\n'It was all a dream, I used to read Word Up! magazine. Salt-n-Pepa and Heavy D up in the limousine,' he said in a floor speech to fellow legislators, according to the New York Post.\nHe continued: 'Hangin' pictures on my wall, every Saturday Rap Attack, Mr Magic, Marley Marl.'\nThe congressman then gave a small synopsis of the life of the Brooklyn native Christopher Wallace, who went by the stage name Biggie.\nBiggie Smalls, also known as the notorious B.I.G., rose from the streets of Bedford-Stuyvesant to be one of the most successful rappers in history.\nJeffries (pictured) then gave a small synopsis of the life of the Brooklyn native Christopher Wallace, who went by the stage name Biggie\nBiggie Smalls, also known as the notorious B.I.G., rose from the streets of Bedford-Stuyvesant to be one of the most successful rappers in history\nHe was killed in a drive-by shooting in Los Angeles March 9, 1997, aged just 24.\nTrailed by fellow artist P. Diddy, who opted to travel in a separate car, his friend could only watch as the Brooklyn-born star was hit by four bullets from a driver in a Chevrolet Impala that pulled alongside his GMC Suburban SUV.\nTheories around the shooting - now a part of hip hop lore - have reemerged in one form or another over the years as journalists and fans attempted to tackle the case.\nJeffries ended the Thursday shout out by saying: 'Where Brooklyn at?'","url":"https://www.dailymail.co.uk/news/article-4300114/Brooklyn-congressman-recites-Biggie-lyrics-house-floor.html"}
