{"authors":["Celeste Mora"],"date_download":"2018-10-30 23:13:12","date_modify":"2018-10-30 23:13:12","date_publish":"2014-08-13 22:11:14","description":"Terry Crews may be gearing up for the release of Expendables 3, but rumor has it that he may be playing a different action hero sometime soon. In an interview with Digital Spy on Wednesday, the Brooklyn Nine-Nine actor said that although he's still…","filename":"data/vaneerConsumption/BrooklynNineNinesTerryCrewsasNetflixsLukeCageTheProsCons.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/a476b914-160f-4810-896d-602fd012138b.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35675-brooklyn-nine-nines-terry-crews-as-netflixs-luke-cage-the-pros-cons_1540941192.html","title":"'Brooklyn Nine-Nine's Terry Crews as Netflix's Luke Cage: The Pros & Cons","title_page":"'Brooklyn Nine-Nine's Terry Crews as Netflix's Luke Cage: The Pros & Cons","title_rss":"NULL","source_domain":"bustle.com","text":"Terry Crews may be gearing up for the release of Expendables 3, but rumor has it that he may be playing a different action hero sometime soon. In an interview with Digital Spy on Wednesday, the Brooklyn Nine-Nine actor said that although he's still \"waiting for the call from Marvel,\" he would be \"privileged and honored\" to play Luke Cage in Netflix's upcoming series. The rumors of Crews' casting have been floating around for some time, and Crews has previously called out Marvel to tap him for the role. With this further confirmation that Crews would love the job, fans are hoping that their wildest Terry superhero fantasies will come true.\nOf course, Terry did say he's \"booked for a while,\" and Netflix seems on a tight timetable for its multi-part street-level heroes series. The 13-episode Daredevil series began filming in July, and it has been confirmed that the others will begin in New York when it wraps. While Netflix soldiers through shooting, Terry still has Brooklyn Nine-Nine and two films yet to release in 2014, and probably plenty of still-unannounced projects lined up after that. So its possible that the timing may not line up for someone who would probably make an amazing Luke Cage. Nonetheless, lets see if Terry is fit for a job on the Defenders roster.\nPro: He's Got the Bod\nFOX on YouTube\nYes, the Luke Cage muscles are an obvious sticking point for any actor, and of course, Crews has that covered. Being an ex-NFL player and notoriously buff dude, Terry's real guns might be bigger than Luke Cage's comic-book biceps. Nonetheless, he's got the bad-boy-with-super-strength image down. Oh, and he'd look badass shirtless with a chain in hand.\nCon: He Might Be Too Old\nHenrik Persson on YouTube\nTerry's age seems to be the only drawback fans can foresee to his casting as Luke Cage, but I want to put that to bed right now. There's no way Terry is \"too old\" to play Luke Cage, because Luke has a long past before he becomes a \"Hero for Hire.\" It's doubtful that Netflix will be able to tell his long and complicated origin story in 13 episodes, so they will probably need to begin once Luke Cage has established himself as a for-pay superhero, meaning that Terry would be the perfect age. As Terry once said, \"Man do my workout 20 years ago and we’ll talk about who’s too old.\" You go, Terr-bear.\nCon: He Needs to Fight Crime in Brooklyn\nAssociated Press on YouTube\nAs Crews mentioned in his interview, he's been a busy man ever since the Expendables and Brooklyn Nine-Nine. Even though he would be amazing as Luke Cage, it would pain me to see Terry Jeffords leave the BK 99 gang, even for an episode. After his big transformation from muscle-bound wimp to badass crimefighter, it would be difficult to watch the Sarge take a back seat to film a new series. Where would Jake get his wisdom, and who would carry Charles around?\nPro: He's Already a Superhero\nTerry has played a major action star in three Expendables movies now, but his best superhero role is as the Ebony Falcon in Brooklyn Nine-Nine. Remember: he takes bad guys to jail and bad girls to bed (but not anymore because he's monogamous and too tired for sex).\nSeriously though, THE EBONY FALCON WILL SOAR AGAIN.\nImages: brooklyn99insider/Tumblr","url":"https://www.bustle.com/articles/35675-brooklyn-nine-nines-terry-crews-as-netflixs-luke-cage-the-pros-cons"}
