{"authors":[],"date_download":"2018-10-22 21:01:43","date_modify":"2018-10-22 21:01:43","date_publish":"2014-06-03 20:39:44","description":"The brothers, who said they were making a video to promote child abduction awareness, apologized April 6 on TODAY.","filename":"data/vaneerConsumption/BrothersChargedinFakeKidnappinginWashingtonState.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/485296/140603-fake-kidnappings-1612_00c15ca6b5c0ce1b2f8579780ab01557.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_brothers-charged-fake-kidnapping-washington-state-n121691_1540242103.html","title":"Brothers Charged in Fake Kidnapping in Washington State","title_page":"Brothers Charged in Fake Kidnapping in Washington State","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nTwo brothers who staged the phony abduction of their 4-year-old nephew in a Washington state park and uploaded footage of the prank to YouTube were charged Monday with misdemeanor disorderly conduct.\nCity Attorney Craig Ritchie had previously said \"scaring the hell out of people is not a crime.\" But he reconsidered his position after reviewing the police report about the April 13 stunt that terrified onlookers at Carrie Blake Park in Sequim, Washington.\nHe told NBC News the charges are based on the number of people who were horrified and disturbed when the 25-year-old brothers, Jesse and Jason Holden, descended on the public park in ski masks, grabbed the boy and drove off in a van.\nA mother who saw the phony abduction said her 7-year-old daughter is still traumatized.\n\"I’ve never ran so fast in my adult life. I was absolutely bawling and I could not stop shaking. My entire body was shaking. I was so scared for that little boy and what might happen to him,” Tiffany Barnett told TODAY.\nThe brothers, who said they were making a video to promote child abduction awareness, apologized April 6 on TODAY.\n\"We didn't really think about what we were doing and we didn't really think about the kids that we were endangering,\" they said.\n— Daniel Arkin","url":"https://www.nbcnews.com/news/us-news/brothers-charged-fake-kidnapping-washington-state-n121691"}
