{"authors":[],"date_download":"2018-10-30 01:02:50","date_modify":"2018-10-30 01:02:50","date_publish":"2015-05-23 00:00:00","description":null,"filename":"data/vaneerConsumption/BrotherlyBetrayalJebBushsFatalError.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_05_brotherly_betrayal_jeb_bushs_fatal_error_comments_1540861370.html","title":"Brotherly Betrayal: Jeb Bush's Fatal Error","title_page":"Blog: Brotherly Betrayal: Jeb Bush's Fatal Error","title_rss":"NULL","source_domain":"americanthinker.com","text":"Jeb Bush stepped in a cow pie and cannot wipe it off his boots. The more he attempts to explain his contradictory comments about how he feels about brother George W's 2003 invasion of Iraq, the worse he comes across as a potential Republican presidential candidate. Had his campaign staff been on their toes, Bush would never make three fatuous statements on the subject. And he could have avoided the stain on his candidacy by stating unequivocally he would have done the same thing George did. Here's why. Imagine you were president of the United States 9/11/2001. The country experienced the most outrageous and heinous act of aggression on its own soil since the Japanese sneak attack on Pearl Harbor December 7, 1941. Georg W. would not deserve the title commander-in-chief had he not acted immediately to assuage the American public's angst and anger for the sneak attack on the World Trade Center and the Pentagon Coincidentally, the best example of the... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/05/brotherly_betrayal_jeb_bushs_fatal_error_comments.html"}
d by president Franklin D. Roosevelt in response against Japan for the 2400 + American casualties and sunken ships that \"day of infamy\". FDR knew the U.S. was woefully unprepared to retaliate in force and that the bombing raid would do minimal damage. Yet, he felt he had to do something to boost morale and demonstrate the country meant business by declaring war on Japan. Like FDR, George W. Bush knew he had to act to boost morale after the 9/11 \"sneak attack\". But he and his military planners were in an historic dilemma: the fanatical Muslims who planned and implemented the 9/11 attacks were, as intelligence historian Christopher Andrew put it, \"transnational\". Bush was looking at as many as 60 countries who harbored Al-Qaeda operatives, the enemy that attacked America. Unlike FDR's advantage of a single nation enemy, he was forced to select one among many countries to draw a line in the sand (so to speak). He chose Iraq. The gaggle of critics of Bush's decision did not bother to take into consideration the U.S. was forced simultaneously to remove 30,000 troops from Saudi Arabia at the request of the kingdom. Bush had to have a toehold in the Middle East to compensate for leaving Saudi soil. Plus, Iraq as strategically important for its oil resources and was ruled by Saddam Hussein, a fanatic dictator who ordered the murder of 300,000 of his own citizens. He possessed and had deployed chemical weapons, ordered SCUD missiles to be fired continuously into America's ally Israel and threatened any hopes for peace in the region. Yet, somehow, that was not enough for George W.'s critics. The pressure was on to verify Iraq had nuclear weapons to justify an invasion. This argument is reminiscent of Richard Nixon's invasion of Cambodia during the Vietnam War to intercept the main supply line from the communist North to the U.S.-backed South. However, bombing the Ho Chi Minh Trail was a \"war crime\" to the peace movement in the US, as evidenced by the intensity of anti-war demonstrations, culminating in the tragedy of Kent State. Similarly, occupying Iraq to root out those responsible for the attacks on America, and ridding the region of the egregious Saddam Hussein, were not good enough reasons for the anti-war Left in 2003. Though the U.S. invasion of Iraq was approved by the general public, right on cue the activist opposition was resurrected, igniting anti- Iraq war sentiments that linger today and obfuscate the admirable success of the invasion of Iraq by the U.S. military. Free elections were held, dams and bridges repaired, schools reopened; and the Iraqi military and police forces trained and supplied. Al-Qaeda and other jihadists were tracked down and killed, including Saddam Hussein. Why can't Jeb Bush say this? He should be pointing out U.S. success in Iraq was undermined by Barack Obama, one of the most unpopular U.S. presidents in history, who pulled forces out of Iraq. The result has been the implosion of Iraq and occupation of one-third of the country by the deranged and murderous ISIL. Jeb Bush needs to demonstrate backbone rather than equivocation, before another Republican sees the light. Like Chris Christie, who is suddenly advocating strong military action and intervention against fanatic Muslim terrorists.","url":"https://www.americanthinker.com/blog/2015/05/brotherly_betrayal_jeb_bushs_fatal_error.html"}
