{"authors":["Associated Press"],"date_download":"2018-10-22 20:33:34","date_modify":"2018-10-22 20:33:34","date_publish":"2016-01-29 02:06:30","description":"SAN DIEGO (AP) — Scott Brown and Phil Mickelson both had reason to believe it could be a long day on the South Course at Torrey Pines. It turned out just fin...","filename":"data/vaneerConsumption/BrownhandlesSouthtoshareearlyleadatTorreyPines.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422001_Brown-handles-South-share-early-lead-Torrey-Pines_1540240414.html","title":"Brown handles South to share early lead at Torrey Pines","title_page":"Brown handles South to share early lead at Torrey Pines | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Brown handles South to share early lead at Torrey Pines\nSAN DIEGO (AP) — Scott Brown and Phil Mickelson both had reason to believe it could be a long day on the South Course at Torrey Pines. It turned out just fine Thursday in the Farmers Insurance Open, especially for Brown.\nBrown hit into a hazard and made bogey on the first par 5 he faced and was 2 over through six holes. He finished with eight birdies over his last 11 holes for a 6-under 66, giving him a share of the lead with Andrew Loupe.\nOnly it felt much better for Brown because it was on the South, which played 2½ shots harder than the North Course where Loupe shot his 66.\n\"Extremely hard,\" Brown said of the South, which already hosted one U.S. Open and has another coming in five years. \"But it's fair. It's just tough. If you're out of position, you just have to play for par or bogey and you can't make any big numbers out there because as soon as you get behind the 8-ball, you can't press and try to make birdies.\"\nHe did, anyway, including a 30 on the front nine.\nBrown and Loupe had a one-shot lead over five players, including Billy Horschel, who all played the North Course.\nDefending champion Jason Day, who missed the pro-am because of the flu, made his tee time but not a lot of birdies. He shot 72 on the North Course. That was one shot better than Rickie Fowler, who won Sunday in Abu Dhabi and couldn't buy a putt on the North Course in his round of 73.\n\"Couldn't get anything going,\" Fowler said. \"Couldn't make a putt. So looking forward to getting on the South greens, that's for sure.\"\nMickelson, whose last win at Torrey Pines was 15 years ago, didn't have the ideal start, either. On the second-easiest par 4 on the South Course, he hit into a fairway bunker, caught the lip trying to get out, hit his third shot just over the green and failed to get up-and-down, making double bogey.\n\"I thought anything in the 60s would have been a good score,\" Mickelson said. \"It's a very difficult golf course. But after doubling the second, I was able to kind of just keep things calm until I made a few birdies, and it was a good back nine.\"\nAs significant as his birdies was a par on No. 11, where his tee shot found a bunker and he escaped with a 20-foot par putt. Mickelson hit enough good drives to set up three straight birdies. He reached the 614-yard 13th hole in two, hit wedge to 5 feet for birdie on the 14th and an 8-iron to 4 feet on the next hole.\nHe ended with a 30-foot birdie putt on the 18th.\nOf the 33 players who shots in the 60s, only 12 of the scores came on the South Course. K.J. Choi and Chesson Hadley each had a 68.\nPaul Dunne of Ireland made his PGA Tour debut with a 69 on the South, while 17-year-old Ryan Ruffels of Australia opened with a 70 on the North Course in his first professional event in America. Ruffels, the son of tennis parents Ray Ruffels and Anna-Maria Fernandez, won a Junior World Championship at Torrey Pines, and he beat Mickelson in a practice round last December.\nMickelson figured the South Course would be a good test for his driver, and he had mixed results.\n\"It was not what I expected, but better than I'm used to,\" he said.\nJimmy Walker was expecting much better. He was excited about the way he was driving the ball until a piece of epoxy on his driver came loose during the pro-am. He missed it left of the gallery on No. 7, and so far right on the par-5 ninth on the South that it landed beyond a blue mesh fence of a concession area. At that point, he still was 4 under. Walker kept it together for a 69 and then headed for the range.\n\"It's tough when you've got a two-way miss going,\" he said. \"But I hit some good irons, good wedges and some good putts.\"\nThis tournament typically isn't sorted out until the weekend because of the disparity of the courses, though the North is no longer a pushover. It has tighter fairways with thick rough. The scoring difference comes largely from the par 5s, which all are reachable with good tee shots.","url":"https://www.dailymail.co.uk/wires/ap/article-3422001/Brown-handles-South-share-early-lead-Torrey-Pines.html"}
