{"authors":["Chriss W. Street"],"date_download":"2018-10-30 22:10:38","date_modify":"2018-10-30 22:10:38","date_publish":"2015-01-27 21:36:10","description":"Brown to Tax Miles Driven in Most Impoverished State","filename":"data/vaneerConsumption/BrownWantstoTaxMilesDriveninMostImpoverishedState.json","image_url":"https://media.breitbart.com/media/2015/01/Route-66-Associated-Press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_01_27__1540937438.html","title":"Brown Wants to Tax Miles Driven in Most Impoverished State","title_page":"Brown Wants to Tax Miles Driven in Most Impoverished State | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"According to California state officials, it is a disaster that vehicles are getting better mileage. Heaven forbid that as the most impoverished state, Californians would pay lower state gas taxes for politicians to spend. To protect the Legislature’s slurp at the public’s trough, Governor Jerry Brown is studying the replacement of gas taxes with mileage fees.\nBrown’s 2015 budget stated that California has a $59 billion backlog of maintenance needs on state highways and bridges. On January 5, he said, “We’re going to have to find another way to finance the upkeep of the roads.” Brown has already set 15-member commission to study a “road usage charge,” and it had its first meeting on January 21 in Sacramento with the goal of establishing a pilot program by Jan. 1, 2017.\nGasoline taxes have been falling across the United States because the number of gallons Americans use in driving has fallen by 8% since hitting an all-time high in August 2005. Today, Americans consume about the same amount of gasoline as in 1998. Most of this decline is due to vehicle mileage rising from 20 miles per gallon in 2008 to 26 miles per gallon today.\nThe amount of gasoline sold in California peaked in 2003 at 15.9 billion gallons and has fallen by 8% to 14.6 billion gallons since then, despite population growth. As a result of Californians buying less gasoline, state gas tax revenues fell from $2.87 billion in 2003 to $2.62 billion in 2013.\nThe reason California gasoline tax collections peaked earlier than the national high is that native-born Americans have been moving away from the state and impoverished immigrants have been moving to California in droves. In 2013, there were 102,972 California residents who left for other states, while only 66,294 residents from other states moved to California. But the state’s population grew in 2013 by attracting 169,266 mostly impoverished illegal aliens. That demographic explains why California is the lowest ranked state in proportion of population to licensed drivers.\nAccording to the National Bureau of Economic Research (NBER), California’s welfare policies rose from about the middle of the pack for providing a package of benefits under Aid to Families with Dependent Children (AFDC) in 1970, to almost the most generous in the nation by 1990. California’s AFDC was 20% larger than that provided by New York; 89% larger than the one in Illinois, and almost 280% greater than the package offered by Texas.\nNBER found a direct correlation between the increasing relative the generosity of California’s welfare system and attracting immigrants. By 1990, California was home to 9.6% of U.S. natives who did not receive welfare and 11.5% of U.S. natives who did receive welfare–and as the home to 27.6% of the nation’s immigrant households not receiving welfare and 37.6% of immigrant households that did receive welfare.\nGovernor Brown celebrates this as rising diversity. But that rise has resulted in California winning the booby-prize for the highest overall rate of poverty of any state in the nation at 16.8%. It has also resulted in the City of Los Angeles capturing the crown as America’s Poorest Big City, according to an analysis by the American Community Survey-based Census Bureau data.\nIn addition to government strategies that have allowed California to trade down economically, the state needs more money to pay for massively inflated subsidies to unions through “prevailing wage rate” mandates on state contracts for road maintenance and other needs. According to non-partisan General Accounting Office studies, such laws push up construction costs by about 37%.\nOregon has already tried a pilot program last year for charging miles versus gasoline taxes to maintain roads. Yet there was an outcry from privacy groups who complained that government could potentially be tracking the location of private vehicles. Electric car owners also went ballistic at the prospect that they would lose their tax-free subsidy.\nCalifornians already pay the highest gasoline tax rate in America at 70.87 cents a gallon–so there should be plenty of cash to pay for road maintenance. Yet with impoverished immigrants making up more of the state’s population, Brown needs more tax revenue to pay for more benefits to attract more impoverished immigrants.","url":"https://www.breitbart.com/local/2015/01/27/brown-wants-to-tax-miles-driven-in-most-impoverished-state/"}
