{"authors":["Judy Lin","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:42:31","date_modify":"2018-10-30 22:42:31","date_publish":"2016-05-05 08:00:00","description":"Our Partners Budgeting from the Blacktop - KQED A Day With a Sixth Grader - KQED One School's Unique Program Faces Uncertainty - KQED Is Extra Funding","filename":"data/vaneerConsumption/BrownWhatmakesyouthinkLegislaturecanfixit.json","image_url":"https://calmatters.org/wp-content/uploads/AP_650584920111.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939351.html","title":"Brown: What makes you think Legislature can fix it?","title_page":"Brown: What makes you think Legislature can fix it? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Who should decide how to fix schools that need help?\nIn this video taken by CALmatters at the Berggruen Institute’s Five-Year Anniversary in Beverly Hills May 3, Gov. Jerry Brown said he wants more decisions made at the local school level because the teachers and principals are best able to deal with the problem.\n“If the parent screwed up things, and if the principal’s no good, if the principal can’t lead, if the superintendent isn’t very good, if the local school board isn’t so good, what makes you think that the Legislature can fix it,” Brown told the invitation-only audience.\nThis year, California is planning to overhaul its school evaluation system to include more than test scores. The issue is contentious because there’s a debate about who — the state or local school district — is responsible for the lagging academic performance among Latino and African-American students.\nThe State Board of Education is looking to add graduation rates, how fast English learners gain proficiency and other indicators to comply with a new federal law about school evaluation.\nThat has civil justice and education reform groups worried. They want to include measures of school climate in an effort to drive down suspension and expulsion rates that have been linked to the school-to-prison pipeline. More than 50 civil rights and education reform groups sent him a letter this week asking him to recommit to helping high-need students, the majority who are black and Latino.\nThe fight is spilling over into the Legislature over a bill that would require local districts to track how safe and supported students feel on campus. The state school board appointed by Brown is resisting such measures.\nGov. Jerry Brown at Berggruen Institute’s five-year anniversary celebration","url":"https://calmatters.org/articles/brown-what-makes-you-think-that-the-legislature-can-fix-it/"}
