{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:18:00","date_modify":"2018-10-30 21:18:00","date_publish":"2015-12-18 19:56:45","description":"Bruce Jenner is Barbara Walters' \"Most Fascinating Person of 2015.\"","filename":"data/vaneerConsumption/BruceJennerIsBarbaraWaltersMostFascinatingPersonof2015.json","image_url":"https://media.breitbart.com/media/2015/12/Bruce-Jenner-E.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_12_18__1540934280.html","title":"Bruce Jenner Is Barbara Walters' 'Most Fascinating Person of 2015'","title_page":"Bruce Jenner Is Barbara Walters' 'Most Fascinating Person of 2015'","title_rss":"NULL","source_domain":"breitbart.com","text":"Bruce Jenner is Barbara Walters’ “Most Fascinating Person of 2015.”\nWalters bestowed the honor on the former Olympian and Keeping Up With The Kardashians star during her annual ABC television special Thursday night.\n“Our choice for the most fascinating person of the year was once called the world’s greatest athlete,” Walters began. “Traditionally that title was given to the man who won the Olympic decathlon. When Bruce Jenner won it in 1976, it was a huge accomplishment that had everybody talking, but it was nothing like this. When Bruce Jenner became Caitlyn Jenner, there was a seismic shift in the gender universe.”\n“Through her own transition, Caitlyn Jenner transformed society this year,” Walters added at the end of the special. “And that, for us, makes her the most fascinating person of 2015.”\nJenner beat out nine other candidates — Donald Trump, Bernie Sanders, Amy Schumer, Bradley Cooper, Tracy Morgan, Jeff Bezos, Ronda Rousey, Donna Karan and Misty Copeland — for the honor.\nDuring the special, Walters praised Jenner for becoming “a champion for people who had long been pushed to the margin of society.”\nJenner joins Amal Clooney (2014), Hillary Clinton (2013), David Petraeus (2012), Steve Jobs (2011), and President and First Lady Obama (2008 and 2009, respectively) who have also been named Walters’ “Most Fascinating” person in recent years.\nJenner has racked up accolades after announcing his transition into Caitlyn Jenner with a widely-publicized cover shoot for Vanity Fair magazine earlier this year. Jenner was awarded the Arthur Ashe Courage Award at this year’s ESPY Awards and was named to the shortlist for TIME magazine’s Person of the Year.\nJenner closed out the year as the second-most searched person on Google in the United States in 2015, behind troubled former NBA-er Lamar Odom and just ahead of Ronda Rousey and Donald Trump.\nE! Network renewed Jenner’s reality television series, I Am Cait, for a second season in October.","url":"https://www.breitbart.com/entertainment/2015/12/18/bruce-jenner-barbara-walters-fascinating-person-2015/"}
