{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:18:20","date_modify":"2018-10-30 21:18:20","date_publish":"2015-07-05 21:36:05","description":"Former gold-medal Olympian and reality TV star Bruce Jenner--who came out to the world as \"Caitlyn\" on last month's now-infamous cover of Vanity Fair magazine--celebrated his first Independence Day as a woman on Saturday. |","filename":"data/vaneerConsumption/BruceJennerCelebratesFirstJuly4thasWomanProudtobeanAmerican.json","image_url":"https://media.breitbart.com/media/2015/06/cait-jenner-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_07_05__1540934300.html","title":"Bruce Jenner Celebrates First July 4th as Woman: 'Proud to be an American'","title_page":"Bruce Jenner Celebrates First July 4th as Woman: 'Proud to be an American' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Former gold-medal Olympian and reality TV star Bruce Jenner–who came out to the world as “Caitlyn” on last month’s now-infamous cover of Vanity Fair magazine–celebrated his first Independence Day as a woman on Saturday.\nThe Keeping up with the Kardashians star posted a special July 4th message on Twitter:\nHappy 4th of July! Proud to be an American … where at least I am free to be me. pic.twitter.com/MDAPve5B7C — Caitlyn Jenner (@Caitlyn_Jenner) July 4, 2015\n“Happy 4th of July!” Jenner wrote. “Proud to be an American… where at least I am free to be me.”\nJenner first came out as a woman during an emotional interview with Diane Sawyer in April.\nJuly will be a big month for Jenner.\nJenner is set to receive the Arthur Ashe Award for Courage at the ESPY Awards on July 15.\n“In the past few months, the overwhelming outpouring of support from all over the world for my journey has been incredible,” Jenner said after it was announced he would receive the prestigious award. “However, being honored with this award, which is named after one of my heroes, is truly special. For the first time this July, I will be able to stand as my true self in front of my peers.”\nThe momentum continues for Jenner on July 26, when the eight-part I Am Cait reality docu-series premieres on the E! network.","url":"https://www.breitbart.com/entertainment/2015/07/05/bruce-jenner-celebrates-first-july-4th-as-woman-proud-to-be-an-american/"}
