{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:16:50","date_modify":"2018-10-30 21:16:50","date_publish":"2015-10-22 19:08:31","description":"Bruce Springsteen, Pharrell Williams, Sting, and other artists will team up to present a 2-hour television special called Shining a Light: A Concert for Progress on Race in America on November 20.","filename":"data/vaneerConsumption/BruceSpringsteenPharrellToHeadlineRacialEqualityConcert.json","image_url":"https://media.breitbart.com/media/2015/10/Bruce-Springsteen-singing-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_10_22__1540934210.html","title":"Bruce Springsteen, Pharrell To Headline Racial Equality Concert","title_page":"Bruce Springsteen, Pharrell To Headline Racial Equality Concert | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Bruce Springsteen, Pharrell Williams, Sting, and other artists will team up to present a 2-hour television special called Shining a Light: A Concert for Progress on Race in America on November 20.\nThe concert special, which will be recorded at the Shrine Auditorium in Los Angeles on November 18, will air at 8 pm across all A+E channels including A+E, History, Lifetime, H2, LMN, and FYI. The concert will also be streamed live across all iHeartMedia broadcast radio stations and on the iHeartRadio digital station.\nIn addition to Springsteen, Williams, and Sting, other artists participating in the concert special include Zac Brown Band, John Legend, Pink, Ed Sheeran, Sia, Jamie Foxx, Eric Church, Miguel, Jill Scott, Tori Kelly, and Rhiannon Giddens.\n“As a global media company, A+E Networks has the privilege of being invited into the homes of millions of Americans every day and believe that it is our responsibility to use this incredible platform to inform as well as entertain. By shining a light on the uncomfortable truth that racial inequity and bias still impact our society, we are looking to inspire people to go beyond short-lived, symbolic gestures,” A+E Networks President and CEO Nancy Dubuc said in a statement.\nAfter the concert, A+E will air the tentatively-titled Shining a Light: Conversations on Race in America, in which artists will meet with residents from Charleston, Ferguson, Baltimore, and Chicago to discuss racial inequality.\n“The current racial situation in America is at a critical point,” executive producer Ken Ehrlich said in a statement. “Today’s musical artists, much like those of the civil rights movement’s history, have strong feelings about what’s going on today, and we’re hopeful that ‘Shining a Light’ does, in fact, give a voice to their concerns, their hopes and their thinking about solutions to the alarming events that we see around us every day.”\nTickets for the concert go on sale October 28 at 1 pm EST at AXS.com and on the Shrine Auditorium’s website. Ticket sale proceeds will benefit the Fund for Progress on Race in America powered by United Way Worldwide.","url":"https://www.breitbart.com/entertainment/2015/10/22/bruce-springsteen-pharrell-headline-racial-equality-concert/"}
