{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 04:23:17","date_modify":"2018-10-23 04:23:17","date_publish":"2017-03-16 15:43:15","description":"The 38-year-old model shared a picture with the Die Hard actor and their two daughters on vacation at Disney World, on Thursday, and explained he's easy to spend time with","filename":"data/vaneerConsumption/BruceWillistakesfamilytoDisneyWorld.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E5473BE00000578-0-image-a-9_1489676789368.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320572_Bruce-Willis-family-Walt-Disney-World-wife-says-easy-going_1540268597.html","title":"Bruce Willis takes family to Disney World","title_page":"Bruce Willis takes family to Disney World | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's the ultimate movie hard-man.\nBut Bruce Willis's wife Emma Heming says that in real life, Bruce, 61, is very laid back.\nThe 38-year-old model shared a picture with the Die Hard actor and their two daughters on vacation at Disney World, on Thursday, and explained he's easy-going.\nFamily trip: Emma Heming shared a picture with her husband Bruce Willis and their two daughters on vacation at Disney World, on Thursday, and explained he's easy going\nSharing her tips on how to survive a theme park day, Emma wrote: 'Daddy [Bruce] just goes with the flow. He’s always a good sport.'\nShe had explained that the family headed to the happiest place on earth in Orlando, Florida, over Spring Break.\nCaptioning the Instagram shot, she wrote: 'We planned a pretty last minute trip to Disney World and it was epic! Last year I did a post on how to survive a theme park with kids, referenced it for this trip and it stood the test of time! Head over to my site for the slightly updated version for some tips and tricks @waltdisneyworld #springbreak2017 #disneyworld #disneylove #themepark'.\nIn his (fifth) element: It's not Bruce's first trip to Disney in Florida, as he was seen in 2011 posing with Minnie and Goofy at Hollywood Studios, whilst on vacation at the resort with family and friends\nBruce is seen wearing white, with his sunglasses tucked into the collar of his plain Tee.\nHe added a baseball cap, as he posed with his two youngest daughters, Evelyn - who turns five next month - and Mabel, who will be three in May, and second wife Emma in front of Cinderella's castle.\nEmma also revealed what their daughters enjoyed about the park: 'For Evelyn, she was all about Nemo. And Mabel was about the princesses. For mommy, roller coasters,' she wrote on her blog.\nLarge family: Bruce also has three adult daughters with ex-wife Demi Moore - Rumer, 28, Tallulah, 22 and Scout, 25\nIt's not Bruce's first trip to Disney in Florida, as he was seen in 2011 posing with Minnie and Goofy at Hollywood Studios, whilst on vacation at the resort with family and friends.\nHe's been married to the British model and blogger since 2009.\nAlong with his two youngest girls, Bruce also has three adult daughters with ex-wife Demi Moore - Rumer, 28, Tallulah, 22 and Scout, 25.\nWith such a large family Bruce is still working hard.\nHe is slated to appear in three films in 2017: Once Upon A Time In Venice, First Kill and Death Wish.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320572/Bruce-Willis-family-Walt-Disney-World-wife-says-easy-going.html"}
