{"authors":["Associated Press"],"date_download":"2018-10-23 02:43:11","date_modify":"2018-10-23 02:43:11","date_publish":"2016-01-28 17:48:54","description":"NEW YORK (AP) — Bruce Springsteen's tour showcasing his 1980 album \"The River\" is more than an exercise in nostalgia. It's a telling example of how veteran a...","filename":"data/vaneerConsumption/BruceSpringsteenstourshowcasesnewwayofservingfans.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:affe8c11ed7542059fcf868fb998a88a-2vdWmEltwXfba0ce28e632b43a64-800_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421311_Springsteens-tour-showcases-new-way-serving-fans_1540262591.html","title":"Bruce Springsteen's tour showcases new way of serving fans","title_page":"Bruce Springsteen's tour showcases new way of serving fans | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bruce Springsteen's tour showcases new way of serving fans\nNEW YORK (AP) — Bruce Springsteen's tour showcasing his 1980 album \"The River\" is more than an exercise in nostalgia. It's a telling example of how veteran artists are adjusting to the new realities of the music business by super-serving their longtime fans.\nThe 66-year-old superstar is performing an album he made when he was 30 from start to finish, a two-hour exercise during the tour's third stop in New York on Wednesday. A musician with a long-time aversion to regularly documenting his epic concerts now makes recordings of them available to all his fans, whether they were there or not.\nAfter opening with an outtake from \"The River,\" Springsteen explained to fans that he wrote the songs at a time when he was looking for more adult connections, and wanted to make an album with the grandeur of his live shows.\nBruce Springsteen performs with the E Street Band at Madison Square Garden, Wednesday, Jan. 27, 2016, in New York. (Photo by Robert Altman /Invision/AP)\n\"I wanted the record to contain fun, dancing, laughter, jokes, politics, sex, good comradeship, love, faith, family, lonely nights and, of course, tears,\" he said. \"I wanted to imagine and write about those things, and I figured if I wrote about them, I'd get one step closer to getting it in my own life.\"\nWith that, he dropped the needle on 20 songs performed in the album's original sequence. Springsteen being Springsteen, he added 10 of his classics at the end before finishing with the bar band favorite, \"Shout.\"\nPerforming albums in their entirety is a trend gaining steam with artists such as Steely Dan, Lucinda Williams, Van Morrison — even Springsteen himself in recent years. It's a way to give fans a fresh experience without new songs, said Chris Phillips, editor of Backstreets, a website devoted to Springsteen's music.\nAs Springsteen explained in a recent interview with Phillips, he'd spend years formatting an album's song order to tell a story, then never perform it that way. Before this tour, he'd only fully played \"The River\" live once before, in 2009.\n\"The accumulation of those 20 songs together is greater than the individual playing of each particular song on a given night,\" Springsteen said. \"You get a sense of time, you get a sense of where your head was, the issues you were thinking about, who you were at that moment.\"\nContext is important: \"Born to Run\" has become something of a perfunctory ritual at Springsteen shows, but hearing it performed once a few years ago in its original album sequence gave the song new life.\nDevoted fans can also be cheered by Springsteen's embrace of www.nugs.net, a website that lets fans buy high-quality downloads or CDs of concerts. All of his concerts from this tour will be offered there. The site provides a fresh revenue stream for artists like Springsteen, Pearl Jam and Phish who are now out of the mainstream when it comes to new music, but have strong live reputations. Springsteen prices range from $9.95 for a download to $23 for a CD.\nAfter snow forced postponement of his Sunday show in New York, Springsteen offered a free download of his Jan. 19 Chicago show for 48 hours — both a gift to fans and a sly introduction to the new technology. More than 100,000 copies were ordered.\nThe site also offers a handful of Springsteen shows from past tours. Much to his regret now, Springsteen was never big on recording all of his performances. The only quality video they could find from his original concert tour in 1980-81, for inclusion in his recently released box set, was missing several songs.\n\"The show was always about this moment, it's about you, it's about tonight,\" Springsteen told Phillips. \"This moment belongs to the people that are in the room, and that was my first and foremost concern. And anything that got in the way of that, I was against at the time.\"\nFans now can order recordings of every single show of the tour at a 10 percent discount. Springsteen announced this week he was adding shows, bringing the total to 35.\n___\nOnline: http://backstreets.com/\n___\nFollow David Bauder at twitter.com/dbauder. His work can be found at http://bigstory.ap.org/content/david-bauder\nBruce Springsteen performs with the E Street Band at Madison Square Garden, Wednesday, Jan. 27, 2016, in New York. (Photo by Robert Altman /Invision/AP)\nBruce Springsteen, center, Max Weinberg, and Jake Clemons, left, perform with the E Street Band at Madison Square Garden, Wednesday, Jan. 27, 2016, in New York. (Photo by Robert Altman /Invision/AP)\nBruce Springsteen, front, and Max Weinberg perform with the E Street Band at Madison Square Garden, Wednesday, Jan. 27, 2016, in New York. (Photo by Robert Altman /Invision/AP)\nBruce Springsteen, center, Stevie Van Zandt, left, and Patti Scialfa perform with the E Street Band at Madison Square Garden, Wednesday, Jan. 27, 2016, in New York. (Photo by Robert Altman /Invision/AP)","url":"https://www.dailymail.co.uk/wires/ap/article-3421311/Springsteens-tour-showcases-new-way-serving-fans.html"}
