{"authors":["Associated Press"],"date_download":"2018-10-22 21:12:46","date_modify":"2018-10-22 21:12:46","date_publish":"2017-04-26 01:25:18","description":"BOSTON (AP) - Two days weren't enough to relieve the Boston Bruins' pain after a six-game loss to the Ottawa Senators in an Eastern Conference first-round...","filename":"data/vaneerConsumption/BruinsgointooffseasononhopefulnoteafterlosstoSens.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/01/wire-462461-1493166323-115_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4445984_Bruins-offseason-hopeful-note-loss-Sens_1540242766.html","title":"Bruins go into offseason on hopeful note after loss to Sens","title_page":"Bruins go into offseason on hopeful note after loss to Sens | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BOSTON (AP) - Two days weren't enough to relieve the Boston Bruins' pain after a six-game loss to the Ottawa Senators in an Eastern Conference first-round playoff series.\nBut the pain was dulled by the positives of a season in which they reached the postseason for the first time since 2014 and integrated several young players into their lineup to complement the veteran core.\n\"We definitely made a step forward, definitely in the right direction,\" center Patrice Bergeron said on Tuesday as the Bruins cleaned out their lockers at Warrior Ice Arena.\nBoston Bruins center Patrice Bergeron takes questions from reporters in the NHL hockey team's locker room at their training facility, Tuesday, April 25, 2017, in Boston. The Bruins made it back to the playoffs for the first time in three seasons before being eliminated in game six of the first round by the Ottawa Senators. (AP Photo/Steven Senne)\n\"The young players coming in are also contributing, and gaining some huge experience in the playoffs is something that you can't buy and something that's going to go a long way for them but also for us as a team.\"\nIt didn't look as if the Bruins were going to gain that playoff experience when they were 26-23-6 and fired head coach Claude Julien on Feb. 7.\nThey replaced him on an interim basis with first-year assistant coach Bruce Cassidy, who led them to a 7-1-0 record in his first eight games and an 18-8-1 run to finish the regular season. Boston clinched its playoff berth with two games to go.\n\"Well it was for sure something that shook up the whole team, all the players, the whole organization,\" Bruins captain Zdeno Chara said.\n\"I thought that kind of brought a true realization that we need to be better and was kind of a big wakeup call for everybody. I think from that day we really started playing a little bit more together and we were getting results.\"\nThe Bruins' first order of business will be to decide whether to bring Cassidy back as full-time head coach.\nThe players made it clear where they stand on the issue.\n\"We obviously had some success with Butch and it shows with the way that we played,\" defenseman Torey Krug said. \"The guys were excited to play for him. I think the guys in this room would echo that same message and hopefully it does happen. It's out of our hands, but the guys like playing for him.\"\nThe Bruins only have three unrestricted free agents (forwards Drew Stafford and Dominic Moore, and defenseman John-Michael Liles), but have to get contracts done with restricted free agent forwards David Pastrnak and Ryan Spooner.\nAfter getting 70 points (34 goals, 36 assists) in 75 games, Pastrnak will be a priority. The Bruins can also negotiate an extension with the 40-year-old Chara after July 1. In the last season of his contract, Chara will count for $4 million under the NHL's salary cap.\n___\nMore AP hockey: https://www.apnews.com/tag/NHLhockey\nBoston Bruins defenseman Zdeno Chara takes questions from members of the media in the NHL hockey team's locker room at their training facility, Tuesday, April 25, 2017, in Boston. The Bruins made it back to the Stanley Cup playoffs for the first time in three seasons, before getting eliminated in the first round in Game 6 by the Ottawa Senators. (AP Photo/Steven Senne)\nBoston Bruins goalie Tuukka Rask, of Finland, takes questions from reporters in the team's locker room at their training facility, Tuesday, April 25, 2017, in Boston. The Bruins made it back to the Stanley Cup playoffs for the first time in three seasons before being eliminated in Game 6 in the first round by the Ottawa Senators. (AP Photo/Steven Senne)","url":"https://www.dailymail.co.uk/wires/ap/article-4445984/Bruins-offseason-hopeful-note-loss-Sens.html"}
