{"authors":["John Brummett"],"date_download":"2018-10-30 22:06:44","date_modify":"2018-10-30 22:06:44","date_publish":"2016-03-16 05:45:00","description":"We entered Tuesday evening facing two fatefully humongous questions about the race for president.","filename":"data/vaneerConsumption/BRUMMETTONLINEAboutTuesdaysprimaries.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_mar_16_brummett-o_938f3149703b36569ccd022f0d1685b7__page=4_1540937204.html","title":"BRUMMETT ONLINE: About Tuesday’s primaries …","title_page":"BRUMMETT ONLINE: About Tuesday’s primaries …","title_rss":"NULL","source_domain":"arkansasonline.com","text":"We entered Tuesday evening facing two fatefully humongous questions about the race for president.\nOne: Would Donald Trump effectively sew up the Republican nomination, or would John Kasich defeat him in winner-take-all Ohio, thus raising the likelihood that Trump couldn’t win quite enough requisite delegates to secure the nomination outright, in which case he conceivably could be denied the nomination at the mid-July convention in Cleveland, if the Republican Party has the nerve to deny him?\nTwo: Would Hillary Clinton finally lock down her nomination on the Democratic side with four or five large-state wins, or would pesky Bernie Sanders vex her yet again — in Ohio or Missouri or her Illinois home — and lay bare more than ever her weakness as a candidate, even call into question her inevitable nomination?\nSo by evening’s end we had …. not many clearer answers, especially on the zany Republican side.\nThe only thing fateful was Marco Rubio, who dropped out early in the evening to spare further embarrassment to himself and pundits who predicted his victory.\nTrump remained the dominant front-runner among Republicans. But the vanquisher of Rubio couldn’t achieve a significant separation from second-place Ted Cruz in delegate-apportioned states like Missouri and North Carolina.\nAnd Kasich, the popular Ohio governor, did what a popular Ohio governor ought to do, which is hold serve in his home state.\nSo now Kasich is the surviving “establishment candidate,” emerging after the pressing of a reset button, perhaps possessed of new life to compete in places like Pennsylvania and Connecticut and Wisconsin and California and Trump’s New York.\nIt appears Wednesday morning the same as it appeared Tuesday morning: Trump leads the field impressively and will continue to do so. He probably will get close enough to the winning delegate threshold to be pushed over if the Republican Party is inclined to push.\nSo the question Wednesday morning is precisely what it was Tuesday morning: Will the Republican establishment dare at its convention to reject Trump and all his voters, and reject runner-up outsider Ted Cruz and all his voters, to nominate someone entirely different?\nMost likely, the Republicans will choose to do that only if they figure they’ll lose the presidency either way but would fare better in immediate congressional races and over the long term without the Trump circus.\nAnd here’s one other element of the Republican race that remained the same Wednesday morning: Kasich is overwhelmingly the best man in the race.\nIt’s not his fault that the statement seems to extend only the faintest praise, owing to the lowness of the bar. Kasich likely would remain the best man in a more respectable Republican field.\nAs for the Democratic race: Hillary Clinton entered the evening an uninspiringly inevitable nominee who couldn’t quite put away the pestering socialist, Bernie Sanders. And that’s how she ended the evening.\nShe won impressively in Florida, Ohio and North Carolina but had trouble with Sanders in her own Illinois and Missouri. Then she used her victory speech, her chance to speak triumphantly to the nation, to deliver an angry-sounding and angry-looking address notable only for a banal recitation of targeted appeals and applause lines.\nShe will be the Democratic presidential nominee, of course. She probably will be the next president. But people are wondering how she’ll fashion a message and generate enthusiasm, neither of which she’s yet accomplished.\nIn that challenge she may get lucky.\nHer message and source of enthusiasm may well become the compelling fact that she is neither Trump nor Cruz.\nMore to the point, it’s that she is all that stands between us and one of those characters as president.\nJohn Brummett, whose column appears regularly in the Arkansas Democrat-Gazette, was inducted into the Arkansas Writers’ Hall of Fame in 2014. Email him at jbrummett@arkansasonline.com. Read his @johnbrummett Twitter feed.","url":"https://www.arkansasonline.com/news/2016/mar/16/brummett-online-about-big-primaries-last-night/?page=4"}
