{"authors":["John Brummett"],"date_download":"2018-10-30 17:54:20","date_modify":"2018-10-30 17:54:20","date_publish":"2018-06-27 04:30:00","description":"Let’s check on the latest excuse for political dialogue occurring at the intersection where disgraceful Trumpian behavior and Democratic haplessness collide.","filename":"data/vaneerConsumption/BRUMMETTONLINEHownottoopposeTrump.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_jun_27__1540922060.html","title":"BRUMMETT ONLINE: How not to oppose Trump","title_page":"BRUMMETT ONLINE: How not to oppose Trump","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Let’s check on the latest excuse for political dialogue occurring at the intersection where disgraceful Trumpian behavior and Democratic haplessness collide.\nWe have Maxine Waters, Democratic congresswoman from California. She is telling supporters that, if they see a Trump administration official at a public place, maybe a gas station, they should put out the word for reinforcements to come “push back” and shout at the Trump administration official.\nWhat should they shout? Waters says they ought to let the no-account Trumpian rascal know that he or she is not welcome at whatever place he or she happens to be.\nThat’s a new advancement in political rhetoric, as best I can determine. I am personally unaware of any previous instance of a politician urging that opposing politicians be unwelcomed at gas stations.\nThe president, Donald Trump, who can sink to any occasion, put on Twitter that Waters was “low IQ,” although an intelligence quotient is not necessarily related to absurd and counterproductive political tactics. Then he tweeted that “Max,” as he referred to the congresswoman, ought to be careful what she wished for.\nIt was unclear what the president meant. A threat? But of what? Might Waters someday find herself unwelcomed at a self-service pump?\nTrump accused Waters of threatening harm against his people, though she didn’t exactly say that. This president thus demonstrated once again that he can overstate anything or anyone, even Maxine Waters.\nHouse Speaker Nancy Pelosi rebuked her caucus member, Waters, saying calls for harassment of the opposition were not appropriate or the smart way to go. She said she understood the disdain for Trump, but that Waters and those engaging in harassing acts were descending to Trump’s level.\nPelosi, you might be aware, represents to many conservative Arkansas voters the radical left. Yet here she was seeking to moderate and make peace, which just goes to show what state Rep. Clarke Tucker of Little Rock faces as an obstacle to defeating French Hill in the 2nd Congressional District race this fall.\nIt’s problem enough for Tucker that Republicans morph him into Pelosi. Now Republicans are saying there are two faces of the Democratic midterm slate in November — Pelosi’s and, somehow worse, Waters’.\nThe New York Times published an analytical piece Monday explaining Democratic angst about how to oppose Trumpism in the midterms.\nThe article said the difference was largely generational, with younger liberals believing standard rules of engagement no longer apply. Older left-of-center analysts — the one writing this column, for example — see as counterproductive and backlash-inviting such spectacles as we’ve seen lately.\nDavid Axelrod, a key senior aide to Barack Obama’s presidency, is an older Democrat. He declared Monday that harassing or non-civil tactics were potentially ruinous for Democrats. They threaten to make a sympathetic figure even of Sarah Sanders, the banished would-be diner, Axelrod said, as if astonished at the near-accomplishment.\nMeanwhile, in Little Rock, we see an example of how the Trump resistance could and should demonstrate in the street with the proper tone and context.\nMembers of the Indivisible movement began Monday morning waving a banner at motorists saying French Hill should himself be “repealed and replaced.”\nHill, you see, voted for a bill to repeal the Affordable Care Act and replace it with … well, nothing much, except for removal of premium-equity guarantees for persons with pre-existing conditions.\nPublic displays reflecting raw sentiment to repeal and replace a politician who would have repealed health insurance and replaced it with uncertainty for the sickest people — that’s better politics, by tone and persuasiveness.\nIt’s not appeasing Trump to oppose him with less overwrought spectacle and more surgical precision.\nJohn Brummett, whose column appears regularly in the Arkansas Democrat-Gazette, is a member of the Arkansas Writers’ Hall of Fame. Email him at jbrummett@arkansasonline.com. Read his @johnbrummett Twitter feed.","url":"https://www.arkansasonline.com/news/2018/jun/27/brummett-online-how-not-oppose-trump/"}
