{"authors":["John Brummett"],"date_download":"2018-10-30 19:10:30","date_modify":"2018-10-30 19:10:30","date_publish":"2016-05-18 05:45:00","description":"I was brought up by a Marine veteran of World War II’s Pacific battle on Okinawa. He wouldn’t talk about his experience.","filename":"data/vaneerConsumption/BRUMMETTONLINEThesmelloftestosterone.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_may_18_brummett-online-smell-testosterone__page=3_1540926630.html","title":"BRUMMETT ONLINE: The smell of testosterone","title_page":"BRUMMETT ONLINE: The smell of testosterone","title_rss":"NULL","source_domain":"arkansasonline.com","text":"I was brought up by a Marine veteran of World War II’s Pacific battle on Okinawa. He wouldn’t talk about his experience.\nHe sobbed and fled the time I pressed too hard.\nHe never declared himself worthy of political office for the historic hardness of that service.\nHere’s about all I got from him on military-driven public policy: Back in the ’80s when self-professed patriots were assailing me for columns ridiculing the idea of a constitutional amendment to ban flag-burning, and telling me I would understand the inspiration of that flag if I’d ever been on a battlefield and seen it flying, I asked my dad about that. He scoffed.\nIf those guys saw a flag on a battlefield, he said, then they were way back down the hill behind him. And by the way, he said: The idea was to crawl. It was to not call attention to yourself, lest you get shot. Any damned fool waving a flag where he was would have been dead in an instant.\nYour real motivation, I said, must have been simply to survive the moment. He paused and said, “I reckon.”\nSo I have been steadily fascinated by Tom Cotton’s incessant barrage of glowing heroic self-reference to his award-winning Army captain’s service in combat in Iraq and Afghanistan.\nI’ve considered the differences. My dad served in a period of near-universal service, and all he abandoned was an eighth-grade education and a tenant farm. Cotton served as a Harvard Law grad in an all-volunteer era and left an elite law career. Cotton was a specially trained Army Ranger. My dad’s discharge papers say he was but a private and rifleman. Cotton got a Bronze Star for meritorious service in a combat zone. My dad got a bus ticket home from Camp Lejeune in North Carolina. (His story was that the Marines bought him a ticket to Nashville, Tenn., when, in fact, he’d meant the Nashville in Howard County in Arkansas). And my dad served in a time of slow media. Cotton served in a time of live television coverage of war.\nI see all that. I get it. There are differences of class, prestige, circumstance and, considering the Bronze Star, soldier performance.\nStill, Cotton’s acceleration last week of his legendary autobiography of war-tested physical magnificence was rather remarkable.\nHe basically said he was more qualified than Obama to set foreign policy because he’d been a tough guy in war and Obama and the other sissy boys in the White House hadn’t.\nThe argument was about “heavy water,” which Iran has a lot of and which can be used effectively in nuclear processes. The nuclear deal with Iran requires Iran to rid itself of vast quantities. To help it comply, and to keep heavy water out of the hands of, say, North Koreans, the United States bought $8.6 million worth of it, which came to about 32 metric tons.\nThat irritated Cotton, who wants to fight, not trade, and contends we shouldn’t send our hard-earned money to no-accounts like Iran. So he attached a rider to a domestic energy and water spending bill of $37.5 billion to prohibit future heavy-water transactions with Iran.\nWhite House spokesman Josh Earnest ridiculed Cotton, saying he wouldn’t know heavy water from sparkling water. In time, Cotton had to withdraw his showboat amendment — walk away from the grandstand, in other words — so the spending bill could proceed. A senator of his own party, Lamar Alexander of Tennessee, was especially outspoken about the nonsense of Cotton’s stunt.\nBut Cotton didn’t withdraw the amendment without returning fire against Earnest and every other sissy man in the White House, whether within the Oval Office or without.\nHe said his stand was no laughing matter and that anyone who had been “man enough” to serve as he had would understand the seriousness.\n“This chump [Earnest] thinks it’s a laughing matter that American taxpayer dollars are subsidizing Iran’s nuclear program,” Cotton railed. “I don’t think it’s that funny. If he had ever been man enough to put on a uniform and go serve in combat and have to worry about dodging Iranian bombs, he might not be laughing so hard.”\nCotton said his comment applied to Earnest “or, for that matter, pretty much any of the other ‘yes men’ and ‘fan boys’ the president has on his staff, as well as the president himself.”\nThe next day a writer with a right-wing news service put on Twitter that the White House loves to ridicule Cotton, and Cotton replied: “Feeling is mutual: community organizers, failed novelists and physical cowards are good material.”\nPhysical cowards? That’s almost a call to a fistfight, like taunting with the sound of a chicken on a playground.\nAnd Cotton apparently equates physical cowardice with not fighting in a war, which would make cowards of Abraham Lincoln and Franklin Delano Roosevelt, our greatest war-time presidents even if neither was really “man enough” for the job.\nSpeaking of other sissies, Ronald Reagan managed to crush Grenada, and Dick Cheney, who famously said, “I had other priorities in the ’60s than military service,” performed a White House coup on George W. Bush and started an odd war with Iraq over something Iraq didn’t do.\nJohn Brummett, whose column appears regularly in the Arkansas Democrat-Gazette, was inducted into the Arkansas Writers’ Hall of Fame in 2014. Email him at jbrummett@arkansasonline.com. Read his @johnbrummett Twitter feed.","url":"https://www.arkansasonline.com/news/2016/may/18/brummett-online-smell-testosterone/?page=3"}
