{"authors":["Bill Chappell"],"date_download":"2018-10-22 21:20:45","date_modify":"2018-10-22 21:20:45","date_publish":"2016-04-25 00:00:00","description":"Announcing that all its stations would be operating today, Brussels' transport authority used a smiley face in its tweet.","filename":"data/vaneerConsumption/BrusselsReopensMetroStationWhereBombingTookLives.json","image_url":"https://media.npr.org/assets/img/2016/04/25/ap_382672371451_wide-f4004710d12a591b202687d4d6a00b82733ed5a8.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_04_25_475563487_brussels-reopens-metro-station-where-bombing-struck_1540243245.html","title":"Brussels Reopens Metro Station Where Bombing Took Lives","title_page":"Brussels Reopens Metro Station Where Bombing Took Lives : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Brussels Reopens Metro Station Where Bombing Took Lives\nEnlarge this image toggle caption Geert Vanden Wijngaert/AP Geert Vanden Wijngaert/AP\nTrains began picking up passengers at the Maelbeek metro station in Brussels on Monday morning, more than a month after a terrorist bombing killed more than a dozen people there and wounded many more. The city's metro is now largely back to normal — with a noticeable security presence.\n\"Only two entrances per station will be open for now, and police and army patrols will be maintained,\" Teri Schultz reports for our Newscast unit. \"A commemorative wall has been put up in the station for anyone who wants to leave a message of support and condolences.\"\nAnnouncing via Twitter that all its stations would be open today, Brussels' transport authority, known by the acronym STIB, used a smiley face in its tweet. The agency also said that it's extending operating hours, which had been sharply limited after the attacks, with transit service after midnight. STIB says it is \"delighted to again offer complete transport to its passengers.\"\nApart from the human toll, transport officials have said that the Maelbeek station suffered mainly cosmetic, not structural, damage on March 22, when coordinated attackers hit the city's airport and metro system.\nSpeaking to a passenger who used the station this morning, Flanders News relays the comments of a woman who said, \"It is strange, I am not at all at ease.\" She added, \"I work a couple of buildings away and we followed what had happened from close range.\"","url":"https://www.npr.org/sections/thetwo-way/2016/04/25/475563487/brussels-reopens-metro-station-where-bombing-struck"}
