{"authors":[],"date_download":"2018-10-23 01:00:08","date_modify":"2018-10-23 01:00:08","date_publish":"2015-11-23 00:00:00","description":"Brussels remains on high alert for the third day with schools and the metro system closed. NPR's Kelly McEvers talks with reporter Teri Schultz in Brussels about how this is affecting residents there.","filename":"data/vaneerConsumption/BrusselsRemainsOnHighAlertDueToTerrorThreats.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=457139679_1540256408.html","title":"Brussels Remains On High Alert Due To Terror Threats","title_page":"Brussels Remains On High Alert Due To Terror Threats : NPR","title_rss":"NULL","source_domain":"npr.org","text":"KELLY MCEVERS, HOST:\nBrussels is still on high alert today for the third day in a row. Schools and shops are closed, and the Metro service has been stopped. Belgian authorities issued the level-four alert - this is the highest alert there - on Saturday. They cited the threat of a serious an iminent attack like the one in Paris. Since then, almost two dozen people have been detained in raids, but most of those have been released. And a main suspect, Salah Abdeslam, who's believed to have taken part in the Paris attacks, remains at large. For more from Brussels, we are joined by reporter Teri Schultz. And Teri, the government came out just a little bit ago and said that the schools and the metro will reopen on Wednesday.\nTERI SCHULTZ: That's right. Well, Belgian prime minister Charles Michel says that the maximum terror alert will remain through next Monday, but they will begin to gradually, he said, reopen the metro and schools from Wednesday. I think the sense is just that people want to start returning to normalcy. There haven't been any attacks so far, although there also haven't been any explosives or firearms found after we were told that several individuals had these and were planning, as you mentioned. a Paris-style attack. So I think that people just feel a sense of urgency to start getting back to normal, even if we are living under what we will know is maximum terror alert.\nMCEVERS: Teri, what is the latest from the investigation? I mean, what are you hearing from officials there in Brussels?\nSCHULTZ: Well, there have been a series of raids throughout Brussels and other cities. And prosecutors are having to let most of these people go after they bring them in for questioning. There are only four people who've been formally charged so far. Two of those are friends of Salah Abdeslam who are believed believed to have driven over to Paris after the attack, picked him up and brought him back and dropped him off here in Brussels. They've been charged. And there are two others charged more generally in the Paris attacks.\nOf course, the main suspect, Salah Abdeslam, is still at large. But we're told by the interior minister, Jan Jambon, that there are several individuals they are still going back after. And I spoke with a police source today who said that the main targets are people who are known to have gone to Syria and fought with the Islamic State or were preparing to go to Syria. There's a strong undercurrent of radicalization here in Brussels. That's something that we're going to be hearing more and more about as these plots are uncovered.\nMCEVERS: We've heard people use the term lockdown to describe what is going on there. What is the actual feeling on the street? I mean, how much of the city is actually closed?\nSCHULTZ: Well, I walked around each of these three days of the maximum terror alert, and it doesn't feel like a city under siege. Although, it is much quieter than it would be. Today, at lunch time, I walked through an area that would have been very busy with people out walking on their lunch break, jogging, and it was extremely quiet.\nAnd part of that is because with kids out of school, of course parents had to stay home to take care of them. And with no metro, many workplaces just told people to go ahead and stay home and work from there, including the European Union institutions and NATO Headquarters, which are both here, of course. But I don't get the sense that people are panicking. And I think that it will be welcomed on Wednesday when kids go back to school and offices reopen fully.\nMCEVERS: Reporter Teri Schultz in Brussels, thank you so much.\nSCHULTZ: It's a pleasure, Kelly.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=457139679"}
