{"authors":["Erica Tempesta For Dailymail.Com"],"date_download":"2018-10-23 03:02:59","date_modify":"2018-10-23 03:02:59","date_publish":"2016-01-11 15:38:53","description":"The 34-year-old actress, who was a presenter at Sunday's awards show, bought her $4,800 Jenny Packham gown at Neiman Marcus last week.","filename":"data/vaneerConsumption/BryceDallasHowardboughtherGoldenGlobesdressatadepartmentstore.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/300C07C400000578-0-image-a-7_1452529320270.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3393978_Size-SIX-star-Bryce-Dallas-Howard-reveals-bought-Golden-Globes-dress-department-store-designers-don-t-lots-options-size_1540263779.html","title":"Bryce Dallas Howard bought her Golden Globes dress at a department store","title_page":"Bryce Dallas Howard bought her Golden Globes dress at a department store | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Most celebrities rely on stylists and borrowed dresses for award shows, but actress Bryce Dallas Howard revealed that she headed to the department store to by her own gown for the Golden Globes because designers don't offer many options for women who don't fit into sample sizes, which are usually a size zero or two.\nWhile walking the red carpet at Sunday's awards show, the 34-year-old actress told E! News host Giuliana Rancic that she had purchased her stunning Jenny Packham sequined gown at Neiman Marcus last week.\n'I like having lots of options for a size six, as opposed to maybe one option, so I always go to department stores for this kind of stuff,' she said of buying the $4,800 dress.\nScroll down for video\nKeeping it real: Bryce Dallas Howard revealed at the Golden Globes on Sunday that she purchased her stunning sequined Jenny Packham gown at the department store Neiman Marcus\nSelection: 'I like having lots of options for a size six, as opposed to maybe one option, so I always go to department stores for this kind of stuff,' Bryce said of her $4,800 gown\nGiuliana was visibly surprised when the Jurassic World star admitted that she 'just picked it up at Neiman's this week', but after the mother-of-two shared her reasoning, the host celebrated her decision.\n'Give me a high five, baby,' Giuliana said.\n'I mean it's just, you know how it is?' Bryce added, while Giuliana replied: 'Oh, I hear you sister.'\nDuring her interview with Giuliana, Bryce also revealed that it was her first time attending the Golden Globes.\nCandid confession: The 34-year-old told E! News host Giuliana Rancic that she usually buys her red carpet outfits off the rack because designers don't offer many options for her size six figure\nCelebration: Giuliana, who was surprised that Bryce had purchased her gown offered the actress a high five\n'I got nominated one year, but it was the year that was the writer strikes, so it kind of got canceled that year. Well, it did get canceled. Other than that, I have never been. I am so excited.'\nBryce paired her stunning in the midnight blue 3/4 sleeve gown with orange gemstone earnings and a matching clutch, leaving her red hair down and parted to one side.\nAnd after her candid red carpet confession, many took to Twitter to praise Bryce for calling attention to the the fact that not all actresses can fit into sample sizes.\n'When @BryceDHoward said she went to a dept. store to buy a dress, \"size 6's need options too,\" I wish she would have dropped the mic. #gg [sic],' tweeted social media star and author Kelly Oxford.\nBeing honest: Many people took to Twitter to praise Bryce for acknowledging that not all actresses where sample sizes, which are usually a size zero or two\nInspiring change? New York Times fashion director and chief critic Vanessa Friedman tweeted that it was 'good' that the Jurassic World star shared her size - and the origin of her dress - with the world\nTotal shock: This Twitter user noted that size six is considered 'tiny' everywhere except Hollywood\nOff the rack: Izzy Grinspan joked that Giuliana struggled to comprehend why an A-list star would actually buy her own dress\nIn her dreams: Author and social media star Kelly Oxford tweeted that she wished Bryce would have 'dropped the mic' after she explained that size six women need dress options too\nAnother Twitter user named Jennifer noted that it is crazy to think that the actress can't get a dress in her size.\n'Bryce Dallas Howard mentioned she can't get a size 6 from designers. WTF? Size 6 is tiny. But 00 is the Hollywood standard [sic],' she wrote.\nMeanwhile, New York Times fashion director and chief critic Vanessa Friedman praised Bryce for sharing her real size and the origins of her dress.\n'Bryce Dallas Howard just revealed she bought her blue sequined @jennypackham herself -- and that she is size 6. This is good. #GoldenGlobes,' she tweeted.\nBeautiful pair: Bryce Dallas Howard can be seen presenting an award at the show alongside Orlando Bloom\nEnjoyinig the moment: Bryce is pictured with her husband Seth Gabel at the InStyle and Warner Bros. 73rd annual Golden Globe Awards post-party at The Beverly Hilton Hotel\nAnd the Twitter account Deal Divas added: 'Amen to Bryce saying she likes to shop at the mall because she can find things in a size 6. AMEN I SAY. #tbtglobes #GoldenGlobes [sic].'\nBryce, who has been criticized for her size in the past, struggled with her weight along with along with postpartum depression following the birth of her son Theo back in 2007.\n'Before Theo was born, I had been in good humor about my 80-pound weight gain, but I was now mortified by it,' she revealed. 'I felt I was failing at breast feeding. My house was a mess. I believed I was a terrible dog owner. I was certain I was an awful actress.'\nDown-to-earth: Bryce, who is pictured at the Jurasic World premiere last June and on the red carpet last October, said she often heads to department stores to pick out her own dresses\nFamily affair: Bryce and Seth sat with their son Theo when her father, director Ron Howard, received another star on The Hollywood Walk Of Fame\nBryce and her husband Seth Gabel also have a daughter named Beatrice, who was born in January 2012.\nAnd while her openness about what it is really like to be a size six in Hollywood is refreshing, she isn't the only woman to struggle during awards season.","url":"https://www.dailymail.co.uk/femail/article-3393978/Size-SIX-star-Bryce-Dallas-Howard-reveals-bought-Golden-Globes-dress-department-store-designers-don-t-lots-options-size.html"}
