{"authors":["Associated Press"],"date_download":"2018-10-23 01:43:57","date_modify":"2018-10-23 01:43:57","date_publish":"2017-03-10 10:09:09","description":"LONDON (AP) - BT, Britain's former telephone monopoly, agreed Friday to hive off a unit that oversees the network used by all of the country's phone and...","filename":"data/vaneerConsumption/BTagreestohiveoffitsnetworkarminUK.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300664_BT-agrees-hive-network-arm-UK_1540259037.html","title":"BT agrees to hive off its network arm in UK","title_page":"BT agrees to hive off its network arm in UK | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"LONDON (AP) - BT, Britain's former telephone monopoly, agreed Friday to hive off a unit that oversees the network used by all of the country's phone and broadband providers in response to competition concerns.\nCommunications regulator Ofcom said the company will turn its Openreach unit into an independent entity that will have its own board and chief executive while remaining part of BT Group.\nOfcom ordered the separation in November because of concerns BT wasn't consulting with other telecommunications firms about projects that affect them. The agreement allows the split to take place without the delays that would have been caused by the sale of Openreach, Ofcom said.\n\"This is a significant day for phone and broadband users,\" Sharon White, Ofcom chief executive, said in a statement. \"The new Openreach will be built to serve all its customers equally, working truly independently and taking investment decisions on behalf of the whole industry - not just BT.\"\nSky Plc, which provides phone, internet and cable TV throughout the U.K., described the move as \"a welcome step that we have long called for on behalf of our customers.\"\n\"It's important that today's agreement is now implemented by BT in good faith and without delay,\" Sky said.\nGeorge Salmon, an analyst at Hargreaves Lansdown, said the outcome, while not unexpected, is still good news for shareholders.\n\"With competitors such as Sky and TalkTalk crying foul, there was always an element of doubt as to whether BT and Openreach would be required to do the splits,\" Salmon said. \"The news that it will remain part of the wider group, although with its own distinct board and brand, should put to bed any lingering concerns investors may have had over this potentially disruptive issue.\"","url":"https://www.dailymail.co.uk/wires/ap/article-4300664/BT-agrees-hive-network-arm-UK.html"}
