{"authors":["Press Association"],"date_download":"2018-10-23 01:17:34","date_modify":"2018-10-23 01:17:34","date_publish":"2017-03-10 09:13:05","description":"Openreach Limited will have its own branding that will not feature the BT logo.","filename":"data/vaneerConsumption/BTreachesOfcomagreementtolegallyseparatefromOpenreach.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/09/wire-195045-1489137191-860_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4300494_BT-reaches-Ofcom-agreement-legally-separate-Openreach_1540257454.html","title":"BT reaches Ofcom agreement to legally separate from Openreach","title_page":"BT reaches Ofcom agreement to legally separate from Openreach | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BT has reached an agreement with Ofcom to legally separate its infrastructure arm Openreach.\nThe telecoms giant has faced growing calls from rivals to hive off Openreach, and in November the communications regulator ordered a legal separation of the firm.\nOn Friday, the pair said they have reached agreement on a “long-term regulatory settlement that will see Openreach become a distinct, legally separate company with its own board, within the BT Group”.\nA British Telecom Openreach van\nBT has agreed to Ofcom’s requirements for the legal separation of its network division, Openreach: https://t.co/CZphzQUZGa pic.twitter.com/sAsfvXwgev — Ofcom (@Ofcom) March 10, 2017\nAround 32,000 employees will transfer to the newly formed Openreach Limited following TUPE consultation and after pension arrangements are in place.\nOfcom said, since BT has agreed to all of the changes needed to address its competition concerns, it will no longer need to impose these changes through regulation.\nOpenreach builds and maintains the tens of millions of copper and fibre lines that run from telephone exchanges to homes and businesses across the UK.\nOpenreach to become a distinct company with its own staff, management and purpose. This is how it will work: https://t.co/CZphzQUZGa pic.twitter.com/GTKBDTze1Y — Ofcom (@Ofcom) March 10, 2017\nOfcom boss Sharon White called it a “significant day” for phone and broadband users and pledged to “carefully monitor” how the new Openreach performs.\nUnder the agreement, the Openreach chief executive will report to the Openreach chairman, with accountability to the BT Group chief executive.\nGavin Patterson, BT chief executive, said: “I believe this agreement will serve the long-term interests of millions of UK households, businesses and service providers that rely on our infrastructure.\n“It will also end a period of uncertainty for our people and support further investment in the UK’s digital infrastructure.\n“We have listened to criticism of our business and as a result are willing to make fundamental changes to the way Openreach will work in the future.”","url":"https://www.dailymail.co.uk/wires/pa/article-4300494/BT-reaches-Ofcom-agreement-legally-separate-Openreach.html"}
