{"authors":["Abc News"],"date_download":"2018-10-30 00:57:07","date_modify":"2018-10-30 00:57:07","date_publish":"2018-10-29 14:56:24","description":"Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.","filename":"data/vaneerConsumption/BucstostartRyanFitzpatrickatQBvsPanthersDirkKoettersays.json","image_url":"http://media.video-cdn.espn.com/motion/2018/1029/dm_181029_kershaw_machado_future/dm_181029_kershaw_machado_future_default.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Sports_bucs-start-ryan-fitzpatrick-qb-panthers-dirk-koetter_story_id=58833292_1540861027.html","title":"Bucs to start Ryan Fitzpatrick at QB vs. Panthers, Dirk Koetter says","title_page":"Bucs to start Ryan Fitzpatrick at QB vs. Panthers, Dirk Koetter says - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"The Tampa Bay Buccaneers will start Ryan Fitzpatrick at quarterback this week against the Carolina Panthers, coach Dirk Koetter announced Monday.\nKoetter benched quarterback Jameis Winston on Sunday against the Cincinnati Bengals after the former No. 1 overall pick threw his fourth interception of the game, which was returned by safety Jessie Bates for a touchdown.\nFitzpatrick rallied the Buccaneers from an 18-point fourth-quarter deficit to tie the game, but Cincinnati won 37-34 on a field goal with no time remaining. Fitzpatrick went 11-for-15 for 194 yards and two touchdowns.\nTurnovers have plagued Winston going back to his college career and could be the difference-maker in his future with both the Bucs and the league. He has 11 turnovers in four games (three starts).\nWinston has thrown multiple interceptions in a game 16 times in his career, breaking the tie he had with Blake Bortles for the most multi-interception games since he entered the league in 2015.\nThe Bucs already have picked up the fifth-year option on his contract, worth $20.9 million, but that is guaranteed for injury only. They could cut him with zero financial implications prior to the beginning of the new league year on March 13, 2019, at 4 p.m ET.\nFitzpatrick began the season as the team's starter while Winston served his three-game suspension for violating the NFL's personal conduct policy, stemming from him allegedly inappropriately touching an Uber driver in 2016.\nFitzpatrick has thrown for 1,550 yards with 13 touchdowns and five interceptions this season.\nESPN's Jenna Laine contributed to this report.","url":"https://abcnews.go.com/Sports/bucs-start-ryan-fitzpatrick-qb-panthers-dirk-koetter/story?id=58833292"}
