{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:26:38","date_modify":"2018-10-30 22:26:38","date_publish":"2016-09-28 08:00:00","description":"The slick website offers many ways to get high. Three pre-rolled joints will cost you $30. A gram of hash is $45. Blueberry, pineapple or brownie-flavored","filename":"data/vaneerConsumption/BuddingconfusionSplitoverwhetherProp64allowsondemandmarijuanadelivery.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/MarijuanaDeliveriesMain-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938398.html","title":"Budding confusion: Split over whether Prop. 64 allows on-demand marijuana delivery","title_page":"Budding confusion: Split over whether Prop. 64 allows on-demand marijuana delivery | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"The slick website offers many ways to get high. Three pre-rolled joints will cost you $30. A gram of hash is $45. Blueberry, pineapple or brownie-flavored cannabis treats go for about $12 a bag. (“Caution,” the label says, they are “very strong.”)\nIt takes just few taps on a smart phone to place an order, and then the goods arrive.\n“I’ve had it where a patient who doesn’t have a medical card gets it through our partner service… in less than 15 minutes, and we have marijuana to their door in 45,” said Nick Ocampo of Sacramento, who owns mynugrun.com, one of many companies in California that sell weed online and deliver it on demand.\n“It’s like ordering a 6-pack of beer from Postmates, or becoming a member of a wine club.”\nMarijuana delivery websites are exploding in popularity: A recent survey by the California Growers Association, which represents hundreds of marijuana businesses in the state, found that almost half of all regulated pot purchases are now done through web-based delivery services. The bigger ones have already attracted millions in venture capital, hailing themselves the “Uber” of the medical marijuana world. They publish detailed how-to guides for cannabis-delivery drivers, and boast the ability to get medical marijuana to you faster than a pizzeria can deliver a pepperoni pie.\nBut with California voters considering Proposition 64 on the November ballot to allow recreational pot, police chiefs are warning that on-demand delivery will make it too easy for teenagers to get their hands on the drug. “There is less accountability to do that ID check in the doorway of someone’s home,” said Lauren Michaels, a lobbyist for the California Police Chiefs Association, which has joined a long list of law enforcement groups in opposing Prop. 64.\nThe concern is revealing confusion among advocates of legalizing recreational marijuana—who offer contradictory opinions about whether Prop. 64 would allow for on-demand delivery of recreational weed.\nThe official pro-Prop. 64 campaign maintains that fears of on-demand delivery are unfounded—insisting that the initiative only allows recreational marijuana to be sold in a physical storefront, not online or at a customer’s front door. Home delivery could only take place after customers purchase marijuana from a brick-and-mortar dispensary, where they must show ID to prove they’re at least 21, said campaign spokesman Jason Kinney. And, he said, local governments can pass ordinances to ban even that limited form of delivery.\n“It was the intention of the drafters of Prop. 64 to prohibit on-demand delivery,” Kinney said. “We wanted to be very restrictive about how delivery services work.”\nThat interpretation has the backing of a Sacramento superior court judge, who presided over a lawsuit over how Prop. 64 could be described in the state’s voter handbook. After listening to supporters and opponents argue over whether the initiative allows for on-demand delivery of non-medical weed, she sided with the pro-Prop. 64 campaign in ruling that it would not. Opponents argued that the initiative would allow for delivery of orders placed online, but the judge agreed with the campaign’s argument that technology platforms could only be used to track deliveries after purchase in a storefront.\nProp. 64: Excerpt of court transcript\nBut marijuana industry professionals are surprised—incredulous, even—at the suggestion that web-based delivery would really be excluded if the initiative passes.\n“I think that is a very strange interpretation and I see nothing to lead me to believe that that will be the status,” said Hezekiah Allen, executive director of the cannabis growers association.\n“It doesn’t make any sense. You don’t go to Taco Bell and buy your tacos, and ask them to drive it to you.”\nThe CEO of Eaze, a tech platform that calls itself the “Uber of pot,” said the company is well-positioned to expand in California if voters approve recreational use—he’s already figured out how to streamline the online ordering process without a doctor’s note. So Keith McCarty said he was “baffled” to hear from a reporter that legalization proponents say his business model would be prohibited under Prop. 64.\n“I’ve read through the language pretty intently with our legal team and our lobbyist, and that’s the first I’ve heard of that,” McCarty said this week. “The Prop. 64 team was in our office last week and that certainly wasn’t the message they gave.\nThe funding behind Prop. 64 indicates a strong interest in pot inside the tech world, where entrepreneurs already are speculating about the potential market for cannabis delivery by drones. A tech mogul with a track record of creating wildly successful online platforms is the initiative’s main donor. Sean Parker, the founder of Napster and the first president of Facebook, has given $8.8 million to support the campaign—about half the money it’s raised so far. Weedmaps, an Irvine-based website that advertises various marijuana businesses, including delivery services, has contributed $1 million.\nLast year, California lawmakers passed sweeping legislation to better regulate medical marijuana, an industry that had grown without much government oversight in the two decades since voters approved medicinal use. Police chiefs supported the legislation, even though it allows for home delivery. (One argument is that delivery serves sick people who might benefit from medical marijuana but are unable to travel to a store.) The legislation allows cities to pass more stringent local controls, and several—including Los Angeles and San Jose—have since banned delivery.\nWhen voters in the state of Washington approved an initiative legalizing recreational marijuana, it explicitly banned delivery, said Hilary Bricken, a Seattle attorney whose practice focuses on marijuana law.\nShe doesn’t see a similar approach when she looks at Prop. 64. The way it’s written, Bricken said, leaves room for details on the use of technology platforms to be worked out after the initiative passes. “People will lobby to get it defined in a way that supports their business model,” she said. “And certainly the entrepreneurs will want delivery.”\nThe text of Prop. 64 runs more than 60 pages long. Even so, it may ultimately fall to state regulators, or possibly even the courts, to decide the details of what it does and doesn’t permit.","url":"https://calmatters.org/articles/budding-confusion-split-over-whether-prop-64-would-allow-on-demand-marijuana-delivery/"}
