{"authors":["Associated Press"],"date_download":"2018-10-22 21:17:51","date_modify":"2018-10-22 21:17:51","date_publish":"2016-01-29 06:20:37","description":"PROVIDENCE, R.I. (AP) — Former Mayor Buddy Cianci, the wisecracking political rogue who presided over the revitalization of Providence during two stints in o...","filename":"data/vaneerConsumption/BuddyCiancidominantinRhodeIslandpoliticsdiesat74.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:cbf30719963841d88e865618d7dfbf62-4PuZeKVXE7cd9005b2c8765a581e-623_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421219_Former-Providence-Mayor-Vincent-Buddy-Cianci-dies-74_1540243071.html","title":"Buddy Cianci, dominant in Rhode Island politics, dies at 74","title_page":"Buddy Cianci, dominant in Rhode Island politics, dies at 74 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Buddy Cianci, dominant in Rhode Island politics, dies at 74\nPROVIDENCE, R.I. (AP) — Former Mayor Buddy Cianci, the wisecracking political rogue who presided over the revitalization of Providence during two stints in office cut short by criminal charges and a prison sentence for corruption, died Thursday. He was 74.\nWLNE-TV said Cianci was taping his weekly TV show, \"On the Record with Buddy Cianci,\" on Wednesday evening when he had severe stomach pains and was taken by ambulance to a hospital. A hospital spokeswoman said he died Thursday morning. She did not release the cause.\nDespite his criminal record, Cianci was beloved by many in the city who credited him with resurrection of Providence from a decaying, Industrial-age relic to a 21st-century city with gondolas plying newly uncovered rivers. His bare-fisted style of politics made Cianci larger than life even in a tiny state known for the outsized personalities of its public figures.\nFILE - In this in Jan. 7, 1991 file photo, Providence, R.I., Mayor Vincent \"Buddy\" Cianci Jr., stands during his inauguration ceremony. Cianci, the wisecracking political rogue who presided over the revitalization of Providence during two stints in office cut short by criminal charges and a prison sentence for corruption, died Thursday, Jan. 28, 2016, in Providence. He was 74. (AP Photo/Charles Krupa, File)\nMayor Jorge Elorza, who defeated Cianci in his 2014 comeback bid for mayor, ordered flags in Providence flown at half-staff and said the city is making arrangements to recognize his memory.\nCianci spent 21 years in office and was elected to six terms during two stints as mayor, starting in 1974 and ending in 2002 with his federal corruption conviction.\nDuring that time, he used his outsized personality to sell his city — and himself — to a national audience. With a quick wit, political smarts and flair for spectacle and legendary toupee, Cianci was able to attract national attention to the capital of the nation's smallest state.\nHe started his own line of pasta sauce and managed to have it put on display in the window of Cartier on Fifth Avenue in New York. He became a darling of national TV and radio shows and rubbed elbows with luminaries such as Frank Sinatra. He said often in his later years that his proudest achievement was raising the self-esteem of the people of Providence.\n\"He's the most talented politician that New England has produced since John Kennedy,\" former University of Rhode Island political scientist Marc Genest said in a 2002 interview.\nCianci began his public career as a state prosecutor on the attorney general's anti-corruption task force and made a name for himself going after members of the powerful mob families.\nIn 1974, at 32, he capitalized on a rift in the dominant Democratic Party to win the mayoral post as a Republican. His first three terms were marred by scandal. Twenty-two city workers and contractors were convicted of corruption charges, including Cianci's chief of staff and city solicitor. The mayor was never charged.\nPersonal problems sidetracked Cianci's career in 1984.\nHe pleaded no contest to attacking his estranged wife's alleged lover with an ashtray, lit cigarette, and a fireplace log. As a condition of his plea deal, he was forced to resign.\nCianci took a job as a talk-radio host on a local station and regained the mayor's office in 1990. The second coming of Cianci coincided with the \"Providence renaissance.\"\nRivers that had run through underground culverts were reclaimed. People flocked to a downtown that just decades ago had been a dangerous, seamy zone. The city became a beacon for tourists and gained a hip reputation.\nCianci soaked up the attention.\nBut beneath the glitter, the city was rotting. Buddy's Providence was a town for sale, federal prosecutors said, where even routine dealings with City Hall — such as applying for jobs or bidding on contracts — meant greasing a few palms.\nThe charismatic mayor became ensnared in an FBI investigation into City Hall corruption, code-named \"Operation Plunder Dome.\" In 2001, he was indicted on charges he orchestrated bribes for jobs, contracts and contributions to his campaign fund.\nCianci vehemently proclaimed his innocence: \"I have said to you before, there are no stains on this jacket, and I assure you there still are no stains on this jacket,\" he said after the indictment.\nIn a circus-like trial in 2002 that lasted seven weeks and featured a local who's who list of wise guys and mob wannabes, a jury found Cianci guilty of one count of racketeering conspiracy. The judge compared him to Dr. Jekyll and Mr. Hyde at sentencing.\nCianci maintained his innocence, and appealed. But those failed, and he served 4½ years behind bars.\n\"I love this city. It's a very, very saddening thought to be separated from it,\" he told The Associated Press the morning he left for prison. \"My whole life, personally and professionally, has revolved around it. How do you walk away from that? I'm not sure you do. ... Providence is a part of me.\"\nIn a 2011 memoir, he acknowledged misusing his office while maintaining he was innocent of the charges brought against him.\n\"I used my public power for personal reasons. I admit it,\" Cianci wrote. \"It probably wasn't the right thing to do, but it certainly felt good.\"\nHe was released from prison in 2007, and decided to leave behind his toupee, which he then jokingly referred to as \"the squirrel.\" He would later call his prison term a \"bump in the road.\"\nHe then resumed his career as a radio talk show host and TV commentator, but the draw to politics was strong.\n\"All the things that they celebrate in this city are the things that I did,\" Cianci said in 2014 as he contemplated a comeback bid for mayor.\nDespite being diagnosed with cancer the same year, he chose to jump in, running as an independent.\nFaced with the possibility of a Cianci return to office, several Democratic candidates dropped out to consolidate support behind Elorza, a political newcomer. The idea of a new Cianci administration was so objectionable that even the Republican candidate donated $1,000 to Elorza and then voted for him.\nCianci lost, but still pulled in 45 percent of the vote.\nIn November, Cianci returned to City Hall for his first significant visit since his conviction. He told The Associated Press he was filled with nostalgia as he walked through the halls where he built his career.\n\"For some reason, it looks smaller,\" he said.\nAs a portrait was unveiled that showed Cianci in his younger days, he flashed the wit that helped propel him into the national consciousness.\n\"It's not the first time I've been framed,\" he quipped.\nThe crowd roared.\nFormer Providence Mayor Joseph R. Paolino said initial plans call for a public viewing for Cianci Feb. 6-7 at Providence City Hall with a funeral Mass on Feb. 8.\nFILE - In this October 1998 Providence Mayor Vincent \"Buddy\" Cianci Jr., poses before the city skyline in Providence, R.I. Cianci died Thursday, Jan. 28, 2016, in Providence. He was 74. (AP Photo/Matt York, File)\nFILE - In this Sept. 10, 2014, file photo, former Providence Mayor Buddy Cianci attends a campaign fundraising event in Providence, R.I. The former mayor was hospitalized Wednesday, Jan. 27, 2016 after experiencing severe stomach pains. Cianci died Thursday, Jan. 28, in Providence. He was 74. (AP Photo/Steven Senne, File)\nFILE - In this June 22, 2010, file photo, former Providence, R.I., mayor and talk show host Buddy Cianci, speaks into a microphone during a live broadcast of \"The Buddy Cianci Show,\" at the WPRO radio studios in East Providence. Cianci died Thursday, Jan. 28, 2016, in Providence. He was 74. (AP Photo/Steven Senne, File)\nFILE - In this Sept. 6, 2002 file photo, former Providence, R.I., Mayor Vincent \"Buddy\" Cianci waves to supporters after being sentenced to federal prison for his conviction on racketeering conspiracy charges. Cianci died Thursday, Jan. 28, 2016, in Providence. He was 74. (AP Photo/Steven Senne, File)\nFILE - In this Dec. 5, 2002, file photo, former Providence, R.I., Mayor Vincent \"Buddy\" Cianci Jr., walks away from the media following an impromptu news conference outside the Biltmore Hotel where he was living in Providence, R.I. Cianci died Thursday, Jan. 28, 2016, in Providence. He was 74. (AP Photo/Victoria Arocho, File)\nFILE - In this July 28, 2007, file photo, former Providence, R.I., Mayor Vincent \"Buddy\" Cianci, second from left, attends the WaterFire event with his granddaughter Olivia, left, in downtown Providence. Cianci died Thursday, Jan. 28, 2016, in Providence. He was 74. (AP Photo/Bizuayehu Tesfaye, File)","url":"https://www.dailymail.co.uk/wires/ap/article-3421219/Former-Providence-Mayor-Vincent-Buddy-Cianci-dies-74.html"}
