{"authors":["Associated Press"],"date_download":"2018-10-22 20:12:32","date_modify":"2018-10-22 20:12:32","date_publish":"2016-01-29 00:42:55","description":"PROVIDENCE, R.I. (AP) — Love him or hate him, Buddy Cianci put Providence on the map. A master of both retail politics and publicity stunts, Cianci used his ...","filename":"data/vaneerConsumption/BuddyCianciusedpersonalitytoputProvidenceonthemap.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:8c5c4b4f5cf14f1facd9cba2dbef74a9-2vdWmEltwXfba0ce28e632e61b74-931_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421995_Buddy-Cianci-used-personality-Providence-map_1540239152.html","title":"Buddy Cianci used personality to put Providence on the map","title_page":"Buddy Cianci used personality to put Providence on the map | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Buddy Cianci used personality to put Providence on the map\nPROVIDENCE, R.I. (AP) — Love him or hate him, Buddy Cianci put Providence on the map.\nA master of both retail politics and publicity stunts, Cianci used his considerable charms and political instincts to win six terms leading Rhode Island's capital city. Along the way, he and his trademark toupee landed countless appearances on national TV, inspired a musical and even put out his own line of pasta sauce.\nCianci died Thursday at age 74, the morning after he was overcome with abdominal pain while filming his weekly TV show. The cause was not released, but he was diagnosed with cancer in 2014.\nFILE - In this in Jan. 7, 1991 file photo, Providence, R.I., Mayor Vincent \"Buddy\" Cianci Jr., stands during his inauguration ceremony. Cianci, the wisecracking political rogue who presided over the revitalization of Providence during two stints in office cut short by criminal charges and a prison sentence for corruption, died Thursday, Jan. 28, 2016, in Providence. He was 74. (AP Photo/Charles Krupa, File)\nEven after being forced to resign because he attacked a man (with the aid of a city police officer) with a fireplace log, ashtray and lit cigarette, he won his seat back, then lost it again when he was convicted of a federal corruption charge and sent to prison.\nThe judge who sentenced him called him a modern day Jekyll and Hyde: someone who did great things as the city's biggest cheerleader, while simultaneously taking every opportunity to help himself and his friends, and exact revenge on his enemies.\nCianci grew up the son of a doctor and was educated at Moses Brown School, a private Quaker school on the city's wealthy East Side. He said that as one of the school's only Italian-Americans, he did not fit in, and wrote in his 2011 memoir that the feeling of being \"tolerated, rather than accepted\" drove him to succeed.\nIt was a feeling that followed him throughout his life. The city's elites fell out of love with him after first delivering him to office in 1974. He ran then as a mob-busting prosecutor, a Republican intent on breaking up the entrenched Democratic machine.\nCorruption ran rampant under Cianci, but his showmanship and personal connections with residents — who all called him \"Buddy\" — kept him in office. He knew how to play to the crowd, and get the most attention possible. He was a master at finding the loopholes, pushing the envelope and circumventing the rules.\nOne year, he was disinvited from the Bristol Fourth of July Parade, a voter and attention-rich venue attended by 100,000 people.\n\"Parades are to politicians as blood is to Dracula,\" he wrote in his 2011 memoir.\nInstead of missing the chance to shake that many palms and kiss that many babies, he took a helicopter into town and contrived to join a marching band, playing the whistle.\nHe created the \"Mayor's Own Marinara Sauce\" and would hand out jars to every celebrity who came through town: Hillary Clinton and Supreme Court Justice Antonin Scalia were among the recipients. He persuaded Cartier to display it in its store on Fifth Avenue in New York.\nReporters ate it up. He'd call them out of the blue to drop tips, or to offer a thought or two that he forgot to share the last time he was interviewed. He rarely turned down a request to talk, although would occasionally freeze reporters out when they wrote something unfavorable. Before long, he'd be back on the phone with them.\n\"He reveled in that contact, that back and forth,\" said Mike Stanton, a former Providence Journal reporter who wrote \"The Prince of Providence,\" the definitive book on Cianci. \"He was kind of the ringleader of the circus.\"\nCianci joked that he would attend the opening of an envelope. People who are middle-aged now recall with fondness when Cianci paid a visit to their elementary school classroom, appeared unannounced at a neighborhood barbecue or attended their Little League game.\n\"It's actually intoxicating. You wanted a tree planted on your street, I could give you a tree. There was a pothole on your block, I could get it filled. Your nephew needed a job, I could get him an interview,\" he said in his 2011 memoir. \"This was old-fashioned ward-healing local politics in action.\"\nBut it often veered into patronage, palm-greasing and score-settling.\nJust one example was what happened with the University Club, an exclusive East Side club that he had tried and failed to get into. Cianci got his revenge years later when the club tried to remodel, and the city withheld the permits. Desperate, the club's leaders came to his office, prompting him to quip: \"Be careful of the toe you step on today, because it may be connected to the ass you have to kiss tomorrow.\"\nCianci got his membership, and the line ultimately inspired a song in 2003's \"'Buddy' Cianci: The Musical.\" Characters in FOX's animated show \"Family Guy\" attend Buddy Cianci Jr. High School.\nIn 2007, after he finished his \"vacation in a federally funded gated community,\" as he referred to prison, Cianci resumed life in the spotlight as a talk radio host and TV commentator. He took a break from that in 2014 when he decided to mount a comeback campaign for office, even though he had been diagnosed with cancer.\nBy then 73, Cianci hit the trail hard and kept up a hectic pace of debates, community meet-and-greets and late nights at his campaign office.\n\"It was a great, great love affair that I had with the city of Providence,\" Cianci told supporters the night he lost with 45 percent of the vote. \"That will never end, that will continue till the day I die.\"\nFILE - In this Sept. 10, 2014, file photo, former Providence Mayor Buddy Cianci, center, speaks with supporters at a fundraising event in Providence, R.I. after announcing in June he would make a comeback bid for his old job Cianci died Thursday, Jan. 28, 2016, in Providence. He was 74. (AP Photo/Steven Senne, File)\nFILE - In this October 1998 Providence Mayor Vincent \"Buddy\" Cianci Jr., poses before the city skyline in Providence, R.I. Cianci died Thursday, Jan. 28, 2016, in Providence. He was 74. (AP Photo/Matt York, File)\nFILE - In this June 22, 2010, file photo, former Providence, R.I., mayor and talk show host Buddy Cianci, speaks into a microphone during a live broadcast of \"The Buddy Cianci Show,\" at the WPRO radio studios in East Providence. Cianci died Thursday, Jan. 28, 2016, in Providence. He was 74. (AP Photo/Steven Senne, File)\nFILE - In this Sept. 10, 2014, file photo, former Providence Mayor Buddy Cianci attends a campaign fundraising event in Providence, R.I. The former mayor was hospitalized Wednesday, Jan. 27, 2016 after experiencing severe stomach pains. Cianci died Thursday, Jan. 28, in Providence. He was 74. (AP Photo/Steven Senne, File)\nFILE - In this Sept. 6, 2002 file photo, former Providence, R.I., Mayor Vincent \"Buddy\" Cianci waves to supporters after being sentenced to federal prison for his conviction on racketeering conspiracy charges. Cianci died Thursday, Jan. 28, 2016, in Providence. He was 74. (AP Photo/Steven Senne, File)\nFILE - In this Dec. 5, 2002, file photo, former Providence, R.I., Mayor Vincent \"Buddy\" Cianci Jr., walks away from the media following an impromptu news conference outside the Biltmore Hotel where he was living in Providence, R.I. Cianci died Thursday, Jan. 28, 2016, in Providence. He was 74. (AP Photo/Victoria Arocho, File)","url":"https://www.dailymail.co.uk/wires/ap/article-3421995/Buddy-Cianci-used-personality-Providence-map.html"}
