{"authors":[],"date_download":"2018-10-22 21:10:12","date_modify":"2018-10-22 21:10:12","date_publish":"2014-05-05 16:19:37","description":"There are hundreds of vacancies at the National Weather Service, with many in states prone to tornadoes, according to a document obtained by NBC News.","filename":"data/vaneerConsumption/BudgetCutsMeanWeatherForecasterShortageinTornadoAlley.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/421851/140505-brooke-barnes-1824_b416511cc79c59cb808e780b25a0d4dd.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_investigations_budget-cuts-mean-weather-forecaster-shortage-tornado-alley-n97341_1540242612.html","title":"Budget Cuts Mean Weather Forecaster Shortage in Tornado Alley","title_page":"Budget Cuts Mean Weather Forecaster Shortage in Tornado Alley","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nWith tornado season underway the National Weather Service is short nearly 200 meteorologists, including vacancies in Tornado Alley and at the office responsible for predicting tornadoes, according to documents obtained by NBC News.\nRead a full report at NBC 5 Dallas-Fort Worth\nNBC owned and operated station KXAS in Dallas/Ft. Worth has acquired union documents showing as many as 500 vacancies at NWS offices around the country, including nearly 200 unfilled jobs for front-line meteorologists.\nMany of the offices affected are in the central and southern states most often hit by tornadoes, and there are three vacant forecasting positions at the National Storm Prediction Center in Norman, Okla., which is responsible for tracking long-range tornado threats across the country.\n“We’re basically staffed at the minimum level to cover shifts,” said Jeremy Grams, a forecaster at the National Storm Prediction Center.\n“I just hope something really bad doesn’t happen,” said Dan Sobien, president of the National Weather Service Employees Organization, the union that represents NWS forecasters.\nThe National Weather Service is funded by Congress as part of the National Oceanic and Atmospheric Administration. The automatic federal spending cuts required by \"sequestration\" chopped 8.2 percent from the NWS budget in early 2013, and NOAA's acting administrator ordered a hiring freeze. The NWS hiring freeze lasted until this January.\n\"You can only stretch a rubber band so far before it breaks”\nSobien’s group collected the information for the list obtained by NBC News. The union said that the shortages have not caused the NWS to miss any critical storm warnings, but they worry about fatigue as forecasters are forced to cover extra shifts this summer.\n“We’re pretty lucky it hasn’t happened yet, but it’s just a matter of time. You can only stretch a rubber band so far before it breaks.”\nGrams, who is also a union rep, said scheduling will be a challenge this summer when the National Storm Prediction Center is at its busiest and that staff shortages are also making it harder for them to work on advances in forecasting.\n“If we have a sickness, or anything that happens, we’ll have to figure out a way to scramble to get that covered too,” said Grams.\nTornado survivor Brooke Barnes of Texas says she “fully believes” in the importance of early warnings from NWS forecasters.\nBrooke Barnes survived an April 3, 2012 tornado in Texas by hunkering down in her bathtub. KXAS\nWhen 17 tornadoes struck the Dallas-Ft. Worth area on April 3, 2012, warnings convinced her to set up a makeshift shelter in her Dallas-area home. She put a bike helmet on her son’s head and they huddled among hunkered down among pillows in the bathtub. A tornado ripped the top of the house off, but Barnes and her son survived.\n“I think the worst could have happened if we hadn’t had that lead time,” said Barnes.\nThe NWS office that covers the Dallas-Ft. Worth area is currently short two lower-level meteorologists, according to the union’s list.\nThe NWS says the current staffing situation is not a safety threat. Chris Vaccaro, the agency’s director of communications, told NBC News, “It’s clear by the actual performance of our forecasters that they more than meet our mission,” said Vaccaro. “The NWS has not and will not skip a beat. All else is speculation.”\nThe NWS won’t confirm or deny the total number of vacant jobs on the union’s list, but told KXAS it’s aggressively trying to hire at least 190 people right now, including 43 meteorologists to work in local offices.\nRep. Marc Veasy (D.-Ft. Worth) is on the Congressional committee that oversees the NWS and says the current staffing situation is “unacceptable.”\n“I'm going to have my staff find out exactly what we can do to help speed the process up,” said Rep. Veasy.\nLast summer a government report found “critical staff shortages” affected the weather service’s response to Hurricane Sandy, which battered the East Coast in October 2012.\nThe report said vacant jobs at East Coast offices and the National Hurricane Center in Miami could “make them vulnerable to failure during significant weather events.”\nThere are currently five job vacancies at the National Hurricane Center, according to the union tally, but the NWS said that all positions for individuals who issue storm advisories are currently filled.\nNow some wonder if fewer people watching the skies could increase the risk for people on the ground in Tornado Alley.\n“It makes me really nervous because I really think that's what saved us was having that lead time,” said Barnes.","url":"https://www.nbcnews.com/news/investigations/budget-cuts-mean-weather-forecaster-shortage-tornado-alley-n97341"}
