{"authors":["Eleanor Harding For The Daily Mail"],"date_download":"2018-10-22 22:14:12","date_modify":"2018-10-22 22:14:12","date_publish":"2017-03-10 00:22:57","description":"Pupils in many secondary schools are being taught in classes of 35 or more because of budget squeezes fuelling the swell in numbers, according to a survey.","filename":"data/vaneerConsumption/Budgetsqueezesbehindsurgeinsupersizedclasses.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/334C539000000578-0-image-a-45_1489105365422.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299512_Budget-squeezes-surge-super-sized-classes_1540246452.html","title":"Budget squeezes behind surge in super-sized classes","title_page":"Budget squeezes behind surge in super-sized classes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Pupils in many secondary schools are being taught in classes of 35 or more because of budget squeezes fuelled by a bulge in numbers, according to a survey today.\nIt revealed that one in eight school leaders has created the super-size classes to cope in densely populated areas.\nThe enlarged classes are far bigger than the nationwide average of 20. For years, primary schools have had to take extra children following a baby boom exacerbated by migration and the pressure is now moving up to secondaries.\nPupils in many secondary schools are being taught in classes of 35 or more because of budget squeezes fuelling the swell in numbers, according to a survey\nThe study by the Association of School and College Leaders also found many schools are having to cut courses to save money. Interim general secretary Malcolm Trobe warned that senior staff are having to make ‘impossible choices’.\nHe said: ‘Schools cannot sustain the level of support to pupils or the range of options and enrichment activities.\n‘School leaders will do their utmost to protect provision but they cannot provide everything that is asked of them without the resources they need. Unless the Government invests more, there will be a significant impact on young people.’\nThe survey of 1,054 mostly secondary school leaders found 82 per cent said they have had to increase class sizes. On average, they said their largest is 33. But 12 per cent, almost one in eight, said it was 35 or more.\nThe Government said it has protected the per-pupil budget in real terms but many schools say they have extra costs from having to take more students.\nSchool run pollution risk Parents should cover prams to protect children from air pollution on the school run, scientists warn. A study found they were exposed to harmful levels of fine particulates in the air. And levels of the tiny specks – formed from soot, metal from car brake linings, and tiny bits of tyre – were higher in the morning. They can penetrate a child’s lungs, causing or worsening breathing problems such as asthma. Surrey University’s Dr Prashant Kumar, lead author of the study in journal Environmental Pollution, said: ‘One of the simplest ways to combat this is to use a barrier between the in-pram children and the exhaust emissions, especially at pollution hotspots.’\nFrom 2009-2016, the system took in an extra 470,000 pupils. An official projection for 2016-2025 said the number in state schools will rise ten per cent from 7.4million to 8.1million.\nSubject choices are also being hit, said school leaders. More than 72 per cent of those teaching 14-16-year-olds said GCSE or vocational courses have been axed in the past year.\nFor those teaching sixth-formers, 79 per cent said courses have been cut.\nOne school leader said: ‘Students will have restricted subject choices in larger class sizes with less pastoral support, whilst still being expected to perform at the highest of standards – nonsense.’\nA Department for Education spokesman said: ‘School funding is at its highest on record at more than £40billion in 2016-17.’ She added reforms to the way it is distributed will give a cash boost to more than half of England’s schools.","url":"https://www.dailymail.co.uk/news/article-4299512/Budget-squeezes-surge-super-sized-classes.html"}
