{"authors":["Anna Hodgekiss For Mailonline"],"date_download":"2018-10-23 01:46:53","date_modify":"2018-10-23 01:46:53","date_publish":"2016-01-28 16:14:26","description":"Coca Miglioranza, 90, from Buenos Aires, was given drugs for an eye infection. But her condition failed to improve - and a horrified employee then noticed the right side of her face was 'crawling' with parasites.","filename":"data/vaneerConsumption/BuenosAireswomansuffersworminfestationinhereye.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AA4A5300000578-0-image-a-9_1453997513475.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3421200_Grandmother-suffers-worm-infestation-eye-care-home-staff-gave-drugs-meant-ANIMALS_1540259213.html","title":"Buenos Aires woman suffers worm infestation in her eye","title_page":"Buenos Aires woman suffers worm infestation in her eye | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"laimed she was given a drug meant for animals, aggravating infection\nIt is c\nIt didn't improve and staff noticed her face was 'crawling' with parasites\nAn elderly woman suffered an infestation of worms in eye after care home staff accidentally gave her medication meant for animals.\nCoca Miglioranza, a 90-year old grandmother, has lived in the residential home in Lujan, Buenos Aires, for 30 years.\nLocal reports claim she began to suffer a severe eye infection provoked by ongoing skin cancer.\nShe was given medication by care home staff, but continued to complain for some time when her condition did not improve.\nIt was only when an employee noticed the right side of her face was 'crawling' with the parasites that that alarm was raised.\nCoca Miglioranza, a 90-year old grandmother, suffered an infestation of worms in eye after staff at the care home where she lives apparently gave her medication meant for animals\nHe reported the incident to local media after his employers failed to act, saying: 'This is not the first time this has happened.\n'The grandma is very hurt, but she hasn't filed a complaint due to her vulnerable state.'\nIt has now emerged Mrs Miglioranza was administered a drug meant for animals, which only aggravated the infection.\nHealth officials have been left horrified by the incident.\nThe president of the state's healthcare commission, Marcelo Musso, made clear in a statement that 'what happened is very serious and should not happen again'.\nHe also highlighted the issue of extreme staffing shortages at the care home, where only six nurses must care for the 65 elderly residents who reside in shared rooms.\nOfficials are said to be working to implement strategies in order to prevent such an incident from occurring again.\nThe story comes just two weeks after Indian doctors found a live worm moving around a man's eye.\nThe unnamed 25-year-old man came to doctors in Delhi after having problems with his vision and pain for two weeks.\nDoctors said the worm may have burrowed through layers of his eyeball and grown there.","url":"https://www.dailymail.co.uk/health/article-3421200/Grandmother-suffers-worm-infestation-eye-care-home-staff-gave-drugs-meant-ANIMALS.html"}
