{"authors":["Carly Stern For Dailymail.Com"],"date_download":"2018-10-23 03:30:12","date_modify":"2018-10-23 03:30:12","date_publish":"2017-03-10 13:00:05","description":"Buffy the Vampire Slayer debuted on March 10, 1997 and ran for seven seasons until 2003. It led to the spin-off show Angel, which ran for five seasons. FEMAIL looks at what the stars have done since.","filename":"data/vaneerConsumption/BuffytheVampireSlayerturns20.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/22/3E1EAA9D00000578-0-image-a-88_1489099305750.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4272060_Buffy-Vampire-Slayer-turns-20_1540265412.html","title":"Buffy the Vampire Slayer turns 20","title_page":"Buffy the Vampire Slayer turns 20 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Unless you're a vampire who's been alive for centuries and hasn't aged a day since 1997, it might come as a 'wow I've gotten old' surprise to learn that Buffy the Vampire Slayer debuted 20 years ago today, March 10.\nThe hit teen TV show starring a spunky, vamp-killing high schooler was a standout at the time, a first of the then-new 'teen drama' genre that paved the way for programs like Dawson's Creek, The OC, One Tree Hill, Veronica Mars — and, of course, The Vampire Diaries.\nCelebrating two decades since its premiere, FEMAIL looks back at the stars of the seven-season show, which started on The WB and ended on UPN in 2003 — and reveals what The Scooby Gang has been up to since.\nWarning: Spoilers ahead!\nTwo whole decades! Buffy the Vampire Slayer debuted 20 years ago in 1997\nShe can kick butt! The show starred Sarah Michelle Gellar in the title role (pictured left in 1997 and right in 2017)\nFriends forever: Members of the cast still occasionally see each other — and sometimes they post the evidence on social media\nAn impact: The show, created by Joss Whedon (center), remains one of the most successful teen dramas — and was also one of the first\nSarah Michelle Gellar: Buffy Summers\nThe butt-kicking, wise-cracking, vamp-vanquishing star of the show was 15 years old when the series premiered — though Sarah Michelle Gellar was 19 at the time.\nWhile the first season was a short 12 episodes, it earned good ratings in an as-yet-untapped market, and Sarah Michelle became a fast star, also coming out with a major role in I Know What You Did Last Summer that year.\nDuring the show's run, Sarah Michelle covered magazines, hosted Saturday Night Live, and appeared in several big movies like Cruel Intentions and — quite appropriately — Scooby-Doo (since Buffy and her friends refer to themselves several times as the Scooby Gang or Scoobies on the show).\nShe also started dating Freddie Prinze, Jr. in 2000, and the two went on to tie the knot in 2002. Together, they have two kids: Charlotte, seven, and Rocky, four.\nNow 39, Sarah Michelle has continued acting since the series wrapped, starring in the films The Grudge, Suburban Girl, and Veronika Decides to Die, as well as the short-lived TV shows Ringer and The Crazy Ones — the latter of which earned her a People's Choice Award but was cancelled following the untimely death of her co-star Robin Williams.\nShe's also launched her own healthy baking company, Foodstirs, and will be releasing her first cookbook, Stirring up Fun with Food, on April 18.\nThe gang's all here! Buffy ran for seven seasons until 2003, starting on The WB and ending its run on UPN\nFairy tale romance: Sarah Michelle wed Freddie Prinze Jr. shortly before Buffy wrapped, and the two have a son and a daughter together\nNew ventures: The actress currently runs the organic baking mix company FooDstirs and is set to come out with a cookbook\nReminiscing: In honor of the anniversary, Sarah Michelle posted a flashback photo and a heartfelt message to fans on Instagram\nAnd on Friday, in honor of the anniversary, the actress took to Instagram to thank the show's most dedicated fans, posting a behind-the-scenes image of herself shooting a scene, along with a lengthy message to all who have supported Buffy throughout the years.\n'20 years ago today, I had the greatest privilege to bring Buffy to your TV screens for the first time,' she wrote. 'It was a long and challenging road to get there. First the movie, then a passed over pilot presentation, and eventually a mid season time slot on a little known network.'\nShe went on to praise her fellow cast and crew members on the show, naming several of the actors who played Buffy's love interests in particular.\n'Thank you to Gail Berman for always believing there was a show in that movie,' the post continued. 'Thank you to Joss Whedon, for trusting me to give life to one of the greatest female characters ever created. Thank you to David, for always being my Angel. Thank you to James for understanding that while Buffy and Spike may have been love/hate, I have nothing but love for you.\n'Alyson, as any woman knows, you are nothing without the love and support of great female friends, so thank you for being that. Michelle, you will always hold a key to my heart. Thank you to all the incredible actors for seven seasons of amazing performances.\n'I would be remiss if I didn't mention the incredible crew that worked tirelessly (and also really tired) to bring this show to life.'\nThe post concluded with a touching tribute to the fans, with Sarah noting: 'We made this show for you, and your unwavering support has kept this show going long past our seven years. You are everything. And always remember...\"if the apocalypse comes, beep me.\"'\nAlyson Hannigan played Willow, Buffy's best friend who later became a witch (pictured left in 1997 and right in 2015)\nShe has two kids with her husband, Alexis Denisof — who played Wesley Wyndam-Pryce on a handful of Buffy episodes before moving on to the spin-off Angel\nThe lucky actress has starred on two hugely successful series; her second, How I Met Your Mother, recently ended\nAt one point on the show, Alyson got a visit from her old Buffy co-star, Seth Green, who made a cameo in a college flashback\nAlyson Hannigan: Willow Rosenberg\nAlyson Hannigan's Willow evolved quite a bit over the course of the show's 145 episodes. Starting out as a shy, unpopular geek who is thrilled Buffy befriends her and moons silently over her best friend Xander, she eventually becomes a brave, powerful witch — who was also half of one of TV's first scripted lesbian relationships.\nDuring the show's run, Alyson — who was 22 when the series started — also starred in American Pie and American Pie 2, uttering one of the film's most famous lines ('This one time, at band camp...').\nAfter Buffy ended in 2003, she had small parts in a few TV shows and movies before, in 2005, landing another big TV gig: playing Lily Aldrin on How I Met Your Mother.\nShe also had more luck in her love life than Willow, who watched her girlfriend Tara get shot by a stray bullet meant for Buffy. A few months after the series ended, the now-42-year-old married Alexis Denisof — who played Wesley Wyndam-Pryce on the series and its spin-off Angel. The couple has two daughters, seven-year-old Satyana and four-year-old Keeva.\nNicholas Brendon played Xander, the third member of the original Scooby Trio (pictured left in 1997 and right in 2016)\nFrom 2005 to 2006, Nicholas (far left) starred in the short-lived show Kitchen Confidential with Bradley Cooper (center) and John Cho (far right)\nNicholas Brendon: Xander Harris\nNicholas, who played Scooby sidekick Xander, has mostly kept up acting since Buffy ended, moving on to a co-starring role with Bradley Cooper in the short-lived series Kitchen Confidential from 2005 to 2006.\nHe also appeared in the films The Portal, Unholy, Big Gay Love, and Indigo and had arcs on the shows Private Practice and Criminal Minds.\nHis personal drama, though, has grabbed more headlines than the on-screen kind. He went to rehab twice, in 2004 and 2010, and has been arrested several times over the past decade.\nNicholas was one of the original cast members; during the first seasons of the show, Xander dated Cordelia, played by Charisma Carpenter (far right)\nTrouble: Nicholas has had several run-ins with the law, including arrests for allegedly choking his girlfriend, trashing a hotel room, and being found drunk and disorderly\nIn 2010, he was charged with four misdemeanors and given a suspended one-year jail sentence for resisting arrest, battery against a police officer, and vandalism.\nHe was arrested five subsequent times for allegedly choking his girlfriend, trashing a Florida hotel room, and being found drunk on a beach.\n'When you wake up in jail and you're not sure why you're there, that's a very, very lonely feeling,' he told Dr. Phil in a TV interview in 2015. Later that year, a video surfaced of the actor's 'suicide attempt' in Saratoga Springs, New York in September.\nIn 2016, he told Us Weekly that he was still committed to overcoming his addiction issues but had recently relapsed.\nThe vampire with a soul, Angel was played by David Boreanz on the show, before his character left for a spin-off (pictured left in 1997 and right in 2017)\nSwoon! Angel's doomed love affair with Buffy kept viewers entralled\nFamily man: David now has two kids, seven-year-old Bella and 14-year-old Jaden\nDavid Boreanaz: Angel\nVampires like David Boreanaz's character Angel may never age, but David himself has. Luckily for him, he still has those hunky good looks.\nNow 47, David officially left Buffy after season three to star in his own spin-off show, Angel, which followed the vampire-with-a-soul's demon-fighting detective agency in LA. He did come back for a few episodes here and there, and continued on Angel for a year after Buffy wrapped.\nWith his vamp days behind him, David didn't stay away from TV for long. A year after Angel was cancelled, he began starring opposite Emily Deschanel on Bones, which is currently airing its twelfth and final season.\nHe is also on another series, Bones, with Emily Deschanel; it's on its twelfth and final season\nHe's married to former Playboy model Jaime Bergman, right; together, they co-own a nail polish company with friends\nIn 2010, it was discovered that he'd had an affair with Rachel Uchitel (pictured), who also slept with Tiger Woods\nMeanwhile, the star has been married to his second wife, former Playboy model Jaime Bergman, since 2001. Together they have two kids, Jaden, 14, and Bella, seven. In 2010, when Jaime was pregnant with Bella, David admitted to having an affair with Rachel Uchitel, who is best known as being one of Tiger Woods' mistresses.\nHe and his wife are still together and started a nail polish line with two of their friends called Chrome Girl. That business and his Bones gig seem to keep him busy — as David said he definitely wouldn't want to come back for a reunion.\n'No, never; that's done, see ya, next. I have no problem with the cult audience, and I would totally get back into the genre, but I’m not a big reunion guy,' he told Parade.\nWatcher love: Anthony Stewart Head played Rupert Giles, Buffy's watcher — who became a sort of father-figure for the teen (pictured left in 1997 and right in 2016)\nHe has two grown daughters, Emily (left) and Daisy (right), who are also actors\nAfter Buffy, Rupert appeared in the UK show Merlin and the film The Iron Lady\nAnthony Stewart Head: Rupert Giles\nAnthony Head has worked steadily since moving on from his role as Buffy's watcher, Mr. Giles. He spent several years on the UK sketch show Little Britain and popped up in over a dozen other shows.\nHe also played the king on the five-season UK series Merlin, and had a supporting role in the Meryl Streep film The Iron Lady, about Margaret Thatcher.\nThese days, Anthony's daughters — Emily, 28, and Daisy, 25 — are acting, too. Emily is currently on the UK show Emmerdale, while Daisy starred in the short-lived Freeform show Guilt.\nThe OTHER vamp: James Marsters played Spike (a.k.a. William the Bloody) and reprised the role on Angel (pictured left in 1999 and right in 2016)\nThough his character was a super villain for much of the show, scientific experiments — and a fondness for Buffy — eventually led to him reclaiming his soul\nThe 54-year-old married now-31-year-old Patricia Rahman in 2011 and has one child from a previous marriage\nJames Marsters: Spike\nThe second vampire that Buffy slept with — the girl's clearly got a problem — was still just a supervillain and Angel antagonist in the beginning of the show.\nAnd James, now 54, is clearly a pro at playing bad guys. After continuing his role as Spike on Angel for the show's final season, he went on to play Brainiac on Smallville from 2005 to 2010. The actor also had short arcs on Without a Trace, Caprica, and Hawaii Five-0.\nAs for his personal life, James — who has a child from a previous marriage — wed Patricia Rahman in January 2011, when she was 25 and he was 48. They had been dating for five years.\nCharisma Carpenter played Cordelia Chase during the show's high school years (pictured left in 1997 and right in 2016)\nCordelia was the mean popular girl — and sometimes friend of the Scoobies — who moved on to Angel after several seasons\nShe went on to appear in Veronica Mars in 2005 (pictured), Charmed, and The Lying Game, as well as a starring role on Angel\nNow: The 46-year-old's most recent role was on the Fox show Lucifer\nCharisma Carpenter: Cordelia Chase\nCharisma had actually auditioned for the role of Buffy, but was instead cast as the series' vapid popular girl Codelia.\nAfter season three, Cordelia graduated high school and moved to LA to pursue her dream of being an actress — but ended up working with Angel in his detective agency, and appeared on the spin-off for all five seasons.\nPost-Cordy, Charisma went on to appear in arcs on Charmed (appropriately as a demon with psychic powers), Veronica Mars, and The Lying Game, and starred in the TV movies See Jane Date and Relative Chaos.\nA year after giving birth to her son, Donovan — whose father, Damian Hardy, Charisma divorced in 2008 after six years of marriage — the star stripped down to pose for Playboy, which she said helped her 'get back to my old self'.\nNow 46, her most recent role was a guest-spot on the Fox comedy Lucifer.\nKristine Sutherland played Joyce Summers, Buffy's oblivious but loving mom (pictured left in 1997 and right in 2015)\nThe death of Buffy's mom is considered one of the most memorable and heartbreaking moments of the series\nKristine Sutherland: Joyce Summers\nTrivia time: Kristine Sutherland, who played Buffy's mom, is not related to Donald or Keifer, though they did inspire her stage name. The 61-year-old actress changed her surname, picking one inspired by her cat, Donald — who was named after the actor.\nJoyce, who died tragically — and not supernaturally — in season five, was the biggest role for Kristine, who went on to do a short stint on One Life to Live in 2010.\nReflecting on the show in a Reddit AMA in 2014, Kristine said: 'Sarah and I had a very special connection...it was just there from day one. I adored her and I adored working with her.'\nShe also revealed how hard it was not to react to Sarah Michelle crying during the scene in which Joyce died, but added that the most fun scenes to film were those during the episode Band Candy, in which she played a teenage version of herself.\nSeth Green played Daniel 'Oz' Osbourne, a werewolf who dated Willow for several seasons (pictured left in 1998 and right in 2016)\nFlashback: Seth left the series in 2000 but has remained very active in Hollywood\nAfter appearing in Buffy (pictured), he was in several movies and has voiced characters in animated shows Family Guy, Robot Chicken, and Teenage Mutant Ninja Turtles\nReunited! He also popped up on an episode of How I Met Your Mother with Alyson\nSeth Green: Daniel 'Oz' Osbourne\nSeth had already racked up quite a few acting credits — including in Austin Powers — by the time he was cast in Buffy as werewolf and Willow beau Oz.\nWhile the show aired, he also starred in an Austin Powers sequel and Can't Hardly Wait, and went on to appear in Josie and the Pussycats, a third Austin Powers movie, and Party Monster.\nSince the mid-2000s, he's also been in That '70s Show, Without a Paddle, Greg the Bunny, Four Kings, and Entourage, and does quite a bit of voice work as well — including for the popular animated shows Family Guy, Robot Chicken, and Teenage Mutant Ninja Turtles.\nIn 2012, he reunited with Alyson Hannigan on How I Met Your Mother, and while the two didn't rekindle any on-screen romance, Seth wrote online at the time: 'Spending the day with my favorite costar'.\nIn real life, Seth is married to actress Clare Grant. He's also become a major investor in several companies in the tech and entertainment industries.\nNerd makes good: Danny Strong played Jonathan, a nerd in high school who later joined an 'evil' trio looking to make trouble for Buffy (pictured left in 2002 and right in 2012)\nHigh school reunion: He's caught up with old cast members since and has continued acting\nHis character was a member of The Trio with Andrew (played by Tom Lenk, left) and Warren (played by Adam Busch, right)\nAnother teen series: He also played Paris Geller's boyfriend Doyle on Gilmore Girls\nRecently, he co-created the Fox show Empire and appeared in the Netflix reboot of Gilmore Girls\nDanny Strong: Jonathan Levinson\nDanny Strong played Jonathan, the nerdy outcast who went on to join an 'evil' trio that caused quite a bit of trouble for the Scoobies, and eventually led to his death.\nHis most memorable roles after Buffy were as Paris' boyfriend (and later husband, in the Netflix reboot) on Gilmore Girls and wannabe adman Danny Siegel on Mad Men. He also crossed paths with Alyson again on How I Met Your Mother, and played a supporting character in Sydney White with Amanda Bynes.\nBut it's as a writer and producer that the 42-year-old has become a major standout lately. Danny was an executive producer on Lee Daniels' The Butler, and currently holds that title — as well as writer and director — on the Fox show Empire.\nIn addition, he was a co-writer on the screenplays for The Hunger Games: Mockingjay - Part 1 and Part 2 and has several Emmy's to his name.\nJuliet Landau played the vampire Druisilla on Buffy an Angel (pictured left in 1997 and right in 2016)\nBite me: Though she is British on the show, Juliet is actually American — a fact that surprises many fans that meet her\nJuliet Landau: Drusilla\nAs crazy, temperamental, vision-seeing vamp Drusilla, Juliet popped up in every season of Buffy and guest-starred in a few episodes of Angel, too.\nBut once the shows ended and she was able to step out into the daylight again, Juliet chose to stay mostly off-camera, lending her voice to animated shows including Justice League Unlimited, Ben 10: Alien Force, and Ben 10: Ultimate Alien.\nFans might be surprised to learn the star is actually American, not British, and has also racked up writing and production credits since her turn as Drusilla.\nThough she said in a recent interview that she'd be up for reprising her role, she did point out one potential problem: 'The thing with playing a vampire is vampires never age, so if I was going to play Dru, I'd better do it quick and with great lighting.'\nMercedes McNab played Harmony, Cordelia's mean girl popular friend (pictured left in 1997 and right in 2011)\nMercedes McNab: Harmony\nThe youngest member of the original cast, Mercedes was just 17 when the series began. She played Harmony, Cordelia's mean-girl best friend, who was turned into a vampire at graduation. She continued to play Harmony on Angel.\nShe's only had a few roles since the two series ended, including in the horror film Hatchet.\nIn 2012 she married Mark Henderson, with friend and fellow actress Taryn Manning in attendance. They have a four-year-old daughter, Vaunne.\nEliza Dushku joined the series as Faith in season 3, the slayer-turned-bad (pictured left in 1998 and right in 2016)\nHer character eventually redeems herself and helps fight off evil again in the final season\nSeries regular: After Buffy — and a few episodes of Angel — she starred in Tru Calling\nShe also starred in Dollhouse, which was created by Buffy's Joss Whedon\nEliza Dushku: Faith\nThough Faith didn't first appear until Season 3 in 1998, the beloved character was an integral part of the show and also made appearances on Angel.\nDuring that time, she popped up in Bring it On, Jay and Silent Bob Strike Back, and The New Guy.\nAfter both Buffyverse shows ended, she starred in Tru Calling from 2003 to 2005, and another series from Buffy creator Joss Whedon, Dollhouse, from 2009 to 2010. Most recently, she was on Cinemax's Banshee.\nIn her private life, she dated NBA star Rick Fox from 2009 to 2014, and while she hasn't been linked to anyone since, she's kept busy, and is currently studying to get her sociology degree from Suffolk University.\nEliza also struggled with alcoholism and drug addiction, and spoke out this week about being eight years sober. She said: '[Using] was fun and I loved it, until it wasn't. Drugs didn't love me, they didn't love my family. They definitely didn't love my friends that died. I have a lot of friends that are dead.\n'I'm a good person, but when I did drugs and I drank, I didn't make good decisions. I got sober for my family, but today I'm sober for me, and I'm sober for you. Drugs and alcohol are powerful, but we're more powerful.'\nEmma Caulfield played Anya, a revenge demon who becomes human (pictured left in 2001 and right in 2016)\nOn-screen couples: She and Xander dated and almost wed before splitting up, though she stayed friends with the gang and helped in the final battle\nAfter the show, she starred in the movie TiMER and appeared in the series Gigantic, Bandwagon, Life Unexpected, Once Upon a Time, and Fantasy Hospital\nEmma Caulfield: Anya\nBuffy wasn't actually Emma's first teen TV series — a hard thing to say, since there weren't very many before the vampy hit. Before starring as Anya, the revenge demon who went on to date and almost wed Xander, Emma played Brandon's girlfriend Susan Keats on a season of Beverly Hills, 90210.\nAfter Buffy ended — with Anya's tragic death — Emma starred in the movie TiMER and appeared in the series Gigantic, Bandwagon, Life Unexpected, Once Upon a Time, and Fantasy Hospital last year.\nThough she was married to Cornelius Grobbelaar from 2010 to 2016, she didn't start a family until marrying Mark Leslie Ford, with whom she has a new baby girl.\nShe's currently filming an arc on AMC's Fear the Walking Dead.\nAs UC Sunnydale witch Tara, Amber Benson was half of one of primetime's first lesbian couples (pictured left in 2001 and right in 2016)\nTara and Willow's relationship was a show favorite and fans were heartbroken when Tara died\nSay what? Surprisingly, Tara dated Adam Busch for several years in real life; Adam played Warren, who killed Tara\nAmber Benson: Tara Maclay\nJoining the show in season four, Amber Benson played Tara, a witch at UC Sunnydale who later became Willow's girlfriend.\n'The most rewarding thing about playing Tara was that the relationship on Buffy between her and Willow helped kick open the door for more amazing LGBTQ characters on TV,' she said in 2015. 'We were so blessed to walk in their shoes and play those ladies. It's one of the things I am most proud of in my life.'\nSince Buffy, she's appeared in a bunch of movies and TV shows including Supernatural, Ringer, and Morganville.\nShockingly, she also spent about seven years after the show dating Adam Busch, who played bad guy Warren Mears — the very same bad guy, in fact, who killed Amber's character Tara with a stray bullet.\nSurprise addition: In season five, Michelle Tractenberg joined as Buffy's little sister (pictured left in 2000 and right in 2017)\nShocking: Her appearance was a mystery until it was revealed that she was really The Key and Buffy and company's memories had been altered\nSister, sister: Sarah Michelle and her on-screen younger sister have reunited several times in recent years\nGrown-up roles: As an adult, she appeared in EuroTrip, 17 Again, and Gossip Girl\nMichelle Trachtenberg: Dawn Summers\nMichelle was just 14 when she unexpectedly joined the Buffy cast as the title character's little sister in 2000, but she had already packed her resume with roles in The Adventures of Pete & Pete and Harriet the Spy.\nHer career has only grown since. Besides starring in the Disney movie Ice Princess, EuroTrip, and the hit film 17 Again with Zac Efron, she also played appeared in Gossip Girl and Mercy, in addition to a handful of other roles.\nNow 31, Michelle did take the familiar former-child-star route of stripping down for a sexy magazine cover — in her case, Maxim in 2011 — but otherwise she's managed to stay out of trouble and away from tabloid headlines.\nWhen Buffy started college, she met — and eventually dated — Riley Finn, played by Marc Blucas (pictured left in 2000 and right in 2016)\nHe and his wife, Ryan Haddon, have no kids together, though Marc is stepdad to Ryan's two children with her ex, actor Christian Slater\nMarc Blucas: Riley Finn\nA genuinely good guy and dreamy to boot, Riley was balm on the wound that Angel left when he departed the series in 1999.\nAfter leaving himself, the now-45-year-old acted in View from the Top, First Daughter, The Killing Floor, The Jane Austen Book Club, Stay Cool, and Deadline, and also took on several more TV series with roles in Necessary Roughness, Killer Women, and Underground.\nHe and his wife, Ryan Haddon, tied the knot in 2009. Though he has no biological kids of his own, he is stepfather to Ryan's two children with her ex, actor Christian Slater.\nTom Lenk played Andrew, who plotted evil deeds until helping Buffy in the final season (pictured left in 2002 and right in 2015)\nOff-screen: He and Sarah Michelle are friends who sometimes meet up in real life\nHe also had a popular Instagram account where he recreates celebrity outfits\nFans: Some of his old Buffy castmates have regrammed his better recreations\nHe has dressed up as Lea Michele (pictured), Lady Gaga, and Diane Kruger\nTribute: In honor of the anniversary, he finally recreated a Buffy look on March 10\nTom Lenk: Andrew Wells\nAndrew didn't join Buffy until the show's sixth season, but Tom Lenk's character ended up playing a major part in the last two years of the show — first, with the havoc-wrecking group The Trio, and then documenting Buffy and Co.'s fight to end the final Big Bad.\nHe's since appeared in episodes of How I Met Your Mother (with Alyson Hannigan), House, Samantha Who?, Nip/Tuck, Psych, and Bones (with David Boreanz), though he is earning most of his attention these days for his Instagram account.\nThere, the 40-year-old recreates red carpet looks worn by Hollywood starlets in incredible and hilarious detail, taking on Charlize Theron, Heidi Klum, Carrie Underwood, and more.\nIn honor of March 10's anniversary, he recreated an early Buffy promotional image, using a glue bottle in place of a stake. Reposting it later, Sarah Michelle wrote gleefully: 'It feels like I had to wait 20 years for this....but damn it was worth the wait.'","url":"https://www.dailymail.co.uk/femail/article-4272060/Buffy-Vampire-Slayer-turns-20.html"}
