{"authors":["Jonathan Stempel","Trevor Hunnicutt"],"date_download":"2018-10-30 23:35:54","date_modify":"2018-10-30 23:35:54","date_publish":"2018-07-18 00:00:00","description":"Berkshire Hathaway made it easier for the company to buy its own shares, a change that could help billionaire Chairman Warren Buffett deploy more of the conglomerate's cash. The company has been under pressure in recent years to put more than $108 billion of cash and similar safe assets to work.","filename":"data/vaneerConsumption/BuffettsBerkshireHathawayloosenspolicyonstockbuybacks.json","image_url":"https://amp.businessinsider.com/images/5a2811b9f914c352018b8491-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_r-buffetts-berkshire-hathaway-loosens-policy-on-stock-buybacks-2018-7_1540942554.html","title":"Buffett's Berkshire Hathaway loosens policy on stock buybacks","title_page":"    Buffett's Berkshire Hathaway loosens policy on stock buybacks - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Warren Buffett Dimitrios Kambouris/Getty Images\n(Reuters) - Berkshire Hathaway Inc on Tuesday made it easier for the company to buy its own shares, a change that could help billionaire Chairman Warren Buffett deploy more of the conglomerate's cash.\nThe new policy lets Buffett and Vice Chairman Charlie Munger authorize stock buybacks when both believe the repurchase price is \"below Berkshire's intrinsic value,\" a determination they said would be made \"conservatively.\"\nBerkshire's former policy said repurchase prices would not exceed 1.2 times book value per share.\nIts class A shares closed Tuesday at $288,500, roughly 1.37 times its book value per share of $211,184 as of March 31. Berkshire's class B shares rose 1.5 percent in after-market trading.\nThe new policy would be a major change for Berkshire Hathaway, which has been under pressure in recent years to put more than $108 billion of cash and similar safe assets to work, or consider returning that money to its shareholders.\n\"It's a somewhat significant change,\" said Steven Check, president of Check Capital Management Inc in Costa Mesa, California. Berkshire shares comprise about 20 percent of its $1.5 billion of assets.\n\"This is a good thing in an environment where Berkshire has a lot of excess cash, nothing to buy, and an underpriced stock,\" Check said.\nBuffett, known as a bargain-hunter, has acknowledged difficulty finding companies he can buy at a reasonable price. When asked at its shareholders' meeting in May about Berkshire's use of its cash, Buffett resisted the idea of issuing a special dividend to pass it on to shareholders.\nAt that meeting, he said he supported a move by Apple Inc , a Berkshire holding, to increase its share buybacks, because that could boost the value of the outstanding stock. But Munger warned that some companies use repurchases simply to prop up their own stock prices.\nOn Tuesday, Berkshire said it would not buy back stock under the new policy until it releases second-quarter results, scheduled for Aug. 3.\nBerkshire also affirmed its policy of not repurchasing stock if doing so would reduce the value of Berkshire's cash and equivalents below $20 billion.\n(Reporting by Jonathan Stempel and Trevor Hunnicutt in New York, Editing by Rosalba O'Brien and Richard Chang)","url":"https://www.businessinsider.com/r-buffetts-berkshire-hathaway-loosens-policy-on-stock-buybacks-2018-7"}
