{"authors":["Benjamin Zhang"],"date_download":"2018-10-30 23:03:33","date_modify":"2018-10-30 23:03:33","date_publish":"2016-12-09 00:00:00","description":"At 261 mph, the $2.6 million Bugatti Chiron is designed to be no more difficult to drive than a normal car on the highway.","filename":"data/vaneerConsumption/BugattiChironis26millionsupercarartwork.json","image_url":"https://amp.businessinsider.com/images/572ca11352bcd01a008c13d8-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bugatti-chiron-million-dollar-hypercar-supercar-2016-12_1540940613.html","title":"Bugatti Chiron is $2.6 million supercar artwork","title_page":"    Bugatti Chiron is $2.6 million supercar artwork - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Hollis Johnson\nA new Bugatti doesn't come along very often. In fact, the Bugatti Chiron is just the third production car to carry the vaunted badge in the last 25 years and just the second car this millennium.\nAs the successor to the game-changing Veyron, the Chiron has the unenviable task of following in the foot steps of an automotive icon.\nFortunately for Bugatti, the Veyron is about as competent of a start point as one can ask for. And Bugatti's director of design Achim Anscheidt is one of the best in the business.\nAnscheidt, a veteran of VW Group and Porsche's design departments, joined Bugatti as its design boss in 2004 just as the Veyron was readied for production.\nWith the Chiron, Anscheidt got his shot at the momentous task of creating the first new Bugatti in a decade. During its development, Bugatti built more than 30 prototypes that completed more than 300,000 miles of testing and went through more than 200 sets of tires.\nWith a $2.6 million asking price, it will have to live up to the high bar set by the ground-breaking Veyron.\nHere's a closer look at the new Bugatti Chiron.\nPhotos by Hollis Johnson unless otherwise credited.","url":"https://www.businessinsider.com/bugatti-chiron-million-dollar-hypercar-supercar-2016-12"}
