{"authors":[],"date_download":"2018-10-30 14:29:36","date_modify":"2018-10-30 14:29:36","date_publish":"2014-12-19 00:00:00","description":null,"filename":"data/vaneerConsumption/BuhbyeCandyCrowley.json","image_url":"https://www.americanthinker.com/images/bucket/2014-12/193592.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_12_buhbye_candy_crowley_1540909776.html","title":"Buh-bye, Candy Crowley","title_page":"Buh-bye, Candy Crowley","title_rss":"NULL","source_domain":"americanthinker.com","text":"Crowley now joins Dan Rather in a Hall of Shame of journalism, for her transparent coordination with the Obama campaign trying to flummox Mitt Romney in the second presidential debate of 2012. Recall that president Obama stmbled badly in the first debate, and momentum seemed to be behind the Romney campaign. But then, Crowley just happened to have a transcript in hand to wave and back-up a misleading claim of Obama.\nCandy Crowley finally is out at CNN, in what sounds like her being fired. Of course, those words would never be used, but how hard is it to decipher the code when CNN head Jeff Zucker wrote in an internal memo that she “has made the decision to move on” and she has no specific plans for her next gig?\nAnother dark horse: Katie Couric, who has been serving as Yahoo News’ Global Anchor, but insiders tell TheWrap is “itching to get back on TV.”\nThere is also one other dark horse. God forbid, the Perkster herself, now lurking on the internet. Via The Wrap :\nJohn King. Veteran reporter with silver hair and a bigger reputation than the others.\nJohn King. Veteran reporter with silver hair and a bigger reputation than the others.\nBriana Keilar. (Honestly, never heard of her, but then, like most people, I rarely watch CNN.) But she's pretty and blonde.\nBriana Keilar. (Honestly, never heard of her, but then, like most people, I rarely watch CNN.) But she's pretty and blonde.\nDana Bash. She wrote a gushing tribute to Crowley that made no mention of her presidential debate perfidy.\nBy virtue of the time slot, there is considerable media interest in who will replace Crowley. Mediaite lists the main contenders:\n…the show represents CNN’s efforts to be part of the news cycle at that time, when influential viewers tune in to see what they can glean from U.S. senators, Cabinet members and the like.\nCrowley’s Sunday Morning talk show, State of the Union, is an also-ran in the ratings derby, like CNN programming in general. Variety delicately phrases it:\nThe Romney campaign never recovered from that momentum shift. It is impossible to claim that Crowley threw the election, but it is also impossible to claim that she had no effect.\n“Can you say that a little louder, Candy?” Obama asked her, to which she obliged.\n“He did, in fact, sir, call it an act of terror,” Crowley interjected, telling Romney, leading to one of the more memorable moments during the three debates.\nInfamously, while moderating the second of three presidential debates in 2012, Crowley decided to correct Gov. Romney and confirm President Barack Obama’s claim that he described the Benghazi attack as an act of terror the day after the event, while that is not true, as the Washington Post’s fact checker Glenn Kessler noted at the time .\n“Candy Crowley committed one of the most significant blunders of any moderator in the history of presidential debates,” Ryan Williams, a former Romney spokesman, told The Daily Caller.\nCandy Crowley finally is out at CNN, in what sounds like her being fired. Of course, those words would never be used, but how hard is it to decipher the code when CNN head Jeff Zucker wrote in an internal memo that she “has made the decision to move on” and she has no specific plans for her next gig?\nCrowley now joins Dan Rather in a Hall of Shame of journalism, for her transparent coordination with the Obama campaign trying to flummox Mitt Romney in the second presidential debate of 2012. Recall that president Obama stmbled badly in the first debate, and momentum seemed to be behind the Romney campaign. But then, Crowley just happened to have a transcript in hand to wave and back-up a misleading claim of Obama.\nThe Daily Caller summarizes what happened:\n“Candy Crowley committed one of the most significant blunders of any moderator in the history of presidential debates,” Ryan Williams, a former Romney spokesman, told The Daily Caller. Infamously, while moderating the second of three presidential debates in 2012, Crowley decided to correct Gov. Romney and confirm President Barack Obama’s claim that he described the Benghazi attack as an act of terror the day after the event, while that is not true, as the Washington Post’s fact checker Glenn Kessler noted at the time. “He did, in fact, sir, call it an act of terror,” Crowley interjected, telling Romney, leading to one of the more memorable moments during the three debates. “Can you say that a little louder, Candy?” Obama asked her, to which she obliged.\nThe Romney campaign never recovered from that momentum shift. It is impossible to claim that Crowley threw the election, but it is also impossible to claim that she had no effect.\nCrowley’s Sunday Morning talk show, State of the Union, is an also-ran in the ratings derby, like CNN programming in general. Variety delicately phrases it:\n…the show represents CNN’s efforts to be part of the news cycle at that time, when influential viewers tune in to see what they can glean from U.S. senators, Cabinet members and the like.\nBy virtue of the time slot, there is considerable media interest in who will replace Crowley. Mediaite lists the main contenders:\nDana Bash. She wrote a gushing tribute to Crowley that made no mention of her presidential debate perfidy. Jake Tapper. ABC veteran, pretty decent reputation. Briana Keilar. (Honestly, never heard of her, but then, like most people, I rarely watch CNN.) But she's pretty and blonde. Jim Acosta. CNN’s White House correspondent. Don Lemon. Black and openly gay. A twofer! John King. Veteran reporter with silver hair and a bigger reputation than the others.\nThere is also one other dark horse. God forbid, the Perkster herself, now lurking on the internet. Via The Wrap:\nAnother dark horse: Katie Couric, who has been serving as Yahoo News’ Global Anchor, but insiders tell TheWrap is “itching to get back on TV.”\nGood riddance, I say.\nHat tip: John Nolte, Breitbart","url":"https://www.americanthinker.com/blog/2014/12/buhbye_candy_crowley.html"}
