{"authors":[],"date_download":"2018-10-22 21:27:02","date_modify":"2018-10-22 21:27:02","date_publish":"2014-06-05 00:00:00","description":"A new documentary, “Just Gender,” seeks to raise awareness about what it is to be transgender.","filename":"data/vaneerConsumption/BuildingABetterUnderstandingOfTheTransgenderCommunity.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/488576/140604-katie-hills-2157_13e06781b874d9d4e45b265a021cafdb.nbcnews-fp-1200-630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/feature_maria-shriver_building-better-understanding-transgender-community-n123436_1540243622.html","title":"Building A Better Understanding Of The Transgender Community","title_page":"Building A Better Understanding Of The Transgender Community - NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"Just Gender\" participant, and leader in the transgender rights movement, Jamison Green Buddha Dog Productions\nWhat does it mean to be transgender? You might know the answer to the question, or you might think that you do, but with awareness of the transgender experience on the rise, it’s clear that there is a distance to go in educating the public about the diversity within the transgender community and the appropriate, respectful ways to talk about it.\nActivist and filmmaker George Zuber is meeting that challenge head-on with his new documentary “Just Gender,” an exploration of the many facets of the transgender experience and the day-to-day realities of transgender individuals. The film screens across the country this month in conjunction with LGBT Pride Month.\n“Just Gender” tackles several fundamental misconceptions: gender identity and sexual orientation are not the same thing; the transgender spectrum encompasses many different kinds of gender expression and includes cross-dressers; transition is not a one-size-fits all process and does not necessarily include surgery.\n“I realized that I knew nothing about the transgender community more than probably the same stereotypes and misconceptions that most people held,” says Zuber who, having served as a diversity leader and been active in local and national LGBT groups, realized that what he didn’t know had important implications.\n“I thought, if I can know so little after having served in these roles, imagine how little probably most people know.”\nHere, Zuber shares what transgender individuals most want people to understand, discusses the term genderqueer, and explains why fixating on whether transgender individuals have undergone medical transition is offensive.\nPart of the challenge in people better understanding the transgender community is that the spectrum is incredibly diverse. It’s not just one way of being. Can you talk about that?\nI think probably typical of what happens with groups as they emerge and become more visible to the rest of the world, is that they are trying to work out their own language. So even the terminology that we use in the film isn’t universally, 100% accepted by every transgender person. However, that being said, I think the term “transgender,” and the way we use it to cover the range of diversity of people that have these experiences, is probably the more common way.\nWe describe transgender in the film as people who have an innate need to express their internal gender identity in some way that crosses society’s norms for the gender they were assigned at birth based on physical appearances.\nSome people only need to express periodically or in the privacy of their own homes, other people need to express more frequently. Those people who simply express by wearing clothes of the opposite sex, or wearing make-up or things of that nature, are typically referred to as cross-dressers. At the other end of the spectrum, are people who feel they have an essential need to find congruence between their internal sense of gender identity and their external body, and those people are generally referred to as transsexual. And I should point out that even in that group transitioning, this is not a one-step process; for many people it’s a multi-step process.\nThe film addresses the fixation some have on whether transgender individuals have undergone medical transition. Can you help people understand why that is offensive?\nWell, a couple of thoughts, first off it’s narrow, and it demonstrates that people really don’t understand what it means to be transgender.\nWhat comes to mind a little bit, is a fairly recent interview on television where a transgender woman who is well recognized within the community, was offended because the interviewer kept focusing on things like, “Before you transitioned...” and “When you were a man...” And I think what becomes offensive -- and I’m speaking from my experience talking to other people, not my own personal experience -- is that gender is something that is in people’s minds. It’s the essence of who they are.\nTransgender people are much more interested in talking about who they are in terms of being an authentic self, and much less interested in dwelling on what it means to go through a surgery.\nSo, what was a little bit backwards there, was that she was trying to explain that for her she’s always been a woman. There was no, “When I was a boy...” And so for her, it becomes somewhat offensive when the continual focus is simply on a body part. Transgender people are much more interested in talking about who they are in terms of being an authentic self, and much less interested in dwelling on what it means to go through a surgery.\nBecause the transgender community is diverse, and because there’s some disagreement within it as to who belongs under the umbrella, people feel unsure how to talk about the community. Can you talk about how that impacts the public conversation?\nWell, a couple of thoughts come to mind in that respect. One of them is of course what Dru Levasseur from Lambda Legal said in the film, and that is: when people start disagreeing amongst themselves, and actually start being prejudicial or discriminating against each other within the transgender community, it does raise a question as to why people should be surprised to learn that people are discriminating against them, if they themselves can’t accept each other.\nI do think that language is important, and we all know that language is fluid and that those things go through changes. But it’s important to try and help people understand. I think that making the right effort and having your heart in the right place, goes a long way.\nCan you talk about “Going Stealth,” whereby someone transgender can go through life without people realizing that they are transgender, and how it relates to some of the visibility challenges the community has faced?\nFor some of the people who have transitioned for a long period of time, it would be almost impossible for anybody walking down the street to even begin to guess that they might be a transgender person. And for some, that is almost a dream to have conformed their body to their gender identity. They want to put it in the past. And many can do that.\nI think there are more people who are saying, “This is simply part of who I am and I’m not going to hide this aspect.”\nHowever, thankfully for the transgender community, there are many people who have made those transitions and feel that they don’t want to be silent, that they want people to understand that they are ordinary people that had this lack of congruence, and now they feel as though they are congruent with their internal understanding of their authentic selves. So, they are still willing to go out there and be heard and try and stand up for the rest of the people in the transgender community. As the community has grown and connected, particularly through the internet, and with more organizations, community support, and increasing awareness, I think there are more people who are saying, “This is simply part of who I am and I’m not going to hide this aspect.”\nDuring the film, you cover the extreme challenges the community faces: suicide rates, economic hardship, isolation, violence, medical discrimination. To endure so much in this life speaks to the irrefutable call of self. Can you talk about that?\nThere are so many stories I have heard: people who have attempted to hide from themselves, or hoped that some kind of change of life, or alcohol, or drugs will help bury it or erase it from their mind. And the one thing that becomes evident in these conversations, is that it just never happens. And there are a number of people, and we’ll never know the exact quantities, but it’s widely believed that transgender people have among the highest rates of suicide, because not everybody can go for that full walk by themselves. And I think that’s one of the important reasons that we need to help others understand, so that transgender people will have somebody to walk with, and feel supported, and feel as though there’s hope.\nThe film provides historical context by showing there were deities combining both female and male expressions as far back as the pagans. Why did you feel the need to include that?\nWell, you know, periodically you do hear people suggest that this is the result of a degenerative, contemporary society. The reality of it is, that this is an experience which is not unique to our society. Based on all the recorded history that we have, it appears as though it’s always been with us in every age and every society.\nWhat progress do you see in terms of awareness and acceptance, and how has the digital revolution changed the game for younger members of the transgender community?\nI think one thing that’s wonderful, although there’s still a long way to go, is that there are certainly more parents beginning to understand that this is not just the way a child acts out or rebels, and that for the people we are talking about, this is just an innate part of who they are. And I think that there’s more parents who are trying to understand that, and who are trying to be supportive. I also think that it’s wonderful how a lot of younger people refuse to say that they fit in any one particular place along that spectrum of transgender people. I think the term “genderqueer” captures some of the sense of that, which is, “I don’t know exactly what I am. Maybe I’m not fully male or female, maybe I’m somewhere in between, or I have a little bit of both. But I don’t need to decide that. I can just be who I am.”\nWhat do you think the transgender community most wants people to understand?\nThat they’re just normal people. They’re not sick. They’re not deviants. We have to recognize that the term “gender identity disorder” -- the reference to a “disorder” -- was only eliminated recently, I mean, we’re talking about only a year ago. Up until that point, that kind of terminology, even within the professional medical community, suggested that it was more of an illness that needed to be cured.\nThis interview has been edited.\nFor more information and inspiration visit MariaShriver.com","url":"https://www.nbcnews.com/feature/maria-shriver/building-better-understanding-transgender-community-n123436"}
