{"authors":["Nick Enoch For Mailonline"],"date_download":"2018-10-23 01:31:03","date_modify":"2018-10-23 01:31:03","date_publish":"2017-04-26 11:56:59","description":"The huge animal appears suddenly after two baby elephants have crossed ahead of him - and looms scarily in front of a safari jeep in Kruger National Park, South Africa.","filename":"data/vaneerConsumption/BullelephantsquaresuptotouristsinSouthAfrica.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9D471E00000578-0-image-a-41_1493203783218.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447008_Bull-elephant-squares-tourists-safari-jeep_1540258263.html","title":"Bull elephant squares up to tourists in South Africa","title_page":"Bull elephant squares up to tourists in South Africa | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Standing threateningly right in front of a group of tourists, this male elephant was more than a little bullish.\nVideo footage shows the bull appear suddenly after two baby elephants have crossed ahead of him - and looms scarily in front of a safari jeep in Kruger National Park, South Africa.\nHe then fronts up to the vehicle, waving his ears and tugging at his tusk aggressively.\nThis is the moment a bull elephant came face to face with a safari tourist group in Kruger National Park, South Africa\nThe bull was in musth at the time - a hormonal surge in male elephants that is characterised by highly aggressive behaviour and a rise in reproductive hormones.\nTourist Kevin Kramer, 53, who filmed the encounter, said: 'We were driving on the Skukuza-Lower Sabie Road along the river when we stopped to observe a herd of elephants drinking.\n'Within a few minutes, the herd began making its way toward us.\nThe bull was in musth at the time - a hormonal surge in male elephants that is characterised by highly aggressive behaviour and a rise in reproductive hormones\nTourist Kevin Kramer, 53, who filmed the encounter, said: 'We were driving on the Skukuza-Lower Sabie Road along the river when we stopped to observe a herd of elephants drinking. Within a few minutes, the herd began making its way toward us'\n'There was a very large bull in musth that decided to intimidate us. All six of us became very nervous.\n'However, our guide Simon Vegter remained very calm and slowly backed the vehicle up to give the bull a little more space.\n'He later explained that, as we were on the road first, this was not as confrontational as it might have been.'\nThe bull appeared suddenly after two baby elephants had crossed ahead of him","url":"https://www.dailymail.co.uk/news/article-4447008/Bull-elephant-squares-tourists-safari-jeep.html"}
