{"authors":["Kalhan Rosenblatt For Dailymail.Com"],"date_download":"2018-10-23 01:59:19","date_modify":"2018-10-23 01:59:19","date_publish":"2016-01-29 16:15:13","description":"An eighth grade girl was caught attacking a seventh grader on video in Denver, Colorado. The attack happened for an entire minute in front of other students who were changing classes.","filename":"data/vaneerConsumption/BullycaughtinvideobeatingseventhgradegirlatschoolinDenver.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B4197F00000578-0-image-a-31_1454084051902.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422925_Bully-caught-camera-attacking-seventh-grade-girl-minute-two-children-school-Denver_1540259959.html","title":"Bully caught in video beating seventh grade girl at school in Denver","title_page":"Bully caught in video beating seventh grade girl at school in Denver | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An eighth grade girl was caught on camera pummeling a seventh grader in the middle of a Denver, Colorado, classroom.\nThe attack happened in front of a group of students who were changing classes at Center of Hope School in Denver on Thursday.\nFor an entire minute the older girl in a white shirt with black sleeves is seen sitting on top of the younger girl's chest throwing a steady barrage of punches down.\nAn eighth grade girl was caught attacking a seventh grader at a Denver school in a shocking video\nThe older girl can be seen on top of the younger child as she repeatedly punches the seventh grader\nAt one point the girl even stands up and kicks the younger girl in the face and side before as the younger girl puts her arms up, trying to protect her face from the minute-long attack\nThe older girl begins punching the seventh grade student again before an adult pulls her off\nThe younger girl tries to cover her face as she is repeatedly beat over and over again by the older girl.\nThe eighth grader then stands up and kicks the younger girl in the face, before beginning another slew of punches.\nChildren can be heard in the background cheering the fight on.\nEventually an adult enters the room and pulls the girls apart. Police were called and both children were suspended from Center of Hope School.\nThe seventh grader's father, Robert Medina (pictured), was outraged and angered by the attack on his daughter and said the school, Center of Hope School in Denver, should have handled it better\nThe school said it followed policy while handling the fight and that the students were changing classes when it happened, which is why no adults were around to break up the fight sooner\nThe police were called after the attack and both students have been temporarily suspended from the school\nThe seventh grader's father, Robert Medina, said the students were changing classes, which is why no teachers were around.\nMedina was horrified when he saw the video of his daughter being attacked by the older girl.\n'I just couldn't believe it. I was outraged, I was angry. I couldn't believe something like this could happen,' Medina told Fox31 in Denver.\nHe said he thinks the whole situation was mishandled by the school and is also upset no one tried to help his daughter.\n'For a good minute the girl is on top of her, hitting and hitting and no one was around to do anything,' Medina said.","url":"https://www.dailymail.co.uk/news/article-3422925/Bully-caught-camera-attacking-seventh-grade-girl-minute-two-children-school-Denver.html"}
