{"authors":[],"date_download":"2018-10-22 20:52:17","date_modify":"2018-10-22 20:52:17","date_publish":"2014-05-02 17:03:43","description":"High school students who are bullied are bringing hundreds of thousands of weapons to school, a new study claims.","filename":"data/vaneerConsumption/BulliedStudentsSneakThousandsofGunsIntoSchools.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_18/418546/140503-students-backpack-1916_f80e7e764f08bb35b8042e9e2885799a.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_kids-health_bullied-students-sneak-thousands-guns-schools-n95781_1540241537.html","title":"Bullied Students Sneak Thousands of Guns Into Schools","title_page":"Bullied Students Sneak Thousands of Guns Into Schools","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBullying victims are sneaking hundreds of thousands of firearms, knives and clubs into U.S. high schools, according to a chilling new analysis that carries the eerie echoes of one recent mass school assault and two potential near misses.\nExtrapolating from a survey of American high school students by the U.S. Centers for Disease Control and Prevention, researchers found that bullied students who are threatened or injured by a weapon on school property were eight times more likely to then choose, themselves, to carry a weapon to campus.\nMore alarming: Bullying episodes have a cumulative effect, vastly boosting the likelihood that a chronically harassed student will choose to pack a weapon before returning to a high school, the study found.\nSpecifically, bullied students who have endured four types of aggressive clashes at school — being verbally tormented, sustaining a physical assault, suffering personal property theft or damage, and cutting school due to safety concerns — are nearly 49 times more likely to have recently carried a weapon to school and 34 times more likely to have carried a gun within the past 30 days, the study found.\n“When you combine all of those risk factors, you see scary figures,” said the lead author, Dr. Andrew Adesman, chief of developmental and behavioral pediatrics at Steven & Alexandra Cohen Children’s Medical Center of New York.\n\"The data is staggering.\"\n“The CDC gave us the dots — we connected them. The data is staggering,” Adesman added during a phone interview. He will present the findings Sunday to a meeting of the Pediatric Academic Societies in Vancouver, B.C.\nBy examining the responses of high school students in a biannual, national survey conducted by the CDC, the researchers estimated that more than 200,000 victims of bullies had secretly lugged weapons such as firearms, knives or clubs into their high schools at least once during a previous month.\n“Looking at these risk factors, it’s not hard to know who’s most likely to carry a weapon to school,” Adesman said. He added that some victims of bullies also are bullies themselves, “so it's not always black and white.\"\nBullying is often discussed after mass shootings, even if evidence has been generally mixed. The Columbine shooters, for example, bragged about bullying students themselves. But previous studies have found bullying to be a factor in many school shootings.\nThe fresh findings are certainly consistent with three 2014 incidents during which students who were reportedly bullied later toted weapons to their schools — and one of those students allegedly inflicted mass injuries.\nAlex Hribal, 16, is accused of a stabbing spree at a school near Pittsburgh that left 20 students and a security guard wounded. The Pittsburgh Tribune-Review reported that Hribal had received an online taunt the night before.\nTwo weeks later, a 9-year-old boy brought a handgun to Ellis Elementary School in Manassas, Va., and did so, police said, because he was being bullied.\nEarlier this year, police in San Diego, hunting for truants, stopped a 15-year-old freshman at Serra High School who was carrying a gun in his backpack and who was en route to that school.\n“He obtained the gun (earlier that morning) from where he was living. He hid it in a canyon on his way to school,” said Lt. Kevin Mayer, a spokesman for the San Diego Police Department. “He went to Serra High School where he was being bullied, and he got bullied again that day. He ditched a period. He went and retrieved the gun.”\n“If victims felt supported, protected, and heard by at least one of their peers, would they need to bring a weapon to school?”\nThe new findings from Adesman don't surprise two top anti-bullying advocates, yet both agreed the figures should offer teachers, principals and even parents a more urgent understanding of where to find the seeds of eventual mass school shootings.\n“The extent to which a youngster has a weapon with them at school, you create a feeling of a bit more bravado on their part,” said Ronald Stephens, executive director of the National School Safety Center, based near Los Angeles. “When you combine the weapon's availability with the intimidation, some type of confrontation could escalate significantly.\n“And when you look at many of the school shootings, they start with the small things,” Stephens added. “It could be name-calling, cursing, yelling, hard looks, and then you’re just moving right up the violence-continuum scale.\"\nThis study “may move us further along” in the work now underway at many schools to curb bullying while placing extra responsibility on administrators, Stephens said, “because once school officials know there is bullying going on, it goes back to: What did you know, when did you know about it, what did you do about it?”\nOne method for school professionals to intervene well before a weapon is placed inside a backpack is to try to break the code of silence that exists among many students, said Donna Clark Love, a Houston-based anti-bullying advocate who works with school staffs and families.\n“A common thread of these students who bring weapons to school is to tell someone — usually peers,” Clark Love said. \"We have to give our kids permission and support to report what they hear when a peer is in trouble.\n“We have to train our bystanders to become up-standers. Schools spend so much time focusing on the bullies, and yet so little time and effort in training the largest part of the student body, the bystanders,” she added. “If victims felt supported, protected, and heard by at least one of their peers, would they need to bring a weapon to school?”","url":"https://www.nbcnews.com/health/kids-health/bullied-students-sneak-thousands-guns-schools-n95781"}
