{"authors":["Rosie Taylor Business Reporter For The Daily Mail"],"date_download":"2018-10-22 20:19:20","date_modify":"2018-10-22 20:19:20","date_publish":"2016-01-28 00:56:14","description":"Last year bungalows made up just one in 50 new dwellings, said the National House Building Council. It said British families want houses while older people opt for retirement flats.","filename":"data/vaneerConsumption/Bungalowsmadeupjust1in50newdwellingsin2015.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/00/1B64E309000005DC-0-image-a-35_1453942488392.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420215_End-storey-bungalows-1-50-new-dwellings-single-floor_1540239560.html","title":"Bungalows made up just 1 in 50 new dwellings in 2015","title_page":"Bungalows made up just 1 in 50 new dwellings in 2015 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bungalows are falling out of favour with buyers, who prefer houses or flats, say home builders.\nIn the mid-1980s, they accounted for around one in six new homes.\nBut last year, they made up just one in 50 new dwellings, said the National House Building Council. It said families want houses while older people opt for retirement flats.\nLast year bungalows made up just one in 50 new dwellings, said the National House Building Council. It said British families want houses while older people opt for retirement flats (file image)\nBuilders said increased demand for family homes and older people preferring retirement flats had pushed the once-popular style out of favour.\nBungalows are also ‘land-hungry’ – making them less profitable for developers who cannot fit as many on a piece of land as houses with two or three storeys. Neil Jefferson, of the NHBC, said firms are ‘building upwards rather than outwards’.\nPeter Andrew, of the Home Builders Federation, said: ‘Bungalows are relatively land-hungry. If you’re looking at land in a competitive nature, a bungalow has a greater footprint for the same amount of square footage as a house because they are on one level instead of two.\n‘From an economics point of view, bungalows are a challenge to make work economically sat alongside houses.’\nBungalows were most likely to be built by local authorities with large aging populations, such as in coastal areas, he added.\nNeil Jefferson, of the NHBC, said: ‘There has been a move towards building upwards rather than outwards and using less land.’\nMore new homes were finished last year than at any time in the last seven years, the NHBC said.\nThere were 139,975 properties completed, compared to 119,898 in 2014 and 108,583 in 2013.\nThere was also an eight-year high in the number of properties registered to be built, with 156,140 new homes registered in 2015 – up 75 per cent on the 2009 recession.\nDevelopers register planned builds ahead of starting work, so registrations are used as a reliable measure of the number of planned homes which will actually be built, rather than just those for which planning permission has been obtained.\nMost areas in the UK saw a rise in the number of new homes registered, although there was a drop of 9 per cent in London after two record years of growth.","url":"https://www.dailymail.co.uk/news/article-3420215/End-storey-bungalows-1-50-new-dwellings-single-floor.html"}
