{"authors":["Rebecca Sheir","Sarah Scruggs Of Manna","An Affordable Housing Organization"],"date_download":"2018-10-23 01:08:27","date_modify":"2018-10-23 01:08:27","date_publish":"2014-11-25 00:00:00","description":"This problem exists nationwide, but in the nation's capital, there are more requirements and restrictions. For example, D.C. limits the maximum resale price and makes homeowners wait before they sell.","filename":"data/vaneerConsumption/BureaucraticHoopsMakeDCAffordableHousingUnitsHardToSell.json","image_url":"https://media.npr.org/assets/img/2014/11/25/AffordableHousingDCSheir3_wide-f656cc69617f24c83faa7268910bbb8548cb340d.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2014_11_25_366352163_bureaucratic-hoops-make-d-c-affordable-housing-units-hard-to-sell_1540256907.html","title":"Bureaucratic Hoops Make D.C. Affordable Housing Units Hard To Sell","title_page":"Bureaucratic Hoops Make D.C. Affordable Housing Units Hard To Sell  : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Bureaucratic Hoops Make D.C. Affordable Housing Units Hard To Sell\nEnlarge this image toggle caption Courtesy of Manna Inc. Courtesy of Manna Inc.\nIn Washington, D.C., a city with one of the highest costs of living in the nation, low-income residents are having trouble buying affordable housing — not because of a lack of it, but because of all the red tape.\nNearly 1 in 5 D.C. residents lives at or below the poverty line.\nD.C. real estate developer Buwa Binitie offers affordable housing units as well as market-rate condos and says his rental properties can get snapped up quickly but the for-sale properties take a whole lot longer.\n\"The affordable units we're selling for $171,000, and the market-rate units we're selling for $230,000. All the market-rate units sold in two months, but it's taken me 11 months to dispose of 11 affordable dwelling units,\" he says.\nBinitie blames the holdup on the hoops prospective buyers must jump through.\nThe first trick, says National Low Income Housing Coalition President Sheila Crowley, is proving your income is low enough to qualify for affordable housing yet high enough to get a mortgage. In D.C., you must make below 80 percent of the area median income of $107,000 for a family of four.\n\"Part of it is this square-peg-into-a-round-hole thing that we try to do in housing, and that's a conundrum,\" Crowley says.\nShe says this conundrum exists nationwide, and in D.C., it's compounded by more requirements: Prospective buyers of affordable housing must also attend homebuying training, and if they want to get a loan, they must navigate the labyrinth of city government.\nMarilyn Phillips just bought her very first condo. An affordable housing organization called Manna walked her through the process.\nThe D.C. government and the federal government want to make sure that the subsidies that they're providing are going to people that actually need them.\n\"People can get frustrated with all the hoops you have to jump through,\" Phillips says. \"All of the information they want to gather from you, it can make you feel like, 'Why do you need all this information?' \"\nThe 58-year-old has been fighting breast cancer for years, and now she can finally save money.\n\"I pay most of my Social Security disability check to my landlord now. I pay $900 a month. My mortgage at this new place is only $224 a month,\" she says.\nSarah Scruggs works for Manna and says the bureaucracy surrounding affordable homeownership is well-intentioned.\n\"The D.C. government and the federal government want to make sure that the subsidies that they're providing are going to people that actually need them,\" Scruggs says.\nBut what happens is many low-income individuals decide to just keep renting or scrape their pennies together for a market-rate unit \"because they don't have to deal with the paperwork required to buy an affordable dwelling unit,\" Scruggs says, \"and they don't have to deal with the restrictions.\"\nFor example, there's a restriction in D.C. that limits maximum resale price and makes homeowners wait anywhere from five to 20 years before they sell.\nMichael Kelly, director of the D.C. Department of Housing and Community Development, says he understands how unwieldy the process can be. \"Unfortunately, with all government programs, there are bureaucracies and provisions that go with that,\" he says. \"We're doing everything we can to streamline that effort.\"\nThe current mayor has vowed to build 10,000 affordable units for sale and lease by the year 2020; he hopes his successor will continue toward that goal. But under the current system, it could be a while before every unit has an owner to call it home.","url":"https://www.npr.org/2014/11/25/366352163/bureaucratic-hoops-make-d-c-affordable-housing-units-hard-to-sell"}
