{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 19:27:03","date_modify":"2018-10-30 19:27:03","date_publish":"2017-02-15 22:18:26","description":"Burlington, formerly known as the Burlington Coat Factory, is the latest retailer to drop Ivanka Trump's fashion line.","filename":"data/vaneerConsumption/BurlingtonDropsIvankaTrumpsFashionLinefromItsWebsite.json","image_url":"https://media.breitbart.com/media/2017/02/Burlington-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_02_15__1540927623.html","title":"Burlington Drops Ivanka Trump's Fashion Line from Its Website","title_page":"Burlington Drops Ivanka Trump's Fashion Line from Its Website","title_rss":"NULL","source_domain":"breitbart.com","text":"Burlington is the latest retailer to drop Ivanka Trump’s fashion line.\nAs of Friday, Burlington had removed from its website all 13 of the Ivanka Trump items it had for sale, Business Insider reports.\nBurlington, formerly known as the Burlington Coat Factory, has not commented on the matter, and it is unclear whether it is still selling the brand in its stores.\nShannon Coulter, co-founder of the Grab Your Wallet anti-Trump boycott movement, posted on Twitter a screen grab of a search for Ivanka Trump merchandise on the website, which yielded no results.\n“Sorry, we are not getting any results for the brand you searched,” the message on the website said.\nNordstrom announced on February 3 that it would stop selling Ivanka Trump’s brand due to poor sales, but an industry veteran who knows Nordstrom said that was not true.\nThe source told Breitbart News:\nThis is a classic example of a retailer making a decision based on their fear of standing up to political pressure – even on a limited scale. It was clear from their actions since last fall that Nordstrom would prefer to sell out to loud liberal groups who weren’t even regular Nordstrom consumers, just to avoid controversy.\nStores have also dropped Donald Trump’s line of products. Retailers Sears and Kmart dropped the Trump Home products from their websites this week. The retailers’ brick-and-mortar locations did not sell the merchandise.","url":"https://www.breitbart.com/politics/2017/02/15/burlington-drops-ivanka-trump-fashion-line-website/"}
