{"authors":["Dennis Drabelle"],"date_download":"2018-10-21 03:32:38","date_modify":"2018-10-21 03:32:38","date_publish":"2018-08-16 20:08:15","description":"Two books explore our sparest landscapes — and the threats to their existence.","filename":"data/vaneerConsumption/BurningManisjustoneofthemanystrangewondersofdesertlife.json","image_url":"https://www.washingtonpost.com/resizer/IWfAK_hwl6FCHuLhuFknRKd7cj4=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/W4K7CSFATMI6RDUHZBU744FHEE.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/outlook_burning-man-is-just_9012aa50e9ef827449a41c558dcc7413_1faa2516-7e0b-11e8-bb6b-c1cb691f1402_story_1540092758.html","title":"Burning Man is just one of the many strange wonders of desert life","title_page":"Burning Man is just one of the many strange wonders of desert life - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Dennis Drabelle, a former contributing editor of Book World, writes frequently on the environment.\nEach summer, Burning Man — a week-long farrago of do-it-yourself spectacle and impromptu whoop-up — springs to life in the Nevada outback like a debauched Brigadoon. At a recent festival, William Atkins became the one thing that Burning Man discourages: a spectator.\nIn “The Immeasurable World,” his perceptive and witty account of his desert travels, Atkins gives the reader an entertaining tour of the tent city’s zones and attractions, including the Barbie Deathcamp, the Camel Toe Fashion Show and the Hug Bank, which “offered a ‘menu’ ranging from ‘businesslike’ to ‘awkward.’ ” He also zeroes in on certain little-known properties of the extravaganza — its whiteness, for example. “The portapotties,” he writes, “were suctioned out each morning by Mexican labor, almost the only dark faces you saw.”\nAnd he puts his finger on the underlying Burning Man dilemma: how to achieve maximum spontaneity while living cheeks-to-cheeks (nudity is commonplace) with 60,000 or so other burners. To help everyone make connections, a homegrown institution known as the Department of Public Works puts up road signs. The signs never last long, though; anarchists paint over them or take them down, leaving festivalgoers disoriented. “Those responsible for the vandalism were not admired,” Atkins writes, “but their lawlessness was truer to Burning Man’s founding spirit.”\n[The dire future that awaits San Francisco, New Orleans, Los Angeles and Seattle]\nThe Burning Man chapter comes toward the end of the book, which starts with a nod to the explorers — many of them Atkins’s fellow Englishmen — who did not share the majority view of deserts as hellish regions to be avoided at all costs. With a local guide, Atkins, also the author of a travel book on the English moors, samples the Empty Quarter of the Arabian Peninsula, where the likes of Wilfred Thesiger and Bertram Thomas performed impressive feats of “discovery” — that is, reaching sites previously known only to nomadic Bedouin. Citing Thesiger’s preferred state of celibacy and T.E. Lawrence’s praise of “abnegation, renunciation, self-restraint,” Atkins sums up the allure to which they succumbed. “For those sweating, leaking, reeking, dreaming travelers in the hyper-arid Middle East, the desert promised asylum — both from garden England and from their own body and its cursed fecundity and importuning, its uncleanness.”\nThis is weighty material, but Atkins is usually prepared to buoy it up with a joke. I especially like his description of the gizmo he bought in advance of his visit to the Empty Quarter, where “the average annual rainfall is five millimeters.” He would self-hydrate with “a CamelBak — a blue plastic bladder that slips inside your backpack and has a spigoted rubber catheter that snakes over the shoulder for on-the-go suckling.”\nAtkins’s itinerary also includes the Great Victoria Desert of Australia, the Taklamakan Desert of China, the Aralkum Desert of Kazakhstan, the Sonoran Desert of Arizona and the Eastern Desert of Egypt. In that last region, he hangs out with Coptic Christian monks who undermine the prejudice that the desert is strictly for loners. The life of a cenobitic monk, he writes, is “shriveled, perhaps, but not joyless. What I am most aware of, in fact, is love; each man touches the hand of every other he meets, to bless him or take his blessing.”\nBlessings are hard to come by in “The World in a Grain,” American journalist Vince Beiser’s impassioned and alarming report on sand. The only good news in the book is that Atkins’s deserts — indeed, deserts in general — are likely to survive because their sand has no utilitarian value. Sand’s predominant commercial use is as a constituent of concrete, a purpose for which desert sand won’t do because, “shaped by wind rather than water, [the] grains are too round to bond together well.”\nSo much construction is going on worldwide as rural people migrate to cities en masse that the right kind of sand — typically found on river bottoms or ocean floors — is coveted by builders and made off with by pirates who aren’t above murdering those who stand in their way. Dredging up that sand causes great harm to the environment, including to floodplains where sand normally serves as a buffer against storms. Sand-enabled construction has given rise to ever bigger houses, in suburbs ever more distant from the urban job sites to which the house owners drive, burning ever more fossil fuel, enhancing the greenhouse effect and exacerbating global warming — so that in Beiser’s artful telling, the planet is caught up in a vicious, sand-fueled cycle.\n[Why have we done so little to tackle climate change?]\nBeiser is particularly informative on China, where the aforementioned mass migration is most acute. Calling China “the world’s largest consumer of concrete and the most voracious consumer of sand in human history,” he notes that, ironically, the country also has too much of the wrong kind of sand — the desert variety — which is being added to by surging development. As people colonize new territory in Inner Mongolia, Beiser points out, they “cut trees for firewood and draw groundwater to irrigate farmland and run heavy industries. . . . As underground aquifers get depleted, the land dries up. Without plant roots to anchor it and moisture to weight it, topsoil blows away, leaving behind only pebbles and sand. Which means that at the same time that we’re running out of the sand we need, we’re generating more of the kind we don’t.”\nChina purports to be solving this problem by planting trees, millions upon millions of them, creating the “Great Green Wall.” Beiser, however, is skeptical. Many of the newly planted trees die young, and while alive they siphon up groundwater. Whether the Great Green Wall is “hurting or helping,” he writes, is “hard to know.” What’s easy to know is that the fate of sand exemplifies humans’ increasing overconsumption of natural resources. “Sand,” Beiser reminds us, “is perhaps the most abundant substance on the planet’s surface. If we’re running out of that, we really need to rethink how we’re using everything.”","url":"https://www.washingtonpost.com/outlook/burning-man-is-just-one-of-the-many-strange-wonders-of-desert-life/2018/08/16/1faa2516-7e0b-11e8-bb6b-c1cb691f1402_story.html"}
