{"authors":[],"date_download":"2018-10-23 01:07:54","date_modify":"2018-10-23 01:07:54","date_publish":"2016-01-28 15:20:26","description":"Burundi's main opposition grouping on Thursday urged the international community and the African Union to approve plans to send an AU peacekeeping force to t...","filename":"data/vaneerConsumption/BurundioppositionurgessupportforAUinterventionforce.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h1da-2vdWmEltwXfba0ce28e632a1983b-665_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421149_Burundi-opposition-urges-support-AU-intervention-force_1540256874.html","title":"Burundi opposition urges support for AU intervention force","title_page":"Burundi opposition urges support for AU intervention force | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Burundi opposition urges support for AU intervention force\nBurundi's main opposition grouping on Thursday urged the international community and the African Union to approve plans to send an AU peacekeeping force to the strife-torn country despite President Pierre Nkurunziza's objections.\nBurundi has been in turmoil since April when Nkurunziza said he would stand for a third term, a move the opposition said was illegal and breached an accord ending a horrific civil war which left 300,000 dead in the former Belgian colony.\n\"The risk is that hesitancy on the part of the international community to support the Burundi people could lead to the resurgence of armed groups,\" Leonard Nyangoma, head of the CNARED opposition group, told a press conference.\nBurundi has been in turmoil since April when President Pierre Nkurunziza said he would stand for a third term, a move the opposition said was illegal and breached an accord ending a horrific civil war which left 300,000 dead ©Carl De Souza (AFP/File)\n\"If the international community holds back, then the Burundi people, in a legitimate act of self-defence, will certainly organise against the aggression of Pierre Nkurunziza, who has declared open war on his people,\" Nyangoma said.\nThe AU said Thursday it was determined to end the crisis in Burundi, with a summit on Saturday due to vote on sending a 5,000-strong peacekeeping force.\nBut Nkurunziza called last month for Burundians to \"stand up to fight\" if AU troops set foot in the country without permission, dubbing it an \"invasion force\".\nThe AU charter gives the pan-African bloc the right to intervene in a member state in \"grave circumstances\" where war crimes, genocide and crimes against humanity are being committed.\nSince Nkurunziza won the presidential elections in July, clashes between loyalists and the opposition have turned increasingly violent.\nThe UN has warned Burundi risks a repeat of the 1993-2005 civil war, with some 400 dead since April and at least 230,000 people fleeing to neighbouring countries.\nCNARED warned that the international community and the AU must not shirk their responsibilities in Burundi.\nIf they do, they risk instability in the whole central African region, with tribal fault lines very close to the surface.","url":"https://www.dailymail.co.uk/wires/afp/article-3421149/Burundi-opposition-urges-support-AU-intervention-force.html"}
