{"authors":["Staff Report"],"date_download":"2018-10-30 17:50:09","date_modify":"2018-10-30 17:50:09","date_publish":"2018-10-30 12:18:00","description":"Fourteen students from Bentonville West High School suffered minor injuries in a charter bus accident Monday, according to a Bentonville School District spokeswoman.","filename":"data/vaneerConsumption/Busaccidentsends14NorthwestArkansashighschoolstudentstohospital.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30__1540921809.html","title":"Bus accident sends 14 Northwest Arkansas high school students to hospital","title_page":"Bus accident sends 14 Northwest Arkansas high school students to hospital","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Fourteen students from Bentonville West High School suffered minor injuries in a charter bus accident Monday, according to a Bentonville School District spokeswoman.\nBand members were on two charter buses to the Arkansas State Marching Contest at War Memorial Stadium in Little Rock.\nNear the 32-mile marker on Interstate 49 South, traffic started to slow down and one bus collided with the other, disabling both buses, according to a statement from Bill Sadler, public information officer at the Arkansas State Police.\nThere were 128 students on the two buses. The band was scheduled to perform at 3:45 p.m. but withdrew from the competition, said Leslee Wright, the district's director of communications.\nInjured students were taken to a Sparks Health System office in the Fort Smith area. As of 5 p.m., all the injured students were treated and released, Wright said.\nSuperintendent Debbie Jones went to Fort Smith to be with the injured students, Wright said.\n\"We've been in communication with the students and parents affected by this incident to support them however we can,\" Wright wrote in an email. \"Their safety is our top priority and we're grateful to police and medics who quickly responded to care for them.\"\nThe crash is under investigation, according to Sadler. The name of the bus company involved wasn't available.\nThe West High School band was scheduled to perform in Little Rock right after a weekend trip to St. Louis for the Bands of America super regional competition, where the school placed 28th out of 74 bands. Bentonville High School also performed at the competition and finished 14th overall.","url":"https://www.arkansasonline.com/news/2018/oct/30/bus-accident-sends-14-northwest-arkansas-high-scho/"}
