{"authors":["Jennifer Newton For Mailonline"],"date_download":"2018-10-23 00:55:04","date_modify":"2018-10-23 00:55:04","date_publish":"2016-01-11 11:13:48","description":"The bus was carrying members of a Mexican soccer team when the driver lost control as the vehicle travelled over a bridge and plunged off a ravine into a deep gorge below.","filename":"data/vaneerConsumption/BuscarryingmembersofaMexicansoccerteamplungesoffravineintoadeepgorge.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/10/3007875000000578-0-image-a-35_1452509546537.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393712_Bus-carrying-members-Mexican-soccer-team-fans-plunges-ravine-deep-gorge-killing-20-people_1540256104.html","title":"Bus carrying members of a Mexican soccer team plunges off ravine into a deep gorge","title_page":"Bus carrying members of a Mexican soccer team plunges off ravine into a deep gorge | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"At least 20 people have died after a bus carrying a Mexican soccer team plunged off a ravine and fell into a deep gorge below.\nThe head of the civil defense office in the Gulf coast state of Veracruz, Yolanda Guttierrez, says the accident saw 20 of the 45 people on board die.\nShe added that the bus was apparently carrying members of a soccer team when it skidded off a bridge near the city of Cordoba.\nAt least 20 people have died after a bus carrying a Mexican soccer team plunged off a ravine and fell into a deep gorge below\nRescue workers remove the body of a passenger who died when a bus plunged off a bridge in Mexico after the driver lost control\nThe Veracruz state government said it was likely the bus was speeding and that the driver lost control when going over a speed bump.\nThe vehicle then plunged off the bridge, which is more than 100 feet high on the Atoyac-Paso del Macho highway in Atoyac.\nIt is understood the bus was heading from Camaron de Tejeda to Cordoba, where the team was going to play a match.\nPictures from the scene showed rescue workers help pull survivors out of the wreckage and transport them to hospitals in Cordoba, a city more than 155 miles from Mexico City.\nRescue workers were seen pulling bodies from the wreckage of the bus after it crashed. The Veracruz state government said it was likely the bus was speeding and that the driver lost control when going over a speed bump\nA survivor of the crash struggles to contain his emotion as bodies are pulled from the ravine after the crash in Cordoba\nThey were also pictured pulling the bodies of those who died from the crumpled remains of the bus.\nIt was unclear if the driver survived.\nMexican President Enrique Pena Nieto expressed his condolences to the victims' families in his Twitter account.\nLocals look on over the side of the ravine where the wreckage of the bus lay as rescue workers pulled bodies from the crumpled vehicle\nHe said: 'I regret the tragic accident at the bridge of Atoyac, Veracruz, in which several people were killed.\n'My condolences to your loved ones and wishes of speedy recovery to the injured.'","url":"https://www.dailymail.co.uk/news/article-3393712/Bus-carrying-members-Mexican-soccer-team-fans-plunges-ravine-deep-gorge-killing-20-people.html"}
