{"authors":["Martin Robinson","Uk Chief Reporter For Mailonline"],"date_download":"2018-10-23 01:44:29","date_modify":"2018-10-23 01:44:29","date_publish":"2017-03-10 10:15:13","description":"Driver Surjeet Singh Pal, 57, lost control of his vehicle and mounted the pavement in Stourbridge, West Midlands, in May last year, sending Deborah Davies flying into the gutter.","filename":"data/vaneerConsumption/Busdriverleftagrandmotherwithonlyhalfahead.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E22488400000578-0-image-a-70_1489142648123.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300658_Bus-driver-left-grandmother-56-half-head_1540259069.html","title":"Bus driver left a grandmother with only half a head","title_page":"Bus driver left a grandmother with only half a head  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Driver Surjeet Singh Pal, 57, lost control of his vehicle and mounted the pavement in Stourbridge, West Midlands, in May last year, sending Deborah Davies flying into the gutter - and she lost half her brain\nA bus driver who ploughed into a grandmother and left her with half a head has been handed a £175 fine - to the fury of her heartbroken family.\nDriver Surjeet Singh Pal, 57, lost control of his vehicle and mounted the pavement in Stourbridge, West Midlands, in May last year, sending Deborah Davies flying into the gutter.\nMrs Davies, 56, was rushed to Queen Elizabeth Hospital in Birmingham in a critical condition and suffered severe brain damage.\nShe survived, but the life-saving surgery for a bleed on her brain left her without half of her skull, before it was replaced with a metal plate.\nThe driver ploughed into Deborah from behind, sending her flying into a gutter - and her husband Steve, 58, claims the bus driver has 'ruined their lives'.\nHowever Singh Pal, who is understood to have driven onto the pavement when approaching a bend, received only a £175 fine and a six month driving ban from Birmingham Magistrates' Court.\nHe must also reapply for his licence from the DVLA.\nEven though causing death by careless driving carries a maximum penalty of five years, there is no law that covers the offence of causing serious injury by careless driving.\nSteve, a retired engineer, lashed out at the sentence and said: 'It's appalling. It's no punishment at all.\nBefore and after: Mrs Davies was a fit and healthy woman before the crash (left), which left her brain damaged and required life-saving surgery on her brain (right)\n'He has ruined our lives and he gets to walk free.\n'If he had killed her, he would have had a more severe punishment, but then I would have lost my wife. It's a lose-lose situation.\n'My son said if he were to collect three speeding tickets he would be more severely punished than the driver.\n'Deborah went from being a vibrant and vivacious young grandmother to being solely dependent on me and our family.\nHearing: Deborah went from being a vibrant and vivacious young grandmother to being solely dependent on her husband and family\n'She is now merely existing. She has such a poor quality of life compared with the one she planned for and we built together.\n'She is living a life sentence while the driver who did this to her can put everything behind him and continue living his life.\n'I am disgusted and dismayed there is not provision in law to adequately reflect the catastrophic, irrevocable damage this incident has done, both to Deborah physically as well as our lives as a family.'\nSteve, 58, witnessed the accident along with one of their five grandchildren.\nThey were on their way to complete a purchase on a dream home so they could move closer to their daughter and grandchildren when the bus struck.\nAn ambulance crew that were two vehicles behind rushed out and immediately administered first aid, without which Deborah would have died.\nHe said: 'It was a lovely sunny day and we were walking along three-abreast, my wife closest to the road.\n'We were just going to give in the final but of paperwork, and it was exciting as it was what we both wanted.\n'All of a sudden she went flying through the air and landed in the gutter. It was awful.\n'Without the ambulance crew right there she would have died. She could not have held on and waited for one to arrive.'\nDespite being in a critical condition, she amazingly pulled through, but suffered severe brain damage and had to have part of her skull replaced by a metal plate.\nThe life-saving surgery has left her with only half a head.\nFollowing the incident on May 20 last year, Deborah was placed into an induced coma for a week.\nShe sustained severe brain damage with lead to a clot on the brain. She required life-saving surgery and extensive rehabilitation.\nShe also suffered a broken neck, fractured cheek, broken ribs and a punctured lung in the collision.\nDevastating injuries: Debbie also suffered a broken neck, fractured cheek, broken ribs and a punctured lung in the collision\nShe returned home on October 2016 to await a craniotomy to replace part of her missing skull with a metal plate.\nHowever, the couple may need to move from their new home to an adapted house, due to the level of care Deborah requires.\nShe is no longer able to look after her beloved grandchildren, visit friends for walk her miniature schnauzer Archie.\nRebecca Hearsey, an expert serious injury lawyer at Irwin Mitchell, said: 'Five months after the accident which almost claimed her life, Deborah was allowed to return home but only if she wore a padded helmet to protect her fragile skull.\n'Every day continues to be a struggle for her.\n'Her life now will be constantly punctuated by hospital appointments, therapy, carers and rehabilitation.\n'The driver's sentence does not reflect the severity of what happened and it is easy to see why Steve and his family are so dismayed that the punishment simply does not fit the crime.\n'While the sentence ultimately can't do anything to change what has happened to Deborah, Steve and his family feel it also does nothing to encourage drivers to exercise greater caution behind the wheel.\n'He hopes that releasing photos of Deborah before and after the crash will instead serve as a warning to drivers that their actions can have catastrophic consequences.'","url":"https://www.dailymail.co.uk/news/article-4300658/Bus-driver-left-grandmother-56-half-head.html"}
