{"authors":["Adrian Thrills For The Daily Mail"],"date_download":"2018-10-22 22:31:13","date_modify":"2018-10-22 22:31:13","date_publish":"2017-03-10 00:55:47","description":"On their seventh album, Bush have come up with a record designed to bring some overdue UK success.","filename":"data/vaneerConsumption/BushfindtheirvoiceinBritainonnewalbum.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1F125E00000578-0-image-a-16_1489107224860.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299578_Bush-voice-Britain-new-album_1540247473.html","title":"Bush find their voice in Britain on new album","title_page":"Bush find their voice in Britain on new album | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BUSH: Black And White Rainbows (Zuma Rock)\nRating:\nGavin Rossdale’s Bush were the ugly ducklings of the Britpop era. At a time when Blur and Oasis were refurbishing the Swinging Sixties, they sought inspiration from the early Nineties – and their records were greeted with indifference in the UK as a result.\nIt was a different story in America, where the quartet’s debut album Sixteen Stone reached the Top Five and its 1996 follow-up, Razorblade Suitcase, topped the charts.\nToday, six years after their return from an eight-year sabbatical, they are still a draw in the States, but remain a band seemingly out of time over here.\nWith its potent hooks and arena-ready choruses, Black And White Rainbows could mark a new beginning for Bush\nMaybe the stars are now aligning differently, though. Rossdale, 51, has raised his profile by appearing as a judge on The Voice UK. And, with this seventh album, Bush have come up with a record designed to bring some overdue UK success.\nWritten and produced by Gavin, former husband of US singer Gwen Stefani, Black And White Rainbows retains hints of Bush’s musical roots. The guitars of Rossdale and Chris Traynor often mesh together to recreate the thick slabs of hard-rock noise that were a hallmark of grunge pioneers Nirvana and Pearl Jam.\nBut they are edging forward, too. Rossdale’s ability to deliver a catchy hook has often been submerged by the barrage of riffs behind his rasping vocals. The polished, measured arrangements here give his tuneful songs room to breathe.\nMad Love is fuelled by a Coldplay-sized refrain. All The Worlds Within You is a slow-burning ballad with acoustic flourishes. Toma Mi Corazon (‘It Takes My Heart’) is a full-tilt rocker.\nBlack And White Rainbows has 15 tracks lasting almost an hour\nWith its 15 tracks lasting almost an hour, there is inevitably some filler, with Dystopia and Ravens, despite rousing choruses, both routine grunge workouts.\nThere are references aplenty to the collapse of Rossdale’s 14-year marriage to Stefani. Having met when Gwen’s band No Doubt supported Bush on a US tour in 1996, the pair married in 2002 after Gavin proposed on New Year’s Day. Despite raising three young sons together, the couple divorced 11 months ago, and songs such as Mad Love address the ensuing turmoil with a sense of regret.\nIf Stefani’s 2016 solo album, This Is What The Truth Feels Like, was a feisty response, Rossdale’s bleak take on things has more in common with Coldplay’s Ghost Stories – a lovelorn record on which Chris Martin sang about his ‘conscious uncoupling’ from another famous American, Gwyneth Paltrow.\nLost In You finds Gavin admitting that a past relationship haunts him, although he appears to accept his fate on The Edge Of Love – ‘I always felt we both knew it was the end of things’.\nHe also expresses a desire to move on with his life on People At War, which finishes with the observation that ‘every ending is a start’.\nWith its potent hooks and arena-ready choruses, Black And White Rainbows could mark a new beginning for Bush, too.\nLAURA MARLING: Semper Femina (More Alarming)\nVerdict: Accomplished folk-pop\nRating:\nSemper Femina finds Laura Marling exploring complex emotions on songs that garnish her folk foundations\nLaura Marling has grown in stature in the decade since she emerged as Hampshire’s teenage answer to Joni Mitchell. Once ejected from one of her own gigs for being under-age, she has matured into a skilful songwriter who divides her time between L.A. and London.\nHaving amassed a considerable body of work – this is her sixth album in nine years – she has fully found her voice. The intimate, accessible Semper Femina finds her exploring complex emotions on songs that garnish her folk foundations with electric blues and West Coast pop.\nMarling, 27, began composing Semper Femina (Latin for ‘always a woman’) as if she were a man writing about the opposite sex, but broadened the concept to embrace songs addressing friendship and sexuality from a female standpoint.\nThe acerbic tone of 2015’s Short Movie resurfaces on Wild Fire – ‘I know your mama’s kinda sad, and your papa’s kinda mean’. Laura’s barbs are tempered by the conversational ease of her lyrics, although the Mid-Atlantic accent adopted on that particular song is irritating.\nThe arrival of a new producer helps. Blake Mills, who has worked with John Legend, focuses on the acoustic essentials here, while his clever use of strings adds unexpectedly soulful touches to another accomplished effort.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299578/Bush-voice-Britain-new-album.html"}
