{"authors":["Michelle Moons"],"date_download":"2018-10-30 21:34:43","date_modify":"2018-10-30 21:34:43","date_publish":"2016-07-14 12:44:04","description":"Republican Platform committee member Maine State Senator Eric Brakey put forward an amendment in the National Security subcommittee to declassify 28 pages of 9/11 Commission report in the National Security subcommittee. He told Breitbart News that he consulted with and did so at the request of North Carolina congressman Walter Jones. | Politics","filename":"data/vaneerConsumption/BushNationalSecurityStafferLeadsEffortThatKilledDeclassificationof28Pagesof911Report.json","image_url":"https://media.breitbart.com/media/2016/04/GettyImages-120040967.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_07_14__1540935283.html","title":"Bush National Security Staffer Leads Effort That Killed Declassification of 28 Pages of 9/11 Report","title_page":"Bush National Security Staffer Leads Effort That Killed Declassification of 28 Pages of 9/11 Report | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A former Bush administration adviser led the effort to kill a Republican platform amendment that would have called for the declassification of the 28 pages redacted from Congress’ 9/11 Commission report which reveals details of the 2001 Islamic terror attacks on the United States.\nRepublican Platform committee member Maine State Senator Eric Brakey put forward an amendment in the National Security subcommittee to declassify 28 pages of 9/11 Commission report in the National Security subcommittee. He tells Breitbart News that he consulted with and did so at the request of North Carolina congressman Walter Jones.\nMembers of the subcommittee voted to advance the amendment to a preliminary version of the platform to be considered in Tuesday’s meeting of the RNC Platform committee. It was a very close vote, Brakey said, but the majority of the subcommittee voted to advance it.\nThe original amendment proposed for insertion in the platform, provided to Breitbart News by Senator Brakey, reads as follows:\nAs the nation continues to confront terrorism at home and abroad, the American people are being denied access to information that can provide vital insight into the funding of Islamic extremism: 28 classified pages from a 2002 joint congressional intelligence inquiry into the September 11 attacks. A former senator who co-chaired the inquiry says the pages “point a very strong finger at Saudi Arabia as being the principal financier” of the 9/11 attacks and that, by shielding the kingdom from consequences for its actions, the redaction has encouraged its continued sponsorship of extremism and paved the way for the rise of ISIS. President Obama twice promised 9/11 family members he would release the pages, which could be invaluable in their pursuit of justice in the courtroom. However, his administration has refused to declassify them, even in the face of bipartisan support for their release that includes former 9/11 Commission members and 73 current representatives and senators. These pages must be released. As Thomas Jefferson said, “An enlightened citizenry is indispensable for the proper functioning of a republic. Self-government is not possible unless the citizens are educated sufficiently to enable them to exercise oversight.\n“I think that people have a right to know. What really convinced me that [the pages] should be public was just the conviction of members of congress that I really respect and have read these 28 pages and have expressed that Americans have the right to know,” Brakey told Breitbart News on Wednesday. “I think there’s information in there that will affect our knowledge of history on what really happened that day.”\nAfter the amendment passed in subcommittee, Brakey says that Trump staff approached him asking for a sentence to be removed from the original version.\nIn April, Republican presumptive presidential nominee Donald Trump said that the 28 pages should be available to the public. “I think I know what it’s going to say,” he said, “having to do with Saudi Arabia and Saudi Arabia’s role on the World Trade Center, and the attack.”\nThe intended final version reads as follows:\nAs the nation continues to confront terrorism at home and abroad, the American people are being denied access to information that can provide vital insight into the funding of Islamic extremism: 28 classified pages from a 2002 joint congressional intelligence inquiry into the September 11 attacks. President Obama twice promised 9/11 family members he would release the pages, which could be invaluable in their pursuit of justice in the courtroom. However, his administration has refused to declassify them, even in the face of bipartisan support for their release that includes former 9/11 Commission members and 73 current representatives and senators. These pages must be released. As Thomas Jefferson said, “An enlightened citizenry is indispensable for the proper functioning of a republic. Self-government is not possible unless the citizens are educated sufficiently to enable them to exercise oversight.\nThe intended final version was not voted on as the move in the general Platform committee meeting struck the section entirely from the platform.\nIn the general Platform Committee hearing, co-chair of the National Security subcommittee Stephen Yates of Idaho moved to strike the section from the proposed platform.\nYates said:\nThis is language that addresses Saudi Arabia and 9/11. I give a little bit of context, I served for the first five years of the Bush administration as Deputy National Security Advisor to Vice President Cheney. I was in the White House before, during and after 9/11. Was evacuated out, took most of the day to be able to communicate with my family to just let them know that I was alive. Many of us lost friends and loved ones in that tragedy; however, we should not release 28 pages of classified information from a congressional intelligence inquiry into 9/11 attacks. Releasing raw intelligence data that raises the specter that our intelligence gathering maybe compromised. Dangerous, and pose a danger to our own national security. This information mainly consists of rumors from third parties that is totally uncorroborated. It is unfair to the individuals involved to allow the speculation to be treated as fact simply because it’s in a secret government report. If Saudi officials were complicit in 9/11 that is a matter for both governments to resolve at the highest levels. I strongly urge the committee to withdraw this segment.\nA delegate from New York seconded the motion to withdraw and added, “I would wholeheartedly agree with what my colleague from Idaho just stated.”\nPresident George W. Bush’s administration ordered the pages withheld during his term as president citing a need to protect intelligence sources and methods. Rep. Jones has criticized the Bush administration’s relationship with the Saudis.\nBrakey read a list of the Republican congressmen who have signed on calling for the declassification of the 28 pages:\nRep. Justin Amash (MI)\nRep. David Bratt (VA)\nRep. Mike Coffman (CO)\nRep. Kevin Cramer (ND)\nRep. Scott DesJarlais (TN)\nRep. John J. Duncan, Jr. (TN)\nRep. Chris Gibson (NY)\nRep. Louie Gohmert (TX)\nRep. Walter B. Jones Jr. (NC)\nRep. Cynthia Lummis (WY)\nRep. Thomas Massie (KY)\nRep. Tom McClintock (CA)\nRep. Mick Mulvaney (SC)\nRep. Randy Neugebauer (TX)\nRep. Scott Perry (PA)\nRep. Joe Pitts (PA)\nRep. Bill Posey (FL)\nRep. Tom Reed (NY)\nRep. Dana Rohrabacher (CA)\nRep. Ileana Ros-Lehtinen (FL)\nRep. Matt Salmon (AZ)\nRep. Mark Sanford (SC)\nRep. Austin Scott (GA)\nRep. Glenn Thompson (PA)\nRep. Dave Trott (MI)\nRep. Ted Yoho (FL)\nRep. Ryan Zinke (MT)\n(Brakey mispoke saying Mike Zinke in the hearing, but identified Zinke as the representative from Montana)\n“The American people, the victims of 9/11 have the right to know about the funding that was involved in this,” said Brakey in the hearing.\nIn June a group of family members and survivors of the September 11 attacks wrote a letter urging President Barack Obama to release the 28 pages.\nA Vermont delegate rose in support of striking the addition of Brakey’s amendment, “It is not our job to release classified information from this Platform committee.”\nA West Virginia delegate called for a vote.\nVoting took place and the new section calling for declassification of the 28 pages was removed. In the hearing the section was referred to as page seven, line 33 through page eight line 7.\nAfter the vote Brakey told Breitbart News, “Hopefully if there are foreign governments or people related to those governments that have participated in funding the attacks, families and victims of 9/11 can get justice it will give them some legal standing.”\nBrakey was the 2012 Maine State Director for the Ron Paul campaign. He recalled being among those involved in a contentious 2012 floor fight over a rules change that favored Mitt Romney and slighted Ron Paul supporters.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/politics/2016/07/14/bush-national-security-staffer-leads-effort-killed-declassification-28-pages-911-report/"}
