{"authors":["Lyndsay Hemphill"],"date_download":"2018-10-30 23:39:17","date_modify":"2018-10-30 23:39:17","date_publish":"2016-12-06 00:00:00","description":"Come work with BI's finance team!","filename":"data/vaneerConsumption/BusinessInsiderishiringaneditorialfinanceintern.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_business-insider-hiring-finance-intern-2016-12_1540942757.html","title":"Business Insider is hiring an editorial finance intern","title_page":"    Business Insider is hiring an editorial finance intern - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Are you a financial and political news junkie? Apply here.\nSpencer Platt/Getty Business Insider is looking for a fun finance geek to join the team this winter as a paid intern.\nBusiness Insider's finance vertical covers financial professionals and everything they do. A basic understanding of what Wall Street's banks, private equity firms, hedge funds, and other firms do is key, as is an understanding of global financial markets.\nThis candidate should be ready to write about what Wall Streeters need to know, and also about what they want to know.\nStrong communications skills are a must, and the ability to separate the boring from the interesting is important.\nOur interns are an integral part of our team, and many of our current writers and editors started as interns. We seek out self-starters and people who are enthusiastic about collaborating with other reporters, video producers, social media editors, and other team members.\nAPPLY HERE with your resume and cover letter.\nThis is a full-time internship position at our Flatiron headquarters in New York City, with flexibility on start and end dates. Our internship program runs for approximately six months.","url":"https://www.businessinsider.com/business-insider-hiring-finance-intern-2016-12"}
