{"authors":["Neil Munro"],"date_download":"2018-10-30 19:05:28","date_modify":"2018-10-30 19:05:28","date_publish":"2018-08-25 03:45:21","description":"Trump, GOP, Need More College-Grad Votes","filename":"data/vaneerConsumption/BusinessAsksforMoreForeignCollegeGradEmployeesBeforeNovemberElection.json","image_url":"https://media.breitbart.com/media/2018/08/GettyImages-85402362.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/midterm-election_2018_08_24__1540926328.html","title":"Business Asks for More Foreign College-Grad Employees Before November Election","title_page":"Business Asks for More Foreign College-Grad Employees Before November Election | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Brand-name American companies are lobbying the government to import more visa-workers for a wide variety of good white-collar jobs, even though the companies’ investors are earning record profits while American graduates’ salaries are barely growing.\nThe cheap-labor demand from U.S. and Indian outsourcing companies was delivered by the Business Roundtable to Secretary Kirstjen Nielsen at the Department of Homeland Defense. Nielsen’s chief of staff formerly lobbied for two of the Indian firms who signed the letter.\nChief of Staff Chad Wolf worked as a lobbyist at Wexler & Walker Public Policy Associates, and his clients included the Indian software-industry association, NASSCOM, or the National Association of Software & Services Companies. When Wolfe was picked by Nielsen, he promised to recuse himself from any dealings with his former clients, which included Indian companies on the Roundtable letter, Cognizant and Wipro.\nThe Roundtable signers also include CEOs at IBM, Mastercard, Johnson & Johnson, JPMorgan Chase & Co., PepsiCo, Visa, and Verizon, as well as the progressive CEOs of Apple and Salesforce.\nThe CEO of Internet giant Cisco Systems also signed, even though his company is reportedly facing an investigation from the Department of Labor for its alleged discrimination against American college graduates by favoring cheap Indian software programmers.\nThe Washington Post reported in April:\nThese companies and others find themselves sitting on an Everest of cash, thanks to profits pouring in faster than they can find productive ways to spend it. The profits have built up in recent years, aided by low borrowing costs, rapidly advancing technology that has reduced overhead and boosted margins, and international trade that has allowed offshore production of goods at bargain prices.\nThe signatory list also includes companies which import blue-collar labor, such as Marriott International and Tyson Foods,\n“The authors of this correspondence are among the All-Star team of abusers of cheap-labor work visas who mocked and ridiculed Donald Trump all during the election,” said Robert Heath, a programmer now lobbying to block a pending congressional plan to expand the inflow white-collar visa-workers. He continued:\nDisenfranchised U.S. STEM [Science, Technology, Engineering, and Math] workers were and are among the most passionate Donald Trump supporters. US STEM workers continue to hope that Donald Trump, a man that prides himself on fulfilling his campaign pledges will do so with his promised support of disenfranchised US STEM workers.\nThe November election is fast approaching, and Trump is likely to gain at the ballot box if he rejects the CEOs’ demand for more cheap college-graduate labor.\nThe MyVisaJobs.com site displays government data showing how the two Indian companies have asked for thousands of visas to bring in college-graduate replacement workers, and thousands of green cards to convert their home-country visa-workers into citizens.\nThe site also shows how American companies, hospitals, and universities are trying to outsource thousands of jobs in the healthcare sector:\nThe Roundtable letter was covered favorably, dutifully, or deferentially by the establishment press, even though media outlets also lament the slow growth in college-graduate salaries, the huge scale of college debt, and the growing gap between wealthy and the middle-class.\nReuters outsourced the task of covering the letter to an Indian reporter in India, who unskeptically described the business claim: “Reporting by Ankit Ajmera in Bengaluru.”\nThe Roundtable letter prodded Nielsen to reverse the pro-America reforms now being rolled out by her U.S. Citizenship and Immigration Services agency, run by Francis Cissna.\nIn a USCIS response to the Roundtable letter, USCIS spokesman Michael Bars said:\nWe are committed to upholding our nation’s immigration laws as passed by Congress. The administration has been relentlessly pursuing necessary immigration reforms that move towards a merit-based system. USCIS is committed to reforming employment based immigrant and non-immigrant immigration programs so they benefit the American people to the greatest extent possible and will continue adjudicating all petitions, applications and requests fairly, efficiently, and effectively on a case-by-case basis to determine if they meet all standards required under applicable law, policies, and regulations.\nThe business group argues that Cissna’s reforms are changing the visa-worker rules “in the middle of the [visa] process,” and are ending the award of work permits to the 100,000 spouses of the visa-workers:\nOn behalf of the CEO members of Business Roundtable, we write to express our serious concern about changes in immigration policy that are causing considerable anxiety for many thousands of our employees while threatening to disrupt company operations. Due to a shortage of green cards for workers, many employees find themselves stuck in an immigration process lasting more than a decade. These employees must repeatedly renew their temporary work visas during this lengthy and difficult process. Out of fairness to these employees — and to avoid unnecessary costs and complications for American businesses — the U.S. government should not change the rules in the middle of the process. Unfortunately, U.S. Citizenship and Immigration Services (USCIS) has issued several policy memoranda over the past year that will do just that, resulting in arbitrary and inconsistent adjudications.\nCissna’s reports are intended to clarify many ambiguities that have allowed companies free rein in importing workers, even for outsourcing contracts that have not yet been drafted. For example, Cissna’s reforms allow officials to reject incomplete visa-applications instead of being required to ask for more information, to deny requests by companies which do not explain why the visa-worker is needed for unidentified future work when Americans can do the work, to schedule expired-visa workers for repatriation, and to start counting the number of days that foreign students overstay their visas.\nCissna is also ending President Barack Obama’s policy of providing work-permits to the spouses of H-1B visa-workers.\nThese reforms are a direct threat to the companies’ investors because they are already forcing up salaries for H-1B workers. As the reform are rolled out, they are also likely to nudge up salaries for American college-graduates, taking money directly out of the hands of investors.\nNationwide, companies have imported a white-collar workforce of roughly 1.5 million college graduates. None of these workers are immigrants, and most have multi-year work permits under several programs, such as the H-1B, L-1, OPT or J-1 programs. But 400,000 workers are have gotten conditional approval as immigrants which allow the visa-workers to stay in the U.S. for many years until they get green cards.\nThe huge population of resident visa-workers is roughly equivalent to two years’ production of skilled graduates from Americans business, healthcare, science, software, engineering and architecture departments. That oversupply helps explain why salaries for college-grads are growing slower than wages for blue-collar workers:\nAdvocates for Americans scoffed at the CEO complaints.\n“I find it amazing that these employers of temporary foreign workers are outraged that the Department of Homeland Security is treating these workers as temporary foreign workers,” said Rosemary Jenks, policy director for NumbersUSA. “The whole point of guest worker programs is to fill short-term gaps, not to permanently give away American jobs to cheap foreign labor.”\n“These big shots were spoiled under the Obama administration because they repeatedly got their way,” said Jessica Vaughan, policy director at the Center for Immigration Studies. She continued:\nNow they feel entitled to the same deference and are trying to throw their weight around to get it. They should not get their way. Their employees came as temporary workers. They are not entitled to stay permanently, no matter what their employers promised them in order to get them to accept substandard salaries and working conditions … They couldn’t care less about the effect of these policies on the US workers who once did these jobs, or about the prospects for newly minted American workers who could do these jobs.\nVaughan is skeptical that Nielsen will reject the Roundtable’s demands:\nWhat remains to be seen is whether the DHS front-office staffers who are eager to do the bidding of these corporations will have the upper hand over the Trump administration appointees who were put in charge to prevent this kind of sell-out of American jobs.\nThe Roundtable document also hides the close ties between U.S. companies the Indian outsourcing companies which provide them with a huge volume of visa-workers, said Stephen Pushor, a former software worker who is lobbying against the visa-worker programs. The Roundtable letter “is an act of social selfishness and greed,” he said, adding:\nThe memo is yet another example of corporate lobbying and malfeasance directed in favor of the cheap indentured servant labor conditions that bring huge profits and windfalls at the expense of American Information Technology, Medical and STEM professionals who are struggling to find a career amid the flood of cheap foreign labor.\nLobbyists for companies on the Roundtable letter have repeatedly demanded more cheap-labor college-graduates\nOn August 7, Trump met with more than 10 CEOs from Boeing, Mastercard, Pepsico, Honeywell and other major companies who demanded more visa-workers. Several of those CEOs signed the Roundtable letter to Nielsen. In April 2018, Roundtable-signer Jamie Dimon, the CEO of JPMorgan Chase & Co. bank urged that “those who get an advanced degree in the United States should receive a green card along with their diploma … We need these skilled individuals in America.”\nThese cheap-labor demands have repeatedly been endorsed by GOP legislators — even though few GOP legislators actually promote legislation which pushes their college-graduate voters out of jobs. For example, Ohio Rep. Steve Stivers, the chairman of the National Republican Congressional Committee, told CNBC in August that:\nI think we should bring in people in the high-tech fields. I actually also believe that when [foreign students] graduate from one of the [university] schools in my district … we should staple a work visa to their diploma.\nStivers is supposedly responsible for helping the House GOP keep its majority in the 2019 midterm elections, where a lack of support from college-graduates could flip the House to the Democratic Party.\nOn July 25, GOP Rep. Kevin Yoder added a “country cap” amendment to the 2019 DHS budget that would open up a fast-track to green cards for up to 400,000 Indian, Chinese and Filipino visa-workers who have been working and waiting many years in the immigration line. Yoder’s plan would allow the Roundtable companies to annually offer up to 140,000 green cards to their Indian and Chinese visa-workers if they agree to take Americans’ white-collar jobs at low wages for several years. Yoder said July 25:\nMr. Chairman, that is discriminatory, it is wrong, it is unjust, and we have a chance here today in this committee in a bipartisan way to put a stop to that, to make this a first-come, first served basis and to quit this horrible discriminatory practice.\nYoder’s H.R. 392 “country cap” measure is opposed by Pushor, Heath and by pro-American immigration-reform groups.\nYoder’s rules-changing legislation is backed by the Roundtable, according to the letter, which said the “Business Roundtable continues to work with Congress to reduce the green card backlog.” Yet the letter also told Nielsen that the “U.S. government should not change the rules in the middle of the process.”\nWhite-collar salaries have lagged blue-collar salaries in recent years, according to June 2018 by the Conference Board. But stock values for major companies have risen at three times faster than salaries, at roughly 7.5 percent a year, or 5.3 percent after inflation — partly because of the reduced salaries. So $100 invested in the 2002 Standard & Poor’s Index would have grown to $231 in June 2018.\nFour million Americans turn 18 each year and begin looking for good jobs in the free market — but the government provides green cards to roughly 1 million legal immigrants and temporary work-permits to roughly 3 million foreign workers.\nThe Washington-imposed economic policy of economic growth via immigration shifts wealth from young people towards older people by flooding the market with cheap foreign labor. That process spikes profits and Wall Street values by cutting salaries for manual and skilled labor offered by blue-collar and white-collar employees. The policy also drives up real estate prices, widens wealth-gaps, reduces high-tech investment, increases state and local tax burdens, hurts kids’ schools and college education, pushes Americans away from high-tech careers, and sidelines at least 5 million marginalized Americans and their families, including many who are now struggling with opioid addictions.","url":"https://www.breitbart.com/midterm-election/2018/08/24/business-wants-more-visa-worker-college-grads-before-november-election/"}
