{"authors":["Neil Munro"],"date_download":"2018-10-30 19:05:44","date_modify":"2018-10-30 19:05:44","date_publish":"2018-09-08 04:35:04","description":"'We Certainly Can't Let it Get to that Point,' Says Pro-Trump Lobbyist","filename":"data/vaneerConsumption/BusinessFirstGOPPreparesPostElectionBorderWallTrapforTrump.json","image_url":"https://media.breitbart.com/media/2018/04/Trump-Nielsen-Border-Wall-MANDEL-NGANAFPGetty-Images.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_09_07__1540926344.html","title":"Business-First GOP Prepares Post-Election Border-Wall Trap for Trump","title_page":"Business-First GOP Prepares Post-Election Border-Wall Trap for Trump | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Business-first GOP leaders are walking President Donald Trump into a post-election trap where he will be forced to approve more wage-cutting visa-worker programs if he wants an extra $3.4 billion for his border wall.\nThe cheap-labor legislation which is in the draft House appropriations bill would dramatically expand several visa-worker programs which suppress blue-collar wages and white-collar salaries. Before the election, Trump can pressure House Speaker Paul Ryan to drop those unpopular wage-cutting programs. But after the election, GOP leaders can offer extra border-wall funds to pressure Trump into accepting the cheap-labor programs.\nThe House’s 2019 spending bill, drafted by appropriations subcommittee chairman Rep. Kevin Yoder, includes $5 billion for roughly 200 miles of border wall in 2019. That is $3.4 billion above the $1.6 billion offered by Senate Republicans.\nBut Yoder’s bill also betrays Trump voters by giving business groups another huge inflow of cheap white-collar and blue-collar immigrant labor. Business donors want those cheap-labor programs to reverse the impact of Trump’s popular low-immigration policies which are pushing wages up before the 2018 and 2020 elections. In August, for example, voters’ wages rose by 2.9 percent above 2017 levels as companies competed for workers and pushed up productivity.\n“That is why the administration needs to be engaged with Congress and insist that the Yoder provisions are either be stripped in the Rules Committee or by a manager’s amendment,” before the House approves Yoder’s plan, said RJ Hauman, policy director at the Federation for American Immigration Reform. The President, Hauman added:\ncan’t let it get to that point, and we certainly can’t let it get to that point as well, because we fear the president will sign something that does contain that border wall funding despite the other things in it that fly in the face of his agenda.\nWatch Breitbart News’ entire interview with RJ Hauman:\nTrump is accepting the establishment’s promise to push for border-wall funding after the election — when the GOP will have the most leverage to make him also accept Yoder’s cheap-labor programs.\nOn Thursday, Trump told Fox News that he will delay the dispute over homeland security funding until after the election:\nWe need Republicans elected in the midterms … We’re going to do it immediately after the election. I have the commitment from [Senate Majority Leader] Mitch McConnell, from [Speaker] Paul Ryan, from everybody. We do it right after the election where hopefully, frankly, it’ll be easy because we’ll have more Republicans, not less.\nOn Tuesday, Trump told the Daily Caller:\nPOTUS: “I don’t like the idea of shutdowns. We’ve already started the wall. We’ve gotten $3.2 billion for the wall [in the 2016 and 2017 budgets]. We’ve done a lot of work on the wall … Border security is a very important issue. I don’t see even myself or anybody else closing down the country right now.” THE DAILY CALLER: “Maybe after the midterms?” POTUS: “I think that after midterms, we’re going to have a very serious discussion because we want border security, we have to have it. It’s going to be a big part of — it is a big part of this country. We have to have border security.”\nTrump has already gotten $3.2 billion for the border wall in 2016 and 2017.\nOn Wednesday, Trump again touted border security when he was asked about the fall budget battles:\nQ Can you rule out a shutdown? THE PRESIDENT: If it happens, it happens. Q If it happens, it happens? THE PRESIDENT: If it happens, it happens. If it’s about border security, I’m willing to do anything. We have to protect our borders. If we don’t protect our borders, our country is not going to be a country. So if it’s about border security, I’m willing to do what has to be done. Thank you very much.\nTrump’s emphasis on border security — but not immigration reforms and voters’ wages — came after the Wednesday meeting with top GOP leaders. Those leaders included Ryan, Senate Majority Leader McConnell, Texas Sen. Jon Cornyn, and Trump’s budget director, Mick Mulvaney. All four are business-first Republicans, and all are pressuring Trump to postpone a pre-election fight that would kill Yoder’s cheap-labor provisions. “We still are in favor of the wall, we still want to get funding for the wall, but we think the best time to have that discussion is after the election,” McConnell said, according to the Washington Post.\nYoder put the political trap into the House Appropriations Committee’s 2019 DHS budget on July 25.\nYoder’s 2019 legislation includes $5 billion for a border fence, which is enough to build roughly 200 miles of border fence. In contrast, the Senate’s 2019 DHS budget includes $1.6 billion for border-wall funding, which is enough to build roughly 100 miles of tall and tough fence.\n“That $5.5 billion or so in border funding gave him gave cover to insert all these ridiculous egregious provisions that still are in the bill,” said FAIR’s Hauman.\nThe provisions are a politically lethal cocktail of cheap-labor programs, migration-boosting loopholes and agency cutbacks.\nOn August 29, Yoder reiterated his support for the four cheap-labor programs:\nWe end the per-country cap that has created an almost million-person, hundreds and hundreds of thousands, of particularly Indian and some Chinese [white-collar visa-workers] that might take decades to get a green card because of a discriminatory policy that puts them at the back of the line on a country cap. We fixed that in our bill … We fixed the H-2B visa program which is the seasonal workers [and] our ag [visa-]workers, H-2A. So to me that is showing leadership on the issues, saying look, we need better border security, we have to stop human trafficking and drug trafficking from illegally coming into our country while at the same time focusing on how we can acknowledge that immigration, legal immigration, is a critical part of our economy and part of our cultural diversity … We put a prohibition against family separations — that’s in our bill. Part of the Dream Act, in our bill, saying you can’t deport Dreamers, that’s in my bill.\nYoder’s bill also defunds any action by border officials to implement Attorney General Jeff Sessions’ successful asylum reforms, although Yoder has hinted he may drop the curbs on Sessions’ asylum reforms.\nYoder’s bill also deep-sixed Trump’s requests for extra enforcement agents and detention beds. For example, it rejected Trump’s request for 50,000 detention beds which are needed to minimize the catch-and-release of migrants. Instead, the committee only funded 44,000 beds.\nYoder’s four-part cheap-labor plan was endorsed by nearly all GOP members on the House appropriations committee and likely was backed by GOP leaders.\nThe “country caps” outsourcing bill was endorsed by Amazon, IBM and the billionaire founders of FWD.us, partly because it helps many investors continue replacing American graduates with cheap foreign graduates. Yoder says his bill would end discrimination, but it is backed by many business lobbyists and critics say it will boost discrimination against Americans.\nTrump’s congressional relations team failed to block Yoder’s surprise provisions and has done little or nothing to get them removed from the pending bill, sources tell Breitbart News.\nYoder also hid his plan when Trump invited him to fly on Air Force One to Kansas on July 24.\nThe next day, the only opposition came from Attorney General Jeff Sessions who called Yoder’s aides to urge him to drop some of the measures.\nYoder’s outsourcing plan has also been ignored by the anti-Trump, pro-migration establishment media. The silence exits even though many journalists have friends and family members who have lost salaries, opportunities, and jobs to the resident population of 1.5 million white-collar H-1B, L-1, J-1, H4 EAD, OPT, and TN visa-workers.\nMost of Trump’s conservative allies in the Hill are not moving against Yoder’s provisions, and prefer to talk generalities about funding a border wall. Politico reported:\nHouse Freedom Caucus Chairman Mark Meadows told reporters Wednesday morning that “at this point, we need to fund the government and we need to have a deliberate plan on how we secure our border.” Meadows said he didn’t see such a plan emerging this month, “So having that debate over the next three months is probably more prudent than trying to have it in the next week and a half.” “I really believe that the majority of our effort will be spent on border security after November versus in October,” Meadows said, who added he’s conveyed his message to the White House.\nBut conservative Rep. Jim Jordan may push for a pre-election fight over the border wall.\n“What was probably the single biggest promise Republicans made to the voters in 2016? It was the border security wall, so let’s get that done here before the end of the fiscal year,” Jordan told Fox & Friends Sept. 5. He added:\nWe increase our chances of keeping the majority if we do a simple thing: do what we promised the voters what we were going to do. And again, this was probably the central thing that the people elected Republicans to do is secure our border, build the border security wall, so let’s get it done on this spending bill.\n.@Jim_Jordan: We can increase our chances of keeping the majority if we fulfill our promise to the voters and secure our border pic.twitter.com/5FivslGmvw — FOX & friends (@foxandfriends) September 5, 2018\nSome of Trump’s reputed allies in the House want Trump to accept Yoder’s wall-and-outsourcing package. Politico reported:\n“The polls showing Republicans maintaining control of the House are not optimistic, and I don’t believe a shutdown helps,” said group member Joe Barton of Texas, who is retiring this year. “So I would not be supportive of anything that results in a shutdown or anything of that nature — and I’m usually one of the more aggressive individuals willing to confront excessive spending and the Senate.” “I have voted for wall funding, I think it’s necessary and in the end, after the election, I’m fine with forcing the issue,” echoed group member Andy Harris of Maryland, who’s advocated for a delayed fight as well.\nHarris is the lead sponsor of one of Yoder’s four cheap-labor measures.\nOn Sept. 4, the McClatchy establishment news service reported that Yoder said he “will continue to push for a vote on the bill on its own, but its most likely path to the president’s desk is as a provision in the homeland security budget.”\nYoder’s office did not respond to questions from Breitbart News.\nBut if Trump forces a pre-election border-wall fight, he likely will force GOP leaders to drop Yoder’s very unpopular business-backed four-part cheap-labor plan from his plan to spend $5 billion on the border-wall.\nRyan, Barton and many other GOP legislators are retiring, but few Republicans will defend outsourcing plans in the month before they face the voters.\nMany polls suggest that Yoder’s outsourcing plans are deeply unpopular.\nBusiness groups and Democrats tout polls which prod Americans to declare support for migrants or the claim that the United States is a “Nation of Immigrants.” But the alternative “priority” or “fairness” polls — plus Trump’s triumph in the 2016 election — show that voters in the polling booth put a much higher priority on helping their families, neighbors, and fellow nationals get decent jobs in a high-tech, high-immigration, low-wage economy.\nThose polls also are a problem for Yoder who is facing a tough fight in a Democrat-leaning suburban district where many college-graduate voters likely will oppose his “country caps” plan to outsource more of their jobs to Indian college-graduates.\nIn July, Trump endorsed a shutdown to pressure Democrats to support his border-wall and immigration reforms, such as those he outlined in his Four Pillars program.\nI don’t care what the political ramifications are, our immigration laws and border security have been a complete and total disaster for decades, and there is no way that the Democrats will allow it to be fixed without a Government Shutdown… — Donald J. Trump (@realDonaldTrump) July 31, 2018\nIf Trump blocks the Yoder giveaway, Trump will gain as voters see their wages rising this year and before the 2020 election, Hauman said. “Keep wages rising for Americans,” he said.\n“If you really want to do true border security, it is mandatory E-Verify,” he added. “E-Verify is a wall [because] you will turn off the Number 1 magnet for immigration, which is jobs.”\nSeveral groups of U.S. white-collar professionals, such as U.S. Tech Workers, are trying to rally opposition to the Yoder giveaways.\n.@realDonaldTrump @Dawnnewyorker handed you a letter which intelligently and emotionally tells the truth about outsourcing, offshoring… pic.twitter.com/4iPhp5Q5Pn — Sara Blackwell (@4US_Workers) August 17, 2018\nEach year, four million young Americans enter the workforce — and the government imports 1 million legal immigrants, replenishes the population of roughly 1.5 million white-collar guest workers, and does little to repatriate the resident population of roughly 8 million illegal immigrants.\nOverall, the Washington-imposed economic policy of economic growth via immigration shifts wealth from young people towards older people by flooding the market with cheap foreign labor.\nThat process spikes profits and Wall Street values by cutting salaries for manual and skilled labor offered by blue-collar and white-collar employees. The policy also drives up real estate prices, widens wealth-gaps, reduces high-tech investment, increases state and local tax burdens, hurts kids’ schools and college education, pushes Americans away from high-tech careers, and sidelines at least 5 million marginalized Americans and their families, including many who are now struggling with opioid addictions. Immigration also pulls investment and wealth away from heartland states because investment flows towards the large immigrant populations living in the coastal states.\nContact the reporter here.","url":"https://www.breitbart.com/politics/2018/09/07/trump-faces-ryan-trap-border-wall-funds-wage-raises-for-voters/"}
