{"authors":["Alexander Robertson For Mailonline"],"date_download":"2018-10-23 04:23:42","date_modify":"2018-10-23 04:23:42","date_publish":"2017-03-10 14:33:25","description":"Colin Thomas (pictured) disclosed details of the alleged stalking of Diane Benussi to the board of a company running Birmingham's Liberty Place complex, of which they were both members.","filename":"data/vaneerConsumption/Businessmanharassedlawyeraftertheyfelloutovermoney.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E232DD800000578-0-image-a-61_1489156514069.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301314_Businessman-harassed-lawyer-fell-money_1540268622.html","title":"Businessman harassed lawyer after they fell out over money","title_page":"Businessman harassed lawyer after they fell out over money | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Colin Thomas (shown) disclosed details of the alleged stalking of Diane Benussi\nA businessman has admitted harassing a top divorce lawyer - after alleging she had made up claims of being stalked.\nColin Thomas, 74, disclosed details of the alleged stalking of Diane Benussi to the board of a company running Birmingham's Liberty Place property complex.\nBirmingham magistrates heard that the businessman was a member of the management board and Ms Benussi was the chairperson.\nThey both owned properties at Liberty Place and had fallen out over a money wrangle.\nThe court was told Thomas heard about allegations that Ms Benussi had been the victim of a stalking campaign and later sent emails to other property board members claiming she had made them up.\n'The complainant said in a statement she felt the defendant was intending to expose her private life,' said Shawn Williams, prosecuting.\nDetails sent by Thomas of the alleged campaign included threats against Ms Benussi and her daughter and the sending of items including a used contraceptive.\n'This was a private investigation being carried out by the police,' he said. 'That information had been circulated.\n'She felt sick that people had been told about her private situation as well as deeply embarrassed and humiliated.'\nMr Williams said that, even when told not to have any further contact with Ms Benussi, Thomas continued to send similar emails which treated the allegations in a 'dismissive manner'.\nDetails sent by Thomas of the alleged campaign included threats against Ms Benussi (pictured) and her daughter\nHe said ultimately no further action was taken against the alleged stalker.\nWhen quizzed by police, Thomas said he was aware he was being offensive when sending the emails but wanted to 'get a response'.\nSimon Bailey, defending, said Ms Benussi's running of the management company had caused concern which prompted Thomas to send the emails.\n'Feelings were running quite high within the board. He was not getting the response he wanted to basic questions. That brought forth further frustration,' he said.\nThomas, of Wylde Green, admitted a charge of harassment.\nHe was given a 12-month conditional discharge, ordered to pay £200 compensation and £1,000 costs. He was also banned indefinitely from contacting the victim, other than through solicitors.\nDistrict Judge Joanne Dickens said: 'This is a really serious incident and went on for a period of time.\n'Even if all the things you were saying were true, this is not the way for a person who has the means and ability to seek legal advice to go about it.\n'All you had to do was get legal advice. To make slurs in this fashion is wholly unacceptable.'","url":"https://www.dailymail.co.uk/news/article-4301314/Businessman-harassed-lawyer-fell-money.html"}
