{"authors":["Joshua Caplan"],"date_download":"2018-10-30 18:23:32","date_modify":"2018-10-30 18:23:32","date_publish":"2018-08-07 19:26:06","description":"Business Insider CEO Henry Blodget dismissed concerns of Silicon Valley trampling on free speech by deplatforming Infowars.","filename":"data/vaneerConsumption/BusinessInsiderCEOInfowarsTechPurgeNotaFreeSpeechIssue.json","image_url":"https://media.breitbart.com/media/2018/08/GettyImages-145012052.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2018_08_07__1540923812.html","title":"Business Insider CEO: Infowars Tech Purge Not a Free Speech Issue","title_page":"Business Insider CEO: Infowars Tech Purge Not a Free Speech Issue","title_rss":"NULL","source_domain":"breitbart.com","text":"Business Insider CEO Henry Blodget on Tuesday dismissed concerns of Silicon Valley trampling on free speech by deplatforming Infowars and its founder Alex Jones.\nIn an interview with CNBC, Blodget claimed Apple, Facebook, YouTube, and Spotify weren’t encroaching on Jones’ First Amendment rights by barring him from their platforms — rather, he argued, they were enforcing their terms of service. “Anyone who says it’s a freedom of speech issue, no it isn’t,” Blodget said. “The First Amendment is about your right to be able to say stuff and not be thrown in jail by the government for criticizing the government.”\nBlodget expressed bewilderment with how long technology giants waited to bar Infowars and its founder. “I think actually what’s surprising is it’s taking the platforms this long to actually put their foot down and say, ‘you know what, this is not about freedom of speech, this is a private platform, we do not want this stuff on our network,’” he told CNBC.\nOn Monday, Facebook announced they had unpublished four InfoWars pages from their platform: the Alex Jones Channel Page, the Alex Jones Page, the Infowars Page, and the Infowars Nightly News Page. The embattled technology giant unpublished the pages after InfoWars content was found to have violated its “hate speech and bullying policies.” Google-owned YouTube deleted Jones’ main channel shortly after Facebook removed the pages.\nFacebook claims says the pages were deleted after users flagged InfoWars content that including “dehumanizing language” to“describe people who are transgender, Muslims, and immigrants, which violates our hate speech policies.”\nIn a statement released Sunday evening, Apple said they were removing several InfoWars podcasts, including the outlet’s flagship program: the Alex Jones Show. A spokesperson for the technology giant told far-left BuzzFeed News: “Apple does not tolerate hate speech, and we have clear guidelines that creators and developers must follow to ensure we provide a safe environment for all of our users. Podcasts that violate these guidelines are removed from our directory making them no longer searchable or available for download or streaming. We believe in representing a wide range of views, so long as people are respectful to those with differing opinions.”","url":"https://www.breitbart.com/the-media/2018/08/07/business-insider-ceo-infowars-tech-purge-not-a-free-speech-issue/"}
