{"authors":[],"date_download":"2018-10-22 21:01:10","date_modify":"2018-10-22 21:01:10","date_publish":"2014-05-05 17:38:21","description":"Corporate expense reports are seeing an eye-popping rate of growth from employees using sharing-economy businesses.","filename":"data/vaneerConsumption/BusinessandLuxuryTravelersTurningtoAirbnbTypeLodging.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/421231/140505-airbnb-1424_946f3fc4edd87aaba40bfc0da831b4d1.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_business-luxury-travelers-turning-airbnb-type-lodging-n97416_1540242070.html","title":"Business and Luxury Travelers Turning to Airbnb-Type Lodging","title_page":"Business and Luxury Travelers Turning to Airbnb-Type Lodging","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nMove over couch surfers. The business traveler and luxury jet setters want in on this sharing economy thing and they're willing to pay more for the personalized offerings and unique layouts and locations hotels can't often offer.\nAirbnb, which lets people rent out their homes to travelers, is exploding onto expense reports, said Tim MacDonald, an executive vice president at Concur, which operates a travel and expense system with more than 22 million users globally.\n\"We're seeing Airbnb going from zero two years ago to $1 million this quarter,\" MacDonald said.\n\"It's still small, less than 1 percent,\" MacDonald said of the Airbnb market share. \"It's the rate of growth that is eye-popping.\"\nHotels could soon be pressured by the loss of the business and luxury segment.\n\"With a multibillion-dollar valuation, Airbnb is not going anywhere and is establishing itself as a competitor for hotel demand,\" Jan Freitag, the senior vice president for strategic development at hotel research firm STR, wrote on the company's HotelNewsNow website.\n\"Once millennials, who today use Airbnb for leisure travel, move up in their companies to positions that can dictate travel policy, Airbnb is on its way to being a legitimate accommodations choice for Fortune 1,000 corporations,\" he wrote.\nFor the traditional hotels to compete, they need to make changes. \"It's less about the price and more about the feel,\" he told CNBC.\n\"It's the rate of growth that is eye-popping.\"\n\"No. 1 it has to be about location. It has to be downtown. It's about being part of the community — with art, tasting menus, events, trying to make the lobby more of a social hub than anything ... and make you feel you're part of the town you're in,\" Freitag said.\nThe biggest business-travel opportunity for companies like Airbnb, MacDonald said, is in cities that don't have enough hotel rooms, especially during a high-demand period such as a major tech conference in San Francisco: \"There's a group of us and we want a house in San Francisco during Apple's worldwide developer conference,\" MacDonald said as an example.\n\"There obviously is a real need otherwise business travelers wouldn't be going there,\" MacDonald said.The Concur expense reports show not just Airbnb bookings showing up, but other businesses in the peer-to-peer sector.\n\"I would expect all the sharing economies to see a pickup,\" MacDonald said. \"We know anecdotally that the ride-share companies are seeing tremendous growth in the business sector. It's a changing dynamic in the travel industry.\"\nIt's not just one segment of the business community that's dipping a toe in the waters. \"Anecdotally the tech companies are the earlier adopters of new offerings in the marketplace, but there are cases where even the most established companies are going to find value that can't be replicated by the traditional\" providers, MacDonald said.\nHowever, going the non-traditional route poses some problems for companies. MacDonald said it's harder for companies to keep track of their traveling employees if the they don't book through the traditional methods. And Freitag pointed out that the Airbnb-type properties likely aren't meeting all the regulations hotels must follow when it comes to safety inspections or Americans with Disability Act rules.\n\"The premise for the rising acceptance of Airbnb as a legitimate choice for business travelers is obviously safety and security, and right now Airbnb is one lethal fire away from a public relations nightmare,\" Freitag wrote.\nAirbnb's recent public relations nightmares are more along the lines of renters finding out their apartment was damaged during an orgy, or the state attorney general in New York suing for user data to weed out the bad apples.\nHowever, an Airbnb spokesperson said in a statement that more than 11 million guests have had a safe, positive experience on Airbnb.\n\"We help promote positive experiences through a global trust and safety team available 24/7, authentic reviews, verified profile information, and the $1 Million Host Guarantee,\" the statement said.\nAnother company, Time & Place, offers 250 villa-style rentals in 16 countries and seeks to offer another level of safety by providing a concierge who checks on the property to help the short-term renter as well as make sure rules are being followed about numbers of guests, noise and property safety.\n\"We typically have one concierge for every three to five homes,\" said company founder Mitch Willey. The homes are all inspected and photographed before arrival, sometime with a stocked refrigerator if requested. The concierge will drop by to welcome the guests and help them with any local needs, even if it means navigating a late-night hospital visit.\nWhile Time & Place has liability insurance for slip-and-fall type problems, the homeowners must have their own insurance, Willey said. And since his company is the one collecting payment, it also handles the short-term hotel-type taxes where required. Those complexities have thus far kept Time & Place out of some markets. \"We don't believe we would be legal today in San Francisco, so were not in San Francisco now,\" Willey said.\nWhile the business traveler is using the Time & Place rentals in city centers, it's largest appeal is still with leisure travelers—and even the celebrity set including the likes of Daniel Craig, Greg Kinnear, Meg Ryan, and Morgan Freeman, Willey said.\nBut like the hotels, the smaller luxury renters are keeping an eye on Airbnb as well. Even Airbnb isn't all cheap all the time. Its listings include 17,000 villas and 640 castles in more than 40 countries, an Airbnb spokesperson told CNBC.","url":"https://www.nbcnews.com/business/travel/business-luxury-travelers-turning-airbnb-type-lodging-n97416"}
