{"authors":["Daniel Piotrowski For Daily Mail Australia"],"date_download":"2018-10-22 21:00:55","date_modify":"2018-10-22 21:00:55","date_publish":"2016-01-28 06:18:16","description":"Two businesswomen have expressed outrage after an Australian official asked them to remove their Arabic dresses because they could offend locals in Dubai.","filename":"data/vaneerConsumption/BusinesswomensoutrageafterrespectfulhijabbaninDubai.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/05/30A6EAE900000578-0-image-a-2_1453958024058.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420165_Businesswomen-s-outrage-respectful-hijab-ban-Dubai_1540242055.html","title":"Businesswomen's outrage after 'respectful' hijab ban in Dubai","title_page":"Businesswomen's outrage after 'respectful' hijab ban in Dubai | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Two businesswomen have expressed outrage after an Australian official allegedly asked them to take off their Arabic dresses and put Western clothing on instead because it could offend locals at a Dubai business expo.\nDebbie Black and Sue Lamb said they were just trying to be respectful to local customs when they wore headscarfs and long-sleeved black Abaya dresses to the Arab Health Exhibition and Medical Congress in the United Arab Emirates this week.\n'We're in someone else's environment so we should be respectful to the people that we're in,' Ms Black told Daily Mail Australia. 'It's common sense'.\nSue Lamb (pictured left) and Debbie Black (right), from medical device company Elanra, initially wore abaya dresses to the Dubai exhibition in what they said was a bid to respect local customs\nThe pair (far left and far right) said they wore their headscarfs and abayas while they attended the Gold Coast pavillion at the Arab Health Exhibition and Medical Congress in Dubai this week\nMs Lamb (left) refused to remove her abaya while she appeared at the Gold Coast area of the exhibition. She is pictured with a businessman at the expo\nBut Ms Black and Ms Lamb, senior personnel for healthcare company Elanra, were shocked when an official from the Gold Coast City Council allegedly labelled their 'classy' Arabic clothing 'inappropriate'.\nThe pair claimed a council trade official told them they should ‘only wear Western dress, Western businesswear’.\n'He asked us to leave the stand immediately and go back to the hotel and get changed into Western clothing.'\nThe council funded the space at the exhibition in a bid to provide opportunities for Gold Coast businesses in the Middle East.\nMs Black, who returned to her hotel room to get changed, said the clothing rule had impacted her business: 'It has caused a lot of problems with the Muslim culture.'\n'When I wear my Western suit and I'm on the stand here I will only have people approach me who are mostly people who are wearing Western type clothing.\n'The local Arabic men will not talk to me. As soon as I wear the Abaya and headscarf the local men will come and talk to me.\n'And they will have much different conversations because they can see I'm respecting what their desires are for women to appear like to dress like,' she said.\nHer colleague, Ms Lamb, refused to remove the abaya, saying being asked to remove the ‘classy dress’ was 'discrimination against her personal beliefs'.\nMs Lamb (at the pavilion in her Arabic style dress) said she had the right to wear whatever she chose 'as every Australian woman does'\nMs Lamb said being asked to remove the 'classy dress' represented 'discrimination'\n'I have the right to wear whatever I choose as every Australian woman does, and every woman around the world if they chose to do so,’ she said.\nIn a statement, council spokesman Warwick Sinclair said: 'The Council employee did advise a visiting Gold Coast exhibitor, who was wearing a hijab, that wearing such attire could be considered offensive unless the person was a practising Muslim.\n'The exhibitor obliged and consequently, removed the Hijab and dressed in western attire.\n'This was done out of respect to the religion, not in offense'.\nThe council claimed a second employee of the company 'confirmed to (their official) she was a Muslim'.\n'As such, our City officer apologised for any misunderstanding and advised she could continue to wear appropriate headwear.'\n'No Gold Coast City employee would ever ask a Muslim to refrain from wearing clothing appropriate to their religion.'\nMs Lamb said she was ‘not going to disclose whether she was Muslim or not’ and disputed the council's version of events, calling them 'liars'.\nThe Arab Health Exhibition and Congress is described as the largest healthcare event of its kind in the Middle East. This year's event was held from January 25 to 28.\nThe Gold Coast City Council had funded the area at the exhibition in Dubai","url":"https://www.dailymail.co.uk/news/article-3420165/Businesswomen-s-outrage-respectful-hijab-ban-Dubai.html"}
