{"authors":["Lana Shadwick"],"date_download":"2018-10-30 21:11:03","date_modify":"2018-10-30 21:11:03","date_publish":"2015-11-04 19:08:26","description":"A woman who is a dean at a Texas university claimed she was harassed by cops in her upscale community for ‘walking while black.’","filename":"data/vaneerConsumption/BUSTEDTexasProfessorWhoClaimedHarassedbyCopsforWalkingWhileBlack.json","image_url":"https://media.breitbart.com/media/2015/11/Corinth-Police-Dept-Bland.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_11_04__1540933863.html","title":"BUSTED: Texas Professor Who Claimed Harassed by Cops for ‘Walking While Black’","title_page":"BUSTED: Texas Professor Who Claimed Harassed by Cops for ‘Walking While Black’","title_rss":"NULL","source_domain":"breitbart.com","text":"A woman who is a dean at a Texas university claimed she was harassed by white cops in her upscale community for ‘walking while black.’ The only problem, a police dashcam video tells a different story.\nDorothy Bland was stopped by peace officers in Corinth, Texas, on October 24th while she was ‘power-walking.” Corinth is a city in Denton County and is a suburb of Dallas.\nOn October 28th, The Dallas Morning News published Bland’s story about the police stop.\nOn November 3rd, the Morning News updated Bland’s article with the actual police dashcam video of the encounter.\nIn her Morning News article Bland wrote:\nI was dressed in a gray hooded ‘Boston’ sweatshirt, black leggings, white socks, plus black-and-white Nike running shoes. Like most African-Americans, I am familiar with the phrase ‘driving while black,’ but was I really being stopped for walking on the street in my own neighborhood? Yes. In the words of Sal Ruibal, ‘Walking while black is a crime in many jurisdictions. May God have mercy on our nation.’ Knowing that the police officers are typically armed with guns and are a lot bigger than my 5 feet, 4 inches, I had no interest in my life’s story playing out like Trayvon Martin’s death. I stopped and asked the two officers if there was a problem; I don’t remember getting a decent answer before one of the officers asked me where I lived and for identification. … One officer captured my address and date of birth. I guess I was simply a brown face in an affluent neighborhood. I told the police I didn’t like to walk in the rain, and one of them told me, “My dog doesn’t like to walk in the rain.” Ouch! I didn’t have my I.D., but I did have my iPhone, so I took a picture of the two police officers and the Texas license plate. One of the officers told me I should walk on the sidewalk or the other side of the street for safety’s sake.\nBland, who says she is not related to Sandra Bland, is the dean of the Frank W. and Sue Mayborn School of Journalism, and the director for the Frank W. Mayborn Graduate Institute of Journalism at the University of North Texas. Sandra Bland was the black woman who was pulled over by a Texas Department of Public Safety (DPS) trooper, was arrested, and later died in the Waller County, Texas, jail. Her death was ruled a suicide by a county medical examiner.\nAs can be seen on the police dashcam video, Bland was exercising when police officers drove up behind her. She had on a dark hoodie and long pants and socks and her race or gender is not apparent. The officers told her that she was walking on the wrong side of the street and told her that it was a safety issue and that she was impeding traffic. They told her that a truck had to come to a stop. Bland replied, “I appreciate it.”\nRemember Bland wrote in her article that, “I stopped and asked the two officers if there was a problem; I don’t remember getting a decent answer before one of the officers asked me where I lived and for identification.”\nAfter this, the 57-year-old woman said she wanted a photo of the two officers. The officers did not say anything or do anything to prevent their photos from being taken. Bland wrote in her opinion piece that she also took a photo of the license plate of the patrol car.\nOne of the officers said that the patrol car was behind her for about 20 seconds and she did not even hear them. They told her that she should be walking facing the traffic.\nAs can be seen from the video, the officers were very polite during the entire discussion, and the patrol car was quite a distance from her as it approached her. There is no indication that she was, as she wrote in the opinion piece, stopped for “walking while black.” Bland also claimed that the police vehicle lights were flashing and the sirens were on. The dashcam video refutes that claim.\nThe officers took her name, called it in, and then let her go to continue exercising.\nLana Shadwick is a contributing writer and legal analyst for Breitbart Texas. She has served as a prosecutor and an associate judge. Follow her on Twitter@LanaShadwick2","url":"https://www.breitbart.com/border/2015/11/04/busted-texas-professor-claimed-harassed-cops-walking-black/"}
