{"authors":["Associated Press"],"date_download":"2018-10-22 23:31:38","date_modify":"2018-10-22 23:31:38","date_publish":"2017-03-16 07:19:19","description":"SALT LAKE CITY (AP) - They are supposed to be the best of the best. In many instances, they have looked more like the ugliest of the ugly.Some of the top...","filename":"data/vaneerConsumption/BustedTeamsattopofbracketsfindthemselvesintrouble.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/07/wire-227097-1489649380-476_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319096_Busted-Teams-brackets-trouble_1540251098.html","title":"Busted: Teams at top of brackets find themselves in trouble","title_page":"Busted: Teams at top of brackets find themselves in trouble | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SALT LAKE CITY (AP) - They are supposed to be the best of the best. In many instances, they have looked more like the ugliest of the ugly.\nSome of the top teams in this year's NCAA Tournament have seen their names pop up in off-the-court headlines all too often and for all the wrong reasons.\n-No. 1 seed Kansas has been beset by a series of run-ins with the law.\nFILE- In this Oct. 20, 2016, file photo, Louisville basketball coach listens to a response during a news conference about an NCAA investigation, in Louisville, Ky. Pitino is portraying this season as a comeback story at Louisville--proud of what his team has accomplished after losing two scholarships as part of self-imposed sanctions that also included missing the postseason last year. The coach has accused the NCAA of overreaching for suggesting a possible one-year suspension because he failed to monitor an assistant coach who hired female escorts to party with recruits. (AP Photo/Timothy D. Easley, File)\n-No. 2 seed Louisville is awaiting the latest from the NCAA in a back-and-forth that started when an assistant coach hired female escorts to party with recruits.\n-Another top seed, North Carolina, is still going back and forth with the NCAA on a complicated case centered on athletes taking \"paper classes\" that resulted in inflated grades to keep the players eligible. This story was running hot last year while the Tar Heels were making a run to the NCAA final. It still isn't resolved.\nIf all this feels achingly familiar, it's because it is.\n\"It's not a new problem,\" said Joy Gaston Gayles, a professor at North Carolina State who studies the impact college sports has on its athletes. \"And you often wonder, what's going to be the scandal that breaks the camel's back? Every decade, scandals get worse and nothing really changes.\"\nYou could put together a book about them all, which is exactly what Penn State professor Shaun Harper did recently. Gayles wrote a chapter in \"Scandals in College Sports\" about some of the lowlights of the past 10 years or so.\n\"You see these kinds of things, and for institutions of higher education, it flies in the face of everything higher education is about,\" she said.\nNorth Carolina's irregular-courses scandal has already cost the university - long one of the most respected in the nation - the embarrassment of a 12-month probation levied by the Southern Association of Colleges and Schools. There is still the possibility the NCAA could find the athletics program guilty of \"lack of institutional control,\" which has, for decades, been about the worst conclusion possible within the realm of college sports.\nBut \"institutional control\" can be defined in many different ways outside of the traditional NCAA nomenclature.\nIn the most damaging instance of legal trouble at Kansas this season, police investigated a reported rape at the dorm that houses the basketball team. No charges have been filed.\nFrom there, more headlines kept piling up involving no fewer than four players.\nCoach Bill Self said he's proud his team has rallied despite the steady stream of issues.\n\"I will say that this team has been as focused as any group that I can remember considering all the crap and distractions that this team has listened to and dealt with,\" he said.\nWhile Self paints an us-against-the-world scenario, Rick Pitino is portraying this season as a comeback story at Louisville - proud of what his team has accomplished after losing two scholarships as part of self-imposed sanctions that also included missing the postseason last year. The coach has accused the NCAA of overreaching for suggesting a possible one-year suspension because he failed to monitor the assistant coach who was throwing the recruit parties.\nAnd yet, the biggest story about Pitino this week is that he and his son, Richard, are the first father-son coaching duo in the tournament. The Minnesota program that Richard Pitino now coaches has been beset with problems for decades, the latest of which came last year when Pitino suspended three players for their connection to a sex video that showed up on social media.\nAt Baylor, one of the darkest episodes in college sports history was brought to light again when news surfaced of an upcoming documentary in which former coach Dave Bliss repeats the claim that Patrick Dennehy, who was shot and killed in 2003, was a drug dealer. That documentary will air the night before the Final Four.\nAt East Tennessee State, the Buccaneers are celebrating the reclamation project that is coach Steve Forbes , who was fired from Tennessee and suspended for a year for failing to cooperate with an investigation into then-coach Bruce Pearl's program.\nAll this makes the problems this year at Duke seem almost quaint. Coach Mike Krzyzewski handed down an \"indefinite\" suspension to star Grayson Allen because Allen couldn't stop tripping opponents. The suspension turned out to last one game.\n\"There are things that you see or the public see, and there are things that you all don't see and shouldn't see or shouldn't be talked about, and they're called teachings,\" Coach K explained. \"You don't need to teach out in the public all the time.\"\nBut it's a sport where every move, especially this time of year, is very much out in the open.\n\"There's a lot of value in playing college sports,\" Gayles said. \"But sometimes it gets lost in all the corruption and scandals that take place because this is such a highly commercialized, big-business industry that we're running on college campuses. It's a system that has potential, but we haven't realized it, and I don't know if we ever will because of all the competing interests.\"\n___\nAP Sports Writers Aaron Beard, Dave Skretta, Gary B. Graves and Steve Megargee contributed to this report.\n___\nFor more AP college basketball coverage: http://collegebasketball.ap.org and http://twitter.com/AP_Top25\nFILE - In this Feb. 22, 2017, file photo, Kansas coach Bill Self carries his 13th Big 12 championship trophy following the team's NCAA college basketball game against TCU in Lawrence, Kan. In the most damaging instance of legal trouble at Kansas this season, police investigated a reported rape at the dorm that houses the basketball team. No charges have been filed. From there, more headlines kept piling up involving no fewer than four players. Self said he's proud his team has rallied despite the steady stream of issues. (AP Photo/Orlin Wagner, File)","url":"https://www.dailymail.co.uk/wires/ap/article-4319096/Busted-Teams-brackets-trouble.html"}
