{"authors":[],"date_download":"2018-10-30 18:33:59","date_modify":"2018-10-30 18:33:59","date_publish":"2018-10-30 14:55:30","description":"A regularly congested intersection in Peachtree Corners will get new thru lanes and extended turning lanes, with construction set to begin in the spring, the city said.","filename":"data/vaneerConsumption/BusyGwinnettintersectionwillgetupgradesinspring2019.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Images/medlock.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_busy-gwinnett-in_32c5b1f48fe1dadeea3807d0e9bb03a8__1540924439.html","title":"Busy Gwinnett intersection will get upgrades in spring 2019","title_page":"Busy Gwinnett intersection will get upgrades in spring 2019","title_rss":"NULL","source_domain":"ajc.com","text":"A regularly congested intersection in Peachtree Corners will get new thru lanes and extended turning lanes, with construction set to begin in the spring, the city said.\nWork is expected to begin at the intersection of Medlock Bridge Road and Bush Road in the coming months, according to a city release. The dedicated thru lanes and extended turn lanes are designed to “increase capacity” on the roads, which see more than 25,000 vehicles per day. In order to allow a “continuous flow of traffic,” the right turn lane on Bush Road for northbound traffic traveling toward Ga. 141 will be separated by a raised median, the release says.\nREAD | South Gwinnett football honors fallen police officer on helmets\nUpgraded signals and crosswalks are designed to make it easier for people to cross and walk along the streets, the city said. A pedestrian island will help people who aren’t quite fast enough to beat the light change.\nThe project will be funded by SPLOST funds from both Gwinnett County and the city of Peachtree Corners, the release says. The cost of the project isn’t finalized. Construction will take about 15 months to complete, setting summer 2020 as an approximate end point.\n“We are pleased to be able to announce this partnership with the city of Peachtree Corners on this project,” Gwinnett County Commissioner Lynette Howard said in the release. Howard’s district includes the intersection. “As the county continues to grow, it is paramount that we continue our work on road improvements and pedestrian safety.”\nLike Gwinnett County News on Facebook | Follow us on Twitter and Instagram\nStay up to the minute with breaking news on Channel 2 Action News This Morning","url":"https://www.ajc.com/news/local/busy-gwinnett-intersection-will-get-upgrades-spring-2019/pj4uhwIcnp0o471KYRNF8H/"}
