{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:21:29","date_modify":"2018-10-30 21:21:29","date_publish":"2018-06-18 00:00:07","description":"Headed to the mountains or the beach?","filename":"data/vaneerConsumption/BuyThisThreethingsyouneedforthatbeachormountainrental.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_bu_c619845c9d680a684a01aaeb7b95ac5f__1540934489.html","title":"Buy This: Three things you need for that beach or mountain rental","title_page":"Buy This: Three things you need for that beach or mountain rental","title_rss":"NULL","source_domain":"ajc.com","text":"Headed to the mountains or the beach? Make sure to take these three things to take your getaway game to the next level.\n3-in-1 Brewer Kit from Coffee House by Chef’N\nChef'N 3-in-1 Brewer Kit\nYou know you’ll want coffee, but you never know what kind of coffee making equipment you’ll find at your vacation rental. When was the last time it was cleaned and will you have the right size filters? Ensure the perfect cup of coffee by taking this 3-in-1 Brewer Kit with you. It’s got everything you need to make French press coffee, the perfect pour over or cold brew concentrate. There’s no electricity required, no filters, no pods - just a source of hot water (or room temperature water for the cold brew). The set of nesting glass vessels and the other pieces can go in the dishwasher and everything comes in a compact package about 11 inches high and 8 inches wide so it won’t take up much room in your luggage.\n$79.99. Available online at http://crateandbarrel.com or at http://www.chefn.com/shop/coffee/3-in-1-coffee-brewer-set.html .\nAtlanta-based Coffee Blends from Historic Noir Coffee\nHistoric Noir Coffee\nYou’ve got the coffee maker, now what about the coffee itself? Take a taste of home by carrying a package of Historic Noir Coffee. Ricardo Richardson, Deron Moreman and Christopher Brown grew up in the Atlanta area. They came together to form Historic Noir Coffee and to offer coffee blends that reflect the areas where they grew up - Decatur, West End and Fourth Ward. They source their beans from Fair Trade coffee importers and the blends are packaged as whole beans or ground. We sampled them all and our favorite was the Fourth Ward Blend, a medium dark roast with chocolate notes that really do come through. Decatur is the darkest roast and West End Blend is their light roast. All were delicious. Soon to come, Buckhead Select, a double black espresso.\n$11.99 per 12-ounce package. Available at Sprouts, on Amazon or online at http://historicnoircoffeegroup.com.\nWillie’s Hog Dust Bloody Mix\nWillie's Hog Dust Blood Mix\nOk. You’ve got coffee covered, but no one lives on coffee alone. How about a Bloody Mary or a Michelada? Willie’s Hog Dust Original Bloody Mix (there’s also a hot version) is just one of a long line of products from Willie’s Rubbins of Sumter, South Carolina. The mix is a cumin-forward blend of tomato juice and Willie’s Hog Dust spice mix along with carrots, beets and red pepper. It was great as a classic Bloody Mary but the bottle was even more quickly consumed when we paired the mix with beer. If there had been any left over, it would have been great as a base for gazpacho or to make jambalaya with that fresh seafood you pick up at the local fish shack.\n$9.99 to $14.99 per 32-ounce bottle. Available at Intown Ace Hardware in Decatur and Savi Provisions Buckhead. https://willieshogdust.com .\nRELATED:\nMore must-buy food products\nTry these Made in Georgia food products\nGet a taste of the new fusion revolution with the 2018 AJC Spring Dining Guide: Global Mashup\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook , following @ATLDiningNews on Twitter and @ajcdining on Instagram .","url":"https://www.ajc.com/blog/atlanta-restaurants/buy-this-three-things-you-need-for-that-beach-mountain-rental/g0tthW9hnhtwVcDBDjzgTK/"}
