{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:21:24","date_modify":"2018-10-30 21:21:24","date_publish":"2018-06-25 13:05:11","description":"If someone in your life is setting up housekeeping after a big event like a graduation or a wedding,...","filename":"data/vaneerConsumption/BuyThisThreegiftsforthegradsandgroomsinyourlife.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/06/21/Images/hurom-juicer_20180621172529.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_bu_5c73636b12894721474665b77d26c4ac__1540934484.html","title":"Buy This: Three gifts for the grads and grooms in your life","title_page":"Buy This: Three gifts for the grads and grooms in your life ","title_rss":"NULL","source_domain":"ajc.com","text":"If someone in your life is setting up housekeeping after a big event like a graduation or a wedding, one of these might be just the thing to get their kitchen set up right.\nA Citrus Juicer\nHurom Citrus Juicer\nA well-stocked kitchen needs a tool for juicing citrus. Fresh orange juice for breakfast, fresh lime juice for the sparkling water that powers you through your day, it’s healthy and it’s delicious. You can juice oranges and lemons with anything from a handheld wooden reamer to a state-of-the-art piece of equipment like Hurom’s stainless steel citrus juicer. We vote for this juicer. It will tackle anything from a key lime to a large grapefruit. Cut your fruit in half, set it on the juicing cone and press down lightly with the lever. It effortlessly squeezes out the maximum amount of juice. Raise the lever and you’re ready for the next piece of fruit. There’s a drip-stop juice outlet so you can pour juice directly into a glass or into a container for storage. The motor is so quiet you won’t disturb those folks who are sleeping in. And all the parts that touch the fruit are top rack dishwasher safe.\n$149. Available at https://www.hurom.com/products/cj-citrus-juicer.\nA Healthy Frozen Dessert Maker\nYonanas Frozen Dessert Maker\nYou can make ice cream with all kinds of devices, but what about a frozen dessert that uses just fruit? For that you need Yonanas, a fruit soft service machine. You take frozen fruit (bananas are definitely recommended for a creamier result) and let it thaw just about five minutes, then push pieces of the fruit through the machine’s chute. Out comes a creamy mixture that looks like soft serve ice cream but there’s no fat and no added sugar. We tested this with lots of folks and everyone loved the result. Perfect for a quick dessert (it takes less than a minute to make) that can use the best of seasonal fruit or packages of frozen fruit you might have used for smoothies. The smaller machine is a little noisy and makes a small quantity at a time. If you want to use it for entertaining, you probably want the larger version.\n$39.99 for the Yonanas Classic, $99.99 for the Yonanas Elite. Available at Bed Bath & Beyond or online at http://yonanas.com.\nA New Fangled Toaster\nRussell Hobbs Toaster\nBack in the day, when you toasted grocery store sliced bread, a stocky little toaster with 1/2-inch slots worked fine. Fast forward to today when we’re toasting fat chewy bagels and slices from wide artisan loaves. With the Russell Hobbs-designed Two Slice Toaster, there’s no more cutting that bagel into thirds or toasting one end of a long slice and then turning it around and toasting the other end. We tried the glass accent toaster. It’s beautiful (yes, a toaster can be beautiful) and its slender design will fit into that narrow spot on a countertop. Play around with the settings to get the toast at the shade of “toast” you prefer. The bagel setting toasts one side of your bagel and just warms the other. The “lift and look” feature lets you check on how things are going.\n$99.99. Available online at http://russellhobbs.com.\nGet a taste of the new fusion revolution with the 2018 AJC Spring Dining Guide: Global Mashup\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/buy-this-three-gifts-for-the-grads-and-grooms-your-life/neUQlBYNSrjj2EF4hBveBJ/"}
