{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:17:14","date_modify":"2018-10-30 21:17:14","date_publish":"2018-10-29 13:00:00","description":"The season for tailgating and lots of entertaining is upon us.","filename":"data/vaneerConsumption/BuyThisThreeeasywaystoimproveyourcocktails.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/18/Images/EMPOWER_025.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_bu_5ca30cbdb0003b9e6f4d24ded086bf86__1540934234.html","title":"Buy This: Three easy ways to improve your cocktails","title_page":"Buy This: Three easy ways to improve your cocktails   ","title_rss":"NULL","source_domain":"ajc.com","text":"The season for tailgating and lots of entertaining is upon us. You can mix up some pretty complicated cocktails if you want to emulate your favorite mixologist. Or .... you could try these three options for an easy cocktail life.\nCosmopolitan Martini from Empower Cocktails\nA cocktail in a bottle? Count us in. This martini from Empower Cocktails is made from sweet potato vodka, triple sec, white cranberry juice and lime. Remember it’s a martini, so there’s plenty of power in this drink. Sip wisely. The website has other ideas for using it including mixing it with Aperol and sparkling rose, or matching it with rum, some lemon juice and simple syrup and a few raspberries. With a bottle of this in your refrigerator, you’re ready for any impromptu gathering. Chill, pour. Could it be easier?\n$21.99. Available at Available at Total Wine. http://empowercocktails.com.\nTonics and Potions from Cherokee Moon Mixology\nTonics and Potions from Cherokee Moon Mixology\nAlmeta Tulloss, Deisha Oliver-Millar and Nicole Bluh are the women of Cherokee Moon, an Atlanta-based mixology company using traditional food ways to enhance modern life. They are always tweaking their line of drinking vinegars. We tried the Prickly Pear Sangria with satsuma, hibiscus, ginger, lemon, sugar and cinnamon and Smokehouse Shandy, with lemons, habanero pepper, camellia flowers, sugar, black cardamom and smoked sea salt (this one is very hot and very smoky). If you’re lucky, they may still have a few bottles of their Southern Woods Tonic with Eastern red cedar tips, holy basil, lemon, juniper berries, lemongrass, green apples, sorghum molasses, rosemary, thyme and sugar. We hear Goldenrod Tonic will be available soon. Our favorite of what we’ve tried is the Prickly Pear Sangria. Beautiful color, includes delicious Georgia grown satsumas and made from vinegar produced from Georgia apples. It’s just sweet enough, just tart enough, just delicious. Use these vinegars to make a mocktail with sparkling water or tea, or to make a cocktail by mixing with sparkling wine or your favorite spirit.\n$10 for a 4-ounce bottle, $20 for an 8-ounce bottle. Available at Grant Park, Decatur, Freedom, Athens and Roswell farmers markets and at Creature Comforts Brewery. Check their social media for where they’ll be next. http://www.cherokeemoonmixology.com/\nCucumber Mojito from Barcoop Bevy\nCucumber Mojito from Barcoop Bevy\nBarcoop Bevy out of Charleston, South Carolina offers a line of mixers that makes serving cocktails a breeze. We love the flavors - Grapefruit Margarita, Agua Caliente Spicy Strawberry Margarita, Ginger Smash, Pina Colada and the one we tried, Cucumber Mojito. It’s got just five ingredients: water, lime juice, cane sugar and natural cucumber and mint flavors. To make a mojito, the proportions are two parts mixer to one part white rum. Or the label cleverly explains how to turn the entire bottle into a pitcher of mojitos. Empty the bottle into your pitcher. Then pour in rum up to the black line on the now empty bottle. Now combine the two and stir. Done. All we needed was a sprig of fresh mint to be totally refreshed. The mixers work great with sparkling water as well.\n$9.99 for a 33.8-ounce bottle. Available at Total Wine. http://barcoopbevy.com/\nRELATED:\nMore must-buy food products\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/buy-this-three-easy-ways-improve-your-cocktails/jdmhbYMNZeyPiz9NS3bioJ/"}
