{"authors":[],"date_download":"2018-10-22 20:31:35","date_modify":"2018-10-22 20:31:35","date_publish":"2014-05-02 11:51:33","description":"Journalists from CBS News and BuzzFeed were captured just two weeks after another reporter, Simon Ostrovsky, was detained for four days.","filename":"data/vaneerConsumption/BuzzFeedCBSJournalistsFreedAfterUkraineOrdeal.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_18/415746/1400502-clarissa-ward-jsw-912a_714904bf9e1264112242dd02f795e4fe.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_buzzfeed-cbs-journalists-freed-after-ukraine-ordeal-n95446_1540240295.html","title":"BuzzFeed, CBS Journalists Freed After Ukraine Ordeal","title_page":"BuzzFeed, CBS Journalists Freed After Ukraine Ordeal","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nJournalists from the American news outlets CBS News and BuzzFeed were captured by pro-Russian separatists in eastern Ukraine before being released a short while later on Friday.\nCBS correspondent Clarissa Ward tweeted that she and her crew were stopped at a checkpoint outside Slovyansk, where Ukraine forces were attempting to push back separatists occupying the city.\nThe CBS This Morning Twitter account said that the crew was taken to a tent and blindfolded with cloth and masking tape.\nBuzzFeed Mideast Correspondent Mike Giglio said his ordeal was similar. He said he and his crew were stopped at a checkpoint while trying to get into the city and blindfolded for three hours before being released. He said one of the team was punched in the face.\nThe detentions come after VICE reporter Simon Ostrovsky was detained in Slovyansk for four days at the end of last month. Ostrovsky said he was kept in a cellar of the occupied state security building along with a dozen other detainees.\n- Alexander Smith","url":"https://www.nbcnews.com/storyline/ukraine-crisis/buzzfeed-cbs-journalists-freed-after-ukraine-ordeal-n95446"}
