{"authors":[],"date_download":"2018-10-22 22:06:37","date_modify":"2018-10-22 22:06:37","date_publish":"2014-06-06 17:25:51","description":"From USB ports to mobile chargers, restaurants and bars are finding inventive ways to keep their customers' phones juiced.","filename":"data/vaneerConsumption/BuzzedBarsandRestaurantsKeepCustomersSmartphonesJuiced.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/493126/140606-restaurant-phone-mn-1525_3e4b98805fe685cce7eec2336b8c2dfd.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_innovation_buzzed-bars-restaurants-keep-customers-smartphones-juiced-n124651_1540245997.html","title":"Buzzed: Bars and Restaurants Keep Customers' Smartphones Juiced","title_page":"Buzzed: Bars and Restaurants Keep Customers' Smartphones Juiced","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nDead batteries and hangovers are the afflictions of the modern drinker. Now restaurants and bars are trying to fix at least one of those problems.\nAt Left Hand Path in Brooklyn, New York, the beer taps are built into a piece of 113-year-old spruce. Here, men with beards fill up their iPhones alongside their whiskey glasses, with cables running down to the electrical outlets and USB ports tucked underneath the bar.\nOne the owner’s goals when opening the bar last week was to make life easier for his bartenders.\n“If you’re in the middle of service, and someone asks you to charge their phone instead of giving you a drink order, it can mess you up,” Travis Boettcher told NBC News.\nThe former programmer from San Francisco had installed USB ports in his own home, and decided to they would make a good addition to his bar.\n“I saw a problem and I solved it,” he said.\nIt’s a problem many people continue to have. With bigger screens and more features, smartphones are only becoming more power-hungry. A battery lasting all day at work can seem like an accomplishment; lasting until last call can seem like a miracle.\nMaxwell Foxman, 29, uses a Wi-Fi-equipped iPod as a phone during the day to save the battery on his actual phone. At night he pulls out his Motorola Droid Razr Maxx, which, ironically, he bought for its supposedly long battery life. Even then, he often finds himself low on juice.\n“I don’t go to every bartender and ask, ‘Hey can you charge my phone?’ I try to solve the problem on my own,” Foxman, a Ph.D. student at Columbia University, told NBC News. “But every time I have asked and there has been easy access, they have said yes.”\nIt’s a request that many bartenders and waiters have heard. Like Boettcher, Federico Castellucci decided it was just easier to build electrical outlets into the bars and booths of his three Atlanta restaurants. He came up with the idea when opening his first spot, The Iberian Pig, and he found himself hunting for outlets while working there during the day.","url":"https://www.nbcnews.com/tech/innovation/buzzed-bars-restaurants-keep-customers-smartphones-juiced-n124651"}
