{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 21:47:39","date_modify":"2018-10-30 21:47:39","date_publish":"2015-12-09 13:51:35","description":"Buzzfeed editor-in-chief Ben Smith has proudly tweeted an internal memorandum OK'ing terms like \"mendacious racist\" to describe Donald Trump.","filename":"data/vaneerConsumption/BuzzfeedBansProDonaldTrumpOpinionsfromSite.json","image_url":"https://media.breitbart.com/media/2015/12/Buzzfeed-Ben-Smith.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_09__1540936059.html","title":"Buzzfeed Bans Pro-Donald Trump Opinions from Site","title_page":"Buzzfeed Bans Pro-Donald Trump Opinions from Site - Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Buzzfeed editor-in-chief Ben Smith has proudly tweeted an internal memorandum he sent to staff in which he allows and defends their use of terms like “mendacious racist” to describe Republican presidential frontrunner Donald Trump on social media.\nHere’s a memo I sent to @buzzfeed staff today on our social media policy, and Donald Trump pic.twitter.com/zCiDds3C29 — Ben Smith (@BuzzFeedBen) December 9, 2015\nThe goal of the company’s social media policy, Smith writes, is to “preserve our readers’ confidence that we can be fair” and not to “undermine” reporters’ work. The memo, however, is entirely one-sided, and says nothing about defending Donald Trump.\nSmith elaborates: “It is, for instance, entirely fair to call [Trump] a mendacious racist, as the politics team and others have reported clearly and aggressively. He’s out there saying things that are false, and running an overtly anti-Muslim campaign.”\nHe does advise employees that it is not fair to tar all Republicans with the same brush, since some disagree with Trump, but concludes that “there’s nothing partisan about accurately describing Donald Trump.”\nOn the facts Smith presents, it is unclear how describing Trump as “racist” is defensible. It is not clear, for example, how Smith makes the leap from religion to race.\nThe broader problem is that Smith’s memo would have a chilling effect in any company. It makes clear that defending Donald Trump is to be equated with racism. In fact, Smith does not even seem to acknowledge that some Buzzfeed employees might have a favorable opinion of Trump, and his memo tends to preclude that possibility in future.\nThis is poor editorial management, to say the least. It achieves exactly the opposite of what Smith intends and undermines any confidence in the fairness of Buzzfeed’s political coverage of the 2016 presidential campaign.\nWhat is particularly interesting is that Smith would publish this memo. Behind the self-righteous moral preening lies a stark admission of political intolerance.\nBuzzfeed reporters have, in the past, mocked Breitbart News writers for having different opinions of Trump. Now it is clear why.","url":"https://www.breitbart.com/politics/2015/12/09/buzzfeed-bans-pro-donald-trump-opinions-from-site/"}
