{"authors":["Awr Hawkins"],"date_download":"2018-10-30 21:47:38","date_modify":"2018-10-30 21:47:38","date_publish":"2015-07-24 23:06:56","description":"BuzzFeed Editor Rachel Zarrells reaction to a theater shooting: \"Don't pray. Push for gun control.\"","filename":"data/vaneerConsumption/BuzzFeedEditorRegretsBashing2ndAmendmentofGddmnConstitution.json","image_url":"https://media.breitbart.com/media/2015/07/ceZzFi3Y.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_07_24__1540936058.html","title":"BuzzFeed Editor Regrets Bashing 2nd Amendment of 'G*dd*mn Constitution'","title_page":"BuzzFeed Editor Regrets Bashing 2nd Amendment of 'G*dd*mn Constitution' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In a tweet sent while news of the tragic July 23 attack in Lafayette’s Grand Theatre was still rolling in, BuzzFeed News Editor Rachel Zarrell exclaimed, “Let’s just give everyone guns, right? It’s in the g*dd*mn constitution.”\nThis tweet was preceded by one in which Zarrell wrote: “If this were someone in my family I’d want every person alive screaming about gun control to anyone who would listen.” And another in which she tried to stir people to action: “Don’t pray. Push for gun control.”\nShortly after Zarrell’s gun control diatribe began, Stephen Miller (@redsteeze) tweeted BuzzFeed editor-in-chief Ben Smith, asking him to explain what Zarrell meant by “g*dd*mn constitution” and included the following excerpt from BuzzFeed’s Editorial Standards and Ethics Guide:\n[W]hen it comes to activism, BuzzFeed editorial must follow the lead of our editors and reporters who come out of a tradition of rigorous, neutral journalism that puts facts and news first. If we don’t, it makes it harder for those reporters to do their jobs… [W]e must maintain one blanket rule for all of editorial: Political partisanship may not be expressed in public forums, including Twitter and Facebook.\nZarrell then apologized for the gun control push and the language that accompanied it by tweeting: “You’re right, it was the wrong thing to say. I was being reactive. I don’t speak for my colleagues.”\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/the-media/2015/07/24/buzzfeed-editor-regrets-bashing-2nd-amendment-of-gddmn-constitution/"}
