{"authors":["Breitbart News"],"date_download":"2018-10-30 19:54:09","date_modify":"2018-10-30 19:54:09","date_publish":"2016-12-06 21:51:48","description":"Buzzfeed conducted a study to determine President-elect Trump’s favorite news sites by analyzing the articles he tweeted. Breitbart was by far his favorite.","filename":"data/vaneerConsumption/BuzzfeedBreitbartIsTrumpsFavoriteNewsSource.json","image_url":"https://media.breitbart.com/media/2016/12/DT-reads-Buzzfeed.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2016_12_06__1540929249.html","title":"Buzzfeed: Breitbart Is Trump’s Favorite News Source","title_page":"Buzzfeed: Breitbart Is Trump’s Favorite News Source","title_rss":"NULL","source_domain":"breitbart.com","text":"From Buzzfeed:\nBuzzFeed News reviewed 26,234 of Trump’s 34,062 tweets, which we received through the Twitter API and developer Brendan Brown, who has archived Trump’s tweets beyond what is accessible via the API (a stream of data that includes information like tweet text, time, and date). We filtered that data down to the 2,687 hyperlinks tweeted by Trump’s personal Twitter account since he announced his candidacy in June 2015. By programmatically expanding the shortened links in his tweets we were able to group and count them to generate a rudimentary portrait of the news and opinion he publicizes and, presumably, consumes.\n…\nDuring campaign season Trump shared more Breitbart links to his more than 15 million followers than any other news organization (in August Breitbart chairman Steve Bannon joined Trump’s campaign as CEO and will enter the West Wing in January as Trump’s senior White House adviser). While Trump also shares links from mainstream sites — his second most shared site during the time period analyzed was the Washington Post — Trump’s preferred content seems to be right-leaning, hyper-partisan sites and opinion blogs including Daily Caller (21 links), Newsmax (18), the Gateway Pundit (14 links), the Conservative Treehouse (11), the Political Insider (1), Conservative Tribune (1), Infowars (1), newsninja2012.com (5), and westernjournalism.com (1)…","url":"https://www.breitbart.com/the-media/2016/12/06/buzzfeed-breitbart-is-trumps-favorite-news-source/"}
