{"authors":["Frank E. Lockwood"],"date_download":"2018-10-30 19:20:20","date_modify":"2018-10-30 19:20:20","date_publish":"2016-02-25 00:00:00","description":"Stuck in Iowa, with poll numbers plummeting and chances for success dwindling, Mike Huckabee for President Inc. ran out of money.","filename":"data/vaneerConsumption/ByIowaHuckabeebidonfumesgoingintored.json","image_url":"https://media.arkansasonline.com/img/photos/2016/02/25/resized_99263-gop-2016-debate_jenk_22-20782_t600.JPG?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_feb_26__1540927220.html","title":"By Iowa, Huckabee bid on fumes, going into red","title_page":"By Iowa, Huckabee bid on fumes, going into red","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Former Arkansas Gov. Mike Huckabee (second from right) joins the field of Republican presidential candidates debating Jan. 28 in Des Moines, Iowa. The others on stage are (from left): former U.S. Sen. Rick Santorum, business executive Carly Fiorina and former Virginia Gov. Jim Gilmore. - Photo by AP / CHARLIE NEIBERGALL\nWASHINGTON -- Stuck in Iowa, with poll numbers plummeting and chances for success dwindling, Mike Huckabee for President Inc. ran out of money.\nTrying to survive until caucus day, the campaign spent more than it raised and ran up a debt, the former Arkansas governor is telling supporters. He's asking for their help to pay off about $90,000.\nHuckabee suspended his campaign Feb. 1 after his ninth-place finish in the Iowa caucuses. He received just 1.8 percent of the vote, finishing with 3,345 votes.\nIn a fundraising pitch appeal titled \"Help Me Honor Their Sacrifice,\" Huckabee wrote about the campaign's final weeks.\n\"Some of our staff went without pay in the final 2 months to keep us in the game. Few candidates have that level of devotion among the staff. I feel that it's important to honor their sacrifice by trying to make them whole for their weeks worked without pay,\" Huckabee wrote on a message posted on his website.\nThe message doesn't indicate how many staff members are affected or how much they would receive.\nIn an interview Thursday, Sarah Huckabee Sanders, the former candidate's daughter and campaign manager, said five or six campaign employees are affected. While not releasing their names, she said they were \"mostly all senior staff.\"\nIn the final weeks, money was a constant worry.\n\"I spent hours every day just going over the budget and watching pennies, literally pennies, coming in and out, and it's really stressful,\" she said.\nHuckabee had struggled to build a large donor base, never keeping pace with the rest of the field. And contributions dropped even more after campaign-finance reports were released for the third quarter of 2015.\n\"If you're not raising a lot of money, the media starts to write you off, and it really becomes hard to recover from that,\" Sanders said.\nCompounding matters was that Huckabee's polling numbers continued to slide. In nine consecutive polls conducted during November and early December, he never climbed higher than 2 percent.\nMonica Notzon, a Republican fundraising consultant, has raised money for more than 200 House and Senate members across the country, and she's seen what happens when a candidate's numbers flat-line.\n\"Ninety-nine times out of a hundred, when your polling numbers are either plummeting or not able to get off the ground, it really very quickly just stifles your fundraising efforts across the board,\" she said. \"It's demoralizing on a lot of levels.\"\nPathways to victory evaporate, and the funds needed to change course are no longer available, she said.\nSome Huckabee campaign staff members agreed to take pay cuts. Others gave up their salaries altogether. Alice Stewart, the campaign's longtime spokesman, quit in December and, in January, went to work on the presidential campaign of U.S. Sen. Ted Cruz of Texas.\nSanders said money problems are \"a good test of your staff, your team and the loyalty that they have. Our team was willing to stick with it and fight through until the bitter end, some of them voluntarily going without salary for a little bit with no expectation of getting that back just because they believed in what we were doing.\"\nPaul S. Ryan, an attorney and deputy executive director of the Campaign Legal Center, questioned whether the money being raised to repay staff members could be portrayed as a campaign \"debt\" if the money was going to people who had chosen to work for free.\nThe center is a Washington-based nonpartisan, nonprofit group that advocates for strong enforcement of campaign-finance laws.\n\"Candidates are allowed to accept as much volunteer assistance on their campaigns as they can possibly talk people into giving them,\" he said. \"The tricky thing here is that, if these people were volunteers, then they are not owed money, so raising money after the election to pay volunteers strikes me as odd.\"\nAs Huckabee's coffers ran dry, a pro-Huckabee super PAC, Pursuing America's Greatness, still had lots of money. The independent, expenditure-only group spent nearly $2.4 million in January and finished the month with about $372,000 in the bank, but was unable to end Huckabee's money woes. Federal law prevented it from paying the campaign's bills.\nSo while the PAC flooded the airwaves with pro-Huckabee and anti-Cruz ads, Huckabee struggled to make it to the finish line.\nElection night, as Huckabee supporters awaited the results, it was the super PAC that funded the party, paying for the pulled-pork sandwiches that fed the supporters and for the stage from which Huckabee conceded defeat.\nHuckabee's message, posted on his campaign website and his Facebook page, says he stretched his campaign's money as far as he could.\n\"We frugally managed the campaign funds entrusted to us by our friends, but in the days immediately after the campaign suspended, outstanding bills for services we didn't anticipate, and some late arriving bills from vendors means we need to raise about $90,000 to end the campaign in the black,\" the appeal stated.\nThrough Jan. 31, campaign donors had given the Hope native $4.1 million, including $503,163 contributed by Arkansans.\nHuckabee wrote, in the Feb. 19 solicitation, that he's appealing to backers \"one final time\" to help him end his campaign debt-free.\n\"It's embarrassing to even ask you to help yet again, but I don't want to let these good people go without pay and bills not paid. So that is why I am asking for your help ... I know you have gone above and beyond! I am only asking this because I need to,\" he wrote.\nCampaign reports filed with the Federal Election Commission document the money problems.\nIn January, the Huckabee campaign raised $166,470.29, while spending $258,171.06, according to documents it filed Saturday with the Federal Election Commission.\nOverall, Huckabee had raised and spent $4.1 million through Jan. 31, compared with Ben Carson's $57.5 million and Cruz's $54.4 million. Their super PACs had gathered tens of millions more.\nFourteen presidential candidates -- 11 Republicans and three Democrats -- had collected more cash than Huckabee by that point.\nThat enabled those other candidates to focus on getting out the vote. Sanders said lack of funds limited her father's options in the campaign's final days.\nWhile other presidential candidates hopscotched across Iowa, Huckabee remained in the Des Moines area, holding events and giving interviews.\nThe day before the caucuses, one day before the candidate conceded defeat, the campaign had $39,043.61 in the bank and a stack of unpaid bills totaling $55,384.25.\n\"You can't do media of any kind, whether it's digital advertising or TV advertising,\" she said. \"Mail, automated phones, a lot of those things come off the table.\"\nInstead of renting large rooms, \"we had to look for venues that were smaller, most of the time completely free venues,\" she said.\nInstead of traveling on a 757 like New York businessman Donald Trump did or in a flashy new campaign bus, Huckabee had to borrow a set of wheels.\nOther candidates had \"wraps\" on their vehicles, a term, Sanders said, that refers to \"the big logos on the side of the bus, where they plaster their face and their name. ... Ours was just a plain RV that one of our supporters had that we were able to use.\"\nThere were fleeting signs of hope. One Iowa event drew nearly 1,000 people, Sanders said. Another gathering earlier that same day attracted a crowd of more than 200.\nBut splashed across the front pages of that day's Des Moines Register, the state's largest newspaper, was a poll showing Trump in front and Huckabee at 2 percent.\n\"We were working hard until the very end,\" Sanders said. \"I'm not sure that there was anything differently we could have done.\"\nThe votes were still being counted, but Huckabee knew it was over.\nHe told supporters in the room that he was suspending his campaign, \"not because of the votes. It's because of illness,\" adding, \"Obviously the voters are sick of me.\"\nWith his bid for the White House over, Huckabee called it quits and headed for the airport.\nMeanwhile, the bills kept arriving.\nFederal Election Commission forms list six people or businesses to whom the campaign owed money as of Jan. 31.\nSilver Eagle GPX of Little Rock is the only Arkansas debt listed. The company was awaiting payment of $1,837.85 for printing. An employee said the company had printed T-shirts for the campaign but declined to discuss a client.\nOthers owed money as of Jan. 31 included:\n• MSCO Management of Fort Worth ($15,344.44 for air travel)\n• Oxford Communications of Alexandria, Va. ($15,156 for telemarketing)\n• Skycraft Management of Cleburne, Texas ($6,065.24 for air travel)\n• Unisource Direct LLC of Watertown, Wis. ($16,301.08 for direct mail)\n• Alice Tadlock of Germantown, Tenn., who served as Huckabee's national finance director, ($679.64 for reimbursement for mileage).\nWhat's owed to the unpaid staff members emphasized in his fundraising letter aren't listed on Huckabee's Jan. 31 campaign-finance report.\nBut \"regularly recurring administrative expenses such as rent, utilities and salaries are not considered to be debts until they are past-due,\" according to Christian Hilland, deputy press officer for the Federal Election Commission.\n\"Committees may solicit contributions to retire outstanding net debts and loans as long as those contributions do not exceed the contributors' limit for the designated election,\" he wrote in an email.\nOther bills have since arrived for the campaign. Plus, there's the cost of litigation related to the campaign's unauthorized use of Survivor's 1980s hit song, \"Eye of the Tiger.\"\nThe song's owner is accusing the campaign of copyright infringement. Campaign attorneys say the \"fair use doctrine\" allowed for a snippet of the song to be played.\nMeanwhile, the campaign is trying to wind things down.\nIn his fundraising pitch, Huckabee told supporters \"I have asked much of you. Nothing I've asked of you is above what I've asked of myself,\" and then he requested that they \"make a contribution of $25, $15, $10, $5, or whatever you can do right now.\"\nFederal Election Commission papers filed by the campaign indicate that Huckabee hadn't donated any money to his campaign as of Jan. 31.\nBut Sanders said her father has contributed for the postelection effort \"pretty significantly already, and I'm sure will again as we're kind of wrapping up.\"\nAsked what would happen if there's extra money once the bills are paid, Sanders said. \"There won't be any,\" she said. \"Don't worry.\"\nNotzon, the Republican fundraiser, said it's \"certainly much more challenging\" to raise money to settle campaign debts if the race was a losing one.\n\"Unfortunately a lot of times candidates don't even realize until after an election's over and they've lost, how much debt they actually have,\" she said.\nFor a non-officeholder, \"It's next to impossible,\" she said.\nBut Brendan Doherty, an associate professor of political science at the U.S. Naval Academy, said Huckabee's better off than some previous also-rans, including Wisconsin Gov. Scott Walker, who dropped out of the 2016 race before the first vote was cast.\nWalker's debt was deeper, he said, around $1 million.\n\"It's quite common to have residual debt after an unsuccessful presidential campaign. The most famous example was John Glenn, who took over two decades to pay off his debt,\" Doherty said in an email. \"Retiring debt can be quite a challenge, especially for failed candidates without clear political prospects ahead. $90,000 seems like a relatively modest amount of debt for the Huckabee campaign to have to deal with.\"\nA Section on 02/26/2016","url":"https://www.arkansasonline.com/news/2016/feb/26/by-iowa-huckabee-bid-on-fumes-going-int/"}
