{"authors":[],"date_download":"2018-10-30 22:27:01","date_modify":"2018-10-30 22:27:01","date_publish":"2018-07-28 16:40:44","description":"Jamie Nieto was an Olympic high jumper who was paralyzed by a freak injury, but now he's on an amazing journey.","filename":"data/vaneerConsumption/ByTheGraceofGodImBackonMyFeetParalyzedOlympianJamieNietosIncredibleRoadtoRecovery.json","image_url":"http://www1.cbn.com/sites/default/files/styles/original/public/media/slider/images/jamesnieto.jpg?itok=qdM7WC9J","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/.cbn.com/cbnnews_entertainment_2018_july_by-the-grace-of-god-im-back-on-my-feet-paralyzed-olympian-jamie-nietos-incredible-road-to-recovery_1540938421.html","title":"'By The Grace of God I'm Back on My Feet': Paralyzed Olympian Jamie Nieto's Incredible Road to Recovery","title_page":"'By The Grace of God I'm Back on My Feet': Paralyzed Olympian Jamie Nieto's Incredible Road to Recovery | CBN News","title_rss":"NULL","source_domain":"cbn.com","text":"Jamie Nieto was an Olympic high jumper who was paralyzed by a freak injury, but now he's on an amazing journey.\nThe images of Nieto soaring through the air are unforgettable... competing and winning Olympic competitions.\n\"Everything that we do starts with the mind. If you can believe, you can achieve. When I began to believe, things started to change in my life,\" Nieto said.\n\"I always had the idea that I had the talent to do it. I can do this,\" he told CBN News.\nAnd then doubt started to creep in when he competed in his second Olympic Games.\n\"When I went to the Olympics, I was 35 years old, and I was asking myself, 'Do you think you can compete against these guys who are 10, 15 years younger than you? You haven't jumped so high in eight years. You haven't been on top of your game in a little while. Do you think you can actually do this again?'\" Nieto said.\n\"I didn't totally believe, but I convinced myself I could do it,\" he said. \"I did that by prayer. I did that by positive affirmation. I did that by surrounding myself with people who are like minded. Then I did start to believe within a year. 'Oh, I can do this and I did.'\"\nCBN News caught up with Jamie Nieto on the set of the Pure Flix soap opera \"Hilton Head Island.\" Nieto plays a chief surgeon on the series.\nThis is yet another milestone on his incredible road to recovery.\nThe two-time Olympic high jumper injured himself in a freak accident and became paralyzed.\n\"I was coaching and I was demonstrating for athletes who were Olympic hopefuls,\" he recalled. \"As I did the jump, my foot slipped and I went straight from my feet to my head. The disc in my neck pressed back and bruised the spinal cord and I was paralyzed from the chest down. It was a tough time. It's still hard sometimes, but I'm getting through it. And by the grace of God, I'm back on my feet.\nThe doctors said I would only have 30 percent mobility back. I knew with my faith, my determination, my will to keep wanting to be the best that I could be....I'm going to get back on my feet and walk again and run again because I have the fight of an Olympian,\" Nieto continued.\nFamily and friends saw that Olympic fight when Jamie proposed to his wife and vowed to walk down the aisle at their wedding.\n\"My wife said: 'It will probably take you about 150 steps to get out of the church.' So I started practicing on my walking. At the time, I was barely falling into three steps. Eventually, I started gaining more balance and stability. The steps got a little more solid. Even now, I use crutches to stabilize me. It was a blessing to be able to do that for me and my wife,\" Nieto told CBN News.","url":"http://www1.cbn.com/cbnnews/entertainment/2018/july/by-the-grace-of-god-im-back-on-my-feet-paralyzed-olympian-jamie-nietos-incredible-road-to-recovery"}
