{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:15:06","date_modify":"2018-10-30 22:15:06","date_publish":"2015-04-23 12:25:59","description":"New information released by the California Department of Justice's Bureaus of Firearms shows that the state's \"assault weapons\" ban did not ban \"assault weapons.\"","filename":"data/vaneerConsumption/CAAssaultWeaponsBanDidNotBanAssaultWeapons.json","image_url":"https://media.breitbart.com/media/2015/04/ar-15-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_04_23__1540937706.html","title":"CA 'Assault Weapons' Ban Did Not Ban 'Assault Weapons'","title_page":"CA 'Assault Weapons' Ban Did Not Ban 'Assault Weapons' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"New information released by the California Department of Justice’s Bureaus of Firearms shows that the state’s “assault weapons” ban did not ban “assault weapons.”\nIn fact, nearly 150,000 such weapons legally remain in private ownership in the state, and that figure only represents the number of such weapons that the state knows about.\nAccording to Reveal, there were 145,253 “assault weapons” grandfathered in after the 1989 ban was passed. AR-15 variants are the most popular type on the list, and Colt is the most popular manufacturer. The list also includes Bushmaster, Heckler & Koch, and various AK-47 brands.\nInformation on the guns was released “in response to a public records request.” The information does not reveal “the names, locations, and other personal information of those who registered the guns.”\nThe release of the “assaults weapons” information brought attention to the fact that “many of the grandfathered guns are in the hands of people prohibited from owning [them] because of mental health issues, restraining orders or criminal convictions that happened after the gun was legally registered.” This, in turn, continues to put pressure on CA Attorney General Kamala Harris, who is currently working “to confiscate these firearms.”\nThe Calguns Foundation is challenging the ban’s existence, citing FBI statistics which show “assault weapons” are rarely used in crime. Calguns’ executive director Brandon Combs points out that handguns are far and away the most popular gun for crime, so he wonders why the state is so busy targeting AR-15s.\nIn January 2014 Breitbart News reported on a study by the “Geneva-based research project Small Arms Survey” which showed that of all the guns police seize “from gang members, felons, and drug traffickers,” less “12 percent” are rifles of any type. “Assault weapons” only make up a small percentage of that 12 percent, while handguns are seized “77 percent” of the time.\nFollow AWR Hawkins on Twitter @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/local/2015/04/23/ca-assault-weapons-ban-did-not-ban-assault-weapons/"}
