{"authors":[],"date_download":"2018-10-30 14:33:23","date_modify":"2018-10-30 14:33:23","date_publish":"2015-04-22 00:00:00","description":null,"filename":"data/vaneerConsumption/CAballotinitiativewouldkeepboysoutofgirlsbathrooms.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_04_ca_ballot_initiative_would_keep_boys_out_of_girls_bathrooms_comments_1540910003.html","title":"CA ballot initiative would keep boys out of girls' bathrooms","title_page":"Blog: CA ballot initiative would keep boys out of girls' bathrooms","title_rss":"NULL","source_domain":"americanthinker.com","text":"A group called Privacy for All is trying to get enough signatures to create a ballot initiative in California that would prevent boys from going into girls' bathrooms and locker rooms, even if the boys wiggle when they walk and talk in high-pitched feminine voices. Privacy for All submitted its proposal Friday. It would restrict restrooms, locker rooms and dressing rooms that transgender people can use. Called the Personal Privacy Protection Act, it would require people to \"use facilities in accordance with their biological sex\" in government-owned buildings, including public schools and universities. It would not apply to single-occupancy restrooms or to family restrooms. \"There's a trend out there, I call them science deniers, who don't believe the biological reality of two sexes is real,\" said Kevin T. Snider, an attorney with the Pacific Justice Institute, a conservative legal group that has been advising Privacy for All. But not... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/04/ca_ballot_initiative_would_keep_boys_out_of_girls_bathrooms_comments.html"}
 will of the majority,\" said Dave Garcia, director of policy for the Los Angeles LGBT Center.\nGarcia prefers that the minority dictate the rights of the majority.\n\"These anti-LGBT initiatives pose an undue burden on the California taxpayer ...\nWhat cost is there to keeping boys out of girls' bathrooms? I love it how leftists always talk about \"cost\" only when it threatens one of their pet social engineering projects\n... they are inherently bigoted, ultimately unconstitutional and to most fair-minded Californians, they are simply embarrassing.\"\nSo now it is bigoted to insist that girls and boys use separate bathrooms? Has society changed so much now that we're embarrassed to tell a boy that even if he wiggles his behind when he walks and talks in a high-pitched voice, he still can't see girls naked in their locker rooms?\nKris Hayashi, executive director of the Transgender Law Center, called the proposed initiative unconstitutional and unenforceable, saying that it would \"dangerously single out Californians who don't meet people's stereotypes of what it's like to be male or what it looks like to be female ...\nThere are \"stereotypes\" of what it's like to be male and female? Do you think having breasts and female reproductive organs are unfair \"stereotypes\" of women?\n... putting everyone at greater risk of harassment and opening the state up to costly lawsuits.\"\nAlways concerned about the cost to the taxpayer! As for harassment, isn't that just what girls will experience when a guy dressed as a girl comes into a locker room and starts staring and drooling?\nSociety has changed so rapidly that now it's considered perverse to keep children of different genders apart and considered virtuous to encourage children to pretend they are something they can never be, and to permit them to harass normal kids in the bathroom.\nThis article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/04/ca_ballot_initiative_would_keep_boys_out_of_girls_bathrooms.html"}
