{"authors":["John Hutchinson For Mailonline"],"date_download":"2018-10-23 02:32:34","date_modify":"2018-10-23 02:32:34","date_publish":"2016-01-29 17:04:53","description":"Airline staff on an internal flight in Peru first gave out handkerchiefs and hats to those travelling on board before they turned on the music and strutted their stuff in the aisle.","filename":"data/vaneerConsumption/CabincrewfilmedentertainingpassengerswithsensualrenditionoftraditionalPeruviandance.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B4358100000578-0-image-a-2_1454085417291.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3423059_Mile-high-masterclass-Cabin-crew-filmed-entertaining-passengers-30-000ft-sensual-rendition-traditional-Peruvian-dance_1540261954.html","title":"Cabin crew filmed entertaining passengers with sensual rendition of traditional Peruvian dance","title_page":"Cabin crew filmed entertaining passengers with sensual rendition of traditional Peruvian dance | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the moment airline passengers were given some special entertainment mid-flight when the flight crew broke into traditional Peruvian dance.\nThe video, recorded during a flight from Lima to Trujillo, was soon uploaded onto social media platforms.\nAirline staff first gave out handkerchiefs and hats to those travelling on board before they turned on the music and the dancers, in traditional dress, positioned themselves in the aisles.\nAirline passengers were given some special entertainment mid-flight when the flight crew broke into traditional Peruvian dance\nThis passenger was keen to join in with the flight crew, taking a white handkerchief and showing some moves\nMany of the passengers also jumped up from their seats to dance along with the air hostesses and hosts, who can be seen twirling their white handkerchiefs from side to side.\nThe dance in question is a coastal dance of Peru called Marinera, where the man traditionally wears shoes while the woman dances completely barefoot.\nMarinera is a graceful and romantic couple's dance that uses handkerchiefs as props. The dance is an elegant and stylised re-enactment of a courtship, and it shows a blend of the different cultures of Peru.\nThe video, recorded during a flight from Lima to Trujillo, was soon uploaded onto social media platforms\nWith a lot of practice, women are able to dance barefoot on extremely hot pavements and very rough surfaces, as the soles of their feet get toughened up, something they are really proud of.\nThis week the 56th national Marinera contest was held in Peru.\nIt saw 1,600 couples compete for the prize of best dancers.\nThe dance in question is a coastal dance of Peru called Marinera","url":"https://www.dailymail.co.uk/travel/travel_news/article-3423059/Mile-high-masterclass-Cabin-crew-filmed-entertaining-passengers-30-000ft-sensual-rendition-traditional-Peruvian-dance.html"}
