{"authors":["Jonathan Spencer For Mailonline"],"date_download":"2018-10-22 21:11:50","date_modify":"2018-10-22 21:11:50","date_publish":"2017-04-26 01:12:22","description":"Prescot Cables had a night to remember on Tuesday as they beat National League outfit Southport 2-0 in the County Cup final of the Liverpool Senior Cup.","filename":"data/vaneerConsumption/Cablesfanscelebrategoalsowildlythattheybreakfence.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F9B50A900000578-0-image-a-55_1493165477433.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4445852_Cables-fans-celebrate-goal-wildly-break-fence_1540242710.html","title":"Cables fans celebrate goal so wildly that they break fence","title_page":"Cables fans celebrate goal so wildly that they break fence | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Evo-Stik Northern League Division One North side Prescot Cables had a night to remember on Tuesday as they beat National League outfit Southport 2-0 in the County Cup final of the Liverpool Senior Cup.\nAnd after celebrating one of the goals, the home side's supporters managed to break a fence as they enjoyed an incredible night at their ground.\nIn a Twitter video posted by @nevs44, Cables supporters can be seen going crazy after their side scored a precious goal to help fire the club to victory.\nPrescot Cables fans went wild after their side scored against National League outfit Southport\nThe fans celebrated so hard that the fence they were stood behind gave way on Tuesday\nAnd what happened next took everyone by surprise. The supporters were celebrating so hard that the fence that they were stood behind gave way, with the fans amusingly falling with it.\nSome of the Cables players, who enjoyed a bundle following the goal, were stuck under the fence for a short time.\nBut due to a combined effort from the fans, stewards and their team-mates, they were pulled to safety and the fence was pushed back into place.\nAfter everything was back to normal, the jubilant Cables fans resumed their celebrations.\nThe home side managed to hold on to claim the Liverpool Senior Cup title in front of an attendance of 905 on Tuesday.","url":"https://www.dailymail.co.uk/sport/football/article-4445852/Cables-fans-celebrate-goal-wildly-break-fence.html"}
