{"authors":["Merrill Hope"],"date_download":"2018-10-30 21:19:48","date_modify":"2018-10-30 21:19:48","date_publish":"2015-10-22 13:14:57","description":"California Democrat Congressman Mike Honda, currently under an ethics investigation, cried Islamophobia outside the U.S. Capitol Building Tuesday while questioning the legality of the Sept. 14 arrest of “Clock Boy” Ahmed Mohamed.","filename":"data/vaneerConsumption/CACongressmanUnderEthicsInvestigationSeeksDOJClockBoyAhmedProbeofTexasOfficials.json","image_url":"https://media.breitbart.com/media/2015/10/AP_543817913602.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_10_22__1540934388.html","title":"CA Congressman Under Ethics Investigation Seeks DOJ 'Clock Boy' Ahmed Probe of Texas Officials","title_page":"CA Congressman Under Ethics Investigation Seeks DOJ 'Clock Boy' Ahmed Probe of Texas Officials","title_rss":"NULL","source_domain":"breitbart.com","text":"California Democrat Congressman Mike Honda, who cried Islamophobia outside the U.S. Capitol Building Tuesday while questioning the legality of the Sept. 14 arrest of “Clock Boy” Ahmed Mohamed, is himself under an ethics investigation.\nHonda is under investigation by the House Ethics Committee for mixing government and campaign business. Despite that, he organized the press conference questioning the ethics and legality of Texas officials. He used the press conference to nudge along his Sept. 22 letter to U.S. Attorney General Loretta Lynch, calling for a U.S. Department of Justice probe into the Irving, Texas school district and police department that handled the arrest. This, despite the fact that no charges were ever filed against Mohamed.\nLate Wednesday, Irving ISD spokeswoman Lesley Weaver confirmed to Breitbart Texas that the school district “is in receipt of an inquiry from the U.S. Department of Justice.”\nThe soon-to-be Qatari student Ahmed, his father Mohamed Elhassen Mohamed, uncle Aldean Mohamed, and former Dallas Independent School District (ISD) board trustee Ron Price, acting as a family adviser, attended the press conference. Throughout, Honda insisted Ahmed was punished because of his Muslim heritage.\nThe 14-year-old withdrew from Irving ISD after serving a three-day suspension for bringing into a public school his homemade clock that resembled a suitcase bomb. When opened, the case exposed an unshielded 110-volt transformer, hazardous to anyone who put their hands inside the clock-box, Breitbart News reported.\nHonda likened his early childhood spent in a Japanese internment camp during World War II to Ahmed’s temporary detainment, saying he was honored to stand with Ahmed “and call on the DOJ to investigate his arrest.”\nHe also claimed Ahmed Mohamed’s detention was part of an “alarming trend of profiling Muslim-Americans” and admonished Irving PD, MacArthur High School, and Irving Mayor Beth Van Duyne. He insisted they formally apologize to the teen. Honda did not seek reconciliatory messages for Van Duyne, the recipient of troubling emails and foul-mouthed social media posts, some which advocated sexual violence against her because she shared on Facebook: “I do not fault the school or police for looking into what they saw as a potential threat.”\nThis Spring, the local Muslim population protested the mayor’s support of American laws in American courts as discriminatory.\nHonda’s biased letter implored the Justice Department to review the circumstances of Ahmed’s arrest. Signed by 28 other U.S. Democrat House members. Texas Representatives Sheila Jackson Lee and Mark Veasey were included in the letter’s signatories. Also on the leftwing lineup were eight California House reps including Maxine Waters, Judy Chu, Ted Lieu, and Loretta Sanchez. Other signatories included Representatives Charlie Rangel, Keith Ellison, John Conyers, and Alcee Hastings also signed the letter.\nThe letter purported civil rights violations per the Texas Family Code but did not mention the Texas Education Code, which addresses related penal codes. It did not reference the state’s 1995 Safe Schools Act or the Student Code of Conduct handbook, which outline zero tolerance consequences for perceived threats applicable to all public school children.\nDespite his passion and verve on the clockmaker’s behalf, Honda seems uninspired by Golden State concerns, snoozing through Congressional meetings on the Keystone XL pipeline, during House votes to repeal Obamacare, and at a Northern California town-hall he organized. In February, CSPAN caught Honda napping on the House floor during a Department of Homeland Security funding debate.\nHonda attributed his shut-eye to being “tired of the GOP playing games with our national security” but Obama 2010 presidential campaign organizer Shobana Ramamurtha jabbed: “Mike, you cannot use that excuse all the time. You fell asleep in your own town hall.”\n@RepMikeHonda @cspanJeremy Mike, you cannot use that excuse all the time You fell asleep in your own town hall. #SleepingHonda #AsleepOnJob — Shobana Ramamurthi (@Shobji) February 27, 2015\nLast month, the San Jose Mercury News jibed that Honda’s 2016 congressional district challenger Democrat Ro Khanna, a former Obama administration official, should consider a media campaign slogan like “Vote for Ro: He’ll stay awake for you.”\nFollow Merrill Hope on Twitter @OutOfTheBoxMom.","url":"https://www.breitbart.com/border/2015/10/22/ca-congressman-ethics-investigation-seeks-doj-clock-boy-ahmed-probe-texas-officials/"}
