{"authors":[],"date_download":"2018-10-23 00:37:11","date_modify":"2018-10-23 00:37:11","date_publish":"2016-01-28 14:40:40","description":"Troubled Central African Republic said Thursday it will hold a deferred presidential runoff alongside a new legislative vote on February 14. The presidential...","filename":"data/vaneerConsumption/CAfricasayspresidentialrunoffnewlegislativepollonFeb14.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h0jm-2vdWmEltwXfba0ce28e6329a2da7-654_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421082_C-Africa-says-presidential-runoff-new-legislative-poll-Feb-14_1540255031.html","title":"C.Africa says presidential runoff, new legislative poll on Feb 14","title_page":"C.Africa says presidential runoff, new legislative poll on Feb 14 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"C.Africa says presidential runoff, new legislative poll on Feb 14\nTroubled Central African Republic said Thursday it will hold a deferred presidential runoff alongside a new legislative vote on February 14.\nThe presidential run-off, originally due to be held on Sunday but delayed due to organisational problems, will see two former premiers -- Anicet Georges Dologuele and Faustin Archange Touadera -- compete for election.\nA presidential decree said a December 30 legislative election annulled due to irregularities will be held along with the runoff on February 14.\nA Central African Republic police officer talks with a taxi driver outside a vote-counting centre for the presidential and parliamentary elections on January 2, 2016 in Bangui ©Issouf Sanogo (AFP/File)\nThe elections have been widely seen as turning a page on the worst sectarian violence in the traditionally unstable and dirt poor nation.\nDologuele won 23.74 percent of the vote in the first round on December 30, trailed by Touadera, who picked up 19.05 percent.\nDologuele, a 58-year-old former central banker, came to be known as \"Mr Clean\" after his attempts to bring transparency to murky public finances during his time as premier.\nTouadera, also 58, is a former maths professor who served as prime minister under disgraced ousted president Francois Bozize.\nHe was considered an outsider among the 30 candidates running for the top job.\nThe announcement comes after the country's top court on Monday annulled last month's first-round legislative vote over \"irregularities\", but said the second round of the presidential poll could go ahead.\nThere were more than 1,000 candidates in the legislative election.\nNearly two million people were eligible to vote in the polls, seen as the way out of more than two years of sectarian bloodshed that has forced about one in 10 of the nation's 4.9 million people to flee their homes.\nThe violence set mainly Muslim rebels against vigilantes from the Christian majority, with civilians the main victims.","url":"https://www.dailymail.co.uk/wires/afp/article-3421082/C-Africa-says-presidential-runoff-new-legislative-poll-Feb-14.html"}
