{"authors":[],"date_download":"2018-10-23 01:51:17","date_modify":"2018-10-23 01:51:17","date_publish":"2016-01-11 13:06:28","description":"A top candidate in presidential elections in the Central African Republic, Martin Ziguele, wants a manual recount of first-round votes because of alleged irr...","filename":"data/vaneerConsumption/CAfricanpresidentialcandidatedemandsvoterecount.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z9c8-56CX32zFKLb7123928b84cee2933-635_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3393910_C-African-presidential-candidate-demands-vote-recount_1540259477.html","title":"C.African presidential candidate demands vote recount","title_page":"C.African presidential candidate demands vote recount | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"C.African presidential candidate demands vote recount\nA top candidate in presidential elections in the Central African Republic, Martin Ziguele, wants a manual recount of first-round votes because of alleged irregularities, his party said Monday.\nZiguele, a former prime minister who came fourth out of 30 hopefuls in the December 30 vote, plans to go to the Constitutional Court to \"demand a manual recount of the voting slips\", according to the Movement for the Liberation of the Central African People (MLPC).\nThe party accused the National Authority for Elections (ANE) of breaching the electoral code as it released figures \"each day muddling up different (administrative districts) with varying rates of vote counting, rendering any checks and follow-up impossible.\"\nMartin Ziguele -- a former prime minister who came fourth out of 30 in the Central African Republic's December 30 presidential election -- plans to go to the Constitutional Court to \"demand a manual recount of the voting slips\" ©Issouf Sanogo (AFP/File)\nNearly two million people were eligible to vote in the election seen as the way out of more than two years of sectarian bloodshed that has forced about one in 10 of the nation's 4.9 million people to flee their homes.\nProvisional first-round results show former government heads Georges Dologuele and Faustin Archange Touadera poised to face off for presidential office in the second round on January 31 after leading the field of 30 candidates.\nBut Ziguele argued that the jumbled release of results made it \"impossible for each candidate to verify that all votes in their favour, constituency by constituency, polling station by polling station, have been fully taken into account.\"\nThe MLPC questioned \"a sharp and unjustified fall in the number of voters\" between partial results issued on January 6 and the full provisional figure released the next day. Around 230,000 votes went \"uncounted and thus were not attributed to candidates,\" the statement said.\nLast week, a score of presidential candidates denounced alleged fraud in the election and called for a halt to the process, but 18 of them went on jointly to back Touadera, an outsider they called \"the only real political alternative.\"\n\"Manipulation and the confiscation of the people's expression of sovereignty have in the past always been the main factors in instability and regression,\" said the MLPC, which won general elections in 1993, three years after the introduction of a multi-party system.\nCAR has been riven by coups, rebellions, army mutinies and prolonged strikes. The latest unrest, the worst violence since independence from France in 1960, has set mainly Muslim rebels against vigilantes from the Christian majority, with civilians as the prime targets.\nFrance, the African Union and the European Union have deployed troops amid fears that the conflict might escalate into a genocide. A transitional regime was formed in 2014 to pave the way for elections.","url":"https://www.dailymail.co.uk/wires/afp/article-3393910/C-African-presidential-candidate-demands-vote-recount.html"}
