{"authors":["Neil Munro"],"date_download":"2018-10-30 18:12:14","date_modify":"2018-10-30 18:12:14","date_publish":"2016-06-14 02:52:16","description":"A press conference to complain about so-called \"Islamophobia\" has been cancelled by the mass murder of 49 unarmed Americans in Orlando, Fla. | Politics","filename":"data/vaneerConsumption/CAIRCancelsIslamophobiaEventAfterIslamicMassMurderinFlorida.json","image_url":"https://media.breitbart.com/media/2016/06/GettyImages-539534464.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_06_13__1540923134.html","title":"CAIR Cancels 'Islamophobia' Event After Islamic Mass Murder in Florida","title_page":"CAIR Cancels 'Islamophobia' Event After Islamic Mass Murder in Florida | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Islamic advocates cancelled a Tuesday press conference about “Islamophobia,” amid public distress and anger following Sunday’s mass murder of 49 unarmed Americans by a Muslim in Orlando, Fla.\nThe Tuesday “Islamophobia” press conference was scheduled by the Council on American-Islamic Relations, which has generated “ample evidence to establish the associations of CAIR… with [the Jew-hating jihad group] Hamas,” according to a 2009 statement by a federal judge.\n“A forthright discussion about all forms of bias is vital to our nation,” said a spokesman for the group as they cancelled the “Islamophobia” event, which was scheduled for six-and-a-half months after the December 2015 Islamic massacre in San Bernardino, California. “However, it is our belief that in the wake of this weekend’s tragedy in Orlando, our nation should focus on addressing anti-LGBT hate,” he claimed.\nThe CAIR event was supposed to smear American groups who argue that officials are paying too little attention to the many Islamic scriptures that urge ordinary Islamic believers to attack non-Muslim civilians, such as the Americans in the gay nightclub in Orlando, Fla. The smear is included in the term “Islamophobia,” which says that normal fear or disgust over Islam’s violent teachings is a mental disease, or a “phobia” that is best cured.\nHowever, the political term has been very successful.\nIt has been embraced by progressives to help persuade themselves that immigrant Muslims are powerless victims of conservative hatred — supposedly similar to American gays and lesbians — and to help them ignore the aggressive demands in orthodox Islam for a totalitarian, brutal, anti-liberal, apartheid-like theocracy. For example, The Huffington Post published at least 10 articles citing the smear in the two days after the Muslim massacre.\nUnsurprisingly, CAIR aggressively goes after reporters who read Islamic scripture and who challenge CAIR’s “Islamophobia” claims.\nBreitbart has frequently noted that the CAIR group is so closely entwined with Islamists and with jihadis that court documents and news reports show that at least five of its people — either board members, employees or former employees — have been jailed or repatriated for various financial and terror-related offenses.\nBreitbart has also published evidence highlighted by critics showing that CAIR was named an unindicted co-conspirator in a Texas-based criminal effort to deliver $12 million to the Jew-hating HAMAS jihad group, that CAIR was founded with $490,000 from HAMAS, and that the FBI bans top-level meetings with CAIR officials. “The FBI policy restricting a formal relationship with CAIR remains … [but] does not preclude communication regarding investigative activity or allegations of civil rights violations,” said an Oct. 2015 email from FBI spokesman Christopher Allen.\nOn June 12, CAIR ejected a Breitbart reporter before the start of planned press conference on the group’s response to the massacre at the Pulse nightclub. The Breitbart reporter had planned to ask CAIR officials what steps Islamic groups are taking to distance American Muslims from orthodox Islamic scripture which frequently and clearly urge the expulsion, humiliation and the murder of homosexuals.\nFor example, orthodox Muslims believe the Koran is a perfect transcription of a divine and unchangeable book of commandments from Allah. In Verse 80 of Book 7, for example, Allah declares that “For ye practise your lusts on men in preference to women : ye are indeed a people transgressing beyond bounds … [In Sodom and Gomorrah] we rained down on them a shower (of brimstone): Then see what was the end of those who indulged in sin and crime!”\nOrthodox Muslims also say the reputed founder of Islam, Muhammad, was perfect and should be emulated by all Muslims. His statements are written up as the Hadiths, where he is shown as urging the death of homosexuals. For example, a collection of sayings byAbu Dawud records one tale “Narrated By Abdullah ibn Abbas : The Prophet (peace be upon him) said: If you find anyone doing as Lot’s people did, kill the one who does it, and the one to whom it is done.”\nHere’s a short and exemplary debate between a gay Muslim and an orthodox Islamic cleric.\nIn contrast, Catholic officially abhor homosexuality as a waste of God-given potential, but also postpone divine judgement to the hereafter because of their 2,000 year-old doctrine separating church and state. On Earth, “the Church seeks to enable every person to live out the universal call to holiness. Persons with a homosexual inclination ought to receive every aid and encouragement to embrace this call personally and fully. This will unavoidably involve much struggle and self-mastery, for following Jesus always means following the way of the Cross,” says the Catholic Church.\nIn September, CAIR also ejected this reporter after a press conference in which a CAIR official insisted it is unconstitutional for a person to oppose an Islamic presidential candidate because of the candidate’s Islamic ideology.","url":"https://www.breitbart.com/politics/2016/06/13/islamophobia-event-cancelled-islamic-mass-murder-florida/"}
