{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 18:11:23","date_modify":"2018-10-30 18:11:23","date_publish":"2016-07-05 20:32:21","description":"Two Muslim youths were injured outside a New York mosque, but police have rejected the incident as a \"bias crime\" because the two were slammed by a man after they harassed his girlfriend, officials say. | Politics","filename":"data/vaneerConsumption/CAIRClaimsHateCrimeWhenMuslimYouthsHarassWomanThenGetSlammedbyBoyfriend.json","image_url":"https://media.breitbart.com/media/2015/01/Ibrahim-Hooper-CAIR-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_07_05__1540923083.html","title":"CAIR Claims 'Hate' Crime When Muslim Youths Harass Woman, Then Get Slammed by Boyfriend","title_page":"CAIR Claims 'Hate' Crime When Muslim Youths Harass Woman, Then Get Slammed by Boyfriend | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Two Muslim youths were injured outside a New York mosque, but police have rejected the incident as a “bias crime” because the two were slammed by a man after they harassed his girlfriend, officials say.\nDuring the July 3 beating outside a Brooklyn mosque, 16-year-old Ahmad Emrech received a concussion, cuts, bruises and a swollen eye. He was taken to a local hospital for treatment and released. Another youth was also given a black eye, police report, but refused medical attention.\nAfter the attack, at least one of the Muslim teens immediately went complaining to the Muslim advocacy group CAIR. The group dutifully put out a statement insisting the teens were beaten because they were Muslim.\nIn a statement a CAIR official claimed the man who beat the teens loosed anti-Muslim slurs at the kids. The attacker allegedly shouted, “You Muslims are the cause of all the problems of the world” and called the teens “terrorists.”\nThe “slurs,” CAIR said, should force the New York Police to charge the attacker with a hate crime. “The slurs heard during the assault indicate that the attack may have been fueled by hatred of the victims’ faith, thereby warranting an investigation by law enforcement into a possible bias motive,” CAIR-NY Executive Director Afaf Nasher said in a posting to Facebook.\nBut police also report that the beatings were a result of the two teens harassing a woman sitting in a car outside the mosque. The man who beat the teens has been identified and an investigation is underway, but the incident has already been ruled out as a “bias crime.”\nU.S. court documents and news reports show that at least five of CAIR’s people — either board members, employees or former employees — have been jailed or repatriated for various financial and terror-related offenses. The evidence highlighted by critics shows that CAIR was named an unindicted co-conspirator in a Texas-based criminal effort to deliver $12 million to the Jew-hating HAMAS jihad group, that CAIR was founded with $490,000 from HAMAS, and that the FBI bans top-level meetings with CAIR officials. “The FBI policy restricting a formal relationship with CAIR remains … [but] does not preclude communication regarding investigative activity or allegations of civil rights violations,” said an Oct. 2015 email from FBI spokesman Christopher Allen.\nCAIR’s critics it harasses and threatens its political and religious rivals.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com.","url":"https://www.breitbart.com/politics/2016/07/05/two-muslim-youths-get-slammed-harassing-woman-new-york-police-rule-bias-crime/"}
