{"authors":["Alex Swoyer"],"date_download":"2018-10-30 18:12:23","date_modify":"2018-10-30 18:12:23","date_publish":"2016-03-11 14:27:23","description":"The Council on American-Islamic Relations (CAIR) and other Muslim leaders are demanding that GOP frontrunner Donald Trump issue an apology for saying “Islam hates us.” |","filename":"data/vaneerConsumption/CAIRDemandsApologyfromDonaldTrumpforSayingIslamHatesUs.json","image_url":"https://media.breitbart.com/media/2016/03/Trump-newser-Getty-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_03_11__1540923143.html","title":"CAIR Demands Apology from Donald Trump for Saying 'Islam Hates Us'","title_page":"CAIR Demands Apology from Donald Trump for Saying 'Islam Hates Us' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Council on American-Islamic Relations (CAIR) and other Muslim leaders are demanding that GOP frontrunner Donald Trump issue an apology for saying “Islam hates us.”\nCAIR has been declared a terrorist organization by the United Arab Emirates and was named by federal prosecutors as an unindicted co-conspirator in a Hamas-funding operation.\nCAIR official Nihad Awad said there are “extremist elites” who say statements that are “bigoted like Donald Trump.” He added, “They may assume the highest office of the land,” saying that’s “dangerous.”\nCAIR’s press release also argues the “Islamophobic rhetoric” from Trump and other Republican officials “is to blame at least in part for the recent unprecedented spike in anti-Muslim hate incidents nationwide.”\nCAIR held the press conference after Trump said, “I think Islam hates us,” during an interview with CNN’s Anderson Cooper.\n“We have to get to the bottom of it,” Trump stated. “There is an unbelievable hatred of us — anybody.”\nCAIR is planning on passing out free donuts and coffee across the street from Trump’s rally in Missouri Friday afternoon “in order to challenge growing hatred and bigotry with kindness and love.”","url":"https://www.breitbart.com/politics/2016/03/11/cair-demands-apology-from-donald-trump-for-saying-islam-hates-us/"}
