{"authors":["Michelle Moons"],"date_download":"2018-10-30 18:12:21","date_modify":"2018-10-30 18:12:21","date_publish":"2016-06-13 11:59:47","description":"The interview came after the early Sunday morning Islamic terror attack on an Orlando gay nightclub that left at least 50 dead and 53 more injured. The mass shooting has been deemed the worst in the history of the United States. | National Security","filename":"data/vaneerConsumption/CAIRRepAgreeswithCNNHostThatMuslimsCouldBeRadicalizedBecauseTheyHaveHomosexualTendenciesAndTheyreUpsetByIt.json","image_url":"https://media.breitbart.com/media/2016/06/GettyImages-539749146.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_06_13__1540923141.html","title":"CAIR Rep. Agrees with CNN Host That Muslims ‘Could Be Radicalized Because They Have Homosexual Tendencies And They’re Upset By It’","title_page":"CAIR Rep. Agrees with CNN Host That Muslims ‘Could Be Radicalized Because They Have Homosexual Tendencies And They’re Upset By It’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Council on American-Islamic Relations (CAIR)-FL Orlando Regional Coordinator Rasha Mubarak agrees with CNN anchor Don Lemon when he posits, “some of the people who are radicalized, could be radicalized because they have homosexual tendencies and they’re upset by it.”\n“Absolutely,” Mubarak said.\nThe interview came after the early Sunday morning Islamic terror attack on an Orlando gay nightclub that left at least 50 dead and 53 more injured. The mass shooting has been deemed the worst in the history of the United States.\nCAIR has been declared a terrorist organization by the United Arab Emirates and was named by federal prosecutors as an unindicted co-conspirator in a Hamas-funding operation.\nLemon revisited words from the Orlando Islamic terrorist’s father, who recalled his son was once disgusted at the sight of two men kissing.\nMubarak responded denouncing the shooter’s murderous actions and asserted, “Its unacceptable and it goes against everything Islam teaches.”\nLemon cited the words of a local attorney, paraphrasing the attorney’s words, “He said as a matter of fact the Muslim community and the gay community work together in this community…what’s the reaction?”\nMubarak responded, “Absolutely,” calling the gay community part of her “movement family.” She told Lemon that the two groups work together in the legislature “fighting anything anti-phobic for both of our communities.” She projected an image of “camaraderie” between Orlando Muslim and LGBTQ communities.\nLemon said, “Yeah and but ya know we say the LGBT community and the Muslim community, there are gay Muslims.”\nMubarak agreed, “Absolutely, yes…”\nLemon responded, “Right?”\nMubarak said, “Right.”\nLemon asked Mubarak, “so the two communities are combined at some point right?”\nMubarak agreed, “Right.”\nLemon went on, “When there are gay Muslims right.” He continued, “What do you make of this idea that ya know about homosexuality being a sin, that Muslims are not gay? There are gay Muslims. And some of the people who are radicalized, could be radicalized because they have homosexual tendencies and they’re upset by it.”\nMubarak agreed, “Absolutely. There’s homosexuality no matter what religion or race you come from and I think that the world needs to open their eyes and understand that. Muslim or not Muslim, I mean Planned Parenthood happened because of extremists.”\nAndrew McCarthy, former Chief Assistant United States Attorney in the Southern District of New York, rather informed SiriusXM Breitbart News Sunday listeners that it is Islamic Law that is at the root of the jihadists attacks like the one in Orlando. McCarthy said, “There are authoritative treatises of Sharia, of Muslim law, that very blatantly and plainly lay out the fact that Islam’s hostility to homosexuals is scripturally-based and more importantly for our present purposes is that Sharia, which is the Muslim societal system.”\nLast December’s Islamic terror attack on an office Christmas party in San Bernardino, California left 14 dead and over 20 more injured. One of the two attackers had been working on terror attacks plans for years with the aim of causing maximum casualties. He had studied the terror magazine Inspire, terror group videos and teachings from now deceased Islamic terror leader Anwar al-Awlaki. The American-born Awlaki was touted as a moderate Muslim while teaching as an imam at mosques in the United States. Once he moved overseas to Yemen he began producing videos preaching jihad against America.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/national-security/2016/06/13/cair-rep-agrees-with-cnn-host-that-muslims-could-be-radicalized-because-they-have-homosexual-tendencies-and-theyre-upset-by-it/"}
