{"authors":["Zoe Nauman For Dailymail.Com"],"date_download":"2018-10-23 03:39:04","date_modify":"2018-10-23 03:39:04","date_publish":"2016-01-28 19:09:49","description":"According to TMZ on Thursday, the 66-year-old and Kim Howe's stepchildren have filed to dismiss, and a settlement has been reached over the crash which happened in February 2015.","filename":"data/vaneerConsumption/CaitlynJennersettlesfatalcarcrashlawsuit.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/20/30AD3B4500000578-0-image-a-66_1454012522137.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421526_Caitlyn-Jenner-settles-fatal-car-crash-lawsuit-Kim-Howes-stepchildren-modest-amount_1540265944.html","title":"Caitlyn Jenner settles fatal car crash lawsuit","title_page":"Caitlyn Jenner settles fatal car crash lawsuit | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Crash last year - when Caitlyn was still known as Bruce Jenner - killed 69-year-old\nCaitlyn Jenner has settled a lawsuit over the Pacific Coast Highway car crash she was involved in last year which left a woman dead.\nAccording to TMZ, the 66-year-old and Kim Howe's stepchildren have filed to dismiss, and a settlement has been reach between them.\nThe fatal crash happened in February last year.\nScroll down for video\nFile to dismiss: Caitlyn Jenner has settled the lawsuit which resulted in the death of Kim Howe it was revealed on Thursday - she is seen here at an NBCUniversal chat in January in Pasadena\nAccording to court documents, William Howe and Dana Redmond filed for the dismissals on Tuesday.\nCaitlyn, who was still known as Bruce Jenner at the time, slammed into the back of one car when she was driving along the highway, in Malibu, starting a chain reaction.\nDana and William's stepmother Kim was driving a Lexus during a multi-vehicle wreck\nFatal: Caitlyn, who was still known as Bruce Jenner at the time, slammed into the back of one car when she was driving along the highway, in Malibu, starting a chain reaction\nSources told the website the case was settled for a 'very modest amount.'\nThe reason it claimed was down to the stepchildren having no legal standing to press a case.\nA small amount of money changed hands, which was paid by insurance.\nThe family filed a wrongful death lawsuit against Jenner in May last year.\nThe four car wreck resulted in the death of 69-year-old Kim.\nTragedy: Dana Redmond and William Howe's stepmother Kim (pictured) was driving a Lexus during a multi-vehicle wreck\nAfter the accident Caitlyn said in a statement: 'My heartfelt and deepest sympathies go out to the family and loved ones, and to all of those who were involved or injured in this terrible accident.\n'It is a devastating tragedy and I cannot pretend to imagine what this family is going through at this time. I am praying for them. I will continue to cooperate in every way possible.'\nThe family pursued their lawsuit against Jenner, which accused her of being 'careless, negligent, and reckless' as well as seeking unspecified damages.\nAftermath: After the accident Caitlyn said in a statement, 'My heartfelt and deepest sympathies go out to the family and loved ones, and to all of those who were involved or injured in this terrible accident'\nDismissed: Sources told the website the case was settled for a 'very modest amount'\nCaitlyn, who was uninjured in the accident, responded later that same month, saying the plaintiffs were 'financially independent and successful adult stepchildren, ages 60 and 57, living and working and residing out-of-state for decades.'\nTherefore, the response argued, the two cannot claim that they were financially dependent on their late stepmother.\nKim Howe's family were vociferous in their criticism of the accident.\nIn July last year, after seeing footage of the crash on a surveillance tape, which was obtained by ET, their attorneys, Jeffrey Wolf and John Sheehan said in a statement: 'We encourage Ms. Jenner to be that role model that she seeks to be. That means accepting responsibility for what she has done.'\nIn September, it was revealed the former Olympian would not face any charges over the accident.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421526/Caitlyn-Jenner-settles-fatal-car-crash-lawsuit-Kim-Howes-stepchildren-modest-amount.html"}
