{"authors":["James Dunn For Mailonline"],"date_download":"2018-10-22 22:40:38","date_modify":"2018-10-22 22:40:38","date_publish":"2016-01-11 03:35:30","description":"A number of vendors have set up stores across the sprawling Calais Jungle camp selling items ranging from cigarettes and electrical supplies to fizzy drinks.","filename":"data/vaneerConsumption/CalaisJungleshopscashinonnewarrivalsincamp.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/300CC23100000578-0-image-a-74_1452528572710.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393340_Calais-container-city-Units-recycled-rooms-set-house-1-500-migrants-new-area-Jungle-camp-prepares-open_1540248038.html","title":"Calais Jungle shops cash in on new arrivals in camp","title_page":"Calais Jungle shops cash in on new arrivals in camp | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Make-shift shops operating in the the Calais Jungle are preparing to cash in on new arrivals to the migrant camp, which has become so big it now has road names - including David Cameron street.\nAs the site has grown, a number of vendors have set up stores across the sprawling camp selling items ranging from cigarettes and electrical supplies to fizzy drinks.\nAnd they can expect some extra business in the weeks to come after a new section of the camp was unveiled, featuring metal transport containers capable of housing 1,500 people.\nIt comes as a final decision is expected on a new £1.1million centre in Dunkirk that could house up to 3,000 migrants, although many fear it will be rejected as the plan has met fierce local opposition.\nOpening hours: A Pakistani migrant looks out of his shop which he has set-up at the sprawling migrant camp known as the 'Jungle' in Calais\nDirections: The Calais Jungle migrant camp is now so big it features its own road names, including a boggy track known as David Cameron Street\nWorkers walk past converted containers, at the entrance of the Calais refugee camp in northern France. Approximately 130 containers will be converted to shelters\nHundreds of migrants will swap squalor for new beds in shipping containers that have today become a permanent migrant camp\nPresident Francois Hollande’s £20million scheme is being compared to the disastrous Sangatte camp that opened in 1999 but was closed three years later after becoming a haven for trafficking gangs\nMigrants walk over the muddy ground between made up restaurants and small shops in the makeshift camp called 'The Jungle'\nParts of the camp are now flooded after the rain throughout December and January, but there is no escape for those living here\nBoth the £20million scheme opening today and the Dunkirk camp have been compared to the disastrous Sangatte camp that opened in 1999 but was closed three years later after becoming a haven for trafficking gangs.\nThe new section of the Jungle camp in Calais will be a welcome change for many migrants currently living in tents made from basic materials such as rope and tarpaulin that they have lived in for months in squalid conditions.\nBut there are not enough beds for everyone in the new section as there is estimated to be 4,000-7,000 migrants at the camp.\nPictures already show a dividing line between the clean white containers and the muddy, flooded conditions outside it.\nThose who have not been given beds in the new section of the camp will be offered free transport to other refugee camps in France and will be encouraged to seek asylum, The Telegraph reports.\nThe planned tented facility near Dunkirk would be the country’s first official camp in more than 13 years. But government-appointed Prefect, Jean-François Corde, said he would rather see no camp at all in the region.\nJust five miles from the ferry port, critics claim it will act as a magnet for migrants and become the latest ‘jumping off point’ for those trying to enter the UK.\nPeople in The Jungle have created a way of life at the camp, even setting up shops to buy essentials in the migrant camp\nThe state has converted dozens of the metal transport containers into homes for 1,500 people that have been living in tents amid the mud and squalor of the infamous Jungle camp in Calais\nNew containers will be a welcome change from the tents and wooden huts, although there is objection to any kind of permanent camp from city officials in France\nThere are currently an estimated 4,00-7,000 migrants at the camp in Calais, where they have built a number of amenities in what has become a transient community\nMigrants wait for the rain to stop in a makeshift restaurant in a camp that has grown massively over the last years, as more immigrants continue to pile in from war-torn regions in the Middle East and North Africa\nIt too has been compared to the notorious Red Cross Sangatte camp near Calais, which was closed in 2002 after massive overcrowding led to rioting.\nThe new encampment at Grand-Synthe will have heated tents, running water, toilets and showers and will be built close to the site of an existing rat-infested shanty town where thousands are squatting.\nIt is less than 30 miles from the ‘new Jungle’ camp near Calais where around 5,000 migrants wait while they try to reach the UK on board lorries and ferries.\nThere were fears that Britain - which has already handed over millions of pounds towards security measures including fences and CCTV at Calais and the Channel Tunnel - would be expected to pay towards the camp, but France has since agreed to pick up the bill.\nNumbers living there have risen from about 80 a year ago to around 3,000 – a seventh of Grande-Synthe’s official population of 21,000. The migrants, almost exclusively Iraqi Kurds, are camping in squalid conditions on marshland infested by rats and where disease is rife.\nThe camp was never properly planned, and there is inadequate drainage, so heavy rainfall has turned large parts of it into a giant swamp\nMigrants tread the muddy tracks that separate the wooden huts and tents, but France is planning a more long-term solution to a problem that is only getting worse as more migrants arrive in Europe\nMigrants here in The Jungle that do not have beds in the new centre will be encouraged to travel to other migrant centres elsewhere in the country, and the government has agreed to pick up the bill\nThe Jungle (pictured) has been compared to the notorious Red Cross Sangatte camp near Calais, which was closed in 2002 after massive overcrowding led to rioting\nThe new section of the Jungle camp in Calais will be a welcome change for 1,500 migrants currently living in wooden huts and tents made from basic materials such as rope and tarpaulin that they have lived in for months in squalid conditions\nTraffickers operating out of Dunkirk usually load migrants on to lorries, vans and cars in motorway service stations and lay-bys several miles from the port.\nBut the move has been criticised by British MPs, who say that France should look after migrants at the point of entry, not in a locations that gives them easy access to Britain.\nTory MP Tim Loughton, a member of the Commons home affairs select committee, said construction of the camp was a ‘really unhelpful move by France on all fronts’.\n‘If they are genuine about looking after refugees, then it needs to be at their point of entry rather than as a jumping-off point for the UK, where they have no right of abode,’ he said.\nA Kurdish child stands over a drenched mattress in the mud next to her family tent in the makeshift migrant camp in Grande-Synthe near Dunkirk, France\nKurdish migrants works around the tents of the migrant camp\nA decision to relocate the refugee camp inhabitants to a new to-be-constructed building, aimed to improve miserable conditions, is expected to be made\nKurdish children climb on a trailer as they play around the volunteers in the makeshift migrant camp in Grande-Synthe\nDespite most of the attention on the so-called 'Jungle' in near-by Calais, the refugee camp in Grande-Synthe counts an estimated 3,000 residents\nThe Dunkirk area has suffered heavy rains in recent weeks making conditions miserable for migrants at the camp\nVolunteers from Holland set up a bridge over the mud using pallets","url":"https://www.dailymail.co.uk/news/article-3393340/Calais-container-city-Units-recycled-rooms-set-house-1-500-migrants-new-area-Jungle-camp-prepares-open.html"}
