{"authors":["Kaitlin Reilly"],"date_download":"2018-10-31 01:35:37","date_modify":"2018-10-31 01:35:37","date_publish":"2014-08-12 19:48:15","description":"The summer season of Pretty Little Liars pressed the reset button on the ABC Family mystery series in a major way. Season 5 saw the return of the infamous Alison DiLaurentis to Rosewood, which shook up not only the lives of her four best friends but…","filename":"data/vaneerConsumption/CalebMayDieIfRavenswoodEventsPlayIntoThePrettyLittleLiarsFatalFinale.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/fe8a6b06-b55c-4d76-a7c1-c174e2307933.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_34957-caleb-may-die-if-ravenswood-events-play-into-the-pretty-little-liars-fatalfinale_1540949737.html","title":"Caleb May Die If 'Ravenswood' Events Play Into The 'Pretty Little Liars' #FatalFinale","title_page":"Caleb May Die If 'Ravenswood' Events Play Into The 'Pretty Little Liars' #FatalFinale","title_rss":"NULL","source_domain":"bustle.com","text":"The summer season of Pretty Little Liars pressed the reset button on the ABC Family mystery series in a major way. Season 5 saw the return of the infamous Alison DiLaurentis to Rosewood, which shook up not only the lives of her four best friends but also the lives of just about everyone in the little Pennsylvanian town. But while Ali may have been the most surprising former Rosewood resident to return home, she wasn't the only one who made the trip back home. Hanna's former boyfriend Caleb spent time in ghostly Ravenswood and returned to Rosewood after; now it seems that Caleb himself came back haunted. That's not particularly surprising — after all, Caleb's stint on Ravenswood brought him face to face with death more than once. Now, Pretty Little Liars may make Caleb face death once again — and this time, he might not turn around unscathed.\nPretty Little Liars loves incorporating mysterious hashtags into their major episodes to get fans on social media excited about the episode. The Season 5 finale \"Taking This One To The Grave\" airs on August 25, and already the show is promoting the spooky hashtag — and things aren't looking good for our beloved characters. According to ABC Family, we're in for a #FatalFinale and the possibility of \"one less liar.\" While there are a ton of characters who could bite the dust in the finale, there's a possibility that the person who joins the ranks of Shana, Garrett, and Detective Wilden is none other than Caleb — and we can blame Ravenswood for that.\nCaleb's time on Ravenswood involved him diving deep into the haunted town's history, which was connected to his own mysterious past. Caleb learned that his family was originally from Ravenswood, and that his ancestor was the victim of a pact that the townspeople made with the devil a century earlier. The Ravenswood townsfolk arranged a shady deal with a \"Pact Maker,\" who promised them that the Ravenswood soldiers who left for battle would make a safe return home. In exchange, the townsfolk agreed to sacrifice the lives of five innocent teens. Caleb's ancestor was one of the teens who died, and Caleb and his four new friends were slated to be next.\nThings didn't work out in the way that the Pact Maker had planned — only one of Caleb's friends died in the accident that was supposed to kill all five teens at once. The Pact Maker then planned to bring Miranda, the only girl who died in the accident, back to life — something that, in the finale, was suggested as a true possibility. Unfortunately, Ravenswood was cancelled before Miranda could come back to life, and from Caleb's less-than-cheery disposition on Pretty Little Liars, we can assume she never did.\nIf the pact worked the way we assumed it did on Ravenswood, then death shouldn't stop following Caleb around, even though he no longer lives in the haunted town. Could Caleb's bad attitude be because he knows that death is coming for him? It's certainly a possibility — and it would fit perfectly into the finale's hashtag.\nIf the Pact Maker has his way, then Miranda would come back to life so that Miranda, Caleb, and their three other friends would be killed at the same time, which would pay off Ravenswood's morbid debt to the Pact Maker. I assumed that Caleb's attitude had to do with not being able to save Miranda — after all, she is suspiciously missing from Caleb's world, even in her ghostly form. What if Miranda did get brought back to life — possibly by someone with good intentions, like her uncle, Collins — but the Pact Maker got wind of it and vowed to kill off the five teens for good?\nCaleb's return to Rosewood was sudden and unexpected — perhaps Caleb wanted to run away from the Ravenswood pact once he realized that Miranda's resurrection meant that his death was imminent. The scariest part of this idea is that Caleb's running may be futile — there's a chance that, due to the pact, Caleb was fated to die all along, no matter what the circumstances. After all, he did cheat death once — he might not be able to do it again.\nOf course, this is pure speculation — Caleb is a fan favorite and it would be a huge bummer to lose him for good just episodes after he returned to PLL. That being said, Caleb's death would also be a huge twist for the show, and a way to tie up Ravenswood's loose ends. Whatever happens in the #FatalFinale, one thing is for sure: We need to start expecting the unexpected.\nImages: ABC Family; Giphy; ravenswood-onabcfamily/tumblr","url":"https://www.bustle.com/articles/34957-caleb-may-die-if-ravenswood-events-play-into-the-pretty-little-liars-fatalfinale"}
