{"authors":["Chriss W. Street"],"date_download":"2018-10-30 19:24:10","date_modify":"2018-10-30 19:24:10","date_publish":"2015-02-16 14:02:25","description":"Cal High Speed Rail Confiscating Farms for Real Estate Development Profits","filename":"data/vaneerConsumption/CalHighSpeedRailConfiscatingFarmsforRealEstateDevelopmentProfits.json","image_url":"https://media.breitbart.com/media/2014/12/high-speed-rail-CAHSRA.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_02_16__1540927450.html","title":"Cal High Speed Rail Confiscating Farms for Real Estate Development Profits","title_page":"Cal High Speed Rail Confiscating Farms for Real Estate Development Profits","title_rss":"NULL","source_domain":"breitbart.com","text":"Breitbart reported in November that in the six years since California legislature approved the High-Speed Rail Authority (HSRA), just 7% of the 1,100 pieces of land needed for the first leg to travel 130 miles across farm country had been acquired.\nWith the project billions over budget, HSRA’s chair has admitted the agency plans to make billions in profits by confiscating farmland under eminent domain for real estate development and advertising rights along the rail line.\nBecause California has had a horrible record of starting and then later abandoning freeways, power plants and other highly expensive infrastructure projects; the state legislature was forced to add a series of provisions to pass AB 3034 for approval of the high-speed rail project. The restrictions were meant to ensure the train is not partially built and then becomes what “government-speak” refers to as a “stranded investment.”\nThe most common reasons so many California infrastructure projects have become “stranded” is that the state legislature is notorious for drastically underestimating the cost of obtaining lands and construction in order to ensure approval for the projects.\nState planners knew that the most difficult sections to complete for the 381-mile long rail project would be crossing the 7,680-foot-high Tehachapi Mountain range and tearing up huge swaths of the densely populated Bay Area and Los Angeles Basin–so planners picked the flattest, straightest and most desolate area for the first segment.\nThe HSRA budgeted only $766 million for land acquisition–mostly farmland–along this initial stretch of track. But of the 822 parcels the state tried to buy between Madera and Bakersfield, it was only successful in acquiring 106 properties. Although government planners have called the prices they are offering farmers as “fair value,” the vast majority of property owners have bitterly called the offers pennies-on-the-dollar.\nAlready running substantially over budget, the HSRA is resorting to “eminent domain,” known un-affectionately as “condemnations.” On Friday the 13th, the Public Works Board adopted another 31 resolutions to declare a public need to take 33 more property parcels totaling 69 acres in Madera and Fresno County. The HSRA has now quietly received approval for 275 eminent domain resolutions, about a third of the 822 parcels of property parcel they want to buy.\nEminent domain is so controversial that on June 3, 2008, California voters passed Proposition 99 as a constitutional amendment by a roughly 62% to 38% margin. The proposition prohibited state and local governments from acquiring any owner-occupied residence for the purpose of conveying it to another person, usually a crony developer. But unfortunately, with Proposition 99 continuing to allow eminent domain to take businesses, HSRA wants to take owner-occupied family farms as businesses.\nUnder the eminent domain process, the HSRA can go to court to acquire property for a public project when the agency and property owner do not agree on the price or terms. The agency must first adopt a “Resolution of Necessity,” and then file an eminent domain lawsuit in the Superior Court where the property is located.\nA judge first decides whether the agency is entitled to the property, and then a trial determines the fair market value and other “just compensation” due the owner. The verdict must be no lower than the agency’s offer and no higher than the owner’s counteroffer. But the large percentage of farmers unwilling to sell is a sign the Cal Rail is bidding exceptionally low, and then hoping that the judge “splits the difference.”\nDan Richard, Chairman of the Board of the HSRA, acknowledged to the Los Angeles Times in January that the agency is already short billions of dollars to complete the project. But he then admitted that the agency plans to use “advertising and real estate development rights along the route could provide large amounts of cash.”\nOn Jan. 6, 2015, Gov. Jerry Brown staged a highly scripted ceremonial groundbreaking for the high-speed rail project in a decaying inner-city industrial site in Fresno. Near vacant lots where homeless and druggies gather each night, Brown tried to “reset” public debate on the controversial $68 billion project by comparing the rail line to the construction of the great cathedrals of Europe, which took generations. “The high-speed rail links us from the past to the future, from the south to the north,” he said.\nBut just like the medieval land confiscations and heavy taxation of the peasantry to pay for those “great cathedrals of Europe” as monuments to the egos of their elitist rulers, Central Valley family farms are being confiscated for less than fair value so that high speed rail can serve as a monument to California’s modern elitist rulers.","url":"https://www.breitbart.com/local/2015/02/16/cal-high-speed-rail-confiscating-farms-for-development-profits/"}
