{"authors":["Elizabeth Castillo","Dan Morain","David Gorn"],"date_download":"2018-10-30 22:30:39","date_modify":"2018-10-30 22:30:39","date_publish":"2018-07-24 23:57:17","description":"A bill would make California the first in the nation to require that abortion pills be available at student health centers on all CSU and UC campuses.","filename":"data/vaneerConsumption/Californiasoonmaybefirststatetorequirepublicuniversitiestoofferabortionpills.json","image_url":"https://calmatters.org/wp-content/uploads/ThinkstockPhotos-868576798-e1532475834894.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938639.html","title":"California soon may be first state to require public universities to offer abortion pills","title_page":"California soon may be first state to require public universities to offer abortion pills | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Jessica Rosales recalls plunging into a downward spiral after discovering that her birth control had failed and she was pregnant. A financially unstable third-year student at UC Riverside, she immediately sought an abortion —something the campus student health clinic did not provide.\nInstead she was referred to private medical facilities off campus. One wouldn’t accept her insurance; the other didn’t provide abortions. Her grades slipped, she said, and she frequently slept the days away to escape her circumstances. Eventually she traveled six miles to a Planned Parenthood clinic that performed the procedure. Ten weeks had passed.\n“My situation could have been avoided if the student health center was there and provided medication abortion for students on campus,” Rosales said.\nA bill advancing in the Legislature would make California the first in the nation to require that abortion pills be available at on-campus health centers. The legislation, which has passed the Senate and is advancing in the Assembly, would mandate that all California State University and University of California campuses make the prescription abortion drug RU 486 available at their on-campus student health centers by Jan. 1, 2022.\nFunding, at least for the first year, would be provided not by taxpayers but by donations from a private foundation.\nAdvocates say making the drug available on campus is an essential part of guaranteeing access and ensuring that college women are able to terminate a pregnancy, if and when they choose.\n“It’s necessary because it’s a constitutionally protected right, but just because it’s a constitutionally protected right does not mean you have access,” said state Sen. Connie Leyva, the Chino Democrat who authored the bill.\nBut opponents say the proposed law is a solution in search of a problem, and that it could endanger women’s health and potentially saddle public universities with additional ongoing costs. They note that campus health centers currently refer students to off-campus abortion providers, and that UC and CSU campuses are located an average of less than 6 miles from such facilities.\n“The abortion industry strategically places their facilities close to young women, that demographic, and of course close to universities,” said Anna Arend, Northern California regional coordinator of Students for Life of America, which opposes the bill. “There really is no issue of access. It’s a made-up problem.”\nStill, some campuses have more access than others. While UC Santa Cruz is located 2 miles away from a Planned Parenthood clinic providing abortion services, UC Davis is over 11 miles away from such a clinic. San Diego State is located just 1 mile away from a clinic, but CSU Stanislaus is located over 14 miles away from one. For students without a car, like Rosales, that can add up to hours on public transit.\nCampus health centers provide students a wide range of services: immunizations, contraception, mental health services, x-rays, dental and optical services among them. Exact services offered vary by campus—some offer IUD insertions, for example, while others do not. They do not, for example, offer childbirthing services.\nAdiba Khan, a campus organizer with the foundation, said she helped launch the effort to pass the bill after several of her classmates at UC Berkeley experienced difficulty obtaining abortion pills during the first 10 weeks of pregnancy.\nAfter that, a pill is no longer an option—abortion would require a more medically invasive procedure, such as a suction method. The bill would require campuses to make abortion pills, but not more involved procedures, available.\n“Most people don’t find out that they’re pregnant until five, six weeks in, so that’s a really short time crunch,” said Khan, adding that it’s not unusual for students to have to wait a week or more for a health center appointment\n“Students at UCLA and Berkeley still experience a bad time so just imagine students who are in more secluded areas,” she said. “They have to go through an insane battle to be able to get an abortion.”\nThe CSU and UC system haven’t taken a position on the bill, but both systems want to ensure that adding abortion pill services wouldn’t ultimately raise student fees, which provide the primary funding for campus health centers.\nThe Women’s Foundation of California has secured up to $20 million in private start-up money for the first year from prominent health advocacy groups and anonymous donors. The foundation, which says it focuses on gender, racial, and economic justice, maintains that one year of funding at $200,000 per campus, along with an additional $200,000 each to the UC and CSU systems, will be more than enough to cover costs.\nSome lawmakers question what happens once the initial funding runs out.\nDuring a hearing of the Assembly Health Committee, Madera Republican Assemblyman Frank Bigelow said he wanted to guarantee that schools wouldn’t be forced to use money from campus general funds or other student fees to pay for abortions.\n“I would hope that you would look at further refining so that we limit that complete ability for them to use the public-sector funds,” Bigelow told Leyva.\nLeyva explained that some of the startup money would be used to teach campus health centers prescribing the pills how to bill health insurers—including private health plans, campus student health insurance programs and Medi-Cal, for the poorest students. By the second year, she contends, campuses will be able to use such reimbursements to fully cover their costs to provide abortion pills.","url":"https://calmatters.org/articles/california-abortion-pills-public-universities/"}
