{"authors":["Pauline Bartolone","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:53:53","date_modify":"2018-10-30 22:53:53","date_publish":"2015-09-09 08:00:00","description":"Some of the world's most ambitious climate change legislation is currently under consideration in America. But the lawmakers in question aren't in D.C. —","filename":"data/vaneerConsumption/Californiaconsiderssweepingproposalstocutgreenhousegasemissions.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/stockton_tailpipe-thumbnail-1200x1200-70.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940033.html","title":"California considers sweeping proposals to cut greenhouse gas emissions","title_page":"California considers sweeping proposals to cut greenhouse gas emissions | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Some of the world’s most ambitious climate change legislation is currently under consideration in America. But the lawmakers in question aren’t in D.C. — they’re in Sacramento.\nCalifornia lawmakers are intensely debating far-reaching goals to curb greenhouse gas emissions.\nThe bill contains three proposals: one to double energy efficiency in buildings, one to derive 50 percent of electricity from renewable sources and one head-turning proposal to cut petroleum use in vehicles by half — all in the next 15 years.\nCalifornia has a reputation for going one step beyond the status quo of environmental policy.\nNow it’s doing it again with climate change — and lawmakers say the state’s track record gives them confidence to propose much tougher rules.\nCalifornia’s previous environmental efforts have included years spent working to make cars run more cleanly. At a recent event in Stockton, Calif., drivers could check smog pollution and receive repair vouchers — and owners of high-polluting cars were invited to test drive electric vehicles.\nLegislators hope at least a million low-emission vehicles will be on the road in the coming years. Funds from California’s 9-year-old global warming law currently help people buy them, and there’s widespread belief California will meet the 2020 emission reduction goals that law set.\nBut Gov. Jerry Brown says California’s current climate change work isn’t enough. The proposed legislation lays out his loftier goals.\n“This is exciting, it’s bold,” Brown says. “It’s absolutely necessary if we are to have any chance of stopping potentially catastrophic changes to our climate system.”\nCatherine Reheis-Boyd of the Western States Petroleum Association is fiercely opposed to the gasoline reduction goal.\n“It is a mandate to accomplish an infeasible goal, within an infeasible time,” she says.\nShe says there are no details about how the goal can be accomplished in the bill. “That has huge impacts on jobs, the economy, people’s ability to move, and to have energy security in the state of California.”\nBut Washington, D.C.-based Resources for the Future says California’s proposed goals are both ambitious and feasible.\nWhat’s more, says senior fellow Dallas Burtraw, “the ambition is going to be contagious.”\nBurtraw says for decades, California has been ahead in environmental policymaking. When the nation catches up, the state takes one step forward again.\nHe says if the legislation passes, D.C. would again take notice, and California would be the buzz of climate talks in Paris this December.\n“It will be taken as a — more than a signal, almost a ratification that we are going down this pathway inevitably,” Burtraw says, “and many innovators and investors I expect to really come full in.”\nBut if California wants to reduce global pollution, it shouldn’t get too distracted with state goals, says UC Berkeley energy economist Severin Borenstein. California emits only about 1 percent of the world’s greenhouse gases, he says, so the focus should be on cleaner technology for the developing world.\n“We have a responsibility for not just reducing ours, but in actually figuring out how the developing world can develop in a way that’s not going to be as greenhouse-gas-intensive as the way we did,” he says.\nAnd, Borenstein says, technological innovation is an area where California has the resources to take the lead.","url":"https://calmatters.org/articles/california-considers-sweeping-proposals-to-cut-greenhouse-gas-emissions/"}
