{"authors":[],"date_download":"2018-10-22 21:44:21","date_modify":"2018-10-22 21:44:21","date_publish":"2014-05-08 02:03:33","description":"After allegedly killing his live-in girlfriend, \"Moe\" Fleming may have used firefighting access to vanish into the backcountry, authorities say.","filename":"data/vaneerConsumption/CaliforniaFireChiefSoughtinBrutalMurderMayBeHidinginMountains.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/427956/140507-sarah-douglas_c3576f43c304b0facea354def40fa54e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_california-fire-chief-sought-brutal-murder-may-be-hiding-mountains-n99971_1540244661.html","title":"California Fire Chief Sought in Brutal Murder May Be Hiding in Mountains","title_page":"California Fire Chief Sought in Brutal Murder May Be Hiding in Mountains","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAuthorities in California are conducting a statewide manhunt for a state fire battalion chief suspected of “brutally and violently” stabbing his live-in girlfriend to death before possibly fleeing into the wilderness.\nThe Sacramento County Sheriff’s Department on Wednesday released four photos of 55-year-old Orville “Moe” Fleming, who is accused of killing 26-year-old Sarah Douglas at their Sacramento home on May 1.\nIt also issued a statement describing him as “an avid outdoorsman” who has “keys to fire gates, trails and Cal Fire facilities throughout the state, in his possession.”\nThat means that Fleming has easy access to hundreds of miles of back roads and other state supplies and facilities, Sheriff’s Department spokeswoman Sgt. Lisa Bowman told NBC News.\n“His keys are missing, and those keys open up miles and miles of trails and dirt roads that the public doesn’t have access to in some of the most rural parts of the state,” she said. “That includes food bins, lookout towers and live-in shacks.”\nFleming, a 24-year veteran of the California Department of Forestry and Fire Protection, known as Cal Fire, met Douglas through an adult services website two years ago where she was advertised as an escort and the two had been living together recently, Bowman said.","url":"https://www.nbcnews.com/news/us-news/california-fire-chief-sought-brutal-murder-may-be-hiding-mountains-n99971"}
