{"authors":["Associated Press"],"date_download":"2018-10-22 20:14:53","date_modify":"2018-10-22 20:14:53","date_publish":"2016-01-29 00:58:12","description":"FRESNO, Calif. (AP) — California homeowners and businesses installing rooftop solar panels can keep offsetting their energy bills by sending surplus power ba...","filename":"data/vaneerConsumption/CaliforniaregulatorsRooftopsolarcustomerskeepcredit.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422005_Regulators-Rooftop-solar-customers-credit_1540239293.html","title":"California regulators: Rooftop solar customers keep credit","title_page":"California regulators: Rooftop solar customers keep credit | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"California regulators: Rooftop solar customers keep credit\nFRESNO, Calif. (AP) — California homeowners and businesses installing rooftop solar panels can keep offsetting their energy bills by sending surplus power back to the grid, regulators said Thursday in a decision celebrated by the solar industry.\nNew guidelines narrowly approved by the California Public Utilities Commission add fees to future solar users, but they fall short of what utility companies sought to charge customers for their use of the grid.\nSolar customers will pay up to $150 in a onetime fee for connecting to the grid and up to $10 each month. Existing solar customers aren't affected by the changes approved by the commission in a 3-2 vote.\nBernadette Del Chiaro, executive director of the California Solar Energy Industries Association, said that the ever-dropping costs of solar equipment should offset the new fees.\n\"At the end of the day, going solar in California will remain a very good economic investment,\" Del Chiaro said, adding that Nevada and other states have raised fees on customers, pushing the solar industry out of the market.\n\"This has been a clear signal that California is building our grid in a different way,\" she said.\nSouthern California Edison, San Diego Gas & Electric and Pacific Gas & Electric pressed the commission to charge solar owners heftier fees so the cost of running the grid doesn't fall on non-solar customers.\nPG&E spokeswoman Ari Vanrenen said in a statement that the power company supports the continued growth of rooftop solar in California, but she called the decision disappointing.\nThere remains a need to reform California's energy regulation so that it supports a sustainable solar market in California and is fair to everybody, she said.","url":"https://www.dailymail.co.uk/wires/ap/article-3422005/Regulators-Rooftop-solar-customers-credit.html"}
