{"authors":["John Pudner"],"date_download":"2018-10-30 18:50:25","date_modify":"2018-10-30 18:50:25","date_publish":"2015-07-20 14:33:53","description":"East Coast bias is the only reason we can explain Juju Smith being snubbed from from the preseason Biletnikoff Award list as one of nation's top receivers. |","filename":"data/vaneerConsumption/CaliforniaTop25StudentAthletestoWatchin201516.json","image_url":"https://media.breitbart.com/media/2015/07/california-juju-smith-usc-ap-photo-rick-bowmer-crop.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_07_20__1540925425.html","title":"California: Top 25 Student-Athletes to Watch in 2015-16","title_page":"California: Top 25 Student-Athletes to Watch in 2015-16 | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"East Coast bias is the only reason we can explain Juju Smith being snubbed from from the preseason Biletnikoff Award list as one of nation’s top receivers.\nWe ran the Value Add Sports calculations on all returning California athletes and emailed 139 sports writers and other experts in the state to help rank the 25 state players to watch on a list we will update here.\nThe USC receiver beat out great athletes from rival UCLA and Cal, as well as a host of great track, soccer, baseball, and basketball players from Cal State Northridge, Fresno State, Long Beach State, Pepperdine, Sacramento State, San Diego State, and Santa Clara.\nFrankly, we find it shocking that Smith could be left off the list of 48 receivers considered for the award. Rarely do you see a freshman as dominant, and players make their biggest jump between their freshman and sophomore years.\nNow add that with Nick Agholor going to the NFL Smiths become the main target for his main competition for top player in the state, quarterback Cody Kessler. He also plays alongside two other great receivers in Darreus Rogers and Adoree Jackson to keep defenders from focusing on him.\nSmith’s Freshmen Stats vs. Result Rec Yds Avg Fresno Won 52-13 4 123 30.8 at Stanford Won 13-10 1 -2 -2.0 at Boston College Lost 37-31 6 49 8.2 Oregon St. Won 35-10 3 13 4.3 Arizona St. Lost 38-34 4 24 6.0 at Arizona Won 28-26 4 39 9.8 Colorado (TD) Won 56-28 4 104 26.0 at Utah (TD) Lost 24-21 6 77 12.8 at Washington St. (3Tds) Won 44-17 6 74 12.3 Cal Won 38-30 4 30 7.5 at UCLA Lost 38-20 4 79 19.8 Notre Dame Won 49-14 5 48 9.6 Nebraska Won 45-42 3 66 22.0\nTiger Woods edges out Brady as the best athlete ever from California despite the sad showing this weekend that indicates Woods likely plays in the twilight of his career.\nHere are the top 25:\nJuju Smith, USC, Football, Cody Kessler, USC Trojans, Foot, QB Jaylen Brown, California, Basket, PF Andi Sullivan, Stanford, Soccer, Midfielder Kaulyn Lee-McNeill, UC Irvine, Track/Field, 400m Intermediate Hu Jared Brownridge, Santa Clara, Basket, SG Khalfani Muhammad, California, Foot/Track, zzzz Annia Mejia, California, Soccer, Defender Hailey Harbison, Pepperdine, Soccer, Midfielder Ashley Gonzales, Long Beach State, Soccer, Forward Emily Boyd, California, Soccer, Goalkeeper Allexis Bennett, UCLA, Softball, Faith Anumba, UCLA, Track/Field, Triple Jump Zoey Goralski, UCLA, Soccer, Defender Austin Hazel, UCLA, Track/Field, Long Jump Ivan Rabb, California, Basket, PF Adoree’ Jackson, USC, Foot/Track, zzzz Indigo Gibson, California, Soccer, Defender Jason Chandler, UC Davis, Track/Field, 400m Intermediate Hu Bryce Alford, UCLA, Basket, PG Jamie Van Horn, Pepperdine, Soccer, Defender Sydney Sladek, USC, Soccer, Midfielder Brianna Cueva, Cal St. Northridge, Track/Field, Discus Throw Trey Kell, San Diego St., Basket, PG Daulton Jefferies, California, Baseball, SP\nOthers Receiving Votes in Alphabetical Order\nAric Walden, Sacramento St., Track/Field, 110m High Hurdles\nChris Paul, California, Baseball, 1B\nEllis Newton, California, Track/Field, 800m Run\nFaith Makau, UC Riverside, Track/Field, 1,500m Run\nGarrett Stubbs, USC, Baseball, C\nGrant Dyer, UCLA, Baseball, RP\nGuro Bergsvand, California, Soccer, Midfielder\nIsaiah Brandt-Sims, Stanford, Foot/Track\nLeon Powell, UCLA, Track/Field, 200m Dash\nLucas Erceg, California, Baseball, 3B\nMalik Pope, San Diego St., Basket, C\nMarvelle Harris, Fresno St., Basket, PG\nStacy Davis, Pepperdine, Basket, PF\nTyrone Wallace, California, Basket, PG","url":"https://www.breitbart.com/local/2015/07/20/california-top-25-student-athletes-to-watch-in-2015-16/"}
