{"authors":[],"date_download":"2018-10-23 00:56:12","date_modify":"2018-10-23 00:56:12","date_publish":"2015-05-06 00:00:00","description":"This week marks the official start to California's fire season. The state's ongoing drought is stressing its forests and trees, making them even more vulnerable.","filename":"data/vaneerConsumption/CaliforniaRacesToProtectItsForestsAsFireSeasonBegins.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=404739715_1540256172.html","title":"California Races To Protect Its Forests As Fire Season Begins","title_page":"California Races To Protect Its Forests As Fire Season Begins : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ROBERT SIEGEL, HOST:\nCalifornia's fire season has officially begun. But ask the state's firefighters, and they'll say fire season started a long time ago. Four years of drought coupled with unusually hot weather has primed California for wildfire. NPR's Nathan Rott went to the Pacific coast and has this report.\nNATHAN ROTT, BYLINE: Cambria, Calif. is under an emergency fire declaration. There's no actual fire, no smoke, but here's the situation broken down by Cambria Fire Chief Mark Miller. If a fire started today under the circumstances that exist...\nMARK MILLER: ...In the first 20 minutes, it would be six acres, and there would be two houses involved.\nROTT: Which, he says, would already be more than Cambria's two fire engines could deal with. A half-hour later, 20 acres, 15 houses, more than the next wave of responders could handle.\nMILLER: And then within the two-hour timeframe, you've taken out half the town, and it's out of control, you know? So it's going to be a life loss situation.\nROTT: To understand why it's so volatile here, let's go out into the forest. Cambria sits about halfway between Los Angeles and San Francisco on the Pacific coast. It's a small town of about 6,000 nestled between the Pacific's rocky ocean bluffs and thick forests of Monterey pine, hence the town's slogan, pines by the sea.\nCONNIE GANNON: So this is all a preserve, and...\nROTT: Connie Gannon is with Greenspace, a nonprofit environmental group in the area.\nGANNON: So you can see the trees are in different stages of health.\nROTT: Some are green, and some are dead.\nGANNON: Now, see here's a whole bunch...\nROTT: Oh, yeah.\nGANNON: ...That are sick.\nROTT: Sick with pitch canker, a fungus, and beetle infestation - pests that thrive on sick or stressed trees. And with the drought in its fourth year, Gannon says, every tree in this forest is stressed. The change is evident.\nGANNON: The rate of tree death has just escalated amazingly and sadly. You know, it's very hard to look out across your town and look at what was a green forest, and it's all brown now.\nROTT: Some estimates put the percentage of dead trees here in Cambria at 40 percent. In some stands, that number is closer to 80 or 90. And dead or dying trees are a huge problem for firefighters, not just here in Cambria but in the rest of the state. CAL FIRE and the Forest Service both say that dead trees due to drought are one of their top concerns for the upcoming fire season. Invasive pests are flourishing in the Stanislaus National Forest near Yosemite, the Sequoia National Forest, Los Padres in Shasta. A recent survey found that at least 12 million California trees have died because of the drought, and millions more are at risk, but few in as scary a setting as Cambria.\nMILLER: Try to notice a lot of the dead stuff as we drive through the town here.\nROTT: Mark Miller leads more than two dozen fire professionals in a caravan of trucks on a tour through town. They're here for a wildland-urban interface class learning about defensible space around homes. They chose Cambria because, well, around here defensible space is few and far between.\nMILLER: Look at the construction on this house. I mean...\nROTT: What do you...\nMILLER: How is that not going to burn...\nROTT: Yeah...\nMILLER: ...You know?\nROTT: ...A wood home\nMILLER: Yeah.\nROTT: Half the town's population are seniors, Miller says. Add that in with the roads...\nMILLER: You see how narrow...\nROTT: Your truck barely gets down the road.\nMILLER: Yeah.\nROTT: ...Stage-three water restrictions because of a shortage in water availability and the dry fuels. At lunch, Miller asks a group of fire chiefs and consultants what they would do in his situation. Don Oakes, a former battalion chief who the others call a fire legend, speaks up.\nDON OAKES: I don't have an answer for what you have. I can't even come close to one, at least in conventional thinking.\nROTT: Unconventionally, Oakes says Miller should look to getting concrete boxes from FEMA, the same type they use for tornado and hurricane shelters, so that if a fire does hit, people can just shelter in their homes instead of having to try to evacuate up or down the narrow coastal highway.\nOAKES: At least it's a better alternative than what we're looking at out there right now. If a fire occurs today right here, even with this mild weather, you're going to lose a lot of houses. And I'm just trying to cheer you up.\n(LAUGHTER)\nROTT: The firefighters laugh, but there's a grim reality to the situation. Despite the local efforts to cut down and mulch dead and dying trees and the rising public awareness to the potential threats, Miller says it took them decades to get into this situation. And with the limited resources, the ongoing drought and fire season already here, well, it's going to take a degree of luck for them to get out of the summer unscathed. Nathan Rott, NPR News.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=404739715"}
text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2015/05/06/404739715/california-races-to-protect-its-forests-as-fire-season-begins"}
