{"authors":["Matt Levin","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 23:54:17","date_modify":"2018-10-30 23:54:17","date_publish":"2016-03-23 08:00:00","description":"After a decades-long decline in violent and property crime, early indications from cities across California point to a significant increase in","filename":"data/vaneerConsumption/Californiacrimeontherise.json","image_url":"https://calmatters.org/wp-content/uploads/Victor_handcuffs.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540943657.html","title":"California crime on the rise","title_page":"California crime on the rise | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"After a decades-long decline in violent and property crime, early indications from cities across California point to a significant increase in lawbreaking.\nIn California’s 68 largest cities, violent crime jumped 11 percent in the first six months of 2015 compared to the same period in 2014. Among major U.S. cities, three California cities saw the largest increase in property crime in the country.\nData compiled thus far relies on half-year reports from California cities with a population of at least 100,000, which together comprise about half the state’s population. Statewide data for the year will be released this summer.\nCalifornia’s increase in violent crime appears to be less of an outlier compared to other states. But on property crime, California appears to be trending in a different direction.\nPart of the reason the jump in 2015 is so surprising is because both violent and property crime in California have consistently trended downward since reaching peaks more than two decades ago. Even with the latest increase, crime is still below levels of just a few years ago.\nCalifornia introduced two major criminal justice policies in the last five years that both reduced the number of offenders in jail or prison.\nIn late 2011, the state began “realignment,” Gov. Jerry Brown’s plan to reduce prison overcrowding by shifting responsibility for about 30,000 offenders from the state to the counties. County jails absorbed many, but roughly 18,000 fewer offenders were incarcerated in the first year after the shift, according to the nonpartisan think tank Public Policy Institute of California. In the most definitive look at the role realignment played in the state’s crime rate, a PPIC study in 2013 found that realignment could not be linked to an increase in violent crime. However, the study did find realignment could be blamed for a significant increase in auto theft — about 65 more auto thefts per year per 100,000 residents.\nIn 2014, voters approved Proposition 47, which reclassified several drug possession and small-scale property offenses from felonies to misdemeanors. The total incarcerated population dropped by more than 10,000 in the months following Proposition 47’s passage.\nCrime rates fluctuate year to year, and there has been no definitive research to date showing a relationship between crime trends and Proposition 47. But many law enforcement officials across the state have voiced concern that Proposition 47 may be to blame.\nThe crime rate may also be an issue this year for Gov. Jerry Brown. He is collecting signatures to qualify a measure for the November ballot that would further reduce the prison population by allowing more nonviolent inmates to gain earlier access to parole.\nSo far, the increase in crime does not appear to have changed public opinion. Polling by PPIC found that about 20 percent of California adults said in January that violence and street crime in their communities are a big problem. That’s four percentage points less than in January of 2015.","url":"https://calmatters.org/articles/charticle-californias-crime-on-the-rise/"}
