{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:55:11","date_modify":"2018-10-30 19:55:11","date_publish":"2015-12-15 16:23:14","description":"2015 has delivered a record-breaking year for background checks in California, surpassing the 12-month background check record in 11 months.","filename":"data/vaneerConsumption/CaliforniaBreaks12MonthBackgroundCheckRecord.json","image_url":"https://media.breitbart.com/media/2015/04/gun-store-background-checks-gun-control-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_12_15__1540929311.html","title":"California Breaks 12-Month Background Check Record","title_page":"California Breaks 12-Month Background Check Record","title_rss":"NULL","source_domain":"breitbart.com","text":"2015 has delivered a record-breaking year for background checks in California, surpassing the 12-month background check record in an 11-month period.\nAccording to the Times Standard News, the previous record of 1.47 million background checks, set in 2014, was broken by the end of November 2015, when California hit 1.51 million background checks year-to-date. And California expects December to bring a large number of gun sales, not only because it is usually a strong month for gun sales, but because even higher than usual sales are being fueled by a gun control push at the state and federal levels.\nThe Standard News put it this way: “The renewed gun control debate here and across the nation is good for gun sales.”\nCalifornia Association of Federal Firearms Licensees spokesman Craig DeLuz said, “Every single time the politicians start talking about firearms bans or increasing regulation, folks start to realize, ‘This is a right that if I don’t exercise it, I may lose it.’ It’s not the sole motivator, but it’s a significant motivator.”\nDeLuz said President Obama’s policies and former Attorney General Eric Holder’s anti-gun approach both contributed to a rise in gun sales in California. This translated into an increase in the number of background checks each successive year in California since 2008. The increases were modest in 2009-2011, then skyrocketed when the Democrats’ gun control push began in earnest following the July 2012 Aurora movie theater shooting.\nIt is interesting to note that though the post-Aurora gun control push was a push for background checks, Aurora gunman James Holmes passed a background check for the guns he used in the attack.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/local/2015/12/15/california-breaks-12-month-background-check-record-11-months/"}
