{"authors":[],"date_download":"2018-10-22 22:53:07","date_modify":"2018-10-22 22:53:07","date_publish":"2014-06-11 04:33:26","description":"A judge ruled after hearing testimony from students who argued the job protections made it virtually impossible to dismiss low-performing teachers.","filename":"data/vaneerConsumption/CaliforniaTeacherTenureLawsRuledUnconstitutional.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_california-teacher-tenure-laws-ruled-unconstitutional-n128076_1540248787.html","title":"California Teacher Tenure Laws Ruled Unconstitutional","title_page":"California Teacher Tenure Laws Ruled Unconstitutional","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBy NBC BAY AREA\nA judge ruled Tuesday that California's public school teacher tenure laws are unconstitutional, after hearing testimony from students who argued the job protections made it virtually impossible to dismiss low-performing teachers.\nThe decision's implementation was put on hold, however, pending appeals.\nVergara v. California had pitted the state and its largest teacher unions against a group of students who asked the judge to consider laws regarding teacher tenure, dismissal and seniority consideration for layoffs. A Silicon Valley-based group called Students Mattter brought the lawsuit on behalf of nine students, contending the targeted laws hinder the removal of ineffective teachers and disproportionately hurt low-income and minority students.\nIn his ruling Tuesday, Los Angeles County Superior Court Judge Rolf Treu cited the Supreme Court's landmark equal protection ruling in Brown v. Board of Education, saying that all students are entitled to equal education. The current laws create a situation in which minority and low-income students are discriminated against when ineffective teachers are placed in their schools, he found.\nIn the 16-page ruling, Treu said California laws on the hiring and firing of teachers have resulted in \"a significant number of grossly ineffective teachers currently active in California classrooms.\" He called the evidence in support of the plaintiffs' claims \"compelling\" and agreed that a disproportionate share of underperforming teachers are in schools that have mostly minority and low-income students.\nThe ruling affects K-12 teachers in public schools.\nThe judge wrote in his decision that it's not the court's job to determine how the state should change its laws. The court's role involved applying constitutional principles of law to the statutes and trusting \"the Legislature to fulfill its mandated duty to enact legislation that... passes Constitutional muster.\"\nLawyers for the teachers argued that changes to the job protection laws would allow teachers to be fired on a whim. Tenure laws, they argued, preserve academic freedom and help attract talented teachers to a profession that does not pay well.\n\"What this is going to do is destabilize schools,\" said United Teachers-LA president-elect Alex Caputo-Pearl. \"Seniority, due process and right to a hearing protects investment.\n\"It protects the district's investment because the district has trained the teacher. It protects the teachers' investment so that they can teach a curriculum that they've developed over the years. It protects the students' investment because students are involved in programs that depend on teachers.\"\nState Superintendent of Public Instruction Tom Torlakson released the following statement on the ruling:\n“All children deserve great teachers. Attracting, training, and nurturing talented and dedicated educators are among the most important tasks facing every school district, tasks that require the right mix of tools, resources, and expertise. Today’s ruling may inadvertently make this critical work even more challenging than it already is.\n“While I have no direct jurisdiction over the statutes challenged in this case, I am always ready to assist the Legislature and Governor in their work to provide high-quality teachers for all of our students. Teachers are not the problem in our schools, they are the solution,” Torlakson said.\nIn a phone interview, Jennifer Thomas, who represents 1,700 teachers in San Jose, California, called it a \"dark day.\"\n\"Nobody is offering a solution for when teachers are unfairly fired,\" she said. \"Great teachers need to be protected from arbitrary decisions by administrators. I don't hear anybody planning to address this very real problem.\"\nCalifornia Teacher Association spokesman Mike Mylinski called the ruling \"unnecessary and misguided.\" He would have preferred a stricter discipline process for teachers.\nBut the plaintiffs argued that the laws make it difficult to remove ineffective teachers. The trial included testimony from Los Angeles Unified School District Superintendent John Deasy, who said the process of removing an ineffective tenured teacher can take more two years on average. He estimated the cost of doing so at about $250,000 to $450,000.\n\"We believe very strongly that we will prevail on appeal,\" attorney Glen Rothner said.\nDeasy applauded Tuesday's \"historic\" ruling.\n\"Every day that these laws remain in effect is an opportunity denied,\" Deasy said. \"It's unacceptable, and a violation of our education system's sacred pact with the public.\"\nStudents who said they were not afforded a good education because of the laws also testified. Julia Macias of Southern California said in a telephone news conference on Tuesday that she was \"glad I did not stay quiet,\" because \"great teachers make all the difference.\" Kate Elliott of San Carlos, another plaintiff, said she joined the suit because of a bad eighth grade teacher who had students color and watch YouTube videos and who \"didn't really care about our education.\"\nThe students were backed by Atherton entrepreneur David Welch, who partnered with Griffin Schein, a consulting company that builds campaigns around social causes.\nThe decision could have wide-ranging impact on the way California hires and fires teachers. It also could lead to changes in dozens of states with strong tenure laws that have been targeted by opponents of such policies.\nNBC Bay Area's Lisa Fernandez, Jodi Hernandez and Barb Kunz contributed to this report.","url":"https://www.nbcnews.com/news/us-news/california-teacher-tenure-laws-ruled-unconstitutional-n128076"}
