{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:37:38","date_modify":"2018-10-30 22:37:38","date_publish":"2016-07-27 08:00:00","description":"As they come of age and register to vote, Millennials—that enormous generation born since 1981—are surging so fast they're on the verge of overtaking the","filename":"data/vaneerConsumption/CaliforniaMillennialsSurgingTheirvotescouldbedecisiveespeciallyonmarijuana.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/voters-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939058.html","title":"California Millennials Surging: Their votes could be decisive-especially on marijuana","title_page":"California Millennials Surging: Their votes could be decisive—especially on marijuana | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"As they come of age and register to vote, Millennials—that enormous generation born since 1981—are surging so fast they’re on the verge of overtaking the Baby Boomer behemoth as a share of the California electorate. And new evidence confirms that, so far at least, the GOP is losing them.\nFewer than 1 out of every 5 Millennial voters in California is registered as a Republican. Not that the Republicans’ loss is the Democrats’ gain. Recent voter data shows that Millennials are the driving force behind the huge growth in Californians registering with no party affiliation at all. They’re also more optimistic than other generations—the latest polls show them more approving than their elders of the job the Legislature is doing, and far more supportive of the direction in which California is headed.\nTheir emerging dominance means that 20- and 30-somethings are well-positioned this year to influence several critical questions—including the generational changing-of-the-guard as two Democrats compete to replace retiring U.S. Sen. Barbara Boxer, and the fate of 17 ballot measures covering issues as varied as the death penalty, gun control and marijuana.\nAs for the state issue over which Millennials are most likely to visibly wield their power, many people point to Prop. 64, the initiative to legalize recreational use of weed. That was the prediction of Rep. Eric Swalwell (D-Dublin), as he addressed a recent UC Berkeley conference focused on the generation. “So I hope young people show up” to vote, he said, “Because once California legalizes marijuana, I think the rest of the country is going to follow.”\nMillennials today make up 29 percent of the state’s registered voters, the second largest share among five living generations. Only Baby Boomers, at 32 percent, comprise a bigger bloc—for now.\nMillennials rising: California voter registration by generation\n“You’ve got to think of Millennials as essentially becoming the largest single segment of the electorate,” said Paul Mitchell, vice president of Political Data, Inc., who analyzed California voter registration data by generation.\nTheir dominance among California registered voters has been climbing steadily since the generation hit voting age in 2000. This spring, tech-savvy Millennials propelled a surge in voter registration: Nearly 200,000 Californians signed up to vote over two days in May when a Facebook campaign linked users to the state’s online registration portal—and nearly two-thirds of them were 35 or younger, according to Secretary of State Alex Padilla.\nNow other tech companies are expressing interest in promoting voter drives on their platforms, potentially further boosting registration among Millennials before the November election. Padilla said he’s in talks with Google and Twitter.\n“It’s great to see the social media world really committing to this. It’s really helpful and powerful,” he said.\nHow potent this generation really is at the polls comes down to one question: Will they actually vote? Though young people typically have low turnout rates, they could be more motivated this year by the turbulent presidential election, which then would have spillover impact on California races with long-lasting implications.\nParty ID slipping by generation: California Millennials shun the GOP\n“If they vote, I think they will be significant in any number, if not all, of the initiatives,” said Gale Kaufman, a political consultant running campaigns for Prop. 64 to legalize marijuana, and Prop. 55 to extend income taxes on the wealthy. “Issues like guns, the death penalty and marijuana should evoke a lot of interest at the campus level and moving through Millennials. Social issues or values issues tend to energize younger voters.”\nOpponents of marijuana legalization plan to deploy a campaign designed to raise concerns about specific aspects of Prop. 64, especially those that could be salient to parents. “I think the concept polls well, I don’t think the details poll well,” said Andrew Acosta, a political consultant working on the campaign against Prop. 64.\n“Once you start to open this thing a little bit, there might be things that turn people off.”\nStill, many Millennials have their minds made up. Voters age 18 to 34 favor legalizing marijuana by a 2 to 1 margin, far greater than older voters, according to a Public Policy Institute of California poll in May. Hours before Rep. Swalwell passionately endorsed Prop. 64 in Berkeley, one conference participant said it was the only initiative on California’s long ballot this year that he was aware of—and he plans to vote “yes.”\n“We’ve had medicinal marijuana in California for about 20 years,” said Chris Johnigan, 29, a substitute teacher who lives in the Bay Area. “It seems like we’re past due to have it legalized on a recreational level.”\nMarijuana legalization may be the first issue in which Millennial voters cast the decisive votes in California. But it certainly won’t be the last.","url":"https://calmatters.org/articles/california-millennials-surging-huge-generation-could-cast-decisive-votesespecially-on-marijuana-1/"}
