{"authors":[],"date_download":"2018-10-30 01:04:41","date_modify":"2018-10-30 01:04:41","date_publish":"2016-07-14 05:15:58","description":null,"filename":"data/vaneerConsumption/CaliforniansGettingTheirDemocracyGoodandHard.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/07/Fresno_-_Prop_8_Rally.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861481.html","title":"Californians Getting Their Democracy ‘Good and Hard’","title_page":"Californians Getting Their Democracy ‘Good and Hard’The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Sacramento\nAs we roll toward the November ballot, I’m reminded of H.L. Mencken’s quip that “Democracy is the theory that the common people know what they want, and deserve to get it good and hard.” We always get it “good and hard” in California given the ever-expanding one-party rule. The worse it gets, the more voters from the GOP high-tail it to Nevada and Texas — and the worse it gets as political competition evaporates. It’s the political equivalent of a death spiral.\nThanks to the relatively new Top Two primary system, legislative, congressional, and state constitutional races (not the presidential race) are open to voters from all parties. The top two vote-getters in this jungle primary, regardless of party affiliation, move on to the general election. Increasingly, we’re seeing November races that pit members of the same party against one another, with no third-party or write-in candidates allowed in the general.\nOccasionally, there are some policy differences between the two same-party candidates, but usually it comes down to personality. Do you prefer the Democratic machine’s choice to be the next U.S. senator, Attorney General Kamala Harris, or U.S. Rep. Loretta Sanchez? Both are Democrats. Both agree on virtually everything. Harris is from the Bay Area and is polished, whereas Sanchez is from Orange County and is more “shoot from the hip.” Isn’t democracy great?\nBut while voters are facing rapidly diminishing choices when it comes to candidates, they are getting expanding choices in terms of ballot initiatives. California pioneered “direct democracy” thanks to its Progressive-era Gov. Hiram Johnson, who in 1911 led constitutional reforms allowing the recall, initiative, and referendum. Californians have approved myriad far-reaching measures at the ballot box, ranging from approval of 1978’s tax-limiting Proposition 13 to the creation of the ham-fisted California Coastal Commission in 1972. In 2003 they even recalled their governor, as Arnold Schwarzenegger bounced Gray Davis from office.\nThe November ballot will have at least 17 measures — the largest number since 1999. The state Legislature, currently enjoying its summer recess, could still add some when it returns. There can be no more citizen-sponsored initiatives for the coming ballot, however. The complexity and significance of choices voters will face is downright amazing.\nIn past years, California voters had reliably rejected tax increases. It was one of the few checks on a Legislature that loves to spend money, and continued to spend despite an economic downturn. When Gov. Jerry Brown came into office, he promised a “temporary” tax increase (sales and income taxes) to address the enormous deficits. Unfortunately, voters gave their OK to Proposition 30 in 2012. The new revenues, combined with a burgeoning economy, forced the economic crisis out of the news and let legislators get back to business as usual.\nDespite Brown’s frequent (and welcome) warnings about overspending, he and the Legislature have passed record-spending state budgets — and lost interest in addressing unfunded liabilities to pay for the state’s coddled and over-pensioned government workers. Why bother when there’s enough short-term money flowing in (but don’t remind us about the debt)? Who cares when voters are willing to raise their own taxes whenever the money runs out?\nThere’s no such thing as a “temporary” tax increase, so a coalition with some of the state’s most powerful unions (the California Teachers Association, the state Service Employees International Union) have qualified for the ballot a measure that would extend the income-tax-hike portion of the previous initiative. California officials routinely complain about a state budget that is so dependent on capital gains taxes that it is victimized by boom-and-bust cycles, yet this extra tax on incomes above $250,000 will exacerbate the situation.\nWill the average voter understand the complexities — or simply buy the idea that they can vote for “free money”? Why even ask? Another measure would boost the tobacco tax by $2 on a pack of cigarettes — and apply the same tax structure on vaping products. Supporters’ argument is higher taxes discourage teen smoking (even though it’s already illegal for teens to buy cigarettes). If true, why dramatically increase taxes on a safer alternative (vaping)? The obvious answer: As smoking decreases, so too do tobacco-tax-related revenues that fund programs. This measure is basically a money grab to backfill those declining revenues.\nOne measure would authorize $9 billion in general-obligation bonds for public schools, without demanding any reforms in exchange for the cash. It’s for the children, of course. State bonds are paid out of the general fund, so this will crowd out other spending and lead to a call for — you guessed it — even higher taxes. This being California, these tax increases almost certainly will pass.\nNot everything on the ballot is bad. The plastic-bag manufacturers have put the state’s ban on those wonderfully useful little grocery bags on the ballot as a referendum. Voters have the chance to overturn the latest pointless environmental harassment law. My favorite initiative, because of its mischievousness, is related to the bag ban. The executive director of the American Plastic Bag Alliance complains that the ban was a “backroom deal” between grocers and their unions to “to scam consumers out of billions of dollars in bag fees — all under the guise of environmentalism” given that the grocers get to keep the fees. This initiative would redirect the money to a state environmental fund. It’s payback. I love it.\nVoters get to choose whether to repeal the state’s death penalty — a meaningless gesture given how infrequently it is used here. A separate measure would “fast track” executions. Voters will probably react to those based on their gut feelings, but might have a harder time sorting through the Jerry Brown-backed sentencing reform to allow “parole consideration for persons convicted of nonviolent felonies upon completion of full prison term for primary offense.” Republicans have geared up to oppose the latter, which may be the governor’s attempt to make amends for harsh sentencing standards he approved in the 1970s.\nOne eye-rolling measure would require porn actors to wear condoms during their, er, acting; another would make it harder to divert Medi-Cal funds. Then there’s a major marijuana-legalization measure that is backed by the lieutenant governor. It would put California in line with Colorado, Washington, and other states that have recently legalized recreational marijuana. California has long allowed medical marijuana. But some supporters of legalization are troubled by the particular measure on the ballot, given that it applies a heavy-handed dose of state regulation to a process that currently has a lot of gray areas. When something becomes “legal” in California, that means the authorities are going to tax and regulate the heck out of it. Isn’t freedom great?\nAnother significant measure would require voter approval for revenue bonds in excess of $2 billion. Opponents claim this will slow infrastructure projects, but it’s likely only to slow two of the state’s biggest boondoggles: The Delta tunnel projects and high-speed rail. Yet another newsworthy measure would “prohibit state agencies from paying more for a prescription drug than the lowest price paid for the same drug by the United States Department of Veterans Affairs.” This “applies to any program where the state is the ultimate payer for a drug, even if the state does not purchase the drug directly.”\nThere’s a symbolic initiative that, as the Los Angeles Times reported, “asks voters whether they want California officials to work toward a repeal of the Citizens United campaign finance ruling by the U.S. Supreme Court. That ruling opened the door to unlimited spending on federal campaigns by corporations and unions, and could be overturned only by an amendment to the U.S. Constitution.” This was put on the ballot by legislators.\nAnd there’s more. One of the most successful education reforms in California in decades has been the elimination of bilingual education. In 1998, voters approved Prop. 227, which ended that ideologically motivated educational practice that often kept Spanish-speaking kids from learning English by teaching them in their native language. The current lefty Legislature placed a measure on the November ballot that would repeal the ban by letting local education officials make the determination. There’s also the lieutenant governor’s slate of draconian gun-control measures, most of which echo bills already signed into law by the governor.\nWe’ll save a good one for last. Moderate Republican donor Charles Munger Jr., the same man who helped fund the disastrous initiative that ushered in the Top Two, is funding a useful measure that would require the final form of all bills to be in print for 72 hours before a final vote is taken. That would end the standard and cynical rush of last-minute gut-and-amend bills, in which legislators approve major bills without anyone (other than their favored lobbyists) knowing what’s in them.\nBy and large, though, the initiatives reflect the increasingly out-of-touch sensibilities of our increasingly left-of-center state. An enormously complex set of policy questions will be placed before California’s voters in the general election. To cop a little Mencken attitude, I’d wonder whether a state that reliably sends its current crop of legislators to Sacramento and Washington is capable of making informed decisions about such far-reaching policies.","url":"https://spectator.org/californians-getting-their-democracy-good-and-hard/"}
