{"authors":["Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:08:55","date_modify":"2018-10-31 00:08:55","date_publish":"2016-02-25 14:22:39","description":"Thu, March 3, 2016 6:00 PM – 8:30 PM PST SOLD OUT LOCATION: The Mark 1623 19th Street Bakersfield, CA 93301 California, home to America's car culture as","filename":"data/vaneerConsumption/CaliforniasEnergyFutureevent.json","image_url":"https://calmatters.org/wp-content/uploads/Jerry_brown_signing.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944535.html","title":"California’s Energy Future-event","title_page":"California's Energy Future-event | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Thu, March 3, 2016\n6:00 PM – 8:30 PM PST\nSOLD OUT\nLOCATION:\nThe Mark\n1623 19th Street\nBakersfield, CA 93301\nCalifornia, home to America’s car culture as well as its most ambitious climate change policies, is experimenting with a new future for energy. Gov. Jerry Brown hopes to cut gas consumption in half by 2030 with government mandates and financial incentives to make cars and trucks more efficient and get more people out of their vehicles. Meanwhile, utilities are required to get 50 percent of their electricity from renewable sources by 2030 and to build thousands of power stations around the state for more than 1.5 million new electric cars. These changes and others will reshape California’s economy and its celebrated lifestyle. Success could mean the world’s eighth largest economy removes tons of greenhouse gas from the atmosphere and that California companies develop innovations that create local jobs and a new global market. Many of these experiments, however, are unprecedented, costly and uncertain.\nThis panel discussion will describe the policy landscape ahead and hear key perspectives from the state legislature, environmentalists and energy sector leaders. They will explain what we have learned nearly a decade after Gov. Arnold Schwarzenegger signed the landmark Global Warming Solutions Act. And they will share their thoughts about how climate change policy is changing life in California and the way we do business.\n6:30 – 7:00pm Reception and Registration\n7:00 – 8:30 Panel Discussion\nWelcome: Richard Beene, publisher, Bakersfield Californian\nPanelists\nModerator: David Lesher, editor, CALmatters\nDavid Lesher, editor, CALmatters Sen. Jean Fuller (R-Bakersfield)\nCathy Reheis-Boyd, president, Western States Petroleum Assn\nTodd Strauss, senior director of planning and analysis, PG&E\nPaul Gipe, author/alternative energy advocate\nOrganized by CALmatters and the Bakersfield Californian","url":"https://calmatters.org/articles/californias-energy-future-event/"}
