{"authors":["Laurel Rosenhall","Guest Commentary","Dan Morain"],"date_download":"2018-10-30 22:45:59","date_modify":"2018-10-30 22:45:59","date_publish":"2018-08-17 02:52:25","description":"Civil rights advocates who once led the charge for bail reform are now lobbying against it, saying it replaces one problem with another—and may perpetuate racial bias.","filename":"data/vaneerConsumption/Californiasbilltoendcashbailcouldmakehistoryandsplintertheleft.json","image_url":"https://calmatters.org/wp-content/uploads/BailPhoto1-e1535523162898.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939559.html","title":"California's bill to end cash bail could make history-and splinter the left","title_page":"California's bill to end cash bail could make history—and splinter the left | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"California is considering a massive shake-up in the way the justice system treats people accused of crimes—scrapping money-based bail but giving judges broad leeway to decide whether suspects should be held in jail before they go to trial.\nIt’s the result of nearly two years of work to craft a bill that would make California the first state to entirely eliminate the use of money bail. If enacted, it could be life-altering for low-income Californians. And, like so much in this state, it is shaping up as a tug of war between liberal and moderate visions for a state that can often be more cautious than it may appear.\nThe effort to end cash bail has been fueled by the argument that it’s fundamentally unfair to hold poor people in jail before trial while letting those with money go free. Instead, the argument goes, people should only be jailed if they pose a danger to society.\nYet as lawmakers have moved in recent weeks into the final stages of crafting the bill, giving judges more say over who can be held in jail before trial, some civil rights advocates who once led the charge for bail reform in California are now lobbying against it. They say the new version replaces the problematic money bail system with an equally problematic system that may perpetuate racial biases and leave just as many people locked up before trial.\nOn the flip side, judges, who opposed the old version of the bill, are now fully behind it, with the Judicial Council—the administrative body that oversees California’s court system—saying the proposal “appropriately balances public safety, fairness, and the rights of defendants and victims.”\nThe upshot is that the movement to end bail in California—once a progressive dream—has managed to splinter the left even as it promises to deliver a long-sought rethinking of criminal justice, leaving lawmakers to vote on a more centrist approach in the final weeks of the legislative session that ends on Aug. 31.\n“[This] provides judges with really unbridled discretion to be able to detain anyone, even people charged with misdemeanor crimes,” said San Francisco Public Defender Jeff Adachi, among those who once supported the bill but now oppose it.\n“This bill creates all these categories and exceptions where a judge can keep someone in jail pending a trial, which really defeats the whole purpose of bail reform.”\nAssemblyman Rob Bonta, an Alameda Democrat who is a co-author of the bill said the bill is actually “fairer, it’s safer, it’s more just.”\n“You can’t always accommodate everyone’s vision of what a new system should have, but this system is better,” said Bonta. “It will make a huge difference.”\nThe changes make the bill more likely to pass the Democratic-controlled Legislature, which last year rejected a bail-reform bill that had progressive backers but no buy-in from the courts. Gov. Jerry Brown has not indicated if he will sign the bill, but his staff have been involved in the negotiations, and Brown—back in 1979—called bail “an obvious tax on poor people.”\nUnder the bill, most people arrested for non-violent misdemeanors will be released within 12 hours of being booked. (Though there are some exceptions, including if they’re arrested for domestic violence or have recent felony convictions.) And people arrested for a long list of violent or sex crimes will automatically be held in jail.\nEach county will establish a procedure for evaluating people awaiting trial to determine if they are at high-, medium- or low-risk of committing a crime or not showing up at court. Those considered a low risk would be set free until trial, those at high risk would be held in jail, and judges would have authority to decide how to handle those in the middle bracket.\nJudges are best suited to make the call because they can examine a person’s prior record and evaluate if they pose a danger, said Sen. Bob Hertzberg, a Van Nuys Democrat who is a co-author of the bill.\nRather than using a formula, “they will judge you as a person,” Hertzberg said. “That’s what justice is about, and simultaneously, that’s what safety is about.”\nThe bill also gives each county-level court the power to decide what kinds of crimes would put someone in the medium-risk bracket. And it allows judges to hold people in jail “if there is a substantial likelihood” that they pose a danger or would not return to court.\nThe bill reflects a system that was recommended by Chief Justice Tani Cantil-Sakauye, who established a group of judges to study California’s bail system and wrote a report last year calling it “unsafe and unfair.”\nThat kind of local control is important, said Ronald Lawrence, vice president of the California Police Chiefs Association. The group doesn’t yet have a formal position on the bill, but Lawrence said the justice system is designed to give a lot of power to county courts.\n“We have 58 counties in California, arguably we’ve had 58 different interpretations of the law at the county level since 1850,” he said. “I think you’ll always have some type of inconsistency. That’s the way our system is.”\nBut giving judges so much leeway is exactly why some civil rights groups now oppose Senate Bill 10. They’re concerned that justice will be applied unevenly among counties and that ultimately judges will decide to keep too many Californians behind bars.\n“They ended money bail but they did it at the expense of the freedom of communities that made this rallying cry to begin with,” said Raj Jayadev, a coordinator with Silicon Valley De-Bug.\nHis San Jose-based group was a sponsor of the bill when it was announced at the end of 2016. But this week, Jayadev was in the Capitol urging lawmakers to vote against it . Human Rights Watch also opposes the bill and the American Civil Liberties Union—originally a co-sponsor—is no longer supporting it.\n“SB 10 needs to go further to be the model for pretrial justice and racial equity that we are working towards,” the ACLU said in a statement.\nThe group was among more than 100 national civil rights organizations that signed a letter last month raising concerns about the “risk assessment” tools that are being used in place of bail in a growing number of states and counties. The formulas that assess how likely someone is to commit a crime or fail to appear in court can exacerbate racial biases in the criminal justice system, the group said in a letter urging authorities to reduce their use.\nRisk assessment tools are already used in several California counties, including Santa Clara, Santa Cruz, San Francisco, Ventura, Riverside and Imperial, according to the Judicial Council. And some states use them too: Kentucky was among the first; New Jersey became a more recent addition when it passed a law last year that largely replaces bail with risk assessment.\nRunning California’s risk assessment program will likely cost the state about $200 million a year once the program is fully implemented in 2019, according to a budget analysis . The state may wind up saving some money if fewer people are incarcerated before trial.\nNot surprisingly, it’s all left bail bondsmen furious and fighting for their livelihoods.\n“You’re talking about an entire industry that goes back for generations, some to the 1850s. I guess their jobs are going to be shipped to the government sector,” said David Quintana, a lobbyist for the California Bail Agents Association.\nBut Jessica Bartholow, lobbyist for the Western Center on Law and Poverty, said shutting down money bail will alleviate financial stress for some of California’s neediest families:\n“We will be preventing millions of dollars from leaving low income communities and communities of color and going to a corporate money bail system.”","url":"https://calmatters.org/articles/california-bail-reform-splinters-left/"}
