{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:17:44","date_modify":"2018-10-30 22:17:44","date_publish":"2015-07-11 16:00:04","description":"California AG: Trump's Comments Against Illegal Immigration Are Ignorant","filename":"data/vaneerConsumption/CaliforniaAGTrumpsCommentsAgainstIllegalImmigrationAreIgnorant.json","image_url":"https://media.breitbart.com/media/2015/01/Kamala-Harris-AP.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_07_11__1540937864.html","title":"California AG: Trump's Comments Against Illegal Immigration Are 'Ignorant'","title_page":"California AG: Trump's Comments Against Illegal Immigration Are 'Ignorant' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On July 10 California Attorney General and current US Senatorial candidate Kamala Harris (D) responded to Donald Trump’s statements on the dangers posed by illegal immigration by calling those statements “ignorant.”\nTrump spoke out after Kathryn Steinle was allegedly gunned down by illegal immigrant Francisco Sanchez on July 1, calling for secure borders and criticizing what he sees as purposeful action by the Mexican government whereby they are dumping their worst on America before any barrier is erected to stop them.\nOn July 3 Trump said, “This senseless and totally preventable act of violence committed by an illegal immigrant is yet another example of why we must secure our border immediately.” He made clear his conviction that the American people “deserve a wall” along the southern border.\nAccording to the San Francisco Chronicle, Harris says these comments were “ignorant” and prove Trump is “someone who clearly cannot be a leader.”\nHarris said it was wrong to frame immigration policy over the actions of one individual, rather, “comprehensive immigration reform” is what ought to be pursued.\nIronically, Democrats in the House and Senate have been pushing such reform for years, and since it always includes amnesty it means individuals like Sanchez would theoretically remain in the United States to commit acts like he allegedly committed on July 1.\nHarris said:\nWe have to get smart and understand the vast majority of these undocumented immigrants are following the law, working hard, raising their children, paying taxes — and we have to provide a pathway for them. It does us all, as a country, a disservice to suggest we’re going to craft immigration policy around the heinous and outrageous actions of this murderer.\nShe went on to say that she still supports the idea of sanctuary cities, describing the phrase “sanctuary city” is somewhat “a term of art.” She added:\nSanctuary cities evolved around the idea that we also don’t want to deny access to public safety, public health, public education for anyone who is living..in our community. And I support that. As a prosecutor, I don’t want an undocumented immigrant who is the victim of rape or child molestation or domestic violence to not come forward and receive the benefit of our public safety or public health system because the perpetrator or the predator convinces her that if she comes forward, it is she who will be treated as a criminal.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/local/2015/07/11/california-ag-trumps-comments-against-illegal-immigration-are-ignorant/"}
