{"authors":["Associated Press","Chris Summers For Mailonline"],"date_download":"2018-10-22 23:36:31","date_modify":"2018-10-22 23:36:31","date_publish":"2017-04-26 08:20:22","description":"The father of a five-year-old boy who has been missing in California for more than a week has been released from jail as the hunt goes on.","filename":"data/vaneerConsumption/Californiadadofmissingfiveyearoldboyreleased.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F8B9FC300000578-0-image-a-16_1493203164468.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446604_California-dad-missing-5-year-old-boy-released-jail_1540251391.html","title":"California dad of missing five-year-old boy released","title_page":"California dad of missing five-year-old boy released | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The father of a five-year-old boy who has been missing in California for more than a week has been released from jail as the hunt goes on.\nArmazd Andressian junior was last seen on April 18 during a video chat with his mother but his father, also called Armazd, never returned him to his estranged wife.\nThe boy's mother was scheduled to have another video chat with her son on April 20, but that never happened, said South Pasadena Police Chief Art Miller.\nThe parents are divorcing and share custody of the boy.\nPolice began investigating after Andressian failed to drop the boy off at the weekend.\nInvestigators yesterday decided against charging Andressian, who was found unconscious on Saturday morning at Arroyo Park in South Pasadena.\nAramazd Andressian senior (left) has been released. He was vague and evasive when questioned by police about the whereabouts of his son, Aramazd junior (right)\nAndressian Sr was vague and evasive in his answers to detectives' questions.\nLos Angeles County Sheriff’s Department Captain Chris Bergner told the Los Angeles Times Andressian had given 'convoluted and not consistent' statements about the boy's whereabouts.\nHe was arrested on Saturday night on suspicion of child endangerment and abduction and was being held on $10million bail before his release.\nHomicide detectives went to Lake Cachuma but later said surveillance video suggested Andressian had gone there without his son\nThe authorities would say only the investigation was continuing, and would not say whether the father remains a suspect.\nAndressian's lawyer, Rebecca Lizarraga, said he and his family were 'emotionally reeling' and were hoping for the boy's safe return.\n'Aramazd, his family and counsel are fully cooperating with the police in their efforts to locate little Ara,' said Ms Lizarraga, but she did not explain when Andressian last saw his son.\nFour days of intensive searching for the boy have yielded very little.\nOn Tuesday authorities searched Cachuma Lake in Santa Barbara County where Andressian's car had been seen before his arrest, but later found surveillance video which suggested the father had been there alone.\nInvestigators do not know why Andressian was unconscious at the park but have said there is no evidence he was attacked.\nHis car was spotted a day earlier in Orange County and investigators believe he drove to Cachuma Lake - 120 miles northwest of Los Angeles - and spent the day there.\nAramazd is described as three feet five inches tall, weighs about 55 pounds, has brown hair, a small mole on his right shoulder, and was last seen wearing a turquoise shirt and plaid shorts.\nHis father is from Los Angeles' large Armenian-American community.","url":"https://www.dailymail.co.uk/news/article-4446604/California-dad-missing-5-year-old-boy-released-jail.html"}
