{"authors":[],"date_download":"2018-10-31 00:06:03","date_modify":"2018-10-31 00:06:03","date_publish":"2016-10-20 00:00:00","description":"A case before the state Supreme Court could clear the way for reductions in public retiree benefits, which have become hugely expensive. But the outcome is “hard to predict.”","filename":"data/vaneerConsumption/CaliforniapromisedpublicemployeesgenerousretirementsWillthecourtsgivegovernmentawayout.json","image_url":"https://www.trbimg.com/img-5807d1d2/turbine/la-art-for-california-pension-legal-story-2016-004/900","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/latimes.com/projects__1540944363.html","title":"California promised public employees generous retirements. Will the courts give government a way out?","title_page":"California promised public employees generous retirements. Will the courts give government a way out? - Los Angeles Times","title_rss":"NULL","source_domain":"calmatters.org","text":"A case before the state Supreme Court could clear the way for reductions in public retiree benefits, which have become hugely expensive. But the outcome is “hard to predict.”\nCalifornia’s generous public employee pensions, shielded for decades by the state’s courts, may soon no longer be sacrosanct.\nIn a potentially huge win for advocates of cutting government pensions, an appeals court in August declared that public retirement plans were not “immutable” and could be reduced. The three-judge panel said the law merely requires government to provide a “reasonable” pension.\nThis series is a partnership of\nThat unanimous ruling, now before the California Supreme Court, could be a vehicle for reducing a shortfall amounting to hundreds of billions of dollars in state and local pension systems. If upheld, the decision could lead to the kinds of cutbacks previous courts blocked.\nEmory University Law Professor Alexander Volokh called the decision “a big change from what the doctrine has been so far” and expressed doubt that it would be upheld. University of Minnesota Law Professor Amy B. Monahan described the ruling as “novel” and the outcome “hard to predict.”\nThe decision has attracted national attention because of California’s influential role in pension law. Like California, other states are facing massive shortfalls in public pensions and wrangling with ways to head off staggering debts.\nStanding in the way have been decades of court decisions that created what is called the “California Rule.” It guarantees government workers the pension that was in place on the day they were hired.\nADVERTISEMENT\nThe formula for calculating retirement income generally can be changed only if it is neutral or advantageous to the employee, courts have ruled. It cannot be reduced, except for new hires.\n“It is a rule that makes it extremely difficult for states to reform their pensions,” Volokh said, “and lots of states have really big pension problems now.”\nUntil the last century, the law generally treated government pensions as gifts that could be taken away. People didn’t live long, and pensions were not considered particularly important.\nThat changed as lifespans rose and government employees sued to protect their retirement earnings. California law now treats government pensions as contracts protected by the state Constitution.\nTwelve other states eventually adopted the California Rule, although not all interpret it so strictly. Now that public pension systems are facing massive debts, many states are again looking to California for possible answers.\nThe case that could weaken the California Rule stems from a “pension reform” law state legislators passed in 2012.\nThe law cut pensions and raised the retirement ages for new government employees and banned “pension spiking” for existing workers.\nJudges, who generally have benefited from past public pension rulings, were exempted.\n“They stuck it to pretty much everybody except the judges,” said Gregg McLean Adam, who is representing unions in the case.\nSome unions objected to the law’s prohibition on pension spiking for longtime employees.\nThe practice involves inflating an employee’s pay during the period on which retirement is based — usually at the end of a worker’s career.\nThis can be done by cashing in years of accumulated vacation or sick pay or volunteering for extra duties just before retirement.\nIn some cases, spiking has created pensions higher than the workers’ salaries.\nThe Marin County retirement system, relying on the new law, decided to remove pay from pension calculations for various on-call duties and for waiving health insurance.\nUnions sued, contending that employees had long been promised that benefit and took jobs because of it. They argue the rules for new workers will eventually end the pension shortfalls.\nIn a ruling written by Justice James A. Richman, appointed by former Gov. Arnold Schwarzenegger, the appeals court said the Legislature can alter pension formulas for active employees and reduce their anticipated retirement benefits.\n“While a public employee does have a ‘vested right’ to a pension, that right is only to a ‘reasonable’ pension — not an immutable entitlement to the most optimal formula of calculating the pension,” wrote Richman, joined by Justices J. Anthony Kline and Marla J. Miller, both Gov. Jerry Brown appointees.\nIn most states, this sort of law easily would be upheld and perhaps not even challenged, legal scholars said.\n“But in California, it’s a tough issue,” Monahan said.\nUnions appealed the decision to the California Supreme Court.\n“This a frontal assault on 60 years of California pension law,” Adam said.\nThe state’s top court is now reviewing written arguments on the case. It could agree to take up the appeal, let the decision stand as precedent or limit its effect only to Marin County.\nScholars agree the decision stands apart in the state’s long jurisprudence on public pensions. But the state high court might want to shift the law to meet new economic realities, they said.\n“Specific facts in different cases really drive the development of the law, “ said Minnesota’s Monahan.\nShe attributed the origins of the California Rule in part to a 1947 case brought by a public employee whose story stirred sympathy.\nIn that case, Kern v. City of Long Beach, a firefighter sued because the city abolished pensions for all working employees 32 days before he was entitled to retire. The firefighter had been contributing toward his pension for 20 years.\n“So the court came up with a rule that was going to protect this person from losing his pension,” the law professor said. “The Kern facts were really awful for the government.”\nThe real “bombshell” came in 1955 in Allen v. City of Long Beach, when the California Supreme Court ruled that any cutbacks in pensions for current employees must be offset by comparable new advantages, Monahan wrote in a law review.\nUnlike private pensions, which are governed by a federal law and must be insured, public retirement systems depend on government revenue if obligations exceed contributions and investment income.\nNumerous attempts have been made around the country to reel in pension costs, with mixed success. Even in dire consequences, some courts have refused to retreat from protective pension law.\nIn Illinois, which has similar, or stronger, pension protections, shortfalls caused bond ratings to plummet. Chicago and the state passed reform measures, both of which the Illinois Supreme Court soundly rejected.\nA decision by the California Supreme Court on whether to review the Marin County dispute is likely to be weeks or even months away.\nAnother ruling on the new pension law, by a Contra Costa County judge in 2014, is pending in the same appeals court that decided the Marin County case but before different judges.\nThat decision, responding to lawsuits brought by public employees in Contra Costa, Alameda and Merced counties, upheld the anti-spiking provisions but allowed some employees to count pay for regular and required on call duties toward their pensions.\nLinda Ross, who represented a county agency in that case, said the Marin decision went further.\nIt “kind of rewrote the rule” that made it impossible to reduce pensions without providing equivalent benefits, she said.\n“That is what prevented changes over the years,” Ross said, “because if you have to give someone something equivalent you are not saving money.”\nPublic employee unions say the decision, if upheld, would spark endless litigation.\n“The court says you can reduce current employee pensions to a point of reasonableness” Adam said. “Where that point is, your guess is as good as mine.”\nContact the reporter. Twitter: @mauradolan\nCredits: Produced by Lily Mihalik\nCalifornia's Pension Crisis: Coming next in the series Gov. Jerry Brown brokered the biggest pension rollback in California history. But how much of the problem has he really solved? Sign up for our Essential Politics newsletter to receive the next installment in your inbox Privacy policy","url":"http://www.latimes.com/projects/la-me-pension-legal/"}
