{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 22:02:21","date_modify":"2018-10-30 22:02:21","date_publish":"2016-05-03 07:01:17","description":"The California primary could come down to a district of conservative Orange County Republicans and progressive Los Angeles County Democrats.","filename":"data/vaneerConsumption/CaliforniaPrimaryTheLAOrangeCountyFrontier.json","image_url":"https://media.breitbart.com/media/2016/05/Lil-Jon-on-Catalina-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_05_03__1540936941.html","title":"California Primary: The L.A./Orange County Frontier","title_page":"California Primary: The L.A./Orange County Frontier | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A handful of congressional districts in California could ultimately decide whether Donald Trump is able to secure the 1,237 delegates needed to lock up the Republican presidential nomination — and nowhere is the race likely to be closer than in California’s 47th congressional district, the terrain of influential conservative Orange County Republicans and progressive Los Angeles County Democrats.\nThe 47th District stretches from Long Beach northeast through Garden Grove, Westminster and Cypress, and also includes the tony Santa Catalina Island.\nThe portion of Orange County contained within the district boasts nearly 50,000 registered Republican voters, roughly 10,000 more than registered Democrats. But the district’s portion of Los Angeles County holds more than double the number of registered Democrats, giving CA-47 a significant Democrat tilt.\nBreitbart California has previously predicted that Sen. Bernie Sanders will likely split the district’s six Democrat delegates with prohibitive frontrunner Hillary Clinton.\nLess clear is which Republican candidate will pick up the district’s three GOP delegates. However, the on-the-ground political reality of the district could prove advantageous to Sen. Ted Cruz.\nIn December, the Orange County Register reported that the share of the county’s registered Republican voters fell below 40 percent, to its lowest level ever. This in itself could provide a boost to Cruz, as California’s presidential primary is “closed,” allowing only those voters registered Republican to cast ballots for Republican candidates. Cruz has traditionally done better among registered Republicans.\nAccording to the most recently available Census data, CA-47 is mostly white and relatively affluent, with a median household income of $79,351. However, of the district’s total population of 718,747, some 207,092 residents are of Mexican descent, which could similarly prove advantageous to Cruz. In March, the Los Angeles Times reported that the success of Donald Trump’s campaign has alienated many of Orange County’s minority voters.\nHowever, a slew of recent developments could swing the district in favor of Trump.\nA SurveyUSA/KABC poll released Monday finds Trump with a staggering 54-20 lead over Cruz among registered voters statewide. The same poll finds Clinton opening up a 57-38 lead over Sanders. The results confirm that voters are moving toward their respective Party’s frontrunners as the primary season concludes.\nTrump could also experience a boost across California as voters get an up-close look at the chaos that surrounds his events in the state. A Trump rally in Costa Mesa in Orange County on Thursday night was beset by violent protesters who smashed police cars and hurled profanities at the candidate’s supporters. The next day, housands of protesters convened outside the California Republican Convention in Burlingame, many of them brandishing Mexican flags and anti-Trump signage. One Burlingame resident was viciously harassed simply for walking down a nearby street wearing a “Make America Great Again” ballcap. This level of violent demonstration could boost the resolve of Trump’s backers as well as convert on-the-fence voters concerned about public safety.\nCruz’s efforts in the district could also be complicated by John Kasich, who will pick up support in moderate Republican districts, including those Orange County.\nTuesday’s Indiana primary could also further clarify the contours of the California contest. An NBC News/Wall Street Journal/Marist University poll released Monday found Trump with a 49-34 lead over Cruz in that state, just hours before polls were set to open Tuesday. A commanding win for Trump in Indiana could effectively kill Cruz’s chances of preventing Trump from reaching the magic number in California.","url":"https://www.breitbart.com/local/2016/05/03/california-primary-l-orange-county-frontier/"}
