{"authors":["Assemblyman Tim Donnelly"],"date_download":"2018-10-30 22:08:46","date_modify":"2018-10-30 22:08:46","date_publish":"2015-01-14 19:05:54","description":"If you believe that government ought to keep its hands out of your pockets, and stick to its proper role--which is protecting our right to “life, liberty and the pursuit of happiness”; securing our borders; maintaining infrastructure; and achieving a handful of other things enumerated in the Constitution--then you cannot be silent in the face of an attempt to seize what little freedom you have left. |","filename":"data/vaneerConsumption/CaliforniaPromotesSocialismDisguisedasProsperity.json","image_url":"https://media.breitbart.com/media/2015/01/upi_GOLDEN-GATE-BRIDGE.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_01_14__1540937326.html","title":"California Promotes Socialism Disguised as Prosperity","title_page":"California Promotes Socialism Disguised as Prosperity | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Want to know why the growth of government is the greatest threat to our future?\nThe latest example is a grant that came from the department of Housing and Urban Development (HUD), which gave almost $5 million dollars to the Bay Area’s Metropolitan Transit Agency (MTC) in order to carry out the socialist dictates of a plan entitled the “Bay Area Regional Prosperity Plan.”\nThis Thursday in Redwood City, a coalition of “community organizations”–many of which are front groups for the socialist labor movement, including churches, social justice and living wage nonprofits, unions, local governments, housing collaboratives, and others who profit off the massive, growing labor-poverty-government industrial complex—are hosting one of their 5 launch meetings for their “Regional Economic Prosperity Strategy.”\nYou might think that sounds harmless, even beneficial–and you’d be right if they were advocating for less government restriction to unleash the power of the free market.\nBut they’re not. And they’re not doing it with their money. They are lobbying our state and local government with our tax dollars handed over by agencies of our federal government.\nYes, that’s right. Government is using money funneled through an innocuous-sounding grant to advocate for the following (and these are just a few of the juicy ones):\n90….Organize and professionalize industries to improve wages, benefits and career ladders. (So now the government is now officially in the business of subsidizing the unionization of entire industries?) … 93. Remove barriers to unionization. (Really? Shouldn’t the goal of an effort at creating prosperity be to remove barriers to economic growth so that companies can prosper, expand and hire more workers?) … 95. Enacting living wage ordinances. (Translation: Force private businesses to pay above-market wages to compensate some individuals while reducing opportunity for others.) 96. Passing prevailing wage ordinances. (Make government contracts for services such as janitors and security guards as grossly overpriced for taxpayers as public works projects are now.) 97. Establishing project labor agreements (PLAs). (Force all those wishing to work on a project to join a union, and legally discriminate against smaller contractors, who are usually non-union and might be willing to work for less, costing the public more.)\nYet what’s so bad about wanting economic security? Isn’t prosperity desirable?\nSure, but the key is in how you achieve it.\nIf you wake up one morning and decide you are going to rob a bank because you can’t find work, that might get you prosperity, but it’s illegal and could also get you 20 years behind bars.\nBy robbing a bank, you put the lives and economic prosperity of others in jeopardy, and that’s immoral. You wouldn’t steal your neighbor’s car either, but why is it OK if the government robs your neighbor’s business by forcing him to pay a “living wage” instead of whatever the market will bear?\nTheft is theft, even if the government is the agent of it.\nAt its core, this is really a moral question.\n“Is it moral for the government to take from those according to their ability and give to those according to their needs?” Karl Marx thought so, and pushed for a fully communist society, in which the government controlled everything–all means of production–and where every individual belonged to and was dependent on the state.\nThat’s economic servitude—slavery—the antithesis of freedom.\nAnd yet, little by little, California is funding this socialist labor movement, so that outcomes are equalized and controlled by the government.\nIt all started with a coalition of governmental bodies who crafted a regional plan entitled Plan Bay Area. It is a blueprint to implement “social justice” initiatives disguised as a pathway to prosperity, which empower unelected “regional” bureaucrats to dictate what you can do with your property, your business and your capital.\nBy forcing Project Labor Agreements (PLA’s) on every public project–and pushing for more public projects as a means of “job creation” for “low and middle wage” workers–all job creation is put at risk.\nIt is ironic that by instituting PLA’s, the bureaucrats almost guarantee that those jobs will never go to any of the people they claim they want to help; those jobs will be parceled out by powerful unions in union halls based on seniority, not need.\nPushing for “living wage” ordinances might sound noble, but it’s not government’s job to fix prices for labor or anything else. In order to give that raise to someone by legislative fiat, you must first take that money from the business owner.\nIn a completely free market, If you don’t work, you don’t eat. And being hungry is a powerful motivator. It forces you to learn new skills in order to meet the demands of the market.\nIf you believe that government ought to keep its hands out of your pockets, and stick to its proper role–which is protecting our right to “life, liberty and the pursuit of happiness”; securing our borders; maintaining infrastructure; and achieving a handful of other things enumerated in the Constitution–then you cannot be silent in the face of an attempt to seize what little freedom you have left.","url":"https://www.breitbart.com/local/2015/01/14/california-promotes-socialism-disguised-as-prosperity/"}
