{"authors":["Matt Levin","Guest Commentary","Laurel Rosenhall","Dan Morain"],"date_download":"2018-10-30 23:44:04","date_modify":"2018-10-30 23:44:04","date_publish":"2018-09-06 00:29:44","description":"Voters will soon have a chance to touch the third rail of California politics. Here’s a breakdown of how broadly and deeply Californians love their cheap property taxes.","filename":"data/vaneerConsumption/CaliforniansstillreallylikeProp13exceptforthebigpartstheydontlike.json","image_url":"https://calmatters.org/wp-content/uploads/fb-thumbnail-houses-prop-13.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540943044.html","title":"Californians still really like Prop. 13-except for the big parts they don't like","title_page":"Californians still really like Prop. 13—except for the big parts they don't like | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"California looks a lot different than it did a generation ago. Its residents are far more diverse, and they live in a far more expensive state. There’s way more renters and proportionately way fewer Republicans.\nYet today’s Californians have at least one thing in common with their late 1970s forebears: They still really like Proposition 13.\nIn 1978 California voters approved Prop. 13 with a whopping 65 percent of the vote. A populist backlash to soaring property values and their attendant taxes, the ballot measure placed stringent caps on how much local governments could charge homeowners and businesses for the land they own. Overnight, Californians enjoyed some of the lowest property taxes in the country.\nSince then, Prop. 13 has been blamed for everything from the poor performance of California public schools to a shortage of affordable homes to the perpetuation of racial inequality . In progressive quarters, the initiative has become a poster child for bad ballot-box policy.\nBut this year, when the nonpartisan Public Policy Institute of California surveyed voters about Prop. 13, 65 percent said it had been mostly a good thing. Yes, the exact same proportion that voted for the measure 40 years ago.\nThat’s a pretty stunning approval rating. By comparison, Gov. Jerry Brown—one of the most popular California political figures in recent memory—has never seen his job approval breach 60 percent over the past eight years. In 2016, Hillary Clinton beat Donald Trump here by a margin not seen since the days of Franklin Roosevelt, although she got less than 65 percent of the vote.\nSuch enduring popularity has led officials to long regard Prop. 13 as the untouchable third rail of California politics—yet voters may have a chance to repeatedly touch it in the not-too-distant future. A major proposed crimp in its tax-cutting power is likely headed for the 2020 ballot, and voters will decide on a possible expansion of Prop. 13 benefits this fall. With those battles on the horizon, here’s a breakdown of just how broadly, deeply and consistently Californians love their cheap property taxes.\nProp. 13’s popularity has been remarkably consistent. Nothing really moves it much, not even house prices.\nProp. 13 features many controversial components, but the part that hits taxpayers’ pocketbooks directly is arguably the most important. Prop. 13 caps a homeowner’s property tax bill at 1 percent of its market value when the new home is bought, and then indexes that value to inflation. In other words, if you bought your home in 1998, in real terms you’re still essentially being taxed on the price you paid back then—not on what it’s worth 20 years later, which is likely a lot more.\nGiven that the benefits of Prop. 13 are bigger in a hotter housing market—the more your house is worth, the more Prop. 13 saves you on your property tax bill—you might expect a strong relationship between housing prices and Prop. 13’s approval rating.\nYou’d be wrong.\nSince the institute began polling on Prop. 13 in the early 2000s, the initiative’s approval rating has consistently hovered around the high 50s. That’s true through housing booms and busts.\nWhen California’s housing market was cratering in 2008, 59 percent of those polled thought Prop. 13 had worked well for California. Ten years later, with home prices in many parts of the state at all-time highs, 56 percent of those polled thought Prop. 13 had worked out well. (These marks are for all Californians. Likely voters give Prop. 13 that approval rating of 65 percent).\nSupport for Prop. 13 is unsurprisingly strongest among those voting blocs you associate with wanting lower taxes—older, whiter, more conservative homeowners. More than 70 percent of Republicans said Prop. 13 was working out well, as did 70 percent of homeowners.\nBut the landmark initiative enjoys widespread support among pretty much every other major partisan and demographic group. A clear majority of Democrats, independents, self-identified liberals, younger voters, and those with household income below $40,000 give Prop. 13 good marks. Perhaps most shockingly, 57 percent of renters support Prop. 13.\nHow Prop. 13 is like ‘Obamacare’. No, really.\nThose who wish to revise Prop. 13 can find a bright spot in the relatively high percentage of Californians who may not know much about the initiative or its consequences. Nearly one in five Californians surveyed couldn’t say whether Prop. 13 has been good or bad for the state.\nIn the years following the passage of the Affordable Care Act (aka Obamacare) in 2010, national polls revealed a consistent contradiction. While most polls found a majority of respondents saying they didn’t like the law writ large, the same polls saw fairly high approval ratings for most of the Affordable Care Act’s specific provisions—keeping adult children on family health plans, for example, or prohibiting price discrimination against people with pre-existing health conditions.\nPolling on Prop. 13 has suggested a similar disconnect between how Californians feel about the initiative overall and how they feel about individual components.\nBack in 2008 (unfortunately the last year this question was asked), PPIC explained a key consequence of Prop 13 to respondents—the fact that someone who recently bought a home will typically pay much higher property taxes then someone who bought a nearly identical home decades ago in the same neighborhood. Only 41 percent said they supported that defining feature of Prop. 13.\nA similar pattern surfaces based on public attitudes about “split-roll”—the idea possibly headed for the 2020 ballot that commercial properties should be taxed at market value. Prop. 13 treats business and residential properties essentially the same.\nFor most of the past decade, a clear majority of Californians supported the “split roll” idea. But that support isn’t as strong as it used to be. Back in 2012, 60 percent of likely voters wanted to modify Prop. 13 to tax commercial properties at their market value. In January of this year, supporters had dipped to 46 percent.","url":"https://calmatters.org/articles/california-proposition-13-approval-rating/"}
