{"authors":["Jessica Calefati","Julie Cart","Dan Morain"],"date_download":"2018-10-30 22:25:53","date_modify":"2018-10-30 22:25:53","date_publish":"2018-07-22 07:01:42","description":"Faced with a pension debt crisis, California schools may need to use over half of all their new money to cover growing teacher pension obligations.","filename":"data/vaneerConsumption/Californiateacherpensiondebtswampsschoolbudgets.json","image_url":"https://calmatters.org/wp-content/uploads/Teachers-Pension_003-e1532115431880.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938353.html","title":"California teacher pension debt swamps school budgets","title_page":"California teacher pension debt swamps school budgets | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"C\nalifornia’s public schools have enjoyed a remarkable restoration of funding since the bone-deep cuts they endured during the recession, but many are now facing a grave financial threat as they struggle to protect pensions crucial for teachers’ retirement.\nOver the next three years, schools may need to use well over half of all the new money they’re projected to receive to cover their growing pension obligations, leaving little extra for classrooms, state Department of Finance and Legislative Analyst’s Office estimates show. This is true even though the California State Teachers’ Retirement System just beat its investment goals for the second straight year.\nSome districts are predicting deficits and many districts are bracing for what’s to come by cutting programs, reducing staff or drawing down their reserves—even though per-pupil funding is at its highest level in three decades and voters recently extended a tax hike on the rich to help pay for schools.\nAt the same time, some districts are grappling with how to simultaneously afford raises for teachers who have threatened to strike.\nThe situation could become even more bleak if California’s economy doesn’t keep growing.\nIf there’s another recession – which economists say is increasingly likely given the record length of the expansion underway now – the higher pension payments scheduled could push some districts deeper into the red, Legislative Analyst’s Office data indicates.\n“Many districts’ budgets would be upside down with expenses growing faster than revenues,” said Michael Fine, CEO of the Fiscal Crisis and Management Assistance Team, the state agency responsible for overseeing schools with financial problems.\nSchool systems that saved money over the last few years will be able to use it to buy time, Fine said, but those reserves “won’t eliminate the impact or make that problem go away.” Tackling it will likely require new sources of revenue or an array of cuts.\n“Building maintenance could suffer, grounds care could suffer, class size could suffer, instructional coaches could suffer, athletic programs could suffer, technology could suffer, intervention programs could suffer” Fine said.\nThe problems stem from the state Legislature’s reticence to mandate steeper payments into the California State Teachers’ Retirement System. The system was badly underfunded and careening toward collapse four years ago when school districts, teachers and the state all agreed to pay more to reduce its unfunded liability, which now stands at $107 billion.\nDistricts took on the greatest share of those new costs, agreeing to increase payments from 8 percent of their payroll in 2013 to 19 percent by 2020.\nNo matter how burdensome the larger and larger pension payments may be, actuaries say they’re necessary to protect teachers’ hard-earned retirement and prevent the system from running out of money. Teachers don’t get social security, and unlike firefighters or police officers, most retirees earn modest pensions of about $55,000 a year.\nThe Brown administration has directed an additional $20 billion to the state’s public schools since 2013 and says districts have had plenty of time to plan for the pension payments ahead. But many school leaders and advocates want the state to invest even more—especially given that in the most recent state-by-state comparison, from 2014, California ranked near the bottom in per-pupil spending when cost-of-living was taken into account.\n“Knowing that these liabilities were growing, we provided districts with the resources they needed to plan accordingly,” said H.D. Palmer, a spokesman for the state Department of Finance.\nMeanwhile, the state’s largest teachers union is downplaying the problem and encouraging its members to bargain for raises. California’s teachers may be among the nation’s most generously paid, but they say the money doesn’t go very far because the state’s cost of living is so high.\nSchool officials are left with a Gordian knot of politically charged problems, forced to make escalating payments into the pension fund while trying to elevate disadvantaged students’ sagging classroom performance, which remains among the country’s worst despite the state’s big investment in their learning through a policy championed by Brown.\n“We need to graduate more kids and close academic achievement gaps, but we can’t move the needle when costs are rising like this,” said Dennis Meyers, assistant executive director for governmental relations of the California School Boards Association, who stressed that his group is not seeking to reduce teachers’ retirement benefits.\n“We simply need more revenue, and we’re out here waving the white flag, looking for relief.”\nEach of California’s school districts is bound to tackle these challenges differently, so CALmatters visited three of them whose circumstances are emblematic of what others across the state are experiencing. During those visits, we spoke with the people working to solve the problem.\nFremont Unified devotes a greater share of its budget to salary than any other district in the state (discover the percentage devoted to salaries at each of California’s school districts here). So when the largest pension payments are phased in, Fremont will be hit especially hard. That means the district’s budget could face cuts even as enrollment in the Bay Area school system grows.\nSacramento City Unified knew that larger pension payments were coming and saved money to prepare for them. Then the local teachers union criticized the district for hoarding cash and threatened to strike. Now, the contested funds are being used to finance a raise that teachers say is long overdue and that the county superintendent believes the district can’t afford.\nAnd in Los Angeles, growing demand for charter schools and a dwindling birth rate has led to declining enrollment in the district’s own schools, which means pension payments will rise even as the district’s state funding shrinks. School officials recently predicted that a quarter billion dollar budget deficit was just two years away.\n♦♦♦\nR\naul Parungao’s distinctive grin and his cheery demeanor belie his concern about Fremont Unified’s finances.\nSituated between Oakland and San Jose in the pricey Bay Area, the school system pays its employees more than most. That makes it a desirable place to work but also means it will be hit especially hard when the largest payments required under Brown’s pension plan are phased in.\n“There’s this sense in the community that we’re flush with cash, but I try to remind people about the other half of the story,” said Parungao, the district’s chief business officer.\nEven though revenue is rising because enrollment is growing, the district must hire and pay more employees to serve them. And over the next three years, while Fremont predicts its revenue will grow by $26 million, a 7 percent bump, it also expects its employee pension and health care costs to climb by $14 million, a 23 percent surge.\n“Here’s the bottom line: the extra revenue we expect to get from the state won’t be enough to keep pace with our pension contributions,” Parungao said. “The problem hasn’t exploded big yet, but it will. It’s only a matter of time. I haven’t met another chief business official who isn’t concerned about this.”\nMeanwhile, Fremont’s teachers just won a small raise after months of protracted negotiations.\nThe current pay scale is competitive, with veterans making $114,000 a year, but leaders of the local union say about half of teachers still don’t make enough to live in the district and must commute from up to an hour away.\nBut no matter how tough it may be for the district to afford this 1 percent pay hike, teachers deserve one, said Victoria Birbeck, the union’s president.\n“The series of small raises we’ve received haven’t covered cost of living,” she said. “Besides, the district has known about the governor’s plan for a few years now. There should have been better planning.”\nParungao said planning isn’t the problem.\nThe district stretched to offer teachers a raise last year and even had to shift its budget by millions of dollars to accommodate that 2 percent increase, which came after a 13 percent bump over the prior three years. Plans to upgrade students’ textbooks and computers were postponed and class size for kindergarten, first and second grade students increased slightly.\nGiven the district’s rising pension and other fixed costs, the new agreement’s $7 million price tag will be tough to accommodate. Still, Michele Burke, one of the district’s board members, acknowledged that for many teachers, $1 spent on pensions isn’t as good as $1 spent on salary.\n“As we negotiate with the union, STRS is the elephant in the room,” she said in an interview before the deal was finalized, referring to the acronym for the California State Teachers’ Retirement System. “We’re paying toward your future, but those payments don’t help put food on the dinner table.”\nS\nacramento Mayor Darrell Steinberg only worked with a few key players one weekend last fall when he helped broker a deal to avert a citywide teacher strike, and former school board president Jay Hansen was one of them.\nHansen had tried for months to negotiate the terms of a pay increase for the city’s 3,000 teachers, but the district and leaders of the local teachers union were far apart and neither side would budge. An acrimonious relationship between the two camps was partly to blame for the impasse.\n“It’s like the Hatfields and the McCoys,” Hansen said. “No one remembers why they can’t get along.”\nAt issue during the talks was the $81 million sitting in Sacramento City Unified’s savings account, a sum the district had built up over several years with spoils from California’s booming economy.\nThe union said the money should go toward class size reduction and raises for teachers that would make the district a more attractive place to work. Sacramento educators are paid less than their peers in nearby districts, but they also receive more generous lifetime health benefits, records show. The district said that it had saved the money to help cover rising pension and employee health care costs in the lean budget years ahead.\nIn the end, Steinberg helped craft an agreement that gives Sacramento teachers an 11 percent raise over three years. But just a few weeks after Steinberg announced the deal during a celebratory news conference on the steps of City Hall, Sacramento County Superintendent Dave Gordon delivered some bad news: the district can’t afford it.\n“Based on the review of the public disclosure and the multi-year projections provided by the district, our office has concerns over the district’s ability to afford this compensation package and maintain ongoing fiscal solvency,” Gordon wrote in a December letter to the district.\nThe district’s own budget offers proof of Gordon’s concerns.\nOver the next three years, the school system anticipates its revenue will grow by $6 million, a 1 percent increase, while its pension and health care costs grow by more than $18 million, an 11 percent increase. A popular summer program for struggling students has already been eliminated to save money.\nA second letter Gordon sent in January further underscores his concerns. He called the district’s plan to use one-time money to help cover the cost of the new contract a “poor business practice” that “only perpetuates the district’s ongoing structural deficit.”\n“The pension contributions are putting a strain on everyone’s budgets,” Gordon said in an interview.\nEven though Hansen had been the union’s adversary during months of stalled contract talks, he defended the district’s decision to offer teachers a raise, calling it “the right thing to do” despite the school system’s escalating pension and health care costs. “We did it anyway,” he added.\nSteinberg echoed Hansen’s perspective.\n“A strike would have been calamitous for everybody,” he said. And Sacramento isn’t the only place in California where teachers are thinking about a show of force. At least half a dozen other local unions fighting for higher wages have held labor actions in recent months.\nIn an interview with CALmatters that union leaders cut short after refusing to answer some questions, Executive Director John Borsos rejected any suggestion that the district won’t be able to afford the contract it recently signed or that it ever claimed to have needed the money stockpiled in its savings account to cover rising pension costs.\n“They have more than enough to cover the pension increases,” Borsos said. “And they didn’t make that argument at the bargaining table.”\n♦♦♦\nG\nov. Jerry Brown promised his 2014 funding plan would shore-up California’s teacher pension system, but at least one young Los Angeles teacher, Josh Brown, says he’s not counting on it. The Oliver Wendell Holmes Middle School special educator is so worried about the system’s solvency that he has an alternative retirement plan: using a portion of his salary to invest in the stock market.\n“I’m a fifth-year teacher, I’m 30 years old, and I’m paying into a pension system that may or may not be around when I retire,” he said. “If I were 65-years-old and retiring soon, I would feel differently. Right now, I feel frustrated and worried.”\nThe largest payments required under the plan will be tough for many districts to manage, but they’re going to be especially vexing for large urban districts like Los Angeles Unified, which lost 100,000 students in the last decade and expects to shed more (here’s the toll of that under-enrollment, school by school). That’s a problem because California’s schools are funded on a per-pupil basis and fewer students means less money.\nIn Los Angeles, the swift enrollment decline is due to a dwindling birthrate and growing demand for charter schools, which are publicly funded but independently run, meaning their budgets are separate from the district’s.\nOver the next three years, the district anticipates its employee pension and health care costs will climb $90 million, a 5 percent increase, while its revenue dips about $270 million, a 4 percent decline. The result is a $258 million budget deficit in 2020 that the district can no longer paper over, push off or ignore.\n“We’re going to have to tighten our belts to save our schools,” said Nick Melvoin, a board member whose stark views on district finances have been criticized by skeptical local union leaders and fellow board members. “We’re in a death spiral.”\nThe district plans to tackle the deficit with a one-time $105 million bailout from the state and central office staff reductions. But observers says officials will soon need to consider some painful measures it has so far been able to avoid, like boosting high school class sizes or closing schools with dwindling numbers of students.\nAt least 55 schools across the district are under-enrolled by a quarter, and ten of those are half empty, a CALmatters analysis of building capacity and enrollment data shows.\n“Our costs are rising, and as a result, there are hard choices and trade-offs to make each time we look at the budget,” said Scott Price, the district’s chief financial officer.\nParent Paul Robak fears that if the district doesn’t tackle its budget problems soon, it could be taken over by the state. At a recent board meeting, he urged the members to reject a healthcare spending plan that would further squeeze the budget. The members listened and thanked him for testifying before approving the agreement.\n“It’s as if the board members are prancing down the lane and covering their ears, pretending nothing’s wrong,” said Robak, who has been active on the district’s parent councils for a decade. “Everyone will lose if we fail to act.”\nBoard member Kelly Gonez also acknowledged the district’s budget woes and the pressure of rising pension and health care costs but said officials should be trying to ease the pain by finding new sources of revenue, not by making cuts. All but one other board member declined to comment.\nEven as a fiscal crisis looms, Los Angeles teachers are negotiating for a raise.\n“Everyone who works in the district comes to work with an expectation they’re going to be treated fairly. They need to be treated fairly,” Austin Beutner, a former investment banker and the district’s new superintendent, told the Los Angeles Times. “How we strike that balance remains to be seen.”\nUnited Teachers Los Angeles President Alex Caputo-Pearl declined CALmatters’ request for an interview. However, at a Pepperdine University event held before the state bailout was announced, he pledged to keep pushing for more money and predicted that the state would come through.\n“If we take it off the table,” Caputo-Pearl said, “then we are acknowledging that the public district system is going to go off a fiscal cliff, which (is something) I’m not willing to acknowledge.”\n♦♦♦\nF\nlooded with calls from anxious school officials, Sen. Anthony Portantino of La Canada Flintridge and several other Democrats pushed earlier this year for a fix that would boost districts’ funding by $1 billion a year. In the end, Portantino convinced Brown to include about half as much in the state budget he signed a few weeks ago.\nHe insisted that the money be “flexible,” meaning districts may use it to cover rising pension costs or for anything else. But California’s schools are still underfunded compared to other states, and to better fulfill their responsibility to students and taxpayers, that must change, he said.\n“In a few months, we’ll have a new governor with a new set of priorities,” Portantino said. “Is there more to do? Absolutely.”\nCalSTRS’ first official report on the impact of districts’ growing pension obligations is due to the Legislature mid next year, when school budgets will likely be squeezed the most.\nIn the meantime, Fine hopes a recession doesn’t strike soon and that districts can manage their budgets without needing to make cuts or send out pink slips. He was a deputy superintendent in Riverside during the Great Recession and remembers how painful it was to carry out round after round of layoffs.\n“We lost one of the best counselors and some very bright teachers. I had to layoff someone who years earlier had taught my young children how to swim,” Fine said. “I remember their faces.”\nThis story was updated with additional context on California’s per-pupil spending rank.","url":"https://calmatters.org/articles/california-teacher-pension-debt/"}
