{"authors":["Julie Cart","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 23:08:38","date_modify":"2018-10-30 23:08:38","date_publish":"2017-04-25 09:16:59","description":"A slow-moving emergency is lapping at California’s shores— climate-driven sea-level rise that experts now predict could elevate the water in coastal areas up to 10 feet in just 70 years.","filename":"data/vaneerConsumption/CaliforniasubmergingRisingseasareclaimingitsfamedcoastfasterthanscientistsimagined.json","image_url":"https://calmatters.org/wp-content/uploads/Pacifica-in-Storm-Wikimedia-photo-by-Brocken-Inaglory.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940918.html","title":"California submerging: Rising seas are claiming its famed coast faster than scientists imagined","title_page":"California submerging: Rising seas are claiming its famed coast faster than scientists imagined | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Understanding the threat of sea-level rise in California depends to some extent on where you are standing: Boots in the dust of the Central Valley and you might curse the lateness of a rail shipment held up by flooding at the port of Oakland; bare feet in the sand at Huntington Beach and you may have to consider relocating your family, your home and all your possessions.\nSome simple math: Every inch of sea-level rise equates to an 8- to 10-feet loss of beach. So, using the conservative projection of a 4-foot rise, and the lower-end 8-foot-per inch formula, that equates to 384 feet of coastal beach loss in the next 70 years.\nThe 10-foot rise scenario, which scientists peg as the new worst-case, would cause a land loss of 800 feet—the length of two-and-a-half football fields. The sea will not rise the same amount in every place; scientists say each discrete elevation is dependent on factors such as the shape of the sea floor and the slope of the landfall.\nConsidering the scope of this coming catastrophe, it does not appear to be front-of-mind to many in the state. But that doesn’t mean it’s gone unstudied. California has a peerless capacity to turn over problems until they are smooth and shiny. Understanding comes first, with action often a distant and expensive second.\nA tour through recent scientific analyses:\nA 2009 report on sea-level rise commissioned by the state paints worst-case scenarios that are the stuff of disaster movies: A half-million Californians at risk of flooding and more than $100 billion worth of infrastructure. More than two dozen coastal power plants flooded, along with hundreds of hazardous waste facilities, as well as schools, hospitals, police stations, ports and major airports.\nA 2012 report prepared for the California Energy Commission focused just on the San Francisco Bay and its 1,000 miles of shoreline, concluding: “Rising sea levels will overwhelm the existing protection structures, putting the 140,000 people currently living in vulnerable areas at increased risk.” The authors cautioned their findings did not reflect worst-case scenarios. And, if no action is taken to address the vulnerabilities, the risk projections should be considered “substantially low.”\nThe California Assembly weighed in with a report in 2014, and the next year the Senate chimed in with its own review, amping it up a bit: “With current projections, rising seas combined with a 100-year flood event would close over 2,000 miles of roadway, the Oakland and San Francisco airports, and the Port of Oakland.”\nThe sobering fact of those state-of-the-art reports, recent though they are, is that they are already out of date and not nearly comprehensive enough in describing the scope of what currently faces California. Nor remotely scary enough. What scientists are observing now is, they say, a rapid and steep change that, even as it unfolds over comparatively long periods of time, is nonetheless occurring at a breathtaking pace.","url":"https://calmatters.org/articles/engulfing-crisis-california-sea-level-rise/"}
