{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 17:56:04","date_modify":"2018-10-30 17:56:04","date_publish":"2015-04-28 13:15:36","description":"As the Supreme Court takes up oral arguments on whether there is a fundamental right to gay marriage, Californians will be watching closely. |","filename":"data/vaneerConsumption/CaliforniaWatchesGayMarriageArgumentsatSupremeCourt.json","image_url":"https://media.breitbart.com/media/2015/01/Newsom-AP-1024x766.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_04_28__1540922164.html","title":"California Watches Gay Marriage Arguments at Supreme Court","title_page":"California Watches Gay Marriage Arguments at Supreme Court | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"As the Supreme Court takes up oral arguments on whether there is a fundamental right to gay marriage, Californians will be watching closely. Though the case of Obergefell v. Hodges did not originate in California, the gay marriage debate of recent years has California roots, even before Proposition 8 passed in 2008, particularly through the role of Justice Anthony Kennedy, the Sacramento native and former Ninth Circuit judge who has been central to gay marriage rulings.\nKennedy wrote the majority opinion in U.S. v. Windsor, the 2013 case that overturned the federal Defense of Marriage Act. He wrote: “The federal statute is invalid, for no legitimate purpose overcomes the purpose and effect to disparage and to injure those whom the State, by its marriage laws, sought to protect in personhood and dignity.” For that reason, many predict Kennedy will rule in favor of the plaintiffs in Obergefell and against states’ ability to decide the issue on their own.\nLt. Gov. Gavin Newsom, a former San Francisco mayor who is a noted advocate for gay marriage, is on hand in Washington personally to show his solidarity with the plaintiffs, as are activists from across the Golden State. “…I caution against complacency in this battle against bigotry, especially where states are turning to so-called religious exemptions. Even in California, a vanguard for tolerance, there are those who continue their hateful crusade against love,” Newsom stated.\nCalifornia’s own constitutional amendment enshrining traditional marriage was finally overturned in 2013 as Proposition 8 failed at the Supreme Court on narrow procedural grounds. The state’s elected officials simply failed to defend the statute as required by their oath of office, and as a result those defending the law had no legal right of standing to do so. That case left open the question of whether states could define marriage for themselves at all–a question Obergefell will likely decide.","url":"https://www.breitbart.com/local/2015/04/28/california-watches-gay-marriage-arguments-at-supreme-court/"}
