{"authors":["William Bigelow"],"date_download":"2018-10-30 19:23:59","date_modify":"2018-10-30 19:23:59","date_publish":"2015-08-07 12:42:41","description":"The California Supreme Court threw a giant obstacle on the California bullet train’s track in its ruling about CA's environmental laws.","filename":"data/vaneerConsumption/CaliforniaSupremeCourtCouldStopBulletTrain.json","image_url":"https://media.breitbart.com/media/2015/01/Bullet-Train-1024x619.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_08_07__1540927439.html","title":"California Supreme Court Could Stop Bullet Train","title_page":"California Supreme Court Could Stop Bullet Train | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The California Supreme Court threw a giant obstacle on the California bullet train’s track, ruling that the state agencies cannot escape the state’s environmental laws by claiming federal laws supersede them.\nThe case from which the argument against the California High Speed Rail Authority derives, City of San Diego vs. Board of Trustees of the California State University, revolved around the board wanting to expand the campus of San Diego State University (SDSU) to accommodate more than 10,000 additional students in the next few years. The board argued that CSU “may not lawfully pay to mitigate the off-campus environmental effects of its projects unless the Legislature makes an appropriation for that specific purpose.”\nAs explained by The National Law Review:\nThe California Environmental Quality Act (“CEQA”) mandates that, before approving a project, a public agency must first identify the project’s significant adverse environmental impacts, and then mitigate those impacts by adopting feasible, enforceable mitigation measures or selecting feasible alternatives that avoid the impacts. If mitigation is infeasible, the agency may approve the project despite adverse impacts only by finding that unmitigated effects are outweighed by the project’s benefits.\nThe board attempted to use City of Marina v. Board of Trustees (2009) to buttress its argument, as the court had ruled, “[A] state agency’s power to mitigate its project’s effects through voluntary mitigation payments is ultimately subject to legislative control; if the Legislature does not appropriate the money, the power does not exist.” The board argued that the court’s statement prohibited it from funding off-site mitigation without express appropriation by the Legislature.\nBut the court called the Marina language overstated, and ruled against CSU, stating, “In mitigating the effects of its projects, a public agency has access to all of its discretionary powers and not just the power to spend appropriations.” The court added:","url":"https://www.breitbart.com/local/2015/08/07/california-supreme-court-stops-bullet-train-in-its-tracks/"}
