{"authors":["William Bigelow"],"date_download":"2018-10-30 20:02:06","date_modify":"2018-10-30 20:02:06","date_publish":"2015-03-11 18:45:36","description":"An Agoura Hills daycare center has been sued by parents who claim two teachers punished their children by pressing push pins through their clothes into the skin. |","filename":"data/vaneerConsumption/CaliforniaDayCareAccusedofUsingPushPinstoPunishKids.json","image_url":"https://media.breitbart.com/media/2015/03/Push-pins-cropped-Cary-Bass-Wikimedia-Commons-1024x768.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_03_11__1540929726.html","title":"California Day Care Accused of Using Push Pins to Punish Kids","title_page":"California Day Care Accused of Using Push Pins to Punish Kids | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"An Agoura Hills daycare center has been sued by parents who claim two teachers punished their children by pressing push pins through their clothes into the skin.\nLast May, the California Department of Social Services made an impromptu visit to the school, called Tutor Time, and discovered evidence of wrongdoing. Three members of the staff were subsequently fired. One of the members had allegedly known that wrongdoing had occurred, but didn’t report anything.\nThe two teachers who allegedly abused the two young boys were identified in the lawsuit as Rosa Nepomuseno and Jessica Morales, according to CBS Los Angeles. The suit charges the school with negligence, negligent supervision and hiring, failure to report abuse, assault and battery, breach of contract and both intentional and negligent infliction of emotional distress.\nCBS reported that the lawsuit stated, “If a boy was deemed inattentive or failed to follow directions, these teachers would stick a push pin into the child’s legs. This practice was so commonplace at Tutor Time that the defendants had given it a name; they called it ‘pica pica’.”\nThe suit alleges that a sister of one of the victims was “made to watch the defendants inflict this brutal punishment on her twin brother, which resulted in severe mental and emotional injuries to her.”\nThe parents’ lawyer, Robert Clayton, told ABC7 News, “What happened at this Tutor Time in Agoura Hills is just shocking….They would say, ‘You are going to get pica, pica,’ and they would poke them in the legs with pushpins…The push pin was pressed through the clothes into the skin.”\n“Pica, pica” is the Spanish equivalent of “prick, prick.” One former employee of the school told ABC 7 that the classroom for the two-year-olds featured two teachers dealing with 24 children.\nTwo parents whose children were not abused still are pulling their children from the school, adding that the school never told them about the alleged prior abuse.\nTutor Time, which has schools across the nation, has retaken the school from the franchisee who ran it during the incidents. The company stated, “We train our employees regularly and emphasize the use of our positive guidance policy for behavior management.” The parents suing the school claim that the classrooms had viable video cameras at the time of the incidents, but the cameras did not record the occurrences.","url":"https://www.breitbart.com/local/2015/03/11/california-day-care-accused-of-using-push-pins-to-punish-kids/"}
