{"authors":["Michelle Moons"],"date_download":"2018-10-30 20:43:55","date_modify":"2018-10-30 20:43:55","date_publish":"2015-04-29 07:05:39","description":"Over 4,600 people are reportedly presumed dead in the 7.8 magnitude earthquake that struck Nepal Saturday and the numbers continue to rise, but nine Californians in various stages of rescue or distress remain alive at this point. |","filename":"data/vaneerConsumption/CaliforniaClimbersSurvivingEverestforNowWhileRescueUncertain.json","image_url":"https://media.breitbart.com/media/2015/04/ap_ap-photo1509-1024x768.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_04_29__1540932235.html","title":"California Climbers Surviving Everest–for Now–While Rescue Uncertain","title_page":"California Climbers Surviving Everest--for Now--While Rescue Uncertain | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Over 4,600 people are reportedly presumed dead in the 7.8 magnitude earthquake that struck Nepal Saturday and the numbers continue to rise, but nine Californians in various stages of rescue or distress remain alive at this point.\nFour San Diegans are trapped due to an avalanche and are running low on food, said a relative of one in the group, according to the San Diego Union-Tribune. Oscar Olea, Brigida Matinez, Kevin Krogh and Kathleen Heldman had recently arrived for a month-long hiking trip. Nurse Martinez, the only medical professional in the area, has been putting her skills to work and helping injured survivors. While many in the camp remain trapped, about 20 of the 50 camp survivors have been medically evacuated.\nSan Francisco-based Everest climber Siobhan McFeeney, 43, made her way up to the mountain’s Camp 1 after holding on for dear life on her initial ascent as quake induced avalanches that killed 18 pummeled the region, McFeeney’s husband Terry Trevino said, according to the San Francisco Chronicle. McFeeney continued up the infamously dangerous icefall section as the mountain continued shaking Saturday in order to make it to Camp 1, after which she was helicoptered back to base camp. She now sits trapped there.\nRescue efforts for survivors stranded at Everest’s base camp remain uncertain, as weather conditions have hindered efforts. Supplies are also a concern for those left and it remains unclear whether down mountain supply depots and villages that could provide relief are still standing or have also succumbed to quake or avalanche, Trevino reportedly relayed after hearing from his wife via satellite phone.\nGoogle executive Dan Fredinburg, 33, from San Francisco, is among at least four Americans dead on the mountain, the Chronicle reported.\nFour men from Humboldt County, California, in two separate hiking groups, are safe. Each of the two groups had plans to visit areas that faced much devastation, but were thankful, reports the Eureka Times-Standard. Two are hiking back to Lukla to wait for a flight out, while another two flew from Lukla to the reportedly chaotic Kathmandu airport where they were waiting for a flight home.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2015/04/29/california-climbers-surviving-everest-for-now-while-rescue-uncertain/"}
