{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 18:15:41","date_modify":"2018-10-30 18:15:41","date_publish":"2015-05-27 12:53:37","description":"California is enjoying another year of budget surplus--and the state's Democrats cannot wait to spend the spoils. Though Gov. Jerry Brown's new plans call for spending an additional $7.5 billion more than originally budgeted--an increase that is larger than the entire budgets of some states--Democrats in the state legislature are predicting a $2.5 billion surplus in the year to come, and bickering over which of the state's generous social welfare programs will benefit from the new cash. |","filename":"data/vaneerConsumption/CaliforniaDemocratsDisagreeHowMuchSurplustoWaste.json","image_url":"https://media.breitbart.com/media/2015/05/CA-State-Assembly-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_27__1540923341.html","title":"California Democrats Disagree: How Much Surplus to Waste?","title_page":"California Democrats Disagree: How Much Surplus to Waste? | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"California is enjoying another year of budget surplus–and the state’s Democrats cannot wait to spend the spoils. Though Gov. Jerry Brown’s new plans call for spending an additional $7.5 billion more than originally budgeted–an increase that is larger than the entire budgets of some states–Democrats in the state legislature are predicting a $2.5 billion surplus in the year to come, and bickering over which of the state’s generous social welfare programs will benefit from the new cash.\nAs the Los Angeles Daily News reports, rival proposals from the State Senate and State Assembly agree that some of the surplus must be spent on the state’s new “rainy day” fund, approved by voters in 2014, as well as on programs that were cut during the lean years of the recession. But they disagree over funding to students and child care to low-income families–both under the rubric of providing for future “economic growth,” according to Senate President Pro Tem Kevin De Léon.\nThe Los Angeles Times notes that Democrats want to renew a subsidy for the United Farm Workers’ health insurance that was enacted last year as a “one-time stopgap measure” to help the union comply with Obamacare. There is little interest in spending on infrastructure, such as the state’s crumbling highways, which Gov. Brown’s budget proposal says are short of money for basic maintenance.\nThe legislature must pass a budget by June 15 or work without pay, the Daily News notes.","url":"https://www.breitbart.com/politics/2015/05/27/california-democrats-disagree-how-much-surplus-to-waste/"}
