{"authors":["Julie Cart","David Gorn","Felicia Mello"],"date_download":"2018-10-30 23:07:45","date_modify":"2018-10-30 23:07:45","date_publish":"2017-04-27 15:14:00","description":"California Attorney General Xavier Becerra joined New Mexico Attorney General Hector Balderas in filing a lawsuit this week against the U.S. Department of the Interior for delaying the implementation of a rule intended to ensure that the taxpayers —and states— receive appropriate royalties from mining and energy companies leasing federal lands.","filename":"data/vaneerConsumption/CaliforniasuesTrumpadministrationtostopitfromdelayingoilroyalties.json","image_url":"https://calmatters.org/wp-content/uploads/becerra-300x200-2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles_trump_california__1540940865.html","title":"California sues Trump administration to stop it from delaying oil royalties","title_page":"California sues Trump administration to stop it from delaying oil royalties | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"An Orange County Superior Court judge has ruled that California’s “sanctuary state law” conflicts with Huntington Beach’s rights as a charter city, throwing some protections for undocumented immigrants into question in 120 cities throughout the state.\nSenate Bill 54 or the California Values Act, authored by state Sen. Kevin de León, a Los Angeles Democrat who is challenging incumbent U.S. Sen. Dianne Feinstein, doesn’t actually make California a sanctuary for undocumented immigrants. Rather, it puts limits on the amount of work state and local government officials can do to expedite ICE enforcement.\nThough many California cities support the law, arguing it makes immigrant communities less afraid to report crimes and promotes trust in local institutions, dozens of other municipalities have adopted resolutions opposing it in principle. Huntington Beach, in coastal Orange County, was the first to take its challenge to court.\nJudge James Crandall did not issue a legal opinion about the case, but granted a writ of mandate, ruling that the state cannot enforce its sanctuary law there, based on Huntington Beach’s status as a charter city.\nCharter cities are organized under their own municipal codes, rather than under the state’s general law. One hundred twenty-one of California’s 482 cities share the designation, including Los Angeles, Sacramento, San Jose, San Diego and San Francisco.\nLawyers for Huntington Beach argued that the state sanctuary law intruded on the city’s local control.\n“Huntington Beach is saying, ‘If we want to volunteer to go above and beyond to help immigration officials, we should be able to do that.’ Under SB 54 they can’t,” said immigration law expert Jean Reisz at University of Southern California’s Gould School of Law.\nIt’s unclear how the judge’s decision will affect other charter cities, or whether it will inspire more legal opposition.\n“It certainly could apply to all of them, but this is an injunction to keep the state from enforcing this law against Huntington Beach, not all charter cities,” Reisz said.\nThe state Attorney General’s office is expected to appeal.\n“Preserving the safety and constitutional rights of all our people is a statewide imperative which cannot be undermined by contrary local rules,” state Attorney General Xavier Becerra said in an email. “We will continue working to ensure that our values and laws like the California Values Act are upheld throughout our state.”\nThe ruling is separate from the federal lawsuit challenge filed last year by the Department of Justice to the sanctuary laws, which are actually made up of three pieces of legislation. A U.S. District Judge struck down one of the three, pertaining to business owners’ interactions with immigration authorities, but upheld the other two, including SB 54.","url":"https://calmatters.org/articles/trump_california/california-sues-trump-administration-stop-delaying-oil-royalties/"}
