{"authors":["Kate Galbraith","Dan Morain","Julie Cart","Guest Commentary"],"date_download":"2018-10-30 22:41:01","date_modify":"2018-10-30 22:41:01","date_publish":"2015-11-19 08:00:00","description":"When Gov. Jerry Brown arrives in Paris next week for a major international conference on climate change, he will showcase one of the world’s most sweeping","filename":"data/vaneerConsumption/Californiaaclimatemodelfortheworldhasworktodoathome.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/paris_skyline-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939261.html","title":"California, a climate model for the world, has work to do at home","title_page":"California, a climate model for the world, has work to do at home | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"When Gov. Jerry Brown arrives in Paris next week for a major international conference on climate change, he will showcase one of the world’s most sweeping programs to cut greenhouse gas emissions.\nCalifornia has perhaps the most comprehensive cap-and-trade program in the world, setting a limit and a price for pollution from factories, utilities and transportation fuels. The state’s 2030 goals of getting half of its electricity from renewable sources and reducing greenhouse gas emissions to 40 percent below 1990 levels are also among the most ambitious anywhere.\nAs the world’s eighth-largest economy, California is often cited as an international example of what is possible on climate, alongside powerhouses like Germany.\n“California definitely is in a leadership role, and has been for quite a long time,” said Richard Kinley, a top official with the United Nations Framework Convention on Climate Change, which is the forum for the Paris conference. The state, he added, has “a lot of opportunity” to work with other jurisdictions to push for climate action.\nWhile the state is a global model for climate policy, however, it also produces more greenhouse gas emissions per person than almost anywhere else in the world, due partly to its heavy reliance on cars. Among the eight largest economies, California is second only to the U.S. in emissions per capita.\nGreenhouse gases per capita Greenhouse gases per capita View More SHARE Facebook\nTwitter\nEmail\nTransportation is the largest single source of California’s greenhouse gas emissions, accounting for 37 percent of the state’s total. For most of the world’s large economies, the most polluting sector is electricity and heat, according to data from World Resources Institute, a nonprofit research organization.\nCalifornia fares better compared to other major economies in terms of the emissions intensity of its economy — meaning that its emissions are relatively low per unit of economic output. But Severin Borenstein, an energy expert at UC Berkeley’s Haas School of Business, said that measure can be misleading because California imports many items that are manufactured elsewhere, effectively outsourcing the carbon-intensive activities to other nations.\n“If you count … greenhouse gases per-capita or per dollar of GDP, I think it’s too early to claim California is a real leader,” Borenstein said. “California’s leadership is in recognizing the problem, and in starting to propose and investigate real solutions.”\nThat’s what California leaders will be emphasizing when they arrive at the Paris conference with perhaps the biggest state delegation.\nThe goal of the Paris conference, running from November 30th to December 11th, is to produce a global pact that describes what the world, and each nation, will do to cut emissions and slow global warming. The conference is continuing despite the recent terrorist attacks.\nCalifornia will have no negotiating role. But state officials will ensure that federal negotiators hear their views, and they will showcase California at the innumerable climate action panels and meetings that happen alongside the negotiations. Brown plans to meet with officials from a number of countries.\nParis Conference Paris Conference View More SHARE Facebook\nTwitter\nEmail\nGoing into the Paris conference, “we’re concerned that the international effort is insufficiently ambitious — that it’s going to come up short,” said Ken Alex, a senior policy advisor to Brown. California has a major stake in climate action, due to concerns about rising sea levels, shrinking snow packs, wildfires and drought, Alex said.\nAs part of its lobbying effort in Paris, California has been helping to organize more than 55 “sub-national” governments around the world. Each government, from the Chinese city of Zhenjiang to Wales, has signed or endorsed the “Under 2 MOU,” encouraging the conference to adopt goals that will limit global warming to less than 2-degrees Celsius.\nAlex is one of approximately six officials from the governor’s office who will travel to Paris alongside Brown, with costs paid by foundations and business groups. Other Californians attending the conference include former Gov. Arnold Schwarzenegger; the Democratic leaders of the state Senate and Assembly; state Sen. Fran Pavley (D-Agoura Hills); Mary Nichols, chair of the California Air Resources Board, the state’s powerful regulatory agency and Tom Steyer, a wealthy Bay Area environmentalist and prominent political donor.\nPavley was the co-author of the California Global Warming Solutions Act in 2006, which calls for the state to cut greenhouse gas emissions to 1990 levels by 2020. The act, also known as AB 32, led to the creation of the state’s cap-and-trade program and a requirement for lowering the carbon intensity of motor fuels like gasoline and diesel.\nPavley said California has had plenty of opportunity to preview the Paris conference, with a parade of international officials visiting to discuss climate. “Almost never a week goes by that we don’t have people from a foreign country coming to Sacramento on these policies,” she said.\nCalifornia’s international reputation was buttressed this year by a law requiring half of the state’s electricity to come from renewable sources in 15 years. That is more ambitious than most US states or the federal government, and it runs parallel to the aggressive clean-energy goals in Germany, which plans to get 80 percent of its electricity from renewables by 2050.\nDemocratic leaders had hoped to require halving the amount of petroleum used in motor vehicles by 2030, but that goal was cut from the bill after opposition from moderate Democrats. Brown, aware of California’s outsize transportation emissions, has vowed to achieve such cuts anyway. California’s cap-and-trade program covers transportation fuels like gasoline and diesel, in contrast to Europe’s cap-and-trade program, which does not include most transportation.\nSenate President pro Tempore Kevin de León (D-Los Angeles), who authored the climate change bill this year, said a crucial goal of his in Paris will be attracting more investment to California “so we can keep innovating and create the technology that will help reduce carbon emissions.”\nCalifornia’s greenhouse gas emissions are declining, but not rapidly. They fell by less than 1 percent between 2009 and 2013, the latest year available, according to a state inventory. Emissions need to fall dramatically, by more than 40 percent, to meet the 2030 goal Brown has set, and even farther for another goal in 2050.","url":"https://calmatters.org/articles/california-a-climate-model-for-the-world-has-work-to-do-at-home/"}
