{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:52:39","date_modify":"2018-10-30 19:52:39","date_publish":"2015-10-04 22:18:13","description":"A self-defense and law enforcement training facility in Torrance, California, reportedly denied enrollment to the Umpqua gunman.","filename":"data/vaneerConsumption/CaliforniaFirearmsAcademyRejectedUmpquaGunman.json","image_url":"https://media.breitbart.com/media/2015/10/ap_ap-photo67-wi-e1443813314263.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_10_04__1540929159.html","title":"California Firearms Academy Rejected Umpqua Gunman","title_page":"California Firearms Academy Rejected Umpqua Gunman | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A self-defense and law enforcement training facility in Torrance, California, claims that sometime around 2012 or 2013 Umpqua Community College gunman Chris Harper Mercer wanted to take advanced firearm instruction but was denied because he allegedly wanted to forgo a gun safety course to do it.\nThe name of the training facility is Seven 4 Para.\nAccording to Reuters, Seven 4 Para president and head instructor Eloy Way said, “We wanted [Mercer] to take a beginner safety course and he was trying to tell me that he already had experience with firearms.”\nIn addition, Way said Mercer “was just kind of a weird guy and seemed kind of spoiled, immature. He was a little bit too anxious to get high-level training and there was no reason for it.”\nSo Way rejected Mercer.\nUnbeknownst to Way, Mercer had been rejected in a similar fashion years earlier by the U.S. Army. He “enlisted in the U.S. Army and served for about a month in 2008 before being discharged for failing to meet administrative standards,” Reuters reports.\nMercer and his mother lived in Torrance before moving to Winchester, Oregon, in 2013. The Daily Mail reports that neighbors who watched Mercer growing up in Torrance remembered “a ‘paranoid’ and ‘childlike’ character who circled his neighborhood on a bicycle and ‘freaked out’ at the smallest things.”\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/local/2015/10/04/california-firearms-academy-rejected-umpqua-gunman/"}
