{"authors":["Antoinette Siu","Laurel Rosenhall","Dan Morain"],"date_download":"2018-10-30 22:47:17","date_modify":"2018-10-30 22:47:17","date_publish":"2018-08-09 00:11:14","description":"California is moving toward becoming the first state to fine companies that fail to have women on their boards of directors.","filename":"data/vaneerConsumption/Californiamaymandateawomanintheboardroombutbusinessesarefightingit.json","image_url":"https://calmatters.org/wp-content/uploads/adult-analyzing-brainstorming-1080865-600x400.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939637.html","title":"California may mandate a woman in the boardroom-but businesses are fighting it","title_page":"California may mandate a woman in the boardroom—but businesses are fighting it | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"California is moving toward becoming the first state to require companies to have women on their boards—assuming the idea could survive a likely court challenge.\nSparked by debates around fair pay, sexual harassment and workplace culture, two female state senators are spearheading a bill to promote greater gender representation in corporate decision-making. Of the 445 publicly traded companies in California, a quarter of them lack a single woman in their boardrooms.\nSB 826, which won Senate approval with only Democratic votes and has until the end of August to clear the Assembly, would require publicly held companies headquartered in California to have at least one woman on their boards of directors by end of next year. By 2021, companies with boards of five directors must have at least two women, and companies with six-member boards must have at least three women. Firms failing to comply would face a fine.\n“Gender diversity brings a variety of perspectives to the table that can help foster new and innovative ideas,” said Democratic Sen. Hannah-Beth Jackson of Santa Barbara, who is sponsoring the bill with Senate President Pro Tem Toni Atkins of San Diego.\n“It’s not only the right thing to do, it’s good for a company’s bottom line.”\nYet critics of the bill say it violates the federal and state constitutions. Business associations say the rule would require companies to discriminate against men wanting to serve on boards, as well as conflict with corporate law that says the internal affairs of a corporation should be governed by the state law in which it is incorporated. This bill would apply to companies headquartered in California.\nJennifer Barrera, senior vice president of policy at the California Chamber of Commerce, argued against the bill and said it only focuses “on one aspect of diversity” by singling out gender.\n“This bill basically mandates that we hire the woman above anybody else who we may be fulfilling for purposes of diversity,” she said at a hearing.\nSimilarly, a legislative analysis of the bill cautioned that it could get challenged on equal protection grounds, and that it would be difficult to defend, requiring the state to prove a compelling government interest in such a quota system for a private corporation.\nFive years ago, California was the first state to pass a resolution, authored by Jackson, calling on public companies to increase gender diversity. In response, about 20 percent of the companies headquartered in the state followed through with putting women on their boards, according to the research firm Board Governance Research. But the resolution was non-binding and expired in December 2016.\nOther countries have been more proactive. Norway in 2007 was the first country to pass a law requiring 40 percent of corporate board seats be held by women, and Germany set a 30 percent requirement in 2015. Spain, France and Italy have also set quotas for public firms.\nIn California, smaller companies have fewer female directors. Out of 50 companies with the lowest revenues, 48 percent have no female directors, according to Board Governance Research. Only 8 percent of their board seats are held by women.\nThe 2017 study said larger companies did a better job of appointing women, with all 50 of the highest-revenue companies having at least one female director and 23 percent of board seats held by women.\n“The main issue is still that a lot of companies headquartered here don’t have women on their boards,” said Annalisa Barrett, clinical professor of finance at the University of San Diego’s School of Business. “We quite often like to think of California as progressive and a leader on social issues, so that’s kind of disappointing.”\nBarrett publishes an annual report of women on boards in California. Public companies are major employers in the state, and their financial performance has a big impact on public pension funds, mutual funds and investment portfolios. “Financial performance does really impact the broader community,” she said.\nThe National Association of Women Business Owners, sponsor of the bill, says an economy as big as California’s ought to “set an example globally for enlightened business practice.” In a letter of support, the association cites studies that suggest corporations with female directors perform better than those with no women on their boards.\nOne University of California, Davis study did find that companies with more women serving on their boards saw a higher return on assets and equity, but the author acknowledges this may not suggest a cause-and-effect.","url":"https://calmatters.org/articles/california-women-in-boardrooms-mandate/"}
