{"authors":["Nate Church"],"date_download":"2018-10-30 18:01:58","date_modify":"2018-10-30 18:01:58","date_publish":"2018-08-31 00:43:29","description":"Encino, California, resident Robert D. Chain was taken into custody on charges of \"making threatening communications in interstate commerce.\"","filename":"data/vaneerConsumption/CaliforniaManArrestedforThreatsofViolenceAgainstBostonGlobe.json","image_url":"https://media.breitbart.com/media/2018/08/boston-globe-headline-after-death-threats-aug-2018-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2018_08_30__1540922518.html","title":"California Man Arrested for Threats of Violence Against Boston Globe","title_page":"California Man Arrested for Threats of Violence Against Boston Globe | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Encino, California, resident Robert D. Chain was taken into custody on charges of “making threatening communications in interstate commerce,” after alleged threats against the Boston Globe.\nChain, 68, allegedly made 14 threatening phone calls to the Boston Globe between August 10 and 22. He threatened to shoot employees and, on August 16, told the newspaper he was going to carry out his threats at 4:00 PM. Though extra police officers were stationed outside the building as a precaution, Chain did not follow through.\nOn August 22, Chain allegedly told the paper that his threats would not stop “as long as you keep attacking the President, the duly elected President of the United States, in the continuation of your treasonous and seditious acts.” In many of these threatening calls, Chain referred to the press as the “enemy of the people” — a designation for which President Donald Trump has become well known.\nSpecial Agent Harold Shaw of the Boston division of the FBI issued a warning: “Everyone has a right to express their opinion, but threatening to kill people takes it over the line and will not be tolerated.” He said, “Today’s arrest of Robert Chain should serve a warning to others, that making threats is not a prank, it’s a federal crime.” Chain will face a judge in Los Angeles, on Thursday afternoon.\nThe Boston Globe has joined 400 other news media organizations in order to respond to Trump’s sustained criticism. “A central pillar of President Trump’s politics is a sustained assault on the free press,” they wrote in an editorial.\n“Journalists are not classified as fellow Americans, but rather ‘the enemy of the people,'” the Globe continued. “This relentless assault on the free press has dangerous consequences. We asked editorial boards from around the country – liberal and conservative, large and small – to join us today to address this fundamental threat in their own words.”","url":"https://www.breitbart.com/the-media/2018/08/30/california-man-arrested-for-threats-of-violence-against-boston-globe/"}
