{"authors":["Jessica Calefati","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:50:33","date_modify":"2018-10-30 22:50:33","date_publish":"2017-04-12 23:56:42","description":"Vowing to fight public school profiteering, Democratic state lawmakers have introduced legislation that would either block or seriously limit for-profit","filename":"data/vaneerConsumption/Californiabillsaimtocrackdownonforprofitcharterschools.json","image_url":"https://calmatters.org/wp-content/uploads/Boy-studying-at-computer-1024x683.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939833.html","title":"California bills aim to crack down on for-profit charter schools","title_page":"California bills aim to crack down on for-profit charter schools | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Vowing to fight public school profiteering, Democratic state lawmakers have introduced legislation that would either block or seriously limit for-profit companies’ ability to operate charter schools in California.\nThe two proposals seek to address a growing concern among legislators that Wall Street-traded companies managing some of the state’s charters are raking in mountains of state aid while providing students a poor education.\nDemocratic Assemblyman Kevin McCarty of Sacramento authored one of the measures, Assembly Bill 406, because he said for-profit firms haven’t proven they can manage high-achieving schools and shouldn’t be allowed to fail any longer on taxpayers’ dime—even if the Trump administration thinks otherwise.\n“When we allow private companies to run public schools, we invite them to focus on shareholders and profit margins instead of on children and student achievement,” McCarty said in an interview. “Profiting off the public good is bad public policy.”\nHe says he first learned of the problem last year when a San Jose Mercury News investigation cited state data showing that K12 Inc.—the biggest for-profit firm of its kind in the state—reaps tens of millions of taxpayer dollars annually while operating online academies that graduate fewer than half of their high school students.\nBy the state’s calculation, about half of the 15,000 California students enrolled in the company’s schools are not proficient in reading and only a third are proficient in math—levels below statewide averages.\nThe investigation also noted that kids who spend as little as one minute during a school day logged onto K12’s software may have been counted as “present” in records used to calculate the amount of funding the schools get from the state. And last year, the company reached a $168.5 million settlement with the state over claims it had done just that.\nA spokesman for K12 declined to comment on the legislation.\nCalifornia’s effort to reign in for-profit charters is at odds with the Trump administration, whose top education official, U.S. Secretary of Education Betsy DeVos, has long been a supporter of the very for-profit companies these bills aim to stifle.\nWhen DeVos’ husband Dick ran for governor of Michigan in 2006, he disclosed that they were early investors in K12. And as chairwoman of the American Federation for Children, a school choice advocacy group, Betsy DeVos repeatedly called for expanding families’ access to online “virtual” schools.\nMcCarty’s bill would bar charter schools operated by for-profit companies or management organizations, and it could block companies like K12 from running schools in this state. It would also impact three online schools managed by a for-profit company called Connections Academy whose reading test scores exceed the state average, according to state education data.\nThe measure resembles legislation that stalled in the final days of last year’s legislative session after the California Teachers Association and the California Charter Schools Association failed to reach agreement on amendments.\nVirginia-based K12 now faces a federal securities fraud lawsuit filed by shareholders as well. Seeking to dismiss the case, the company has argued in court documents that the plaintiffs “fall far short” of their burden to prove the complaint is justified.\nStill, in the months since Trump’s election, K12’s stock price has almost doubled.\n“These companies are ripping off taxpayers and making a lot of money at students’ expense,” McCarty said. “Enough.”\nThe California Charter Schools Association shares McCarty’s concerns, but the powerful advocacy group disagrees with his approach.\nFearing that overbroad language in AB 406 could impact routine contracting and send successful charter schools’ operations into disarray, the organization is sponsoring an alternative, Senate Bill 806. Authored by Democratic state Sen. Steve Glazer of Orinda, the measure seeks to create a “firewall” between for-profit contractors and the nonprofit charter schools they serve.\nSB 806 would prohibit the companies from selecting a school’s board members, approving its budget or supervising any of its teachers. It would also force all charter schools to comply with existing open meeting and open record laws.\n“We don’t think it’s appropriate to prohibit charter schools from contracting with (for-profit companies). We want to create some nuance around when that sort of contracting is appropriate,” said Colin Miller, a senior adviser to the association.\nLawmakers will consider the measures for the first time in education policy committee hearings scheduled for later this month and early May.\nJessica Calefati, who authored the San Jose Mercury News investigation in 2016, is now the education writer for CALmatters.org.","url":"https://calmatters.org/articles/california-bills-aim-crack-profit-charter-schools/"}
