{"authors":["Antoinette Siu","Julie Cart","David Gorn","Felicia Mello"],"date_download":"2018-10-30 23:33:52","date_modify":"2018-10-30 23:33:52","date_publish":"2018-08-30 15:28:00","description":"California’s push to pass the nation's strongest net neutrality protections—and bring back Obama-era rules undone by the Trump administration—advanced today, one step in a high-stakes tech battle that's being waged from here to Washington.","filename":"data/vaneerConsumption/Californiapoisedtoofferstrongestnetneutralityprotectioninthecountry.json","image_url":"https://calmatters.org/wp-content/uploads/IMG_0383-e1535676883603.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles_trump_california__1540942432.html","title":"California poised to offer strongest net neutrality protection in the country","title_page":"California poised to offer strongest net neutrality protection in the country | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"California’s push to pass the nation’s strongest net neutrality protections—and bring back Obama-era rules undone by the Trump administration—advanced today, one step in a high-stakes tech battle that’s being waged from here to Washington.\nThe bill by Democratic Sens. Scott Wiener and Kevin de Léon survived intense negotiations to pass the Democratic-controlled Assembly with overwhelming support by a vote of 61 to 18. It goes back to the Senate for a final vote before the legislative session ends Friday. If passed, it would prohibit internet service providers from slowing or speeding content based on preference or extra payment.\n“The core premise of net neutrality is that we get to decide where we go on the internet, as opposed to telecom and cable companies telling us where to go,” Wiener said in a statement.\nSB 822 aims to protect an open internet by replacing the Trump administration’s repeal of federal protections established during the Obama administration in 2015. It is considered the strongest set of net neutrality provisions since Obama’s were rolled back in June, and would be enforced by California’s attorney general.\nWiener and de Léon’s proposal would ban internet companies from charging businesses access fees in order to reach its online customers. It would also prohibit “zero rating,” a practice in which providers charge consumers for accessing their competitors’ content, but provide a free data incentive for accessing their own content.\nRepublican opponents of the bill slammed it as an overreach that meddles with a free market, creates a regulatory patchwork and invites litigation. Advocates, meanwhile, argued that such protections prevent internet service providers, such as AT&T and Comcast, from throttling internet speeds and creating so-called “fast lane” access.\nNet neutrality proponents include not just technology companies such as Google parent Alphabet Inc. and Facebook, but also the Writers Guild of America and the American Civil Liberties Union.\nThe bill garnered national attention as it moved through the Legislature earlier this year. Facing strong opposition from internet companies and Republican legislators, Democrats anticipated a legal challenge as the state measure advanced.\nIn committee, the bill was heavily amended by Assemblyman Miguel Santiago, a Los Angeles Democrat. In response, Wiener almost withdrew his “hijacked” bill, which he said had been stripped of all its key protections.\nBut in July, the bill’s original provisions were restored and lawmakers reached an agreement to advance it together. Santiago eventually came around and joined as principal coauthor.\n“This bill is about value,” Santiago said. “The question before us is, do you believe in a free and open internet?”\nOn the floor, Republican leaders charged regulation should be left to the feds. Assemblyman Jim Patterson, a Fresno Republican, said the issue will go straight to the U.S. Supreme Court, and the state will lose. Other opponents argued it will chill the tech industry and result in a less robust market for consumers.\n“The worst possible thing we can do is to create 50 different state FCCs,” Patterson argued. “If you are really interested, the place to have this fleshed out is the federal level with federal elections and accountability. It takes several steps way too far.”\n“You’re wading into an area where you have no business in,” echoed Assemblywoman Melissa Melendez, a Lake Elsinore Republican. “This is embarrassing.”\nLobbying was intense as Thursday’s vote neared. A group affiliated to AT&T was reportedly using robocalls to send out automated messages claiming the law would raise consumer cell phone bills. Earlier this month, Verizon was widely criticized for allegedly throttling data speeds for the Santa Clara County Fire Department during the Mendocino Complex fire, a complaint the company denied.\nRyan Singel, media and strategy fellow at Stanford University’s Center for Internet and Society, says public pressure clearly helped secure Assembly approval.\n“While it seems like getting net neutrality passed in California should be simple, the reality is that AT&T is incredibly powerful in California’s legislature—which was made clear when the bill was gutted in committee in June,” Singel said in an email.\nIn recent months, more than 20 states have introduced bills aiming to restore the federal net neutrality protections. Washington and Oregon have already passed legislation.\nMeanwhile, the fight on the federal front is far from over. Tech groups including Amazon, Facebook and the Internet Association this month filed briefs with the federal appeals court supporting a lawsuit against the Federal Communications Commission to bring back net neutrality.","url":"https://calmatters.org/articles/trump_california/california-poised-to-offer-strongest-net-neutrality-protection-in-the-country/"}
