{"authors":["Julie Cart","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:04:09","date_modify":"2018-10-31 00:04:09","date_publish":"2016-03-29 08:00:00","description":"State officials recently added a new piece to the patchwork quilt that is California energy policy:  a mechanism for easily—and publicly—tracking how","filename":"data/vaneerConsumption/Californiawillratebigenergyusers.json","image_url":"https://calmatters.org/wp-content/uploads/5480544493_53d8d77e84_z.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944249.html","title":"California will rate big energy users","title_page":"California will rate big energy users | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"State officials recently added a new piece to the patchwork quilt that is California energy policy: a mechanism for easily—and publicly—tracking how non-residential buildings use energy.\nThe details aren’t worked out yet under a law that took effect three months ago. But such programs are already in place in San Francisco and a smattering of other cities across the country.\nUsing federal Energy Star guidelines, officials measure a building’s energy consumption, then assign a score and make it available to the public.\nStay tuned for more energy-efficiency stories. CALmatters is taking a deep look at a new state requirement that residential and commercial buildings slash their energy use. This is a preview of coming stories.\nHere, officials hope that implementing such a regimen across the state will help get California to its goal of radically reduced energy consumption in coming years.\nThe idea is to create a readily understood vocabulary – perhaps along the lines of restaurant health grades — for energy efficiency. That and transparent information will help consumers make better choices, officials say.\nMeg Waltner, of the Natural Resources Defense Council, which helped the state craft the rule, agrees. “Information makes markets work,” she said.\nDesigning the new program is the responsibility of the California Energy Commission, which is working out the details before it goes into effect in January.","url":"https://calmatters.org/articles/energy-information-about-to-become-public/"}
