{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 21:45:49","date_modify":"2018-10-30 21:45:49","date_publish":"2016-04-04 12:31:48","description":"Former President Bill Clinton campaign across California last weekend on behalf of his wife, former Secretary of State Hillary Clinton.","filename":"data/vaneerConsumption/CaliforniasBeenUncommonlyGoodtoMyFamily.json","image_url":"https://media.breitbart.com/media/2016/04/Bill-and-Hillary-Clinton-embrace-Andrew-Renneisen-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_04_04__1540935949.html","title":"California's Been 'Uncommonly Good to My Family'","title_page":"Bill Clinton: California's Been 'Uncommonly Good to My Family'","title_rss":"NULL","source_domain":"breitbart.com","text":"Former President Bill Clinton campaign across California last weekend on behalf of his wife, former Secretary of State Hillary Clinton, who will likely have to win in the Golden State on June 7 to secure her party’s nomination.\nClinton is still the heavy favorite to defeat Sen. Bernie Sanders (I-VT), and also to defeat her most likely GOP rivals, whether businessman Donald Trump or Sen. Ted Cruz (R-TX). However, Sanders has racked up a series of wins in recent caucuses and primaries, nearly keeping pace with Clinton and denying her the 2,383 delegates she needs for a majority. He would be even closer, were it not for the votes of party bigwigs known as superdelegates.\nThe former President — and potential First Spouse — campaigned Sunday at the Los Angeles Trade-Technical College, telling a crowd: “California has been uncommonly good to my family … I always felt at home here because every time I looked at a crowd, especially one having anything to do with a community college, I could see the future and feel good about it.” He borrowed a line from Barack Obama, according to the Los Angeles Times, declaring”Si, se puede” (“Yes, we can”). And Clinton, who governed as a business-friendly Democrat, also praised the state’s new $15 minimum wage — “God bless you” — despite concerns that it would hurt the state’s businesses.\nClinton also spent part of Sunday in Oakland with his daughter Chelsea at a school in Havenscourt-Lockwood as part of a Clinton Global Initiative project. According to the San Francisco Chronicle, volunteers “painted murals, organized the library, and created colorful art pieces for the garden and other areas of the school, among other improvements.”\nConveniently, the Clintons’ charity work lined up with their presidential campaign schedule.\nPhoto: file","url":"https://www.breitbart.com/local/2016/04/04/bill-clinton-barnstorms-california-hillary/"}
