{"authors":["Elizabeth Castillo","Guest Commentary","Laurel Rosenhall","Dan Morain"],"date_download":"2018-10-30 22:41:35","date_modify":"2018-10-30 22:41:35","date_publish":"2018-06-19 23:42:04","description":"A bill advancing in the Capitol would require restaurants to offer only water or milk with meals marketed for children — not soda, juice or chocolate milk.","filename":"data/vaneerConsumption/Californiacouldbecomethefirststatetorestrictkidsmeals.json","image_url":"https://calmatters.org/wp-content/uploads/TheaEmily.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939295.html","title":"California could become the first state to restrict kids' meals","title_page":"Out with soda: California could become the first state to restrict kids' meals","title_rss":"NULL","source_domain":"calmatters.org","text":"As the food court at a Sacramento mall buzzed with families on a recent summer day, Emily Wickelgren and her daughter Thea were enjoying lunch at Subway. The 7-year-old opted for water with her sandwich instead of soda or juice.\n“I do have unusual kids in that neither one of them likes soda and they don’t really like juice,” said Wickelgren, the mom of two daughters.\nThis is what many legislators hope will be the new norm for more California families. Under a bill advancing in the Capitol, restaurants could offer only water or milk with meals marketed for children. Not soda. Not juice. Not chocolate milk.\nThose sugary drinks would still be available, at no extra cost, but only upon request. They couldn’t be advertised alongside kids’ meals or offered as a default option. If the bill becomes law, cashiers would ask customers ordering a Happy Meal at McDonald’s, for instance, if they want water, milk or a non-dairy substitute like almond milk. California would become the first state in the nation with such a requirement.\nIt’s the Legislature’s latest attempt to combat obesity and diabetes by limiting how much soda Californians drink. To illustrate the point at a Tuesday hearing, Democratic Assemblyman Kevin McCarty of Sacramento held up a jar containing 9.5 teaspoons of sugar—the same amount found in a 12 ounce can of soda.\nResearch shows that kids often get extra calories in their diet from sugary drinks like soda. The extra sugar puts them at a higher risk for tooth decay, type two diabetes and obesity, according to Public Health Advocates, a sponsor of the bill. Some health experts think changing the drinks offered with kids meals will cause a long-term behavioral shift, leading other kids to become more like Thea and prefer water over pop.\n“It’s a thoughtful approach to giving families choice, making sure the choice is a healthful one but not taking away the right if they want to order the sugar-sweetened beverage,” said Sen. Bill Monning, a Carmel Democrat who has been fighting the soda industry for years.\nHis past legislation—including bills to tax sugary drinks and slap warning labels on them—died under strong opposition from the beverage industry. But his latest bill to regulate the drinks offered with kids meals has faced surprisingly little push-back, other than criticism that it empowers the government to make decisions that should be made by parents. It passed the Senate with bipartisan support and cleared the Assembly Health Committee this week without opposition.\nThe California Restaurant Association has not taken a position on the bill, and the American Beverage Association is neutral, writing in a letter to Monning that it “is committed to increasing access to beverages with less sugar and smaller portions in stores and restaurants.”\nThe group has already embraced guidelines that say elementary schools should offer only water, milk and 100 percent juice, which may explain why it’s not fighting the proposal to get soda out of kids meals at restaurants.\nSome fast food chains are voluntarily taking similar steps. McDonald’s stopped advertising Happy Meals with soda in 2013 and in February removed chocolate milk as a default option, though it’s still available upon request. The meals are now advertised with plain low-fat milk or an apple juice drink that has half the sugar of 100 percent apple juice.\nAt the local level, cities have started to tackle the issue too. Berkeley passed an ordinance last year with the same requirements as Monning’s bill. Other cities—including Stockton, Daly City and Long Beach—have passed similar ordinances.\nNonetheless, the bill still raises debate about how much government is too much.\n“I trust parents and I thought parents can make those decisions,” said Sen. Joel Anderson, a Republican from Alpine who voted against the bill.\nJennifer Nevarez, a Sacramento mother of four, echoed the same sentiment when told about the proposal at the mall’s food court.\n“That’s not going to work,” she said. “I feel like it should be the parents’ choice.”\nNevarez said she only buys water and apple juice for her children at home, so the soda is typically a treat when the family eats out.\nStill, some experts worry that drinking sugary drinks at a young age can cause problems later on.\n“What we know is that the eating habits we establish when we’re young, often carry with us as we get older,” said Flojaune Cofer, director of state policy and research for Public Health Advocates. “If we consume more sugar, we tend to crave more sugary things when we get older.”","url":"https://calmatters.org/articles/out-with-soda-juice-and-chocolate-milk-california-could-become-first-state-to-restrict-kids-meals/"}
