{"authors":["Associated Press"],"date_download":"2018-10-22 20:49:20","date_modify":"2018-10-22 20:49:20","date_publish":"2016-01-28 04:06:41","description":"SACRAMENTO, Calif. (AP) — California on Wednesday became the first state to set energy efficiency standards for household LEDs and smaller track-lighting-sty...","filename":"data/vaneerConsumption/CaliforniaadoptsfirstenergystandardsforhouseholdLEDs.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420288_California-adopts-energy-standards-household-LEDs_1540241360.html","title":"California adopts first energy standards for household LEDs","title_page":"California adopts first energy standards for household LEDs | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"California adopts first energy standards for household LEDs\nSACRAMENTO, Calif. (AP) — California on Wednesday became the first state to set energy efficiency standards for household LEDs and smaller track-lighting-style light bulbs — a move that could save consumers billions in utility bills and prompt lawmakers and manufacturers to adopt them nationwide.\nThe California Energy Commission approved new requirements for general purpose light-emitting diodes — the LEDs used in household lamps and chandeliers — and directional lamps that have a diameter of 2.25 inches or less. They often are used in track lighting by stores, hotels and museums.\nIn addition to being more energy efficient than halogen and incandescent bulbs, the bulbs sold in California beginning in January 2018 will have to meet certain color requirements and have minimum lifetimes: 10,000 hours — the equivalent of 10 years of household use — for the LEDs and 25,000 hours for the small-diameter directional lamps.\nThe commission said using lights that meet the new standards will save consumers more than $4 billion in utility bills over 13 years, conserve enough electricity to power about 400,000 homes and reduce the amount of carbon dioxide emissions from power plants by about 10 million metric tons between 2017 and 2029.\nThere already are bulbs on the market that meet the new standards. But the LEDs cost more than their incandescent counterparts — even though they last up to 20 times as long — and consumers have been slow to adopt them.\nIn 2010, LEDs comprised only 1 percent of the 600 million general-purpose light bulbs in California, according to commission figures. There were about 16 million of the small-diameter directional lamps.\nThe commission was ordered to come up with lighting standards under 2007 state legislation that called for reducing home lighting energy use by 50 percent and business use by 25 percent by 2018.\nThe standards were backed by the Sierra Club and other conservation groups. They were opposed by the National Electrical Manufacturers Association, which argued that they would raise the cost of LED bulbs and thus make it less likely that Californians would buy them to replace inefficient incandescents.\nThe commission disagreed.\n\"The standard will save consumers money compared to products that are already on the shelf,\" Commission Chair Robert B. Weisenmiller said in a statement. \"The standard pushes the entire market toward more efficient products with higher quality. It will reduce the overall cost to consumers.\"\nThe standards were adopted after considering whether they were feasible and cost-efficient, commission spokeswoman Amber Beck said.","url":"https://www.dailymail.co.uk/wires/ap/article-3420288/California-adopts-energy-standards-household-LEDs.html"}
