{"authors":[],"date_download":"2018-10-30 00:51:03","date_modify":"2018-10-30 00:51:03","date_publish":"2014-10-29 08:00:00","description":null,"filename":"data/vaneerConsumption/CaliforniaFacesDeathbyPension.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2014/10/Motorcycle_patrol_officer_along_San_Tomas_Expressway2C_Santa_Clara2C_California_-_20060224.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860663.html","title":"California Faces Death by Pension","title_page":"California Faces Death by PensionThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"When the November election was still a long way off, Sacramento-area streets were already plastered with campaign signs for a little-noticed political race: candidates are running to serve on the board of the California Public Employees’ Retirement System, better known as CalPERS. While not as high-profile as the statewide and congressional races, these seats are arguably of equal importance to Golden State taxpayers. CalPERS, the largest state pension fund in the country, not only manages more than $257 billion in assets, but also loves to use its political muscle to prod corporate America into “socially responsible” (read: leftist-friendly) investing.\nSacramento, as the state capital, is Public Employee Central, so the race has become heated and costly. The campaign signs that caught my eye promised “pension security” and were paid for by the Service Employees International Union. This election is a touchstone for the entire pension issue in California—and, per usual, it doesn’t look good for the taxpayer.\nIn short, the people who benefit from CalPERS have complete control over it. Those who pay the tab have little if any say. Six of the board seats are set aside for various groups of CalPERS “members”—for example, one for retirees who receive pensions, one for eligible current state employees, and so on. Then there are three members appointed by the governor and the legislature, both of which are wholly owned subsidiaries of California’s public-sector unions.\nAnd there are four “ex officio” members: state officials and employees that also—surprise!—have close ties to the union movement. That includes state Treasurer Bill Lockyer, who in a 2011 speech about CalPERS had this to say about the daunting unfunded liabilities that might force pension reform:\nIf we need to do it, then we ought to do it—but on our terms. We must not allow the debate on retirement security to be framed by those who simply seek to eliminate altogether defined benefits, the social and economic power of public pension funds in the market, and the power of workers and their unions to be a balancing force to business and the unregulated marketplace in American life.\nThe treasurer’s staff underlined those words in the official text of the speech. When Lockyer said reform should only be undertaken on “our” terms, he meant those of the public sector unions and the government workers. He clearly was not sympathizing with California’s hard-pressed taxpayers. The governor and most others in state government have the same attitude. They don’t care about pension debts and the burden on taxpayers. They care about protecting the current system as it now exists.\nAnd what a system that is, if one happens to be a government employee. California’s entire public-sector compensation system is absurdly generous. For instance, the median pension for a recent state Highway Patrol retiree is $98,000 a year—available at age 50, and paid for the life of the retiree and that retiree’s spouse. The median pay and benefit package for a California firefighter is more than $175,000 a year.\nAs the Orange County Register reported in 2011, the city of Newport Beach had fourteen full-time lifeguards, with thirteen of them earning more than $120,000 a year in total compensation. “More than half the lifeguards collected more than $150,000 for 2010 with the two highest-paid collecting $211,451 and $203,481 in total compensation respectively,” according to the report. These are not aberrations.\nCalifornia salary schedules are filled with city managers earning $300,000 or more a year and low-level administrative employees earning around $100,000 a year. This is true at the state-government level and even in the poorest cities. The San Joaquin Valley city of Stockton paid its workers at 125 percent of the California state average—and gave them a “Lamborghini-style” health-care plan that provided lifetime benefits after working for the city for as little as two months. Big surprise that Stockton now is in bankruptcy court.\nIn the private sector, most workers receive 401k-style defined-contribution plan, in which final retirement income is based on the amount the worker puts in and the success of the stock market. California’s public workers, in contrast, receive what are called defined-benefit retirement plans, in which guaranteed payment amounts are based on a formula. Most so-called “public-safety” employees—police, firefighters, prison guards, billboard inspectors, school security guards, cooks at prisons, etc.—are eligible for the “3 percent at 50” plan. That means they receive 3 percent of their final pay times the number of years worked, and it is available to them at age 50. (It’s usually calculated on base pay and not overtime, but overtime counts in some jurisdictions.) Thus, if a Newport Beach lifeguard earns $150,000 a year, after thirty years he receives 90 percent of that pay—or $135,000 a year—for the rest of his life and his spouse’s life. The retirement ages are so low that in some cities taxpayers are paying for an entire second ghost workforce behind the one that’s actually doing the job. (New York City already is past that tipping point, as taxpayers there pay more retired cops than active ones.)\nPension funds such as CalPERS invest the retirement contributions paid by workers or their employers (in many agencies, workers don’t contribute a cent to their own retirements) in stocks and bonds. They guess at how well those investments will do. The higher the forecast returns, the better funded the system; the lower the predicted returns, the bigger the “unfunded liabilities.” If things go well, the public employees split up the loot. If they don’t go well, taxpayers must backfill the losses.\nUnion activists insist the average California pension is in the low $30,000s, but that includes people who retired eons ago and ones who worked only a short time in the system. The formulas are the formulas, and they have increased dramatically since the late 1990s. Some workers have figured out pension-spiking gimmicks, as well, ways to work the rules to inflate their retirements even further.\nIt’s also important to note that pensions are guaranteed against any reductions once they have been granted. “Pension payments are senior obligations of the state to its employees and accordingly have priority over every other expenditure except Proposition 98 [K-14 education] expenditures and arguably even before debt service,” said David Crane, former Governor Arnold Schwarzenegger’s chief pension adviser, in 2010 testimony before the state senate. Crane is a self-styled progressive Democrat, yet he is outraged at the way CalPERS has gamed the system—to the detriment of every public service. “All of the consequences of rising pension costs fall on the budgets for programs such as higher education, health and human services, parks and recreation and environmental protection that are junior in priority and therefore have their funding reduced whenever more money is needed to pay for pension costs,” he added.\nThis isn’t just a dire projection. Cities across the state are facing massive infrastructure breakdowns and they lack the money to fix them. Consider this picture painted by the New York Times earlier this year: “The scene was apocalyptic: a torrent of water from a ruptured pipe valve bursting through Sunset Boulevard, hurling chunks of asphalt 40 feet into the air as it closed down the celebrated thoroughfare and inundated the campus of the University of California, Los Angeles.” The key point was buried deeply in the news story: “And here, as in other cities, the demand for public works comes as the costs of municipal pension plans are shooting up—a confluence that has alarmed business leaders.”\nEven when cities go belly up, they can’t dislodge the main expense that is pushing them over the brink, thanks to the power of CalPERS and to the elected officials who owe their seats to the state’s muscular public-employee unions. Three recently bankrupt cities—Stockton, Vallejo, and San Bernardino—city officials came up with recovery plans that did not touch public-employee pensions. City officials preferred instead to stiff bond-holders, raise taxes on residents, and slash city services. I know Stockton well—and that beautiful old Gold-Rush city on the edge of the California Delta is falling apart because of a lack of public services. Vallejo officials publicly stated that they were unwilling to challenge CalPERS, which holds that all pension promises must be paid in full come hell or municipal bankruptcy. San Bernardino halted its payments to CalPERS, but eventually buckled under to that agency’s threats. When exorbitant pensions for an elite class of government workers are protected at all costs, everything else suffers.\nA few years back, these realities were dawning on the state’s leaders. Even Lockyer’s “reform on our terms” speech was in the context of needing to reform. California faced a general-fund budget mess, and although only a small portion of the budget directly goes toward pension payments, it highlighted the problem to voters.\nIn June 2012, the electorates in the state’s second- and third-largest cities—San Diego and San Jose—approved significant pension-reform initiatives. Both cities have solid Democratic voting majorities, but both measures passed with around 70 percent support. San Jose’s Democratic Mayor Chuck Reed pointed to his city’s 350-percent increase in pension costs over the past decade and to the declining public services. He championed the city’s reform as a model that could be followed in other struggling California cities.\nIndeed, the public’s concern over pension debt was so noticeable that polling showed it endangering Governor Jerry Brown’s signature initiative for the November ballot—a large tax hike to help fill a red-ink-stained budget. Voters wondered why they should entrust this government with more of their money if it wasn’t even tackling the problem of big debt.\nLate in the session, the governor and legislature threw together a modest pension reform bill that basically ended the practice of pension spiking— inflating a public employee’s final salary to enhance his retirement payments for life. It was political window-dressing that helped Brown and his fellow union-backed legislators get their tax hike. They since have echoed the dishonest mantra: we reformed pensions and the system is fine!\nThey’ve also since claimed to have “fixed” the debts faced by the state’s second-largest pension fund, the California State Teachers’ Retirement System, or CalSTRS. Because of complex statutory reasons, CalSTRS is dependent on the legislature to backfill any losses, whereas CalPERS can simply raises its contribution rates on participating cities.\nIt became clear that CalSTRS would go belly up in thirty years if the legislature didn’t start sending another $5 billion or so its way annually. So Brown and company concocted another plan to ratchet up state contributions. But it, too, was largely phony. Under the plan, the state sends a pittance extra each year to CalSTRS, with the really large bumps in contributions pledged to take place years from now when it will be someone else’s problem.\nFrankly, Brown, Democratic legislative leaders, and even the courts have been doing everything to derail any manner of reform.\nThe courts gutted the most significant part of the San Jose initiative. And while San Diego continues to implement its reform, Brown’s appointees to the union-controlled Public Employment Relations Board have been suing the city to stop the voter-approved measure. PERB claims the public vote was illegal because the city first had an obligation to negotiate with the unions representing the new workers who will face lower benefit levels. Union demands even trump the right to vote, in the administration’s view.\nFurthermore, a judge in Ventura County pre-emptively halted an election that would have asked voters to reform that county’s pension system. CalSTRS did pass a reform that required teachers to pitch in a little more toward their pensions (in exchange for vesting other benefits, given that it is illegal in California to reduce public-employee benefits without giving something equal or greater in exchange).\nIn late August, the CalPERS board—you know, the same board run by union activists and union-controlled politicians—voted on a measure that effectively obliterates even the modest pension reform that Brown and company passed as a tax-raising window dressing.\nHere’s how it works: Currently, existing state and local employees get all sorts of special pay. There are ninety-nine extra-pay categories, most of which should induce mockery and anger. Librarians, for instance, are paid extra for helping library patrons find books. Police are paid extra for driving alone in patrol cars. Fire chiefs get special management pay. Gardeners get paid extra for fixing sprinklers. Those categories have existed since the 1990s, but a few years ago CalPERS decided that they should also be used when it’s time to calculate an employee’s pension—thereby inflating the final base pay and ensuring higher pension benefits for many years to come.\nBrown’s ballyhooed reform applied only to new hires. So the CalPERS board passed regulations that allow these ninety-nine categories to be used in a pension-spiking bonanza for these new hires, too. It seemed like a giant middle finger to Brown, although the governor’s reaction suggests that he wasn’t upset by the scam.\nBrown is joined at the hip with the unions, even if he talks a good game about fiscal responsibility. He claimed to be outraged by the CalPERS decision, but of the ninety-nine categories used in the scheme, he said that he only objected to one. He has yet to follow even this half-hearted protest with any serious action. In other words, he seems fine with a CalPERS rule that destroys any gains made by his own pension reform, even as he championed an end of pension spiking during his gubernatorial debate.\nIt keeps getting worse. In September, the California Supreme Court gave CalPERS the OK “to sue credit-rating giants Moody’s and Standard & Poor’s for hundreds of millions of dollars over the top ratings they gave to investments that collapsed in 2007-08,” reported the San Francisco Chronicle.\nCalPERS is blaming the credit agencies for its poor performance, which has led to higher-than-expected unfunded pension liabilities. This really is something when you consider what CalPERS has been promising taxpayers over the past many years. In 1999, for instance, CalPERS pressured the legislature to pass a massive pension increase—and to do so quickly and without all the normal committee hearings and vetting sessions. That CalPERS action has led to the bulk of the state’s current pension problems.\nThe law, SB 400, boosted California Highway Patrol pensions by 50 percent, instituting that “3 percent at 50” pension formula mentioned above. Legislators did so retroactively—meaning that even officers a day away from retirement got the boost going back to the day they started working. The law practically begged local governments to follow suit. I recall when even in conservative Orange County, Republican legislators tripped over themselves to offer the huge pension increase.\nAs Crane said in his senate testimony: “Promising that ‘no increase over current employer contributions is needed for these benefit improvements,’ and that CalPERS would ‘remain fully funded’ despite the increases, the CalPERS Proposal claimed that enhanced pensions would not cost taxpayers ‘a dime’ because investment returns would cover the expense.” Instead, it led to massive debts, billions of dollars in taxpayer expense, and obliterated public services.\nCrane noted that CalPERS’s promises would have “required the Dow Jones to reach roughly 25,000 by 2009 and 28,000,000 by 2099 for no such deficiencies to rise.” He reminded senators that CalPERS never disclosed that its own employees would receive these massive pension increases.\nCalPERS is suing the credit agencies, but no one is holding CalPERS accountable for the false information it provided in the capitol.\nCalifornia pension reformers continue to come up with new ideas to rein in out-of-control spending, to protect public services, and to create a generous but sustainable system. Every poll and indication shows that even the state’s Democratic electorate supports these efforts. A number of Democratic local officials such as San Jose’s mayor have the courage to try to reform their local systems. They are stymied at every turn by the union machine, and though they are a hardy group and they keep regrouping, it’s looking fairly hopeless.\nBankrupt cities are desperately afraid of standing up to CalPERS and its enormous political and legal might. Efforts to go around the machine and take the matter directly to voters via a statewide ballot measure cannot get past the union favoritism. For instance, state Attorney General Kamala Harris gets to author the titles and summaries for all statewide ballot measures. Twice now, she has given such unfair ballot summaries to pension initiatives that even liberal editorial boards argued that they sounded as if they were written in the union hall.\nWhat to do? In a recent verbal ruling, the federal judge overseeing Stockton’s bankruptcy said that pensions are not protected when cities go bankrupt—the first good news in a long time. It’s the only hope left to keep California from being doomed to a slow destruction of its public services and an ev­er-increasing tax burden to fund these lush retirements. But maybe politicians and voters in other states can take heed of the situation and learn that all is lost once the looters are given complete control of the treasury.","url":"https://spectator.org/60778_california-faces-death-pension/"}
