{"authors":["Elizabeth Castillo","Julie Cart","David Gorn","Felicia Mello"],"date_download":"2018-10-30 23:28:42","date_modify":"2018-10-30 23:28:42","date_publish":"2018-07-30 18:23:00","description":"Although California can’t do much to block the Trump administration’s controversial immigration policies, opponents in the “Resistance State” keep finding ways to chip away at their foundations. The latest: pushing the state and its Democratic leaders to cancel business deals with, investments in, and campaign donations from private companies with immigration contracts.","filename":"data/vaneerConsumption/CaliforniaconsiderscuttingtiestofirmscarryingoutTrumpsimmigrationpolicies.json","image_url":"https://calmatters.org/wp-content/uploads/ICE-Out-of-CA-protest_Robbie-Short_011.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles_trump_california__1540942122.html","title":"California considers cutting ties to firms carrying out Trump's immigration policies","title_page":"California considers cutting ties to firms carrying out Trump's immigration policies | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Although California can’t do much to block the Trump administration’s controversial immigration policies, opponents in the “Resistance State” keep finding ways to chip away at their foundations.\nThe latest: pushing the state and its Democratic leaders to cancel business deals with, investments in, and campaign donations from private companies with federal immigration contracts.\nA group of K-12 teachers is urging their retirement system to divest from GEO Group, CoreCivic and General Dynamics.\nSome University of California students and workers are pressing UC to sever ties with General Dynamics Information Technology. The company helps the UC system administer a placement test for incoming first-year students.\nPoliticians and the state Democratic Party are shedding donations from CoreCivic, operator of private prisons and detention facilities.\n“I don’t think we should profit off of the lives of other people,” said Adrianna Betti, one of hundreds of teachers who are urging CalSTRS, the organization responsible for the pensions of California K-12 teachers, to divest from the private prison companies. “The concept that I’m going to retire off of this type of money, it bothers me immensely.”\nBetti told a recent CalSTRS investment meeting that the organization needs to provide more transparency about its portfolio and realize they are making moral choices with their dollars.\n“Nobody with a moral lens would have made this decision ever,” she said.\nAmid public outcry last month, President Donald Trump backed off of his initial policy of separating undocumented parents from their children at the border. “So we’re keeping families together, and this will solve that problem,” he said. “At the same time, we are keeping a very powerful border and it continues to be a zero-tolerance. We have zero tolerance for people that enter our country illegally.”\nOver 1,800 children have been reunited with family after being separated at the border, but over 700 still remain separated—and some of those may be in California.\nThe state—which Trump branded “out of control” in its immigration defiance—passed a trio of laws last year designed to make California a “sanctuary state” for undocumented immigrants who don’t commit serious crimes. Although the Trump administration sued to have the laws overturned, it has not yet been successful.\nBut the emotional family separations posed a particular frustration in Democrat-dominated California. Attorney General Xavier Becerra joined 17 other states in contesting the Trump administration’s “zero tolerance” policy last month, arguing in the complaint that family separation is causing severe trauma that state resources will be strained to address.\nThe federal government “does have the right to decide how to conduct immigration processes. They’ve done a very poor job obviously. Very harshly,” Becerra said on KQED earlier this month. “We are more limited there in what we can do as far as allowing these kids to be free.”\nOne move the state could make: divestment. It’s a tactic that various activists have proposed against gun manufacturers, tobacco companies and fossil fuel firms. Successes include the UC divestment effort in the 1980s against South Africa, which Nelson Mandela credited with helping bring an end to the racist apartheid regime.\nCalSTRS said it is determining potential risk factors the private prison companies may pose to pensions. At its meeting, investment committee chairman Harry Keiley said he’s asked the chief investment officer to update the board on the issue by September.\nCoreCivic said in a statement that none of its facilities provide housing for children who aren’t under the supervision of a parent, adding, “We also do not enforce immigration laws or policies or have any say whatsoever in an individual’s deportation or release.”\n“We are proud that for over the past 30 years we have assisted both Democrat and Republican administrations across the country as they address a myriad of public policy challenges,” said company spokeswoman Amanda Gilchrist. “CoreCivic has a strong commitment to caring for each person respectfully and humanely.”\nOther educators are urging the UC system to sever ties with General Dynamics Information Technology. The University Council-AFT, the labor union that represents librarians, lecturers and other university faculty members, sent such a letter to UC president Janet Napolitano in June, who received a similar letter from the Council of UC Faculty Associations, the umbrella organization that represents the different faculty associations at each campus.\nThe University of California Student Association, an organization that represents students across UC campuses is also pressing the UC system to end its contract. “To work with a company actively taking part in the state sanctioned violence of separating families seeking asylum, and profiting from it is to be complicit in the inhumanity of their actions,” the association said in a letter to the president.\n“This is still happening and they’re not doing as much as they could,” said Stephanie Luna-Lopez, a third-year student at UC Berkeley and associate chief of community development for the Associated Students University of California, the student association for UC Berkeley. “We actually cannot do anything because it’s out of our control.”\nNapolitano contends that UC has contracted with the company for years, that it assured her they were providing case work for unaccompanied minors to facilitate reuniting families, and that breaking ties would be “detrimental” and “disruptive.”\n(Although she presided over significant deportations as head of Homeland Security in the Obama administration, Napolitano has denounced Trump’s separation policy.)\nGeneral Dynamics Information Technology has worked with the Office of Refugee Resettlement since 2000, providing casework support for the U.S. Department of Health and Human Services. It says it has no role in the family separation policy, but facilitates reunifications.\nDemocratic legislators and the Democratic Party have, since Jan. 1 of 2017, collected some $250,000 from private prison companies that incarcerate undocumented immigrants. Now they’re distancing themselves.\nAssembly Speaker Anthony Rendon tweeted last month he would donate campaign money received from CoreCivic to the Anti-Recidivism Coalition, which works with formerly incarcerated people to reform the justice system.\nAnd after CALmatters noted that Lt. Gov. Gavin Newsom received private prison money in his campaign for governor, an aide said Newsom donated $5,000 to the National Domestic Workers Alliance’s Families Belong Together project, which protests Trump’s immigration policies.\nThe California Democratic Party has also announced it will no longer accept contributions from organizations that run private prisons or other incarceration services.\n“The private prison system represents so much of what is wrong with our criminal justice system,” said CDP chair Eric C. Bauman in a statement. “Accepting donations from companies that profit from the systemic injustices and suffering that results from them is incompatible with the values and platform of our Party.”","url":"https://calmatters.org/articles/trump_california/california-considers-cutting-ties-to-firms-carrying-out-trumps-immigration-policies/"}
