{"authors":["Matt Levin","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 23:54:57","date_modify":"2018-10-30 23:54:57","date_publish":"2017-01-06 23:10:48","description":"There are more white men named Jim in the California Legislature than black and Asian-American women—combined. And that’s not even including another white","filename":"data/vaneerConsumption/CalifornialegislatorsJustlikeyou.json","image_url":"https://calmatters.org/wp-content/uploads/CaliforniaLegislature-1-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540943697.html","title":"California legislators: Just like you?","title_page":"California legislators: Just like you? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Play with the filters below to see which of California’s 120 legislators match your own demographic characteristics. Be wary of that income filter…\nCalifornia’s new legislative session begins in earnest this week, and a fresh class of legislators will influence everything from how bad your commute is to the quality of the air you breathe. But while California prides itself on diversity, is that diversity reflected in the Capitol?\nThere are more white men named Jim in the California Legislature than black and Asian-American women—combined. And that’s not even including another white James. Or a Latino Jimmy.\nVoters sent dozens of new faces to Sacramento last November. In many ways, the new Legislature is as reflective of the state’s diverse population as any in recent memory. But some Californians remain sorely underrepresented in their state government. Here’s a breakdown of how the state Legislature and the population it represents stacks up.\nWho’s missing from the Legislature?\nWomen : The lack of female legislators is perhaps the most glaring difference between Californians outside of the Capitol and those within it. Twenty-two percent of state legislators are women, the lowest percentage since the early 1990s. Slightly more than half of Californians are female.\n: The lack of female legislators is perhaps the most glaring difference between Californians outside of the Capitol and those within it. Twenty-two percent of state legislators are women, the lowest percentage since the early 1990s. Slightly more than half of Californians are female.\nLatinos: While the number of Latino legislators is on the upswing, California’s largest non-white ethnic group is still underrepresented in Sacramento. Twenty-three percent of California’s state lawmakers are Latino, compared to 40 percent of the population as a whole.\nWhile the number of Latino legislators is on the upswing, California’s largest non-white ethnic group is still underrepresented in Sacramento. Twenty-three percent of California’s state lawmakers are Latino, compared to 40 percent of the population as a whole.\nPeople Who Make Less Than $100K: We’re cheating a little here, but it’s noteworthy that legislators’ salaries put them in an income bracket well above your average Californian. The median income for a California household in 2015 was about $62,000—about 40 grand short of what a legislator makes. California legislators are the highest paid of any state lawmakers in the country.\nCopy: CA Leg Ethnicity No Description\nWho’s overrepresented?\nWhites—and specifically white men—and very specifically white men named Jim : In a state where 60 percent of the population consists of people of color, just over 45 percent of lawmakers are non-white. White males alone account for nearly half of the Legislature.\n: In a state where 60 percent of the population consists of people of color, just over 45 percent of lawmakers are non-white. White males alone account for nearly half of the Legislature. People in their 40s, 50s, and 60s: Baby Boomers and Gen Xers dominate the California Legislature. While Californians under age 40 comprise about 40 percent of the state’s adult population, they make up only 23 percent of lawmakers. Part of that is simply a function of experience—it’s hard to have a compelling political resume in your 20s. But a handful of young legislators are challenging that norm.\nBaby Boomers and Gen Xers dominate the California Legislature. While Californians under age 40 comprise about 40 percent of the state’s adult population, they make up only 23 percent of lawmakers. Part of that is simply a function of experience—it’s hard to have a compelling political resume in your 20s. But a handful of young legislators are challenging that norm. Gays and Lesbians: Although it’s difficult to get a precise count of LGBT people in California, one well-respected estimate places the proportion at about 4.6% of the population. Eight state lawmakers are openly gay, making up nearly 7 percent of the Legislature. There are, however, no transgender legislators.\nIt’s one thing to look at the diversity (or lack thereof) of lawmakers in a vacuum. But how does the California Legislature compare to those of other large states with diverse populations? The chart below contrasts the ethnic demographics of California, Texas, Florida and New York with the demographics of their state legislators. In this context, California legislators appear much more reflective of their communities than those of Texas, the state with the second-largest Latino population in the country. However, the proportion of non-white state legislators from New York and Florida more closely matches the demographics of their states than is the case in California.\nHow diverse is CA’s legislature compared to other states?\nOf course, the question of how well legislators reflect their constituents extends well beyond any legislator’s ethnicity, gender, or sexual orientation. And just because a legislator mirrors the demographic profile of a given voter does not mean that lawmaker necessarily reflects that voter’s ideological disposition, nor does it mean he or she is an especially effective legislator. Let’s just hope the name “Jim” is associated with good policymaking.\nInteractive by John Osborn D’Agostino and Matt Levin. Assistance in some data collection by Alex Vassar.","url":"https://calmatters.org/articles/new-california-legislators-just-like-you/"}
