{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:14:55","date_modify":"2018-10-30 22:14:55","date_publish":"2015-11-10 19:17:51","description":"The \"American Gun Show\" exhibition combines handgun and rifle parts with sculpture to communicate America's \"obsession\" with firearms.","filename":"data/vaneerConsumption/CaliforniaExhibitFeaturesPenisHandgunVaginaRifle.json","image_url":"https://media.breitbart.com/media/2015/11/CQXpRAfUcAEj1y1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_11_10__1540937695.html","title":"California Exhibit Features Penis Handgun, Vagina Rifle","title_page":"California Exhibit Features Penis Handgun, Vagina Rifle","title_rss":"NULL","source_domain":"breitbart.com","text":"The Works San Jose gallery is currently displaying the American Gun Show exhibition, which combines pieces inspired by various aspects of human life in an attempt to communicate America’s “obsession” with firearms.\nThe exhibition was put together by James Morgan and Dorothy Santos and contains some pieces which are sexually graphic in nature. Others are focused on addressing what have become prominent social topics in our day–issues like the relationship between police officers and minority communities.\nFor example, The Creators Project reports that one of the pieces exhibited is Micha Cardena’s UNSTOPPABLE, which “explores the idea of making clothing and gear in response to Cullors’ question at the Allied Media Conference 2015: ‘What would technology for Black Lives be?'”\nAmerican Gun Show Exhibition Explores a National Obsession https://t.co/xk3JPEdvKb pic.twitter.com/tCw3sCmg4G — Diane Howell (@DianeHowell11) November 9, 2015\nOther pieces include Barbosa Prince’s “Machine Gun Jesus Gold,” which depicts an Uzi submachine gun as the horizontal beam of the cross on which Christ was crucified. The entire piece–including the model of Christ–is painted gold.\nGreat show at @WorksSanJose thanks to @deedottiedot and all the awesome artists pic.twitter.com/ET1s5xDKEl — Barbosa Prince (@gpbprince) October 3, 2015\nOne piece focused on male genitalia–a handgun with a penis, or a dildo, in place of the barrel–which attempts to communicate the belief that gun ownership is tied to “masculinity.” Another features a synthetic vagina in a rifle butt.\nJames Morgan told the Creators Project that the idea for the exhibit came to him while studying Cody Wilson’s 3-D printed Liberator gun. The Department of Justice demanded that plans for Wilson’s gun be blocked from public availability on the grounds that such munitions fall under regulation.\nMorgan told the Creators Project: “The question I was left with about the file being restricted as a munition was ‘what is a gun?’” He added, “This question finds its way into the exhibition multiple times in the mini-Liberator (scaled-down version of Cody’s Liberator) and a few other works. This tension between the First and Second Amendments also became an interesting focus as an artist.”\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhwkins@breitbart.com.","url":"https://www.breitbart.com/local/2015/11/10/california-exhibit-features-penis-handgun-vagina-rifle/"}
