{"authors":["Julie Cart","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:04:10","date_modify":"2018-10-31 00:04:10","date_publish":"2016-03-16 08:00:00","description":"Before remodeling a kitchen or building a house, Californians should consider Title 24 of the state building code. It spells out the state’s","filename":"data/vaneerConsumption/Californiaofficialssaygoinggreenwillcostyousomesaveyousome.json","image_url":"https://calmatters.org/wp-content/uploads/buildingcode.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944250.html","title":"California officials say going green will cost you some, save you some","title_page":"California officials say going green will cost you some, save you some | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Before remodeling a kitchen or building a house, Californians should consider Title 24 of the state building code. It spells out the state’s energy-use requirements for new and existing structures.\nSince 1978, Title 24 has set such standards for builders and homeowners, guiding them along a path that will lower the energy footprint of California’s buildings.\nThe code is updated every three years, with the latest Title 24 regulations taking effect in January.\nThe standards for new or remodeled residences will include high-performance attic and wall insulation, lighting controls and bulbs that cut energy use by 50%, and tankless water heaters that reduce water use by 35%, trimming heating costs.\nCommercial buildings—new or remodeled–must be constructed with elevators in which lights and fans turn off when the elevator is empty, escalators and moving walkways that operate at slower speeds when not in use and sensors that shut down heating and cooling systems when a door or window is open for more than five minutes.\nThe California Energy Commission, which crafts the standards, is also working to implement elements of a new state law that requires almost all buildings to operate twice as efficiently by 2030.\nThe agency estimates that, based on a 30-year mortgage, the cost of building a home to the new code will cost $11 a month but will save $31 on monthly heating, cooling and lighting bills.\nWhich buildings are covered by Title 24? According to the Energy Commission: “All new construction of, and additions and alterations to, residential and nonresidential buildings are covered except hospitals, nursing homes, correctional centers, jails, and prisons.”","url":"https://calmatters.org/articles/california-officials-say-going-green-will-cost-you-a-little-save-you-a-lot/"}
