{"authors":["William Bigelow"],"date_download":"2018-10-30 22:13:42","date_modify":"2018-10-30 22:13:42","date_publish":"2015-09-11 19:48:35","description":"On Thursday, the Butte Fire, east of Jackson and southeast of Sacramento, surged, tripling in size due to hot winds and triple-digit temperatures.","filename":"data/vaneerConsumption/CaliforniaWildfiresButteBlazeExplodes.json","image_url":"https://media.breitbart.com/media/2015/08/California-firefighter-Josh-Edelson-AFP-Getty-1024x768.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_09_11__1540937622.html","title":"California Wildfires: Butte Blaze Explodes","title_page":"California Wildfires: Butte Blaze Explodes | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Thursday, the Butte Fire, east of Jackson and southeast of Sacramento, surged, tripling in size due to hot winds and triple-digit temperatures.\nThe fire, one of the most serious in a season of California wildfires, had initially been measured at 100 acres on Wednesday afternoon, swelling to 4,000 acres by Thursday, before Thursday’s winds whipped it to 14,700 acres, according to the California Department of Forestry and Fire Protection (Cal Fire). As of Friday morning, it had swollen to over 31,000 acres.\n#ButteFire [update] east of Jackson (Amador & Calaveras Counties) is now at 31,974 acres and 10% contained. http://t.co/EF4lnPaeKR — CAL FIRE (@CAL_FIRE) September 11, 2015\nCal Fire said six air tankers and nearly 60 fire engines were fighting the fire, which was “expanding in all directions,” according to NBC News. The Department also stated that the exponential growth in size of the fire meant containment of the fire dropped from 20% early Thursday to 10% Thursday night.\nCal Fire said mandatory orders for evacuation for part of one subdivision and part of Pine Grove had been issued; six homes had already been destroyed.\nKCRA reported that some evacuees were holed up in campers and recreational vehicles in a supermarket parking lot.\nPhoto: file","url":"https://www.breitbart.com/local/2015/09/11/california-wildfires-butte-fire/"}
