{"authors":["Antoinette Siu","Dan Walters","Ben Christopher","Laurel Rosenhall"],"date_download":"2018-10-30 22:48:44","date_modify":"2018-10-30 22:48:44","date_publish":"2018-08-26 23:42:28","description":"Though two state workarounds remain in play as California's Legislature enters the final days of the session, lawmakers have less than a week to find an alternative to new federal income tax rules that, among other things, set a cap of $10,000 on combined state and local income, property and sales tax deductions. Though two state workarounds remain in play, California lawmakers have less than a week to address new federal income tax rules that punish taxpayers in high tax states with a cap of $10,000 on combined state and local income, property and sales tax deductions.","filename":"data/vaneerConsumption/CaliforniansfaceanuphillbattleinchallengingcostlyTrumptaxlaw.json","image_url":"https://calmatters.org/wp-content/uploads/Autumn-Burke_Steve-Yeater-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939724.html","title":"Californians face an 'uphill battle' in challenging costly Trump tax law","title_page":"Californians face an 'uphill battle' in challenging costly Trump tax law | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Time is running out for California taxpayers trying to recoup a valuable tax deduction lost in the Republican tax overhaul.\nThough two state workarounds remain in play as the Legislature enters the final days of the session, lawmakers have less than a week to legislate an alternative to new federal income tax rules that, among other things, set a cap of $10,000 on combined state and local income, property and sales tax deductions.\nAbout a third of California taxpayers claim those state and local tax, or “SALT” deductions. They had no limit—and were a boon to taxpayers in high-tax states such as California—until the Trump administration targeted them last year.\nSince then, California’s Democratic legislative majority has searched for a way around the deduction limit, proposing to give taxpayers the option of donating to the state or a nonprofit in exchange for a tax credit toward their federal and state taxes. It’s a gambit that other high-tax states, such as New York, are also exploring.\nLast week, however, the Internal Revenue Service proposed a new rule that would mostly block any federal tax deductions, charitable or not, for state and local tax payments above the $10,000 limit. The IRS will accept comments through Oct. 11 and hold a public hearing November 5.\nThat hasn’t deterred California Assemblywoman Autumn Burke and Sen. Kevin De León, whose proposed workarounds remain under discussion.\nBurke’s AB 2217 would allow taxpayers to contribute to nonprofits, colleges or K-12 public schools in exchange for an 80 percent tax credit. The bill is headed to the Senate for a floor vote.\nSB 227 by De León would offer taxpayers a 75 percent tax credit for contributing to the state’s college tuition fund.\nBoth bills have faced strong resistance from the beginning—including a warning from the IRS in May and skepticism from conservative state lawmakers, who view the proposals as an effort to perpetuate a state tax system that relies too heavily on personal income taxes, and that generally taxes Californians too aggressively.\nCritics of the federal tax overhaul, meanwhile, have charged that the SALT cap was a partisan maneuver by congressional Republicans aimed at bleeding blue states that didn’t support Trump.\nIf the rule is in place by the end of the year, it would block major tax write-offs by requiring taxpayers to lower the value of their charitable deduction by the amount of any state or local tax credit received.\nThus, someone getting a $700 tax credit on a $1,000 donation would only be able to write off $300 on his or her federal return, assuming the state offers a 70 percent tax credit for the contribution.\nKirk Stark, tax law and policy expert at UCLA says it remains to be seen whether and how California will chime in during the IRS’ comments process in the next two months. There also is a likelihood of litigation.\n“Challenging the validity of Treasury regulations is always an uphill battle (as courts typically give deference to administrative regulations), but the rules announced yesterday represent a sharp break from 100+ years of established law,” Stark said in an email.\n“If the regulations as proposed are finalized in their current form and withstand legal challenge, there is the question of what new state legislation could provide CA residents with maximum flexibility in making deductible contributions within the parameters established by the regs.”\nIn 2015, Californians deducting state and local taxes claimed an average of $18,438 per taxpayer, according to The Pew Charitable Trusts.","url":"https://calmatters.org/articles/california-faces-uphill-battle-on-costly-trump-tax-law/"}
