{"authors":["Pauline Bartolone","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:54:14","date_modify":"2018-10-30 22:54:14","date_publish":"2016-01-27 08:00:00","description":"Private health plans invoiced the state of California $387.5 million to cover high-cost hepatitis C treatments in Medi-Cal between July 2014 and November","filename":"data/vaneerConsumption/CaliforniadolesoutheftypaymentsforhepatitisCdrugs.json","image_url":"https://calmatters.org/wp-content/uploads/bills.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940054.html","title":"California doles out hefty payments for hepatitis C drugs","title_page":"California doles out hefty payments for hepatitis C drugs | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Private health plans invoiced the state of California $387.5 million to cover high-cost hepatitis C treatments in Medi-Cal between July 2014 and November 2015, when just 3,624 patients received the treatments, according to the California Department of Health Care Services.\nThe state’s supplemental payments started after managed care plans that cover health services for almost 80 percent of Medi-Cal recipients raised “alarm” about the high cost of the new drugs. The hepatitis C treatments were eating into financial reserves, said Charles Bacchi, president of the California Association of Health Plans, an industry trade group.\n“Dollars that were intended for a wide array of medical services started being gobbled up by just one drug,” Bacchi said.\nThe health insurance companies are usually paid a flat rate per member to cover all health care needs. The Department of Health Care Services says this is the first time the state has paid health plans supplemental money to cover high-cost drugs. Specifically, Sovaldi, a hepatitis C drug retailing at $1,000 per pill, has sent treatment prices soaring. The drug is made by Gilead Sciences of Foster City.\nA mix of federal and state dollars paid health plans an average of nearly $107,000 per patient over 16 months. The funding will continue next year: The state health care agency has budgeted $303.4 million in supplemental drug payments for health plans for 2016-17.\nAlthough the members of Bacchi’s trade group benefit from the additional funding stream, he says the state’s supplemental payments aren’t a “sustainable” solution.\nCalifornia receives some money back from drugmakers in the form of rebates. The ultimate price the state pays for drugs is confidential, according to the state health agency.\nLimiting the cost of pharmaceuticals is the basis of a ballot initiative expected to go before voters this November. The measure would limit the amount the state pays for a drug to no more than the lowest price paid for the same drug by the U.S. Department of Veterans Affairs.\nThe state health care agency says its payments to insurers of Medi-Cal patients for hepatitis C drugs are a “very unique” solution, one that they may use for other high-cost drugs in the future. The state says the current hepatitis C payments may be reassessed in a year or two as the price of the drugs go down.\n“As the prescribing of the drugs levels off, as the population and the overall nature of who’s getting it settles down, we may get to a point where we look at carving that responsibility back into the plans’ … rate,” said Jennifer Kent, director of the California Department of Health Care Services.\nBut California’s spending on hepatitis C drugs doesn’t end there.\nFor the rest of the Medi-Cal population — the 2.7 million people whose health care services are directly reimbursed by the state — a U.S. Senate Finance Committee report the following for the year 2014:\nCalifornia paid almost $22 million to treat 280 hepatitis C patients with Sovaldi.\nCalifornia paid more than $2.8 million for 57 Harvoni prescriptions for hepatitis C patients.\nAccording to the U.S. Senate report, 237,000 people in Medi-Cal are infected with hepatitis C. That means less than 2 percent of that population has received the new hepatitis C treatments in Medi-Cal as a whole, with the sum of money and during the two different time periods we reference above.\n“In order for taxpayers of the state of California to afford to provide people the necessary treatments,” says Bacchi, “we have to have drug pricing society can afford to pay.”\nWe’ll be exploring how a drug’s cost affects patient access. If you are a hepatitis C patient, or other chronic disease patient who is having difficulty getting drugs, we’d like to hear from you.","url":"https://calmatters.org/articles/california-doles-out-hefty-payments-for-hepatitis-c-drugs/"}
