{"authors":["Kate Galbraith","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:35:09","date_modify":"2018-10-30 22:35:09","date_publish":"2015-08-17 08:00:00","description":"At a Pacific Gas and Electric power plant east of San Francisco, greenhouse gases flow from a stack as the air shimmers from heat, with no dirty cloud of","filename":"data/vaneerConsumption/Californiapushesforwardonrenewablepower.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/windmills_sunset-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938909.html","title":"California pushes forward on renewable power","title_page":"California pushes forward on renewable power | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"At a Pacific Gas and Electric power plant east of San Francisco, greenhouse gases flow from a stack as the air shimmers from heat, with no dirty cloud of pollution in sight. In the distance, wind turbines spin slowly under a cloudy sky. And nearby in the city of Antioch, local schools are celebrating the addition of solar panels to their roofs and parking structures.\n“If you look around, it’s really clean,” said Ben Stanley, PG&E’s plant manager, as he showed how the gas facility makes electricity for northern California.\nThe state’s electric power sources are poised to get cleaner still. In 15 years, electric utilities that power California’s lights and cellphones would need to get fully half their electricity from renewable sources, if Senate Bill 350, which is working its way through the Legislature, passes. The goal, often called a renewable portfolio standard, can almost certainly be met, though it will require utilities to make behind-the-scenes adjustments as they juggle different types of energy.\n“Increasing the renewable portfolio standard to 50 percent is completely doable by 2030,” said Severin Borenstein, an energy economist at the Haas School of Business at the University of California, Berkeley. “Exactly how we do it and how much cost we’re willing to bear is an open question, but I don’t think it would be a huge cost.”\nCalifornia’s plan, a piece of a broader strategy for battling climate change, is considerably more ambitious than most other states’ efforts, as well as a major power-plant rule released by the Obama Administration last week. The federal rule, which aims to cut the nation’s dependence on coal-fired power plants, calls for renewables to account for 28 percent of electric capacity by 2030. (This is a less impressive goal than it appears, because capacity refers to energy production when the sun and wind are constantly shining or blowing and does not take into account the inevitable downtimes of those sources.)\nCalifornia’s electricity providers have already made strong efforts to add solar and wind power, and have never used much coal — a big reason why the state will feel little impact from the new federal rule.\nBetween 2000 and 2013, greenhouse gas emissions from the state’s electric sector fell considerably faster than emissions overall. That is largely because of renewable energy mandates, first enacted in 2002 and strengthened in 2008 in by then-Gov. Arnold Schwarzenegger’s executive order. The order, which subsequently became law, requires utilities to get 33 percent of their electricity from renewable sources by 2020.\nCurrently, the three major utilities — PG&E, Southern California Edison and San Diego Gas & Electric — all get more than 20 percent of their electricity from renewables. Both PG&E and the San Diego utility have already booked enough renewables by 2020 to pass the 30 percent mark.\nNot all forms of renewable energy get counted. Large hydropower projects, such as those generated by the dams off Lake Shasta, Lake Oroville or Folsom Lake, are excluded. So are most rooftop solar panel installations, as opposed to the large solar arrays in the desert, which do count. That is a point of contention in the current bill, with utilities and solar installers arguing that rooftop systems also should count.\nFong Wan, a senior vice-president at PG&E, told an Assembly committee in July that the utility will have “no choice but to oppose this bill” unless changes are made on the rooftop solar issue, in addition to another accounting adjustment.\nCalifornia’s set of electricity providers, such as PG&E, already have levels of solar, wind, geothermal and biomass energy that are higher than most American power companies. For most of the rest of their power, they generally rely on natural gas, nuclear, dams or some coal. No major coal plants exist in California, but some utilities do import power from coal plants in other Western states. Modesto Irrigation District, for example, got 14 percent of its power from the San Juan coal plant in northern New Mexico last year, but it is ending its contracts with the plant by 2017, partly because California law makes it hard to invest in coal.\nGetting half of electric power from renewables is aggressive, but other states and nations are on their way. Denmark, a wind farm powerhouse, gets more than 40 percent of its electricity from renewables and hopes to go fully renewable by 2050. Hawaii plans to run on 100 percent renewables by 2045 and Vermont 75 percent by 2032.\nElectricity rates are rising with the policies. According to an estimate from the California Public Utilities Commission, rates have risen three to five percent due to the renewable requirements. In the competition last year to draw the battery factory for the electric carmaker Tesla, Nevada won out over California, the company’s home. Part of the package, according to the New York Times, was discounted electricity rates.\nNevada’s electricity rates are already about 35 percent cheaper than California’s, which are among the highest in the nation. However, California residents enjoy low overall electric bills due partly to the state’s mild weather, and environmentalists say that the state’s energy-efficiency measures, like requiring energy-sipping televisions and lamps, should help keep Californians’ bills low over time.\nFor electric power providers, a big concern is how to keep the lights on, and balance energy supply and demand, as renewable energy grows. Unlike coal or nuclear plants, wind and solar farms don’t produce round-the-clock power. They follow nature’s whims.\n“It’s not just the cost of the renewables. It’s the cost of the other things you have to do to operate all those renewables,” said Greg Salyer, the assistant general manager for electric resources at the Modesto Irrigation District, which sells power as well as water.\nBig hydroelectric plants and natural gas plants can help back up the renewables. So can batteries, though the technology continues to evolve. The cost of batteries, as well as that of solar panels, has fallen sharply, which will aid the transition to renewables.\nOddly, another looming concern is that power providers occasionally produce more renewable energy than the grid can handle, so wind or solar farms get turned off. That may happen even more as renewable energy grows, but there are solutions, said Edward Randolph, energy division director at the California Public Utilities Commission. For example, he said, people can pre-cool their houses when solar panels are pumping out electricity, rather than in the evening as the sun falls.\nFour years from now, California’s utilities will also introduce electric rates that vary depending on the time of day, which will encourage residents to use power when demand is low or clean energy production is high.\n“We need to get to a 50 percent target in the most cost-effective way possible,” Randolph said.\nLaurel Rosenhall contributed reporting.","url":"https://calmatters.org/articles/california-pushes-forward-on-renewable-power/"}
