{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 20:50:47","date_modify":"2018-10-30 20:50:47","date_publish":"2017-01-16 13:03:00","description":"Over one hundred \"progressives\" vowed to \"resist\" President-elect Donald Trump on Sunday as they gathered to organize.","filename":"data/vaneerConsumption/CaliforniaProgressivesOrganizetoResistTrump.json","image_url":"https://media.breitbart.com/media/2017/01/Leftist-Jerry-Cohen-at-Resist-Trump-Adelle-Nazarian-Breitbart-News.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2017_01_16__1540932647.html","title":"California Progressives Organize to 'Resist Trump'","title_page":"California Progressives Organize to 'Resist Trump' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"SANTA MONICA — Over one hundred “progressives” vowed to “resist” President-elect Donald Trump on Sunday as they gathered at the Mt. Olive Lutheran Church in this well-to-do coastal California city to organize efforts to combat the incoming administration.\nThe MoveOn.org-sponsored grassroots meeting coincided with several others taking place nationally, aimed “to plan for how we’ll protect our communities, defend our democracy and resist the new administration every step of the way.”\n>500 #ResistTrump @MoveOn organizing mtgs nationwide today. My local event: Packed rooms, volunteer host in suit and tie, terrific energy. pic.twitter.com/f4O5rITZXA — Anna Galland (@annagalland) January 15, 2017\nDozens of rallies across the nation on Sunday also saw Democrats and labor organizers pledging to fight in Congress against the repeal of the Affordable Care Act (also known as Obamacare).\nAlthough other people were allowed to take photos of attendees to document the turnout, Breitbart News was told (illegally, and unconstitutionally) that we could not.\nUpon learning this reporter was from Breitbart, one woman — in her late 60s, scoffed, “Shouldn’t you be out there covering Republicans or some KKK rally?”\nThe hashtags #ProtectOurCare, #ResistTrumpTuesdays and #HereToStay were created and circulated to help connect volunteers throughout the country using social media to organize and plan the “Resist Trump” movement:\nThere were a few curious Trump supporters attending the town hall. One told Breitbart News: “I think they [the volunteers] are being used … My opinion is the people from MoveOn.org wrote this stuff are hardcore Communists and I know where they’re coming from.”\nThere were approximately a dozen tables set up for groups to brainstorm the top three items MoveOn.org identified as the most pressing issues for discussion.\nThose gathered were sincere in their passion against the incoming administration and the groups quickly appointed leaders to each table. Each person was timed and given two minutes to voice their thoughts.\n“I’ve got to hand it to the guy [Trump]; he lit a fire under our butts,” a designer-turned activist named Time said. “I liken it to an alcoholic. They have to hit bottom and, unfortunately, we all have to go with him.”\nGene, who led the event and small group discussions, described himself as a “recovering Republican” and noted that he’s “never done anything like this in my life.”\nAfter he noticed an attendee sporting a red “Make America Great Again” hat and a Breitbart News t-shirt, he made it a point to say that if anyone was present at the meeting who is “not in support of what your liberal neighbors are doing,” they should leave.\nHe added, “we love you though” and said those gathered “don’t expect any trouble today.” He cautioned the volunteers, “If someone tries to interrupt or disturb our meeting, do not engage them. Ignore them, okay? Don’t talk to them. Maybe ask them to leave, but that’s it. Do not engage them in debate … We are here for one reason and one reason alone. We are here to organize.”\nThe man wearing the Trump gear, identified as Bill Becker, told Breitbart News, “I was treated cordially by everyone I encountered.” He also noted well-known radical Santa Monica activist, Jerry Ruben, who said he was welcome there.\n“We don’t have to reinvent the wheel,” one woman said regarding efforts to fight the administration on immigration. “There are already organizations that are working on these issues.” She explained further that she had been referring to United We Dream and We are Here to Stay. She also emphasized her intention to support SB 54, a measure introduced by Senate President pro Tem Kevin de Léon and Assembly Speaker Anthony Rendon, which would “freeze out ICE” by banning “state and local law enforcement officials from performing the functions of a federal immigration officer.”\nThe bill was introduced one day after California State Assembly and Senate members were sworn in.\nSome expressed fears, others guarded optimism.\n“Trump says things that terrify and scare me,” a woman named Danielle, who works as a voice-over artist by profession, said at a table marked for organizing future rallies.\nA table of women expressed similar sentiments. They agreed that Hillary Clinton made the error of neglecting middle class and working white men during the election, which resulted in her loss of many critical Electoral College votes. “Absolutely,” Debra said. “That was a mistake,” Stephanie added. “I did a lot of phone banking for Hillary and many, many people — after Comey came out [with the FBI report] — said, ‘I’m not voting at all. They’re both crooks.’ And those were Democrats.”\n“I want him to prove my worst fears wrong,” an artist named Mary told Breitbart News. Rana, “a spiritualist” who sat at the same table as Mary said, “I want to highlight the importance of working together.”\nSunday’s meeting took place just five days before Trump’s inauguration, which will see him installed as the 45th President of the United States. His presidency is likely to see the greatest opposition from the deep blue state of California, the the home of liberal Hollywood and left-leaning Silicon Valley, where progressives are gearing up to for the political fight of their lives.\nFollow Adelle Nazarian on Twitter and Periscope @AdelleNaz","url":"https://www.breitbart.com/local/2017/01/16/california-progressives-plan-town-hall-to-resist-trump/"}
