{"authors":[],"date_download":"2018-10-30 14:21:19","date_modify":"2018-10-30 14:21:19","date_publish":"2014-05-31 00:00:00","description":null,"filename":"data/vaneerConsumption/CallthemJillary.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_05_call_them_jillary_comments_1540909279.html","title":"Call them Jillary","title_page":"Blog: Call them Jillary","title_rss":"NULL","source_domain":"americanthinker.com","text":"The strangely intertwined careers of Jill Abrahamson and Hillary Clinton are explored by Noemie Emery in a long article at The Weekly Standard, titled Jillary’s Wars. Call them Jillary: as in Jill Abramson plus Hillary Clinton, two women of an age, of a kind, and of a political genre, the reigning queens of modern identity politics, each rising high and becoming a model for generations of feminists who admired their guts and brashness and gall. What binds them together, aside from left wing politics and general meanness, is their career-long involvement with feminism for fun and profit. Their career rises paralleled and echoed each other to a startling degree, from beginning: In the beginning, it all seemed much simpler. The early 1990s were the critical years for them all. Hillary went from being the lawyer-wife of an unknown southern governor to being first lady and feminist icon. Jill was at work on the book which would make her a player, Strange Justice, which... (Read Full Post)","url":"https://www.americanthinker.com/blog/2014/05/call_them_jillary_comments.html"}
generations could do. “He was like a silversmith, noisily banging the New York Times into a shape that reflected his own values, beliefs, and personality,” wrote Alex S. Jones and Susan E. Tifft in The Trust, their 1999 book about the New York Times Company, quoting a colleague who said Pinch was “not nearly as fully formed as he appeared to be.” Declaring diversity to be the most critical challenge facing the paper, Pinch embraced the cause of gay and lesbian rights, hired blacks as editors, critics, and columnists, promoted women, and like his employees resolutely took Anita Hill’s side in the Hill-Thomas sexual harassment showdown. This made him a good fit for Abramson, whom he would hire away from the Wall Street Journal in 1997 and whose views seemed to mirror his own: While treating liberal blacks with kid gloves and much reverence, the Times would make a practice of profiling conservatives such as Clarence Thomas and quota foe Ward Connerly as disturbed personalities whose udgment was wanting. In 1992, the Clintons used the raw emotions from the Hill-Thomas battle to fuel their campaign, hitching their wagon to “The Year of the Woman” and working in tandem with feminist candidates, whose campaigns would feed into their own\nto the present.\nWhen Hillary conceived her groundbreaking plan to run first for the Senate and then to become the first female president, no one dreamed she would be swamped by a far larger identity-wave, and that a little-known freshman senator—the son of a genuine African—would emerge to run against her. In the six months in 2008 before she went under, the reactions of Hillary and her friends (and her husband) at finding their group-think-plus-victim card trumped by one even stronger ranged from bewilderment to denial to frustration and finally to sputtering rage. Something of the sort happened to Jill in 2014, when she clashed with her subordinate at the Times, Dean Baquet, and Pinch, faced with choosing between them, went with the black male. “Abramson has risen beyond her coauthored book about the empowered black man and the gender victim [to become] herself possibly a gender victim—and look!—they replaced her with a black man. That’s the kind of strange justice called poetic justice,” wrote Ann Althouse. It was Jill herself who had made Clarence Thomas “the angry black man. The classic stereotype of a black man. And now, replaced by a reputably amiable black man, Jill Abramson is exposed to the world as the classic stereotype of the successful woman: the bossy bitch.”\n(Note: Baquet may not be quite as “amiable” as is intimated. This from David Folkenflik of NPR:\n…Baquet acknowledges he too can become intense amid argument. I asked Baquet about maps that reporters said had been tacked up at the Times' Washington offices to cover several holes he had punched in walls down there. He laughed and said, \"It's true. I should have a lawyer with me for this part, shouldn't I? \"I have a temper,\" Baquet said, \"In each case I was mad at somebody above me in rank. That's not an excuse, but it's a fact.\")\nEmery’s piece is an entertaining and excellent review of the hypocrisy and irony that characterize these two unappealing left wing feminists. Highly recommended.\nHat tip: Clarice Feldman","url":"https://www.americanthinker.com/blog/2014/05/call_them_jillary.html"}
