{"authors":["Jerome Hudson"],"date_download":"2018-10-30 22:08:59","date_modify":"2018-10-30 22:08:59","date_publish":"2016-05-12 01:21:06","description":"Calvin Klein's new butt cheek-baring underwear ad is becoming a PR nightmare for the controversial clothing company.","filename":"data/vaneerConsumption/CalvinKleinUnderFireforOvertlySexualAdCampaignThisIsFckingDisgusting.json","image_url":"https://media.breitbart.com/media/2016/05/kendall-jenner-calvin-klein-advertisement.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_05_11__1540937339.html","title":"Calvin Klein Under Fire for Overtly Sexual Ad Campaign: 'This Is F*cking Disgusting'","title_page":"Calvin Klein Under Fire for Overtly Sexual Ad Campaign: 'This Is F*cking Disgusting' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Calvin Klein’s new butt cheek-baring underwear ad, featuring an up-the-skirt shot of 22-year-old Danish actress Klara Kristin, is becoming a PR nightmare for the controversial clothing company.\nThe clothier’s Instagram account posted a racy picture with a caption that reads, “I flash in #mycalvins.” The backlash came quickly, as several commenters called the ad “disgusting,” while others suggested that the photo was “porno.”\n“This is disgusting,” said one Instagram commenter.\n“This is full on porno! Disgusting,” said another.\nOther outraged commenters reacted with utter shock, calling the ad “F*cking disgusting.”\nIndeed, across social media, reaction to Calvin Klein’s spring 2016 campaign was brutal.\nSeveral Twitter users argued that Kristin appeared to be underage in the photo, which would appeal to pedophiles.\n“Exactly when did paedophiles become your target audience?” one Twitter user said. “This is so offensive to victims of molestation.”\n@CalvinKlein https://t.co/oKZ7y8J1dj every pedophile a peek up a 12 year-olds skirt.Just wrong. — XAS (@momdukes1130) May 11, 2016\nAnd those Twitter users responding to the Calvin Klein tweet panned it as “gross” and “awful.”\n@CalvinKlein awful ad. Your concept looks predatory. This \"upskirt\" photo invites men to do this to women. Disrespectful. — Lexistential (@lexistential) May 11, 2016\n@CalvinKlein this ad is so wrong. You're pathetic if this is what you need to do to attract customers now.. — m.a.wuebker (@ammamaw) May 11, 2016\n@CalvinKlein wtf… did you seriously become so desperate that you had to go to the upskirt? — Tawnee Cowan (@TawneeCowan) May 11, 2016\n@CalvinKlein Geez – pushing the limits of fashion does not have to include soft porn. — Bobby Kaps (@Adventurehog76) May 11, 2016\nI get that @CalvinKlein likes to \"go there\", push the envelope and show too much skin but this is just creepy and too far. Not ok in my book — Jenna (@Jenna4Trump) May 11, 2016\nThe ad campaign also features model Kendall Jenner holding a grapefruit with the caption, “I eat in #mycalvins.”\n“Does that grapefruit remind you of a specific part of the female anatomy? (Hint: vagina.),” wrote Esquire’s Johnathan Evans.\nInterestingly enough, Calvin Klein has been accused of potentially peddling in child pornography for decades.\nIn 1995, Bill Clinton’s Justice Department launched an FBI investigation into whether photos depicting a young girl in a short skirt — in several provocative poses — violated federal decency laws.\nIn 1980, Calvin Klein introduced a controversial ad campaign starring a then-15-year-old Brooke Shields.\nFollow Jerome Hudson on Twitter @jeromeehudson.","url":"https://www.breitbart.com/entertainment/2016/05/11/calvin-klein-overtly-sexual-ad-campaign-disgusting/"}
