{"authors":["Matt Hunter For Mailonline"],"date_download":"2018-10-22 23:35:17","date_modify":"2018-10-22 23:35:17","date_publish":"2016-01-29 11:45:04","description":"Players from Cambridge Christian School (CCS), in Tampa, Florida, asked if they could carry out their pre-match ritual over the PA system only to be denied.","filename":"data/vaneerConsumption/CambridgeChristianAmericanfootballteamthreatenslegalactionoverprayerban.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30B1D5CF00000578-0-image-a-41_1454067897465.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422358_Christian-American-football-team-threatens-legal-action-officials-block-players-using-loudspeakers-pre-match-prayer_1540251317.html","title":"Cambridge Christian American football team threatens legal action over prayer ban","title_page":"Cambridge Christian American football team threatens legal action over prayer ban | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A USA private Christian school is demanding players on its football team are allowed to pray before matches after officials banned them.\nPlayers from Cambridge Christian School (CCS), in Tampa, Florida, asked if they could carry out their pre-match ritual over the PA system only to be denied.\nThe school, backed by pro-religious freedom group Liberty Institute, is now threatening legal action against Florida High School Athletic Association (FHSAA).\nA private Christian school said its American football players were not permitted to pray over a PA system at a match in Florida - pictured here is the team's quarterback Garrett Young\nThey argue players had their religious freedom violated in their game with University Christian School.\nA letter sent by Liberty Institute to FHSAA said: 'We require the FHSAA to issue a written apology to CCS for this gross violation along with written assurances that, in the future, the FHSAA will abide by the U.S. Constitution.\n'If the FHSAA refuses to meet these simple demands by February 25, our clients are prepared to seek redress in federal court, inclusive of our client's attorney's fees and costs.'\nPRAYER BEFORE AMERICAN FOOTBALL GAMES IS AN EXAMPLE OF 'CHRISTIAN SUPREMACY' Last month a former U.S. Air Force officer branded the ritual of military football players kneeling in prayer a ‘putrid’ example of ‘Christian supremacy’ and demanded it must stop. Michael Weinstein, president and founder of the Military Religious Freedom Foundation (MRFF), insisted the public prayers so often seen on the football pitch before games are ‘a scandalous outrage’. He said Air Force Academy football players had approached the MRFF claiming they were forced into joining the prayers, for fear of punishment. He even claimed that such a public showcase of Christianity could be used in anti-American propaganda produced by ISIS and al-Qaeda. ‘It’s a disgrace,’ said Mr Weinstein, who graduated from the Academy in 1977. ‘It’s a putrid example of fundamentalist Christian supremacy, triumphalism and exceptionalism and it has to stop.' The United States Air Force Academy said it was 'attentive to all religious freedom concerns' and had started an inquiry into the complaint.\nThe letter contends that at the State Championship Football Game held on December 4, in Orlando, CSS asked the FHSAA for permission to offer a pre-kick off prayer over the loud speaker.\nWith the prayer being a tradition for both schools it was expected the officials would permit it.\nBut FHSAA denied the request, arguing that the private prayer could be viewed as an endorsement of religion since the Christian schools would be praying on government property.\nThe FHSAA said in a statement: 'FHSAA acted in accordance with a prior U.S. Supreme Court decision and Florida Statutes.\n'The FHSAA, as host and coordinator of the event, is statutorily a “state actor”, and according to state and federal law, cannot legally permit or grant permission for the requested activity over the PA system.'\nThey added 'alternative options' including on-field prayer without the PA system were suggested and accepted by the teams.\nJacob Enns, the kicker for the CCS football team said: 'We were really excited to play in the championship game. But then we showed up and they wouldn't let us pray.\n'It's been our tradition ever since I've been on the team, and our tradition was ruined. It made me wonder, is it wrong to pray?'\nLiberty Institute contends in its release that no average person could watch two Christian football teams praying and interpret that as government endorsement of religion.\nAttorneys for the organisation argue the FHSAA engaged in unlawful discrimination and violated the religious liberty rights of CSS's players and staff by refusing the school's request to pray.\nA street view of Cambridge Christian School's headquarters in Florida - the group is threatening legal action as they argue the players' religious freedom rights were infringed\nIt's 'our right': Liberty Institute argues that no average person could watch two Christian football teams praying and interpret that as a government endorsement of religion\nJeremy Dys, senior counsel for Liberty Institute said in a statement: 'By banning prayer, the FHSAA sent a message to these kids that prayer is wrong and something you should be ashamed of.\n'They are on the wrong side of the law. We are committed to restoring the rights of these students — and all students across the State of Florida — to pray without government censorship.'","url":"https://www.dailymail.co.uk/news/article-3422358/Christian-American-football-team-threatens-legal-action-officials-block-players-using-loudspeakers-pre-match-prayer.html"}
