{"authors":[],"date_download":"2018-10-22 21:17:31","date_modify":"2018-10-22 21:17:31","date_publish":"2016-01-29 06:01:00","description":"Cameroon captain and former Marseille centre-back Stephane Mbia has signed for Hebei China Fortune, the club announced Friday, the latest Europe-based player...","filename":"data/vaneerConsumption/CameroonscaptainMbiaheadstoHebeiChinaFortuneFC.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h78e-4PuZeKVXE7cd9005b2c876577244-702_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422231_Cameroons-captain-Mbia-heads-Hebei-China-Fortune-FC_1540243051.html","title":"Cameroon's captain Mbia heads to Hebei China Fortune FC","title_page":"Cameroon's captain Mbia heads to Hebei China Fortune FC | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Cameroon's captain Mbia heads to Hebei China Fortune FC\nCameroon captain and former Marseille centre-back Stephane Mbia has signed for Hebei China Fortune, the club announced Friday, the latest Europe-based player to head east in the current transfer window.\n\"Looking forward to 'absolute beast defender' Mbia fully showing his strength,\" the club said on their verified microblog, adding that he would give the team's rear-guard a \"qualitative leap\".\nHebei did not give a fee but football website Transfermarkt said the club paid Turkey's Trabzonspor 4 million euros ($4.4 million) for the 29-year-old.\nSevilla's Cameroonian midfielder Stephane Mbia celebrates after winning a Spanish La Liga match in Sevilla, in May 2015 ©Cristina Quicler (AFP/File)\nOn his verified Twitter feed, Mbia posted a photo of himself in a waistcoat and cufflinks, holding a shirt from his new club.\n\"Proud to join Hebei China Fortune,\" he wrote. \"Ready for this adventure. Let's go.\"\nMbia will join Ivory Coast and former Arsenal striker Gervinho, who signed with Hebei from AS Roma on Wednesday. That fee was also undisclosed by the Chinese club, but Transfermarkt gave it as 18 million euros.\nThey are among a stream of arrivals in the Asian country as increasingly wealthy clubs flex their financial muscles.\nOn Wednesday Chelsea's Brazilian midfielder Ramires signed with Jiangsu Suning for a Chinese Super League record 28 million euros.","url":"https://www.dailymail.co.uk/wires/afp/article-3422231/Cameroons-captain-Mbia-heads-Hebei-China-Fortune-FC.html"}
