{"authors":["Alexander Robertson For Mailonline"],"date_download":"2018-10-22 23:34:47","date_modify":"2018-10-22 23:34:47","date_publish":"2016-01-29 11:32:38","description":"Cameroon-born Andong Ashu conducted the bogus examinations to begin abusing the girl in Hull, East Yorkshire. The scientist would regularly give the victim £10 or £20 to maintain her silence.","filename":"data/vaneerConsumption/CameroonianNHSscientistAndongAshuwhoabusedgirlisjailedfor21years.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30B0A7CF00000578-0-image-a-9_1454066612092.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422584_Cameroonian-NHS-scientist-performed-fake-medical-examinations-girl-11-abuse-rape-granted-asylum-Britain-jailed-21-years_1540251287.html","title":"Cameroonian NHS scientist Andong Ashu who abused girl is jailed for 21 years","title_page":"Cameroonian NHS scientist Andong Ashu who abused girl is jailed for 21 years | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Andong Ashu outside Hull Crown Court, where he has been sentenced for abusing an 11-year-old girl\nAn NHS scientist granted asylum in Britain has been jailed for the abuse and rape of a young girl while performing fake medical examinations.\nCameroon-born Andong Ashu, 45, conducted the bogus examinations to begin abusing the girl when she was just 11 years old.\nThe assaults, which happened in Hull, East Yorkshire, then became progressively more serious until Ashu began raping her.\nThe victim tried to fight him off and told him to stop, but was ignored, a court heard.\nAshu was convicted by a jury at Hull Crown Court of four counts of rape and seven other sexual assaults by majority verdicts and jailed for 21 years.\nAshu occasionally gave his victim £10 or £20 to maintain her silence, but she eventually plucked up the courage to report her ordeal to police.\nThe scientist is originally from Cameroon and was granted asylum after arriving in the UK in 2002 as a refugee.\nHe obtained a university degree before working in NHS laboratories.\nAshu, who still protests his innocence, forced the girl to relive her ordeal by giving evidence at his trial.\nRichard Woolfall, prosecuting, read two victim personal statements from the woman, who was brave enough to attend court to give evidence against Ashu during his trial.\n'She feels, in future, if she marries, she will not be able to trust her husband,' Mr Woolfall said.\n'She used to be a religious person but finds now that her belief in God has gone as a result of this.'\nHe said she had problems sleeping since the abuse, but now felt she was getting her confidence back.\nSentencing him at the same court on Thursday, Judge Jeremy Richardson QC told him: 'Andong Abong Ashu, you are a depraved individual who visited appalling debauchery upon [the victim].\n'You repeatedly sexually abused her in a vile fashion. You will be punished severely for your crimes.\n'You are aged 45 years and you fall for sentence in respect of 11 counts of serious sexual crimes.\n'You forced a trial and you were found guilty on each count by verdict of the jury.\n'The majority of the jury saw through your bogus denial. You have forfeited what would have been potent mitigation by a guilty plea.\n'Your conduct was both calculating and cruel. You engaged in vile sexual abuse. It was painful to listen to [the victim] giving her evidence of what you did.\n'You betrayed every item of trust reposed in you. You commenced your abuse on the pretext of undertaking some form of medical or physical inspection of her.\n'You spared her nothing. She was accused of telling lies. You put that girl through torment when you did what you did, and you added to her torment by forcing her to relive those appalling events.\n'She still has feelings of worthlessness, finds it hard to trust people, and found giving evidence an utter ordeal.'\nAshu, of Manchester, must serve at least half his sentence before he can be considered for release, and had an additional year added to his licence period.\nHe must sign the sex offenders register for life and was made subject to a sexual harm prevention order of indefinite duration.","url":"https://www.dailymail.co.uk/news/article-3422584/Cameroonian-NHS-scientist-performed-fake-medical-examinations-girl-11-abuse-rape-granted-asylum-Britain-jailed-21-years.html"}
