{"authors":[],"date_download":"2018-10-30 22:02:15","date_modify":"2018-10-30 22:02:15","date_publish":"2015-12-15 08:36:36","description":"Prime Minister David Cameron's proposed European Union (EU) reforms would not fundamentally change Britain's relationship with the bloc","filename":"data/vaneerConsumption/CameronsReformsChangeNothingInUKEURelationship.json","image_url":"https://media.breitbart.com/media/2015/12/Screen-Shot-2015-12-08-at-10.11.38.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_12_15__1540936935.html","title":"Cameron's Reforms Change Nothing In UK-EU Relationship","title_page":"MPs Warn: Cameron's Reforms Change Nothing In UK-EU Relationship","title_rss":"NULL","source_domain":"breitbart.com","text":"Prime Minister David Cameron’s proposed European Union (EU) reforms would not fundamentally change Britain’s relationship with the bloc and there is no certainty anything promised would actually be delivered, a committee of lawmakers said on Tuesday.\nLast month, Cameron set out in a letter to Donald Tusk, president of the European Council, the four key areas where he wants to see changes ahead of a membership referendum he has promised to hold in Britain by the end of 2017.\nIn a report published ahead of a Thursday meeting of EU leaders at which Britain’s demands will be discussed in more detail, parliament’s European Scrutiny Committee said the proposals did not do enough to boost national sovereignty.\n“The negotiation priorities as set out by the prime minister will not deliver the legally binding and irreversible agreement leading to reform of the EU nor a fundamental change in the UK’s relationship with it envisaged by him,” said the committee, which includes lawmakers from Cameron’s Conservatives as well as the opposition Labour Party and Scottish National Party.\nThe lawmakers criticised the government’s renegotiation process as lacking transparency and said parliament should have been more involved in debating what changes Britain would seek before Cameron set out his proposals.\n“We consider the approach adopted by the government to be reactive and opaque. It places the onus on parliament to guess when to request information and evidence, without information about the progress of the negotiations,” the report said.\nAssessing each of the areas of renegotiation, the committee said the political and legal challenge of achieving Cameron’s demands on limiting some welfare payments to EU migrants was “formidable” and questioned whether the proposals would even have a significant impact on immigration levels.\nIt also said it was not clear whether all four renegotiation areas would require amendments to the EU’s treaties, but that such change was the only way any reforms could be made legally binding and irreversible.\nAs this would be a lengthy process which has to be agreed by all 28 members and in some countries would require a referendum, it would not be possible to cement such changes before Britons go to the polls, the committee said.\n“Whatever the promises made in the negotiations, there is no certainty that they will be delivered to the British people. Voters in the forthcoming referendum must be aware of this when they make their choice,” said the committee’s chairman, eurosceptic Conservative lawmaker Bill Cash.","url":"https://www.breitbart.com/europe/2015/12/15/mps-warn-camerons-reforms-change-nothing-in-uk-eu-relationship/"}
