{"authors":["A.B. Sanderson"],"date_download":"2018-10-30 20:51:03","date_modify":"2018-10-30 20:51:03","date_publish":"2014-12-10 13:32:50","description":"After months of debates over controlling EU migration, which saw the Prime Minister himself making a speech laying out measures on how the Tories would |","filename":"data/vaneerConsumption/CameronStillWantsTurkeytoJointheEU.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-London/2014/12/10/Cameron-Erdogan_Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2014_12_10__1540932663.html","title":"Cameron Still Wants Turkey to Join the EU","title_page":"Cameron Still Wants Turkey to Join the EU | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"After months of debates over controlling EU migration, which saw the Prime Minister himself making a speech laying out measures on how the Tories would try to regain some control, David Cameron has said he still wants Turkey to join the EU.\nThe Prime Minister was in the county for talks with the Turkish premier, Ahmet Davutoglu, his first visit since 2010, The Telegraph reports.\nHe was quizzed over Turkish accession, which has a population of 75 million who would have free movement within the EU and is bordered by thirteen countries including Iraq and Iran. This has caused concern amid speculation that it could ease the passage for terrorists to enter European countries and result in Turkish border authorities having too much power over Britain’s borders.\n“In terms of Turkish membership of the EU, I very much support that. That’s a longstanding position of British foreign policy which I support. We discussed that again in our talks today” he said.\nBack in 2010, Mr Cameron gave a speech in Ankara where he said that Turkish membership was “vital for our economy, vital for our security and vital for our diplomacy”.\nIt was felt by many that having the largely Muslim country as a member of the political bloc would stop it being seen largely as a club for white, Christian countries.\nA European Union without Turkey at its heart was “not stronger but weaker… not more secure but less… not richer but poorer” he said.\nTurkey is already a member of NATO and was a key asset due to its proximity to rogue states and the intelligence from Middle Eastern countries.\nThe talks between Mr Cameron and Turkish leaders focused on the sharing of intelligence in the fight against the Islamic State militants. The two premiers agreed sharing information between Ankara and London on British jihadis who travel to Turkey en route to joining the Isil fighters in neighbouring Syria.\nAt a press conference, Mr Cameron said that both countries were “taking the steps that we believe we should” to deal with “this scourge of foreign fighters”.\nThis is said to include requiring all Turkish airlines to share accurate and timely passenger information on direct flights from Turkey to the UK. This would enable counter terrorism police to have more opportunities to apprehend suspected fighters.\nHe said: “The prime minister and I have agreed that we should exchange even more information, we should cooperate more in terms of intelligence.\n“These are people that threaten us back at home so we should do everything that we can and we’ve had very productive discussions today.”\nAnd the Prime Minister Mr Davutoglu reiterated his support for the agreement, saying that “Turkey has never tolerated their transit through our territory or their existence in Syria”.\n“These fighters are creating a threat for us in Turkey, they are casting a shadow over the just cause of the Syrian people” he added.\n“No country can claim that it is under more of a threat than Turkey.” He added that “in no way did any Isis leader pass through the Turkish border”.","url":"https://www.breitbart.com/europe/2014/12/10/cameron-still-wants-turkey-to-join-the-eu/"}
