{"authors":["Donna Rachel Edmunds"],"date_download":"2018-10-30 22:02:11","date_modify":"2018-10-30 22:02:11","date_publish":"2015-03-16 14:07:41","description":"Renegotiation of the EU treaties is \"mission impossible\", according to the man tasked with brokering the negotiations. But he has promised to help Prime |","filename":"data/vaneerConsumption/CameronisObviouslyProEuropeanbuthisPlannedTreatyChangeisMissionImpossiblesaysEUOfficial.json","image_url":"https://media.breitbart.com/media/2015/03/Donald-Tusk-and-David-Cameron.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_03_16__1540936931.html","title":"Cameron is Obviously Pro-European but his Planned Treaty Change is Mission Impossible, says EU Official","title_page":"Cameron is Obviously Pro-European but his Planned Treaty Change is Mission Impossible, says EU Official | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Renegotiation of the EU treaties is “mission impossible”, according to the man tasked with brokering the negotiations. But he has promised to help Prime Minister David Cameron during the talks as Cameron is “obviously pro-European”. Donald Tusk, the President of the European Council, made his comments in an interview with a number of European papers, The Guardian has reported.\nThe Conservative leader came under huge pressure when he first entered Downing Street, from both within and without his party, to call a referendum on EU membership having reneged on his promise to hold one on the Lisbon Treaty. His solution was to call for renegotiation of the Lisbon Treaty, and to put the results of that renegotiation to the British people in an in/out referendum by 2017.\nDowning Street argued that the Treaty required renegotiation anyway to further integrate the political structures within the EU nations in the wake of the Eurozone crisis. But Tusk said that there was little appetite amongst EU leaders to reopen negotiations even for integration talks, saying “The first reaction of member states about a possible process of treaty change in this context was in fact univocal, that they don’t want today any discussions about treaty change.”\nHe also joined the chorus of voices calling on Cameron to spell out exactly what success would look like for Britain if negotiations were to take place. “We need more precise concrete [details] about British demands. When we have more information about details, about legal problems, then we can decide if discussion about treaty change is at all necessary,” said Tusk.\n“For me the problem of possible treaty change is a practical question. It’s not only about the arguments of Cameron. I can agree or disagree with some of them. But at the end of the day I would like to ask him ‘what is your concrete proposal?’ and then I can consult with the other member states.”\nTusk, a former President of Poland admitted that the British question was one of his most pressing concerns upon taking up his current office in December, listing the problem as one of three most important issues in his in-tray.\nCameron’s desire to cut off the flow of immigrants pouring into Britain from Eastern Europe is a particularly tricky negotiating point for Tusk, as the largest European immigrant community in the UK is the Polish community. “It’s not easy for me because of some expectations close to the immigration problems, which means also the huge Polish minority in Great Britain,” Tusk said.\nThe 2011 census recorded 521,000 Polish-born people resident in the UK, although there is a larger Polish-British population in the country, mostly descended from the 200,000 Polish refugees who arrived after World War II.\nNonetheless, Tusk has conveyed his desire to help Cameron fulfil his aims, saying “I am ready to help Cameron. I have no doubt that we have to help in a limited and rational framework. We have to help David Cameron because he is obviously pro-European. I am sceptical when it comes to changing the treaty.”\nHe has, however, warned that a successful negotiation is highly unlikely: “My intuition is that treaty change is close to mission impossible today because it’s not only about rationality, about good argument,” he said. “We need unanimity between 28 member states, in the European parliament, in 28 national parliaments in the process of ratification. To say that it is a Pandora’s Box is too little.”\nFor now, both Brussels and London are in a holding pattern, waiting to see who will win the British general election in May. But if Cameron should be returned to Downing Street by the electorate, he will be expected to issue his full wish list at an EU summit in June.\nTusk said that he hoped a way could be found for Britain to stay within the EU – for Britain’s sake. “We need, also for the United Kingdom, a good solution for Cameron and Great Britain under existing law,” he said. “We need the United Kingdom in Europe. For me there’s no more obvious political thesis than this one. And I feel, but it’s not my role to decide about it, but I feel that the United Kingdom needs Europe.”","url":"https://www.breitbart.com/europe/2015/03/16/cameron-is-obviously-pro-european-but-his-planned-treaty-change-is-mission-impossible-says-eu-official/"}
