{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 21:58:32","date_modify":"2018-10-30 21:58:32","date_publish":"2015-10-22 20:54:26","description":"Mysterious posters have appeared mocking the \"Students for Justice In Palestine\" group by changing its logo to \"Stabbing Jews for Peace.\"","filename":"data/vaneerConsumption/CampusPostersMockStudentsforJusticeinPalestine.json","image_url":"https://media.breitbart.com/media/2015/10/Screen-Shot-2015-10-22-at-1.49.05-PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_10_22__1540936712.html","title":"Campus Posters Mock 'Students for Justice in Palestine'","title_page":"Campus Posters Mock 'Students for Justice in Palestine'","title_rss":"NULL","source_domain":"breitbart.com","text":"Mysterious posters have appeared at the University of Chicago, mocking the “Students for Justice In Palestine” group by changing the slogan on its logo to “Stabbing Jews for Peace.”\nThe change refers to the ongoing spate of stabbings carried out by Palestinian terrorists in Israel at the urging of senior Palestinian leaders.\nIn Chicago and in other cities around the nation, thousands of anti-Israel demonstrators marched this past weekend in solidarity with the Palestinians. The Chicago rally explicitly supported a “third intifada” against Israel.\nSJP chapters throughout the country, including in California, have also demonstrated in solidarity with Palestinians throughout the terror campaign, which is inspired by false accusations that Israel intends to change the status of the Temple Mount in Jerusalem, which is holy to Muslims as well.\nLocal pro-palestinian activists angrily denounced the prank posters, which appear to be a response to a poster campaign by SJP to raise awareness of their cause.\nUniversity of Chicago SJP leader Zach Taylor tweeted that the fake posters reflected “libel and violent imagery.”\nSam Cholke of Chicago’s DNAInfo news website reported that the prank had been part of a “poster war” between pro-Israel and pro-Palestinian groups.","url":"https://www.breitbart.com/national-security/2015/10/22/palestine-campus-sjp-prank/"}
