{"authors":["Breitbart London"],"date_download":"2018-10-30 18:28:02","date_modify":"2018-10-30 18:28:02","date_publish":"2016-11-12 16:13:50","description":"COPENHAGEN, Denmark (AP) — The Danish toy company Lego said Saturday it won't advertise anymore in Britain's Daily Mail, one of several British newspapers | London / Europe","filename":"data/vaneerConsumption/CampaignToDepriveRightWingNewspapersofAdvertisersClaimsScalpAsLegoWithdrawsFromDailyMail.json","image_url":"https://media.breitbart.com/media/2016/11/LEGO.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_11_12__1540924082.html","title":"Campaign To Deprive Right-Wing Newspapers of Advertisers Claims Scalp As Lego Withdraws From Daily Mail","title_page":"Campaign To Deprive Right-Wing Newspapers of Advertisers Claims Scalp As Lego Withdraws From Daily Mail","title_rss":"NULL","source_domain":"breitbart.com","text":"COPENHAGEN, Denmark (AP) — The Danish toy company Lego said Saturday it won’t advertise anymore in Britain’s Daily Mail, one of several British newspapers targeted by a social media campaign for their anti-immigrant stances.\nThe maker of multi-colored Lego building bricks tweeted Saturday “@StopFundingHate We have finished the agreement with the Daily Mail.”\nRoar Rude Trangbaek, a spokesman for the privately-held company, told The Associated Press that Lego has “no plans to make additional marketing activities with the newspaper.”\n“We spend a lot of time listening to what children tell us. And when parents and grandparents take the time to tell us what they think, we listen,” he said in an email. He declined to elaborate on the advertising.\nThe Stop Funding Hate campaign has urged companies to drop advertising in several British newspapers due to their resistance to helping child refugees.\nIn 2014, the Danish company said it would not renew its contract with oil group Shell whose logo was on Lego sets sold at gas stations in Europe. The move came after weeks of pressure following a video against oil drilling in the Arctic region.\nThe western Denmark-based group has more than 18,000 employees around the world and ranks among the world’s biggest toymakers.\nIn March, the group said its 2015 revenue soared 25 percent to 35.8 billion kroner, and said some 100 million children played with Lego products or used Lego materials in schools.","url":"https://www.breitbart.com/europe/2016/11/12/campaign-to-deprive-right-wing-newspapers-of-advertisers-claims-scalp-as-lego-withdraws-from-daily-mail/"}
