{"authors":["Jack Tonhaben"],"date_download":"2018-10-30 21:58:21","date_modify":"2018-10-30 21:58:21","date_publish":"2017-02-02 16:25:55","description":"The rabbi of a California university says a proposed student resolution to ban Sabra hummus is indicative of anti-Jewish sentiments.","filename":"data/vaneerConsumption/CampusRabbiSaysMotionToBanSabraHummusIsAntiSemitism.json","image_url":"https://media.breitbart.com/media/2017/02/hummus.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_02_02__1540936701.html","title":"Campus Rabbi Says Motion To Ban Sabra Hummus Is Anti-Semitism","title_page":"Campus Rabbi Says Motion To Ban Sabra Hummus Is Anti-Semitism","title_rss":"NULL","source_domain":"breitbart.com","text":"The rabbi of a California university says a proposed student resolution to ban Sabra company products from the university’s dining hall “is about more than hummus” and indicative of anti-Jewish sentiments among students.\nRabbi Matisyahu Devlin, director of Chabad on Campus at the University of California Riverside, told the Algemeiner on Wednesday:\n“People ask what the big deal is, because even if the motion does pass the University of California Riverside Student Senate, it’s up to administrators to decide what is served at the school. But Jewish students are afraid; they are disturbed. If the motion passes, the message is clear: We don’t want you here, even your hummus.”\nDevlin added that some students told him they may stop openly identifying as Jewish on campus if the motion passes.\nIt was scheduled for a vote on Wednesday.\n“Even though Sabra is an American-based brand, people associate it with Israel and Jews,” he added. “This vote is about banning a Jewish product, Jewish business.”\nDevlin told the paper that the effort to block the motion has been a joint project of Jewish and Israel-oriented student groups, including Chabad, Hillel, the AEPi fraternity and advocacy groups Stand With Us and Israel on Campus Coalition.\n“Everyone is getting involved in trying to make sure this vote doesn’t go through. Jews from all backgrounds are speaking out, and many non-Jews are joining us,” he said. “I have had a lot of nachas (pride) watching my students at work.”\nThe motion was brought by the school’s chapter of Students for Justice in Palestine, an anti-Israel group that succeeded in getting Sabra banned from UC Riverside in 2015 by going straight to dining services with a complaint.\nSchool administrators quickly called the decision a “mistake,” to the dismay of SJP.\n“Since that time,” Devlin told the Algemeiner, “the anti-Israel movement on campus has been growing. Right now, they are working to bring Israeli Apartheid Week to the school.”\nThe rabbi hopes he’ll be able to block the motion, but noted that SJP has allies — and at least one vote in the Student Senate.\nIn May 2015, the Salomon Center for American Jewish Thought confirmed that UC Riverside was offering a course that met the State Department’s definition of anti-Semitism, according to a report in the Algemeiner.\nThe course — “Palestinian Voices,” a student-initiated class whose syllabus reveals a different and more controversial title: “Palestine & Israel: Settler-Colonialism and Apartheid” — raised concern among 20 campus watchdog groups.","url":"https://www.breitbart.com/middle-east/2017/02/02/campus-rabbi-says-motion-to-ban-sabra-hummus-is-about-anti-semitism-not-food/"}
