{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 20:28:01","date_modify":"2018-10-30 20:28:01","date_publish":"2017-02-26 10:55:06","description":"The Canadian Parliament is debating a motion to “condemn Islamophobia” and “quell the increasing public climate of hate and fear.”","filename":"data/vaneerConsumption/CanadaMovesForwardwithAntiIslamophobiaMeasures.json","image_url":"https://media.breitbart.com/media/2017/02/Iqra-Khalid.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_02_26__1540931281.html","title":"Canada Moves Forward with Anti-Islamophobia Measures","title_page":"Canada Moves Forward with Anti-Islamophobia Measures","title_rss":"NULL","source_domain":"breitbart.com","text":"The Canadian Parliament is debating a motion urging the government to “condemn Islamophobia” and “quell the increasing public climate of hate and fear.”\nMotion 103, or M-103 as it is commonly called, was introduced in the House of Commons by Iqra Khalid, a Liberal Member of Parliament (MP) and a Pakistan-born Muslim Canadian.\nNot long after an attack on a Quebec mosque in late January, the motion is now being debated in the House of Commons. It calls on the Standing Committee on Canadian Heritage to undertake a study on what the government could do to reduce or eliminate systemic racism including Islamophobia and to present its findings no later than 240 calendar days from the adoption of the motion.\nThe motion has generated passionate debate between supporters and opponents, and has raised at least five serious points of contention.\nThe motion is based on the unsubstantiated assumption that anti-Muslim sentiment is growing in Canada\nAlthough M-103 summons the government to “recognize the need to quell the increasing public climate of hate and fear,” its proponents have produced no evidence for the claim that such a public climate is indeed growing.\nNo statistics were presented to Parliament and no cases of Islamophobia were cited to back up the claim that anti-Muslim violence is on the rise in Canada.\nOn introducing the motion, Khalid cited strong anti-Muslim sentiment in Canada, alleging that she was “among thousands of Muslims who have been victimized because of hate and fear,” but no further evidence of such victimization was furnished.\nThe motion fails to identify or define “Islamophobia”\nAccording to Freudian psychology, a phobia is “an overwhelming and unreasonable fear of an object or situation that poses little real danger but provokes anxiety and avoidance.” Properly understood, therefore, a phobia is not just a fear, but an irrational fear that goes far beyond any real possible harm. It is the disproportion between the fear and the danger and the unreasonableness of the dread that characterizes a phobia.\nWho will judge what degree of fear is proportionate in this case? Moreover, who will judge which expressions of concern over Islam are motivated by an irrational fear rather than an appropriate prudence?\nConservative MPs have contended that condemning “Islamophobia” without defining it could stifle legitimate debate about controversial issues like sharia law and the niqab.\nThe problem here is that any discussion of sharia law, the danger of Islamic terrorism or simply the relationship between the Islamic worldview and that of the Judeo-Christian West could easily provoke the accusation of Islamophobia.\nEvidence of this can be seen in the way that the other phobia du jour—“homophobia”—is commonly used an as paralyzing insult for anyone who manifests the slightest hesitation to embrace homosexual activity as an unqualified moral good.\nThe motion threatens to curb free-speech\nA number of opponents to M-103 have sustained that the motion threatens free speech by targeting an attitude (“Islamophobia”) rather than a certain sort of illegal behavior. Many have logically deduced that measures aimed at curbing Islamophobia would include pro-Muslim government propaganda encouraging positive views of Islam, along with pressure on individuals not to express negative opinions.\nAmong Conservative politicians, Brad Trost expressed his fear that the motion would be an instrument of the “thought police in Ottawa.”\nChris Alexander, the former Minister of Citizenship and Immigration said that M-103 is “ground zero” for freedom of speech, not just in Canada “but for the world today.”\nThe motion illogically prioritizes one sort of religious freedom over others\nAlthough M-103 condemns “all forms of systemic racism and religious discrimination,” it only mentions one by name: “Islamophobia.” The motion refers to Islamophobia twice, while never mentioning anti-Semitism or the need to combat anti-Christian discrimination—which arguably occurs far more often in Canada than victimization of Muslims.\nCritics such as Conservative leadership candidate Kellie Leitch have suggested that the motion is singling out Islam for “special treatment” by mentioning it by name while lumping the rest together under the generic title of “religious discrimination.”\nThe motion falls into the errors of hate-crime and hate-speech legislation\nThe introduction of hate legislation has undermined the right order of criminal justice by irrationally elevating the human passion of “hate” above other passions such as pride, anger, lust, envy and a host of other possible motives for malfeasance.\nA motion like M-103 replicates this wrong-headed legislation by addressing a state of mind—Islamophobia—rather than illegal behavior. Whether or not the motion translates into law, it creates an atmosphere where certain opinions are considered unlawful and others are prohibited.\nIn traditional jurisprudence, hate only becomes a criminal problem when one’s behavior contravenes the law. When prosecutors investigate motive and premeditation, they do so only to ascertain guilt and the level of personal responsibility involved in a given act. They do not try to measure the quality of the motive.\nThe matter of criminal law, moreover, is not internal dispositions but external actions.\nThese and other arguments would suggest that the best way for government to counteract violence against groups or individuals is not by stifling debate or trying to sway public opinion, but by making it clear that certain behavior will not be tolerated, regardless of one’s motives or intentions.\nFollow Thomas D. Williams on Twitter Follow @tdwilliamsrome","url":"https://www.breitbart.com/national-security/2017/02/26/canada-moves-forward-anti-islamophobia-measures/"}
