{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 18:38:55","date_modify":"2018-10-30 18:38:55","date_publish":"2015-01-09 16:26:56","description":"Chocolate lovers in Vancouver have apparently found a new way to enjoy their chocolate treats. A candy store in that great Canadian city is now offering a snortable chocolate. |","filename":"data/vaneerConsumption/CanadiansAreNowSnortingChocolate.json","image_url":"https://media.breitbart.com/media/2015/01/chocolate-powder-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_09__1540924735.html","title":"Canadians Are Now 'Snorting Chocolate'","title_page":"Canadians Are Now 'Snorting Chocolate'","title_rss":"NULL","source_domain":"breitbart.com","text":"Chocolate lovers in Vancouver have apparently found a new way to enjoy their chocolate treats. A candy store in that great Canadian city is now offering a snortable chocolate.\nThe owner of Vancouver’s Commercial Drive Licorice Parlour said she got the idea from a friend who had visited Europe and so she hopped on a plane to the originators of the treat in Antwerp, Belgium, one of the earliest known chocolate centers of the world.\nMary Jean Dunsdon, owner of the Vancouver candy store, explains that the snorting device developed in Belgium pops a puff of finely ground chocolate at a chocolate lover’s nose and after a healthy sniff, the fine powder enters the sinuses and oral factory where much of the ability to taste is centered.\n“Then you just kind of experience chocolate for a couple hours, actually, in a very subtle manner,” Dunsdon told Huffington Post Canada. “It hits all the same pleasure receptors in the brain [as it would] if you were to eat chocolate.”\nThe store sells the new experience for $2 a sniff, or curious chocolate lovers can get a tin of the powder for $12. For $109 Dunsdon also sells a whole sniffing kit replete with two flavors of the powder, an instruction manuel, and the tiny powder catapult to launch the powder toward the nose.\nFlavors include cocoa raspberry and cocoa ginger, both with a hint of mint.\nThe treat was created by Belgian chocolatier Dominique Persoon who was searching for an interesting desert for a birthday party for two members of the Rolling Stones rock band.\nThis is not the first time that folks have thought about snorting candy. Over the years some teens and preteens in the USA have crushed the tart candy “Smarties” to a fine powder and tried snorting it.\nDoctors do not recommend the practice and say prolonged use could leave scarring and cause breathing difficulties.\nAs for her new chocolate powder experience, Dunsdon also suggests that customers use it sparingly.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com","url":"https://www.breitbart.com/politics/2015/01/09/canadians-are-now-snorting-chocolate/"}
