{"authors":["Austin Ruse"],"date_download":"2018-10-30 18:41:25","date_modify":"2018-10-30 18:41:25","date_publish":"2015-05-15 20:10:55","description":"A Canadian mom is dragging the Catholic Church before the Alberta Human Rights Commission because the Catholic school district said her son had to use the boy’s bathroom. The woman’s son thinks he is a girl and the mother goes along with it. |","filename":"data/vaneerConsumption/CanadianCatholicChurchSuedforNotLettingBoyUseGirlsBathroom.json","image_url":"https://media.breitbart.com/media/2015/05/all-gender-restroom.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_15__1540924885.html","title":"Canadian Catholic Church Sued for Not Letting Boy Use Girl's Bathroom","title_page":"Canadian Catholic Church Sued for Not Letting Boy Use Girl's Bathroom | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A Canadian mom is dragging the Catholic Church before the Alberta Human Rights Commission because the Catholic school district said her son had to use the boy’s bathroom. The woman’s son thinks he is a girl and the mother goes along with it.\nAccording to CBC News, “The parents knew from the beginning that something was different about their child, but last September, the youngster made it clear.”\nThe seven-year-old boy said, “I just told my mom that I felt like a girl.”\nThe mother said that was when she knew her boy “was a girl who had a penis.” Apparently the boy told his parents that he had a “girl’s heart and a girl’s brain.”\nThe mother tried to get the Catholic school system to allow her son to use the little girl’s room and they refused. The school has even installed a special non-gendered bathroom for this situation, but the mother feels this solution is not good enough for her child; she claims no harm will come to anyone if he is allowed to use the girls’ restroom. She cited a doctor who said the boy has “gender dysphoria.”\nAt least one trustee of the Catholic school has spoken out in support of the boy. Patricia Grell called it a “social justice issue” and that “this little girl needs advocates. She needs people like us, trustees to stand up for her.”\nAdvocates for the boy are hopeful. The Ontario Human Rights Commission has already ordered the school system to allow confused boys and girls to use the bathroom of their choice and not the one corresponding to their sex.\nFollow Austin Ruse on Twitter @austinruse","url":"https://www.breitbart.com/politics/2015/05/15/canadian-catholic-church-sued-for-not-letting-boy-use-girls-bathroom/"}
