{"authors":[],"date_download":"2018-10-30 14:34:16","date_modify":"2018-10-30 14:34:16","date_publish":"2015-04-23 00:00:00","description":null,"filename":"data/vaneerConsumption/Canadasstillinsufficientdefensebudget.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_04_canadas_still_insufficient_defense_budget_1540910056.html","title":"Canada's still insufficient defense budget","title_page":"Canada's still insufficient defense budget","title_rss":"NULL","source_domain":"americanthinker.com","text":"\"That was the real problem with the decade of darkness: a total, total black hole in terms of procurement,\" Kenney told host Evan Solomon of CBC News Network's Power & Politics, using the phrase coined by former chief of the defence staff Rick Hillier in reference to the era of slashed military spending under the Liberals.\nThe Conservative Party of Stephen Harper has released Canada's 2015 election year federal budget, and the defense minister, Jason Kenney, is promoting the proposed CAD $11.8 billion (USD $9.6 billion) increase in military spending over the next decade:\nBut as CBC News notes, \"the money is backloaded and won't even come into play until 2017.\"\nIt is fair to classify the 2006-2015 period under the Harper government as another \"decade of darkness\" for the Canadian military.\nIn constant dollar terms, 2014 defense spending in Canada (USD $18.4 billion) was lower than when the Conservatives came to office in 2006 (USD $18.6 billion). As a percentage of GDP, defense spending in 2014 reached a post-WWII low of 1.0 percent, down from 1.2 percent in 2006, and only at half the NATO spending target. All other major members of NATO have higher military expenditures normalized to their economy compared to Canada.\nAdding an average of a billion dollars a year to the defense budget over the next decade simply will not have much impact. There is no chance that any serious major procurements can be met with this low level of investment, and the minimal rate of nominal increase in spending will not keep pace with inflation.\nThe military has not been a priority for Harper. Not only has defense spending fallen in real terms and as a percentage of GDP, but it has also declined as a percentage of general government spending from 2006 (2.7 percent) to 2014 (only 2.3 percent).\nWhile defense spending as a percentage of GDP has declined under Harper, social expenditures as a percentage of GDP have increased significantly (at 17.0 percent in 2014) since before his government took office. This is backwards for a \"conservative\" government, especially during times of geopolitical turmoil and rising threats from Russia, China, Iran, and elsewhere.","url":"https://www.americanthinker.com/blog/2015/04/canadas_still_insufficient_defense_budget.html"}
