{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 20:58:04","date_modify":"2018-10-30 20:58:04","date_publish":"2016-12-23 00:00:00","description":null,"filename":"data/vaneerConsumption/CanadianMintjoinsgoldtradingblockchainnetwork.json","image_url":"https://amp.businessinsider.com/images/585d33c9f10a9a13018b50f0-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_canadian-mint-joins-gold-trading-blockchain-network-2016-12_1540933084.html","title":"Canadian Mint joins gold-trading blockchain network","title_page":"    Canadian Mint joins gold-trading blockchain network - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Fintech Briefing\" subscribers. To learn more and subscribe, please click here.\nThe Canadian Mint and Goldmoney, a blockchain-based gold payments and savings platform operating in Canada and the UK, announced a collaboration that will give Goldmoney users access to the Mint's gold bullion vault, in addition to vaults from other participating institutions.\nBullion is the most common form in which precious metals are traded, i.e. in bars or ingots.\nThe two parties will also collaborate on campaigns to improve public awareness of and access to gold. Any user with internet access can use Goldmoney to buy, sell, and transfer allocated gold bullion via blockchain, and the service is available both for individuals and for businesses. Goldmoney has 13.4 million global users and $1.7 billion worth of AUM.\nGoldmoney users will be able to instantly buy any amount of Mint bullion using the platform's permissioned blockchain. Fees of 0.5% will apply for purchases, but bullion storage is free for up to 1,000 grams for Goldmoney users. Users will also be able to send gold title to anyone free of charge via text or email, redeem their gold balance to a prepaid Goldmoney Mastercard or bank account in fiat currency, or make vault-to-vault transfers between the Canadian Mint and seven other vaults worldwide using Goldmoney's platform or mobile app, available both for iOS and Android.\nGold trading seems to be an area ripe for real-world blockchain use cases. This week, Euroclear and Paxos successfully tested a clearing and settlement platform for unallocated gold bullion. And although most focus has been on blockchain implementation within the banking sector, it is possible that the first successful industry-wide blockchain network might take root in the gold-trading industry.\nBlockchain has the potential to make the gold-trading process, prone to high costs and human error, more cost-efficient and secure through automation and an ability to better keep track of bullion as it changes hands. In addition, alternative assets, including precious metals like gold, have been in high demand recently due to political uncertainty in the US and Europe. Together, these factors could mean high demand for blockchain solutions in the sector.\nBlockchain technology, which is best known for powering Bitcoin and other cryptocurrencies, is gaining steam among finance firms because of its potential to streamline processes and increase efficiency. The technology could cut costs by up to $20 billion annually by 2022, according to Santander.\nThat's because blockchain, which operates as a distributed ledger, has the ability to allow multiple parties to transfer and store sensitive information in a space that's secure, permanent, anonymous, and easily accessible. That could simplify paper-heavy, expensive, or logistically complicated financial systems, like remittances and cross-border transfer, shareholder management and ownership exchange, and securities trading, to name a few. And outside of finance, governments and the music industry are investigating the technology's potential to simplify record-keeping.\nAs a result, venture capital firms and financial institutions alike are pouring investment into finding, developing, and testing blockchain use cases. Over 50 major financial institutions are involved with collaborative blockchain startups, have begun researching the technology in-house, or have helped fund startups with products rooted in blockchain.\nJaime Toplin, research associate for BI Intelligence, Business Insider's premium research service, has compiled a detailed report on blockchain technology that explains how blockchain works, why it has the potential to provide a watershed moment for the financial industry, and the different ways it could be put into practice in the coming years.\nHere are some key takeaways from the report:\nSpending on capital markets applications of blockchain is expected to grow at a 52% compound annual growth rate (CAGR) through 2019, according to Aite Group, to reach $400 million that year.\nBanks and major financial institutions are working both collaboratively and independently to develop blockchain tech. Over 50 major financial institutions are involved with collaborative blockchain startups, like R3 CEV or Chain. And many are investing in the technology on their own as well.\nPutting blockchain to use for real-world transactions is likely not that far off. If working groups' tests are successful, firms could be using it to transact real value as early as the end of this year and we could see widespread industry application within the next few years.","url":"https://www.businessinsider.com/canadian-mint-joins-gold-trading-blockchain-network-2016-12"}
