{"authors":["Associated Press"],"date_download":"2018-10-23 05:01:17","date_modify":"2018-10-23 05:01:17","date_publish":"2016-01-28 21:06:11","description":"TORONTO (AP) — A Canadian arrested in China two years ago on suspicion of stealing state secrets has been charged. The Canadian government confirmed Thursday...","filename":"data/vaneerConsumption/CanadianinChinachargedwithstealingsecrets.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421367_Canadian-China-charged-stealing-secrets_1540270877.html","title":"Canadian in China charged with stealing secrets","title_page":"Canadian in China charged with stealing secrets | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Canadian in China charged with stealing secrets\nTORONTO (AP) — A Canadian arrested in China two years ago on suspicion of stealing state secrets has been charged.\nThe Canadian government confirmed Thursday Kevin Garratt has been indicted. China's official Xinhua News Agency Xinhua said Garratt has been charged in Dandong city, Liaoning Province, which neighbors North Korea. The agency reported Chinese authorities found evidence which implicates Garratt in accepting tasks from Canadian espionage agencies to gather intelligence in China.\nGarratt and his wife, Julie, were arrested in August 2014 by the state security bureau.\nFrancois Lasalle, a spokeman for Canada's Global Affairs department, said Canada finds the indictment of Garratt concerning.\n\"The Government of Canada has raised this case with the Chinese Government at high levels,\" Lasalle said.\nHe said Canadians consular officials are providing assistance to Kevin and Julia Garratt and they remain in contact with Chinese authorities and the family. He declined further comment.\nSimeon Garret has said his parents ran a coffee shop and did Christian aid work for North Koreans and said there must have been a mistake. The couple had worked with North Star Aid, whose website said the British Columbia-registered charity seeks to help North Koreans primarily through providing humanitarian aid. Simeon Garratt has said his parents made no secret of their faith but did not flaunt it in China, where proselytizing is against the law. He has said they worked on getting school supplies, cooking oil and food into North Korea.\nThe coffee shop, Peter's Coffee House, is located within sight of the Friendship Bridge linking China to North Korea. It was known for its North American cuisine and attracted a mix of tourists, students and locals.","url":"https://www.dailymail.co.uk/wires/ap/article-3421367/Canadian-China-charged-stealing-secrets.html"}
