{"authors":["Nikki Schwab","U.S. Political Reporter For Dailymail.Com"],"date_download":"2018-10-23 00:19:28","date_modify":"2018-10-23 00:19:28","date_publish":"2016-01-28 14:08:17","description":"Sure, polls in Iowa have shown a sort of tight race between Donald Trump and Ted Cruz, but after Monday's Hawkeye State caucuses it could be smooth sailing for the billionaire.","filename":"data/vaneerConsumption/CananyonestopTheDonaldTrumpcouldrunthetableasheleadsby7pointsinIowa19inNewHampshireand16inSouthCarolina.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30A6B68E00000578-0-image-a-5_1453987773502.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420948_Can-stop-Donald-Trump-run-table-leads-7-points-Iowa-19-New-Hampshire-16-South-Carolina_1540253968.html","title":"Can anyone stop The Donald? Trump could run the table as he leads by 7 points in Iowa, 19 in New Hampshire and 16 in South Carolina","title_page":"Can anyone stop The Donald? Trump could run the table as he leads by 7 points in Iowa, 19 in New Hampshire and 16 in South Carolina  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Donald Trump has a commanding lead over Ted Cruz in the next two states to vote after Iowa, new polls shows today.\nThe Republican frontrunner is ahead of Cruz by 19 points in New Hampshire and 16 points in South Carolina, the NBC/Wall Street Journal/Marist poll found.\nHe is also seven points ahead of Cruz in Iowa with just four days to go before the caucus – the first actual test for White house candidates.\nScroll down for video\nDonald Trump made a trip to South Carolina this week, a move that showed that he believed he would sweep Iowa and New Hampshire and then the Palmetto State too\n'Trump is positioned to run the house in these three states,' said Lee Miringoff, the director of the Marist College Institute of Public Opinion in a statement on the polls' release. 'Will that happen? The answer depends on when or if anti-Trump sentiment will coalesce to interrupt his march to the nomination.'\nIn Iowa, Trump is again out in front with 32 percent support from likely GOP caucus-goers.\nCruz stands at 25 percent, while Rubio is at 18 percent.\nBen Carson, who was leading in Iowa around Halloween before plummeting in the polls, now snags 8 percent support.\nJeb Bush has 4 percent.\nAll the other Republicans candidates are receiving just 2 percent support from Iowans.\nThe new numbers are good news for Trump, who was trailing Cruz 24 percent to 28 percent in the same poll less than three weeks ago, according to NBC News.\nTrump and Cruz are nearly tied when it comes to support from white Evangelical Christian voters in Iowa, with Trump receiving 31 percent to 28 percent.\nTrump's endorsement this week from Jerry Falwell Jr., the president of the Virginia-based Liberty University, could help usher more evangelicals toward the billionaire, while Family Research Council head Tony Perkins' endorsement for Cruz could have the same pull on the opposite direction.\nIn New Hampshire, things are even more comfortable for Trump.\nHe now stands at 31 percent support compared to 12 percent for Cruz.\nRubio, along with Ohio Gov. John Kasich, are tied for third place, both garnering 11 percent support, while Bush receives 8 percent.\nChris Christie is getting 7 percent in the Granite State.\nNo other Republican receives more than 5 percent in New Hampshire.\nTrump leads with a number of key constituencies in New Hampshire, including young voters with 37 percent, Tea Party supporters with 34 percent, independents with 26 percent and evangelicals with 26 percent.\nHowever, his share of evangelicals is smaller in New Hampshire than it is in Iowa.\nMoving on to South Carolina, the third state in which voters will pick their nominee, and Trump again has a double-digit lead.\nHe stands at 36 percent, while Cruz receives 20 percent.\nIn South Carolina, like Iowa, Rubio stands in third place alone, attracting 14 percent of the vote.\nBush is at 9 percent and Carson receives 8 percent.\nAll the other candidates are receiving two percent support or less.\nAnd in the Palmetto State, Trump does the best with white evangelical Christians.","url":"https://www.dailymail.co.uk/news/article-3420948/Can-stop-Donald-Trump-run-table-leads-7-points-Iowa-19-New-Hampshire-16-South-Carolina.html"}
