{"authors":["Associated Press"],"date_download":"2018-10-23 05:36:38","date_modify":"2018-10-23 05:36:38","date_publish":"2017-04-26 17:01:10","description":"A woman who was stuck on the top part of a construction crane in downtown Toronto for hours was rescued Wednesday after being strapped to a rappelling firefighter and lowered.","filename":"data/vaneerConsumption/CanadianfirefightersrescuewomanfromcraneinToronto.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/27/05/3FA56D1F00000578-0-image-a-20_1493268281793.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448398_Canadian-firefighters-rescue-woman-crane-Toronto_1540272998.html","title":"Canadian firefighters rescue woman from crane in Toronto","title_page":"Canadian firefighters rescue woman from crane in Toronto | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A woman who was stuck on the top part of a construction crane in downtown Toronto for hours was rescued Wednesday after being strapped to a rappelling firefighter and lowered to the ground.\nThe woman had been perched on a gently swaying large pulley device for at least four hours and was clinging to a steel cable when a rescuer reached her.\nShe was later identified as Marisa Lazo, 23, of Toronto, according to the CBC.\nLazo is due to appear in court Thursday morning, where she faces six counts of mischief.\nToronto Fire Chief Matthew Pegg said his crew had never seen an incident like this before.\n'It's an outstanding success,' Pegg said of the operation. 'We train for this, although we've never seen one like this before.'\nA woman who was stuck on the top part of a construction crane in downtown Toronto for hours was rescued Wednesday after being strapped to a rappelling firefighter and lowered to the ground\nThe woman had been perched on a gently swaying large pulley device for at least four hours and was clinging to a steel cable when a rescuer reached her\nA rescue worker began climbing up the crane around 6am and rappelled down to the woman. He then strapped himself to her and the pair were slowly lowered to the ground\nHe added, 'She was brought down safely, she didn't appear to be in any distress. This was a very technical, very complex rescue.'\nPegg said crews were called to the scene at a construction site at about 4am.\nA rescue worker began climbing up the crane around 6am and rappelled down to Lazo on the pulley device around 8am, Pegg said.\nThe firefighter then carefully strapped himself to Lazo and the pair were slowly lowered to the ground about half an hour later.\nThe woman, who was later identified as 23-year-old Marisa Lazo, was handcuffed and arrested. She faces six counts of mischief in a Toronto courtroom on Thursday\nStreets in the area were blocked off and bystanders packed nearby sidewalks to watch the dramatic operation unfold.\nCheers erupted from the crowd as the firefighter successfully landed on the ground with Lazo.\nShe was then handcuffed by police and handed over to paramedics.\nFire crews said there was no immediate indication of why Lazo climbed onto the crane in the middle of the night.\nThey believe she climbed up the crane, crawled out to the end of it, and slid down a cable to the large pulley device.\n'She has to tell me how she did it because she has to be our new training officer for high-angle (rescue) because it's impressive,' said Rob Wonfor, who rappelled down the towering machinery with her.\n'It was hard enough for me to go up with ropes and harnesses and she free-climbed that.'\nThe 22-year veteran of the fire service said he didn't ask Lazo for an explanation during the rescue because they needed to stay focused.\nBut he noted the woman didn't seem frightened and was 'very calm.'\n'She was a brave girl, she helped me when I got there,' he said.","url":"https://www.dailymail.co.uk/news/article-4448398/Canadian-firefighters-rescue-woman-crane-Toronto.html"}
