{"authors":["Alexandra Bruschi"],"date_download":"2018-10-30 23:27:12","date_modify":"2018-10-30 23:27:12","date_publish":"2014-08-13 18:42:00","description":"The words “life-saving” and “snake venom” rarely occur in the same sentence. But they've joined forces in a breakthrough scientific discovery: In a report recently presented to the American Chemical Society (ACS), University of Illinois scientist…","filename":"data/vaneerConsumption/CancerFightingBeeScorpionVenomIsInOurFutureScienceSays.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/0a2c8841-1bcc-4801-a344-b3e7c9e80fad.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35648-cancer-fighting-bee-scorpion-venom-is-in-our-future-science-says_1540942032.html","title":"Cancer-Fighting Bee & Scorpion Venom Is In Our Future, Science Says","title_page":"Cancer-Fighting Bee & Scorpion Venom Is In Our Future, Science Says","title_rss":"NULL","source_domain":"bustle.com","text":"The words “life-saving” and “snake venom” rarely occur in the same sentence. But they've joined forces in a breakthrough scientific discovery: In a report recently presented to the American Chemical Society (ACS), University of Illinois scientist Dipanjan Pan and his team suggested that bee, scorpion, and snake venom could potentially be used as a life-saving, cancer-fighting substance.\nTo test their hypothesis, Pan and his team first created a synthetic element similar to the venom found in bees, snakes, and scorpions to use in their experiments. When Pan used nanotechnology to deliver the synthetic venom to breast cancer and melanoma cells, he noticed that the venom indeed halted cell growth.\nThough ancient healers from around the world have used venom to treat ailments like gout, brain tumors, and even baldness for centuries, many modern doctors hesitate to use venom in their practice because of its possibly-harmful side effects. For example, bee stings can destroy cell membranes and cause blood clots, and snake venom can damage the heart muscle and nerve cells. Pan and his team, however, sought to prove to the ACS conference that their synthetic venom was different.\nIn explaining his findings, Pan made sure to clarify to his audience at the ACS conference that the human body wouldn’t react to this synthetic venom antidote as it would to a typical snake bite or bee sting, and that the venom wouldn’t harm healthy cells in its path to attack the cancer cells.\nAmerican Chemical Society on YouTube\nIn contrast to chemotherapy, Pan told the ACS conference that this technique is more precise in its ability to target only cancer cells, and thus could create the basis for a better cancer treatmnent:\nWe have safely used venom toxins in tiny nanometer-sized particles to treat breast cancer and melanoma cells in the laboratory…These particles, which are camouflaged from the immune system, take the toxin directly to the cancer cells, sparing normal tissue...The peptide toxins we made are so tightly packed within the nanoparticle that they don't leach out when exposed to the bloodstream and cause side effects.\nThough the experiments are still in early stages, Pan announced to the conference that he plans to begin a study involving human patients in three to five years. In the meantime, the team plans to test their findings on rats and pigs.\nImages: Youtube/American Chemical Society","url":"https://www.bustle.com/articles/35648-cancer-fighting-bee-scorpion-venom-is-in-our-future-science-says"}
