{"authors":["Kate Galbraith","Dan Morain","Julie Cart","Guest Commentary"],"date_download":"2018-10-30 22:35:23","date_modify":"2018-10-30 22:35:23","date_publish":"2015-08-04 08:00:00","description":"One sunny Saturday in Stockton, Mary Serrano climbed into the driver’s seat of a bright-red, all-electric Chevrolet Spark. A retiree who normally drives a","filename":"data/vaneerConsumption/CanCaliforniacutgasolineuseinhalfin15yearsProbablynot.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/maryserrano2-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938923.html","title":"Can California cut gasoline use in half in 15 years? Probably not","title_page":"Can California cut gasoline use in half in 15 years? Probably not | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"One sunny Saturday in Stockton, Mary Serrano climbed into the driver’s seat of a bright-red, all-electric Chevrolet Spark. A retiree who normally drives a 20-year-old Toyota Camry, she was curious about the new technology on display at the local fairground.\n“I feel like I’m going to outer space,” she said giddily, as a company representative prepared to explain the controls.\nBut after the excitement of the test drive, reality set in. The Camry, which had to be fixed after failing a smog test, will keep its place at her Stockton home. An electric car seems out of reach, despite the availability of rebates.\n“For the moment, I don’t have the money to buy it,” she said by phone, a few months after the fairground event. “Maybe later in life.”\nHer situation suggests that for all the allure of emissions-free vehicles, getting Californians to adopt them will take time. That in turn creates challenges for slashing gasoline and diesel use, a goal state leaders are championing as part of their battle against climate change. A bill that has passed the state Senate and awaits a vote in the Assembly seeks to halve the amount of petroleum used in motor vehicles by 2030. It will be difficult to accomplish in such a short period.\n“If we’re talking about transportation petroleum use, then the goal probably isn’t possible,” said John German, a Michigan-based senior fellow with the International Council on Clean Transportation. A key problem, he said, is that people hold onto cars and trucks for a long time, an average of more than 11 years for American cars.\nThe bill has the backing of Gov. Jerry Brown, who earlier this year called for the state to cut petroleum use in cars and trucks by “up to 50 percent.” Senate Bill 350 contains an unequivocal 50 percent target.\nA snapshot of climate policies in California View More SHARE Facebook\nTwitter\nEmail\n“I wouldn’t set forth on this pathway if I believed that the targets were unrealistic,” said Senate leader Kevin de León, D-Los Angeles, the bill’s powerful co-author, in a recent interview.\nOther parts of the legislation call for electric utilities to use 50 percent renewable energy by 2030 and for buildings to become twice as energy efficient.\n“We should be careful when we set round numbers like 50-50-50. Why 50?” said Eloy Garcia, who lobbies for the Western States Petroleum Association, in testimony before an Assembly committee in July. “I know they’re nice round numbers, but we should be careful about why we’ve picked those numbers.”\nThe bill would take gasoline use in the state back to the 1960s, a time when California’s population was close to half of what it is today. It would not only help cut greenhouse gas emissions, a priority for the state, but also reduce the fine particles and smog-forming gases that contribute to unhealthy air above some California cities, including Los Angeles, Bakersfield, and Fresno.\n“The primary driver of this target was air quality,” Stanley Young, a spokesman for the Air Resources Board, the state agency overseeing air quality and climate change policy, wrote in an e-mail.\nThe ARB would oversee the programs, creating a point of controversy because industry groups perceive it as high-handed, even as environmentalists cheer it on. Petroleum lobbyists and other opponents want elected legislators to plan how the goals will be met and not the appointed air board officials.\nCurrently, trends are moving in the wrong direction. Gasoline and diesel sales are ticking up, the sign of a surging economy. The number of miles traveled by vehicles on California highways — a crucial metric for determining whether Californians are getting out of their cars and onto bikes, sidewalks or public transportation– is also rising.\nCalifornia’s Emissions, Population and Economic Growth How will population and economic growth impact California’s greenhouse gas targets? View More SHARE Facebook\nTwitter\nEmail\nBut the technology exists to halve petroleum use, as German and others point out. If everyone suddenly began driving emissions-free electric cars, such as the one Serrano tried out, California would easily meet its target. Driven by government fuel-economy and emissions standards, even cars that run on petroleum will be made of lighter, more fuel-efficient materials in the future.\nThese coming changes will be dramatic, even if they do not end up being enough to halve petroleum use in 15 years. German’s organization, the International Council on Clean Transportation, estimates that recent federal fuel-economy standards could cause greenhouse gas emissions from light-duty vehicles nationwide to fall 28 percent by 2030 compared to 2015.\nJeffrey Greenblatt, a scientist at the Lawrence Berkeley National Laboratory, estimates that by 2030, a number of transportation policies already in existence will enable the state to cut petroleum use by cars and trucks to about 70 percent of their 2014 level. Besides federal fuel-economy standards, these include support for public transit and a state goal of having 1.5 million emissions-free vehicles by 2025.\nAnother way the state is trying to cut petroleum is by encouraging the use of biofuels like ethanol or renewable diesel, provided they are formulated to be as environmentally friendly as possible. (Renewable diesel is made from fats or vegetable oil and specially refined.) At a pump in Redwood City operated by Propel Fuels, several customers opted for 85 percent ethanol rather than the ordinary gasoline available nearby, although helping the environment was not their primary motive.\n“It’s cheaper,” said Donald Rainer of Menlo Park, whose flex-fuel GMC Yukon takes both gasoline and 85 percent ethanol. His main complaint was about refueling stations: “They don’t have enough of them around.”\nFor potential buyers of electric cars, too, costs are key. Many plug-in vehicles remain expensive, though prices have been falling and the state subsidizes them in various ways. The cars are limited in how far they can go without recharging, but that problem is diminishing as battery technology improves. Some in the auto industry wonder whether key incentives, such as allowing zero-emissions vehicles into the high-occupancy vehicle lanes on major roads, will remain in place if electric cars flood the roadways.\nAs improved fuel-efficiency allows Californians to use less gasoline, then prices at the pump may fall, according to Darwin Hall, professor emeritus of economics at California State University, Long Beach, depending on whether refiners adjust their capacity.\nHowever, in the near-term, some climate policies are causing the price of gasoline to rise. The state’s cap-and-trade program, which sets limits on the amount of greenhouse gases that fuel distributors, refineries and other large polluters can emit, has increased gasoline prices by roughly a dime a gallon this year, economists estimate.\nCap and Trade in Two and a Half Minutes View More SHARE Facebook\nTwitter\nEmail\nRepublican lawmakers fear that SB 350 will cause job losses and economic damage. “What are my constituents going to do if we cut petroleum by 50 percent but they are still using cars that require petroleum? Will they all be required to buy new cars?” asked Sen. Jean Fuller, R-Bakersfield, during a floor debate over the bill. Her colleague, Sen. Jeff Stone, R-Temecula, described it as “coastal elitism at the worst.”\nThe bill is expected to have a more difficult time in the Assembly than in the Senate, where it passed the Senate with the support of all but two Democrats: Sen. Cathleen Galgiani of Stockton and Sen. Richard Roth of Riverside. The Assembly contains more moderate Democrats who have historically been friendly to the oil industry, which has launched a television ad dubbing the bill the “gas restriction act of 2015.”\nThe ads target a select group of lawmakers and are running on websites in their respective districts, said Beth Miller, a spokeswoman for the industry group called California Drivers Alliance.\n“It is a method of communicating to legislators about an issue we think is of concern to their constituents,” Miller said.\nSen. de León emphasized that fossil fuels were not going away. Nor, he said, would everyone need to immediately buy an electric car or hybrid. (In his official capacity, de León is chauffeured in a Chevrolet Suburban. For personal use, he leases a Chevrolet Impala and said he aspires to a hybrid.) Establishing targets, he said, is vital to encouraging California down the path toward clean energy, but the policy would not result in banning or rationing gasoline.\n“If we don’t meet this goal,” de León said, “no one’s going to jail.”\nLaurel Rosenhall contributed reporting.","url":"https://calmatters.org/articles/can-california-cut-gasoline-use-in-half-in-15-years-probably-not/"}
