{"authors":["Antoinette Siu","Dan Walters","Ben Christopher","Laurel Rosenhall"],"date_download":"2018-10-30 22:49:50","date_modify":"2018-10-30 22:49:50","date_publish":"2018-07-11 23:42:27","description":"California Democrats have either concocted a clever way to thwart the Trump administration’s tax plan by gaming the tax credit programs, or they're engaging in magical thinking.","filename":"data/vaneerConsumption/CanDemocratsshieldCaliforniansfromnewGOPtaxlawdespiteIRSopposition.json","image_url":"https://calmatters.org/wp-content/uploads/ThinkstockPhotos-903438576-e1531414694116.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939790.html","title":"Can Democrats shield Californians from new GOP tax law-despite IRS opposition?","title_page":"Can Democrats shield Californians from new GOP tax law—despite IRS opposition? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"As President Trump’s massive tax overhaul takes effect, Democratic state lawmakers are refining and advancing a plan they insist will protect California taxpayers from higher federal tax bills.\nThe federal government last year set a cap of $10,000 on state and local income, property and sales tax deductions combined, which about a third of Californians claim. Taxpayers in states with high taxes and property values are likely to get hit hardest from the loss of these deductions, which high earners rely on to reduce the taxes they owe Uncle Sam.\nLambasting the move by Trump and the GOP-controlled Congress as an attack on high-taxed blue states, California Democrats hit upon a supposed workaround to the deduction limit. Under the pending legislation, the state would change its laws, the theory goes, to offer Californians the option of making a donation to a state or local government or nonprofit that the state would deem as “charitable”—thus magically preserving the ability of taxpayers to deduct it on their federal and state taxes.\nSounds like a way to boost state funding, but the government won’t actually keep all the money. The state would offset what it takes in by giving back to taxpayers 80 to 85 percent of contributions via a tax credit.\nA clever attempt to thwart the Trump administration’s tax plan by gaming the tax credit programs? Maybe—but it might not work.\nThe IRS in May signaled its intent to look more critically at such a workaround—a vague warning, but one that has prompted at least one of the sponsors of the California legislation to scale back its scope. But while conservatives describe the California effort as laughable and doomed, some tax and policy experts still insist it can prevail.\nIt’s what many states—including Trump-supporting red ones—already have been using to fund some of their public programs, says Kirk Stark, tax law and policy professor at University of California, Los Angeles. In 2013, he co-authored a report outlining how states could capture federal money by creating state tax credits for contributions.\n“The big question now is whether the IRS will attempt to undercut the tax advantages of all of these programs, which would be politically unpopular but somewhat more defensible legally, or if they’ll somehow try to nix only the newer blue state programs, which would be more palatable for advocates of red state programs but would be legally dubious,” Stark told CALmatters.\nTwo related bills aimed at a deduction workaround have passed their chambers of origin, authored by Sen. Kevin de León of Los Angeles and Assemblywoman Autumn Burke or Marina Del Rey.\nBurke’s proposal would allow taxpayers to give to nonprofits and public schools and districts.\nDe León’s would allow the state to accept contributions for government programs. Both bills must pass the full Legislature by Aug. 31 in order to reach Democratic Gov. Jerry Brown.\nBy amendment, de León’s bill has been narrowed to direct the funds to public schools and community colleges as opposed to a state-run fund that would disperse the money more widely—interpreted as a way of upping the legislation’s chances of surviving legal challenges. More than a dozen states, including Arkansas and Maryland, already use a similar mechanism to help underwrite private school vouchers.\nIf passed, the duo of bills could theoretically sidestep the federal change by allowing Californians to make donations to the state after they hit the limit, and write those state donations off a charitable contribution. But whether the IRS would accept the contribution and how many taxpayers will actually take advantage of the credits remains to be seen.\nIn 2015, Californians deducting state and local taxes claimed an average of $18,438 per taxpayer, according to The Pew Charitable Trusts. Other states with high average deductions include New York, Connecticut and New Jersey.\n“It will cost Californians billions of dollars,” de León said of the federal tax overhaul in a video introducing his bill. “We shouldn’t be subject to double taxation to pad the profits of corporations and hedge fund managers.”\nIn April, New York became the first state to enact legislation that will create a state-run charitable trust to accept contributions and offer tax credits. Donors get a credit equal to 85 percent of the gift and funds go toward health care, education and nonprofits. New Jersey and Connecticut have also passed similar legislation.\nIn Connecticut, municipalities will get to decide whether they establish a charitable fund and how much of a tax credit they give taxpayers for contributions. There is risk involved—because the IRS decision hangs in the balance. That’s what Michael D’Addio, principal at Connecticut-based accounting firm Marcum, is telling clients.\n“The IRS has got to come up with some conclusion on how they’re going to address all these states,” said D’Addio.\nIn May, the IRS said it planned to issue guidance on the issue and warned that taxpayers would be making these contributions at their own risk: “Despite these state efforts to circumvent the new statutory limitation on state and local tax deductions, taxpayers should be mindful that federal law controls the proper characterization of payments for federal income tax purposes.”\nAnd yet, Stark contended in an email, the IRS hasn’t “said anything of substance on the issue yet.”\nCalifornia’s Republican lawmakers say it’s obvious that the IRS will reject such state maneuvers. Sen. John Moorlach, a Costa Mesa Republican and partner in an accounting firm, called de León’s bill “too cute” to succeed.\n“This whole bill is a missile shooting at Washington, D.C., and it will not stand,” Moorlach said at a hearing. “It’s just not going to work, so you’re sort of giving false hope to a lot of people and you’re also probably going to create some liability exposure.”\nOther critics contend the real problem is that California’s Democratic lawmakers have saddled state residents with state and local taxes that are too high—and with a tax structure that relies heavily on the personal income tax. Jared Walczak, policy analyst at Washington, D.C.-based think tank the Tax Foundation, calls California’s attempts a “legally dubious” strategy that the IRS will fight.\n“California policymakers could find themselves encouraging taxpayers to pursue a strategy that backfires on them, that ultimately results in them paying more taxes and potentially facing IRS penalties,” Walczak told CALmatters.\nThe IRS can react in one of two ways, he continued. Either it will distinguish between tax credit programs that already exist in certain states from these pending ones, or it can create a rule that will reduce the charitable deduction amounts taxpayers can receive. Existing statutes and case law are on the IRS’ side, he said.\n“Whatever the motivations behind these, it’s pretty clear the IRS is disallowing them. So states should hit pause and wait for that guidance before they move forward,” Walczak said.\nJon Coupal, president of the Howard Jarvis Taxpayers Association, also points to California’s “dysfunctional tax code” in this debate. Legislators should, he said, instead try to flatten out the income tax rate to address the state’s revenue volatility.\n“The tax-and-spend lobby’s answer to federal tax reform has been to propose a convoluted scheme that would allow high-wealth individuals to make ‘contributions’ to some government-affiliated entities that they argue would be deductible as charitable giving. In the meantime, we continue to experience the negative consequences of California’s tax code,” he wrote in an opinion letter.\nThe IRS did not respond to inquiries about when its regulation will come, but Charles Rettig, the nominee for IRS commissioner, said in June at his confirmation hearing he is aware of the uncertainty concerning states and taxpayers. He did not give a position on the matter but said he “looks forward to a resolution that, universally, people could say is the right resolution.”\n“It’s my understanding that there’s a possibility that the post-tax act situation could be not on all fours with the earlier position taken by the Internal Revenue Service in the 2010 chief counsel notice,” Rettig said.\nOriginally introduced in 1917, charitable contribution deductions have been widely used by many states running school voucher programs and scholarships supported by funds from taxpayer donations. Georgia gives its taxpayers a tax credit for contributions made to rural hospitals, and Alabama and South Carolina offer tax incentives to those giving to public schools.\nDarien Shanske, law professor at University of California, co-authored the paper on charitable tax credits with Stark and other tax experts.\nHe still advocates that California enact the workaround bills and try it—despite the uncertainty and likely litigation. De León and Burke’s bills work nicely together, he said, and taxpayers with a lot of state taxes to deduct would benefit from the programs the workaround could fund.\n“It seems like a tax break for the wealthy, but actually it enables California to fund its services progressively,” said Shanske. “There’s no reason why government shouldn’t be able to fund programs through charitable contributions.”\nThis article has been updated to clarify that the federal deductibility cap applies to state and local income and property taxes combined.\nWant to dig deeper into California’s tax system? Here you go.","url":"https://calmatters.org/articles/can-democrats-shield-californians-from-new-gop-tax-law-despite-irs-opposition/"}
