{"authors":["Mike Larkin For Dailymail.Com"],"date_download":"2018-10-22 21:51:49","date_modify":"2018-10-22 21:51:49","date_publish":"2016-01-29 08:21:06","description":"Blonde bombshell Candice Swanepoel, 25, did the pouring while wearing a racy sheer dress at a perfume launch in New York on Thursday","filename":"data/vaneerConsumption/CandiceSwanepoelpourschampagnepyramidatElizabethArdenperfumelaunch.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/07/30B0347E00000578-0-image-a-132_1454052385478.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422282_Candice-Swanepoel-steady-hand-pours-champagne-pyramid-sheer-dress-perfume-launch_1540245109.html","title":"Candice Swanepoel pours champagne pyramid at Elizabeth Arden perfume launch","title_page":"Candice Swanepoel pours champagne pyramid at Elizabeth Arden perfume launch | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"When one pours a champagne fountain all attention is usually on the fizzy stuff.\nBut it was surely hard for attendees to concentrate when blonde bombshell Candice Swanepoel did the pouring while wearing a racy sheer dress at a perfume launch in New York on Thursday.\nThe saucy stunner looked in fine form indeed as she showcased her steady hand, not to mention other noteworthy attributes, at the Elizabeth Arden event.\nScroll down for video\nShe's got bottle: Candice Swanepoel made it look easy as she poured champagne at a perfume launch in Ne York on Thursday\nThe 25-year-old Victoria's Secret Angel seemed to have a great time pouring the good stuff, and delighted in hamming it up for the cameras by pulling a funny face as the drink flowed.\nBut she was not the only one whose jaw was dropping as she flaunted her pleasingly firm form in her black fishnet sheer dress, which showcased her pedigree to the full as she held a bottle of the wonderfully named Viva La Juicy Rose.\nThose who think she is simply another pretty face are very much mistaken however.\nFor Candice recently revealed she is a woman of many talents, admitting she has another, lesser-known trick up her sleeve.\nPyramid scheme: The joker made sure she got a cheap laugh by posing with her jaw hanging down\nWorth a sniff: Who wouldn't want to smell Elizabeth Arden's Viva La Juicy Rose if Candice is holding it\nThe self-confessed shy South African stunner said: 'I am very good at pretending that I am not nervous!'\nBut that's not all, for she also gave an brief, but deceptively deep, insight into her complicated job as a Victoria's Secret Angel.\nShe said: 'It comes with a different kind of responsibility. It’s not just about posing for shoots. People know your name and your personality.'\nHigh pressure indeed for the professional lingerie wearer, who is worth an impressive $19 million. She is the eight highest paid model in the world according to Forbes and last year pulled in an estimated $5 million.\nSheer delight: The gentlemen at the event found it difficult to concentrate on the product being hawked by the blonde beauty","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422282/Candice-Swanepoel-steady-hand-pours-champagne-pyramid-sheer-dress-perfume-launch.html"}
