{"authors":["Mark Prigg For Dailymail.Com"],"date_download":"2018-10-23 05:13:36","date_modify":"2018-10-23 05:13:36","date_publish":"2016-01-28 21:10:02","description":"The world's largest social network today said it was allowing all of its US iPhone users to broadcast live. Facebook began testing the live video option among U.S. users last year.","filename":"data/vaneerConsumption/CanFacebooksinkPeriscopeLivevideostreamingaddedtoiPhoneapp.json","image_url":"https://i.dailymail.co.uk/i/pix/2015/12/03/20/2F08E20D00000578-0-image-a-20_1449175637980.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3421723_Can-Facebook-sink-Periscope-Live-video-streaming-added-iPhone-app_1540271616.html","title":"Can Facebook sink Periscope? Live video streaming added to iPhone app","title_page":"Can Facebook sink Periscope? Live video streaming added to iPhone app | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Get ready to start watching live video of your friends and family doing something fun, boring and even dumb on Facebook.\nThe world's largest social network today said it was allowing all of its US iPhone users to broadcast live.\nFacebook began testing the live video option among a sliver of its U.S. audience with iPhones last year.\nScroll down for video\nThe world's largest social network is testing a new feature that will enable its 1.5 billion users to use their smartphones to shoot video so other people can see what they are doing in real time.\n'Today, we’re excited to expand the ability to share live video to everyone in the U.S. via iPhone, and we plan to start rolling this out to the rest of the world over the coming weeks,' said Facebook's Vadim Lavrusik.\nThe company didn't say when everyone with a Facebook account and a smartphone will have an opportunity to broadcast live.\n'Now you can bring the photos and videos you share on Facebook to life with live video and collages, to help friends and family feel like they’re in the moment with you,' it said.\nThe feature represents Facebook's latest challenge to online messaging service Twitter, which introduced a live video application called Periscope earlier this year.\nAnother popular app called Meerkat also can be used to share live video.\nHOW IT WORKS To share live video, tap on Update Status and then select the Live Video icon. You can write a quick description and choose the audience that you want to share with before going live. During your broadcast, you’ll see the number of live viewers, the names of friends who are tuning in, and a real-time stream of comments. When you end your broadcast, it will be saved on your Timeline like any other video, which you can then delete or keep for your friends to watch later. Facebook began testing the live video option Thursday among a sliver of its U.S. audience with iPhones.\n'Live lets you show the people you care about what you’re seeing in real time — whether you’re visiting a new place, cooking your favourite recipe, or just want to share some thoughts,' said the social network.\n'No matter where you are, Live lets you bring your friends and family right next to you to experience what’s happening together.'\nThe social network giant also unveiled a new way to show pictures using a collage.\nCollages can group photos and videos that were taken together into a scrolling, moving collage.\nIt can group photos and videos that were taken together into a scrolling, moving collage.\nIt will show recent 'moments' from your camera roll organized into collages based on when and where you took them.\nYou can edit your collage by adding, removing or re-arranging the photos and videos that you want to include.\nCollages will begin rolling out on iPhone today and will be available on Android early next year.","url":"https://www.dailymail.co.uk/sciencetech/article-3421723/Can-Facebook-sink-Periscope-Live-video-streaming-added-iPhone-app.html"}
