{"authors":["Jim Zarroli"],"date_download":"2018-10-22 21:30:12","date_modify":"2018-10-22 21:30:12","date_publish":"2017-01-26 00:00:00","description":"Many groups are raising questions about President Trump's conflicts of interest, but do they have the \"standing\" to challenge him in court? Some legal experts say Trump's business competitors might.","filename":"data/vaneerConsumption/CanGroupsSueEvenIfTheyWerentHarmedNPR.json","image_url":"https://media.npr.org/assets/img/2017/01/25/gettyimages-632699284_wide-85822626d9a2f17272183ca95d4d9c94a01059b7.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2017_01_26_511665032_can-groups-sue-over-trumps-business-conflicts-even-if-they-werent-harmed_1540243812.html","title":"Can Groups Sue Even If They Weren't Harmed? : NPR","title_page":"President Trump's Business Conflicts Of Interest: Can Groups Sue Even If They Weren't Harmed? : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Can Groups Sue Over Trump's Business Conflicts Even If They Weren't Harmed?\nEnlarge this image toggle caption Nicholas Kamm/AFP/Getty Images Nicholas Kamm/AFP/Getty Images\nPresident Trump's continued business dealings have generated plenty of teeth-gnashing about whether the occupant of the White House will be profiting off his new role.\nThe question is who has the \"standing\" to do anything about it?\nThis week a group of legal scholars and former government ethics officials teamed up to file a lawsuit in federal court alleging that Trump's overseas commercial activities violate the Constitution's Emoluments Clause, which bars presidents from taking gifts from foreign governments.\nThe suit faces some significant legal hurdles, among them the question of whether Citizens for Responsibility and Ethics in Washington, the advocacy group behind the lawsuit, actually has the standing to sue the president.\n\"Standing is a basic doctrine of the federal courts. No one has the right to go into court and get a judgment unless they've been injured by the action they're complaining about, so we don't just have miscellaneous busybodies filing lawsuits,\" says Michael McConnell, director of the Constitutional Law Center at Stanford University.\n\"If your neighbor is hit by a car, you may be outraged. You may think he ought to sue. But you can't sue on his behalf. He's the only one who can sue,\" McConnell says.\nCREW argues that, as a government ethics watchdog, it should be looked at like a business whose main \"product\" is ethics advocacy and commentary.\n\"Because of Donald Trump's unprecedented conflicts of interest, the cost to produce that product has gone up. The resources have had to shift away from the business they engage in typically, and that affects them. It affects them directly. It affects the way they spend money,\" says Deepak Gupta, a Supreme Court litigator who is representing CREW.\nGupta says some precedent exists for the argument. In the 1982 Havens Realty case, the Supreme Court ruled that a housing rights group could claim damages because it was forced to put money and resources into opposing discrimination by a private real estate firm.\nBut McConnell, who believes CREW's argument for standing is something of a stretch, says that case was \"quite a different situation.\"\n\"That organization was providing actual services to people who were purchasing housing,\" he says. \"They were ushering clients through the process, and when the defendants were discriminating, and hiding the type of discrimination, it actually made it more difficult for them to provide the services that they were providing.\"\nSince the Havens Realty case, numerous public-interest groups have tried to argue that they have standing because laws were being violated, says Jonathan Adler, professor of law at Case Western Reserve University.\n\"In all these cases, the court has made clear that being a mission-oriented organization is not enough to establish standing. You still have to show something more concrete than alleging a legal violation that touches upon your mission,\" Adler says.\nIf CREW doesn't have the legal standing to challenge Trump, who does?\nOne possibility is Trump's business competitors. For example, a hotel could argue that it's facing unfair competition because its customers are switching to Trump properties in an effort to curry favor with the president. Something like that is actually happening, Gupta says.\n\"We have been contacted since we filed the lawsuit by all sorts of people who believe they have economic injuries as a result of the streams of foreign payments that go to Donald Trump's businesses, and we are considering very carefully the potential claims that those people have,\" Gupta says.\nThe courts could also decide that no one really has the standing to sue the president over his conflicts of interest, and that Congress will ultimately have to decide whether Trump's business dealings are a problem, Adler says.\n\"The impeachment clause [of the Constitution] specifically mentions bribery as an impeachable offense,\" Adler says. \"So if we believe that the president is violating the Emoluments Clause or is otherwise so enmeshed in conflicts of interest that they are tantamount to bribery or that they prevent him from being able to discharge his responsibilities, the primary mechanism for dealing with that is the impeachment clause.\n\"That's obviously a severe remedy. That's obviously something that's unlikely when Congress is controlled by the same party. But that is the structure,\" he says.","url":"https://www.npr.org/2017/01/26/511665032/can-groups-sue-over-trumps-business-conflicts-even-if-they-werent-harmed"}
