{"authors":["Pamela J. Hobart"],"date_download":"2018-10-31 00:11:08","date_modify":"2018-10-31 00:11:08","date_publish":"2014-08-12 20:07:00","description":"Snack or meal time is always just a few hours away, and once again, you face that conundrum: Am I going to \"eat healthy\" this time or not? But you should actually do both, because researchers at Vanderbilt University have proposed a way to combine…","filename":"data/vaneerConsumption/CanIEatUnhealthyandStillLoseWeightMaybeIfYouDoSoIntheRightRatio.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/701c4d77-b1b1-4fc6-9ad5-1a4b08ba3cfc.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35489-can-i-eat-unhealthy-and-still-lose-weight-maybe-if-you-do-so-in-the-right_1540944668.html","title":"Can I Eat Unhealthy and Still Lose Weight? Maybe, If You Do So In the Right Ratio","title_page":"Can I Eat Unhealthy and Still Lose Weight? Maybe, If You Do So In the Right Ratio","title_rss":"NULL","source_domain":"bustle.com","text":"Snack or meal time is always just a few hours away, and once again, you face that conundrum: Am I going to \"eat healthy\" this time or not? But you should actually do both, because researchers at Vanderbilt University have proposed a way to combine healthy and unhealthy foods for better nutrition. These so-called \"vice-virtue bundles\" (such as french fries served alongside apple slices) may hold the key to feeling satisfied with your food and eating healthfully.\nThe Vanderbilt researchers conducted some experiments to find the \"taste-health balance point\" that eaters prefer: in other words, how much boring-but-healthy food are you willing to tolerate with that tasty junk food? It turns out that most people are fine with a mix containing as little as 25 to 50 percent \"vice\" food. If you're eating cookies and cut veggies, for instance, you might choose two small cookies and a handful of carrots instead of a whole pile of just cookies. Saving even one or two hundred calories per day in this manner could go far in preventing the insidious weight creep of aging.\nMixing healthy and unhealthy items also may work for places that are hoping to sell food for profit without contributing to the obesity epidemic. There's no use \"selling\" healthy snacks if no one actually buys them, but only offering food that'll kill people in order to maximize revenue seems sleazy. If virtue-vice bundles really satisfy, and really sell, then they're a win for consumers and merchants alike.\nIndeed, the vice-virtue bundle is more likely to work than just reducing portions will, as in the case of the \"100-calories pack\" which — oops — actually encouraged people to eat more snack foods instead of less. So, although research clearly shows that people can feel satisfied by surprisingly small portions of indulgent foods, presentation matters. The vice-virtue bundle probably fares better than the 100-calorie pack because it offers a larger, more satisfying amount of food altogether. I'm off to try my first vice-virtue bundle (grapes and coconut macaroons), and we'll see how it goes.","url":"https://www.bustle.com/articles/35489-can-i-eat-unhealthy-and-still-lose-weight-maybe-if-you-do-so-in-the-right"}
