{"authors":["Associated Press"],"date_download":"2018-10-22 23:19:23","date_modify":"2018-10-22 23:19:23","date_publish":"2017-03-16 06:14:15","description":"TEHRAN, Iran (AP) - On a cold winter morning in the Iranian capital recently, a homeless dog lay basking in the sun's rays for warmth. Suddenly, the canine...","filename":"data/vaneerConsumption/CaninesheltertakesonTehranstraydogproblemhumanely.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/06/wire-226793-1489645463-707_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319008_Canine-shelter-takes-Tehran-stray-dog-problem-_-humanely_1540250363.html","title":"Canine shelter takes on Tehran stray dog problem _ humanely","title_page":"Canine shelter takes on Tehran stray dog problem _ humanely | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"TEHRAN, Iran (AP) - On a cold winter morning in the Iranian capital recently, a homeless dog lay basking in the sun's rays for warmth. Suddenly, the canine moaned - it had been shot with an anesthetic dart from a blowpipe. It ran several steps, then fell immobilized.\nThe cream-and-gray colored dog was collected by a worker for a new shelter where it will be given a medical check, neutered and microchipped - the first such initiative in this country where usually strays in the street are killed.\nThe Aradkouh Stray Dogs Shelter has been hired by the Tehran city government to take a new, more humane approach to deal with the burgeoning problem of stray dogs in the capital. It's a sign of changing attitudes among officials in a country where Islamic authorities have long seen dogs as \"un-Islamic\" and at times still confiscate them from people who have dogs as pets and walk them in public or drive with them in their cars.\nIn this picture taken on Sunday, March 5, 2017, veterinarian Hamid Ghahremanzadeh, chief of Aradkouh Stray Dogs Shelter plays with some of his charges on the outskirts of the capital Tehran, Iran. The shelter has been hired by the Tehran city government to take a new, more humane approach to deal with the burgeoning problem of stray dogs in the capital. It's a sign of changing attitudes among officials in a country where Islamic authorities long saw dogs as \"un-Islamic\" and would at times confiscate them from people who kept them as pets. (AP Photo/Vahid Salemi)\nAlthough there are no official numbers, in some Tehran neighborhoods - especially in poorer districts - strays are rampant and a nuisance and the shelter captures 30 to 40 dogs per day. District 18, for example, a poor neighborhood in Tehran's southwest known for its farmland, brick furnace towers, junkyards and factories, has some of the most stray dogs in the city.\n\"This area has a countless number of dogs and sometimes they pass by in hordes,\" said Einollah Ardalanisaid, a garage owner in southern Tehran who hailed the initiative that began less than a year ago. \"I think it is great if these dogs can be collected in a managed way so that neither the dogs nor the citizens are harmed.\"\nThe shelter, located near the small town of Kahrizak, caters to the captured dogs' needs, including feeding them and examining them for disease. Shelter workers vaccinate the dogs and sterilize them to control the stray population. After about two weeks, the dogs are microchipped and registered in a data bank so they can be tracked down later. The facility is equipped with surgery rooms, sonography machines and a kitchen.\nOn a recent day, there were 500 mature dogs and 145 puppies being looked after by the shelter's staff. All the dogs are available for adoption.\nUrban animal control vehicles set off in the mornings to hunt for strays, their destination determined by reports from citizens or places where the population of the animals is conspicuously large. The staff's hunting tools are blowpipes or guns armed with dart syringes filled with anesthetic drugs.\nThe workers are trained to try to catch the animals as gently as possible and are advised not to use force.\nIn Islam, dogs are seen as unclean. However, police dogs, shepherd dogs and rescue dogs are common, and there have been no reports of clerical backlash against the shelter's operations.\nPrior to the shelter's arrival, the preferred method of dealing with stray animals was to shoot them dead.\nIn one horrific case in 2015, dogs were injected with a deadly substance, presumably acid. Videos were published on social media showing dogs dying while moaning in agony. The videos quickly went viral, sparking widespread outrage and prompting protests by animal rights activists and celebrities.\nAn animal activist who filmed the dog killings in the city of Shiraz in central Iran claimed that private contractors were paid about $4 for each dog they killed. Local authorities denied having any role in the incident.\nSince the advent of the shelter, municipal authorities claim that not a single dog is killed inhumanely and that the animals are being treated in a far more civil manner.\nHassan Heidari, director of Tehran's Urban Animal Control Department, told The Associated Press that killing dogs or any other animals is against Islamic teachings and animal rights.\n\"From a moral and Islamic point of view, we are not allowed to treat these animals violently,\" he said. \"Observance of animal rights was another motive that made us stop killing dogs.\"\n\"We are now catching them alive despite its costs and troubles,\" he added. \"Today, with God's grace, we have accomplished a very useful and pleasant achievement.\"\nAfter shooting the dogs with the darts, the animals are placed in the air-conditioned rear compartments of the dog-catcher vehicles.\nUpon arrival at the shelter, after being fed and checked for illness, some dogs are neutered or treated with medicine in the facility's clinic and can spend 15 to 45 days there recovering. The dogs are then given to animal supporters who adopt them or are released into the wild.\nDogs that are not adopted receive a collar and a microchip that contains the dog's full history.\nDr. Hamid Ghahremanzadeh, the Canadian-educated veterinarian who runs the shelter, says staffers make an effort to find the dogs a home.\n\"We make arrangements to give (adopters) a registered dog with an ID,\" he said. \"If there is no adopter, we will release the sterilized dog at the same spot where we took them.\"\n___\nFollow Amir Vahdat on Twitter at www.twitter.com/AmirhVahdat . His work can be found at http://bigstory.ap.org/journalist/amir-vahdat .\nIn this picture taken on Sunday, March 5, 2017, Tehran's urban animal control workers carry a caught stray dog to put into their vehicle after being shot with an anesthetic dart on the outskirts of the capital Tehran, Iran. The shelter has been hired by the Tehran city government to take a new, more humane approach to deal with the burgeoning problem of stray dogs in the capital. It's a sign of changing attitudes among officials in a country where Islamic authorities long saw dogs as \"un-Islamic\" and would at times confiscate them from people who kept them as pets.(AP Photo/Vahid Salemi)\nIn this picture taken on Sunday, March 5, 2017, caught stray dogs are put inside the vehicle of Tehran's urban animal control after being shot with anesthetic darts on the outskirts of the capital Tehran, Iran. The shelter has been hired by the Tehran city government to take a new, more humane approach to deal with the burgeoning problem of stray dogs in the capital. It's a sign of changing attitudes among officials in a country where Islamic authorities long saw dogs as \"un-Islamic\" and would at times confiscate them from people who kept them as pets. (AP Photo/Vahid Salemi)\nIn this picture taken on Sunday, March 5, 2017, a Tehran urban animal control worker puts an anesthetic dart syringe into his gun to shoot stray dogs on the outskirts of the capital Tehran, Iran. The shelter has been hired by the Tehran city government to take a new, more humane approach to deal with the burgeoning problem of stray dogs in the capital. It's a sign of changing attitudes among officials in a country where Islamic authorities long saw dogs as \"un-Islamic\" and would at times confiscate them from people who kept them as pets. (AP Photo/Vahid Salemi)\nIn this picture taken on Sunday, March 5, 2017, caught stray dogs stand on their cage's wall at Aradkouh Stray Dogs Shelter on the outskirts of the capital Tehran, Iran. The shelter has been hired by the Tehran city government to take a new, more humane approach to deal with the burgeoning problem of stray dogs in the capital. It's a sign of changing attitudes among officials in a country where Islamic authorities long saw dogs as \"un-Islamic\" and would at times confiscate them from people who kept them as pets. (AP Photo/Vahid Salemi)\nIn this picture taken on Sunday, March 5, 2017, a Tehran urban animal control worker shoots dog with anesthetic dart from a blowpipe on the outskirts of the capital Tehran, Iran. The shelter has been hired by the Tehran city government to take a new, more humane approach to deal with the burgeoning problem of stray dogs in the capital. It's a sign of changing attitudes among officials in a country where Islamic authorities long saw dogs as \"un-Islamic\" and would at times confiscate them from people who kept them as pets. (AP Photo/Vahid Salemi)\nIn this picture taken on Sunday, March 5, 2017, veterinarian Habib Golzardi performs a sterilization surgery on a stray dog at Aradkouh Stray Dogs Shelter on the outskirts of the capital Tehran, Iran. The shelter has been hired by the Tehran city government to take a new, more humane approach to deal with the burgeoning problem of stray dogs in the capital. It's a sign of changing attitudes among officials in a country where Islamic authorities long saw dogs as \"un-Islamic\" and would at times confiscate them from people who kept them as pets. (AP Photo/Vahid Salemi)","url":"https://www.dailymail.co.uk/wires/ap/article-4319008/Canine-shelter-takes-Tehran-stray-dog-problem-_-humanely.html"}
