{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 19:47:30","date_modify":"2018-10-30 19:47:30","date_publish":"2016-05-30 17:11:00","description":"Trump's latest attack on Judge Gonzalo P. Curiel raise doubts about his commitment to an independent judiciary.","filename":"data/vaneerConsumption/CanIndependentJudiciarySurvive.json","image_url":"https://media.breitbart.com/media/2016/05/Scales-of-justice-Yoshikazu-Tsuno.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_05_30__1540928850.html","title":"Can Independent Judiciary Survive?","title_page":"First Obama, Now Trump: Can Independent Judiciary Survive?","title_rss":"NULL","source_domain":"breitbart.com","text":"Presumptive Republican nominee Donald Trump reassured many doubting conservatives when he released his list of possible Supreme Court nominations earlier this month. But his latest attack on Judge Gonzalo P. Curiel — the federal judge presiding in the Trump University case — raises doubts about his commitment to judicial independence.\nThese doubts are pertinent, given that President Barack Obama has done more to harm the judiciary than any president since Franklin Delano Roosevelt tried to pack the Court in the 1930s.\nTrump told a rally in San Diego on Friday: “I have a judge who is a hater of Donald Trump, a hater. He’s a hater. His name is Gonzalo Curiel.” He also noted that the judge “happens to be, we believe, Mexican, which is great, I think that’s fine.”\nEarlier this year, Trump had said Judge Curiel could be biased against him in the fraud lawsuit regarding Trump University because he is Hispanic. (Judge Curiel recently ordered that sealed documents regarding Trump University be released to the media.)\nIt is generally unwise for a defendant in a lawsuit to question the integrity of the judge — certainly in ethnic or national terms. It is worse when a president, or presidential candidate, does it, because it suggests he or she lacks respect for the judiciary.\nBut Trump is not alone, of course. Earlier this year, a federal judge slammed Hillary Clinton’s former colleagues at the State Department for their “constantly shifting admissions” in refusing to provide Benghazi documents in response to a FOIA request. Throughout, she and her former department have treated Congress, the courts, and the law with contempt.\nAnd several days ago, a federal judge in Texas ordered Department of Justice lawyers to take ethics classes after misleading the court about the Obama administration’s compliance with his order to stop the implementation of so-called “executive amnesty” policies. The lawyers had, he said, committed misconduct that was “intentional, serious and material.”\nIt was not the first time the Obama administration had defied the courts. In 2011, a federal judge found the Obama administration in contempt of court for ignoring his order to halt a moratorium on offshore drilling in the Gulf of Mexico. And who can forget his humiliating, public rebuke of the Supreme Court itself?\nTrue, the American judiciary has been under assault long before Obama and Trump came along. After FDR, a new generation of liberal justices emerged with a tendency to approve sweeping federal powers, and to read liberal social values into the text of the Constitution.\nIn response, Republican presidents tried to appoint originalists, faithful to the Constitution and the limits of their powers. The left slandered those judges as apparatchiks in robes — which more aptly described their own appointees, and degraded the public image of the judiciary.\nWith the Obamacare and gay marriage decisions at the Supreme Court, where Republican appointees joined liberal justices in their activism, the public esteem of the judiciary fell even further.\nBut an independent judiciary remains America’s most important safeguard against the erosion of the Constitution, and against political and social chaos.\nThe damage Obama has done has been bad enough. And a list of names will not, by itself, solve the problem. The next president needs to lead by example in respecting the judiciary.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. His new e-book, Leadership Secrets of the Kings and Prophets: What the Bible’s Struggles Teach Us About Today, is on sale through Amazon Kindle Direct. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/politics/2016/05/30/judiciary-first-obama-now-trump-can-judiciary-survive/"}
