{"authors":[],"date_download":"2018-10-30 14:23:09","date_modify":"2018-10-30 14:23:09","date_publish":"2017-04-24 19:24:00","description":"A primer on Georgia's gun carry laws ahead of the 2017 NRA convention in Atlanta, where Donald Trump will be the keynote speaker.","filename":"data/vaneerConsumption/CanIcarrymyguninAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/21/Images/Trump%20at%20NRA.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_ce6f86bec2c8c1cfad23d0f23b648192__1540909389.html","title":"Can I carry my gun in Atlanta?","title_page":"NRA convention: Can I carry my gun in Atlanta?","title_rss":"NULL","source_domain":"ajc.com","text":"Some 80,000 people are expected in downtown Atlanta later this week for the National Rifle Association’s annual conference.\nIt shouldn’t be a shocker that many of them are likely to be lawfully armed and wanting to know where they can legally carry their gun.\nHere’s a rundown of what Georgia law allows and doesn’t allow:\nWho can carry? Georgia residents who have been issued a weapons carry license or anyone who is visiting Georgia with a reciprocal permit.\nThe NRA is a powerful political advocate for gun rights and formidable opponent of gun control laws. (www.accessatlanta.com)\nWhat’s a reciprocal permit? Georgia has agreements with 32 states to recognize weapons carry licenses issued by those states (and vice-versa). Those states are Alabama, Alaska, Arkansas, Arizona, Colorado, Florida, Idaho, Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine, Michigan, Mississippi, Missouri, Montana, New Hampshire, North Carolina, North Dakota, Ohio, Oklahoma, Pennsylvania, South Carolina, South Dakota, Tennessee, Texas, Utah, Virginia, West Virginia, Wisconsin and Wyoming.\nI’m a Georgia resident but don’t have a permit. How do I get one? In Georgia, county probate courts issue firearms licenses to state residents who are at least 21 years old, provided they consent to be fingerprinted and pass a criminal background check. Certain other exemptions or restrictions may apply. This is not, however, a quick process. If you have never had a weapons carry license before, the process may take more than a month.\nIf I want to go eat or get a drink outside the convention, can I carry a gun into a restaurant or bar? Yes. However, Georgia law allows a restaurant or bar owner to ask you to leave if they do not want you to carry in their establishment. The best way to avoid a problem is to ask before you are seated.\nWhat if I want to go to church service on Sunday? License holders may carry their guns into a church or religious building, but only with permission from the church.\nCan I carry at Hartsfield-Jackson Atlanta International Airport? Yes, in what are considered “non-secure” portions of the main terminals. You are not allowed to carry past the TSA security checkpoints or in the concourses.\nCan I carry while attending the convention itself? Yes. Firearms will be permitted in the Georgia World Congress Center and the Omni Atlanta Hotel at CNN Center. However, be mindful that no guns are allowed in other areas of the CNN including the food court and retail shops.\nWhat if I’m driving to the convention? Yes, you may carry in your car.\nWhat if I’m planning to ride MARTA to the convention? Yes, you may take your gun on the train if you are legally licensed to carry it. But the agency requests that you also have your license with you while carrying your weapon. Anyone found carrying a firearm without a license will receive a citation and have the firearm confiscated.\nAnything else I should know? State law currently bans guns from being carried on a public university or college campus. If you find yourself on one, you are legally allowed to store the gun in a locked compartment of your car in the parking lot. You may not carry on campus. State lawmakers earlier this year passed a bill that would allow guns on campus, but the bill is still pending before Gov. Nathan Deal.","url":"https://www.ajc.com/news/state--regional-govt--politics/primer-georgia-gun-carry-laws-ahead-the-nra-convention-atlanta/yR1c57D3vKJoX4nq5ZGxFI/"}
