{"authors":[],"date_download":"2018-10-30 01:21:43","date_modify":"2018-10-30 01:21:43","date_publish":"2018-07-26 00:05:41","description":null,"filename":"data/vaneerConsumption/CanKeithEllisonEnforcetheLawWithoutBias.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/Keith_Ellison_U.S._House_of_Representatives_from_Minnesotas_5th_district_02.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862503.html","title":"Can Keith Ellison Enforce the Law Without Bias?","title_page":"Can Keith Ellison Enforce the Law Without Bias?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Congressman Keith Ellison (D) lost his cool when confronted on his association with Nation of Islam Leader Louis Farrakhan, Ellison’s former employer. Farrakhan has a long and well-documented history of bigotry, which Ellison refused to admit. Particularly given Ellison is a recently announced candidate for Minnesota Attorney General, this should raise red flags.\nEllison has successfully climbed the political ladder as a legislator and is now the Deputy Chair of the Democratic National Committee. However, an attorney general is expected to enforce the law fairly — even against people who are friends or supporters. It is vital for law-enforcement officials to avoid even the appearance of impropriety.\nEllison is one of only two Muslim members of Congress, and he has gone the extra mile to establish relationships with the American Muslim community. This, by itself, is admirable. But while the majority of American Muslims are good citizens and fine neighbors, others are criminals, terror financiers, or otherwise lawbreakers. Ellison has repeatedly turned a blind-eye to radicalism, and even criminality, involving his friends and supporters.\nConsider Ellison’s relationships with the Council on American Islamic Relations (CAIR) and the Islamic Society of North America (ISNA). Both organizations were named as unindicted co-conspirators in the Holy Land Foundation terror finance case, the largest terror finance case in U.S. history. The case resulted in five individuals getting long prison sentences for financing the U.S.-designated terrorist group Hamas. And Judge Jorge Solis, who tried the case, stated that there was “ample evidence” to establish the association of CAIR and ISNA to Hamas.\nYet Ellison has a long and profitable association with both CAIR, which Ellison has called “a wonderful, aggressive, assertive organization,” and ISNA. Prominent individuals from those organizations have donated over $150,000 to his campaigns. For his part, Ellison has been a featured speaker for CAIR at least 11 times. Notably, the FBI refuses to liaise with CAIR, as it remained unconvinced that CAIR has actually severed all connections with Hamas as CAIR claims to have done.\nSimilarly, Ellison’s 16-day pilgrimage to Mecca was funded by the Muslim American Society (MAS), described by federal prosecutors as an “overt arm of the Muslim Brotherhood,” which in turn is the parent organization of Hamas. Ellison has also received at least $9,000 in donations from senior leaders of the SAAR Network, a group of firms connected to the Brotherhood that were suspected of laundering money to Islamic Jihad and probably Hamas as well — though the investigation was halted for political reasons. (One SAAR-Network alumnus was later convicted of a plot to assassinate a Saudi prince.) Ellison also personally advocated for Sami al-Arian, a confessed financier of Palestinian Islamic Jihad and a collaborator with the SAAR Network.\nIt should be noted there is no credible reason to believe Ellison himself is sympathetic to terrorism, violent jihad, or anything like it. It is to suggest, however, that he has trouble showing objectivity to those he views as being on his side — religiously, politically, or otherwise. Indeed, at a Congressional hearing in 2011, Ellison reacted emotionally simply to the idea that there is a radical trend going through Islam that deserves a closer look — even though it can be objectively noted that at present, Islamic extremism drives the majority of terrorism in the world.\nDuring Ellison’s run for Chairman of the DNC, the Anti-Defamation League opposed his candidacy out of concerns over his belief, stated as recently as 2010, that American foreign policy in the Middle East is determined by Israeli interests. This canard is strikingly similar to age-old conspiracies about Jewish control of the government. And it is worth keeping in mind that one of the roles of the Minnesota Attorney General is to give state prosecutors bias-crime training.\nTimeless legal principles require law-enforcement attorneys to recuse themselves from any case “where [they have] a personal bias or prejudice concerning a party.” Minnesotans can and will decide who will best represent them in the office of Attorney General. But Minnesota deserves an Attorney General who will enforce the law, no matter who is violating it.\nCliff Smith is the Washington Project Director for the Middle East Forum. Oren Litwin is the Islamist Money in Politics research fellow for Islamist Watch, a program of the Middle East Forum.","url":"https://spectator.org/can-keith-ellison-enforce-the-law-without-bias/"}
