{"authors":["John Mcgarry For The Scottish Daily Mail"],"date_download":"2018-10-22 21:02:22","date_modify":"2018-10-22 21:02:22","date_publish":"2017-03-16 00:25:00","description":"When you've shipped ten goals without reply over two games, maintaining belief and morale is the sternest test of a manager's amateur psychology skills.","filename":"data/vaneerConsumption/CanningHamiltoncantmakeiteasyfornewRangersboss.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/3E4B162000000578-0-image-a-43_1489623594753.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4318404_Canning-Hamilton-t-make-easy-new-Rangers-boss_1540242142.html","title":"Canning: Hamilton can't make it easy for new Rangers boss","title_page":"Canning: Hamilton can't make it easy for new Rangers boss | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"When you've shipped ten goals without reply over two games, maintaining belief and morale is the sternest test of a manager's amateur psychology skills.\nFor Martin Canning, however, the solution to the hammerings Hamilton have endured in successive weeks - 6-0 at Ibrox and 4-0 at Tynecastle - is much more straightforward.\nHis frank assessment is that individual errors, as opposed to a collective mental collapse, are to blame for what's gone so horribly wrong.\nHamilton player-manager Martin Canning takes training ahead of his side's trip to Rangers\nAhead of Saturday's return trip to Ibrox, where Rangers will be looking to impress new boss Pedro Caixinha, Canning feels his players only need to look at the basic facts to realise their problems come with a ready-made solution.\n'If you break the games down, six of the ten goals have come from set pieces, one from a penalty and one from us putting them straight through on goal,' he said. 'We've only lost two goals from open play. So it's not like we're getting battered from pillar to post and conceding chance after chance.\n'The game last Saturday (against Hearts), in the first half they had seven attempts and in five of those we were in safe possession of the ball but gave it away and got counter-attacked. So it's not like we're sitting in and getting nowhere near the ball – getting a doing if you like.\n'In the four games against the top four in the league, we've conceded one goal from open play against Celtic and none against Aberdeen so that's three goals from open play against the top four teams.\nCanning has blamed individual errors for his side conceding 10 goals in their last two matches\nSeason at a glance Live tables\nFixtures\nScores Scottish Premiership\nPremier League\nChampionship\nLeague One\nLeague Two\nScottish Premiership\nScottish Div 1\nScottish Div 2\nScottish Div 3\nLigue 1\nSerie A\nLa Liga\nBundesliga\n'It's simple fixes. It's not as if we've got to go from one to 11 and fix every part of the game. We just need to defend set pieces, not give away stupid free kicks and not pass the ball straight to them and put them clear on goal.'\nThis weekend, Accies are not only reunited with an opponent who stuck six past them in the Scottish Cup, they face the added factor of the lift a new manager tends to gives teams.\nFor Caixinha's first game at Ibrox, it's hard not to view Accies as having the walk-on part in a high-octane movie.\nYet that was also the script last August when Mark Warburton's side tackled their first game back in the top flight.\nHamilton's deserved 1-1 draw was a reminder that not every party goes as planned.\n'It was a big atmosphere on the first day of the season,' Canning recalled. 'A full stadium with everybody getting right behind their team.\nHamilton travel to Ibrox on Saturday as Pedro Caixinha takes charge of his first Rangers game\n'It will be similar again so we need to deal with that, be organised and produce better than the last game.\n'They'll get a lift from getting a new guy in so we need to cope with that. What we can't do is concede sloppy goals. You've got to make sure you're organised and disciplined in the basics.'\nCaixinha's arrival offers up obvious questions for Accies. While few new managers are minded to make radical changes in the middle of a season, the Portuguese is likely to make subtle alterations both in terms of personnel and tactics.\nLast time the two sides met, Martyn Waghorn scored on the way to a 6-0 win for the Gers\n'I'm pretty sure he'll be doing a lot of work,' said Canning. 'He'll be speaking to a lot of people and asking questions of the players who were involved a couple of weeks ago.\n'You've got the problem that it's a new manager and you don't really know how he's going to set up, but the modern world has platforms that allow you to watch games from his previous clubs to see how they played.\n'That's not to say he'll do the same thing here. Yes, there's a little bit of a question mark over what he'll do and what he thinks is the best way to get the most out of the players he's got.'","url":"https://www.dailymail.co.uk/sport/football/article-4318404/Canning-Hamilton-t-make-easy-new-Rangers-boss.html"}
