{"authors":[],"date_download":"2018-10-30 18:51:18","date_modify":"2018-10-30 18:51:18","date_publish":"2015-06-16 18:53:06","description":"After a series of accidents, federal regulators have ordered a Georgia trucking company to shut down because it poses a potentially deadly risk to its drivers and the public.","filename":"data/vaneerConsumption/Canolaoilspillleadstotruckingfirmshutdown.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_canola-oil-spill-leads-trucking-firm-shutdown__1540925478.html","title":"Canola oil spill leads to trucking firm shutdown","title_page":"Canola oil spill leads to trucking firm shutdown","title_rss":"NULL","source_domain":"ajc.com","text":"After a series of accidents, federal regulators have ordered a Georgia trucking company to shut down because it poses a potentially deadly risk to its drivers and the public.\nPrudential Carriers, based in Hampton, has had repeated, egregious violations of safety standards, according to the order by the Federal Motor Carrier Safety Administration.\nAn investigation was triggered after a May 12 incident, in which a truck leaked more than 1,000 gallons of canola oil for miles along Interstate 75, causing four separate vehicle crashes in Bibb County. The driver reported the leak to the company but was told to drive back to Atlanta from Macon.\nLaw enforcement officers tracking the spill caught up with the driver and arrested him.\nThe order also cites an October accident in Douglas County, in which a Prudential driver pulled over on the right shoulder of I-20 because of overheated brakes. “While waiting for the brakes to cool, the driver fell asleep and another vehicle collided with the Prudential vehicle. The Prudential driver was cited for parking in a prohibited place,” the order states.\nThe investigation found that trucks Prudential operates were not systematically inspected, repaired and maintained; the company failed to ensure drivers complied with regulations to prevent fatigued driving; it allowed unqualified drivers to operate vehicles; and it failed to comply with mandated random alcohol and controlled substances testing of drivers.\nThe order also accuses Prudential of falsifying records.\n“Prudential’s operations are reckless, with almost nonexistent safety management oversight of its vehicles, drivers and operations,” the order says.\nPrudential operates out of the house of its president, Sitha Svay. He could not be reached for comment Tuesday.\nThe company employs 28 drivers, with 21 who are owner-operators, though the order notes that Prudential could not provide federal safety investigators with an accurate list of drivers employed in the past year, nor could it identify the vehicles it operated or used during that time. The order said the company leases 27 truck tractors and 14 trailers and owns 4 tractors and 13 trailers.","url":"https://www.ajc.com/business/canola-oil-spill-leads-trucking-firm-shutdown/wURjnauRAWtYMjv5gW83OI/"}
