{"authors":[],"date_download":"2018-10-30 14:16:51","date_modify":"2018-10-30 14:16:51","date_publish":"2018-06-20 00:00:00","description":null,"filename":"data/vaneerConsumption/CansomeonepleasetellJohnMcCainhecanresignnow.json","image_url":"https://www.americanthinker.com/images/bucket/2018-06/206787.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2018_06_can_someone_please_tell_john_mccain_that_he_can_resign_now_1540909011.html","title":"Can someone please tell John McCain he can resign now?","title_page":"Can someone please tell John McCain he can resign now?","title_rss":"NULL","source_domain":"americanthinker.com","text":"Can someone please tell John McCain he can resign now?\nJune 1 has come and passed. Everyone can breathe a sigh of relief. Under Arizona law, if John McCain had vacated office before June 1 (\"vacated\" meaning \"died\"), there would be a special election in November to replace him. But having passed this June deadline, if McCain resigns, he can be replaced by an appointee of the governor of Arizona, Doug Ducey, a conservative Republican, and this appointee will serve until 2020.\nThe problem is, McCain hasn't resigned. McCain has been so ill that he hasn't been seen in the Senate for months. He has missed countless votes. Arizona is without half its representation in the Senate, and that's only if you count Jeff Flake. So why hasn't McCain resigned? The answer is unclear, but it may boil down to one word: Cindy. McCain wants his wife, Cindy McCain, to take his place. McCain may feel that he is royalty and his Senate seat is like a throne that can be passed down to relatives. One source close to the McCain family said supporters of the senator have quietly let Gov. Ducey know Cindy is the choice of \"Team McCain.\"\nCindy McCain. My guess is that Ducey doesn't want to appoint Cindy, and without a guarantee that Cindy will be appointed, McCain is refusing to resign. Out of spite, he's leaving the people of Arizona without full representation in the Senate. In a tight 51-49 GOP-controlled body, the absence of one senator is critical on many votes. McCain apparently does not care. People criticize Supreme Court justices who stay in office long past their prime. But at least they show up for work or pretend to work and have their clerks write opinions for them. In the Senate, aides can't vote for senators, and so McCain can't even pretend to be attentive to his job as justices can. At this point, perhaps McCain will try to wait out the governor to see if he can get his way. If he does, I don't expect Cindy to be any better than John or Meghan. Ironically, if McCain did resign, it's possible we'd \"flip\" the seat and get a solid Republican. Remember that McCain was the deciding vote against the partial repeal of Obamacare and tried to torpedo Gina Haspel for CIA director because of his personal experiences in the Hanoi Hilton. It seems McCain wants to spite Republicans until the very end. Ed Straker is the senior writer at Newsmachete.com. Photo credit: Gage Skidmore via Flickr.","url":"https://www.americanthinker.com/blog/2018/06/can_someone_please_tell_john_mccain_that_he_can_resign_now.html"}
