{"authors":[],"date_download":"2018-10-22 21:16:47","date_modify":"2018-10-22 21:16:47","date_publish":"2016-07-26 00:00:00","description":"As TV dramas get better and better, publishers are getting into the game with serialized fiction. Some are even referring to what they publish as \"episodes\" and \"seasons\" rather than \"books.\"","filename":"data/vaneerConsumption/CanSerializedFictionConvertBingeWatchersIntoBingeReaders.json","image_url":"https://media.npr.org/assets/img/2016/06/30/eightislands_wide-e1a5e402dddee76f6bfd18e71563ae30478756b8.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=484171813_1540243007.html","title":"Can Serialized Fiction Convert Binge Watchers Into Binge Readers?","title_page":"Can Serialized Fiction Convert Binge Watchers Into Binge Readers? : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ROBERT SIEGEL, HOST:\nOn-demand streaming has made binge TV watching popular. You probably know someone who has stayed up for hours watching episodes of a favorite TV show back-to-back. Well, that behavior has inspired some book publishers. They want to convert binge TV watchers into binge readers with serialized books. NPR's Lynn Neary reports.\nLYNN NEARY, BYLINE: Serialized books have a long history in publishing. Charles Dickens famously released many of his novels in serial form.\nSEAN MCDONALD: We love to think about harkening back to the way Dickens was published and people waiting anxiously at the dock for the new installments to arrive.\nNEARY: Sean McDonald is a publisher and editor at Farrar, Straus and Giroux, which is known for its serious, award-winning novels, not so much for serialized fiction. But McDonald says in 2014, FSG tried an experiment. They published the three books in the \"Southern Reach\" trilogy on a much faster timetable than usual. All three were released in less than a year. That coincided with another cultural phenomenon.\nMCDONALD: A lot was going on with television getting taken much more seriously as an art form. And that sense of episodic storytelling was being talked about a lot. And it felt like this was a way for us to engage with that and, you know, not to have books be left out of it, but actually to play a good and serious role in it.\nNEARY: This year, FSG is trying something similar - publishing \"The Tale Of Shikanoko\" in four parts, over six months. Publishing this way, says McDonald, feels very much like delivering a season of programming.\nJulian Yap and Molly Barton take it a step further. They've just launched a company called Serial Box - that's serial with an S - which aims to be HBO for readers.\nMOLLY BARTON: Well, we're not just chopping up novels and sending out chapters.\nNEARY: Molly Barton doesn't talk in terms of publishing books. Serial Box releases what they call episodes over a 10 to 16-week season. Each season is written by a team of writers.\nBARTON: We're committed to having a new season every year of the serials. And so - you know, like \"Game Of Thrones.\" And that's what is possible given the way that we're working with multiple writers.\nNEARY: The process, says Barton, is directly modeled on writing for a TV series.\nBARTON: We begin with the equivalent of a showrunner and three or four supporting writers. And we all get together and break the story and talk through the characters and what's going to happen over the course of the first season. And we think about future seasons, as well.\nNEARY: Serial Box launched officially this month with four serials currently available and a fifth on the way. Subscribers can buy one serial at a time, in text or audio form, or they can buy a season pass. Each episode takes about 40 minutes to read, the same time as it takes to watch an average TV drama.\nJulian Yap says people do still love to read, but they don't have a lot of time.\nJULIAN YAP: There's a lot of data that people are reading more than ever. But they're also reading shorter than ever. And they have trouble fitting a whole novel into their lives. We wanted to produce fiction that fit into people's lives. So it was short episodes that you could read on your commute and back and finish that way, and serialize them so you could tell a longer story.\nJANE FRIEDMAN: I don't think that people really consume books in the same way that they consume TV shows.\nNEARY: Jane Friedman teaches digital media and publishing at the University of Virginia. Friedman agrees that people's reading habits are changing, but she's not convinced binge reading is anything like binge watching.\nFRIEDMAN: We always have a mobile device with us. And so we're reading in short bursts of five to 10 minutes, you know, while we're waiting in line. And so a series is really ideal for that type of a reading situation. But that's a very different dynamic than, say, the - you know, the binge watching TV series. In fact, reading in five to 10-minute bursts is distinctly not intriguing.\nNEARY: Friedman says interest in serialized fiction has increased since the advent of digital publishing, but it's hard to make money out of it. Not surprisingly, Amazon has had the most successful venture so far. And even it has pulled back, says Friedman.\nFRIEDMAN: Most authors I talk to and even Amazon has said that every time they do a serial, they make as - you know, at least half their money on - than selling the whole thing together as a bundle.\nNEARY: But the founders of Serial Box are confident that serialized fiction will appeal to both dedicated readers and TV watchers. And, of course, if you do binge read an entire season of episodes, well, congratulations. You've just read a book. Lynn Neary, NPR News, Washington.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=484171813"}
