{"authors":["Angus Chen"],"date_download":"2018-10-22 21:59:59","date_modify":"2018-10-22 21:59:59","date_publish":"2016-02-16 00:00:00","description":"The #catmageddon ad pretty much blew the doors off the Grammys. Now the question is whether the fact that secondhand smoke can cause cancer in cats will persuade young adults to stop smoking.","filename":"data/vaneerConsumption/CanSmokingKillCatVideosABoldPublicHealthAdSaysYes.json","image_url":"https://media.npr.org/assets/img/2016/02/16/catmaggedon_wide-3bdb5340eab45708bdc4c8b5580c50d981e4121d.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2016_02_16_466956513_can-smoking-kill-cat-videos-a-bold-public-health-ad-says-yes_1540245599.html","title":"Can Smoking Kill Cat Videos? A Bold Public Health Ad Says Yes","title_page":"Can Smoking Kill Cat Videos? A Bold Public Health Ad Says Yes : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Can Smoking Kill Cat Videos? A Bold Public Health Ad Says Yes\nEnlarge this image via Youtube via Youtube\nAfter the Grammys, social media were awash in Hamilton and Kendrick Lamar shares, but cats took the Web like they owned it. In a 30-second ad, house cats sent a chilling memo to smokers: The health of the Internet is at stake.\nThe montage of cat videos (cat riding Roomba, cat weeping silently) and secondhand smoke facts put forth the message that cats living with smokers are twice as likely to get cancer. Ergo smoking kills cats. And if there are no more cats? Well, I don't know if I would want to live in an Internet with no cats.\nDespite this somewhat faulty logic (house cats will not go extinct from secondhand smoke), people have been tweeting the campaign using the panic-inducing #catmageddon tag.\nIt's a departure from more traditional public health campaigns, says Sherry Emery, the director of the University of Illinois, Chicago's Health Media Collaboratory. \"It's nothing like any anti-smoking ad that's been out,\" Emery says. \"This is the first time I think [anti-smoking campaigns] have gone after the health effects for animals. And people care so much about their animals.\"\nThat was a smart move by the Truth Initiative, Emery says. The campaign targets teens and young adults who don't really think about health consequences in the same way that older, more seasoned smokers might. \"Sometimes people don't care enough about themselves. They do care about their pets,\" she says. \"And cat videos, of course. They capitalize on this cultural phenomenon where people just love cat videos.\"\nYouTube\nIt's about time cats got into the anti-tobacco-ad arena, says John Pierce, a professor emeritus of cancer research at the University of California, San Diego. \"It's well overdue,\" he says. \"There's a long history of using animals in advertising. Think of the chameleon promoting alcohol or that camel\" — the one that's been peddling cigarettes for decades. This ad, in some ways, levels the arsenal a little bit.\nAnd the Truth Initiative, which is funded by the 1998 settlement of a massive lawsuit filed against tobacco companies by 46 states, sets out to target young people. \"We know that 60 percent of [young adults] have a pet, and 20 percent say they want a pet. And they do love watching their cat videos,\" says Truth Initiative CEO Robin Koval. According to her, #catmageddon was an engineered success.\nIt was also a daring gambit, according to Emery. \"I think a lot of people in public health might think it's a risky strategy just because it's so novel. It's talking about pets and not humans,\" she says. But Truth is no stranger to controversy. In 2014, the Truth Initiative ran an ad on the MTV music video awards that showed paparazzi shots of celebrities smoking and accused them of being \"unpaid spokespeople\" for the tobacco industry. \"They got this huge backlash,\" Emery says, for a shot of Zayn Malik from One Direction.\nSo this commercial keeps popping up on my YouTube and so I've decided to pick a date and quit smoking. I'm sure it is... Posted by Cassandra Marie on Monday, February 15, 2016\nBut both Pierce and Emery say \"smoking = no cats = no cat videos\" is a strategy that has already worked. The point of anti-tobacco campaigns is to get people talking. And they're talking about tobacco, Pierce says. \"It's stimulated a conversation. It's about the cats. It's also about the smoking.\"\nAngus Chen is on Twitter @angRchen","url":"https://www.npr.org/sections/health-shots/2016/02/16/466956513/can-smoking-kill-cat-videos-a-bold-public-health-ad-says-yes"}
