{"authors":["Associated Press","Dailymail.Com Reporter"],"date_download":"2018-10-22 23:23:39","date_modify":"2018-10-22 23:23:39","date_publish":"2016-01-29 11:05:31","description":"A Georgia grand jury has indicted Olivia Smith on charges of malice murder and felony murder in the November stabbing death of 17-year-old Abbey Hebert.","filename":"data/vaneerConsumption/Cantongirlindictedonmurderchargesafterstabbingstepcousintodeath.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B3078000000578-0-image-a-56_1454081712423.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422557_18-year-old-woman-indicted-stabbing-death-step-cousin_1540250619.html","title":"Canton girl indicted on murder charges 'after stabbing step-cousin to death'","title_page":"Canton girl indicted on murder charges 'after stabbing step-cousin to death' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Georgia teenager accused of fatally stabbing her 17-year-old step-cousin during a sleepover in suburban Atlanta last year has been indicted on four charges, including malice murder and felony murder.\nOlivia Smith, 18, of Canton, was indicted Thursday by a Cobb County grand jury in connection with the November 14 slaying of Abbey Hebert.\nAccording to a search warrant, Smith admitted to stabbing Hebert with a kitchen knife after the two smoked marijuana and got into an argument while having breakfast together at the victim's home in Acworth.\nAccused killer: Olivia Smith (left), 18, has been indicted on charges of malice murder and felony murder in the November 2015 stabbing death of her step-cousin, of 17-year-old Abbey Herbert (right)\nSmith, pictured in court last month, allegedly told neighbors that God made her stab Herbert\nPolice say Smith stabbed Hebert inside the house, then chased her outside, where a witness saw the 17-year-old get stabbed multiple times in the front yard.\nDetective Matt Fuller testified in December that Smith told a neighbor that God had 'made her' kill Herbert.\nSmith's attorney says his client, who has been jailed since her arrest, is very remorseful. The results of her toxicology tests are still pending, reported the station 11 Alive Atlanta.\nSmith and Herbert were close friends, as well as step-cousins. According to police, on the eve of the stabbing, the pair attended a high school football game together and then went to a party, followed by a sleepover at the victim's home that ended with the 18-year-old repeatedly plunging a knife into her younger relative.\nDetective Fuller said Smith told police that she had smoked what she believed was marijuana, and she had a reaction to the drug.\nThe investigator told the court that Smith had had a similar reaction before.\nBFFs: Smith (left) and Herbert (right) were close friends, as well as step-cousins, and had attended a football game and party together on the eve of the killing\nThe 17-year-old girl was stabbed multiple times in the front yard of her family's home in Georgia. The killing was preceded by an argument with Smith\n'It was basically when she smoked marijuana, she had smoked it with Abbey one other time and both times she had an overwhelming feeling of God coming to her and maybe we shouldn't be doing this. That may have been what started the argument,' Fuller said.\nHebert's father, Steve Hebert, said after last month's hearing that the alleged marijuana doesn't change the circumstances of his daughter's death.\n'Olivia is here; Abbey is not,' he told KHOU.\nIn November, Mr Hebert told NBC that Smith was 'obsessed' with his daughter.\nSmith posted numerous photos of herself with Hebert on her Facebook page, and on November 12 proclaimed her love for Abbey on Twitter. The 17-year-old tweeted her back that she loved her more than the world.\nThe girls are step-cousins because after Hebert's parents divorced 12 years ago, her mother remarried, and her step-father's brother is Smith's father.","url":"https://www.dailymail.co.uk/news/article-3422557/18-year-old-woman-indicted-stabbing-death-step-cousin.html"}
