{"authors":[],"date_download":"2018-10-22 22:52:59","date_modify":"2018-10-22 22:52:59","date_publish":"2014-06-11 03:06:32","description":"U.S. Sen. Lindsey Graham both won and lost on Tuesday.","filename":"data/vaneerConsumption/CantorLossOvershadowsGrahamVictoryMessage.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_15/308676/140408-graham-545a_da2f4c0d63b50afdc33cc766bcf8bee0.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_elections_cantor-loss-overshadows-graham-victory-message-n128046_1540248779.html","title":"Cantor Loss Overshadows Graham Victory Message","title_page":"Cantor Loss Overshadows Graham Victory Message","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nCOLUMBIA, South Carolina - U.S. Sen. Lindsey Graham both won and lost on Tuesday.\nHe cruised to victory in his own primary, joining a growing list of GOP senators who have survived challenges from anti-establishment conservatives.\nBut Graham wanted his victory, against six conservative challengers who claimed the longtime senator is too moderate, to send a message to the broader Republican Party about the importance of accepting leaders willing to compromise and work with Democrats.\nThat message was decidedly undercut by the loss of House Majority Leader Eric Cantor in Virginia, who like Graham had been urging the GOP to update its party platform, particularly on immigration, and highlight a more positive message.\n“Here’s what South Carolina Republicans are saying tonight, I can’t speak for other Republicans, ‘we want Lindsey to fix this,” he said, referring to immigration reform during his victory speech at a hotel ballroom here.\nHis nod to “other Republicans,” seemed an acknowledgment of the defeat of Cantor, who he did not specifically name.\n“I can’t speak to that district in Virginia,” he said in an brief interview, but noted he won with his pro-immigration reform message even as “South Carolina is a pretty red state.”\nBy getting nearly 60 percent of the vote, Graham avoided a potential runoff and has a clear path to re-election.\nGraham has been one of the most vocal Republicans in criticizing the growing influence of the Tea Party on the GOP. But his victory over a group of underfunded challengers is unlikely to match the symbolism of the equally cash-short campaign of economics professor Dave Bart defeating Cantor with a Tea Party-style message of small government and strong conservatism.\n“I want a positive agenda, laid out by the Republican Party for the American people,” he said in his speech, calling for a Contract with America-style document from the party ahead of this fall’s elections.\nGraham’s closest challenger here, state senator Lee Bright, finished with more than 14 percent, according to early estimates.\nGraham’s victory comes on the heels of wins by fellow senator Republicans John Cornyn (Texas) and Mitch McConnell (Kentucky) over opponents who linked themselves with the Tea Party, as well as the successes of more moderate Republican U.S. candidates in states like Georgia and North Carolina.\nThese wins could help the Republican Party capture the Senate this fall. Unlike in 2010 and 2012, when conservative candidates won the Republican nomination in several states and then made costly mistakes that lead to defeat in the general election, the Republicans have so far largely nominated politically-safe candidates.\nChris McDaniel, the Tea Party-funded candidate in Mississippi, could defeat incumbent U.S. Sen. Thad Cochran in a runoff on June 22. But the state senator would still be the favorite to retain the Senate for Republicans because of the deep conservatism of Mississippi.","url":"https://www.nbcnews.com/politics/elections/cantor-loss-overshadows-graham-victory-message-n128046"}
