{"authors":["Flora Drury For Mailonline"],"date_download":"2018-10-23 03:39:11","date_modify":"2018-10-23 03:39:11","date_publish":"2016-01-28 19:09:43","description":"So far, four airlines are offering refunds to pregnant women travelling to affected countries, while Australia's Olympic team has said pregnant athletes need to consider the risks 'very carefully'.","filename":"data/vaneerConsumption/CantheRioOlympics2016surviveBrazilsZikavirusoutbreak.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/10/30B1139900000578-0-image-a-5_1454062868902.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421467_Can-Olympics-survive-Brazil-s-Zika-outbreak-Crisis-female-spectators-ATHLETES-warned-not-organisers-rely-dry-season-kill-mosquitoes_1540265951.html","title":"Can the Rio Olympics 2016 survive Brazil's Zika virus outbreak?","title_page":"Can the Rio Olympics 2016 survive Brazil's Zika virus outbreak? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rio's Olympics are on the verge of disaster as fear grows over the Zika virus, which has left more than 4,000 newborns with shrunken heads.\nFemale spectators and even athletes of childbearing age are being warned by countries and medical professionals around the world to reconsider their plans to travel to Brazil for fear of what could happen to their unborn children after the country was overrun by the mosquito-borne disease.\nRussia and Australian officials have both raised fears for those women preparing to compete in August's Games, while numerous airlines around the world are offering pregnant women the chance to swap or refund their tickets to avoid travelling to affected areas - of which Brazil is the worst.\nScroll down for video\nThe Brazilian government is trying to get the outbreak of the Zika virus under control ahead of the Games\nWomen of child bearing age are being warned to consider trips to Brazil 'carefully' ahead of the Olympic Games this August. Pictured: Geovane Silva holds his son Gustavo Henrique, who has microcephaly - one of more than 4,000 babies to be born with the condition in the last 12 months\nThose organising Rio's Olympics are keen to play down the risks, and say they will have it under control\nThe condition, which cause babies to have unusually small heads, is being linked to the Zika virus\nThe Brazilian government has vowed to do everything in its power to stop the spread of the mosquito-borne disease, including sending out municipal workers with insecticide (pictured) to kill off the insects\nThe offers of refunds and dire warnings will put added pressure on a country which has already been struggling under the strain of preparing for the upcoming Games - especially considering the mosquito thrives in puddles, nooks and crannies common in host city Rio.\n'It is the perfect set-up for proliferation,' said Isaac Bogoch, a tropical infectious disease specialist at Toronto General Hospital, who published a scientific paper predicting Zika's rapid spread. 'It can keep spreading until we find a way to contain the virus or keep the mosquitoes from transmitting it.'\nIn fact, medical professionals have warned that the virus has 'explosive pandemic potential', and could spread around the world infecting as many as four million people.\nAnd currently, there is no vaccine to afford any of the potential victims any protection - while wiping out the mosquitoes spreading the virus is proving almost impossible.\nThe combination of factors led Marcelo Castro, Brazil's health minister, to admit this week: 'We are losing the battle in a big way.'\nBut organisers are keen to stress the 2016 Games will go ahead - because they remain convinced Brazil will get the outbreak under control by the time the Games begin.\nThe country is now throwing everything it has at combating the problem. Ahead of this week's Carnival, more than 3,000 municipal health agents have been out on the city's streets, trying desperately to rid the city of its mosquito hotbeds.\nThey will be paying particular attention to Carnival and Olympic venues, which will be inspected daily during the big events.\nBut it seems the government's main hope for gaining control of the virus ahead of the Opening Ceremony in six months lies in something they have no control over whatsoever: the weather.\nAhead of this week's Carnival, more than 3,000 municipal health agents have been out on the city's streets, trying desperately to rid the city of its mosquito hotbeds\nThey will be paying particular attention to Carnival and Olympic venues, which will be inspected daily during the big events\nBut the fact remains there is no known prevention method - aside from avoiding mosquito bites - and the Aedes aegypti mosquito is notoriously adaptive to any conditions\nBrazil's winter falls during the Games, which begin in August, when mosquitoes are less prevalent due to the 'dryer, cooler climate'.\nIS RIO'S OLYMPIC DREAM TURNING INTO A GIGANTIC NIGHTMARE? When the world descends on Rio in less than 200 days it will become the first South American city to host the Olympic Games. But this is a Games which risks going down in history as one plagued by problems - and not only the Zika outbreak. First, there were the people who lost their homes to make way for the brand-new Olympic park, forcibly evicted from one of the city's favela. Then there was Associated Press' analysis of the Olympic and Paralympic venues due to be used for swimming and boating, which found dangerously high levels of viruses and bacteria from human sewage in the water. Then there were the spiraling costs of the Games: the organising committee announced they needed to make cuts in October, to avoid going 10 per cent over its £1.3bn budget.\nBut the fact remains there is no known prevention method - aside from avoiding mosquito bites - and the aedes aegypti mosquito is notoriously adaptive to any conditions.\nYet the World Health Organisation's deputy chief Bruce Aylward said it was 'very, very unlikely' the UN agency would issue warnings against travel to Brazil, including for the Games, while International Olympic Committee head Thomas Bach said it will 'do everything' in its power to keep everyone safe from the virus.\nIt included ridding the area of any stagnant water, to prevent any mosquitoes gathering near the hundreds of thousands of spectators expected to descend on the city.\nHowever, it may be of little use should the virus - which has little affect on anyone other than babies in the womb - find a different way to spread.\nThe US Centers for Disease Control and Prevention principal deputy director Anne Schuchat said there had been one reported case of Zika virus 'through possible sexual transmission'.\n'In another case, Zika virus was found in semen about two weeks after a man had symptoms with Zika virus infection, so that sort of gives you the biologic plausibility of spread.'\nSchuchat added that 'the science is very clear to date that Zika virus is primarily transmitted to people through the bite of an infected mosquito. So that is really where we are putting the emphasis right now.'\nThe Australian Olympic team is advising its athletes to educate themselves before deciding to travel to Rio in August, while airlines are offering refunds on tickets to affected countries. Pictured: Gleyse Kelly da Silva holds her daughter Maria Giovanna as she sleeps in their house in Recife, Pernambuco state, Brazil\nBut WHO's deputy chief it was 'very unlikely' the UN agency would issue warnings against travel to Brazil\nWorryingly, the US Centers for Disease Control and Prevention principal deputy director Anne Schuchat said there had been one reported case of Zika virus 'through possible sexual transmission'\nZika virus is common in parts of Africa and South East Asia, but since 2007 there have been various outbreaks outside of the disease's comfort zone. It spread to South America in 2014, before reaching Mexico and the Caribbean last year. The first US case was reported in Texas at the start of January\nAll this is starting to make not only the spectators, but Olympic teams nervous about travelling to Rio.\nRussia's Sports Minister Vitaly Mutko expressed fears that athletes were particularly vulnerable to infectious diseases as heavy training reduces their immune system.\n'We are employing all protective measures,' he told a local broadcaster.\nThe Australian Olympic Committee has become the first to openly admit to concerns over the virus.\nThe team's medical director David Hughes told news.com.au: 'All females of child-bearing age need to be aware of the specific risks of microcephaly in newborns, should the mother become infected during pregnancy.\n'Following the recently updated DFAT guidelines, any team members who are pregnant at the time of the Games need to consider the risks very carefully before deciding whether to proceed with travel to Brazil.'\nWhether more teams will follow in speaking out about the potential threat to pregnant women and their unborn children is yet to be seen.\nThe British Olympic Association spokesperson said they were watching the situation closely.\n'As part of Team GB's overall planning, our medical team has been liaising with specialists at the London School of Tropical Medicine, to ensure that team members are given the most up-to-date travel medicine advice, which includes information on bite prevention strategies.\n'This information has already been shared with all sports and it will be continually updated prior to departure for the Olympic Games.'\nPatrick Sandusky, spokesman for the United States Olympics Committee, also said they were montioring the situation, telling the Washington Post they were also 'taking steps to ensure that our delegation and those affiliated with Team USA are aware of the CDC’s recommendations regarding travel to Brazil'.\nIt is hoped that the virus will be brought under control during the Olympics, partly thanks to the 'dryer, cooler climate' which is not ideal weather for mosquitoes\nIn the meantime, they will continue to fumigate and ensure there is no stagnant water in the area\nBach said the IOC is in 'close cooperation' with Brazilian authorities and the World Health Organization, and he promised to have consultations with national Olympic committees on safety guidelines concerning the Zika outbreak by late Friday.\nDecisions over whether or not to attend the Games will be being made as the the World Health Organisation warned the disease had gone from a mild threat to one of alarming proportions, admitting up to four million people could be infected.\nWith concern over travel to Latin America spreading, two airlines in the region announced refund offers to pregnant women booked for travel.\nChilean-Brazilian airline Latam, the region's biggest, will refund or rebook expectant mothers with tickets to any of 22 countries or territories with outbreaks of the mosquito-borne virus, while Chilean company Sky will refund pregnant women with tickets to Brazil.\nUS carriers Delta and American Airlines have made similar offers.\nMeanwhile, France has urged women not to travel to French overseas territories in South America and the Caribbean.\nWHAT YOU NEED TO KNOW ABOUT ZIKA WHAT IS ZIKA? The Zika (ZEE'-ka) virus was first discovered in monkey in Uganda in 1947 - its name comes from the Zika forest where it was first discovered. It is native mainly to tropical Africa, with outbreaks in Southeast Asia and the Pacific Islands. It appeared in Brazil last year and has since been seen in many Latin American countries and Caribbean islands. HOW IS IT SPREAD? It is transmitted through bites from the same kind of mosquitoes that can spread other tropical diseases, like dengue fever, chikungunya and yellow fever. It is not known to spread from person to person. Investigators, though, are exploring the possibility that the virus can be passed on through sex - it was found in one man's semen in Tahiti and there's been another report of possible spread of the virus through sex. An Aedes Aegypti mosquito on human skin in a lab in Cali, Colombia. Scientists there are studying the genetics and biology of this mosquito, which transmits the Zika virus The World Health Organisation says Zika is rapidly spreading in the Americas because it is new to the region and people are not immune to it. Furthermore, the Aedes aegypti mosquito (pictured) that carries it is just extremely widespread The World Health Organisation says Zika is rapidly spreading in the Americas because it is new to the region, people aren't immune to it, and the Aedes aegypti mosquito that carries it is just about everywhere - including along the southern United States. Canada and Chile are the only places without this mosquito. ARE THERE SYMPTOMS? Experts think most people infected with Zika virus don't get sick. And those that do usually develop mild symptoms - fever, rash, joint pain, and red eyes - which usually last no more than a week. There is no specific medicine and there hasn't been a vaccine developed for it, which is the case for some other tropical illnesses that cause periodic outbreaks. GLAXO CONSIDERING USING VACCINE TECHNOLOGY FOR ZIKA GlaxoSmithKline Plc is concluding feasibility studies evaluating whether its vaccine technology is suitable for the Zika virus, a spokeswoman has confirmed. There is no vaccine or treatment for Zika, which typically causes mild fevers and rashes, although about 80 percent of those infected show no symptoms. 'We're concluding our feasibility studies as quickly as we can to see if our vaccine technology platforms might be suitable for working on Zika,' a Glaxo spokeswoman said in an email. She declined to provide details but added that vaccine development typically takes 10 to 15 years. WHY IS IT A CONCERN NOW? In Brazil, there has been mounting evidence linking Zika infection in pregnant women to a rare birth defect called microcephaly, in which a newborn's head is smaller than normal and the brain may not have developed properly. Brazilian health officials last October noticed a spike in cases of microcephaly in tandem with the Zika outbreak. The connection to Zika is still being investigated, and officials note there are many causes of the condition. Nearly 4,000 cases have been recorded. Meanwhile, doctors have noted increased reports of a nerve condition called Guillain-Barre that can cause paralysis. But the link to the Zika virus is not clear; other infections can spark the problem, including dengue fever. CAN THE SPREAD BE STOPPED? Individuals can protect themselves from mosquito bites by using insect repellents, and wearing long sleeves and long pants - especially during daylight, when the mosquitoes tend to be most active, health officials say. Eliminating breeding spots and controlling mosquito populations can help prevent the spread of the virus. HAVE THERE BEEN CASES IN THE US? Yes, but in tourists. Since 2007 there have been more than two dozen cases diagnosed in the US all travellers who are believed to have caught it overseas. (Puerto Rico and the U.S. Virgin Islands have each had a recent case that didn't involve a traveler.) There is no vaccine or treatment for Zika, which typically causes mild fevers and rashes, although about 80 per cent of those infected show no symptoms The kind of mosquito that spreads Zika is found along the southern states, so experts think it's likely the pests may end up spreading the virus there. But officials also have said Zika infections probably won't be a big problem in the US for a number of reasons, including the more common use of air conditioning and door and window screens. Recent U.S. outbreaks of dengue and chikungunya - carried by the same mosquito - suggest any Zika outbreaks may be relatively small, said Dr. Lyle Petersen of the Centers for Disease Control and Prevention. WHAT ARE THE TRAVEL ADVISORIES? US health officials recommend that pregnant women should consider postponing trips to 22 destinations. Latin America: Bolivia, Brazil, Colombia, Ecuador, El Salvador, French Guiana, Guatemala, Guyana, Honduras, Mexico, Panama, Paraguay, Suriname and Venezuela. In the Caribbean: Barbados, Guadeloupe, Haiti, Martinique, St. Martin and Puerto Rico. Also, Cape Verde, off the coast of western Africa; and Samoa in the South Pacific. In Brazil, most of the mothers who had babies with microcephaly were apparently infected during the first trimester, but there is some evidence the birth defect can occur later in the pregnancy, CDC officials say. The travel alert applies to women in any stage of pregnancy.","url":"https://www.dailymail.co.uk/news/article-3421467/Can-Olympics-survive-Brazil-s-Zika-outbreak-Crisis-female-spectators-ATHLETES-warned-not-organisers-rely-dry-season-kill-mosquitoes.html"}
