{"authors":[],"date_download":"2018-10-30 01:25:50","date_modify":"2018-10-30 01:25:50","date_publish":"2014-06-20 08:00:00","description":null,"filename":"data/vaneerConsumption/CanWeAbidetheDeathPenaltyAnyLonger.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2014/06/spnphotosfour285427.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862750.html","title":"Can We Abide the Death Penalty Any Longer?","title_page":"Can We Abide the Death Penalty Any Longer?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"No Messing With Death\nby Jesse Walker\nThe typical conservative is well informed about the careless errors routinely made by the Internal Revenue Service, the U.S. Postal Service, and city hall. If he’s a policy wonk, he may have bookmarked the Office of Management and Budget’s online list of federal programs that manage to issue more than $750 million in mistaken payments each year. He understands the incentives that can make an entrenched bureaucracy unwilling to acknowledge, let alone correct, its mistakes. He doesn’t trust the government to manage anything properly, even the things he thinks it should be managing.\nExcept, apparently, the minor matter of who gets to live or die. Bring up the death penalty, and many conservatives will suddenly exhibit enough faith in government competence to keep the Center for American Progress afloat for a year. Yet the system that kills convicts is riddled with errors. And I’m not just referring to the ineptitude on display in that slapstick snuff film of an execution in Oklahoma this past April—the event that has gotten everyone talking about capital punishment again, whether or not it has actually changed anyone’s mind. I mean mistakes that are far worse.\nDoes anyone seriously doubt that innocent people have been put to death in the United States? From 1973 through the early months of 2014, 144 people sentenced to die in America have been exonerated of the crimes that landed them on death row. A study this year in the Proceedings of the National Academy of Sciences of the United States of America estimated that “if all death-sentenced defendants remained under sentence of death indefinitely, at least 4.1% would be exonerated.” A 2000 study at Columbia Law School examined 4,578 appeals in state capital cases from 1973 to 1995. The courts, the researchers wrote, “found serious, reversible error in nearly 7 of every 10 of the thousands of capital sentences that were fully reviewed during the period.” (And no, the kinks have not been worked out of the system over time: “In half the years, including the most recent one, the error rate was over 60%.”)\nThe naïve response to this is to take those numbers as a sign that the system works. Most of the prisoners were guilty, after all, and those 144 innocent inmates were eventually found and freed. But as the Columbia study notes, it often took multiple appeals to uncover the mistakes in the original trials. And for how many innocent men was the truth discovered too late, or not at all? On several occasions, an investigation raised serious doubts about the prisoner’s guilt after the execution, from the Chicago Tribune’s probe into the prosecution of Carlos DeLuna, killed by the state of Texas in 1989, to the Houston Chronicle’s look at the case against Ruben Cantu, executed in the same state four years later.\nSeveral states have recently seen stunning numbers of prisoners who were not on death row use DNA evidence to clear their names. Those injustices can be undone, at least partly: If you imprison a man for a crime he didn’t commit, you can’t restore the years he lost, but you can at least give him the years he has left. The death penalty removes even that option.\nYes, most of the people on death row are guilty. But while the percentage of cases the courts get right might make for a good set of statistics at the ballpark, the error rate is far too high for a policy that takes lives. If there are prisoners on death row who landed there by mistake, you have to reconsider the death penalty altogether—and that’s true even if you accept the idea that some acts are so monstrous that the people who commit them have forfeited their right to life. Otherwise the incentives become absurd. The death penalty appeals process has to be open to everyone, since we can’t be sure in advance whether a prisoner was wrongfully convicted. We can know that he’s guilty, of course, if he confesses to the crime. But if confession makes execution more likely, he has every reason not to admit his guilt. An indefinite appeal may amount to a life sentence, but life in jail still beats dying.\nNo, better to remove the possibility of error altogether. We aren’t talking about a split-second decision to kill a criminal who poses an immediate threat to people’s lives. This is a years-long process that ends with the premeditated slaying of a convict who has already been subdued and confined. Mistakes that might be acceptable in the first case should not be acceptable here.\nThe government regularly bungles everything from the day-to-day delivery of the mail to the rollout of health insurance exchanges. There is no reason to think it will always get the business of punishing criminals right either. At the very least, that means the decisions it does make should be as reversible as possible. And that leaves no room for the death penalty.\nWe Need the Deterrent\nby William Tucker\nThere’s a concept in economics I think ought to be introduced into the public discourse. It’s called the “marginal value of wealth.” It means that the wealthier you become, the less each additional dollar means to you. That’s why we have environmentalism—because some people have grown so affluent that they really aren’t much interested in further economic development.\nThe same concept also applies to crime. There’s a “marginal value of safety” that people take into account when evaluating policies such as the death penalty. Most affluent Americans now feel safe enough in their suburban retreats or gated communities with private police patrols so that they can express more concern for a condemned criminal suffering a few minutes of pain in a botched execution than for what the person did to end up on death row in the first place. (As many have pointed out, all this blundering could be fast eliminated by returning to the firing squad.)\nIt’s a different story, however, if you’re running a bodega in a low-income neighborhood or working in a 7-Eleven on a lonely Texas highway. You are completely vulnerable. You may be protected by security cameras or a locked cash register, but to an amateur with a handgun this means little. Murder is the third cause of occupational death among men, behind vehicle accidents and falls by construction workers, and the leading cause of occupational death among women. There’s a very simple reason. For a criminal pulling off a holdup—or a rapist, or a “surprised” burglar caught by a homeowner—there’s a very simple logic at work. The victims of your crimes are also the principal witnesses. They will call the police the minute you depart. They can identify you. They will probably testify at your trial. There’s a very simple way to prevent all this: kill them.\nThe purpose of the death penalty is to draw a bright line between a felony and felony murder.If the penalty for rape or robbery is jail time, and for murder is more jail time after that, there isn’t a huge incentive to prevent you from pulling the trigger. This was well known to reformers of the eighteenth century, who tried to resolve the same dilemma by eliminatingthe death penalty for crimes less than homicide. In The Spirit of the Laws(1750), Montesquieu wrote:\nIt is a great abuse among us to condemn to the same punishment a person what only robs on the highway and another who robs and murders. Surely, for the public security, some difference should be made in the punishment. In China, those who add murder to robbery are cut in pieces: but not so the others; to this difference it is owing that though they rob in that country they never murder. In Russia, where the punishment of robbery and murder is the same, they always murder. The dead, they say, tell no tales.\nIn the 1960s we stopped executing people altogether. At the time homicides were at an historical low and 90 percent were “acquaintance” murders resulting from disputes between friends or relatives. “Stranger murders,” which are generally committed in the course of other crimes, had been reduced to 10 percent. What happened next is well-established. After the death penalty was abolished, murder rates nearly tripled, rising to an all-time high in the 1980s. Only when the death penalty was reinstated and states started executing people in significant numbers in the 1990s did they again fall to 1960s levels. The 500,000 murders committed during this interim took more lives than any conflict in American history save the Civil War. Moreover, by the 1980s murder in the act of another crime had risen to about half the much larger total.\nBut of course these murders were not evenly distributed across society. Instead they are still highly concentrated in minority neighborhoods. Although African Americans make up only 13 percent of the population, they constitute 48 percent of all murder victims—93 percent of whom are killed by other blacks—and they commit 51 percent of the murders in which the case is solved. A standard argument against the death penalty is that it is racist because 40 percent of those on death row are African American. But in fact judges and juries are six times less likely to impose capital punishment if the victim is black. There is racism in the system, but it is not the kind people think.\nThe late Ernest van den Haag used to suggest that we should only execute people for murders on odd numbered days, just to see whether criminals would shift their activities. In fact, we have been conducting just such an experiment by race for decades. What better proof could we have that the death penalty makes a difference?","url":"https://spectator.org/59547_can-we-abide-death-penalty-any-longer/"}
