{"authors":["Esra Gurkan For Mailonline"],"date_download":"2018-10-23 04:13:41","date_modify":"2018-10-23 04:13:41","date_publish":"2017-04-26 15:53:50","description":"Hundreds of people have admitted that they can't tell the difference between canned and fresh food. The study revealed one in four admit they've eaten canned food, mistakenly believing it was fresh.","filename":"data/vaneerConsumption/CanYOUtellwhichmealiscannedandwhichisfresh.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3F9FC47200000578-0-image-a-63_1493215325926.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_food_article-4447470_Can-tell-meal-canned-fresh_1540268021.html","title":"Can YOU tell which meal is canned and which is fresh?","title_page":"Can YOU tell which meal is canned and which is fresh? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Many home cooks pride themselves on only using fresh ingredients - never tinned.\nBut can you really tell the difference between a dish made from scratch, and one thrown together with veg from a can?\nAccording to a new survey, one in four of us would struggle, and produce like sweetcorn, beans, and even entire meals like chili con carne are among the most likely to have us fooled.\nThe vegetable bake on the left was made using canned items whereas the one on the right was made using fresh ingredients - but it's hard to tell the two apart just by looking at them\nOf 2,000 people polled, 25 per cent admitted to having eaten canned food, believing it was made from fresh ingredients.\nWhen put to the test, nearly half said there were certain meals which, on eating, they would struggle to tell whether they'd been made using tinned goods or fresh produce.\nThe research found the average adult has 16 cans of food in their cupboard and relies on tinned food for at least three meals a week, with one in four using canned items once a week for breakfast.\nWhile 56 per cent said they tend to use tinned goods mostly for side dishes like beans or sweetcorn, one in 20 said they hardly ever have a meal made entirely of fresh ingredients.\nOthers said they use canned goods in their Christmas dinner, or when cooking for a date.\nA group of people were asked to try two different vegetable bakes to see if they could tell the difference in a video commissioned by the MPMA\nPeople struggled to tell the difference when eating two different vegetable bakes - one made from fresh and one using tins\nIn the video, one woman guessed correctly that the meal she was pointing at wasn't fresh\nBaked beans emerged as the most popular canned food to use in everyday cooking, followed by tinned tomatoes, soup, fish such as tuna and salmon and other vegetables such as sweetcorn.\nTinned fruit, hot dogs, ravioli and even new potatoes are also popular choices.\nThe research also found one in 10 believe canned food is no different to fresh food, with 48 per cent seeing it as a store cupboard essential.\nAnd six in 10 happily serve it up when they are preparing food for others with almost three in 10 using tinned food at a dinner party.\nAlmost a third have used canned ingredients as part of a roast dinner and one in four have even turned to tins during a barbecue.\nOne in 10 believe canned food is no different to fresh food, with 48 per cent seeing it as a store cupboard essential\nA spokesman for the Metal Packaging Manufacturers Association (MPMA), which commissioned the research, said: 'Many people have a narrow perception of canned food, but it can be a great addition to any kitchen.\n'In fact, in a taste test, where people were given two meals, one made from fresh ingredients and one made from canned food, as well as some struggling to tell the difference, many said they actually preferred the canned food version.'","url":"https://www.dailymail.co.uk/femail/food/article-4447470/Can-tell-meal-canned-fresh.html"}
