{"authors":["Martha Sorren"],"date_download":"2018-10-30 23:13:08","date_modify":"2018-10-30 23:13:08","date_publish":"2014-08-13 22:20:06","description":"When I first started playing Kim Kardashian's iPhone game, I took any and all assignments my manager Simon threw my way. That's how I made my way up the internship ladder while in college, so I figured that was my best bet. But now that I've been…","filename":"data/vaneerConsumption/CanYouSayNotoSimoninKimKardashiansiPhoneGameItsBettertoBeChoosy.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/759c09fd-22c0-4483-bc8e-3ccae80277d6.PNG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35646-can-you-say-no-to-simon-in-kim-kardashians-iphone-game-its-better-to-be-choosy_1540941188.html","title":"Can You Say \"No\" to Simon in Kim Kardashian's iPhone Game? It's Better to Be Choosy","title_page":"Can You Say \"No\" to Simon in Kim Kardashian's iPhone Game? It's Better to Be Choosy","title_rss":"NULL","source_domain":"bustle.com","text":"When I first started playing Kim Kardashian's iPhone game, I took any and all assignments my manager Simon threw my way. That's how I made my way up the internship ladder while in college, so I figured that was my best bet. But now that I've been playing the app for awhile, I've discovered how best to choose projects from Simon in order to raise your status in Kim Kardashian: Hollywood. Contrary to popular belief, Kim Kardashian's life is not as cushy as is to be believed. Or at least her path to the A-list wasn't. It takes a lot of work and a lot of strategizing to figure out how to best ascend to celebrity status.\nThat's where I come in. Like I've advised on how to get more energy, collect stars for free, and balance a busy in-game work schedule, I'm going to give you some tips on which assignments are worth your time and which ones you should skip. After all, you rise in status when you get more fans, and photo shoots are the key way to up your fan count. But which kind of photo shoots? Here are seven tips to the kinds of events your avatar should do if she wants to get more popular.\nSAY NO TO 24 HOUR SHOOTS\nThese actually take basically all of your waking day to complete. So not only does it suck you time and energy (in game and in real life) but it's boring because you can't get any other assignments that whole day until you finish the photo shoot. The money and points you get at the end are hardly worth it when you consider you can do like 5 smaller shoots and earn even more than that one job would get you.\nSAY YES TO SPECIAL APPEARANCES\nThe jobs that Maria and Simon call you to their office to set up are your cash cows. They're way more high profile than the standard Popglam gig because they often include working with someone big (like Elizabeth Korkov/Anna Wintour.) When you finish these appearances you win a ton of cash and the media always reacts really well.\nSAY NO TO INTERIM GIGS\nThe filler jobs in between special appearances become unnecessary as you get more famous and have more on your plate. Instead of filling the hour between two shoots, use it as a chance to let your energy restore for the next special appearance. That way you can finish that one faster and reap the rewards sooner.\nSAY YES TO ONE AND THREE HOUR JOBS\nIf you must take an in between job because you don't want to take a break, go with the short ones. These are over with quickly and are easy ways to rack up points. Plus, it doesn't take as long for the media to respond to them, so you can see your fan count jump significantly multiple times per day.\nSAY NO TO PHOTO SHOOTS BEFORE BED\nI know it's tempting to think you can finish an 8-hour gig an hour or so before bed, but trust me, you can't. So you'll either lose sleep to finish or lose fans because you didn't finish the event. Just say no to photo shoots before bed.\nVARY THE TYPES OF JOBS YOU DO\nIf you don't do one type of job for awhile, Simon will assign you another task to complete like two fashion shows or two ad campaigns. So try to vary your jobs to the point where that's never a problem. Do a photo shoot, then a club appearance, then a beach front ad campaign, and so on so you stay good at lots of things instead of just one style of gig.\nALWAYS COMPLETE WITH FIVE STARS\nAll your strategic work will be for nothing if you don't complete the job with five stars. You'll lose fans and it will be sad, so avoid that at all costs and good luck on your next job!\nImages: Kim Kardashian: Hollywood (4)","url":"https://www.bustle.com/articles/35646-can-you-say-no-to-simon-in-kim-kardashians-iphone-game-its-better-to-be-choosy"}
