{"authors":["Erin Mayer"],"date_download":"2018-10-30 23:47:24","date_modify":"2018-10-30 23:47:24","date_publish":"2014-08-13 11:00:03","description":"In the mid-'90s my dance teacher got her belly button pierced. I was crazy jealous. She just looked so cool with that little rhinestone stud on her toned, tanned stomach. I wanted one, bad. Luckily, I was only about six at the time and far too young…","filename":"data/vaneerConsumption/CanYouGuessWhich90sPopStarTheseBellyButtonRingsBelongTo.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/65117867-bfd2-4440-b8af-775baf1c448c.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35110-can-you-guess-which-90s-pop-star-these-belly-button-rings-belong-to_1540943244.html","title":"Can You Guess Which '90s Pop Star These Belly Button Rings Belong To?","title_page":"Can You Guess Which '90s Pop Star These Belly Button Rings Belong To?","title_rss":"NULL","source_domain":"bustle.com","text":"In the mid-'90s my dance teacher got her belly button pierced. I was crazy jealous. She just looked so cool with that little rhinestone stud on her toned, tanned stomach. I wanted one, bad. Luckily, I was only about six at the time and far too young to make that kind of mistake. My belly remained ring-free, and 23-year-old me is eternally grateful for that.\nThe belly button ring, like many trends from the '90s through the early '00's, is embarrassingly bad in retrospect. How did we, as a society, allow them to become a trend? Chalk it up to a moment of weakness for humanity, but belly button rings were everywhere for a time. By 1999 a belly button ring was practically a prerequisite for becoming a female pop star, right up there with \"abs that look great in a ripped cropped top\" and \"chunky highlighted hair.\"\nWhile I'm currently hoping for a technological breach of some sort that wipes the belly button ring from our collective memory, the '90s girl in me is still in awe of them. I mean, doesn't every stomach instantly become 17 points hotter when there's a rhinestone sticking out of the navel? I think it's time we give credit to the all-powerful belly button ring with a little quiz. Let's see how well you know your '90s pop stars from their belly piercings, shall we?\nRound One\nPiercing:\nAnd the pop star is....\nBritney Spears! Also worth noting: the flesh-toned two piece predating Rihanna.\nRound Two\nPiercing:\nAnd the pop star is...\nWhy it's Queen Bey, of course!\nRound Three\nPiercing:\nAnd the pop star is...\nSuhaimi Abdullah/Getty Images Entertainment/Getty Images\nVictoria Beckham! Back in her singing days, the ultra-refined Posh Spice sported a navel piercing. See a full version of the above photo for proof!\nRound Four\nPiercing:\nAnd the pop star is...\nJanet Jackson. So she's more of a legend than a '90s pop star, but she's got the belly button ring to let us know which decade she really belongs to.\nRound Five\nPiercing:\nAnd the pop star is...\nMadonna, naturally!\nImages: britneyspears/Instagram, beyonce/Instagram, Laurent Jean Phillipe/Flickr, love4janetjackson/Instagram, madonnamatt/Instagram","url":"https://www.bustle.com/articles/35110-can-you-guess-which-90s-pop-star-these-belly-button-rings-belong-to"}
