{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:26:04","date_modify":"2018-10-30 22:26:04","date_publish":"2015-07-25 08:00:00","description":"It was mid-morning one day in May and somewhere deep inside a 25-story tower in Sacramento, an auction, cloaked in secrecy, was about to begin. Why this","filename":"data/vaneerConsumption/CapandtradeIsCaliforniaaleaderoraloner.json","image_url":"https://calmatters.org/wp-content/uploads/cap_trade_feature_ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938364.html","title":"Cap and trade: Is California a leader or a loner?","title_page":"Cap and trade: Is California a leader or a loner? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"It was mid-morning one day in May and somewhere deep inside a 25-story tower in Sacramento, an auction, cloaked in secrecy, was about to begin.\nWhy this matters Cap and trade is among the most pioneering – yet controversial – elements of California’s multi-layered approach to combating climate change. But the national reach of the program has fallen short of expectations.\nThere was no gavel pounding. No shouting. No frenzy of traders running around.\nInstead, an unknown number of state workers surrendered their cell phones, and took positions monitoring computer screens inside the building that houses California’s environmental agencies. Across the world, traders logged in, poised to buy permits that allow businesses in California to emit the kind of pollution responsible for global warming.\nFour hours later, the auction was over and California state government was $626 million richer.\nThat’s the state’s cap and trade program at work, the only one like it in the country.\nHow many staff monitor the online auctions? Which companies bought the permits? State officials won’t say. Making too much information public, they say, could compromise the integrity of the quarterly auctions.\n“What we don’t do and won’t do is get into the individual business strategies that companies use to decide when to buy, what auctions to participate in, who to trade with, and so forth,” said Mary Nichols, chair of the California Air Resources Board, which runs the cap and trade program.\nThe secrecy around the auctions is meant to keep them fair and prevent participants from colluding; other carbon markets use a similar “sealed bid” technique.\nUnder California’s two-year-old cap and trade system, the state sets a limit on how much greenhouse gases businesses can emit, and reduces the amount each year. Companies decide how to stay below the cap: They can buy permits to pollute through the auction, change operations to use energy more efficiently or pay for “offsets,” which are environmentally beneficial projects somewhere else that allow businesses to continue sending emissions into the atmosphere in California.\nCap and trade is among the most pioneering – yet controversial – elements of California’s multi-layered approach to combating climate change. The program covers most major polluting industries and is generating billions of dollars for the state, money that must be poured into efforts to further reduce greenhouse gas emissions. Courts have so far upheld the approach in the face of legal challenges.\nYet the national reach of the program has fallen short of expectations. One Canadian province has joined and another is working on it, but California remains the only state that charges almost every industry a price for emitting carbon.\nIt wasn’t supposed to be this way, said former Assembly Speaker Fabian Núñez, who carried Assembly Bill 32, the 2006 measure that led to cap and trade.\n“The environmental community said, ‘Look, the reason why this has to be the most progressive bill is because once California passes a law, all of these other states are going to follow suit. All of them,’” Núñez said in a recent interview.\n“The irony of this is that once the law passed in California, no one followed suit. No one.”\nThe federal government is pressuring states to cut emissions by crafting rules that crack down on greenhouse gas production from coal-fired power plants. States are figuring out how to comply, and one option is to join existing cap-and-trade programs. So in theory, California’s system could spread to other states.\nIn practice, however, analysts say it’s unlikely.\nWashington state Gov. Jay Inslee proposed linking to California’s system, but the Legislature shot down his plan. Nine states in the Northeast have run their own cap and trade since 2008, but it applies only to electric power producers.\nCalifornia’s, by contrast, is more comprehensive. It covers roughly 600 facilities, including oil refineries, food processors, paper mills, cement manufacturers and electricity providers. The sweeping approach means many businesses that make the most routine consumer goods – think of gas, toilet paper, beer and tomato sauce – must cut their emissions or pay to pollute.\nWho’s covered by cap and trade? About 600 industrial facilities in California are subject to the state’s cap and trade program. Many of them are oil companies or electricity providers, but other kinds of manufacturers are also included. Here are some surprising ones: Anheuser-Busch – Los Angeles Campbell Soup – Dixon Del Monte – Hanford E&J Gallo Winery – Fresno Foster Poultry Farms – Livingston Frito Lay – Kern Hilmar Cheese Company – Hilmar Land O’ Lakes – Tulare Lockheed Martin – Palmdale and Sunnyvale Miller Coors – Irwindale United Airlines Maintenance Center – San Francisco\nWhat does this mean as Californians gas up their cars or shop for groceries? Economists figure gas prices are up by about 10 cents a gallon this year because of cap and trade. The increased costs for other products, however, are hard to pin down.\nThe world’s largest tomato processor says the program will increase its costs by about $5 million over seven years, making it more expensive to churn out the paste that becomes spaghetti sauce, ketchup and pizza. During the hottest months of the year, the Morning Star Packing Company cooks more than 2,000 tons of tomatoes each hour in enormous boilers at three factories in the Central Valley. All that gas-fired cooking creates emissions that are now capped by the state.\n“It’s a regressive tax,” said Morning Star spokesman Nick Kastle, as he led a tour through a Los Banos processing plant.\nMorning Star passes the costs of cap and trade on to the companies that buy its tomato paste to make salsa and sauce, Kastle said. “The only link in that chain who can’t pass it on is the consumer,” Kastle said. “That is the person who bears all the additional costs.”\nKastle couldn’t say how much more shoppers are paying because of cap and trade, citing the complexities of the supply chain. State regulators say the increase is tiny: an additional 1/100th of a cent for a 14.5-ounce can of tomato product.\n“The cost of living in California is higher than it is in some other states that have a lower environmental quality of life. There is absolutely no question about that,” Nichols said.\nBut because cap and trade money is coming back to Californians through many channels, including biannual rebates on electricity bills, the net effect, Nichols claims, is that the costs and benefits even out.\nHow the money flows\nThe solar panels on the roof of Miguel Abugaber’s home in San Diego tell part of the story. Abugaber lives on the $76 a day he earns by caring for his mother, who has Alzheimer’s disease. They were struggling to pay the electric bill when he heard about a program that would give him solar panels almost for free. It uses cap and trade money to help low-income Californians install solar systems that would otherwise be beyond their means.\n“It was like, oh my God, you just have to be kidding me,” Abugaber said during an interview in his modest home, his mother sleeping nearby on a comfortable chair.\nThe 17 solar panels that now glint on their roof are an economic game-changer: The family’s June electric bill came in at $5.10. Without them, Abugaber said his monthly power bill had been more than $100.\n“I mentioned it to my neighbors,” Abugaber said. “But they don’t believe me.”\nState officials say that about 1,780 low-income households will receive rooftop solar systems with cap and trade money.\nThe auctions are also partially funding a program that gives steep discounts on clean cars. Hundreds of Central Valley residents drove their old cars – some trailing smoke from tailpipes – to the Stockton fairgrounds for a free emissions check in May. Those with low incomes and high-polluting cars could get screened for discounts of up to $9,500 on a hybrid or electric vehicle – if they also gave up their old clunkers.\nLawmakers have decided that at least 25 percent of cap and trade money must be spent to benefit disadvantaged communities, and that 60 percent of it will go toward high-speed rail and other transportation and housing plans that make it easier for people to get out of their cars. The auctions brought in $832 million for last year’s budget and are projected to account for $2.2 billion in the current year. Gov. Jerry Brown and legislators are scheduled to wrangle over how to spend the money in the weeks ahead.\nBut whether officials can legally collect money from the auctions is a question before the courts. The Morning Star tomato processor and the California Chamber of Commerce sued the state arguing that cap and trade amounts to an illegal tax because AB 32 was approved by a simple majority of the Legislature, not the two-thirds necessary to pass a new tax. They argue the state could cut emissions and operate a cap and trade market without charging for the permits.\nThe state contends the system is not a tax because participation in the auction is voluntary and the money generated is used specifically to reduce greenhouse gas emissions. California won the first round in court, but an appeal is pending.\nState regulators believe that cap and trade will eventually account for about one-fifth of California’s overall emissions cuts. But for now, officials can’t say how much the system – on its own – is furthering the state’s environmental goals. In 2013, the first year of the auctions and the most recent data available, overall emissions in the state dropped by just a fraction of a percent (0.3%) compared with the year before.\nAn option elsewhere\nCalifornia businesses can satisfy a portion of their obligations without going to the auctions. Instead, they can buy “offsets credits,” in which they pay for an environmental benefit somewhere else while they continue sending emissions into the air at home.\nIn this way, California’s program has sent ripples around the country: About 80 percent of the offset credits regulators have approved are for projects outside the state. Roughly one-third of them are for an incinerator in Arkansas that destroyed greenhouse gases known as chlorofluorocarbons. It parted ways with the program last year after California regulators invalidated some of its credits.\nOffset Credits in California’s Cap-And-Trade\nOffsets cost less than permits to pollute, so businesses like them as an option. But offsets can present problems, said Barbara Haya, a researcher at the Berkeley Energy and Climate Institute. It’s difficult to assess how much additional benefit they provide to the climate, Haya said, which means offsets can “nudge out more certain reductions” in emissions.\nState data show that Chevron bought offsets to preserve forests in South Carolina, Maine, Michigan and California; Valero at dairy farms in Indiana and New York; and the Morning Star tomato packing company at a Wisconsin dairy farm.\nA relatively new offset project is at the Ideal Family Farms in central Pennsylvania, where Dennis Brubaker raises 30,000 hogs a year. The farm makes most of its money turning those pigs into hams and bacon. But it makes a little more by turning their manure into electricity.\nPig waste travels through underground pipes to a methane digester – a 16-foot deep concrete cauldron that rests on the farm’s green pastures. The heated container facilitates a biological process that produces methane gas, which is captured and fed into an engine that sends enough electricity back to the grid to power 100 homes. By capturing the methane gas, Ideal Family Farms offsets greenhouse gases emitted in California.\n“It’s pretty cool that we can have joint partnerships in trying to help make the environment better from one end of the country to the next,” Brubaker said.\nBut offsets are created by individual businesses – not governments – so their prevalence outside California does not indicate that other states are poised to join our cap and trade.\nParticipation and competition help markets thrive, so it will be hard to consider the system a success if California continues its solitary path for many years, said Dan McGraw, who reports on carbon markets for a trade publication called ICIS.\n“It’s very important: Does California get another U.S. state?” McGraw asked at a conference in Los Angeles this spring, where Brown announced signing an executive order requiring California to further slash greenhouse gas emissions by 2030.\n“That’s a huge vote of confidence to the market that shows what (you’re) doing in California isn’t an isolated case. It’s not California and this little speck over here in Quebec and Ontario. It’s more, it can spread… all the way across the United States.”\nBrown’s senior policy adviser Ken Alex sat next to McGraw on the panel, and agreed that California “absolutely can’t do it alone.”\nCALmatters reporters Kate Galbraith and Pauline Bartolone contributed to this report.","url":"https://calmatters.org/articles/cap-and-trade-is-california-a-leader-or-a-loner/"}
