{"authors":[],"date_download":"2018-10-30 14:21:40","date_modify":"2018-10-30 14:21:40","date_publish":"2018-08-20 00:00:00","description":null,"filename":"data/vaneerConsumption/CapitalFlightTheStrategyBehindTrumpsSanctions.json","image_url":"https://www.americanthinker.com/images/bucket/2018-08/208354.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2018_08_capital_flight__the_strategy_behind_trumps_sanctions__1540909300.html","title":"Capital Flight -- The Strategy Behind Trump's Sanctions","title_page":"Capital Flight -- The Strategy Behind Trump's Sanctions","title_rss":"NULL","source_domain":"americanthinker.com","text":"Capital Flight -- The Strategy Behind Trump's Sanctions\nWhen there is war, conflict, or instability, vulnerable human beings flee, seeking refuge in safer countries. Everyone is familiar with the plight of refugees, and the challenges refugees create for surrounding nations. People need and deserve support, and it requires resources to meet this need. When there is war, conflict, or instability, vulnerable capital and wealth also flee. The \"problem\" of fleeing capital is different, however. Because capital and wealth are not as encumbered and physically restricted as are human beings, especially in the modern electronic age, capital moves far from the source of instability. Capital flight makes support of human refugees even more difficult, as capital often flees nations burdened with the obligation of support, nations in close proximity to the underlying cause of flight.\nUnlike human refugees, who consume resources and capital, fleeing capital is welcome with inviting arms by safe havens. Capital and wealth must \"go somewhere,\" and if they land in the banks and markets of a particular nation, that nation reaps the reward of that investment. Banks can lend at lower interest rates. Businesses can grow, expand, modernize, and invest. There is great reward and little cost to a recipient nation, especially if that nation has already invested heavily, historically, in the safety and security of the investment, by, for example, modern economic protections, strong security, a stable political system, and reasonable taxation. The recipient nation does not have to reduce or compromise taxes, regulations, environmental protections, workers' protections, and the like, in order to be more \"competitive,\" in the global market, all costs to capital investment, because these costs are easily accepted and paid in exchange for safety and security. In other words, when confronted with high risk of loss, those who invest capital and wealth will accept higher investment cost, and lower ultimate returns. It is not necessarily a simple calculus, but its truth is undeniable. Turkey provides an excellent example of capital flight, and insight into Trump's economic and foreign policy strategy. The Turkish lira is plummeting. It is plummeting because the Trump administration announced that it would \"review\" Turkey’s duty-free access to the U.S. market, after Turkey hit the U.S. with tariffs on U.S. goods in response to American tariffs on steel and aluminum. President Trump also hit Turkey with sanctions over the country’s hostile detainment of an American pastor. The result is that capital is fleeing Turkey, because according to the Wall Street Journal, investors are alarmed by the amount of control Turkish president Erdogan holds over monetary policy. Analysts bluntly told the Journal that improving relations with the U.S. and raising interest rates would help stabilize the country’s currency. Turkey has refused to do either. Capital flees Turkey because Turkey is unsafe. Some economist have struggled to understand the U.S. stock market. Investment in U.S. domestic and multinational companies is at an all-time high. Investment advisers worry that valuations of companies don't reflect well the amount invested and warn of a bubble. Some are surprised daily that the bubble hasn't burst. \"It just keeps going up!\" After all, \"what comes up...\" If, however, the U.S. economy generally, and the U.S. stock market, particularly, is seen as a safe haven, the appreciation resulting capital flight is understandable, rational, and beneficial. More, it may mean that the bubble risk isn't dire; a bursting bubble means that capital has suddenly flown elsewhere, and in a world of a multitude of choices, capital is always free to flee where it is best employed by its owners to produce wealth. But, what if the risk of flight is just too high? Capital might be expected to stay where it is safe, especially if that safety endures, and other opportunities for safe investment with reasonable return do not materialize. Consider the many causes of the flight of capital in recent years. Are competing markets as strong and stable as they were seven years ago, and more importantly, are they as strong and stable as is the U.S. market? Capital is fleeing Canada. Capital is fleeing China (strange -- people who command wealth get a bit skittish when several hundreds of their kind simply disappear). EU instability has caused capital to flee Europe (link behind subscription wall). Capital has flown from India. Capital has flown from Russia, although early indications are that new Trump sanctions may not encourage additional capital flight. Capital is fleeing Latin America. There are a multitude of examples, but the point is, too, that capital is not fleeing the U.S. Not all capital flight winds up in the U.S., of course, but it’s safe to say that a good percentage is winding up here. Simple economics: more money chasing the same goods or investment opportunities causes prices to increase. With share prices high, companies can grow, expand, modernize, and invest. The investment increases the value of companies, generates returns for investors, and generates revenues for the U.S. government. Trump is counting on U.S. strength and safety to lure even more investment, especially if there is uncertainty, instability, and conflict resulting from trade disputes and sanctions. Trump calculates that, regardless of the effect on a particular good or service in the long term, the short term or immediate effect will be capital flight. This flight is particularly certain if nations seek to return to a trade system that is not fair to the U.S.; sanctions and economic risk are not likely to cause capital to flow from the U.S. to nations from which capital has or is already flowing. Trump is not employing a philosophically driven foreign and trade policy wielding empty threats of carrot and stick like his predecessors. His foreign policy is disruptive, and intended to create meaningful reform in both statecraft and trade, first and foremost, to advance U.S. political, economic, and military interests. Achieving these objectives, even in the slightest of degrees, increases the safety and security of the U.S. as a safe haven, which strengthens Trump's ability to reform both foreign services and trade. The Trump administration knows well that there will be a price for economic dislocation and higher costs for goods in some segments of the economy, which is precisely why the administration has invested in worker training. Trump understands, nonetheless, the value of dislocation, disruption, and instability in reforming markets and institutions. The very consequences experts fear, are the very tools through which Trump will ensure reform.","url":"https://www.americanthinker.com/articles/2018/08/capital_flight__the_strategy_behind_trumps_sanctions_.html"}
