{"authors":["Associated Press"],"date_download":"2018-10-22 22:15:59","date_modify":"2018-10-22 22:15:59","date_publish":"2016-01-11 02:45:58","description":"WASHINGTON (AP) — Alex Ovechkin scored his 500th goal Sunday night, becoming the 43rd player in NHL history to reach the milestone. Ovechkin reached the mark...","filename":"data/vaneerConsumption/CapitalsAlexOvechkinscores500thgoal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:5d18f64d329844478542f1a2c3286eaf-56CX32zFKLb7123928b84c94d2c4-679_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393248_Capitals-Alex-Ovechkin-scores-500th-goal_1540246559.html","title":"Capitals' Alex Ovechkin scores 500th goal","title_page":"Capitals' Alex Ovechkin scores 500th goal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Capitals' Alex Ovechkin scores 500th goal\nWASHINGTON (AP) — Alex Ovechkin scored his 500th goal Sunday night, becoming the 43rd player in NHL history to reach the milestone.\nOvechkin reached the mark in vintage fashion, scoring from just beyond the left hash marks during a second-period power play to give the Washington Capitals a 5-1 lead over the Ottawa Senators.\nOvechkin got an extended standing ovation and took a skate around the rink, acknowledging the cheering crowd that included his parents. He later drew another roar while waving to fans from the bench.\nWashington Capitals left wing Alex Ovechkin (8) celebrates just after scoring his 500th career goal during the second period of a NHL hockey game against the Ottawa Senators in Washington, D.C., Sunday, Jan. 10, 2016. (AP Photo/Jacquelyn Martin)\nHe added No. 501 midway through third, beating a defender with a sweeping deke at the top of the zone before smacking a shot past goalie Andrew Hammond for a 7-1 lead.\nAt 801 games, the Russian winger is the fifth-fastest player to 500 goals, trailing only Hall of Famers Wayne Gretzky (575 games), Mario Lemieux (605), Mike Bossy (647) and Brett Hull (693).\n\"He is one of a kind,\" Hull told the AP in a phone interview last week. \"I admire what he does because he's a pure goal scorer.\"\nOvechkin has filled the net more often than anyone since he entered the league in 2005, scoring 149 more goals than the next closest player, Jarome Iginla.\nOvechkin was the first overall pick in the 2004 draft by Washington. He's been named an All-Star in each of his 11 seasons and was voted a captain for this year's All-Star game. He's won three straight Richard Trophies as the league's leading goal scorer and five overall. He's also won three Hart Trophies as league MVP.\nThe 30-year-old Ovechkin is the NHL leader in career goals by a Russian-born player.\nOvechkin has 26 goals this season, including five over his past three games.\nWashington Capitals left wing Alex Ovechkin (8) follows through as he scores his 500th career goal during the second period of a NHL hockey game against the Ottawa Senators in Washington, D.C., Sunday, Jan. 10, 2016. (AP Photo/Jacquelyn Martin)","url":"https://www.dailymail.co.uk/wires/ap/article-3393248/Capitals-Alex-Ovechkin-scores-500th-goal.html"}
