{"authors":["Associated Press"],"date_download":"2018-10-22 21:09:13","date_modify":"2018-10-22 21:09:13","date_publish":"2016-01-28 06:49:55","description":"WASHINGTON (AP) — Russian winger Alex Ovechkin will miss the upcoming All-Star game because of an unspecified lower-body injury he's been dealing with since ...","filename":"data/vaneerConsumption/CapitalsOvechkintomissNHLAllStarGamewithinjury.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:0d609c1646524dbbb608cc745f9a7325-2vdWmEltwXfba0ce28e63251e38d-595_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420424_Capitals-Ovechkin-miss-NHL-All-Star-Game-injury_1540242553.html","title":"Capitals' Ovechkin to miss NHL All-Star Game with injury","title_page":"Capitals' Ovechkin to miss NHL All-Star Game with injury | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Capitals' Ovechkin to miss NHL All-Star Game with injury\nWASHINGTON (AP) — Russian winger Alex Ovechkin will miss the upcoming All-Star game because of an unspecified lower-body injury he's been dealing with since mid-November.\nWashington Capitals coach Barry Trotz said Wednesday that the team took the decision out of Ovechkin's hands because the focus must be on the playoffs and the chase for the franchise's first Stanley Cup.\n\"You don't win a Stanley Cup. You don't get two points for (the All-Star) Game. You get prize money,\" Trotz said. \"For us, it's not about the prize money. We have a bigger goal, and if we want to get to where we want to get to, we can't do it without Alex Ovechkin being 100 percent.\"\nWashington Capitals left wing Alex Ovechkin (8), of Russia, looks on during the first period of an NHL hockey game against the Philadelphia Flyers, Wednesday, Jan. 27, 2016, in Washington. (AP Photo/Nick Wass)\nOvechkin has a penchant for playing through injuries and still has 28 goals and 14 assists this season as the Capitals are atop the NHL standings. The 30-year-old left wing who was picked as an All-Star for the seventh time hoped a week-long break would heal the injury, but instead it may have aggravated it.\n\"We talk about it maybe last couple weeks and last week it was very serious, should I go, should I not go,\" Ovechkin said. \"The snowstorm came and it felt like maybe it's going to help and it doesn't. (I) clean my house and it's my bad decision.\"\nOvechkin had been voted Metropolitan Division captain by fans for the NHL's new 3-on-3 tournament. His replacement was not immediately announced.\n\"If you have injury, you have to do all the treatments to take care of yourself,\" Ovechkin said. \"In a game, sometimes you have to just forget about it and play. Sometimes I just feel not that bad and sometimes I feel bad and I just kind of settle down and sit on the bench and look at Trotz and say, 'It's not that good.\"","url":"https://www.dailymail.co.uk/wires/ap/article-3420424/Capitals-Ovechkin-miss-NHL-All-Star-Game-injury.html"}
