{"authors":["Daniel Leberfeld"],"date_download":"2018-10-30 19:50:35","date_modify":"2018-10-30 19:50:35","date_publish":"2017-04-12 22:11:06","description":"The man who plays Captain America is giving New England quarterback Tom Brady “a pass” for supporting Donald Trump in the last presidential election. | Sports","filename":"data/vaneerConsumption/CaptainAmericaActorGivesTomBradyAPassForSupportingTrump.json","image_url":"https://media.breitbart.com/media/2017/03/ChrisEvansCaptainAmericaTrumpRage.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2017_04_12__1540929035.html","title":"Captain America Actor Gives Tom Brady 'A Pass' For Supporting Trump","title_page":"Captain America Actor Gives Tom Brady 'A Pass' For Supporting Trump | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The man who plays Captain America is giving New England quarterback Tom Brady “a pass” for supporting Donald Trump in the last presidential election.\nLeft-leaning actor Chris Evans, a Massachusetts native and huge Patriots fan, is willing to cut Brady slack because he’s delivered five Super Bowl championships to New England.\n“Well, I tell you what, if anyone gets a pass it’s Tom Brady,” Evans told USA Today earlier this week.\nRight after Trump was elected on November 9, Evans tweeted, “This is an embarrassing night for America. We’ve let a hatemonger lead our great nation. We’ve let a bully set our course. I’m devastated.”\nThis tweet didn’t sit well with some of his Twitter followers.\n“How do you think this makes the millions of people who voted for him feel? They’re not evil, you just disagree,” a woman named Amanda tweeted at Evans.\nWhile Captain America was “devastated” when a man who wants to “make America great again” captured the White House, the Super Bowl victory by his beloved Patriots perhaps helped soothe the wounds.\nAnd Evans, who narrated the video, “America’s Game: The Story of the 2014 New England Patriots,” is clearly willing to forgive Brady.\n“We may have political disagreements,” Evans told USA Today. “But I don’t want to encourage this landscape of if you disagree with me politically, you’re my enemy; That’s not the case. Granted, it’s an easy thing to say as a privileged white male. Because there are plenty of people oppressed and victimized and in jeopardy at this stage.”\nHow the election of Trump’s election hurts “oppressed and victimized” people is a mystery. The new president wants to lower taxes, secure the borders and keep more American jobs at home. Sounds like a plan to help the “oppressed and victimized.”\nEvans continued, “It’s easy for me to say, ‘Hey, we can all get along,’ and I have to remember that, as well. I’m just going to out of my way to give Tom Brady a pass. He gave me five rings. What am I supposed to do? He gets a pass.”\nIf Evans truly considers Trump “a bully” and considered his election “embarrassing,” why forgive Brady, one of the President’s more high-profile supporters?\nWhy? Because Brady led his favorite sports team to a championship? Isn’t that trivial compared to the future of the country being led by a man Evans considers a “hatemonger?”\nWhat about the courage of your convictions, Mr. Evans?","url":"https://www.breitbart.com/sports/2017/04/12/captain-america-actor-gives-tom-brady-a-pass-for-supporting-trump/"}
