{"authors":["Jennifer Brett"],"date_download":"2018-10-30 21:35:57","date_modify":"2018-10-30 21:35:57","date_publish":"2015-05-16 07:47:49","description":"\"Captain America: Civil War\" has been filming in downtown Atlanta for several days now and needs ext...","filename":"data/vaneerConsumption/CaptainAmericaCivilWarneedsextrasforMondaysceneinAtlanta.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_buzz_captain-america-c_e829e1926a443bea0bf8093f7a883d96__1540935357.html","title":"\"Captain America: Civil War\" needs extras for Monday scene in Atlanta","title_page":"\"Captain America: Civil War\" needs extras for Monday scene in Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"\"Captain America: Civil War\" has been filming in downtown Atlanta for several days now and needs extras for a scene coming up on Monday. Details are below.\nThe Marvel threequel stars Chris Evans, Scarlett Johansson, Robert Downey Jr., Paul Rudd, Elizabeth Olsen, Jeremy Renner, Emily VanCamp, Paul Bettany, Sebastian Stan Martin Freeman, Chadwick Boseman, Anthony Mackie, Frank Grillo, Daniel Brühl, Don Cheadle and William Hurt.\nChris, Scarlett and Anthony were on the set on Friday. Photos here!\n\"Captain America: Civil War\" has been filming in downtown Atlanta and needs extras on Monday. Photo: Jennifer Brett, jbrett@ajc.com\n\"Captain America: Civil War\" has been filming in downtown Atlanta, not far from the Georgia Dome and site of the new Atlanta Falcons stadium. Photo: Jennifer Brett, jbrett@ajc.com\nIt's a good bet that the scene needing extras would take place at the same location, a large and detailed set that looks like an African market. It's located in downtown Atlanta.\nNote: If you have heat sensitivity issues this might not be the right opportunity for you. On Friday I witnessed an extra become overwhelmed by the heat. The set people were incredibly efficient at immediately rendering assistance, helping the woman to the shade and getting her water and medical attention. During breaks they were assiduous in making sure extras got out of the sun and had plenty of water and snacks. (Chris Evans' stunt double even helped hand out water!)\nStill, the high on Monday is supposed to be almost 90 degrees. Keep that in mind.\nChris Evans' stunt double for \"Captain America\" lives up to heroic status by handing out water to extras on the set of \"Captain America: Civil War.\" It is filming in downtown Atlanta. PHOTO: Jennifer Brett, jbrett@ajc.com\nChris Evans films a scene from \"Captain America\" in downtown Atlanta. PHOTO: Jennifer Brett, jbrett@ajc.com\nAnthony Mackie on the set of \"Captain America: Civil War.\" PHOTO: Jennifer Brett, jbrett@ajc.com\nHere are the details for the casting call:\n\"CASTING FOR AFRICANS and AFRICAN AMERICANS\nfor MONDAY, 5/18 for an African Market\nages 18-75\n***************** IMPORTANT NOTES*********************************\n1. Pay rate is $68 for 8 hrs with O.T. after that\n***\n2. Start time will be early in the morning and works in Atlanta\n**************************************************************************\nPLEASE SUBMIT TO: sputnikextras@TScasting.com\nand put “MONDAY AFRICAN MARKET” in the subject line\n**************************************************************************\nPLEASE INCLUDE:\nCURRENT PHOTOS !!!!! (one of from shoulders up and one from the knees up- Hair Length must be visible in one of the photos) and IF you have a headshot and resume, please ALSO include a current photo taken recently\n************************************************************************\nThen please List the following:\nFirst and Last NAME\nPHONE NUMBER (s) (XXX-XXX-XXXX format)\nEmail address\nCITY & STATE where you live (where you will be coming from!)\nAGE\nHeight\nWeight\nINCLUDE: Car info , in case we need a few cars...the older the better - wink emoticon\nColor, year, make and model\n**************************************************************************\nYou MUST be LOCAL to the GREATER ATLANTA, GEORGIA AREA (or willing to work as a local hire)\"\nMORE COVERAGE:\nChris Evans suits up for “Captain America” Civil War”\n“Captain America” stars cheer on the Atlanta Hawks\nScarlett Johansson, Chris Evans spotted in Buckhead\nPhotos from the Buckhead “Captain America” set\nPhotos from the Midtown “Captain America” set\nChris Evans spotted toning his “monster” physique at Atlanta gym\n“Captain America: Civil War” films in downtown Atlanta","url":"https://www.ajc.com/blog/buzz/captain-america-civil-war-needs-extras-for-monday-scene-atlanta/aftlaHhWAJIccHZM67GL3J/"}
