{"authors":["Breitbart News"],"date_download":"2018-10-30 18:11:13","date_modify":"2018-10-30 18:11:13","date_publish":"2016-06-30 14:43:03","description":"Capt. Joseph R. John, USN (Ret), the Chairman of Combat Veterans for Congress PAC, writes that members of the Muslim Brotherhood and its Islamist front groups have become “a very dangerous ‘Fifth Column’ in the United States, appointed by Obama to very high and sensitive positions in the US Government agencies.” | Politics","filename":"data/vaneerConsumption/CaptJosephJohnMuslimBrotherhoodFifthColumnHasInfiltratedUSGovernment.json","image_url":"https://media.breitbart.com/media/2016/06/GettyImages-541748026.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_06_30__1540923073.html","title":"Capt. Joseph John: Muslim Brotherhood ‘Fifth Column’ Has Infiltrated U.S. Government","title_page":"Capt. Joseph John: Muslim Brotherhood ‘Fifth Column’ Has Infiltrated U.S. Government | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Capt. Joseph R. John, USN (Ret), the Chairman of Combat Veterans for Congress PAC, writes that members of the Muslim Brotherhood and its Islamist front groups have become “a very dangerous ‘Fifth Column’ in the United States, appointed by Obama to very high and sensitive positions in the US Government agencies.”\nMany law abiding Muslim America citizens have assimilated in the United States and fought as members of the US Armed Forces, against Saddam Hussein’s invasion of Kuwait, and also against “Radical Islamic Terrorism” over the last 50 years. They are opposed to ISIS’ murderous attacks against gays, Christians, and Jews, and are frightened of the “Radical Islamic Terrorist” threat. More Muslims worldwide than Americans have been murdered by “Radical Islamic Terrorists.”\nThe Muslim Brotherhood (the progenitor of Jihadism), and its front groups, the Council of American Islamic Relations (CAIR), and the Muslim Public Affairs Council (MPAC), do not have members who are law abiding Muslim Americans, like many Muslim Americans who are good citizens and have assimilated in the United States. Members of the Muslim Brotherhood, CAIR, and MPAC have sinister goals that are not in support of the US Constitution or The Bill of Rights. They have become a very dangerous “Fifth Column” in the United States, appointed by Obama to very high and sensitive positions in the US Government agencies.\nFor nearly 8 years Obama has been filling the Washington bureaucracy including DHS, the CIA, DOD, the National Security Council, the White House, the State Department, every US Intelligence Agency, and the US Armed Forces with thousands of members of the CAIR, MPAC, the Muslim Brotherhood, and other Muslim Brotherhood front groups.\nPhil Haney (former Custom & Border Protection DHS Law Enforcement Officer) and Richard Higgins (former DOD Manager of the Combating Terrorism & Technical Support Office & Irregular Warfare Section) made explosive charges on national radio. They stated that the Obama administration is a “tool” for the Jihadi movement in the US. That the driving force behind America’s domestic counter-terrorism strategies and its foreign policy is a massive Muslim Brotherhood (MB) movement in the United States, that the MB controls how the issue of terrorism is handled at the National Security Agency level.\nRead the rest here.\nListen to Capt. John discuss this article on Breitbart News Daily on SiriusXM:","url":"https://www.breitbart.com/politics/2016/06/30/capt-joseph-john-muslim-brotherhood-fifth-column-infiltrated-u-s-government/"}
