{"authors":["Ciara Farmer For Mailonline"],"date_download":"2018-10-23 04:18:27","date_modify":"2018-10-23 04:18:27","date_publish":"2016-01-28 20:17:44","description":"The 23-year-old supermodel was joined by Kara Tointon, Lacey Turner and Erin O'Connor in getting snap happy for charity, while also toying with their usually perfect make-up","filename":"data/vaneerConsumption/CaraDelevingneleadsahostofstarstosupportbehindSmearForSmearcampaign.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/20/30AD3ECC00000578-0-image-a-17_1454013763389.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421575_Cara-Delevingne-leads-host-stars-including-Kara-Tointon-Lacey-Turner-support-SmearForSmear-campaign_1540268307.html","title":"Cara Delevingne leads a host of stars to support behind #SmearForSmear campaign","title_page":"Cara Delevingne leads a host of stars to support behind #SmearForSmear campaign  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Many superstar selfies act to flaunt a new outfit or hairdo - yet a host of celebrities have opted to pull a pout for a good cause.\nCara Delevingne has led a number of stars in becoming loose-handed with their lipstick to help support the #SmearForSmear campaign as part of Cervical Cancer Prevention Week over the last seven days.\nThe 23-year-old supermodel was joined by Kara Tointon, Lacey Turner and Erin O'Connor in getting snap happy for charity, while also toying with their usually perfect make-up.\nScroll down for video\nLippy lady: Cara Delevingne has led a number of stars in becoming loose-handed with their lipstick to help support the #SmearForSmear campaign as part of Cervical Cancer Prevention Week over the last seven days\nCara was the most enthusiastic in her lipstick application as she covered her entire lips in a deep pink shade before extending the shade along her entire face.\nShe then drew a fine line beneath her eyes and along her nose before topping off the playful look with a heart illustrated on her head.\nDespite the dramatic nature of her lipstick application, Cara went make-up free underneath - a nod to her usual off-duty, laid-back look.\nIn a bid to help the campaign reach a wider audience, the British beauty nominated Kendall Jenner and her sister Poppy to take part.\nSee Cara Delevingne updates as throws support behind the #SmearForSmear campaign\nPulling a pout: Lacey [pictured] went for Cara's simple yet effective look - minimal make-up and a beanie hat allowed her smudged lipstick to become the focal point of the look\nSuperstars support: The 23-year-old supermodel was joined by Kara Tointon [pictured], Lacey Turner and Erin O'Connor in getting snap happy for charity, while also toying with their usually perfect make-up\nKara meanwhile opted for a wholly more vampish selfie as she took the snap from below while rocking a blood-red shade with just a subtle smudge extending along the right-hand corner of her lip.\nLacey went for Cara's simple yet effective look - minimal make-up and a beanie hat allowed her smudged lipstick to become the focal point of the look.\nSupermodel Erin O'Connor was barely recognisable in her snap, as her alabaster skin beamed through with a shock of crimson lipstick standing out.\nHer trademark raven tresses were just visible although her jet black eyebrows made the look even more stand out.\nLady in red: Supermodel Erin O'Connor was barely recognisable in her snap, as her alabaster skin beamed through with a shock of crimson lipstick standing out\nEastEnders star Patsy Palmer opted to break against the mould and use a nude hued lipstick while not smudging the application at all - seemingly missing the point of the campaign but still showing support.\nFormer TOWIE star Lauren Pope made quite a dramatic statement in her sultry image - where she pulled down one side of her lip to provide a smudged look.\nMade In Chelsea star Rosie Fortescue also joined in the fun with a deep red shade smeared across her face.\nAnd pout! EastEnders star Patsy Palmer opted to break against the mould and use a nude hued lipstick while not smudging the application at all - seemingly missing the point of the campaign but still showing support\nRed lady: Former TOWIE star Lauren Pope made quite a dramatic statement in her sultry image - where she pulled down one side of her lip to provide a smudged look\nThe campaign is the second run by Jo's Cervical Cancer Trust, after the inaugural drive kicked off on in January, and aims to raise awareness about the disease among young women.\nJo's Cervical Cancer trust, which is the largest cervical cancer charity in the UK, has launched the campaign following reports that the number of young women diagnosed with cervical cancer has soared in the last decade.\nNew figures reveal more than one million failed to attend smear tests last year.\nOver the last 10 years, cases of the disease in women aged 25 to 29 have soared by 59.2 per cent.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421575/Cara-Delevingne-leads-host-stars-including-Kara-Tointon-Lacey-Turner-support-SmearForSmear-campaign.html"}
