{"authors":[],"date_download":"2018-10-30 01:13:09","date_modify":"2018-10-30 01:13:09","date_publish":"2018-10-29 00:05:01","description":"We owe a debt of gratitude to whoever organized and funded the approaching caravan of Central Americans who are racing north through Mexico to our southern border. The 7,000 migrants on the march are providing a powerful, profound, and sobering visual statement as to what is and has been at stake for us if we do not secure our borders.","filename":"data/vaneerConsumption/CaravanFairnessAModestProposal.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/10/CaravanWoman-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861989.html","title":"Caravan Fairness: A Modest Proposal","title_page":"Caravan Fairness: A Modest ProposalThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"We owe a debt of gratitude to whoever organized and funded the approaching caravan of Central Americans who are racing north through Mexico to our southern border. The 7,000 migrants on the march are providing a powerful, profound, and sobering visual statement as to what is and has been at stake for us if we do not secure our borders.\nIn 2015, the Department of Homeland Security apprehended 267,885 foreign nationals trying to cross illegally from Mexico into the United States. This, of course, does not include the many illegals who entered without being detected or caught. Nevertheless, compare, contrast and do the math. Divide the number of just those who were caught in 2015 by 7,000 and you will find that the numerical equivalent of 38 caravans entered illegally that year.\nIn short, by massing all at once to rush and overwhelm our border security, the Central American caravan is providing a stark, alarming and much needed wake up call.\nSome doomsayers predict that, if successful, the caravan will spawn future similar efforts. Where, they ask, will it all end? How can we stop this from happening when so many highly influential progressive elements in our society are in favor of open borders and unregulated immigration?\nTo gain the support of progressives for controlling our borders, we must include them in the process. Put another way, we must see to it that progressives have some skin in the game. At present, illegal immigration has resulted in a tsunami of poor and uneducated manual laborers flooding all parts of the country to compete with and depress the wages and job opportunities of blue collar American citizens.\nThe same is not true for the social and economic elites who comprise our progressive betters. Think of the most influential elements of progressivism as a three-legged stool resting on academia, the news media, and the entertainment industry. None of these groups are directly impacted by illegal immigration.\nSo that is why we need more caravans of illegals not fewer. Only the future caravans should consist of different classes of illegals. Instead of poor laborers and farm hands, the next caravan should, for example, consist of academics from Central America and Mexico. We should empty out the faculty lounges at colleges and universities south of the border and start the assembled professors, scholars, researchers, and administrators north to the USA.\nThe arrival of untold thousands of undocumented illegal academics would have a beneficial effect on American universities. In addition to promoting the Holy Grail of Diversity, overpaid American faculty and administrators would be replaced by their newly-arrived illegal counterparts willing to work for much lower compensation. Plus, with an academic workforce subject to sudden and arbitrary arrest and deportation, universities could at last do away with that pesky tenure nonsense and demands for better working conditions. The American Association of University Professors would become a thing of the past as would pensions, sabbaticals, and similar frills.\nThis would be a true win-win. While allowing the entry of poor, downtrodden foreign academics into the United States, the reduction of faculty and administrative pay to Honduran or Mexican compensation levels would slow the ruinously rising cost of a college education and lessen the need for crippling student loans.\nThe same approach would have the same beneficial effect on the news media and the entertainment industry. Let’s face it: these people are way overpaid for what they do. Social justice requires that the pampered Americans in these enterprises be replaced with foreign counterparts willing to work for far less. By opening our arms to foreign broadcasters, reporters, news anchors, actors, producers, directors, and technicians, we would be alleviating economic deprivation and suffering in the third world while slashing cable television bills and movie admission prices.\nOf course, if ever faced with losing their livelihoods due to an influx of illegals, progressive open-borders advocates might abandon their convictions. It’s one thing to finger wag and lecture the great unwashed, Trump-loving American blue collar workers about the immorality of trying to protect their jobs. It would be quite another if the consequences of open borders were to directly and negatively impact those same finger-wagging progressive scolds. If they wound up at the unemployment office, they might actually change their minds about the unalloyed benefits of uncontrolled, open immigration.\nAs a great man once said, when it comes to sorting right from wrong, it all depends on whose ox is being gored. Until the progressive elites of this country are made to suffer the consequences of their moral posturing, they will continue their support for illegal immigration.\nSo heed and take up the rallying cry of us newly-minted conservative advocates for more and improved immigrant caravans:\nProfessores! Los actores! Reporteros de television! Para una vida mejor, ven a los Estados Unidos!\nThirty or forty caravans of academics, reporters, editors, actors, and directors ought to do the trick.\nHeh.\nGeorge Parry is a former federal and state prosecutor who practices law in Philadelphia. He blogs at knowledgeisgood.net and may be reached by email at kignet1@gmail.com.","url":"https://spectator.org/caravan-fairness-a-modest-proposal/"}
