{"authors":[],"date_download":"2018-10-22 20:35:00","date_modify":"2018-10-22 20:35:00","date_publish":"2014-06-02 13:06:29","description":"Today’s announcement -- if it withstands the upcoming legal challenges -- would represent Obama's biggest achievement of his second term so far.","filename":"data/vaneerConsumption/CarbonCombatObamaBeginsBattleOverEnvironmentalRegulation.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/481256/140602-traffic-carbon-combat-jsw-954a_da4d2d3065c44b245d4681c8d47d2117.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_carbon-combat-obama-begins-battle-over-environmental-regulation-n120171_1540240500.html","title":"Carbon Combat: Obama Begins Battle Over Environmental Regulation","title_page":"Carbon Combat: Obama Begins Battle Over Environmental Regulation","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nClimate battle begins\nThe battle over the Obama administration’s new environmental regulations begins in earnest today and will be a dominating topic throughout the 2014 elections. This morning, EPA Administrator Gina McCarthy will speak on the administration’s proposal that existing power plants will have to cut their carbon emissions by 30% from 2005 levels by 2030, NBC’s Kelly O’Donnell, Kristen Welker, and Anne Thompson report. The announcement will work through Section 111-d of the Clean Air Act, which requires states to adopt performance standards for existing sources of pollution. The EPA sets benchmarks that the states must meet and can improve upon. President Obama previewed this announcement in his weekly address. “In just the first year that these standards go into effect, up to 100,000 asthma attacks and 2,100 heart attacks will be avoided – and those numbers will go up from there,” he said. Over the last two years, the fate of the Keystone XL Pipeline has dominated the political conversation when it comes to the environment and energy. But today’s announcement by Obama -- if it withstands the upcoming legal challenges -- would represent, by far, his biggest achievement on the environment and of his second term so far.\nNew rules represent a big political risk for Democrats\nBut it also comes with a significant risk to his party, particularly to Democrats hailing from coal-producing states (think West Virginia, Virginia, Kentucky, even Ohio). Republicans argue that the regulations will hurt the economy and these coal/energy jobs. “[T]his is just the latest attempt at a national energy tax by the Obama administration and yet another assault on Kentucky coal jobs and the Commonwealth's economy,” said Senate Minority Leader Mitch McConnell (R-KY), who is running for re-election in a very competitive race against Alison Grimes (D). House Speaker John Boehner’s office adds, “The president’s plan would indeed cause a surge in electricity bills -- costs stand to go up $17 billion every year. But it would also shut down plants and potentially put an average of 224,000 more people out of work every year.” So move over Obamacare, Benghazi, even the recent political skirmish over the VA. It’s very likely that “Obama’s war on coal” could be the GOP’s rallying cry over the next five months. Consequently, today probably isn’t going to be a good day for Alison Grimes. But the debate also comes with a risk for the GOP. What is their solution to reduce greenhouse gases? Do they disagree with the vast majority of scientists who believe human actions have contributed to climate change? As Sen. Marco Rubio (R-FL) recently discovered, these questions can be problematic for GOP politicians, especially those who represent a coastal state.\nState-based compliance\nThe Washington Post makes an important point about the new EPA regulations -- they are state-based. “Under the draft rule, the EPA would analyze four options that states and utilities would have to meet the new standard, with different approaches to energy efficiency, shifting from coal to natural gas, investing in renewable energy and making power plant upgrades, according to those who spoke on the condition of anonymity because it has not been formally announced. Other compliance methods could include offering discounts to encourage consumers to shift electricity use to off-peak hours,” the paper writes. “Meeting the EPA targets might not be difficult for states that have cut emissions in the electricity sector or that have been meeting their own renewable energy standards. Since the EPA proposed a baseline year of 2005, 13 states and the District have cut carbon emissions by about 30 percent or more, according to a Sierra Club compilation of Energy Information Administration data.”\nThe political clash over Bergdahl’s release\nAmericans celebrated Saturday’s news that U.S. solider Bowe Bergdahl was released by his Taliban captors in Afghanistan. And then -- as what happens to nearly all things now -- it turned into political debate, with Republicans arguing that the U.S. releasing five Taliban Gitmo detainees in exchange for Bergdahl is a dangerous precedent. “Now we're going to have five people potentially on the ground targeting American troops, Afghan troops, and the Afghan people,” Rep. Adam Kinzinger (R-IL) said on NBC’s “Meet the Press” yesterday. “There's a lot of questions that need to be asked here. This whole exchange is shocking to me, and I'm very disappointed.” Defense Secretary Chuck Hagel countered, “We do have responsibilities that we don't let anyone out of Guantanamo, and I will not sign off on any detainee coming out of Guantanamo unless I am assured, unless our government assured, our country can be assured that we can sufficiently mitigate any risk to American security.” As NBC’s Jim Miklaszewski reported on Sunday, critics also claim President Obama broke the law by not notifying Congress 30 days before the Taliban prisoners were released. National Security Adviser Susan Rice claims Congress was informed once Bergdahl was released, but that his failing health required immediate action. NBC’s Kristen Welker made another point on Sunday: Foreign-policy experts remind us that Ronald Reagan swapped arms with Iran for hostages held in Beirut.\nObama to depart on European trip\nMeanwhile, at 7:30 pm ET, President Obama departs on his four-day trip to Europe. The New York Times previews the president’s travel. “President Obama leaves for Europe on Monday night cautiously optimistic that the crisis in Ukraine has turned a corner, but he will find himself face to face with President Vladimir V. Putin of Russia for the first time since the two squared off in a Cold-War-style showdown in Eastern Europe… Mr. Obama arrives in [Poland] on Tuesday to meet not only with Polish leaders but also with leaders from throughout the region who will converge there.” More: “On Wednesday, he will meet with [new Ukrainian President] Poroshenko for the first time since his election and then address a public rally celebrating the 25th anniversary of the elections in Poland that signaled the eventual end of Communist rule. Later that day Mr. Obama will fly to Brussels, where he will meet that night and Thursday with counterparts from Britain, France, Germany, Italy, Canada and Japan in a reconstituted Group of 7.” Finally: “Mr. Obama and Mr. Putin will both be at Normandy on Friday for the 70th anniversary of the D-Day landings. No meetings are scheduled, but aides did not rule out an unscripted conversation.”\nUpdates on the June 3 primaries\nA Des Moines Register poll released over the weekend shows state Sen. Joni Ernst leading the Republican Senate field in Iowa with 36% of likely GOP primary voters -- followed by businessman Mark Jacobs at 18%, Matt Whitaker at 13%, and Sam Clovis at 11%. As we wrote on Friday, if no one clears 35%, then a nominating convention later this month will decide the winner. So this poll is good news for Ernst. And a Los Angeles Times/USC poll finds Gov. Jerry Brown (D) with a commanding lead in California’s top-two primary system. But it shows Republicans Neel Kashkari (at 18%) and Tea Partier Tim Donnelly (at 13%) running nearly neck and neck for the right to challenge Brown in the fall.\nPolling Edward Snowden\nFinally, speaking of polls, an NBC News poll unveiled on Sunday finds that 24% of registered voters say they back Edward Snowden’s release of information about how government agencies collect intelligence data to media outlets, compared with 34% who disagree with his actions. Another 40% said they didn’t have an opinion. (Yet among those who say they’ve closely followed the story, 49% oppose Snowden’s actions and 33% support them.) These overall numbers are essentially unchanged from a Jan. 2014 NBC News/Wall Street Journal, when 23% of registered voters said they supported Snowden’s actions, versus 38% who opposed them. Also from the poll: Americans -- by a 2-to-1 margin -- view Snowden in a negative light: 27% of voters have an unfavorable opinion of him, while 13% have a positive one. By comparison, a July 2013 NBC/WSJ poll had his fav/unfav score at 36% negative, 11% positive. However, the poll shows a striking difference of opinion in Snowden by age. Those ages 18 to 34 tend support Snowden’s actions (by 32% to 20%) and view him a favorable light, compared with all other age groups who don’t.\nClick here to sign up for First Read emails. Text FIRST to 622639, to sign up for First Read alerts to your mobile phone. Check us out on Facebook and also on Twitter. Follow us @chucktodd, @mmurraypolitics, @carrienbcnews","url":"https://www.nbcnews.com/politics/first-read/carbon-combat-obama-begins-battle-over-environmental-regulation-n120171"}
