{"authors":["Julie Cart","Dan Morain","Alastair Bland"],"date_download":"2018-10-30 22:57:00","date_modify":"2018-10-30 22:57:00","date_publish":"2016-12-29 18:26:59","description":"Cap and Trade in Two and a Half Minutes Salmon—made possible by the rivers they run in and the forest canopy above them—are the lifeblood of the Yurok","filename":"data/vaneerConsumption/CarboncuttersonedgeHopingCaliforniascapandtradeprogramsurvives.json","image_url":"https://calmatters.org/wp-content/uploads/OFFSET_Photo_1-thumbnail-1200x1200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940220.html","title":"Carbon cutters on edge: Hoping California's cap-and-trade program survives","title_page":"Carbon cutters on edge: Hoping California's cap-and-trade program survives | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Salmon—made possible by the rivers they run in and the forest canopy above them—are the lifeblood of the Yurok Tribe. The native word for salmon, Ney-puy, means “that which is eaten” and the iconic fish and its habitat sustain California’s largest tribe in ways that are both literal and metaphorical.\nHow this tribe, from its rugged stronghold on the Redwood coast of Humboldt County, became an early adopter of California’s cutting-edge carbon offset trade program speaks to the tribe’s ambitions for its future and the state’s ambitions for its signature environmental policy.\nIn 2014 the state’s Air Resources Board awarded the Yurok the first certified forestry carbon offset credits in California, after they placed more than 8,000 acres of Douglas fir and hardwood into the state’s carbon bank and pledged to leave the mature forest to absorb and sequester carbon for 100 years.\nThe tribe’s 836,619 offset credits could earn the Yurok as much as $7 million annually.\n“I think of offsets as economic diplomacy for climate mitigation,” said Brian Shillinglaw, who runs the U.S. offset projects for New Forests, which helped the Yurok through the state’s certification process. “It shows people that society values the ecosystem services of cap and trade. It’s changing hearts and minds, delivering revenue to landowners.”\nCalifornia’s cap-and-trade system is designed to induce polluting companies in the state to cut climate-warming greenhouse gases. Firms may either reduce emissions or buy carbon credits at auction.\nBut there is another alternative.\nThey may partially offset their own pollution creation by funding carbon-reduction projects. These “offset credits” may take place in the state or around the country.\nCalifornia offers offset credits for six different categories of eco-friendly endeavors, from leaving forests untouched to capturing the methane in cow manure. But, while the program has helped reduce greenhouse gas emissions and spurred worthwhile environmental projects, it has done little to win the hearts and minds of its critics.\nMany of those are business owners who operate under California’s cap-and-trade program, which sets a statewide ceiling on greenhouse gas emissions for several industries. And, because offsets are part of cap and trade, their future is caught in the limbo created by the a pending legal challenge.\nThat lawsuit—filed by California Chamber of Commerce, Morning Star Packing Co. and the National Association of Manufacturers—argues that cap-and-trade auction revenues amount to a tax, which to be levied would have required a two-thirds vote of the Legislature. The Chamber declined to comment for this article.\nThe years-long suit is coming to a close; oral arguments are scheduled for Jan. 24 at the Third District Court of Appeals in Sacramento.\nUncertainty about the future of the carbon auctions has not only roiled that carbon market but also given potential participants reason to rethink their participation.\n“The case is absolutely a massive cloud hanging over cap and trade and the offset program,” said Henry Horner, California product manager for CaliforniaCarbon.info, which analyzes the North American carbon market.\nGov. Jerry Brown maintains that the Air Resources Board has existing statutory authority to run both the cap-and-trade program and the carbon auction. The agency is moving forward as if that is the case, and is well along in a rulemaking process that may lead to some changes in cap and trade, at least in the short term.\n“We are reasonably confident that cap and trade is going to be operating until 2030,” Horner said, adding that the Democratic ‘supermajority’ in the California legislature could propel another push to enshrine cap and trade in law.\nNo one claims to have an accurate reading of how the court might rule, nor is there any certainty that if cap and trade went away, any of the offset projects tied to it would continue. Shillinglaw, who is a lawyer, said that the Chamber should drop its suit, but can’t say with certainty whether cap and trade would continue—only that it should.\n“Right now, we’ve been through the difficult part of the early birthing project, with the promise that there would be a program that, once stabilized, would persist,” said Chris Kelly, the California director of the Conservation Fund, which manages four forestry offset projects in the state. “Much of the money to develop the programs has already been spent. It would be a shame to see the state get this far and then have them drop it. I hope that doesn’t happen.”\nIndeed, the offset program has created a cottage industry of service providers, many in rural areas. And, proponents argue, the projects are driving innovation and rewarding efficiency in agriculture.\nBut not all of agriculture has embraced the program. Last year the state added a new offset: cultivating rice to reduce methane. It has yet to entice any California farmers to register projects. The simple reason? Money. While the Conservation Fund’s forest projects bring in $3 million a year—with administrative costs of about $150,000—the carbon offset reward isn’t enough to justify the upfront costs for rice farmers.\n“It’s not a highly attractive option right now, with the price of carbon where it is,” said Paul Buttner, environmental affairs manager for the California Rice Commission.\nIt costs about $1,200 an acre in California to produce rice and sell it, Buttner said. The industry’s calculation is that by the time farmers fill out the paperwork, enroll in the program, then institute the changes required, it might reduce emissions by about one-half a ton an acre,” Buttner said. “If you do the math, that’s $5 an acre. Unless the price of carbon doubles or triples over the current price, I can’t imagine them getting highly motivated to take part in the program.”\nButtner said he believes that rice operations in the Mississippi Delta were likely to join California’s offset program. “All is not lost,” he said.\nThe dairy industry tells much the same tale, citing the cost of purchasing expensive equipment as one barrier to taking part in the offset program. Most of the livestock methane-capture credits go to dairies in other states, although there are about a dozen such projects in California.\nThe forest projects award credits for managing woodlands to maintain large-diameter trees that store carbon, rather than growing for commercial timber harvests. Those legally-binding agreements call for a 100-year commitment to sustainable forestry.\nThe livestock offset comes when cattle growers reduce the methane generated by waste from dairy cattle. Generally, participating farmers pump manure into covered retaining ponds where the methane gas is captured and fed into generators that produce electricity.\nSimilarly, the rice-production innovation encourages farmers to institute a different planting and field-draining regime to reduce the amount of time that rice straw—organic matter left after rice cultivation—is flooded under water. The decomposition creates heavily polluting methane gas.\nAnd there’s an offset credit for operations that dismantle appliances and remove greenhouse gas-producing refrigerants that deplete the ozone layer.\nCalifornia’s offset program—with its blue-collar grounding in forests, farms and scrap yards— lacks the sex appeal of the online allowance auctions, which generate billions in revenue and have created a feeding frenzy among lawmakers eager to snag a share of the proceeds for their favorite initiatives.\nThe offset market itself is not operated by the state and the proceeds stay in private hands. But the establishment of an offset market in California tied to cap and trade has generated its own, somewhat more modest, benefit to the state economy by supporting agricultural innovation, employing out of work foresters and timber specialist, and creating a burgeoning infrastructure of analysts, economists, financiers, environmental scientists, carbon registries and international carbon brokers—a vertically integrated cap-and-trade services industry created from scratch.\nAnd, by including forestry and agriculture in the carbon market, California has expanded emissions reductions to new sectors.\n“It’s a valuable adjunct,” said Dave Clegern, a spokesman for the air board. “The offset program allows us to gain emissions reductions that would have gone uncounted or not happened at all.”\nBusinesses regulated under the emissions cap may use offsets verified by third-parties to meet as much as 8 percent of their obligations each year, although the most recent state figures show that only 4.4 percent of cap-and-trade compliance came from purchasing offsets.\nMore than 50 million offset credits have been issued by the state, each credit representing one ton of carbon reduction.\nHorner estimates about $200 million offset credits are sold annually. A credit on the offset market sells for 10 to 20 percent less than the allowance market, where the price is about $12.73 a ton.\nBy far the most common offset is created via forestry, and just getting into the project pipeline can take a year or more because of the state’s rigorous approval and compliance process. (The Yurok reaped their first credits two years after their project began.) Project managers identify trees according to species. Workers verify a project’s viability by measuring a tree’s girth, growth and ability to store carbon. The biometric analysis is regularly reviewed by state-certified firms. Landowners must pay third-party verifiers to certify each project, for decades.\n“It’s the level of statistical accuracy we use in a moonshot,” said the Conservation Fund’s Kelly. “It’s fiendishly complex. Offset project development in the forestry space is not for the faint of heart.”\nThe air board periodically reviews projects and if one fails to comply with state guidelines, it is subject to decertification. In 2014 the agency revoked the carbon credits for a facility in Arkansas that was removing ozone-depleting substances from machines prior to incineration.\nSome view the very notion of offsets as little more than paying people for not cutting trees, akin to agricultural programs that reward farmers for not growing certain crops. But supporters argue that the benefits from offsets flow two ways, rewarding a landowner or business for providing an environmental benefit that accrues to everyone, and helping the state meet its ambitious greenhouse gas reduction goals.\nShillinglaw said the value of the forest offset program isn’t limited to carbon-reduction. With all the scientific analysis of California forests, “the system has a side benefit of delivering more data on forest measurements than anyone has ever seen.”","url":"https://calmatters.org/articles/carbon-cutters-on-edge-hoping-californias-cap-and-trade-program-survives/"}
