{"authors":["Harriet Mallinson","Sophie Williams For Mailonline"],"date_download":"2018-10-23 02:26:15","date_modify":"2018-10-23 02:26:15","date_publish":"2016-01-28 17:13:54","description":"Video footage has emerged online of a car driving backwards at 60km an hour in China. Police have located the car but not the driver. They say the person behind the camera could be in trouble too.","filename":"data/vaneerConsumption/CarcaughtdrivingBACKWARDSinNanjingJiangsuProvinceChinaat60mph.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB560A00000578-0-image-a-25_1453995966990.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_peoplesdaily_article-3421132_Car-caught-driving-BACKWARDS-Nanjing-Jiangsu-Province-China-60mph_1540261575.html","title":"Car caught driving BACKWARDS in Nanjing, Jiangsu Province, China at 60mph","title_page":"Car caught driving BACKWARDS in Nanjing, Jiangsu Province, China at 60mph | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Navigating a busy road is hard at the best of times but one driver decided to make the experience even more challenging... by driving backwards.\nFootage posted online shows the car overtaking and changing lanes at nearly 40 miles per hour, the People's Daily Online reports.\nThe video was filmed in Nanjing, Jiangsu Province, China from a car driving behind - or rather in front - of the white car.\nDevil-may-care: The video filmed in Nanjing, east China shows a car driving backwards down a motorway\nThe car drives down the middle of the road before later successfully overtaking a truck as well as changing lanes.\nThe passenger and driver filming the video were stunned by the motorist's act and can be heard commenting on the unusual road stunt in Nanjing dialect.\nInternet users on Chinese social media expressed their concern at the driver's behaviour.\nThey managed to identify the neighbourhood sparking fears that pedestrians could have been hurt in the usually busy area.\nOne internet user wrote: 'people are really worried about the driver's behaviour'.\nMostly users on Weibo, the Chinese equivalent to Twitter, expressed their opinions in a joking way.\nA user named 'Zhu Xiao Le' said: 'Did [the driver] have eye at the back of his head?'\n'Jiangsu Wei Quan Ren Yu Hai' said: 'Excellent reversing skills.'\n'LY_527miss' commented: 'Real masters are among the people.'\nThe man is now being referred to as 'daochege' meaning reversing brother in Chinese.\nOvertaking: The motorist drives down the middle of the road before later successfully overtaking a truck\nLocal police told Chinese media yesterday that they were aware of the video and its popularity.\nThey said that they had located the car but had not managed to find the driver yet. Police say they will take appropriate action within regulations.\nHowever it's not just the driver of the white car that is in trouble.\nThe person filming the car is also driving at the same time.\nPolice say that according to traffic laws, his behaviour would interfere with safe driving meaning that he would be liable for a fine of £5.28 (50 yuan) and two demerit points on his license.\nThe World Health Organization has reported that more than 200,000 people die in China every year as a result of traffic accidents.\n'Much more needs to be done to spur the adoption of measures to raise road safety' Bernhard Schwartlander, the WHO's representative said.","url":"https://www.dailymail.co.uk/news/peoplesdaily/article-3421132/Car-caught-driving-BACKWARDS-Nanjing-Jiangsu-Province-China-60mph.html"}
