{"authors":[],"date_download":"2018-10-30 17:50:27","date_modify":"2018-10-30 17:50:27","date_publish":"2018-08-23 00:00:00","description":"Cardi B wants to stay by her daughter’s side as much as possible — out of fear that 3-mo...","filename":"data/vaneerConsumption/CardiBisscaredtoleavedaughterforlongstretchesoftimeIdon.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/23/Videos/4467288.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_celebrity-new_5e084f34ab08240d658aefc2a77fb81f__1540921827.html","title":"Cardi B is scared to leave daughter for long stretches of time: 'I don","title_page":"Cardi B is scared to leave daughter for long stretches of time: 'I don","title_rss":"NULL","source_domain":"ajc.com","text":"Cardi B wants to stay by her daughter’s side as much as possible — out of fear that 3-month-old Kulture Kiari may not remember her.\n“I don’t want to miss nothing from my baby,” the “I Like It” rapper, who welcomed her first child in July with husband Offset, says in this month’s PEOPLE en Español cover story. “I read that babies forget people so quick; I don’t want her to forget me. I don’t want her thinking that somebody else is her mom; I want her to love me as her mom.”\nCardi’s desire for quality time with Kulture led her to back out of Bruno Mars‘ 24K Magic World Tour. “I want to be the one that when she cries, I’m the one that stops her from crying. Seriously,” Cardi, 26, continues. “Being a week away, it would just drive me insane.”\n» Cardi B, Offset welcome baby girl in Atlanta\nIn July, Cardi announced her decision about the tour on social media. “I thought that after giving birth to my daughter that 6 weeks would be enough time for me to recover mentally and physically,” she wrote.\n“I also thought that I’d be able to bring her with me on tour, but I think I underestimated this whole mommy thing,” Cardi added at the time.\nWhen Cardi does need to leave home, she has multiple babysitters to turn to. “[When she’s] with my grandmother or with my mother, I balance it out because everybody gets tired,” Cardi explains to PEOPLE en Español. “I don’t like going to sleep and leaving them with the responsibility of my baby because I know they just as tired as me. Same way I wanna sleep, they wanna sleep.”\nKulture’s upbringing will be different from Cardi’s. “She’s gonna be raised in a big mansion. She’s most likely gonna get whatever she wants from me and her dad, but I also want her to be humble,” says the Bronx native, who once had a gig as a stripper.\n» Cardi B makes history as first female rapper with two Billboard No. 1 singles\n“So, yes, I will be taking her to her cousin’s, her grandmother’s house, and I would like her to see how the people in my community live. I would like for her to be humble, for her to want to share, for her not to be snobby,” Cardi continues. “I want her at least to speak four languages: Spanish, English, French and I’m really loving Italian. I love how those people talk!”\n“I’m very proud of my Hispanic heritage,” she notes.\nThe cover story comes after Cardi called out Nicki Minaj, 35, in 10 separate expletive-filled Instagram videos posted on Monday. Cardi’s clips were posted just hours after Minaj spoke about their ongoing conflict in the latest episode of her Queen Radio show on Apple Music’s Beats 1.\nCardi’s sister Hennessy Carolina recently claimed in a since-deleted Instagram post that Minaj leaked the “I Like It” rapper’s phone number, which led to threatening messages about baby Kulture. “After my sister showed those text messages, look what you do. You go on Twitter and start liking s—, endorsing that type of nasty ass f—— behavior. Bitch you’re f—— sick in the head,” Cardi said in the sixth video.\nCardi and Minaj’s exchange on Monday, comes seven weeks after videos of their now-infamous New York Fashion Week brawl were posted online. One clip showed Cardi charging at someone. In a different video, Cardi can be heard screaming “say some s— about my daughter [Kulture] again.”\n“Cardi walked towards Nicki and all of a sudden Cardi started screaming something about her child,” a source told PEOPLE. “She was yelling, ‘Bitch you feisty. Bitch don’t talk s— about my child’ at Nicki.”\nThe source also revealed Cardi “threw her shoe because she couldn’t get through” to Minaj who “was there with eight or nine bodyguards.”","url":"https://www.ajc.com/entertainment/celebrity-news/cardi-scared-leave-daughter-for-long-stretches-time-don-want-her-forget/xbSYO4kQQwgwjVPwXpG6IN/"}
