{"authors":[],"date_download":"2018-10-30 17:51:09","date_modify":"2018-10-30 17:51:09","date_publish":"2018-07-11 15:31:00","description":"Rapper and Migos member name their daughter Kulture Kiari Cephus","filename":"data/vaneerConsumption/CardiBOffsetwelcomebabygirlinAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/11/Videos/4436175.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_celebrity-new_7c50e96bc3486892d540881b0cd1d089__1540921869.html","title":"Cardi B, Offset welcome baby girl in Atlanta","title_page":"Cardi B, Offset welcome baby girl in Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"Cardi B has given birth to her baby girl.\nThe rapper and her husband, Migos member Offset, welcomed Kulture Kiari Cephus in Atlanta on Tuesday. Her middle name is after her father, whose legal name is Kiari Kendrell Cephus.\nThe 25-year-old first-time mom announced the news on Instagram on Wednesday.\n» Social media reacts to birth of Cardi B and Offset’s baby girl\nCardi B, whose legal name is Belcalis Almanzar, confirmed in June that she and Offset, 26, were married in a ceremony in their bedroom in September. Offset publicly proposed to Cardi on stage at Power 99’s powerhouse concert in Philadelphia in October.\nCardi revealed her pregnancy while performing on “Saturday Night Live.”\nKulture is the first child for Cardi and the fourth for Offset. He has three children from previous relationships.\nRELATED CARDI B / OFFSET NEWS\n» Cardi B becomes first female rapper to score two Billboard No. 1 hits\n» Offset and Cardi B’s ‘intimate’ texts hacked by website, lawsuit says\n» Offset calls pregnant Cardi B 'my wife' amid report they've already wed in Atlanta\n» Cardi B and Migos’ Offset pose for risqué Rolling Stone cover\n» Former manager sues Cardi B for $10 million\n» Migos star in hilarious Tasty video for new ‘Stir Fry’ song","url":"https://www.ajc.com/entertainment/celebrity-news/cardi-offset-welcome-baby-girl-kulture-kiari-cephus/mzyg7yoOlaoKsDkpDyrKUI/"}
