{"authors":[],"date_download":"2018-10-30 21:25:10","date_modify":"2018-10-30 21:25:10","date_publish":"2018-07-15 14:12:06","description":"Los Angeles (AFP) - The St. Louis Cardinals abruptly fired manager Mike Matheny on Saturday, ending his tenure with the Major League Baseball","filename":"data/vaneerConsumption/CardinalsAbruptlyFireManagerMikeMatheny.json","image_url":"https://media.breitbart.com/media/2018/07/AFP-Jonathan-Daniel.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2018_07_15__1540934710.html","title":"Cardinals Abruptly Fire Manager Mike Matheny","title_page":"Cardinals Abruptly Fire Manager Mike Matheny | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Los Angeles (AFP) – The St. Louis Cardinals abruptly fired manager Mike Matheny on Saturday, ending his tenure with the Major League Baseball club after six and a half seasons.\nThe surprise move came after an 8-2 loss to the Cincinnati Reds, their third straight defeat dropping them to 47-46 with the All-Star break approaching.\nHitting coach John Mabry and assistant hitting coach Bill Mueller were also dismissed.\nBench coach Mike Shildt will take over as interim manager, the Cardinals said.\n“Mike Matheny has served the St. Louis Cardinals organization with tremendous dedication and pride, and I am thankful for his service to the Cardinals over the past six and a half seasons,” club owner Bill DeWitt Jr. said in a statement.\n“On behalf of the entire Cardinals organization, I would like to wish Mike the very best.”\nMatheny, 47, was named the Cardinals manager on November 14, 2011 and compiled a 591-473 win-loss mark, which ranks fifth among Cardinals managers in wins.\nHe helped lead the team to the playoffs in 2012, 2013, 2014 and 2015, winning the National League championship in 2013.\n“These decisions are never easy, but we felt that a change in leadership was necessary as the team prepares to enter into the second half of the season,” said president of baseball operations John Mozeliak.\nShildt, 49, has been a member of the Cardinals organization since 2004 and has served on the team’s Major League coaching staff the past two (2017-18) seasons.\nHe managed eight seasons in the Cardinals’ minor league system.\nThe Cardinals said DeWitt and Mozeliak would hold a press conference on Sunday to discuss the move and additional staff changes.","url":"https://www.breitbart.com/sports/2018/07/15/cardinals-abruptly-fire-manager-mike-matheny/"}
