{"authors":["Stephanie Downs"],"date_download":"2018-10-31 01:43:58","date_modify":"2018-10-31 01:43:58","date_publish":"2018-08-27 21:27:31","description":"Cardi B and Offset's relationship seems to be hotter than ever, if a recent social media post is any indication. As Cosmopolitan noted, Cardi B and Offset had a flirty Instagram exchange over the weekend. Based off of Offset's comment on his wife's…","filename":"data/vaneerConsumption/CardiBOffsetsInstagramExchangeShowsThatTheyreEachOthersBiggestFans.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/39a0ecf3-fb48-431c-9e73-8ed92941409a-getty-858473738.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_cardi-b-offsets-instagram-exchange-shows-that-theyre-each-others-biggest-fans-10255061_1540950238.html","title":"Cardi B & Offset's Instagram Exchange Shows That They're Each Other's Biggest Fans","title_page":"Cardi B & Offset's Instagram Exchange Shows That They're Each Other's Biggest Fans","title_rss":"NULL","source_domain":"bustle.com","text":"Cardi B and Offset's relationship seems to be hotter than ever, if a recent social media post is any indication. As Cosmopolitan noted, Cardi B and Offset had a flirty Instagram exchange over the weekend. Based off of Offset's comment on his wife's latest snap, it's safe to say that he's her number-one fan.\nCardi started things off by posting a photo of herself on Instagram sporting a very different look. The \"Bodak Yellow\" singer can be seen posing in a plane while donning nothing but a long, bright pink wig and some black lingerie. She captioned the post with a simple, \"im on my way to see you.\" In short, she looked flawless. And her husband obviously thinks so, too.\nOffset had a little fun in the comments section of her post, as he replied with a cheeky message of his own. He wrote back simply, \"HURRY HURRY HURRY,\" in response to Cardi's caption. It is nice to see the new parents have a little fun. And this isn't the first time that they've put some of their sweeter relationship moments on display via social media. In fact, recently, the pair have been super into posting all about their relationship and giving their fans a glimpse at their tight bond.\niamcardib/Instagram (screenshot)\nPrior to this recent Insta snap, Cardi posted a photo of herself and Offset on Aug. 22. The photo appears to show the couple as they came back from a night out celebrating after the VMAs, seeing as though the \"I Like It\" singer won a slew of awards herself including Best New Artist, per Vulture.\nWhile the new mom didn't show off her daughter on the social site, she did give fans the smallest of glimpses at her little one in the photo. In the pic, captioned with \"KultureK,\" Cardi and Offset can be seen looking down adoringly at their baby. It's simply an adorable pic of the little family.\nCardi posted a similarly sweet snap of the fam soon after it was announced that she had given birth to Kulture in July. The singer and her husband took a minute to share an embrace as they headed to one of their daughter's doctor visits. It's clear that Cardi is loving motherhood, just based on all of the photos she's posted of her growing family.\nThe singer has also posted some pretty fancy snaps featuring her husband, too. On July 28, she revealed her new purchase to all of her Insta followers and it seriously gives new meaning to the word lavish. Cardi and the Migos rapper got matching his-and-hers gifts, actually. But, this wasn't your regular old present. The couple got matching green and blue Lamborghinis. In a later snap, Cardi explained on her Instagram Story that she had indeed purchases the cars, despite some naysayers saying she leased them. Talk about a fun couple's gift.\nBased on their recent flirty Instagram exchange, and a slew of other couple-centric pics, it appears as though Cardi and Offset really are in a good place right now.","url":"https://www.bustle.com/p/cardi-b-offsets-instagram-exchange-shows-that-theyre-each-others-biggest-fans-10255061"}
