{"authors":["Michelle Moons"],"date_download":"2018-10-30 21:34:32","date_modify":"2018-10-30 21:34:32","date_publish":"2015-07-29 14:43:26","description":"Once again, the Republican Party of California faces a fight over the planks of the party platform regarding social issues. |","filename":"data/vaneerConsumption/CARepublicansBraceforPlatformFightoverSocialIssues.json","image_url":"https://media.breitbart.com/media/2014/12/California-Tattoo-2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_07_29__1540935272.html","title":"CA Republicans Brace for Platform Fight over Social Issues","title_page":"CA Republicans Brace for Platform Fight over Social Issues | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Once again, the Republican Party of California faces a fight over the planks of the party platform regarding social issues.\nStephen Frank of capoliticalreview.com wrote Tuesday that power within the party had been ceded to elite, high-profile donors, meaning that basic party positions and functions had eroded over time.\nFrank detailed efforts to weaken the party platform, including proposed changes to the definition of marriage; on immigration policy and amnesty; on right-to-life and abortion positions; and on the right to keep and bear arms, to name a few. Each change serves to erode the spine of the party, he said, gradually transforming Republicans into milquetoast Democrats.\n“The good news is that [on] Saturday the Drafting Committee can assure Republican Platform for the Republican Party”….Words matter. Missing words matter even more,” Franks wrote. He noted that similar efforts were made four years ago, but those efforts were struck down.\nJon Fleischman, Politics Editor at Breitbart California and publisher of FlashReport.com, said, “Charles Munger Jr, who four years ago was supportive of efforts to water down the entire platform, has since invested significant financial resources to expand his influence over the California Republican Party. It’s quite possible he will succeed this go around.”\nEight California County Republican Party Chairs have signed a memo specifically backing the current platform writes Josh Richman in Political Blotter. That letter speaks of the four main compromises that Frank also notes: on immigration, marriage, life and the right to bear arms. “It is crucial that these four planks be upheld rather than be incrementally chipped away,” the memo states. “This Platform will serve to motivate our numerous volunteers and voters who will be needed to Get Out the Vote and rally around our candidates in 2016.”\nRichman notes polling that shows support for sanctioning homosexual marriage; however, the poll also notes statistics showing a majority in favor of non-traditional marriage in 2008, but that same year, Californians voted to uphold traditional marriage. Poll results also indicate that the recent change in views was motivated not by the will of the people, but by a 2013 Supreme Court decision on the issue.\nThe Fall 2015 California Republican Party convention will take place September 18-20 in Anaheim.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2015/07/29/ca-republicans-brace-for-platform-fight-over-social-issues/"}
