{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:55:25","date_modify":"2018-10-30 22:55:25","date_publish":"2016-01-13 08:00:00","description":"A strange thing is happening in Sacramento: voices on the political left and right are calling for the state to spend more money on services for","filename":"data/vaneerConsumption/CarefordisabledCaliforniansensnaredinCapitolpolitics.json","image_url":"https://calmatters.org/wp-content/uploads/rusty_boyer.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940125.html","title":"Care for disabled Californians ensnared in Capitol politics","title_page":"Care for disabled Californians ensnared in Capitol politics | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"A strange thing is happening in Sacramento: voices on the political left and right are calling for the state to spend more money on services for Californians with developmental disabilities.\nThe message is coming from Republican legislators, who have delivered boxes of petitions to Gov. Jerry Brown’s office, as well as labor unions that have mounted billboards in the Bay Area asking the governor to “Increase funding now!”\nIt’s not often that Republicans and organized labor take the same side. But unions are defending programs that employ their members to care for some of the roughly 300,000 Californians with autism, cerebral palsy and other developmental disorders. And Republicans are speaking up for a suite of services that have become a legacy for California’s GOP. The Lanterman Act that requires the state to provide care to the developmentally disabled was written by a Republican legislator and signed into law in 1969 by Republican Gov. Ronald Reagan.\nAdvocates argue that the system that cares for the developmentally disabled is on the brink of collapse because of a nearly decade-long freeze on the rate the state pays service providers.\n“I think they are definitely the most vulnerable part of our society and government has a responsibility to assist them,” said Assemblyman Tom Lackey (R-Palmdale), a former special education teacher who has a photo of himself with Reagan on the wall of his Capitol office.\nLackey was among the Republican lawmakers who brought petitions to the governor and participated in rallies around the state asking for more money to serve the developmentally disabled.\nRepublican support for the program is so strong that Brown appears to be using it to entice GOP lawmakers to help him achieve one of his priorities this year. Brown wants a new tax on health plans to replace one that’s been challenged by the federal government. But his proposal needs approval from two-thirds of the Legislature, which means the tax only moves ahead with the support of all Democrats and at least two Republicans in the Assembly and one in the Senate.\nThe new state budget Brown proposed last week provides $6.4 billion for services for the developmentally disabled. That includes an increase of $130 million – less than half the amount advocates want. It makes additional funding contingent on the Legislature approving the health care tax, which Brown said “would be a very wise investment on the part of my Republican colleagues.”\nSo far, Republicans have argued that a tax isn’t necessary because the state is flush with cash. They say Democrats who control the state budget could choose to pay for the services through the general fund. The Legislature’s Democratic leaders proposed increased funding for disability services last year but lost the money in final budget negotiations with Brown.\n“I am appalled that the governor is attaching funding for people with developmental disabilities to any tax,” said Barbara Maizie, executive director of Contra Costa ARC, which offers services for disabled residents of the East Bay.\nHer agency recently closed a preschool program that provided intensive help to children with speech and motor delays. Maizie blamed the state’s rate freeze, saying the program requires more staff than state funding could support.\n“The obvious thing is that we’re being used as a pawn in that political battle,” she said.\nLegislators are feeling the heat from advocates and can see how funding problems have impacted services for disabled people in their communities, said Sen. Mark Leno (D-San Francisco), who chairs the Senate’s budget committee.\n“There are always tipping points and I think we may be there right now,” he said, adding that the health care tax Brown is advocating would provide a long-term source of funding for disability services.\nIncoming Assembly Speaker Anthony Rendon (D-Lakewood) said he supports boosting funding for those services “either way” – from the proposed tax or the state’s general fund.\nBrown’s move to attach the funding to the health care tax could wind up being an effective political move, said Bill Whalen, who served as the chief speechwriter for Republican Gov. Pete Wilson.\n“It’s a very clever ploy by the governor… He needs an enticer. He needs a reason to bring the Republicans to the table,” Whalen said.\n“There aren’t many programs you could talk about spending more money on and make Republicans happy, but this is a lone exception to the rule. It’s smart politics by the governor going straight to what the Republicans care about.”\nIn other words: Politics are brutal. And that’s how deals are made.","url":"https://calmatters.org/articles/care-for-disabled-californians-ensnared-in-capitol-politics/"}
