{"authors":[],"date_download":"2018-10-22 21:13:10","date_modify":"2018-10-22 21:13:10","date_publish":"2014-05-06 13:32:15","description":"U.K.-based P2i specializes in nano-coating technology that the company says could revolutionize both the electronics and manufacturing industries.","filename":"data/vaneerConsumption/CareForaDipDunkableCoatingMakesGadgetsWaterproof.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/422951/140506-waterproof-cellphones-934_b77df0953d948435954d09d3658100df.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_innovation_care-dip-dunkable-coating-makes-gadgets-waterproof-n98091_1540242790.html","title":"Care For a Dip? 'Dunkable' Coating Makes Gadgets Waterproof","title_page":"Care For a Dip? 'Dunkable' Coating Makes Gadgets Waterproof","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIt's a soul-destroying situation: watching your cell plunging into a toilet, down a drain or into some other watery grave. One unfortunate woman hit the news last month after getting stuck in a storm drain rescuing her smartphone.\nFor years, people have tried to salvage their soaked cells in a variety of ways – everything from putting it in a bag of rice to placing it in the freezer with fingers crossed.\nAll this could be about to change, however. U.K.-based P2i specializes in nano-coating technology, and it says it's developed a coating that could revolutionize both the electronics and manufacturing industries.\nRead More: Wearable tech: It could save your life\nDunkable, described by P2i as a 'hydrophobic barrier technology', enables phones to be submerged underwater without any ill effects.\n\"With an untreated device, (getting wet) causes electrochemical migration – corrosion to you and me. It actually starts to rust up, and then the device doesn't function anymore,\" Stephen Coulson, chief technology officer of P2i, told CNBC in a phone interview.\n\"What the Dunkable technology does is provide a barrier layer, which is extremely thin, but prevents this electrochemical migration occurring and doesn't damage any of the electronics … or the general working of the device.\"\nRead More: 10 innovations that changed the world\nAccording to Coulson, P2i's technology has implications not only for the functionality of electronic devices, but the way in which they are manufactured too.\n\"There's some technology where you have to put on rings or gasket seals to actually physically prevent the water from getting in,\" he said. But with nano-coating, none of these - sometimes clunky - add-ons are required.\n\"It saves (manufacturers) time, it saves them money, it gives them a massive increase in reliability. It's a low barrier to entry for them,\" Coulson added.\nLater this year, Dunkable-treated phones will be available to buy, and Coulson is thinking big.\n\"This is massive. It's kind of like the holy grail of what the electronics industry has been after,\" he said. \"Now we have this mass-manufacturable solution. We can apply this technology to any solid object.\"\nAnd while companies like P2i are trying to change the way devices are built, some companies are aiming to transform the factories that build them. We are, according to some, now in the era of the \"smart factory\".\nU.K.-based Ubisense provides tracking technology to companies including Aston Martin, BMW and Deutsche Telekom to make their manufacturing processes more efficient.\nRead More: Solar gadgets that could save the planet\n\"We have a set of sensors we can deploy around a factory that give us very precise information about where… items are, down to a centimetre, level,\" Andy Ward, chief technology officer of Ubisense, told CNBC.\nThis exact-location data helps manufacturers drive down costs and improve efficiency.\n\"You can take a lot of manual processes out of manufacturing by having the factory make the decisions about what has to happen to a particular piece of work… as it goes through the factory floor,\" Ward said.\n\"It's turning the factory from a very specialized thing that makes one thing into something that's adaptable and can make a wide range of things in the order they're needed by the customer,\" he added.\n-- Anmar Frangoul, Special to CNBC.com","url":"https://www.nbcnews.com/tech/innovation/care-dip-dunkable-coating-makes-gadgets-waterproof-n98091"}
