{"authors":["Emma Glanfield For Mailonline"],"date_download":"2018-10-23 02:37:14","date_modify":"2018-10-23 02:37:14","date_publish":"2016-01-28 17:28:53","description":"Amzad Hosein, 62, is accused of raping the vulnerable woman, who cannot be identified for legal reasons, on two occasions at the care home near Leatherhead, Surrey.","filename":"data/vaneerConsumption/CarehomedeputymanagerAmzadHoseinrapedaseverelydisabledfemaleresident.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/17/30AB2E4500000578-0-image-a-9_1454001559576.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421347_Care-home-deputy-manager-raped-severely-disabled-female-resident-bedroom-twice_1540262234.html","title":"Care home deputy manager Amzad Hosein 'raped a severely disabled female resident'","title_page":"Care home deputy manager Amzad Hosein 'raped a severely disabled female resident'  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Amzad Hosein, 62 (pictured outside court today), is accused of raping the woman, who cannot be named for legal reasons, on two occasions at the home near Leatherhead, Surrey\nThe deputy manager of a care home raped a severely disabled resident after she blurted out that he had a bigger penis than her boyfriend, a jury heard today.\nAmzad Hosein, 62, is accused of raping the woman, who cannot be identified for legal reasons, on two occasions at the care home near Leatherhead, Surrey.\nThe allegations only came to light when the woman, who has a severe mental disability, mentioned in passing to one of his colleagues that she had seen his penis when he came into her bedroom.\nShe went on to claim that Hosein had gone on to have sex with her, Guildford Crown Court heard.\nShe then repeated the allegations when approached by another member of staff - after the care home's manager did not take any action when the claim was first reported to her, jurors heard.\nHosein - who was known as Toy to staff and residents at the care home - is accused of having sex with the woman twice, which he denies.\nHis alleged victim told police that she had had sex with her boyfriend before but did not enjoy her experience with Hosein as it hurt her.\nThe woman's disability is such that she is unable to say when the sex attack took place - simply that it happened at some point between December 1999 and February 2013.\nGabby Henty, prosecuting, told the six men and six women on the jury: 'This case concerns the alleged rape of a lady who is a vulnerable lady and who is a resident in a care home.\n'The prosecution say that the person responsible was this defendant, Amzad Hosein, a care worker in the care home involved, whose job it was to look after her.\n'Her disability means that she is permanently fully dependent on care staff at the home where she lives to meet all her needs.\n'She had a close relationship with a man who was also a resident. It could be described as boyfriend and girlfriend. There were times when they were physically intimate together.\n'Towards the end of September 2013 she remarked to another carer, Rosario Faux, that her boyfriend had a little penis and that Toy had a big penis.\n'[The woman] told how Toy had shown her his penis as he came out of the bathroom and had told her to open her legs.\n'She then became withdrawn and wouldn't say any more.\n'Rosario Faux reported what had been said, to Dina Non, the care home manager at the time. At that stage she took no action.\n'Another member of staff, Carla Withers, became aware of her complaint from Rosario. [The woman] told them Toy had shown her his penis.\n'Dina Non became involved again at the instigation of Carla Withers. She questioned [the woman], who repeated the allegation.'\nThe police were then called and the woman was interviewed by Detective Constable Paul Thomas.\nMiss Henty told the jury: 'She told the officer on two occasions the defendant had put his penis in her vagina. When asked how it made her feel, she said \"sad\".\n'She said it hurt her and she didn't like it.\n'She alleged Toy had penetrated her vagina and she alleged she didn't consent to the penetration.'\nHosein was arrested and gave a no comment interview to officers, having provided them with a pre-prepared statement denying he had had sex with the woman.\nHosein - who was known as Toy to staff and residents at the care home - is accused of having sex with the woman twice, which he denies. He is pictured above outside Guildford Crown Court today with his partner\n'According to the defendant there never was any sexual contact between himself and the complainant at all,' Miss Henty told the court.\nShe added: 'It is the Crown's case however that the defendant acted in a gross breach of trust placed on him as a person employed to care for [the woman].\n'He preyed upon her vulnerability and used her for his own sexual gratification by raping her in the very place where she should have been safe - in the care home.'\nThe jury was played a DVD recording of the alleged victim's second interview with Det. Con. Thomas on November 13, 2013.\nIn it she said she understood sex to mean kissing on the lips - which she said she had done with her boyfriend - and did not know where babies came from.\nShe said she remembered seeing Hosein's penis and added she was 'serious' about the allegation.\nDuring the interview she claimed she had been in her room watching TV when Hosein came in.\nWhen asked where Hosein had touched her, the woman said 'inside, here' and pointed at her vagina.\nIt is the Crown's case that he preyed upon her vulnerability and used her for his own sexual gratification by raping her in the very place where she should have been safe Gabby Henty, prosecuting\nWhen asked to explain how Hosein had touched her, she said: 'Toy's penis, in.' After a pause the woman added: 'I not like it.'\nShe added it was night time when it happened and she was wearing a nightie, but could only recall it occurred a 'long time ago'.\nWhile being questioned by police she said she had had penetrative sex with her boyfriend once before. When asked to compare her experiences, she said she did not enjoy being penetrated by Hosein as it hurt her.\nShe said Hosein helped to wash and clothe her each day, but she would wash her intimate areas herself.\nHosein, of Croydon, Surrey, is charged with two counts of rape to account for the fact the relevant law changed during the period of time the woman lived in the upstairs flat.\nHosein also faces charges of sexual activity with a person with a mental disorder by a care worker - said to have taken place between May 1, 2004, and February 1, 2013 - and of unlawful sexual intercourse with a patient between December 16, 1999 and April 30, 2004.\nMiss Henty explained that the jury could convict him of one of those offences if they are sure Hosein had sex with the woman's consent.\nThe two counts again reflected the fact the relevant law changed during the time frame the offences were claimed to have taken place.\nHosein denies all the charges.","url":"https://www.dailymail.co.uk/news/article-3421347/Care-home-deputy-manager-raped-severely-disabled-female-resident-bedroom-twice.html"}
