{"authors":["Assemblyman Tim Donnelly"],"date_download":"2018-10-30 22:10:45","date_modify":"2018-10-30 22:10:45","date_publish":"2015-01-01 12:55:35","description":"Effective January 1st, drivers in California will be in for a shock as gas prices jump. This overnight price increase has nothing to do with the fluctuations of the market, nor will drivers be getting a better grade of gasoline. It’s simply the price of supporting a government that wants to control your every move. |","filename":"data/vaneerConsumption/CARingsinNewYearwithGasTaxHike.json","image_url":"https://media.breitbart.com/media/2014/12/california-gas-pump-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_01_01__1540937445.html","title":"CA Rings in New Year with Gas Tax Hike","title_page":"CA Rings in New Year with Gas Tax Hike | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Under complete Democrat domination, Gov. Jerry Brown’s appointee to the California Air Resources Board (CARB), Mary Nichols, has decreed that every driver must pay for another level of government control. As California singlehandedly attempts to combat the ever-elusive “global warming”—now conveniently renamed “climate change”— CARB is putting gasoline and diesel fuel under the Cap-and-Trade scheme authorized by AB32 (known as the Global Warming Solutions Act)\nIt doesn’t matter that theres no evidence that raising the cost of fuel will do anything to alleviate a problem that is rooted in llaklitics instead of science. By requiring refiners to buy a permit, this unelected board is doing nothing more than confiscating capital from ordinary Californians. Even though the cost is passed on at the pump, it will be paid by more than just drivers: the cost of every product that must be transported on California roads will cost more.\nAnd for what? The only clear beneficiary of this hidden tax on fuel are the bureaucrats whose ranks will increase, and the Democrat politicians whose socialist programs will be funded, further solidifying their control over every Californian. This is how government continues to grow faster than the economy at large—and the never-ending growth of government is the greatest threat to our future, and our freedom. Tomorrow, 900 new laws take effect, many of which limit our freedom or raise the cost of living in the most oppressed state in the union.\nThe response of the Democrat masters of our state has been laughable. Last summer, a number of Democrat politicians signed onto a letter asking CARB to delay a gas tax hike that will hit the poorest the hardest–but that was ignored. Then they spoke and voted in favor of a bill—AB 69 by Central Valley Democrat Henry Perrea—that would legislatively delay the tax’s implementation.\nIn spite of the fact that Democrats had a legislative supermajority at the time, the bill died in committee. That’s usually what happens to Republican bills that are good for the average, hard-working California taxpayer. It wasn’t because they couldn’t pass it–it’s because they wanted to pretend to address the problem at election time.\nThe public sector unions legally bribe more Democrat politicians to grow government, thereby increasing their fiefdoms by passing even more laws requiring even more regulators to enforce them, and more social programs requiring even more administrators to administer. That translates into reliable voting blocks and steady and strong financing for the campaigns of anyone willing to play the game.\nIn the end, it’s the little guy who pays for all this government expansion through increased taxes—most of which are hidden as fees or simply passed on in the cost of a necessary commodity such as gasoline that everyone must purchase. By the time the public is forced to pay the additional cost, the outrage is diffused. The average citizen won’t know who to blame. The Democrats, however, will remedy that in short order. They’ll gin up public anger at the oil companies, and raise public ire and campaign funds in the process.\nDemocrats have played the voters for fools because they control every constitutional office and both the Assembly and the Senate–and yet, they refused tot kill this egregious tax on every hard-working Californian who drives to work. Their domination will not last forever. One massive tax penalty is looming and will hit many Americans as they try to recover from a job loss.\nThis could be the straw that breaks the camel’s back.","url":"https://www.breitbart.com/local/2015/01/01/ca-rings-in-new-year-with-gas-tax-hike/"}
