{"authors":["Alex Swoyer"],"date_download":"2018-10-30 19:46:33","date_modify":"2018-10-30 19:46:33","date_publish":"2015-04-15 13:33:48","description":"On tax day, former HP CEO Carly Fiorina, a likely presidential candidate, took to Facebook to say the current tax system is in need of reform. You deserve to have a tax code that is transparent and fair so that everyone--whether you work for a small business or just want to keep a little more of your own money-- has the opportunity to compete and thrive,” said Fiorina. |","filename":"data/vaneerConsumption/CarlyFiorinaOurCurrentTaxSystemIsInDesperateNeedofReform.json","image_url":"https://media.breitbart.com/media/2015/02/carly-fiorina-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_15__1540928793.html","title":"Carly Fiorina: 'Our Current Tax System Is In Desperate Need of Reform'","title_page":"Carly Fiorina: 'Our Current Tax System Is In Desperate Need of Reform' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Former HP CEO Carly Fiorina, a likely presidential candidate, took to Facebook to voice her opinion on Tax Day, saying the current tax system is in need of reform.\n“The complexity and lack of transparency only benefits the powerful and connected while crushing small businesses and innovation. The result is crony capitalism–because only big businesses can handle big government,” wrote Fiorina.\nShe said Washington doesn’t examine the budget properly and that causes tax dollars to be wasted.\n“What we do know is that every year, every government agency spends every dime they are entitled to, whether they need to or not,” Fiorina added.\n“I started my career in Washington, D.C. and sold to the federal government. As anyone who has done business with the federal government knows, in the last six weeks of every year, every government agency spends every dime,” she continued. They do that because they want to make sure the appropriations process is focused on the rate of increase for the following year – not what they actually need or whether they actually need to spend it.”\nFiorina said it is time for America to move to a zero-based budgeting and simplify the tax code.\n“You deserve to understand where your money is going. You deserve to have a tax code that is transparent and fair so that everyone–whether you work for a small business or just want to keep a little more of your own money– has the opportunity to compete and thrive,” said Fiorina.","url":"https://www.breitbart.com/politics/2015/04/15/carly-fiorina-our-current-tax-system-is-in-desperate-need-of-reform/"}
