{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 21:23:42","date_modify":"2018-10-30 21:23:42","date_publish":"2016-02-05 18:48:17","description":"Five Republican candidates for President (Sen. Marco Rubio, Sen. Ted Cruz, Jeb Bush, John Kasich, and Carly Fiorina) find themselves within the margin of error for second place in the latest WBUR New Hampshire GOP Primary poll, which shows Donald Trump leading the pack with 29 percent of those surveyed supporting the business mogul. |","filename":"data/vaneerConsumption/CarlyFiorinaFightsfor2ndinLatestNewHampshirePollTrumpAhead.json","image_url":"https://media.breitbart.com/media/2015/09/GettyImages-489586268-e1443323372321.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_05__1540934622.html","title":"Carly Fiorina Fights for 2nd in Latest New Hampshire Poll: Trump Ahead","title_page":"Carly Fiorina Fights for 2nd in Latest New Hampshire Poll: Trump Ahead | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Five Republican candidates for President (Sen. Marco Rubio, Sen. Ted Cruz, Jeb Bush, John Kasich, and Carly Fiorina) find themselves within the margin of error for second place in the latest WBUR New Hampshire GOP Primary poll , which shows Donald Trump leading the pack with 29 percent of those surveyed supporting the business mogul.\nWhile four of the five candidates will be seen on stage Saturday for the ABC News Republican primary debate, Carly Fiorina, the former HP executive and successful entrepreneur, has not been invited to participate.\nThe latest New Hampshire poll shows her ahead of Republican competitors Chris Christie and Ben Carson, both of whom will be participating in the debate.\nBefore the polling came out indicating she was within the margin of error to finish in 2nd place in New Hampshire, Fiorina appeared Friday morning on Breitbart News Daily to discuss the snub.\n“The fact that I’m not on that debate stage is proof positive that the game is rigged,” she told Breitbart News Executive Chairman Stephen K. Bannon. “The game is rigged.”\n“We had a real vote in Iowa. And I beat a couple of the people on that debate stage. And I have delegates,” she added.\n“This isn’t just about me on the debate stage. It’s about the voters of this nation,” Fiorina told Bannon. “In particular it’s about the voters of Iowa who’ve basically been told your vote doesn’t count.”\n“The American people now must demand a leader, a President, a Commander in Chief who will challenge the system, who will produce results, who will restore power for all … If we are having the votes discounted in favor of backroom deals between political establishment leaders in Washington and establishment leaders in New York, then our country is being taken away from us,” she concluded.\nFellow candidates Donald Trump, Sen. Ted Cruz (R-TX), and Dr. Ben Carson have all called for Fiorina to be included in Saturday’s debate.\nThe others remained “silent, maybe they’re afraid to debate me,” Fiorina opined.\nFiorina also took to Facebook Friday morning, writing:","url":"https://www.breitbart.com/politics/2016/02/05/fiorina-fights-for-2nd-in-latest-new-hampshire-primary-poll-trump-ahead/"}
