{"authors":["Sportsmail Reporter"],"date_download":"2018-10-23 01:15:08","date_modify":"2018-10-23 01:15:08","date_publish":"2016-01-29 15:04:03","description":"Ahead of this weekend's FA Cup action, Sportsmail will be providing you with all you need to know about every fixture, with team news, provisional squads, betting odds and Opta stats.","filename":"data/vaneerConsumption/CarlislevsEvertonTeamnewskickofftimeprobablelineupsoddsandstatsfortheFACupclash.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B1BE1500000578-0-image-a-20_1454079831114.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422929_Carlisle-vs-Everton-Team-news-kick-time-probable-line-ups-odds-stats-FA-Cup-clash_1540257308.html","title":"Carlisle vs Everton: Team news, kick-off time, probable line-ups, odds and stats for the FA Cup clash","title_page":"Carlisle vs Everton: Team news, kick-off time, probable line-ups, odds and stats for the FA Cup clash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ahead of this weekend's FA Cup action, Sportsmail will be providing you with all you need to know about every fixture, with team news, provisional squads, betting odds and Opta stats. Here is all the information you need for Everton's trip to League Two side Carlisle.\nTeam news\nCarlisle\nHallam Hope will line up against the side he played more than 10 years for when Carlisle host Everton. The 21-year-old striker is on loan at Carlisle from Bury and could lead the line.\nMidfielder Gary Dicker may also start the game despite holding talks over a move north of the border to Kilmarnock.\nProvisional squad: Gillespie, Raynes, Ellis, Atkinson, Gillesphey, Dicker, Hery, Kennedy, Ibere, Hope, Wyke, Hanford, Bacon, Balanta, Gilliead, Comley, McQueen, Sweeney, Asamoah, Miller, Douglas, Joyce, Thompson\nCarlisle United manager Keith Curle will welcome Everton to Brunton Park in the FA Cup\nEverton\nKevin Mirallas will have a late fitness test on a tendon injury ahead of the trip.\nMidfielder Muhamed Besic also missed the club's midweek Capital One Cup semi-final exit at Manchester City and will not be ready for this weekend.\nJoel Robles will keep his place in goal, as has been the case for cup matches.\nProvisional squad: Robles, Oviedo, Jagielka, Funes Mori, Galloway, Cleverley, McCarthy, Osman, Lennon, Kone, Pienaar, Howard, Stones, Baines, Pennington, Barry, Deulofeu, Lukaku, Rodriguez, McAleny.\nEverton forward Kevin Mirallas will have a late fitness test on a tendon injury ahead of the trip\nKey match stats (supplied by Opta)\nCARLISLE v EVERTON Kick-off: Sunday, 1.30pm - BT Sport Odds (subject to change): Carlisle: 6/1 Draw: 19/5 Everton: 1/2 Referee: Lee Mason Managers: Keith Curle (Carlisle), Roberto Martinez (Everton\nEverton have progressed in their last eight FA Cup ties against lower league opposition, scoring 26 goals in the process and conceding just five.\nThese sides have met three times in the FA Cup in the past, with Everton winning on each occasion (1930, 1968 and 2010).\nIndeed, the Cumbrians have won just one of their last 14 FA Cup ties against top flight opposition, beating QPR 1-0 in January 1986 (D2 L11).\nThe Toffees have reached the fifth round of the FA Cup in four of the previous five seasons.\nRomelu Lukaku has scored in all three of his FA Cup appearances for Everton.","url":"https://www.dailymail.co.uk/sport/football/article-3422929/Carlisle-vs-Everton-Team-news-kick-time-probable-line-ups-odds-stats-FA-Cup-clash.html"}
