{"authors":["Jack Bezants For Mailonline"],"date_download":"2018-10-22 21:01:58","date_modify":"2018-10-22 21:01:58","date_publish":"2016-01-29 05:29:51","description":"Carlisle United chairman Andrew Jenkins has blasted Premier League clubs for ignoring his ask for help when the club's Brunton Park stadium was flooded last month.","filename":"data/vaneerConsumption/CarlislechairmanblastsPremierLeagueclubsafteronlyEvertonandSunderlandofferprizesforaraffletohelpfloodclearup.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/05/308078CB00000578-0-image-a-230_1454045224008.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422222_Carlisle-chairman-blasts-Premier-League-clubs-Everton-Sunderland-offer-prizes-raffle-help-flood-clear-up_1540242118.html","title":"Carlisle chairman blasts Premier League clubs after only Everton and Sunderland offer prizes for a raffle to help flood clear-up","title_page":"Carlisle chairman blasts Premier League clubs after only Everton and Sunderland offer prizes for a raffle to help flood clear-up | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Carlisle United chairman Andrew Jenkins has blasted Premier League clubs for ignoring his plea for help when the club's Brunton Park stadium was flooded last month.\nJenkins, 79, claims he wrote to Premier League sides requesting prizes for an auction where the funds raised would have gone towards helping the clean-up.\nCarlisle's FA Cup fourth round opponents Everton and Sunderland were the only ones that Jenkins heard back from.\nCarlisle United chairman Andrew Jenkins claims Premier League clubs ignored his calls for help last month\nLeague Two Carlisle's Brunton Park ground was badly affected by the floods across Cumbria last month\nOne of the two Premier League sides Jenkins said he heard back from was their FA Cup opponents Everton\n'My son held a dinner for the Cumbria Flood Recovery Appeal,' Jenkins said to The Sun. 'We made about £4,000 on an auction and about £14,000 altogether.\n“I had written to a few clubs. The big London ones, large clubs in the North West, some much closer to home here, and even north of the border.'\n'Sunderland sent three items, one of which was four tickets to their game with Man City. Everton sent some memorabilia to be auctioned and Rangers sent us something.\nCarlisle said Sunderland also offered a prize to the raffle where funds raised would help with the clean up\nCarlisle, 11th in League Two, hope to spring an upset at home against Everton in the FA Cup on Sunday\n'But that was it. I was disappointed with some of the big clubs. They couldn't even send a shirt or something like that.'","url":"https://www.dailymail.co.uk/sport/football/article-3422222/Carlisle-chairman-blasts-Premier-League-clubs-Everton-Sunderland-offer-prizes-raffle-help-flood-clear-up.html"}
