{"authors":["Francesca Chambers","White House Correspondent For Dailymail.Com In Des Moines"],"date_download":"2018-10-22 20:12:56","date_modify":"2018-10-22 20:12:56","date_publish":"2016-01-29 00:40:57","description":"'The entire lead up to this debate was whether Donald Trump was going to show up to the next debate,' Rick Santorum, a former U.S. senator, barked.","filename":"data/vaneerConsumption/CarlyFiorinasattackonHillaryClintonishitofthenightforundercardGOPers.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/30AE552900000578-0-image-a-2_1454031558492.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421992_Republican-undercard-candidates-complain-Trump-s-shadow-Iowa-s-Hillary-gets-booed_1540239176.html","title":"Carly Fiorina's attack on Hillary Clinton is hit of the night for undercard GOPers","title_page":"Carly Fiorina's attack on Hillary Clinton is hit of the night for undercard GOPers | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Republican presidential candidates relegated to an early debate spent the night in Donald Trump's shadow once again even though the billionaire wasn't on stage, let alone at the debate site.\nTrump skipped tonight's main stage debate to hold his own event across town benefiting veterans amid a tiff with the host of the evening's festivities, Fox News.\nAnd yet, the frontrunner came up multiple times in the so-called 'undercard' debate as low-polling candidates tried to soak up what little limelight was left ahead of the first 2016 contest, on Monday, in Iowa, where tonight's debates took place.\nIt was a hit on Hillary Clinton that set Carly Fiorina apart from the competition, though.\n'She's escaped prosecution more times than El Chapo,' Fiorina said. 'Perhaps Sean Penn should interview her.'\nIt was a hit on Hillary Clinton that set Carly Fiorina apart from the competition. 'She's escaped prosecution more times than El Chapo,' Fiorina said. 'Perhaps Sean Penn should interview her'\nRepublican presidential candidates relegated to an early debate kicked off the night by blaming the media and its focus on Donald Trump for their campaign woes. From left to right they are: Rick Santorum, Carly Fiorina, Mike Huckabee and Jim Gilmore\n'The entire lead up to this debate was whether Donald Trump was going to show up to the next debate,' Rick Santorum, a former U.S. senator, barked.\nShe added: 'The woman should be prosecuted.'\nFiorina insisted that her assaults on Clinton weren't 'personal' - at the last debate she said she enjoyed going home to her husband unlike the other woman in the race - yet in the next breath said the former first lady 'will do anything to gain and hang on to power.'\n'Listen, if my husband did what Bill Clinton did, I would have left him long ago,' she said.\n'So, here's the deal. Hillary Clinton has been climbing the ladder to try and get power and here now she is trying for the White House. She is probably more qualified for the big house, honestly.'\nFiorina accused Hillary and her husband Bill of abiding by a separate set of rules she dubbed 'The Clinton way.'\n'Say whatever you have to say, do whatever you have to say. Lie as long as you can get away with it. Hillary Clinton cannot be the president of these United States,' the Republican candidate said.\nWhen she previously brought up Clinton, the top Democrat running, and the Benghazi, Libya, attack the crowd booed.\nDrawing on Clinton's infamous 'what difference does it make' remark at a congressional hearing, Fiorina blasted Clinton for what she perceived as a nonchalant reaction to the attack.\n'When terrorists purposefully attack an American embassy and kill four Americans, including an ambassador, and the next morning you get up and you lie about a videotape that doesn't represent our values, instead of saying the United States of America was purposefully attacked by terrorists, and we will seek retribution, then you are saying to every adversary and every terrorist organization on the planet, it's open season.\n'That, Mrs. Clinton, is what difference it makes,' she stated.\nFiorina stayed focused on Clinton, taking swipes at her several times throughout the debate.\nJim Gilmore, a former governor of Virginia who has barely made any of the debates but was included tonight, also went after her, saying during a discussion on guns, 'If gun control comes to the President's desk when I'm president, I'll veto it as fast as it takes Hillary Clinton to eliminate her emails.'\nMore than Clinton, though, the candidates directed their ire at the media, whom they accused of enabling Trump and blamed for their meager poll numbers.\n'The entire lead up to this debate was whether Donald Trump was going to show up to the next debate,' Rick Santorum, a former U.S. senator, barked.\nTrump arrived at his own event, where a long line of supporters were waiting for him, in his private jet (pictured)\nHis own stage awaits: The podium was set up for Trump at Des Moines before the event in aid of veterans kicked off at 9pm\nSantorum complained in his first answer of the night that the 2016 coverage favored an 'entertainer' over candidates serious about discussing the issues - then backed down when asked to name names.\n'I'm not going to throw mud at anybody on this stage tonight. I'm not going to throw mud at anybody on the stage later,' he said. 'I'm not going to attack Donald Trump.'\nYet, Santorum was one of two candidates on the stage this evening who attended Trump's event after their own.\nDuring the debate Santorum said his reason for attending the Trump event was plain and simple: it benefited veterans.\n'I had some time because I'm not doing anything at 9 o'clock tonight,' he said, rejecting a suggestion that he's trying to cozy up to the race's frontrunner, and 'so I'm going.'\nIn the spin room after, Santorum told reporters, ‘I was invited to an event to go and help raise money for veterans…one of the things that you guys seem to focus a lot on is somehow or another that this is just a dog-eat-dog, zero-sum game that you actually can’t, even in the course of a campaign, work together to do something positive for America.\nMaybe this is just showing that things aren’t as zero-sum as some have suggested, that we can actually take a pause, do something that’s positive for our nation’s veterans an then go back.'\nMike Huckabee and Rick Santorum joined Trump at the veterans event after their debate ended\nAnd he admitted, he did have an ulterior motive for going.\n'I’ll be very honest with you, at that event I’m gonna be asking people to vote for me at the caucus. I’m not gonna be shy about that,' he said. 'Anytime I can get in front of a group of Iowans, I’ll take that opportunity.’\nOn stage Fiorina also rolled her eyes at questions pertaining to Trump and the schism his candidacy is reportedly causing in the GOP.\nThere's a 'yawning chasm between what the national media talks about and what the people of Iowa and the people of this great nation talk about,' she declared.\n'That's the biggest surprise... so guess what, sorry, the people of Iowa never ask me about a crisis in the GOP, they never ask me about the polls, they never ask me about the other candidates.'\nAs the foursome - Fiorina, Santorum, Mike Huckabee and Jim Gilmore - were complaining about the former reality TV star's oversized share of the conversation Trump arrived at his own event, where a long line of supporters were waiting for him, in his private jet.","url":"https://www.dailymail.co.uk/news/article-3421992/Republican-undercard-candidates-complain-Trump-s-shadow-Iowa-s-Hillary-gets-booed.html"}
