{"authors":["Associated Press"],"date_download":"2018-10-23 03:39:57","date_modify":"2018-10-23 03:39:57","date_publish":"2016-01-28 19:20:28","description":"PARIS (AP) — France's government welcomed Iranian President Hassan Rouhani on Thursday with promises of a new beginning in an old relationship, starting with...","filename":"data/vaneerConsumption/CarmakingdealsprotestsgreetIranianpresidentinParis.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:dd28ebc0342048b7925310c2cf2b4f42-4PuZeKVXE7cd9005b2c8760a929c-12_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420649_Car-making-deals-protests-greet-Iranian-president-Paris_1540265997.html","title":"Car-making deals, protests greet Iranian president in Paris","title_page":"Car-making deals, protests greet Iranian president in Paris | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Car-making deals, protests greet Iranian president in Paris\nPARIS (AP) — France's government welcomed Iranian President Hassan Rouhani on Thursday with promises of a new beginning in an old relationship, starting with investments to boost Iran's flagging economy that has been crippled by decades of sanctions.\n\"It's a new chapter of our relationship,\" French president Francois Hollande said in a joint news conference following a two-hour meeting with Rouhani at the Elysee palace. \"I want that relationship to be useful, useful to both countries, useful to the (Middle East) region affected by wars, crises and tragedies.\"\nHollande added that he raised the issue of human rights and freedom during the meeting.\nFrench Foreign Minister Laurent Fabius, left, and Iranian President Hassan Rouhani inspect the honor guard during a welcome ceremony at the Invalides in Paris, Thursday, Jan. 28, 2016. .While Rouhani arrived in Paris on Wednesday from Rome, the official French government greeting ceremony is being held Thursday morning. The trip is an effort to usher in a new era after a landmark accord to curb Iran's nuclear program and lift Western sanctions. However, France is now weighing new sanctions over Iranian ballistic missile tests. (AP Photo/Michel Euler, Pool)\nFrance sees the visit also as an opportunity to draw Iran into a role of crisis-solving, notably in Syria's civil war where Iran actively supports the government of President Bashar Assad, which Paris firmly opposes.\n\"We must fight terrorism\" in Syria and Iraq, Rouhani said during the joint conference. \"We must help the Syrian people so that the Syrian people can build a sustainable future for the country,\" he said.\nRouhani decried the sanctions his country was previously under, saying history has shown that they \"never worked.\" He said the nuclear deal that led to the lifting of sanctions this month can serve as a model for solutions in other crises, notably in the Middle East.\nA total of 20 agreements were signed after Rouhani's meeting with Hollande.\nIran Air signed a deal to buy 118 aircraft from Airbus, valued at 22.8 billion euros ($25 billion). PSA Peugeot Citroen also announced a joint venture with Iran Khodro to produce latest-generation vehicles in Tehran by the end of 2017.\nFrench and Iranian companies also signed agreements in the sectors of air and maritime transport, airports, health and agriculture. Oil and gas company Total inked a deal with the National Iranian Oil Company to purchase crude oil.\nThe French presidency said the total amount of the deals signed during Rouhani's visit, including Airbus, could reach up to 30 billion euros ($32.8 billion).\nThe historic outreach trip did face some strains, however, in a reminder of the complexities confronting all sides despite the French welcome mat.\nFrance has asked its European Union partners to consider new sanctions on Iran for its recent ballistic missile tests, officials told The Associated Press. That highlights continued suspicions between Iran and the West.\nIranian opposition group, the People's Mujahedeen of Iran, with headquarters outside Paris, held a demonstration, and 61 lawmakers signed an open letter to Hollande condemning Iran's human rights record, with executions on the rise, and what it called its \"strategy of chaos\" in the Middle East.\nAn activist hung from a fake noose off a Paris bridge next to a huge banner reading \"Welcome Rouhani, Executioner of Freedom.\"\nAt the French Institute of International Relations (IFRI), Rouhani took digs at the West, notably regarding the migrant crisis. He pointed out that Europe is complaining about the number of refugees arriving on its territory while Iran is hosting 3 million Afghans \"without complaining.\"\nRouhani, who arrived in France from Italy, was originally scheduled to visit Paris in November, but the trip was called off after Islamic extremists carried out attacks around Paris that killed 130 people.\n___\nSylvie Corbet and Angela Charlton in Paris, Danica Kirka in London, Raf Casert in Brussels and George Jahn in Vienna contributed to this report.\nFrench Foreign Minister Laurent Fabius, left, and Iranian President Hassan Rouhani arrives for a welcome ceremony at the Invalides in Paris, Thursday, Jan. 28, 2016. While Rouhani arrived in Paris on Wednesday from Rome, the official French government greeting ceremony is being held Thursday morning. The trip is an effort to usher in a new era after a landmark accord to curb Iran's nuclear program and lift Western sanctions. However, France is now weighing new sanctions over Iranian ballistic missile tests. (AP Photo/Michel Euler, Pool)\nFrench Foreign Minister Laurent Fabius, left, and Iranian President Hassan Rouhani inspect an honor guard during a welcome ceremony at the Invalides in Paris, Thursday, Jan. 28, 2016. While Rouhani arrived in Paris on Wednesday from Rome, the official French government greeting ceremony is being held Thursday morning. The trip is an effort to usher in a new era after a landmark accord to curb Iran's nuclear program and lift Western sanctions. However, France is now weighing new sanctions over Iranian ballistic missile tests. (AP Photo/Michel Euler, Pool)\nA Femen activist, Sarah Constantin, is hanged from a noose-like rope from a Paris bridge to call attention to the large number of executions in Iran as she stages a protest against visiting Iranian President Hassan Rouhani in Paris, Thursday, Jan. 28, 2016. A near-naked woman hanging from a noose-like rope from a Paris bridge has sent a message to visiting Iranian President Hassan Rouhani. (AP Photo/Zacharie Scheurer)\nSupporters of Maryam Rajavi, President of the National Council of Resistance of Iran, demonstrate against the Iranian President Hassan Rouhani's visit in Paris, Wednesday, Jan. 27, 2016. Rouhani says his first visit to Europe since the nuclear accord was signed has proven that there are \"great possibilities\" for economic, academic, scientific and cultural cooperation and that \"today we are in a win-win situation\" after years of mutual losses due to sanctions. Banner on the right reads \"Human rights. No complaisance. 2000 executions after 2 years with Rouhani\". (AP Photo/Christophe Ena)\nIranian President Hassan Rouhani gets into a car as he leaves the Invalides a after welcome ceremony in Paris, Thursday, Jan. 28, 2016. While Rouhani arrived in Paris on Wednesday from Rome, the official French government greeting ceremony is being held Thursday morning. The trip is an effort to usher in a new era after a landmark accord to curb Iran's nuclear program and lift Western sanctions. However, France is now weighing new sanctions over Iranian ballistic missile tests. (AP Photo/Michel Euler, Pool)\nIranian President Hassan Rouhani inspects the honor guards during a welcome ceremony at the Invalides in Paris, Thursday, Jan. 28, 2016. While Rouhani arrived in Paris on Wednesday from Rome, the official French government greeting ceremony is being held Thursday morning. The trip is an effort to usher in a new era after a landmark accord to curb Iran's nuclear program and lift Western sanctions. However, France is now weighing new sanctions over Iranian ballistic missile tests. (AP Photo/Michel Euler, Pool)\nIranian President Hassan Rouhani, left, applauses France's President Francois Hollande, after his speech, during a press conference, at the Elysee Palace, in Paris, Thursday, Jan. 28, 2016. Iran Air has signed a deal to buy 118 aircraft from Airbus in the first of an expected host of commercial deals expected to be announced during the visit of Iranian President Hassan Rouhani to Paris. (AP Photo/Thibault Camus)\nFrance's President Francois Hollande, right, and Iranian President Hassan Rouhani give a press conference, at the Elysee Palace, in Paris, Thursday, Jan. 28, 2016. Iran Air has signed a deal to buy 118 aircraft from Airbus in the first of an expected host of commercial deals expected to be announced during the visit of Iranian President Hassan Rouhani to Paris. (AP Photo/Thibault Camus)","url":"https://www.dailymail.co.uk/wires/ap/article-3420649/Car-making-deals-protests-greet-Iranian-president-Paris.html"}
