{"authors":["Will Martin"],"date_download":"2018-10-30 22:33:55","date_modify":"2018-10-30 22:33:55","date_publish":"2016-12-13 00:00:00","description":"As part of a series of meetings with senior figures from Britain's most important industries, David Davis held a summit with auto-industry bosses on Monday.","filename":"data/vaneerConsumption/CarmanufacturersfearthelackofatransitionalBrexitdeal.json","image_url":"https://amp.businessinsider.com/images/583d5846dd08953f1a8b4abb-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_car-manufacturers-fear-the-lack-of-a-transitional-brexit-deal-2016-12_1540938835.html","title":"Car manufacturers fear the lack of a transitional Brexit deal","title_page":"    Car manufacturers fear the lack of a transitional Brexit deal - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Peter Nicholls/Reuters Car industry bosses in the UK are fearful that a lack of a transitional Brexit deal will seriously harm the industry and cause it to \"bleed,\" according to a report in the Financial Times, which cites numerous industry bosses.\nAs part of a series of meetings with senior figures from Britain's most important industries, Brexit secretary David Davis held a summit with auto-industry bosses on Monday, and reports from inside the meeting suggest that the industry is fearful of what a cliff edge Brexit — one without a transitional deal — means for their sector.\nShould Britain fail to complete a deal in the two years between triggering Article 50 and formally exiting the EU, Britain would most likely automatically revert to being subject to World Trade Organisation rules. That could mean a tariff of as much as 10% put on cars imported into the UK from Europe.\nIn November, the Society of Motor Manufacturers and Traders (SMMT) said t he price of cars like Fiats and Peugeots could jump by as much as £1,500 ($1,871) unless a favourable trade deal is worked out post-Brexit.\nThe Telegraph reported that SMMT president Gareth Jones made the prediction at the society's annual dinner, forecasting a potential cost to the industry of £4.5 billion.\nThis prospect is giving the industry's most senior people sleepless nights. According to the FT's report of the meeting, one executive said: \"It may be fine in the long run but we can't manage 10 per cent and we will bleed in the many years that we're paying it.\"\nThey then added that any benefits coming from Brexit will \"be in the medium to long term.\"\nThe meeting was described by the SMMT as a roundtable discussion, and was attended by Nick Hurd, a minister from the Department for Business, Energy and Industrial Strategy, and John Hayes from the Department for Transport. Executives from Jaguar Land Rover, Nissan, Honda, Ford, Vauxhall, McLaren, Aston Martin and BMW were all present at the meeting, as were staff from JCB and Caterpillar.\n\"Being part of the single market has helped make the UK automotive sector amongst the most competitive in the world and a critical part of the UK economy. It is essential that we maintain those benefits and we will work with government and our partners in Europe to ensure the global success of our sector continues in the future,\" SMMT Chief Executive Mike Hawes said in a statement released after the meeting.\nThere is an increasing divide within the government about the prospect of a transitional deal before Britain fully leaves the EU. Chancellor Philip Hammond reportedly backs such a deal, saying on Monday: \"The further we go into this discussion, the more likely it is that we will mutually conclude that we need a longer period to deliver.\"\nHowever, two of the government's three senior Brexiteers, Davis and trade secretary Liam Fox, do not want a transitional deal, with Davis saying last week that he was \"not really interested\" in any adjustment period.\nDavis reportedly struck a similar tone with auto industry bosses on Monday, with one telling the FT that ministers at the meeting were \"very non-committal — they were in listening mode.\" During the meeting, Davis is believed to have said that he favours a \"data driven\" Brexit that is \"calm and orderly,\" while also asking for \"quantification\" about the risks facing the car industry.\nIn October, Theresa May convinced Japanese car manufacturer Nissan to keep and even increase its manufacturing presence in Sunderland, with speculation she promised to insulate the car manufacturer from any effects of Brexit. However, neither side has disclosed the details of the deal.","url":"https://www.businessinsider.com/car-manufacturers-fear-the-lack-of-a-transitional-brexit-deal-2016-12"}
