{"authors":["Bill Chappell"],"date_download":"2018-10-22 21:20:20","date_modify":"2018-10-22 21:20:20","date_publish":"2016-04-22 00:00:00","description":"The cruise company says Cuba has relaxed its ban on Cuban-born people returning to the island by boat.","filename":"data/vaneerConsumption/CarnivalSaysItsCruisesToCubaCanNowIncludeCubanBornPassengers.json","image_url":"https://media.npr.org/assets/img/2016/04/22/carnival-cuba_wide-33f351ef6ac988f7f7098a653382510791152d04.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_04_22_475246655_carnival-says-it-cruises-to-cuba-can-now-include-cuban-born-passengers_1540243220.html","title":"Carnival Says Its Cruises To Cuba Can Now Include Cuban-Born Passengers","title_page":"Carnival Says Its Cruises To Cuba Can Now Include Cuban-Born Passengers : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Carnival Says Its Cruises To Cuba Can Now Include Cuban-Born Passengers\nEnlarge this image toggle caption Carnival Corporation Carnival Corporation\nThe first cruise ship to sail between the U.S. and Cuba in more than 50 years can now carry passengers who were born in Cuba, after the island nation eased its ban against native-born Cubans returning by boat. The cruise ship, operated by Carnival, is set to depart Miami for Cuba on May 1.\n\"We made history in March, and we are a part of making history again today,\" Carnival CEO Arnold Donald says in a statement from the company. \"More importantly, we are contributing to a positive future. This is a positive outcome and we are extremely pleased. We want to extend our sincere appreciation to Cuba and to our team who worked so hard to help make this happen.\"\nThe Carnival Corporation announced plans for a cruise to Cuba last July, after winning approval from U.S. regulators for what it termed \"social impact travel.\"\nAt the time, the company was only beginning to negotiate with Cuban officials. Then in March, it announced a breakthrough, with Cuban officials agreeing to allow the 704-passenger MV Adonia to visit three ports of call: Havana, Cienfuegos and Santiago de Cuba.\nThe cruise company has set a price of $2,662 for an interior room aboard the Adonia for its May 1 voyage, which will last seven nights. That price omits Cuba's visas, taxes, fees and port expenses, which the company currently estimates at $208 per person.\nCarnival's website for travelers urges prospective customers to \"Cruise to Cuba, Make History!\" The cruises will run every other week, the company says.","url":"https://www.npr.org/sections/thetwo-way/2016/04/22/475246655/carnival-says-it-cruises-to-cuba-can-now-include-cuban-born-passengers"}
