{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 23:39:15","date_modify":"2018-10-30 23:39:15","date_publish":"2016-12-06 00:00:00","description":"'Rather than a new golden era, globalisation is associated with low wages, insecure employment, stateless corporations and striking inequalities.'","filename":"data/vaneerConsumption/CARNEYBritainisinthefirstlostdecadesincethe1860s.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bank-of-england-governor-mark-carney-britain-lost-decade-2016-12_1540942755.html","title":"CARNEY: Britain is in 'the first lost decade since the 1860s'","title_page":"    Bank of England governor Mark Carney says Britain facing 'lost decade' - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Bank of England Governor Mark Carney delivers the Liverpool John Moores University's Roscoe Lecture, at the BT Convention Centre in Liverpool, Britain December 5, 2016. REUTERS/Peter Byrne/Pool LONDON — Bank of England Governor Mark Carney thinks Britain is facing \"the first lost decade since the 1860s\" when \"Karl Marx was scribbling in the British Library.\"\nCarney said in a speech on Monday in Liverpool that stagnant wage and productivity growth means Brits are no better off today than they were prior to the onset of the financial crisis in 2008.\nHe added that, with Brexit looming, low real wage growth is set to continue: \"The only question is how this comes about: either through a compression of nominal wage growth and higher unemployment, or through faster growth in consumer prices and a smaller rise in joblessness.\"\nThis wage stagnation, combined with income and wealth inequality, has led to a widespread backlash against free trade and globalisation.\nCarney told the audience at the Liverpool John Moores University, \"We meet today during the first lost decade since the 1860s. ... Rather than a new golden era, globalisation is associated with low wages, insecure employment, stateless corporations, and striking inequalities.\"\nThe shock election of Donald Trump as President of the United States has been interpreted by many commentators as a rejection of globalisation, with Trump campaigning to \"Make America Great Again\" and returning manufacturing jobs to the US.\nCarney said central bankers and governments must do more to look after those who feel left behind by the forces of globalisation, saying: \"The combination of open markets and technology means that returns in a globalised world amplifies the rewards of the superstar and the lucky. Now may be the time of the famous or fortunate, but what of the frustrated and frightened?\"\nAs well as name-checking Karl Marx, one of the founders of communism, in his introduction, Carney also suggested a solution to the problems that he identified that could be seen as communist.\nHe appeared to reject the \"trickle down\" economic theory favoured by those on the right — saying \"while trade makes countries better off, it does not raise all boats\" — and called for at least some limited wealth redistribution.\nCarney said: \"For free trade to benefit all requires some redistribution.\" He called on politicians to develop a system of \"inclusive growth where everyone has a stake in globalisation.\"\nHowever, the governor added: \"There are limits, of course, because of fiscal constraints at the macro level and the need to maintain incentives at the micro level. Fostering dependency on the state is no way to increase human agency, even though a safety net is needed to cushion shocks and smooth adjustment.\"\nIf the government, central banks, and private corporations do not make changes to adopt \"inclusive growth,\" Carney warns: \"Turning our backs on open markets would be a tragedy, but it is a possibility. It can only be averted by confronting the underlying reasons for this risk upfront.\"\nFormer Chancellor George Osborne said at an event in London last month he believes \"western\" values such as democracy, free trade, and open society are at risk of being \"rolled back\" and says people must \"fight\" to protect them.\nSome commentators have blamed low interest rates for rising inequality — savers can not make much return while a flood into things like property and stocks creates an asset price bubble that favours the well off, or so the theory goes.\nThe governor defended the Bank of England's monetary policy, saying the Bank's actions helped to avert an economic depression in the wake of the financial crisis.\nBut he said: \"Long-run prosperity is not in the gift of central bankers. It depends on a much wider set of initiatives of our elected representatives, and ultimately, on the actions of the private sector.\"","url":"https://www.businessinsider.com/bank-of-england-governor-mark-carney-britain-lost-decade-2016-12"}
