{"authors":["Becky Freeth For Mailonline"],"date_download":"2018-10-23 01:55:12","date_modify":"2018-10-23 01:55:12","date_publish":"2017-03-16 12:09:16","description":"Carol Vorderman's attire matched her glamorous arrival via helicopter on Thursday morning as she dressed in an elegant black dress and feathered fascinator to lead a starry turnout.","filename":"data/vaneerConsumption/CarolVorderman56leadsstarsatCheltenhamFestival.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/17/01/3E597E8500000578-0-image-a-22_1489715902770.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319858_Carol-Vorderman-56-leads-stars-Cheltenham-Festival_1540259712.html","title":"Carol Vorderman, 56, leads stars at Cheltenham Festival","title_page":"Carol Vorderman, 56, leads stars at Cheltenham Festival  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She touched down in Cheltenham in style, co-piloting a helicopter into the racing grounds.\nAnd Carol Vorderman's attire matched her glamorous arrival as she dressed in an elegant black dress and feathered hat to lead a starry turnout.\nAside from her age-defying figure, the 56-year-old didn't miss the opportunity to draw attention to her two-awarded rear of the year in a figure hugging dress.\nScroll down for video\nTop bird: Caroline Vorderman certainly lead the glamour at The Cheltenham Festival on Thursday in a fitting black dress\nHere they come: taking to Instagram, the TV presenter shared a snap of herself and a group of friends arriving at the event via helicopter\nCarol offset a statement mididress with a contrasting brown belt and sexy black leather gloves, posing with a hand on her hip to accentuate her pert behind.\nHaving previously been praised with the ''Rear Of The Year' - best bottom in Britain - accolade in 2014 and 2016, Carol this year attracted another title for her youthful body.\nIn January, the nation recently made the I'm a Celebrity… Get Me Out Of Here contestant the UK's favourite Fifty Plus Beach Body.\nGorgeous: The TV personality rocked a glamorous top-to-toe black look, complete with a hat\nHers was chosen as the celebrity beach body they most admired behind the likes of Halle Berry, who came second, and Helen Mirren and Goldie Hawn.\nHer extravagant fascinator set off the image, and added something of a countryside vibe to her sassy outfit yet there was a further story behind the decision to wear the hair piece, as she explained online.\n'[I] am guest of the incredible genius and racing legend Michael Dickinson today,' Carol excitedly told her Twitter followers as she arrived on the grounds for Day Three.\nReady to ride: Carol tweeted about arriving in style to the Cheltenham Festival on Thursday\nTricky: She saw the humorous side when her headset had to be worn upside down to avoid ruining her hair\nShe'd been up late sharing her excitement about arriving at Cheltenham in a helicopter.\nBut Carol, who obtained her pilot's liscence almost three years ago, made it clear that her outfit was far too precious for her to be at the helm of the aircraft, this time.\n'Cheltenham tomorrow,' she wrote. 'Flying in a helicopter (I'm not pilot...Won't get headset over hat!)'\nLow and behold, the TV personality shared the humorous side of the flight in pictures the next morning, as she attended to wear the headset upside down, to avoid spoiling her perfectly coiffed hair.\nCarol had squeezed all of her girlfriends into the back of the aircraft to make it a full day out.\nWearing a cap: Carol covered up in a flat cap and a coat, later that afternoon\nTaking pictures: The stunner found the whole look very amusing\nJoker: Carol laughed as she took multiple pictures of herself\nGiddy: Carol made it clear that it was her outfit that was standing in her way of piloting the helicopter\nSpecial guest: Carol explained that she was a guest of Michael Dickinson\nAlso in attendance: Coronation Street's Michael Le Vell was one of the guests","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319858/Carol-Vorderman-56-leads-stars-Cheltenham-Festival.html"}
