{"authors":["Lucy Crossley","Alex Matthews For Mailonline"],"date_download":"2018-10-22 23:52:28","date_modify":"2018-10-22 23:52:28","date_publish":"2016-01-29 12:21:43","description":"Caroline Hughes, 28, from Gravesend, Kent, raised concerns over the Goodfella's Takeaway Pepperoni Pizza, which boasts of its 'manly' toppings.","filename":"data/vaneerConsumption/CarolineHughescomplainsoverGoodfellaspackagingformanliestmeat.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B2508900000578-0-image-a-55_1454071432523.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422688_Since-pepperoni-pizza-just-men-Woman-customer-complains-Goodfellas-packaging-advertises-manliest-meat-topping_1540252348.html","title":"Caroline Hughes complains over Goodfellas packaging for 'manliest meat'","title_page":"Caroline Hughes complains over Goodfellas packaging for 'manliest meat' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Goodfellas pizza advertised as having the 'manliest meat' as a topping is to have its packaging changed after complaints that it was sexist.\nCaroline Hughes, 28, from Gravesend, Kent, raised concerns over the Goodfella's Takeaway Pepperoni Pizza, which boasts of its 'manly' toppings, and invites customers to 'get the guys round' to enjoy it.\nMs Hughes posted a photograph of the box on the Goodfella's Facebook page, asking: 'Do you sell a women's version of this pizza? Or are we allowed to eat it too? ‪#‎testosteroni‬.'\nCaroline Hughes, 28, from Gravesend, Kent, raised concerns over the Goodfella's Takeaway Pepperoni Pizza, which boasted of having the 'manliest meat' as a topping\nA spokesman for the brand replied to Ms Hughes, and said that the packaging on the product was being changed, after complaints over the product\nA spokesman for the frozen pizza brand said that the packaging on the product was being changed, after other complaints over the product.\n'We've taken feedback seriously regarding this packaging and we are updating the packaging to remove the reference,' they wrote.\nMs Hughes said she 'struggled to find a link between enjoying food and being a man'\n'We realise we’ve missed the mark with what was supposed to be a little bit of fun.\n'Apologies for any offence this has caused.'\nAs well as the pepperoni, the pizza, which serves four people, comes with a sweet chilli dip.\nOn the box containing the pepperoni-topped pizza there was an arrow pointing to a picture of the sausage with the words 'Loaded with the manliest meat'.\nThe box also declared: 'This baby is loaded with the cheesiest cheese and the manliest meat.\n'Not to mention our brilliantly authentic base, freshly baked and frozen to lock in the perfect pizza taste.\n'So get the guys round because, man, this is one Takeaway pizza that always delivers.'\nSecondary school teacher Ms Hughes told MailOnline: 'I was surprised to find three different references about manliness or men on the back of a frozen pizza box.\n'I struggled to find a link between enjoying food and being a man.'\nA spokesman for Goodfella's manufacturers 2 Sisters Food Group said: 'There was no intention to cause offense with this packaging for our Goodfella’s Takeaway Pepperoni Pizza but clearly some people have considered it sexist.","url":"https://www.dailymail.co.uk/news/article-3422688/Since-pepperoni-pizza-just-men-Woman-customer-complains-Goodfellas-packaging-advertises-manliest-meat-topping.html"}
