{"authors":["George Odling For Mailonline"],"date_download":"2018-10-22 22:25:55","date_modify":"2018-10-22 22:25:55","date_publish":"2016-01-28 10:23:33","description":"Paramedics had to organise an extra-large stretcher to get Carol Beverley out of her home in Dorchester, Dorset, but a systems failure meant the call regarding her size did not get through.","filename":"data/vaneerConsumption/CarolBeverleydiedfromaheartattackwhilewaitingforXLstretcher.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AAFFDB00000578-0-image-a-71_1453992432307.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420608_30-stone-teacher-Carol-Beverley-died-heart-attack-firefighters-discussed-removing-window-Dorchester-home_1540247155.html","title":"Carol Beverley died from a heart attack while waiting for XL stretcher","title_page":"Carol Beverley died from a heart attack while waiting for XL stretcher | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Carol Beverley went into cardiac arrest at her parents' home in Dorset\nA 30-stone teacher died from a heart attack as firefighters discussed removing the window to get her out, an inquest heard.\nCarol Beverley, 43, went into cardiac arrest after suffering with a blood clot in her lung while at her parents' home in Stoborough, Dorset, on April 22 last year.\nAn extra-large stretcher – one of only two in Dorset – had to be organised, according to paramedics who gave evidence about Ms Beverley's condition at an inquest on Tuesday.\nBut a major system failure meant the initial call regarding the physics teacher's size and location was missed and the on-site paramedic was forced to return to Dorchester to collect the specialised oversize trolley.\nThe paramedics were also flagged down by police en route because of a road traffic accident.\nMs Beverley's death sparked clinical reviews at both South West Ambulance Service and Dorset County Hospital where the 43-year-old had been rushed to A&E the day before.\nShe was diagnosed with a urinary tract infection and sent home with antibiotics some hours later.\nDr Han Cao told the hearing she tried to keep Ms Beverley, who lived at Crossways, Dorchester, at the hospital overnight to assess the clot - which was then only suspected - but Carol became very anxious and refused to stay.\nParamedics had to organise a specialised extra-large stretcher for Ms Beverley, but a systems failure meant the call about her size did not get through and the trolley was delayed\n'She didn't like the experience,' she said.\n'I initially offered a hospital stay, then maybe a smaller ward, then the possibility of a smaller unit and when I said 'what about a home visit?' she said that was even worse.'\nDr Rob Torock, consultant in emergency medicine at Dorset who conducted the trust review, said it was clear there was 'miscommunication and a misunderstanding between the attending doctor and senior doctor' - Dr Cao and Dr Vanessa Bell.\n'In retrospect it appears treatment was missed for a pulmonary embolism,' he said. 'It's unclear whether her subsequent death could have been avoided. I'm very regretful; an opportunity was missed and it's a shame. That is tragic but I don't think it's fair to criticise.\n'I think there are going to remain some questions we continue to answer.'\nThe matter was referred to the Wessex Deanery but not onto the General Medical Council, Dr Torock added.\nCarol's sister Tessa Griffiths said after the inquest: 'Carol was a beautiful, kind and loving person and we miss her terribly.\nMs Beverley, a 'beautiful, kind and loving person,' had been rushed to hospital just the day before but was diagnosed with a urinary tract infection and sent home with antibiotics\n'When opportunities are missed by medical professionals, the consequences can be devastating. In these cases, it's important that lessons are learned so this is not allowed to happen again.\n'We are still coming to terms with losing Carol and ask to be allowed to grieve in private.'\nDorset coroner Sheriff Payne recorded a verdict of natural causes.\n'An opportunity was missed to provide treatment that may have altered her death,' he said. 'It appears that lessons have been learned and changes are being considered.\nThe South Western Ambulance Service has been forced to invest in extra-large equipment across the trust and review its operations as a result of Ms Beverley's death, Tuesday's inquest heard.\nEvery ambulance will have a striker installed - a specialist trolley with high sides capable of transporting up to 50st in weight - over the next two years.\nThe South Western Ambulance Service has been forced to invest in extra-large equipment across the trust and review its operations as a result of Ms Beverley's death\nSWAS staff member Caroline Tonks, who conducted the clinical review, told the hearing: 'We do have access to 17 stretchers across the trust placed strategically across the counties.\n'Hopefully they will become available in every front-line ambulance.'\nShe also said that, on the day Carol died, engineers were replacing damaged hard drives lasting approximately three hours which caused significant communication problems for their western hub at Exeter where calls are received and the eastern hub at St Leonards where dispatchers are located.\n'During the time the system was down business continuity plans were implemented,' she said.\n'There were communication difficulties. There was no access to satellite navigation so everything was just being sent via radio.'","url":"https://www.dailymail.co.uk/news/article-3420608/30-stone-teacher-Carol-Beverley-died-heart-attack-firefighters-discussed-removing-window-Dorchester-home.html"}
