{"authors":[],"date_download":"2018-10-22 22:56:13","date_modify":"2018-10-22 22:56:13","date_publish":"2014-06-11 14:34:15","description":"A new social media campaign exposes overpackers with embarrassing photos.","filename":"data/vaneerConsumption/CarryonshameCampaignAimstoExposeOverpackedTravelers.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/502071/sobigbags_0630dcd26732c355add1efe14af895e6.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_carryonshame-campaign-aims-expose-overpacked-travelers-n128396_1540248973.html","title":"#Carryonshame Campaign Aims to Expose Overpacked Travelers","title_page":"#Carryonshame Campaign Aims to Expose Overpacked Travelers","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIf \"sunlight is the best disinfectant\" then the #carryonshame campaign is harnessing a supernova to shame overpackers into cleaning up their act.\nFed up with airlines not enforcing sizing rules, Spud Hilton, a travel writer for the San Francisco Chronicle who launched the campaign, is calling on passengers to do it themselves, posting pictures and videos to Instagram, Twitter, and Vine with the hashtag #carryonshame.\nHilton said that some folks are flouting the luggage size limits, leading to delays, longer boarding, abusive passengers and increased theft from gate-checked bags.\nSign up for top Business news delivered direct to your inbox.\n\"When your steamer trunk inconveniences someone else, there’s no excuse for that,\" wrote Hilton.\nMost airlines limit bags to 45 linear inches, usually no more than 14 inches wide by 22 inches long and 9 inches deep.\nBut bringing his measuring tape to luggage stores, Hilton found 40 percent of the bags he surveyed exceeded those limits.\nTo make it even worse, passengers will often abuse the the dimensions allowed for the \"personal item,\" using it as a way to cram another piece of luggage on the plane. And another area where passengers bend the rules, knowingly or unknowingly, is using a soft bag that meets the limits, and then putting too much stuff in it.\nA bit of inconvenience isn't the worst of it, though.\n\"The real issue is the attitude and the denial,\" wrote Hilton. \"They stand in line at the airport, 2 feet from the airline’s carry-on sizer rack, clearly transporting the entire cast wardrobe for 'Beach Blanket Babylon' (including the hats). Then they walk past the gate agents with an air of entitlement that says, \"Those silly rules don’t apply to me.\"\nPerhaps after a little social media exposure, overpackers will think twice next time before trying to stuff in that extra jacket or set of romance novels.","url":"https://www.nbcnews.com/business/travel/carryonshame-campaign-aims-expose-overpacked-travelers-n128396"}
