{"authors":["Snejana Farberov For Dailymail.Com"],"date_download":"2018-10-23 04:33:58","date_modify":"2018-10-23 04:33:58","date_publish":"2017-03-10 14:45:55","description":"George Edwin Thomas III, 54, a biology teacher from Texas, has been charged with six counts of invasive visual recording for allegedly videotaping female students in various states of undress.","filename":"data/vaneerConsumption/Carrolltonteachersecretlyrecordedgirlsundressing.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E236E1B00000578-0-image-a-16_1489157277549.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301316_High-school-teacher-secretly-recorded-girls-undressing_1540269238.html","title":"Carrollton teacher 'secretly recorded girls undressing'","title_page":"Carrollton teacher 'secretly recorded girls undressing' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Teacher under fire: George Edwin Thomas III, 54, a biology teacher from Texas, has been charged with six counts of invasive visual recording for allegedly videotaping female students in various states of undress\nPolice in Texas have arrested a high school science teacher on suspicion that he secretly recorded female students undressing inside a classroom closet.\nGeorge Edwin Thomas III, 54, has been charged with six counts of invasive visual recording stemming from incidents that took place at RL Turner High School in Carrollton during the 2015-2016 school year, according to investigators.\nAn arrest affidavit cited by Fox 4 News has revealed that it was Thomas' girlfriend and her friend who tipped off the authorities about the videos.\nDetectives reviewed the surreptitiously recorded footage and were able to identify six female victims 'in various stages of undress.'\nThe girls were videotaped without their knowledge while changing into their school uniforms, according to police.\nAdministrators with the Carrollton-Farmers Branch ISD said in a statement that they became aware of the allegations against Thomas on February 22.\nThe incidents took place at RL Turner High School in Carrollton during the 2015-2016 school year and involved at least a half-dozen students\n'The district placed the teacher on administrative leave and is cooperating fully with all local sand state authorities,' the statement read.\nAccording to the affidavit, the case began unfolding last month after Thomas' girlfriend, who had long suspected him of being unfaithful, came upon a random thumb drive on the floor of their apartment in Highland Village.\nThe girlfriend and a friend of hers, who was present at the time, became curious and accessed the contents of the thumb drive, discovering multiple video recordings of teenage girls undressing inside a closet.\nThe device also contained footage that appeared to show a teacher's desk with female students being called to the desk.\nAccording to police, the camera had been placed in such a way as to record under the victims' clothing.\nGeorge Thomas' Facebook page indicates that he started working at RL Turner High School in October 2014.\nThe case began unfolding in February after Thomas' girlfriend found a thumb drive in their home containing videos showing half-naked high school girls. The Facebook photo above shows Thomas with an unnamed woman\nHis profile on the school's website states that he teaches several biology courses.\nWhen interviewed by police about the allegations against him, the 54-year-old educator admitted that he recorded videos on his phone in class, but claimed that the recordings showed 'activities' of the students for educational purposes.\nA spokesperson for the police department said there are other minors in the footage seized by investigators that have not been identified yet, which could lead to additional charges against Thomas.\nThomas was being held on Thursday at the Carrollton City Jail pending a bail hearing.","url":"https://www.dailymail.co.uk/news/article-4301316/High-school-teacher-secretly-recorded-girls-undressing.html"}
