{"authors":["Associated Press"],"date_download":"2018-10-22 23:52:56","date_modify":"2018-10-22 23:52:56","date_publish":"2017-04-26 08:45:22","description":"COLUMBUS, Ohio (AP) - Housing and Urban Development Secretary Ben Carson said Wednesday he expects to release a policy agenda within the next few months that...","filename":"data/vaneerConsumption/Carsoneyesprivatesectorastooltooffsethousingcuts.json","image_url":"https://i.dailymail.co.uk/1/2017/04/27/06/wire-469899-1493272298-859_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446652_Ben-Carson-brings-HUD-listening-tour-urban-rural-Ohio_1540252376.html","title":"Carson eyes private sector as tool to offset housing cuts","title_page":"Carson eyes private sector as tool to offset housing cuts | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"COLUMBUS, Ohio (AP) - Housing and Urban Development Secretary Ben Carson said Wednesday he expects to release a policy agenda within the next few months that delivers \"bang for the buck,\" partly by encouraging more private-sector collaboration.\nIn an interview with The Associated Press, Carson said he expects to advance public-private partnerships, extending low-income housing tax credits and providing more opportunities for public-housing residents to get jobs at the buildings where they live.\n\"The biggest tools are the partnerships - public, private, nonprofit and faith community partnerships - which allow us to leverage those federal dollars, anywhere from 2, 3, 4, 5 to 20-to-1,\" Carson said.\nHousing and Urban Development Secretary Ben Carson, second from right, speaks with Michelle Heritage, director of a shelter program, center, and Columbus mayor Andrew Ginther, left, outside a shelter in Columbus, Ohio, Wednesday, April 26, 2017. Carson said Wednesday he expects to release a policy agenda within the next few months that delivers \"bang for the buck,\" partly by encouraging more private-sector collaboration. (AP Photo/Dake Kang)\nHe said businesses with a financial stake in such projects are motivated to maintain the surrounding infrastructure.\n\"And if they're maintaining it, we don't have to - and then we can spend more time and effort dealing with the things that really need to be dealt with,\" he said.\nCarson has been traveling the country gathering input from agency field staff, local leaders and residents of public housing developments.\nHis three-day visit to Ohio, the tour's fourth stop, included visits to developments in both urban and rural areas.\nCarson declined to comment during a later news conference on the tax plan President Donald Trump released Wednesday, saying he had not yet seen it.\nHe said he doesn't anticipate negative effects associated with Trump's proposed budget cuts to the Department of Housing and Urban Development, or HUD, and said he has not been promising those he encounters along his tour route that he will fight the cuts.\n\"I'm going to be fighting for the people who benefit from the programs. I'm not fixated on any particular number,\" he said. \"I'm fixated on making sure that we maintain the good programs that are helping our elderly and disabled people.\"\nHe said a review of redundancies, inefficiencies and waste should allow for the reductions to have \"no material effect.\"\nFor Robin Mallory, 59, a public housing resident Carson visited Wednesday at Columbus' Van Buren Village, maintaining the facility where she lives and the programs it offers are vital to helping people who are down and out.\nMallory said she told the secretary, \"I feel the funding should be continued, because a person like myself was afforded this opportunity and there's others out there that are in need.\" Their conversation wasn't open to the press.\nShe voted for Democrat Hillary Clinton last year, but Mallory said she's hopeful. \"I also feel with the right people working together with President Trump that we'll be fine and we'll get what we need.\"\nShe says the facility afforded \"an opportunity not only to get your pride back but to get yourself back together. It's a second start on life to rejuvenate once again a productive lifestyle.\"\nCarson said he was inspired by the collaborations behind Van Buren Village, a 100-unit housing complex backed by various government, nonprofit and business partners, the homeless shelter next door and a veterans-only housing site he toured on the other side of Columbus.\n\"There are some like these that make you so proud. There are others where you would want to turn and run,\" he said. \"But we want to get to the situation where they're all good, that they're something we can be proud of. As a nation, we are totally capable of doing this.\"\nCarson is working to raise the profile and use of HUD's Section 3 program, which requires recipients of agency funding to provide - \"to the greatest extent possible\" - job training, employment and contract opportunities to low-income residents.\nHe said the provision has been \"largely ignored\" because developers say residents lack necessary skills for the jobs that will be created. Carson would like to see job training begin when the ground is broken on any new housing complex.\n\"What we're really going to be emphasizing is planning. We know when a big project is going to be done and, you know, the planning stage generally takes at least a year,\" he said. \"Well, during that time you can be training people in the area, so that now you have some skills.\"\nCarson said he wants to explore working with the Treasury Department and the IRS on how to make the low-income housing tax credits \"more effective, efficient and more widespread.\"\nHousing and Urban Development Secretary Ben Carson, center, speaks with city and housing officials outside a shelter in Columbus, Ohio, Wednesday, April 26, 2017. Carson said Wednesday he expects to release a policy agenda within the next few months that delivers \"bang for the buck,\" partly by encouraging more private-sector collaboration. (AP Photo/Dake Kang)\nHousing and Urban Development Secretary Ben Carson, left, speaks with Columbus mayor Andrew Ginther outside a shelter in Columbus, Ohio, Wednesday, April 26, 2017. Carson said Wednesday he expects to release a policy agenda within the next few months that delivers \"bang for the buck,\" partly by encouraging more private-sector collaboration. (AP Photo/Dake Kang)\nHousing and Urban Development Secretary Ben Carson, center, speaks with city and housing officials inside a shelter in Columbus, Ohio, Wednesday, April 26, 2017. Carson said Wednesday he expects to release a policy agenda within the next few months that delivers \"bang for the buck,\" partly by encouraging more private-sector collaboration. (AP Photo/Dake Kang)\nHousing and Urban Development Secretary Ben Carson, left, speaks with Michelle Heritage, director of a shelter program, inside a shelter in Columbus, Ohio, Wednesday, April 26, 2017. Carson said Wednesday he expects to release a policy agenda within the next few months that delivers \"bang for the buck,\" partly by encouraging more private-sector collaboration. (AP Photo/Dake Kang)","url":"https://www.dailymail.co.uk/wires/ap/article-4446652/Ben-Carson-brings-HUD-listening-tour-urban-rural-Ohio.html"}
