{"authors":["Ryan Saavedra"],"date_download":"2018-10-30 18:09:10","date_modify":"2018-10-30 18:09:10","date_publish":"2017-04-28 17:37:30","description":"U.S. Customs and Border Protection (CBP) officers discovered an abandoned tunnel on a tip.","filename":"data/vaneerConsumption/CartelSmugglingTunnelDiscoveredunderMexicanBorder.json","image_url":"https://media.breitbart.com/media/2017/04/Arizona-Tunnel-CBP.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2017_04_28__1540922950.html","title":"Cartel Smuggling Tunnel Discovered under Mexican Border","title_page":"Cartel Smuggling Tunnel Discovered under Mexican Border","title_rss":"NULL","source_domain":"breitbart.com","text":"U.S. Customs and Border Protection (CBP) officers discovered an abandoned tunnel on a tip.\nTucson Sector Border Patrol agents located a collapsed tunnel after receiving a report about a suspicious opening near the Raul Hector Castro Port of Entry, according to a statement from CBP Arizona.\nAlthough the tunnel collapsed roughly 25 feet from its opening, agents confirmed that it extended into the United States by 60 yards. It was located near a sewer line and apparently cut through a tunnel that was previously dug in the same location.\nTransnational criminal organizations (TCOs) use tunnels like the one found in Arizona to smuggle humans and narcotics into the United States.\nThere have been well over 200 tunnels discovered along the U.S.-Mexico Border used for illicit purposes since 1990, Breitbart Texas previously reported.\nThe Sinaloa Cartel, considered to be the largest and most powerful in Mexico, is the primary culprit behind smuggling tunnels into the United States.\nIn April 2016, U.S. officials discovered what is thought to be the longest ever cross-border tunnel into the United States. The tunnel was found in San Diego and is estimated to be over 800 yards long. Authorities say that it was used to tons of narcotics worth tens of millions of dollars.\nIn December of 2016, authorities discovered two additional tunnels in the same area, one of which was in use and the other near completion, both thought to be the work of the Sinaloa Cartel.\nThe U.S. is co-sponsoring an Israeli-invented tunnel detection system that officials are hoping can be used to locate routes created by the Mexican cartels. Already, the new technology has yielded positive results in Israel, uncovering structures used by Hamas.\nRyan Saavedra is a contributor for Breitbart Texas and can be found on Twitter at @RealSaavedra.","url":"https://www.breitbart.com/border/2017/04/28/cartel-smuggling-tunnel-discovered-mexican-border/"}
