{"authors":["Associated Press"],"date_download":"2018-10-23 02:26:41","date_modify":"2018-10-23 02:26:41","date_publish":"2016-01-29 16:56:31","description":"LAUSANNE, Switzerland (AP) — Bulgaria remains banned from Olympic weightlifting because of excessive doping after sport's highest court dismissed an appeal o...","filename":"data/vaneerConsumption/CASconfirmsBulgariabanfromOlympicweightlifting.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423089_CAS-confirms-Bulgaria-ban-Olympic-weightlifting_1540261601.html","title":"CAS confirms Bulgaria ban from Olympic weightlifting","title_page":"CAS confirms Bulgaria ban from Olympic weightlifting | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"CAS confirms Bulgaria ban from Olympic weightlifting\nLAUSANNE, Switzerland (AP) — Bulgaria remains banned from Olympic weightlifting because of excessive doping after sport's highest court dismissed an appeal on Friday.\nThe Court of Arbitration for Sport said its single judge ruled the International Weightlifting Federation president Tamas Ajan was entitled to exclude Bulgarian teams from qualifying for the Rio de Janeiro Games after 11 athletes tested positive for anabolic steroids last March.\nThe IWF rules allow bans if at least nine lifters in a team test positive in a single season, the court noted.\nThe case extends Bulgaria's tainted record in Olympic weightlifting.\nThe team also withdrew before the 2008 Beijing Games for doping, and was sent home from the 2000 Sydney Games and stripped of three medals.\nIn one victory for the Bulgarian Weightlifting Federation, the CAS judge upheld its appeal against paying a $500,000 fine.\n\"(Ajan) had no jurisdiction to take such decision alone (and) it is for the executive board to rule on the issue of the fine,\" CAS said in a statement.\nLast March, eight Bulgarian men and three women tested positive for the anabolic steroid stanozolol during training ahead of the European Championships.\nBulgaria withdrew from the European event, and the 11 lifters were banned before the 2015 world championships in Houston.\nIn Houston, the IWF barred Bulgarian lifters from Olympic qualifying standings and imposed the fine.","url":"https://www.dailymail.co.uk/wires/ap/article-3423089/CAS-confirms-Bulgaria-ban-Olympic-weightlifting.html"}
