{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:13:19","date_modify":"2018-10-30 22:13:19","date_publish":"2016-07-05 20:00:23","description":"Despite California's strict gun controls, violent crime and high-profile shootings--including terror attacks--have risen.","filename":"data/vaneerConsumption/CaseStudyintheFailureofGunControl.json","image_url":"https://media.breitbart.com/media/2016/07/semi-automatic-rifles-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_07_05__1540937599.html","title":"Case Study in the Failure of Gun Control","title_page":"California: Case Study in the Failure of Gun Control","title_rss":"NULL","source_domain":"breitbart.com","text":"In 1989, California became “the first state to ban assault weapons.” Since that time, it has enacted a steady stream of gun controls, only to see violent crime rise and high-profile shootings — including terror attacks — betray the lie that gun control saves lives.\nJust days ago, Governor Jerry Brown signed new gun controls into law. Those controls include a requirement that ammunition purchasers go through a background check just like firearms purchasers and “impose new restrictions on assault weapons,” according to the New York Times.\nIt is crucial to note that the “new restrictions on assault weapons” are the result of the old restrictions being circumvented. Although this circumvention was lawful in some cases — via the use of bullet buttons to remove magazines — the fact that it happened so easily only bolsters arguments from the NRA, Gun Owners of America, Breitbart News, and others who stress that gun control does not prevent criminals from getting the guns they need.\nAnd now, with the new restrictions in place, criminals who continue to obtain the guns they need will be assured that law-abiding citizens will not be able to match their firepower.\nBrown also signed a “high-capacity” magazine ban into law, even though the premises for such a ban were clearly undercut during the May 23, 2014, Santa Barbara attack. During that attack, mass murderer Elliot Rodger used only ten-round magazines — “standard capacity” in leftist jargon — in a shooting spree that took the lives of three innocents. (He began his murders by stabbing his roommates.)\nNonetheless, Brown signed a bill that now bars law-abiding citizens from even possessing a magazine that holds more than ten rounds. Of course, criminals will still have “high-capacity” magazines, and that gives them the upper hand. So how will that increase safety?\nThink about it like this: before the new gun controls were even signed on July 1, California had universal background checks — which means no “gun show loophole”; a ten-day waiting period on gun purchases; firearm registration requirements; Gun Violence Restraining Orders; other means of firearm confiscation; and requirements for concealed carry permit holders that are so stringent that getting a concealed carry permit in California is a herculean task.\nMoreover, while fighting to uphold the strictness of the concealed permitting process via the “good cause” requirement, Democrat lawmakers have reduced the number of places Californians with permits are allowed to carry a gun for self-defense. Most recently, they took college campuses off the list of places where law-abiding citizens may be armed to defend themselves.\nSo crime must be dropping, right? On the contrary, violent crime is up.\nAccording to the San Francisco Chronicle, murder in California rose ten percent last year. Additionally, in San Francisco — a city with some of the most stringent gun controls in the state — “smash-and-grab car burglaries … were up 31 percent in 2015 and have nearly tripled since 2010.”\nThese stats are on top of the high-profile attacks that grabbed the nation’s attention in 2014, 2015, and 2016.\nIn 2014, we witnessed the Santa Barbara attack; on December 2, 2105, we witnessed the firearm-related San Bernardino terror attack; and on June 1, 2016, we saw a murder-suicide on UCLA’s gun-free campus.\nJerry Brown’s solution to these gun control failures? More gun control.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/local/2016/07/05/california-a-case-study-in-the-failure-of-gun-control/"}
