{"authors":[],"date_download":"2018-10-22 20:58:23","date_modify":"2018-10-22 20:58:23","date_publish":"2014-06-03 19:02:00","description":"Casey Kasem's daughter has asked a judge to move her father back to Los Angeles. Doctors say the radio icon is \"near the end of his life.\"","filename":"data/vaneerConsumption/CaseyKasemsDaughterWantstoMoveFathertoanLAFacility.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_21/454816/140520-casey-kerri-kasem-jms-1401_00e080c184974466bf599e23c37772d5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/pop-culture_celebrity_casey-kasems-daughter-wants-move-father-l-facility-n121531_1540241903.html","title":"Casey Kasem's Daughter Wants to Move Father to an L.A. Facility","title_page":"Casey Kasem's Daughter Wants to Move Father to an L.A. Facility","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA lawyer representing Casey Kasem's daughter filed an emergency petition on Tuesday asking that the legendary radio DJ be transported to Los Angeles as soon as possible and be admitted to a skilled nursing facility.\nKasem, 82, who was hospitalized on Sunday in Washington, is battling the terminal illness Lewy Body dementia. Doctors have said he has about six months to live, according to lawyers who appeared at a Kitsap Superior Court hearing on Monday.\nAttorney Troy L. Martin filed the petition on behalf of Kerri Kasem, who has been appointed temporary conservator over her father's medical care after a year-long fight with her stepmother, Jean Kasem. Los Angeles Superior Court Judge Daniel S. Murphy will rule on the request at a hearing on June 9.\nCasey Kasem had been in Washington at a friend's house since May 6 when his wife removed him from East Berkeley Convalescent Facility in Santa Monica, where he had been staying since Feb. 14. While staying there, the radio icon's health has deteriorated. Doctors say he developed bed sores and infections in his lungs and bladder.\nThe family feud over Casey Kasem's care and visitation took an ugly turn over the weekend when Jean Kasem released a cell phone recording of her husband moaning, and two days later threw a pound of hamburger meat at Kerri Kasem when she arrived with an ambulance to pick up her father.\nJean Kasem's lawyer Joel Paget told NBC News that the 59-year-old former actress will file court documents in Kitsap Superior Court Wednesday explaining why she has shut out her husband's children from a previous marriage and other relatives.","url":"https://www.nbcnews.com/pop-culture/celebrity/casey-kasems-daughter-wants-move-father-l-facility-n121531"}
