{"authors":[],"date_download":"2018-10-30 20:52:30","date_modify":"2018-10-30 20:52:30","date_publish":"2014-06-18 23:43:01","description":"After a school employee reported Amanda Hendrickson for kicking her 5-year-old daughter “very hard” in the back, a state caseworker interviewed three people: Hendrickson and the child, Heaven Woods, plus a friend of Hendrickson’s.","filename":"data/vaneerConsumption/CaseworkersupervisorinHeavenscaserelievedofduties.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/MyAJC/2014/06/18/Images/photos.medleyphoto.5395649.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_caseworker-_14a210250abad16137bcf9420866dc90__1540932750.html","title":"Caseworker, supervisor in Heaven's case relieved of duties","title_page":"Caseworker, supervisor in Heaven's case relieved of duties","title_rss":"NULL","source_domain":"ajc.com","text":"After a school employee reported Amanda Hendrickson for kicking her 5-year-old daughter “very hard” in the back, a state caseworker interviewed three people: Hendrickson and the child, Heaven Woods, plus a friend of Hendrickson’s.\nHendrickson denied the allegation, and the friend and the child backed her up. The probe by the Floyd County office of the state Division of Family and Children Services didn’t go much further, despite a half dozen previous abuse allegations against Hendrickson over the course of five years.\nIf DFCS had talked to the property manager of the home Hendrickson rented in Rome, that person would have told of seeing the mother drag the girl around on a harness, “like a dog.” But the agency only found and interviewed the manager after Heaven died three weeks later of blows to the abdomen.\nHendrickson and her boyfriend, Roderick Buckner, are charged with murder in the girl’s May 20 death.\nAt a Wednesday news conference, Bobby Cagle, appointed last week by Gov. Nathan Deal to take over as DFCS director, said “there were issues around practice and supervision in this case.”\nHe repeatedly declined to be more specific, saying he was following the wishes of prosecutors in the case. But in the past DFCS has sometimes been much more open about flaws in procedure that may have contributed to children’s deaths.\nCagle, who said he’s still reviewing Heaven’s case, did say that the caseworker and that person’s supervisor have been taken off any duties involving interaction with families or the safety of a child.\nLike all documents released by DFCS, the full case file, released late Tuesday, is shorn of all identifying information and many details. Nevertheless, it portrays a cursory investigation largely concluded in a single afternoon on May 1, three weeks before Heaven’s death.\nThe caseworker first went to the school to try to interview Heaven, but the girl was not present that day. The worker did not, as far as the file shows, make any attempt to speak to the teacher who saw the alleged attack.\nThe worker found Hendrickson and Heaven at their home. Hendrickson said she had not walked Heaven home from school on the day in question (the kick reportedly happened on the walk home.) She said Heaven rode the bus that day and injured herself in a fall while waiting for the bus.\nHeaven, interviewed separately, said the same thing.\nCagle acknowledged that it is often difficult to get truthful statements from battered children. He said that if there is any doubt that the child is comfortable speaking, they should be interviewed by another expert.\n“Children in homes that are abusive are typically children who are very afraid,” he said.\nHendrickson’s friend, interviewed the same afternoon, told the caseworker Hendrickson “does not hit” the child.\nIn the file, under the heading “Action Steps” is a notation to interview another person, whose name is blacked out. There is no entry to indicate that such an interview was carried out.\nAs far as the file reflects, the worker made no attempt to double-check Hendrickson’s version of events.\nCagle said investigator erred by not interviewing the teacher who was the source of the complaint. He said he sent out a note to employees today, stipulating that all DFCS investigators must include an interview with the original source of the allegations.\nThat, he said, is just “typical good practice.”\nThe case file also includes summaries of several prior complaints against Hendrickson, but it brushes most of them off on the grounds that many came from family members, and the child’s parents were engaged in a custody battle.\nIn response to a reporter’s question, Cagle said it’s not wise to discount abuse allegations because they arise in the midst of family conflicts. “Any time you make an assumption about a case,” he said, “you may be making a mistake.”\nPhysical exams performed after Heaven’s death at Buckner’s home in Monroe County found signs of repeated physical injuries inflicted over a long period of time.\nOne person interviewed by DFCS after Heaven died supplied a particularly ghastly detail: Before 6 a.m. on the day of the death, Hendrickson sought advice on Facebook for “how you get rid of bruises.”\nRon Scroggy, who served as DFCS director from mid-2012 to mid-2013, said he was not impressed by the “Next Steps” outlined by DFCS at the end of the case summary.\nThey included such basic procedures as the one Cagle reiterated Wednesday: always interviewing the person who witnessed the alleged abuse.\n“I would hope the state is already doing these things,” Scroggy said. “They are pretty global comments that you would hope that they are doing anyway. If they are really serious about the lessons learned, then they need to put down what they are.”\nMaureen Kornowa, executive director of Gwinnett Children’s Shelter, said much the same.\n“The comments at the end seem like a feeble attempt at trying to say what we want to hear in an attempt to fix a terribly, terribly broken system,” she said.\n“We hear a lot of the right words.”","url":"https://www.ajc.com/news/crime--law/caseworker-supervisor-heaven-case-relieved-duties/N2Nbz9zcfBRFSVu7ylod3O/"}
