{"authors":[],"date_download":"2018-10-22 22:23:55","date_modify":"2018-10-22 22:23:55","date_publish":"2014-06-09 16:06:31","description":"Doctors have said that radio icon Casey Kasem is near the end of his life, but the family fight over his medical care took another dramatic turn.","filename":"data/vaneerConsumption/CaseyKasemJudgeSidesWithWifeOverMedicalTreatment.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/473636/tdy_mor_kasem_140529_a6c33a01710098e6a520461e295bd612.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/pop-culture_celebrity_casey-kasem-judge-sides-wife-over-medical-treatment-n126331_1540247035.html","title":"Casey Kasem Judge Sides With Wife Over Medical Treatment","title_page":"Casey Kasem Judge Sides With Wife Over Medical Treatment","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nDoctors in Washington have said that Casey Kasem is near the end of his life, but the family fight over his medical care took a dramatic turn in Los Angeles Monday when his wife of 33 years broke down in a courthouse corridor, fell to her knees and wailed over and over, \"Please don't let them kill my husband!\"\nThe tense scene took place minutes before Jean Kasem, 59, and her lawyers, appeared before Los Angeles Superior Court Judge Daniel S. Murphy to protest decisions made over the weekend by Kerri Kasem, who was appointed as her father's healthcare conservator. The 82-year-old radio icon, who has Lewy Body dementia, has not received nutrition or proactive treatment for two days.\nA lawyer representing Jean Kasem told the judge that Casey Kasem indicated to his wife that he wants to live and \"signaled to her that he was in distress, grabbed her hand with such strength that the hospital administrator had to peel his fingers off one by one.\"\n\"This is an unusual circumstance,\" countered attorney Troy Martin, who represents Kerri Kasem and spoke with Casey Kasem's doctors before the hearing. \"Feeding and hydration causes him tremendous amounts of pain and further infection and pneumonia.\"\nAlthough Murphy upheld Kerri Kasem's temporary conservatorship, he sided with Jean Kasem and ordered that doctors immediately feed and hydrate Casey Kasem and provide whatever medications they see fit. The judge also ordered for court-appointed attorney Samuel Ingham, who represents Casey Kasem, to fly to Washington to see Casey Kasem for himself as soon as possible and report to the court on Friday.\nJean Kasem said her husband is communicative, but Martin said doctors told him otherwise. The hearing was originally scheduled because Kerri Kasem was asking for permission to move her father to Los Angeles, but Martin withdrew that petition because of Casey Kasem's condition.\n\"All parties have the best interest of Mr. Kasem at heart,\" Murphy said. \"Hopefully we can all reach an agreement on how to proceed on Friday.\"\nCasey Kasem has been hospitalized in Washington since June 1, after Jean Kasem removed him from a Santa Monica facility on May 6. Casey Kasem's children from his first marriage and other family members say Jean Kasem shut them out and did not allow them to visit or speak to Casey Kasem for nearly a year.\nOn Friday, Kerri Kasem released details of the five-day road trip that she says Jean Kasem took her father on before reaching Washington. After the hearing on Monday, Jean Kasem vehemently denied that.\n\"We took a medical air flight!\" Jean Kasem said angrily. \"Look it up!\" But she could not recall the name of the company she used for transportation.","url":"https://www.nbcnews.com/pop-culture/celebrity/casey-kasem-judge-sides-wife-over-medical-treatment-n126331"}
