{"authors":["Alex Matthews For Mailonline"],"date_download":"2018-10-22 22:01:19","date_modify":"2018-10-22 22:01:19","date_publish":"2016-01-28 09:42:59","description":"Zanaida Gonzalez, 46, was caught by police officers in Orlando, Florida, after it is believed she went on a spending spree worth $850 in stores such as Home Depot, 7-Eleven, Walmart and RaceTrac.","filename":"data/vaneerConsumption/CaseyAnthonynannyZanaidaGonzalezstolecancerpatientscreditcard.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/09/30A8386900000578-0-image-a-9_1453972953089.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420539_Innocent-woman-entangled-2008-case-Anthony-murder-bars-accused-theft-clocking-bills-worth-hundreds-cancer-patient-s-credit-card_1540245679.html","title":"Casey Anthony nanny Zanaida Gonzalez stole cancer patient's credit card","title_page":"Casey Anthony nanny Zanaida Gonzalez stole cancer patient's credit card | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Zanaida Gonzalez, pictured, and Jonattan E. Acevedo were arrested for stealing a credit card\nThe murder case of two-year-old Caylee Anthony gripped America when it hit the headlines in 2008 and the nanny wrongfully accused of the heinous crime has now found herself in the spotlight once again.\nZanaida Gonzalez, 46, is behind bars after she was arrested by police officers in Orlando, Florida, for the theft of a cancer patient’s credit card.\nAlong with Jonattan E. Acevedo, 26, she is accused of going on a spending spree worth $850 in stores such as Home Depot, 7-Eleven, Walmart, RaceTrac, and Sports Authority.\nGonzalez is currently in custody at the Orange County Jail and faces charges of credit card theft and grand theft, according to a report by the Orlando Sentinel.\nOsceola County Sheriff's spokeswoman Twis Lizasuain said: 'She [Gonzalez] told detectives that she was the same person involved in the Casey Anthony case.'\nGonzalez and Acevedo were staying at the Star Motel, in Orlando, where they worked as cleaners, when a credit card was stolen in December, Ms Lizasuain explained.\nA 64-year-old man who lived in the motel later told police his card had been taken while he was in hospital being treated for cancer. It is believed that both Gonzalez and Acevedo knew the victim.\nGonzalez's life was turned upside down after she found herself being labelled as a potential suspect in the Caylee Anthony case seven years ago.\nIn June 2008 Caylee went missing from her home in Florida and her skeletal remains were found in a woodland in December that year.\nCaylee Anthony, pictured, was missing for a month before her body was found in a Florida woodland, in 2008\nCasey Anthony, pictured, accused Gonzalez of kidnapping her daughter but later said the claims were fictional\nA month after she went missing, her mother, Casey, reported the incident to police and later claimed that a babysitter by the name of Zanaida Gonzalez was responsible for her daughter's disappearance.\nJonattan E. Acevedo, 26, is also accused of going on a spending spree with the stolen card\nPolice officers searched the area and Gonzalez was found living in a hotel in Kissimee, Florida, where she was interviewed but not arrested.\nAnthony was later arrested and charged with the murder of her daughter, but was acquitted in 2011. Her defense attorney Jose Baez said Zenaida Fernandez-Gonzalez was a fictional person.\nIt was revealed that Anthony came up with the name after seeing it on an envelope.\nGonzalez claimed the adverse publicity and public ill feeling towards her, at first, left her losing her job and friends.\nIn a short biography on the 'I Support Zenaida Gonzalez Facebook' page, which has 418 likes, it said that she was 'just a hard-working woman trying to raise her family' and that she was 'shunned by her community' because of the Casey Anthony ordeal.\nShe tried to file a defamation suit against Anthony in 2013 because she said the allegations had damaged her reputation.\nHowever, Anthony's lawyers argued that she was only trying to profit from the situation.\nLast year a defamation judge ruled Gonzalez's claim, that Anthony had purposely linked her to the death of her daughter, had no evidence.\nThe judge also explained that if she carried on with the lawsuit she would fail to win financial compensation because Anthony had declared herself bankrupt.","url":"https://www.dailymail.co.uk/news/article-3420539/Innocent-woman-entangled-2008-case-Anthony-murder-bars-accused-theft-clocking-bills-worth-hundreds-cancer-patient-s-credit-card.html"}
