{"authors":[],"date_download":"2018-10-22 20:31:59","date_modify":"2018-10-22 20:31:59","date_publish":"2014-06-02 00:39:49","description":"Legendary radio DJ Casey Kasem was hospitalized Sunday as more drama unfolded between his wife and eldest daughter.","filename":"data/vaneerConsumption/CaseyKasemHospitalizedAfterDramaticSceneUnfoldsatHome.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_22/480596/140601-casey-kasem-jms-2122_000f452f2bf05c4bcf785afb171f44fe.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/pop-culture_celebrity_casey-kasem-hospitalized-after-dramatic-scene-unfolds-home-n119941_1540240319.html","title":"Casey Kasem Hospitalized After Dramatic Scene Unfolds at Home","title_page":"Casey Kasem Hospitalized After Dramatic Scene Unfolds at Home","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nRadio icon Casey Kasem was hospitalized in Washington on Sunday after a dramatic scene unfolded outside the home where he has been staying — a situation which culminated with his wife throwing a pound of hamburger meat at his eldest daughter from his first marriage.\nAs ordered by Kitsap County Judge Jennifer Forbes on Friday, Casey Kasem's daughter Kerri was able to visit him on Friday for the first time since his wife removed him from a Santa Monica facility and transported him to Washington without notifying his family. Forbes also ruled that Kerri Kasem, 41, would be able to take her father to be evaluated by a physician and hospitalized, if necessary.\nKerri Kasem testified at the hearing that the doctor hired by Jean Kasem had told her that her 82-year-old father had developed infections in his lungs and bladder and has bed sores.\n\"Kerri was just very, very upset because her dad’s health had declined so much since she and Julie saw him on May 6,\" her aunt Mary Kasem, who lives in Michigan, told NBC News. He just went backwards. She was so heartbroken on Friday that it broke my heart.\"\nOn Sunday, Kerri Kasem arrived at the home with an ambulance to take Casey Kasem to a hospital, but paramedics were not allowed inside the Silverdale residence. A few minutes later, someone inside the home called 911, and a second ambulance and fire truck arrived. After the fire truck was called away to an emergency, Jean Kasem, 59, walked downstairs and threw a pound of raw hamburger meat at Kerri. The paramedics were finally able to go inside and pick up Casey Kasem.\n\"In the name of King David, I threw a piece of raw meat into the street in exchange for my husband to the wild rabid dogs.\"\nAfter Casey Kasem was gone, Jean Kasem told NBC News that she was following a King James verse when she threw the meat at her stepdaughter.\n\"In the name of King David, I threw a piece of raw meat into the street in exchange for my husband to the wild rabid dogs,\" she said.\n\"Everything she's doing is just making it worse for herself,\" Mary Kasem said when she learned how Jean had behaved on Sunday.\nIt was the second time since Friday's hearing that Jean Kasem acted out. A few hours after Judge Forbes said she was going to carry out a Los Angeles judge's orders that Kerri Kasem be in charge of her father's medical care, Jean Kasem held a news conference in which she played cell phone audio of her husband moaning. She claimed that he was protesting the judge's decision.\n\"That was just so sad and wrong,\" Mary Kasem said. \"We don't know if that's him or not. But if it is, he's probably groaning because he has stage three bed sores, a lung infection, and a bladder infection. For her to put out something like that and claim that is just awful.\"\nForbes has scheduled another hearing for Friday.\nJean Kasem is best known for her role on the '80s hit \"Cheers.\" She and Kasem married in 1980 — she and the radio personality have a 24-year-old daughter.\nNBC News producer Michelle Hofland contributed to this report.","url":"https://www.nbcnews.com/pop-culture/celebrity/casey-kasem-hospitalized-after-dramatic-scene-unfolds-home-n119941"}
