{"authors":[],"date_download":"2018-10-22 22:07:03","date_modify":"2018-10-22 22:07:03","date_publish":"2014-06-08 15:33:03","description":"The former host of the \"American Top 40\" countdown for four decades is being treated for an infected bedsore, a hospital spokesman said.","filename":"data/vaneerConsumption/CaseyKasemRemainsinCriticalCondition.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/437521/140512-casey-kasem-1811_3cc006a49795d51a4e73443a1434da8d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_casey-kasem-remains-critical-condition-n125626_1540246023.html","title":"Casey Kasem Remains in Critical Condition","title_page":"Casey Kasem Remains in Critical Condition","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nCasey Kasem, host of the \"American Top 40\" countdown for four decades, remained in critical condition at a Washington state hospital on Sunday and was being treated for an infected bedsore, a hospital spokesman said.\nKasem, who was also the voice of Shaggy in the \"Scooby-Doo\" cartoons and one of the most recognizable voices on American radio, was admitted to St. Anthony Hospital in Gig Harbor last week amid a bitter family battle.\nThe 82-year-old former DJ has been alert throughout his hospitalization, receiving wound care, intravenous antibiotic therapy, blood pressure support medication and treatment for his pain, hospital spokesman Scott Thompson said.\nKasem suffers from Lewy body disease, a form of dementia with symptoms similar to Parkinson's disease and hallucinations.\nHis medical care and visitor access has been at the center of a legal tussle between the children from his first marriage — Kerri, Julie and Mike — and his second wife, Jean Kasem, with whom he has one child, Liberty.\nA Washington state judge ruled on Friday that Kasem's care would be decided by his daughter, Kerri, and not her stepmother. As the ruling took effect, a family spokesman said Kasem \"won't be with us much longer.\"\n— Reuters","url":"https://www.nbcnews.com/news/us-news/casey-kasem-remains-critical-condition-n125626"}
