{"authors":["Amie Gordon For Mailonline"],"date_download":"2018-10-22 23:17:50","date_modify":"2018-10-22 23:17:50","date_publish":"2016-01-29 10:58:40","description":"Martin Slater, 58, runs Jenkins newsagents in Swanage, Dorset, with his wife Betty. He is showing customers damning footage of former worker Jacqueline Wray, 49, who stole thousands from him.","filename":"data/vaneerConsumption/CashierJacquelineWrayshamedbyCCTVrecordingofherstealingcash.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30B1DFA000000578-0-image-a-111_1454067595604.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422550_Thieving-cashier-shamed-CCTV-recording-pocketing-cash-played-continuous-loop-newsagent-s-used-work_1540250270.html","title":"Cashier Jacqueline Wray shamed by CCTV recording of her stealing cash","title_page":"Cashier Jacqueline Wray shamed by CCTV recording of her stealing cash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mr Slater claims he was almost bankrupt by the theft - so is showing CCTV\nA newsagent is taking revenge on a woman cashier who stole thousands of pounds from him - by playing CCTV footage of her thievery on a giant TV in his shop.\nMartin Slater is screening the damning video of Jacqueline Wray hiving off money from customers into her purse under the counter rather than the till on a continuous loop for 12 hours a day.\nHe hopes the footage will shock his customers and shame the 49-year-old 'wolf in sheep's clothing' who avoided prison for her prolific enterprise that he claims almost bankrupted him.\nScroll down for video\nJacqueline Wray can be seen taking money from the till in Jenkins newsagents in Dorset. Martin Slater is now showing the video of Wray stealing, on a continuous loop for 12 hours a day\nCCTV footage captures Wray putting the money from the till into her purse under the counter. Mr Slater hopes the footage will shock his customers and shame the 49-year-old 'wolf in sheep's clothing'\nThe 42ins television has been placed on top of a fridge unit overlooking the small shop in the traditional seaside town of Swanage, Dorset.\nMr Slater, 58, who runs Jenkins newsagents with wife Betty, has put up a poster explaining to their customers why the video is being played.\nIt reads: 'The CCTV you are watching shows Jacqueline Wray stealing over a consecutive three day period.\n'We are showing the CCTV clips as we feel this serial thief has not only deceived us during the time she worked here but also you the customer.\n'We almost lost Jenkins due to the prolific thieving but we are still here and hopefully will pick up the pieces and restore our trust in human nature.'\nWhen a customer paid for alcohol or cigarettes Wray failed to scan the item and put the money in her purse below the counter before giving them change from the till.\nThe CCTV also shows her reeling off Lottery scratchcards 'like loo roll' which she placed in her handbag when the shop was empty. Wray also helped herself to money from the safe, cigarettes and groceries.\nJacqueline Wray's (pictured) prolific enterprise in the small shop owned by friends she had known for 25 years saw her pocket thousands of pounds\nWray's defence barrister told a court that the initially alleged figure of £200,000 was incorrect and 'nothing like that amount'.\nThe Slaters bought Jenkins newsagents in 2008 and employed Wray as a cashier soon after.\nShe was a former committee member of Swanage Conservative Club who the couple had known for over 20 years.\nThe big screen television installed in Jenkins, to play the footage to customers 12 hours a day\nThe Slaters refused to accept the suggestion from their accountant that a member of staff must be stealing from them until they checked three days of CCTV footage\nCCTV here appears to show Wray putting the money in her purse\nThe Slaters refused to accept the suggestion from their accountant that a member of staff must be stealing from them until they checked three days of CCTV footage and were horrified to find Wray pocketing wads of cash through her enterprise.\nMr Slater said: 'We really worked hard at the business and became very efficient. Our first year turnover was better than the previous owner's last so we were obviously doing something right.\n'But the profit margins just nosedived after that. We blamed the recession, questioned that our prices were too low or that we were spending too much on stock. We blamed ourselves.'\nThe couple's financial problems got so bad they had to rent out their home and move into a flat above the shop and ask friends for personal loans.\nMr Slater said: 'The sums just weren't adding up.Then after a couple of years of this our accountant said someone must be stealing from you. We didn't suspect a thing.\n'One day I came into the shop and found packet of cigarettes sticking out of her bag and they weren't her usual brand which I thought was suspicious. That's when I looked at the CCTV and got a big shock.\n'She was putting her purse under the counter and when customers paid for alcohol or cigarettes she didn't scan the items through the till and put their money into the purse rather than the till but gave the customers their change out of the till.\n'She was prolific. The TV footage in the shop is already causing a bit of a stir and word is spreading around the town.'\nWray pleaded guilty to one charge of theft from September 2011 to September 2014 at Dorchester Crown Court last month.\nShe was given a 15 month prison sentence, suspended for 12 months, and told to carry out 130 hours of unpaid work and placed on a three month curfew with an electronic tag.\nMr Slater said: 'We are angry and frustrated that a criminal like Jackie Wray isn't getting the punishment she deserves. In this case crime does pay.'\nMr Slater's actions come after an Essex businessman carried out a similar initiative in an attempt to deter thieves.\nLaurence Munday, owner of Wellworth-a-£, hoped to shame the crooks who stole from his bargain store in Dovercourt, Essex.\nHe says since the innovative scheme - which he has named 'Wellivision' - began in November and has reduced shoplifting by half.\nA 'wolf in sheep's clothing': Martin and Betty Slater have thanked customers for their support","url":"https://www.dailymail.co.uk/news/article-3422550/Thieving-cashier-shamed-CCTV-recording-pocketing-cash-played-continuous-loop-newsagent-s-used-work.html"}
