{"authors":["Monique Friedlander For Daily Mail Australia"],"date_download":"2018-10-22 21:39:06","date_modify":"2018-10-22 21:39:06","date_publish":"2017-04-26 02:21:56","description":"She jetted off to Queensland with her children amid claims she is 'stressed' about photos of her estranged husband Karl Stefanovic getting cosy with model Jasmine Yarbrough in Mexico.","filename":"data/vaneerConsumption/CassandraThorburnrelaxesonQueenslandholiday.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/02/3F9B8DB800000578-0-image-a-89_1493170043128.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4445956_Slender-Cassandra-Thorburn-cigarettes-wine-glass_1540244346.html","title":"Cassandra Thorburn relaxes on Queensland holiday","title_page":"Cassandra Thorburn relaxes on Queensland holiday | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She jetted off to Queensland with her children amid claims she was 'stressed' about photos of her estranged husband Karl Stefanovic getting cosy with model Jasmine Yarbrough in Mexico.\nAnd Cassandra Thorburn, 45, was spotted at a local Gold Coast beach smoking cigarettes and drinking from a wine glass with a female pal over the Easter long weekend.\nSwathed from the cold in an over-sized jumper, slender Cassandra was seen sitting cross-legged on the sand as she watched her three children frolic in the surf.\nTaking time out: Cassandra Thorburn, 45, was spotted at a local Gold Coast beach smoking cigarettes and drinking from a wine glass with a female pal over the Easter long weekend while her ex husband Karl was cavorting in LA and Mexico with his new squeeze, Jasmine Yarbrough\nShe completed her casual ensemble with a pair of skinny jeans, a pair of black sandals and a black-and-white beach bag.\nCassandra protected her eyes from the glare with a pair of sunglasses as her cropped mane blew wildly in the coastal wind.\nAt one stage, the former ABC reporter was spotted drinking from a wine glass, which she produced from her handbag.\nFlaunting it: Cassandra jetted off to Queensland with her three children amid claims she is 'stressed' about photos of her estranged husband Karl Stefanovic getting cosy with model Jasmine Yarbrough in Mexico\nPhoto tells a thousand words: Karl and Jasmine appeared every inch the happy couple as they posed for this photo during their Mexican getaway over Easter\nSitting on the side-lines: Swathed from the cold in an over-sized jumper, slender Cassandra was seen sitting cross-legged on the sand as she watched her three children frolic in the surf\nNo-frills: She completed her casual ensemble with a pair of skinny jeans, a pair of black sandals and a black-and-white beach bag\nWindy weather: Cassandra protected her eyes from the glare with a pair of sunglasses as her cropped mane blew wildly in the coastal wind\nCheers! At one stage, the former ABC reporter was spotted drinking from a wine glass, which she produced from her handbag\nHoliday mode: Later, she was seen removing her sandals before taking a stroll down the sand, wine glass in hand\nLater, she was seen removing her sandals before taking a stroll down the sand, wine glass in hand.\nShe also appeared to pick up one of her children's flip-flops before making her way back to the hotel.\nAt one stage during the stroll she was joined by her pal, with the pair sharing a few giggles while smoking cigarettes.\nDifficult time: 'Cass felt like she'd been kicked in the guts when she saw Karl and Jasmine cavorting like teenagers,' a source close to Cassandra told Women's Day\nStruggles: 'Cass is a very strong woman and she wants to move on, but it's incredibly difficult when she has his new relationship flung in her face so publicly,' a source told Women's Day\nRomantic display: Photos emerged of Karl and Jasmine during their loved-up holiday, several of which depicted blonde shoe designer Jasmine putting on a raunchy display with the father-of-three\nMoment of solitude? Cassandra stared at the ground as she walked past a pair of lifeguards\nMaking the most of the sunny weather, Cassandra also spent time soaking up some rays on a pool chair.\nKicking off her shoes, the brunette looked relaxed as she flicked through her phone and chatted to her friend reclining in the chair next to hers.\nA day later, Cassandra's spirits seemed to have lifted, with the former journalist being spotted laughing and beaming as she shared a take-away coffee with her family and friend.\nOn the move! She scooped up one of her children's flip-flops before making her way back to the hotel\nGiggle: She was seen laughing as she traversed the sandy shore\nCleaning up: She stored two cigarettes in the empty wine glass\nKicking back: Making the most of the sunny weather, Cassandra also spent time soaking up some rays on a pool chair\nCassandra was dressed in a casual striped T-shirt, blue long-line cardigan and a pair of denim shorts.\nShe accessorised her look with a simple gold necklace and a pair of black flip-flops.\nOn several occasions that day Cassandra was spotted flipping through her phone while wearing a concerned expression.\nLazy days: She propped her head up with her jumper while leaning one arm over her face to shield her forehead from the sun\nStress free! Kicking off her shoes, the brunette looked relaxed as she flicked through her phone and chatted to her friend reclining in the chair next to hers\nCatching up on the news? She was also seen checking her phone as her pal looked on\nNew day, new look! A day later, Cassandra's spirits seemed to have lifted, with the former journalist being spotted laughing and beaming as she shared a take-away coffee with her family and friend.\nJoking around: She was seen laughing and beaming\nMeanwhile, Karl, 42, spent the Easter break with his new squeeze Jasmine Yarbrough, 33 in LA and Mexico.\nPhotos emerged of the pair during their loved-up holiday, several of which depicted blonde shoe designer Jasmine putting on a raunchy display with the father-of-three.\nAccording to a Woman's Day source, the photos left Cassandra feeling deflated.\nChic: Cassandra was dressed in a casual striped T-shirt, blue long-line cardigan and a pair of denim shorts\nPensive: On several occasions that day Cassandra was spotted flipping through her phone while wearing a concerned expression\nLoved-up: Meanwhile, Karl, 42, spent the Easter break with his new squeeze Jasmine Yarbrough, 33 in LA and Mexico\nDeflated? According to a Woman's Day source, the photos left Cassandra feeling deflated\n'Cass felt like she'd been kicked in the guts when she saw Karl and Jasmine cavorting like teenagers,' a source close to Cassandra told the publication.\n'Cass is a very strong woman and she wants to move on, but it's incredibly difficult when she has his new relationship flung in her face so publicly,' they added.\nFollowing their split in September last year, Karl moved out of their family home in Lindfield after 21 years of marriage.\nA few months later he was spotted getting cosy with Jasmine.\nIn October, Cassandra said in an open letter: 'I'm going through one of the hardest times of mine and my children's lives.'\nDaily Mail Australia has reached out to Channel Nine for comment.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4445956/Slender-Cassandra-Thorburn-cigarettes-wine-glass.html"}
