{"authors":["Frances Martel"],"date_download":"2018-10-30 19:26:32","date_modify":"2018-10-30 19:26:32","date_publish":"2014-12-22 21:03:06","description":"Castro visited the Cuban National Assembly to declare that, against the United States, \"now we've really won the war.\"","filename":"data/vaneerConsumption/CastroonObamasCubaDealNowWeveReallyWontheWar.json","image_url":"https://media.breitbart.com/media/2014/12/obama-raul-castro-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2014_12_22__1540927592.html","title":"Castro on Obama's Cuba Deal: 'Now We've Really Won the War'","title_page":"Castro on Obama's Cuba Deal: 'Now We've Really Won the War' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"After a televised speech last week in which Cuban dictator Raúl Castro declared President Obama’s unilateral actions towards Cuba a victory for “a more prosperous and sustainable socialism,” Castro visited the Cuban National Assembly to declare that, against the United States, “now we’ve really won the war.”\nThe event at the National Assembly, Cuba’s legislative body, was organized to reunite publicly the “Cuban Five,” a spy network dedicated to infiltrating American military organizations and Cuban-American civil society. President Obama released the three remaining spies that had been imprisoned in the United States for a number of crimes, including conspiracy to murder in the case of the Brothers to the Rescue plane shooting, in which the Cuban government killed four U.S. citizens. The five were received by the legislative body with effusive applause for their work in that killing and other Cuban government operations.\nTheir appearance was followed by a long speech by Castro, in which he recycled the words of his brother, Fidel, upon beginning his guerrilla warfare in the 1950s: “now we have really won the war.” He once again reiterated his desire for President Obama to act unilaterally, without the support of Congress, on as many issues in the White House’s Cuba proposal as possible. “We hope that Obama will use with determination executive prerogatives to substantially modify the blockade in those aspects that do not require Congressional approval,” demanded Castro.\nHe added that he does not expect any changes in the Cuban regime: “just as we have never proposed to the United States a change in their political system, so too do we demand respect for ours.”\nIn defiance of recent American Congressional action, Castro also mentioned by name the government of Venezuela as an ally, noting that he was “lending his support against intents to destabilize the government of Maduro,” the socialist nation’s president. Congress chose to sanction President Nicolás Maduro and several high-ranking members of the Venezuelan government due to longstanding human rights abuses against opposition politicians and protesters in the OPEC nation.\nCastro concluded the speech by shouting, “Viva Fidel!,” a reminder that, to the Cuban government currently in power, President Obama’s reforms appear not to be a threat. While the provisions in the White House deal provide for a U.S. embassy in Havana–pending Congressional approval–and removal of sanctions on American businesses should they seek to work in Cuba, they do not require the Cuban government to permit American corporations to do business on the island or require of the Cuban government any concessions on economic or political freedom.\nWatch Castro’s hour-long speech below:","url":"https://www.breitbart.com/national-security/2014/12/22/castro-on-obamas-cuba-deal-now-weve-really-won-the-war/"}
