{"authors":["Bill Chappell"],"date_download":"2018-10-22 23:23:44","date_modify":"2018-10-22 23:23:44","date_publish":"2014-09-27 00:00:00","description":"Catalonia's leader has set a November date for a vote on whether the northeast region of Spain should become independent. Spain's central government has said it will block the vote.","filename":"data/vaneerConsumption/CataloniaDefiesSpainAsLeaderSignsDecreeForBreakawayVote.json","image_url":"https://media.npr.org/assets/img/2014/09/27/artur-mas_wide-f1f287421b9e70152c95d7e87377810632b194e9.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2014_09_27_351975380_catalonia-defies-spain-as-leader-signs-decree-for-breakaway-vote_1540250624.html","title":"Catalonia Defies Spain As Leader Signs Decree For Breakaway Vote","title_page":"Catalonia Defies Spain As Leader Signs Decree For Breakaway Vote : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Catalonia Defies Spain As Leader Signs Decree For Breakaway Vote\nEnlarge this image toggle caption Lluis Gene/AFP/Getty Images Lluis Gene/AFP/Getty Images\nOne week after the Catalan parliament gave him the power to do so, Catalonia's leader is calling for a vote in the northeast region of Spain on whether it should become independent. The vote is set for November 9, but Spain's central government has said it won't let the vote occur.\nCatalonia has already launched a website for the independence vote, referring to it with the shorthand 9N. The website includes a sample ballot that asks two questions: Should Catalonia be a state, and should that state be independent?\nFrom Madrid, NPR's Lauren Frayer reports:\n\"With the Catalan president's signature, the room of dignitaries erupted into applause. And so did the streets of the Catalan capital, Barcelona. Catalonia's leader Artur Mas has officially set a Nov. 9 vote on secession from Spain. \"But the Spanish constitution says the country's unity is indivisible, and that no region can opt out of that. Police could block polling stations. The Catalan president nevertheless says voting is a democratic right. \" 'And we know,' Mas said, 'that democracy is the most civilized way to resolve difficulties between nations.' \"Spain's prime minister has called an emergency Cabinet meeting to decide how to proceed.\"\nIn Madrid, Spain's central government is expected to challenge both the independence vote and the parliamentary action that authorized it, by filing appeals in the country's Constitutional Court.\nAfter authorizing the vote today, Mas directed some of his remarks at citizens elsewhere in Spain, urging them to visit the Catalan region to get a sense of the people's wishes. According to Euronews, he also said:","url":"https://www.npr.org/sections/thetwo-way/2014/09/27/351975380/catalonia-defies-spain-as-leader-signs-decree-for-breakaway-vote"}
