{"authors":["Mike Larkin For Dailymail.Com"],"date_download":"2018-10-22 23:36:39","date_modify":"2018-10-22 23:36:39","date_publish":"2017-03-16 07:25:20","description":"It was certainly no laughing matter. And Cat Deeley struggled to raise a smile as she headed home after a salon appointment sporting painful-looking sunburn in Los Angeles","filename":"data/vaneerConsumption/CatDeeleysportspainfulsunburninLA.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/07/3E5242EA00000578-0-image-a-21_1489648442443.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319044_Cat-Deeley-painful-sunburn-salon-appointment-LA_1540251399.html","title":"Cat Deeley sports painful sunburn in LA","title_page":"Cat Deeley sports painful sunburn in LA | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It was certainly no laughing matter.\nAnd Cat Deeley struggled to raise a smile as she headed home after a salon appointment sporting painful-looking sunburn in Los Angeles on Wednesday.\nAs a West Bromwich girl, it is likely the English rose still gets excited whenever the sun breaks out, despite the fact she now lives in California.\nRed alert: Cat Deeley sported painful-looking sunburn as she stepped out in LA Wednesday\nHowever it seems the Black Country beauty's enthusiasm got the better of her during the recent LA heatwave, as her head and neck were an excruciating shade of scarlet.\nThe 40-year-old SMTV Live icon looked great for her age in a loose-fitting blouse, tight jeans and strappy shoes.\nSo You Think You Can Dance favourite Cat finally managed to force a grin as she made her way back to her car, though no doubt her famously funny husband Patrick Kielty will have been able to give her a few belly laughs with his cunning quips.\nThe expat and her 46-year-old ruggedly handsome other half expanded their family to three after she gave birth to their first child Milo in January 2016.\nMonths after the birth the smitten star said: 'I'm besotted with the baby and really enjoying motherhood\nYou're not in the Black Country now: It seems the West Bromwich native spent too much time in the California sunshine\nTime for tea? No doubt Cat would not have been amused if her funnyman husband Patrick Kielty served her lobster for dinner\nForcing a smile: She eventually flashed a grin as she headed back to her car\nAnd she claimed breast is best when it comes to getting back in pre-baby shape.\nCat said: 'People keep asking me if I've been hitting the gym, but I haven't I think breastfeeding is key and it's worked well for me. Add to that running around after a new baby and you don't need to work out.'\nJust before their happy news emerged, her funnyman husband displayed his usual level of comedic acumen.\nThe jolly Northern Irishman said: 'I hope any child we might have has Cat's looks and my accent. With our two strong accents, we basically needed subtitles or a UN translator.'\nMama mia: It is hard to believe the svelte beauty have birth to her first child just last year\nA cut above the rest: Her trip to the hair salon no doubt lifted her spirits","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319044/Cat-Deeley-painful-sunburn-salon-appointment-LA.html"}
