{"authors":["Neil Munro"],"date_download":"2018-10-30 19:08:35","date_modify":"2018-10-30 19:08:35","date_publish":"2016-09-07 01:46:59","description":"Caterpillar is firing 300 American employees in Mossville, Indiana, even though it is continuing to recruit and pay foreign “H-1B” guest-workers to do the white-collar jobs sought by American professionals in the United States. | Politics","filename":"data/vaneerConsumption/CaterpillarHiresH1BForeignGraduatesDumps300AmericanProfessionals.json","image_url":"https://media.breitbart.com/media/2016/09/AP_12122801072.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_09_06__1540926515.html","title":"Caterpillar Hires H-1B Foreign Graduates, Dumps 300 American Professionals","title_page":"Caterpillar Hires H-1B Foreign Graduates, Dumps 300 American Professionals | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Caterpillar is firing 300 American employees in Mossville, Illinois, even though it is continuing to recruit and pay foreign “H-1B” guest-workers to do the white-collar jobs sought by American professionals in the United States.\nCaterpillar’s combination of white-collars layoffs and H-1B outsourcing matches the much-criticized decision by Carrier, a company in next-door Indiana, to outsource 1,400 blue-collar factory jobs to Mexico.\nOutsider GOP candidate Donald Trump has vigorously denounced the outsourcing by Carrier’s air-conditioning business. His opposition has helped him get a nine-point polling advantage in the state. But Trump’s support for major reforms to the H-1B program to reduce the outsourcing of professional jobs is raising his support among upper-income professional-class voters in many other states.\nThe Caterpillar outsourcing “is all the same thing happening over and over again,’ said John Miano, a lawyer and software expert who has sued the federal government to reduce or stop various outsourcing programs, such as the H-1B visa. “What we see is that companies ask for more [H-1B visas] while they’re laying off the same kind of [American professionals] … this is going to be an election that decides whether this continues,” Miano said.\nEarly in 2016, Caterpillar asked the federal government for 71 H-1B visas needed to hire foreign white-collar college-grads. At least 30 of the requested H-1B visas are for engineers and other skilled professionals in Mossville, which is suffering the most layoffs.\nAt least 44 of the visas requested in 2016 are for foreign graduates who are already working at Caterpillar in the United States. These “continuation” visas are automatically approved, and do not count against the much touted annual limits on H1-B visas.\nAnother 22 of Caterpillar’s H-1B request visas are for new hires.\nSince 2012, Caterpillar has requested 768 visas for H-1B workers. Roughly speaking, companies get one-fifth of the new-hire H-1B visas they request, suggesting the company has outsourced at least 100 U.S.-based jobs to lower-wage foreign graduates.\nCompanies are not required to interview Americans, or even announce job openings, before asking for H-1B visas.\nThe H-1B visa allows the foreign college-graduates to stay for at least three years, and some manage to stay permanently. For example, the company has also helped get green cards — the precursor to citizenship — for roughly 70 foreign college graduates. Most of these green card employees have replaced Americans software graduates.\nCaterpillar has not responded to emails from Breitbart.\nWhile Trump has promised to reform the controversial H-1B program as part of his plan to ensure that immigration law helps Americans before companies or foreign workers, Hillary Clinton has been a strong supporter of the H-1B program, and her foundation has tried to hire more than 130 foreign professionals in place of young Americans.\nThat political difference over white-collar outsourcing may become critical in the new few weeks when Trump tries to raise his support among college graduates.\nTrump is already doing well among blue-collar families, party because of his promise to start enforcing existing laws that bar the hiring of illegals. But Trump is doing poorly among college-graduates, partly because few white-collar workers yet recognize the pocketbook impact to them of federal immigration practices. Fewer still know that states are also allowing illegal immigrants to work in professional jobs.\nAmerican professionals prefer to ignore the threat from the government’s H-1B program, said Miano. “They all all think ‘I’m good… if I keep up my skills, I don’t have anything to worry about’ — but they don’t know these [hiring] decisions are being made by accountants who have no idea what their skills are,” he said.\nThat outsourcing process is a huge threat to the middle class because it is “cutting off the ability of people to rise up,” he said. “The whole thing of the middle class is to send your kids to college, get professional jobs and move up — but now that is being destroyed” by outsourcing, Miano said.\nMany companies outsource U.S. white collar jobs to foreign professionals — Disney, DeLoitte, many hospitals, Facebook, Intel, Qualcomm, Microsoft, plus many smaller companies, such as the Toys R Us retailer, Cengage publishing firm, and New York Life insurance company. The scale and details of the outsourcing movement can be tracked at websites, including MyVisaJobs.com.\nVirgil Bierschwale, a displaced software expert, has posted details of the H-1B program and maps showing the locations and employer contacts for H-1B requests.\nMuch of the 2016 H-1B outsourcing at Caterpillar is for engineering jobs held by Americans.\nCommercial job search boards show many Americans are qualified for those jobs. Indeed.com, for example, offers the resumes of 2,445 engineers within a 25-mile distance of Mossville, including some recently posted resumes of Caterpillar’s soon-to-be-outsourced employees.\nThese engineering jobs are in the so-called STEM field, which the federal government — and the private sector — has long declared will provide a secure upward path for American college grads.\nHowever, even as young Americans study to earn places in colleges, the federal government is helping companies employ a population of roughly 650,000 H-1B professionals in the United States.\nThe resident population of around 650,000 H-1B professionals include roughly 100,000 professionals at U.S. universities. The outsourced university jobs include tens of thousands of jobs for professors and lecturers, doctors and therapists, scientists and researchers.\nMost of the 650,000 outsourced H-1B jobs are in the information technology sector, where the imported professionals have lowered wages throughout the industry and forced middle-aged Americans into new, lower-paying careers — such as journalism — at just the time when they need good pay to help their children get a good education.\nMany additional outsourced H-1B jobs are in business and finance, architecture and design, p.r. and media, health care, and teaching.\nThe wide variety of jobs shows how the H-1B outsourcing is reaching far beyond Silicon Valley. For example, companies such as CVS are increasingly using foreign college graduates to replace American pharmacists in Washington D.C., New York, and across the nation.\n“If American professionals don’t stand up soon, they’ll be going the way of the auto workers and the factory workers in just a few years,” said Miano.","url":"https://www.breitbart.com/politics/2016/09/06/caterpillar-hires-h-1b-foreign-graduates-fires-300-american-professionals/"}
