{"authors":["Associated Press"],"date_download":"2018-10-22 20:04:35","date_modify":"2018-10-22 20:04:35","date_publish":"2016-01-28 00:11:08","description":"NEW YORK (AP) — Cate Blanchett will make her Broadway debut next winter in Anton Chekhov's first — and long-forgotten — play. The Oscar winner and Academy Aw...","filename":"data/vaneerConsumption/CateBlanchetttomakeBroadwaydebutinChekhovplay.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:7f8285d9924a4d22934f42be36eaf123-2vdWmEltwXfba0ce28e6321e902a-641_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420141_Cate-Blanchett-make-Broadway-debut-Chekhov-play_1540238675.html","title":"Cate Blanchett to make Broadway debut in Chekhov play","title_page":"Cate Blanchett to make Broadway debut in Chekhov play | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Cate Blanchett to make Broadway debut in Chekhov play\nNEW YORK (AP) — Cate Blanchett will make her Broadway debut next winter in Anton Chekhov's first — and long-forgotten — play.\nThe Oscar winner and Academy Award nominee this year for \"Carol\" will star in \"The Present\" opposite Richard Roxburgh in the production that originated at the Sydney Theatre Company last summer.\nIt is adapted by Andrew Upton, Blanchett's playwright husband and former artistic director of the Sydney Theatre Company. It will be directed by John Crowley, who directed the film \"Brooklyn\" and \"A Behanding in Spokane\" on Broadway.\nStage veteran: Cate has also appeared in stage productions of Hedda Gabler, A Streetcar Named Desire and The Maids\nBlanchett and Roxburgh previously appeared together off-Broadway in 2012 in Upton's adaptation of Chekhov's \"Uncle Vanya.\" Blanchett has also appeared in stage productions of \"Hedda Gabler,\" ''A Streetcar Named Desire\" and \"The Maids.\"\n\"The Present,\" also known as \"Platonov,\" centers on Anna Petrovna, who is celebrating her 40th birthday at her summer home in the country. She holds a party that includes uncomfortably mismatched collection of characters.\nChekhov wrote it as a young medical student in the 1880s but it went nowhere and the playwright put it aside. It was unearthed in a Moscow bank vault in 1920, 16 years after his death.\nChekhov's original version, which was set during the end of the 19th century and the conception of communism, has been relocated to the end of the 20th century. Over the years, it's been given other titles, including \"The Disinherited,\" ''Wild Honey\" and \"Fatherlessness.\"\nThe new version will be produced on Broadway by Stuart Thompson and Sydney Theatre Company. The theater where it will play and other casting will be announced later.\n___\nOnline: http://www.SydneyTheatre.com.au\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3420141/Cate-Blanchett-make-Broadway-debut-Chekhov-play.html"}
