{"authors":["Sophie Goulopoulos For Daily Mail Australia"],"date_download":"2018-10-23 02:21:13","date_modify":"2018-10-23 02:21:13","date_publish":"2016-01-29 16:45:17","description":"While she's known for her dramatic fervour on the big screen, Cate Blanchett will return to her Thespian roots on stage as she makes her Broadway debut next Northern Hemisphere's winter.","filename":"data/vaneerConsumption/CateBlanchetttomakeherBroadwaydebutinChekhovsThePresentplay.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B3D6DF00000578-0-image-a-43_1454085786175.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422894_Cate-Blanchett-make-Broadway-debut-Chekhov-s-long-forgotten-play-adapted-playwright-husband-Andrew-Upton_1540261273.html","title":"Cate Blanchett to make her Broadway debut in Chekhov's The Present play","title_page":"Cate Blanchett to make her Broadway debut in Chekhov's The Present play | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's one of Australia's most respected and interesting acting exports.\nAnd while she's known for her dramatic fervour on the big screen, Cate Blanchett will return to her Thespian roots on stage as she makes her Broadway debut next Northern Hemisphere's winter.\nThe 46-year-old Oscar winner will star in Anton Chekhov's first and long-forgotten play, The Present, opposite Richard Roxburgh in the production that originated at the Sydney Theatre Company.\nReturning to her roots: Cate Blanchett will make her Broadway debut in Chekhov's long-forgotten play, The Present, at the end of this year\nIt will be adapted by Andrew Upton, Cate's playwright husband and former artistic director of the Sydney Theatre Company, with John Crowley to direct.\nBlanchett and Roxburgh previously appeared together off-Broadway in 2012 in Upton's adaptation of Chekhov's Uncle Vanya.\nCate has also appeared in stage productions of Hedda Gabler, A Streetcar Named Desire and The Maids, with her first major role acting opposite Geoffrey Rush in the STC's Oleanna in 1992.\nPower couple: The Present will be adapted by Andrew Upton, Cate's playwright husband and former artistic director of the Sydney Theatre Company\nStage veteran: Cate has also appeared in stage productions of Hedda Gabler, A Streetcar Named Desire and The Maids\nThe Present, also known as Platonov, centres on Anna Petrovna, who is celebrating her 40th birthday at her summer home in the country.\nShe holds a party that includes uncomfortably mismatched collection of characters.\nChekhov wrote it as a young medical student in the 1880s but it went nowhere and the playwright put it aside - it was unearthed in a Moscow bank vault in 1920, 16 years after his death.\nFlashback: Cate's first major role acting opposite Geoffrey Rush (pictured left) in the STC's Oleanna in 1992\nThe original version, which was set during the end of the 19th century and the conception of communism, has been relocated to the end of the 20th century.\nOver the years, it's been given other titles, including The Disinherited, Wild Honey and Fatherlessness.\nThe new version will be produced on Broadway by Stuart Thompson and Sydney Theatre Company, with the theatre location and other casting to be announced later.\nThe Melbourne-born, Sydney-trained actress is up for an Academy Award for Best Actress In A Leading Role for her portrayal of Carol Aird in the acclaimed film Carol.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422894/Cate-Blanchett-make-Broadway-debut-Chekhov-s-long-forgotten-play-adapted-playwright-husband-Andrew-Upton.html"}
