{"authors":[],"date_download":"2018-10-23 00:19:15","date_modify":"2018-10-23 00:19:15","date_publish":"2016-01-28 14:05:26","description":"US industrial giant Caterpillar reported a fourth-quarter loss Thursday and trimmed its sales outlook for 2016, warning that commodity prices would probably ...","filename":"data/vaneerConsumption/Caterpillarreportsquarterlylossoncommodityhit.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h04a-4vVdYopwYQ7f641721b07adfbb1b-94_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421016_Caterpillar-reports-quarterly-loss-commodity-hit_1540253955.html","title":"Caterpillar reports quarterly loss on commodity hit","title_page":"Caterpillar reports quarterly loss on commodity hit | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Caterpillar reports quarterly loss on commodity hit\nUS industrial giant Caterpillar reported a fourth-quarter loss Thursday and trimmed its sales outlook for 2016, warning that commodity prices would probably stay low.\nCaterpillar's loss for the quarter ending December 31 came in at $87 million, compared with $757 million in profits in the year-ago period.\nResults were dented by $682 million in severance and other expenses tied to employee layoffs and facility closures.\nCaterpillar's loss for the quarter ending December 31 came in at $87 million, compared with $757 million in profits in the year-ago period ©Justin Sullivan (Getty/AFP/File)\nRevenues fell 22.6 percent to $11.0 billion.\n\"Cost management, restructuring actions and operational execution are helping the company while sales and revenues remain under pressure from weak commodity prices and slowing economic growth in developing countries,\" said Caterpillar chief executive Doug Oberhelman.\n\"We took tough but necessary restructuring actions in 2015 -- and they were significant.\"\nCaterpillar, which sells heavy machinery to the oil, mining and construction businesses, trimmed its 2016 sales outlook, saying it \"does not anticipate improvement in world economic growth or commodity prices.\"\nCaterpillar now expects 2016 sales and revenues of about $42 billion, down about $3.5 billion from its October forecast.\nCaterpillar projected 2016 profits of $3.50 per share, two cents above analyst expectations.\n\"Our outlook reflects struggling oil and other commodity markets, and continued economic weakness in developing countries,\" Oberhelman said. \"While the US and European economies are showing signs of stability, the global economy remains under pressure.\"\nCaterpillar said it has eliminated 5,000 jobs and closed nine facilities since announcing a restructuring program in September.\nFor all of 2015, Caterpillar reported net income of $2.1 billion, down 43.1 percent from 2014.\nRevenues were $47.0 billion, down 14.8 percent from the year before.","url":"https://www.dailymail.co.uk/wires/afp/article-3421016/Caterpillar-reports-quarterly-loss-commodity-hit.html"}
