{"authors":["Jay Akbar For Mailonline"],"date_download":"2018-10-23 01:00:44","date_modify":"2018-10-23 01:00:44","date_publish":"2016-01-11 11:21:37","description":"Police found the cat named Lily (pictured) 'meowing in discomfort' in a 'suspicious' car parked behind a closed business in California. Its occupants were found in possession of narcotics","filename":"data/vaneerConsumption/CatfoundwithherpawsboundtogetherwithelectricaltapeinCalifornia.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/3008200600000578-0-image-a-21_1452514409221.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393720_Lily-cat-paws-bound-electrical-tape-owner-tied-scratching_1540256444.html","title":"Cat found with her paws bound together with electrical tape in California","title_page":"Cat found with her paws bound together with electrical tape in California | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Two people have been arrested after a cat was discovered with its paws bound together with electrical tape, it has been reported.\nPolice found the cat named Lily on the back seat of a 'suspicious' car parked behind a closed business in Santa Clarita, California.\nIts occupants, a 26-year-old woman and her 23-year-old boyfriend, were also found to be in possession of drugs, according to the Los Angeles County Sheriff's Department (LASD).\nLily's owner, thought to be the female suspect, told a deputy that she tied her legs together 'because it had been scratching'.\nPolice found the cat named Lily (pictured) on the back seat of a 'suspicious' car parked behind a closed business in Santa Clarita, California\nDeputies found the cat upside down inside a cat carrier, unable to move, and meowing loudly in discomfort', ABC reported.\n'It [the cat] was not happy... That's what was attracting our attention, something kind of calling to us,' said LASD's Adam Halloran.\nOnly when they removed her from the carrier did they discover that her front and back paws was tied together with tape. She could not move as deputies tried to free her.\nHalloran said: 'When I first found the cat, I was like, \"no way\", the cat was up on its side...It was crammed in the back... I own cats, that's not how a cat should be treated.'\nDeputies found Lily (pictured) upside down inside a cat carrier, unable to move, and meowing loudly in discomfort'\nLily's owner is now facing animal cruelty charges, the deputies said.\nThe cat was turned over to the Los Angeles County Department of Animal Care and Control, which is also investigating the case.","url":"https://www.dailymail.co.uk/news/article-3393720/Lily-cat-paws-bound-electrical-tape-owner-tied-scratching.html"}
