{"authors":["Lydia Willgress For Mailonline"],"date_download":"2018-10-22 23:11:15","date_modify":"2018-10-22 23:11:15","date_publish":"2016-01-29 10:54:48","description":"The animal, who has now been called Bubbles, was discovered dangling in the concrete pipe at Lake Odessa Cattle Auction in Michigan. She was taken to a veterinary clinic and is now up for adoption.","filename":"data/vaneerConsumption/Catgetsherheadstuckintheentrancetoan80ftconcretepipe.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/10/30B1891D00000578-0-image-a-30_1454064839895.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422467_Feline-scared-Cat-gets-head-stuck-entrance-80ft-concrete-pipe-pushed-out_1540249875.html","title":"Cat gets her head stuck in the entrance to an 80ft concrete pipe","title_page":"Cat gets her head stuck in the entrance to an 80ft concrete pipe | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A cat had to be rescued after she got her head stuck in the entrance to an 80ft drainpipe for up to two days.\nThe animal, who has now been called Bubbles, was discovered dangling in the concrete pipe at Lake Odessa Cattle Auction in Michigan.\nPhotographs show the grey cat's furry neck squashed into the small hole. It is thought she could have been there for days.\nScroll down for video\nA cat had to be rescued after she got her head stuck in the entrance to an 80ft drainpipe for up to two days\nShe was eventually rescued by locals who carefully pushed her head through the pipe until she dropped out.\nKendall Tobias, who discovered Bubbles, told Fox 17: 'We couldn't believe it.\n'I come out here, I look down, here's two eyeballs sticking through that drain.'\nMr Tobias, who frequently attends the auction, said the cat was then taken to the nearby Thornapple Veterinary Clinic.\nBubbles suffered from several cuts and swollen eyelids but was otherwise fine. She is now up from adoption at the clinic.\nLeslie Lettinga, a veterinary technician at Thornapple, told Fox Bubbles was now 'doing great'.","url":"https://www.dailymail.co.uk/news/article-3422467/Feline-scared-Cat-gets-head-stuck-entrance-80ft-concrete-pipe-pushed-out.html"}
