{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:08:58","date_modify":"2018-10-31 00:08:58","date_publish":"2015-09-17 08:00:00","description":"The Catholic Church was a player in two of the biggest bills California lawmakers grappled with this year, working to push politicians to the left in one","filename":"data/vaneerConsumption/CatholicChurchpushestotheleftandtheright.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/bishops_small-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944538.html","title":"Catholic Church pushes to the left and the right","title_page":"Catholic Church pushes to the left and the right | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"The Catholic Church was a player in two of the biggest bills California lawmakers grappled with this year, working to push politicians to the left in one case, and to the right in another.\nMany religious groups lobby the Legislature on a host of issues. But it was unusual for one to be so visible on two of the year’s most high-profile bills: one seeking to combat climate change by reducing use of fossil fuels, and another that would allow terminally ill patients to end their own lives with prescription drugs.\nUPDATE: On October 5, 2015, Gov. Jerry Brown signed the bill allowing doctors to prescribe lethal drugs to terminally-ill Californians who want to end their lives. Read his unusually personal signing letter here.\nBoth pieces of legislation sparked fierce disagreement – including public debate among Catholic lawmakers – and took dramatic turns as they worked their way to the desk of Gov. Jerry Brown. (He has until Oct. 11 to act on the climate change bill and until the end of the month on the assisted-death measure.) As pressure climaxed toward the end of the legislative session, the church sent bishops to meet with lawmakers and their staffs inside the Capitol.\n“This particular session has had a lot of issues that have been of concern, not only to the Catholic community, but often times to the groups of poor and vulnerable that we are most concerned about,” Bishop Jaime Soto of Sacramento said as he strolled a Capitol corridor on his way out of a meeting.\n“That has caught the attention of many people in the Catholic community… and has caused more of a groundswell of Catholic interest in the political process.”\nThe groundswell of interest is supported by the church’s robust lobbying infrastructure. Its advocacy arm, called the California Catholic Conference, employs four lobbyists who work in an office near the statehouse. In addition, the church contracts with a handful of outside lobbying firms that also represent big-ticket clients: insurance companies, racetracks and cigarette makers among them. Over the last five years, the California Catholic Conference has spent more than $1.5 million on lobbying in Sacramento.\nOther religious lobbies spend much less: the Jewish Public Affairs Council about $500,000 during the same time period, the Lutheran Office of Public Policy about $100,000. Most faith groups spend so little on political advocacy in California that they are not registered to lobby state government.\nCatholicism is the biggest organized religion in California, with 28 percent of state residents calling themselves Catholic, according to the Pew Research Center on Religion and Public Life.\nReligious lobbying in California How much religious groups spent lobbying California government from 2010 to 2015:\nIt was concern for the environment that brought Bishop Soto and fellow Bishop Stephen Blaire, of the Diocese of Stockton, to the Capitol last month. They held a closed-door meeting in the governor’s office with about 50 legislative staffers to discuss Pope Francis’ major teaching on climate change.\nThe bishops were joined by Senate President pro Tem Kevin de León, who carried a bill to slash petroleum consumption and increase use of renewable power, echoing some of the Pope’s teachings.\n“Thou shall vote for SB 350,” joked de Leon (D-Los Angeles), as he stood with the bishops for a photo.\nBrown supported the bill and traveled to the Vatican this year for meetings on climate policy. But oil companies went to war against the petroleum cut, which ultimately proved too unpopular to pass the Assembly. When de León and Brown announced that the petroleum cut would be removed from the bill, Brown said the oil companies are “fighting Pope Francis.”\nWhile the church supported de León’s liberal environmental agenda, it opposed a Democratic measure to make it easier for the sickest Californians to choose when to die. Catholic groups lobbied against the bill as part of a coalition that included disability-rights organizations.\n“I have a lot of respect for the Catholic Church, but on the death-with-dignity issue I just happen to think differently,” de León said.\nIt’s hardly the only point of departure. Like most Democrats, de León (who was raised Catholic) and Brown (a former Jesuit seminarian) both support abortion rights and same-sex marriage.\nThe physician-assisted death issue, however, divided Catholic lawmakers.\n“I know that some of my Catholic peers in this body are struggling with this bill,”\nAssemblywoman Cristina Garcia (D-Bell Gardens) said during an emotional floor debate. “I want them to know that… you can continue to practice your faith without imposing it on those who do not practice the same faith with you.”\nAssemblywoman Lorena Gonzalez (D-San Diego) countered with a tearful speech saying her opposition to the bill goes beyond her religion. She said she reached her position after watching her own mother die of cancer, and out of fear that the policy would hurt her constituents — many of whom are poor immigrants without access to good health care.\n“I’m not going to stand up and say I’m not Catholic. I am,” Gonzalez said.\n“(But) I’ve never seen the decisions that I’ve made be addressed to my religion when I stand up for women’s reproductive health.”\nWatching the debate from the gallery above was Dan Diaz, a Bay Area widower who has made several trips to Sacramento to lobby for the bill. After his wife, Brittany Maynard, was diagnosed with terminal brain cancer, the couple moved to Oregon so she could use that state’s law to end her life with prescription drugs.\n“I went to Catholic school. I was an altar boy,” Diaz said. “I am well aware of the religious doctrine involved in this.”\nThe question now is how much that doctrine will influence Brown as he weighs whether to sign the bill.","url":"https://calmatters.org/articles/catholic-church-pushes-to-the-left-and-the-right/"}
