{"authors":[],"date_download":"2018-10-22 21:13:05","date_modify":"2018-10-22 21:13:05","date_publish":"2014-05-06 13:30:41","description":"Flight attendants at Cathay Pacific are demanding their uniforms be redesigned to be less revealing.","filename":"data/vaneerConsumption/CathayPacificUniformsAreTooSexySaysFlightAttendantsUnion.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/422906/hkoutfits_c9d962d0ff9cd863aa9b9364740ce188.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_cathay-pacific-uniforms-are-too-sexy-says-flight-attendants-union-n98086_1540242785.html","title":"Cathay Pacific Uniforms Are 'Too Sexy' Says Flight Attendants Union","title_page":"Cathay Pacific Uniforms Are 'Too Sexy' Says Flight Attendants Union","title_rss":"NULL","source_domain":"nbcnews.com","text":"Short blouses and tight skirts that are \"too sexy\" need to be redesigned, according to the Flight Attendants Union, which represents members of Cathay Pacific's cabin crew.\n\"The blouse is too short and does not cover enough. Whenever a flight attendant bends down, her waistline is exposed,\" Michelle Choi, the trade union's honorary secretary, told the South China Morning Post.\n\"We believe the company intentionally does this to make us look a bit sexier and to let the passenger see more,\" she said.\nChoi said the tight attire has led to increasing incidents of sexual harassment. She said female flight attendants experience problems on one in every 10 flights.\nCathay Pacific said that cabin crew members can now exchange their uniform for a looser, longer option.\n\"Crew are welcome to exchange their uniform any time if they feel the fit is not right,\" the airline told the South Morning China Post. It added that it had modified the length of the blouses and the skirt's tightness.","url":"https://www.nbcnews.com/business/travel/cathay-pacific-uniforms-are-too-sexy-says-flight-attendants-union-n98086"}
