{"authors":["Merrit Kennedy"],"date_download":"2018-10-22 23:16:48","date_modify":"2018-10-22 23:16:48","date_publish":"2018-08-02 00:00:00","description":"It's a shift for the church, which used to consider the death penalty an \"acceptable, albeit extreme, means of safeguarding the common good\" in response to certain crimes.","filename":"data/vaneerConsumption/CatholicChurchNowFormallyOpposesDeathPenaltyInAllCases.json","image_url":"https://media.npr.org/assets/img/2018/08/02/ap_18214380169257_wide-b1641be226479413c9f4b66b807a760aa3f2e92a.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_08_02_634864608_catholic-church-now-formally-opposes-death-penalty-in-all-cases_1540250208.html","title":"Catholic Church Now Formally Opposes Death Penalty In All Cases","title_page":"Catholic Church Now Formally Opposes Death Penalty In All Cases : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Catholic Church Now Formally Opposes Death Penalty In All Cases\nEnlarge this image toggle caption Andrew Medichini/AP Andrew Medichini/AP\nThe Catholic Church now formally considers the death penalty \"inadmissible because it is an attack on the inviolability and dignity of the person\" and is pledging to work for its abolition worldwide.\nIt's a shift for the church, which used to consider the death penalty a \"means of safeguarding the common good\" in response to \"certain crimes.\" The update to the Catechism of the Catholic Church, the book of official teachings of the church, was announced Thursday.\nPope Francis approved the change, which aligns with his public statements against the death penalty.\n\"Recourse to the death penalty on the part of legitimate authority, following a fair trial, was long considered an appropriate response to the gravity of certain crimes and an acceptable, albeit extreme, means of safeguarding the common good,\" the new teaching reads.\nNow, it states that \"there is an increasing awareness that the dignity of the person is not lost even after the commission of very serious crimes.\"\nThe Vatican catechism also cited \"a new understanding has emerged of the significance of penal sanctions imposed by the state.\" It also notes that \"more effective systems of detention have been developed, which ensure the due protection of citizens but, at the same time, do not definitively deprive the guilty of the possibility of redemption.\"\nOver the past decades, Catholic leaders appear to have grown less comfortable with selectively supporting the death penalty. In a letter to bishops about the revision, Cardinal Luis Ladaria, the prefect of the Congregation for the Doctrine of the Faith, noted that Francis' predecessors spoke critically about the death penalty.\nLadaria said the change \"centers principally on the clearer awareness of the Church for the respect due to every human life.\"\nFor example, in 1995, Pope John Paul II said, \"There is evidence of a growing public opposition to the death penalty, even when such a penalty is seen as a kind of 'legitimate defence' on the part of society.\" He described that as a sign of hope.\nAnd, as Ladaria notes, Pope Benedict XVI called for \"the attention of society's leaders to the need to make every effort to eliminate the death penalty.\"\nThe change also reflects Francis' focus on prisons — as The Associated Press notes, he has \"long made prison ministry a mainstay of his vocation.\" He regularly visits inmates.\nLast year, there were \"993 executions in 23 countries,\" according to Amnesty International. That's down 4 percent from the previous year.\nReporting from Rome, NPR's Sylvia Poggioli says the catechism change is \"likely to be opposed by Catholics in the U.S. and other states where capital punishment is legal.\"\nThe pope also recently stressed the idea of individual dignity in a tweet that appeared critical of the Trump administration's policy of separating migrant children from their families, as NPR's Amy Held reported.\n\"A person's dignity does not depend on them being a citizen, a migrant, or a refugee,\" he wrote last month. \"Saving the life of someone fleeing war and poverty is an act of humanity.\"","url":"https://www.npr.org/2018/08/02/634864608/catholic-church-now-formally-opposes-death-penalty-in-all-cases"}
