{"authors":[],"date_download":"2018-10-30 21:37:43","date_modify":"2018-10-30 21:37:43","date_publish":"2017-03-09 17:01:39","description":"A private Catholic high school in Illinois is taking heat for its prom dress guidelines for girls, with critics claiming the strict standards amount to body-shaming.","filename":"data/vaneerConsumption/Catholicschoolspromdresscodeforgirlsdrawsbodyshaming.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/CmgSharedContent/2017/03/09/Images/photos.medleyphoto.13479010.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_catholic-school-_d164efaccde0ce130b642a52486f3c2f__1540935463.html","title":"Catholic school's prom dress code for girls draws body-shaming...","title_page":"Catholic school's prom dress code for girls draws body-shaming...","title_rss":"NULL","source_domain":"ajc.com","text":"A private Catholic high school in Illinois is taking heat for its prom dress guidelines for girls, with critics claiming the strict standards amount to body-shaming.\nWhile the boys' prom dress guidelines at Boylan Catholic High School garner a mere one-sentence description and four images, the girls' guidelines encompass three pages of regulations along with 11 slides featuring images of acceptable and not-acceptable dresses.\n>> Read more trending stories\nSome female students claimed the strict guidelines do not take into account different body shapes, according to CNN. A dress could be acceptable worn by one student but violate the school's guidelines when worn by another student with a different body type, the students argued.\nThe prom dress guidelines have angered some students enough that there is a call to hold a separate prom outside of school.\nA school official told CNN that the dress code isn't new and was created by a committee made up of students and teachers. The official defended the private Catholic school's right to teach students \"moral values, which include modesty.\"","url":"https://www.ajc.com/lifestyles/catholic-school-prom-dress-code-for-girls-draws-body-shaming-complaints/wcFJoMCQdXTO6HMXLDskbO/"}
