{"authors":["Caitlin White"],"date_download":"2018-10-30 23:00:34","date_modify":"2018-10-30 23:00:34","date_publish":"2014-08-14 14:15:03","description":"It's not that Karen Cushman's Catherine, Called Birdy doesn't get a lot of love — it won the Newbery Honor and Golden Kite Award in 1995 — it's just that Catherine is so awesome we can't possibly talk about the book enough.\nIt centers on 14-year-old…","filename":"data/vaneerConsumption/CatherineCalledBirdyByKarenCushmanCouldNeverGetTooMuchLove.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/a79049a3-057c-4e89-ba92-be0da6402148.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35599-catherine-called-birdy-by-karen-cushman-could-never-get-too-much-love_1540940434.html","title":"'Catherine, Called Birdy' By Karen Cushman Could Never Get Too Much Love","title_page":"'Catherine, Called Birdy' By Karen Cushman Could Never Get Too Much Love","title_rss":"NULL","source_domain":"bustle.com","text":"It's not that Karen Cushman's Catherine, Called Birdy doesn't get a lot of love — it won the Newbery Honor and Golden Kite Award in 1995 — it's just that Catherine is so awesome we can't possibly talk about the book enough.\nIt centers on 14-year-old Lady Catherine, who is the daughter of middle-of-the-road English noblemen during medieval times, and who her father has decided needs to be sold off to a rich husband. This doesn't sit well with Catherine, who then does whatever trickery she can to shoo them away.\nCatherine, Called Birdy was Cushman's debut novel and set the tone for her historical young adult fiction career. (She won the Newbery Award the next year again for The Midwife's Apprentice.) And basically everyone loved this book. Teachers, parents, and we students all were fans.\nWhy did we love Catherine, Called Birdy?\nOne word: Catherine. Cushman's heroine is witty, tough, and feminist far ahead of her time. She will also make you laugh out loud. When her brother tells her to keep a diary, her first entry is:\nI am bit by fleas and plagued by family. That is all there is to say.\nIt's perfect. And Cushman tells you so much about Catherine just in those two short sentences. She allows Catherine to stand front and center in the book, not just as an observer, but as a full, three-dimensional participant in all the actions. And I fell in love with her with each of her silly fill-ins for cursing: Corpus Bones! God's thumbs!\nSo when she becomes engaged to Shaggy Bones, we're all cheering alongside her to escape, to run away and become a monk or join the Crusades. And Catherine does something incredible, and unexpected, and I felt like she was actually teaching me something.\nI am who I am wherever I am.\nAs a stubborn 10- or 11-year-old girl myself at the time, this hit me hard. Relenting on your stubbornness doesn't mean that you're giving up; it can sometimes mean you believe in yourself even more.\nWhy do we still love it?\nOne word: Catherine. Yes, as adults, Catherine herself is still the main draw.\nPersonal story: My 5th grade teacher gifted me Catherine, Called Birdy, saying that the protagonist reminded her of me. As a huge book nerd, I was thrilled to receive a book in general, and I loved Catherine once I read through the book. But it wasn't until I got older that I realized what a huge compliment her words were, because Catherine is one awesome 14-year-old. I seriously looked up to her when I was in 5th grade, and I have to tell you, as a close-to-30-year-old, I think I still look up to her.\n#TeamCatherineForever\nThere have been arguments in book reviews on both Goodreads and Amazon that Catherine would have never been able to exist in the Middle Ages without having something terrible happen to her at the hands of men (disappointing). But isn't this just a way of showing us young women not to settle for the status quo and to strive to realize your potential?\nAnd speaking of the Middle Ages, Cushman also envelops readers in the setting. You can practically smell the waste and swat away the fleas:\nI have developed a rash on my body where the rough cloth rubs on my skin. I wanted to take a bath, thinking that the dirt on my skin made the rash worse, but the bathing tub has been turned upside down and is being used as an extra table in the kitchen and i cannot have it until spring, so I just spread goose grease on my rash. The dogs are following me everywhere.\nTo that, Cushman, I say:\nIf You Loved Catherine, Called Birdy, Try Reading...\n1. Changeling (Order of Darkness Book #1) by Philippa Gregory\nPhilippa Gregory is probably best known for her adult historical fiction, like The Other Boleyn Girl, and she takes that spirit into YA with her Order of Darkness series. Set in Italy during the Middle Ages, the story centers on Luca and Isolde, the former who is accused of heresy and the latter who is shut up in a convent.\nClick here to buy.\n2. Tarnish by Katherine Longshore\nWhen Anne Boleyn arrives at King Henry VII's court, she is an outcast because of her sharp, witty tongue. She struggles to find a voice in the male-dominated times, and well, we know how this turns out.\nClick here to buy.\n3. The Forestwife by Theresa Tomlinson\nThe Forestwife tells the medieval tale of Robin Hood from Maid Marian's perspective, before she became a notorious name. Instead she is just a 15-year-old girl who escapes an arranged marriage by running away into the forest and encounters a band of outlaws.\nClick here to buy.\nImages: Giphy (2)","url":"https://www.bustle.com/articles/35599-catherine-called-birdy-by-karen-cushman-could-never-get-too-much-love"}
