{"authors":["Daily Mail Reporter"],"date_download":"2018-10-22 20:17:14","date_modify":"2018-10-22 20:17:14","date_publish":"2016-01-29 00:58:41","description":"The star, who grew up in Swansea, revealed her skin had been saved by the Moroccan oil after it was left as dry as a 'Walker's crisp' by her hectic workload.","filename":"data/vaneerConsumption/CatherineZeraJonessaysshedrenchesherfaceinarganoiltostaylookingyouthful.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/03/30AE9B5B00000578-0-image-a-2_1454036701234.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422011_I-drench-face-argan-oil-say-wrinkle-free-Zeta-Jones-Actress-reveals-secret-youthful-complexion_1540239434.html","title":"Catherine Zera-Jones says she drenches her face in argan oil to stay looking youthful","title_page":"Catherine Zera-Jones says she drenches her face in argan oil to stay looking youthful | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"If you’re wondering how Catherine Zeta-Jones manages to keep her skin so dewy at 46, she’s more than happy to share her secret.\nThe Hollywood star has told how she uses argan oil to moisturise her complexion, saying she ‘saturates’ her face with it to keep looking youthful.\nAlthough the product is becoming increasingly popular in the kitchen for its supposed health properties, Miss Zeta-Jones, like many women, prefers to make it part of her daily beauty regime.\nScroll down for video\nCatherine Zeta-Jones revealed argan oil is the secret to keeping her dewy complexion at the age of 46\nDuring a webchat with Mumsnet yesterday, the star said her hectic workload was taking its toll on her appearance and leaving her complexion as dry as a potato crisp.\nShe said: ‘I’m finding, just from travelling from New York and being in heated hotel rooms, my skin feels like a Walker’s crisp at the moment, but I’ve been using some argan oil just to saturate my skin at night, so it has some nourishment as I sleep, to start the day a little bit more hydrated.’\nThe Oscar-winner, who is in the midst of a promotional tour for the new Dad’s Army film in which she plays a glamorous journalist, added: ‘The real hydration comes from within. You can never drink too much water. No diet sodas!’\nShe added: ‘I think happiness is the best tonic for keeping us youthful. Being happy with who you are inside radiates on the outside.’\nThe oil is produced from nuts of the argan tree, which is native to Morocco and has long been used by Berber women to treat ailments such as dry skin, acne, wrinkles, joint pain and even stretch marks.\nThe traditional harvesting method involves letting goats eat the nuts, which are softer and easier to crack once they have passed through their gut.\nHowever, the cosmetics industry has developed more modern extraction techniques. Experts say it contains twice as much vitamin E as olive oil and is rich in antioxidants. It also has anti-inflammatory properties that can help those with arthritis or rheumatism.\nThe Hollywood star has been travelling the world promoting Dad's Army, the remake of the television classic\nPrices range from £9.99 ($14) to £74 ($105) depending on quality and strength. Bread can be dipped in it or it can be drizzled on couscous and pasta. It is also credited with being able to lower cholesterol and ease arthritis. During the webchat, Miss Zeta-Jones – married to Michael Douglas, 71 – also admitted women over 40 are sidelined by Hollywood movie bosses.\nShe said: ‘I have been in this business since I was nine years old, and have heard the same thing said throughout the different parts of my career. Then, hello, I’m in my 40s... and it’s true.’\nShe added: ‘There’s talk in Hollywood about diversity right now, and it’s a good conversation to be had, and necessary, but when we say diversity, let’s mean diversity for actors with ethnic differences, age differences, and sex differences.’\nThe actress said her two children – Dylan, 15, and 12-year-old Carys – are her greatest achievement.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422011/I-drench-face-argan-oil-say-wrinkle-free-Zeta-Jones-Actress-reveals-secret-youthful-complexion.html"}
