{"authors":[],"date_download":"2018-10-30 22:52:40","date_modify":"2018-10-30 22:52:40","date_publish":"2014-08-14 17:09:58","description":"In Chula Vista, California, a woman and her adult daughter were recently forced to hide in a bedroom when their cat Cuppy held them hostage. Police were called in to handle the situation, but this isn't an isolated event for law enforcement officers…","filename":"data/vaneerConsumption/CatsAreHoldingEverybodyHostageIn2014ATimelineOfTheRevolution.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/3269f8bb-6448-4f4c-9038-5dcbed539336.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35752-cats-are-holding-everybody-hostage-in-2014-a-timeline-of-the-revolution_1540939960.html","title":"Cats Are Holding Everybody Hostage In 2014 - A Timeline Of The Revolution","title_page":"Cats Are Holding Everybody Hostage In 2014 — A Timeline Of The Revolution","title_rss":"NULL","source_domain":"bustle.com","text":"In Chula Vista, California, a woman and her adult daughter were recently forced to hide in a bedroom when their cat Cuppy held them hostage. Police were called in to handle the situation, but this isn't an isolated event for law enforcement officers across the nation. Nope, Cuppy the cat is just the latest in a string of hostage situations carried out by fierce felines, and it looks like there is no end in sight for house-cat owners everywhere.\nThe woman and her daughter called 911 after their house cat, which they had owned for 14 years, went berserk. Cuppy shredded the woman's nightgown and sent them scrambling for the bedroom, where they phoned for outside help. Then came this all-too common report from a 911 dispatcher:\nFemale's calling on 911 advising that her cat is holding her and her adult daughter hostage in the bedroom.\nCuppy eventually went quietly with the police, laying to rest another cat saga. But this is just another brick in the wall of cat hostage situations, slowly building toward total feline refurlution. At the rate we're going, we will soon live in a world where the kittehs that we once used as Internet meme fodder will rule us completely.\nWhat should we do? How do we move forward from here? Will news reporters ever be able to take themselves seriously when they say that there was a cat hostage situation? Let's look at these cases and see.\nLux, March 2014\nLux may still be the most famous of the cat 911 calls. The Portland-area cat turned on its owners and scratched their 7-month-old son. The family sheltered in the bedroom while police came out to take control of the 22-pound Himalayan.\nLux has since been helped by cat-whisperer Jackson Galaxy on his Animal Planet show My Cat From Hell. He was relocated to a new home and put on medication for feline hyperesthesia syndrome, which causes cats to have bursts of violent behavior. His foster parents, shown at the end of the show, gave him up, fearing for their own safety.\nKush, July 2014\nIn DeLand, Florida, a woman and her husband fled to their bedroom to hide from Kush, their 4-year-old Russian Blue that lost its mind. The couple was covered in scratches and was unsure what could have caused the cat's outburst, saying that the cat had never been this violent.\nKush was not up-to-date on shots, so the cat needed to be quarantined after officers removed her from the home. She returned home in mid-July, with all of her vaccinations and having being spayed at the vet's office.\nCuppy, August 2014\nWhich brings us to the aforementioned Cuppy. Though he has just been taken away, his owners say that they may euthanize the cat instead of trying to reintroduce him to the home.\nSo here's what we know now:\nThere has been about a million percent uptick in cat hostage incidents in 2014\nAll of these cats have really dumb names\nThe bedroom seems like everyone's safe spot\nAll the cats' coloring is a combination of grey in some way\nI'm working with cat analysts to further assess this epidemic and will report back with any revelatory information. Until then, stay safe, cat owners.\nImages: Screenshot/ABC 7, Screenshot/Discovery, DeLand Police Dept., Screenshot/ABC 7, Flickr/opethpainter,","url":"https://www.bustle.com/articles/35752-cats-are-holding-everybody-hostage-in-2014-a-timeline-of-the-revolution"}
