{"authors":["Kelly Mclaughlin For Mailonline"],"date_download":"2018-10-23 03:43:12","date_modify":"2018-10-23 03:43:12","date_publish":"2017-04-26 15:19:31","description":"The Laguna Vista Police Department shared an image of the pair late last week on its Facebook page alongside a warning for residents of the south Texas town to keep an eye out for rattlesnakes.","filename":"data/vaneerConsumption/Catshowsnofearashesitsnexttoadeadlyrattlesnake.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3FA02AE000000578-0-image-a-65_1493216363306.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447958_Cat-shows-no-fear-sits-deadly-rattlesnake_1540266192.html","title":"Cat shows no fear as he sits next to a deadly rattlesnake","title_page":"Cat shows no fear as he sits next to a deadly rattlesnake | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A cat in Texas has been dubbed 'fearless' after it was pictured casually sitting next to a rattlesnake that looked like it was about to strike.\nThe Laguna Vista Police Department shared an image of the pair late last week on its Facebook page alongside a warning for residents of the south Texas town to keep an eye out for rattlesnakes.\nMembers of the Bay Area Birders of LV came across the rattlesnake while on a walking trail in the city and called police to help them remove it.\nThe Laguna Vista Police Department shared an image of cat and rattlesnake late last week on its Facebook page alongside a warning for residents of the south Texas town to keep an eye out for rattlesnakes.\nMembers of the Bay Area Birders of LV came across the rattlesnake while on a walking trail in the city and called police to help them remove it\nBut before handling the snake, they snapped a photo of the reptile hanging out with its newfound feline friend.\n'LV Residents, earlier today Laguna Vista Police Officers assisted the Bay Area Birders of LV that were at the walking trail when they suddenly spotted a rattlesnake,' the police department said in a statement about the incident.\nIt added: 'We ask that you all use caution and are aware of your surroundings when walking on the walking trail or any other locations.\nBut before handling the snake, they snapped photos of the reptile hanging out with its newfound feline friend\n'Generally, rattlesnakes emerge from hibernation in March or April, or when the average daytime temperatures reach and remain about 60F and higher.\n'The snakes are then most active when the temperatures are between 80-90F.\n'This means that the snakes may be active most of the day during the spring, and during the early mornings and late afternoons throughout the summer. Please be careful!'\nThe department later shared another image giving the feline the title: 'Fearless Laguna Visa Cat!'","url":"https://www.dailymail.co.uk/news/article-4447958/Cat-shows-no-fear-sits-deadly-rattlesnake.html"}
