{"authors":["Associated Press"],"date_download":"2018-10-22 22:35:07","date_modify":"2018-10-22 22:35:07","date_publish":"2016-01-29 09:39:17","description":"KENANSVILLE, Fla. (AP) — Some cowboys had selfie-sticks, and others posted regularly on Facebook while helping to herd more than 400 head of cattle more than...","filename":"data/vaneerConsumption/CattledrivedrawsfocustoFloridascowboyhistory.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:c87b70dad36e4f6ba731f73b306f241f-3bmscybNe842cce83474b5387390-60_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422419_Cattle-drive-draws-focus-Floridas-cowboy-history_1540247707.html","title":"Cattle drive draws focus to Florida's cowboy history","title_page":"Cattle drive draws focus to Florida's cowboy history | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Cattle drive draws focus to Florida's cowboy history\nKENANSVILLE, Fla. (AP) — Some cowboys had selfie-sticks, and others posted regularly on Facebook while helping to herd more than 400 head of cattle more than 50 miles through central Florida.\nDespite their efforts to re-create the life of Florida cowboys from the 19th century by wearing bonnets, suspenders and cowboy hats, and sleeping in sod fields at night, the more than 400 participants who took part in the once-in-a-decade cattle drive through the heart of Florida this week couldn't help but allow for little bits of the 21st century to seep in.\nSemi-trailers hauled catered food from campsite to campsite for the weeklong trek. Participants like Doug Yarborough regularly checked his cellphone for messages while on horseback in the middle of fields where there was nothing but cows, sod, palm fronds and cow paddies.\nIn this Tuesday, Jan. 26, 2016 photo, riders arrive for lunch during the Great Florida Cattle Drive 2016, in Kenansville, Fla. Spanish explorers brought horses and Andalusian cattle to the New World in the 16th century, making Florida the nation's oldest cattle-raising state. (AP Photo/Wilfredo Lee)\n\"It's like going back in time, but you get to bring along modern things,\" said Yarborough, whose family has a ranch in Geneva, near Orlando.\nAlexi Gutierrez, who makes and fits horseshoes for living, installed two car seats that can recline and have armrests for comfort at the front of his covered wagon pulled by mules. His friend, Bryce Burnett, also a farrier, teased him that he had forgotten to install cup-holders.\n\"You can't drink and drive,\" Gutierrez shot back.\nThe purpose of the once-a-decade Great Florida Cattle Drive was to draw attention to Florida's deep cowboy history at a time when the state is known more for Disney World fantasies, South Beach flashiness, Panama City Beach spring break rowdiness and Cape Canaveral rocket launches. This week's drive was the third one since 1995. It ends with a celebration at the Kenansville Silver Spurs Arena on Saturday.\n\"We try to remember the way it used to be and draw attention that the cattle industry was the first industry in America,\" said Doyle Conner Jr., who is chairman of the cattle drive.\nSpanish explorers brought horses and Andalusian cattle to the New World in the 16th century, making Florida the nation's oldest cattle-raising state. Today, Florida's $531 million cattle industry has 1.7 million cattle and calves, and it's the 17th largest in the nation, according to the U.S. Department of Agriculture. Most of Florida's cattle are used for breeding and nursing, and they're typically shipped out West once they get near adulthood.\n\"You do whatever you can to keep it going,\" said Linda Ballatine Brown, whose husband's family will have been running a ranch in Osceola County for six generations, if her grandchildren eventually takeover as expected. \"It's a tough life. You have to love the land to do it.\"\nFlorida's cowboys differ from their more famous Western counterparts in a few ways. They are better known for using whips than ropes, and hence earned the name \"crackers\" from the sound of a cracking whip. They liked to be called \"cow hunters\" rather than cowboys since the job often involves searching for cattle in swamps and through sawgrass fields. They're more likely to wear lace-up boots than pull-on boots since Florida's swampy terrain often means wet feet which makes pull-on boots difficult to take off.\nSome things never change in cowboy life, whether in the 19th or 21st century, such as the popularity of farriers like Gutierrez and Burnett. Every couple of miles, riders stopped them and asked for help with their horses' feet. Holly Huffman-Pope's horse, Rocky, had an abscess in his hoof, and Burnett cut out the infection so that it would drain.\n\"We hope he will be able to finish the trip,\" said Huffman-Pope, who has a ranch in Polk City. \"Horses come first. Riders come second.\"\nWhile there was help for horses, there was no AAA tire-repair service for the dozen or so wagons on the ride that stretched through several ranches and state land in Osceola County. A tire on Malcom Jessup's covered wagon went flat less than a mile from the campsite on the second day of the cattle drive. Jeff Parker rode up on his horse, carrying a red portable power pack to pump air into the tires.\n\"You don't see this often on a cattle drive,\" said Parker, referring to the power pack.\nBut it didn't help since the hole in the tire was too big. After a cellphone call, a mechanic from the local farm stopped by with a replacement tire as more than a dozen cowboys stood around and watched, including Deborah Ritchie, of Jacksonville.\n\"I just texted my daughter, 'How many cowboys does it take to change a wagon tire?'\" said Ritchie, deadpan.\n___\nFollow Mike Schneider on Twitter: http://twitter.com/mikeschneiderap\nIn this Tuesday, Jan. 26, 2016 photo, Richard Claybrooke, center, of Parrish, Fla., sits with his sons Brady, left, 7, and Logan, 10, after stopping for lunch during the Great Florida Cattle Drive 2016, in Kenansville, Fla. The once-a-decade event was organized to draw attention to Florida's deep cowboy history. (AP Photo/Wilfredo Lee)\nIn this Tuesday, Jan. 26, 2016 photo, Chris Helton, 12, of Sandersville, Ga., prepares his horse, Dakota, for the second day of the Great Florida Cattle Drive 2016, in Kenansville, Fla. The purpose of the once-a-decade Great Florida Cattle Drive is to draw attention to Florida¿s deep cowboy history at a time when the state is known more for Disney World fantasies, South Beach flashiness, Panama City Beach spring break rowdiness and Cape Canaveral rocket launches. (AP Photo/Wilfredo Lee)\nIn this Tuesday, Jan. 26, 2016 photo, a rider herds cattle during the Great Florida Cattle Drive 2016, in Kenansville, Fla. Most of Florida's cattle are used for breeding and nursing, and they're typically shipped out West once they get near adulthood. (AP Photo/Wilfredo Lee)\nIn this Tuesday, Jan. 26, 2016 photo, farrier Bryce Burnett of Zolfo Springs, Fla., files down the hoof of a horse named Rocky during the second day of the Great Florida Cattle Drive 2016, in Kenansville, Fla. Every couple of miles, riders stopped him and asked for help with their horses' feet. Rocky had an abscess in his hoof, and Burnett cut out the infection so that it would drain. (AP Photo/Wilfredo Lee)\nIn this Tuesday, Jan. 26, 2016 photo, Laura Jessup of Spencer, Tenn., takes a photo as she waits for her wagon to be fixed during the Great Florida Cattle Drive 2016, in Kenansville, Fla. The tire on Jessup's covered wagon went flat less than a mile from the campsite on the second day of the cattle drive. (AP Photo/Wilfredo Lee)\nIn this Tuesday, Jan. 26, 2016 photo, cowboys lift up a covered wagon to remove a flat tire on Malcolm Jessup's wagon during the Great Florida Cattle Drive 2016, in Kenansville, Fla. The tire on Jessup's covered wagon went flat less than a mile from the campsite on the second day of the cattle drive. (AP Photo/Wilfredo Lee)\nIn this Tuesday, Jan. 26, 2016 photo, Steve Pyle of DeLand, Fla., a veteran attending with the Wounded Warrior Project, relaxes in the back of a covered wagon as he waits for the start of the second day of the Great Florida Cattle Drive 2016, in Kenansville, Fla. (AP Photo/Wilfredo Lee)\nIn this Tuesday, Jan. 26, 2016 photo, Ellison Hardee and his daughter Robin, of Chiefland, Fla., saddle their horse, Dilly, during the second day of the Great Florida Cattle Drive 2016, in Kenansville, Fla. More than 400 participants took part in the once-in-a-decade cattle drive through the heart of Florida. (AP Photo/Wilfredo Lee)\nIn this Tuesday, Jan. 26, 2016 photo, horses drink water from a trough as their riders eat lunch during the Great Florida Cattle Drive 2016, in Kenansville, Fla. The purpose of the once-a-decade Great Florida Cattle Drive is to draw attention to Florida¿s deep cowboy history at a time when the state is known more for Disney World fantasies, South Beach flashiness, Panama City Beach spring break rowdiness and Cape Canaveral rocket launches. (AP Photo/Wilfredo Lee)\nIn this Tuesday, Jan. 26, 2016 photo, a rider lets his horse drink from a stream as he waits for the start of the second day of the Great Florida Cattle Drive 2016, in Kenansville, Fla. The purpose of the once-a-decade Great Florida Cattle Drive is to draw attention to Florida¿s deep cowboy history at a time when the state is known more for Disney World fantasies, South Beach flashiness, Panama City Beach spring break rowdiness and Cape Canaveral rocket launches. (AP Photo/Wilfredo Lee)\nIn this Tuesday, Jan. 26, 2016 photo, storyteller Eric Hoeppner, left, and guitarist Chuck Hardwicke relax at a campsite during the Great Florida Cattle Drive 2016, in Kenansville, Fla. \"We try to remember the way it used to be and draw attention that the cattle industry was the first industry in America,\" says Doyle Conner Jr., who is chairman of the cattle drive. (AP Photo/Wilfredo Lee)\nIn this Tuesday, Jan. 26, 2016 photo, Wendy Wilson of Ocala, Fla., kisses Arcus the horse as she and other riders stop for lunch and to water the horses during the Great Florida Cattle Drive 2016, in Kenansville, Fla. (AP Photo/Wilfredo Lee)","url":"https://www.dailymail.co.uk/wires/ap/article-3422419/Cattle-drive-draws-focus-Floridas-cowboy-history.html"}
