{"authors":[],"date_download":"2018-10-21 02:47:47","date_modify":"2018-10-21 02:47:47","date_publish":"2018-07-30 15:55:39","description":"The newsletter will focus on the intersection of Washington and Silicon Valley.","filename":"data/vaneerConsumption/CatZakrzewskitoanchorThePostsnewTech202newsletter.json","image_url":"https://www.washingtonpost.com/resizer/4oIKRyIvFL1Z8DgI9jnA3xN0qqo=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OT6RFGUBLM2W7AQ74CMRI5JD6Q.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_07_30__1540090067.html","title":"Cat Zakrzewski to anchor The Post’s new Tech 202 newsletter","title_page":"Cat Zakrzewski to anchor The Post’s new Tech 202 newsletter - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Announcement from National editor Steven Ginsberg, PowerPost editor Rachel Van Dongen, and deputy editor of PowerPost Sara Sorcher:\nWe’re very excited to announce that Cat Zakrzewski will join The Post as the anchor of a new PowerPost newsletter on the intersection of Washington and Silicon Valley.\nCat comes from The Wall Street Journal, where she spent the last two-and-a-half years as a venture capital reporter based in San Francisco. Her experience and sourcing in Silicon Valley will help inform her coverage of the rapidly changing policy debate on Capitol Hill, within the regulatory agencies and in the White House. She will also focus on the role social media companies play in distributing news, competition among tech titans and the challenge that governments face in keeping pace with new technologies.\nBefore joining the Journal, Cat wrote about tech policy for TechCrunch and interned for the Boston Globe in Washington, where she covered the Massachusetts congressional delegation with a focus on tech policy. She was a homicide watch intern for the Chicago Sun-Times, and her work has been published in USA Today and UPI.\nCat is a graduate of the Medill School of Journalism at Northwestern University. She is originally from the Philadelphia suburbs, and she is very excited to move to Washington and live near a Wawa again. Please welcome her when she starts Aug. 20.","url":"https://www.washingtonpost.com/pr/wp/2018/07/30/cat-zakrzewski-to-anchor-the-posts-new-tech-202-newsletter/"}
