{"authors":[],"date_download":"2018-10-22 23:22:40","date_modify":"2018-10-22 23:22:40","date_publish":"2014-07-12 00:00:00","description":"From the basketball court to the soccer pitch, ESPN's Howard Bryant and NPR's Tamara Keith catch up on the latest news in sports.","filename":"data/vaneerConsumption/CavaliersFansCanFinallyMakePeaceWIthTheirOldLeBronJerseys.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2014_07_12_330889577_cavalier-fans-can-finally-make-peace-with-their-old-lebron-jerseys_1540250560.html","title":"Cavaliers Fans Can Finally Make Peace WIth Their Old LeBron Jerseys","title_page":"Cavaliers Fans Can Finally Make Peace WIth Their Old LeBron Jerseys : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Cavaliers Fans Can Finally Make Peace WIth Their Old LeBron Jerseys\nTAMARA KEITH, HOST:\nIt's time now for even more sports. Fans of the Cleveland Cavaliers must regret burning their Lebron James jerseys now. The prodigal NBA star will return to his home team - well, right after he attends the World Cup final in Brazil. For more on both of these sports, we're joined now by Howard Bryant of espn.com and ESPN the Magazine. Howard, good morning.\nHOWARD BRYANT: Good morning, Tamara. How are you?\nKEITH: I'm good. So Lebron is going back to Cleveland. But when he left in 2010 to join the Miami Heat, the Cavaliers' owner cursed him with bad karma for his, quote, shameful display of selfishness and betrayal. Those are pretty harsh words after such a painful breakup. Why does Cleveland want Lebron back?\nBRYANT: Well, obviously - I enjoyed what Lebron had to say. It's simply about being from there and the concept of being home. And that concept of home mattered a lot to him in the end. I think that in the end, he regretted leaving. And I feel like at some point - with the money being what it is today - that there are concerns other than money that have to guide you. And I think that Lebron recognized after four years that - that that's where he belongs. And I kind of applaud him for doing that. I remember when I was covering the New York Yankees a bunch of years ago and Jason Giambi had come in from the Oakland A's. And he signed a $120,000,000 deal and while he was there, he regretted it. He missed Oakland. And there's more - there's more things than money when you're making that kind of money. And I - it would be interesting to see over the years coming whether or not players will begin to think about their hearts as much as their wallets.\nKEITH: Lebron could have made more money staying with the Miami Heat. Does this mean that he has heart?\nBRYANT: (Laughing) Well, he's a great player. And on a basketball court, obviously, that's all we can really judge. We don't know them as people. I believe that - that what he's done over the course of his career - I mean, he's the difference maker. And if you watch what's happened during this free agent period - no moves are made until he made his move. And that's kind of the power that he has there. There hasn't been a player - I don't think we've ever seen a player in professional sports who has had this much control over where he plays and how much it affects where everybody else goes. He's essentially a walking dynasty because of these opt out clauses in contracts where you can leave after a couple of years. And also because the lack of allegiance in sports today - you can have - Lebron could actually be the type of player who could go wherever he wanted to go in his prime several times. He chose to come back to Cleveland and maybe that's where he'll stay.\nKEITH: Of course tomorrow is the big final World Cup deciding game. And while Germany may be the favorite to win, Argentina has the best player in the world - Lionel Messi. Is this the moment Argentina has been waiting for?\nBRYANT: Absolutely it is. And it's the moment that Lionel Messi's been waiting for. I'm not sure Germany is the favorite. I think that this is the type of matchup - you've got two great historic soccer powers. You've got Germany that's won the World Cup, you've got Argentina that's won the World Cup. You've got great players on both sides. You've got Toni Kroos, you've got Thomas Muller, you've Messi, you've got big names that if you cover the sport or if you watch the sport, everybody knows who these guys are. And it's not a Cinderella thing on either side. Both of these franchises have - these countries - have huge, huge, huge successes. And so it's going to be a great matchup. I think that on the one hand, Germany is so solid and on the other hand, Argentina is kind of destined because Messi would really be the national hero he is around the world if he's able to bring this home for them.\nKEITH: Howard Bryant of ESPN, thank you so much.\nBRYANT: My pleasure.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2014/07/12/330889577/cavalier-fans-can-finally-make-peace-with-their-old-lebron-jerseys"}
