{"authors":["Abc News"],"date_download":"2018-10-30 00:52:10","date_modify":"2018-10-30 00:52:10","date_publish":"2018-10-28 12:36:24","description":"Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.","filename":"data/vaneerConsumption/CavaliersfirecoachTyronnLueafter06start.json","image_url":"http://media.video-cdn.espn.com/motion/2018/1029/dm_181029_kershaw_machado_future/dm_181029_kershaw_machado_future_default.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Sports_cavaliers-fire-coach-tyronn-lue-start_story_id=58807840_1540860730.html","title":"Cavaliers fire coach Tyronn Lue after 0-6 start","title_page":"Cavaliers fire coach Tyronn Lue after 0-6 start - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"The Cleveland Cavaliers fired coach Ty Lue on Sunday, sources say the team plans to promote Larry Drew to interim coach.\nCleveland has started the season with six straight losses.\n\"My time here in Cleveland was truly special,\" Lue said in a statement. \"I am very grateful for the dedication, sacrifice, and support of all the players on our team, the tremendous coaches I worked with and of course, our incredible fans. Lastly, deep thanks to Dan Gilbert, David Griffin and Koby Altman for the opportunity over the last three years and I only wish the organization success moving forward.\"\nDrew was meeting with management on Sunday morning to discuss terms of a promotion to interim coach, league sources said. It is possible he'll seek a more permanent appointment. Drew was 8-1 as the interim coach a year ago when Lue was sidelined with illness. He led Atlanta to the playoffs in each of his three years as heads coach and spent one year at Milwaukee's head coach in 2013-14.\nLue led the Cavaliers to three straight NBA Finals, including the 2016 NBA championship. He was 128-83 on the job. Cleveland's ownership and management had hoped the team would compete for a playoff spot, although it may not be realistic with the hole the loss of LeBron James leaving in free agency left on the roster.\nThis was second time that James left Cleveland in free agency. The first time the Cavaliers went from 61 wins with James in 2009-10 to 19 wins without him the next season.\nSources told ESPN's Brian Windhorst that Lue recently had a disagreement with general manager Altman over playing veterans. Altman preferred that Kyle Korver and JR Smith be taken out of the rotation to give time to younger players. After one game in which they didn't play, Lue put both back in the rotation without consulting Altman.\nOwner Gilbert has also encouraged more playing time for rookie Collin Sexton, sources told Windhorst. Sexton is averaging just 23.5 minutes per game.\nLue is still owed roughly $15 million on the contract he signed in 2016 after the team won the title, sources said.\nNow with the Lakers, James thanked Lue on Sunday.\nCavaliers forward Kevin Love also gave a shout out to Lue on social media.\n\"You helped me see the big picture. Life changing experiences and teaching points,\" Love posted on Instagram. \"Nothing but love and admiration. Know we will work towards something greater together again. THANK YOU.\"\nAltman planned to address the Cavaliers players at a noon ET practice session and inform them that Drew is the \"voice\" of the team for Sunday, league sources said. Altman and Gilbert want Drew to accept the interim coaching job now with the potential of a long-term commitment later, but that hasn't happened yet, sources said. Drew prefers an appointment as head coach that extends beyond this season, sources said.\nWhen Lue replaced David Blatt as Cavaliers coach in the 2015-2016 season, he was given a deal beyond the balance of that season, and he negotiated a long-term extension after winning a title that spring.\nThe Athletic first reported Lue's dismissal.","url":"https://abcnews.go.com/Sports/cavaliers-fire-coach-tyronn-lue-start/story?id=58807840"}
