{"authors":["Kayleigh Giles For Mailonline"],"date_download":"2018-10-23 00:32:05","date_modify":"2018-10-23 00:32:05","date_publish":"2016-01-29 13:33:00","description":"The star may have been forced to confront her former flame Sam Reece in the Celebrity Big Brother house on Friday, as part of a time-sensitive telephone task.","filename":"data/vaneerConsumption/CBBsStephanieDavisburstsintotearsasshereceivesmysteryphonecall.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30B281B600000578-0-image-a-36_1454074284538.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422755_Is-Stephanie-Davis-speaking-Sam-Reece-CBB-star-bursts-tears-receives-phonecall-mystery-man-packing-PDA-Jeremy-McConnell_1540254725.html","title":"CBB's Stephanie Davis bursts into tears as she receives mystery phonecall","title_page":"CBB's Stephanie Davis bursts into tears as she receives mystery phonecall | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She awkwardly dumped him on television earlier this week, claiming she needs 'to be single'.\nBut Stephanie Davis may have been forced to confront her former flame Sam Reece in the Celebrity Big Brother house on Thursday, as part of a time-sensitive telephone task, in scenes which aired during Friday night's episode.\nWhen housemate Scotty T answered the telephone and was forced to ask the unknown male caller a series of questions, the 22-year-old looked a little panicked, most likely over fears she could be forced to speak to her ex - whom she's been 'cheating on' on national television.\nEmotional: Stephanie Davis burst into tears as she shared an emotional chat with her father as part of a telephone task on day 25 of Celebrity Big Brother\nBut it was soon revealed that the unidentified caller is Stephanie's father, who reassured her that her family and friends are 'so proud' and in the face of all adversity, she is a 'fighter'.\n'Have I made you proud?' she instantly asked him, before he warmly responded: 'You've made us laugh, you've made us cry. You've been so funny.'\nHinting at his opinion on new beau Jeremy McConnell, she said: 'I've just got to follow my heart dad.'\nSupportive: Her father reassures her that her family and friends are 'so proud' and that in the face of all adversity she is a 'fighter\nSeeking reassurance: 'Have I made you proud?' she instantly asks him, before he warmly responds: 'You've made us laugh, you've made us cry. You've been so funny.'\nSubtle: Hinting at his opinion on new beau Jeremy McConnell, she says: 'I've just got to follow my heart dad.'\nEncouragement: Determined to lift his daughter's spirits once more, he adds: 'Stephanie, don't forget who you are or where you've come from. You're a fighter\nTelling all: The TV star instantly rushes over to Jeremy McConnell to share details of the exchange\nWelcome embrace: The Beauty School Copouts star gives Stephanie a calming hug\nReiterating his support for the actress, her father replied: 'Stephanie, we know you've had decisions to make and that's not easy but that's life, babes. We've all had to go through that. What you need to do is give your head a wobble.'\nDetermined to lift his daughter's spirits once more, he added: 'Stephanie, don't forget who you are or where you've come from. You're a fighter.\n'Look for the rainbow and feel the angel on your shoulder.'\nSmitten kittens: The former Hollyoaks star had spent most of the morning getting cosy with love interest Jeremy\nWild thing! Clad in an animal print onesie, Stephanie sprawls herself across the Irish model as he cradles her in his arms\nIn one last attempt to seek her father's approval, she asked: 'Should I just keep being myself?'\nClad in an animal print onesie, her face completely free of make-up, the former Hollyoaks actress sobbed into the telephone.\nPrior to the phone call, viewers saw Stepahnie express her concerns over it being from Sam to in-house love interest Jeremy.\nAfter telling him she's going to struggle with the task, he tried to reassure her, saying: 'If it's Sam you're going to have to speak to him on the outside any way. Do what you have to do. Don't say any thing on the phone. Just say you're sorry.'\nThe tasks sees housemates supplied with countless phones which they must answer before determining who is at the other end of the line via a series of 'yes' or 'no' questions.\nPucker up! Unable to resist his charms, the 22-year-old then plants a kiss on his lips as she rests between his legs\nOnce the housemate who answers the phone is able to determine who the call is for, they are then able to hand over the phone to allow the housemate and the caller to share a brief chat - making sure to keep an eye on the time as they're only given a limited number of minutes.\nBut Stephanie's woeful display is a stark contrast to her mood just an hour before, as she got cosy with housemate and new love interest Jeremy on the living room sofa.\nAfter weeks of playing down their chemistry, the smitten duo - who shared a steamy smooch for the first time in Thursday night's episode - packed on the PDA once again as Stephanie sprawled herself on top of the Irish model as they chatted.\nThe ex soap star even planted a kiss on Jeremy's lips as he cradled her in his arms as the two lay on his bed.\nIn an attempt to tear them apart from each other, fed up Scotty T got in on the action as he hopped into bed with the love birds, much to Stephanie's entertainment.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422755/Is-Stephanie-Davis-speaking-Sam-Reece-CBB-star-bursts-tears-receives-phonecall-mystery-man-packing-PDA-Jeremy-McConnell.html"}
