{"authors":["Becky Freeth For Mailonline"],"date_download":"2018-10-23 00:13:57","date_modify":"2018-10-23 00:13:57","date_publish":"2016-01-28 13:55:34","description":"A ban on contact appeared to have brought the two closer in Celebrity Big Brother on Thursday, when Stephanie straddled the Irishman in the bedroom and later leaned in for their first kiss in bed.","filename":"data/vaneerConsumption/CBBsStephanieDavisandJeremyMcConnellshareFIRSTpassionatesmooch.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30A9FD6700000578-0-image-a-77_1453988590896.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420967_CBB-s-Stephanie-Davis-Jeremy-McConnell-share-passionate-smooch-detox-room_1540253637.html","title":"CBB's Stephanie Davis and Jeremy McConnell share FIRST passionate smooch","title_page":"CBB's Stephanie Davis and Jeremy McConnell share FIRST passionate smooch | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"After three weeks of sharing a bed, Stephanie Davis and Jeremy McConnell have finally shared a steamy smooch.\nA ban on contact appeared to have brought the two closer in Celebrity Big Brother on Thursday, when Stephanie straddled the Irishman in the bedroom and later leaned in for their first kiss in bed.\nStephanie dramatically declared that she wanted to be single the previous day, saying in front of the cameras that her boyfriend outside the house, Sam Reece, was not right for her.\nScroll down for video\nSealed the deal: Stephanie Davis and Jeremy Connell shared a steamy smooch after their bedtime heart-to-heart on Thursday\nIt's doubtful that model Sam will be waiting for her after Celebrity Big Brother ends, since the most recent footage shows Jeremy and Stephanie snogging in the dark.\nIn scenes due to air on Thursday, Jeremy is seen stroking the brunette's head and telling her 'what's done is done' as they found themselves alone in the detox room after-hours, on Wednesday night.\n'I don't think we need to explain any more,' he said, adding: 'I don't care what they say, I'm proud of you. There's no going back any more.'\nHe was consoling her about her regret over 'dragging [him] into it,' as she cried in his arms over her 'toxic' behaviour in the house.\nSee more of the latest CBB updates as Stephanie and Jeremy share a steamy smooch\nWhat ban? Stephanie disregarded her warning to keep away from her CBB housemate because of their 'toxic' bond earlier that day\nCloser than ever: Jeremy declared that there was no going back as they were reunited at bed time\nNo going back: He was there to reassure the star about their reaction outside the house\n'Despite how I feel,' she said. 'I've sort of been wondering what I've done wrong but you don't know what it's like outside the house. What's done is done now anyway. That's alright isn't it?'\nStephanie had been slapped with a ban on contact with Jeremy, after temporary housemate and lifestyle guru Gillian McKeith, warned her to steer clear of him under a new 'detox' regime.\nIt seemed like the housemates were heading for a fail on this week's shopping task when Stephanie proved she just couldn't keep away and went running straight into his arms for a cuddle.\nIt's over: After declaring herself single on Wednesday, she appeared to issue a warning to beau Sam Reece\nLocking lips: They shared a bed in the detox room, seemingly all alone\nThough not long after her stark warning, Stephanie was seen straddling the Irish hunk while his wandering hands migrated to her derriere.\nStephanie and Jeremy then ignored their housemates' glares and moved into the bathroom area for more privacy.\nFellow toxic housemate John Partridge reminded the duo: 'You're not supposed to be messing... remember? You're going to fail your task.'\nSee the latest updates from the CBB house as Stephanie can't keep away from Jeremy\nCan't keep away: Dressed in just his boxers, Jeremy seemed to latch onto the petite brunette\nSome privacy: They migrated to the bathroom for privacy as they embraced during a ban from one another, imposed by Gillian McKeith\nBut Stephanie was quick to dismiss the contact as, 'Just a quick hug, I haven't had one all day.'\nThe toxic housemates only rejoined the house for a fresh air break before heading back to bed in the detox clinic.\nInside the clinic, Gillian scolded the star, saying: 'If you have a boyfriend, you can’t really expect to be carrying on with someone else and feel good about it. You need some self-discipline.'\nLook away now: Housemate Gemma Collins tried to ignore their contact because she knew Gillian would be watching... and judging\nNaughty: Stephanie had only just admitted that she wanted to be single and dump boyfriend Sam Reece\nStephanie admitted that she felt trapped in the situation and didn’t know what to do, adding: 'I don’t want to hurt anyone. I’ve just wanted to be loved.'\nExplaining that she needed to be 'single' an emotional Stephanie reflected on the state of her relationships after being branded a 'floozy' by Gillian.\nNaming and shaming her in front of the group, Gillian said: 'Stephanie, you're emotionally toxic and septic to Jeremy. And untidy. Your floozy days are over!'\nFumble: Jeremy pulled Stephanie under the covers for a cuddle in the bedroom\nShe's always watching: The housemates have been warned that they could lose their shopping task if they don't take Gillian McKeith's January detox seriously","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420967/CBB-s-Stephanie-Davis-Jeremy-McConnell-share-passionate-smooch-detox-room.html"}
