{"authors":["Dan Cain For Mailonline"],"date_download":"2018-10-22 23:12:22","date_modify":"2018-10-22 23:12:22","date_publish":"2016-01-29 10:56:15","description":"Scotty T was the latest Celebrity Big Brother housemate to hear from a familiar voice when his close pal Vicky Pattison dialled in to give the cheeky chappie some words of encouragement.","filename":"data/vaneerConsumption/CBBsScottyTisthrilledafterreceivingsurprisephonecallfromVickyPattison.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/10/30B12EBA00000578-0-image-a-37_1454062581191.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422475_You-smashing-man-Scotty-T-thrilled-bits-receiving-surprise-phone-call-Vicky-Pattison-CBB_1540249942.html","title":"CBB's Scotty T is thrilled after receiving surprise phone call from Vicky Pattison","title_page":"CBB's Scotty T is thrilled after receiving surprise phone call from Vicky Pattison | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They've been receiving phone calls from their nearest and dearest as part of this week's shopping task.\nAnd Scotty T was the latest Celebrity Big Brother housemate to hear from a familiar voice when his close pal Vicky Pattison dialled in to give the cheeky chappie some words of encouragement.\nThe lothario, 27, couldn't hide his excitement when the Queen of the Jungle, 28, revealed who it was on the other end of the line in scenes which aired during Friday night's episode.\nScroll down for video\nCall me: Scotty T was the latest Celebrity Big Brother housemate to hear from a familiar voice when his close pal Vicky Pattison dialled in to give the cheeky chappie some words of encouragement\nGood judge: Having made her name on reality shows, Vicky, 28, presumably knows her stuff when it comes to judging contestants, and she was full of praise for Scotty\nA visibly excited Scotty, real name Scott Timlin, jumped up and down as he enthused: 'Oi oi! How you doing? You alright?'\nHaving made her name on reality shows, Vicky presumably knows her stuff when it comes to judging contestants, and she was full of praise for Scotty.\nShe gushed: 'Honestly, Scott, I can't tell you, you're smashing it, man. I'm so proud of ya!'\nAnd Scotty was clearly pleased with what he was hearing, replying: 'I'm so happy to hear that from you, Vicky. I'm buzzin'. I'm so glad ya called!'\nSee CBB updates as Scotty T call from Geordie Shore co-star Vicky Pattison\nNice to hear from you: The lothario couldn't hide his excitement when the Queen of the Jungle revealed who it was on the other end of the line\nThrilled! Vicky told her pal how proud she was of him, much to his delight\nThe brunette beauty was her usual straight talking self, and after asking if he missed ex-housemate Megan McKenna, which he admitted to doing 'a little bit', she moved on to Tiffany Pollard.\n'What you been doing with Tiffany? You've been dipping her?' she playfully asked.\nAnd Scotty responded defensively: 'I'm not dipping her'\nWhen asked how he was finding it, he said: 'I'm alright. it's been mad. It's getting to late days now though, isn't it? So it's getting harder. It's good craic, like.'\nTop of the toon: The pair starred together in hit MTV reality show Geordie Shore\nThe Geordie Shore star was keen to find out how he was being perceived, but Vicky told him she was limited with what she could discuss.\n'I can't really talk about what's going on on the outside, Scott, but I can tell you this: from the bottom of me heart babe right, I'm proud of ya.'\nAnd clearly touched, he replied: 'Thank you, Vicky. Thank you, mate. That means a lot.'\nShe continued: 'You're doing yourself proud. You're being yourself. Keep doing what ya doing. You're fun. Ya honestly crackers. I was watching ya the other night with (Alex) Cannon and we were just howling at ya. The things you're coming out with, babe.'\nPublic perception: The Geordie Shore star was keen to find out how he was being perceived, but Vicky told him she was limited with what she could discuss\nAfter the conversation, Scotty hugged Tiffany, followed by Jeremy McConnell, and was thrilled to have received the call.\nA previous call received by Darren Day melted viewers' hearts as he broke down in tears while on the phone to his wife Stephanie Dooley.\nThe 47-year-old star showed off his softer side as he told her how much he misses her and their children.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422475/You-smashing-man-Scotty-T-thrilled-bits-receiving-surprise-phone-call-Vicky-Pattison-CBB.html"}
