{"authors":["Kayleigh Giles For Mailonline"],"date_download":"2018-10-23 02:32:51","date_modify":"2018-10-23 02:32:51","date_publish":"2016-01-29 17:07:03","description":"Megan showered Scotty with adoration despite his naughty antics with his wild housemate.","filename":"data/vaneerConsumption/CBBSScottyTspeakstoMeganMcKennaforthefirsttimesinceTiffanyPollardkiss.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B449F200000578-0-image-a-115_1454086432193.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423022_In-big-bother-Scotty-T-speaks-Megan-McKenna-time-steamy-Tiffany-Pollard-kiss-CBB-task_1540261971.html","title":"CBB'S Scotty T speaks to Megan McKenna for the first time since Tiffany Pollard kiss","title_page":"CBB'S Scotty T speaks to Megan McKenna for the first time since Tiffany Pollard kiss | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They were enjoying a passionate romance before she was evicted from the Celebrity Big Brother house last Friday.\nBut it looks like things are still golden between Scotty T and Megan McKenna as the star showered him with adoration during a surprise phone call to the house on Friday - despite the Geordie Shore star sharing a steamy smooch with housemate Tiffany Pollard briefly after her exit.\nClearly chuffed at hearing her voice for the first time in a week, the 27-year-old enthused: 'Ah, you alright kid?'\nScroll down for video\nStill friends! It looks like things are still golden between Scotty T and Megan McKenna as the star showered him with adoration during a surprise phone call to the house on Friday\n'How are you? I miss you, man!' Megan responded, before Scotty reciprocated: 'I miss you too.'\nShowing nothing but love for the Newcastle native, in spite of his naughty antics, Megan gushed: 'Listen, you're doing amazing. I'll save you a shot for when you win mate, alright? I'll see you on the final.'\nSeemingly elated, Scotty couldn't contain his smile as he replied: 'OK darling, see you soon. Love you.'\nSee CBB updates as Scotty T speaks to Megan McKenna for the first time since steamy kiss\nBit smitten? Clearly chuffed at hearing her voice for the first time in a week, the 27-year-old enthused: 'Ah, you alright kid?'\nOpening up: Megan told the Geordie Shore star that she has been missing him since departing the house\nBut while Megan chose to keep tight-lipped about Scotty's raunchy display during their brief chat, she didn't hesitate to be vocal when appearing on Rylan Clark's Big Brother's Bit on the Side earlier this week, where she spoke openly about the tryst.\n'She's just horny,' she said, while looking lovely in an orange off-the-shoulder number. 'She comes across as desperate.'\nThough it seemed the star wasn't surprised by Scotty's behaviour, as she continued: 'I knew he would be like this. We've got a good summer planned.'\nFond of him: Showing nothing but love for the Newcastle native, in spite of his naughty antics, Megan gushed: 'Listen, you're doing amazing. I'll save you a shot for when you win mate, alright? I'll see you on the final.'\nBeaming: Scotty couldn't wipe the smile from his face after their chat\nWhile saying that people have encouraged her to meet up with Scotty as soon as he is out of the house, she said: 'As soon as I leave, this happens.'\nThe popular lothario and housemate Jeremy McConnell both got a little hot under the collar during Monday night's episode as they treated Tiffany to a kiss and a strip tease.\nA half-naked Scotty played up to Tiff's long-standing affections and locks lips with her, before joining Jeremy in the pool, where they frolic and strip naked for the reality star's entertainment.\nCosying up: The reality stars grew increasingly close during their time in the house\nBut Megan isn't the first beautiful caller to have put a smile on his face, as he also received a call from Queen of the Jungle Vicky Pattinson.\nHaving made her name on reality shows, the Loose Woman presumably knows her stuff when it comes to judging contestants, and she was full of praise for Scotty.\nShe gushed: 'Honestly, Scott, I can't tell you, you're smashing it, man. I'm so proud of ya!'\nAnd Scotty was clearly pleased with what he was hearing, replying: 'I'm so happy to hear that from you, Vicky. I'm buzzin'. I'm so glad ya called!'\nThe brunette beauty was her usual straight talking self, and after asking if he missed ex-housemate Megan McKenna, which he admitted to doing 'a little bit', she moved on to Tiffany Pollard.\nCheeky! The chat comes a short while after Scotty shared a steamy kiss with housemate Tiffany Pollard following Megan's eviction\nCall me: Scotty T also heard a familiar voice when his close pal Vicky Pattison dialled in to give the cheeky chappie some words of encouragement\nGood judge: Having made her name on reality shows, Vicky, 28, presumably knows her stuff when it comes to judging contestants, and she was full of praise for Scotty\n'What you been doing with Tiffany? You've been dipping her?' she playfully asked.\nAnd Scotty responded defensively: 'I'm not dipping her'\nWhen asked how he was finding it, he said: 'I'm alright. it's been mad. It's getting to late days now though, isn't it? So it's getting harder. It's good craic, like.'\nThe sprightly star was keen to find out how he was being perceived, but Vicky told him she was limited with what she could discuss.\n'I can't really talk about what's going on on the outside, Scott, but I can tell you this: from the bottom of me heart babe right, I'm proud of ya.'\nAnd clearly touched, he replied: 'Thank you, Vicky. Thank you, mate. That means a lot.'\nShe continued: 'You're doing yourself proud. You're being yourself. Keep doing what ya doing. You're fun. Ya honestly crackers. I was watching ya the other night with (Alex) Cannon and we were just howling at ya. The things you're coming out with, babe.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423022/In-big-bother-Scotty-T-speaks-Megan-McKenna-time-steamy-Tiffany-Pollard-kiss-CBB-task.html"}
