{"authors":["Lianna Brinded"],"date_download":"2018-10-31 00:35:47","date_modify":"2018-10-31 00:35:47","date_publish":"2016-12-01 00:00:00","description":"The UK government is focusing on immigration control during Brexit negotiations.","filename":"data/vaneerConsumption/CBIBritainscoreBrexitstrategyrisksputtingtheeconomyindanger.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_cbi-warning-over-uk-economy-impact-from-hard-brexit-immigration-control-2016-12_1540946147.html","title":"CBI: Britain's core Brexit strategy risks putting the economy in danger","title_page":"    CBI warning over UK economy impact from 'hard Brexit' immigration control - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Carolyn Fairbairn, director-general of the The Confederation of British Industry (CBI). Reuters LONDON — Britain's core Brexit strategy, which involves opting out of the free movement of EU citizens into the country, risks harming the economy, said the head of an influential business lobby group.\nCarolyn Fairbairn, director general of the CBI which speaks on behalf of 190,000 businesses in Britain, told The Guardian that the government risks hurting businesses if it implements a new immigration system that is too bureaucratic.\n\"Whatever new system comes in, and businesses recognise there will be one, make it easy: make it administratively straightforward, and flexible and speedy, because actually if it takes six months to bring somebody in, and your project starts next week, then in terms of productivity it will take us backwards,\" she said.\n\"We think [the new immigration system] needs to be evidence-based; it needs to understand different kinds of migration - students, skilled labour, less skilled labour, different job categories. But whatever system comes in - ease of use. Particularly in this fast, flexible, competitive world that we're in. If it's just going to be leaden, and heavy, and bureaucratic, we will lose out.\"\nBritain voted to leave the EU on June 23. The British government is putting immigration control at the forefront of Brexit talks and also pushing for single market access. In other words, it wants the benefits of the free trading area but it wants to opt out of the clause that enables all EU citizens to roam across borders.\nThere is concern that if Britain does opt out of the freedom of movement, one of the core pillars of membership to the EU, the UK will adopt a more stringent points-based system for EU migrants.\nThe points system would mean that people who apply to come to the UK will have to adhere to a grading system to be granted a visa to live and work here. Points would be calculated on your ability to speak English, your skills, your earning power and various other elements, such as your age.\nThis could adversely affect some industries, such as construction, where workers are not necessarily highly educated or earn high wages.\nIn November, the massive design and consultancy firm Arcadis warned that Britain stands to lose out on 215,000 workers in the house building and infrastructure industries if it pushes for tight immigration controls over EU citizens in Brexit negotiations.","url":"https://www.businessinsider.com/cbi-warning-over-uk-economy-impact-from-hard-brexit-immigration-control-2016-12"}
