{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 21:22:15","date_modify":"2018-10-30 21:22:15","date_publish":"2016-12-21 00:00:00","description":"The Confederation of British Industry (CBI) has come up with 6 priorities for the government after thousands of hours of conversation with its 190,000 members.","filename":"data/vaneerConsumption/CBIonBrexitprioritiesforBritishindustryFarmingretailtechmanufacturing.json","image_url":"https://amp.businessinsider.com/images/585a51d0dd0895647f8b4712-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_cbi-brexit-priorities-british-industry-farming-aviation-retail-tech-manufacturing-tourism-2016-12_1540934535.html","title":"CBI on Brexit priorities for British industry: Farming, retail, tech, manufacturing","title_page":"    CBI on Brexit priorities for British industry: Farming, retail, tech, manufacturing - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"CBI head Carolyn Fairbairn. REUTERS/Paul Hackett/File Photo LONDON — Business lobbying group the Confederation of British Industry (CBI) on Wednesday released a report titled \"Making a Success of Brexit,\" calling for the government to take a holistic approach to Britain's economy outside of the European Union.\nThe CBI represents 190,000 UK businesses with a combined staff of 7 million. It claims Wednesday's report is a result of thousands of hours of conversations with businesses across the UK and constitutes the biggest consultation of its members since June's vote to leave the European Union.\nCarolyn Fairbairn, CBI Director-General, says in an emailed statement: \"Leaving the EU will be a highly complex process, and all sectors of the economy are making their priorities clear in order to get it right. The Government will need to take a 'whole economy' approach to avoid leaving sectors behind.\n\"While each sector has issues specific to them, there are many crossovers and common principles that unite them, for example the need to avoid cliff edge changes that cause disruption to supply chains and trade.\"\nAs part of the report, the CBI sets out what each of the industries it consulted is most concerned about when it comes to Brexit and identifies six principles that it argues should inform the government's post-Brexit trade negotiations.\nHere is what the CBI concluded from its consultations:","url":"https://www.businessinsider.com/cbi-brexit-priorities-british-industry-farming-aviation-retail-tech-manufacturing-tourism-2016-12"}
