{"authors":["Chriss W. Street"],"date_download":"2018-10-30 18:14:23","date_modify":"2018-10-30 18:14:23","date_publish":"2016-04-07 02:48:20","description":"Interest rates on President Barack Obama's federal debts will double over the next decade, forcing American taxpayers to spend $776 billion on extra interest payments by 2026, according to a new report by the Congressional Budget Office. | Politics","filename":"data/vaneerConsumption/CBOObamas10YearBudgetPlanHides776BillioninExtraDebtPayments.json","image_url":"https://media.breitbart.com/media/2014/11/obama-thumbs-up-ap-640-480.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_04_06__1540923263.html","title":"CBO: Obama's 10-Year Budget Plan Hides $776 Billion in Extra Debt Payments","title_page":"CBO: Obama's 10-Year Budget Plan Hides $776 Billion in Extra Debt Payments | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Interest rates on President Barack Obama’s federal debts will double over the next decade, forcing American taxpayers to spend $776 billion on extra interest payments by 2026, according to a new report by the non-partisan Congressional Budget Office.\nThat $776 billion adds up to roughly $2,500 per American. Call it the Obama surcharge.\nThe CBO’s report whacks many incredible projections by the White House, such as its claim that if Congress would “Enact Immigration Reform,” that government would get “[tax] revenues by $386 billion over the coming decade.” CBO agrees that amnesty would expend GDP, but concluded that most of that supposed “growth” would consist of added welfare participation costing “$285 billion over the same period.”\nBut the biggest concern by the CBO is that Obama’s plan grossly understates likely interest payments.\nThe President’s budget predicts there will be a decrease of “$343 billion in net interest costs” over the next decade. Obama predicts this decrease even though the federal debt — which is now at record high of $20.9 trillion — will rise by another projected $9.3 trillion over the next decade,\nObama creates this magical savings by predicting that today’s historically low interest rates on the 10-year Treasury notes will average 1.8 percent over the next decade.\nBut the latest Congressional Budget Office baseline projections suggest that with rising federal indebtedness, the 10-year Treasury note interest rate will climb to 4.1 percent.\nThat rise, according to the CBO, will push interest payments as a percentage of the federal budget from 6.03 percent in 2016 up to 13 percent by 2026.\nThe CBO warns that doubled interest-payments must reduce spending on the two other federal budget categories.\nMandatory spending is currently 64.63 percent of the budget. It includes items outside the annual Congressional appropriations process that includes the “earned-benefit programs” of Social Security and Medicare, “safety net programs” like SNAP (formerly food stamps); and federal spending on transportation and a few other items. Non-mandatory spending is discretionary spending, which is currently 29.34 percent of the budget. It includes federal spending authorized by the appropriations process each year, such as defense.\nAs part of his magical budget forecast, President Obama also projects that a future Congress could raise taxes or cut spending. That would mean less debt and thus lower interest payments. But the latest CBO scoring of President Obama’s budget suggests that even if Congress accepts each of his tax and spending proposals, interest in 2026 still would account for 12 percent of federal spending.\nObama projects Congress will pass tax increases of $543 billion by limiting certain individual income tax deductions for higher-income taxpayers; $386 billion by enacting immigration reform; $298 billion by imposing a minimum tax on certain foreign income; $273 billion by imposing a tax on oil; and $245 billion by increasing taxes on capital gains and dividends.\nAll that tax raising will come to pass, according to Obama, even though the United States already has the second-highest taxes in the developing world, just behind non-diverse Denmark.\nWashington D.C. is notorious for under-projecting spending and over-projecting tax revenue. But with the CBO warning of an impending crisis over the amount of the budget used to pay interest, members of Congress are going to face much increased, post-Obama, pressure to slash spending and raise taxes.","url":"https://www.breitbart.com/politics/2016/04/06/cbo-interest-budget-doubles-13-next-decade/"}
