{"authors":["Justin Caruso"],"date_download":"2018-10-30 17:57:57","date_modify":"2018-10-30 17:57:57","date_publish":"2018-09-06 22:48:00","description":"CBS is reportedly offering CEO Les Moonves around $100 million to leave the company following allegations of sexual harassment against him.","filename":"data/vaneerConsumption/CBSOffersCEOLesMoonves100MillionExitPackage.json","image_url":"https://media.breitbart.com/media/2018/07/LesMoonves1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2018_09_06__1540922277.html","title":"CBS Offers CEO Les Moonves $100 Million 'Exit Package'","title_page":"#MeToo: CBS Offers CEO Les Moonves $100 Million 'Exit Package'","title_rss":"NULL","source_domain":"breitbart.com","text":"According to reports, CBS is offering CEO Les Moonves around $100 million to leave the company following several allegations of sexual harassment against him.\nCNBC reports that although Les Moonves is owed around $180 million under his current deal, there are now talks underway to give Moonves an “exit package” that would be around $100 million, mostly in CBS stock.\nHowever, the deal for Moonves to leave includes a caveat–if more claims of harassment or inappropriate behavior emerge, CBS wants to be able to take some stock back.\nMoonves was accused of sexual harassment and inappropriate behavior by several women in a New Yorker article by Ronan Farrow published in July.\n“Four described forcible touching or kissing during business meetings, in what they said appeared to be a practiced routine,” Farrow wrote. “Two told me that Moonves physically intimidated them or threatened to derail their careers. All said that he became cold or hostile after they rejected his advances, and that they believed their careers suffered as a result.”\nIn response, Moonves admitted to making women uncomfortable, but denied ever violating anyone’s consent or trying to hurt their career.\n“I recognize that there were times decades ago when I may have made some women uncomfortable by making advances. Those were mistakes, and I regret them immensely,” Moonves said in a statement.\n“But I always understood and respected—and abided by the principle—that ‘no’ means ‘no,’ and I have never misused my position to harm or hinder anyone’s career. This is a time when we all are appropriately focused on how we help improve our society, and we at CBS are committed to being part of the solution.”\nCBS opened an investigation into Moonves’ behavior following news that an article about him was in the works, however, unlike many of the men accused of misconduct in the #MeToo era, he did not immediately leave his position.","url":"https://www.breitbart.com/entertainment/2018/09/06/metoo-cbs-offers-ceo-les-moonves-100-million-exit-package/"}
