{"authors":["Breitbart News"],"date_download":"2018-10-30 19:47:06","date_modify":"2018-10-30 19:47:06","date_publish":"2015-05-31 18:46:32","description":"Bob Schieffer won't see you next Sunday when CBS' \"Face the Nation\" airs with a new lineup of politicians and pundits. |","filename":"data/vaneerConsumption/CBSsBobSchiefferSignsOffwithFinalFacetheNationBroadcast.json","image_url":"https://media.breitbart.com/media/2015/05/455678200-schieffer.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_05_31__1540928826.html","title":"CBS's Bob Schieffer Signs Off with Final 'Face the Nation' Broadcast","title_page":"CBS's Bob Schieffer Signs Off with Final 'Face the Nation' Broadcast | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON (AP) — Bob Schieffer won’t see you next Sunday when CBS’ “Face the Nation” airs with a new lineup of politicians and pundits.\nHe moderated his final broadcast Sunday after 24 years, ending a journalism career that started at age 20 at a radio station in Fort Worth, Texas.\nDuring the show, the 78-year-old Schieffer said he tried to “remember that the news is not about the newscaster, it’s about the people who make it and those who are affected by it. I’ll be honest, I’m going to miss being in the middle of things.”\nHe said he would never forget the trust that he said viewers placed in him and “how nice you were to have me as a guest in your home over so many years.”\nIt’s been the news that mattered for Schieffer, and Sunday’s show reflected that – timely interviews with CIA Director John Brennan and former Florida Gov. Jeb Bush. In recent years, “Face the Nation” has been highly competitive in the ratings with its network rivals.\nFrom the time he was in the 9th grade and saw his byline in the school paper, Schieffer wanted to be a reporter.\n“When I was a young reporter, I wanted to work for CBS because Walter Cronkite was my hero, and I got a chance to do that,” he said. “And after I was here a while, I wanted to be the moderator of `Face the Nation’ and I got to do that, and did it for 24 years. Maybe it’s because I just love the news, but at the time I thought every job I ever had was the best job in the world.”\nAnd that’s the way it was on Schieffer’s farewell.","url":"https://www.breitbart.com/the-media/2015/05/31/cbss-bob-schieffer-signs-off-with-final-face-the-nation-broadcast/"}
