{"authors":["Jonathan Garber","Nathan Mcalone"],"date_download":"2018-10-30 22:53:02","date_modify":"2018-10-30 22:53:02","date_publish":"2018-07-27 00:00:00","description":"A piece for the Hollywood Reporter says The New Yorker will publish a story detailing unwanted sexual advances made by Moonves over 20 years ago.","filename":"data/vaneerConsumption/CBSstockpricesinkingonLesMoonvesreportaboutsexualmisconduct.json","image_url":"https://amp.businessinsider.com/images/5b5b45eb1982d820008b46aa-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_cbs-les-moonves-sexual-stock-price-2018-7_1540939982.html","title":"CBS stock price sinking on Les Moonves report about sexual misconduct","title_page":"    CBS stock price sinking on Les Moonves report about sexual misconduct - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Markets Insider\nCBS dropped Friday afternoon, down more than 6%, following a report suggesting its CEO, Leslie Moonves, will be accused of sexual misconduct in a forthcoming New Yorker story by Ronan Farrow.\nA story in The Hollywood Reporter said the New Yorker's story details unwanted sexual advances made by Moonves over 20 years ago.\nFollowing the publication of The Hollywood Reporter report, CBS' independent directors made a statement saying that \"all allegations of personal misconduct are to be taken seriously.\" The statement did not mention Moonves.\nIt reads:\n\"All allegations of personal misconduct are to be taken seriously. The Independent Directors of CBS have committed to investigating claims that violate the Company's clear policies in that regard. Upon the conclusion of that investigation, which involves recently reported allegations that go back several decades, the Board will promptly review the findings and take appropriate action.\"\n\"The timing of this report comes in the midst of the Company's very public legal dispute. While that litigation process continues, the CBS management team has the full support of the independent board members. Along with that team, we will continue to focus on creating value for our shareowners.\"\nMeanwhile, Farrow tweeted, saying: Twitter\nMoonves has held numerous executive positions at CBS since joining the company in 1995. He was named CEO of CBS Television in 1998 and chairman in 2003. He's won praise from the industry and investors for helping CBS navigate changes in the TV industry, helping the company deliver over 5 million subscribers to CBS' streaming services, CBS All Access, and Showtime OTT, well ahead of expectations.\nMoonves and Shari Redstone, the daughter of Sumner Redstone, have been locked in a legal battle for months over Redstone's desire for CBS to merge with Viacom. Redstone controls both Viacom and CBS through her company National Amusements. The CBS board filed a suit to take away Redstone's voting control, but Redstone fired back with her own suit.\nBloomberg previously reported that Moonves could make up to $280 million if Redstone fires him over the potential merger between the two TV companies.\nCBS shares are down nearly 9% this year, including Friday's losses.","url":"https://www.businessinsider.com/cbs-les-moonves-sexual-stock-price-2018-7"}
