{"authors":["Stephanie Linning For Mailonline"],"date_download":"2018-10-22 20:28:02","date_modify":"2018-10-22 20:28:02","date_publish":"2016-01-29 01:47:36","description":"Security cameras captured the shocking moment a woman set her husband's hair on fire after he annoyed her while on a night out in a US bar in the early hours of September 9.","filename":"data/vaneerConsumption/CCTVfootageshowswomansettingherhusbandshaironfireinUSbar.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/30AE62DA00000578-0-image-a-20_1454031862356.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422023_That-s-one-way-flame-alive-Shocking-CCTV-footage-shows-woman-setting-husband-s-hair-fire-bar-annoyed-night-out_1540240082.html","title":"CCTV footage shows woman setting her husband's hair on fire in US bar","title_page":"CCTV footage shows woman setting her husband's hair on fire in US bar | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Most couples fear losing the spark in their relationship.\nBut this feisty young woman took a drastic step to keep the passion alive.\nSecurity cameras captured the shocking moment she set her husband's hair on fire after he annoyed her while on a night out in a US bar in the early hours of September 9.\nThe footage starts with the couple deep in conversation. The man stands over his wife, who has her head in her hands and a stony expression on her face, and speaks intently in her ear.\nMoments later, he is back in good spirits. He laughs and chats with revellers sitting on the other side of the bar as his wife sits next to him smoking.\nApparently annoyed at something her husband has done, the woman takes out her lighter, sparks it, and lifts it closer to his long hair.\nIntense conversation: A man is seen leaning over his wife, who sits at the bar with her head in her hand (right)\nDangerous game: Apparently annoyed with her husband, the woman sparks her lighter and lifts it to his hair\nUp in flames: She sits stony faced as another reveller (left) points and tells the man his long hair is on fire\nShe touches it to the ponytail and within moments it is engulfed in flames. The man continues to tell his story for a few seconds until another customer points to the blaze.\nHe frantically pats down the flames with his hands as another man reaches over to offer his help.\nAngry at his wife, the man turns to her and says something before standing up and walking away.\nThe woman, who did little to help him when he was on fire, is left sitting on her bar stool.\nFrantic: The man pats down his blazing ponytail but his wife appears reluctant to help\nBacklash: Another customer reaches over to check the flames have died as the man turns on his wife","url":"https://www.dailymail.co.uk/news/article-3422023/That-s-one-way-flame-alive-Shocking-CCTV-footage-shows-woman-setting-husband-s-hair-fire-bar-annoyed-night-out.html"}
