{"authors":["Harry Pearl For Daily Mail Australia"],"date_download":"2018-10-22 20:39:11","date_modify":"2018-10-22 20:39:11","date_publish":"2016-01-29 02:44:02","description":"CCTV footage has caught the moment when a man delivers a sickening 'coward punch' outside a bar in Canberra.","filename":"data/vaneerConsumption/CCTVfootagecatchescowardpunchoutsideCanberrabar.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/04/30AEDACA00000578-0-image-a-17_1454040143970.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422100_CCTV-footage-catches-sickening-coward-punch-outside-Canberra-bar_1540240751.html","title":"CCTV footage catches 'coward punch' outside Canberra bar","title_page":"CCTV footage catches 'coward punch' outside Canberra bar | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Police are appealing to the public to help identify a man caught on video delivering a brutal 'coward punch' that sends his victim sprawling onto the pavement outside a Canberra bar.\nCCTV footage released by police shows a verbal confrontation between a group of people and the victim, before he is hit on the side of the head in a one-punch attack and knocked to the ground.\nAfter the man hits the pavement, he can be seen sprawled out on his back.\nPolice are appealing for information to help them identify the attacker in the video\n'This is a cowardly act which will not be tolerated,' ACT police said on their Facebook page.\n'This type of senseless violence can have tragic consequences; we know that just one punch can kill.'\nPolice have urged anyone shown in the video, as well as other witnesses, to come forward and speak with investigators.\nThe attack occurred outside PJ O’Reilly’s in Greenway at about 2.45 am on December 12.\nPolice want to identify the male offender, who is seen wearing a white T-shirt and black or blue pants in the video.\nHe's described as being between 5’9” and 6’ inches tall (175cm – 183cm) with light complexion and brown hair.\nAnyone with information about the attack, or who can help identify the offender, can call contact Crime Stoppers on 1800 333 000.\nThe attack occurred outside PJ O’Reilly’s in Greenway about about 2.45 am on December 12\nThe victim was punched in the side of the head after an argument with a group of people\nThe video shows the victim taken by surprise as he talks to a man directly in front of him\nAfter he is hit, the victim is sent crashing to the ground","url":"https://www.dailymail.co.uk/news/article-3422100/CCTV-footage-catches-sickening-coward-punch-outside-Canberra-bar.html"}
