{"authors":["Mary Chastain"],"date_download":"2018-10-30 18:51:50","date_modify":"2018-10-30 18:51:50","date_publish":"2016-02-23 21:08:37","description":"The U.S. Centers for Disease Control (CDC) has announced it is investigating fourteen cases of sexually transmitted Zika in the United States.","filename":"data/vaneerConsumption/CDCReports14SuspectedCasesofSexuallyTransmittedZikainUS.json","image_url":"https://media.breitbart.com/media/2016/02/Zika-Mosquitos-WSLS-News.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_02_23__1540925510.html","title":"CDC Reports 14 Suspected Cases of Sexually-Transmitted Zika in U.S.","title_page":"CDC Reports 14 Suspected Cases of Sexually-Transmitted Zika in U.S.","title_rss":"NULL","source_domain":"breitbart.com","text":"The U.S. Centers for Disease Control (CDC) has announced it is investigating fourteen cases of sexually transmitted Zika in the United States.\n“CDC and state public health departments are now investigating 14 new reports of possible sexual transmission of Zika virus, including several involving pregnant women,” they stated in a media release.\nFrom the CDC:\nCDC and state public health departments are now investigating 14 new reports of possible sexual transmission of Zika virus, including several involving pregnant women. In two of the new suspected sexual transmission events, Zika virus infection has been confirmed in women whose only known risk factor was sexual contact with an ill male partner who had recently traveled to an area with local Zika virus transmission; testing for the male partners is still pending. For four additional suspected sexual transmission events, preliminary laboratory evidence (IgM antibody test) is available for the women, but confirmatory tests are pending. For eight other suspected events, the investigation is ongoing. In all events for which information is available, travelers were men and reported symptom onset was within 2 weeks before the non-traveling female partner’s symptoms began. Like previously reported cases of sexual transmission, these cases involve possible transmission of the virus from men to their sex partners. At this time, there is no evidence that women can transmit Zika virus to their sex partners; however, more research is needed to understand this issue.\nThe center insisted that people can best avoid Zika by preventing mosquito bites.\nThe Dallas County Health and Human Services (DCHHS) confirmed the first sexually transmitted Zika case in the beginning of February. The CDC responded with an adivorsy for people to take precautions to prevent transmission of the virus. This latest discovery forced the center to issue another Health Advisory Notice (HAN) “to underscore the importance of adhering to the interim guidance published on February 5.” These include pregnant women asking their male partners about possible Zika contact. They also asked everyone to use condoms until further notice since no one knows for sure how long Zika survives in sperm.\n“Now that we know Zika virus can be transmitted through sex, this increases our awareness campaign in educating the public about protecting themselves and others,” explained Zachary Thompson, DCHHS director. “Next to abstinence, condoms are the best prevention method against any sexually-transmitted infections.”\nSperm banks in the United Kingdom and the U.S. have changed policies to protect clients from Zika. The British Fertility Society asked people who traveled to areas with Zika, mainly South America and the Caribbean, not to donate sperm for 28 days.\nThe California Cryobank will not allow donations from anyone who traveled to those countries or has “had sex with someone who has traveled there within the past month.” Doctors must report any patient who left the U.S. or Canada. New policy also includes checking all “records on where sperm donors have traveled over the past year to see if any have visited the nearly 30 countries and territories where the virus has caused outbreaks.”\nHarvey Stern, medical director at Fairfax Cryobank, told USA Today that scientists do not “know how long the Zika virus can survive in semen, or whether the virus is present in the semen of men without symptoms.”\nBritish researchers recently reported doctors found the Zika virus in a 68-year-old man 62 days after he contracted the virus. U.S. officials recommended that any man coming from a Zika country use “condoms even with nonpregnant sex partners because the virus may persist in semen even after it clears the bloodstream.”\n“They don’t say for how long,” said Dr. William Schaffner, an infectious disease expert at Vanderbilt University Medical Center in Nashville. “That’s because they don’t know. As it was with Ebola, we’re learning as we go.”","url":"https://www.breitbart.com/national-security/2016/02/23/report-14-u-s-cases-of-sexually-transmitted-zika/"}
