{"authors":[],"date_download":"2018-10-30 14:23:15","date_modify":"2018-10-30 14:23:15","date_publish":"2014-08-08 00:00:00","description":null,"filename":"data/vaneerConsumption/CeasefireoverHamaslaunchesrocketbarrageintoIsrael.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_08_cease_fire_over_hamas_launches_rocket_barrage_into_israel_1540909395.html","title":"Cease fire over: Hamas launches rocket barrage into Israel","title_page":"Cease fire over: Hamas launches rocket barrage into Israel","title_rss":"NULL","source_domain":"americanthinker.com","text":"As a 72-hour truce in Gaza expired at 8 a.m. Friday, Palestinian militants fired barrages of rockets into Israel and the Israeli military responded with airstrikes, one of which killed a 10-year-old boy, according to relatives.\nThe renewed hostilities interrupted the indirect talks in Cairo, brokered by Egypt and backed by the United States, for a more durable cease-fire agreement. While the rocket fire signaled Hamas’s refusal to extend the temporary lull and its desire to apply pressure for its demands to be met at the talks, the Israeli government said in a statement that “Israel will not hold negotiations under fire.”\nIsrael had said it was willing to extend the truce unconditionally, but the Cairo talks, which began on Wednesday, appeared to have yielded few results.\nAfter three days of quiet, the Israeli military said, at least 33 rockets and mortars were fired into southern Israel between 8 a.m. and 1 p.m. Some were intercepted by Israel’s missile defense system, while others fell in open ground and a few landed short in the Gaza Strip. An Israeli civilian and a soldier were injured in one of the attacks, according to the military, and a building was damaged. The Israeli military also reported two launchings of rockets or mortar shells from Gaza before dawn.\nIn Gaza, Ibrahim Dawawsa, 10, was killed in a strike from an Israeli drone as he played in the yard of a mosque in the Sheik Radwan neighborhood of Gaza City, according to his brother, Zuheir, 19.\nSami Abu Zuhri, a spokesman for Hamas, wrote in an Internet posting on Friday morning that it did not accept an extension of the lull, adding, “We will continue negotiations.” Islamic Jihad, a militant Palestinian faction that has taken part in the fighting alongside Hamas and is represented at the talks in Cairo, took responsibility for firing rockets.\nLt. Col. Peter Lerner, a spokesman for the Israeli military, said in a statement: “The renewed rocket attacks by terrorists at Israel are unacceptable, intolerable and shortsighted. Hamas’s bad decision to breach the cease-fire will be pursued by the I.D.F. We will continue to strike Hamas, its infrastructure, its operatives and restore security for the State of Israel.”","url":"https://www.americanthinker.com/blog/2014/08/cease_fire_over_hamas_launches_rocket_barrage_into_israel.html"}
