{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:39:17","date_modify":"2018-10-30 20:39:17","date_publish":"2016-04-12 00:54:41","description":"A United Nations-brokered ceasefire in Yemen between Iran-allied Houthi rebels and a Saudi-led military coalition has reportedly started.","filename":"data/vaneerConsumption/CeasefireBetweenSaudiCoalitionHouthisBegins.json","image_url":"https://media.breitbart.com/media/2016/04/yemen-buildings-after-saudi-coalition-airstrikes-afp-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_04_11__1540931957.html","title":"Ceasefire Between Saudi Coalition, Houthis Begins","title_page":"Yemen: Ceasefire Between Saudi Coalition, Houthis Begins","title_rss":"NULL","source_domain":"breitbart.com","text":"A United Nations-brokered ceasefire in Yemen between Iran-allied Houthi rebels and a Saudi-led military coalition has reportedly started amid allegations of fighting among the warring sides.\n“Fighting on Monday marred the latest cease-fire in Yemen just hours after it began, dimming prospects for next week’s United Nations-backed talks aimed at ending the year-long war between Houthi rebels and a Saudi-led military coalition,” reports the Wall Street Journal (WSJ).\nHowever, Agence France-Presse (AFP) also reports, “A UN-brokered ceasefire was taking hold in Yemen on Monday, raising hopes that peace talks due next week may finally resolve the country’s devastating conflict.”\nBoth sides in Yemen’s civil war have reportedly vowed to respect the truce, which went into effect late Sunday, local time.\n“The forces of the [Saudi-led] coalition will adhere to the ceasefire,” reportedly said the alliance’s command, which backs the Yemeni government led by President Abed Rabbo Mansour Hadi. “The leadership of the coalition reaffirms its continued support for the people of Yemen and the government in order for the UN-brokered peace talks to end the crisis to succeed.”\nMeanwhile, Iran-allied Shiite rebels in the Yemeni capital Sanaa have also said they would adhere to the ceasefire, adding that the Saudi-led coalition had already breached it “by continuing to fly air sorties over Sana’a and shelling Houthi positions,” notes the Guardian.\nWSJ quotes residents of Taiz as saying the Saudi-led coalition conducted airstrikes on their city. A witness told the Journal that clashes broke out 35 miles east of Sanaa.\n“The scope of that violence and the identities of the combatants weren’t immediately known,” acknowledges the Journal.\nReuters reports that hours before the cessation of hostilities was due to come into effect, fighting between forces loyal to the Hadi government and the Houthis erupted, killing at least 20 people.\nThe U.N. estimates that more than 6,000 people, many of them civilian, have been killed in the Yemen war.\nIn March 2015, a Saudi-led coalition backed by the United States began combating the Shiite Houthis and their allies, armed groups loyal to former Yemeni President Ali Abdullah Saleh.\nPeace negotiations are expected to begin April 18 in Kuwait.\n“Several previous attempts to negotiate an end of the conflict have failed,” points out WSJ.\nIsmail Ould Cheikh Ahmed, the U.N. special envoy to Yemen, said the Saudi-led coalition and the Houthis are committed to the ceasefire.\n“Now is the time to step back from the brink,” he declared. “The progress made represents a real opportunity to rebuild a country that has suffered far too much violence for far too long.”\nThe Journal reports:\nThe cease-fire has been on tenuous footing from the start. Armed Yemeni factions allied with the Saudi coalition near Taiz said earlier this week they wouldn’t abide by the cease-fire. Yemen’s main jihadist groups, al Qaeda in the Arabian Peninsula (AQAP) and local branches of Islamic State [ISIS/ISIL], weren’t expected to honor it, either. AQAP fighters advanced Monday in the southern Abyan province, local officials said.\nThe Saudi-led war has reportedly helped the Yemen-based AQAP, considered the most dangerous al-Qaeda branch, grow stronger than ever.","url":"https://www.breitbart.com/national-security/2016/04/11/yemen-ceasefire-saudi-coalition-houthis-begins-amid-tensions/"}
