{"authors":[],"date_download":"2018-10-22 23:28:46","date_modify":"2018-10-22 23:28:46","date_publish":"2016-01-29 11:10:28","description":"A statue at Oxford University of 19th century British imperialist Cecil Rhodes will not be taken down despite protests, the college at the centre of the disp...","filename":"data/vaneerConsumption/CecilRhodesstatuetoremainatOxfordcollegedespiteracerow.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h6fj-3bmscybNe842cce83474b54ba997-700_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422101_Rhodes-statue-Oxford-not-removed-report_1540250926.html","title":"Cecil Rhodes statue to remain at Oxford college despite race row","title_page":"Cecil Rhodes statue to remain at Oxford college despite race row | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Cecil Rhodes statue to remain at Oxford college despite race row\nA statue at Oxford University of 19th century British imperialist Cecil Rhodes will not be taken down despite protests, the college at the centre of the dispute said Friday, to the fury of campaigners.\n\"Following careful consideration, the college's governing body has decided that the statue should remain in place,\" Oriel College said in a statement.\nBut it denied newspaper reports that it feared losing donations worth some £100 million (130 million euros, $140 million) if it did take the statue down.\nOriel College, which owns the statue of Cecil Rhodes, has ruled out removing it over fears that it could lose donations worth some £100 million ©Rodger Bosch (AFP/File)\nRhodes -- a white supremacist like many builders of the British empire -- gave his name to the territories of Rhodesia, now Zimbabwe and Zambia, and founded the De Beers diamond company.\nThe tycoon was also a donor to Oriel, one of Oxford's 38 colleges, and endowed the Rhodes Scholarship, which has helped non-British students like former US president Bill Clinton and ex-Australian prime minister Tony Abbott study at the prestigious university.\nInspired by the \"Rhodes Must Fall\" campaign which prompted the removal of the University of Cape Town's Rhodes statue last year, many current students objected to the presence of his statue in the heart of the historic English city.\nThe \"Rhodes Must Fall\" group on Friday called Oriel's decision \"outrageous, dishonest, and cynical.\n\"This is not over. We will be redoubling our efforts and meeting over the weekend to discuss our next actions.\"\nNtokozo Qwabe, a South African 2014 Rhodes Scholar who has campaigned to remove the statue, said on Facebook that the decision \"reminds us that black lives are cheap at Oxford\".\n\"Oriel has basically said: Who cares about black lives and the concerns of BME (black and minority ethnic) Oxford students anyways?\"\nOthers have warned against taking the statue down, saying that to do so would be to rewrite history.\n- 'Complexity of history' -\nSouth Africa's last white president, F. W. de Klerk, wrote to Britain's Times newspaper last month calling the plan \"folly\" and adding: \"If the political correctness of today were applied consistently, very few of Oxford's great figures would pass scrutiny.\"\nOriel's statement said that \"the overwhelming message we have received has been in support of the statue remaining in place\".\n\"The recent debate has underlined that the continuing presence of these historical artefacts is an important reminder of the complexity of history and of the legacies of colonialism still felt today.\"\nAnti-apartheid veteran Denis Goldberg, who was jailed alongside Nelson Mandela in 1964, said the statue's fate was trivial.\n\"Reshape your campaign to expose what Rhodes did and how the legacy continues in South Africa today. That's what you must fight,\" he told BBC radio.\nRemoving the Cape Town statue \"hasn't changed the systemic exploitation.\n\"The removal of it takes away the right to expose, to debate,\" he added. \"We cut into our right to free speech.\"\nThe Daily Telegraph newspaper reported that Oriel had already seen £1.5 million in donations cancelled due to the ambiguity over the statue and that some alumni had cut the college out of their wills.\nBut an Oriel spokesman insisted: \"The financial implications were absolutely not the overriding consideration -- not even a major factor.\"\nThe Telegraph welcomed the \"rational\" decision.\n\"The past cannot be rewritten. And it is not the responsibility of Oxford students to try,\" the broadsheet said, criticising \"attempts by a self-righteous lobby to purge the university of any blemish of historical bigotry\".","url":"https://www.dailymail.co.uk/wires/afp/article-3422101/Rhodes-statue-Oxford-not-removed-report.html"}
