{"authors":["Sebastian Shakespeare For The Daily Mail"],"date_download":"2018-10-22 20:32:31","date_modify":"2018-10-22 20:32:31","date_publish":"2016-01-28 01:45:03","description":"Although the former Enflield East MP's death notice included all three of his daughters with his wife, Lady Parkinson, the announcement failed to include the name of Flora.","filename":"data/vaneerConsumption/CecilParkinsonssnubforlovechildFloraKeaysfrombeyondthegrave.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/309B67B700000578-0-image-a-4_1453945374702.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420270_SEBASTIAN-SHAKESPEARE-Parkinson-s-snub-love-child-Flora-grave_1540240351.html","title":"Cecil Parkinson's snub for love child Flora Keays from beyond the grave","title_page":"Cecil Parkinson's snub for love child Flora Keays from beyond the grave  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Abandoned during Cecil Parkinson’s life, his love child, Flora Keays, has now been insulted by the Conservative Party grandee from beyond the grave.\nYesterday Lord Parkinson’s family formally announced his passing at the age of 84 with a death notice in a newspaper which paid tribute to his role as a father.\nAlthough it included all three of his daughters with his wife, Lady Parkinson, the announcement failed to include the name of Flora, who has just turned 32.\nScroll down for video\nFlora Keays, left with mother Sara, the love child of Cecil Parkinson, right with his wife Ann, has now been insulted by the Conservative Party grandee from beyond the grave\nShe suffers from learning disabilities and Asperger’s syndrome and had an operation to remove a brain tumour when she was four years old. Adding insult to injury, the notice even found space to mention his two step-grandsons.\nIt read: ‘Beloved husband of Ann, much loved father of Mary, Emma and Joanna, grandfather of Harry, Jessica, Oliver and India, step-grandfather to Alec and Ralph.’\nParkinson, a favourite of Margaret Thatcher, was forced to resign as Trade and Industry Secretary in 1983 after it was disclosed that Flora’s mother, Sara Keays, was expecting his child. She was his secretary and they enjoyed a 12-year affair.\nWhile Parkinson, who was mentioned by Thatcher as her potential successor as PM, had helped to pay for Flora’s education and upkeep, he never met her, nor even sent her a birthday or Christmas card. When she turned 18, Flora said sadly: ‘I would like to see him. If he loved me, he would want to see me and be in my everyday life.’\nBefore that age, any mention of Flora’s existence was prohibited by a draconian court injunction that Parkinson gained (with Sara’s initial consent) in 1993 after he was elevated to the House of Lords.\nParkinson's obituary mentioned everyone in his family, including step-grandchildren, but not Flora (pictured as a baby in January 1984, leaving the hospital with her mother)\nThe injunction even prevented Flora from talking about her own life.\n‘Do you know, the restrictions were so severe that when Flora participated in an ice show, the school couldn’t put her name in the programme,’ her mother later said. ‘It was as if she didn’t exist.’\nClearly, Parkinson’s family are determined that Flora will carry on ‘not existing’.\nJerry Hall's sparkling night out\nWith no fewer than three films scheduled for release this year, including a cameo in the forthcoming Absolutely Fabulous movie adaptation, it would be perfectly natural for Texan model-turned-actress Jerry Hall to ask for some guidance from industry veteran Sir Michael Caine, 82.\nThe duo were spotted dining in London on Tuesday evening alongside their respective partners, Hall’s fiance Rupert Murdoch, 84, and Caine’s wife Shakira, 68.\nThere was no doubt plenty to talk about, not least Hall’s impending nuptials to media mogul Murdoch. Hall, 59, who was proudly brandishing her new engagement ring, was previously married to Mick Jagger, with whom she has four adult children. Sir Michael, who has been married twice, dated Bianca Jagger in 1968 before she met (and married) the Rolling Stones singer. Not a lot of people know that.\nNewly engaged couple Rupert Murdoch and Jerry Hall leave dinner with Michael Caine and his wife Shakira Caine at C London restaurant in London\nPaxo and Pesto's preening match\nIt was a clash of the media titans — or two inflated egos, depending on your point of view.\nITV News political editor Robert Peston came face-to-face with University Challenge presenter Jeremy Paxman at the Radio Times covers party on Tuesday evening. As Peston was being interviewed on camera, Paxo admonished his former colleague with the words: ‘Oh do stop preening, you ridiculous man!’\n‘Coming from you!’ rejoined former BBC economics editor Peston, after the two enjoyed a friendly bear hug. Your starter for ten. Who is the biggest preener of them all?\nChloe Herbert, 22, grew up in the house just behind Highclere Castle, where Downton Abbey was filmed\nEarl's niece Chloe's star-struck slip-up\nShe is hailed in next month’s Tatler as one of its ‘hot new girls’. Chloe Herbert, 22, is the daughter of the Earl of Carnarvon’s younger brother Harry, and grew up in the house just behind Highclere Castle, where Downton Abbey was filmed.\nArt student Chloe even got to meet Hugh Bonneville, who played the Earl of Grantham, and was so overcome she curtsied.","url":"https://www.dailymail.co.uk/news/article-3420270/SEBASTIAN-SHAKESPEARE-Parkinson-s-snub-love-child-Flora-grave.html"}
