{"authors":["Jo Tweedy For Mailonline"],"date_download":"2018-10-23 02:20:33","date_modify":"2018-10-23 02:20:33","date_publish":"2016-01-11 14:17:48","description":"A new exhibition of images taken by legendary photographer Sir Cecil Beaton at Chatsworth House is set to offer a fascinating insight into the lives of the Devonshire family.","filename":"data/vaneerConsumption/CecilBeatonphotosrevealtheDuchessofDevonshiresglitteringsociallife.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/13/300A78D900000578-0-image-a-80_1452518608351.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3393800_Cecil-Beaton-photos-reveal-Duchess-Devonshire-s-glittering-social-life_1540261233.html","title":"Cecil Beaton photos reveal the Duchess of Devonshire's glittering social life","title_page":"Cecil Beaton photos reveal the Duchess of Devonshire's glittering social life | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A new exhibition at Chatsworth House is set to celebrate the lives of one of its most glamorous residents.\nThe series of photos, taken by celebrated photographer Sir Cecil Beaton, will offer a tantalising glimpse into the glittering social life of the late Duchess of Devonshire.\nThe Duchess, known as 'Debo' to those close to her, passed away in September 2014 at the age of 94 and this is the first major exhibition to celebrate her life.\nLifting the society lid: A new exhibition - Never a Bore: Deborah Devonshire and Her Set by Cecil Beaton (both are pictured above) - at Chatsworth House in Derbyshire will show 65 rarely-seen photographs of the Duchess as seen by famous portrait photographer Beaton\nOne of the most colourful characters in 20th century high society, the Duchess, known as 'Debo' died in 2014 at the age of 94. This photo was taken by Sir Cecil in 1949 and features in the exhibition\nThe Duchess relaxing in the grounds of her beloved Chatsworth in 1960, a year after the family moved into the Derbyshire stately pile\nAlongside 65 of Sir Cecil's images, there will also be a collection of private letters, written by the Duchess to varying members of her family.\nThe exhibition, entitled Never a Bore and running from March 19 to September, includes shots of the Duchess relaxing in the grounds of Chatsworth plus shots that reveal the glamour of a lost age.\nPortrait photographer Beaton was a close friend of the family and spend time at the estate after the family moved in in 1959.\nChatsworth, in pastoral Derbyshire, remains one of the most fascinating English estates, home to one of high society's most colourful families, of which the Duchess was at the heart of.\nActress Adele Astaire married Lord Charles Cavendish (the second son of the 9th Duke of Devonshire) in 1932 at the height of her fame. Above, Adele and Cecil Beaton in New York in 1931\nLife at Chatsworth: The Duke of Devonshire is pictured in the drawing room at Chatsworth. Sitting on the sofa next to him is close family friend Violet Hammersley, known affectionately as ‘Mrs Ham’, as artist Duncan Grant paints her portrait from an armchair opposite\nSociety's most fascinating figures appear in the collection of 65 images including Lady Diana Cooper, Viscountess Norwich, pictured at the Beistegui Ball, Venice, 1951. Right, Dame Edith Sitwell, poet, critic and renowned eccentric, would dine with the Devonshires in a full-length fur coat\nSociety girl Daisy Fellowes, right, took a more exotic approach to the Beistegui Ball in Venice, dressing as the Queen of Africa as depicted by Tiepolo in his frescoes at Wurzburg. She's pictured alongside Jefferson Caffery, an American diplomat\nCow pat: When the Duchess sat for artist Lucian Freud, pictured above centre, she wrote him a note afterwards saying that her hair had looked like a 'cow pat' on her head\nThe stately pile is already a living museum to the Duchess - largely regarded as one of the most interesting characters in 20th century aristocracy - and sees thousands of tourists head to the estate every year to delve deeper into the lives of the Devonshires.\nA snap of Fred Astaire on the sofa in 1931 shows how the family mingled with Hollywood royalty; Astaire's sister Adele married Lord Charles Cavendish, the second son of the ninth Duke.\nOther photos due to appear in the collection include an image of painter Lucian Freud and a comical note referring to how the Duchess' hair looked like a 'cow-pat' in the painting Freud did of her.\nThe exhibitions curator at Chatsworth, Hannah Oboe, said the images would largely take their inspiration from one of Beaton's most famous remarks: 'Perhaps the world's second-worst crime is boredom; the first is being a bore.'","url":"https://www.dailymail.co.uk/femail/article-3393800/Cecil-Beaton-photos-reveal-Duchess-Devonshire-s-glittering-social-life.html"}
