{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-23 01:05:51","date_modify":"2018-10-23 01:05:51","date_publish":"2017-03-10 08:41:37","description":"The ex-Hollyoaks star, 29, has sparked speculation she could have found someone by the end of Celebs Go Dating, stepping out in Chelsea with a mystery man.","filename":"data/vaneerConsumption/CelebsGoDatingsJorgiePorterwithmysteryman.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/08/3E2197A900000578-0-image-a-11_1489134863575.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300386_Celebs-Dating-s-Jorgie-Porter-mystery-man_1540256751.html","title":"Celebs Go Dating's Jorgie Porter with mystery man","title_page":"Celebs Go Dating's Jorgie Porter with mystery man | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Viewers thought she had found love with rugby hunk James, only for her to call off their romance after a few dates.\nAnd Jorgie Porter has sparked speculation she could have found someone outside of Celebs Go Dating, stepping out in Chelsea, west London with a mystery man on Thursday.\nThe ex-Hollyoaks star, 29, was spotted leaving what appeared to be a date, rocking a casual ensemble for her night out.\nScroll down for video\nDate night? Jorgie Porter has sparked speculation she could have found someone outside of Celebs Go Dating, stepping out in Chelsea, west London with a mystery man on Thursday\nJorgie and her date clambered into a taxi together, speeding off into the night.\nThe blonde beauty was dressed down in black skinny jeans, a denim shirt and a faux fur lined jacket.\nShe completed her look with a beige handbag and coordinating trainers, wearing her hair down loose.\nLaid back: The ex-Hollyoaks star, 29, was spotted leaving what appeared to be a date, rocking a casual ensemble for her night out\nCasual: The blonde beauty was dressed down in black skinny jeans, a denim shirt and a faux fur lined jacket\nJorgie's journey to finding love on the E4 dating show had been smoother than most - until she unexpectedly decided things weren't going to work out with her date James.\nThe pair had instant chemistry and were falling fast - until her feelings began to cool during a visit to his hometown of Bournemouth, where his over-eager friends put her off.\nJames acting awkwardly when invited him to be her plus one at a celeb event was the last straw for Jorgie, who called time on their short-lived romance.\nHeading off: Jorgie and her pal clambered into a taxi together, speeding off into the night\nSingle lady: Jorgie's journey to finding love on the E4 dating show had been smoother than most - until she unexpectedly decided things weren't going to work out with her date James\nThings haven't been going too well for her since, with the petite blonde going on a cringe-inducing date with boxer Kelvin, who forgot her name.\nMeanwhile, Celebs Go Dating receptionist Tom has teased he is hopeful some of the stars on the dating agency's books will find love.\n'I'm wildly optimistic about Ferne McCann and I'm also feeling very hopeful about Perri Kiely,' the lovable lad told Star magazine.\nHe was less than impressed with axed star Stephen Bear, however, who he called a 'misfit'.\nTom said: 'Sometimes I enjoyed his mischievousness, but at other times it was a bit exhausting.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300386/Celebs-Dating-s-Jorgie-Porter-mystery-man.html"}
