{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 20:19:43","date_modify":"2018-10-30 20:19:43","date_publish":"2016-01-18 16:48:36","description":"Hollywood weighed in on social media during Sunday night's Democrat presidential debate, with many progressive-minded celebrities loudly cheering for the insurgent Sen. Bernie Sanders as he squared off against Hillary Clinton and Martin O'Malley in South Carolina.","filename":"data/vaneerConsumption/CelebsCheerSandersOverHillaryDuringDemocratDebate.json","image_url":"https://media.breitbart.com/media/2016/01/Sarah-Silverman-Bernie-Sanders-2-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_01_18__1540930783.html","title":"Celebs Cheer Sanders Over Hillary During Democrat Debate","title_page":"Celebs Cheer Sanders Over Hillary During Democrat Debate","title_rss":"NULL","source_domain":"breitbart.com","text":"Hollywood weighed in on social media during Sunday night’s Democrat presidential debate, with many progressive-minded celebrities loudly cheering for the insurgent Sen. Bernie Sanders as he squared off against Hillary Clinton and Martin O’Malley in South Carolina.\nWhile some superstars like Katy Perry took to Twitter to reaffirm their support for Clinton, others praised the fiery Sanders, who sparred with Clinton on issues including healthcare, gun control, and the economy.\nMichael Moore praised Sanders early and often, but said later on that any of the Democrats would be better than a GOP president:\nYoung people know BS instantly. They have the best truth sniffer. Bernie just lays it all out, and that is refreshing to youth. — Michael Moore (@MMFlint) January 18, 2016\nHillary preying on people's fears about losing a health care fight to the Republicans instead of sounding like a leader willing to do battle — Michael Moore (@MMFlint) January 18, 2016\nOne thing's for sure, you'll never hear the issues that got discussed tonight being debated amongst the Republican candidates. #fear #invade — Michael Moore (@MMFlint) January 18, 2016\nMark Ruffalo, Sarah Silverman, and some others felt the Bern:\n.@BernieSanders is preferred 2-1 by young people because they know his means what he says. — Mark Ruffalo (@MarkRuffalo) January 18, 2016\nI love you Bernie! \"Trump thinks that Climate Change is a hoax invented by the Chinese\" — Minnie Driver (@driverminnie) January 18, 2016\nBlack people check Sanders out — Killer Mike (@KillerMike) January 18, 2016\nBill Maher was bored, as was Arsenio Hall, who said the debate could benefit from the presence of a certain GOP candidate:\nWatching the Dems right now, its just not as much fun watching sane people debate. But it sure makes you think one of them better win. — Bill Maher (@billmaher) January 18, 2016\nPeople don't seem interested in the democratic debate. Hillary better ride in on a hover board, that at some point … burst into flames! — Arsenio Hall (@ArsenioHall) January 18, 2016\nOthers had jokez:\nSanders always looks like he is waiting for the bus, sees a bus, but it's not his bus. #DemDebate — Dane Cook (@DaneCook) January 18, 2016\nToss-up which I've seen more of: Lena Dunham's boobs or Bernie Sanders' bottom teeth. — Michael Ian Black (@michaelianblack) January 18, 2016\nOh man I wish O'Malley had accidentally winked when he mentioned the government getting in your \"back door.\" #DemDebate — Patton Oswalt (@pattonoswalt) January 18, 2016\nPerry enthusiastically tweeted her support for Clinton, while Rosie O’Donnell, Kat Dennings, Debra Messing, and director Ron Howard all re-tweeted pro-Hillary tweets.\nMeanwhile, James Woods was having none of it.","url":"https://www.breitbart.com/entertainment/2016/01/18/celebs-cheer-sanders-during-democrat-debate/"}
