{"authors":["Lucy Crossley For Mailonline"],"date_download":"2018-10-23 00:45:27","date_modify":"2018-10-23 00:45:27","date_publish":"2016-01-29 14:08:17","description":"The model, 37, from north London, was facing trial for assault after the argument with Teen Mom's Farrah Abraham, 24, at the Big Brother studios in Elstree, Hertfordshire, in September.","filename":"data/vaneerConsumption/CelebrityBigBrothersAisleyneHorganWallacechargesdropped.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/30B2F5A000000578-0-image-a-2_1454078688436.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422838_Charges-against-Celebrity-Big-Brother-star-Aisleyne-Horgan-Wallace-champagne-throwing-incident-DROPPED-five-month-probe_1540255527.html","title":"Celebrity Big Brother's Aisleyne Horgan-Wallace charges dropped","title_page":"Celebrity Big Brother's Aisleyne Horgan-Wallace charges dropped | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Prosecutors have dropped assault charges against former Big Brother contestant Aisleyne Horgan-Wallace after five month probe into champagne being thrown during a row on live TV.\nThe model, 37, had been facing trial for assault after the argument with Teen Mom's Farrah Abraham, 24, on Channel 5's Celebrity Big Brother's spin-off Bit On The Side in September.\nIt had been reported that the trial would have cost the taxpayer £15,000, but now the case has been ditched after a u-turn by the Crown Prosecution Service.\nProsecutors have dropped assault charges against ex-Big Brother contestant Aisleyne Horgan-Wallace (left) after five month probe into champagne being thrown during a row with Teen Mom's Farrah Abraham (right)\n'The CPS finally saw the evidence from the show and agreed Aisleyne had no case to answer,' a source toldThe Mirror.\n'Aisleyne stuck to her guns and was prepared to have her day in court. Thankfully the CPS decided she did no wrong, unlike two of her co-panellists.'\nMiss Horgan Wallace welcomed the news that the case against her had been dropped in a tweet directed at Miss Abraham.\n'My full story will soon be told.... Be worried darling @F1abraham I only speak the truth.....,' she wrote.\nShe also thanked her friend, model Nicola McLean, writing: 'Massive thank u to my rock through all this drama the past 5 months I have a love for u that will never be broken @NicolaMcLean.'\nMiss Horgan Wallace welcomed the news that the case against her had been dropped in a tweet directed at Miss Abraham\nShe also thanked her friend, model Nicola McLean, writing: 'Massive thank u to my rock through all this drama the past 5 months I have a love for u that will never be broken @NicolaMcLean'\nA CPS spokesman told MailOnline: 'The CPS regularly review cases according to the Code for Crown Prosecutors.\n'Upon a review of this case it was decided that, whilst there was sufficient evidence, it would not be in the public interest to proceed therefore the case was discontinued.'\nPolice were called to the set in Elstree, Hertfordshire, in September after the row broke out between the celebrities during a discussion about nominations, causing the show to come off air 12 minutes early.\nViewers heared Miss Horgan-Wallace call Miss Abraham a 'nasty horrible b****' who should 'f*** off' back to America, to which she responded by shouting 'Hag be quiet, hag be quiet'.\nPolice were called to the set in Elstree, Hertfordshire, after the row broke out between Miss Abraham (left) and Miss Horgan-Wallace (right) during a discussion about nominations\nMiss Abrahams (left) was on CBB's spin-off to discuss the recent evictions of Janice Dickinson (centre) and Jenna Jameson (second from left), who had joined Vicki Michelle (second from right) and Miss Horgan-Wallace (right) for a post-show analysis before the row boiled over\nThe feuding pair are said to have thrown champagne glasses, while former supermodel Janice Dickinson, 60, was accused of throwing a chair. Channel 5 have not confirmed what happened after the programme went off air.\nMs Dickinson (pictured) and Miss Abraham were later cautioned for common assault\n'Allo 'Allo actress Vicki Michelle, 64, who was also appearing on the programme but was not involved in the argument, had to be rushed to hospital after she was apparently caught in the crossfire.\nThe dramatic incident came days after mother-of-one Miss Abraham, who rose to fame when she appeared on MTV reality series Sixteen And Pregnant, was evicted from the competition following weeks of aggressive behaviour.\nShe was on CBB's spin-off to discuss the recent evictions of Ms Dickinson and Jenna Jameson, who had also joined them for a post-show analysis before the row boiled over.\nMs Dickinson and Miss Abraham were later cautioned for common assault, but Miss Horgan-Wallace - who appeared in Big Brother's seventh series in 2006, did not accept a caution, alleging that the show's producers had engineered the spat.\nFollowing a five-month police investigation Miss Horgan-Wallace, from north London, was charged with assault, after Miss Abraham was allegedly injured by the champagne.\nShe was also charged with criminal damage to Miss Abraham's dress, but denied both charges during a hearing in Stevenage, Hertfordshire, on Monday last week, The Sun reports.\nA trial was set to take place in March, and witnesses who could have been called to give evidence included the programme's presenter, Rylan Clarke, Ms Michelle and two of the show's producers.","url":"https://www.dailymail.co.uk/news/article-3422838/Charges-against-Celebrity-Big-Brother-star-Aisleyne-Horgan-Wallace-champagne-throwing-incident-DROPPED-five-month-probe.html"}
