{"authors":["Siofra Brennan For Mailonline"],"date_download":"2018-10-23 01:22:44","date_modify":"2018-10-23 01:22:44","date_publish":"2017-03-10 09:23:45","description":"Kendall Jenner has been accused by fans of having hip implants to boost her curves after displaying a more hourglass figure on Instagram, and experts confirm it's a growing trend.","filename":"data/vaneerConsumption/Celebritiesarehavinghipjobstoboosttheircurves.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/15/3E14054100000578-0-image-a-47_1489072324184.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4293986_Celebrities-having-hip-jobs-boost-curves_1540257764.html","title":"Celebrities are having hip jobs to boost their curves","title_page":"Celebrities are having hip jobs to boost their curves | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Kardashians are certainly no strangers to rumours about turning to surgery to enhance their figures, with many insisting that their voluptuous derrieres are more likely down to bum implants than squatting at the gym.\nBut fans of Kendall Jenner believe they've found another explanation after she displayed a noticeably more curvy figure on Instagram, and was accused of having a 'hip job'.\nThe procedure, which involves implants or fat injections, is growing in popularity as people strive to emulate Kardashian curves.\nDr Dev Patel, medical director of Perfect Skin Solutions in Portsmouth, has examined photos of Kendall and her sister Kylie as well as Amber Rose and Nicki Minaj and believes they've all had some kind of procedure to boost their hips.\nKylie Jenner has been at the centre of breast and buttock implant rumours, but now experts say she may have also had a procedure to boost the size of her hips\nWhat a difference three years makes! Kylie Jenner in a bikini in February 2014 (left) and showing off significantly curvier hips in 2017 (right)\n'The examples seem to have more shape to the hip area, which could indicate that they have undergone a cosmetic treatment to reshape or add shape,' said Dr Patel, who has not treated any of the stars mentioned.\n'Often the hips and buttocks may be jointly treated to create a more even result.'\nDr Patel confirms that treatments to enhance the hips if one of the most popular requests of the moment.\n'Now more than ever we are seeing younger female patients seeking body contouring treatments and procedures designed to give them a toned but curvy physique,' he explained.\nWHAT IS A HIP JOB? There are two ways of boosting the hips according to Dr Ross Perry, GP Dermatologist and founder of Cosmedics. 'The first is by creating a pocket between the skin and muscle to put an actual \"implant\" in, that is specificially shaped for this area - often made from silicon gel like the breast implants. 'The second is to use fat from your body that is harvested and re injected into this area. 'Both methods are acceptable but with significant risks of infection, bleeding and contour irregularities. 'It is not a routine procedure and needs careful thought and due diligence in whom you choose to do this as I would personally only see a BAAPS member ( British Association of Aesthetic Plastic Surgeons ) as you are running a serious risk to your health otherwise.\nFans cautioned Kendall not to 'go overboard like her sisters' after seeing this snap of her with seemingly bigger hips\nFans have questioned whether Kendall Jenner may have had some kind of surgical enhancement after Kendall on the catwalk for Tommy Hilfiger in September 2014 (left) and (right) an Instagram snap that prompted fans to accuse her of artificially boosting her hips\n'As soon as Kylie or Kendall Jenner posts a photo to their Instagram account we will receive requests from clients someway linked to what they have seen.\n'When it comes to the \"dream body\" the most popular areas of the body to undergo contouring treatments on at the moment include the hips, thighs and buttocks.\n'I tend to favour a non-surgical approach such as energy-assisted body contouring treatments as it offers both safer and offer more natural looking results.\nAmber Rose shows off her slim curves in a catsuit in 2009 (left) and with much curvier hips in October 2016\nRapper Nicki Minaj in 2010, showing off her slim but curvy figure in a fitted white dress (left). The star shows off her very voluptuous hips in a lace catsuit in October 2016 (right)\n'Hip implants specifically would be classed as an invasive surgical procedure, in the same vein as breast augmentation or butt implants.\n'It is worth seriously considering whether a non-surgical alternative such as body contouring maybe a safer alternative to getting a curvier or toned shape.'\nDr Ross Perry points out that the illusion of bigger hips can also be created using liposuction.\n'For those with fuller contours on their hips but slimmer waists, it's possibly due to liposuction to create the slimmer waists and leave a fuller figure lower down rather than adding volume to those areas.","url":"https://www.dailymail.co.uk/femail/article-4293986/Celebrities-having-hip-jobs-boost-curves.html"}
