{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-23 03:12:02","date_modify":"2018-10-23 03:12:02","date_publish":"2016-01-29 18:02:36","description":"In scenes set to air on Friday's installment of the Channel 5 show, viewers will see the lovebirds fumbling under the covers, causing outrage among their housemates for keeping them awake.","filename":"data/vaneerConsumption/CelebrityBigBrothersStephanieDavisandJeremyMcConnelldidNOThavesex.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/18/30B4A55400000578-0-image-a-23_1454090627503.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423235_Stephanie-Davis-Jeremy-McConnell-did-NOT-sex-Celebrity-Big-Brother_1540264322.html","title":"Celebrity Big Brother's Stephanie Davis and Jeremy McConnell did NOT have sex","title_page":"Celebrity Big Brother's Stephanie Davis and Jeremy McConnell did NOT have sex | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's been alleged that Stephanie Davis and Jeremy McConnell took their relationship to the next level on Celebrity Big Brother.\nIn scenes set to air on Friday's installment of the Channel 5 show, viewers will see the ex-Hollyoaks star and male model Jeremy fumbling under the covers, causing outrage among their housemates for keeping them awake.\nBut despite Danniella Westbrook, Tiffany Pollard and Gemma Collins' claims the lovebirds were having sex, it has been confirmed to MailOnline that their relationship was not intimate.\nScroll down for video\nNo frisky business: Despite scenes airing on Friday night's episode of Celebrity Big Brother appearing to show Stephanie Davis and Jeremy McConnell having sex, MailOnline has learnt the pair did NOT get intimate\nStephanie's representative said: 'I can confirm that Stephanie does not have sex on television in tonight's episode of Celebrity Big Brother, this suggestion comes from Danniella and Gemma's comments and isn't based on any fact – just speculation.'\nThis comes after Danniella made it appear as though the pair were indulging in some hanky panky between the sheets, declaring she would personally never have sex on national television.\nThe former EastEnders actress said: 'All I can hear is them getting it on, I’m so embarrassed. I don’t want to take my fingers out of me ears.\nSee the latest CBB updates on Stephanie Davis and Jeremy McConnell\nInseparable: After dumping her boyfriend Sam Reece, Stephanie has taken the plunge with Jeremy and the pair shared their first kiss this week\nBedroom antics: In scenes set to air on Friday, viewers will see the lovebirds moving around under the covers, prompting speculation from their housemates that they were getting intimate\n'I couldn’t do it could you on the telly? Don’t take her foot off the gas does she, it’s one thing after another.\n'It’s just a level of disrespect for everyone in that room.'\nTiffany was also annoyed by Stephanie and Jeremy's noisy bedroom antics, complaining that the sound effects were 'throwing [her] off'.\nThe outspoken American reality star complained: 'That makes me uncomfortable now. It wasn’t bothering me until now.\nSleep deprived: Danniella Westbrook was furious about the pair keeping her awake, saying, 'It’s just a level of disrespect for everyone in that room'\n'You know what it is; it’s the sounds of kissing. Because I’m not gonna lie to you, when I was hearing the sounds of kissing, I was becoming quite moist. It’s throwing me off my game.'\nEarlier this week, Stephanie decided to throw caution to the wind and dump her boyfriend Sam Reece on television, claiming that she needs 'to be single'.\nAnd Stephanie and Jeremy's flirty friendship has progressed as a result, with the pair sharing a steamy smooch for the very first time in Thursday night's episode.\nNot bothered: Male model Sam Reece - who was dumped by Stephanie on television - is said to have turned down the offer of entering the CBB house this week\nIt has now emerged that Stephanie's now ex-boyfriend Sam was offered the chance to go into the CBB house, but declined the chance to set things straight with the brunette beauty.\nA source told MailOnline: 'Sam has been asked earlier in the week and has turned it down.'\nStephanie is up for eviction of on Friday night alongside tattooed hunk Jeremy and feisty Tiffany - and it seems she won't be short of offers should she get the axe.\n'She is going to be seriously busy when she comes out', the insider added.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423235/Stephanie-Davis-Jeremy-McConnell-did-NOT-sex-Celebrity-Big-Brother.html"}
