{"authors":["Olivier Laurent","Photo Editor Focusing On France","Africa","Middle East"],"date_download":"2018-10-21 03:05:24","date_modify":"2018-10-21 03:05:24","date_publish":"2018-09-04 11:18:55","description":"An exhibition of 30 years of photojournalism shows why photography is still powerful","filename":"data/vaneerConsumption/Celebrating30yearsofphotojournalismatVisapourlImage.json","image_url":"https://www.washingtonpost.com/resizer/I0a03_K0apKtaJm2fN4Hg8g4dck=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/EL2YBXNVP4YMLPI7O2JRDH3IH4.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_09_04__1540091124.html","title":"Celebrating 30 years of photojournalism at Visa pour l’Image","title_page":"Celebrating 30 years of photojournalism at Visa pour l’Image - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Bacchi, a young tigress, seeks relief from the sweltering 120-degree-Fahrenheit heat in a pool, despite its fetid brew of rotting leaves and monkey urine. (Michael “Nick” Nichols/National Geographic Creative)\nBeyond the exhibitions and screenings, where hundreds of thousands of visitors can discover or rediscover some of the best of photojournalism produced around the world, Visa pour l’Image, the annual photography festival held in Perpignan, France, is also a meeting place.\nThe first time I attended, 10 years ago to the day, my colleague, then Diane Smyth of the British Journal of Photography, and I found ourselves speaking to two giants of photojournalism: Noor photographers Yuri Kozyrev and Stanley Greene. Not only were they answering our questions, but they were reacting to each other’s work and anecdotes. I fell in love with photojournalism that day.\nThis year, as the festival turns 30, its director has distilled that feeling of wonder and rediscovery in an anniversary exhibition composed of a selection of his favorite images ever taken or shown at Visa pour l’Image.\nIn total, there are 39 images ranging from the political — with Paul Fusco’s documentation of Robert Kennedy’s funeral train or Callie Shell’s behind-the-scenes shot of Barack Obama resting before a speech during the 2008 presidential campaign — to the historical, best represented by Joe Rosenthal’s “Raising the Flag at Iwo Jima,” a photo that later inspired the Marine Corps War Memorial monument near Arlington National Cemetery.\nAlso featured are photographs by Stephanie Sinclair, who has spent the last decade documenting child marriages around the world, as well as by Catherine Leroy, one of the first women war photographers, and Françoise Demulder, Alexandra Boulat and Brent Stirton among many others.\nThe exhibition is not just an ode to the power of photography, it’s also a reminder that great photography can inspire emotions the moment the shutter is pressed as well as decades later.\nIn Shkodra, Albania, Lina’s husband was robbed and killed after he withdrew his salary from a bank. (Guillaume Herbaut)\nThe Karantina Massacre in Beirut, in 1976. (Françoise Demulder)\nSen. Barack Obama rests while campaigning for president in Muscatine, Iowa, on Nov., 7, 2007. (Callie Shell/Aurora for TIME)\nAhmad Shah Massoud in the Panjshir Valley, Afghanistan. (Pascal Maitre/Cosmo)\nRobert Kennedy’s funeral train, 1968. (Paul Fusco/Magnum Photos)\nThe exhibition runs until Sept. 16 in Perpignan, France.\nHere’s a full list of selected photographers: Mohammed Abdiwahab, Yannis Behrakis, Daniel Berehulak, Philip Blenkinsop, Alexandra Boulat, Pierre Boulat, Sarah Caron, Patrick Chauve, Marie Laure de Decker, Françoise Demulder, Marie Dorigny, David Douglas Duncan, Paul Fusco, Raphael Gaillarde, Stanley Greene, Carol Guzy, Guillaume Herbaut, Brenda Ann Kenneally, Jean Pierre Laffont, Catherine Leroy, Gerd Ludwig, Pascal Maitre, Dario Mitidieri, Michael “Nick” Nichols, Rémi Ochlik, Darcy Padilla, Paolo Pellegrin, Eugene Richards, Joe Rosenthal, Andrea Star Reese, Callie Shell, Stephanie Sinclair, Maggie Steber, Brent Stirton, Tom Stoddart, Scott Thode, Laurent Van Der Stock, and Alfred Yaghobzadeh.\nEach photograph is presented with a video interview of Visa pour l’Image’s director, Jean-François Leroy, and deputy director, Delphine Lelu. They can be viewed here.\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\nConfronting depression with photos, this artist’s works are ‘keen emotional witnesses to this broken world of ours’\nStunning aerial photos of the worst drought in Australia’s living memory\nWhat it was like in the nightclubs of Chicago’s South Side in the 1970s","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/09/04/celebrating-30-years-of-photojournalism-at-visa-pour-limage/"}
