{"authors":["Jan Moir For The Daily Mail"],"date_download":"2018-10-22 21:36:19","date_modify":"2018-10-22 21:36:19","date_publish":"2016-01-11 01:12:30","description":"Angie Bowie’s single claim to fame is that she was once married to David Bowie and that was good enough to get her into this year’s Celebrity Big Brother house.","filename":"data/vaneerConsumption/CelebrityBigBrothersAngieBowieclaimsDavidforcedherintoopenmarriage.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/30008B1000000578-0-image-a-46_1452474316627.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/debate_article-3393204_The-bitterness-Mrs-Bowie-claims-forced-debauched-open-marriage-poisoned-son-against-Angie-Bowie-s-hitting-viciously-indiscreet-style_1540244179.html","title":"Celebrity Big Brother's Angie Bowie claims David forced her into open marriage","title_page":"Celebrity Big Brother's Angie Bowie claims David forced her into open marriage | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Angie Bowie’s single claim to fame is that she was once married to David Bowie and that was good enough to get her into this year’s Celebrity Big Brother house.\nBarely had the door slammed shut on the television freakfest which began on Channel 5 last week, when Angie peeled off her red fur coat, sat down in her gold sequinned dress and set about minting her notoriety afresh.\n‘He hates me,’ she told fellow contestants, explaining why she has not spoken to her legendary ex-husband for nearly 40 years.\nWhen they divorced in 1980, David was awarded custody of their son, Zowie.\nToday, he is a 44-year-old film director called Duncan Jones, and he does not speak to Angie, either.\n‘That is because David poisoned the boy against me,’ says his mother. Why would he do such a thing? ‘I don’t know, you’ll have to ask him.’\nScroll down for video\nGolden years: Angie and David Bowie with their son Zowie in 1974\nBeing shunned by both Bowie men has, Angie told her housemates, left her with a broken heart.\n‘My job was managing David and when I was offloaded I couldn’t work with anyone else as a manager. That’s the reason why I was heartbroken; I had no work and a son. So I wasn’t interested in fighting David for custody because I didn’t have a job,’ she explained.\nIt hardly seems logical now, but back then it must have made sense to a headstrong young woman whose unhappiness had manifested itself in a deepening spiral of drugs, alcohol and two suicide attempts.\nTo Angie’s credit, she somehow managed to get sober and has attempted over the years to relaunch herself variously as a model, actress, singer, writer, journalist, radio show host, businesswoman and now reality show star.\nYet nothing she has done has ever been as potent or as successful as basking in the reflected glory of Bowie’s fame. A fame which, to be fair, she helped to establish, pushing him from South London cult icon to global superstar.\nSee the latest CBB news updates with more on Angie Bowie and ex-husband David\nCelebrity Big Brother: Channel 5 asked Angie ‘three or four’ times before to appear and this time she said yes only because she wants to sell charity books and donate some of the funds to a cat refuge\nIndeed, she believes that her greatest creation was David Bowie himself and it continues to grate, after all this time, that he never gives her any credit for it.\n‘I was miffed. The divorce was a terrible time because it was also the end of a business partnership, but he would never acknowledge the help that I had been to him, the fact that I got Space Oddity (Bowie’s seminal 1969 album) signed to a record label when no one else could.’\nWhen they met, Angela Barnett was a leggy 19-year-old studying marketing in London, a brash American who grew up in Cyprus and went to a Swiss finishing school.\nShe had big ideas — that first she would make David a star, then it would be her turn to shine.\nInstead, their relationship ended in a chilly divorce followed by a glacial silence as she was cut out of his life.\nBowie rarely speaks of his first wife, but once said she had ‘as much insight into the human condition as a walnut and a self-interest that would make Narcissus green with envy’.\nStill, they must have been happy once. He wrote Prettiest Star and — she claims — Golden Years for her. ‘But he never treated me the way I wanted to be treated,’ she reflects.\nWe meet in a hotel near Elstree, Hertfordshire, the day before Angie is going into the Big Brother House. I hear her before I see her, that raspy trumpet of a voice rolling down the corridor. ‘No!’ she bellows at a photographer, who has asked her to pose with hands on hips. ‘I don’t want to look like a washerwoman.’\nAngie is sometimes oddly vulnerable, but generally has the air of a woman on the lookout for fools, which she will then take pleasure in not bearing lightly.\nOne can see why Bowie said that being married to her was like ‘living with a blowtorch’ — but I wondered if she knew what he meant.\n‘Whaddya mean, what did he mean? I have no idea. I don’t know what being a blowtorch means, do you?’\nUm, perhaps that you are a force of nature? Angie likes that idea.\nAbove: Angie today at 66\n‘Yeah! I think so because I am pretty lively.’\nToday, home is in Acworth, Georgia, a small town near Atlanta where she lives with her partner of 23 years, an electrical engineer called Michael Gassett, and their two cats, George and Bitsy.\nShe works out in her home gym, writes poetry and, when asked if being David Bowie’s ex-wife has proved lucrative, replies: ‘No.’\nIt wouldn’t take Sherlock Holmes to deduce that Angie is doing CBB because she really needs the money, but apparently this is not so.\nChannel 5 asked her ‘three or four’ times before to appear and this time she said yes only because she wants to sell charity books and donate some of the funds to a cat refuge. ‘I agreed to do it,’ she says, ‘as I know it is one of the better, more fabulous and more thought-out reality shows.’\nOh dear. Shall you tell her, or shall I?\nAngie is now 66, with a shock of ice-cream hair, a trim figure and, still, those great legs. She married Bowie in 1970 and, at their peak, they were a molten couple, the darlings of the counter culture.\nBoth were bisexual (‘David and I may have been the best-known bisexual couple ever’) and wildly promiscuous, with a marriage as open as a Saturday morning sweetshop.\nAngie tells me that was because it was what he wanted, it was not what she wanted.\n‘I was a little suspect of him. He did a lot of cavorting. When we got married, it soon became apparent that it had to be an open marriage if it was going to work for him.\n‘I liked him, loved him, cared about him, but I was not going to be humiliated and not treated with dignity and respect. So I made sure I did plenty of cavorting myself because that means the playing field was levelled.\n‘If it is good enough for you, Big Daddy, it is good enough for me.’\nShe says she has no idea if Big Daddy got jealous of her affairs — which included romps with singer Dana Gillespie and gangster John Bindon — but admits that despite her best endeavours, she was frequently humiliated by Bowie.\n‘We won’t even go into it because we would still be here 280 people later. The worst, the very worst, was when he went to meet Bianca Jagger in the South of France. I thought that was really tacky, particularly because he took my son with him. I did not like that. I thought that was very poor manners.’\nIn her 1993 book Backstage Passes — Life On The Wild Side With David Bowie, she says that Bowie seduced Bianca in 1975 because he was furious with Mick Jagger for writing the Rolling Stones hit Angie about his wife.\nHowever, it was Rolling Stone Keith Richards who primarily wrote the lyrics. And in his 2011 memoir Life, Richards stated the song was actually about heroin.\nThat’s not the only claim of Angie’s that disappears into a puff of stardust under close examination. Even her insistence that she was Bowie’s manager is puzzling, given that her only experience had been half a dozen marketing classes.\nFrom her own memoirs, she seems to have been the kind of pushy girlfriend who was a stylish inspiration, but not much more that a glorified personal assistant.\nWhen Ziggy and the Spiders From Mars (Bowie as flamboyant alter ego Ziggy Stardust and his band) went on tour, Angie says: ‘I wouldn’t allow them to book bad hotels, or go out not looking fantastic, I ironed more shirts than I have had hot dinners. I did everything.’\nI loved him, but I was not going to be humiliated Angie Bowie\nShe played her part, but did she have any real power? Trying to get at the truth is like trying to make alphabetti letters out of spaghetti while wearing mittens.\nBy the mid-Seventies, she and Bowie started to live separate lives, wrapped up in their individual drug problems while Zowie seems to have been largely brought up by nannies and was educated at Gordonstoun.\nIn the end, she left the marriage with a settlement of £500,000 (‘paid in instalments, it wasn’t even enough to buy a house’) and a ten-year gagging clause.\nThe second that was up, she wrote her book Backstage Passes. And she wasted no time in telling the world, via the Joan Rivers show on American TV, her most delicious secret: that she once found David Bowie in bed with Mick Jagger at their house in London.\nFrom her own memoirs, she seems to have been the kind of pushy girlfriend who was a stylish inspiration, but not much more that a glorified personal assistant\nWas this an act of revenge on her part?\n‘What are you talking about? Do you think I was lying? I never said they had sex together. He was just fast asleep in my house in Oakley Street with Mick Jagger in the bed.’\nNo, but surely your implication was that they had sex?\n‘Why would I think that?’\nBecause you found them naked together in bed?\n‘So what? People pass out drunk all the time. I didn’t see them having sex, so why would I say it?’\nSo why include it in your book?\nShe found Bowie naked in bed with Mick Jagger\n‘Include what?’\nThe fact that you found them in bed together.\n‘Why would that be relevant? Mick and David in bed together made no odds to me, I didn’t care.’\nDid you ever talk to him about it afterwards?\n‘No.’\nOh God. Perhaps Angie has forgotten she wrote that she was ‘absolutely dead certain’ Jagger and Bowie had sex together because ‘David made a virtual religion of slipping the Lance of Love into almost everyone around him’.\nBowie is now happily married to the model Iman, and they have a 15-year-old daughter together.\nThe couple live in New York, where I imagine Bowie is regarding his ex-wife’s burgeoning career as a reality star with a jaundiced eye.\nAngie and David’s son Duncan lives in Los Angeles and is, at best, a ghostly presence in her life.\nAngela Barnett was a 19-year-old marketing student when she met David Bowie in London\nIn Backstage Passes, she writes of how Bowie is secretly appalled when she goes off to party with Dana Gillespie in Italy two weeks after their son was born.\nHe says nothing but, Angie feels, that was the beginning of the end. ‘I had gained a son but lost a husband.’\nAlthough she tries to hide it, I think Angie continues to be hurt by the absence of her son in her life.\n‘You are talking about stuff that is so old. I haven’t seen him for so many years. What would I care?’\nHe is now a successful Hollywood director and his 2009 sci-fi film Moon was garlanded with awards and praise. When Angie went to see it, she wept in the cinema.\n‘I boo-hoo’d like an absolute child because the film was all about abandonment and I got it. I thought that is what David told him, David said I abandoned them. And I got it and boy, was I mad.\n‘I didn’t abandon Zowie, but at some point I couldn’t take any more humiliation from David so I took my dignity and got up off my a**e and left to start another life.’\nShe had a three-year relationship with punk rocker Andrew Lipka, aka Drew Blood. They had a daughter Stasha, born in 1980, to whom Angie remains close.\nStill, the giant shadow of her famous husband continues to loom over her existence. Friends say that she still calls herself Angie Bowie even when booking taxis.\nFollowing a minor heart attack in 2004, Bowie has not played live since 2006, but still makes music — he marked his 69th birthday on Friday with the release of an album, Blackstar, welcomed by critics.\n‘I can’t listen to his new music, it makes me nauseous,’ says Angie. ‘The last album he did was just a rehash of a bunch of old rubbish.’\nYet she is still trying to get her share of the limelight, promised to her all those years ago.\nWhat does she see herself as now? ‘I am an entertainer,’ she says, and it is hard to argue. In CBB, she has sparked the first argument by calling another housemate ‘an obnoxious American’ while he muttered about her ‘scary witch face’.\nWowie, Bowie.","url":"https://www.dailymail.co.uk/debate/article-3393204/The-bitterness-Mrs-Bowie-claims-forced-debauched-open-marriage-poisoned-son-against-Angie-Bowie-s-hitting-viciously-indiscreet-style.html"}
