{"authors":["Heidi Parker For Dailymail.Com"],"date_download":"2018-10-23 00:31:01","date_modify":"2018-10-23 00:31:01","date_publish":"2016-01-28 14:32:27","description":"The lineup is better than any former boss Donald Trump ever had. On top of the list are Kyle Richards of Real Housewives Of Beverly Hills fame and Eighties pop legend Boy George.","filename":"data/vaneerConsumption/CelebrityApprentice2016lineupannouncedasArnoldSchwarzeneggerplaysboss.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB593F00000578-0-image-a-36_1453996711441.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421035_Celebrity-Apprentice-lineup-announced-Arnold-Schwarzenegger-plays-boss-list-better-Donald-Trump-got_1540254661.html","title":"Celebrity Apprentice 2016 lineup announced as Arnold Schwarzenegger plays boss","title_page":"Celebrity Apprentice 2016 lineup announced as Arnold Schwarzenegger plays boss | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The contestants for the eighth edition of Celebrity Apprentice were announced on Thursday by NBC.\nAnd the lineup is better than any former boss Donald Trump ever had. This time around, action star Arnold Schwarzenegger takes the reins. On top of the list are Kyle Richards of Real Housewives Of Beverly Hills fame and Eighties pop legend Boy George.\nTyra Banks - who announced on Wednesday she had a baby via surrogate - Jessica Alba, Warren Buffett, Steve Ballmer and Patrick Knapp Schwarzenegger (not Arnold's son, but rather his nephew) will serve as advisers on the new season.\nScroll down for videos and list of contestants...\nDid this guy pull some strings? The contestants for the 15th season of Celebrity Apprentice was announced on Thursday. And the lineup is better than any former boss Donald Trump ever had. This time around, action star Arnold Schwarzenegger talks the reins; here he is seen in December in Paris\nThey will be tested: On top of the list are Kyle Richards of Real Housewives Of Beverly Hills fame and Eighties pop legend Boy George\nBack to reality: Nicole 'Snooki' Polizzi of Jersey Shore fame is also joining the show; here she is seen on Wednesday in LA\nShe is reality gold: Brooke Burke-Charvet, who was a contestant then co-host of Dancing With The Stars, made the grade; here she is seen on January 20 in NYC\nOther contestants include Brooke Burke-Charvet (who was a contestant then co-host of Dancing With The Stars), Laila Ali and Eric Dickerson.\nOthers who made the cut include Matt Iseman, Carrie Keagan, Carson Kressley, Lisa Leslie, Jon Lovitz and Vince Neil.\nThis is Real: Real Housewives Of Atlanta wild card Porsha Williams will go head-to-head with The Arnold; here she is seen in pink halter dress with cast mates (l-r) Tammy McCall, Kenya Moore, Cynthia Bailey, Kandi Burruss, Phaedra Parks Nida and Kim Fields\nMore TV for this new mom: Tyra Banks - who announced on Wednesday she had a baby via surrogate - will serve as advisers on the new season; here she is seen in April\nCELEBRITY APPRENTICE CONTESTANTS SEASON EIGHT CONTESTANTS Laila Ali Brooke Burke-Charvet Eric Dickerson Boy George Matt Iseman Carrie Keagan Carson Kressley Lisa Leslie Jon Lovitz Vince Neil Nicole \"Snooki\" Polizzi Kyle Richards Chael Sonnen Porsha Williams Ricky Williams Carnie Wilson ADVISERS Tyra Banks Jessica Alba Warren Buffett Steve Ballmer Patrick Schwarzenegger\nNicole 'Snooki' Polizzi of Jersey Shore fame is also on the list.\nAnd so is Real Housewives Of Atlanta wild card Porsha Williams.\nChael Sonnen, Ricky Williams and Eighties music sensation Carnie Wilson round out the list.\nTrump did not sign up last year to a 15th season of the Apprentice in anticipation of running for president - prompting the decision to find a new star of the show.\nIn June he and NBC acrimoniously parted ways completely after controversy over his description of some Mexican illegal immigrants as 'rapists'.\nEach side claimed they were first to end the relationship. NBC accused him of 'derogatory statements' and Trump said: 'As far as ending the relationship, I have to do that, because my view on immigration is much different than the people at NBC.'\nIt was announced in September that Schwarzenegger - who was once the Governor of California - would be stepping into Trump's shoes.\n'I have always been a huge fan of The Celebrity Apprentice and the way it showcases the challenges and triumphs of business and teamwork,' the star said.\n'I am thrilled to bring my experience to the boardroom and to continue to raise millions for charity.'\nHe added: 'Let's get started!'\nTrump said, 'Congrats to my friend @Schwarzenegger who is doing next season's Celebrity Apprentice. He'll be great & will raise lots of $ for charity. To all my fans, sorry I couldn't do The Apprentice any longer—but equal time (presidential run) prohibits me from doing so. Love!'\nIn previous years, Trump has had stars like Joan Rivers and Playboy pinup Tiffany Fallon.\nShe will lend her talents too: The Honest Company founder Jessica Alba will also appear on the series; here she is seen on Wednesday","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421035/Celebrity-Apprentice-lineup-announced-Arnold-Schwarzenegger-plays-boss-list-better-Donald-Trump-got.html"}
