{"authors":["Fehintola Betiku","Rebecca Davison For Mailonline"],"date_download":"2018-10-23 05:13:17","date_modify":"2018-10-23 05:13:17","date_publish":"2016-01-11 18:24:49","description":"On Monday afternoon a Channel 5 spokesperson told MailOnline: 'Jonathan Cheban has decided to leave the Celebrity Big Brother House.'","filename":"data/vaneerConsumption/CelebrityBigBrothersJonathanChebanpicturedinLondonafterquitting.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/23/3010C6A900000578-0-image-a-24_1452554462147.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3394373_Jonathan-Cheban-LEFT-Celebrity-Big-Brother-House-saying-edgy-claustrophobic_1540271597.html","title":"Celebrity Big Brother's Jonathan Cheban pictured in London after quitting","title_page":"Celebrity Big Brother's Jonathan Cheban pictured in London after quitting | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jonathan Cheban was pictured looking tired as he headed out in London on Monday night, following his shock exit from the Celebrity Big Brother house earlier that day.\nShowing signs of exhaustion, the 41-year-old had visible bags under his eyes as he donned a casual ensemble.\nEarlier on, a Channel 5 spokesperson told MailOnline: 'Jonathan Cheban has decided to leave the Celebrity Big Brother House.'\nScroll Down For Video\nOut and about: Jonathan Cheban looked exhausted as he stepped out in London on Monday evening after his shock exit from the Celebrity Big Brother house\nCasual: The 41-year-old dressed down for his outing in the capital following his brief stint on CBB\nDressed down for his night out, Jonathan sported a quilted jacket with a hoodie, jeans and a pair of high top trainers.\nFollowing his untimely exit from the reality TV show, Cheban took to Twitter to thank his fans for their support during his stint in the house.\nHe tweeted: 'Thank you guys for your support and the thousands and thousands of messages supporting me in Celebrity Big Brother! I love you so much #CBB'.\nScenes of Cheban's exit will appear in Tuesday night's episode on Channel 5 at 9pm. His reason for leaving is currently unknown.\n'Love you so much': Cheban took to Twitter to thank his fans for supporting him while in the house\nFree from the house: Jonathan appeared to show signs of exhaustion with very visible bags under his eyes\nOne to watch: Scenes of Cheban's exit will appear in Tuesday night's episode on Channel 5 at 9pm\nBack to the norm: Jonathan sported a quilted jacket with a hoodie, jeans and a pair of high top trainers\nJonathan's decision to quit CBB came after he had been complaining this week about feeling claustrophobic in the celeb-packed compound.\nMeanwhile on Saturday, viewers saw Kim Kardashian's best friend ask to speak to a producer of the over fears of anxiety.\nAfter speaking to Big Brother in the diary room for over an hour though, the 41-year-old decided to stick it out for at least one more day.\nAfter a dramatic first week in the house, Jonathan was seen during the latest episode seeking refuge in the diary room, following the first eviction of the series which saw Winston McKenzie voted out of the house.\nSee more of the latest on Jonathan Cheban as he leaves the Celebrity Big Brother house\nHe's gone! Jonathan left the Celebrity Big Brother House after saying he was 'edgy and claustrophobic'\nHe's out! The reality TV star was seen leaving the famous Elstree compound on Monday\nTime to leave: Soon after the news broke, the American personality was seen being driven in a car\nIt's over: Viewers saw Kim Kardashian's best friend ask to speak to a producer of the Channel 5 reality show on Saturday night's episode, after complaining of anxiety\n'Right now I'm feeling a little bit edgy and claustrophobic,' he told Big Brother. 'I'm definitely a little bit torn on whether to stay. There's a point when my mental stability is more important that entertaining,' he added.\n'I know Big Brother would not want me pain especially when I give 24 hour entertainment.'\nAfter leaving the diary room he joined close pal, TOWIE star Gemma Collins, who told the US star he should stay as 'you want to make it big in the UK?'\n'It's not that, I'm huge here. We're on in 180 countries!' Jonathan pointed out of the success of Keeping Up With The Kardsashians, which he appears in.\nLater Jonathan returned to the diary room and asked to speak to a producer about his anxiety and claustrophobia.\n'I feel like it's closing in, there's no room to hide so until I get out of here I'm not going to be calm,' he explained.\nClose: Despite pleas from his housemate Gemma Collins to stay, the US star admitted his anxiety was becoming too much to handle\nTalks: Jonathan ended up staying in the diary room for over an hour while his fellow housemates worried that he had already left the house\n'It's becoming impossible, I can't sit still, my heart is tight and racing all the time now. I can't even enjoy it, the fun masks it and now we're done with the day. I'm so anxious I'm going to have a heart attack.'\nJonathan ended up staying in the diary room for over an hour while his fellow housemates worried that he had already left the house.\nBut after a long chat with Big Brother, Jonathan decided he was feeling 'a little bit better, I've tried to regroup and see how I feel. Tomorrow will be my big deciding day but I want to give it one more shot.'\nAs he finally left the diary room the popular housemate was greeted with jubilant cheers.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3394373/Jonathan-Cheban-LEFT-Celebrity-Big-Brother-House-saying-edgy-claustrophobic.html"}
