{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-23 03:31:56","date_modify":"2018-10-23 03:31:56","date_publish":"2016-01-11 16:14:06","description":"The American beauty locks lips with both Jeremy McConnell and Scotty T in scenes set to air on Monday night's installment of the Channel 5 show.","filename":"data/vaneerConsumption/CelebrityBigBrother2016sTiffanykissesBOTHJeremyandScottyT.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/18/300CF59100000578-0-image-a-35_1452535591448.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3394160_Tiffany-kisses-Jeremy-Scotty-T-Celebrity-Big-Brother-house_1540265516.html","title":"Celebrity Big Brother 2016's Tiffany kisses BOTH Jeremy and Scotty T","title_page":"Celebrity Big Brother 2016's Tiffany kisses BOTH Jeremy and Scotty T | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She hasn't received any romantic attention in the Celebrity Big Brother house so far.\nBut Tiffany Pollard more than made up for it on Monday night when she shared an drunken smooch with not one, but two of her fellow housemates.\nThe American beauty, who is known for taking part in reality show Flavor of Love, can be seen locking lips with resident womanisers Jeremy McConnell and Scotty T in scenes set to air on Monday night's installment of the Channel 5 show.\nScroll down for video\nCornered! Tiffany Pollard went in for the kill when she bumped into Jeremy McConnell in the corridor in scenes set to air on Monday night's episode of Celebrity Big Brother\nTiffany, 34, can be seen giggling hysterically as she corners Beauty School Drop Outs hunk Jeremy in the corridor.\nWith a glass of wine in one hand and two beers in the other, the fiesty star lunges at her tattooed co-star, planting a wet sounding smacker on his lips.\nWhen his wingman Scott intercepts them, Jeremy calls out, 'Give scotty a kiss!', to which Tiffany immediately responds by kissing the Geordie Shore star,\nSee more of the latest CBB news as Tiffany kisses BOTH Jeremy and Scotty T\nMaking a move: Scotty T eagerly locked lips with Tiffany, despite pulling out all the stops to romance Megan so far\nTwice as nice: The American beauty then kisses Geordie Shore star Scotty T when he pops his head around the door\nBoozy night: Tifffany was clutching a glass of wine in one hand and two beers in the other\nTiffany's booze-fuelled antics come just after she expressed her attraction for married man Darren Day.\nTalking to Big Brother in the diary room, she said: 'I hate to admit this, I know he’s married, but I think Darren is very cool and attractive.'\n'I definitely will respect the boundaries of his marriage.'\nLusty: Resident womaniser Jeremy wasn't complaining and seemed thrilled with her advances\nJeremy certainly seems to have a way with the ladies, charming former Hollyoaks beauty Stephanie Davis despite the brunette having a boufriend.\nLying on top of each other on Steph’s bed, the pair could be heard saying ‘love you’ as they cuddled one another.\nEarlier this week, the soap star - who is in a relationship with model Sam Reece - got upset when David Gest made a joke about her boyfriend as she laid in bed receiving a tickle from Jeremy, 25.\nVexed by David's comments, the soap star rose from the bed and attempted to stomp out of the bedroom but not before the 62-year-old reassured her that he was only playing around.\n‘It's not funny though, it's hard enough being in here without him anyway,' she affirmed, before David apologised and hugged her.\nFlirtatious: The Beauty School Drop Outs star has been trying his best to impress the ladies in the house","url":"https://www.dailymail.co.uk/tvshowbiz/article-3394160/Tiffany-kisses-Jeremy-Scotty-T-Celebrity-Big-Brother-house.html"}
