{"authors":[],"date_download":"2018-10-30 21:15:22","date_modify":"2018-10-30 21:15:22","date_publish":"2016-08-03 17:05:53","description":"Another day, another food holiday. This time though, Georgia can really get behind it. August 3 is National Watermelon Day.","filename":"data/vaneerConsumption/CelebrateWatermelonDayattheseAtlantarestaurants.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/05/05/Images/photos.medleyphoto.7222205.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/events_food--wine_treat-you_ba7feedd1afae92bf2220b330afa47a3__1540934122.html","title":"Celebrate Watermelon Day at these Atlanta restaurants","title_page":"Celebrate Watermelon Day at these Atlanta restaurants","title_rss":"NULL","source_domain":"ajc.com","text":"Another day, another food holiday. This time though, Georgia can really get behind it.\nAugust 3 is National Watermelon Day. From being home to the Watermelon Capital of the World (Cordele, Ga) to growing nearly 36,000 acres of them, you could say we know our watermelons.\nFrom eats to drinks, there are a ton of ways to celebrate the great watermelon today in Atlanta.\nIf you want to celebrate this most sacred of holidays at home, the Watermelon Board has the guide for picking out the perfect melon today at the store.\nIf you want to start your meal the right way..\nKyma is bringing together the best of the south and Greece with a watermelon salad that combines feta, Vidalia onion, fresh herbs and watermelon sorbet.\nTable & Main puts together the ultimate summer salad with produce that is at it’s peak right now. Check out their watermelon & tomato salad with honey thyme ricotta, berry balsamic, and sesame.\nIf you’re craving seafood...\nFor Fry’s European coastal restaurant St. Cecilia is taking hamachi crudo and pairing it with sweet heirloom tomato, watermelon water and onion flowers for a delicate dish that is refreshing.\nMiller Union’s farm first menu is serving a small plate of chilled shrimp with watermelon, cucumber & vidalia salad, paprika, cilantro, serrano vinaigrette . You’ll want extra bread to sop up the tasty broth.\nIf you want a cocktail ...\nHead over to Bartaco for the perfect balance of sweetness and bitterness with the Sashito. It's made with Campari, orange liquer, watermelon, lemon juice and bitters. Order a few baja tacos, grab a seat on the beach-like patio and suddenly you're on vacation.\nIf you’re in Sandy Springs, stop by Tupelo Honey Cafe for their Watermelon & Ginger Kentucky Mule. Served on tap and made with Old Forester bourbon infused with fresh watermelon juice and ginger syrup and soda water served in a copper mug.\n>>>RELATED: First Look: Tupelo Honey serving up Southern in Sandy Springs\nIf you have a sweet tooth ...\nThe king of Atlanta desserts, King of Pops, serves up a refreshing way to satisfy any sweet tooth with their watermelon mojito pops. There are more than 40 carts throughout the city in addition to their window on the Beltline and shop in Ponce City Market, so you can always find one.","url":"https://www.ajc.com/events/food--wine/treat-yourself-national-watermelon-day-with-these-refreshing-atlanta-dishes/1Aj79eBV27tZ62JFtei5EP/"}
