{"authors":["Zoe Nauman For Dailymail.Com"],"date_download":"2018-10-23 05:14:48","date_modify":"2018-10-23 05:14:48","date_publish":"2016-01-29 20:50:43","description":"The 47-year-old singer took to her website on Friday to post a moving message of thanks to all those that have joined her in her sadness over the death of René Angelil.","filename":"data/vaneerConsumption/CelineDionthanksfansforsupportinmessageafterfuneralofherhusbandRenAngelil.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/22/30B55FD400000578-0-image-a-42_1454104880260.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423372_My-family-deeply-touched-Celine-Dion-thanks-fans-support-moving-message-funeral-beloved-husband-Ren-Angelil_1540271688.html","title":"Celine Dion thanks fans for support in message after funeral of her husband René Angelil","title_page":"Celine Dion thanks fans for support in message after funeral of her husband René Angelil | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Celine Dion has thanked her fans in a touching message after the death of her beloved husband René Angelil.\nThe international superstar was stoic in her grief at her husband's high-profile public funeral in Montreal a week ago.\nAnd today she told her fans that she had drawn strength from their messages of support.\nScroll down for video\nA message of thanks: Celine Dion made a statement on Friday thanking fans for all the support she and her family have got from their 'outpouring of love' after the funeral of her beloved husband René Angelil\nThe 47-year-old singer wrote on her website: 'My family and I are deeply touched by the outpouring of love and support from so many people who have touched our lives during these past few days.\n'We have felt your love for René, and your prayers and compassion have helped us during this most difficult time… more than you’ll ever know.'\n'I thank you from the bottom of my heart.'\nCeline carried her grief with tremendous dignity at the funeral in front of hundreds of well-wishers in a public service that was also live-streamed across the globe.\nAlongside the couple's three brave children, René-Charles, 15, and five-year-old twins Nelson and Eddy Patrick, as well as René's adult children, Jean-Pierre and Anne-Marie, Celine Dion led mourners remembering her manager and the man she called: 'The only boyfriend I've ever had'.\nBrave: In a statement Celine Dion thanked fans for their 'outpouring of love and support'\nGrief: The singer is seen here with her children René-Charles, 15, and five-year-old twins Nelson and Eddy Patrick at the state funeral held at the Notre-Dame Basilica, in Montreal, Canada, on January 22\nBeloved father: René (pictured here in 2009 with Celine and their son René-Charles) passed away after a long battle with cancer - he was 73\nCeline went on to thank the Quebec Government, who helped arrange the tribute to her husband, as well as National Funerals.\nShe continued: 'As well as the many individuals and organizations who came together to hold such a beautiful tribute in his name.\n'We will never forget all of the kindness that you have bestowed upon us.'\nShe finished the statement: 'On behalf of our family, with all of our love, Céline, René-Charles, Nelson & Eddy Patrick, Jean-Pierre & Anne-Marie.'\nGrieving: The 47-year-old singer said on behalf of her family: 'We have felt your love for René, and your prayers and compassion have helped us during this most difficult time'. The star suffered a double loss that week and on Saturday mourned her older brother Daniel, who also died of cancer\nRene‘s funeral, held at the Notre-Dame Basilica, in Montreal, Canada, on January 22, was televised in Canada as well as being streamed online around the world.\nHe passed away after fighting cancer for years, aged 73.\nThe most moving part of the ceremony, for many, was when the couple's oldest son, René-Charles, gave a speech.\nThe 15-year-old stood in front of the massive crowd saying: 'Fifteen years is not a long time to get to know your father.\n'He had a busy life but we were getting to know each other through golf, poker, smoked meat and other wonderful food.'\nDevastating: Celine (left) was left distraught after a terrible twist of fate saw her sibling (right) die aged 59 after losing his battle with cancer, just days after the singer's husband also passed away\nIt was at the line about smoked meat that René Charles got a few knowing laughs from the audience, a smile spreading to both his and his mother's faces.\n'Bonding more and more as time went by,' he continued.\n'You left me now with enough good memories of you to share with my younger brothers. As they grow older without you being around, I'll make sure to pass on what I've learned from you.'\nIn a terrible twist of fate, Celine tragically lost her brother Daniel two days after her husband died.\nMoving: Although only days shy of his fifteenth birthday, Celine Dion's son René Charles Angelil captured the heart of Canada with a moving eulogy to his late father during his funeral at the Notre-Dame Basilica\nThe family held a visitation at Salon Charles Rajotte, a funeral home in Repentigny, which is located outside of Montreal, for Daniel - who died after a long battle with cancer of the throat, brain and tongue.\n'They're close; she's close with all of her siblings,' a source told People.com at the time.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423372/My-family-deeply-touched-Celine-Dion-thanks-fans-support-moving-message-funeral-beloved-husband-Ren-Angelil.html"}
