{"authors":["Mallory Schlossberg"],"date_download":"2018-10-30 23:30:16","date_modify":"2018-10-30 23:30:16","date_publish":"2014-08-13 17:23:22","description":"It's a sad day for Celine Dion fans, as USA Today reports that she has decided to go on hiatus and postpone her Celine Dion Asia tour and Las Vegas shows. You know what that means: no live bellowing, powerhouse vocals to blow your mind and help you…","filename":"data/vaneerConsumption/CelineDionInConcertIsNoMoreButThese7PowerBalladsWillHelpYourHeartToGoOnVIDEOS.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/4da78a8b-8a75-4ac0-b1c2-c283c6d67a9b.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35623-celine-dion-in-concert-is-no-more-but-these-7-power-ballads-will-help-your-heart_1540942216.html","title":"Celine Dion In Concert Is No More But These 7 Power Ballads Will Help Your Heart To Go On - VIDEOS","title_page":"Celine Dion In Concert Is No More But These 7 Power Ballads Will Help Your Heart To Go On — VIDEOS","title_rss":"NULL","source_domain":"bustle.com","text":"It's a sad day for Celine Dion fans, as USA Today reports that she has decided to go on hiatus and postpone her Celine Dion Asia tour and Las Vegas shows. You know what that means: no live bellowing, powerhouse vocals to blow your mind and help you time travel back to the glory days of power ballads. But rest assured, the hiatus comes with a very good — albeit very sad — reason. Dion's husband, René Angélil, had a cancerous tumor removed back in December, and he is still in recovery. Dion wants to focus her attention on him, so she released a statement that said:\nI want to devote every ounce of my strength and energy to my husband's healing, and to do so, it's important for me to dedicate this time to him and to our children. I also want to apologize to all my fans everywhere, for inconveniencing them, and I thank them so much for their love and support.\nBut if there's anything that Celine Dion taught me and anyone who else who knows all of the words to \"It's All Coming Back To Me Now,\" it's that Celine knows a thing or two about the power of music when it comes to getting through the hard times. Her songs are the ultimate power ballads — hell, they paved the way for Let It Go. So, yes, your heart will go on by listening to this ultimate power ballad Celine Dion playlist.\nMy Heart Will Go On\nTitanicFan on YouTube\nCeline's famous song from Titanic— proof that your heart, will indeed, go on.\nIt's All Coming Back To Me Now\nCelineDionVEVO on YouTube\nThere were nights when the wind was so cold...this song is both epic in nature and in its exhibition of vocal prowess.\nThe Power of Love\nCelineDionVEVO on YouTube\nIf ever there was a musical testament to commitment to a relationship, then this one is it.\nAll By Myself\nCelineDionVEVO on YouTube\nEven though this is a cover, Dion's interpretation made it pretty famous. If you're ever feeling lonely, this is the song to belt out to express your pain.\nBecause You Loved Me\nYouTube\nAnother one of Dion's vocally powerful testaments to commitment and love. I also fully believe that there would be no \"I Turn To You\" without this song. (Revisit this '90s song, and see if you agree!)\nTo Love You More\nBonnesvisagie on YouTube\nThis song has less anguish than, say, \"All By Myself,\" and maybe it ooze \"this is a power ballad\" as much as \"The Power of Love,\" but this is still classic Celine Dion.\nThe Prayer (featuring Josh Groban)\nPhillymacvideos on YouTube\nTwo beautiful voices on one beautiful song.\nAll coming back to you now, eh? (Sorry, couldn't help myself.) But you know the signature sounds of a Celine ballad: high notes, anguish, emotion, love, all gut-wrenching stuff.\nHopefully Dion's husband will have a more speedy recovery than anticipated, but it's understandable that she'd want to spend time with him instead of performing for masses of her fans; it's appropriate that she's putting her family first in this situation. So until Celine Dion resumes performing, you can revisit those golden days of power ballads. In fact, it's never a bad time to time travel to the era of glorious power ballads.\nAnd while these emotional songs may not be able to aid in her husband's recovery, it's undeniable that if Dion can bellow such passion into these songs, that she's giving her husband her utmost, loving attention right now.","url":"https://www.bustle.com/articles/35623-celine-dion-in-concert-is-no-more-but-these-7-power-ballads-will-help-your-heart"}
