{"authors":["Associated Press"],"date_download":"2018-10-23 03:45:11","date_modify":"2018-10-23 03:45:11","date_publish":"2016-01-11 16:32:43","description":"ATLANTA (AP) — The FBI zeroed in on a woman suspected in jewelry store robberies across the South after analyzing records from cellphone towers near the robb...","filename":"data/vaneerConsumption/CellnumbersocialmedialedFBItorobberysuspect.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393872_Cell-number-social-media-led-FBI-robbery-suspect_1540266311.html","title":"Cell number, social media led FBI to robbery suspect","title_page":"Cell number, social media led FBI to robbery suspect | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Cell number, social media led FBI to robbery suspect\nATLANTA (AP) — The FBI zeroed in on a woman suspected in jewelry store robberies across the South after analyzing records from cellphone towers near the robberies, then checking social media and hearing from suspicious friends, newly filed court records reveal.\nAbigail Lee Kemp, 24, is due in court at noon Monday for a first appearance before a judge, FBI Special Agent Stephen Emmett said in an email. She was apprehended in the Atlanta suburb of Smyrna, Georgia, along with a person who was with her at the time, the FBI said. Authorities haven't identified an alleged accomplice in the robbery spree, but court records say he acted as a lookout in some of the robberies.\nA key break in the case came from one phone number with a north Georgia area code, court records show. An analysis of cell tower data found that the number showed up at or near jewelry stories in Georgia, Florida and South Carolina while the businesses were being robbed, authorities said.\nCourt records detail how authorities then used the phone number to identify Kemp as a suspect, and found a photo of a maroon Honda Civic on her social media accounts that matched the description of one seen in surveillance video.\nThe FBI also released images from surveillance video from the robberies, which led Kemp's friends to contact authorities, court records show. The images showed a female dressed in a jogging suit in one robbery and wearing a black cowboy hat in another.\n\"Within hours of issuing a press release this week requesting assistance in identifying the suspects, the FBI Jacksonville Division began to receive numerous credible leads from the public,\" the FBI said in a news release.\n\"Some citizens further advised that during recent contacts with Kemp, she was wearing expensive jewelry that some of the callers believe she cannot afford,\" the court affidavit said. \"Some citizens also advised that Kemp possesses a black handgun and recently had her car painted black.\"\nFederal court records do not list an attorney for Kemp. Her arrest comes amid an investigation of jewelry store robberies last year in Sevierville, Tennessee; Bluffton, South Carolina; Panama City Beach, Florida; and Dawsonville and Woodstock in Georgia, FBI spokeswoman Amanda Warford Videll confirmed to The Associated Press via email.\nThe latest robbery occurred recently in Mebane, North Carolina, Videll said.\nThe jewelry store hold-ups in Tennessee and North Carolina each netted more than $900,000, and a total of at least $2.2 million was taken in the string of crimes, court records show.\nThe female suspect seen in surveillance video from several of the robberies was armed with a handgun, ordered store employees into a back room, made them lay face-down and zip tied their hands, court records state.\nIn at least one of the robberies, in Panama City Beach, a male accomplice is seen on video removing the front door stop and letting the front door close while he remained outside of the store. The female suspect then removed about $400,000 in jewelry from the display cases, the affidavit states.","url":"https://www.dailymail.co.uk/wires/ap/article-3393872/Cell-number-social-media-led-FBI-robbery-suspect.html"}
