{"authors":["Stephen Mcgowan For Mailonline"],"date_download":"2018-10-23 03:11:45","date_modify":"2018-10-23 03:11:45","date_publish":"2016-01-29 17:59:26","description":"Celtic have agreed an 18-month loan deal with Man City for teenage star Patrick Roberts. Sportsmail first revealed Ronny Deila’s interest in the England youth player earlier this month.","filename":"data/vaneerConsumption/CelticandManchesterCityagree18monthloandealforyoungstarPatrickRoberts.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/3090835700000578-0-image-a-10_1454090357032.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3423215_Celtic-Manchester-City-agree-18-month-loan-deal-young-star-Patrick-Roberts_1540264305.html","title":"Celtic and Manchester City agree 18-month loan deal for young star Patrick Roberts","title_page":"Celtic and Manchester City agree 18-month loan deal for young star Patrick Roberts | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Celtic have agreed an 18-month loan deal with Manchester City for teenage star Patrick Roberts.\nSportsmail first revealed Ronny Deila’s interest in the £12million rated England youth player earlier this month.\nAnd Roberts is expected in Glasgow to watch Sunday’s League Cup semi-final clash with Ross County from the Hampden stands before completing a medical ahead of Monday’s deadline.\nPatrick Roberts is on the verge of completing an 18-month loan move to Celtic from Manchester City\nRoberts will travel to Glasgow to undergo a medical ahead of completing his loan switch\nInitially reluctant to send the former Fulham attacker north beyond the summer, City boss Manuel Pellegrini has relented on a quest to get Roberts first team football after a mere three outings this season.\nRonny Deila held firm in insisting a six-month deal made no sense to Celtic saying: ‘We will not take a player on loan to have him only until the summer – he would have to be something special.\n‘If it’s going to be for loans then it has to be longer than to the summer.’","url":"https://www.dailymail.co.uk/sport/football/article-3423215/Celtic-Manchester-City-agree-18-month-loan-deal-young-star-Patrick-Roberts.html"}
