{"authors":["Press Association"],"date_download":"2018-10-22 22:58:50","date_modify":"2018-10-22 22:58:50","date_publish":"2017-04-26 06:22:43","description":"Celtic midfielder Callum McGregor will be ready and waiting if Scotland boss Gordon Strachan names him in his squad for the crucial World Cup qualifier against England at Hampden Park in June.","filename":"data/vaneerConsumption/CelticstarCallumMcGregorwouldloveScotlandcallup.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/06/3F860A0E00000578-0-image-a-9_1493183974396.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4446338_Celtic-star-Callum-McGregor-love-Scotland-call-up_1540249130.html","title":"Celtic star Callum McGregor would love Scotland call-up","title_page":"Celtic star Callum McGregor would love Scotland call-up | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Celtic midfielder Callum McGregor will be ready and waiting if Scotland boss Gordon Strachan names him in his squad for the crucial World Cup qualifier against England at Hampden Park on June 10.\nHoops boss Brendan Rodgers recently claimed the 23-year-old's form for the Ladbrokes Premiership champions this season was worthy of an international call-up.\nMcGregor vindicated that praise with his performance and opening goal in Sunday's 2-0 William Hill Scottish Cup semi-final win over Rangers at Hampden.\nCallum McGregor (left) says he would drop everything to play for the Scotland national team\nMcGregor scored the opening goal as Celtic beat Rangers in Sunday's Scottish Cup semi-final\nThe former Scotland Under-21 player was called up by Strachan in 2014 for a European Championship qualifier against Germany but has yet to earn a full cap.\nHowever, he would be more than happy for a recall even if it means eating into his summer break.\n'If you get the call to play for your country, that takes priority over everything so I would be definitely be delighted if that came,' he said. 'It would be massive.\n'The Scotland v England game is a massive game so for me I just need to keep focused on what I am doing at Celtic and try and perform in some more big games and we will see what happens come the end of the season.'\nGordon Strachan is considering the Scotland team to take on England at Hampden on June 10\nMcGregor takes on Jason Holt of Rangers during Sunday's Cup semi-final in Glasgow\nScotland need to beat group leaders England to keep alive their World Cup hopes\nScotland WC fixtures June 10 England (H) September 1 Lithuania (A) September 4 Malta (H) October 5 Slovakia (H) October 8 Slovenia (A)\nMcGregor claimed his first-half goal at Hampden, where he skilfully guided the ball past Gers goalkeeper Wes Foderingham to set the Hoops on their way to a final meeting against Aberdeen at the national stadium next month, was the pinnacle of his Celtic career so far.\nHowever, despite Celtic's easy cup victory over their Old Firm rivals, he expects more of a threat to the Hoops' unbeaten domestic record this season at Ibrox on Saturday, when the two sides meet for the last time in this campaign.\nHe said: 'I think it will be a different game.\n'It is always harder at their place to get on the ball and play and especially after the result on Sunday, they will be up for it.\n'But again we need to look after our stuff and go there and hopefully get a positive result.'","url":"https://www.dailymail.co.uk/sport/football/article-4446338/Celtic-star-Callum-McGregor-love-Scotland-call-up.html"}
