{"authors":["Stephen Mcgowan For The Scottish Daily Mail"],"date_download":"2018-10-22 20:54:36","date_modify":"2018-10-22 20:54:36","date_publish":"2017-03-16 00:11:54","description":"Lee Congerton, a 43-year-old Welshman, replaces John Park at the Parkhead club after previously working with Celtic manager Brendan Rodgers during his time at Chelsea.","filename":"data/vaneerConsumption/CelticstransferguruLeeCongertonisthebestRodgers.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/3E4FCAA100000578-0-image-a-25_1489623096633.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4318410_Celtic-s-transfer-guru-Lee-Congerton-best-Rodgers_1540241676.html","title":"Celtic's transfer guru Lee Congerton is the best - Rodgers","title_page":"Celtic's transfer guru Lee Congerton is the best - Rodgers | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Brendan Rodgers has branded Celtic’s new head of recruitment Lee Congerton the best in the business.\nThe 43-year-old Welshman replaces John Park at the Parkhead club after previously working with Rodgers at Chelsea.\nWelcoming the new man to Parkhead, the Celtic boss said: ‘It is great news that we have been able to bring someone of Lee’s calibre to Celtic.\nBrendan Rodgers believes Lee Congerton is the best recruitment man in the business\n‘He brings knowledge, experience and excellence to such an important area of our work and I know he will add real value to the club.\n‘We will always strive to be the best in everything we do and, in Lee, we have brought the best to Celtic.’\nCongerton’s coaching career began at Wrexham after injury brought a premature end to his playing days at Crewe.\nIn 2002 he moved on to Liverpool where he worked in the Anfield club’s renowned academy.\nHe left there for Chelsea in 2005 before joining Hamburg as technical director alongside former Stamford Bridge colleague Frank Arnesen in 2011.\nCongerton took on the same role at Sunderland in 2014 but that job lasted just 18 months, ending after the departure of Dick Advocaat and the arrival of Sam Allardyce.\nLee Congerton (right) arrives at Parkhead after spells at clubs including German side Hamburg\n‘I know Brendan well,’ said Congerton after Celtic announced his appointment yesterday. ‘I know how he works and the quality he aims for.\n‘I am really looking forward to working with him again and Peter (Lawwell) to ensure that we continue to bring the very best to Celtic, and give our fans and players a team they will be proud of.\n‘It is a huge honour and I can’t wait to get started in making my contribution to such a fantastic institution.\n‘In recent years there has been some great work done at the club in the recruitment and development of some high-quality playing talent. I am really looking forward to adding my experience in this area and ensuring that we continue this high level of achievement.’\nCongerton (centre left) also spent 18 months at Sunderland between 2014 and 2015\nPark led a scouting set-up which uncovered the likes of Virgil van Dijk, Victor Wanyama and Moussa Dembele, but he left his role as head of football development in October last year, taking up a job with Vancouver Whitecaps.\nCeltic chief executive Peter Lawwell said: ‘Player recruitment is such a crucial function of the club and we are delighted to welcome Lee to Celtic to oversee this area.\n‘We are always looking to develop further, to drive the club forward and ensure that we continue our success in this area and deliver the best players we can to our supporters.\n‘Given the importance of this appointment we have gone through a thorough process and taken our time to identify the right person.\n‘Lee was the outstanding candidate for this position and we are sure he will deliver real impact and benefit to the club.’","url":"https://www.dailymail.co.uk/sport/football/article-4318410/Celtic-s-transfer-guru-Lee-Congerton-best-Rodgers.html"}
