{"authors":["Press Association"],"date_download":"2018-10-23 03:44:05","date_modify":"2018-10-23 03:44:05","date_publish":"2017-03-10 13:23:06","description":"Ahead of the service, fans lined the entrance to Celtic Park, allowing them to say their final farewells to the club legend.","filename":"data/vaneerConsumption/CelticfansbidfarewelltoLisbonLionTommyGemmellaheadoffuneralservice.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/16/wire-196815-1489161795-894_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4301234_Celtic-fans-bid-farewell-Lisbon-Lion-Tommy-Gemmell-ahead-funeral-service_1540266245.html","title":"Celtic fans bid farewell to Lisbon Lion Tommy Gemmell ahead of funeral service","title_page":"Celtic fans bid farewell to Lisbon Lion Tommy Gemmell ahead of funeral service | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tommy Gemmell made a poignant final journey past Parkhead as hundreds of fans turned out to pay their last respects to the Celtic giant, one of the Lisbon Lions.\nThe former Scotland left-back died at the age of 73 after a long illness, Celtic announced last week.\nThe Order of Service before the funeral of Tommy Gemmell\nHis funeral is being held at Daldowie Crematorium in Uddingston, South Lanarkshire.\nThe funeral cortege for Tommy Gemmell\nAhead of the service, fans lined the entrance to the Celtic Park ground as the funeral cortege made its way past.\nApplause rang out as the procession left the Parkhead stadium in the east end of Glasgow for the final time while a number of supporters threw Celtic scarves towards the funeral cars.\nA wreath of white flowers beside the coffin bore the emblem of the Lisbon Lions – the Celtic team whose victory over Inter Milan in the Portuguese capital in 1967 saw them become the first British club to win the European Cup.\nThe funeral cortege for Tommy Gemmell at Celtic Park\nWillie Henderson (left) and Lisbon Lion Bobby Lennox (centre) and among the pallbearers carrying the coffin of Tommy Gemmell\nThose attending the service included Celtic manager Brendan Rodgers and chief executive Peter Lawwell.\nLisbon Lions Bertie Auld, John Clark, Jim Craig and Bobby Lennox, along with former Rangers player Willie Henderson, helped carry the coffin in to Daldowie’s East Chapel.\nCurrent Celtic manager Brendan Rodgers (left) arrives at Celtic Park, Glasgow before the funeral cortege for Tommy Gemmell\nFans wait outside Celtic Park in Glasgow ahead of the funeral of Tommy Gemmell.\nFormer Hoops players Danny McGrain, John Hughes, Dixie Deans, Frank McGarvey, Davie Provan, and Andy Walker were also among the mourners.\nEddie Gray, who played for Leeds United and was a former Scotland team-mate of Gemmell’s, was also present.\nRangers managing director Stewart Robertson and administration chief Andrew Dickson attended on behalf of the club.","url":"https://www.dailymail.co.uk/wires/pa/article-4301234/Celtic-fans-bid-farewell-Lisbon-Lion-Tommy-Gemmell-ahead-funeral-service.html"}
