{"authors":["Stephen Mcgowan For Mailonline"],"date_download":"2018-10-22 20:16:43","date_modify":"2018-10-22 20:16:43","date_publish":"2016-01-29 00:59:03","description":"Celtic will only sign Manchester City winger Patrick Roberts if a long-term loan deal is on offer. The Premier League club are willing to lend their £12million signing until the summer.","filename":"data/vaneerConsumption/CeltichappytotakePatrickRobertsonloanfromManchesterCitybutonlyifthewingercanstayinScotlandmorethansixmonths.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/00/308B7D7C00000578-0-image-a-19_1454028800106.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422012_Celtic-happy-Patrick-Roberts-loan-Manchester-City-winger-stay-Scotland-six-months_1540239403.html","title":"Celtic happy to take Patrick Roberts on loan from Manchester City - but only if the winger can stay in Scotland more than six months","title_page":"Celtic happy to take Patrick Roberts on loan from Manchester City - but only if the winger can stay in Scotland more than six months | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Celtic want him for a year but City will only loan him for six months\nThey are now eyeing 18-year-old winger Patrick Roberts from the club\nRonny Deila insists Celtic will only sign Manchester City winger Patrick Roberts if a long-term loan deal is on offer.\nThe English Premier League club are willing to lend their £12million signing from Fulham until the summer. But Deila says Celtic are only interested in a 12 or 18-month agreement.\nConceding there is little point in signing the 18-year-old unless he is available for Champions League qualifiers in July, the Parkhead boss said: ‘Again this is a name which is coming up. We will comment on things when it is done. We will see what is happening on Monday.\nRonny Deila insists Celtic will only sign Manchester City winger Patrick Roberts in a long-term loan deal\nCity are willing to send Roberts on loan to Celtic but only until the end of the Scottish Premiership season\n‘But we will not take a player on loan to have him only until the summer - he would have to be something special. If it’s going to be loans then it has to be longer than just to the summer.’\nAs Sportsmail reported on Monday, Celtic want Roberts for a year or longer. Admitting that is under discussion, Deila added: ‘It could be both … that’s longer than a half season.\n‘If not, there is not anything to think about. We have a lot of players. We have to think: “Is it somebody who can make a difference into next season as well?”\nCeltic used their relationship with City scouting chief Fergal Harkin to take Jason Denayer and John Guidetti on loan last season.\nDeila was desperate to keep defender Denayer, but was unable to persuade him to stay – forcing him to plunge Dedryck Boyata, another signing from City, in for an unsuccessful Champions League qualifying campaign.\nAddressing concerns that Celtic risk becoming a finishing school for Manchester City prospects, Deila defended the signing policy.\n‘It’s a relationship,’ he said. ‘A relationship that I have had for many years, since Stromsgodset. We trust each other in the way we have developed players for them. And if they can bring quality into our squad like Jason did and Guidetti as well then it’s positive for both of us.\n‘Now we know that, if we’re going to do things like that, we have to have an arrangement that is over the summer and for a longer period.’\nAnswering concerns amongst supporters that such deals benefit City and the players more than they benefit Celtic, Deila added: ‘If that is the case it will not happen, you have my word on that.\n‘If it happens, then there has to be something special we need at that time, to the summer, or else it’s going to be a longer loan.’\nReports in Norway, meanwhile, suggest Celtic have been quoted £800,000 to sign young Start prospect Kristoffer Ajer.\nCeltic have brought in a number of players from City under Ronny Deila, such as striker John Guidetti (above)\nDefender Jason Denayer (pictured) was also at Celtic from City, spending all of last season at the club\nThe 17-year-old midfielder was in Glasgow on trial and, asked if negotiations had begun to sign the player this transfer window, Deila said: ‘We will see what’s happening. He made a good impression, we will see, but again that’s something for the future. It’s not something that would make a big difference in the next half year.’\nClaiming there have been no further enquiries for his players, Deila is turning his attention towards Sunday’s League Cup semi-final clash with Ross County.","url":"https://www.dailymail.co.uk/sport/football/article-3422012/Celtic-happy-Patrick-Roberts-loan-Manchester-City-winger-stay-Scotland-six-months.html"}
