{"authors":["Mark Wilson For The Scottish Daily Mail"],"date_download":"2018-10-22 22:07:07","date_modify":"2018-10-22 22:07:07","date_publish":"2017-03-10 00:17:43","description":"Brendan Rodgers heard all the talk in his early days at Celtic. He saw quotes in the newspapers, hashtags online and a card display at Ibrox. Going for 55 was the message emanating from Rangers.","filename":"data/vaneerConsumption/CelticsBrendanRodgerstakesdigatRangerspropaganda.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1B060800000578-0-image-a-126_1489105001221.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4299536_Celtic-s-Brendan-Rodgers-takes-dig-Rangers-propaganda_1540246027.html","title":"Celtic's Brendan Rodgers takes dig at Rangers' propaganda","title_page":"Celtic's Brendan Rodgers takes dig at Rangers' propaganda | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Brendan Rodgers heard all the talk in his early days at Celtic. He saw quotes in the newspapers, hashtags online and a card display at Ibrox. Going for 55 was the message emanating from Rangers.\nReflecting on it on Thursday, Rodgers used the word ‘propaganda’ to describe the promotion of the title hopes harboured on the opposite side of the Old Firm.\nAn interesting choice. Certainly, the words around Rangers weren’t backed up by any substantial actions.\nBrendan Rodgers has taken aim at the 'propaganda' he felt Rangers dealt out in the summer\nRodgers has led Celtic to within touching distance of the title ahead of this weekend's derby\nWith relentless ruthlessness, Rodgers’ side have created a 33-point lead over their Glasgow rivals after 27 Premiership games.\nA fourth derby victory of the season on Sunday would now officially end any arithmetic participation by the Ibrox club in the title race, if it can even be described as such.\n‘They obviously thought they could win the league,’ said Rodgers. ‘Let’s be clear that when I came up here - after the Scottish Cup semi-final game and their promotion - all the propaganda before a ball was kicked was that before the end of the season they’d be going for 55.\n‘So, they obviously had the genuine feeling that they could win the league. But we’ve just done our work, quietly prepared the team, players’ development and improvement and it’s taken us to this point.\n‘In terms of these games, I don’t think it matters if it’s zero points, one point or 33 points of a gap.\n‘You’re playing for pride, you’re defending the culture of your club. We know that if we win the game, that eliminates Rangers out of it totally, but it doesn’t really matter. We want to continue with our focus on winning games and we’ll continue with that.’\nRodgers' Celtic are a whopping 27 points clear at the top of the Scottish Premiership\nAsked if he felt there had been too much chat about what might happen coming from Ibrox, Rodgers was reluctant to point an accusatory finger.\n‘Not so much,’ he replied. ‘I just think that was the message that was out there, from them and from you guys (in the media).\n‘It’s pretty clear that was the message but all you can do as a team is your own work and our players have been brilliant at that.\n‘I wasn’t surprised that message was out there because I was new into it and I had no thought for it either way.’\nSaturday, September 10 was the date when the ‘Going for 55’ phrase was quietly dropped. Any pretence that Rangers might offer a genuine threat was wiped away in 5-1 rout at Parkhead.\nMoussa Dembele, on Thursday named Ladbrokes Premiership Player of the Month for February, made history as the first Celtic player to claim a hat-trick in the fixture since 1973.\nDembele has scored in his side’s subsequent two Old Firm wins and will again be waiting for Rangers this weekend.\nRodgers feels a side still under the temporary management of Graeme Murty will also encounter a stronger, more cohesive force than on their last visit.\n‘I think there’s been quite a bit of improvement - and improvements still to come, of course,’ he said.\nMoussa Dembele was named the Scottish Premiership player of the month on Thursday\n‘That was early September and we weren’t at the level then that we are now. The beauty of the team and how it’s evolved and developed is that, if you see it now, it can play virtually in any type of game.\n‘In a footballing game we have been dynamic and fast and scored goals, defended well, and when we’ve had to battle and fight in some of the games we’ve done that and come through it.\n‘When we’ve played teams that sat off deep we’ve found a way to play around it and get a result.\n‘When the spaces are there we have speed and power. So the dynamic in the team is good.\n‘And when we’re not playing at our best we can still find a way to get the result. The notion of the team and the idea of the team is in a much better place and they have confidence in how they’re working.’\nRodgers believes Rangers thought they would get a lot closer to a title challenge\nThe fact Rangers are available at 8/1 with bookmakers says it all about expectations for the weekend result.\nEarlier this week, ex-Celtic striker Frank McAvennie even made the rather outlandish claim that his old club could score a record eight goals in the fixture.\nRodgers, though, is utterly dismissive of the perception that he simply needs to put 11 players on the pitch to claim victory.\nSeason at a glance Live tables\nFixtures\nScores Scottish Premiership\nPremier League\nChampionship\nLeague One\nLeague Two\nScottish Premiership\nScottish Div 1\nScottish Div 2\nScottish Div 3\nLigue 1\nSerie A\nLa Liga\nBundesliga\n‘It is not the real world,’ he insisted. ‘We want to do well and go out and get the result as we have done for the three games that we have played. So we will be fighting and pushing to get the win. It is never easy – except in theory. It is never easy on the field.\n‘I am motivated to win the game. Listen, we could play really well and luck goes against us.\n‘But our thought is always in the set-up to go out and win.\n‘You can never predict or forecast, all you can do is go in with the right mindset and hopefully you can play well and win the game.’\nRodgers admits he is in the dark about incoming Rangers manager Pedro Caixinha, set to formally take control after Sunday. He is far more familiar with stand-in Murty, who was promoted from leading the Under-20s after Mark Warburton’s contentious exit.\nGraeme Murty will take charge of his final game as Rangers interim manager this weekend\n‘I was a coach at Reading when Tommy (Burns) brought Graeme in and it was unfortunate he didn’t play a lot for Tommy,’ recalled Rodgers. ‘But when Tommy left he came into the team and did very well.\n‘I’m sure he’ll be looking forward to it. When you’re working with young players and you get the chance to step up, of course it’s tough because of the focus in and around the job. You are also maybe looking after it for someone else to come in, but for Graeme’s own development it will prove invaluable for him.\n‘It’s a sensible approach when he says he is still thinking about whether he wants to be a manager in the future.\n‘Enjoy it, work it, feel the pressures, see what it’s like. I always say that when you become a manager it’s welcome to the land of no sleep, because it’s a different sport altogether. But whatever happens for him he’ll be a better coach for it.’","url":"https://www.dailymail.co.uk/sport/football/article-4299536/Celtic-s-Brendan-Rodgers-takes-dig-Rangers-propaganda.html"}
