{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:07:36","date_modify":"2018-10-30 21:07:36","date_publish":"2016-08-11 20:36:36","description":"Scotland Celtic soccer team fans are planning to stage a protest against “rogue Apartheid state” Israel when they meet Hapoel Beersheba.","filename":"data/vaneerConsumption/CelticFansCallToProtestRogueApartheidIsraelWithPalestinianFlags.json","image_url":"https://media.breitbart.com/media/2016/08/Celtic-supporters-and-demonstrators-show-support-for-Palestinians-at-the-match-between-Hapoel-Tel-Aviv.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_08_11__1540933656.html","title":"Celtic Fans Call To Protest 'Rogue, Apartheid' Israel With Palestinian Flags","title_page":"Celtic Fans Call To Protest 'Rogue, Apartheid' Israel With Palestinian Flags","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Scotland Celtic soccer team fans are planning to stage a protest against “rogue Apartheid state” Israel when their side takes on Israeli team Hapoel Beersheba next week in a crucial Champions League playoff.\nCeltic fans are waiting to greet the Israeli team and its fans at Celtic Park for next Wednesday’s match with Palestinian flags.\nA Facebook page entitled “Fly the flag for Palestine, for Celtic, for Justice,” has already attracted 837 users. The page was set up by a group calling themselves Celtic Fans for Palestine.\nThe group claims that the UEFA European soccer governing body should ban Israeli teams from participating in the competition “due to the system of apartheid laws and practices including religious- and ethnic-based colonization, military occupation, and segregation of what remains of Palestinian land and over 90 laws which discriminate against indigenous Palestinians who make up 20 percent of the population of current-day Israel.”\nThey said they will hand out Palestinian flags at the entrance to Celtic Way.\n“When someone is representing Israeli state institutions it is sadly never merely a game; football, UEFA, and Celtic FC are being used to whitewash Israel’s true nature and give this rogue state an air of normality and acceptance it should not and cannot enjoy until it’s impunity ends and it is answerable to international law and faces sanctions for the countless UN resolutions it had breached,” the Facebook page states.\nThe Celtic group affiliates itself with the Boycott, Divestment, and Sanctions (BDS) movement which it praises as being “inspiring and unstoppable.” It called on Celtic fans to exercise their “democratic rights to display our opposition to Israeli apartheid, settler colonialism, and countless massacres of the Palestinian people.”\nTwo years ago, Celtic was fined by UEFA when fans waved Palestinian flags at a game against Iceland’s KR Reykjavik, basing the measure on its rule that any political, ideological, and religious messages are unsuitable for sports events.\nHapoel Beersheba’s spokesperson declined to comment on the matter.\nMeanwhile, the UK’s Jewish News reported that police are investigating Daniel Yahia, an Edinburgh University student, for posting anti-Semitic slurs on Facebook about Celtic’s Israeli midfielder Nir Bitton. See below:\nYahia wrote: “Zionists are subhuman and Nir Bitton is a filthy, Zionist rat.\n“Get him as far to f** from our club as possible.\n“If you’re gonna wave your Palestinian flag, don’t be a hypocrite and demand this b****** takes his place on the team.”\nHe added: “Only place he should be an ever-present is a jail cell for supporting the apartheid regime. C**t.”\nYahia was delegated to the National Union of Students but has not taken up his post.\nAn NUS spokesperson said: “These are utterly contemptible comments, which have absolutely no place in either the student movement or wider society.”\nYahia defended his remarks, saying “Zionism is the practice of genocide in Palestine. If you’ve never been to Gaza, I suggest you go. … I have no problems with Jews or Israelis, just Zionists.”\nHe also described Israeli Prime Minister Benjamin Netanyahu as a “war criminal” and called Israel an “apartheid” state.","url":"https://www.breitbart.com/middle-east/2016/08/11/celtic-fans-call-to-protest-rogue-apartheid-israel-with-palestinian-flags/"}
