{"authors":["Associated Press"],"date_download":"2018-10-23 00:05:15","date_modify":"2018-10-23 00:05:15","date_publish":"2017-03-10 05:44:07","description":"BEIJING (AP) - China's central bank governor said Friday the country needs to get soaring corporate debt under control but its economy and currency are...","filename":"data/vaneerConsumption/CentralbankerChinasdebttoohighmustbecontrolled.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/09/wire-195049-1489137252-598_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300032_Chinas-central-banker-says-debt-high_1540253115.html","title":"Central banker: China's debt 'too high,' must be controlled","title_page":"Central banker: China's debt 'too high,' must be controlled | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BEIJING (AP) - China's central bank governor said Friday the country needs to get soaring corporate debt under control but its economy and currency are stable and the decline in its foreign exchange reserves is no cause for concern.\nZhou Xiaochuan's comments at a news conference held during China's national legislature follows warnings a rapid rise in debt could lead to financial trouble. Beijing is trying to reduce reliance on credit and to clear away debts of state companies but private sector analysts say it needs to move faster.\n\"The leverage of non-financial enterprises in the whole society is too high,\" said Zhou. \"First of all, (debt levels of) every business, especially those with leverage that already is too high, have to be controlled.\"\nZhou Xiaochuan, governor of the People's Bank of China, listens to a reporter's question during a press conference held on the sidelines of the annual meeting of China's National People's Congress in Beijing, Friday, March 10, 2017. (AP Photo/Mark Schiefelbein)\nZhou gave no indication he foresaw a financial crisis. But his chief deputy, sitting beside Zhou, echoed warnings by private sector analysts that debt could drag on economic growth or threaten financial stability.\n\"The continued increase of leverage is not conducive to the sustainable development of the economy and accumulates certain risks,\" said Yi Gang.\nChina has relied on repeated infusions of credit to support growth in the world's second-largest economy since the 2008 financial crisis. That has boosted its total debt from the equivalent of about 150 percent of annual economic output pre-crisis to more than 260 percent today.\nThe country's top economic official, Premier Li Keqiang, called for attention to debt in a speech to the legislature Sunday but said the financial system is healthy.\nZhou also tried to quiet financial market concerns about the outlook for China's currency, the yuan.\nExpectations the yuan would be allowed to weaken against the dollar prompted an outflow of money starting in late 2015, which led Beijing to tighten controls on capital movement. That has prompted concern Chinese acquisitions abroad might be hampered if buyers cannot move money out of the country.\n\"We believe this year the Chinese economy will be relatively stable,\" Zhou said. \"Under such circumstances, this year's exchange rate should be relatively stable.\"\nThe central bank plans no major policy changes but regulation will be \"more meticulous,\" said Zhou.\nZhou also tried to dispel concern about the decline in China's multitrillion-dollar foreign reserves to just over $3 trillion in February from a peak of nearly $4 trillion in 2014.\nThe central bank spent reserves to prop up the yuan's exchange rate.\n\"The decline in the foreign exchange reserves is also a normal phenomenon, because we did not originally want so much,\" said Zhou. \"So an appropriate decline is not something bad.\"\nZhou defended the investment controls as a curb on purchases of assets that are \"unsuited to the industrial policy needs of the country.\" He cited sports, entertainment and other areas where Chinese investors have been spending heavily.\n\"These have not much benefit to China,\" he said. \"So we consider a certain degree of policy guidance necessary and effective.\"\nZhou Xiaochuan, governor of the People's Bank of China, gestures while speaking during a press conference held on the sidelines of the annual meeting of China's National People's Congress in Beijing, Friday, March 10, 2017. (AP Photo/Mark Schiefelbein)\nA woman walks past the headquarters of the People's Bank of China in Beijing, Friday, March 10, 2017. (AP Photo/Mark Schiefelbein)\nA pair of Chinese paramilitary policemen walk past the headquarters of the People's Bank of China in Beijing, Friday, March 10, 2017. (AP Photo/Mark Schiefelbein)","url":"https://www.dailymail.co.uk/wires/ap/article-4300032/Chinas-central-banker-says-debt-high.html"}
