{"authors":["Associated Press"],"date_download":"2018-10-23 04:47:27","date_modify":"2018-10-23 04:47:27","date_publish":"2016-01-28 20:48:47","description":"SALINAS, Calif. (AP) — A central California elementary school will no longer be named after a man considered by some to be a rogue robber and murderer. Alisa...","filename":"data/vaneerConsumption/CentralCaliforniaschoolnamedafterbanditchangesname.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421668_Central-California-school-named-bandit-changes-name_1540270047.html","title":"Central California school named after bandit changes name","title_page":"Central California school named after bandit changes name | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Central California school named after bandit changes name\nSALINAS, Calif. (AP) — A central California elementary school will no longer be named after a man considered by some to be a rogue robber and murderer.\nAlisal Union School District officials voted Wednesday to change the name of Tiburcio Vasquez Elementary to Monte Bella Elementary, according to news station KSBW (http://bit.ly/1Se9MMc).\nThe debate has roiled the community since 2012, when the school board named the school after one of the state's most notorious Old West bandidos.\nSome call Vasquez a revolutionary who defended his land and the Spanish-speaking community from greedy white settlers. Others say he was a 19th century outlaw who terrorized Californians before he was convicted and hanged for murder.\n\"Tiburcio Vasquez, depending on who you ask, he was either a man of the people or a straight-up criminal. We do know he was convicted of murder, and he was hung for his crime,\" said Alisal Union School District spokesman Marcos Cabrera.\nAurelio Salazar Jr., a member of the committee assigned with exploring a name change, said that naming a social justice center after Vasquez might be appropriate, but not an elementary school.\nSalinas is an agricultural city along the central coast and birthplace of writer John Steinbeck. It's about 100 miles south of San Francisco.\nThe Alisal neighborhood is predominantly home to Mexican farmworker families who work in the Salinas Valley, an area known as \"the Salad Bowl of the World.\"\nThe school district enrolls about 9,000 students.","url":"https://www.dailymail.co.uk/wires/ap/article-3421668/Central-California-school-named-bandit-changes-name.html"}
