{"authors":["Jaime Dunaway"],"date_download":"2018-10-30 14:38:14","date_modify":"2018-10-30 14:38:14","date_publish":"2018-09-07 00:00:00","description":"Authorities arrested a Arkansas man who is accused of attacking and abandoning his wife on the interstate after she confronted him about text messages from another woman, according to a report.","filename":"data/vaneerConsumption/CentralArkansasmanaccusedofabandoningwifeonI40afterbeingconfrontedabouttextsfromanotherwoman.json","image_url":"https://media.arkansasonline.com/img/photos/2018/09/07/Screen_Shot_2018-09-07_at_11.46.20_AM_t600.png?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_sep_07__1540910294.html","title":"Central Arkansas man accused of abandoning wife on I-40 after being confronted about texts from another woman","title_page":"Central Arkansas man accused of abandoning wife on I-40 after being confronted about texts from another woman","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Authorities on Wednesday arrested a central Arkansas man who is accused of attacking and abandoning his wife on the interstate after she confronted him about text messages from another woman, according to a report.\nThe victim told police her husband, identified as 51-year-old Brian Bell of Cabot, attacked her shortly before 3:30 p.m. while he was driving east on Interstate 40 in North Little Rock.\nWhile sitting in the passenger's seat, Bell's wife took his phone and confronted him about messages from a woman, the report states. She told police that he then grabbed the phone out of her hand and threw it in the back seat.\nOfficers wrote that the woman climbed into the back and continued reading the messages, at which point the driver pulled over on the side of the road and dragged her out of the vehicle in a headlock.\nOnce out of the vehicle, Bell continued to hold his wife by the neck and right arm as he reached for the phone, according to the report. Authorities noted that the victim had red marks on her neck and cuts and bruises on her right arm.\nPolice said the woman was able to break free, and then Bell got in the vehicle and drove away.\nThe 51-year-old was arrested and taken to the Pulaski County jail on charges of third-degree domestic battery. He did not appear on the jail's online inmate roster as of Friday morning.","url":"https://www.arkansasonline.com/news/2018/sep/07/confronted-text-messages-another-woman-arkansas-ma/"}
