{"authors":["Lucas Nolan"],"date_download":"2018-10-30 21:34:29","date_modify":"2018-10-30 21:34:29","date_publish":"2017-03-30 22:09:05","description":"The CEO of Yum Brands, Greg Creed, recently told CNBC he believes the majority of fast food jobs will by automated by robots within the next ten years.","filename":"data/vaneerConsumption/CEOofCompanyThatOwnsKFCTacoBellBelievesRobotsWillWorkMostFastFoodJobsWithin10Years.json","image_url":"https://media.breitbart.com/media/2016/12/wi/ap/29/18mcu5t-e1490911735636.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2017_03_30__1540935269.html","title":"CEO of Company That Owns KFC, Taco Bell Believes Robots Will Work Most Fast Food Jobs Within 10 Years","title_page":"CEO of Company That Owns KFC, Taco Bell Believes Robots Will Work Most Fast Food Jobs Within 10 Years | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The CEO of Yum Brands, Greg Creed, recently told CNBC he believes the majority of fast food jobs will by automated by robots within the next ten years.\nWhile some fast food restaurants such as McDonald’s have already begun automating parts of their food ordering process with the introduction of electronic ordering kiosks, Yum Brands CEO Greg Creed believes that soon robots will play an even larger role in the fast food business within the next 10-15 years.\nThe CEO of Yum Brands — which owns several fast food chains such as KFC, Pizza Hut, and Taco Bell — stated in an interview with CNBC, “I think it’s gonna happen. We’ll see a dramatic change in how machines run things.” According to Creed, restaurants owned by Yum Brands have already begun introducing automated kiosks in their locations in Shanghai, China, and in one Pizza Hut customers are even greeted by a robot.\nHowever, Creed doesn’t believe that the fast food process will be entirely robot driven. “We don’t make a lot of things until customers order,” Creed said. “I’m not sure we’re going to have robots replace people.” Creed believes that changes in technology may lead to less work in the future but “I don’t see it changing people’s jobs in the short term.”\nRobot delivery drivers are already becoming a reality as companies such as UPS and Postmates test the delivery of packages and takeout food with the aid of drones. Dominos successfully delivered a pizza via drone in New Zealand last year while Chipotle partnered with Alphabet to deliver burritos via drone.","url":"https://www.breitbart.com/tech/2017/03/30/ceo-of-company-that-owns-kfc-taco-bell-believes-robots-will-work-most-fast-food-jobs-within-10-years/"}
