{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 20:34:53","date_modify":"2018-10-30 20:34:53","date_publish":"2016-12-29 00:00:00","description":null,"filename":"data/vaneerConsumption/CFPBChallengesCouldSpellTroubleforUSFintech.json","image_url":"https://amp.businessinsider.com/images/5846e777ba6eb66d268b77cd-640-320.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_cfpb-challenges-could-spell-trouble-for-us-fintech-2016-12_1540931693.html","title":"CFPB Challenges Could Spell Trouble for US Fintech","title_page":"    CFPB Challenges Could Spell Trouble for US Fintech - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BII This story was delivered to BI Intelligence \"Fintech Briefing\" subscribers. To learn more and subscribe, please click here.\nThe US Consumer Finance Protection Bureau (CFPB) is an active supporter of fintech and more specific fintech regulation via its Project Catalyst initiative, but its ability to continue in this role is in question as it faces an increasing number of challenges.\nThe agency has been hit hard by critics of late, and President-elect Trump's transition team is investigating the CFPB's recent performance, according to the Wall Street Journal. At the same time, it remains embroiled in a legal battle over whether its organizational structure is constitutional. If the CFPB is unable to untangle itself from these issues, it could negatively impact its fintech initiatives — and the US fintech industry more broadly.\nThe new administration wants to see its powers reduced. Measures have already been proposed by prominent Republicans that would reduce the CFPB's independence, which include giving Congress control over the agency's budget, according to the WSJ. Any reduction in autonomy would reduce the CFPB's ability to pursue its own initiatives, including its drive to promote fintech. The loss of the CFPB as a champion for fintech would likely be a major blow to the industry.\nMeasures have already been proposed by prominent Republicans that would reduce the CFPB's independence, which include giving Congress control over the agency's budget, according to the WSJ. Any reduction in autonomy would reduce the CFPB's ability to pursue its own initiatives, including its drive to promote fintech. The loss of the CFPB as a champion for fintech would likely be a major blow to the industry. The legal battle regarding its leadership continues. Richard Cordray, the head of the CFPB, has proved a somewhat divisive figure, largely due to the agency's aggressive use of new regulation to target financial practices deemed detrimental to consumers under his leadership. In 2016, the CFPB introduced stricter rules for both prepaid cards and payday loans, for example. Dislike of Cordray's methods is likely a major factor in the legal proceedings that the agency's opponents brought against it earlier this year. The proceedings aim to alter the structure of the CFPB to enable the president to remove its chief at will. While judges took the opponents' side in October, the CFPB's appeal of their decision was upheld last week, and the case will now be referred to a larger panel of lawmakers, according to the WSJ. Any change in leadership would likely result in a loss of momentum for non-vital initiatives, including Project Catalyst.","url":"https://www.businessinsider.com/cfpb-challenges-could-spell-trouble-for-us-fintech-2016-12"}
