{"authors":["Sarah Jones For Dailymail.Com"],"date_download":"2018-10-22 23:25:58","date_modify":"2018-10-22 23:25:58","date_publish":"2017-03-16 06:54:16","description":"The 35-year-old former One Tree Hill actor was back to work on Wednesday as he departed the Los Angeles airport and headed to New York to promote his CMT series.","filename":"data/vaneerConsumption/ChadMichaelMurrayalmostnudeinSunRecordsclip.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/06/3E524AA600000578-0-image-a-106_1489647246997.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318984_Chad-Michael-Murray-goes-nearly-nude-Sun-Records-clip_1540250758.html","title":"Chad Michael Murray almost nude in Sun Records clip","title_page":"Chad Michael Murray almost nude in Sun Records clip | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Chad Michael Murray welcomed his newborn baby daughter with wife Sarah Roemer just days earlier.\nBut the 35-year-old actor was back to work on Wednesday as he departed from the LAX airport and headed to New York to promote his new CMT series Sun Records.\nAnd the former One Tree Hill star is sure to make jaws drop in a newly released sneak peek by Just Jared as he nearly bares it all in a nude scene.\nScroll down for video\nSexy scene: Chad Michael Murray nearly bared it all in a nude clip for his CMT series Sun Records\nThe Agent Carter alum barely covers up as he holds a small bath towel over his genitals.\nChad, who plays Sam Phillips in the TV drama series, showcases his sculpted abs in the racy scene.\nHe confidently struts his stuff through the living room of his home where his wife, Becky Phillips, played by Jennifer Holland, is being informed of the town gossip being spread about him by Nadine McCluskey, played by Lucy Catharine Haskill.\nA-list abs! Chad, who plays Sam Phillips in the TV drama series, showcases his sculpted abs in the racy scene\n'Always a pleasure seeing you': He confidently struts his stuff through the living room of his home as Nadine McCluskey, played by Lucy Catharine Haskill, is left in shock\n'Always a pleasure seeing you Nadine,' he says while giving her a wink after hearing the red-head spreading rumors about him.\nThe award-winning actor headed to New York to discuss the new series, which premiered last month, on Live With Kelly, Buzzfeed and the AOL Build Series.\nMeanwhile, the doting dad took to Instagram on Monday to share the exciting news as he welcomed his first daughter, and second child with his wife of two years.\nPromotional tour: Meanwhile the former One Tree Hill star headed to New York to discuss the new series, which premiered last month, on Live With Kelly, Buzzfeed and the AOL Build Series\nIn a heartwarming snapshot, Chad's daughter's tiny hand can be seen wrapped tightly around one of his fingers.\n'Don't worry little girl you can hold on as tight as you want for as long as you want, I'm already yours & I'll never let go,' he captioned the beautiful image.\n'I've now two incredible women in my life. My son & I are two lucky guys.'\nOn the road again: The award-winning actor departed LAX airport on Wednesday just days after the birth of his newborn baby daughter\nLaid-back look: The father-of-two opted for comfort in black trousers with a brown tee, dark aviator shades and a black baseball cap\nThe couple are already parents to a two-year-old son, after marrying in 2015.\nSpeaking about fatherhood, the actor said becoming a dad was by far the best thing that had ever happened to him.\n'Having a family just changes your perspective on everything,' he told ET last year. 'I mean, it's a world changer.'\nHe says it's made him a better person, too.\n'For me, it was the greatest thing that's ever happened to me,' added. 'Having kids is a game changer and I think you're always walking around with the mentality that you want to make sure that they're proud and you want to represent them well and just be a great leader.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318984/Chad-Michael-Murray-goes-nearly-nude-Sun-Records-clip.html"}
