{"authors":["Neil Munro"],"date_download":"2018-10-30 19:10:43","date_modify":"2018-10-30 19:10:43","date_publish":"2017-02-01 08:23:14","description":"Staff at the House’s immigration committee helped draft President Donald Trump’s new immigration and refugee reform policies.","filename":"data/vaneerConsumption/ChairmanGoodlatteBoostsTrumpsProAmericanMigrationReform.json","image_url":"https://media.breitbart.com/media/2017/01/AP_962845789481.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_02_01__1540926643.html","title":"Chairman Goodlatte Boosts Trump's Pro-American Migration Reform","title_page":"Chairman Goodlatte Boosts Trump's Pro-American Migration Reform","title_rss":"NULL","source_domain":"breitbart.com","text":"Staff at the House’s immigration committee helped draft President Donald Trump’s new immigration and refugee reform policies, says Rep. Bob Goodlatte, the chairman of the House Judiciary Committee.\n“My staff on the House Judiciary Committee are some of the best … They are experts in their respective fields and I proudly allowed them to provide their expertise to the Trump transition team on immigration law,” Goodlatte said on Jan. 31. The House’s immigration subcommittee is under Goodlatte’s judiciary committee.\nGoodlatte is a former immigration lawyer who has seen his GOP-leaning state of Virginia gradually transformed into a Democratic-leaning state. That transformation came as the federal government encouraged a steady flow of immigrants, wage-cutting foreign contract workers and government employees into the northern parts of the state.\nGoodlatte’s statement of support for Trump’s reforms are a counter to protests from Democrats and their allied Islamic groups.\nThey’re protesting because Trump’s reform sets short-term curbs on refugee inflows and long-term policy priorities on immigration. The priorities reverse President Barack Obama’s support for global migration, and instead reassert long-standing and popular rules excluding migrants who don’t embrace Americans culture and laws.\nHere is the critical passage from Trump’s Friday order:\nIn order to protect Americans, the United States must ensure that those admitted to this country do not bear hostile attitudes toward it and its founding principles. The United States cannot, and should not, admit those who do not support the Constitution, or those who would place violent ideologies over American law. In addition, the United States should not admit those who engage in acts of bigotry or hatred (including “honor” killings, other forms of violence against women, or the persecution of those who practice religions different from their own) or those who would oppress Americans of any race, gender, or sexual orientation.\nGoodlatte shielded his staff from the Democrats’ backlash.\nTo be clear, while they gave advice to the new Administration, they did not have decision making authority on the policy. The final decision was made at the highest levels of the Trump Administration, and I support the President’s executive order. My staff had no control of the language contained in the President’s executive order, the timing of the announcement, the rollout and subsequent implementation, and the coordination with Congress. I am proud of my staff—they are an asset to me, Congress, and the American people.\nGoodlatte is expected to play a prominent role this year as Congress develops new immigration policies which reconcile the voters’ support for Trump’s “Hire American, Buy American” policies, and business demands for imported cheap labor and imported welfare-aided immigrant consumers.","url":"https://www.breitbart.com/politics/2017/02/01/goodlatte-champions-staff-trump-immigration-reform/"}
