{"authors":["Daisy Dunne For Mailonline"],"date_download":"2018-10-23 04:43:17","date_modify":"2018-10-23 04:43:17","date_publish":"2017-04-26 16:16:40","description":"The wannabe inventors are students at the Georgia Institute of Technology in Atlanta. The children's tricycle is powered by a 33c chainsaw engine with a modified clutch.","filename":"data/vaneerConsumption/ChainsawpoweredtricycleisbuiltbyGeorgiaTechstudent.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/14/3F9F594400000578-0-image-a-66_1493212453995.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4447336_Chainsaw-powered-tricycle-built-Georgia-Tech-student_1540269797.html","title":"Chainsaw-powered tricycle is built by Georgia Tech student","title_page":"Chainsaw-powered tricycle is built by Georgia Tech student | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A student has found a novel way to ensure he's never late for class again after attaching a chainsaw to a child's tricycle.\nFootage shows the innovative student drive down a main road on his unique motorised trike.\nOnlookers watch in awe as the tiny vehicle speeds by, with a 33cc chainsaw motor powering the children's toy.\nHOW THE CHAINSAW TRIKE WAS MADE The video shows the students testing the children's Radio Flyer tricycle, powered by a 33c chainsaw engine retrofitted with a modified clutch. 'Last October, I was at a thrift shop and saw a small chainsaw for a great price, and promptly bought it with plans to eventually attach it to something,' said Trenton. 'The trike is modified to accept a sturdier rear axle,' said Dustin Sloan, a student from the Georgia Institute of Technology. The saw of the chainsaw was removed and replaced with a welded-on sprocket. 'On the first test of the trike, we tried to use the original rear wheels,' said Dustin. 'They quickly failed as the spokes bent and broke. 'This meant getting new Colson wheels and machining new hubs to attach them to the rear axle.'\nThe chainsaw tricycle was created by Dustin Sloan, 21, from Millbrook, New York and Trenton Charlson, 19, from Oconomowoc, Wisconsin.\nThe wannabe inventors are students at the Georgia Institute of Technology.\n'As ridiculous as it looks, it is very practical for getting around campus,' said Dustin.\n'I've taken it to class for two weeks, and it makes for fast, cheap transportation.\n'A surprising number of students seem unphased by it, as Georgia Tech has become accustomed to home built student contraptions, but a few do laugh and get a kick out of it.\n'Off campus I've had people come up to me and ask to take pictures and video of the trike.'\nThe video shows the students testing the children's Radio Flyer tricycle, powered by a 33c chainsaw engine retrofitted with a modified clutch.\n'Last October, I was at a thrift shop and saw a small chainsaw for a great price, and promptly bought it with plans to eventually attach it to something,' said Trenton.\nStudent Dustin Sloan (pictured) has found a novel way to ensure he's never late for class again after attaching a chainsaw to a child's tricycle\nDustin (pictured) on the tiny children's trike. Dustin and co-inventor Trenton Charlson are students at the Georgia Institute of Technology\nThe Radio Flyer tricycle (pictured) is powered by a 33c chainsaw engine and retrofitted with a modified clutch\n'Given Georgia Tech's tricycle racing tradition, the Mini 500, we thought it was only fitting.'\n'The trike is modified to accept a sturdier rear axle,' added Dustin.\nThe saw of the chainsaw was removed and replaced with a welded-on sprocket.\n'On the first test of the trike, we tried to use the original rear wheels,' said Dustin.\n'They quickly failed as the spokes bent and broke.\nFootage shows the student drive down a main road in Atlanta, Georgia, on his unique motorised trike\nThe saw of the chainsaw was removed and replaced with a welded-on sprocket (pictured right) which was then attached to the trike with a chain\n'This meant getting new Colson wheels and machining new hubs to attach them to the rear axle.'\nThe students have previous experience in engineering kid's toys having assembled an electric Little Tyke's car in the past.\n'Special thanks to the Georgia Tech RoboJackets robotics team, which we are a part of, for use of the shop-space and tools,' said Dustin.\n'It wouldn't have been possible without some of the resources they provided.'","url":"https://www.dailymail.co.uk/sciencetech/article-4447336/Chainsaw-powered-tricycle-built-Georgia-Tech-student.html"}
