{"authors":["Ashley Collman For Dailymail.Com"],"date_download":"2018-10-23 00:56:35","date_modify":"2018-10-23 00:56:35","date_publish":"2016-01-29 14:29:07","description":"Bob Ebeling, 89, of Brigham City, Utah, was one of four engineers who tried to warn NASA against launching the Challenger on January 28, 1986.","filename":"data/vaneerConsumption/ChallengerNASAcontractorisstillrackedwithguiltoverexplosiondeaths.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/30B2BA1400000578-0-image-a-2_1454076519128.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422732_I-Thirty-years-Challenger-explosion-NASA-contractor-racked-guilt-death-seven-crew-members_1540256195.html","title":"Challenger NASA contractor is still racked with guilt over explosion deaths","title_page":"Challenger NASA contractor is still racked with guilt over explosion deaths | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"'Had they listened to me and wait[ed] for a weather change, it might have been a completely different outcome,' Ebeling told NPR\nThirty years after the disaster, Ebeling says he continues to blame himself for not lobbying harder for a postponed launch\nHowever, the space agency overruled them and decided to press forward with the launch anyway, sending seven crew members to their death\nWhistle-blower: Bob Ebeling, 89, was one of four engineers for a NASA contractor who tried to warn the space agency against launching the Challenger space shuttle back in 1986\nFor the millions of Americans who watched the Challenger space shuttle burst into flames over the south Florida sky thirty years ago, it was a moment of profound surprise and shock.\nBut not for Bob Ebeling. He saw it coming and even told his wife the night before the launch 'it's going to blow up'.\nThe former engineer for NASA contractor Morton Thiokol was part of a team of four that tried to warn the space agency against the launch, saying the temperatures in Cape Canaveral were too cold for the booster rockets to seal properly.\nDespite their efforts to postpone the launch, NASA overruled them and went forward with the mission - sending six crew members and a school teacher to their death.\n'I was one of the few that was really close to the situation,' Ebeling, now 89, told NPR this week. 'Had they listened to me and wait[ed] for a weather change, it might have been a completely different outcome.'\nEbeling watched the launch in terror from a conference room at his office in Brigham City, Utah, and to this day he can't shake the image of the exploding vessel from his mind.\nAfter the disaster, Ebeling and another Morton Thiokol engineer spoke with NPR anonymously to detail what they knew went wrong with the launch.\nAt the time, Ebeling asked to be quoted anonymously, afraid that he would lose his job.\nA million pieces: Ebeling knew the weather in Florida was too cold for a safe launch of the Challenger space shuttle on January 28, 1986\nShock: Millions of Americans watched on live TV and on the ground in Florida as the space shuttle took off and then exploded in the air 73 seconds later\nDoomed: Above, the seven crew members of the flight. Back row, left to right: Ellison Onizuka, Christa McAuliffe, Gregory Jarvis, and Judith Resnik. Front row, left to right: Michael J. Smith, Francis R. (Dick) Scobee, and Ronald E. McNair\nBut the burden of what happened that day caused him to retire shortly afterwards anyway, and now on the 30th anniversary of the disaster, he is finally comfortable being identified by name and picture.\nThey had their mind set on going up and proving to the world they were right and they knew what they were doing. But they didn't.\nWhile he says the decision was ultimately up to NASA, after all these years Ebeling still blames himself for not lobbying harder to postpone the flight.\n'I could have done more. I should have done more,' he told NPR.\nA religious man, he says he has prayed on the issue and continues to wonder why God picked 'a loser' for the job.\nIn the aftermath of the disaster, the Reagan administration conducted an investigation into the explosion and found that there were flaws in NASA's decision-making process. It's believed that there were several pressures that may have pushed the agency to go through with the launch when it would have been better to wait.\nThe first was that NASA was scheduling several launches that year and may have wanted to show that they could meet their deadlines. The other factor was that Reagan was scheduled to give his State of the Union speech that night, and wanted to brag about the launch in his address.\nBut Ebeling says whatever the pressures, nothing was worth the risk of sending seven crew members on an uncertain mission.\n'NASA ruled the launch. They had their mind set on going up and proving to the world they were right and they knew what they were doing. But they didn't,' he said.","url":"https://www.dailymail.co.uk/news/article-3422732/I-Thirty-years-Challenger-explosion-NASA-contractor-racked-guilt-death-seven-crew-members.html"}
