{"authors":["Press Association"],"date_download":"2018-10-22 21:12:03","date_modify":"2018-10-22 21:12:03","date_publish":"2017-04-26 01:14:27","description":"Hull will launch their defence of the Ladbrokes Challenge Cup against Super League rivals Catalans Dragons next month.","filename":"data/vaneerConsumption/ChallengeCupholdersHullfaceCatalansinlast16.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/21/23/330A0ADB00000578-0-image-a-15_1492814965624.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyleague_article-4445954_Challenge-Cup-holders-Hull-face-Catalans-16_1540242723.html","title":"Challenge Cup holders Hull face Catalans in last 16","title_page":"Challenge Cup holders Hull face Catalans in last 16 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Hull will launch their defence of the Ladbrokes Challenge Cup against Super League rivals Catalans Dragons next month.\nThe Black and Whites, who ended their wait for a first Wembley triumph with a 12-10 win over Warrington in the 2016 final, will have home advantage in one of three all-Super League ties to be played over the weekend of May 13-14.\nWarrington face a derby fixture with Widnes at the Halliwell-Jones Stadium while St Helens, five-time winners since the turn of the century, will travel to current Super League leaders Castleford, who last won the cup in 1986.\nSIXTH ROUND DRAW Leeds Rhinos v Barrow Raiders Salford Red Devils v Hull KR Castleford Tigers v St Helens Featherstone Rovers v Halifax Hull FC v Catalans Dragons Dewsbury Rams v Wakefield Trinity Swinton Lions v Wigan Warriors Warrington Wolves v Widnes Vikings\nChampionship part-timers Swinton's reward for their 26-24 victory over Super League club Huddersfield is a lucrative tie with reigning champions Wigan, who hold the record for most Challenge Cup wins with 19.\nCurrent Wigan captain Sean O'Loughlin was a tryscorer when the teams last met in the competition, Swinton going down 70-12 in the 2003 quarter-finals.\nLeeds, back-to-back winners in 2014 and 2015 who beat Doncaster in the last round, will again face League 1 opponents in Barrow, the lowest-ranked team in the last 16.\nElsewhere in the draw - made by former Cup winners Keith Senior and Chris Joynt - there is a repeat of the 2016 Million Pound Game only Salford will this time have home advantage against Hull KR, while Wakefield face a trip to Championship club Dewsbury, with whom they could be ground sharing in 2018.\nOne Championship club is guaranteed a place in the quarter-finals, with Featherstone hosting Halifax.","url":"https://www.dailymail.co.uk/sport/rugbyleague/article-4445954/Challenge-Cup-holders-Hull-face-Catalans-16.html"}
