{"authors":["Associated Press","Ashley Collman For Dailymail.Com"],"date_download":"2018-10-23 00:08:05","date_modify":"2018-10-23 00:08:05","date_publish":"2016-01-28 13:38:57","description":"Family members of the Challenger crew are gathering Thursday at the Kennedy Space Center for a memorial","filename":"data/vaneerConsumption/Challengerspaceshuttledisastervictimsfamiliesgatherfor30thanniversarymemorial.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/23/30ADD76D00000578-0-image-a-2_1454022195061.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420606_30-years-Challenger-New-voice-astronauts-memorial_1540253285.html","title":"Challenger space shuttle disaster victims' families gather for 30th anniversary memorial","title_page":"Challenger space shuttle disaster victims' families gather for 30th anniversary memorial | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Family members of the crew gathered Thursday at the Kennedy Space Center for a memorial\nThe space shuttle was carrying six astronauts and a schoolteacher when it launched and then exploded seconds\nOn January 28, 1986, Americans across the country took a break from their work, or from class, and found their way to a television to watch the space shuttle Challenger take off from Cape Canaveral.\nSeventy-three seconds later, the nation gave a united gasp as the shuttle exploded like a firework across the bright blue sky - killing all seven crew members on board.\nToday, on the 30th anniversary of the disaster, the son of teacher Christa McAuliffe, who won her place onboard the shuttle and died alongside her fellow astronauts, led family tributes.\nScott McAuliffe, who along with his sister Caroline has become a teacher like their mother, was just eight when the tragedy happened. Today he stood clutching a white rose in a rare appearance to honor her. His sister, who was six, and their father Steven chose not to attend.\nAlong with Mr McAuliffe was Alison Smith Balch, daughter of Challenger pilot Michael Smith and Kathie Scobee Fulgham, daughter of Challenger commander Francis Scobee and her brother Air Force Brig. Gen. Richard Scobee.\nThey gathered at he Kennedy Space Center in Florida to pay an emotional tribute to their lost loved ones.\nMeanwhile, NASA Administrator Charles Bolden also commemorated the fallen astronauts by placing a wreath at their memorial in Arlington National Cemetery.\nScroll down for video\nAfter placing a wreath, daughters and sons of Challenger astronauts look up at the names of their loved ones on the Astronaut Memorial at Kennedy Space Center on Thursday. Pictured left to right are Alison Smith Balch, daughter of Challenger pilot Michael Smith, Kathie Scobee Fulgham, daughter of Challenger commander Francis Scobee, Air Force Brig. Gen. Richard Scobee, the Challenger commander's son and Scott McAuliffe, son of Challenger \"Teacher in Space\" Christa McAuliffe.\nFamily: High School teacher Christa McAuliffe, her husband Steven, and children Caroline, 6, and Scott, 8, pose for a picture together outside their Concord home on Saturday, July 20, 1985\nThe family of Christa McAuliffe, sister, Betsy, front, and parents Grace and Ed Corrigan, react in horror as the shuttle explodes\nThe awful moment, just 73 seconds after take off, that the shuttle exploded on January 28 1986 as 17 per cent of the American population watched on in horror\nUnlike in previous years, the widow of Challenger commander Dick Scobee did not address the group.\nInstead, June Scobee Rodgers passed the torch to her daughter Kathie Scobee Fulgham, heralding in a second generation of survivors who will be the new custodians to the crew's legacy.\nChrista McAuliffe's son, Scott, attended with his own own family. McAuliffe was chosen from 10,000 candidates to be the first schoolteacher to visit space, and when she died on that January day, she left behind a husband, a son and a daughter.\n'It's going to be wonderful to watch the pages turn,' Rodgers said earlier this week. The second generation 'can now speak for our family and speak for the nation,' she said, adding that she's looking forward to these grown astronauts' children 'sharing their stories, their beliefs and their leadership.'\nPeople attend a Day of Remembrance Ceremony to honor the lives of the seven crew members of the Challenger space shuttle on the 30th anniversary of the 1986 tragedy, at the Kennedy Space Center Visitor Complex on Thursday\nDozens of family members of the crew killed in the explosion gathered at the Kennedy Space Center in Florida on Thursday for a memorial\nNASA Administrator Charles Bolden, left, and NASA Deputy Administrator Dava Newman, right, take part in a 'Day of Remembrance' ceremony to pay tribute to the crews of Apollo 1 and Space Shuttles Challenger and Columbia at Arlington National Cemetery on January 28, 2016 in Washington, DC\nMembers of the \"Old Guard\" take part in a changing of the guard ceremony at the Tomb of the Unknown Solider at Arlington National Cemetery January 28, 2016 in Washington, DC\nRick Varner, director of the Scobee Education Center at San Antonio College, places a wreath at the Challenger Memorial Garden during a ceremony to honor the lives of the seven crew members of the shuttle on Thursday\nVisitors to the Scobee Education Center at San Antonio College view art work displayed to honor the lives of the seven crew members of Challenger shuttle flight STS-51L on the 30th anniversary of the 1986 tragedy, Thursday, Jan. 28, 2016, in San Antonio. (AP Photo/Eric Gay)\nBob Kelley shows a video at the Scobee Education Center planetarium at San Antonio College following a ceremony to honor the lives of the seven crew members of Challenger shuttle flight STS-51L on the 30th anniversary of the 1986 tragedy, Thursday, Jan. 28, 2016, in San Antonio. (AP Photo/Eric Gay)\nFor the seven astronauts' loved ones, January 28, 1986, remains fresh in their minds.\nSteven McAuliffe, a federal judge in Concord, New Hampshire, still declines interviews about his late wife Christa, who was poised to become the first schoolteacher in space.\nBut he noted in a statement that although 30 years have passed, 'Challenger will always be an event that occurred just recently. Our thoughts and memories of Christa will always be fresh and comforting.'\nMcAuliffe said he's pleased 'Christa's goals have been largely accomplished in that she has inspired generations of classroom teachers and students.' She would be proud, he noted, of the Challenger Learning Centers.\nThursday marks the 30th anniversary of the Challenger space shuttle explosion. Above, the six astronauts and school teacher who were killed in the disaster. Front row from left are Michael J. Smith, Francis R. (Dick) Scobee, and Ronald E. McNair. Back row from left are Ellison Onizuka, school teacher Christa McAuliffe, Gregory Jarvis, and Judith Resnik\nIn this series of photos taken on January 28, 1986, the space shuttle Challenger is seen exploding in the sky just 73 seconds after take-off from Cape Canaveral, Florida while a family from Michigan watches from Shepard Park in Cocoa Beach\nWHAT CAUSED THE CHALLENGER DISASTER? On January 28, 1986, shortly before noon, the space shuttle challenger launched from Cape Canaveral, Florida. The shuttle was taking five crew, an engineer and a school teacher in space. The launch was highly publicized due to the fact that New Hampshire high school teacher Christa McAuliffe was to become the first teacher in space - winning the spot from a pool of 10,000 applicants. But just 73 seconds after the launch, the shuttle exploded in the sky making a trail of smoke into the ocean. NASA later blamed the deadly launch on unusually cold weather in Florida which led to the shuttle's booster rocket O-ring seals to become stiff, causing a leak.\nMcAuliffe is presiding over a trial this week in Concord, and so son Scott will represent the family, part of the next-generation shift. Scott and his sister are now in their 30s and have followed in their mother's footsteps to become teachers as well. The McAuliffes normally do not take part in these NASA memorials, so Scott's presence is especially noteworthy.\nAlong with the other Challenger families, Rodgers established the Challenger Center for Space Science Education just three months after the shuttle disintegrated in the Florida sky. Unusually cold weather that morning left Challenger's booster rockets with stiff O-ring seals; a leak in the right booster doomed the ship.\nToday, there are more than 40 Challenger Learning Centers focusing on science, technology, engineering and math, mostly in the U.S. More are being built.\n'They're not just a field trip for kids. They're actually lessons learned,' said Rodgers, an educator who lives in Chattanooga, Tennessee. 'That's why they've lasted.'\nMcAuliffe's backup, Barbara Morgan, a schoolteacher from Idaho, rocketed into orbit in 2007 aboard Endeavour as a fully-trained astronaut. Morgan was invited to speak Thursday at Rodgers' request.\nBesides Dick Scobee and Christa McAuliffe, the Challenger dead include pilot Michael Smith, Judith Resnik, Ronald McNair, Ellison Onizuka and Gregory Jarvis.\nSeven more shuttle astronauts died February 1, 2003, aboard Columbia; that commander's widow, Evelyn Husband Thompson, will attend Thursday's ceremony.\nUnusually cold weather the morning of the launch left Challenger's booster rockets with stiff O-ring seals; a leak in the right booster doomed the ship. Above, the Challenger during take-off\nIn this January 27, 1986 file picture, the crew members of space shuttle Challenger , leave their quarters for the launch pad at Kennedy Space Center in Cape Canaveral, Fla. From foreground are commander Francis Scobee, Mission Spl. Judith Resnik, Mission Spl. Ronald McNair, Payload Spl. Gregory Jarvis, Mission Spl. Ellison Onizuka, teacher Christa McAuliffe and pilot Michael Smith\nThis NASA file photo taken on January 8, 1986 shows the space shuttle Challenger mission crew as they pose for a portrait while training at Kennedy Space Center's Launch complex. Left to right are teacher Christa McAuliffe; Payload Specialist Gregory Jarvis; and Astronauts Judith A. Resnik, mission specialist; Francis R. (Dick) Scobee, mission commander; Ronald E. McNair, mission specialist; Mike J. Smith, pilot; and Ellison S. Onizuka, mission specialist\nFrederick Gregory (foreground) and Richard O Covey, spacecraft communicators at Mission Control in Houston watch helplessly as the Challenger shuttle explodes on take-off\nIn this January 28, 1986 file picture, spectators at the Kennedy Space Center in Cape Canaveral, Florida react after they witnessed the explosion of the space shuttle Challenger\nFaces of spectators register incomprehension and shock as they witness the explosion of the Space Shuttle Challenger 73 seconds after liftoff, on January 28, 1986\nAbove, more shocked spectators to the Challenger disaster. About 17 per cent of Americans watched the launch\nYoung Scott McAuliffe's third grade teacher comforts one of her charges as another youngster and a young woman, right, react after seeing the Space Shuttle Challenger explode in midair, killing all aboard on Tuesday, January 28, 1986\nThe event will honor the Columbia Seven as well, along with the three Apollo 1 astronauts killed during a launch pad test on January 27, 1967. NASA also plans observances at Arlington National cemetery, Johnson Space Center in Houston and elsewhere.\nAt Kennedy, the Scobee contingent will number 12, including June's son Richard, a major general in the Air Force, and a 16-year-old granddaughter.\nDick Scobee was 46 years old when he died aboard Challenger barely a minute into the flight. Both his children are now in their 50s.\n'For so many people, 30 years, it's definitely history. It's in the history books,' Rodgers said. For the family, 'it's like it's just happened, which in a way keeps Dick Scobee young in our hearts, and the joy and excitement he had for flying.'\nIn this 1986 file photo, members of the Presidential Commission on the Space Shuttle Challenger Accident walk past the solid rocket boosters and the external tank of a shuttle being fitted in the Vehicle Assembly building at Kennedy Space Center in Cape Canaveral, Florida\nIn this January 28, 1986 photo provided by NASA shows icicles on hand rails of the space shuttle Challenger's service structure on the morning of its final launch from Kennedy Space Center, Florida","url":"https://www.dailymail.co.uk/news/article-3420606/30-years-Challenger-New-voice-astronauts-memorial.html"}
