{"authors":["Adam Shergold For Mailonline"],"date_download":"2018-10-23 05:53:24","date_modify":"2018-10-23 05:53:24","date_publish":"2017-03-10 15:28:53","description":"Yet another vitally important weekend awaits in the Sky Bet Championship, where there are plenty of issues at both ends of the table to be resolved. We preview all the action","filename":"data/vaneerConsumption/ChampionshippreviewBestoftheweekendsaction.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/15/3E23A30200000578-0-image-a-85_1489159481531.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4301240_Championship-preview-Best-weekend-s-action_1540274004.html","title":"Championship preview: Best of the weekend's action","title_page":"Championship preview: Best of the weekend's action | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Yet another vitally important weekend awaits in the Sky Bet Championship, where there are plenty of issues at both ends of the table to be resolved.\nWhether it's Newcastle United and Brighton pushing on for the Premier League, the fascinating race for the play-offs or the battle to avoid the drop, England's second tier never fails to provide entertainment.\nWe take a look at some of the key talking points in the weekend ahead.\nBrighton celebrate after Anthony Knockaert scored in their midweek win at Rotherham United\nHow the top six in the Championship looks ahead of another crucial weekend\nBrighton looking for a cushion\nThe weekend's Championship action begins, as usual, on Friday night as second-placed Brighton take on Derby County at the Amex Stadium.\nAfter three play-off failures in the past four seasons, the south coast club are determined to make it up automatically this time and a win here would open up a nine-point lead over Huddersfield Town in third.\nAdmittedly the Yorkshire side would have two games in hand but it would still be valuable breathing space and prove that Brighton's recent wobble - losses to Newcastle and Nottingham Forest - was a mere blip.\nSam Baldock fires a shot at goal during Brighton's midweek win over Rotherham\nThree points for Chris Hughton's side against a Derby team now well off the play-off pace would also take them level on points with leaders Newcastle - for 24 hours at least.\nThe Seagulls may have kept an impressive 18 clean sheets in the league this season, but Hughton is without four key defenders, with centre-half Shane Duffy out for six weeks with a broken metatarsal.\nBrighton and Hove Albion vs Derby County, Friday 7.45pm, Live on Sky Sports 1\nDerby's Matej Vydra heads over the crossbar during their midweek draw with Preston\nNewcastle keen to power on\nIt was billed as the toughest test of their promotion credentials - Newcastle facing Brighton, Huddersfield and Reading, all away from home, in the space of a week.\nRafa Benitez and his team passed it with flying colours, defeating Brighton and Huddersfield, then drawing 0-0 at Reading on Tuesday night.\nJonjo Shelvey celebrates after Daryl Murphy scored for Newcastle at Huddersfield last week\nChampionship games FRIDAY Brighton vs Derby County 7.45pm; Live on Sky Sports 1 SATURDAY (all 3pm) Aston Villa vs Sheffield Wednesday Barnsley vs Ipswich Town Brentford vs Huddersfield Town Burton Albion vs Nottingham Forest Cardiff City vs Birmingham City Leeds United vs Queens Park Rangers Newcastle United vs Fulham Norwich City vs Blackburn Rovers Preston North End vs Reading Wigan Athletic vs Bristol City Wolverhampton Wanderers vs Rotherham United\nIt means they are sitting pretty at the top of the table and most definitely in the box seat for automatic promotion with a big gap to third.\nYet there is no let-up in the challenging fixtures as the Toon welcome play-off chasers Fulham to St James' Park.\nFulham are unbeaten in six league games and were buoyed on Tuesday night by Tom Cairney's stoppage time equaliser to earn a deserved point against Leeds.\nThey also need the points as desperately as Newcastle with a five-point gap to make up to Sheffield Wednesday in sixth place.\nSlavisa Jokanovic's team have proven repeatedly they have the staying power for the chase, winning 22 points from losing position this season, significantly more than any other team.\nBut if Newcastle take one point or more, with their hardest spell of the campaign behind them, you'd expect them to romp back to the Premier League.\nNewcastle United vs Fulham, Saturday 3pm, Highlights on Channel 5 at 9pm\nTom Cairney is mobbed by jubilant Fulham fans after scoring in the last minute against Leeds\nHuddersfield trying to close the gap\nHaving seen their automatic promotion hopes dealt a major blow by that 3-1 home loss to Newcastle last weekend, Huddersfield showed extraordinary resilience to bounce back with a 1-0 win over Aston Villa on Tuesday.\nIt keeps the Terriers in touch with Brighton, especially given that they retain a game in hand, and David Wagner's team are ready to pounce on any slip-ups.\nNext up for the west Yorkshire side is a visit to Brentford on Saturday afternoon and they'll be encouraged by their excellent recent away record of just one defeat in eight, including five wins.\nHuddersfield Town players celebrate with the fan after their win over Aston Villa in midweek\nMid-table Brentford have enjoyed the upper hand in this fixture in the last few years, beating Huddersfield 4-2 last season and 4-1 the year before.\nBut it will be the visitors who'll start as strong favourites, especially as they do prove very hard to break down - Huddersfield have faced fewer shots (333) and fewer shots on target (111) than any other Championship side.\nBrentford vs Huddersfield Town, Saturday 3pm\nLeeds hoping to prove how far they've come\nRemember that sunny August afternoon when Queens Park Rangers spanked Leeds 3-0 on the opening weekend of the season?\nYou'd be forgiven for not recalling it given the divergent progress of these two teams' seasons since then.\nWhile QPR have only recently started to feel assured they won't be sucked into a relegation dogfight, Leeds are pushing hard for a Premier League return after 13 agonising seasons away.\nLeeds defender Pontus Jansson celebrates after an own goal gave them the lead at Fulham\nAutomatic promotion looks beyond Garry Monk's team but the play-offs should be all-but-assured given their eight-point cushion to the sides below that magic quartet of places.\nLeeds looked a little bit toothless without 22-goal leading scorer Chris Wood at Fulham on Tuesday night and dropped two points at the death.\nBut Wood should return for another meeting with west London opponents on Saturday, likewise Luke Ayling, who celebrated the birth of his daughter this week.\nMind you, this is a bad time to face Ian Holloway's Hoops, who have won four of their last five fixtures, the same number as they'd won in the previous 15 since his return to Loftus Road.\nLeeds United vs Queens Park Rangers, Saturday 3pm\nQueens Park Rangers celebrate after Idrissa Sylla scored their second goal against Barnsley\nReading looking to cement play-off spot\nReading have been in the promotion shake-up for the majority of the season, playing some pleasing football under Jaap Stam.\nThe Royals, having proven their mettle to hold Newcastle to a goalless draw on Tuesday night, will be hoping for another win at Preston on Saturday to feel more secure about extending their season.\nBut it'll be far from easy at Deepdale given that ninth-place Preston have lost just once in the last seven matches and haven't yet given up on the top six.\nMost impressive about the Lilywhites is that goals come from all areas of the pitch - they've had 16 different goalscorers in league games this season.\nReading, though, will be pleased to get back to less-taxing opponents having lost to both Huddersfield and Brighton, and drawn with Newcastle, in the past few weeks.\nPreston North End vs Reading, Saturday 3pm\nJaap Stam watches on intently as Reading draw 0-0 with Newcastle United on Tuesday\nA fixture fit for the Premier League?\nFor so long, Aston Villa against Sheffield Wednesday would have been a Premier League fixture - but times have moved on.\nInstead, they meet at Villa Park in the Championship and really only one side has anything to play for.\nWhile Villa sit comfortably in mid-table, Wednesday have their eyes set on another play-off challenge, having lost out to Hull City in last year's Wembley final.\nBut Carlos Carvalhal and his Owls team are glancing nervously at Fulham over their shoulder, especially following just one win in their last four outings.\nRoss Wallace fires Sheffield Wednesday into the lead against Burton Albion on Tuesday night\nThey were frustrated by Burton Albion at Hillsborough on Tuesday night and fans wouldn't have been best pleased when Fulham grabbed a last-minute leveller against Leeds.\nStill, the gap remains at five points for now and they will be favourites against a Villa side beaten in midweek and woefully inconsistent.\nAston Villa vs Sheffield Wednesday, Saturday 3pm\nA vital afternoon for Wolves\nThese are very troubling times for Wolves. A Premier League club as recently as 2012, they are now flirting dangerously with a return to the third tier again.\nThey sit just one point and one place above the relegation zone, but retain two games in hand over Bristol City beneath them and, therefore, a chance of salvation.\nPaul Lambert's side have won just once in their last eight matches, losing six of them, and if they can't beat rock-bottom Rotherham United on Saturday, then you really have to worry.\nWolves' Jon Bodvarsson tries to find a way through the Ipswich defence during their 0-0 draw\nLuckily for Wolves, the Millers, 19 points from safety, have pretty much given up and have collected just a sole point from their 18 away games this season - the poorest record in the top four divisions.\nSo there are really no excuses for the Molineux side in this one.\nWolverhampton Wanderers vs Rotherham United, Saturday 3pm\nThe bottom six in the Championship as it looks ahead of this weekend's action\nA relegation six-pointer in Lancashire\nAn afternoon of drama and tension is assured at the DW Stadium as two of the teams currently in the bottom three - Wigan Athletic and Bristol City - meet in a relegation six-pointer.\nWigan are two points from safety, while Bristol City are a point behind Wolves in 21st, so there is everything to play for.\nThe Latics successfully embarked on a number of Great Escapes during their Premier League years and need to repeat the trick in the second tier.\nDan Burn celebrates with Gabriel Obertan after scoring Wigan's winner at Birmingham\nWarren Joyce's side managed a 1-0 win at Birmingham on Tuesday night to stop a slide of four games without victory, but they have a miserable home record, winning just three times at home all season.\nUp against that, the Robins have not won in their previous 13 league away games and they have really suffered during the injury absence of Chelsea loanee Tammy Abraham.\nWigan Athletic vs Bristol City, Saturday 3pm\nBailly Wright plunders an equalising goal for Bristol City against Norwich in midweek\nBest of the rest\nThe four other Championship matches on Saturday see Burton Albion come up against Nottingham Forest, the club that wanted their manager Nigel Clough not so long ago.\nNorwich City, who still have an outside chance of making the play-offs, are at home to relegation-threatened Blackburn Rovers.\nBarnsley take on Ipswich Town in a mid-table encounter and Cardiff City host Birmingham City.","url":"https://www.dailymail.co.uk/sport/football/article-4301240/Championship-preview-Best-weekend-s-action.html"}
