{"authors":["Maurie Backman","The Motley Fool"],"date_download":"2018-10-30 21:00:10","date_modify":"2018-10-30 21:00:10","date_publish":"2016-12-23 00:00:00","description":"The vast majority of US tax returns are not subjected to audits.","filename":"data/vaneerConsumption/Chancesofbeingauditedarelowerthanyouthink.json","image_url":"https://amp.businessinsider.com/images/585d94f6ee14b6b2008b52e1-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_chances-of-being-audited-are-lower-than-you-think-2016-12_1540933210.html","title":"Chances of being audited are lower than you think","title_page":"    Chances of being audited are lower than you think - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Flickr / 401(K) 2012 Though paying taxes is stressful in its own right, there's the idea of getting audited to really drive tax filers over the edge. But before you lose sleep over the notion of getting audited, you should know that IRS audit rates are fairly low, and the likelihood you'll be picked is extremely slim. Less than 1% of U.S. tax returns are audited, and avoiding common red flags can help further reduce your risk.\nWhat's your tax audit risk?\nLet's get one thing out of the way: The vast majority of U.S. tax returns are not subjected to audits. In fact, if you earn between $25,000 and $199,999, your chances of being flagged are even lower. Even higher earnings don't necessarily increase your risk that greatly. An estimated 1.75% of tax filers earning between $200,000 and $499,999 have their returns audited. While that's a higher risk than that of the general population, it's still pretty low overall.\nSo who does get audited the most? Not surprisingly, the country's highest earners have the greatest odds. In fact, those with incomes over $10 million have more than a 16% chance of making the list. But on the other extreme, filers who report no income are more than five times as likely to get audited than the average taxpayer.\nThe following table shows how your chances of being audited look based on how much income you report.\nDon't panic if you're picked\nOf course, nobody wants to be the subject of an IRS audit, but if you are selected, you should know that the process probably won't be as scary as you'd think. First, over 75% of audits are conducted by mail, which means you're less likely to find yourself face-to-face with an actual IRS agent. Secondly, tax audits don't always work out in favor of the IRS. In 2015, almost 40,000 audits resulted in over $1 billion of refunds to taxpayers. Furthermore, 9% of field audits and 12% of audits conducted by mail cause no money to change hands. Now this isn't to say that you're guaranteed not to owe money if you're audited; but unless you seriously embellished your deductions, there's a good chance you'll come out unscathed.\nPeople wait outside the Internal Revenue Service office in the Brooklyn borough of New York May 27, 2015. REUTERS/Shannon Stapleton\nLowering your chances of being audited\nIf you really want to avoid an audit scenario altogether, there are a few things you can do to lower your risk. First, don't claim business expenses that aren't directly related to your line of work. If you're a writer, for example, by all means, include your laptop. But don't think you can get away with buying a new fridge for your home, writing a paid review, and deducting its cost on your taxes.\nFurthermore, make sure your charitable contributions align with your income level. It could very well be that you're a naturally generous soul, but if you deduct $15,000 in donations and your income is only $50,000, there's a good chance the IRS is going to question it.\nFinally, if you can't find documentation supporting a deduction, skip it. Guessing at how much you're eligible to write off could get you in big trouble if your return is indeed flagged.\nRemember, too, that the IRS has three years from the time you file a return to choose to audit it. This means you'll need to keep all of your documentation on hand until this window closes. If you don't have the physical storage space, scan your records and store them electronically. Even though your chances of getting audited are pretty low, it pays to be ready just in case.","url":"https://www.businessinsider.com/chances-of-being-audited-are-lower-than-you-think-2016-12"}
