{"authors":["Jo Scrimshire","Candice Jackson","Kristy Johnson For Daily Mail Australia"],"date_download":"2018-10-23 03:49:57","date_modify":"2018-10-23 03:49:57","date_publish":"2017-03-16 14:52:17","description":"Channel Ten have responded to the public backlash about a 78kg female contestant being featured on The Biggest Loser: Transformed.","filename":"data/vaneerConsumption/ChannelTenrespondstoTBLsNikkisweight.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/15/01/3E478AE300000578-0-image-a-9_1489542315220.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320524_Ten-responds-controversy-78kg-TBL-contestant-Nikki_1540266597.html","title":"Channel Ten responds to TBL's Nikki's weight","title_page":"Channel Ten responds to TBL's Nikki's weight | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Channel Ten have responded to the public backlash about a 78kg female contestant being featured on The Biggest Loser: Transformed.\nNikki's entry weight sparked debate on Twitter after the reality TV show's debut this week, with many fans claiming she is 'not fat enough' to take part.\nIt was claimed by some viewers that portraying the Queenslander as 'unhealthy' was not responsible, as she is just 7kg heavier than the average Australian woman.\nHowever, a spokesperson for the network told The Daily Telegraph on Friday that the new series was 'not just about weight loss'.\n'Not just about weight loss': Channel Ten have responded to the public backlash about a 78kg female contestant being featured on The Biggest Loser: Transformed\nIt comes after former series winner Sam Rouen told Daily Mail Australia he understood the public reaction to a lighter contestant being featured on the show.\nHe explained that the series format had changed since he took part in 2008, saying: 'It is about transforming individuals and overhauling their lifestyles.'\nSam added: 'If the producers had put Nikki on the show and labeled her as obese or something similar, yeah that would be absolutely disgusting.'\nControversy: Nikki's entry weight sparked debate on Twitter after the reality TV show's debut this week, with many fans claiming she is 'not fat enough' to take part\nThe firefighter claimed the show's new direction made weight loss more relatable to the everyday viewer and would 'help to inspire other everyday Aussies to not just take their health for granted.'\n'It's a common misconception that only overweight people are unhealthy, many people with lighter frames also have poor diets, are unfit or sedentary, have high blood pressure or a range of other health issues,' he said.\n'I don't think Nikki has entered the show with the aspirations of losing 30kg but to regain some health and fitness. Now she is in the hands of arguably the best people in the business.'\nFitness quest: Nikki was introduced as one of 16 contestants vowing to change their physical and mental health on The Biggest Loser: Transformed on Tuesday\nNikki was introduced as one of 16 contestants vowing to change their physical and mental health on The Biggest Loser: Transformed on Tuesday.\nThe 25-year-old full-time mother said that feeling confident in a bikini is what she's hoping to achieve from the experience.\nBut viewers quickly took to Twitter to voice their confusion at her entry weight, writing: 'I'm sorry but 78kg?!? No' and '78kg isn't that fat.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320524/Ten-responds-controversy-78kg-TBL-contestant-Nikki.html"}
