{"authors":["Christine Rendon For Dailymail.Com"],"date_download":"2018-10-22 22:24:06","date_modify":"2018-10-22 22:24:06","date_publish":"2016-01-11 03:05:19","description":"The 35-year-old also presented Kate Winslet her award alongside 21 Jump Street co-star Jonah Hill.","filename":"data/vaneerConsumption/ChanningTatumsslickedoverhairatGoldenGlobes2016comparedtoJustinBieber.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/02/3002423200000578-0-image-a-61_1452479632043.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393239_Channing-Tatum-s-slicked-hair-sets-Internet-alight-draws-comparisons-Justin-Bieber-emojis_1540247046.html","title":"Channing Tatum's slicked over hair at Golden Globes 2016 compared to Justin Bieber","title_page":"Channing Tatum's slicked over hair at Golden Globes 2016 compared to Justin Bieber | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"His good looks and chiselled features have made him a fan favourite celebrity.\nBut on the night of the Golden Globes, it was Channing Tatum's unusual new hairdo that captured the interest of users all across the Internet.\nThe tweets came poring in as the 35-year-old debuted his slicked-over hairdo on Sunday, with multiple users comparing him to Justin Bieber, an emo emoji, and even a member of rock group Green Day.\nScroll down for video\nThe mane attraction! Channing-Tatum debuted a new slicked-over hairdo as he walked the red carpet with his wife Jenna Dewan Tatum at the Golden Globes on Sunday in Beverly Hills\nThe inspiration? Journalist Alexandria Symonds declared on Twitter, 'channing tatum looks exactly like the emo skype emoji'\nTwitter user Carina Zhao tweeted during the awards show, 'Channing Tatum's hair is extremely questionable he looks like a member of green day.'\nJournalist Alexandria Symonds declared, 'channing tatum looks exactly like the emo skype emoji.'\nNew York Magazine editor Kyle Buchanan wondered on Twitter, 'Did...Bieber style Channing Tatum for this?'\nSee the latest Justin Bieber updates as Channing Tatum seems to channel his style\nDecisions, decisions: MTV Instagrammed a meme of Justin Bieber and Tatum, asking fans to 'Discuss' Channing's new look\nBig questions: Kyle Buchanan wondered if Tatum recruited the pop star as his stylist for the night\nMy oh my: Cinya Burton was truly perplexed with Tatum's Golden Globes look\nAnd Cinya Burton tweeted, 'GOOD HEAVENS! What in the name of Bieber is happening with Channing Tatum's hair???!?!'\nBuzzfeed correspondent Kate Aurthur comically wrote, 'I'm sure there's an official explanation for Channing Tatum's hair. Can someone send me the file? #GoldenGlobes.'\nThe hairdo quickly drew the interest of multiple media outlets, who all contributed their own comparisons to the intriguing style.\nHe has some explaining to do! Kate Aurthur joked 'I'm sure there's an official explanation for Channing Tatum's hair'\nIt happens: Ashley Weatherford teased the 21 Jump Street star's hairdo 'is a case of when bad side parts happen to good people'\nMTV captioned an Instagram meme of Justin and Channing's face, 'Discuss.'\nElsewhere, Entertainment Weekly compared Channing to Thin Man from Charlie's Angels.\nTwitter user Hayley Spencer referenced Beauty And The Beast as she asked, 'Did he take a picture of Gaston to his hairstylist?'\nThat night, Channing and his 21 Jump Street co-star Jonah Hill presented Kate Winslet with her gong for Best Performance by an Actress in a Supporting Role in any Motion Picture at the Beverly Hilton in Los Angeles in front of Hollywood's biggest stars.\nSpitting image? Entertainment Weekly compared the heartthrob to Thin Man from Charlie's Angels\nInspiration? Hayley Spencer joked that the 35-year-old presented a photo of Beauty And The Beast character Gaston to his hairstylist\nGoing strong: Tatum has been married to his lovely wife Jenna since 2009\n2016 GOLDEN GLOBE AWARDS WINNERS - FILM Best Performance by an Actress in a Motion Picture Drama Cate Blanchett, Carol Brie Larson, Room Rooney Mara, Carol Saoirse Ronan, Brooklyn Alicia Vikander, The Danish Girl Best Performance by an Actor in a Motion Picture Drama Bryan Cranston, Trumbo Leonardo DiCaprio, The Revenant Michael Fassbender, Steve Jobs Eddie Redmayne, The Danish Girl Will Smith, Concussion Best Performance by an Actor in a Motion Picture Musical or Comedy Christian Bale, The Big Short Steve Carell, The Big Short Matt Damon, The Martian Al Pacino, Danny Collins Mark Ruffalo - Infinitely Polar Bear\nBest Performance by an Actress in a Motion Picture Musical or Comedy Jennifer Lawrence, Joy Melissa McCarthy, Spy Amy Schumer, Trainwreck Maggie Smith, The Lady in the Van Lily Tomlin, Grandma Best Screenplay Motion Picture Josh Singer Charles Randolf The Big Short Steve Jobs Quentin Tarantino, The Hateful Eight Best Original Song Motion Picture Love Me Like You Do, Fifty Shades Of Grey One Kind Of Love, Love and Mercy See You Again, Furious 7 Simple Song #3, Youth Writing's On The Wall, Spectre\nBest Motion Picture - Drama Carol Mad Max: Fury Road The Revenant Room Spotlight Best Motion Picture - Musical or Comedy The Big Short Joy The Martian Spy Trainwreck\nBest Motion Picture - Animated Anomalisa The Good Dinosaur Inside Out The Peanuts Movie Shawn The Sheep Movie\nBest Motion Picture - Foreign Language The Brand New Testament, Belgium The Club, Chile The Fencer, Finland/Germany/ Estonia Mustang, France Son of Saul, Hungary Best Performance by an Actress in a Supporting Role in any Motion Picture Jane Fonda, Youth Jennifer Jason Leigh, The Hateful Eight Helen Mirren, Trumbo Kate Winslet, Steve Jobs Alicia Vinkander, Ex-Machina\nBest Performance by an Actor in a Supporting Role in any Motion Picture Paul Dano, Love & Mercy Idris Elba, Beasts of No Nation Mark Rylance, Bridge of Spies Michael Shannon, 99 Homes Sylvester Stallone, Creed Best Director Motion Picture Todd Haynes, Carol Alejandro G Inarritu, The Revenant Tom McCarthy, Spotlight Ridley Scott, The Martian George Miller, Mad Max:Fury Road\nBest Original Score Motion Picture Carol The Danish Girl The Hateful Eight Steve Jobs The Revenant","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393239/Channing-Tatum-s-slicked-hair-sets-Internet-alight-draws-comparisons-Justin-Bieber-emojis.html"}
