{"authors":["Katie Storey For Mailonline"],"date_download":"2018-10-23 03:31:02","date_modify":"2018-10-23 03:31:02","date_publish":"2017-03-10 13:07:02","description":"The reality star, 33, looked decidedly down in the dumps as she took her gleaming new Porsche 911 for a spin near her home in Essex on Tuesday.","filename":"data/vaneerConsumption/ChantelleHoughtontakeshernewPorscheoutforaspin.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E229BA100000578-0-image-a-30_1489148818506.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4301018_Chantelle-Houghton-looks-dumps-new-car_1540265462.html","title":"Chantelle Houghton takes her new Porsche out for a spin","title_page":"Chantelle Houghton takes her new Porsche out for a spin | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's just become the proud owner of the sort of car most can only dream of.\nBut Chantelle Houghton looked decidedly down in the dumps as she took her gleaming new Porsche 911 for a spin near her home in Essex on Tuesday.\nThe reality star, 33, made sure all eyes were on her as she rocked up to a local petrol station to fill up her luxury new purchase - with a price tag of a whopping £90,000 - but her lavish spending failed to raise a smile.\nScroll down for video\nCheer up! Chantelle Houghton looked decidedly down in the dumps as she took her gleaming new Porsche 911 for a spin near her home in Essex on Tuesday\nThe former Celebrity Big Brother winner seemed downcast while she made a pit-stop to tend to her vehicle's needs.\nChantelle sported a dressed down look for the occasion and was seen making her way back to her car in a pair of grey skinny jeans.\nShe teamed her wardrobe staple with a Balmain Paris designer tee and a trendy pair of trainers, while covering up from the winter chill in a leather biker jacket.\nThe mother-of-one - who shares daughter Dolly, four, with ex partner Alex Reid - made sure to inject a little glamour into her ensemble with a full face of heavy make-up.\nHot wheels: The reality star, 33, made sure all eyes were on her as she rocked up to a local petrol station to fill up her luxury new purchase, with a price tag of a whopping £90,000 -\nVroom vroom: The former Celebrity Big Brother winner seemed downcast while she made a pit-stop to tend to her vehicle's needs\nShe was seen sweeping her chocolate hued tresses back from her face, while juggling her new car keys with a bottle of water, her purse and a packet of mints.\nDespite appearing a little low, Chantelle's mood soon lifted as she got the engine going on her Porsche.\nSettling back into the driver's seat, the TV personality donned a huge pair of shades and was caught beaming with delight as she purred along in her flashy motor.\nIt may have cost Chantelle more than a small fortune, but she has been known to live by the motto 'life is too short'.\n'Life is too short': The brunette beauty took on Tina Malone in debate about weight affecting a person's happiness on This Morning in February\nBack in February, the brunette beauty appeared on This Morning to take part in a debate, alongside Tina Malone, about weight.\nChantelle has openly spoken about her own battles with her figure, after ballooning from a size 10 to 16 in 2015, and insisted she is content no matter what her size may be.\nWhile Tina argued that she is happy now because of her slim figure, Chantelle said she is more open minded when it comes to her weight and her self-esteem.\nShe hit back: 'I've been up and down all my life with my weight and life is really short. I just want to enjoy my life.'\nChantelle also shared her views on bodyshamers and insisted to make cruel jibes about a person's size is 'disgusting' behaviour.\n'I think we should all get on with our lives and ignore them,' she fired. 'I truly don't care what trolls say. I think the bodyshaming thing is disgusting.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4301018/Chantelle-Houghton-looks-dumps-new-car.html"}
