{"authors":["Associated Press"],"date_download":"2018-10-23 03:39:50","date_modify":"2018-10-23 03:39:50","date_publish":"2016-01-28 19:11:03","description":"MANCHESTER, England (AP) — Northern-hemisphere rugby sank to a new low during the recent Rugby World Cup when Europe failed to get a single representative in...","filename":"data/vaneerConsumption/ChangeintheairforEuropeschastenedteamsin6Nations.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421523_Change-air-Europes-chastened-teams-6-Nations_1540265990.html","title":"Change in the air for Europe's chastened teams in 6 Nations","title_page":"Change in the air for Europe's chastened teams in 6 Nations | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Change in the air for Europe's chastened teams in 6 Nations\nMANCHESTER, England (AP) — Northern-hemisphere rugby sank to a new low during the recent Rugby World Cup when Europe failed to get a single representative in the semifinals for the first time.\nThe upcoming Six Nations offers the chance of a fresh start — and there's certainly change in the air.\nTwo new coaches, in England's Eddie Jones and France's Guy Noves, and another coach (Italy's Jacques Brunel) sure to leave after the competition finishes.\nThree new captains for England, France and Ireland.\nEngland and France are promising a new style of play — basically, a return to their old ways — while Wales may finally rid itself of the crude \"Warrenball\" approach in a bid to expand its game.\nIreland faces a new era without stalwart lock Paul O'Connell. And is this the year that Scotland finally comes of age after coming within a refereeing error of reaching the World Cup semifinals?\nThe 2015 Six Nations was the most exciting competition in its history, with three teams going for the title on a high-scoring final round of games. Ireland emerged as champion — knocking England into runner-up spot for the fourth straight season — and will look to become the first team to win the Five/Six Nations title outright in three consecutive years.\nHere's' a look at each of the six teams:\n___\nIRELAND\nHopes aren't exactly high in Ireland of the hat trick, after its three provincial teams — Munster, Leinster and Ulster — failed to reach the quarterfinals of the Champions Cup, Europe's top club competition.\nO'Connell is another huge loss, soon after the retirement of Brian O'Driscoll, and Rory Best has taken over the captaincy.\nMuch may depend on the fitness of star flyhalf Jonathan Sexton, with concerns over his long-term health after he suffered another head injury last weekend.\nThe Irish must play France and England away.\n___\nENGLAND\nWiping the slate clean after a dismal World Cup, England has two new leaders in Jones and captain Dylan Hartley, and is promising to restore its traditional forward power.\nOnly three new caps will be in the squad for the opener against Scotland but more should get chances later in the competition. Watch out for lock Maro Itoje and center Elliot Daly, two bright new things of English rugby.\nChris Robshaw will switch flanks to No.6 as he prepares for life away from the captaincy. Hartley, the owner of a rap sheet featuring 54 weeks of bans, has that honor and will be heavily scrutinized.\n___\nWALES\nSame players, new philosophy for the Welsh.\n\"The landscape is changing,\" Wales backs coach Rob Howley said. \"We all need to evolve.\"\nThat means a wider game and less of the \"crash, bang\" that has characterized the so-called \"Warrenball\" approach under coach Warren Gatland since 2007.\nGoalkicking fullback Leigh Halfpenny is still missing through injury, as is scrumhalf Rhys Webb.\n___\nFRANCE\nNoves is rebuilding a team left in tatters following its crushing 62-13 loss to New Zealand at the Rugby World Cup. The former Toulouse coach is banking on youth and has brought in 10 uncapped players, including rugby sevens star Virimi Vakatawa.\nNoves has one goal in mind: the 2019 World Cup. To transform France into a contender, he intends to bring back the French flair after four years marked by a last-place finish in the Six Nations and a dull style of rugby.\n\"My first message was that (the players) weren't going on the pitch to enjoy themselves but to give the fans enjoyment,\" Noves said. \"We have a long way to go but it's not an ambition, we have a responsibility.\"\n___\nSCOTLAND\nWhitewashed on its way to the wooden spoon last year, Scotland has renewed hope after reaching the World Cup quarterfinals and coming to close to beating Australia.\nNo-nonsense Kiwi coach Vern Cotter is certainly getting his message across and there is plenty of strength in depth in the squad.\nA winning start against fierce rival England in international rugby's oldest fixture would be welcome, crushing any English optimism following Eddie Jones' arrival.\n___\nITALY\nBrunel will be replace after the Six Nations, so Italy's players are auditioning.\nThere was more talk last year about whether the Italians deserve their place in the competition — Georgia is pressing hard for inclusion — and they will attempt to quash that by gaining at least one win.\nAt home to Scotland in Round 3 seems their best chance.","url":"https://www.dailymail.co.uk/wires/ap/article-3421523/Change-air-Europes-chastened-teams-6-Nations.html"}
