{"authors":[],"date_download":"2018-10-30 14:34:48","date_modify":"2018-10-30 14:34:48","date_publish":"2015-04-14 00:00:00","description":null,"filename":"data/vaneerConsumption/Chancesthatinjunctionpreventingimmigrationordersbeingimplementedwillbeoverturnedareslim.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_04_chances_that_injunction_preventing_immigration_orders_being_implemented_will_be_overturned_are_slim_comments_1540910088.html","title":"Chances that injunction preventing immigration orders being implemented will be overturned are slim","title_page":"Blog: Chances that injunction preventing immigration orders being implemented will be overturned are slim","title_rss":"NULL","source_domain":"americanthinker.com","text":"The Department of Justice is appealing a decision by a Texas circuit court judge that granted an injunction preventing implementation of the president's executive orders on immigration. The appeal, to the 5th Circuit Court of Appeals, will determine whether the injunction can be lifted while the matter is before the courts. Bad news for the president; the 5th circuit announced the names of the 3 judges who will hear the DoJ brief - two Republicans and one Democrat. The 5th Circuit U.S. Court of Appeals announced Monday that the three-judge panel scheduled to hear arguments on the Justice Department's request for a stay of an injunction against Obama's immigration actions will consist of Judges Jerry Smith, Jennifer Walker Elrod and Stephen Higginson. Smith was appointed by President Ronald Reagan, Elrod by President George W. Bush and Higginson by Obama. Smith is the best known of the trio. During oral argument on a health care related case... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/04/chances_that_injunction_preventing_immigration_orders_being_implemented_will_be_overturned_are_slim_comments.html"}
individual mandate in the health care law, 5-4.)\nThe split on the appellate panel is consistent with the overall lean of the 5th Circuit, which is considered the country's most conservative federal appeals court. Its active Republican-appointed judges outnumber Democrats, 2-1.\nThe panel is set to hear two hours of oral argument Friday morning in New Orleans on the issue of whether to stay a district court judge's injunction from February blocking Obama's efforts to offer deferred deportation and work permits to millions more undocumented immigrants.\nThe same three judges are unlikely to make the ultimate decision on the legal merits of the lower court judge's ruling. Instead, the current panel is assigned to wrestle with the immediate question of whether the injunction should remain in effect while an expedited appeal goes forward.","url":"https://www.americanthinker.com/blog/2015/04/chances_that_injunction_preventing_immigration_orders_being_implemented_will_be_overturned_are_slim.html"}
