{"authors":["Talia Schlanger"],"date_download":"2018-10-23 02:04:47","date_modify":"2018-10-23 02:04:47","date_publish":"2018-07-17 00:00:00","description":"Dave Matthews' opinions on U.S. race relations, excitement for a new band line-up and acceptance of \"Crash Into Me\" are all products of reflection.","filename":"data/vaneerConsumption/ChangeIsNeverEasyDaveMatthewsPastMotivatesHisPresent.json","image_url":"https://media.npr.org/assets/img/2018/07/16/gettyimages-913969884_wide-6c70b4fcf42984eb60afde50cd322d21bcbbb9eb.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_world-cafe_2018_07_17_629471390_change-is-never-easy-dave-matthews-past-motivates-his-present_1540260287.html","title":"'Change Is Never Easy': Dave Matthews' Past Motivates His Present","title_page":"'Change Is Never Easy': Dave Matthews' Past Motivates His Present : World Cafe : NPR","title_rss":"NULL","source_domain":"npr.org","text":"'Change Is Never Easy': Dave Matthews' Past Motivates His Present\nEnlarge this image toggle caption Frazer Harrison/Getty Images Frazer Harrison/Getty Images\nSet List \"Samurai Cop (Oh Joy Begin)\"\n\"Recently\"\nWith its explosive start in 1991, Dave Matthews Band pulled off an incredibly rare rock and roll feat. The band captured an entire generation of young people with songs that featured the unlikely combo saxophone and violin — songs that were more intricate, off-kilter, socially conscious and frankly musical than you usually hear drum up that much mass excitement.\nAlmost three decades in, the band's energy and stamina in live shows will still make your head spin. You're going to hear live performances from a show I was at in Camden, N.J., in June. By the 3-hour mark, my feet were getting tired, but Dave's energy was just hitting its peak.\nDave Matthews Band's new album is called Come Tomorrow, and Dave is clearly excited about it. He's also excited about the band's current lineup. The biggest change right now is that Boyd Tinsley, the band's original violinist, left in February citing health reasons and later faced sexual harassment allegations, which he's denied. We talk about Dave's thoughts on the band without Boyd.\n\"In this band ... I want everything that you have. I want every bit of musicality you have. That's what I demand from everybody,\" Dave says. \"Boyd has not been able to bring that or a long time ... and for that reason, he had to go and take care of himself.\"\nWe also talk about Dave's reaction to hearing the DMB song \"Crash Into Me\" used in the film Lady Bird, plus how being born into apartheid-era South Africa shaped his views on race, and what he thinks the United States could learn about race relations from the way his homeland has dealt with its painful past.\n\"So much to say,\" as Dave has been known to sing. Listen to the full conversation in the player and read interview highlights below.\nInterview Highlights\nOn a band lineup without Boyd Tinsley\nBoyd needed to go and focus on the things that, I guess, he's focusing on now. It was very hard for him, and it's been quite a while, to give the focus to this band that I wanted. In this band ... I want everything that you have. I want every bit of musicality you have. If you are the most magical improviser, and you have a voice that has never been heard before, I want that, and I want every part of it. I don't want it modified. I don't want you to play the notes, I want you to play your notes, and I want you to give it everything. And that's what I demand from everybody, and I think what everyone demands from me. And Boyd has not been able to bring that for a long time and for that reason, he had to go and take care of himself. Change is never easy, even if it's for the better.\nThe band right now is like 10 times what I've felt for years. I feel the gates open because we have an incredible keyboardist and vocalist named Buddy Strong ... It is so invigorating and uplifting at the moment to play with Buddy, and the band, we all feel it. To be on stage right now, I have no idea what to expect from him. It's so exciting. I can't imagine what this band is going to sound like in September. I don't even know if I deserve at age 51 to have this much joy on stage. It's been decades since this band's had so much joy.\nOn the new album's \"radical ideas\"\nThe things that connect us are now, in this strange world, are the radical ideas. And to say we're all the same, people get deeply upset about that. The lives of people that were not born in America are absolutely, in every way, as important as the lives of people that were born in America. It's insane to think there's a good percentage of people in this country that don't believe that. That is bizarre and terrifying to me that someone might think of a person that's looking for a better life as a parasite simply because they're looking for a better life. Or that they're dangerous, simply because they see God in a different light. That's the doom of the human race if we separate ourselves out. Until we realize that, if everyone's not included with the same respect, we're all doomed.\nOn living in apartheid-era South Africa\nI spent some of my childhood as a white South African. I can never know what it's like to be an Indian South African or a black South African, or what they would call it, a colored South African, a mixed-race South African. But I know from my view as a person, because of my mother and the way I was raised, I was raised that judging someone for something they were born with is absurd. A system like that can only be justified because somebody wanted more than their share at some point. And it's the same history we have [in the United States] in many ways. Our society, our country, was born out of division, born out of wealth created from oppression. We teach in our history classes here that this country was born on an ideal of justice and an ideal of freedom, but that's gobbledygook.\nI renounced my South African citizenship and came to America, which I was already a citizen here because I had grown up here. But I went back all through the '80s all the time but as a tourist, always. I'd go back and hang out with all my friends that were in college there and got to witness confrontations between police and university students, which was invigorating and terrifying — and beautiful because of the outcome, in hindsight. Even though I was there with friends as part of the population, I still wasn't a part of the oppressed majority, but I wanted to be part of the struggle of it. That was an amazing part of my life. [It] made me define myself and my position in the world.\nA lot of people would say South Africa is not in a perfect situation now, but then I always want to remind people that it's only a few decades old for a nation. And for a nation to only be a few decades old and to be that far ahead in many ways, that far ahead of this country and how it's dealing with its race relations, is a lesson to us and almost an admonition of us. We need a true reconciliation commission in this country to really look at our past or we're not going to come out of it with a real resolution.\nOn \"Crash Into Me\" in Lady Bird\nIt was such a simple, beautiful use of the song. In a weird way, it kind of made me comfortable with the song, too. The song has a very young quality to it about a young view of intimacy. I was in my early 20s [when I wrote it], and now I'm not. But then when I saw this film, it made me stop being so possessive of what my opinion was, and it became much simpler. It actually was a little cleanse for me personally. I think it's a brilliant film, and I was lucky that she chose to put that song in there.\nOn performing at Seattle's March For Our Lives rally alongside Brandi Carlile\nYouTube\nI found Brandi. She's one of my heroes musically, and she's just an awesome powerhouse. She said, \"You should play something.\" And I was like, \"No, no, no,\" because I don't want to jump on anyone else's situation. But then I thought about it a little bit as we walked to the final destination, and her words started working in my head, so I went up and just played one song. I borrowed her guitar. I think I played \"Mercy\" because that's a simple song. It's a simple message.","url":"https://www.npr.org/sections/world-cafe/2018/07/17/629471390/change-is-never-easy-dave-matthews-past-motivates-his-present"}
