{"authors":[],"date_download":"2018-10-30 19:32:07","date_modify":"2018-10-30 19:32:07","date_publish":"2018-08-29 18:00:00","description":"Chandler Burks is coming off an exceptional junior season.","filename":"data/vaneerConsumption/ChandlerBurksreflectsoncommittingtoKennesawState.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/22/Images/20180801_KSU_FB_TrainingCamp-352.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_chandler-burks-reflects-committing-kennesaw-state__1540927927.html","title":"Chandler Burks reflects on committing to Kennesaw State","title_page":"Chandler Burks reflects on committing to Kennesaw State ","title_rss":"NULL","source_domain":"ajc.com","text":"Chandler Burks is coming off an exceptional junior season.\nWhile leading the Owls to the Big South title, a 12-2 record and the FCS playoffs for the first time in the team’s three-year history, Burks became the first Big South player to be named Offensive Player of the Year and Scholar-Athlete of the Year in the same season and the first Owl to rush and pass for over 1,000 yards in a season, among other accolades.\nA graduate student, Burks enters his final season as an Owl after graduating with a bachelor’s degree in sports management in 2017, working through an ACL injury in 2015 and solidifying his spot as the Owls starting quarterback and undisputed team leader.\n“He’s really been the vocal leader of the team,” senior wide receiver Justin Sumpter said. “He’s like the head coach. He’s like another coach (Brian) Bohannon for us pretty much. He’s always there to motivate us. ... He is probably one of the greatest leaders I’ve ever been around, and just the things that he’s done for his team, it’s just been outstanding.”\nIn June 2013, the former South Paulding High School quarterback took a leap of faith and became the first recruit to commit to Kennesaw State’s start-up football program just 45 minutes from his hometown of Douglasville.\nWhile many high school recruits would rather choose to be part of an established program that had a reputation and a chance of winning a championship before they arrived, the decision to commit to Kennesaw State was made comfortable because of Bohannon, who had been an assistant at Gardner-Webb, Georgia Southern, Navy and Georgia Tech.\nAlthough there were many unanswered questions surrounding the new program, Bohannon convinced the 17-year-old Burks that together they could build a championship program out of nothing.\n“It was very easy for me (to choose Kennesaw State),” Burks said. “When I was looking at going to play college football, I was looking at the coaching staff (mostly) because they were going to be my father figures for the next four to five years. So that was something that I took a lot into consideration knowing what kind of people they were, what kind of core values they carried.”\nOne of the biggest factors in Burks’ decision to commit to the Owls was when Bohannon hired Burks’ high school football coach Tim Glanton as running backs coach in May 2013.\nBurks verbally committed one month later. He was a believer in Bohannon’s vision.\nLast season, Kennesaw State’s Big South championship finally gave outsiders proof that the future Bohannon envisioned from the program’s humble beginning is achievable.\n“What (the senior class has) done here is really unreal when you think about what’s happened in their time in that short period of time,” Bohannon said during training camp. “They’re going to be unbelievably missed when they’re gone I can promise you, but the whole objective for those guys when we signed them was, ‘Listen, we want you to leave a legacy and lay a foundation that even though you’re physically gone’ ... They’ve done that.”\nWhile Bohannon and Burks freely admit their roles in creating a culture that will define Kennesaw State football for decades to come is far from complete, Burks looked back in awe over all the team accomplished in three seasons.\n“It’s kind of surreal to think that we were just a bunch of guys that bought into a vision that our head coach laid out for us,” Burks said. “We bought in, went all in and we helped lay the foundation. We helped build a culture that we wanted to build the team on which is effort, attitude and toughness and were able to see the fruits of our labor unfold on Saturdays when we’re able to put in that hard work, able to see it all come together in the end.”\nKennesaw State kicks off its season at 7 p.m. Thursday at Georgia State. The game can be streamed on ESPN-Plus.","url":"https://www.ajc.com/sports/chandler-burks-reflects-committing-kennesaw-state/x8IzQBrfA8HiW3mQ4WAUzK/"}
