{"authors":["John Hayward"],"date_download":"2018-10-30 19:27:32","date_modify":"2018-10-30 19:27:32","date_publish":"2017-04-26 00:52:11","description":"Security analysts are worried about guns, missiles, and mines falling into the hands of terrorists and criminals in Venezuela.","filename":"data/vaneerConsumption/ChaosinVenezuelaCouldPutMissilesFirearmsinHandsofGovernmentTiedTerrorists.json","image_url":"https://media.breitbart.com/media/2017/04/protesters-venezuela-government-ap-image.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_04_25__1540927652.html","title":"Chaos in Venezuela Could Put Missiles, Firearms in Hands of Government-Tied Terrorists","title_page":"Chaos in Venezuela Could Put Missiles, Firearms in Hands of Government-Tied Terrorists | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Security analysts are worried about Venezuelan guns, missiles, and mines falling into the hands of terrorists and criminals now that socialist strongman Nicolas Maduro has begun arming his militant supporters to crush dissent.\n“Maduro is a dictator with close ties to terror-sponsoring regimes, and is now promising a ‘gun for every militiaman’ as his thugs counter the Venezuelan people’s peaceful pro-democracy protests with violence and lethal force. This reckless action reeks of desperation and raises the possibility that Maduro could lose control over dangerous weapons systems,” warned Senator Marco Rubio (R-FL), as quoted by the Miami Herald.\nThe Herald cites documents that show Venezuela has purchased hundreds of Russian Igla-S missiles, similar to American Stinger surface-to-air missiles. Terrorists turning such missiles against commercial aircraft is a recurring nightmare for security experts. The Igla-S is a 24-pound weapon that can take out an aircraft from over three and a half miles away.\n“I remember U.S. officials being petrified about these things ending up in the hands of the wrong people and that was dozens of these things. In this case, we are talking about perhaps… thousands of these weapons,” former Assistant Secretary of State Roger Noriega told the Herald.\nIn fact, Venezuela’s arsenal is thought to contain up to 5,000 surface-to-air missiles, plus about 400,000 anti-personnel and anti-tank mines.\nIt is bad enough that Maduro is planning to arm 400,000 undisciplined, untrained militiamen – ostensibly just with rifles for the moment – but he is also on cozy terms with Colombia’s Marxist FARC guerrillas and the terrorists of Lebanese Hezbollah. Just yesterday, the head of FARC accused Venezuelan protesters of launching a “criminal onslaught” against socialism and accused the United States of using dissidents as proxies to topple the Maduro government.\nA high-ranking whistleblower recently stated that Venezuela has issued at least 10,000 passports to citizens of Syria, Iran, and other Middle Eastern nations and has no idea where most of these passport holders ended up. “They could be anywhere in the world, traveling with Venezuelan documentation,” he warned.\nThe chaos in Venezuela makes it all but inevitable that the government and military will lose control of some weapons. The death toll from protests this month has climbed to 12, most recently including a man who was shot in the neck at a pro-Maduro rally. Another 11 people have been killed during overnight looting sprees, and there have been over 1,400 arrests.","url":"https://www.breitbart.com/national-security/2017/04/25/chaos-in-venezuela-could-put-missiles-firearms-in-hands-of-government-tied-terrorists/"}
