{"authors":["Ammad Omar"],"date_download":"2018-10-22 23:17:20","date_modify":"2018-10-22 23:17:20","date_publish":"2016-12-28 00:00:00","description":"Dylann Roof is facing the death penalty for the 2015 shooting rampage that killed nine black churchgoers. The self-avowed white supremacist also plans to represent himself.","filename":"data/vaneerConsumption/CharlestonShooterWontCallWitnessesOfferEvidenceDuringPenaltyPhase.json","image_url":"https://media.npr.org/assets/img/2016/12/28/ap_16352658647844_wide-df5cb17295c23414e76b2cee04b59104f856c967.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_12_28_507272096_charleston-shooter-wont-call-witnesses-offer-evidence-during-penalty-phase_1540250240.html","title":"Charleston Shooter Won't Call Witnesses, Offer Evidence During Penalty Phase","title_page":"Charleston Shooter Won't Call Witnesses, Offer Evidence During Penalty Phase  : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Charleston Shooter Won't Call Witnesses, Offer Evidence During Penalty Phase\nEnlarge this image toggle caption Chuck Burton/AP Chuck Burton/AP\nThe man convicted of the deadly shooting rampage at a Charleston, South Carolina church says he won't call witnesses or offer evidence that could spare his life in the penalty phase of his murder trial.\nDylann Roof also reaffirmed his plan Wednesday to represent himself as he faces the death penalty in the final phase of his trial.\nU.S Judge Richard Gergel expressed misgivings over Roof's decision, Reuters reports:\n\"'I think it's a bad idea,' Gergel warned, encouraging Roof to discuss his decision with his family and lawyers. \"The judge said he would allow Roof to change his mind up until the penalty phase gets under way. \"Roof said he planned to make an opening statement to jurors but did not indicate whether he would testify on his own behalf. He said he would present no evidence or witnesses. \"He made clear he wanted no details about his mental health revealed, asking Gergel to refrain from unsealing video interviews about his competency or the transcript from a hearing on the topic in November.\"\nThe Associated Press adds Roof's lawyers say they were dismissed because Roof believed they would present potentially embarrassing evidence to save his life.\nThis is not the first time the 22-year-old has opted to defend himself.\nIn earlier phases of the trial, Roof briefly acted as his own representation. As NPR's Rebecca Hersher reported at the time:\n\"For five days, Roof represented himself during the final jury selection, expressing few opinions about potential jurors as his attorneys sat next to him providing backup counsel. \"But late last week, Roof's attorneys asked the judge to reverse the decision, arguing that Roof was not equipped to adequately defend himself against a possible death sentence, and that 'allowing him to proceed would deprive him of protection against cruel and unusual punishment,' reported the Charleston Post and Courier. \"On Sunday, Roof sent a handwritten letter to the judge asking that his lawyers be allowed to represent him in the first phase of the trial, during which evidence is presented, but not during the sentencing phase, in which arguments will be presented for and against the death penalty.\"\nJurors eventually found Roof guilty on 33 federal charges, including hate crimes, for the 2015 attack that killed nine parishioners at the Emanuel African Methodist Episcopal Church.\nFor the sentencing phase, his defense lawyers wanted to call mental health experts to testify on his behalf, but according to the Associated Press, Roof rejected that plan:\n\"In his hate-filled, racist journal read to the jury during his trial, Roof said his doesn't believe in psychology. \"'It is a Jewish invention and does nothing but invent diseases and tell people they have problems when they don't,' Roof wrote.\"\nMeanwhile, according to South Carolina Public Radio's Alexandra Olgin, prosecutors have a list of more than 30 witnesses who may testify during the sentencing phase.\nThat phase of his trial begins next week.","url":"https://www.npr.org/sections/thetwo-way/2016/12/28/507272096/charleston-shooter-wont-call-witnesses-offer-evidence-during-penalty-phase"}
