{"authors":[],"date_download":"2018-10-30 18:40:10","date_modify":"2018-10-30 18:40:10","date_publish":"2018-08-08 21:48:00","description":"APS will have turned over six of its partner schools to three outside managers by 2019 in a bid to improve troubled schools.","filename":"data/vaneerConsumption/Chartergroupstrytoturnaroundpublicschools.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/08/Images/carver%20crop.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_nonpro_dc49933b546e1d935a49a1ac3f0fa10f__1540924810.html","title":"Charter groups try to turnaround public schools","title_page":"Charter groups try to turnaround public schools","title_rss":"NULL","source_domain":"ajc.com","text":"In the latest push of a pioneering attempt to revive failing schools, Atlanta Public Schools turned over Carver High School to outsiders who restructured it and hired new teachers.\nAPS handed over Carver operations this year to the nonprofit Purpose Built Schools Atlanta, a spin-off of the well-regarded Drew Charter School. Six Atlanta schools will be run by three charter-related groups when the district’s outsourcing plan is fully implemented by 2019.\nThe system hired outside groups because APS couldn’t overhaul all of its troubled schools on its own, officials said. The decision came amid a looming threat that the state could take over the worst performing schools.\nIt’s too early to know if the high-stakes bet will pay off. But supporters point to promising signs that the wager, which involves millions of dollars and a couple of thousand students from poor neighborhoods, will be worthwhile. Superintendent Meria Carstarphen said she’s pleased with how contractors have performed in the first two years but cautions there’s not enough information “to take a victory lap, or to throw in a towel.”\nPrincipal Yusuf Muhammad, whose friendly presence in Carver’s hallways didn’t change after Purpose Built took over said: “This is a defining year. I think it’s going to be tough. Every first year for a school is tough.”\nCarver High School Principal Yusuf Muhammad talks about the new S.T.E.A.M. Academy at Carver High School on Aug. 2. Jenna Eason / Jenna.Eason@coxinc.com (Jenna Eason/Jenna.Eason@coxinc.com)\nIn several Atlanta schools already under new management, English and math test scores nudged up. Officials report that hostility from parents during the first school’s conversion has subsided. And Carver students, such as 17-year-old senior Brianna Brown, credit the fresh approach for exposing them to new opportunities.\n“I never knew I could get an internship at a place like AT&T,” said Brianna, who secured a summer position — and her own cubicle — through a Purpose Built program.\nThe new managers choose which teachers keep their jobs and how to run the schools — flexibility that comes with controversy and expectations that student performance and graduation rates will rise. The outsourcing is one part of the district’s multi-pronged turnaround strategy that includes extra support and funding for other low-performing schools as well as closing and merging schools.\nHiring outside groups to run public schools is a unique approach in Georgia and rare across the country, where similar partnerships have popped up in the last five to 10 years — mostly in urban districts looking to turn around troubled schools. The Georgia Department of Education said no other districts in the state are using the partner model. School leaders in Gwinnett, Cobb, Fulton, DeKalb, and Clayton aren’t considering the strategy.\n8/2/18 - Atlanta - The S.T.E.A.M. Academy at Carver High School starts off the new year under new, nonprofit management. Jenna Eason / Jenna.Eason@coxinc.com (Jenna Eason/Jenna.Eason@coxinc.com)\nThe task ahead for Carver is daunting.\nThe state gave the high school an F-grade in 2017 and 2016. All of its students are eligible for free or reduced-price lunches, one marker of poverty.\nStudent attendance can be spotty and parental involvement has lagged. The school had 588 students last year, but the number shifts as students come and go.\nThe school has been in flux, too. APS had operated four separate schools simultaneously on the campus. One of them, Carver Early College, remains under APS operation.\nIn 2016, APS signed a 14-year deal, which is expected to pay Purpose Built $29.2 million this year alone, to run Carver and three schools that feed it — a middle school and two elementary schools.\nPurpose Built’s success hinges on whether it can graduate more Carver High School students. The goal is to raise graduation rates to 75 percent in five years, 82 percent in 10 years, and 90 percent by the year 2030.\nCarver graduated 74 percent of its class of 2017, up about 7 percentage points over the previous year.\nA controversial element of the contract allows Purpose Built to replace APS employees and hire its own staff.\nVerdaillia Turner, president of the Atlanta Federation of Teachers, calls the staffing maneuver “cherry picking” and remains unconvinced that giving up control of public schools is a good idea.\n“There is nothing magic about them,” she said, of the outside operators. “These are not interventions. These are nothing but a new governance system.”\nOf the 69 APS employees who worked there last year, 29 applied for jobs at Carver and were interviewed. Purpose Built offered jobs to 21 and 19 accepted. Muhammad, now in his third year as principal, remains as well as two assistant principals.\nStudents noticed the changes.\n“I didn’t know what to expect since I heard a lot of our teachers were leaving and [those were] the faces I was used to seeing. So, now change is a good thing, but you’ve got to see the outcome of it,” said senior Stephen Heagbetus, 17.\nAs part of its rebranding, Carver was rechristened as a science, technology, engineering, arts and math academy with a focus on hands-on learning.\nCarver High School students Nicholas Neal and I-Tavious Scott, left to right, race to put the cups up for their project in which they create graphs based on their timing at S.T.E.A.M. Academy at Carver High School on Aug. 2. Jenna Eason / Jenna.Eason@coxinc.com (Jenna Eason/Jenna.Eason@coxinc.com)\nDuring a recent forensics class, students hovered over a staged crime scene with two dummies on the floor.\nIn another classroom, Sascha Brown’s students worked on charts and graphs using data gleaned from how long it took them to stack and unstack cups. What impressed Muhammad was seeing how engaged the teens were.\n“These are some of the toughest kids in school, and they’re babies,” he said, as he left the environmental science class.\nPurpose Built ushered in other changes. Carver started earlier than APS-run schools. Its school days are an hour longer, except on Fridays, when students leave early so teachers can gather for professional development.\nCarver added counseling services and has teams knocking on doors to connect with parents.\nCarver High School junior Darius Dillard talks about his experience as an intern with Delta over the summer. Jenna Eason / Jenna.Eason@coxinc.com (Jenna Eason/Jenna.Eason@coxinc.com)\nAn internship program gave 28 students a chance to work at some of Atlanta’s biggest companies. Stephen, the Carver senior, and Darius Dillard, a 16-year-old junior, interned at Delta. Darius said the experience exposed him to new material and heightened his interest in mechanical engineering.\nPurpose Built’s work in the elementary and middle schools has had time to show results.\nIt’s been two years since Purpose Built took over Thomasville Heights Elementary School and one year since it began running Slater Elementary and Price Middle schools.\nJarod Apperson, who teaches economics at Spelman College, crunched state test scores to figure out if the outside managers were boosting achievement. His conclusion: “Possibly.”\nThe math and English language arts results he looked at showed Thomasville made gains under Purpose Built compared to the year before the outsourcing. The improvement Thomasville made from 2016 to 2018 was greater than that of 70 percent of other APS schools, leading Apperson to conclude the partnership has had a “positive,” if not dramatic, impact.\nHis analysis showed scores at Price Middle improved modestly but dropped at Slater Elementary.\nBarbara Preuss, Purpose Built’s head of school, said she was disappointed by Slater’s test results. The school has responded by working with small groups within classes so teachers can work closely with students who need help.\n“We are not going to make excuses. …We know that we need to make even larger gains this year to make up for it,” she said.\nBut overall, officials are pleased.\nSome parents expressed skepticism and mistrust when strangers took over the first school.\n“I would say that some of that family angst has been tamped down. It really depends on if the families had experience with Purpose Built or any of the partners. There’s a lot of concern about what is happening; so many things are changing,” said Gayle Burnett, who leads the district’s efforts to support and monitor partner and charter schools.\nResearchers at the Center on Reinventing Public Education at the University of Washington in Bothell who have studied the emerging partnership model said APS appears to be on the right track.\nThe challenge is that improvement takes time. Amid excitement over a new approach, there’s the fear that someone might walk away if results don’t come quickly enough.\n“There’s also the risk of over-promising,” said research analyst Sean Gill. “I do think it’s like, how do you keep that momentum going?”","url":"https://www.ajc.com/news/local-education/nonprofit-takes-over-atlanta-high-school-turnaround/10rOI9vovcLBnRXo4W222K/"}
