{"authors":[],"date_download":"2018-10-30 20:37:27","date_modify":"2018-10-30 20:37:27","date_publish":"2014-05-22 21:35:43","description":"Authorities have dropped the charges against one sister and filed them against another in a fatal hit-and-run in Gwinnett County.","filename":"data/vaneerConsumption/Chargesfiledagainstdifferentsisterinfatalhitandrun.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/05/22/Images/photos.medleyphoto.5283919.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_charges-filed-ag_7abc7ae55fc7156f0a2628cfb183f43f__1540931847.html","title":"Charges filed against different sister in fatal hit-and-run","title_page":"Charges filed against different sister in fatal hit-and-run","title_rss":"NULL","source_domain":"ajc.com","text":"Authorities have dropped the charges against one sister and filed them against another in a fatal hit-and-run in Gwinnett County.\nRuth Escobar, 50, had been charged in the incident that killed an 85-year-old Norcross man on April 13. Her sister, Esther Escobar, 46, testified in a hearing on April 24 and claimed responsibility for the incident, Gwinnett County police said in a news release today.\nAfter further investigation, Esther Escobar was determined to be the driver who struck and killed Kanaiyalal P. Patel. She was charged Wednesday with first-degree vehicular homicide, felony hit-and-run, driving without a valid license, failure to stop at a stop sign, and an equipment violation for the vehicle’s tires not having enough tread, police said.\nA witness saw the driver of a maroon 1999 Ford F-150 pickup truck hit Patel as he was walking across Kings Ridge Drive at the intersection with Singleton Road, police previously said. The witness followed the driver to Oakbrook Pointe Apartments in Norcross and helped officers locate a suspect. Ruth Escobar was arrested.\nNow Esther Escobar is charged in the case, but her sister Ruth remains in custody at the Gwinnett County Detention Center for an immigration violation hold.\nPolice said they are continuing to investigate the incident and possible efforts to cover up the crime.","url":"https://www.ajc.com/news/local/charges-filed-against-different-sister-fatal-hit-and-run/xpzA2RSN7JTG0VQSQm4nLP/"}
