{"authors":[],"date_download":"2018-10-30 01:05:39","date_modify":"2018-10-30 01:05:39","date_publish":"2015-05-21 15:20:00","description":null,"filename":"data/vaneerConsumption/CharterSchoolsTheNewWhiteRulingClass.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/05/LSRC-2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861539.html","title":"Charter Schools: The New White Ruling Class?","title_page":"Charter Schools: The New White Ruling Class?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Raleigh, N.C.\nBereft of arguments to discredit charter schools on their merits, education bureaucrats are resorting to one of their favorite go-to arguments in a jam—accuse the opposition of racism and re-segregation.\nAlthough this renewed offensive is unfolding on a national scale, North Carolina has become an epicenter for the conflict, as school-choice advocates and education establishment interests cross swords. The battle came to a head recently when a Duke University study claimed that charter schools don’t live up to their promise of attracting and retaining minority students.\nEager to jump on the bandwagon and generate a national story, the Washington Post spun a headline claiming the Duke study is proof that white parents in North Carolina are using charter schools to “secede” from traditional public schools, resurrecting age-old claims that any conservative reforms are tantamount to re-segregation.\nNorth Carolina might be a hotbed for the current conflict, but the battle remains heated in states across the nation where charter schools have made inroads—Connecticut, for example, where charter schools are accused of being “hyper-segregated.” Leftist reporters have even gone so far as to criticize the Obama administration for seeking to expand charter schools nationwide. (The juxtaposition is odd—the first black president supports schools that supposedly discriminate against minorities?)\nHere in North Carolina, the Duke study—commissioned by the National Bureau of Economic Research and written by Helen Ladd and two other Duke professors—primarily keyed off the fact that charters are not required by law to offer transportation and school lunch services.\n“These services are essential for any school hoping to attract substantial numbers of minority and low-income students,” Ladd and her researcher wrote in an editorial for Raleigh’s News & Observer. “Largely because so many charter schools do not offer transportation and lunch, as a group they have increased racial and socio-economic segregation in North Carolina’s schools.”\nThe Duke University study is simply the latest front in an ongoing war in North Carolina over charters. Liberal advocates have organized a variety of anti-charter efforts in the state that attempt to discredit the schools on the basis of transparency and accountability. Now we can add claims of racial inequality to that list.\nCharter school supporters were quick to dismiss the study’s findings. Darrell Allison, president of Parents for Educational Freedom in North Carolina, called the conclusions “false and disingenuous.” He pointed out that North Carolina charter schools enrolled a greater percentage of African-American students during the 2013-2014 school year than did traditional public schools.\nIndeed, one of charter schools’ chief selling points is that they expand educational options for low-income and minority students who would otherwise languish in a failing inner-city public school.\nThe Duke study’s timing, and the timing of the broader offensive in general, are convenient. Charter schools are taking off in the Tar Heel State, due in part to recent laws from the Republican-controlled government. Ever since the first charter schools arrived on the North Carolina scene in the mid-1990s, the schools have faced a hostile environment—a state education bureaucracy that looked askance at them and an arbitrary 100-school cap on total charters allowed.\nThat all began to change in 2011 when the GOP-controlled legislature and a reluctant Democratic Gov. Bev Perdue teamed up to lift the 100-school cap. Soon afterward, a record-breaking number of charter applications flooded in. Despite the fact that dozens of new schools have opened across the state, the student waiting-list for charters remains long.\nClearly, the demand is present for these innovative new schools. When given a choice, parents flock to learning opportunities where their children will have the best chance for success. For that reason, charters threaten the establishment’s vice-like grip on the education infrastructure and must be targeted.\nThe recent charter school victories in North Carolina and corresponding renewed attack from the Left have national implications. When conservatives begin to make inroads in a state, the Left will wage a fierce battle to reverse those trends. In that respect, it’s critical that conservatives resist simply playing defense and go on the offensive.\nThankfully in North Carolina, that spirit is alive and well. Local charter school supporters are already banding together to create positive messaging about the benefits and accomplishments of charters.\nThe National Charter School Initiative (NCSI) will make its debut in North Carolina this summer. Though the ultimate goal is to achieve a nationwide scope, NCSI will initially focus on defending and advancing charter schools in the Tar Heel State and will focus on educating the public on the positive impact charters schools are having.\nAided by NCSI, charters schools will have the opportunity to enlist a professional marketing arm to help tell their unique stories. Schools will also have a platform for regional and national exposure through TV, radio, print, and digital media. The central goal is to create a steady stream of positive messaging surrounding charters.\nThe ongoing conflict over charter schools in North Carolina is a solid reminder to conservatives nationally—just because a major legislative victory is won doesn’t mean the skirmish is over. As has been seen countless times, liberals begin to fight the hardest right after significant conservative victories.\nThat’s why it’s a good step that North Carolina charter school advocates are ramping up efforts to tell the truth about these important schools.","url":"https://spectator.org/62794_charter-schools-new-white-ruling-class/"}
