{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-22 23:41:02","date_modify":"2018-10-22 23:41:02","date_publish":"2017-04-26 08:22:44","description":"Charlotte Crosby was flaunting the results of her fitness regime as she proudly unveiled her new In The Style swimsuit range in a sizzling new bikini shoot.","filename":"data/vaneerConsumption/CharlotteCrosbyflauntsfigureinbikinishoot.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/08/3F9D16A000000578-0-image-a-62_1493191878402.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446606_Charlotte-Crosby-flaunts-figure-bikini-shoot_1540251662.html","title":"Charlotte Crosby flaunts figure in bikini shoot","title_page":"Charlotte Crosby flaunts figure in bikini shoot | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's worked hard to get into shape and stay trim.\nAnd Charlotte Crosby was flaunting the results of her fitness regime as she proudly unveiled her new In The Style swimsuit range in a sizzling new bikini shoot.\nThe former Geordie Shore star also discussed her blossoming romance with her boyfriend Stephen Bear and how to feel body confident.\nScroll down for video\nBikini shoot: Charlotte Crosby was flaunting the results of her fitness regime as she proudly unveiled her new In The Style swimsuit range in a sizzling new bikini shoot\nCharlotte told MailOnline: 'Being with Stephen bear makes me broody'.\nThe bubbly beauty also revealed that Bear is a big fan of her swimwear range, and loves seeing her in the pieces on their romantic getaways together.\nQuizzed what her favourite part of her body is, the beauty revealed it was her legs, adding that her bikini body inspiration is Pamela Anderson in her Baywatch days.\nThe 26-year-old star's fitness mission has suffered wobbles due to her party lifestyle, but in recent months she has curbed her nights out and prioritised the gym.\nCharlotte told MailOnline: 'Being with Stephen bear makes me broody'\nBeach ready: Charlotte displays her toned and lean physique in an array of glamorous swimwear pieces from her new range\nToned: Quizzed what her favourite part of her body is, the beauty revealed it was her legs\nPin-up: The star revealed her bikini body inspiration is Pamela Anderson in her Baywatch days\nShe said: 'I’ve been working really hard this year so I felt really confident shooting my new swimwear collection - the mesh bikini was one of my favourites as it’s got really flattering high waisted pants and it’s a mix of sporty and sexy.\n'There’s also a khaki bikini with black strap detail that I felt really confident in.'\nCharlotte displays her toned and lean physique in an array of glamorous swimwear pieces from her new range.\nLooking good: Posing up a storm by the poolside, the reality star shows off her sculpted stomach in a white Bardot number\nLong and lean: The reality TV favourite displayed her endless legs by the poolside\nHot mesh: Changing into a black mesh number, Charlotte ups the sex appeal and flaunts her muscular legs\nTatted up: The star's two-piece highlighted her tiny waist and rose tattoo\nPosing up a storm by the poolside, the reality star shows off her sculpted stomach in a white Bardot number.\nChanging into a black mesh number, Charlotte ups the sex appeal and flaunts her muscular legs.\nThe star also larks about in a white one-piece with strategically placed pineapples at the bust, showing off her fun and flirty personality as she frolics on giant inflatables.\nThink pink: The star showed off her flat stomach in a pink lace-up top and matching briefs\nShe said: 'Then I think it’s really important to pick out a piece that you love as then you’ll feel excited to wear it and more confident'\nThe star continued: 'Always pack a swimsuit for when you want to stay a bit more covered'\nThe brunette explained: 'Get a spray tan before you go away - you always feel more confident when you’ve got a tan.\n'Then I think it’s really important to pick out a piece that you love as then you’ll feel excited to wear it and more confident.\n'Always pack a swimsuit for when you want to stay a bit more covered - I’ve got one that says I’d Rather Be A Mermaid and it just puts a smile on my face every time I wear it!'\nFeeling fruity: The star also larks about in a white one-piece with strategically placed pineapples at the bust\nKimono chic: Charlotte kept covered up in a long, patterned kimono\nJoking around: She was showing off her fun and flirty personality as she frolics on giant inflatables","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446606/Charlotte-Crosby-flaunts-figure-bikini-shoot.html"}
