{"authors":["Dana Varinsky"],"date_download":"2018-10-30 23:11:05","date_modify":"2018-10-30 23:11:05","date_publish":"2016-12-08 00:00:00","description":"As economies grow, many believe their their carbon emissions must, too. But new data shows countries can 'decouple' the two, cutting emissions while growing.","filename":"data/vaneerConsumption/ChartsshowhowtheUSeconomycangrowwhiledecreasingemissions.json","image_url":"https://amp.businessinsider.com/images/58498736e02ba75f658b70de-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_us-economy-emissions-2016-12_1540941065.html","title":"Charts show how the US economy can grow while decreasing emissions","title_page":"    Charts show how the US economy can grow while decreasing emissions - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"International Energy Agency\nOklahoma Attorney General Scott Pruitt, who Donald Trump has picked to lead the EPA, has spent much of his career fighting the very agency he is likely to lead. He has challenged the EPA in court multiple times, and is currently part of the group of attorneys general suing over the Clean Power Plan.\nPruitt has often offered an economic argument to justify his opposition to Obama-era EPA rules. He and many other opponents of environmental regulation adhere to the theory that as economies grow, so must carbon emissions. Energy is essential for economic development, the logic goes, and the vast majority of our energy comes from fossil fuels, which produce greenhouse gasses.\nCritics often use this reasoning to argue that EPA requirements to lower emissions — like those proposed in the Clean Power Plan — hurt the economy.\n\"The American people are tired of seeing billions of dollars drained from our economy due to unnecessary EPA regulations,\" Pruitt said in a statement December 8.\nBut in the last two years, the US and countries around the world hit a remarkable milestone: the global economy grew while carbon dioxide emissions stayed the same. Energy experts refer to the weakening link between economic and emissions growth as \"decoupling.\"\nA new report from the Brookings Institution looks into the same dynamic on a state level, comparing GDP growth between 2000 and 2014 with energy-related carbon emissions in all 50 states and Washington DC during the same period.\nTheir findings show that more than 30 states have de-linked their growth and emissions, confirming that \"cleaning up the economy doesn't necessarily put an end to growth.\"\nHere's the data.","url":"https://www.businessinsider.com/us-economy-emissions-2016-12"}
