{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 22:05:59","date_modify":"2018-10-30 22:05:59","date_publish":"2016-12-15 00:00:00","description":null,"filename":"data/vaneerConsumption/CharlesSchwabislaunchinganotherroboadvisor.json","image_url":"https://amp.businessinsider.com/images/5852c2efca7f0cc2178b5425-640-320.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_charles-schwab-is-launching-another-robo-advisor-2016-12_1540937159.html","title":"Charles Schwab is launching another robo advisor","title_page":"    Charles Schwab is launching another robo advisor - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"MyPrivateBanking This story was delivered to BI Intelligence \"Fintech Briefing\" subscribers. To learn more and subscribe, please click here.\nYet another robo advisor product from a legacy provider will hit the market, with Charles Schwab announcing on Tuesday that it plans to launch a second robo advisory service, Schwab Intelligent Advisory, in 2017, according to the Wall Street Journal.\nThe service will combine automated and human investment advice in a hybrid model, and Schwab employees and clients will begin testing the new product soon in pilot programs. The firm will continue to offer its fully-automated robo advisory service, Schwab Intelligent Portfolios, launched in 2015, alongside its new product.\nThe new robo advisory service will differ from Schwab's existing robo advisor offering in several key ways:\nHuman advisors are involved in portfolio selection. Consumers who want to sign up for the service must first answer some questions online. They're then required to speak with a professional advisor either via telephone or video call for an hour to go over their financial plan. This will likely help reassure clients that the service is tailored to their specific needs, earning Schwab customer loyalty. This contact will also better position the firm to deal with ongoing fiduciary rule-related concerns as to whether it's possible for a fully-automated robo advisor to act in a client's best interests.\nConsumers who want to sign up for the service must first answer some questions online. They're then required to speak with a professional advisor either via telephone or video call for an hour to go over their financial plan. This will likely help reassure clients that the service is tailored to their specific needs, earning Schwab customer loyalty. This contact will also better position the firm to deal with ongoing fiduciary rule-related concerns as to whether it's possible for a fully-automated robo advisor to act in a client's best interests. Ongoing human advice. The new service will encourage annual portfolio reviews, but it will also allow investors to check in with human advisors on a more frequent basis if they wish to do so. In times of market volatility and political uncertainty, ongoing human contact and faster response times will reassure investors, helping to boost customer loyalty and satisfaction. Response times to queries are also an area where fully automated robo advisors often fall down.\nThe new service will encourage annual portfolio reviews, but it will also allow investors to check in with human advisors on a more frequent basis if they wish to do so. In times of market volatility and political uncertainty, ongoing human contact and faster response times will reassure investors, helping to boost customer loyalty and satisfaction. Response times to queries are also an area where fully automated robo advisors often fall down. A higher minimum investment threshold. Schwab's fully-automated service asks for a minimum investment of $5,000, while its new service has a higher threshold of $25,000. This higher minimum investment is likely due to the fact that a hybrid model has higher operating costs, thanks to the involvement of human advisors.\nSchwab's fully-automated service asks for a minimum investment of $5,000, while its new service has a higher threshold of $25,000. This higher minimum investment is likely due to the fact that a hybrid model has higher operating costs, thanks to the involvement of human advisors. It will charge fees. While Schwab's initial service is free to use, the hybrid offering will charge advisory fees of 0.28%. These will be capped at $3,600 a year for clients with portfolios of $1.2 million or more. Again, this reflects the higher operating costs of a hybrid model as opposed to a fully-automated service.","url":"https://www.businessinsider.com/charles-schwab-is-launching-another-robo-advisor-2016-12"}
