{"authors":["Kipp Jones"],"date_download":"2018-10-30 21:51:59","date_modify":"2018-10-30 21:51:59","date_publish":"2015-07-21 18:13:58","description":"On ABC’s Jimmy Kimmel Live, actress Charlize Theron revealed she once invited President Obama to a rather seedy place.","filename":"data/vaneerConsumption/CharlizeTheronRevealsSheInvitedObamatoStripClub.json","image_url":"https://media.breitbart.com/media/2015/01/charlize-theron-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_07_21__1540936319.html","title":"Charlize Theron Reveals She Invited Obama to Strip Club","title_page":"Charlize Theron Reveals She Invited Obama to Strip Club","title_rss":"NULL","source_domain":"breitbart.com","text":"Monday night on ABC’s Jimmy Kimmel Live, actress Charlize Theron revealed she once invited President Obama to a rather seedy place.\nTheron recalled her previous appearance on the show, in March when Obama also dropped in as a guest, after which he requested a meeting with her. Nerves got in the way, she said, and the actress told Kimmel’s audience she invited Obama to a strip club.\n“This is terrible, Jimmy. This is terrible,” Theron told Kimmel as she recounted being nervous upon meeting Obama. “I have this thing that happens when I get nervous where I get so nervous that I will say something really inappropriate… it’s like Tourette’s in a weird way… it’s like verbal diarrhea.”\nTheron said Obama was pleased to be on the show because he was able to reach a different demographic.\nThen she said, “there was this pause and I didn’t know what to say and all I could come up with was, ‘Well, if you’re looking for a different demographic I can take you a strip club.'”\nKimmel quipped: “He didn’t go? I would have gotten right into Air Force One and said ‘drop us off at the nearest strip club immediately.'”\nKimmel also added, “If you said that to President Clinton you’d probably still be at that strip club.”\nWatch the video below:","url":"https://www.breitbart.com/entertainment/2015/07/21/charlize-theron-reveals-she-invited-obama-to-strip-club/"}
