{"authors":[],"date_download":"2018-10-30 14:32:29","date_modify":"2018-10-30 14:32:29","date_publish":"2018-08-17 04:00:00","description":"The cardinal flower, blooming now in Georgia, is important to the ruby-throated hummingbird. And the little bird is important to the flower, too.","filename":"data/vaneerConsumption/CharlesSeabrooksWildGeorgia.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/17/Images/newsEngin.22694382_081818-wild_Ruby-throat-%26-38--cardinal-flower.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_environment_ruby_c627c9a3a983fa7094e3a3c2c971022d__1540909949.html","title":"Charles Seabrook's \"Wild Georgia:","title_page":"Charles Seabrook's \"Wild Georgia:","title_rss":"NULL","source_domain":"ajc.com","text":"The eye-catching cardinal flower, Georgia’s reddest wildflower, is blooming now, perfect timing by nature to help fuel the fall migration of one of our most beloved creatures, the ruby-throated hummingbird.\nWith their migration in full swing now, ruby-throats have become gluttonous, quickly trying to build up body fat to provide energy for their grueling trips back to winter homes in Mexico and Central America.\nBackyard nectar feeders help supply some of that energy. But perhaps more vital are the nectar-rich wildflowers of late summer and fall that are blooming now.\nThe brilliant red cardinal flower, which blooms July to October, is especially alluring to southbound hummingbirds — even seemingly designed for the tiny birds.\nIts tubular blooms readily accommodate a hovering hummingbird’s long narrow bill and tongue, allowing the bird to reach the flower’s sweet juice that is out of reach to most other nectar-consumers.\nThe flower, though, gets something in return: The unsuspecting bird is the flower’s primary pollinator. When a ruby-throat inserts its long bill into a cardinal flower blossom, its head picks up pollen from the flower’s male parts. Then, when it visits another cardinal flower, the pollen brushes off into that flower’s female parts, resulting in cross-pollination and in genetically stronger offspring from the flower.\nSo ideal is this relationship that scientists theorize the flower and the bird evolved together to serve each other’s needs.\nRuby-throats have formed similar links with other flowers. For instance, the bird’s overland fall migration in North America is nearly synchronous with peak flowering of another tubular wildflower, the jewelweed, an important nectar source this time of year. Trumpet creeper, scarlet bee-balm and Turk-cap’s lily also seem naturally designed to lure hungry hummingbirds.\nIN THE SKY: From David Dundee, Tellus Science Museum astronomer: The moon is in first quarter tonight. Brightly shining Venus is low in the west just after dark and sets about two hours later. Mars, also brightly shining, is in the east at dusk. Jupiter is in the southwest at dusk. Saturn is high in the south just after dark and will appear near the moon on Monday night.","url":"https://www.ajc.com/lifestyles/environment/ruby-throated-hummingbird-and-cardinal-flower-together/eTMZEW9CmVXWXqxcXkdUJM/"}
