{"authors":[],"date_download":"2018-10-30 17:58:42","date_modify":"2018-10-30 17:58:42","date_publish":"2016-11-18 19:46:38","description":"About a million patients passed through the doors of Atlanta’s Northside Hospital last year &n...","filename":"data/vaneerConsumption/CharlesMSilverstein94DoctorhelpedfoundNorthsideHospital.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/11/18/Images/newsEngin.16869673_Silverstein-mug.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-obituaries_charl_1bc736ccf7ce86f4e1f9a8da9dd8b9f0__1540922322.html","title":"Charles M. Silverstein, 94: Doctor helped found Northside Hospital","title_page":"Charles M. Silverstein, 94: Doctor helped found Northside Hospital","title_rss":"NULL","source_domain":"ajc.com","text":"About a million patients passed through the doors of Atlanta’s Northside Hospital last year – roughly 16,000 of them newborn babies.\nThat might not have happened were it not for some visionary doctors, including Charles Marvin Silverstein M.D., who in the 1960s saw growth heading to Atlanta’s north side.\n“He and his colleagues said: ‘This area is going to grow,’ ” daughter Cathy Silverstein said.\nSilverstein, a diagnostic radiologist, put his all into the establishment of Northside, a project that Atlanta’s premier hospitals were against. He helped with fundraising, selection of a site for the hospital and design of Northside’s radiology department, which he opened and ran for more than two decades.\n“No doubt he was one of the driving forces behind Northside,” said Lew Brannon, former president of S&H X-Ray Co., a division of North American Philips, and Silverstein’s once-to-twice-a-week tennis partner for years.\nCharles Marvin Silverstein, radiologist, author and one of Northside Hospital’s co-founders, 94, died peacefully at his home on Nov. 8.\nHe had deep interests in journalism and medicine. But he ultimately picked a career in medicine, telling family he was stunned that smart people knew so little about their own bodies.\nHe was smart, attending Emory University at 15 and obtaining degrees from there in journalism and medicine.\nAt 19, his medical skills were put to the test. World War II was raging, and he was serving in the Navy in Key West, Fla., when he was assigned to manage a local polio outbreak in the pre-vaccine era.\nHis military service also took him to Warm Springs, where he learned the latest in polio treatments and developed a lifelong enthusiasm for exercise, daughter Cathy said.\nAfter his service in the war, Silverstein completed his radiology residency at Emory and Grady hospitals. He then co-founded the Buckhead Clinic, the first medical group in Atlanta to include doctors with a variety of specialties but emphasis on internal medicine and radiology.\nNorthside opened in 1970 and today is part of a massive cluster of hospitals and doctor’s offices near I-285 and Georgia 400 that some call “Pill Hill.” The hospital’s 60-member radiology department is rooted in Northside Radiology, which Silverstein founded in 1970 and ran until 1992.\n“He was a real leader in his department and everybody thought the world of him,” said Thorne Winter, a retired cardiologist and doctor of internal medicine.\nSilverstein treated staff and patients with respect and ran Northside’s radiology department on the principle of fairness, said radiologist James Zakem.\n“He was a pleasure to work with – a real gentleman,” he said.\nBrannon said Silverstein was a very kind person. “I never heard him say an unkind word about anybody.”\nSilverstein loved the water and ocean from his days in the Navy and spent his retirement years at his lakeside home in Sandy Springs, daughter Cathy said.\n“He also had a keen interest in the world and loved to travel, although he had little time for it,” she said.\nSilverstein retired in 1992 and the next year published “First on the Hill: Atlanta’s Medical Camelot.” The book chronicled the founding and early years of Northside Hospital.\nAs tribute to her father’s skills as a writer, publisher Longstreet Press did not change a word, Cathy Silverstein said.\nSilverstein is survived by his two daughters, Cathy Silverstein and Elizabeth Silverstein, and two grandchildren.\nAt his request, no public funeral or memorial service was held..","url":"https://www.ajc.com/news/local-obituaries/charles-silverstein-doctor-helped-found-northside-hospital/3yryVXnCQunUpghkcrhyoL/"}
