{"authors":["Caroline May"],"date_download":"2018-10-30 21:22:07","date_modify":"2018-10-30 21:22:07","date_publish":"2016-02-12 00:48:48","description":"The government provides more green cards to immigrants each month than South Carolina -- the next GOP primary state – issues high school diplomas each year, according to a new chart released Thursday by Republicans on the Senate Subcommittee on Immigration and the National Interest. |","filename":"data/vaneerConsumption/CHARTMoreGreenCardsGrantedEachMonththanSouthCarolinaIssuesHighSchoolDiplomasAnnually.json","image_url":"https://media.breitbart.com/media/2016/02/Immigrants-line-up-for-delayed-deport-and-work-permits-AP-DAMIAN-DOVARGANES-640x480.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_11__1540934527.html","title":"CHART: More Green Cards Granted Each Month than South Carolina Issues High School Diplomas Annually","title_page":"CHART: More Green Cards Granted Each Month than South Carolina Issues High School Diplomas Annually | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The government provides more green cards to immigrants each month than South Carolina — the next GOP primary state – issues high school diplomas each year, according to a new chart released Thursday by Republicans on the Senate Subcommittee on Immigration and the National Interest.\nAccording to the subcommittee, chaired by Sen. Jeff Sessions (R-AL), the United States issues an average of 83,333 green cards each month. In 2014, nearly half that number, 45,137, graduated from high school in South Carolina.\nApproximately one million immigrants were granted green cards and all the privileges that come with them, including permanent residency, work authorization, and welfare benefits after five years. The subcommittee points out that the new immigrants mean more competition for jobs and coveted college slots.\nA subcommittee analysis reads:\nNot only will these 45,137 young men and women compete against these new Lawful Permanent Residents for jobs and spots in universities and trade schools, but they will also face competition from the approximately 700,000 guest workers allowed to work in the United States through other visa programs each year, or the roughly 500,000 foreign students who are permitted to study in the United States each year (and in some cases, who have been permitted to work in the United States contrary to Congressional authorization).\nThe subcommittee pointed to the declining workforce, implying that more immigration is serving to further dilute the labor market:","url":"https://www.breitbart.com/politics/2016/02/11/chart-more-green-cards-granted-each-month-than-south-carolina-issues-high-school-diplomas-annually/"}
