{"authors":["Kipp Jones"],"date_download":"2018-10-30 18:29:51","date_modify":"2018-10-30 18:29:51","date_publish":"2016-04-06 19:41:35","description":"The Los Angeles Police Department launched a felony investigation into Charlie Sheen Tuesday after the actor allegedly made death threats against his former fiancée, porn star Brett Rossi, according to numerous reports. | Entertainment","filename":"data/vaneerConsumption/CharlieSheenUnderInvestigationforThreateningtoPuta20000HitonExPornStarFiance.json","image_url":"https://media.breitbart.com/media/2016/04/sheen-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_04_06__1540924191.html","title":"Charlie Sheen Under Investigation for Threatening to Put a $20,000 Hit on Ex-Porn Star Fiance","title_page":"Charlie Sheen Under Investigation for Threatening to Put a $20,000 Hit on Ex-Porn Star Fiance | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Los Angeles Police Department launched a felony investigation into Charlie Sheen Tuesday after the actor allegedly made death threats against his former fiancée, porn star Brett Rossi, according to numerous reports.\nThe reported investigation centers on allegations made by Rossi, whose legal name is Scottine Ross, during an interview with the LAPD last week.\nRoss is suing Sheen in civil court and claims he did not disclose his HIV-positive before they had unprotected sex. She filed a “criminal threats” report last week in California, and was awarded an emergency restraining order against Sheen.\nPolice are reportedly working to obtain a 35-minute audio tape of Sheen allegedly making the threats, according to RadarOnline and The National Enquirer.\nThe LAPD has served a search warrant at the offices of Radar in search of the tape, and officers also want to search the offices of the Enquirer in New York for “all recordings to include audio, video, electronic communication, digital and electronic data pertaining to the articles.”\nIn the recording, Sheen allegedly threatens to pay someone $20,000 to kill Rossi. He also allegedly admits that he lied to a partner about his being HIV positive, according to The New York Daily News, which confirmed the warrant with the LAPD.\nPer The Mirror, the warrant describes Sheen as saying Ross “needs to be f—king buried.” “I’d rather spend 20 grand to have her head kicked in,” he added, the New York Daily News reports.\nThe warrant also states “Ross stated that during the relationship she discovered that Sheen was infected with and being treated for HIV,” and “Ross stated that Sheen had not disclosed the fact that he was HIV positive to her.”\nSheen also allegedly said on the recording: “I can’t be f—kng extorted. It’s called treason. You know what treason is? It’s punishable by death.”\nThe legal document concludes the information “tends to show that a felony has been committed.”\nThe Daily Mail reported after Sheen publicly disclosed his HIV status late last year, he settled a $5million lawsuit out of court for an undisclosed amount with Ross.\nRoss, who he became engaged to in 2014, had accused Sheen of assault and battery, false imprisonment, negligence, and forcing her to have an abortion.\n“Ross stated that during the time she resided with Sheen she endured domestic violence, physical assaults and death threats,” the document explains, according to Radar. “Ross reported that on several occasions Sheen had brandished firearms at her and threatened her life. Ross stated that she did not report the violence and abuse at the time the incidents occurred, as she feared for her safety and was under Sheen’s control.”\nSheen’s attorney Marty Singer told the Daily News the allegations against his client are part of a “a publicity stunt.”","url":"https://www.breitbart.com/entertainment/2016/04/06/charlie-sheen-under-investigation-for-threatening-to-put-a-20000-hit-on-ex-porn-star-fiance/"}
