{"authors":["Bobbie Whiteman For Dailymail.Com"],"date_download":"2018-10-22 22:15:30","date_modify":"2018-10-22 22:15:30","date_publish":"2017-03-10 00:28:08","description":"The veteran Spanish-American actress, comedian and flamenco guitarist flashed her thighs as she walked into the Dancing With The Stars rehearsal studio in Los Angeles on Thursday.","filename":"data/vaneerConsumption/Charo65flashesherthighsheadingintoDWTSstudio.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/23/3E1E9B4E00000578-0-image-a-52_1489100653543.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299374_Charo-65-flashes-thighs-heading-DWTS-studio_1540246530.html","title":"Charo, 65, flashes her thighs heading into DWTS studio","title_page":"Charo, 65, flashes her thighs heading into DWTS studio | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It could have been a breeze that flipped up the 65-year-old's black mini-skirt, revealing her still beautiful legs.\nBut it looked as if Charo may have been holding the garment up as she walked into the Dancing With The Stars rehearsal studio in Los Angeles with a cheeky smile on her face on Thursday\nThe Spanish-American actress, comedian and flamenco guitarist was there for a practice session with her pro-partner Keo Motsepe, 27.\nScroll down for video\nDid the breeze blow up her skirt? Cheeky Charo looked as if she was holding her black mini-skirt up to reveal her shapely thighs as she walked into the DWTS rehearsal space on Thursday\nShe teamed her teeny skirt with a two-toned bright pink T-shirt with a low neckline, black leg warmers and white sneakers.\nCharo smoothed her blonde hair back from her face and teased it into a cute half up, half down style.\nThe celebrity, whose full name is María del Rosario Mercedes Pilar Martínez Molina Baeza, covered her eyes with a pair of very dark glasses that hid a lot of her face.\nFixing her shades: The still shapely 65-year-old teamed her teeny skirt with a two-toned bright pink T-shirt with a low neckline, black leg warmers and white sneakers\nPutting in practise time: The Spanish-American actress, comedian and flamenco guitarist was at the studio to work on her fancy footwork ahead of her debut on season 24 of DWTS\nHowever, she did appear to be wearing some light make-up, including foundation and blush.\nAnd her bright pink pouty lips matched the color of her top.\nCharo was at the studio to work on her fancy footwork ahead of her debut on season 24 of DWTS.\nSealed with a smooth: The blonde beauty turned to blow a kiss to fans outside the studio\nShe will compete against Mr. Bachelor Nick Viall, Olympic gymnast Simone Biles, Fifth Harmony's Normani Kordei, model and bull rider Bonner Bolton and reality television star Erika Jayne.\nOther competitors include footballer Rashad Jennings, actor and comedian Chris Kattan, former Olympic figure skater Nancy Kerrigan, former baseball player David Ross, and former A Team muscle man Mr. T.\nDWTS returns to ABC on March 20.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299374/Charo-65-flashes-thighs-heading-DWTS-studio.html"}
