{"authors":["Associated Press"],"date_download":"2018-10-23 03:38:05","date_modify":"2018-10-23 03:38:05","date_publish":"2017-03-10 13:19:09","description":"NEW YORK (AP) - Charlie Rose returns to television on Monday, following a recovery from heart surgery he says his doctors told him has been \"exemplary.\"One...","filename":"data/vaneerConsumption/CharlieRosereturningtoCBSafterheartsurgery.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/13/wire-196211-1489152572-315_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4301278_Charlie-Rose-returning-CBS-heart-surgery_1540265885.html","title":"Charlie Rose returning to CBS after heart surgery","title_page":"Charlie Rose returning to CBS after heart surgery | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NEW YORK (AP) - Charlie Rose returns to television on Monday, following a recovery from heart surgery he says his doctors told him has been \"exemplary.\"\nOne of three anchors on \"CBS This Morning,\" Rose had a heart valve replaced on Feb. 9. His return was announced on the show Friday.\nAnthony Mason filled in for Rose beside Gayle King and Norah O'Donnell for the past month. The 5-year-old CBS morning show has been getting closer to market leaders \"Good Morning America\" of ABC and NBC's \"Today\" show in the ratings, emphasizing a newsier approach.\nFILE - In this April 26, 2016 file photo, Charlie Rose attends the TIME 100 Gala, celebrating the 100 most influential people in the world in New York. After getting the doctor's report that he's had an \"exemplary\" recovery, Rose is ready to return Monday after taking a month off \"CBS This Morning\" for heart surgery. (Photo by Evan Agostini/Invision/AP, File)\nThe 75-year-old Rose, who will resume work on his PBS interview show a few days later, said he has no concerns about coming back too quickly.\n\"It's not my judgment,\" he said in an interview. \"It's the doctor's judgment.\"\nRose has a heart of spare parts. He had one valve replaced in 2002 and, after falling ill while on assignment in Syria in 2006, had another valve implanted following emergency surgery in Paris in 2006. Last month's surgery replaced the one installed in 2002, which had been expected to last about 15 years.\nHe said he'd been having a little trouble sleeping and when a doctor discovered the valve was leaking, decided to move quickly and have surgery.\nRose said he has no intention of cutting back on a schedule that has him rising at 4:30 a.m. on weekdays for a two-hour news show and taping his PBS interviews in the late afternoon, fitting in time for \"60 Minutes\" pieces.\n\"I feel that the best days are ahead of us for 'CBS This Morning,'\" he said.\nRose said he was touched by well-wishers who had emailed him while he was out.\n\"When people tell you you're a national treasure, you don't puff up your shoulders and say, 'I'm a national treasure,'\" he said. \"What you do say is that if they think that highly of me, I want to make sure that I justify it, that I'm prepared.\"","url":"https://www.dailymail.co.uk/wires/ap/article-4301278/Charlie-Rose-returning-CBS-heart-surgery.html"}
