{"authors":["Michelle Moons"],"date_download":"2018-10-30 18:08:17","date_modify":"2018-10-30 18:08:17","date_publish":"2015-03-03 20:57:46","description":"Charger electricity roared through Qualcomm stadium as fans chanted “Save our Bolts! Save our Bolts!” in support of efforts to keep their treasured team in town. |","filename":"data/vaneerConsumption/ChargersFansCheerSanDiegoStadiumPlansSaveOurBolts.json","image_url":"https://media.breitbart.com/media/2015/03/Chargers-Joe-Mahoney-Associated-Press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_03_03__1540922897.html","title":"Chargers Fans Cheer San Diego Stadium Plans: 'Save Our Bolts!'","title_page":"Chargers Fans Cheer San Diego Stadium Plans: 'Save Our Bolts!' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Charger electricity roared through Qualcomm Stadium as fans chanted “Save our Bolts! Save our Bolts!” in support of efforts to keep their treasured team in town.\nFans traveled from as far as Los Angeles to address the Chargers Stadium Task Force in an open forum Monday night, where the group took suggestions on the location and financing for a new stadium for the team.\nRecently, the team’s threat of moving to Los Angeles has intensified pressure to find a stadium plan.\nThree fans shared their enthusiasm with Breitbart California in a video message:\nFor the first half of the evening, public comments were focused on whether a new stadium should be built in downtown San Diego or in the current stadium’s Mission Valley region. An overwhelming number of fans said they would support the team staying in San Diego at either location, but many also expressed a desire to see it stay in the Mission Valley area.\n“Pretty much I’m blessed to be a Charger fan,” said one speaker. “When you think downtown…traffic nightmare,” said another. “Build it right here,” fan Doug Jensen said, “just get it done.” Support for the Mission Valley location also included reference to the greater amount of space for the great tailgating tradition. Michelle Stype said, “let’s keep it here.”\nChristiana Hoffman drove down from Los Angeles to say, “Mission Valley is the best location…keep them here.”\nHeavy support was put behind creating a multi-use facility. Downtown location supporters suggested the massively popular ComiCon event could use the downtown location.\nMany fans recalled their cherished memories of a team that has long been part of their lives and families.\nFan Gabriel Rivera voiced support for a multi-purpose facility that would attract more people. He told the panel, “I come from a Raider family,” but went on to say his family moved to San Diego when he was small and he was raised with the Chargers and that is his team now. He advocated for the Mission Valley location saying, “I’m very passionate.”\nDave Phillips just wants the Chargers to stay in San Diego. “Downtown or Mission Valley,” he said, we need to keep the team in San Diego, “let’s just get it done.”\nAnother impassioned fan said to the Spanos family, which owns the team: “You’re not going to find this kind of passion in L.A.” The Spanos family was reportedly not present, but was expected to watch the proceeding.\nRay Alexander told the task force the Chargers have been his team since 1978, and the “Chargers need to stay.”\nNicolas Ballou-Perez told Breitbart California, “To be honest I don’t care where it’s built at, just keep it here.” He said he takes the tram to get to games at the current stadium.\nAfter a ten-minute break, the crowd and task force resumed speaker remarks with suggestions for financing the behemoth project. The estimated cost is around $1 billion. Prior plans have suggested $400 million from the Spanos family and other investment partners; a $200 million loan from the NFL; and $400 million in a San Diego taxpayer subsidy.\n“You’re in the right location, you just need to use your heads,” one said. Another made a comparison to the profitability of the Cowboys’ stadium in Arlington, Texas, saying they “run that stadium like a business.” Others made mention of stadiums throughout the country that have found innovative ways to raise funds and make the money needed to finance their projects over time.\n“If we build it, they’re gonna come,” said one commenter.\nChris Shepp suggested that the task force put together quantitative data on a cost-benefit analysis and come up with a marketing campaign to reach out to those who may not be avid fans. He suggested there must be other benefits to San Diegans who do not patronize the games.\nA member of the group Save Our Bolts identifying himself as Dave said, “Tailgating is not as important as keeping the Chargers here.” Suggesting either location would be acceptable.\nLynn Stinson told the task force that as a native San Diegan and second generation season ticket holder, the task force should consider selling advertising on locker doors and other parts of the stadium: “Sell it all,” she said.\n“Personally I will prefer it here,” one local man said. He passionately recalled that the fondest memories of his childhood “were coming to the stadium as a child with my dad.” He said he would be “heartbroken” if he were not able to do that with his son.\nAnother speaker suggested a Chargers-themed bar and grill, a Chargers hall of fame, and even a wedding venue, suggesting such business could generate revenue year-round.\nOne man reminded the panel of the stadium’s use as an emergency center for the community and fire department, and the access to trolley connections at the current location.\nSelling paving stones was suggested as a way of raising additional funds, and allows fans to “buy into the stadium.” Seat licensing was another suggestion.\nThe task force closed after the last comment was taken, stating that the job Mayor Kevin Faulconer gave them was to determine a site and develop a financing plan. The meeting closed with thanks given to participants and further extensions of opportunities to comment through email. The deadline is now mid-May for suggestions from the task force on these plans.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2015/03/03/chargers-fans-cheer-san-diego-stadium-plans-save-our-bolts/"}
