{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 23:16:13","date_modify":"2018-10-30 23:16:13","date_publish":"2016-12-08 00:00:00","description":null,"filename":"data/vaneerConsumption/ChasePayhaspartneredwithLevelUp.json","image_url":"https://amp.businessinsider.com/images/58498822ba6eb66d268b7eca-640-320.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_chase-pay-has-partnered-with-levelup-2016-12_1540941373.html","title":"Chase Pay has partnered with LevelUp","title_page":"    Chase Pay has partnered with LevelUp - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Chase Chase has struck a key partnership to expand the market for Chase Pay, the bank's digital payments solution and mobile wallet.\nChase Pay has partnered with LevelUp, the Boston-based tech company that many shoppers might recognize from its square white scanners at registers at quick-service restaurants (QSRs).\nStarting today, Chase customers can use the Chase Pay app to order ahead and pay at participating QSRs in Boston to save time when getting their food and drinks. Customers can either pay ahead of time or in person at LevelUp or Chase Pay branded scanners at the counter, and they can receive special offers available through the app.\nChase plans to roll out this service to other U.S. markets in the next few months. Customers can view the full list of participating restaurants within the app.\n\"LevelUp is thrilled to be working with Chase to help their customers order ahead and pay at thousands of popular restaurants,\" said Seth Priebatsch, CEO and founder of LevelUp, in a statement. \"With Chase Pay, customers will be able to skip the line at their favorite spots and unlock savings at the same time. By seamlessly blending the value propositions of saving time and saving money, Chase Pay is making mobile payments relevant to customers.\"\nQuick-service restaurants (QSRs) — also known as fast-casual restaurants — such as Starbucks have been turning to mobile order-ahead apps to extract higher sales, intensify customer loyalty, and heighten foot traffic.\nMobile order-ahead refers to a consumer-facing mobile payment platform that allows customers to order food remotely, pay for the items on their phone, and pick up their order at a specific restaurant location.\nLeading QSRs in the U.S. are beginning to adopt these platforms at an accelerated pace and are benefiting from them. Taco Bell sees 30% higher average order values on mobile compared to in-store, and Starbucks' Mobile Order & Pay already represents 10% of total transactions at high-volume stores, directly contributing to increased company sales.\nMobile order-ahead is still in its early days, but will be a $38 billion industry by 2020, accounting for 10.7% of total QSR industry sales. This will be driven by full adoption among the top QSRs in the US, the growth of mobile commerce, QSR adoption through aggregators like Grubhub, loyalty programs, higher average order values, and new buy buttons.\nBI Intelligence, Business Insider's premium research service, has compiled a detailed Mobile Order-Ahead Report that profiles the companies that have proved the mobile order-ahead concept and analyzes the trends contributing to this new industry's growth.\nHere are some key takeaways from the report:\nMobile order-ahead apps — platforms that enable consumers to remotely purchase menu items for in-store restaurant pickup — are on the rise among quick-service restaurants (QSRs). We expect sales on these platforms to reach $38 billion by 2020, representing a five-year compound annual growth rate (CAGR) of 57%.\nMobile order-ahead will ultimately have an additive effect on the QSR industry. Mobile ordering platforms have been proven to intensify customer loyalty, increase purchase frequency, and lift average ticket sizes through order customization and easier checkout options. This means that mobile ordering is not a simple substitution for in-store purchasing, but a channel that can enhance the lifetime value of QSR customers. This makes mobile order-ahead a critical channel contributing to the growth of the QSR industry.\nAlternative commerce solutions will help propel mobile ordering. Aggregators like Grubhub will onboard smaller fast-casual restaurants into the mobile ecosystem by offering them an existing app to integrate into, lowering the upfront costs of creating a mobile channel of their own. And in-store self-service kiosks will help popularize remote ordering and accustom users to less traditional forms of payment that don't require a cash register.","url":"https://www.businessinsider.com/chase-pay-has-partnered-with-levelup-2016-12"}
