{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:38:46","date_modify":"2018-10-30 20:38:46","date_publish":"2015-07-17 15:18:25","description":"Ret Marine Col: Chattanooga Shows How 'Gun Control Mafia' Leaves Us Defenseless","filename":"data/vaneerConsumption/ChattanoogaShowsHowGunControlMafiaLeavesUsDefenseless.json","image_url":"https://media.breitbart.com/media/2015/07/ap_ap-photo1284-e1437223543718.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_17__1540931926.html","title":"Chattanooga Shows How 'Gun Control Mafia' Leaves Us Defenseless","title_page":"Ret. Marine Colonel: Chattanooga Shows How 'Gun Control Mafia' Leaves Us Defenseless","title_rss":"NULL","source_domain":"breitbart.com","text":"During a July 16 appearance on Al Jazeera’s America Tonight, Colonel Gary Anderson, USMC (Ret), said the Chattanooga attack demonstrates that the “gun control mafia” has left military personnel and citizens alike in a defenseless position.\nAl Jazeera introduced the segment by pointing out that “those who were at the [Chattanooga] recruiting station…were not permitted firearms.” And they pointed out that “this is standard protocol, not only at recruiting centers but in other [military] facilities as well.”\nCol. Anderson responded by pointing out that these claims are true–our men and women in uniform are largely disarmed–and that “part of the problem in this country is we start to see these incidents occur more and more often where people go after deliberate soft targets…[because] they know the target can’t shoot back.”\nHe then went on to point out that the disarming of our military on stateside bases and in stateside offices and recruitment centers is indicative of larger problem, seen in the way the “gun control mafia” is pushing to disarm the American people as whole.\nCol. Anderson added:\nWe can arm every recruiter, and that will help the recruiter stations in case they are attacked. We can arm every Naval Reserve Center, every Army Reserve Center, but that’s not the issue. The issue is, if [the recruiting stations and reserve centers] become hard targets, the other people that own shops and so forth in that strip mall aren’t protected themselves. I think the problem is really this pervasive gun control mafia that we have in this country, that basically advocates for taking guns away from citizens who could potentially defend themselves, and leaving the only guns in the hands of those who might do them harm.\nHe said that because of these anti-gun policies, a military facility is not the only soft target. “It can be a grammar school, as we’ve seen, it can be church, as we’ve seen so recently. You can’t protect everyone unless you actually arm the citizenry themselves, or at least allow them–and encourage them–to be armed.”\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/07/17/ret-marine-colonel-chattanooga-shows-how-gun-control-mafia-leaves-us-defenseless/"}
