{"authors":[],"date_download":"2018-10-30 18:32:08","date_modify":"2018-10-30 18:32:08","date_publish":"2017-02-16 12:47:00","description":"Revenue from traffic tickets has declined since the DeKalb County Traffic Division of State Court was formed in 2015.","filename":"data/vaneerConsumption/CheaperDeKalbtrafficticketscomewithacost.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/01/15/Images/photos.medleyphoto.8583453.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_c_54b037ee418120d0865e060d076be1e0__1540924328.html","title":"Cheaper DeKalb traffic tickets come with a cost","title_page":"DeKalb County traffic court costs  $11 million more per year","title_rss":"NULL","source_domain":"ajc.com","text":"Drivers are saving money on traffic tickets in DeKalb since the county lowered fines, but the change put a new strain on the government budget.\nThe creation of DeKalb’s traffic court — and the reduced fines that came with it — costs the county government nearly $11 million a year, according to CEO Mike Thurmond’s proposed budget.\nRevenue from traffic tickets has plunged since the Traffic Division of State Court replaced the county’s Recorders Court in 2015.\nResidents complained that Recorders Court was gouging residents for violations, jailing those who couldn’t pay and operating without clear authority to oversee traffic offenses.\nSince reaching an all-time high of $22.4 million in 2010, traffic fines and fees fell to an estimated $7.9 million last year.\nThere are several reasons for the decline:\nLower fine amounts\nAnnexations and incorporations\nFewer tickets being issued\nLower court fees\nElimination of the failure to appear fee\nDefendants can now work off their fines through community service at a rate of $8 an hour\nThe Traffic Division is also $1.6 million more expensive to operate than Recorder’s Court was, with four new State Court judges and additional staff for solicitors, public defenders and probation officers.\nThe decrease in revenue and increase in expenses is contributing to a tight county budget. The $1.3 billion budget proposal includes $93 million in deficit spending that reduces the county’s reserve funds.\nThe DeKalb Board of Commissioners plans to vote on the annual budget at the end of this month.","url":"https://www.ajc.com/news/local-govt--politics/cheaper-dekalb-traffic-tickets-come-with-cost/Pk6NAhQQpoCotuY9FSwvhN/"}
