{"authors":["Antoinette Siu","Julie Cart","Dan Morain"],"date_download":"2018-10-30 22:48:35","date_modify":"2018-10-30 22:48:35","date_publish":"2018-06-28 01:37:37","description":"California has been a national leader in the effort to expand health care coverage, but some advocates say this year’s state budget marks a step backward in the quest to reduce and ultimately eliminate the number of uninsured people.","filename":"data/vaneerConsumption/CheckupHowhealthcarefaresinCaliforniasnewspendingplan.json","image_url":"https://calmatters.org/wp-content/uploads/adult-care-elderly-748780-1-e1530149419809.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939715.html","title":"Check-up: How health care fares in California's new spending plan","title_page":"Check-up: How health care fares in California's new spending plan | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"California has been a national leader in the effort to expand health care coverage, but some advocates say this year’s state budget marks a step backward in the quest to reduce and ultimately eliminate the number of uninsured people.\nGov. Jerry Brown today signed a $201 billion spending plan that adds significant sums to the state’s rainy-day reserves, education and programs to aid affordable housing and homeless people.\nBut of the nearly $1.17 billion in new money that Democratic lawmakers sought to expand coverage, the final deal agreed to by Brown contains just $65 million specifically aimed at making premiums more affordable or addressing the millions of Californians who still have no health insurance at all.\n“There’s no way to sugar coat this: There was no new investment to help Californians access or afford health care,” said Anthony Wright, executive director of Health Access California, a consumer advocacy nonprofit that lobbies for single-payer and universal health care.\nAs the Republican-controlled U.S. Congress continues its push to dismantle the Affordable Care Act—known as Obamacare—health care advocates in the Golden State had hoped to get more state funding to offset policies coming from Washington, D.C.\nThe goal of Senate and Assembly Democrats was to bring the state as near as possible to universal coverage. To get there, they fashioned complementary bills aimed at covering different segments of California’s underinsured or uninsured populations.\nLast year, the state Senate passed a $400 billion bill to create a government-run universal health care system. The Assembly balked and shelved the bill, noting that it failed to detail how to pay for a plan whose costs appeared to exceeded the entire state budget.\nThis year, a scaled-back Assembly Democrats wish list sought just under $1 billion to expand coverage, with some $500 million intended to help lower the premiums that consumers pay for health insurance through the state’s marketplace, Covered California.\nThe Assembly proposal also would have allocated $250 million in recurring annual spending to extend coverage so uninsured young adults between 19 and 25, including undocumented immigrants, would have coverage. And it would have increased spending for health and nutrition programs for low-income women and children, and expansion of healthcare access for disabled undocumented immigrants.\nOf the roughly 2.8 million California residents who remain uninsured, about 58 percent are undocumented immigrants, according to Health Access California.\n“If we want to get to a truly universal system, one of the key things to do is to expand Medi-Cal to undocumented immigrants,” Wright said.\nThe Senate’s proposal for expanding coverage totaled around $169 million this year, and sought to expand Medi-Cal access for more seniors and the disabled.\nCurrently, the aged and disabled program for Medi-Cal covers those with an income at 123 percent of the federal poverty level. Legislators sought to broaden coverage by raising that threshold to 138 percent and expanding eligibility to all adults. That would have provided Medi-Cal coverage to all individuals with annual incomes of $16,754 or less.\nThe Senate version also included $58 million to restore optional Medi-Cal benefits that were cut during lean years of the Great Recession. Dental and optical coverage have been restored as the state’s balance sheet improved but services like podiatry, speech therapy and audiology are still not offered.\nBut the Legislature’s proposals were seen as too ambitious by Gov. Brown, who has warned against misusing the state’s recent budget surpluses by piling on pricey programs that require large, ongoing spending commitments.\n“Let’s not blow it now; we worked too hard for that,” Brown said of the surplus while announcing his 2018-19 budget proposal last month. In his final year as governor, he vowed to “try to leave the most responsible budget I can to the next governor.”\nThe result: big big-ticket programs for health care coverage were shelved in favor of smaller initiatives requiring one-time expenses.\nWhat remains for the coming fiscal year are a pair of minor provisions aimed at maintaining momentum toward universal coverage—major decisions about expanding coverage are kicked down the road.\nThe biggest addition to the new budget allocates $60 million to create a database to track and analyze how much hospitals and other health care providers are charging individuals and insurers—like Cigna, Blue Shield and others—for services, medical devices and pharmaceuticals.\nThe information is aimed at reducing ambiguity about the potential price tag of an eventual universal coverage or single-payer insurance scheme. The database, expected to be up and running by 2023, aims to reduce ambiguity about the potential price of tag of universal coverage.\nA provision co-sponsored by Democratic Assemblymen Jim Wood of Healdsburg, a dentist, and Joaquin Arambula of Fresno, an emergency room doctor, will provide $5 million for a committee that will study pathways to potential universal or single-payer care.\nWood said he was glad that the new budget contains “building blocks” and “a roadmap” for eventually bringing health care to all Californians but he expressed disappointment at the pace of the effort.\n“Funding for making progress toward universal health care…is totally inadequate in this budget,” Wood said in a statement. “To achieve a unified, publicly financed health care system—it does not go nearly far enough.\n“While this budget may provide some one-time funding to get the ball rolling, we will need a longer term commitment to get us where we need to be.”","url":"https://calmatters.org/articles/check-up-how-health-care-fares-in-californias-new-budget/"}
