{"authors":["Abc News","More Michael"],"date_download":"2018-10-30 00:55:59","date_modify":"2018-10-30 00:55:59","date_publish":"2018-10-29 10:42:48","description":"So many good costumes this year!","filename":"data/vaneerConsumption/CheckoutGeorgeClooneyJoeJonasandKendallJennersepicHalloweencostumes.json","image_url":"https://s.abcnews.com/images/GMA/celebs-halloween-gty-er-181029_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/GMA_Culture_check-george-cl_fd0578550ca2ae4f1a3329a741357b5e_story_id=58827027_1540860959.html","title":"Check out George Clooney, Joe Jonas and Kendall Jenner's epic Halloween costumes","title_page":"Check out George Clooney, Joe Jonas and Kendall Jenner's epic Halloween costumes - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"It's that time of year again with your favorite celebs getting all dressed up for Halloween!\nInterested in Halloween? Add Halloween as an interest to stay up to date on the latest Halloween news, video, and analysis from ABC News. Add Interest\nThough the real holiday is on Wednesday, the likes of George Clooney, Harry Styles and others dressed up over the weekend for various parties and events.\nHere's a look at some of the top costumes.\n\"Riverdale\" stars Camila Mendes and Lili Reinhart dressed up as their favorite \"Napoleon Dynamite\" characters. No word if they carried Tater Tots in their pockets.\nGeorge Clooney, Cindy Crawford and Rande Gerber donned flight outfits for their Casamigos party.\nGabe Ginsberg/Getty Images for CATCH Las Vegas\nJohn Legend couldn't have been a more amazing dad taking his little princess Luna out for the occasion.\nSarah Hyland and her boyfriend went dressed up as \"Taco Belle,\" a funny take on the fairy tale classic.\nKendall Jenner was channeling her inner \"Austin Powers\" for the holiday.\nHarry Styles needed no introduction, as he was the legendary Elton John.\nKevin Mazur/Getty Images for Casamigos\nRyan Seacrest went as fashion icon Karl Lagerfeld.\nSMXRF/Star Max/Getty Images\nActress Gabrielle Union went as another celebrity, Gwen Stefani.\nAnd last but certainly not least, Joe Jonas dressed up as his fiancee Sophie Turner's \"Game of Thrones\" character. Epic!","url":"https://abcnews.go.com/GMA/Culture/check-george-clooney-joe-jonas-kendall-jenners-epic/story?id=58827027"}
