{"authors":["Mika Doyle"],"date_download":"2018-10-31 01:50:31","date_modify":"2018-10-31 01:50:31","date_publish":"2018-09-06 13:00:52","description":"Girl bosses everywhere are getting a TV show just for them. Cheddar, the post-cable TV network founded by Jon Steinberg, who serves as a Bustle Digital Group board member, is launching a new weekly program called ChedHER. The new show will be full…","filename":"data/vaneerConsumption/CheddarLaunchesChedHERANewShowAboutMillennialWomenInBusinessEXCLUSIVE.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/5/a3aefbcd-9702-4f0b-bae1-42c3d9174396-kl-still-chedher.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_cheddar-launches-chedher-a-new-show-about-millennial-women-in-business-exclusive-11476283_1540950631.html","title":"Cheddar Launches ‘ChedHER’, A New Show About Millennial Women In Business - EXCLUSIVE","title_page":"Cheddar Launches ‘ChedHER’, A New Show About Millennial Women In Business — EXCLUSIVE","title_rss":"NULL","source_domain":"bustle.com","text":"Girl bosses everywhere are getting a TV show just for them. Cheddar, the post-cable TV network founded by Jon Steinberg, who serves as a Bustle Digital Group board member, is launching a new weekly program called ChedHER. The new show will be full of programming every millennial woman needs to help her achieve success in her life and career. According to a press release from the network, the half-hour show will air at 9:30 a.m. ET starting Friday, Sept. 7, and will help the show’s millennial audience with financial literacy, entrepreneurship, and career growth.\n“We created ChedHER as a single-day event prior to International Women’s Day,” Nicole Sander, senior director, brand partnerships at Cheddar, said in the press release. “After receiving amazing feedback from women and men alike, we knew we had to keep the conversation going.”\nAccording to the press release, the show, which is presented by JP Morgan Chase, will air from the New York Stock Exchange and will be hosted by Cheddar’s women anchors. Each week, they’ll highlight female leaders in their industries, and segments will include news about the pay gap, lessons from entrepreneurs, navigating male-dominated industries, buying a house as a single woman, and more.\nCheddar Partners on YouTube\n“From empowering women with financial tools to supporting their business and career growth, JPMorgan Chase is committed to advancing women everywhere,” Samantha Saperstein, head of Women on the Move for JPMorgan Chase & Co, said in the press release. “We were inspired by Cheddar’s broadcast in celebration of women earlier this year, and this new collaboration on the ChedHER show represents a continuous opportunity to collectively spark conversations and share ideas about how we can all help women rise.”\nThe show couldn't come at a more crucial time. According to a survey from accounting firm PwC, a full quarter of millennial women across the globe need more relatable role models to help close the wage gap. Visible women in top positions empower women starting out in their career to advocate for more. And when millennial women do reach those top-level positions, businesses can see major benefits. When businesses are led by a millennial woman, revenues increase by 9 to 22 percent, Forbes reports. But millennial women don't want to be boxed in by one aspect of the business world. Being a CEO would be great, but some want to be business owners. Forbes reports that 83 percent of millennial women in a 2017 survey said they wanted to start their own businesses.\nCourtesy of ChedHER\nMillennials are looking for guidance that helps them achieve their business goals, whether that's to start a new business or become a top-level exec. Since IRL mentors have been challenging to find, hopefully the ChedHER programming will offer extra guidance that helps women make the connections they need to take their careers where they've been longing to go. Who knows — maybe the show will introduce them to an industry leader they never would have known about otherwise. You can tune in to Cheddar on most streaming services like Hulu, SlingTV, Apple TV, Roku, Facebook, Twitter, and most smart TVs.","url":"https://www.bustle.com/p/cheddar-launches-chedher-a-new-show-about-millennial-women-in-business-exclusive-11476283"}
