{"authors":["Laurinda Joenks"],"date_download":"2018-10-30 20:07:24","date_modify":"2018-10-30 20:07:24","date_publish":"2016-08-11 00:00:00","description":"Jessica Keahey really likes cheese.","filename":"data/vaneerConsumption/Cheesemonger.json","image_url":"https://media.arkansasonline.com/img/photos/2016/08/11/110282399_AN-OT-0811-cheese-004-rgb_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_aug_11_cheese-monger-20160811__page=1_1540930044.html","title":"Cheese monger","title_page":"Cheese monger","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Jessica Keahey loves cheese. As founder and head cheesemaster of Sweet Freedom Creamery in Fayetteville, she currently works through the permitting process and trial batches of cheese she will produce initially through the Arkansas Food Innovation Laboratory at the University of Arkansas. She hopes to release her first cheese for retail by the end of the year. - Photo by NWA Democrat-Gazette / BEN GOFF • @NWABENGOFF\nJessica Keahey really likes cheese.\n\"My biography reads, 'I like long walks on the beach and eating cheese,'\" quipped this Hot Springs native.\nPhoto by BEN GOFF • @NWABENGOFF / NWA Democrat-Gazette\nA variety of award-winning artisan cheeses await sampling in a “Best in Show” class led by Keahey. Selections for tasting ran from a brie, to cheddars made from cow’s milk, goat’s milk and sheep’s milk, a flavored cheese, a wood-smoked cheese and a blue cheese.\nPhoto by BEN GOFF • @NWABENGOFF / NWA Democrat-Gazette\nLori Yazwinski (left) of Bentonville takes a few pieces of cheese as Jessica Keahey, founder and head cheesemaster of Sweet Freedom Creamery in Fayetteville, passes around samples. As Keahey refines her own artisanal cheese, she teaches classes “to get people understanding cheese” and maybe spark them to try their own cheese making.\nPhoto by BEN GOFF • @NWABENGOFF / NWA Democrat-Gazette\nKeahey (right) shares information and even tastes of artisinal cheese judged among the best last month by the American Cheese Society. She shared nutritional information, production processes, alcohol pairings and interesting facts about the various kinds of cheese highlighted in a cheese-tasting class through the culinary arts program of Northwest Arkansas Community College.\nPhoto by BEN GOFF • @NWABENGOFF / NWA Democrat-Gazette\nMichael Skopp and wife Riki Skopp of Siloam Springs take samples of a cheese. As class members tasted the various cheeses, the selections were describe with words like nutty, tangy, crumbly, citrus, butterscotch, mellow, creamy, buttery, caramel, grassy and smooth.\nCheese facts Jessica Keahey of Sweet Freedom Creamery in Fayetteville shared these facts about the different cheese types of cheese and of chese in general during a recent class offered by the Northwest Arkansas Community Colleged culinary arts program. • The bacterial cultures added in the beginning process of making all types of cheese are probiotic, which stimulate the growth of microorganisms with benefical properties. Some of these mircoorganisms reisde in the human gut and are necessary for digestion and nutrition absorbtion. • Blue cheese has cultures of the mold penicillian added during the aging process, which leaves the fininshed cheese spotted or veined throughout with the blue or blue-gray mold. Because of the penicillian mold, as the peptide proteins break down, the cheese will have “an awful, metallic, bitter taste” at about two months of aging. However, when the cheese is aged at least 6 months it develops the sharp, salty taste, Keahey said. • “‘Cheddar’ is a verb, an action,” Keahey explained. “It’s a special thing you do.” In cheesemaking, when the curds are formed, the cheese maker cuts the curds into big lots then stacks them together and “smooshes” out the moisture, she explained. Then, keeping the curds warm allows them to solidify again, and the cheddaring process continues until the cheese is solid. • Strong red wines are hard to pair with strong cheeses. The tannins in both “fight” to influence the flavor, Keahey said. • A lot of people have strong feelings about goat cheese, Keahey said. “They ask if they should keep trying it.” Another participant asked if the rind of the cheese should be eaten, to which Keahey gave the same response: “You can if you want. If you like it, eat it. If you don’t, don’t.” “It’s not going to kill us,” added her friend and cheese minion Julian Santa-Rita. • A cheese minion is a voluteer for Sweet Freedom Creamery, helping at events and with cheese-making tasks. Register on the creamery’s website. • “Sheep don’t produce a lot of milk,” Keahey said as participants tasted a cheese made from goat’s milk. “But sheep’s milk is dense, with high milk fats and solids. “Cows you can trick to produce year round,” she continued. “But not sheep.” Producers using sheep’s milk might make certain types of cheeses only seasonally, she said. • A lot of people turn up their noses at flavored cheeses “because you get a lot of weird flavors,” Keahey said, but she shared one of her favorites: “Briana with Truffles” by Jacobs and Brichford. “Some people don’t like truffles, but I love truffles,” she said. “I think truffles bring it to the next level. I think it’s amazing.” She noted that this cheese was expensive to make because Indiana cheese maker imports the black truffles. Also, class members were eating the cheese from its first public release. • The Shakerag blue cheese from Sequatchie Cove in Tennesee was wrapped with fig leaves soaked in whiskey, a taste that came through when eaten. The cheese name was derived from the region, where moonshine was made during Prohibition. There are two legends, Keahey said. One, that residents of the hollow would wave a rag to warn the moonshiners the revenue agents were coming, or that’s the way residents ordered more whiskey. • The “Moses Sleeper” brie from the Cellars at Jasper Hill in Vermont was named after a Revolutionary War scout who was killed on the road where the creamery now sits.\nUpcoming cheese classes Unless others wise listed, classes run from 6:30 to 8:30 p.m. at the Shewmaker Global Business Development Center, Tyson Culinary Learning Center, Northwest Arkansas Community College. Cost for all classes is $30. • History of Cheese, . • Making ricotta, Aug. 19. • Making butter, Aug. 27. • Making paneer and queso blanco, Sept. 2. • Making chevre, Sept. 3. • Bacteria, molds and fungi of cheese, Sept. 9. • The Chemistry of cheese, Sept. 23. Registration: brightwater.org Information: sweetfreedomcreamery.com\n508809 Cheese highlighted at the “Best of Show” class Each cheese was recognized at the American Cheese Society show last month in Des Moines, Iowa. Many of these have garnered other awards both nationally and internationally. • “Moses Sleeper,” a brie, by Cellars at Jasper Hill in Vermont. • “Cabot Clothbound,” a cloth-bound cheddar, by Cabot Creamery and Cellars at Jasper Hill. • “Deer Creek: The Imperial Buck,” a mature cheddar, by The Artisan Cheese Exchange. • “Trivium,” a goat cheddar, by Montchevre-Betin Cremery 333 in Wisconsin and Crown Finish Caves in Brooklyn, N.Y. • “Donatello,” an aged sheep’s milk cheese, by Cedar Grove Cheese in Wisconsin. • “St. Malachi Reserve,” a farmstead cheese made from cow’s milk, by The Farm at Doe Run in Pennsylvania. • “Briana With Truffles,” a farmstead cheese with flavor added, by Jacobs and Brichford in Indiana. • “Smoked Romano,” a smoked cheese from cow’s milk, by Gold Creek Farms in Utah. • “Shakerag,” a blue cheese, by Sequatchie Cove in Tennessee. These cheese types should be available online from the producer. Local stores with larger selections of artisinal cheese include Ozark Natural Foods in Fayetteville, Whole Foods in Fayetteville, Fresh Market in Rogers, larger locations of Harps Food Stores through Northwest Arkansas and the Blackboard Grocery and Eatery in Fayetteville.\nKeahey likes cheese so much, she's started her own creamery to make what she calls \"the perfect food,\" and leads classes in cheese history, the science behind cheese, even making cheese.\n\"We are the only dairy plant licensed\" i̶n̶ ̶A̶r̶k̶a̶n̶s̶a̶s̶,̶\"̶ through the Arkansas Food Innovation Center at the University of Arkansas, Keahey said of her Sweet Freedom Creamery in Fayetteville. \"And one of only three permitted creameries in Arkansas.\"\nLOVE AT FIRST TASTE\nKeahey took a cheese-making class in 2012. \"I love cooking, and fermenting food is really neat.\n\"I fell in love,\" said this civil engineer. \"It's the first time I've been really excited about something in a long time.\"\nThrough a friend of a friend, a food science intern and a blind date in New York set up by parents in Arkansas, Keahey learned about the Arkansas Food Innovation Laboratory at the University of Arkansas. \"They talked about me on their date,\" she said.\nKeahey started the program last year, a sort-of business incubator program for the food industry, helping producers with everything from paperwork to pasting on labels.\nCurrently, Keahey fills out paperwork to gather the federal and state permits and insurance Sweet Freedom Creamery needs to produce cheese. Also, she tests her production practices in the laboratory.\nShe hopes to make her first cheese for retail sale by the end of the year -- an aged feta not common in the market, she said.\nIn the meantime, Keahey markets her product. But more importantly, she teaches about cheese.\n\"I love, love teaching, and it's a key part of my business plan. And it's important to get people understanding cheese.\"\nShe's also learning. Keahey earned one of only a handful of scholarships to the American Cheese Society's annual convention and judging in late July in Des Moines.\"These are the best and brightest in the industry,\" she said.\nThis summer, Keahey embarked on a five-week tour of creameries across the country, talking with cheese makers about their processing and facilities. She filed information about her future facility away in her civil engineer's mind. She completed an advanced class at the Vermont Artisan Cheese Institute and also had the opportunity to study cheese making with three shepherds in Central America.\n\"I've studied cheese from Vermont to Belize,\" she said.\nNow, Keahey shares her knowledge through classes in the \"the Cheese and Dairy Series\" of the culinary arts program of Northwest Arkansas Community College. The classes are for folks \"who want to try making cheese at home or who just love cheese,\" she said. \"And maybe we'll get more folks interested in the field (of artisan cheese.)\"\nKeahey also teaches an occasional free class at Ozark Natural Foods in Fayetteville. Last Sunday afternoon, the instruction focused on how to make yogurt, a process similar to making cheese.\nDISGUSTING ROT\nThe first documented cheese dates back 6,500 years to Poland, where a residue was found in pottery, Keahey said. \"And we are learning more and more about cheese.\"\nThe artisan cheese movement in the United States started in the 1980s -- \"mostly by female artisans who had goats and too much milk,\" Keahey said. The women saw the diversity of cheese in Europe as opposed to the \"processed food to feed the masses\" in the United States and went to Europe to study the craft.\n\"American cheese is not the Kraft single,\" Keahey said. \"It's now cheddar from the English heritage.\"\nAll types of cheese are made using the same ingredients and the same initial process, Keahey explained.\nA probiotic bacterial culture is added to milk, and the milk is heated, she began. As it warms, the culture eats the lactose (or sugar) in the milk and produces lactic acid. Then, rennet enzymes are added that allow the proteins in the milk to clump together -- making the cheese curds.\n\"We are separating the solid from the water in milk,\" Keahey said. A challenge question in one of her recent cheese classes revealed to participants that cow's milk is 87.5 percent water. \"We are trying to concentrate the solids,\" she said.\nFrom that point, methods of cheese making vary, according to what type of cheese is being made.\nThe curds are allowed to decay -- called \"aging.\" The length of aging -- from several months to several years -- the location for the aging, the temperature and humidity of the \"cave\" where the cheese is aged, the shape of the cheese as it ages, additional bacteria or flavoring added to the cheese and so much more can determine the cheese's structure and taste.\n\"All these things are crucial because they can change the character of the cheese -- even the type of feed the cows producing the milk are eating,\" Keahey said.\nSometimes yeast and bacteria are added -- but they also grow naturally on the cheese -- to help eat away at the milk fat. And somewhere in the process, it becomes tasty.\n\"In cheese making, you let the microbes do all the heavy lifting,\" Keahey said. \"Making cheese is really controlled, microbiological rotting of milk. That sounds disgusting, but it's delicious. I'm fascinated every time.\"\nBEST IN SHOW\nFriday night, Keahey shared with about 20 people some of the cheeses judged best of the best of the 1,843 cheeses at the recent American Cheese Society show. \"This is world-class cheese,\" she said in the class offered by the culinary arts program of Northwest Arkansas Community College at the Center for Nonprofits at St. Mary's in Rogers.\nSelections for tasting ran from a brie to cheddars made from milk of cows, goats and sheep, a flavored cheese, a wood-smoked cheese and a bleu cheese.\n\"When you're having a cheese tasting like this, or with your friends, save the (strongly flavored) cheese until last,\" Keahey suggested. \"You don't want to coat the palette early on. Eating bleu cheese early can affect how the other cheeses taste.\"\nAlthough toothpicks were provided for class participants to try the cheese, \"grabbing cheese with your hands is just part of eating cheese,\" Keahey said, noting that foreign cheese makers think too many regulations in the United States leave cheese making too sanitized and the cheese not as flavorful.\n\"You want to smell it, touch it, taste it,\" Keahey told class participants of the cheese. \"As you judge it, let it coat your tongue and swallow it.\"\nAs guests tasted the various cheeses, they using words like nutty, tangy, crumbly, citrus, butterscotch, mellow, creamy, buttery, caramel, grassy, smooth. Some cheeses left the impression of the smell and taste of cauliflower or broccoli. The whiskey-soaked fig leaves which wrapped a Shakerag blue cheese during aging came to life in the taste of the cheese.\nRikki and Michael Skopp of Siloam Springs liked the \"Cabot Clothbound Cheddar\" by the Cabot Creamery and Cellars at Jasper Hill in Vermont. They noted the probiotics in the cheese, which aid in digestion.\n\"We quit eating a lot of food that is good for us,\" Michael Skopp said. \"It's a wonder why we're overweight.\"\nBut Andrea Ricketts and her daughter Amitty Fryar, both of Pea Ridge, were \"stuck on the brie, the first cheese we tried,\" the \"Moses Sleeper\" brie from the Cellars at Jasper Hill.\n\"I went to Wisconsin and had some fantastic cheese,\" Fryar said. \"I didn't know I didn't have to drive 10 hours to get it.\n\"If I could buy this here, I would probably eat it the minute I got home,\" she continued.\n\"No, you wouldn't even get it home,\" Ricketts admonished gently.\nNAN Our Town on 08/11/2016\n*CLARIFICATION: Sweet Freedom Creamery in Fayetteville is the only dairy plant licensed through the Arkansas Food Innovation Center at the University of Arkansas. This story incorrectly described its licensing.","url":"https://www.arkansasonline.com/news/2016/aug/11/cheese-monger-20160811/?page=1"}
