{"authors":["Imogen Blake For Mailonline"],"date_download":"2018-10-23 02:05:38","date_modify":"2018-10-23 02:05:38","date_publish":"2017-04-26 12:58:49","description":"Italian-American celebrity chef Fabio Viviani, 38, of Chicago, says it is wasteful to add good quality oil to water as it won't stop pasta from sticking. He said: 'Just stir it, you lazy people'.","filename":"data/vaneerConsumption/ChefrevealswhyyouNEVERaddoliveoiltopastawater.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9F6AC300000578-0-image-a-105_1493207913021.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_food_article-4447276_Chef-reveals-NEVER-add-olive-oil-pasta-water_1540260338.html","title":"Chef reveals why you NEVER add olive oil to pasta water","title_page":"Chef reveals why you NEVER add olive oil to pasta water | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's a handy trick many of us use at home to stop pasta from sticking together as it cooks in boiling water.\nBut one top chef says you should never add olive oil to your pasta water - as the trick doesn't actually work.\nAnd Italian-American celebrity chef Fabio Viviani, 38, from Chicago, has some stern words for those who do add the expensive ingredient to their cooking liquid in a new video.\nHe says in the clip those who add glugs to boiling pasta should be 'ashamed' of themselves, as it's a waste of good olive oil.\nOlive oil doesn't come cheap so to use it to prevent pasta from sticking is very wasteful - not to mention the fact it doesn't work according to Fabio Viviani\nThe 38-year-old cookbook author and TV personality told Business Insider that there is a much less expensive way to stop pasta from sticking than adding oil.\nIf you simply stir the pasta often, you will not need to waste good quality oil in your water, he says.\n'I think the stupidest thing I have ever heard about making pasta is people who waste olive oil in the water so the pasta doesn't stick,' Viviani said.\nViviani (pictured in 2011) says that if you leave your pasta unattended without stirring it then it will naturally stick to the bottom\n'That's a lie, it's wasteful, and you should be ashamed of yourself.\n'You should be there stirring your pasta, which doesn't make it stick anyway.'\nThe Bravo reality star - who landed the title of 'Fan Favourite' when he appeared on Top Chef, added: 'Just stir your pasta, you lazy people.'\nViviani also cleared up the debate about whether or not you should add extra salt to your pasta water.\nThe chef said that it's 'fine' but that to be careful about adding extra seasoning if you're making a particularly salty sauce using lots of cheese, for example.","url":"https://www.dailymail.co.uk/femail/food/article-4447276/Chef-reveals-NEVER-add-olive-oil-pasta-water.html"}
