{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:46:24","date_modify":"2018-10-30 21:46:24","date_publish":"2015-07-29 11:57:22","description":"Concentrics Resturants announced this morning that chef Wesley True will no longer be in the ki...","filename":"data/vaneerConsumption/ChefWesleyTrueoutatTheSpence.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/03/09/Images/WPIMAGE_cmgajcfoodandmore_2812.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_chef-wesley-true-out-the-spence__1540935984.html","title":"Chef Wesley True out at The Spence","title_page":"Chef Wesley True out at The Spence","title_rss":"NULL","source_domain":"ajc.com","text":"Concentrics Resturants announced this morning that chef Wesley True will no longer be in the kitchen at The Spence .\nThis from the email:\n“Concentrics has decided to part ways with Chef Wesley True of The Spence. Unfortunately, it was not a great fit and we had to make the hard decision to move forward. We were huge fans and very supportive of Wesley from day one but, unfortunately, we did not get the same in return.”\nAs chef/owner of TRUE in Mobile, AL, True was a semi-finalist for the James Beard Award “Best Chef South” and has been featured in publications including Southern Living, Garden & Gun, and USA Today. He took over at The Spence in March of 2015, replacing chef Richard Blais of “Top Chef” fame, who moved on to open a restaurant in California.\nNow it appears that True has been taking time off from The Spence to film an upcoming season of “Top Chef.”\nCheck out John Kessler's late May two star review of The Spence under True here . At the time, Kessler noted, \"I never did get to talk to True, because he was out of town while I was researching the Spence.\"","url":"https://www.ajc.com/blog/atlanta-restaurants/chef-wesley-true-out-the-spence/i7YjYBO9O9WvBVlTGm5HpN/"}
