{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:49:38","date_modify":"2018-10-30 21:49:38","date_publish":"2015-11-19 08:48:38","description":"...","filename":"data/vaneerConsumption/ChefToddRichardsSouthernFriedsettoopenatKrogStreetMarketi.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/10/05/Images/WPIMAGE_cmgajcfoodandmore_4629.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_ch_7c1c2c97d953f4dd0782ba92ddeb33e2__1540936178.html","title":"Chef Todd Richards' Southern Fried set to open at Krog Street Market i","title_page":"Chef Todd Richards' Southern Fried set to open at Krog Street Market i","title_rss":"NULL","source_domain":"ajc.com","text":"Photo credit: White Oak Kitchen & Cocktails\nBrewed to Serve Restaurant Group, Inc. and chef Todd Richards of White Oak Kitchen & Cocktails in downtown Atlanta have announced the formation of Southern Food Traditions, LLC — \"a company dedicated to the creation of concepts and products that represent the cultural milieu of the South.\"\nSouthern Food Traditions’ first project is Richards’ Southern Fried, a quick service fried chicken concept scheduled to open in early 2016 at Krog Street Market.\nAccording to a press release, Richards’ will offer three flavor options: Classic, Hot and Richards’ HOT. The chicken sourced from Springer Mountain Farms will be seasoned with a blend of spices creating a “slow burn heat versus the high impact heat generated by the use of conventional chili peppers.\"\nThe menu will include hot chicken sandwiches and chicken plates, along with seasonal sides, including hand-cut potato wedges, stewed okra and tomatoes, broccoli rice and cheese casserole and more.\nRichards is working with Green Olive Media and Smith Hanes Studio on the development of the overall concept and space.\n“Krog Street Market is the perfect backdrop for Richards’ Southern Fried,\"Richards said in the release. \"It has unique culinary fair and prime location — the important things you look for when opening a new restaurant.”\nA 2013 James Beard Awards semi-finalist for Best Chef Southeast, Richards served as executive chef at the Ritz-Carlton Buckhead , and most recently chef/partner at The Shed in Glenwood Park and The Pig & The Pearl at Atlantic Station before taking the executive chef position at White Oak Kitchen.\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook and following Atlanta Dining on Twitter.\nRead the AJC Fall Dining Guide, Atlanta Around the Clock, here.","url":"https://www.ajc.com/blog/atlanta-restaurants/chef-todd-richards-southern-fried-set-open-krog-street-market-early-2016/g6KCFAEp4p8Pr66SWweJLL/"}
