{"authors":["Siofra Brennan For Mailonline"],"date_download":"2018-10-23 01:32:52","date_modify":"2018-10-23 01:32:52","date_publish":"2017-03-16 11:40:29","description":"Racegoers put their best foot forward on Ladies Day at Cheltenham on Wednesday, but today fashionable racing fans were equally eager to impress on day three of the festival.","filename":"data/vaneerConsumption/CheltenhamracegoerskickoffStPatricksThursday.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E54081100000578-0-image-a-99_1489666653019.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4319808_Racegoers-kick-St-Patrick-s-Thursday-Cheltenham_1540258372.html","title":"Cheltenham racegoers kick off St Patrick's Thursday","title_page":"Cheltenham racegoers kick off St Patrick's Thursday | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Racegoers put their best foot forward on Ladies Day at Cheltenham on Wednesday, but today fashionable racing fans were equally eager to impress.\nLed by TV presenter Carol Vorderman, the style set were out in force, with the former Countdown host ensuring all eyes were on her in a black dress that showed off her curvy figure to full effect.\nShe started the day with an elaborate and eye-catching feathered hat, but later opted for a flat cap as she embraced the horse racing look.\nCarol Vorderman showed off her hourglass curves in a figure hugging black dress as she joined racing fans at Cheltenham\nFriends were kicking off the party earlier as they treated themselves to mini bottle of wine and champagne at the Cheltenham festival in Gloucestershire\nAfter yesterday's ladies day, it was a more casual affair for many on St Patrick's Thursday\nLady in red! This stylish attendee went for top to toe crimson, including Louis Vuitton monogrammed boots (left) while a fellow racing fan kept it simple in a cosy furry coat and lace up boots (right)\nA feast of hats festooned with feathers and blooms were on show as racegoers arrived for St Patrick's Thursday, celebrating in advance of the feast of the Irish patron saint tomorrow.\nSome high spirited friends were seen kicking off the party earlier with mini bottles of champagne and rose.\nBut overall there was a more relaxed feel to the day with many arriving in smart casual outfits as they prepared to hit the race course.\nMeanwhile, the Jockey Club is hoping for a rather sedate affair after organisers introduced restrictions on purchasing alcohol.\nBated breath: One racegoer in a striking hat could hardly contain her excitement as she willed her horse across the finish line\nCelebrating a winner? Zara Tindall (second Left), Dolly Maude and Mike Tindall show off their excitement while posing for a photo\nOwners of Tobefair watching the Pertemps Network Final Handicap Hurdle, although it was too much for one to handle\nThe emotion was getting too much for one woman who watched the action with gritted teeth (left) but she started cheering when events on the track took a positive turn (right)\nEmotions were naturally running high as people cheered their favourite horses on to victory\nGolfer Lee Westwood with his girlfriend Helen Storey who opted for a dramatic fur hat (left) and cyclist turned jockey Victoria Pendleton (right) who wore her trilby style fascinator at a januty angle (right)\nCarol Vorderman sensibly changed out of her heels into flat boots as she walked the course to watch the second rave from the final fence\nJonjo O'Neill, one the most successful racehorse trainers in the UK and Ireland, with his glamorous wife Jacqui\nLee Westwood and girlfriend Helen Storey watch their horse Yorkhill ridden by Ruby Walsh win in the JLT Novices Steeple Chase\nRacegoers are allowed to buy only four pints at a time and hospitality bars will close early in a bid to crack down on the drunken displays of previous years.\nThis year's festival has had a host of royal visitors with Zara Tindall joining the crowds on the first two days and Camilla, Duchess of Cornwall, yesterday.\nToday, Princess Anne represented the royal family, looking the part in a green tweed midi coat and a gold horse racing brooch.\nIt's a winner! A group of friends couldn't contain their excitement as they celebrated their horse's success\nThat's the way to celebrate! A spectator enjoyed a cigar during a victorious moment on Thursday afternoon\nNot everyone got lucky! There were some downcast faces during the first race at Cheltenham today\nFormer footballer turned Sky Sports pundit Chris Kamara looked to be having a great time as he enjoyed his day at the races\nFormer Loose Women star Carol later swapped her feathered headpiece for a more down-to-earth flat cap\nTV presenter Carol Vorderman was seen greeting writer Jilly Cooper with a friendly hug as they ran into each other at the festival\nRacegoers enjoy a drink during St Patrick's Thursday of the 2017 Cheltenham Festival\nFeathered cocktail hats have dominated this year's festival (left) while one woman gave a nod to St Patrick with her green fascinator (right)\nGetting into the spirit! A female racegoer looks excited as she reads the race card ahead of a day of sporting action\nZara made it along three days in a row, but was seen celebrating with friends and her husband Mike Tindall, while her mother watched the action from the VIP area.\nLater today, two of Cheltenham's greatest heroes, Arkle and Dawn Run, will play their part in celebrating St Patrick's Day.\nHorse Racing Ireland is lighting the statues of the two famous horses, both bred and trained in Ireland, green on Thursday evening at 6.30pm, which is the eve of St Patrick's Day.\nPrincess Anne was certainly dressed for the event, sporting a gold horse racing brooch on her scarf\nA keen equestrian, Princess Anne was no doubt looking forward to the day of racing ahead\nPrincess Anne looked completely relaxed and at ease as she took in the sporting action with Andrew Parker Bowles\n50 shades of grey! Both these ladies opted for an understated colour scheme with a touch of fur\nThe statues, which are situated on the crescent walkway above Cheltenham's parade ring, will remain lit during the Tattersalls sale in the parade ring after racing today.\nTomorrow’s Gold Cup will spark a £20 million betting bonanza across the industry in the UK and Ireland on the final day of the Cheltenham Festival.\nApart from the Grand National, the Gold Cup is the biggest betting race of the entire year.\nLadies day was on Wednesday but stylist racegoers were still determined to show off their best headgear\nA group of friends looked excited about the day ahead as they headed into the grounds\nFedora hats and fur were the order of the day for stylish sporting fans at today's Cheltenham festival\nWell it is St Patrick's Thursday! A group of friends donned shamrock glasses and green ties to celebrate Ireland's patron saint\nA bunch of friends were in high spirits as they smiled and cheered while posing for a huge group shot\nFeeling chilly? There may be a nip in the air but plenty of racegoers bravely went bare-legged in mini skirts\nLuck of the Irish! One woman was determined to celebrate in style by wearing a leprechaun t-shirt, Guinness hat and shamrock sunglasses\nA young racing fan was definitely in the spirit of St Patrick's Thursday as he gave the camera a big thumbs up (left) while another woman was unmistakably celebrating Irish roots (right)\nEven the youngest of racing supporters were getting in to the spirit of the day at Cheltenham\nNo mistaking the fact it was St Patrick's Thursday as racegoers donned shamrock accessories such as tiaras and glasses","url":"https://www.dailymail.co.uk/femail/article-4319808/Racegoers-kick-St-Patrick-s-Thursday-Cheltenham.html"}
