{"authors":["Harry Slavin For Mailonline"],"date_download":"2018-10-23 03:06:50","date_modify":"2018-10-23 03:06:50","date_publish":"2017-04-26 14:30:08","description":"Cesc Fabregas has jumped to second in the all-time Premier League assist table after racking up his 102nd against Southampton, with only Manchester United icon Ryan Giggs ahead of him.","filename":"data/vaneerConsumption/ChelseastarFabregasNo2inPremierLeagueassisttable.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9F93A300000578-0-image-a-17_1493209294336.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4447836_Chelsea-star-Fabregas-No-2-Premier-League-assist-table_1540264010.html","title":"Chelsea star Fabregas No 2 in Premier League assist table","title_page":"Chelsea star Fabregas No 2 in Premier League assist table | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Cesc Fabregas has jumped to second in the all-time Premier League assist table after racking up his 102nd against Southampton.\nThe Spaniard was once again pulling the strings as Chelsea landed their 25th victory of the season against the Saints thanks to a 4-2 win at Stamford Bridge.\nFabregas picked out fellow Spain international Diego Costa in the 53rd minute with a pin-point cross to put the Blues 3-1 in front as they continued their march towards the title.\nCesc Fabregas has moved up to second in the all-time Premier League assist table\nThe Chelsea midfielder notched up his 103rd assist of his career in England's top-flight\nFabregas posted a picture of the all-time table on Instagram with the message: 'PS: Ryan, I am coming for you'\nPREMIER LEAGUE ALL-TIME ASSIST TABLE - THE TOP 20 CRAFTSMEN Cesc Fabregas has jumped to second in the all-time table for assists in the Premier League ahead of Frank Lampard. Below is the full top 20... 1. Ryan Giggs - 162 assists 2. Cesc Fabregas - 103 3. Frank Lampard - 102 4. Wayne Rooney - 101 5. Dennis Bergkamp - 94 6. Steven Gerrard - 92 7. David Beckham - 80 8. Teddy Sheringham - 76 9. James Milner - 75 10. Thierry Henry - 74 11. Andrew Cole - 73 12. Darren Anderton - 68 13= David Silva - 64 13= Matt Le Tissier - 64 13= Alan Shearer - 64 16= Gareth Barry - 63 16= Ashley Young - 63 18. Nolberto Solano - 62 19= Stewart Downing - 59 19= Steve McManaman - 59\nThe assist was number 103 of the 29-year-old’s career in England, taking him one clear of Chelsea icon Frank Lampard in the all-time list.\nIt was also his eighth of the season so far, but he has a way to go to match his best tally in a Premier League season, having notched up 18 when the Blues last lifted the title in 2015.\nThe ex-Arsenal star took to Instagram after the match to post a picture of the table, showing him to be behind only Manchester United legend Ryan Giggs, and Fabregas had a cheeky message for the Old Trafford favourite.\nHe wrote alongside his post: ‘'Wow. Really proud day to become the second best assist maker of all time in this incredible league. Thanks for all your support. PS: Ryan, I am coming for you'.\nAs confident as Fabregas sounds, he still has some way to go to chase down the Welsh wizard and take top spot for himself.\nDuring 24 years at United, Giggs created 162 goals, a whopping 59 more than the Spaniard can currently boast.\nIn his race to the summit however, the Chelsea maestro has already overhauled some of the biggest names to grace the Premier League.\nFabregas is only one of four players to reach treble figures, with Manchester United’s Wayne Rooney on 101, and one of only two other current top-flight stars in the top 10, with Liverpool’s James Milner sneaking in with 75 assists.\nThere is an abundance of usual suspects in the top 10, with Steven Gerrard being kept out of the top five by Arsenal’s Dennis Bergkamp, the pair on 92 and 94 respectively.\nFrank Lampard is one of just four players to have amassed more than 100 assists\nManchester United legend Ryan Giggs leads the way with 162 assists, 59 more than Fabregas\nCESC'S SENSATIONAL RECORD... Cesc Fabregas is in his tenth season in the Premier League. Here is how he got to 102 assists, with Arsenal until 2011 and Chelsea from 2014... 2004-05: Games 33; Assists 5 2005-06: Games 35; Assists 5 2006-07: Games 38; Assists 11 2007-08: Games 32; Assists 17 2008-09: Games 22; Assists 8 2009-10: Games 37; Assists 13 2010-11: Games 25; Assists 11 2014-15: Games 34; Assists 18 2015-16: Games 37; Assists 7 2016-17*: Games 24; Assists 8 *current season still in progress\nDavid Beckham may have spent the majority of his career outside of the Premier League, but that still didn’t stop him from notching an impressive 80 assists in his 265 league appearances.\nTeddy Sheringham and Thierry Henry make up the top 10, while a glance a little further down the list throws up a few blasts from the past.\nDarren Anderton’s talents often go under the radar, but his place on the list is a reminder of the quality the former Tottenham and England star produced with his deliveries, creating 68 goals.\nMatthew Le Tissier made his name as a scorer of great goals, but he also had an eye for a pass too, laying on 64 goals at Southampton.\nSteven Gerrard created his fair share of goals for Liverpool, as well as scoring a few\nDarren Anderton was Tottenham's pass-master; Dennis Bergkamp was Arsenal's chief creator\nAnd while Alan Shearer is the league’s all-time top scorer, this list proves he was also more than capable of turning provider, the former Newcastle United striker also accumulating 64 assists.\nFurther down the list, the Peruvian trumpet-playing winger Nolberto Solano often found the right note with his deliveries, laying on 62 strikes during his spells at Newcastle and Aston Villa.\nCurrent Manchester United winger Ashley Young and Middlesbrough’s Stewart Downing still have time to climb the list – although time may be running out for the latter given the Teessiders’ current predicament.\nManchester United winger Ashley Young is one of seven current players on the all-time list","url":"https://www.dailymail.co.uk/sport/football/article-4447836/Chelsea-star-Fabregas-No-2-Premier-League-assist-table.html"}
