{"authors":["Joe Strange For Mailonline"],"date_download":"2018-10-23 01:26:19","date_modify":"2018-10-23 01:26:19","date_publish":"2017-04-26 11:49:22","description":"Diego Costa returned to form with a brace against Southampton on Tuesday night - and confirmed himself as the Premier League's most important goalscorer in the process.","filename":"data/vaneerConsumption/ChelseanewsDiegoCostasgoalshaveearnedmostpoints.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F99711C00000578-0-image-a-40_1493202395166.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4447108_Chelsea-news-Diego-Costa-s-goals-earned-points_1540257979.html","title":"Chelsea news: Diego Costa's goals have earned most points","title_page":"Chelsea news: Diego Costa's goals have earned most points | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Diego Costa returned to form against Southampton on Tuesday - and confirmed himself as the Premier League's most important goalscorer in the process.\nThe Chelsea striker struck twice in a thrilling 4-2 win at Stamford Bridge as the hosts stretched their lead at the top of the table to seven points.\nCosta's 19 goals have earned Antonio Conte's side a whopping 15 points this season, the best return of any player in the top flight.\nDiego Costa celebrates after scoring Chelsea's third goal against Southampton on Tuesday\nCosta's 19 Premier League goals have earned Antonio Conte's men 15 points so far this season\nHis double against the Saints moved him clear of Crystal Palace's Christian Benteke, Manchester City forward Sergio Aguero and Manchester United star Zlatan Ibrahimovic, each of whom have won 12 points with their goals this term.\nCosta ended a run of five games without a goal at Stamford Bridge on Tuesday night, with many of his match-winning strikes arriving earlier in the campaign.\nThe Spain striker netted an 87th-minute winner away at Watford in Chelsea's opening away game of the season. He also grabbed vital goals against Middlesbrough and West Brom before Christmas to secure two 1-0 victories.\nBenteke, meanwhile, has proved to be a revelation under Sam Allardyce, most recently scoring twice at Anfield to earn Palace three points against his former club Liverpool.\nChristian Benteke stoops to score Crystal Palace's winner against Liverpool on Sunday evening\nZlatan Ibrahimovic opens the scoring for Manchester United in their 3-0 win at Sunderland\nThe big Belgian has only bagged 14 goals in comparison to Aguero and Ibrahimovic's 17, but they have proved crucial in steering the Eagles towards safety.\nUnited are likely to miss Ibrahimovic's goals after the former Paris Saint-Germain striker was ruled out for the rest of the season with serious knee ligament damage.\nThe 35-year-old is above Tottenham's Harry Kane (11 points) and Dele Alli (10 points) and Leicester's Jamie Vardy (10 points) in the top 10.\nFernando Llorente has scored 12 goals during his debut season in the Premier League, directly earning relegation-threatened Swansea nine of their 31 points.\nThat's the same amount as Arsenal's Alexis Sanchez, Romelu Lukaku of Everton and Liverpool winger Sadio Mane.\nTottenham midfielder Dele Alli scores a stunning, long-range goal against Watford","url":"https://www.dailymail.co.uk/sport/football/article-4447108/Chelsea-news-Diego-Costa-s-goals-earned-points.html"}
