{"authors":["Press Association Reporter"],"date_download":"2018-10-23 01:32:48","date_modify":"2018-10-23 01:32:48","date_publish":"2017-03-16 11:40:57","description":"Cheltenham manager Gary Johnson is to undergo heart surgery on Thursday, the Sky Bet League Two club have announced. He aims to be back 'fighting fit' within weeks.","filename":"data/vaneerConsumption/CheltenhammanagerGaryJohnsontoundergoheartsurgery.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E538BEB00000578-0-image-a-93_1489663763036.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319828_Cheltenham-manager-Gary-Johnson-undergo-heart-surgery_1540258368.html","title":"Cheltenham manager Gary Johnson to undergo heart surgery","title_page":"Cheltenham manager Gary Johnson to undergo heart surgery | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Cheltenham manager Gary Johnson is to undergo heart surgery on Thursday, the Sky Bet League Two club have announced.\nJohnson is expected to make 'a swift and full recovery' but assistant boss Russell Milton will be in charge of the Robins until the 61-year-old is ready to return.\nThe former Yeovil and Northampton boss was admitted to hospital last weekend having missed Cheltenham's game at Doncaster suffering from what was thought to be a heavy cold.\nCheltenham manager Gary Johnson is to undergo heart surgery but aims to be back soon\nJohnson said in a message to fans: 'I'm sorry to say that at the present time, after much consultation, I am going to need heart surgery.\n'The timing is obviously not the best but it is out of my control.\n'I'm told that I'll be fighting fit within the next few weeks. Until then I ask politely for everyone; The board of directors, management staff and fans to come together as they have been all year to support our team.\n'It is a young team and positive support will be vital in the next few weeks. The squad is good enough to succeed and we can put our faith in them as well as trusting Russell and the management staff to see us through this period.\nJohnson released a statement and asking for the club to pull together in his absence\n'Be back soon, Gary Johnson.'\nCheltenham chairman Paul Baker, whose club are seven points above the relegation zone, said in a statement: 'We wish Gary a full and speedy recovery from his operation and we will be offering our full support to him and his family over the next few weeks.\n'The most important thing is that Gary returns to full health and the backroom staff led by Russell are more than capable of running things in his absence.\n'We look forward to welcoming Gary back once he has been cleared to return to work but, realistically, this may take some time but the board will give Gary their full support in his recovery process.'","url":"https://www.dailymail.co.uk/sport/football/article-4319828/Cheltenham-manager-Gary-Johnson-undergo-heart-surgery.html"}
