{"authors":["Marcus Townend For The Daily Mail"],"date_download":"2018-10-22 20:57:56","date_modify":"2018-10-22 20:57:56","date_publish":"2017-03-16 00:20:54","description":"As a jockey Jonjo O’Neill provided iconic Festival moments, most notably winning the dramatic 1986 Gold Cup on Dawn Run. He has also trained a Gold Cup winner, Synchonised in 2012.","filename":"data/vaneerConsumption/CheltenhamUnderstartersorderstheinsidetrack.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/3E34C3F800000578-0-image-a-61_1489623119326.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_racing_article-4318426_Cheltenham-starter-s-orders-inside-track_1540241876.html","title":"Cheltenham: Under starter's orders - the inside track","title_page":"Cheltenham: Under starter's orders - the inside track | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"JONJO'S FAMILY AFFAIR\nAs a jockey Jonjo O’Neill provided iconic Festival moments, most notably winning the dramatic 1986 Gold Cup on Dawn Run. He has also trained a Gold Cup winner, Synchonised in 2012.\nBut a new member of the family will write the first line in his Festival story on Thursday.\nO’Neill’s 19-year-old son, also called Jonjo but known as ‘Jonji’ around the stable to avoid confusion, has his first ride at the meeting on his father’s Another Hero in the Fulke Walwyn Kim Muir Handicap Chase for amateur jockeys.\nMichael Cole was given Tobefair by his breeder in return for also looking after a couple of fillies\nGIANTKILLER TOBEFAIR\nMulti-millionaire owners and big-name trainers tend to dominate the Festival these days but Pertemps Hurdle contender Tobefair will bring a touch of underdog spirit to the meeting.\nHis main owner Michael Cole was given the horse by his breeder in return for also looking after a couple of fillies for two years. He then syndicated the gelding with his fellow regulars at the Cresswell Arms in Cresselly Quay. Two coach loads of supporters are travelling from Pembrokeshire to support Tobefair, which has won its last seven races and is one of eight horses trained by Debra Hamer\nTobefair is Hamer’s first Festival runner and to cap it all, jockey Trevor Whelan has never ridden a Festival winner. Victory would be a story to rate with the FA Cup runs of Lincoln and Sutton!\nThistlecrack half-brother's West Approach takes on Unowhatimeanharry (above)\nA BOLD APPROACH\nTrainer Colin Tizzard and owners Heather and John Snook have had to put behind them the disappointment of their King George VI Chase winner and ante-post Gold Cup favourite Thistlecrack picking up a tendon injury which will put him out of action until the end of the year.\nThistlecrack would have been trying to win the Gold Cup as a novice and the Snooks have adopted an equally bold policy with half-brother West Approach.\nThe seven-year-old could have run in tomorrow’s Albert Bartlett Novices’ Hurdle but he takes on Unowhatimeanharry in the Stayers’ Hurdle despite not beating him in five previous meetings.\nEMPIRE STRIKES BACK\nRyanair boss Michael O’Leary has already got on the scoreboard with wins for Apple’s Jade (OLBG Mares’ Hurdle) and Tiger Roll (NH Chase). He is trying to win his third Gold Cup with Outlander.\nBut the one O’Leary really wants is his own sponsored race this afternoon. The Ryanair Chase has been run for 12 years and his name is not yet on the roll of honour. He is represented by Empire Of Dirt, winner of the Brown Advisory & Merriebelle Stable Plate last year — a gelding which has improved so much this season that trainer Gordon Elliott was keen to run him in the Gold Cup.\nMARK'S INJURY HOODOO\nThe injury jinx of riders employed by owner JP McManus continued when Mark Walsh was concussed as Consul De Thaix fell fatally in the Neptune Investment Management Novices’ Hurdle. Walsh’s ride on Uxizandre in the Ryanair Chase looks likely to go to Noel Fehily as does his mount on More of That in tomorrow’s Gold Cup.\nNOEL’S DISKO DANCING\nIrish trainer Noel Meade has had plenty of Festival heartache. But success for Disko in the JLT Novices’ Chase would be a first. Meade has had four Festival wins but never one over jumps.","url":"https://www.dailymail.co.uk/sport/racing/article-4318426/Cheltenham-starter-s-orders-inside-track.html"}
