{"authors":["Adam Shergold For Mailonline"],"date_download":"2018-10-23 01:37:33","date_modify":"2018-10-23 01:37:33","date_publish":"2017-04-26 12:12:23","description":"Chelsea play Manchester City in Wednesday evening in the second leg of the FA Youth Cup final - and it's tantalisingly poised. The two teams drew 1-1 up in Manchester last week.","filename":"data/vaneerConsumption/ChelseavsManchesterCityYouthCupfinalpreview.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/12226D3400000514-0-image-a-143_1493204414774.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4447256_Chelsea-vs-Manchester-City-Youth-Cup-final-preview_1540258653.html","title":"Chelsea vs Manchester City Youth Cup final preview","title_page":"Chelsea vs Manchester City Youth Cup final preview | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Chelsea play Manchester City in Wednesday evening in the second leg of the FA Youth Cup final - and it's tantalisingly poised.\nLast week in Manchester, Phil Foden scored for City to cancel out Ike Ugbo's first-half goal and so it's all square heading back to Stamford Bridge for the return.\nChelsea have dominated the Youth Cup in recent years, winning the last three finals and five out of the last seven. The last two have seen them beat Manchester City.\nPhil Foden celebrates after levelling the scoring for Manchester City in the first leg last week\nIke Ugbo celebrates after giving Chelsea the lead on the stroke of half-time last week\nIf the London club win on Wednesday evening, they will have eight Youth Cup triumphs to their credit in total, just two shy of Manchester United record of 10.\nCity are aiming to lift the trophy for the third time after previous successes in 1986 and 2008 and trying to avoid being runners-up for the sixth time in their history.\nAway goals don't count in the Youth Cup, so City won't be hindered too much by Ugbo's first leg goal, but taking on Treble-chasing Chelsea is daunting enough.\nJody Morris's team finished top of the Under-18 southern league and are on course to win the elite merit round for the overall title as well.\nLast year's final was also deadlocked at 1-1 after the first leg, with Aaron Nemane levelling for City after Mason Mount had given Chelsea the lead at the Academy Stadium.\nBut it was all-too-easy for Chelsea in the Stamford Bridge return as they raced into a three-goal lead through Dujon Sterling, Tammy Abraham and Fikayo Tomori, before Brahim Diaz scored a late consolation.\nTickets for the match have sold out but you can watch the second leg free-to-air on ITV4. Kick-off is at 7.45pm.\nChelsea captain Jake Clarke-Salter lifts the trophy after they beat Manchester City last year\nAnd Chelsea also defeated City over two legs to win the 2015 FA Youth Cup\nTHREE TO WATCH FROM EACH TEAM\nChelsea\nTrevoh Chalobah - The younger sibling of Nathaniel has been at Chelsea since primary school and is well suited in his role at the heart of the team's three-man defence.\nThe Youth Cup has once again been an exhibition of Chalobah's poise and leadership at the back and to watch him in certain games is to not believe he's still only 17.\nWill play a crucial role in negating City's exciting attacking threat in the final.\nChelsea defender Trevoh Chalobah, 17, is one of the club's brightest young stars\nMason Mount - The Chelsea captain seems to mature with every passing game and will be important not only for his leadership qualities but also for probing the City defence if allowed to push on from central midfield into a more creative role.\nHe can fulfil both with skills and composure and was highly-effective in last year's final, meaning City will fear him.\nChelsea recently rewarded Mount with a four-year professional contract and he's already a regular for the development side at under 23 level.\nChelsea's central midfielder Mason Mount in action for their under 23 team last week\nIke Ugbo - Every season, Chelsea seem to boast another insanely prolific striker. We had Dominic Solanke, then Tammy Abraham.\nThis season, it's been Ugbo, who's scored in all but one of the Youth Cup rounds for them. In all, he has scored 44 times in his last 67 outings for the youth team and will certainly fancy his chances against City given the service he'll receive.\nUgbo has the ability to dominate a defence and can also serve as the link-up man for others.\nReliable goalscorer Ike Ugbo opened the scoring for Chelsea in the first leg in Manchester\nManchester City\nBrahim Diaz - Chelsea certainly know about the 17-year-old Spanish playmaker as he scored against them three times last season and scored a hat-trick in a recent Premier League 2 meeting at under 23 level.\nMuch admired by Guardiola, Diaz has already signed a three-year professional contract and made his first team debut in the EFL Cup tie with Swansea City back in September.\nHis dribbling skills and acceleration will catch the eye and he is capable in front of goal too.\nBrahim Diaz of Manchester City will over an attacking threat in the second leg of the final\nLukas Nmecha - City's 18-year-old centre-forward is enjoying another prolific season, with seven goals in their Youth Cup run and a good return in the Premier League 2 as well.\nHe was born in Hamburg but opted to represent England at youth level, where he has been capped up to under 19 standard.\nAgain, Chelsea should be pretty well acquainted with him and know full well that even the slightest scrap of an opportunity inside the box could result in a goal.\nManchester City's Lukas Nmecha takes on Trevoh Chalobah of Chelsea in the first leg\nJadon Sancho - Guardiola believes 17-year-old Sancho has everything it takes to be the next English superstar.\nIt explains why City offered the winger a massive pay rise and a new three-year contract when Arsenal, Chelsea and Tottenham started expressing an interest last year.\nThose clubs enquired amid rumours Sancho was homesick for the south, having moved from Watford for £500,000 in March 2015. He scored twice in the first four minutes of his under 18 debut for City and hasn't stopped since.","url":"https://www.dailymail.co.uk/sport/football/article-4447256/Chelsea-vs-Manchester-City-Youth-Cup-final-preview.html"}
