{"authors":["Kieran Gill For Mailonline"],"date_download":"2018-10-22 23:45:45","date_modify":"2018-10-22 23:45:45","date_publish":"2016-01-28 13:01:49","description":"Arsene Wenger thinks the January transfer window is unfair and perhaps that partly explains why Arsenal have spent a third as much as Chelsea since it was introduced in 2003.","filename":"data/vaneerConsumption/ChelseaarebiggestJanuarytransferwindowbuyershavingspent214msince2003.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30AAB25400000578-0-image-a-24_1453988841878.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3420910_Chelsea-biggest-January-panic-buyers-having-spent-214m-2003-nearly-100m-rivals-Manchester-City_1540251945.html","title":"Chelsea are biggest January transfer window buyers having spent £214m since 2003","title_page":"Chelsea are biggest January transfer window buyers having spent £214m since 2003 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Arsene Wenger thinks the January transfer window is unfair and perhaps that partly explains why Arsenal have spent a third as much as Chelsea since it was introduced in 2003.\nThere is also the fact that Chelsea splash the cash, with ‘Fernando Torres’ and ‘£50million flop’ rarely far away from each other after the Spain striker became the priciest ever purchase in this window five years ago.\nIt is signings like that which put Chelsea top with their £214.2m total, followed by three other clubs that have topped a ton in Manchester City (£131.1m), Liverpool (£120.1m) and Tottenham Hotspur (£105.7m).\nChelsea splashed £50million on Fernando Torres in the January transfer window in 2011\nRoman Abramovich has spent £214.2m on January transfers since the window was introduced in 2003\nThe Blues paid £27m for Colombian winger Juan Cuadrado last January before sending him on loan\nThen come Manchester United (£87.2m) and, bringing up the rear for the Barclays Premier League’s big six, Arsenal (£68.9m).\nTheir manager is not a fan of the winter window and even called for it to be abandoned previously. ‘I think it should be completely cut out,’ Wenger said in January 2013. ‘Or limited to two players.’\nSince he couldn’t beat them, he joined them. Despite Wenger's denouncement, Arsenal are sixth in the list as the richest clubs dominate the top-end of the table.\nThis study by Sportsmail included trawling through every transfer made during the mid-season transfer window in the last 13 years but not including the current one, going by the latest figures on file for each player.\nJANUARY SPENDING BY PREMIER LEAGUE CLUB SINCE 2003 Chelsea: £214.2m Manchester City: £131.1m Liverpool: £120.1m Tottenham Hotspur: £105.7m Manchester United: £87.2m Arsenal: £68.9m Newcastle United: £63.1m Aston Villa: £50.4m West Ham: £44m Sunderland: £37.4m Southampton: £26.5m Everton: £23.2m Crystal Palace: £22.2m Stoke City: £21.4m Norwich City: £15.7m Leicester City: £14.4m Swansea City: £12.2m West Bromwich Albion: £11.8m Watford: £5.4m Bournemouth: £2.4m\nManchester City have spent £131.1m in January transfer windows including up to £28m on Wilfried Bony\nCity also splashed the cash in January on Bosnia striker Edin Dzeko in 2011\nIt threw up a few surprises, and showed who splashes the cash in January and who doesn’t.\nManchester City are runner-up to Chelsea and spent £25m in last season’s window on Wilfried Bony, rising to £28m. They still trail last year’s champions by more than £80m.\nAs for Liverpool, without the signings of Luis Suarez and Andy Carroll in January 2011 for a combined fee of £57.8m, they would be behind Newcastle.\nThe North East club’s priciest window – their French invasion in 2013 – saw them spend £18.7m.\nNewcastle have their eyes on Arsenal and could overtake the London side if they signed Loic Remy this week for £12m, as has been suggested.\nAndy Carroll joined Liverpool from Newcastle for a staggering £35m in the 2011 January window\nJermain Defoe returned to White Hart Lane in January 2009 with Tottenham forking out £15m\nThe January transfer window was grudgingly accepted by English football in the 2002-03 season and, for every big spender, there is a club that cannot afford to be so frivolous.\nBournemouth are last after spending just £2.4m, having risen through the Football League to join the land of untold riches.\nAbove them come Watford (£5.4m) and West Bromwich Albion (£11.8m) in the bottom three.\nThere is less than a week to go until this season’s January transfer window closes but it would take some doing to knock Chelsea off their perch.","url":"https://www.dailymail.co.uk/sport/football/article-3420910/Chelsea-biggest-January-panic-buyers-having-spent-214m-2003-nearly-100m-rivals-Manchester-City.html"}
