{"authors":["Matt Barlow For The Daily Mail"],"date_download":"2018-10-23 03:59:50","date_modify":"2018-10-23 03:59:50","date_publish":"2017-03-10 14:01:47","description":"Chelsea boss Antonio Conte will not tone down his all-action touchline antics for the visit of Manchester United — despite Jose Mourinho's complaints about his behaviour.","filename":"data/vaneerConsumption/ChelseanewsAntonioContewillnotcalmdownvsManUtd.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E232A7500000578-0-image-a-49_1489154485320.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4301328_Chelsea-boss-Antonio-Conte-not-calm-touchline_1540267190.html","title":"Chelsea news: Antonio Conte will not calm down vs Man Utd","title_page":"Chelsea news: Antonio Conte will not calm down vs Man Utd | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Antonio Conte will not mute his touchline celebrations when Jose Mourinho returns to Chelsea for Monday's FA Cup quarter-finals.\nThe managers clashed after Manchester United's 4-0 defeat at Stamford Bridge in October when Mourinho was upset by Conte's euphoric reaction to the fourth goal.\nMourinho, back at Chelsea for the first time since being ousted from the Bridge, claimed it was an attempt at 'humiliating' his team.\nChelsea manager Antonio Conte intends to keep showing his passion on the touchline\nJose Mourinho had a word with Conte about his touchline antics on their last meeting\nConte was speaking ahead of the FA Cup quarter-final against Manchester United on Monday\nLAST TIME ROUND... October 23, 2016 Chelsea 4-0 Manchester United Goalscorers: Pedro 1, Cahill 21, Hazard 62, Kante 70\nThey have not spoken since but Conte said: 'It's not important. We have nothing to clarify with him.\n'I've shown at Chelsea and with every team I've managed that I live the game with great passion.\n'Sometimes I want to share my enthusiasm with my players, my staff and also the fans. It is normal.'\nUnited have lost only twice in 31 games all competitions since, two inconsequential defeats which did not halt their progress in the Europa League and the EFL Cup.\nChelsea have also pushed on. They are 10 points clear at the top of the table and targeting the Premier League and FA Cup Double they won in 2010.\nConte says he has always shown his 'passion' throughout his career with his previous teams\nConte took questions on Friday afternoon and confirmed he had a fully fit squad to pick from\nFA CUP QUARTER-FINALS SATURDAY, MARCH 11 12.15pm: Middlesbrough vs Manchester City 5.30pm: Arsenal vs Lincoln City SUNDAY, MARCH 12 2pm: Tottenham vs Millwall MONDAY, MARCH 13 7.45pm: Chelsea vs Manchester United\n'For us, now, it is better,' said Conte. 'In October, we didn't know our future. In March we are top, we have a good identity and a good team.\n'We are showing good football but it will be a really tough game against United. With Manchester City, they have the best squad in the league with a lot of great players, with great talent and great experience.\n'We want to get into the next round. Until now, we didn't win anything.'\nMourinho was quick to note Chelsea's comfortable week of preparation for Monday' s FA Cup tie had been in contrast to United, who did not return from a game against Rostov in Russia until 3.30am Friday.\n'My players and I are focused on the game on the pitch,' said Conte.\n'The most important thing is to prepare the team in the right way, with good organisation; to think about my team, try through work to improve my players. These are the most important things for me and for every coach.\n'The mind games, they're strange no. The mind games don't bring you the win.'\nConte is regularly animated on the sidelines and celebrated wildly after beating West Ham","url":"https://www.dailymail.co.uk/sport/football/article-4301328/Chelsea-boss-Antonio-Conte-not-calm-touchline.html"}
