{"authors":["Mallory Schlossberg"],"date_download":"2018-10-30 22:56:56","date_modify":"2018-10-30 22:56:56","date_publish":"2014-08-14 15:23:02","description":"Are you there vodka? Er, are you there kocktails? Chelsea Handler posted a topless photo on Instagram, joking that she's a Kardashian. Chelsea, you're a funny one, and perhaps even a trendsetter. Should we all start doing pseudo-Kardashian photos on…","filename":"data/vaneerConsumption/ChelseaHandlerPosesToplessonInstagramHilariouslySendsUpTheKardashiansPHOTO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/94a75c53-288d-4fe2-ab2e-176a57eabc3b.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35766-chelsea-handler-poses-topless-on-instagram-hilariously-sends-up-the-kardashians-photo_1540940216.html","title":"Chelsea Handler Poses Topless on Instagram & Hilariously Sends Up The Kardashians - PHOTO","title_page":"Chelsea Handler Poses Topless on Instagram & Hilariously Sends Up The Kardashians — PHOTO","title_rss":"NULL","source_domain":"bustle.com","text":"Are you there vodka? Er, are you there kocktails? Chelsea Handler posted a topless photo on Instagram, joking that she's a Kardashian. Chelsea, you're a funny one, and perhaps even a trendsetter. Should we all start doing pseudo-Kardashian photos on Instagram? That's your personal decision. If you wanna go topless on social media later today, that is your call, my friend. It's also no big if you just wanna pass on the notion altogether. But hey, you can't deny that Chelsea Handler has some major lady balls! (But you knew that already, right?)\nBut let's talk about this photo. Kardashian level krazy and fancy it ain't. The photo is tongue-in-cheek and is not set on a luxurious bed of a thousand roses. It's in a gym locker room, a place that often smells like a foot. It's also a place where thousands of women get naked every day because getting dressed after working out and showering is just part of being a human being with a pulse and a moderate level of hygiene.\nAnd yes, the pic is funny — the \"I'm a Kardashian\" caption is enough to make you crack a smile as it is — but here's the thing: Handler is gorgeous. There's no sexy overhead lighting, she's not wearing a heavy amount of makeup, she's a genuine human woman. Add in the sense of humor, and she's even more stunning.\nIt's pretty obvious that she's joking in her implication that all you have to do is pose like this in order to be a Kardashian, but one other thing is clear: Handler is way, way, way, way, way more than a Kardashian. She's Chelsea fucking Handler.\nImage: chelseahandler/Instagram","url":"https://www.bustle.com/articles/35766-chelsea-handler-poses-topless-on-instagram-hilariously-sends-up-the-kardashians-photo"}
