{"authors":["Nate Church"],"date_download":"2018-10-30 21:42:09","date_modify":"2018-10-30 21:42:09","date_publish":"2018-08-14 20:41:47","description":"Chelsea Clinton recently made strong -- if not substantiated -- claims about the economic benefits of legalized abortion.","filename":"data/vaneerConsumption/ChelseaClintonLegalizingAbortionCreatedTrillionsinEconomicGrowth.json","image_url":"https://media.breitbart.com/media/2018/08/chelsea-clinton-whatever-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_08_14__1540935729.html","title":"Chelsea Clinton: Legalizing Abortion Created Trillions in Economic Growth","title_page":"Chelsea Clinton: Legalizing Abortion Created Trillions in Economic Growth | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Chelsea Clinton recently made strong — if not substantiated — claims about the economic benefits of legalized abortion.\nThe daughter of former President Bill Clinton and 2016 Democrat nominee Hillary Clinton recently spoke at Rise Up for Roe, an abortion rights campaign event created to advocate against the confirmation of Brett Kavanaugh to the U.S. Supreme Court. During her speech, Clinton reportedly said:\nIt is not a disconnected fact … that American women entering the labor force from 1973 to 2009 added three and a half trillion dollars to our economy. … The net, new entrance of women — that is not disconnected from the fact that Roe became the law of the land in January of 1973. So, I think, whatever it is that people say they care about, I think that you can connect to this issue. Of course, I would hope that they would care about our equal rights and dignity to make our own choices — but, if that is not sufficiently persuasive, hopefully, come some of these other arguments that you’ve expressed so beautifully, will be.\nThere is no way to actually check Clinton’s economic rhetoric. But according to a 2008 report by the Bureau of Labor Statistics:\nSince 1976, the percentage of working women who were self-employed has trended up (from 4.4 percent in 1976 to 5.2 percent in 2008), while the percentage of men who were self-employed has edged down (from 8.4 percent to 7.6 percent). In 2008, 38 percent of all self-employed persons were women, compared with 27 percent in 1976.\nThose numbers would not seem to support Clinton’s estimate.","url":"https://www.breitbart.com/politics/2018/08/14/chelsea-clinton-legalizing-abortion-created-trillions-in-economic-growth/"}
