{"authors":["Associated Press"],"date_download":"2018-10-23 04:37:48","date_modify":"2018-10-23 04:37:48","date_publish":"2016-01-29 20:23:31","description":"PARK CITY, Utah (AP) — After turning 40, quitting her late-night talk show, traveling the world and living alone, Chelsea Handler is feeling more thoughtful ...","filename":"data/vaneerConsumption/ChelseaHandlershiftsgearsinNetflixsChelseaDoes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:167b16afb1c846a9985e2905f53cad3b-3bmscybNe842cce83474b5992f65-580_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423300_Chelsea-Handler-shifts-gears-Netflixs-Chelsea-Does_1540269468.html","title":"Chelsea Handler shifts gears in Netflix's 'Chelsea Does'","title_page":"Chelsea Handler shifts gears in Netflix's 'Chelsea Does' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Chelsea Handler shifts gears in Netflix's 'Chelsea Does'\nPARK CITY, Utah (AP) — After turning 40, quitting her late-night talk show, traveling the world and living alone, Chelsea Handler is feeling more thoughtful and more insecure than ever before.\nShe wonders if audiences are still interested in what she has to say, and worries she might be an egomaniac for even thinking that.\nShe's shifting gears, and she's showing it, in person and on screen in \"Chelsea Does,\" the four-part Netflix docu-series she premiered at the Sundance Film Festival. It was released on the streaming channel last week; her talk show is set to begin in May.\nFILE - In this Jan. 22, 2016 file photo, Chelsea Handler poses for a portrait to promote the film, \"Chelsea Does\", at the Toyota Mirai Music Lodge during the Sundance Film Festival in Park City, Utah. Handler reveals her personal fears and biases in her new Netflix docu-series as she explores marriage, drugs, racism and technology. (Photo by Matt Sayles/Invision/AP, File)\n\"I wanted to do all those things: have fun, be ugly, be funny, sad, cry,\" she said of her approach to the new project. \"I wanted everything, like a phantasmagoria of experience. And I learned a lot and I had a great time filming all of them.\"\nHere's a look at Handler's perspective on each of the installments:\n— Marriage: Handler said series producers Morgan Neville and Eddie Schmidt pressured her to interview her ex-boyfriends and go on dates with a bunch of strangers.\n\"I got my first boyfriend from when I was 20 in LA and had just moved there, and he was so nice,\" she said. \"He was like, 'You did everything you said you were going to do, and it was so sweet.'\"\n— Silicon Valley: Handler met with a therapist throughout the making of the series, and she found their discussions about her frustrations with technology among the most fruitful.\n\"My whole house is run on an iPad and I just don't know how — like I turn on my TV and a microwave goes on downstairs,\" she said. \"I feel like a toddler. I don't know how to do anything. And I have people who do too many things for me so I've forgotten how to even be resourceful.\"\nHandler says she \"definitely got better at technology\" after the segment.\n— Drugs: A six-course marijuana-laced meal and Handler's experiences with ayahuasca are featured in her documentary on drugs. She said the hallucinogenic Peruvian brew induced nausea and deep feelings of love.\n\"You feel beautiful, like everything is beautiful and life is exactly what it should be,\" she said. \"And then I had this epiphany ... like it's OK to be alone. And as I thought that — it's OK to be alone — I thought, 'I want to go down and tell everybody what just happened.'\"\n— Racism: The segment that affected Handler the most was her exploration of racism.\n\"The most mind-blowing thing was the racism in the South,\" she said. \"I just didn't realize how bad it still is.\"\nDiscovering that hatred showed her \"how little I knew about the history of slavery,\" she said, \"and all of that ugly, dirty garbage that we have in our history as a country.\"\n___\nFollow AP Entertainment Writer Sandy Cohen at www.twitter.com/APSandy .","url":"https://www.dailymail.co.uk/wires/ap/article-3423300/Chelsea-Handler-shifts-gears-Netflixs-Chelsea-Does.html"}
