{"authors":["Matt Lawton For The Daily Mail","Craig Hope For The Daily Mail"],"date_download":"2018-10-23 00:14:59","date_modify":"2018-10-23 00:14:59","date_publish":"2017-04-26 09:37:33","description":"Newcastle United and West Ham were raided on Wednesday morning as tax officials in the UK and France took dramatic steps to investigate a suspected £5million of fraud across the football industry.","filename":"data/vaneerConsumption/ChelseadrawnintotaxprobeNewcastleWestHamraided.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9EF8E500000578-0-image-a-5_1493202633935.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_sportsnews_article-4446818_Newcastle-United-West-Ham-face-HMRC-transfer-proble_1540253699.html","title":"Chelsea drawn into tax probe - Newcastle, West Ham raided","title_page":"Chelsea drawn into tax probe - Newcastle, West Ham raided | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Newcastle United and West Ham were raided on Wednesday morning as tax officials in the UK and France took dramatic steps to investigate a suspected £5million of fraud across the football industry.\nThe computers and telephones of a number of agents were seized and 'several men' were arrested as 180 tax officials searched for information about 'hidden payments', allegedly made during transfers between English and French clubs.\nNewcastle managing director Lee Charnley, owner Mike Ashley's main man at the club, was arrested at his home at 6am and spent 10 hours with officers before being released without charge.\nHMRC officers were spotted at Newcastle United's training ground on Wednesday morning\nHMRC officers raided Newcastle's Darsley Park training facility on Wednesday morning\nPlayers are said to have been shocked to see their training ground raided by officials\nNewcastle United owner Mike Ashley (left) sits with managing director Lee Charnley\nHM Revenue and Customs (HMRC) officers also visited Chelsea's Stamford Bridge offices — as MailOnline revealed on Wednesday — to request information in connection with the raids.\nLess than 48 hours after securing promotion back to the Premier League, Newcastle players were stunned by the sight of HMRC officers descending on their Darsley Park training ground.\nWest Ham insiders said around 40 tax officials visited their premises, with one source telling Sportsmail that computers belonging to academy staff had been seized.\nThe officers arrived at West Ham's London Stadium in unmarked white vans at around 8am, with a helicopter circling overhead.\nJust after midday a small team of officers wearing 'HM Revenue and Customs' bibs could be seen carrying clipboards and plastic folders inside the stadium car park.\nCharnley, 39, will return to work on Thursday with HMRC officers expected back at St James' Park to continue their enquiries.\nBritish tax authorities are working in tandem with their French counterparts, who made four arrests — all believed to be football agents — on Wednesday.\nSportsmail understands Olympique de Marseille are central to the investigation and transfers involving the French club, Newcastle and West Ham are being examined.\nSenior Marseille directors have already been charged as part of an ongoing probe, which has seen 800 bank accounts and 110 companies examined.\nReports in France claimed there was a link with Marseille as well as criminal gangs based in Corsica and mainland France.\nNumerous transfers between Marseille and both Newcastle and West Ham have taken place in recent years, the most high-profile of which was Dimitri Payet's switch to London in 2015 for £10.7million. He rejoined his former club for £25m in January.\nHMRC inspectors in Newcastle were later seen leaving a house in Gosporth\nThe investigation spreads across two countries, with French authorities involved\nOfficials were seen at West Ham's London Stadium at around 8am on Wednesday morning\nWHO IS SIMON STAINROD? The former striker for the likes of QPR, Sheffield United, Oldham and Aston Villa is an agent who is allegedly linked to four deals being investigated although there is no suggestion of any wrongdoing on his part. As a player his most successful spell came at QPR, where he scored 48 goals in 145 games from 1980 to 1985. After a spell at Stoke in 1988 his career took him to France and then Scotland, where he finished up as player-manager at Ayr United. In 2003, he set up his own company with friends called Matchday Media. He is now based in Dubai. Stainrod was linked to many of Newcastle's moves for French players such as Hatem Ben Arfa. At Moussa Sissoko's unveiling he purred about him as a 'Rolls-Royce sort of midfielder'.\nIn another deal, Newcastle bought Florian Thauvin for a reported £15m in 2015 and loaned him back to Marseille for two seasons. He is due to be sold back this summer for £9.8m.\nNewcastle also bought Remy Cabella from Montpellier in 2014 for a reported £12m. He was loaned to Marseille until the transfer was made permanent last summer for a fee of £6.3m.\nFrench midfielder Alou Diarra's switch from Marseille to West Ham in August 2012 for around £2m is also under scrutiny. Diarra spent a disastrous five months at the east London club before accusing an agent of misleading him. There is no suggestion of any wrongdoing by any of the players.\nA number of Newcastle deals involving French players are understood to have been facilitated by former QPR striker Simon Stainrod, 58.\nNewcastle have previously confirmed Stainrod was 'involved with the club', having based himself in Dubai as a Scotland-registered agent. He was stripped of his official agent's licence by the FA in 2012 for failing to produce requested documents. There is no suggestion of wrongdoing by Stainrod.\nOfficials were seen loading items into unmarked vans at the London Stadium on Wednesday\nDocuments and other items were seized from the stadium in Stratford, east London\nUnmarked white vans and officials were spotted at the stadium during the raid on Wednesday\nOne well-placed leading sports lawyer suggested on Wednesday night that 'dual representation' in transfer deals could be the focus of this investigation.\nFootball authorities do allow an agent to represent a club as well as the player in a transfer deal, but that has become an area of serious concern for HMRC — particularly with regard to benefits and expenses declared on tax forms within the game.\n'If that issue is at the centre of the investigation this could extend to looking at a huge percentage of transfers in the English game,' said the lawyer.\nThe HMRC press office were not prepared to either confirm or deny reports of other arrests, or claims that the homes of some players had also been targeted in raids.\nA spokesperson said: 'HMRC has arrested several men working within the professional football industry for a suspected £5m income tax and National Insurance fraud — 180 HMRC officers have been deployed across the United Kingdom and France today.\n'Investigators have searched a number of premises in the North East and South East of England and arrested the men and also seized business records, financial records, computers and mobile phones.\nWest Ham's London Stadium was raided by HMRC in connection with a tax investigation\nSt James' Park was also targeted as HMRC confirmed they'd made 'several arrests'\nDimitri Payet joined West Ham for around £10m in 2015 before returning to Marseille this year\n'The French authorities are assisting the UK investigation, have made arrests, and several locations have been searched in France.\n'This criminal investigation sends a clear message that, whoever you are, if you commit tax fraud you can expect to face the consequences.'\nOn Wednesday night a statement from the French authorities said: 'On April 26, 2017, a number of arrests and searches were carried out in France in connection with the execution by the national financial prosecutor (PNF) of a request on July 29, 2016, for mutual assistance from the British judicial authorities.\n'Ten searches were carried out all over France and four people were held in custody. Documents were also seized.\n'The investigation is being conducted by Her Majesty's Revenue and Customs (HMRC). It deals with cases of aggravated tax evasion and the laundering of aggravated tax fraud committed during several transfers of football players between French clubs and clubs playing in the Premier League. The UK authorities suspect hidden payments to certain players, their agents or third parties, allowing them to evade income taxes and social security contributions.\nRemy Cabella (left) has switched between England and France, currently playing for Marseille\nFlorian Thauvin (left) is another player to have joined Newcastle from Marseille only to return\nAlou Diarra (right) complained he was duped into joining West Ham in a transfer deal in 2012\n'This judicial operation to combat tax fraud, carried out jointly by the French and British authorities and supervised by two PNF magistrates, took several months to prepare and mobilised 32 investigators.'\nIn December, HMRC confirmed in a parliamentary hearing that 43 players, 12 teams and eight agents were being investigated over 'the potential abuse of the rules relating to image rights', which it described as 'the most significant tax risk among footballers'.\nA West Ham spokesperson confirmed that the club were 'cooperating fully' with the investigation.\nA Newcastle statement said: 'Newcastle United can confirm that a member of its staff has this morning been assisting HMRC with their enquiries.'\nNewcastle sealed their promotion back to the Premier League with a 4-1 win over Preston\nNewcastle manager Rafa Benitez salutes the club's fans after sealing promotion on Monday\nChelsea's offices at Stamford Bridge were not raided and no allegations of wrongdoing have been made against the Premier League leaders but HMRC officers did make a request for information relating to their investigation into corruption in football.\nA spokesman for Chelsea said: 'In connection with its wider investigation, HMRC has requested certain information which the club will provide.'","url":"https://www.dailymail.co.uk/sport/sportsnews/article-4446818/Newcastle-United-West-Ham-face-HMRC-transfer-proble.html"}
