{"authors":["Nicholas Godden For Mailonline"],"date_download":"2018-10-23 02:50:03","date_modify":"2018-10-23 02:50:03","date_publish":"2016-01-29 17:30:30","description":"Diego Costa, whose form has markedly improved since the club sacked Jose Mourinho and appointed Guus Hiddink in his place, was given the arm around the shoulder treatment during training on Friday.","filename":"data/vaneerConsumption/ChelseabossGuusHiddinkshowsmainmanDiegoCostatheloveassquadgearupforFACupfourthroundclashwithMKDons.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30B498BD00000578-0-image-a-27_1454089829077.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3423186_Chelsea-boss-Guus-Hiddink-shows-main-man-Diego-Costa-love-squad-gear-FA-Cup-fourth-round-clash-MK-Dons_1540263003.html","title":"Chelsea boss Guus Hiddink shows main man Diego Costa the love as squad gear up for FA Cup fourth round clash with MK Dons","title_page":"Chelsea boss Guus Hiddink shows main man Diego Costa the love as squad gear up for FA Cup fourth round clash with MK Dons | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Chelsea manager Guus Hiddink gave an indication during training on Friday what could be behind Diego Costa's recent revival.\nThe Spain international, whose form has markedly improved since the club sacked Jose Mourinho and appointed Hiddink in his place, was given the arm around the shoulder treatment by the Dutchman.\nCosta has been potent in front of goal in recent weeks and has netted six times in his last six games following the arrival of the interim boss in December.\nGuus Hiddink (left) puts his arm around Diego Costa as he has a quiet word with the Chelsea striker\nCosta has been in fine goalscoring form since Hiddink replaced Jose Mourinho as Chelsea boss in December\nCosta has scored six times in his last six appearances since the Dutchman took the reins at Stamford Bridge\nAnd the pair were pictured enjoying a moment together at Chelsea's Cobham headquarters as the squad were put through their paces ahead of Sunday's FA Cup clash with MK Dons.\nThe Premier League champions face the Championship outfit at Stamford Bridge in the fourth round looking to keep up their unbeaten record under their new boss and the players appeared to be in a relaxed mood as they geared up for the game.\nCosta grabbed the winner against Arsenal at the Emirates last weekend as the Blues continued to climb the table and Hiddink had high praise for the former Atletico Madrid striker.\n'I don't know what he did in the previous games,' Hiddink said as he addressed the media at his pre-match press conference on Friday.\nCaptain John Terry (left) and Gary Cahill (right) share a joke as the squad prepare for Sunday's clash\nTerry (left) and Costa battle for possession during Friday's training session at Chelsea's Cobham HQ\nHiddink watches on as Cesc Fabregas takes control of the ball during a practice game during training\n'From what I know about what he's doing now I'm very pleased. We're depending a lot on him, too much sometimes. But I'm happy with his performance and his attitude. He's a key figure for us. He's of huge importance for us.'\nChelsea face Watford midweek as the Barclays Premier League returns and the temptation for Hiddink will be to rest players with just two days between fixtures.\nBut the Dutchman insists that Wednesday's game against Quique Sanchez Flores' side is not even coming into his thinking.\nMidfielder Eden Hazard was in high spirits as the Blues geared up for Sunday's MK Dons clash\nChelsea goalkeeper Thibaut Courtois climbs high to take the cross above midfielder Nemanja Matic\nBrazilian midfielder Willian pulls off a silky turn to keep out of the clutches of John Obi Mikel\nBrazilian playmaker Oscar tries his luck as takes a shot before Fabregas can close him down\n'We have a lot of games coming up. We have to think cleverly how to maintain everyone's fitness. But the FA Cup is important to us. We don't think about the Watford game on Wednesday.\n'Every win helps and I like the attitude, it's there to give everything in every duel. So the FA Cup will help.\n'I don't want to say the FA Cup is our priority, that would neglect the beauty of the Premier League, but the first step is Sunday then the team is eager to go into the Wednesday game.\nCosta closes down Baba Rahman as the Spain striker attempt to pinch the ball from the left back\nTerry sees the funny side as the former England captain trains ahead of the Fa Cup fixture\nBelgium international Hazard holds off the challenge of team-mate Cesar Azpilicueta\nMidfielder Obi Mikel (left), another player enjoying a revival under Hiddink, challenges with Cahill\n'Chelsea must always go for a title. That has been the target in the past. We are not here to pass the time. We are here to aim for targets and the FA Cup is a target.\n'I think it would be a success. When you looked at the table in December, one point off relegation. We recovered a bit, made some steps with draws and hopefully now with some victories but you're still not on top of this league where Chelsea should be.","url":"https://www.dailymail.co.uk/sport/football/article-3423186/Chelsea-boss-Guus-Hiddink-shows-main-man-Diego-Costa-love-squad-gear-FA-Cup-fourth-round-clash-MK-Dons.html"}
