{"authors":["Adam Shergold For Mailonline"],"date_download":"2018-10-23 01:04:31","date_modify":"2018-10-23 01:04:31","date_publish":"2017-04-26 11:10:59","description":"Diego Costa joined the Premier League's 50-goal club with his dazzling double in Chelsea's win over Southampton on Tuesday night, joining some esteemed company in the process.","filename":"data/vaneerConsumption/ChelseastrikersWhowasthefastesttonet50EPLgoals.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9EF30700000578-0-image-a-127_1493201450022.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4447024_Chelsea-strikers-fastest-net-50-EPL-goals_1540256671.html","title":"Chelsea strikers: Who was the fastest to net 50 EPL goals?","title_page":"Chelsea strikers: Who was the fastest to net 50 EPL goals? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Diego Costa joined the Premier League's 50-goal club with his dazzling double in Chelsea's win over Southampton on Tuesday night, joining some esteemed company in the process.\nThe Spain striker reached the milestone in his 85th Premier League outing for the Blues, making him the eighth-quickest to bring up his half-century.\nTop of that table is the former Newcastle and Manchester United goal machine Andrew Cole, who needed just 65 matches to reach the 50-goal mark.\nDiego Costa scored twice as Premier League leaders Chelsea beat Southampton 4-2\nCosta was instrumental as Chelsea re-established their seven-point lead at the top\nThe top 20 fastest players to reach 50 Premier League goals. Stats courtesy of Opta\nIt helped that in the game he achieved the landmark - United's record 9-0 rout of Ipswich Town in March 1995 - he scored five of the goals.\nIt won't come as any surprise that Alan Shearer is second - he was still a Blackburn player when he reached 50 in his 66th Premier League game, against Everton in September 1994.\nAnother prolific United forward, Dutchman Ruud van Nistelrooy, needed 68 games to reach his half-century, while Fernando Torres took 72 games to do it at Liverpool.\nAndrew Cole reached his half-century in the league with five against Ipswich back in 1995\nAlan Shearer reached his 50 goals in the Premier League for Blackburn back in 1994\nRuud van Nistelrooy brought up his 50 by scoring at Newcastle United in August 2003\nFernando Torres celebrates his 50th Premier League goal against Aston Villa in 2009\nSergio Aguero, Thierry Henry and Kevin Phillips also speedily notched their fifties, with Costa next on the list, one game quicker than ex-Liverpool man Luis Suarez.\nCosta, 28, becomes the fastest Chelsea player to reach 50 goals in the Premier League era.\nJimmy Floyd Hasselbaink needed 94 matches to do it and Didier Drogba 106.\nCosta's double set the seal on a nerve-settling 4-2 win for the Blues, who re-established their seven-point advantage over London rivals Tottenham.\nSpurs have the chance to respond when they travel to Crystal Palace on Wednesday night.\nChelsea legend Didier Drogba reached his 50 goals against Arsenal in March 2008","url":"https://www.dailymail.co.uk/sport/football/article-4447024/Chelsea-strikers-fastest-net-50-EPL-goals.html"}
