{"authors":["Matthew Smith For Mailonline"],"date_download":"2018-10-23 04:32:32","date_modify":"2018-10-23 04:32:32","date_publish":"2017-03-16 15:47:47","description":"Newton is loan technical coach, which means he is in charge of the 35 players currently playing away at other clubs on temporary deals. This number has made Chelsea a magnet for criticism.","filename":"data/vaneerConsumption/ChelseanewsEddieNewtondefendsclubloanpolicy.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E55509100000578-0-image-a-16_1489679151969.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4320664_Chelsea-coach-Eddie-Newton-defends-club-loan-policy_1540269152.html","title":"Chelsea news: Eddie Newton defends club loan policy","title_page":"Chelsea news: Eddie Newton defends club loan policy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Chelsea coach Eddie Newton has defended the club's policy of loaning out huge quantities of players, claiming some of their players get better treatment than the players permanently at the club they are loanees with.\nNewton is loan technical coach at Stamford Bridge, which means he is in charge of the 35 players currently playing away at other clubs on temporary deals.\nWhile this number has made Chelsea a magnet for criticism, Newton feels they are the victim of public misconception.\nChelsea coach Eddie Newton has defended the policy of loaning out huge quantities of players\n35 players, including Christian Atsu at Newcastle, are currently away on loan from Chelsea\nSome Chelsea players are young - like Tammy Abraham at Bristol City - but many are older\nHe said in an interview with anti-racism group Kick It Out: 'What they don't see is the due care and process that the club puts into our players. I oversee the loan programme and I've got two coaches next to me, plus four analysts, medical staff and a conditioner for all of the loan players.\n'We run it seamlessly considering there's 35 players – everyone gets seen, everyone gets analysis and feedback on their games, and physical updates.\n'So you can slander our loan process as much as you want, but some of our loan players who are in Germany and Spain are getting looked after better than some clubs who are supposed to look after the players that are right in front of them. I'm very proud of it.'\nNewton said their system has been the victim of 'slander' and he was 'proud' of the club\nNewton, a former Chelsea player who won the 1997 FA Cup with the club, admitted it was difficult for a lot of the loanees to break into the first team but that the system has its merits.\nHe said: 'Sometimes it's frustrating for the players because everyone wants to play first team but only eleven players can get in there, but the loan system is a tool for us to develop players in a senior league instead of playing under-21s football.\n'Every player is different – some will produce very quickly, but others take time to come to fruition.\n'With the money that's in the league, top clubs are under pressure to win titles and bring in the best players, but we have a belief at this club that we've got an abundance of talent that in the next three years are capable of pushing to at least be a permanent squad member, and then it's up to them to see whether they push on to become a number one in the side.'\nNewton served as assistant manager at Chelsea to Roberto di Matteo, having worked with him at MK Dons and West Bromwich Albion, and helped the club win the Champions League in 2012.\nNewton is a former Chelsea player and scored as they won the 1997 FA Cup final","url":"https://www.dailymail.co.uk/sport/football/article-4320664/Chelsea-coach-Eddie-Newton-defends-club-loan-policy.html"}
