{"authors":["Chris Spargo For Dailymail.Com"],"date_download":"2018-10-23 00:49:59","date_modify":"2018-10-23 00:49:59","date_publish":"2016-01-28 14:56:42","description":"Chelsea Clinton hosted her highly-hyped Soul Cycle fundraiser for her mother in New York City on Wednesday afternoon which ended up being a flop as bikes needed to be filled last second.","filename":"data/vaneerConsumption/ChelseaClintonsSoulCycleeventtoraisemoneyforHillaryflops.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AB0EE100000578-0-image-a-76_1453992988295.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420932_Chelsea-Clinton-s-fundraising-FLOP-Soul-Cycle-event-raise-money-Hillary-bust-2700-seats-offered-just-50-bikes_1540255799.html","title":"Chelsea Clinton's Soul Cycle event to raise money for Hillary flops","title_page":"Chelsea Clinton's Soul Cycle event to raise money for Hillary flops | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Chelsea Clinton hosted her highly-hyped Soul Cycle fundraiser for her mother in New York City on Wednesday afternoon.\nThe $2,700-a-head event, which offered just 60 seats at the popular cycling studio's Tribeca location and promised guests a photo with Chelsea, was expected to sell out quick while raising some easy money for the Hillary Clinton campaign but was ultimately a flop.\nSuch a flop in fact that in the end some seats were being sold for just $50, roughly the same price it costs to take a regular Soul Cycle class.\nScroll down for video\nMoneymaker: Chelsea Clinton (above in profile) hosted a Soul Cycle fundraiser for her mother in New York City on Wednesday afternoon\nFlop: The $2,700-a-head event offered just 60 seats but failed to sell out leaving some bikes available for just $50 at the last second. One attendee, Billy Joel's ex Katie Lee, is friends with instructor Laurie Cole and may have been there to support her friend as much as to fundraise for the candidate\nOff day: Chelsea (above) did not participate in the ride but did speak to guests before the event\nBest of the best: The class was taught by beloved instructor Laurie Cole (above) and brought out her friends and colleagues, but even Cole wasn't enough of a draw to fill the room\nCrowd filler? Stacey Griffith (center), who is another popular instructor at Soul Cycle, was also at the event\nHelping hand: Instructor Laurie did her best to try and fill bikes by advertising the class on Instagram just two days ago, as bikes were still available (above)\nCNN reports that Chelsea herself did not participate in the class but did answer questions for guests shortly before they began their stationery ride.\nShe also entered the event, and exited, through a secret entrance to avoid photographers.\nWhen asked who she thought the best candidate was on the Republican side she cited Jeb Bush saying he is 'the only voice on the other side that is demonstrating strong American values'.\nChelsea also spent time talking about 'how important women's rights are to her and the campaign' now that she is a mother with a second baby on the way with her husband Marc Mezvinsky.\nThe instructor for the event, Laurie Cole, did her best to try and help Chelsea out and fill some of the bikes, posting a flyer for the event on her Instagram page on Tuesday claiming that 'some more bikes were released for this amazing ride'.\nThe fundraiser did draw out a fresh-faced Katie Lee Joel, who emerged after the event looking as if she had barely broken a sweat, and popular Soul Cycle instructor Stacey Griffith.\nIt is not clear if those two women were there explicitly for the fundraiser or as favors because they are a close friend and a colleague with the instructor respectively and there were seats that needed to be filled.\nLaurie told a 6:30pm class later in the day that her Hillary fundraiser had raised $75,000 and was 'awesome' and that a SoulCycle class isn't as hard as running for president.\nThe 2pm event drew a few dozen females, many carrying designer bags and wearing trendy Soul Cycle clothing, to the Tribeca studio.\nThere were early reports that some seats were even left empty at the event, but they have since been edited. The class was no easier because it was a Clinton event either according to those in attendance.\nSoul Cycle has not responded to a request for comment about the event.\nClose: Chelsea and instructor Laurie Cole are close, and Chelsea took her classes for years. Cole seen above supporting the former first daughter at a book launch event\nLongtime friends: Katie Lee Joel came to the Hillary ride, but she and Laurie go way back. Here the pair are pictured last summer\nWhen asked who she thought the best candidate was on the Republican side Chelsea cited Jeb Bush (Soul Cycle rider above)\nChelsea said Jeb is 'the only voice on the other side that is demonstrating strong American values' (Soul Cycle riders leaving the fundraiser above)\nChelsea also spent time talking about 'how important women's rights are to her and the campaign' (two other attendees entering above)\nHillary's campaign has been floundering with Bernie Sanders new popularity. It was clear for the level of SoulCycle branded clothing the spin studio does not suffer from loyalty issues\nSadly Hillary was not able to show up for the big fundraiser as she was out on the campaign trail trying to make up ground on Bernie Sanders\nSadly Hillary was not able to show up for the big fundraiser as she was out on the campaign trail, but she herself has taken a private spinning class Laurie shared with those in attendance.\nIt was a busy night for Chelsea, who after her Soul Cycle flop had to prepare for another fundraising event for her mom, this one an LGBT cocktail reception hosted by tennis great Billie Jean King and campaign manager Robby Mook, who has spent the past few weeks filing the email inboxes of anyone on Hillary's supporter list with requests for money.\nThis was another $2,700-a-head event that allowed guests to get a photo with Chelsea and was held at the home of Evercore’s Charles Myers.\nNo word yet on how turnout was for that event, but hopefully better than the Soul Cycle class earlier in the day.\nHillary (above with Chelsea last March) has taken a private cycling class from the same woman who taught Wednesday's class\nIt was a busy night for Chelsea, who after her Soul Cycle flop had to prepare for another fundraising event for her mom. By not participating she avoided the need for a shower during her busy day\nChelsea attended an LGBT cocktail reception hosted by tennis great Billie Jean King and campaign manager Robby Mook. Those boldfaced named missed the afternoon ride\nIt is crunch time for the Hillary campaign with just five days until the first votes are cast in the primary election in Iowa (Soul Cycle riders above)\nHillary's opponent Bernie Sanders has been surging recently and in some states like New Hampshire holds a sizable lead\nThe Soul Cycle event took place at the popular cycling studio's Tribeca location in New York City, which caters to the wealthy neighborhood. This Louis Vuitton tote was one of many pricey purses carted in and out\nChelsea is a mother with a second baby on the way and most of the people in attendance were also female\nWhile the event would be desirable with working women, no doubt the 2pm weekday timing made it a more difficult sell\nIt is crunch time for the Hillary campaign with just five days until the first votes are cast in the primary election in Iowa.\nHer opponent Bernie Sanders has been surging recently and in some states like New Hampshire holds a sizable lead over the former Secretary of State.\nSanders also met with President Obama at the White House this week.","url":"https://www.dailymail.co.uk/news/article-3420932/Chelsea-Clinton-s-fundraising-FLOP-Soul-Cycle-event-raise-money-Hillary-bust-2700-seats-offered-just-50-bikes.html"}
