{"authors":["John Binder"],"date_download":"2018-10-30 21:42:12","date_modify":"2018-10-30 21:42:12","date_publish":"2018-06-18 00:27:59","description":"Chelsea Clinton, the daughter of President Bill Clinton and failed presidential candidate Hillary Clinton, used Father's Day to advocate for open borders, saying \"no parent\" and \"no person\" should be supporting President Trump's crackdown at the U.S.-Mexico border.","filename":"data/vaneerConsumption/ChelseaClintonAdvocatesOpenBordersonFathersDayNoParentNoPersonShouldSupportTrumpAgenda.json","image_url":"https://media.breitbart.com/media/2018/06/chelsea.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_06_17__1540935732.html","title":"Chelsea Clinton Advocates Open Borders on Father's Day: 'No Parent, No Person Should Support' Trump Agenda","title_page":"Chelsea Clinton Advocates Open Borders on Father's Day: 'No Parent, No Person Should Support' Trump Agenda | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Chelsea Clinton, the daughter of President Bill Clinton and failed presidential candidate Hillary Clinton, used Father’s Day to advocate for open borders, saying “no parent” and “no person” should be supporting President Trump’s crackdown at the U.S.-Mexico border.\nClinton displayed her outrage online at Trump’s plan to construct a tent city near El Paso, Texas, to house unaccompanied minors who arrive in the U.S. by crossing the southern border.\n“I also could not imagine being forcibly separated from my children as I sought sanctuary. No parent, no person should support this,” Clinton said, pointing to photos of the tent city where unaccompanied minors will be sheltered by the Department of Health and Human Services.\nOn #FathersDay & every day, I could not imagine a better dad for Charlotte & Aidan than Marc. I also could not imagine being forcibly separated from my children as I sought sanctuary. No parent, no person should support this: https://t.co/uUNs6yFklD — Chelsea Clinton (@ChelseaClinton) June 17, 2018\nThe policy to prosecute all illegal border crossers, including illegal alien adults who cross the border with children, results in border-crossing parents having their children taken into federal custody. This is a loophole known as the Flores Settlement Agreement.\nDetaining child border crossers was a policy during the Obama administration, where Breitbart Texas exclusively reported on the conditions in which unaccompanied minors were being packed into crowded cells and holding facilities.\nPresident Trump has asked the Republican-controlled Congress and Democrat lawmakers to close the loophole so that minors can be swiftly deported from the U.S. with their border-crossing parents. But lawmakers have failed to end the agreement.\nMost recently, Breitbart News exclusively revealed the comfortable living conditions that unaccompanied minor border crossers are placed into by the federal government.\nChild Border Crossers Have Higher Standard of Living than 13M Impoverished Americanhttps://t.co/QRJBmUNUBX — John Binder 👽 (@JxhnBinder) June 17, 2018\nAdditionally, these unaccompanied minor border crossers have a higher standard of living when in federal custody than the more than 13 million American children who are living in poverty in the U.S., Breitbart News noted. Less than four percent of unaccompanied minors are deported from the country.\nAs Breitbart Texas reported, more than 100,000 unaccompanied minors have been released into the interior of the U.S. since 2016. In Fiscal Year 2018 alone, more than 13,000 unaccompanied minors were resettled across the country, Breitbart News reported.","url":"https://www.breitbart.com/politics/2018/06/17/chelsea-clinton-no-parent-no-person-should-support-trumps-border-policy/"}
