{"authors":["Kieran Gill For Mailonline"],"date_download":"2018-10-23 01:27:53","date_modify":"2018-10-23 01:27:53","date_publish":"2017-03-10 09:42:50","description":"KIERAN GILL: Chelsea have added Luca Cattani to their scouting team as part of a wider scheme to sign Italian targets. The club have been linked with Napoli's Kalidou Koulibaly.","filename":"data/vaneerConsumption/ChelseasnapupexPalermosportingdirectorLucaCattani.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/09/3E1DE2A300000578-0-image-a-10_1489138741274.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4300536_Chelsea-snap-ex-Palermo-sporting-director-Luca-Cattani_1540258073.html","title":"Chelsea snap up ex-Palermo sporting director Luca Cattani","title_page":"Chelsea snap up ex-Palermo sporting director Luca Cattani | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Chelsea are adding Italian chief Luca Cattani to their scouting network.\nSportsmail can confirm Cattani – previously sporting director at Serie A club Palermo – will begin by working with the academy as the Blues' Italian family grows.\nCattani will track young talent in Antonio Conte’s homeland in the hope that Chelsea can steal a march on their rivals in Europe.\nLuca Cattani had previously worked at Serie A side Palermo and Serie B outfit Novara\nHe becomes the latest Italian to join the west London club.\nConte, 47, added several trusted aides from Italy to his backroom staff when he took over in the summer.\nAntonio Conte has made no secret of his desire to return to his homeland for transfer targets\nAnd it is no secret that the former Juventus player and manager likes to look towards his homeland for targets.\nMarcos Alonso was signed from Serie A side Fiorentina and Chelsea have been linked to several stars, including Juventus centre back Leonardo Bonucci. They were also interested in Napoli's Kalidou Koulibaly in the summer.\nAs well as Palermo, Cattani worked for Serie B side Novara, and his task will be to find future stars for Chelsea to help develop.","url":"https://www.dailymail.co.uk/sport/football/article-4300536/Chelsea-snap-ex-Palermo-sporting-director-Luca-Cattani.html"}
