{"authors":["Nick Purewal","Press Association"],"date_download":"2018-10-23 01:12:30","date_modify":"2018-10-23 01:12:30","date_publish":"2016-01-11 11:44:28","description":"Ruben Loftus-Cheek has branded the FA Cup 'a competition we've got to win' as Chelsea fight to save their season. The teenage midfielder fired his first senior goal against Scunthorpe.","filename":"data/vaneerConsumption/ChelseamustwinFACupsaysRubenLoftusCheek.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/2FFE10D100000578-0-image-a-19_1452512174243.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3393783_Chelsea-win-FA-Cup-says-Ruben-Loftus-Cheek_1540257150.html","title":"Chelsea must win FA Cup, says Ruben Loftus-Cheek","title_page":"Chelsea must win FA Cup, says Ruben Loftus-Cheek | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ruben Loftus-Cheek has branded the FA Cup 'a competition we've got to win' as Chelsea fight to save their season.\nThe teenage midfielder fired his first senior goal as Chelsea eased past Scunthorpe 2-0 at Stamford Bridge on Sunday, booking their place in the fourth round.\nDiego Costa's fourth goal in three games set the Blues on course before Loftus-Cheek sealed the win in the second half.\nRuben Loftus-Cheek scored Chelsea's second goal in their 2-0 FA Cup victory over Scunthorpe\nLoftus-Cheek celebrates his goal and says Chelsea must go on and win the competition\nGuus Hiddink guided Chelsea to FA Cup glory in his first short-term Stamford Bridge stint in 2009 and now Loftus-Cheek believes the Blues must throw everything at helping the Dutchman repeat that triumph.\n'Even if we were doing really well in the Premier League it's still a competition we'd want to win,' Loftus-Cheek told Chelsea TV.\n'But this season I think we should really want to win it.\n'The Premier League hasn't gone that well, so I think this is a competition we've got to win.'\nInterim boss Hiddink admitted Loftus-Cheek could be called into more regular action in the weeks and months ahead after impressing in training.\nChelsea's 19-year-old academy product joked he would play in defence to get onto the field, before thanking the club's supporters for their strong backing.\nThe Blues youngster is congratulated by his team-mates after recording his first goal in senior football\nDiego Costa put Chelsea in front in what proved to be a comfortable afternoon for Guus Hiddink's side\n'Right now I'm happy to play anywhere - right-back, left-back, wherever!' said Loftus-Cheek, when asked his preferred midfield role.\n'I just want to get on the pitch, get some minutes and enjoy my football.\n'The fans have been so supportive of me, right through from when I joined the first team.\n'I feel a bond with the fans and it's a really good feeling to have them behind me.'\nDefender Gary Cahill echoed Loftus-Cheek's sentiments in calling on Chelsea to focus on cup glory this year, to atone for the horrendous Premier League form that cost Jose Mourinho his job.\n'I think the FA Cup and the Champions League can be two massive competitions for us, and two that we want to go as far as we possibly can in,' Cahill told Chelsea TV.\n'Every game's important, but the FA Cup is definitely important for us this year.'","url":"https://www.dailymail.co.uk/sport/football/article-3393783/Chelsea-win-FA-Cup-says-Ruben-Loftus-Cheek.html"}
