{"authors":["Charlie Spiering"],"date_download":"2018-10-30 21:45:34","date_modify":"2018-10-30 21:45:34","date_publish":"2016-09-23 14:42:02","description":"Chelsea Clinton took the stage to the divisive “Fight Song” campaign anthem by Rachel Patten wearing a “Make Herstory” black t-shirt, black pants, and black boots. | Politics","filename":"data/vaneerConsumption/ChelseaClintonDebutsMakeHerstoryTShirtAtHillaryCampaignRally.json","image_url":"https://media.breitbart.com/media/2016/09/Screen-Shot-2016-09-23-at-10.31.58-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_09_23__1540935934.html","title":"Chelsea Clinton Debuts ‘Make Herstory’ T-Shirt At Hillary Campaign Rally","title_page":"Chelsea Clinton Debuts ‘Make Herstory’ T-Shirt At Hillary Campaign Rally | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Former (and possibly future) first daughter Chelsea Clinton is on the trail for her mother Hillary Clinton, and was sporting a new look during a rally for students at Michigan State University.\nChelsea took the stage to the divisive “Fight Song” campaign anthem by Rachel Patten. She was wearing a “Make Herstory” black t-shirt, black pants, and black boots.\nThe shirt is designed by fashion designers Dao-Yi Chow and Maxwell Osborne, but is currently sold out at the Clinton campaign store.\n“A Hillary Clinton presidency would mark an exciting and bold new chapter in America’s story—and in the story for women’s equality,” wrote the designers about their shirt. “Change doesn’t happen by keeping things the same. Real change comes from being brave, being different.”\nEarlier this month, Chelsea hosted an official campaign fashion event for her mother’s campaign, featuring art and fashion created to signal Hillary Clinton’s historic run for president.\nThe event was headlined by fashion designer Anna Wintour who praised Clinton for serving as a role model to working mothers.\n“Chelsea started raising her own daughter while leading a global foundation, writing a book, and teaching,” she said. “Some people still ask whether a woman can be both a visionary leader and a first-rate mother. Chelsea affirms the one-word answer for my daughter’s generation: Yes.”","url":"https://www.breitbart.com/politics/2016/09/23/chelsea-clinton-wears-make-herstory-t-shirt-campaign-rally/"}
