{"authors":["Meredith Rizzo"],"date_download":"2018-10-23 00:57:29","date_modify":"2018-10-23 00:57:29","date_publish":"2017-04-23 00:00:00","description":"After an incorrect dose of a chemotherapy drug for Crohn's disease caused Anne Webster's bone marrow to shut down, she decided that, if she survived, she'd write about her experience.","filename":"data/vaneerConsumption/ChemoScrambledMyBrain.json","image_url":"https://media.npr.org/assets/img/2017/04/21/chemo-brain-2_wide-f1a9444189e8dea198ae785f6583f59b6f7ff506.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2017_04_23_525062440_chemo-scrambled-my-brain_1540256249.html","title":"Chemo Scrambled My Brain","title_page":"A Poem About Chemotherapy And The Brain : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Chemo Scrambled My Brain\nEnlarge this image Angie Wang for NPR Angie Wang for NPR\nAfter years working as a nurse in critical care units, Anne Webster found herself lying in the hospital struggling to get well. She had been given the wrong dose of a chemotherapy medication to treat Crohn's disease. The mistake had caused her bone marrow to shut down, and she'd developed pneumonia.\nAs she lay in the hospital, she thought, \"If I live, I'm gonna write about this.\"\nAfter three weeks, she recovered. And the experience led Webster to write Chemo Brain, a poem about how the drug scrambled her thinking.\nPoetry, she says, has a way of trimming \"away every extraneous word until the essence shines through.\"\nThese days, she writes essays and poetry full-time. Webster's first collection of poems, A History of Nursing, was nominated for a 2008 National Book Award. She's currently working on a second anthology and a novel about a nurse involved in a murder mystery.\n\"I'm a nurse,\" she says. \"It's what I know.\"\nListen to Anne Webster read her poem 1:20\nBy Anne Webster\nSince a doctor gave me poison pills that left\nmy heart a swollen slug, killed off my bone marrow,\nset my lungs to clamoring, I can get brain-freeze\nwithout eating a snow cone. When I walk\nmy neighborhood's knotted streets, lost drivers\nstop to ask directions. After thirty years, I know\nthe pretzel-turns, but when they motor off, I wonder,\nDid I say left when I meant right? My husband\ngets that look when words change lanes\nwithout bothering to signal. Like soap bubbles\nthey pop from my mouth--\"bird\" for \"tree,\" \"cat\" for \"dog.\"\nI know I've done it again when my grown children\nall but pat my head. As if by magic, plastic wrap,\ndetergent appear in the refrigerator. After errands,\nmy car comes home nicked and scratched,\nas if it's sneaking nips on the sly. I'm afraid\nto drive anywhere new, one wrong turn\nI'm lost forever. Just ask me a simple math problem --\nnumbers dissolve into my skull's black hole.\nEven as I curse that doctor, my brain wakes,\na baby from a nap, stretching till its eyes pop open.\nA tsunami of panic recedes, but, as with an errant lover,\nit's a long time before I am able to trust again.\nApril is National Poetry Month, and Shots is exploring medicine in poetry through the words of doctors, patients and health care workers. The series is a collaboration with Pulse: Voices Through The Heart Of Medicine, a platform that publishes personal stories of illness and healing.","url":"https://www.npr.org/sections/health-shots/2017/04/23/525062440/chemo-scrambled-my-brain"}
