{"authors":[],"date_download":"2018-10-23 03:51:36","date_modify":"2018-10-23 03:51:36","date_publish":"2017-03-10 13:53:14","description":"The world's chemical watchdog Friday condemned the use of the deadly VX nerve agent in the assassination of North Korean leader Kim Jong-Un's half-brother...","filename":"data/vaneerConsumption/ChemicalwatchdogcondemnsVXuseinKimmurder.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/13/wire-196275-1489153996-910_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4301378_Chemical-watchdog-condemns-VX-use-Kim-murder_1540266696.html","title":"Chemical watchdog condemns VX use in Kim murder","title_page":"Chemical watchdog condemns VX use in Kim murder | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Malaysia's Hazmat team conducts a decontamination operation at the Kuala Lumpur International Airport on February 26, 2017 where Kim Jong-Nam, the half-brother of North Korean leader Kim Jong-Un, was killed\nThe world's chemical watchdog Friday condemned the use of the deadly VX nerve agent in the assassination of North Korean leader Kim Jong-Un's half-brother last month.\nThe Organisation for the Prohibition of Chemical Weapons (OPCW) said its executive council \"unequivocally condemned the use of any chemical weapon by anyone under any circumstances.\"\nThe council, made up from 40 member states, called \"for those responsible for the use of chemical weapons to be held accountable.\"\nIt also asked the OPCW's director general Ahmet Uzumcu to \"provide technical assistance upon request from Malaysian authorities for its national investigation.\"\n\"The council underscored its deep interest in receiving and considering the official results of the investigation\" once completed by Malaysia.\nMalaysia's police chief on Friday confirmed that the man assassinated at Kuala Lumpur's international airport on February 13 was Kim Jong-Nam, half-brother of Kim Jong-Un.\nMalaysian authorities had earlier declined to officially confirm the victim's identity or release his body, saying they needed a DNA sample from next-of-kin.\nThe 45-year-old's wife and children, who were living in exile in the Chinese territory of Macau, have since gone into hiding over fears that his 21-year-old son, Kim Han-Sol, could be seen as a potential rival by his uncle Kim Jong-Un in a country roiled by bloody purges.\nThe brazen Cold War-style killing has triggered a bitter diplomatic row between the previously friendly Asian nations, which have expelled each other's ambassadors and refused to let their citizens leave.","url":"https://www.dailymail.co.uk/wires/afp/article-4301378/Chemical-watchdog-condemns-VX-use-Kim-murder.html"}
