{"authors":["Rebecca Davison For Mailonline"],"date_download":"2018-10-23 02:55:38","date_modify":"2018-10-23 02:55:38","date_publish":"2016-01-28 18:09:26","description":"The 32-year-old shared the racy snap on her Instagram account on Thursday after having landed in Barbados the day before for best friend Kimberley Walsh's wedding.","filename":"data/vaneerConsumption/CherylFernandezVersinishowsoffhertonedabsinverysexyredbikiniselfie.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30ACD8BA00000578-0-image-a-43_1454005678595.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421446_I-used-island-life-Cheryl-Fernandez-Versini-shows-toned-abs-sexy-red-bikini-selfie_1540263338.html","title":"Cheryl Fernandez-Versini shows off her toned abs in very sexy red bikini selfie","title_page":"Cheryl Fernandez-Versini shows off her toned abs in very sexy red bikini selfie | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Cheryl Fernandez-Versini is no doubt set to thrill her fans with a very sexy bikini selfie.\nThe 32-year-old shared the racy snap on her Instagram account on Thursday after having landed in Barbados the day before for best friend Kimberley Walsh's wedding.\nLooking incredible and showing off her toned abs, the single singer showed off her red two-piece, captioning the image: 'I could get used to this island life.'\nScroll down for video\n'I could get used to this island life': Cheryl Fernandez-Versini shows off her toned abs in very sexy red bikini selfie on Instagram on Thursday after touching down in Barbados ahead of Kimberley Walsh's wedding\nStanding in a very posh bathroom, she covered up a little in a cream lace cover-up as she looked better than ever and while her head was cut off in the snap, loose tendrils of her trademark brunette locks tumbled over her shoulder, allowing her toned frame to be the central focus of the sexy image.\nWhile her own marriage may be over, Cheryl did not let her romance woes quash her excitement for the forthcoming wedding of her best pal and former Girls Aloud band mate Kimberley Walsh.\nThe Fight For This Love hitmaker also took to Instagram on Wednesday to share a cute snap as she touched down in Barbados to attend her pal's nuptials, where she will act as a bridesmaid.\nSee more on Cheryl Fernandez-Versini as she shows off her toned abs in a bikini\nAnd she's landed! Cheryl Fernandez-Versini did not allow her own romance woes quash her excitement for the forthcoming wedding of her best pal and former band mate Kimberley Walsh\nSporting a cobalt blue cut-out shirt and wearing perfectly applied make-up, Cheryl pouted into the camera while raising her eyebrows in mock shock.\nRather than mention her pal's wedding, The X Factor judge opted to share her delight at landing in the home of fellow pop star Rihanna, who she lovingly dubbed 'Ri Ri'.\nIn the caption she wrote: 'just touched down in Ri Ri's town #Barbados #dataccentdoe' - clearly enjoying the dialect of the locals she had met since arriving in the Caribbean.\nAnd while Cheryl is on holiday, her hectic work schedule never stops at home as she has just launched a stunning new make-up campaign with Maybelline.\nThe pretty star, who was formerly a face of Loreal, looks stunning in the sensational new images for the campaign, in which she pouted saucily into the camera while applying mascara.\nCheryl Fernandez-Versini news as she arrives in Barbados for Kimberley Walsh's wedding\nSorting out the forms: Earlier in the day, Kimberley and her fiance Justin Scott had the legalities to attend to as they headed to the local government offices to pick up their marriage certificate\nElsewhere on the wedding trip, Kimberley and her fiance Justin Scott had the legalities to attend to as they headed to the local government offices to pick up their marriage certificate.\nThe Girls Aloud star was spotted making the most of the sunshine in a pretty strapless maxi dress as she left the office with her partner of 14 years.\nKimberley, 34, looked gorgeous in her maxi, already showing off a hint of tan after jetting into Barbados with her family the day before.\nSelfie queen: Cheryl is well known for her love of a selfie on Instagram\nCheryl recently revealed her excitement for the ceremony, telling Hello! magazine: 'Kimberley is just the best friend you could wish for. I'm so excited for the wedding.\n'It is a celebration of two people in love that we've all been a part of, and I am so excited to celebrate their love story.'\nWhile the exact date is being kept under wraps for now, Kimberley has said she has been planning the big day for months.\nShe has been dating property developer Justin for 14 years, and they welcomed their first child into the world in late 2014.\nHer former bandmates Cheryl and Nicola Roberts will act as bridesmaids on the day, while Sarah Harding and Nadine Coyle are reported to have been left off the guestlist.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421446/I-used-island-life-Cheryl-Fernandez-Versini-shows-toned-abs-sexy-red-bikini-selfie.html"}
