{"authors":["Bianca London For Mailonline"],"date_download":"2018-10-22 23:17:56","date_modify":"2018-10-22 23:17:56","date_publish":"2016-01-29 11:00:04","description":"The new venture, in Chelsea, is owned by her PA Lily England's boyfriend, Shane Collins, and Cheryl has been working up a sweat there in recent weeks.","filename":"data/vaneerConsumption/CherylFernandezVersiniovesthefightclubmeetsnightclubworkout.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/10/30B1975600000578-0-image-a-13_1454065039099.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3422487_The-secret-Cheryl-s-trim-physique-star-loves-fashionable-fight-club-meets-nightclub-workout-s-huge-waiting-list-join-list-class_1540250276.html","title":"Cheryl Fernandez-Versini oves the 'fight club meets nightclub' workout","title_page":"Cheryl Fernandez-Versini oves the 'fight club meets nightclub' workout | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She teased her fans with a racy snap of her toned body and honed abs on her Instagram account on Thursday - and now the secret behind Cheryl Fernandez-Versini's trim figure has been revealed.\nThe 32-year-old, who is currently sunning herself in Barbados for best friend Kimberley Walsh's wedding, loves Kobox - an A-list class described as 'fight club meets nightclub'.\nThe new venture, which is situated on the King's Road in Chelsea, is owned by her PA Lily England's boyfriend, Shane Collins, and Cheryl has been working up a sweat there in recent weeks.\nScroll down for video\nCheryl Fernandez-Versini teased her fans with a racy snap of her toned body from Barbados and now the celebrity loved workout class she swears by has been revealed\nThe 60-minute workout combines heavy bag boxing routines with functional strength training in pitch black with UV lighting.\nWith flattering dark blue studio lighting, a virtual workout wall to help navigate punching sequences and shock absorbent, nail-friendly water filled punch-bags, Kobox aims to take the fear factor out of boxing.\n‘Kobox is a serious workout but anyone can do it,’ says Barry’s Bootcamp Master Trainer, Shane Collins, who is the brains behind the concept.\n‘We’re making boxing accessible to people who want to get fit, but don’t want to get hit. We want people to have fun, sweat lots and feel empowered after every class.’\n'Prepare yourself for a fun, fat burning workout where you will punch, jump, lift and run yourself to a new body and a new level of self confidence,' he says of the £20-a-pop session.\n'At Kobox we don't just change bodies, we change minds.\n'Inspirational instructors, a bespoke studio setting and a nightclub standard sound system create an environment where first time boxers and seasoned athletes alike can let loose, clear their minds and empower themselves with an attitude that is born in the studio and lives far beyond its walls.'\nThe class is no doubt perfect for Cheryl, who has been having a stressful time in recent weeks with marital woes.\nThe 32-year-old loves Kobox - an A-list class described as 'fight club meets nightclub' - and has been pictured on the boutique boxing gym's Instagram page showing off her moves\nCheryl posted an Instagram snap of herself enjoying some boxing with Shane, writing: 'K O'd by Shane'\nThe new venture, which is situated on the King's Road in Chelsea, is owned by her PA Lily England's boyfriend, Shane Collins\nCheryl's favourite class begins with a warm up consisting of jump rope and shadowbox to activate all of the major muscle groups.\nThe instructors have also devised a ‘Punch By Numbers’ approach to training on the heavy bag and project the combination on the walls, too.\nThey also encourage body weight exercises, such as push ups and pull ups, and throwing medicine balls around.\nThe X Factor judge attended the launch of the boutique boxing gym on Chelsea's King's Road after earlier enjoying a training session at the same venue earlier this month.\nCheryl at the launch of Kobox, the UK's first boutique boxing gym, earlier this month\nThe 60-minute workout combines heavy bag boxing routines with functional strength training in pitch black with UV lighting\nIndeed, she posted an Instagram snap of herself enjoying some boxing with Shane, writing: 'K O'd by Shane.'\nLikewise, the gym shared a snap of Cheryl in her workout gear accompanied by the caption: 'Turn out the lights and watch her glooooooooow....our featherweight champion @cherylofficial.'\nMuch like Russ Bateman's SBC class and Psycle, Kobox has become the cult class du jour.\nOther famous fans of the class include Ellie Goulding, Vanessa White and Ashley Roberts but if you're looking to sweat alongside the A-list, join the queue.\nClasses, which can be booked online, get booked out well in advance and many rack up a long waiting list.","url":"https://www.dailymail.co.uk/femail/article-3422487/The-secret-Cheryl-s-trim-physique-star-loves-fashionable-fight-club-meets-nightclub-workout-s-huge-waiting-list-join-list-class.html"}
