{"authors":["Guy Adams For The Daily Mail"],"date_download":"2018-10-22 21:08:27","date_modify":"2018-10-22 21:08:27","date_publish":"2016-01-11 00:26:11","description":"A blonde, pale-skinned woman, who converted to Islam a few years ago, has moved into a small and somewhat tatty rented home with a local Asian man.","filename":"data/vaneerConsumption/CherieBlairssisterLaurenBoothisacheerleaderforIslamiczealots.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/00/3000A05000000578-0-image-a-47_1452471591071.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393150_How-Cherie-s-sister-cheerleader-Islamic-zealots_1540242507.html","title":"Cherie Blair's sister Lauren Booth is a cheerleader for Islamic zealots","title_page":"Cherie Blair's sister Lauren Booth is a cheerleader for Islamic zealots | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"To the tight-knit community of Heaton Mersey, a working-class suburb of Stockport adjoining the M60, it has become quite the local soap opera.\nA blonde, pale-skinned woman, who converted to Islam a few years ago, has moved into a small and somewhat tatty rented home with a local Asian man. The 48-year-old ‘married’ her bearded paramour, Sohale Ahmed, a well-known activist for Muslim charities, in a ‘religious’ ceremony two years ago.\nClad in a colourful hijab, and often accompanied by her two, similarly attired daughters (from a previous marriage), the woman — who is far taller than the man she calls her ‘husband’ — has since attracted plenty of attention on the local streets.\nNot all of it is good, though. For just around the corner is a larger terrace house which is actually owned by 51-year-old Mr Ahmed.\nLauren Booth, 45, and her new husband Sohale Ahmed, 49. who is still 'legally' married to his wife of 16 years\nAnd here lives a second Muslim woman who, according to British law, is his actual wife. They had a ‘legal’ wedding — not just a ‘religious’ one — 18 years ago, and together raised three children, who still reside with her.\nFor reasons that are perhaps blindingly obvious, relations between the two inter-connected households, with both wives living within a stone’s throw of each other, are not entirely cordial.\nIndeed, not long ago, the ‘legal’ wife, Faiza, publicly claimed that Ahmed ‘destroyed’ her family by leaving her for her blonde rival.\nIn an interview, given when wounds appear to have been particularly raw, she went so far as to accuse Ahmed of a ‘betrayal’ of Islam.\nAlthough the second, ‘religious’ marriage doesn’t technically make Ahmed a bigamist (since Islamic ceremonies have no official status under UK law), the ‘legal’ wife said it ‘appals’ her ‘and other Muslim women’ and had left her ‘shocked and furious’.\nInevitably, two years ago these explosive comments ended up being published in a national newspaper.\nFor adding fuel to the gossip machine was an intriguing fact: the tall, pale-skinned woman who has so scandalised Heaton Mersey is none other than Lauren Booth, the sister-in-law of Tony Blair, the former Prime Minister.\nOnce a fixture on the London social circuit, recent years have seen Booth’s life take a series of bizarre and unlikely turns.\nThe daughter of Cherie Blair’s actor father Tony Booth (the two women have different mothers), she first came to public attention in the late Nineties by leveraging her connection with No 10 into a colourful career as a pundit and lifestyle journalist.\nHer public profile arguably peaked in 2006, when she bungee-jumped her way on to ITV’s I’m A Celebrity . . . Get Me Out Of Here! and became a national talking point.\nYet having scaled these somewhat tacky heights, she promptly performed an unlikely career volte face, deciding to leave the London party circuit to devote several years to earnestly campaigning against the Israeli ‘occupation’ of Palestine.\nThen, having suffered the very public breakdown of her first marriage, to actor Craig Darby, in 2010 Booth announced her conversion to Islam.\nAside from the hoo-hah over her 2013 ‘marriage’ to Sohale, the ensuing years have seen her journalistic work largely limited to roles with Al Jazeera and Press TV, a little-watched network run by the government of Iran.\nLauren Booth (left) with her father Tony Booth (centre) and her half-sister Cherie Blair (front right)\nBehind the scenes, however, Booth has been anything but idle. For while her career may have faltered, she appears to have carved out a niche advocating for some of Britain’s most controversial Muslim charities.\nShe is, for example, a patron of CAGE, the organisation which described ISIS killer Jihadi John as a ‘beautiful young man’ and was in recent days revealed by the Daily Mail’s Investigations Unit to be using meetings on university campuses to ‘sabotage’ the Government’s anti-extremism programme.\nBooth is also an influential supporter of HHUGS, a notorious group which funds the families of terrorists, and — as the Mail today discloses — has falsely claimed that a convicted Al-Qaeda killer called Adel Abdel Bary has been ‘detained without charge’.\nAs we further reveal today, she is even quoted on leaflets for HHUGS, which boasts links with a string of homo- phobic extremists.\nBooth has also advocated for a curiously opaque Muslim charity called PeaceTrail, which she co-founded, and is a key player in the campaign against Prevent — the anti-radicalisation policy introduced by her brother-in-law, Tony Blair, in the wake of the 7/7 attacks in London. On Twitter, she describes it as ‘toxic’.\nAll of which begs a question: how exactly did this former girl-about-town, with a career built on sharing indiscreet tittle-tattle about the Blairs, come to find herself at such a far-flung (and arguably extreme) outpost of the political spectrum?\nOr, to put it another way, what prompted a chain-smoking confessional journalist, with a colourful private life and a liking for alcohol, to become a sort of poster girl for conservative Islam?\nLauren Booth, the sister-in-law of former British Prime Minister Tony Blair, addresses a mass anti-war demonstration marking the 10th anniversary of the Afghanistan war, in London's Trafalgar Square in 2011\nBooth has credited the fact of her conversion on an appreciation of Muslim culture and an ‘intensely spiritual’ experience in an Iranian mosque.\nBut another key life event, about which Booth has been curiously silent, can be found in a momentous event that took place a few days after she had announced her religious conversion.\nIn December 2010, she was declared bankrupt at the High Court in London. Among the creditors was her half-sister, Cherie, who’d lent her £15,000 the previous year (and insisted that she sign a loan contract). It was the second time Lauren had suffered such an indignity, having also been declared bankrupt in 2007.\nSoon, however, Booth was to discover that her new faith would open up an array of fresh career opportunities.\n‘Lauren has many faults,’ is how a longstanding Fleet Street acquaintance puts it. ‘She is terrible with money, and an awful person to lend cash or anything else to, as Cherie found. But one thing that she is absolutely first class at — and I mean beyond brilliant — is spotting a new career opportunity.’\nTo that end, Booth was soon offered presenting spots on Al Jazeera and Press TV, and invited to discuss her faith on ITV. She was also booked as a speaker by Islamic organisations in the UK and overseas.\nBooth’s personal website now describes her as a ‘journalist, broadcaster and human rights activist’, and claims that she ‘tours the globe speaking about her “Journey to Islam”, seeking to share the beautiful nature of the religion with as wide an audience as possible.’ It adds: ‘She is invited to lecture on campuses internationally on topics including: Islamophobia, The Media and Islam, Why Women Revert [to Islam] and issues related to the Palestinian Struggle.’\nNice work if you can get it, one might argue.\nHowever, behind the lofty job description, not everything has been running entirely smoothly.\nTake, for example, Booth’s journalistic career. According to her current profile on Twitter, she works, or at least has worked, for Al Jazeera, Press TV, the Mail on Sunday and the New Statesman.\nLauren Booth who has converted to Islam wears her hijab\nHowever, those professional relationships appear to be historic. A glance at the archives suggests that her most recent article for the Mail’s sister paper was published in 2010, and she was last by-lined in the New Statesman in 2005.\nPress TV do not seem to have hired her since 2013, when she made a documentary for them called The Judgment.\nAnd Al Jazeera, who in 2014 gave her a job at its headquarters in the Qatari capital Doha, no longer counts Booth as a staffer, having ‘let her go’, in the words of a company source, last May, barely six months after she joined.\nThen there is the small matter of PeaceTrail, the charity Booth founded with her ‘husband’ Ahmed in 2012. The organisation claims to have been set up to ‘look after Muslim women and children who are homeless in a small house paid for by the charity’.\nHowever, its website, which appears to have been updated last in March 2014, provides no details about whether this house actually exists. It gives only very vague information about how its money is being spent in the UK, saying that it ‘provides urgent funding to sisters in need’. With regard to work overseas, there is little information aside from photographs of an aid trip to Palestine that PeaceTrail sent Booth on in April 2013.\nFor all this, the charity has been raising plenty of cash. In June 2012, for example, it says ‘over 200 guests joined us to celebrate the launch of the PeaceTrail charity at Hilton Docklands’, noting that the event raised ‘over £50,000 in donations’.\nIt held a £10-a-head fundraising dinner at Waltham Forest Town Hall the following July — a month that saw Booth take the charity on a fundraising tour, speaking at events in Burnley, Rochdale, Middlesbrough and Birmingham.\nMeanwhile, in 2014, it raised £315 via a fundraising webpage. Donations are also still being solicited.\nWe must assume these events raised plenty of money. So where, exactly, is it all going?\nIt is difficult, or rather impossible, to say. Bizarrely, PeaceTrail has never filed either audited accounts or an annual return with the Charities Commission. That, as it happens, is a legal requirement. The Charities Commission says such paperwork is almost a year overdue, putting it in danger of being struck off.\nElsewhere, PeaceTrail appears to have a parent company called Peace 2012 (which was registered to her ‘husband’ Ahmed’s parents’ house in Stockport almost four years ago).\nYet Peace 2012 has only ever filed one set of accounts at Companies House, who say that its accounts and annual return are also a year overdue, again putting it in danger of being struck off.\nThey showed that, in April 2013, the firm had just £1 in the bank and debts of £770.\nSo what exactly is going on?\nWhen I asked Mr Ahmed this week, he claimed that audited accounts are ‘currently being prepared’ and will soon be submitted to the relevant authorities.\nThey will show that some of the charity’s income has ended up in Ahmed’s back pocket, by way of a ‘salary’ which he no longer draws.\nAnother portion was spent on ‘emergency housing’ for ‘more than eight women and children’ in the North West. Still more was spent on a project in the Gaza Strip.\nAs to how much money has passed through PeaceTrail’s accounts, he said that the Docklands event, which the charity’s website claims raised ‘over £50,000 in donations’, in fact made far less because the £50,000 figure actually refers to ‘pledges’ rather than donations.\n‘Sadly, it is common for pledges to go unfulfilled in the charity sector,’ he said.\nDoubtless the legally required audit of PeaceTrail’s finances, which Ahmed says is finally under way, will get to the bottom of exactly how much cash was actually generated.\nMeanwhile, the personal finances of Booth and Ahmed appear to be equally unconventional. Ahmed, for example, appears to be in deep financial difficulties, with two county court judgments outstanding against him [for unpaid debts of £975 and £2,989], and six dissolved companies to his name.\nIn December, an ‘equitable charge’ was registered against his home by 1st Credit, a debt collection company, which means that as a last resort the house could be seized if debts are defaulted on.\nLast February, his ‘legal’ wife, Faiza, was awarded what are called ‘home rights’ to live there under the Family Law Act, according to Land Registry records, even though she doesn’t own the property. All of\nwhich is par for the course, according to the aforementioned Fleet Street acquaintance.\n‘The problem with Lauren,’ he says, ‘is that with her, things always seems to end in a mess.’\nWhen Lauren was a teenager, her mother took up with an 18-year-old alcoholic schizophrenic, who allegedly beat her. When Lauren became a young adult, she attended drama school and attempted to pursue a career in acting, with little success.\nHer life changed, however, when her half-sister entered Downing Street. The development made her an in-demand columnist, who could reveal family gossip about what she called her ‘charming, Marmite-sandwich-making brother-in-law’ and his ‘trophy wife’.\nLauren Booth, British journalist and peace activist,\nHer 2000 wedding, to Craig Darby, whom she’d met at drama school, was at least partly paid for by Hello! magazine. (Cherie attended, but not Tony.)\nThey later moved to France with their young daughters, Alex and Holly, with Lauren telling friends she intended to write a tell-all memoir while Craig did up a farmhouse where they would live.\nTheir marriage and finances eventually hit the rocks, however, and in late 2009, after a drunken argument, she changed her status on Facebook to ‘single’. A couple of weeks later, Craig crashed his motorbike into a telegraph pole.\nHe wasn’t wearing a helmet, was left in a coma for two weeks, and suffered severe brain injuries.\nBy July 2010, the couple had split for good.\nIn the ensuing months, Booth was declared bankrupt and then announced her conversion to Islam after visiting the shrine of Fatima al-Masumeh in the Iranian city of Qom.\n‘I read the Koran every day,’ she declared. ‘I also haven’t had a drink in 45 days, the longest period in 25 years.’\nAt first, Lauren’s move was met with cynicism. Her father gave an interview headlined ‘I don’t even love her’. He said: ‘If I thought she genuinely believed in Islam, it would be a different matter. But I’m afraid I don’t.\n‘I honestly don’t know what her motivation is. Maybe it’s mischief-making. Maybe a career move. Is she after a job with Al Jazeera, the Arabic news network? I don’t know, but it’s madness.’\nFor her part, Lauren stuck to her guns, saying: ‘We haven’t seen each other for years, so how can he know anything about me or have any valid views about my conversion? I just feel sorry for him. The rest of my family is very supportive.’\nShe was soon dressing her daughters in hijabs and bringing them up according to conservative Islamic tradition. Quite what their father, Craig, made of this lifestyle change is anyone’s guess, although colleagues of Lauren say her ex-husband, who is still unable to work after his motorcycle accident, does maintain contact with the girls.\nHowever ugly their marriage breakdown, it didn’t, of course, prevent Lauren tying the knot for a second time.\nIn 2012, she placed a jokey advert on Facebook saying she was seeking a husband and that ‘Mossad agents, secret drinkers, CIA stooges, men who don’t pray and men who don’t pay’ need not apply.\nThe following year, she again used Facebook to announce her marriage to Sohale Ahmed.\n‘Lauren has destroyed my home,’ is how Ahmed’s first wife responded to that news, telling how the adulterous couple had met via the charity circuit.\n‘Sohale [would be] staying out almost all night with her, coming back perhaps at 1 am and leaving again at 2.30 am. I asked him what kind of charity fundraising went on at these times,’ Faiza recalled.\nNow, of course, Booth’s connections to the Islamic charity circuit will again cause ructions.","url":"https://www.dailymail.co.uk/news/article-3393150/How-Cherie-s-sister-cheerleader-Islamic-zealots.html"}
