{"authors":["Ciara Farmer For Mailonline"],"date_download":"2018-10-23 04:00:50","date_modify":"2018-10-23 04:00:50","date_publish":"2016-01-28 19:43:44","description":"Showing off her more playful side, the Fight For This Love hitmaker posed up a storm for the camera as she rocked a chic cobalt blue, body-con dress - flaunting her trim frame to perfection","filename":"data/vaneerConsumption/CherylFernandezVersinipoutsherwaythroughnewLOrealParisbeautycampaign.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/19/30ACFD8900000578-0-image-a-55_1454008889590.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421579_Cheryl-Fernandez-Versini-bold-blue-pouts-winks-way-flirty-new-beauty-campaign_1540267250.html","title":"Cheryl Fernandez-Versini pouts her way through new L'Oreal Paris beauty campaign","title_page":"Cheryl Fernandez-Versini pouts her way through new L'Oreal Paris beauty campaign | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Cheryl Fernandez-Versini is fronting a stunning new campaign for make-up giant L'Oreal Paris.\nThe 32-year-old X Factor host smouldered in the new fun campaign for the brand's latest mascara, False Lash Sculpt in which she winks and pouts in an edgy video.\nShowing off her more playful side, the Fight For This Love hitmaker posed up a storm for the camera as she rocked a chic cobalt blue, body-con dress - flaunting her trim frame to perfection.\nScroll down for video\nBlue beauty: Cheryl Fernandez-Versini has fronted a stunning new campaign for make-up giant L'Oreal\nCheryl, showed off her super slender frame in a skin-tight cobalt blue mini dress.\nThe gown boasted a slash across the chest - offering a cheeky glimpse of flesh, while maintaining a demure air around the ensemble.\nAttention to detail made Cheryl's outfit stand out, through her stunning silver necklace comprising of a host of thin strands creating a form of neck cuff.\nSee Cheryl Fernandez-Versini updates as she appears in flirty new beauty campaign\nFlirty: The 32-year-old X Factor host smouldered in the new fun campaign for the brand's latest mascara, False Lash Sculpt in which she winks and pouts in an edgy video\nCheeky: Cheryl showed off her fun and flirty side as she pouted and preened in the new advert\nPerfecting her look: The Fight For This Love hitmaker was seen applying her glamorous eye make-up\nThe Newcastle-born beauty's locks were scraped into an elegant chignon - permitting a full look at her perfectly made-up face.\nCheryl's eyes were outlined in a smokey shadow, while her eyelashes were fluttering and flirty -proving the dramatic effect of the False Lash Sculpt £9.99 mascara, which is available nationwide.\nAs a flashing image of Cheryl holding the mascara to her face and then away flashed up on the screen, a hashtag icon also provided a dramatic flashing.\nCheeky: Cheryl's eyes were outlined in a smokey shadow, while her eyelashes were fluttering and flirty -proving the dramatic effect of the mascara\nElegant: The Newcastle-born beauty's locks were scraped into an elegant chignon - permitting a full look at her perfectly made-up face\nAs the beauty campaign comes to light, the stunning star, who is reportedly in the midst of divorcing her husband Jean Bernard, has just touched down in Barbados for her best pal Kimberley Walsh's wedding.\nWhile settling into her break, she shared a racy snap on her Instagram account on Thursday after having landed in the Caribbean the day before.\nLooking incredible and showing off her toned abs, the single singer showed off her red two-piece, captioning the image: 'I could get used to this island life.'\nBikini body: As the beauty campaign comes to light, the stunning star, who is reportedly in the midst of divorcing her husband Jean Bernard, has just touched down in Barbados for her best pal Kimberley Walsh's wedding\nIn the snap, Cheryl clutched her phone in her left hand - making her ring free wedding finger clearly visible to her 2million followers - a bold move after she was yet again spied without her engagement ring from husband Jean Bernard, who she is rumoured to be divorcing.\nWhile her own marriage may be over, Cheryl did not let her romance woes quash her excitement for the forthcoming wedding.\nThe Fight For This Love hitmaker also took to Instagram on Wednesday to share a cute snap as she touched down in Barbados to attend her pal's nuptials, where she will act as a bridesmaid.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421579/Cheryl-Fernandez-Versini-bold-blue-pouts-winks-way-flirty-new-beauty-campaign.html"}
