{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 21:03:21","date_modify":"2018-10-30 21:03:21","date_publish":"2016-01-26 20:17:03","description":"A man who stopped by a Tennessee Chick-fil-A witnessed a homeless man who entered the restaurant. The manager prayed with him, then offered him a free meal.","filename":"data/vaneerConsumption/ChickFilAManagerPrayswithHomelessManGivesHimHotMeal.json","image_url":"https://media.breitbart.com/media/2016/01/Chick-fil-A-manager-prays-with-homeless-man-Facebook.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_26__1540933401.html","title":"Chick-Fil-A Manager Prays with Homeless Man, Gives Him Hot Meal","title_page":"Chick-Fil-A Manager Prays with Homeless Man, Gives Him Hot Meal","title_rss":"NULL","source_domain":"breitbart.com","text":"A Tennessee man who stopped by a local Chick-fil-A witnessed a stirring sight as a homeless man entered the restaurant on Monday. Instead of being shooed out as a menace to the store’s customers, the manager took time to pray with the man, then offered him a free hot meal.\nAfter he and his daughter witnessed the scene during a visit to a Murfreesboro Chick-fil-A, Joey Mustain took to his Facebook page to relay what he saw when the homeless man entered the store. Now, the post is going viral.\nIn his post, Mustain reported that as he and his young daughter sat down in a booth to eat, a homeless man came into the store. He was wearing a large backpack and sported a shaggy beard and unkempt hair. The man, Mustain said, asked the employees at the counter if they had any “extra food” he could have.\nIt was then the store’s manager emerged from behind the counter and took the homeless man aside. Mustain assumed the man would be thrown out, but he witnessed a far different scene than he expected.\n“All I could pick up on of the conversation,” Mustain wrote, “was the manager saying that he’d love to give him a full, warm meal–not just scraps or extras–, and the only thing he required was that the man let him pray with him.”\nThe Facebooking customer then noted approvingly that when the homeless man agreed to pray with the manager, the manager immediately took the time and prayed on the spot. Mustain said, “There was no waiting for things to die down, there was no scooting anyone to the side.”\n“As busy as they were,” Mustain wrote, “the manager stopped then and there, laid his hand on the man, and proceeded to pray. I heard love in that prayer. The homeless man wasn’t some untouchable stain on business. He was the reason that store opened its doors this morning (or any morning).”\nThe customer asked his daughter to watch, and when she realized it was a prayer, she bowed her head, as well.\nMustain was amazed by the scene.\n“I realized then and there that Chick-fil-A doesn’t simply do business for profits, they truly use business to minister,” the man added on his post. “In a time when companies are trying to win in the market by neutralizing any possibility of offense, CFA is thriving because they unwaveringly cling to their principles and purpose.”\n“I love teaching my daughter life lessons, and I also love being there to watch other Christians teach her life lessons. Thank you, Chick-fil-A, for taking care of the latter today,” Mustain concluded.\nSubsequent to Mustain’s enthusiastic post and the photo he snapped of the manager and the homeless man, more than two hundred delighted replies were posted by other users. Additionally, the post has now been shared nearly 43,000 times.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com.","url":"https://www.breitbart.com/politics/2016/01/26/tenn-chick-fil-a-manager-prays-with-homeless-man-then-gives-him-a-hot-meal/"}
