{"authors":[],"date_download":"2018-10-30 14:21:35","date_modify":"2018-10-30 14:21:35","date_publish":"2016-04-01 00:00:00","description":null,"filename":"data/vaneerConsumption/Chicagoteachersinonedayprotestwalkout.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_04_4_1_2016_8_50_comments_1540909295.html","title":"Chicago teachers in one-day protest walk out","title_page":"Blog: Chicago teachers in one-day protest walk out","title_rss":"NULL","source_domain":"americanthinker.com","text":"The madness gripping the state of Illinois and the city of Chicago got even crazier on April 1, when Chicago public school teachers walked off the job for one day to protest the stalled negotiations for a new contract and the continuing impasse in Springfield that has prevented the state from operating with a budget since July 1 of last year. Chicago Tribune: The district has already said that CTU members who don't show up for work won't be paid, and that schools will be open for teachers who do want to cross picket lines. \"We welcome teachers who want to work,\" district Chief Education Officer Janice Jackson said Thursday. \"I also understand this is a hard decision for many of our teachers, and I have a message to those teachers as well: If teachers are not able to come to work, we will not seek mass discipline against the rank-and-file teachers,\" Jackson said. In addition to early morning pickets at schools, CTU and allied groups are... (Read Full Post)","url":"https://www.americanthinker.com/blog/2016/04/4_1_2016_8_50_comments.html"}
th Park District buildings and city libraries — will be open to students shut out of the classroom. Roughly 750 of the district's bureaucrats will be sent to district-operated contingency sites, Jackson said.\nThe district encouraged parents interested in using one of the sites to register online in advance, though CPS said that is not required and that no students will be turned away. More information for parents is available at www.cps.edu/april1.\n\"We believe that most parents probably will exercise other options,\" Claypool said. \"All we can do is have these options available and to make them as convenient as possible and make sure the plan is as robust as possible.\"","url":"https://www.americanthinker.com/blog/2016/04/4_1_2016_8_50.html"}
