{"authors":["Matt Hunter For Mailonline"],"date_download":"2018-10-23 00:45:11","date_modify":"2018-10-23 00:45:11","date_publish":"2016-01-29 14:04:45","description":"Kim Pindak, 63, and Sam Phillips, 57, have been given a total of $3,000 after deputy sheriffs in downtown Chicago ordered them to stop begging which violated their rights.","filename":"data/vaneerConsumption/Chicagobeggarsland3000aftercourtbattlewithpoliceoverfreespeech.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/309315F300000578-0-image-a-20_1454073106330.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422622_Panhandlers-day-court-lands-3-000-jury-says-Chicago-sheriffs-violated-rights-told-stop-begging_1540255511.html","title":"Chicago beggars land $3,000 after court battle with police over free speech","title_page":"Chicago beggars land $3,000 after court battle with police over free speech | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The pair argued it went against the county's\nA jury in America has awarded two beggars what is likely to be their biggest ever handout after they said local sheriffs had violated their rights.\nKim Pindak, 63, and Sam Phillips, 57, have been given a total of $3,000 after deputy sheriffs in downtown Chicago ordered them to stop begging, which violated their rights as laid down in the country's constitution.\nJurors returned after just four hours of deliberations with a finding that the failure of the Cook County Sheriff's Office to train officers on beggars' rights led its deputies taking the action they did.\nThe claimants said the deputies' actions went against their free-speech rights under the First Amendment.\nCase is over: Kim Pindak stands outside Chicago's federal courthouse - he and fellow beggar Sam Phillips claimed their rights of free speech had been violated\nTheir lawyers said securing a finding that departments must ensure staff understand beggars' rights - not money - was why they chose to litigate the case for almost six years. The $3,000 award was also more than they expected to win.\nAttorney Adele Nicholas said outside court: 'It's wonderful that two people who panhandle to make ends meet can come to court and hold accountable the sheriff of one of the largest counties in the nation,'\nA lawyer representing the sheriff's department, Anthony Zecchin, referred during closing arguments to Pindak's talent at chess, alleging several times that his lawsuit was primarily a money-making scheme.\nThe attorney told jurors: 'You're just pawns being manipulated by Mr. Pindak.'\nSpeaking outside court after the decision, Pindak said he plans to spend most of the $1,500 on necessities, including clothes and shoes.\n'And I might get a chess book or two,' he added.\nThe next step, Nicholas said, would be asking the presiding judge in Chicago, U.S. District Judge Rebecca Pallmeyer, to issue an injunction ordering Sheriff Tom Dart to train staff properly.\nWhile the jurors' decision went against the sheriff's department as a whole, they did find in favor of Sheriff's Deputy Laverne Nance, concluding he didn't violate the men's rights as an individual officer.\nA brief statement released by the sheriff's department said that 'it strives to treat everyone it encounters with dignity and respect, which it did in this case.'\nPhillips, who said he started begging 10 years ago after losing his job as a butcher, said he can make as much as $8,000 annually begging five hours a day, five days a week.\nA file photo of a beggar in Chicago - the Pindak and Phillips case heard that homesless people can lose up to $10 a day because the authorities bar them from a popular public square\nHe said he typically holds up a sign that reads, 'I'm just hungry.'\nPindak said he studied pre-medicine in college for several years in his 20s before mental illness sent his life into a tailspin.\nOn the witness stand, he told jurors he had occasionally handed a $20 bill but often makes just several dollars a day.\nDuring cross-examination, Zecchin also repeatedly asked Pindak about chess, suggesting his ability to think several moves ahead led him to sue.\nPindak denied that, answering he'd always been good at chess but not at life.","url":"https://www.dailymail.co.uk/news/article-3422622/Panhandlers-day-court-lands-3-000-jury-says-Chicago-sheriffs-violated-rights-told-stop-begging.html"}
