{"authors":[],"date_download":"2018-10-30 21:13:23","date_modify":"2018-10-30 21:13:23","date_publish":"2016-12-28 22:37:00","description":"Alabama’s sensational freshman quarterback Jalen Hurts was among several Crimson Tide players...","filename":"data/vaneerConsumption/ChickfilAPeachBowlQAwithJalenHurts.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/28/Images/newsEngin.17275575_Jalen-Hurts.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_college_chick-fil-peach-bowl-with-jalen-hurts__1540934003.html","title":"Chick-fil-A Peach Bowl: Q&A with Jalen Hurts","title_page":"Chick-fil-A Peach Bowl: Q&A with Jalen Hurts","title_rss":"NULL","source_domain":"ajc.com","text":"Alabama’s sensational freshman quarterback Jalen Hurts was among several Crimson Tide players to meet with the media Wednesday in advance of Saturday’s Chick-fil-A Peach Bowl. The Tide will face Washington at 3 p.m. in the Georgia Dome, with the winner advancing to the College Football Playoff national championship game.\nWhile Hurts fielded several questions, another question was posed to his veteran teammates about what Hurts has taught them about leadership. Offensive tackle Cam Robinson took it upon himself to answer the question, and here’s how he answered:\nQ: For the older guys, typically it’s your job to be leaders for the freshmen and teach them things. What are things Jalen has taught you this year?\nRobinson: I’m going to take that question first. I know sometimes in the past, sometimes if things weren’t going as well as it needs to go, I was the type that would get frustrated. I wanted to click like immediately and I wanted it to happen now. Jalen, he does a great job, when he comes to the sideline, if things aren’t going as well as they need to be going, he does a great job just making sure we stay calm and just stay the course. Just keep chopping wood, just keep doing what we’re doing and we’ll get on track eventually. We’ll get some things going on offense.\nHere’s a selection of the questions put to Hurts:\nQ: Jalen, having played in some pretty tough environments this season, some road environments, Ole Miss, Tennessee, LSU, obviously, how does that help you? And then with the SEC Championship here in Atlanta, how does that help you in terms of your experience, staying grounded, not getting awed by the big stage as the stakes get higher and higher over the next one, maybe two games?\nA: When I touch the field, I have to get comfortable and get a feel for the game. But as far as environments I’ve played in, I think the loudest was Arkansas because that first play was just rah, rah, wow.\nIt was the first time I’ve ever experienced that. But I think after the Ole Miss game, which was pretty loud, I settled down and I’m like, well, I don’t think it can get any worse than this. And I felt it less how I uphold it throughout the season.\nQ: Jalen, back in the spring game, you were the only one to throw a touchdown during that game. Was it at that moment that you maybe thought you’d be able to win the job early on in the year?\nA: No, I don’t think one touchdown could give a person a job. It comes from practice. What do you do on this rep? Are you getting better? Are you getting worse? And I guess I was improving. I gained the respect of my teammates, won the team over. So here I am.\nQ: Jalen … This Washington defense leads the country in turnovers. In your mind, looking at them on tape, what enabled them to create turnovers like that?\nA: They’re ball hawks. They play fast. They’re smart and they do what they do well. So we just have to come out and execute our game plan, play our game, and see what happens.\nQ: Jalen, coach Kiffin was just in here and said — I guess he went down to Channelview (Texas) and worked you out in the spring before you came to Bama. He said he went back to (Tuscaloosa) and said that kid’s a first-round draft pick. What do you remember about that workout that day?\nA: Well, me and Ashton Turner, one of my running backs at the time, we went out there and got pulled from, like, fifth period or so on to the field. My dad said Kiffin’s here. I said, ‘OK.’ I’m like, ‘Oh, wow.’ So I went over there and threw for him and I impressed him. And for him to say that, that meant a lot to me. But like I said, hype is nothing to me. Just it’s about what you do on the field.\nQ: Jalen, you mentioned a while ago that you won the team. And coach Saban, you know, talks about that, you know, winning the team. The quarterback winning the team, how important that is. What particular moment in the season or what game do you think you actually did win the team?\nA: Well, I think that was done before the season with the workouts and I guess they just saw a dog mentality in me. One of my teammates said, I mean — and I said it over there, you know, a guy can have it. ArDarius Stewart, he has it. You don’t know what it is, but he has it. He’s a ballplayer. And I just think that’s how they felt about me.\nQ: Washington’s only loss this season was to USC, and they kind of ran a similar way of offense you guys do. Did you learn anything, see anything about the way USC was able to exploit the tough defense? And what can you use from that game and apply it to this one?\nA: Well, USC resembles us. We resemble each other in many ways. So I think we’ll try and attack them similar, like they did. But we just have to go out and play.\nQ: Jalen, just overall, first impressions of Steve Sarkisian being your offensive coordinator and how similar he is to Lane Kiffin.\nA: He’s a talented guy. He has a great track record, and I think he’ll do a great job here. I have a lot of respect for him because I know what he’s done, the quarterbacks he’s had. So I think he’ll be fine.","url":"https://www.ajc.com/sports/college/chick-fil-peach-bowl-with-jalen-hurts/c5admq2CCecuA7Vyv8cp0M/"}
