{"authors":[],"date_download":"2018-10-22 20:52:45","date_modify":"2018-10-22 20:52:45","date_publish":"2014-06-03 15:12:59","description":"Suit contends that the drugs have ramped up addiction that has become a scourge in Chicago and other major cities.","filename":"data/vaneerConsumption/ChicagoSlapsPainkillerMakerswithLawsuitOverRisks.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/484431/140603-chicago_1151_a93fc45d0fc2d5b6eb97582aef28a711.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_business-news_chicago-slaps-painkiller-makers-lawsuit-over-risks-n121306_1540241565.html","title":"Chicago Slaps Painkiller Makers with Lawsuit Over Risks","title_page":"Chicago Slaps Painkiller Makers with Lawsuit Over Risks","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nChicago filed a lawsuit against five major producers of pharmaceutical products on Tuesday, accusing the group of concealing the risks associated with certain painkillers.\nSaying that a drug maker \"should never place its desire for profits above the health and well-being of its customers,\" the city said that the companies knew for years that certain pain-alleviating drugs were addictive and could prove debilitating in the long-term.\nThe five companies named in the suit include Actavis, Endo Health Solutions, Janssen Pharmaceuticals —a unit of Johnson & Johnson, Purdue Pharma and Cephalon, a division of generic drug giant Teva.\nThe suit contends that the drugs have ramped up addiction that has become a scourge in Chicago and other major cities.\nThe lengthy suit, filed in a Cook County circuit court, alleges that the cohort of companies misused their dominance to broaden the market for \"opium-like painkillers\" called opoids. These prescription drugs included top-shelf brand names such as OxyContin and Percocet, as well as a clutch of generics.\nThe drug makers \"spent millions of dollars funding, assisting and encouraging doctors and front groups\" to promote the drugs and broaden their reach among users afflicted with chronic pain, Chicago says. The effort to flood the market was \"wildly successful. The United States is now awash in opiods,\" the suit said, citing data showing that more than 250 million prescriptions for the narcotic were filled in 2010.\nThe suit contends that the drugs have ramped up addiction that has become a scourge in Chicago and other major cities.\nRobyn Frenze, a spokesperson for Janssen, said in a statement e-mailed to CNBC that the company \"is committed to ethical business practices and responsible promotion, prescribing and use of all our medications. We're currently reviewing the complaint.\"\nA spokesman for Actavis said the company does not comment on pending litigation. Representatives for Endo, Purdue and Cephalon were not immediately available to respond to requests from CNBC.","url":"https://www.nbcnews.com/business/business-news/chicago-slaps-painkiller-makers-lawsuit-over-risks-n121306"}
