{"authors":["Dailymail.Com Reporter","Associated Press"],"date_download":"2018-10-23 00:05:57","date_modify":"2018-10-23 00:05:57","date_publish":"2017-03-10 05:46:26","description":"Criminals in the crime-ridden south side of Chicago are targeting freight containers to loot for weapons. The guns are are destined for gun shops but end up in the hands of dangerous gangbangers.","filename":"data/vaneerConsumption/Chicagogangsaretargetingcarsfilledwithguns.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/05/3DE7A76D00000578-0-image-a-15_1489124331405.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300070_Gangs-Chicago-targeting-cars-filled-guns_1540253157.html","title":"Chicago gangs are targeting cars filled with guns","title_page":"Chicago gangs are targeting cars filled with guns | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Brazen criminals in the crime-ridden south side of Chicago are targeting freight containers to loot for weapons, it has been reported.\nThe guns are are destined for gun companies and shops — but end up in the hands of gangbangers in one of the city's most dangerous neighborhoods.\nIn one robbery, at least 100 new Ruger handguns were lifted from a freight train car.\n'Any time you have individuals who can go in and steal guns from a train, that makes the environment very toxic,' said Pastor Cory Brooks, whose church is near a freight yard, to Fox News.\nSince 2013, some 150 firearms have been stolen from freight trains in Chicago — some of which were linked back to violent crimes.\nSCROLL DOWN FOR VIDEO\nBrazen criminals in the crime-ridden south side of Chicago are targeting freight containers (pictured) to loot for weapons\nThe weapons loaded in containers (pictured) are are destined for gun companies and shops — but end up in the hands of gangbangers in Chicago's most dangerous neighborhoods\nAt least one of those weapons is linked back to 14 fatal shootings, according to the Bureau of Alcohol, Tobacco, Firearms and Explosives.\n'How in the world are these kids getting these guns? I see them on Facebook. Everybody got guns,' said Chicago Alderwoman Emma Mitts.\n'They can't go purchase a gun, so where are they getting them from?'\nMitts says the rail yard, Norfolk Southern, needs ti strengthen its security before the weapons get into the hands of violent criminals.\n'We need to be concerned about terrorists who could get into these areas unprotected here and steal things and explosives and really hurt our communities,' Pastor Brooks told Fox News.\nCompany officials say the yard is doing all it can.\n'Norfolk Southern's Chicago-based police department, the largest freight railroad law enforcement force in the city, is increasing patrols of rail yards using uniformed officers in marked cars and K-9 units,' Norfolk Southern spokeswoman Susan Terpay said in an email to Fox News.\n'In addition, the department is conducting undercover surveillance investigations.'\nSince 2013, some 150 firearms have been stolen from freight trains in Chicago — some of which were linked back to violent crimes\nChicago's leaders regularly blame lax gun laws in Illinois and nearby states that enable a flow of illegal weapons to the city's gangs and criminals. But community leaders and security experts say no one seems to be taking responsibility for train-yard gun thefts.\nOnly 16 of the stolen Rugers have been recovered since the 2015 break-in, according to hundreds of recent court records reviewed by The Associated Press.\nOne was used in a January 22, 2016, shooting. Police woke an attempted-murder suspect and found one by his bed.\nAnother was in a dealer's home alongside 429 bags of heroin. Police recovered another during a traffic stop; the driver said his friend had just been shot 10 times and he had to protect himself.\n'It's a war going on over here,' he told police.\nOn the night of the theft, gang members found and kept a shipment of women's sandals, according to filings in the federal case of seven suspects arrested later in 2015.\nFinding guns later was luck, not an inside job, prosecutors said. New pretrial filings describe one thief using expletives to convey the excitement as he ripped open boxes of guns: 'Oh man!' he says. 'These ... are pretty!'\nAt least one of the stolen weapons is linked back to 14 fatal shootings, according to the Bureau of Alcohol, Tobacco, Firearms and Explosives\nResidents near the yard are angry that the multibillion-dollar railroad isn't doing more to stop the thefts.\n'In a place where murders seem to be happening every single day, the last thing we need in Chicago is a rail yard with guns being stolen,' said Corey Brooks, pastor of the New Beginnings Church that hugs the yard.\nThomas Ahern, a Bureau of Alcohol, Tobacco, Firearms and Explosives agent in Chicago until his recent retirement, called the thefts 'a serious (security) breakdown that needs to be addressed.'\nThere's little incentive to spend millions fortifying yards because railways are well insured and don't take a big financial hit when cargo is lost, said Frank Scafidi, an ex-FBI agent and spokesman for the National Insurance Crime Bureau.\nHe said railways weigh costs such as new fencing against the odds thieves will 'win the lottery' and pick the one boxcar out of thousands with guns.\n'They are willing to take the risk,' Scafidi said.\nResidents near the yard are angry that the multibillion-dollar railroad (pictured) isn't doing more to stop the thefts.\nAndrew Shelton is charged in the theft of more than 100 guns from a train stopped in a Norfolk Southern rail yard on Chicago's South Side in April 2015\nOutside his church, Pastor Brooks tugs on razor wire that was once strung atop a fence separating a church basketball court from the yard. It has long since rusted and largely fallen away. Children climb the fence effortlessly to fetch balls that go over.\nAfter the theft of some 30 guns in September, several posts on Brooks' Facebook page asked: Would there be more urgency if the yard was in an affluent area?\nSouth Side Aldermen Pat Dowell introduced a City Council resolution after the 2015 theft demanding a public safety hearing on the rail-yard thefts. It never happened.\nNorfolk Southern spokeswoman Susan Terpay said in an email to the AP that it was 'mutually agreed' with aldermen to focus on investigations rather than disclosing 'specific (security) techniques' that could aid thieves.\nDowell's spokesman said she wouldn't answer questions on the yard:\n'We're focusing her time on other things now,' Kevin Lampe said.\nTerpay insisted Norfolk Southern is 'doing everything within (its) power to prevent thefts,' including more patrols and K-9 units. She didn't provide other details.\nNo arrests have been announced in the September 2016 theft or the one in 2014, when 13 military-style semi-automatic rifles were stolen.\nAlexander Peebles is charged in the theft of more than 100 guns from a train stopped in a Norfolk Southern rail yard on Chicago's South Side in April 2015\nElgin Lipscomb is charged in the theft of more than 100 guns from a train stopped in a Norfolk Southern rail yard on Chicago's South Side in April 2015\nSuch boxcar burglaries have happened elsewhere, including of 100 assault rifles from a train in Atlanta in 2012. But the frequency in Chicago stands out, and it has a lot to do with the city's role as the nation's freight-rail hub.\nOne shipping-industry adage goes: 'Cargo at rest is cargo at risk.'\nAnd in Chicago, because of track congestion, cargo is often at rest. Some 500 freight trains vie daily for limited track access, leaving some waiting for days — and making them easy targets.\nSome gangs treat rail yards as if they are shopping malls.\nSuspects in the 2015 theft stole from trains 'on a regular basis,' say filings. They describe the thieves circling the Norfolk Southern yard late on April 11, 2015, hunting for trains to hit.\nPastor Corey Brooks, of the New Beginnings Church, says: 'Any time you have individuals who can go in and steal guns from a train, that makes the environment very toxic'\nElgin 'Rat' Lipscomb allegedly told his cohorts, including Alexander 'A-Dog' Peebles, 'We going to make some money today.'\nThe train with guns stopped at 1:20am. The thieves belonged to two gangs and teamed up only after running into each other in the yard because they couldn't whisk enough guns away alone.\nA railway worker discovered the theft at 7am after spotting broken locks and bolt cutters. Within hours, the gangs were selling the stolen weapons, valued at around $50,000 in all.\nTwo informants helped catch the suspects, most of whom are awaiting trial, after their arrests for burglarizing another train.","url":"https://www.dailymail.co.uk/news/article-4300070/Gangs-Chicago-targeting-cars-filled-guns.html"}
