{"authors":[],"date_download":"2018-10-23 04:01:27","date_modify":"2018-10-23 04:01:27","date_publish":"2016-01-29 19:30:25","description":"A Chicago police officer plans to sue the family of a black teenager he shot and killed, claiming emotional distress, US media reported Friday. The teen's ne...","filename":"data/vaneerConsumption/Chicagocoptosuefamilyofblackteenhekilled.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i4tb-4PuZeKVXE7cd9005b2c876da07aa-835_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3423332_Chicago-cop-sue-family-black-teen-killed_1540267287.html","title":"Chicago cop to sue family of black teen he killed","title_page":"Chicago cop to sue family of black teen he killed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Chicago cop to sue family of black teen he killed\nA Chicago police officer plans to sue the family of a black teenager he shot and killed, claiming emotional distress, US media reported Friday.\nThe teen's neighbor -- a mother of five -- was caught in the crossfire after answering the door and was also killed by police in the December 26 incident.\nThe shooting came as the US city was reeling from a series of incidents in which police were accused of being too ready to pull the trigger on their service weapons.\nChicago demonstrators called for an end to gun violence and the resignation of Chicago Mayor Rahm Emanuel on December 31, 2015 after the deaths of 19-year-old college student Quintonio LeGrier and his 55-year-old neighbor Bettie Jones ©Scott Olson (Getty/AFP/File)\nCity officials apologized for the death of Bettie Davis, 55, but have said Quintonio LeGrier's shooting was justified.\nThe family of LeGrier, 19, has repeatedly said there was no reason why police should have opened fire when responding to a domestic disturbance at their home.\nPolice said LeGrier was brandishing a baseball bat and threatened the responding officer.\nHis family insists there was no need to respond to the mentally disturbed teen with deadly force when all they were doing was asking for help.\nOfficer Robert Rialmo plans to file a civil suit against LeGrier's estate, citing emotional distress and assault, his lawyer Joe Brodsky told WGN-TV.\nBrodsky did not immediately return a request for comment.\nPolice tactics and racism have been the subject of a national debate since protests erupted in Ferguson, Missouri, in mid-2014 over the shooting death of a black teenager, 18-year-old Michael Brown.","url":"https://www.dailymail.co.uk/wires/afp/article-3423332/Chicago-cop-sue-family-black-teen-killed.html"}
