{"authors":[],"date_download":"2018-10-22 22:34:44","date_modify":"2018-10-22 22:34:44","date_publish":"2014-05-11 19:17:24","description":"The weekend’s latest fatality took place around 1:40 p.m. Saturday when a 25-year-old man was killed in the 4100 block of West Adams Street.","filename":"data/vaneerConsumption/ChicagoMothersDayWeekendViolence4Dead22Wounded.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_chicago-mothers-day-weekend-violence-4-dead-22-wounded-n102586_1540247684.html","title":"Chicago Mother's Day Weekend Violence: 4 Dead, 22 Wounded","title_page":"Chicago Mother's Day Weekend Violence: 4 Dead, 22 Wounded","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBy NBC Chicago\nAt least four people have been killed, including a mother who was shot at a family gathering, and 22 others wounded in shootings over Mother’s Day weekend.\nThe weekend’s latest fatality took place around 3:40 p.m. Sunday when a teen was shot in the left side of his chest in the 200 block of West 116th Street. The man, whose exact age was not immediately known, was transported to Advocate Christ Medical Center in grave condition, but he was later pronounced dead according to the Cook County Medical Examiner's office. Details surrounding the shooting were not immediately available.\nAround 1:40 p.m. Saturday a 25-year-old man was killed in the 4100 block of West Adams Street.\nPolice said a dark-colored minivan pulled alongside the victim and two people exited the car and opened fire. The suspects then jumped back in their van and fled the scene.\nThe victim suffered multiple gunshot wounds and was pronounced dead at John H. Stroger Jr. Hospital of Cook County.\nThe incident is believed to have been gang related, authorities said.\nAnother fatality took place just before 3:30 a.m. Saturday in the Little Village neighborhood.\nPolice said a 34-year-old man was found with multiple gunshot wounds in the 4100 block of West 28th Street. He was pronounced dead at the scene and police are conducting a homicide investigation.\nOn Friday, a 37-year-old woman was shot in the chest while at a family gathering in a front yard in the Morgan Park neighborhood, police said.\nThe woman was sitting in a front yard just before 8 p.m. in the 11400 block of South Aberdeen Street after sending her niece off to prom, when gunshots rang out and the family began to run, according to authorities.\nSummer Moore, a single mother of three, was shot in the chest and later pronounced dead at Advocate Christ Medical Center in Oak Lawn.\nPolice are conducting a homicide investigation.\nSixteen people were wounded in shootings since Saturday afternoon.","url":"https://www.nbcnews.com/news/us-news/chicago-mothers-day-weekend-violence-4-dead-22-wounded-n102586"}
