{"authors":["Tom Wyke For Mailonline"],"date_download":"2018-10-23 01:52:01","date_modify":"2018-10-23 01:52:01","date_publish":"2016-01-11 13:16:48","description":"The FBI are launching an investigation into the fatal Chicago police shooting of a motorist after the victim's family challenged officers' accounts that he was armed and opened fire.","filename":"data/vaneerConsumption/Chicagopoliceinvestigatedafterofficersshotdeadunarmedblackpizzadeliveryman.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/13/2FD0784200000578-0-image-a-65_1452518147746.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393807_Chicago-police-investigated-FBI-officers-shot-dead-unarmed-black-pizza-delivery-man-hail-19-bullets_1540259521.html","title":"Chicago police investigated after officers shot dead ‘unarmed’ black pizza delivery man","title_page":"Chicago police investigated after officers shot dead ‘unarmed’ black pizza delivery man | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The FBI are launching an investigation into the fatal Chicago police shooting of a motorist after the victim's family challenged officers' accounts that he was armed and opened fire.\nA brief mention of the 2013 case was contained in thousands of pages of emails related to police shootings that the city released on New Year's Eve, the Chicago Tribune reported on Saturday.\nAccording to sworn depositions by the two officers pursuing him, Esau Castellanos was speeding at 80 mph and crashed on the city's northwest side. The officers say that when they approached, Castellanos opened fire.\nThe officers fired 19 shots at Castellanos, hitting him three times. His family disputes that, and no gun was ever found, leading the FBI to now open a civil rights investigation into the incident.\nThe FBI will conduct a civil rights investigation into the fatal 2013 Chicago police shooting of a motorist whose family is challenging officers' accounts that he was armed and opened fire.\nThe FBI is known to be investigating the Esau Castellanos shooting and several others\nThe Castellanos family's attorney, Daniel O'Connor, says Esau Castellanos, who worked as a pizza delivery driver, was unarmed and posed no threat.\n'The city told his daughter that her dad was shooting at the police and that's why he's dead,' O'Connor said.\n'They put it all over the news about how he was a bad guy and how these cops dove for cover and valiantly returned fire. It was a lie.\n'The guy just had a bad accident,' O'Connor said. 'He needed medical attention. He didn't need to be shot.'\nIn recorded depositions with the family's attorney, the officers said they pursued Castellanos' speeding car because they thought he might have been fleeing a crime.\nHe sideswiped a car and then crashed. Records show his blood alcohol level was more than twice the legal limit. The officers say he fired at them and they dove for cover before returning fire.\nChicago's police department has come under intense scrutiny, including a U.S. Department of Justice Investigation, since the release in November of squad car video showing a white officer shooting a black teenager 16 times.\nSeventeen-year-old Laquan McDonald was carrying a small knife, but the video showed him walking away from police and contradicted officers' accounts that he posed a serious threat.\nDemonstators link arms in solidarity as they protest the death of black teenager Laquan McDonald\nDemonstrators held a 'die in' last year to protest the fatal police shooting of Laquan McDonald as they attempt to disrupt holiday shoppers along Michigan Avenue\nSeventeen-year-old Laquan McDonald was carrying a small knife, but the video showed him walking away from police and contradicted officers' accounts that he posed a serious threat\nDemonstators hold their hands up in front of Chicago Police officers during protest of last year's shooting death of black teenager Laquan McDonald\nThe FBI is known to be investigating that shooting and several others.\nThe quasi-independent local agency that investigates all police shootings in Chicago says it also referred the Castellanos case to the FBI in the weeks after the March 2013 shooting.\nFBI spokesman Garrett Croon confirmed to the Tribune it has been investigating the shooting but would not comment further, and it remained unclear why the case remained open after so much time.\nThe officers were placed on administrative duty only when the newspaper inquired about their status Friday. Interim Police Superintendent John Escalante said he had not been aware of the FBI investigation.\n'Upon learning of this, I have ordered that both officers be immediately placed on administrative duties,' he said in an emailed statement.","url":"https://www.dailymail.co.uk/news/article-3393807/Chicago-police-investigated-FBI-officers-shot-dead-unarmed-black-pizza-delivery-man-hail-19-bullets.html"}
