{"authors":[],"date_download":"2018-10-30 01:17:45","date_modify":"2018-10-30 01:17:45","date_publish":"2016-11-18 17:39:00","description":"See the classic cars, marching bands and more on Atlanta's Peachtree Street during the Chick-fil-A Peach Bowl Parade.","filename":"data/vaneerConsumption/ChickfilABowlParade.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/30/Videos/5266396629001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/events_festivals_parade_chi_069f10fbe62ee07ee188113e208f501e__1540862265.html","title":"Chick-fil-A Bowl Parade","title_page":"Peach bowl fans: Chick-fil-A Bowl Parade","title_rss":"NULL","source_domain":"ajc.com","text":"Can you really call a holiday a holiday if it doesn't have its own parade?\nA divisive question for sure, but one we thankfully don't have to quibble over in Atlanta. Here, holidays always come with a parade. That's even the case with some of our football games, too.\nRELATED: Here’s your complete guide to downtown Atlanta attractions, dining and more\nTo make your parade planning a little easier this holiday season, here's a list of the city's top holiday parades.\nWashington Huskies marching band heads down John Portman Blvd. during the Chick-fil-A Peach Bowl parade Saturday, December 31, 2016, in Atlanta Ga. STEVE SCHAEFER / SPECIAL TO THE AJC (Steve Schaefer)\nChick-fil-A Peach Bowl Parade Presented by Lions Club International.\nDate: 8 a.m. Jan. 1\nGeneral route: Downtown, from Peachtree Street and Baker Street to the World Congress Center\nDubbed \"the official kickoff for game day,\" the Chick-fil-A Peach Bowl Parade brings revelry to downtown Atlanta. Starting at Peachtree Street, marching bands, beauty queens, floats and cheerleaders will make their way down Baker Street to the World Congress Center, ending at the FanFest, a family-friendly attraction for fans of both teams. And if the parade, FanFest and bowl game itself aren't enough football, the College Football Hall of Fame is only a short walk away.\nKirubel Erassa (pictured) won the men's 5K. Lauren Sara won the women's event. Geraint Davis of Suwanee, who was last year's second-place finisher, won the half marathon with a time of 1:10:54. About 12,000 racers bundled up Thursday morning to take part in the Thanksgiving Day Half Marathon events in downtown Atlanta. The half marathon, 5K, one mile and 50-meter dash started and finished at Turner Field. Jill Braley of Rome broke the tape for the women in 1:18:47. She was also the female champion in 2013. BOB ANDRES / BANDRES@AJC.COM (Bob Andres)\nPrevious holiday parades this season:\nThanksgiving Day Half Marathon & 5K.\nDate: 7:30 a.m. Nov. 24\nGeneral route: Begins at Turner Field and winds its way around town.\nWhat is a parade if not a bunch of people walking (and running, in this case) on closed city streets? We submit that the Atlanta Track Club's Thanksgiving Day Half Marathon & 5K – a tradition for thousands of runners and volunteers each November – definitely counts as a parade.\nNow that that's settled, here are the details: The route meanders around city landmarks from its starting point of Turner Field, passing by Centennial Olympic Park, Atlantic Station, Piedmont Park and Oakland Cemetery before heading back to the Ted. And there's something for the whole family, with 5K, 50 meter dash and one mile options. There are awards for every age range. The Atlanta Track Club is partnering with the Atlanta Mission to collect a ton of clothing, literally, for those in need. Participants are encouraged to bring clothes to donate or donate their warmup gear. Interested, but haven't signed up yet? Registration is open until Nov. 16.\nNewnan High School's Dalton Yarbrough (left) plays the snare drum as he marches down Peachtree Street during the 33rd annual Children's Christmas Parade in Atlanta on Saturday, December 7, 2013. Over 300,000 people were expected to attend the parade that wound its way down Peachtree Street in Midtown. Proceeds from the parade help to fund programs and equipment to serve the patients and families at Children’s Healthcare of Atlanta. JONATHAN PHILLIPS / SPECIAL (Jonathan Phillips)\nThe Children's Christmas Parade.\nDate: 10:30 a.m. Dec. 3\nGeneral route: Midtown, starting at Peachtree Street and 16th Street and ending at Peachtree Street and 5th Street.\nThe largest holiday parade in the Southeast, the Children's Christmas Parade has been an Atlanta tradition since 1981. Each December, the parade marches down Peachtree with giant balloons, elaborate floats, costumed characters, marching bands and, of course, Santa Claus himself. Although you're welcome to bring folding chairs to sit along the parade route, you also can buy bleacher seats from Children's Healthcare of Atlanta. And if you can't make it in person, don't worry: The parade is broadcast live on WSB-TV and replayed throughout the season.","url":"https://www.ajc.com/events/festivals/parade/chick-fil-peach-bowl-parade-2018-what-time-how-watch/tcVmRG29tJc7yY1YTcG22K/"}
