{"authors":["Associated Press"],"date_download":"2018-10-23 01:11:54","date_modify":"2018-10-23 01:11:54","date_publish":"2017-03-10 08:54:47","description":"HAMILTON, New Zealand (AP) - The Wellington-based Hurricanes failed the first test of their Super Rugby title defense Friday when beaten 26-18 by the...","filename":"data/vaneerConsumption/ChiefsbeatHurricanes2618inSuperRugby.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300422_Chiefs-beat-Hurricanes-26-18-Super-Rugby_1540257114.html","title":"Chiefs beat Hurricanes 26-18 in Super Rugby","title_page":"Chiefs beat Hurricanes 26-18 in Super Rugby | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"HAMILTON, New Zealand (AP) - The Wellington-based Hurricanes failed the first test of their Super Rugby title defense Friday when beaten 26-18 by the Hamilton-based Chiefs in a rain-drenched third round match.\nAfter beating the Sunwolves 83-17 and the Melbourne Rebels 71-6 in their first two matches, the Hurricanes seemed likely to mount a formidable defense of their first Super Rugby title.\nBut in their first match against a New Zealand opponent, they were substantially outplayed by the Chiefs who adapted better to conditions made marginal by an almost unprecedented rainstorm which brought flooding to New Zealand's upper North Island.\nThe match was decided in the first half when the Hurricanes were reduced to 13 men by yellow cards awarded for inconsequential offenses which allowed the Chiefs to score two tries and lead 17-6 at halftime.\nThe Hurricanes mounted a brief rally, scoring a try which cut the lead to 23-18 after 78 minutes but the Chiefs were able to ease away to a more comfortable victory with a penalty in injury time.\nThe Chiefs have now won their first three matches of the season against New Zealand opponents, beating the Dunedin-based Highlanders, Auckland-based Blues and the Hurricanes ahead of next weekend's match against the last-placed Melbourne Rebels.\nTheir ability to maintain discipline and control in horrendous conditions decided the match.\n\"Sometimes you get those conditions and it definitely changes the way you play footy,\" Chiefs captain Sam Cane said. \"You've got to tactically be pretty smart and your defense has got to be strong.\n\"I thought although with ball in hand we weren't as clinical as we could be, in pretty trying conditions we were good enough to get it done.\n\"We did take our chances and we chanced our arm a few times, especially in that first half when there were chances to take a shot at goal and we backed our set piece.\"\nThe Hurricanes played most of the first half under extreme pressure when they lost flanker Ardie Savea to a yellow card for collapsing a maul and lock Michael Fatialofa for a no-arms tackle.\nThe Chiefs scored through lock Brodie Retallick to take a 7-3 lead after 15 minutes when they exploited numbers at a scrum with Savea in the sin-bin. They then scored a vital try to winger Tony Pulu on halftime when Fatialofa was still in the sin bin, taking a 17-6 lead to the break.\nFullback Damien McKenzie maintained a perfect kicking record in appalling conditions, landing penalties which took the Chiefs to leads of 20-6 and 23-11 and made any Hurricanes comeback more difficult.\nWinger Julian Savea scored in the 78th minute but McKenzie re-established an emphatic margin with his final penalty.\n\"I think the Chiefs showed us, especially in the first half, the discipline side of things,\" Hurricanes captain Dane Coles said. \"I think they kicked into space well which put us on the back foot and our set piece didn't go too well in the first half which got them in the game.\"","url":"https://www.dailymail.co.uk/wires/ap/article-4300422/Chiefs-beat-Hurricanes-26-18-Super-Rugby.html"}
