{"authors":[],"date_download":"2018-10-22 21:33:15","date_modify":"2018-10-22 21:33:15","date_publish":"2014-06-05 15:50:48","description":"Chikungunya virus – a painful, mosquito-borne infection – is spreading rapidly in the Caribbean, the CDC reports.","filename":"data/vaneerConsumption/ChikungunyaCasesDoubleinCaribbean.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/448276/140516-asian-tiger-mosquito-1610_8332187292f500708e0096dcfe4e6e54.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_health-news_chikungunya-cases-double-caribbean-n123606_1540243995.html","title":"Chikungunya Cases Double in Caribbean","title_page":"Chikungunya Cases Double in Caribbean","title_rss":"NULL","source_domain":"nbcnews.com","text":"Chikungunya is not usually deadly, but it can cause a very bad headache, joint pain, rash and fever. Its name in the Makonde language, spoken in Tanzania and Mozambique in Africa, means “that which bends up,” because patients are often contorted with pain. They can spend weeks in bed, racked with pain.\nThe virus only arrived in the Western Hemisphere in December, on St. Martin, Dr. Marc Fischer and Dr. J. Erin Staples of the Centers for Disease Control and Prevention reported.\n“Since then, local transmission has been identified in 17 countries or territories in the Caribbean or South America (Anguilla, Antigua and Barbuda, British Virgin Islands, Dominica, Dominican Republic, French Guiana, Guadeloupe, Guyana, Haiti, Martinique, Puerto Rico, Saint Barthelemy, Saint Kitts and Nevis, Saint Lucia, Saint Martin, Saint Vincent and the Grenadines, and Saint Maarten),” they wrote in the CDC’s weekly report on illness and death.\n“As of May 30, 2014, a total of 103,018 suspected and 4,406 laboratory-confirmed chikungunya cases had been reported from these areas.”\nThe Aedes aegypti and Aedes albopictus mosquitoes that spread chikungunya are found across the southern United States and as far north as New York. A. albopictus is commonly known as the Asian tiger mosquito and itself only came to the United States in recent decades.\nThe virus grows in human blood and when a mosquito bites an infected person, it can spread it to others. So an infected person can carry the virus to new places and it spreads that way. Officials have been cautioning that the virus could become established in the U.S. , much as West Nile virus did starting in 1999.\nThere's no vaccine against chikungunya and the only treatment is rest and pain relief.","url":"https://www.nbcnews.com/health/health-news/chikungunya-cases-double-caribbean-n123606"}
