{"authors":["Press Association"],"date_download":"2018-10-23 00:49:52","date_modify":"2018-10-23 00:49:52","date_publish":"2016-01-28 14:56:25","description":"Children have been asked to describe their gender from a list of more than 20 different options in a survey criticised as \"profoundly confusing\". Youngsters ...","filename":"data/vaneerConsumption/Childrengiven25genderoptionsinprofoundlyconfusingsurvey.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-24ee41b4-3a40-40ba-b33e-b1176bd45e06-4vVdYopwYQ7f641721b07ae60dae-360_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420977_Children-given-25-gender-options-profoundly-confusing-survey_1540255792.html","title":"Children given 25 gender options in 'profoundly confusing' survey","title_page":"Children given 25 gender options in 'profoundly confusing' survey | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Children given 25 gender options in 'profoundly confusing' survey\nChildren have been asked to describe their gender from a list of more than 20 different options in a survey criticised as \"profoundly confusing\".\nYoungsters aged from 13 to 18 were asked to select from 25 choices, including \"gender fluid\", \"genderqueer\" and \"non-binary\".\nAs well as traditional options of \"girl\" and \"boy\", children were also invited to select from a list that included \"tri-gender\" and \"intersex\".\nThe national survey of children was linked from the website of the Children's Commissioner for England, Anne Longfield\nThe national survey was linked from the website of the Children's Commissioner for England, Anne Longfield, and was forwarded to some schools by local councils.\nBut the question asking children to define their gender was criticised by the Christian Institute as \"totally misleading\" and \"profoundly confusing\" for girls and boys.\nIts spokesman Simon Calvert said: \"We must not intrude on childhood by deliberately confusing schoolchildren about what makes a boy a boy or a girl a girl just to satisfy adult political agendas.\n\"We must protect children from being made to feel that passing phases of confused feeling about themselves, which many go through, must be turned into life-changing moral and political decisions.\"\nIt has emerged that the survey has now been withdrawn. A spokesman at Ms Longfield's office said there had been a \"clerical error\" and the survey was only a draft.\nThe survey will be redrafted with the question asking children to define their gender removed, the spokesman added.\nAmong the schools to issue the survey was Blatchington Mill in Hove, East Sussex, which has gained a strong reputation for its work on LGBT-related issues.\nIts headteacher Ashley Harrold said: \"Gender identity is a real and valid concern for some students at any school, and we're no exception.\n\"We feel our curriculum should address anything that prevents students feeling happy, feeling confident in themselves and feeling accepted by their peers.\"\nA Brighton and Hove City Council spokesman, which forwarded the national survey to all its secondary schools at the request of Ms Longfield's office, said it was aimed at exploring young people's experiences of gender.","url":"https://www.dailymail.co.uk/wires/pa/article-3420977/Children-given-25-gender-options-profoundly-confusing-survey.html"}
