{"authors":["Associated Press"],"date_download":"2018-10-23 02:32:41","date_modify":"2018-10-23 02:32:41","date_publish":"2016-01-29 17:06:03","description":"SANTIAGO, Chile (AP) — Chilean prosecutors have started a formal criminal investigation targeting President Michelle Bachelet's daughter-in-law over allegati...","filename":"data/vaneerConsumption/Chilelaunchesformalprobeofpresidentsdaughterinlaw.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:06485a8557c34152a17f64f251ef5b6d-3bmscybNe842cce83474b5805a28-752_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423159_Chile-launches-formal-probe-presidents-daughter-law_1540261961.html","title":"Chile launches formal probe of president's daughter-in-law","title_page":"Chile launches formal probe of president's daughter-in-law | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Chile launches formal probe of president's daughter-in-law\nSANTIAGO, Chile (AP) — Chilean prosecutors have started a formal criminal investigation targeting President Michelle Bachelet's daughter-in-law over allegations of tax evasion in a real estate venture.\nThe unfolding scandal has hurt the popularity of the president.\nBachelet daughter-in-law Natalia Compagnon and 12 other people were notified Friday that they are suspected of participating in the illegal dealings of Caval, a company that is half-owned by Compagnon. She is married to the president's eldest son, Sebastian Davalos.\nVenezuela's President Nicolas Maduro, back to camera, greets Brazil's President Dilma Rousseff, center, Chile's President Michelle Bachelet, left, and Dominican Republic¿s President Danilo Medina, right, during the official portrait of the heads of state of the IV Summit of the Community of Latin American and Caribbean States, CELAC, in Quito, Ecuador, Wednesday, Jan. 27, 2016. The Dominican Republic will take over the rotating presidency of the CELAC from Ecuador, on Wednesday. (AP Photo/Dolores Ochoa)","url":"https://www.dailymail.co.uk/wires/ap/article-3423159/Chile-launches-formal-probe-presidents-daughter-law.html"}
