{"authors":["Richard Spillett For Mailonline"],"date_download":"2018-10-23 02:06:35","date_modify":"2018-10-23 02:06:35","date_publish":"2017-03-16 12:21:59","description":"The freeview channel Tiny Pop, which features programmes including Postman Pat and Miffy's Adventures, was re-tuned yesterday and is now only available in cities.","filename":"data/vaneerConsumption/ChildrensmeltdownsafterTinyPopchannelisretuned.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E540F6300000578-0-image-a-97_1489667017566.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320000_Children-s-meltdowns-Tiny-Pop-channel-tuned_1540260395.html","title":"Children's meltdowns after Tiny Pop channel is re-tuned","title_page":"Children's meltdowns after Tiny Pop channel is re-tuned | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"There were tantrums and tears among youngsters in rural areas yesterday after a popular children's TV channel was re-tuned so it's only available in cities.\nThe freeview channel Tiny Pop, which features programmes including Postman Pat, Miffy's Adventures and PJ Masks, has become loved by children of primary school age since it launched in 2003.\nBut parents in some parts of the country have hit out after a re-tuning meant they can no longer receive it.\nChannel bosses were branded 'heartless' over the move, with some accusing them of 'penalising rural populations'.\nParents told of wailing children and angry tantrums after the children's channel Tiny Pop was re-tuned so it is only available around big cities\nYoungsters were desperate after missing shows including Miffy's Adventures and Postman Pat\nChantal Claridge, a grandmother who lives near Swindon, Wiltshire, told MailOnline: 'My little granddaughter of four is so upset that she can no longer watch her favourite shows, which include PJ Masks. We live in the countryside and are again being penalised for not living in a city.'\nMs Claridge called on TV chiefs to reinstate the channel for the whole of the UK.\nMother Louise Turner, from Sudbury, Suffolk, said: 'I had a very upset five-year-old this morning and I'm dreading telling her I couldn't fix it while she was at school today.\n'I've emailed Tiny Pop and had no response. I'm very annoyed they have done this.'\nOn Twitter, Nick Hoare‏ wrote: 'Three-year-old in tears his favourite tv channel gone now... Bedtime routine out the window now.'\nChris Hurcombe‏ posted: 'Retuned telly tonight as requested and now we have no Tiny Pop and one very upset daughter to try and explain it too... Thanks!!'\nMother Zoe L‏ wrote: 'Thanks for ruining today. No more Tiny Pop after retuning.'\nAnd Carol MacInnes‏ tweeted: 'Where has Tinypop gone. Got a very unhappy 5yr old here?'\nFurious parents took to Twitter to complain of the impact on youngsters who love the show\nThe channel's owners have not revealed how many homes have lost the channel following the re-tune.\nBut a statement on their website tells parents: 'As of March 15th Tiny Pop TV will move to Local Freeview which covers the major cities in the UK. If you are not in a city you might not be able to watch the channel.\n'If after returning you can no longer receive Tiny Pop then our other children's channel POP is available across most of the UK.'\nThey said the decision to move to Local Freeview was made 'due to availability on National Freeview'.\nA spokesman for Freeview said: 'The availability of a channel on the Freeview platform is down to the decision of the individual broadcaster, in this case CSC Media Group, a subsidiary of Sony Pictures Television.'\nCSC Media have been contacted for comment.\nHave you been affected by the re-tune? Ring MailOnline on 0203 615 2676 or email richard.spillett@mailonline.co.uk","url":"https://www.dailymail.co.uk/news/article-4320000/Children-s-meltdowns-Tiny-Pop-channel-tuned.html"}
