{"authors":[],"date_download":"2018-10-30 19:51:30","date_modify":"2018-10-30 19:51:30","date_publish":"2018-06-26 20:04:00","description":"Children's Healthcare of Atlanta has filed a certificate of need for its $1.5 billion hospital in Brookhaven.","filename":"data/vaneerConsumption/ChildrensHealthcarefilesproposalfornew13Bhospital.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/11/21/Images/Capture.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_children-healthc_1c716783a93ec622146398b62096bbb6__1540929090.html","title":"Children’s Healthcare files proposal for new $1.3B hospital","title_page":"Children's Healthcare files certificate of need for its $1.5B hospital","title_rss":"NULL","source_domain":"ajc.com","text":"Things are moving along for the new Children’s Healthcare of Atlanta at Egleston campus in Brookhaven.\nEgleston has filed a certificate of need for its $1.3 billion hospital. Certificates like these are required by the state for new or expanded healthcare services or facilities.\nMORE: Children’s Healthcare of Atlanta plans massive I-85 campus\nAccording to a Brian Brodrick, CHOA at Egleston representative, their certificate is a projection of what CHOA needs “to continue to meet the need of Georgia’s kids.”\nThe hospital will be part of the new Children’s campus on North Druid Hills Road near I-85, replacing the current Egleston facility.\nMORE: Children’s Healthcare to build center for kids with complex diseases\nWhen completed, the campus will include a 446-bed hospital, support staff buildings, the Center for Advanced Pediatrics, and more than 20 acres of green space. In total, the new facilities will cost $1.5 billion.\n“We are designing the North Druid Hills campus with an intense focus on creating the best care experience for our patients and their families,” said Brodrick.\nRepresentatives say that the Center for Advanced Pediatrics will be the first building on the campus and it will open next month.\nConstruction for the new hospital will begin in 2020 and is expected to open in 2025.\nLike DeKalb County News Now on Facebook | Follow on Twitter\nIn other news:","url":"https://www.ajc.com/news/local/children-healthcare-files-proposal-for-new-hospital/ZT4J2eeh4N3U4w6sSWDMbP/"}
