{"authors":[],"date_download":"2018-10-30 20:08:17","date_modify":"2018-10-30 20:08:17","date_publish":"2017-03-27 21:59:00","description":"Family of a woman and 3-year-old girl killed by a man fleeing DeKalb County police is suing the agency, claiming the pursuit was reckless.","filename":"data/vaneerConsumption/ChildwomandiedbecauseDeKalbcopswererecklessinchase.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/27/Images/Moxley_1329x832.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_family-child-wom_a357f827c56e07ae8234225bde52bbff__1540930097.html","title":"Child, woman died because DeKalb cops were 'reckless' in chase","title_page":"Family: Child, woman died because DeKalb cops were 'reckless' in chase","title_rss":"NULL","source_domain":"ajc.com","text":"The family of a woman and 3-year-old girl killed by a man fleeing DeKalb police is suing the county, claiming the pursuit was reckless.\nLithonia resident Alicia Moxley, 57, and granddaughter Jordan Haynes were in a 2003 Pontiac Grand Am on Snapfinger Woods Drive when the fleeing SUV hit them head-on.\nJeremiah Warthen, who lit out when police tried to pull him over, pleaded guilty in 2014 to multiple counts of vehicular homicide.\nThe lawsuit now claims the police were also to blame for the deaths and the injuries of four others in the Moxley family car.\nDeKalb police declined to comment on the allegations, as is typical with pending litigation. But a spokesman said the officers involved hadn’t been found by the department to be in violation of policy or state law.\nThe lawsuit, filed last week in DeKalb County State Court, says police followed Warthen because they thought he was driving too fast in a motel parking lot on March 20, 2013.\nWhile driving behind the 2001 Chevrolet Yukon, they ran the license plate and found that the owner was wanted on a charge of criminal damage to property.\nBut Warthen wasn’t the owner.\nAll the same, he fled when police tried to pull him over. Police said he struck a cruiser and almost hit an officer in the process, the suit says.\n\"I just panicked, man,” Warthen told Channel 2 Action News in 2013. “I wasn't trying to hurt no one. ... I'm sorry for their loss and I'll be praying.\"\nProsecutors said he got up to as fast as 70 mph in a 25-mph zone.\nBut the lawsuit, which seeks damages in an amount to be determined in court, says the deaths wouldn’t have happened if the pursuit was abandoned.\nIt claims the police violated department policy and state law, which requires police to use caution in such cases.\nThe police department’s policy on pursuits is extensive but says, ultimately, much of the decision of whether to chase must fall to the officers involved.\nThe officers should only chase if the person fleeing presents a danger to the public, just as long as the pursuit itself doesn’t endanger the public, the policy says.\nMaj. Stephen Fore of DeKalb police told The Atlanta Journal-Constitution the officers were never disciplined because they weren’t found in violation.\nWarthen is serving a 30-year sentence, with the first 20 intended to be in prison.\nThe chase is the latest in metro Atlanta to fall under scrutiny as some wonder about the dangers of pursuits. Last year, a College Park family sued over a chase that led to the deaths of two children. A north Georgia bystander also sued the Georgia State Patrol last year for injuries he sustained as a result of a chase.\nLike DeKalb County News Now on Facebook | Follow on Twitter and Instagram","url":"https://www.ajc.com/news/local/family-child-woman-died-because-dekalb-cops-were-reckless-chase/fuvQYr5qr3oUhgCk1WX21I/"}
