{"authors":["Virginia Hale"],"date_download":"2018-10-30 18:27:44","date_modify":"2018-10-30 18:27:44","date_publish":"2018-07-04 07:47:51","description":"The leader of a Telford child rape gang is back in prison after he was released having served less than five years of a 22-year sentence.","filename":"data/vaneerConsumption/ChildRapeGangBossBackBehindBarsAfterEarlyRelease.json","image_url":"https://media.breitbart.com/media/2018/07/mubarek-ali-0.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_07_04__1540924064.html","title":"Child Rape Gang Boss Back Behind Bars After Early Release","title_page":"Child Rape Gang Boss Back Behind Bars After Early Release","title_rss":"NULL","source_domain":"breitbart.com","text":"The leader of a Telford grooming gang which raped and trafficked children is back in prison just months after he was released having served less than five years of a 22-year sentence.\nMubarek Ali was sentenced in 2013 to 14 years’ immediate custody and eight years on licence for offences including controlling child prostitution, causing child prostitution, and trafficking in the UK for the purpose of prostitution, reported the Shropshire Star.\nHis release in November horrified victims, who said they were “living in fear” after hearing the news, and prompted outcry from Telford MP Lucy Allan and thousands of members of the public, who slammed the inadequacy of Ali’s jail stint as “a disgrace”.\nWhy was Mubarek Ali allowed out early when he was still a risk to our community? #Telford #CSE #Groominggang https://t.co/ycPLWAT0t6 — Lucy Allan MP (@lucyallan) July 1, 2018\nThe 35-year-old pimped out girls as young as 13 years old at a curry house in the Shropshire town reported to be Britain’s “child sex capital” before Telford emerged last year as the site of possibly the nation’s “worst ever” child sexual exploitation (CSE) scandal.\nAuthorities and the media have been accused of turning a blind eye while grooming gangs consisting mostly of Pakistani men drugged, raped, and even murdered victims who were overwhelmingly white and working class.\nAli was returned to jail last week for breaching his licence, according to the Sunday Mirror, which noted that his brother Ahdel will be up for parole in 2019 after the 31-year-old was sentenced to 18 years in prison custody for his part in grooming and pimping young girls out to workers at Dhaka Tandoori for £150 a session.\nOne of the girls abused by Mubarak said she and other victims are “relieved he is back inside”, but asking themselves “what if he’s out again soon?”\nThe Sunday Mirror reported one girl told a friend: “I’ve lived in fear of Mubarek Ali for the last seven months.\n“We think he’s coming to get us. He drilled that into us for years and said he’d kill our families and rape our sisters.\n“We think he’ll abuse more girls if he is freed. They should jail him forever,” she said.\nIf you are a victim of hate crime this is the service you can expect from our officers https://t.co/fV9EBm57TF #EndHateCrime pic.twitter.com/siUnrsN3KS — West Mercia Police (@WMerciaPolice) June 19, 2017\nIn May, local MP Allan said there is evidence authorities in Telford are “still failing” CSE victims, highlighting a bundle of documents sent to the Home Office which showed they are still neglecting to take allegations seriously.\nThe case bore striking similarities to grooming gang scandals in towns across England including Rochdale and Rotherham, with public services in Telford operating within a politically correct culture where vulnerability to accusations of “racism” caused authorities to ignore victims and silence whistleblowers.","url":"https://www.breitbart.com/europe/2018/07/04/ringleader-uk-worst-rape-scandal-behind-bars-sentence-short/"}
