{"authors":["Peter Devlin For Daily Mail Australia","Australian Associated Press"],"date_download":"2018-10-23 00:00:36","date_modify":"2018-10-23 00:00:36","date_publish":"2017-03-10 05:42:50","description":"Robin Angus Fletcher, 60, who used hypnotism and mind-altering techniques to prostitute two 15-year-old girls will be allowed back into the community after a Victorian court ruling.","filename":"data/vaneerConsumption/ChildsexwitchallowedbackintoMelbournecommunity.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/04/3E1FDE8700000578-0-image-a-17_1489119620766.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299964_Child-sex-witch-allowed-Melbourne-community_1540252836.html","title":"Child sex witch allowed back into Melbourne community","title_page":"Child sex witch allowed back into Melbourne community | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A legally-blind witch convicted of enslaving and raping two teenage girls will be free to roam the community after a Victorian court ruling.\nRobin Angus Fletcher used hypnotism and mind-altering techniques to prostitute two 15-year-old girls. He was jailed in 1998.\nFletcher was released in 2006 but lived under strict supervision orders.\nRobin Angus Fletcher used hypnotism and mind-altering techniques to prostitute two 15-year-old girls (pictured outside court in February)\nWhen the supervision orders were about to expire in 2016, Victorian authorities applied to renew them, but the 60-year-old successfully appealed against the application.\nThe Department of Justice went to the Court of Appeal after the Supreme Court freed Fletcher from supervision in February, but their appeal was dismissed on Friday.\nJustice Phillip Priest on February 8 ruled that despite Fletcher's 'repellent' offences, he did not pose, according to the law, an unacceptable risk to the community.\nThe Department of Justice went to the Court of Appeal after the Supreme Court freed Fletcher from supervision in February, but their appeal was dismissed on Friday (he is pictured outside court in February)\nThe Department of Justice appealed, arguing Justice Priest was 'plainly wrong' in concluding there was no unacceptable risk.\nOn Friday, the Court of Appeal dismissed the appeal.\nIt found it was 'well open to the judge, on the evidence before him, to reach his conclusion'.\nHe has previously been allowed to leave his secure accommodation to give speeches at a Church of Antioch in Melbourne, the Herald Sun reported.","url":"https://www.dailymail.co.uk/news/article-4299964/Child-sex-witch-allowed-Melbourne-community.html"}
