{"authors":["John J. Xenakis"],"date_download":"2018-10-30 20:35:56","date_modify":"2018-10-30 20:35:56","date_publish":"2015-10-16 13:13:06","description":"China and US poised for South China Sea military confrontation","filename":"data/vaneerConsumption/ChinaandUSPoisedforSouthChinaSeaConfrontation.json","image_url":"https://media.breitbart.com/media/2015/06/china-sailor-US-Navy-ship-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_10_16__1540931756.html","title":"China and US Poised for South China Sea Confrontation","title_page":"China and US Poised for South China Sea Confrontation","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nPresident Obama reverses himself on Afghanistan troop withdrawal\nThe ‘surge’ strategy in Iraq and Afghanistan\nChina and US poised for South China Sea military confrontation\nPresident Obama reverses himself on Afghanistan troop withdrawal\nAfghan soldiers, left, walk past a U.S. Army soldier in a military base in 2012 (AP)\nPresident Barack Obama has done an about-face on the issue of troop withdrawal from Afghanistan, and now says that he will leave a force of 5,500 soldiers in Afghanistan on a continuing basis, “to focus on training Afghans and counterterrorism operations.”\nAccording to several analysts, Obama was forced into this by the surprise victory of the Taliban in capturing the city of Kunduz in northern Afghanistan, near the border with Tajikistan. ( “29-Sep-15 World View — Afghan Taliban capture of Kunduz has major repercussions for Central Asia”)\nIn his speech, Obama said:\nAs you are well aware, I do not support the idea of endless war, and I have repeatedly argued against marching into open-ended military conflicts that do not serve our core security interests.\nThis is indeed Obama’s philosophy, but it completely disregards America’s values and America’s role in the world. It is like saying that New York City should not have a police force since crime is endless. The role of the police is to protect the city from crime when it occurs. If you withdraw the police from New York City, then crime will be even more rampant than it is now.\nI’ve written many times about the Truman Doctrine, from President Harry Truman in 1947, which made America policeman of the world. The justification is that it is better to have a small military action to stop an ongoing crime than to let it slide and end up having an enormous conflict like World War II. The Truman Doctrine was reaffirmed in President John Kennedy’s “ask not” speech, and every president since WW II has followed the Truman Doctrine, up to and including George Bush. Barack Obama is the first president to repudiate the Truman Doctrine, essentially leaving the world without a policeman.\nObama’s repudiation of the Truman Doctrine has been a disaster for the world, since the world no longer has a policeman. This is the concept that Obama completely fails to grasp, which is why the Obama administration has suffered one foreign policy disaster after another. Now, with Afghanistan in crisis, the administration is heading into a new disaster. White House and Washington Post\nThe ‘surge’ strategy in Iraq and Afghanistan\nIn 2007, Senator Barack Obama was extremely contemptuous of the Iraq war and President George Bush’s “surge” strategy for ending it. The irony is that after Bush’s surge strategy was successful, and Obama was elected president, Obama’s Afghan war strategy was modeled after Bush’s successful “surge” strategy in Iraq, something that Senator Obama bitterly opposed before it turned out to be successful.\nHowever, as I wrote in a Generational Dynamics analysis in 2009 in “American army general warns of imminent defeat in Afghanistan war,” the Iraq “surge” strategy would not work in Afghanistan.\nThe Iraq situation was as follows: Iraq’s previous generational crisis war was the 1980s Iran/Iraq war, in which all Sunni and Shia Iraqis united against the common enemy, Iran. In 2007, I wrote “Iraqi Sunnis are turning against al-Qaeda in Iraq (AQI)” (the best analysis of the Iraq war available anywhere at that time), where I explained that AQI consisted of mostly Jordanian and Saudi terrorists, but that Iraqis were only marginally involved and were happy to get rid of these foreign terrorists.\nBut Afghanistan was quite different. Its previous generational crisis war was the Afghan civil war from 1991 to 1996. There was no united country for the “surge” to appeal to. Even worse, the Taliban terrorists were from the same Pashtun ethnic group that was conducting terrorist acts in Pakistan. In Iraq, the Jordanian and Saudi terrorists were foreigners, but in Afghanistan, the Pashtun terrorists were not.\nThe result is that the “surge” strategy could never work in Afghanistan and, in fact, no strategy could work in Afghanistan as well as the surge strategy had worked in Iraq.\nChina and US poised for South China Sea military confrontation\nIt has been rumored for several months that the US Navy plans to send a vessel into the South China Sea close to the man-made island chain that China has been building, apparently to provide a platform for a large military base. Now reports indicate that approval of the plan may be imminent.\nChina has been annexing regions in the South China Sea that have historically belonged to other countries, and continues to use belligerent military operations to enforce its seizures. China has claimed the entire South China Sea, including regions historically belonging to Vietnam, Brunei, Malaysia, Indonesia, Taiwan and the Philippines. China’s claims are rejected by almost everyone outside of China, and China refuses to submit them to the United Nations court deciding such matters, apparently knowing that they would lose.\nTo support its military activities, China has used land reclamation projects to build a chain of man-made islands in international waters around the Spratly Islands. The US Navy plan is simply to send a ship within 12 miles of China’s man-made islands, in order to establish the principle that these are international waters.\nSecretary of Defense Ash Carter has not commented on the specific plan, but said generally: “United States will fly, sail, and operate wherever international law allows, as we do all around the world.”\nChinese state media claims that “The US must have known that China’s reclamation work does not contravene international law, so Washington has no sufficient reason to stop China.” However, the US Navy is not saying anything about trying to “stop China.” All the US Navy plans is to send a vessel near the islands through international waters.\nAccording to China state media:\nWashington’s ceaseless provocations and coercion can only demonstrate that it does not intend to protect freedom of navigation in this region, as China has clearly stated that the right will not be impeded. What the US wants is to play rough against China and stress its hegemony. In this case, China mustn’t tolerate rampant US violations of China’s adjacent waters and the skies over these expanding islands. The Chinese military should be ready to launch countermeasures according to Washington’s level of provocation. The US must have known that China’s reclamation work does not contravene international law, so Washington has no sufficient reason to stop China. Despite the legitimacy of China’s construction work and the public good it can provide, if the US adopts an aggressive approach, it will be a breach of China’s bottom line, and China will not sit idly by. China has remained calm with self-restraint even in the face of Washington’s escalating provocations, but if the US encroaches on China’s core interests, the Chinese military will stand up and use force to stop it.\nAnd so, unless either the US or China backs down, there will be a military confrontation. I do not think that China will back down, but it is quite possible that the Obama administration will back down. Military Times (7-Oct) and Navy Times and Global Times (Beijing)\nKEYS: Generational Dynamics, Afghanistan, Taliban, Kunduz, Tajikistan, Harry Truman, Truman Doctrine, John Kennedy, George Bush, Barack Obama, Iraq, Jordan, Saudi Arabia, Al-Qaeda in Iraq, China, South China Sea, Ash Carter\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2015/10/16/world-view-china-and-us-poised-for-south-china-sea-military-confrontation/"}
