{"authors":["Breitbart News"],"date_download":"2018-10-30 20:03:57","date_modify":"2018-10-30 20:03:57","date_publish":"2015-12-31 14:07:02","description":"China wants the U.S., Japan out of Okinawa","filename":"data/vaneerConsumption/ChinaWantsJapanUSOutofOkinawa.json","image_url":"https://media.breitbart.com/media/2015/12/GettyImages-154661138.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_12_31__1540929837.html","title":"China Wants Japan, US Out of Okinawa","title_page":"China Wants Japan, US Out of Okinawa","title_rss":"NULL","source_domain":"breitbart.com","text":"This story first appeared at The Daily Beast:\nOn the day after Christmas, three Chinese boats, one modified to carry four cannons, entered Japan’s territorial waters surrounding the Senkaku Islands in the southern portion of the East China Sea. The move, a dangerous escalation, is the first time the People’s Republic of China sent an armed vessel into an area that Tokyo claims as its own.\nThe sending of the three Chinese vessels on Dec. 26 appears to signal a new phase of incursions to grab not just the Senkaku Islands but the nearby—and far more important—Ryukyu Islands. Those include Okinawa, which hosts more than half of the 54,000 American military personnel in Japan, including those at Kadena Air Force Base, the Army’s Fort Buckner and Torii Station, eight Marine Corps camps, as well as Air Station Futenma and Yontan Airfield, and the Navy’s Fleet Activities Okinawa.\nGeopolitically, Okinawa is key to the American-Japanese alliance and the heart of America’s military presence in Japan. But if Beijing gets its way, U.S. military bases will be off Okinawa soon. And Japan will be out of Okinawa, too.\nChinese authorities in the spring of 2013 brazenly challenged Japan’s sovereignty of the islands with a concerted campaign that included an article in a magazine associated with the Ministry of Foreign Affairs; a widely publicized commentary in People’s Daily, the Communist Party’s flagship newspaper and therefore China’s most authoritative publication; two pieces in the Global Times, the tabloid controlled by People’s Daily; an interview of Maj. Gen. Luo Yuan in the state-run China News Service; and a seminar held at prestigious Renmin University in Beijing.\nAt the same time, the Ministry of Foreign Affairs refused to affirm that China recognized Okinawa and the Ryukyus as Japanese.\nThe close timing of events indicated these efforts had been directed from the top of the Chinese political system.\nRead the full story at The Daily Beast.","url":"https://www.breitbart.com/national-security/2015/12/31/china-wants-japan-us-out-of-okinawa/"}
