{"authors":[],"date_download":"2018-10-22 20:55:08","date_modify":"2018-10-22 20:55:08","date_publish":"2014-06-03 16:47:45","description":"Comments come a day after Washington announced new targets for its power sector, signaling a potential break in tough U.N. climate talks.","filename":"data/vaneerConsumption/ChinaConsideringCaponCO2EmissionsAfter2016Adviser.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/484586/140603-china-climate-mn-1240_97d39f404bc0c09dac6593d76e4d4bb7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_environment_china-considering-cap-co2-emissions-after-2016-adviser-n121406_1540241708.html","title":"China Considering Cap on CO2 Emissions After 2016: Adviser","title_page":"China Considering Cap on CO2 Emissions After 2016: Adviser","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nChina is considering an absolute cap on its CO2 emissions from 2016, a senior adviser to the government said on Tuesday, a day after Washington announced new targets for its power sector, signaling a potential breakthrough in tough U.N. climate talks.\nProgress in global climate negotiations has often been held back by a deep split between rich and poor nations, led by the United States and China, respectively, over who should step up their game to reduce emissions.\nBut the statement by adviser He Jiankun, coupled with the U.S. announcement, sparked optimism among observers hoping to see the decades-old deadlock broken. The steps come ahead of a global meet on climate change starting on Wednesday in Germany.\nAdviser He had suggested at a conference in Beijing that China would put the cap in place by 2016. But he later told Reuters that the idea was his personal view.\n\"What I said today was my personal view.The opinions expressed at the workshop were only meant for academic studies,\" he said. \"What I said does not represent the Chinese government or any organization.\"\nEarlier, He had told the conference: \"The government will use two ways to control CO2 emissions in the next five-year plan, by intensity and an absolute cap.\"\nChina is the world's biggest emitter. Carbon emissions in the coal-reliant economy are likely to continue to grow until 2030, but setting an absolute cap instead of pegging them to the level of economic growth would mean they would be more tightly regulated and not spiral out of control.\n\"The Chinese announcement marks potentially the most important turning point in the global scene on climate change for a decade,\" said Michael Grubb, a professor of international energy and climate policy at University College London.\nIt is not clear at what level the cap would be set, and a final number is unlikely to be released until China has worked out more details of the five-year plan, possibly sometime next year.\nThe United States, the world's second-biggest emitter, announced plans on Monday for the first time to rein in carbon emissions from its power sector, a move the Obama administration hopes can inject ambition into the slow-moving international climate negotiations.\n--- Reuters","url":"https://www.nbcnews.com/science/environment/china-considering-cap-co2-emissions-after-2016-adviser-n121406"}
