{"authors":[],"date_download":"2018-10-22 21:26:11","date_modify":"2018-10-22 21:26:11","date_publish":"2014-05-06 23:18:47","description":"Islamic militants in far west ratchet up terror campaign by detonating explosive vests shortly after Chinese president ends visit.","filename":"data/vaneerConsumption/ChinasTerrorProblemWorsensUighursStageFirstSuicideBombing.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/424191/140506-urumqi-attack-aftermath-1413_71ba1c5e7fe0a6d55038f2de234e8a39.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_investigations_china-s-terror-problem-worsens-uighurs-stage-first-suicide-bombing-n98696_1540243571.html","title":"China's Terror Problem Worsens: Uighurs Stage First Suicide Bombing","title_page":"China's Terror Problem Worsens: Uighurs Stage First Suicide Bombing","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA suicide bombing last week at a train station in the capital of China's Xinjiang province marked a significant escalation in the terrorist campaign by Islamic Uighur militants against the Chinese government, U.S. officials and China experts say.\nThe attack in Urumqi – the third assault on Chinese targets by militant Uighurs in six months – occurred just hours after Chinese President Xi Jinping had wrapped up a visit to the area and was carried out by two suicide bombers who detonated explosive vests inside the station. It is believed to be the first time that suicide bombers have carried out such an attack in China.\nAccounts in China’s official news media initially indicated that the attack on the Urumqi station, which killed three – including the bombers - and wounded 79 others, was the work of \"knife-wielding mobs.\" Later reports, however, indicated that it was a suicide bombing.\nRelated: Terror on the Tracks: A Timeline\nChina’s state-run Global Times on Monday identified one of the bombers as 39-year-old Sedirdin Sawut, a Uighur from the town of Aksu. It also quoted an unidentified source as saying officials believe that the attack was the work of a \"crime family deeply influenced by extremist ideology.\"\nThe site of the bomb blast at the South Railway Station in Urumqi on April 30. The attackt occurred as Chinese President Xi Jinping was wrapping up a visit to the area. CCTV via Reuters\nThe Los Angeles Times reported Monday that police in Urumqi had sought the arrest of 10 of Sawut’s family members and took the unusual step of releasing photographs showing the faces of the two dead bombers, accompanied by a $15,500 reward for information about the second man, who remains unidentified.\nMany Uighurs and international observers have accused Beijing of oppressing the Uighurs over a period of decades.\nA 2013 report on human rights practices in China by the U.S. State Department said that Chinese authorities had continued in the previous year to impose “severe official repression of the freedoms of speech, religion, association, and assembly of ethnic Uighurs.” It also stated that Uighurs continued to be” sentenced to long prison terms, and in some cases executed without due process, on charges of separatism and endangering state security.”\nA 2009 report by Amnesty International accused China of “systematically eroding” the identity of the Turkic speaking, mostly Sunni Muslim Uighurs through “an aggressive campaign that has led to the arrest and arbitrary detention of thousands of Uighurs on charges of ‘terrorism, separatism and religious extremism’ for peacefully exercising their human rights.”\nU.S. counterterrorism officials and other experts see the latest attack as a signal that the insurgency in Xinjiang, officially an autonomous province within China, is becoming more serious and sophisticated. And that could pose a growing problem for Beijing, they say.\n\"There is a level of organization and sophistication in (this group),\" said Michael Leiter, former director of the National Counter Terrorism Center and now an NBC News analyst. \"It is on the rise and posing an increasingly deadly and aggressive role in China. The Chinese may be authoritarian but the Uighurs have figured out that the Chinese aren't omniscient.\"\n\"If you're changing the style of attacks, it indicates some kind of help.\"\nElizabeth Van Wie Davis, a China expert at the University of Colorado, said the use of suicide vests in Urumqi also may indicate some coordination with other terrorist groups.\n\"If it turns out to be accurate that the attacker was wearing a suicide vest, it’s a different type of the attacks,\" she said.. \"… Most (previous attacks) involved vehicles or knives although there was a failed attempt to bring down an airplane from Urumqi to Beijing. … If you're changing the style of attacks, it indicates some kind of help.\"\nThere is a long history of militancy among the Uighurs, whose homeland in Xinjiang province is deep in Central Asia, bordering India, Pakistan, Afghanistan, the former Soviet states of Kyrgystan, Tajikstan and Kazakhstan, and Mongolia.\nBeijing has for years pressured Han Chinese to move to the province, where they now account for nearly half of the population – up from roughly 5 percent of the Xinjiang population in 1949. The official Chinese census in 2010 reported that the Uighurs accounted for about 45 percent of the province’s population vs. 40 percent for the Hans, though Uighurs suggest that the latter number is higher.\nTensions between the two groups in Xinjiang boiled over in July 2009, when ethnic riots between the two groups erupted in Urumqi, leaving more than 150 dead and approximately 1,000 injured.\nSince then terrorist attacks by the Uighurs against Chinese targets have grown more common.\nIn October of last year, Uighurs were blamed for a deadly explosion in Tiananmen Square in Beijing. In that instance, an SUV plowed through bystanders and burst into flames, killing the three people in the car and two bystanders near the Mao Zedong portrait that dominates the square. China's security chief called it \"organized and premeditated.\"\nIn a March 1 attack on the main train station in Kunming, eight men and women wielded machete-like knives that herders use, hacking and slashing bystanders and killing 29.\nPolice officers investigate the scene outside a train station in the southwestern city of Kunming after a deadly attack by a group of knife-wielding men on March 1. At least 29 were stabbed to death, 130 wounded and four suspects shot dead in the attack. An investigation later found that the more than 10 attackers were separatist Uighurs, according to the official Chinese news agency Xinhua. SUI SHUI / EPA\nOn Tuesday, a similar attack was reported at a rail station in the Guangzhou in south China, with six people wounded by knife-wielding assailants. Authorities did not immediately assign blame for that attack.\nThe fact that the previous two attacks were carried out thousands of miles away from Xinjiang shows an increase in the militants range of operations, said a senior U.S. official with access to intelligence on the attacks.\nWhile Chinese government officials claim that the militant Uighurs are linked to and funded by al Qaeda, both Van Wie Davis and Leiter say any links – if there are any -- are exaggerated.\nSome militants from the East Turkestan Islamic Movement (ETIM), did work closely with al Qaeda in the late 1990s and early 2000s, when leaders of the group were hiding out in Afghanistan and terrorist training camps were operating in both countries.\nBut Van Wie Davis notes that the ETIM has since faded in significance after successful Chinese operations against it. Now, the leading organization behind the unrest is the Turkestan Islamic Party, which is highly decentralized.\n\"My understanding is that they are small cells that don't have an enormous amount of communications, a protective device, no doubt,\" she said. \"(But) these most recent events -- the escalation-- would make you wonder if there isn't more coordination.\"\nLeiter agrees with that assessment.\n\"I'm highly dismissive of a meaningful connection to Al Qaeda via ETIM or anything else,\" he said in an email. \"Even five years ago these ties were seriously frayed and over the past five years with the decline of al Qaeda in Pakistan, the fleeing of many of the non-Arabs/Paks from the Afghan-Pakistan border area, and the refocusing on Syria, I just don't see this [coordination] as a particularly serious problem.\"\nA lot of financing for the militants still comes through Pakistan, several sources report, but there's no indication where it originates.\nFollow NBC News Investigations on Twitter and Facebook.\nVan Wei Davis suggests that the big fear in China is that the most militant Uighurs may move on to assassination plots.\n\"Chinese authorities have known that for about out 10 years,\" said Van Wie Davis of Uighur militants' interest in assassination. \"They came across a video showing militants with hoods and masks holding AK-47s ... and pictures of the Chinese leadership. … The fact they got into Tiananmen Square was the biggest indicator that these extremists were becoming more effective.\"","url":"https://www.nbcnews.com/news/investigations/china-s-terror-problem-worsens-uighurs-stage-first-suicide-bombing-n98696"}
