{"authors":["Edwin Mora"],"date_download":"2018-10-30 17:53:30","date_modify":"2018-10-30 17:53:30","date_publish":"2016-07-23 04:40:12","description":"The Islamic State has been able to attract jihadis from northwest China’s volatile and predominantly Muslim region of Xinjiang.","filename":"data/vaneerConsumption/ChineseIslamicStateJihadisMoreLikelytoHaveFamilies.json","image_url":"https://media.breitbart.com/media/2016/07/isis-1-e1474665417997.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_07_22__1540922010.html","title":"Chinese Islamic State Jihadis More Likely to Have Families","title_page":"Report: Chinese Islamic State Jihadis More Likely to Have Families","title_rss":"NULL","source_domain":"breitbart.com","text":"The Islamic State (ISIS/ISIL) has been able to attract foreign fighters from various corners across the world, including northwest China’s volatile and predominantly Muslim region of Xinjiang, home to the ethnic Uighur population.\nChina’s Uighur minority in autonomous Xinjiang, China’s largest province, is believed to be largely oppressed by the Beijing government.\nISIS recruits from China “don’t fit the pattern for Islamic State fighters” and Beijing may be the culprit of that, reports The Washington Post (WaPo), citing a report from the New America think tank released Wednesday.\nNew America found:\nFighters from Xinjiang, China are generally older and poorer and tend to travel to ISIS territory with their families… Contextual evidence in China suggests the country’s anti-terrorism campaign in Xinjiang could be a push factor driving people to leave the country and look elsewhere for a sense of ‘belonging.’\nThe New America analysis is gleaned from 3,500 ISIS personnel files that were leaked to news outlets earlier this year, of which 118 are from China, including 114 Uighurs, or Uyghurs, from Xinjiang province.\nReferring to the Chinese foreign fighters, New America reports:\nNot a single fighter in the sample reported to have previously fought in a jihad, suggesting that the sample is not comprised of seasoned veterans of foreign wars, such as with Uyghur separatists in the al-Qaeda-affiliated Turkistan Islamic Party (TIP)… [Compared to other ISIS fighters] Marriage rates and family sizes are high, education levels are low, international travel rates are extremely low, and the professional experience of the fighter sample is equivalent to an unskilled laborer.\nAl-Qaeda is the Islamic State’s rival.\nNew America points out that the personnel files are based on foreign fighter registration forms collected by ISIS on the Syria-Turkey border between mid-2013 and mid-2014.\n“These data, leaked in early 2016 by a defected ISIS fighter who stole the records before fleeing to Turkey, represent an unprecedented cache of personal information about foreign fighters, including names and phone numbers of family and friends and notes about fighters’ potential roles within ISIS,” it adds.\nWaPo notes:\nChinese state media has suggested that as many as 300 Chinese Muslims may have joined the group. Some experts have disputed this figure… The [New America] report offers a partial yet detailed view of how Chinese Islamic State fighters differ from their peers. And, more pointedly, it suggests that Beijing’s policies may be driving some of China’s Muslim minority Uighurs to extremism.\nNew America points that ISIS draws foreign fighters from the disaffected segments of society with grievances against their government:\nOver 95 percent of those who joined ISIS from China in 2013-2014 come from the country’s western Xinjiang province, where there are significant economic disparities between the ethnic-majority Han Chinese and the local Uyghur Muslim population, who are subjected to substantial state repression through restrictions on Islamic practices like growing beards or wearing head coverings.\nNew America reveals a substantial age difference among Chinese ISIS fighters, reporting that one fighter was as young as 10 while another was 80.","url":"https://www.breitbart.com/national-security/2016/07/22/report-chinese-islamic-state-jihadis-likely-families-never-engage-jihad/"}
