{"authors":["Olivia Muenter"],"date_download":"2018-10-31 01:35:49","date_modify":"2018-10-31 01:35:49","date_publish":"2014-08-12 19:30:02","description":"What's the point of releasing a film, book or TV series unless there's an accompanying beauty collection to be paired with it, am I right? I should hear a resounding 'amen' from all of you out there with your medicine cabinets overflowing with the…","filename":"data/vaneerConsumption/ChinaGlazeTheGiverNailPolishWillSplashSomeMuchNeededColorIntoYourMani.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/c2875ffb-d1a9-438d-a00a-ff4d6a6bc25d.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35479-china-glaze-the-giver-nail-polish-will-splash-some-much-needed-color-into-your-mani_1540949749.html","title":"China Glaze 'The Giver' Nail Polish Will Splash Some Much Needed Color Into Your Mani","title_page":"China Glaze 'The Giver' Nail Polish Will Splash Some Much Needed Color Into Your Mani","title_rss":"NULL","source_domain":"bustle.com","text":"What's the point of releasing a film, book or TV series unless there's an accompanying beauty collection to be paired with it, am I right? I should hear a resounding 'amen' from all of you out there with your medicine cabinets overflowing with the latest and greatest makeup that you buy on impulse whenever at a location where they are sold. I am one of you, of course, so there's no judgment here. Rather, there's a shared appreciation for the fact that in a world where much is uncertain and Tyra Banks is writing things for the Wall Street Journal , one thing is constant: new makeup. And thanks the new film-adaptation of Lois Lowry's The Giver , there's a new, beautiful nail polish collection from China Glaze. I should hear another amen right about now.\nThe polish collection is limited edition (obviously), and includes a variety of shades inspired by the famous book-turned-movie, which is otherwise known as \"that new movie Taylor Swift is in, I think.\" For all of you who have yearned for the day when you can paint your nails in a color entitled, \"Boundary of Memory,\" your time has come. The names are (I can only assume) references to The Giver's plot and characters, and although they aren't your typical polish color names, they're still pretty fun. Well, except for the one entitled \"New Birth,\" which just makes me slightly uncomfortable. But the color itself is pretty. And that's all that matters.\nAlthough the names won't give you any indication into the actual colors of the limited-edition nail polish line, the palette includes shades of gray, brown, and blue with pops of red, purple, and glitter. It's a great collection to round out your have-to-have fall nail polish list (everyone has that list, right?).\nThe collection is now available at Sally Beauty Supply stores and ULTA locations nationwide.\nImages: China Glaze","url":"https://www.bustle.com/articles/35479-china-glaze-the-giver-nail-polish-will-splash-some-much-needed-color-into-your-mani"}
