{"authors":[],"date_download":"2018-10-23 00:06:40","date_modify":"2018-10-23 00:06:40","date_publish":"2016-01-11 08:36:27","description":"China's stock market resumed its volatile plunges on Monday, as worries over the slowing economy and the government's ability to manage it sent traders fleei...","filename":"data/vaneerConsumption/Chinastocksresumeplungeoneconomicgloom.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z6j9-56CX32zFKLb7123928b84cc63cd8-301_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3393498_Shanghai-stocks-slump-5-afternoon-trade_1540253200.html","title":"China stocks resume plunge on economic gloom","title_page":"China stocks resume plunge on economic gloom | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"China stocks resume plunge on economic gloom\nChina's stock market resumed its volatile plunges on Monday, as worries over the slowing economy and the government's ability to manage it sent traders fleeing, dealers said.\nInvestors have been alarmed by slowing growth in the world's second-largest economy, which is expected to have expanded last year at its slowest pace in a quarter of a century. Official data on fourth-quarter and annual growth is due to be released next week.\nBut early indicators have stoked pessimism. The government said on Saturday that China's consumer price inflation came in at 1.6 percent in December, well short of the government's target of \"around three percent\".\nChina's stock market resumed its volatile plunges on January 11, 2016, as worries over the slowing economy and the government's ability to manage it sent traders fleeing ©- (AFP)\nOn Monday, the Shanghai Composite Index plunged 5.33 percent, or 169.71 points, to 3,016.70 on turnover of 286.4 billion yuan ($43.6 billion).\nThe Shenzhen Composite Index, which tracks stocks on China's second exchange, dropped even more, tumbling 6.60 percent, or 130.62 points, to 1,848.10 on turnover of 377.8 billion yuan. In Hong Kong, the benchmark Hang Seng Index slipped 2.8 percent, or 565.21 points, to close at 19,888.50.\n\"The market is already in a downward spiral and it's still exploring the bottom after last week’s plunge,\" Zhang Yanbing, an analyst at Zheshang Securities, told AFP.\n\"The economy remains weak and there’s no driver for a market rebound.\"\nThe Shanghai index fell nearly 10 percent last week, slammed by concerns over China's flagging economy and weakening currency but also a regulatory blunder.\nOn Friday, authorities reversed course and suspended a new \"circuit breaker\" mechanism that had fuelled investor panic and a global rout by automatically closing Chinese markets early twice in just four days.\nThe plunges have brought a rough start to the year for an index which soared 150 percent in the 12 months to mid-June and then plummeted more than 30 percent in three weeks, prompting an unprecedented government rescue package which helped the market end the year up 9.4 percent.\n- Pessimism dominates -\nTo the dismay of investors, China's central bank recently guided the yuan currency down by setting its daily fix lower for eight sessions, representing a 1.4 percent fall, before a slight reversal on Friday.\nOn Monday, the People's Bank of China set the daily reference rate -- around which the yuan can move up or down two percent -- at a stronger 6.5626 to $1.0, up .02 percent against the US dollar.\n\"Pessimism is the dominant sentiment,\" William Wong, head of sales trading at Shenwan Hongyuan Group in Hong Kong, told Bloomberg News.\n\"Market conditions will remain challenging given weak growth, volatility in external markets and the yuan’s depreciation pressure.\"\nYuan weakness, believed by some analysts to be a creeping devaluation, sparked worries China could set off a currency war in a bid to boost exports.\nIn August last year, China moved the yuan down nearly five percent over a week, saying the drop was a result of reforms aimed at making the unit more flexible.\nBeijing is seeking to transition the country's growth model away from reliance on exports and fixed-asset investment towards a consumer-driven economy, but the reform is proving bumpy.\nChina logged its worst economic performance since the global financial crisis in the third quarter, with gross domestic product (GDP) rising just 6.9 percent -- its lowest level in six years.\nChina's GDP grew 7.3 percent in 2014, the slowest pace in almost a quarter of a century.\n\"China’s equity and currency markets remain very volatile even after the authorities have attempted to stem price movements,\" Moody's Investors Service said in a commentary on Monday.\n\"China’s authorities are finding it increasingly difficult to reconcile the tensions inherent in designing and implementing credible and effective reform measures while maintaining economic, financial, and social stability,\" it said.\nShanghai Composite Index ©- (AFP Graphic)","url":"https://www.dailymail.co.uk/wires/afp/article-3393498/Shanghai-stocks-slump-5-afternoon-trade.html"}
