{"authors":["Corey Charlton For Mailonline"],"date_download":"2018-10-23 02:55:30","date_modify":"2018-10-23 02:55:30","date_publish":"2016-01-11 15:27:41","description":"Held at the Peninsula Hotel in Shanghai, the annual event saw the daughters of the world's wealthy aristocracy wheeled out to announce their arrival on the upper-class social scene.","filename":"data/vaneerConsumption/Chineseelitedazzledbythedaughtersoftheworldsrichestfamilies.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300B9F7500000578-0-image-a-2_1452527226914.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394073_Chinese-elite-dazzled-daughters-world-s-richest-families-presented-high-society-fourth-annual-International-Debutante-Ball-Shanghai_1540263330.html","title":"Chinese elite dazzled by the daughters of the world's richest families","title_page":"Chinese elite dazzled by the daughters of the world's richest families | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The invitation-only event is used by wealthy families to announce their daughters' arrival amongst high society\nHeld at the Peninsula Hotel in Shanghai, the glittering event was China's fourth annual International Debutante Ball\nWearing diamond-studded tiaras and white gowns, the teenagers were from some of the world's wealthiest families\nDecked out in white gowns and tiaras, 14 girls from across the globe dazzled the Chinese elite at the country's International Debutante Ball at the weekend.\nHeld at the Peninsula Hotel in Shanghai, the annual event saw the daughters of the world's wealthy aristocracy wheeled out to announce their arrival on the upper-class social scene.\nIt marked the fourth year of the event's existence in China after it was slow to adopt a tradition that many once saw as inherently capitalist due to its popularity in London, New York and Paris - and of course its ostentatious displays of wealth.\nA group of teenage girls born into some of the world's wealthiest families prepare to make their appearance at the International Debutante Ball\nOne of the contestants of the ball appears on stage before the audience of Chinese elite in Shanghai on Saturday night\nAccording to tradition, the teenage girls who appear at the event are matched up with equally well-groomed teenage boys of equal nobility\nPictured left is a pair of young nobles dancing at the ball, while right, one of the debutantes cuts the cake using a sword\nThe original debutante ball began in 1780 at the Queen Charlotte's Ball after King George III used the event to raise funds for a new maternity hospital to be named after his queen.\nSince then the concept has been transplanted to cities across the globe, including New York and Paris, as an annual social gathering for the wealthy elite.\nChinese socialite Vivian Chow Wong, 66, is responsible for bringing the ball to China four years ago, according to CNN.\nAs the daughter of Opera actor Zhou Xinfang, she moved to Hong Kong in 1959 and enjoyed a privileged upbringing herself on the back of her father's success.\nIn 2012 she told the broadcaster she brought the ball to China because she believed the 'time is right'.\nShe claimed there was high demand for such events in China, which remains in theory a communist nation, 'where the girls are striving to have a certain quality of life other than brand names and materialistic things'.\nThis year's event was the fourth annual International Debutante Ball to be held in China after the inaugural event in 2012\nChinese socialite Vivian Chow Wong, 66, is responsible for bringing the ball to China four years ago\nA group of teenage girls invited to appear at the ball clutch bunches of flowers as they line up to await the judges' decision\nAlthough the event was held in Shanghai, it was an international event and saw invites extended to youngsters across the globe","url":"https://www.dailymail.co.uk/news/article-3394073/Chinese-elite-dazzled-daughters-world-s-richest-families-presented-high-society-fourth-annual-International-Debutante-Ball-Shanghai.html"}
