{"authors":["Frances Martel"],"date_download":"2018-10-30 20:38:28","date_modify":"2018-10-30 20:38:28","date_publish":"2016-02-26 15:55:07","description":"The Chinese navy is sending an advance missile frigate into the East China Sea, risking exacerbating tensions in waters it claims against Japan.","filename":"data/vaneerConsumption/ChinaFlexesItsMuscleinEastChinaSea.json","image_url":"https://media.breitbart.com/media/2016/02/Chinese-Peoples-Liberation-Army-Spratly-Islands-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_02_26__1540931908.html","title":"China Flexes Its Muscle in East China Sea","title_page":"China Flexes Its Muscle in East China Sea","title_rss":"NULL","source_domain":"breitbart.com","text":"The Chinese navy is sending an advance missile frigate into the East China Sea, risking exacerbating tensions in waters it claims against Japan. The move follows a week in which the international community has condemned China’s illegal development of military facilities in the South China Sea.\nThe South China Morning Post reports that the Xiangtan has become an active vessel in the Chinese Navy as of Wednesday and will be deployed in the waters between China and Japan. “The Type 054A frigate, which has a displacement of more than 4,000 tonnes, has long range surveillance and strong air defence capabilities,” the Post cites Chinese state news outlet Xinhua as reporting. Reuters adds that the ship can fight on its own or work in tandem with other military vehicles, and is known for especially successful anti-submarine capabilities.\nThe move comes as Japan mulls aiding the Philippines with an agreement to sell the nation more military equipment. The Philippines is one of China’s major rivals in the South China Sea and has taken Beijing to the Permanent Court of Arbitration at The Hague to contest China’s constructions in the Spratly Islands, which Manila claims. Chinese officials fear that any Japanese equipment that falls into Philippine hands will be used against Chinese expansion in the region. While Japan has sold such equipment previously, it would be the first such deal to a member nation of the Association of Southeast Asian Nations (ASEAN).\nChinese Foreign Minister Wang Yi, returning from a trip to Washington this week in which he told American reporters that the entirety of the South China Sea had belonged to Beijing “since ancient times,” condemned the Philippines Thursday for continuing to challenge China’s claims in the region. Taking the case to an international court was “irresponsible to the Filipino people and the future of the Philippines,” he said.\nChina has yet to make any official comment on the latest developments in Japanese-Philippine talks over an arms deal. The Chinese communist government has declined to provide Japanese Foreign Minister Fumio Kishida with the basic courtesy of planning a proposed visit, forcing Kishida to cancel his plans of visiting. Kishida had said last year that he was hoping to visit China in the spring to expand bilateral cooperation on defense matters.\nSince then, however, Japan has participated in its first military exercise in the South China Sea, along with the United States. Japan has also sought closer ties to Vietnam, whose government contests China’s presence in the Paracel Islands. Satellite photos revealed this week that China has placed surface-to-air missiles and fighter jets in the Paracel Island chain.\nWhile China has been significantly more active in militarizing the South China Sea, it has attempted in the past three years to wrest away all control of the East China Sea from Japan, most of which is considered by the international community to be international waters.\nIn 2013, China declared an Air Defense Identification Zone (ADIZ) over the contested Senkaku Islands in the region, which would claim to force all aircraft in the area to ask China for permission before flying over them. Japan ignored the order, and President Barack Obama, on a trip to Japan, warned China that any attack on Japanese aircraft would force the United States, bound by treaty, to defend Japan from China. The ADIZ is still in place, but commonly ignored.\nThe analysis company Strator suggests that China has done far more than put up an ADIZ to assert its dominance over the East China Sea, however. “China has kept up the pace of its incursions into the disputed waters around the Diaoyu/Senkaku Islands, and Chinese flights have penetrated Japan’s East China Sea air defense identification zone in droves,” the site noted earlier this month.\nBeijing has also strengthened its presence in the area through its coast guard, rather than its navy, allowing for more covert activity. The Chinese government has begun transferring a number of vessels from the navy to the coast guard, to be used with less fanfare to keep Japanese activity in the region at bay.","url":"https://www.breitbart.com/national-security/2016/02/26/following-week-of-south-china-sea-tensions-china-flexes-muscle-in-east-china-sea/"}
