{"authors":["Frances Martel"],"date_download":"2018-10-30 20:40:19","date_modify":"2018-10-30 20:40:19","date_publish":"2016-07-20 03:40:26","description":"The Foreign Affairs Secretary of the Philippines confirmed that they will not engage in bilateral talks with China over the South China Sea.","filename":"data/vaneerConsumption/ChinaNoSouthChinaSeaTalkswithPhilippinesifHagueRulingMentioned.json","image_url":"https://media.breitbart.com/media/2015/05/china-philippines-south-china-sea-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_07_19__1540932019.html","title":"China: No South China Sea Talks with Philippines if Hague Ruling Mentioned","title_page":"China: No South China Sea Talks with Philippines if Hague Ruling Mentioned | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Foreign Affairs Secretary of the Philippines has confirmed that the nation will not engage in bilateral talks with China over the South China Sea under the terms Beijing has dictated, which requires Filipino diplomats to not mention the existence of a verdict in their favor issued by the Permanent Court of Arbitration at the Hague.\nThe Philippines won the international legal case last week, in which the Hague concluded that China’s “nine-dash line” — a border usurping territory belong to the Philippines, Vietnam, Taiwan, Brunei, Malaysia, and Indonesia — has no basis in international law and the nation should cease its “reclamation” efforts in the region immediately. While Philippine officials have repeatedly expressed a willingness to engage in talks with China, the demand that neither side the Hague case at all is a dealbreaker, Foreign Affairs Secretary Perfecto Yasay asserted.\n“They had asked us also to open ourselves for bilateral negotiations but outside of and in disregard of the arbitration ruling. I told him that this is something that was not consistent with our constitution and our national interest,” Yasay told Philippine broadcaster ANC, referring to a talk with Chinese Foreign Minister Wang Yi. Following Yasay’s refusal, he says Wang warned that “confrontation” could be in the future, though he did not specify whether that involved military retaliation.\nYasay argued the Hague ruling conclusively ended the debate over which territories in the South China Sea do not belong to China. “The tribunal have really debunked in no unmistakable terms the position of China in so far as the nine-dash line is concerned,” he said.","url":"https://www.breitbart.com/national-security/2016/07/19/philippines-rejects-south-china-sea-talks-beijing/"}
