{"authors":["Tsvetana Paraskova"],"date_download":"2018-10-30 23:29:58","date_modify":"2018-10-30 23:29:58","date_publish":"2018-07-17 00:00:00","description":"Rising oil prices and \"teapots\" are hurting China's previously torrid demand for oil.","filename":"data/vaneerConsumption/Chinaistheworldsbiggestoilbuyerbutitsdemandmaybeslowingdownsoon.json","image_url":"https://amp.businessinsider.com/images/5b4cb7a67b6714271f8b4836-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_china-is-the-worlds-biggest-oil-buyer-but-its-demand-may-be-slowing-down-soon-2018-7_1540942198.html","title":"China is the world's biggest oil buyer - but its demand may be slowing down soon","title_page":"    China is the world's biggest oil buyer — but its demand may be slowing down soon - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The flow of crude oil is seen in a container while an oilfield worker works on a drilling rig at an oil well operated by Venezuela's state oil company PDVSA Carlos Garcia Rawlins/Reuters\nOil demand growth in the world's biggest oil importer—China—is at risk of slowing down, at least in the coming months.\nHigher oil prices play a role in this, but the main culprit is a new tighter tax regime on independent Chinese refiners, which is already choking the refining margins and profits of the so-called 'teapots' who have grown over the past three years to account for around a fifth of China's total crude imports.\nThe teapots have become instrumental in China's growing thirst for crude oil after the government started allocating import quotas to the independent refiners in 2015.\nUnder the stricter tax regulations and reporting mechanisms effective March 1, however, the teapots now can't avoid paying consumption tax on refined oil product sales—as they did in the past three years—and their profit bonanza is coming to an end.\nDespite ample government-approved crude import quotas, independent refiners are now losing money on refining, cutting utilizations rates, and closing for maintenance to cut exposure to the unfavorable market conditions. With higher oil prices this year and the hefty taxes they now can't avoid paying, the teapots are expected to reduce their imports, threatening China's oil demand growth and ultimately, global oil demand growth.\nLast year alone, the independents accounted for 85 percent of China's crude oil import growth, according to data by S&P Global Platts.\nAlthough China issued last week its second batch of crude oil import quotas to independent refiners for 2018, the teapots are unlikely to use up all their quotas this year, because it wouldn't make business sense to refine crude at a loss just to have quotas fully utilized to make sure that they would qualify for quotas next year.\n\"Refining is a business. If processing crude results in losses now, it is unwise to take more crude just for securing quotas for the coming year,\" a Guangzhou-based trader told S&P Global Platts.\nRefining is indeed a business, and it's a losing one for the independent refiners now.\nAccording to data by Zibo Longzong Information Group, as carried by Reuters, independent refiners were losing US$45 (300 yuan) per ton of crude oil processed in May, compared to a profit of US$135 (900 yuan) per ton at the beginning of 2016.\nThe higher sales revenue from higher retail prices have been wiped out by the higher crude oil prices and the taxes.\n\"We expect much weaker margins in June and July as more orders booked at peak crude prices arrive,\" Gao Jian, crude oil analyst with China Sublime Information Group, told Reuters.\nIn response to the losses, a few teapots shut for maintenance in May and June to avoid exposure to the unfavorable market conditions, and some of them may not reopen at all if those conditions persist, according to Reuters.\nPlatts data shows that crude oil imports by the independent refiners hit a 20-month low last month, as a record-high inventory had piled up at major ports in the Shandong province, home of most of the teapots.\nChina's overall crude oil imports in June dropped for a second consecutive month and hit their lowest level since December 2017, on the back of trimmed purchases by the teapots. Chinese imports stood at 8.36 million bpd last month, down by 9 percent from May's imports of 9.2 million bpd, and down compared to the 8.8 million bpd imports in June 2017, data from the General Administration of Customs compiled by Reuters shows.\nChina's imports for the first half of 2018 were still up compared to last year, by 5.8 percent to around 9.07 million bpd.\nYet, independent Chinese refiners could further trim imports in the coming months as their refining business is now at a loss, due to the hefty taxes and the higher and volatile crude oil prices.\n\"The oil price volatility is certainly not helping as not many independent plants are doing sophisticated hedging,\" Seng Yick Tee with consultancy SIA Energy tells Reuters.\nThe higher import and tax expenses are now leading to the teapots cutting purchases in order to keep afloat in their once-lucrative refining business. Lower purchases from the chunk of the Chinese market accounting for one-fifth of the country's oil imports could spell trouble for Chinese—and global—oil demand growth.","url":"https://www.businessinsider.com/china-is-the-worlds-biggest-oil-buyer-but-its-demand-may-be-slowing-down-soon-2018-7"}
