{"authors":["Daisy Dunne For Mailonline","Associated Press"],"date_download":"2018-10-22 23:12:06","date_modify":"2018-10-22 23:12:06","date_publish":"2017-04-26 06:50:22","description":"The secretary general for China's space agency, Tian Yulong, disclosed the talks today in Chinese state media. ESA has described its 'Moon Village' as a launching pad for missions to Mars.","filename":"data/vaneerConsumption/ChinatalkswithEuropeanSpaceAgencyaboutmoonvillage.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/08/3F9D3CBF00000578-0-image-a-9_1493192329366.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4446426_China-talking-European-Space-Agency-moon-outpost_1540249926.html","title":"China talks with European Space Agency about moon village","title_page":"China talks with European Space Agency about moon village | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"China is talking with the European Space Agency about collaborating on a human settlement on the moon.\nThe secretary general for China's space agency, Tian Yulong, disclosed the talks today in Chinese state media.\nThe ESA has previously described its 'Moon Village' as a potential international launching pad for future missions to Mars.\nScroll down for video\nChina is talking with the European Space Agency about collaborating on a human settlement on the moon. Pictured is an artist's illustration released by the ESA last year\nEXPLORE FAR SIDE OF THE MOON The European Space Agency's CEO Jan Woerner said the project could allow exploration of the far side of the moon. 'No human has ever visited the far side of the Moon,' he wrote. 'Astronomers want to set up radio telescopes there because it is shaded from Earth's radio pollution. Building a telescope with innovative techniques like 3D printing, perhaps using lunar soil, would enable us to look much deeper into the Universe. 'No human has ever visited the lunar pole regions, where unmanned missions found water ice. 'Water is an important resource, because you can produce rocket propellant and oxygen from it. 'Both lunar regions are scientifically very promising places.'\nFurther details on what the collaboration could entail were not revealed.\nBut last year, the head of the ESA elaborated on plans to build a village on the moon.\n'The future of space travel needs a new vision,' said Jan Woerner.\nThe concept is a base for lunar exploration by humans and robots, which would act as a stopover for spacecraft, and become a 'village' with mining and even tourism.\n'The future of space travel needs a new vision.\n'Right now we have the Space Station as a common international project, but it won't last forever,' said Woerner.\n'If I say Moon Village, it does not mean single houses, a church, a town hall and so on. No, that would be misleading.\n'My idea only deals with the core of the concept of a village: people working and living together in the same place.\n'And this place would be on the Moon.\nEsa scientists have been testing 3D-printing technology they say could be used on the moon. It was one of a number of proposals discussed at an international conference organised by Esa about returning humans to the lunar surface. A proposed lunar base is illustrated\n'In the Moon Village we would like to combine the capabilities of different spacefaring nations, with the help of robots and astronauts.\n'The participants can work in different fields, perhaps they will conduct pure science and perhaps there will even be business ventures like mining or tourism.'\nWoerner said the village could even help man get to Mars.\n'The Moon Village would also act as a 'pit stop' for the further exploration of the Universe,' he said.\n'Esa is eager to fly to Mars as well.\n'For more than a decade, we have had a very successful spacecraft orbiting there. And now, with ExoMars, two unmanned missions are aiming at martian orbit and the surface.\n'Yes, the Americans want to send astronauts to Mars one day, but today's technology isn't prepared for this trip yet.\n'For example, we must develop countermeasures against the cosmic radiation that endangers the health of humans on long space trips. And we have to learn how to endure longer periods of time in space, not only in low orbit as on the Space Station.\nStructures for a lunar base could be built by robots sent ahead of human astronauts. Experts said 3D printing technology can currently construct an entire building in around a week\n'This is where our Moon comes into play – it is the perfect stepping stone to Mars.'\nChina has ramped up its space programme since its first manned spaceflight in 2003, more than 42 years after a Soviet cosmonaut became the first to reach orbit.\nChina this month launched an unmanned spacecraft on a mission to dock with its currently unoccupied space station.\nIt plans to launch the first mission to the far side of the moon next year.","url":"https://www.dailymail.co.uk/sciencetech/article-4446426/China-talking-European-Space-Agency-moon-outpost.html"}
