{"authors":["David Scutt","Business Insider Australia"],"date_download":"2018-10-31 00:17:29","date_modify":"2018-10-31 00:17:29","date_publish":"2018-07-11 00:00:00","description":"An intensifying trade war has kicked off between China and the US. The US has announced a new list of 6,000 Chinese goods, totaling $200 billion, that may be hit with additional 10% tariffs by the end of next month.","filename":"data/vaneerConsumption/Chinavowstofightbackasthetradewarescalates.json","image_url":"https://amp.businessinsider.com/images/5b39b0de8747af1f008b45bc-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_china-vows-to-fight-back-as-the-trade-war-escalates-2018-7_1540945049.html","title":"China vows to fight back as the trade war escalates","title_page":"    China vows to fight back as the trade war escalates - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"U.S. President Donald Trump and first lady Melania arrive on Air Force One at Beijing, China, November 8, 2017. REUTERS/Jonathan Ernst Jonathan Ernst/Reuters\nIt's now safe to say that a trade war is underway between the United States and China.\nFollowing the introduction of reciprocal tariffs on $34 billion of the others imports on Friday, the US, as promised, has announced a new list of 6,000 Chinese goods, totaling $200 billion, that may be hit with additional 10% tariffs by the end of next month.\nChina's Commerce Ministry has vowed to retaliate to the countermove.\n\"The Chinese side is shocked by the actions of the US,\" it said in a statement, according to a translation by Google.\n\"In order to safeguard the core interests of the country and the fundamental interests of the people, the Chinese government will, as always, have to make the necessary counter-measures.\"\nIt vowed to immediately file an additional lawsuit against the US to the World Trade Organization.\nThe Commerce Ministry also called upon the international community to \"work together to safeguard the rules of free trade and the multilateral trading system and jointly oppose trade hegemonism\".\n\"The behavior of the US is hurting China, hurting the world, and hurting itself,\" it said. \"This irrational behavior is unpopular.\"","url":"https://www.businessinsider.com/china-vows-to-fight-back-as-the-trade-war-escalates-2018-7"}
