{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:43:18","date_modify":"2018-10-30 20:43:18","date_publish":"2018-06-29 01:34:55","description":"The communist Chinese navy released a propaganda video showing off its naval capabilities in frustration over America's decision not to invite Beijing to the RIMPAC.","filename":"data/vaneerConsumption/ChineseNavyPropagandaVideoRevealsAngeroverRIMPACSnub.json","image_url":"https://media.breitbart.com/media/2018/06/chinese-navy-propaganda-video-18-youtube.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_06_28__1540932198.html","title":"Chinese Navy Propaganda Video Reveals Anger over RIMPAC Snub","title_page":"Chinese Navy Propaganda Video Reveals Anger over RIMPAC Snub","title_rss":"NULL","source_domain":"breitbart.com","text":"Communist China’s navy released a propaganda video showing off its naval capabilities in frustration over America’s decision not to invite Beijing to the annual U.S.-led Pacific joint military drill and “naval keg party,” known as the Rim of the Pacific Exercise (RIMPCA), Task & Purpose reported this week.\nCleverly compared to a “hot diss” typically linked to conflicts between hip-hop emcees, the veterans-oriented news outlet Task & Purpose notes:\nChina, on the other hand, is likely upset that they weren’t invited to the annual U.S.-led Pacific joint military exercise and naval keg party known as the Rim of the Pacific Exercise, or RIMPAC. But why? Well, in 2016, the last time China was invited to RIMPAC, they basically were the kid who shows up to your party and eats out of the fridge without asking; despite the stated goal of easing tensions, China has continued to militarize a constellation of man-made islands in the South China Sea by positioning surface-to-air missile and attack aircraft on newly-constructed airbases. This came after China sent a spy ship to snoop on everyone during RIMPAC 2014, which is possibly the dumbest diplomatic move since Task Force 74 was sent to the Bay of Bengal to piss off India back during the Cold War.\nWhile Task & Purpose ridiculed the “terrible hype video about China’s navy that screams ‘I’m a strong independent China and I don’t need no RIMPAC,’” others praised the production as better than the 1980s American action movie Top Gun.\nThe video features the troops from the Chinese People’s Liberation Army Navy participating in slow color-coded marching on the aircraft carrier Liaoning in scenes that drag on for what appears to be an infinity.\n“Watching it is even more boring than being in formation,” jokes Task & Purpose, which features U.S. military veteran writers.\nThe obscure Aviationist blog run by a Rome-based journalist disagrees, showering the production with praise in a post:\nShot on board the Chinese aircraft carrier Liaoning (CV-16), the video is brilliantly choreographed and composed. It is set to the soundtrack song “Black Blade” from the (ironically) U.S. based soundtrack artists “Two Steps from Hell” featuring musicians and composers Thomas J. Bergersen (originally of Trondheim, Norway) and Nick Thomas of Los Angeles. The two musicians have scored over 1,000 soundtracks and film trailers. They have also produced music for video and computer games. If you’ve seen the Hollywood films, “The Dark Knight”, “Tron: Legacy” or “No Country for Old Men” then you’ve already heard their masterful soundtrack music.\nThe Chinese military reportedly shot the video this year during major naval exercises in the South China Sea, home to Bejing’s territorial claims disputed by U.S. allies in the region.\nU.S. allies Japan and Vietnam, which have expressed dismay with China’s claims in the disputed South China Sea, are expected to participate in the RIMPAC event.","url":"https://www.breitbart.com/national-security/2018/06/28/report-chinese-navy-disses-us-uninvited-military-drill/"}
