{"authors":["John Hayward"],"date_download":"2018-10-30 19:23:55","date_modify":"2018-10-30 19:23:55","date_publish":"2015-09-18 15:55:19","description":"the Chinese Communist Party is happy. That's always a desirable American policy objective, isn't it?","filename":"data/vaneerConsumption/ChinesetoBuildBulletTrainFromLAtoLasVegas.json","image_url":"https://media.breitbart.com/media/2015/09/China-speed-train-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_09_18__1540927435.html","title":"Chinese to Build Bullet Train From L.A. to Las Vegas","title_page":"Chinese to Build Bullet Train From L.A. to Las Vegas | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Even the most energetic free-trade enthusiast can find a few things to be queasy about in Bloomberg Businessweek’s announcement of a major joint venture to build a Chinese bullet train connecting Los Angeles with Las Vegas:\nA China Railway Group-led consortium and XpressWest Enterprises LLC will form a joint venture to build a high-speed railway linking Las Vegas and Los Angeles, the first Chinese-made bullet-train project in the U.S. Construction of the 370-kilometer (230-mile) Southwest Rail Network will begin as soon as next September, according to a statement from Shu Guozeng, an official with the Communist Party’s leading group on financial and economic affairs. The project comes after four years of negotiations and will be supported by $100 million in initial capital. The statement didn’t specify the project’s expected cost or completion date.\nGreat, the Chinese Communist Party is happy. That’s always a desirable American policy objective, isn’t it?\nThe agreement, signed days before President Xi Jinping’s state visit to the U.S., is a milestone in China’s efforts to market its high-speed rail technology in advanced economies. The country has been pushing the technology primarily in emerging markets — often with a sales pitch from Premier Li Keqiang– as a means to project political influence. A $567 million contract last October to supply trains for Boston’s subway system was China’s first rail-related deal in the U.S.\nIf you thought Xi Jinping was going to have a gloomy visit to the United States, in which he was called on the carpet for his government’s involvement in massive cyber-attacks against both government and industrial targets, it might be time to adjust your expectations.\nThe agreement also represents an important victory in China’s high-speed rail rivalry with Japan, as the two countries have competed for train contracts throughout Asia. The parent company of JR Central, Japan’s largest bullet-train maker, had expressed interest in the Los Angeles-Las Vegas line several years ago, and China and Japan are both expected to bid to supply train cars for a proposed high-speed rail line in California’s Central Valley. “This is the first high-speed railway project where China and the U.S. will have systematic cooperation,” Yang Zhongmin, a deputy chief engineer with China Railway Group, said after a news conference in Beijing. “It shows the advancement of China-made high-speed railways.”\nHelping our global adversaries in China win important victories over our vital allies in Japan and market Chinese technology is another important American policy goal, right?\nApart from the railway project, China National Machinery Industry Corp. and General Electric Co. signed a memo of understanding to invest $327 million to develop 60 wind power stations in Kenya, Shu said at the Beijing news conference.\nThat’s just what the developing world needs: unreliable and ridiculously expensive “green” energy. Funny how China never seems interested in kneecapping its own energy industry or industrial production.\nDuring Xi’s visit starting next week, China and the U.S. are expected to reach agreements on trade, energy, climate, finance, aviation, defense and infrastructure construction, China Foreign Minister Wang Yi said Wednesday. Xi is due to visit Boeing Co.’s factory in Everett, Washington as China makes a push to build its own passenger planes.\nSounds like a great arrangement!\nChina will build high-speed trains in the U.S., and we’ll get to sell them coffee and donuts while they tour our factories and learn how to improve their own passenger planes. Maybe Boeing should shut down and unplug all their computers before the Chinese delegation arrives, just to be on the safe side.\nCalifornia’s expensive romance with high-speed rail has led nowhere good so far, but maybe this particular route is a profitable opportunity. Quartz.com notes that “about one-quarter of Las Vegas’s 41 million visitors in 2014 came from Southern California,” a journey currently accomplished with either short-hop plane tickets or a drive lasting several hours. Vegas is one of those tourist destinations where it’s reasonably easy to get by without a car once you arrive.\nOn the other hand, an L.A. Times report on the bullet-train project notes that its California terminus isn’t actually in Los Angeles – it will be in Victorville, which is 85 miles northeast of downtown L.A. Eighty-five miles seems a long way to drive to catch a train. The article further states the ride will last 80 minutes and cost $89. A cursory check of airline sites shows non-stop flights that are faster and only slightly more expensive. Has the demand for this rail line been studied carefully enough?","url":"https://www.breitbart.com/politics/2015/09/18/chinese-build-bullet-train-l-las-vegas/"}
