{"authors":["Linette Lopez"],"date_download":"2018-10-30 21:04:13","date_modify":"2018-10-30 21:04:13","date_publish":"2016-12-22 00:00:00","description":"Happy Holidays from Beijing.","filename":"data/vaneerConsumption/Chinabondmarketjittersattheendof2016.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_china-bond-market-jitters-at-the-end-of-2016-2016-12_1540933453.html","title":"China bond market jitters at the end of 2016","title_page":"    China bond market jitters at the end of 2016 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A woman (bottom) balance two men with her feet as students practice at an acrobatic school in Sanwang village, Anhui province, China, July 30, 2015. Reuters At the beginning of 2016, China sneezed and global markets caught the flu.\nThat is why, as the year closes and the Chinese economy remains in a delicate phase, investors are watching the country very closely for signs that the beginning of 2017 could bring the same volatility as the year before.\nLast time it was a declining yuan and capital outflows, in part caused by the Federal Reserve's first interest rate hike in around a decade, that caused market jitters.\nThis time we have another Fed hike on our hands, and outflows in November did tick up significantly. Now, add to that rumblings in China's corporate bond market.\nYields have spiked across the board — 5 and 10-year China government bond yields have risen by about 70 basis points since the end of October, hitting respective highs of to 3.15% and 3.34% — and rising corporate bond yields have made it harder for companies to pay investors. This year the country has had 55 corporate bond defaults as opposed to 24 in 2015.\n\"After several months of calm, China credit concerns have resurfaced over recent days with a number of headlines regarding rising onshore defaults,\" wrote analysts at Goldman Sachs in a recent note. \"These concerns have coincided with Chinese policymakers adopting a more risk-control mindset compared with the pro-growth agenda we saw in the earlier part of this year.\"\nIn part this is a good thing. China is trying to modernize and liberalize its economy, and that means letting indebted, struggling companies fail instead of bailing them out with state money.\nOn the other hand, this also means that volatility is here and \"that China will continue on its \"bumpy deceleration\" path in 2017,\" the analysts wrote.\n\"To us, asset price bubbles are major sources of risk in China, especially given the very fast pace of credit growth (around 20% yoy as of Q2 2016 when including shadow lending), and it is prudent for policymakers to address such risks.\"\nGoldman Sachs\nA school for Ant's\nOne of the companies that defaulted is mobile phone company Cosun. Earlier this month it announced to 13,000 investors that it would fail to pay $45 million worth of corporate bond payments.\nWhat's interesting about this case is that the bonds were sold through Ant Financial Group, a massive financial supermarket that handles Alipay, the payment system for internet behemoth Alibaba. Ant is expected to IPO sometime next year or the year after.\nOf course, the fact that one of the companies on its platform went bust is making some investors want to take a closer look at the other companies Ant is selling bonds for. The only other time it has had a default was last year, and it was a company tied to the Tianjin explosion. In that case, Ant repaid investors for their loss.\nThis time around the company says it will not cover Cosun investors' losses as the bonds were created by a third party and sold on the Ant platform. However, Ant has promised to cover legal bills for investors who want to sue the company, according to the WSJ.\nThis has all gone down, in part, because towards the end of the year the Chinese government changed tack. It started tightening its monetary policy after months of easing meant to counter the beginning of the year's volatility.\nAnalysts think this tightening is likely to continue, but its unclear for how long. 2017 is a massive year for China politically as it holds its 19th National Congress and determines the future leadership of the Chinese Communist Party.\n\"The Chinese leadership will likely face significant political uncertainty both internally and externally, and in response they will likely place social and economic stability as a top priority throughout 2017,\" a Credit Suisse research team led by Vincent Chan wrote in a note. \"We believe the government will adopt pro-growth measures to boost economic growth ahead of the political transition.\"\nIf that sounds frenetic that's because it is. Get ready for a bumpy ride with China. At any point, you don't know which part of the economy could start driving.","url":"https://www.businessinsider.com/china-bond-market-jitters-at-the-end-of-2016-2016-12"}
