{"authors":["David Scutt","Business Insider Australia"],"date_download":"2018-10-30 23:59:27","date_modify":"2018-10-30 23:59:27","date_publish":"2018-07-13 00:00:00","description":"China's surplus with the US jumped to $28.97 billion last month, larger than the $24.58 billion recorded in May.","filename":"data/vaneerConsumption/ChinarecordslargesttradesurpluswiththeUS.json","image_url":"https://amp.businessinsider.com/images/5b30eecf1ae66222008b47d1-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_china-largest-trade-surplus-with-the-us-2018-7_1540943967.html","title":"China records largest trade surplus with the US","title_page":"    China records largest trade surplus with the US - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A Chinese resident shops for milk for the upcoming Chinese new year at a newly opened supermarket in Haikou of Hainan Province, south China January 22, 2006. China Photos/Getty\nChina's trade surplus increased sharply in June, including with the United States.\nAccording to China's National Bureau of Statistics (NBS), the surplus swelled to $41.61 billion last month, up from $24.92 billion in May, and expects a smaller increase to $27.6 billion.\nIn what will do little to reduce trade tensions between the two sides, China's trade surplus with the US jumped to $28.97 billion, larger than the $24.58 billion recorded in May.\nIn US dollar terms, it was the largest on record, according to calculations from Reuters.\nOver the first half of the year, China's trade surplus with US stood at $133.76 billion.\nA year earlier, the dollar value of total Chinese exports grew by 11.3%, down from 12.6% in the year to May. Despite the deceleration, that topped economist forecasts for a smaller increase of 10.0%.\nHelping to explain the large upside beat for the trade surplus, imports grew by 14.1% in the year to June, down from 26% in May.\nMarkets had been expecting a smaller deceleration in annual growth to 20.8%.\nBIAUS\nDespite strong growth in both exports and imports over the year — reflecting stronger global economic conditions as well as higher commodity prices, especially crude — the expansion in the trade surplus with the US is noteworthy, and will do little to diffuse the escalating tit-for-tat trade war between the two global superpowers.\nWith $34 billion in tariffs already in place and another $16 billion arriving in less than two weeks, the US government announced this week that it may apply additional 10% tariffs on $200 billion worth of Chinese imports as soon as early September.\nThe comprehensive list of over 6,000 additional goods could see the US apply tariffs on around half of total Chinese imports entering the country.\nChina has already announced reciprocal tariffs on $34 billion worth of US imports and has pledged to retaliate to the proposed list of new US tariffs should they be introduced.","url":"https://www.businessinsider.com/china-largest-trade-surplus-with-the-us-2018-7"}
