{"authors":[],"date_download":"2018-10-22 23:39:58","date_modify":"2018-10-22 23:39:58","date_publish":"2016-01-28 12:50:26","description":"Chinese e-commerce giant Alibaba saw its revenue jump 32 percent year-on-year for the quarter ending in December, it said in a statement Thursday, despite sl...","filename":"data/vaneerConsumption/ChineseecommercegiantAlibabasrevenuejumps32.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g983-2vdWmEltwXfba0ce28e6328c3e27-805_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420879_Chinese-e-commerce-giant-Alibabas-revenue-jumps-32_1540251598.html","title":"Chinese e-commerce giant Alibaba's revenue jumps 32%","title_page":"Chinese e-commerce giant Alibaba's revenue jumps 32% | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Chinese e-commerce giant Alibaba's revenue jumps 32%\nChinese e-commerce giant Alibaba saw its revenue jump 32 percent year-on-year for the quarter ending in December, it said in a statement Thursday, despite slowing growth in the world's second-largest economy.\nAlibaba, which dominates the consumer-to-consumer market in China, said revenue reached $5.33 billion (34.54 billion yuan) in the December quarter, beating an average forecast of 33.2 billion yuan in a survey of analysts by Bloomberg News.\nInvestors have hammered the New York-listed shares of Alibaba as a proxy for China's falling growth, weakening currency and domestic stock market turmoil.\nThe logo of Chinese online shopping portal Alibaba.com ©Aaron Tam (AFP/File)\nChina's economy grew 6.9 percent in 2015, the slowest rate since 1990. Fourth-quarter growth alone slowed to 6.8 percent, its worst since the global financial crisis in early 2009.\n\"Alibaba Group had an outstanding quarter, reaching a milestone of over 400 million annual active buyers and continuing our unrivalled leadership in mobile,\" Alibaba chief executive Daniel Zhang said in the statement.\nAlibaba said its net income attributable to shareholders more than doubled, surging 111 percent on the year to $1.93 billion for the three-month period.\nIts closely-watched gross merchandise volume (GMV) -- a measure of value for online sales -- was $149 billion for the period, up 23 percent year-on-year.\nThe quarter included China's November 11 \"Singles Day\", said to be the world's biggest online shopping spree, when Alibaba saw $14.3 billion worth of goods settled through its online payments unit.\nBut analysts said the company could come under pressure in future, even as it seeks to grow overseas business and diversify outside e-commerce.\n\"Overall, Alibaba will probably not be able to enjoy the same high growth rate after the November 11 shopping festival as it did in the past one or two years,\" Internet consultancy iResearch analyst Zhou Xiaoqian told AFP ahead of the results release.\n\"The e-commerce industry in China has reached a mature stage... The growth will gradually slow down and it's inevitable,\" she said.\nAlibaba's Taobao platform is estimated to hold more than 90 percent of the consumer-to-consumer market in China, while its Tmall platform is believed to command more than half of business-to-consumer transactions.\n\"We remain focused on our top strategic priorities, including global imports, rural expansion, increasing our footprint in first-tier Chinese cities and building a world-class cloud computing business,\" chief executive Zhang said.\nThe company had 407 million annual active buyers on its China retail marketplaces by the end of December, compared to 386 million at the end of September.\nAlibaba is making a string of investments as it tries to develop beyond its traditional e-commerce business into a broader Internet company.\nIn December, it bought Hong Kong newspaper the South China Morning Post, though the deal raised worries the purchase by a mainland Chinese company could erode editorial independence.\nIn October, it made a multi-billion-dollar offer to buy the outstanding shares of online video company Youku Tudou, China's equivalent of YouTube.\nAnd it has set up a new sports unit, after billionaire founder Jack Ma bought a stake in a successful Chinese football club now called Guangzhou Evergrande Taobao, the reigning Asian champions.\n\"The development of the sports and entertainment businesses is a necessary step for Alibaba. It's difficult for the e-commerce sector to provide sustained development for Alibaba in the future, so its strategic focus must shift,\" Tan Shufen, an analyst at the government-backed China Internet Network Information Center, told AFP before the release.","url":"https://www.dailymail.co.uk/wires/afp/article-3420879/Chinese-e-commerce-giant-Alibabas-revenue-jumps-32.html"}
