{"authors":["Sophie Williams For Mailonline"],"date_download":"2018-10-23 04:47:13","date_modify":"2018-10-23 04:47:13","date_publish":"2016-01-11 17:59:01","description":"A 13-year-old Chinese girl took her own life after being raped by her father. The schoolgirl left her family a series of notes telling them not to despair before committing suicide.","filename":"data/vaneerConsumption/Chinesegirlplungedtoherdeathafterbeingrapedbyherownfather.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/3005E95800000578-0-image-a-24_1452531237156.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_peoplesdaily_article-3394111_13-year-old-Chinese-girl-plunged-death-36th-floor-raped-father_1540270033.html","title":"Chinese girl plunged to her death after 'being raped by her own father'","title_page":"Chinese girl plunged to her death after 'being raped by her own father' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A 13-year-old Chinese girl took her own life after allegedly being raped by her own father.\nThe schoolgirl from Changzi County, north China's Shanxi province, fell from the 36th floor of an apartment block last October, the People's Daily Online reports.\nA series of notes written by the girl, with the surname of Guo, were found by the family, which expressed her despair in life.\nTragic: A Chinese teen (pictured), named as Guo, has commit suicide after allegedly being raped by her father\nHorrifying story: A series of notes written by the girl were found by the parents. In the note above, Guo tells her family that they should not lose hope\nIn one note, the girl told her family: ''There are many things that don’t need explaining. I don’t want to let you know these [secrets]. I’m scared.\n'It’s hard to avoid disappointment, but at least I don’t want you to lose hope.'\nIn another note, she wrote: 'Death is another start. To forget is because of the painful (mistake). '\nIn a third note, the schoolgirl sated: ' To burn in the fire, to scatter in the sea.\nPlease let my body burn in fire and scatter my ashes in the sea to wash away.\nSky, sea, Purified soul gets atoned and repented, then carries on listening.'\nAccording to Chinese media, the girl's parents were divorced and she had been living with her aunt.\nHer aunt told reporters that the girl's father had called at the house asking to take Guo back to her hometown for a few days.\nGuo left with her father however upon her return to her aunt's house she appeared different and somewhat traumatised.\nSad notes: The 13-year-old girl also wrote: 'Death is another start. To forget is because of the painful (mistake)'\n'In fact, I have not liked lying': In this note, Guo tells her family how she hadn't liked keeping a secret from them\nAfter Guo told her aunt that her father had raped her twice, Guo's aunt immediately called the police and took the girl to hospital. The doctors confirmed that her hymen had broken.\nWhile the police were gathering evidence for arrest, the girl allegedly became increasingly depressed.\nOn October 5 last year, she jumped from the 36th floor of an apartment building.\nGuo's father was arrested on November 1 and is currently awaiting trial.","url":"https://www.dailymail.co.uk/news/peoplesdaily/article-3394111/13-year-old-Chinese-girl-plunged-death-36th-floor-raped-father.html"}
