{"authors":["John Hayward"],"date_download":"2018-10-30 19:35:24","date_modify":"2018-10-30 19:35:24","date_publish":"2017-04-15 02:22:52","description":"China seems to be having second thoughts about indulging the deranged Kim regime in North Korea for so long.","filename":"data/vaneerConsumption/ChineseComponentsFoundinNorthKoreanRocketsDespiteSanctions.json","image_url":"https://media.breitbart.com/media/2017/03/test-fire-of-Pukguksong-2-north-korean-missile-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_04_14__1540928124.html","title":"Chinese Components Found in North Korean Rockets Despite Sanctions","title_page":"Chinese Components Found in North Korean Rockets Despite Sanctions | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"China seems to be having second thoughts about indulging the deranged Kim regime in North Korea for so long, but it will not be easy for Beijing to downplay the amount of assistance it has given Pyongyang’s nuclear missile program over the years.\nThe Washington Post writes of a North Korean booster rocket falling into South Korean waters after a major satellite launch last year, and the South Koreans discovering that many of its key components were purchased from Chinese businesses.\nU.N. officials sought comment from these Chinese firms after preparing a report on the rocket configuration but “received only silence.” That is not surprising since the U.N. report found that “sensitive software and other items specifically banned for export to North Korea under U.N. Security Council sanctions” were sold by the Chinese as well, and some of the shipments occurred within the last 18 months.\nAnalyst Joshua Pollack of the James Martin Center for Nonproliferation Studies suggested the Chinese government might be inadvertently allowing these shipments because it is unwilling, or unable, to police the huge number of companies exporting these sensitive goods, using sophisticated tactics to keep their activities hidden. He added that if they are trying to police the exports, endemic corruption in the Chinese system might be holding investigators at bay.\nThose excuses seem difficult to square with the shrill insistence of Chinese officials on impossible standards of proof before they will investigate allegations of North Korea sanctions-busting. Also, the North Koreans took considerable pains to destroy the evidence by planting explosives all over their test rocket.\nThe conclusions from the U.N. report were mixed, with some optimism expressed that China has been cracking down on illicit shipments to North Korea over the past few months but also complaints that China could do a great deal more to cut off Pyongyang’s access to missile technology.\nOn the one hand, China’s ban on North Korean coal seems like a serious blow to the North Korean economy, and China appears to be serious about maintaining the ban. But on the other hand, Chinese officials boasted this week that overall trade with North Korea increased by 37 percent in the first quarter of 2017. It is not enough to balance the billion-dollar loss North Korea will experience from China’s ban on coal imports, but it will ease the pain of that loss somewhat.\nIt is unclear whether China would be willing to use the other high-powered economic weapon in its arsenal and ban exports of Chinese oil to North Korea, effectively devastating their economy (and possibly triggering one of China’s worst fears, a flood of North Korean refugees). The Chinese gave North Korea a little taste of oil shortage back in 2003, passed off as “technical problems” with shipping, and it seemed to concentrate Pyongyang’s mind wonderfully.\nNorth Korea’s belligerence might force the issue, on both Chinese economic sanctions and China’s willingness to indulge Pyongyang’s missile program. On Friday, mixed with its customary threats to unleash “nuclear thunderbolts” against the United States, North Korea sneered through one of its “think tanks” that “somebody” was cooperating with the U.S. in a “naive and foolish” attempt to collapse the North Korean system. The somebody in question is widely interpreted to be China, making it one of the worst insults the Kim regime has thrown at its Chinese patrons.\nMore than anything else, that calculation changed when the North Koreans began their final lap toward nuclear-tipped ICBMs, and the U.S. responded by deploying the THAAD anti-missile system in South Korea. China and Russia hate the way THAAD’s powerful radars allow it to peer into Chinese territory, and they dislike the thought of pouring resources into offensive systems that might be able to overwhelm advanced missile defense.\nAlso, China may have calculated it could pull North Korea back before it developed nuclear-tipped long-range missiles, without factoring in the danger of EMP attacks. High-altitude nuclear detonations designed to scramble electronics don’t require much in the way of precision guidance, and they don’t need re-entry technology at all, which is one of the biggest challenges to producing regular nuclear missiles. The very same type of satellite launch vehicle China helped North Korea build is just about good enough to put an EMP weapon over the United States or Europe, with potentially catastrophic results. It’s a threat Western planners simply cannot ignore.\nEven if there are no open hostilities in the near future, North Korea is becoming an expensive indulgence for Beijing, so advanced rocket components pinched from European suppliers by Chinese distributors — in defiance of legal agreements never to sell them to North Korea — might finally become as scarce as they were supposed to be.","url":"https://www.breitbart.com/national-security/2017/04/14/chinese-components-found-in-north-korean-rockets-despite-sanctions/"}
