{"authors":["Associated Press"],"date_download":"2018-10-23 01:22:21","date_modify":"2018-10-23 01:22:21","date_publish":"2017-03-10 09:19:07","description":"BEIJING (AP) - China's auto sales growth decelerated in the first two months of the year following a sales tax increase.Sales of sedans, minivans and SUVs...","filename":"data/vaneerConsumption/Chinaautosalesslowingdentedbytaxincrease.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300504_China-auto-sales-slowing-dented-tax-increase_1540257741.html","title":"China auto sales slowing, dented by tax increase","title_page":"China auto sales slowing, dented by tax increase | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BEIJING (AP) - China's auto sales growth decelerated in the first two months of the year following a sales tax increase.\nSales of sedans, minivans and SUVs rose 6.3 percent from a year earlier to 3.8 million units, down from December's 9.1 percent growth, an industry group, the China Association of Automobile Manufacturers, reported Friday. Total vehicle sales, including trucks and buses, rose 8.8 percent to 4.4 million.\nSales in the world's biggest auto market by number of units sold rose 15 percent last year after a 10 percent sales tax on small-engine vehicles was cut by half. The government restored part of that in January, raising the tax from 5 percent to 7.5 percent.\nA steady decline in sales growth is squeezing both global brands that look to China's crowded market to drive revenue and newer local brands that are gradually expanding abroad. Forecasters expect growth in mid-single digits this year.\nChinese commercial data can be volatile in January and February due to the Lunar New Year holiday, which starts on different dates each year. Analysts often combine the two months to screen out the impact of the two-week holiday.\nDemand for SUVs, especially lower-priced Chinese brands, helped to offset weakness in sedan sales.\nSales of SUVs, popular with families that see them as a safe urban ride, rose 21.6 percent to 1.5 million, accounting for 40 percent of passenger vehicle sales. Sales by Chinese brands rose 28.3 percent to 978,000 units.\nGeneral Motors Co. said SUVs accounted for nearly half its February sales.\nSedan sales rose 3.8 percent to 1.8 million units.\n-GM said sales eked out a 0.3 percent gain from a year earlier in February to 246,730. Sales dropped 24 percent in January.\n-Ford Motor Co. said sales in January and February fell 21 percent to 153,073. February sales rose 2 percent to 64,641.\n-Nissan Motor Co., the most popular Japanese brand in China, said sales in January and February rose 3.1 percent from a year earlier to 194,241 vehicles.\n-Toyota Motor Co. said sales rose 9.6 percent to 183,600 in the first two months of the year.\n-BMW AG, Europe's biggest luxury brand, said sales in China of BMW and Mini brand cars rose 14.7 percent in January-February to 92,045.","url":"https://www.dailymail.co.uk/wires/ap/article-4300504/China-auto-sales-slowing-dented-tax-increase.html"}
