{"authors":["Associated Press"],"date_download":"2018-10-23 01:57:01","date_modify":"2018-10-23 01:57:01","date_publish":"2016-01-11 13:21:39","description":"BEIJING (AP) — Chinese President Xi Jinping ordered a reorganization of the military headquarters' structure on Monday in a sign of his firm control over the...","filename":"data/vaneerConsumption/ChinasXireorganizesmilitaryheadquartersstructure.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:35cf23768edb47b082b3a789179b8783-48qEJGFphM8d437f0aaf9253766b-411_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393792_Chinas-Xi-reorganizes-military-headquarters-structure_1540259821.html","title":"China's Xi reorganizes military headquarters structure","title_page":"China's Xi reorganizes military headquarters structure | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"China's Xi reorganizes military headquarters structure\nBEIJING (AP) — Chinese President Xi Jinping ordered a reorganization of the military headquarters' structure on Monday in a sign of his firm control over the 2.3 million-member armed forces.\nXi ordered the elimination of the four headquarters responsible for staff, politics, logistics and armaments and their replacement with 15 new agencies under the direct authority of the ruling Communist Party's Central Military Commission, state media reported.\nThe move is part of a push to reassert the absolute authority of the party commission headed by Xi and modernize the military's organizational structure. Xi is also pressing ahead with the downsizing of the military by 300,000 members to eliminate many non-combat-related functions.\nIn this photo provided by China's Xinhua News Agency, Chinese President Xi Jinping, center front, poses for a group photo during a meeting with the new heads of the reorganized organs of the Communist Party's Central Military Commission in Beijing, Monday, Jan. 11, 2016. Chinese President Xi ordered a reorganization of the military headquarters' structure on Monday in a sign of his firm control over the 2.3 million-member armed forces. (Li Gang/Xinhua News Agency via AP) NO SALES\nChina's military has benefited from near annual double-digit percentage increases in its budget, now the world's second largest after the United States.\nUnlike most militaries, however, the People's Liberation Army is loyal to the Communist Party, rather than to the nation or its people. Leaders have rejected any suggestion of placing it under government rather than party command, and Xi was quoted on Monday as telling commanders to \"unswervingly follow the (party's) absolute leadership over the armed forces.\"","url":"https://www.dailymail.co.uk/wires/ap/article-3393792/Chinas-Xi-reorganizes-military-headquarters-structure.html"}
