{"authors":["Associated Press"],"date_download":"2018-10-30 23:59:11","date_modify":"2018-10-30 23:59:11","date_publish":"2016-12-05 00:00:00","description":"President Barack Obama blocked the purchase of a German maker of semiconductor manufacturing equipment as a security risk.","filename":"data/vaneerConsumption/ChinaappealstoUStostopdisruptingacquisitions.json","image_url":"https://amp.businessinsider.com/images/583f9896ba6eb637008b6e9f-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ap-china-appeals-to-us-to-stop-disrupting-acquisitions-2016-12_1540943951.html","title":"China appeals to US to stop disrupting acquisitions","title_page":"    China appeals to US to stop disrupting acquisitions - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BEIJING (AP) — China has urged Washington to stop disrupting its foreign corporate acquisitions after President Obama blocked the purchase of a German maker of semiconductor equipment on security grounds.\nBarack Obama Getty Images BEIJING (AP) — China urged Washington on Monday to stop disrupting its foreign corporate acquisitions after President Barack Obama blocked the purchase of a German maker of semiconductor manufacturing equipment as a security risk.\nThe proposed acquisition of Aixtron SE by China's Fujian Grand Chip was \"pure market behavior,\" said a foreign ministry spokesman, Lu Kang.\nOn Friday, Obama ordered Fujian Grand Chip to drop its attempt to take over Aixtron's California subsidiary. The government said Aixtron's technology has \"military applications.\"\n\"We hope that the United States will cease making groundless accusations about Chinese companies and will provide a fair environment and favorable conditions for investment by them,\" said Lu at a regular briefing. \"I think this matter will in the long run be in the interests of all the parties concerned.\"\nIt was the third time in three decades that a U.S. president has blocked an acquisition by a Chinese company on security grounds.\nGermany approved the 670 million euro ($740 million) takeover of Aixtron's German parent but said last week it was reconsidering due to unspecified \"security-related questions.\"\nChinese companies have made a multibillion-dollar string of acquisitions in Europe to obtain technology and brands including Club Med, Pirelli tires and Volvo Cars.\nMany Europeans welcome the influx of money but China faces criticism from business leaders that they are blocked from making similar acquisitions in its state-dominated economy.\nAixtron, based in Herzogenrath, says its headquarters, research and development operations and existing technology would remain at its current sites under the proposed acquisition.\nIn 2012, Obama blocked Chinese-owned Ralls Corp. from building a wind farm near a naval base in Oregon. In 1990, then-President George Bush blocked the purchase of MAMCO Manufacturing Inc., a maker of aircraft parts, by a Chinese state-owned company.","url":"https://www.businessinsider.com/ap-china-appeals-to-us-to-stop-disrupting-acquisitions-2016-12"}
