{"authors":["Frank Langfitt"],"date_download":"2018-10-23 00:57:19","date_modify":"2018-10-23 00:57:19","date_publish":"2015-07-07 00:00:00","description":"China's stock market continues to fall despite massive government intervention. The Shanghai Index is down 30 percent since mid-June.","filename":"data/vaneerConsumption/ChineseStocksTakeAPlungeDespiteGovernmentEfforts.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_07_07_420913835_chinese-stocks-take-a-plunge-despite-government-efforts_1540256239.html","title":"Chinese Stocks Take A Plunge Despite Government Efforts","title_page":"Chinese Stocks Take A Plunge Despite Government Efforts : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Chinese Stocks Take A Plunge Despite Government Efforts\nKELLY MCEVERS, HOST:\nThe key to China's power in Asia is its economy. It's the world's second largest. And one aspect of that economy is the country's stock markets, which, right now, are a mess. The Shanghai Index is down 30 percent since mid-June. It continued to fall today despite multiple efforts by the government to prop up shares. For more on that, we turn to NPR's Shanghai correspondent, Frank Langfitt, who's actually here in the studio with us in Washington. Hi, Frank.\nFRANK LANGFITT, BYLINE: Hi, Kelly.\nMCEVERS: So Frank, before all of this happened to the stock markets in China, I mean, all we could hear about it was that it was booming. It was doing great, right?\nLANGFITT: It was euphoric and basically had been rising since last year. And the government has actually been behind this rally. They basically served as a cheerleader. They wanted investors to put money into the market to help out state-owned enterprises. And as the market rose, new investors poured in, many of them, actually, not well-educated. A lot of them just had a middle-school education. And to give you a sense, there's a friend of mine I know who just recently bought a car, and he was able to get a no-interest loan from his cousin who who had been able to take a lot of money out of the market.\nMCEVERS: Wow.\nLANGFITT: So it has made a real difference in people's pocketbooks.\nMCEVERS: Average people's lives - so then what happened last month? Why did the market begin to plunge?\nLANGFITT: Well, I think people watching the market saw a classic bubble. The price-to-earnings ratio, which is a good way to measure the actual value of a stock, were way out of whack. I mean, the stock prices were high, and there was very little earnings. Most people were buying stocks on borrowed money, which is always very dangerous. And when we did a piece on this back in March, there was an analyst I talked to who just called the whole thing a Ponzi scheme. What happened is lenders, as often happens when they get very jittery, they start calling in loans. People had to dumb their stocks, and we saw the route take off in basically the middle of June. It's worth pointing out also that this is very much a domestic phenomenon. This is not about world markets. It's not about what's happening in Greece.\nMCEVERS: OK. So what has the government tried to do, then, to sort of stop this freefall?\nLANGFITT: A lot, and basically every day, they've tried something new. The governmental told security firms to spend about $20 billion to prop up blue-chip stocks. Almost a thousand companies have stopped trading their shares. And until today, the state-controlled media had this narrative that everything was fine. But so many people, I think, were attacking the media online that they stopped that, you know, that line that they were giving. Most investors look at what the government's doing, and it seems like they're in a bit of a panic. They don't think the market has hit bottom, and so people are continuing to sell.\nMCEVERS: It sounds like the government's plan isn't really working.\nLANGFITT: So far not. It will be very interesting to see, actually, what happens tomorrow.\nMCEVERS: So how big of a risk is this to China's overall economy?\nLANGFITT: Well, you know, at the human level, 80 percent of the investment in the Chinese markets is mom-and-pop, so the people who got in late to this market have been gored. The good news, though, is that the Chinese stock markets are a much smaller percentage of the economy than, say, in the U.S. and other developed countries, so it doesn't have as immediate an effect on things. It's also worth pointing out the Shanghai Exchange is down about 30 percent, but it's still up since the rise last year. So so far, this isn't a full-blown crash. What we have to do is see how the rest of the week goes.\nMCEVERS: Do you think there will be any political fallout from this, frustration with the government?\nLANGFITT: I don't think it's going to be immediate, but what's really interesting is that the government encouraged this run-up. And as - they're unelected, so they're very successful government, but it's primarily - their managing rule is based on how they manage the economy. This runs very counter to that narrative. And so if - the longer it takes them to stabilize this market, the more it undermines the Communist Party's, frankly, their greatest political strength.\nMCEVERS: That's NPR Shanghai correspondent, Frank Langfitt, joining us here in Washington. Thanks so much, Frank.\nLANGFITT: Happy to do it, Kelly.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2015/07/07/420913835/chinese-stocks-take-a-plunge-despite-government-efforts"}
