{"authors":["Tiffany Lo For Mailonline","Cindy Tran For Daily Mail Australia"],"date_download":"2018-10-23 00:39:11","date_modify":"2018-10-23 00:39:11","date_publish":"2017-04-26 10:26:43","description":"Pensioner Zhang Qiao, from central China's Henan Province, showcased her glamorous evening gown made from 3,000 expired or unused condoms to promote AIDS prevention.","filename":"data/vaneerConsumption/ChinesedesignershowcasesherdressmadefromCONDOMS.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/27/01/3F9F988300000578-0-image-a-63_1493252038601.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4446952_Chinese-designer-showcases-dress-CONDOMS_1540255151.html","title":"Chinese designer showcases her dress made from CONDOMS","title_page":"Chinese designer showcases her dress made from CONDOMS | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A self-taught fashion designer has made a glamorous evening gown with a latex twist - it's made entirely from condoms.\nZhang Qiao showcased her yellow-coloured attire made from 3,000 expired or unused condoms to promote AIDS prevention.\nThe 54-year-old pensioner, from central China's Henan Province, took just a week to clean the rubbers and sew them onto the dress.\nThe grandmother said she wanted to raise public awareness of understanding the virus and promote safe sex.\nA model is dressing Zhang's condom dress in an eco fashion show last month in central China\nThe outstanding dress was designed under the inspiration of an AIDS patient, Zhang spoke in an interview reported in QQ.com.\n'The patient finds herself and picks up interests to matters around her again after counselling with us,' Zhang said.\nThe special dress looks no different to any fringe dress with tassels at the bottom.\nZhang first made the silhouette of a cami dress in white, then attached 3000 clean condoms on top of it.\nThe dress is to promote safe sex and remind people to cherish life and stay away from AIDS\nThe dress is made of 3000 unused or expired condoms collected from community centres\nShe told Pear in a video that removing the lubricant is the most difficult and time-consuming part in making the gown.\nBut in just a week's time, the dress is ready to wear.\nLast month, Zhang showcased the condom dress she made in an eco fashion show in Sanmenxia county.\nZhang is expected that there will be controversies but she said 'if you have a positive thinking, this is a message o tell you that you should cherish life even if you have AIDS.'\nEco Fashion Show: Zhang's model wearing the condom dress taking a catwalk on stage\nIt also reminded Zhang having breast cancer eight years ago.\nAfter the recovery, she started to sew soles and gave it to poor people for good deed.\nOver the past eight years, Zhang had made over 10,000 soles to people who are in need.\nLater, she started to designed clothes made of environmentally friendly materials to encourage people a low-carbon emission living.\nAnd the condom dress is one of her latest designs to bring up the awareness of AIDS.","url":"https://www.dailymail.co.uk/femail/article-4446952/Chinese-designer-showcases-dress-CONDOMS.html"}
