{"authors":["David Scutt","Business Insider Australia"],"date_download":"2018-10-30 23:46:14","date_modify":"2018-10-30 23:46:14","date_publish":"2018-07-16 00:00:00","description":"China’s economy grew 6.7% over the past year, in line with forecasts, but below the 6.8% level in the March quarter. Monthly data on retail sales and urban fixed asset investment also printed in line with expectations, although industrial output missed badly to the downside.","filename":"data/vaneerConsumption/ChineseeconomicgrowthslowedintheJunequarter.json","image_url":"https://amp.businessinsider.com/images/5b4c2bc9744a9898058b4a7d-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_china-economy-gdp-growth-q2-2018-7_1540943174.html","title":"Chinese economic growth slowed in the June quarter","title_page":"    Chinese economic growth slowed in the June quarter - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Alex Jodoin\nChinese economic growth slowed fractionally in the June quarter, as expected.\nAccording to China's National Bureau of Statistics (NBS), GDP grew by 6.7% from a year earlier — in line with forecasts — maintaining the streak of either meeting or exceeding forecasts by 0.1 percentage points (ppts) in every quarter over the past three years.\nChina's economy grew by 6.8% in the 12 months to March this year.\nChina National Bueeau of Statistics\n\"The national economy sustained the momentum of steady and sound development with restructuring deepened, drivers of growth replaced and the quality and efficiency improved steadily, signifying a good start for national economy to move toward high-quality development,\" the NBS said in a statement.\nFrom a year earlier, China's tertiary sector — predominantly services — grew by 7.6%, outpacing growth of 6.1% in secondary industries and 3.2% for the primary sector.\nThe latter two are often regarded as the \"old\" Chinese economy, with the Tertiary sector the \"new\".\n\"The economic structure continued to be optimized,\" the NBS said.\n\"An analysis by industrial structures shows that the growth rate of the value added of the tertiary industry was 1.5ppts higher than that of the secondary industry in the first half year, accounting for 54.3% of the GDP.\n\"[That] was 0.3ppts higher than that of the same period last year and 13.9ppts higher than that of secondary industries.\"\nFor the quarter, the NBS said GDP expanded by 1.8% after seasonal adjustments, faster than the 1.4% level in the first three months and forecasts for a smaller acceleration of 1.6%.\nOver the first half of the year, GDP expanded by 6.8% compared to the same period a year earlier, a result that was marginally above the 6.7% level that had been expected.\nIn separate data released alongside the GDP report, the NBS also provided details on annual growth in retail sales, industrial output and urban fixed asset investment in June.\nLike the GDP report, there were few surprises outside of the industrial output figure which missed badly to the downside, at least by Chinese standards.\nRetail sales grew by 9% from a year earlier, up from 8.5% in May and in line with market expectations.\nIndustrial output expanded by 6% year-on-year, well below the 6.8% level of May and forecasts for a smaller deceleration to 6.5%.\nUrban fixed asset investment grew by 6% between January to June, below the 6.1% annual rate seen in the first five months of the year.\nWhile the lowest level in several decades, that too was in line with expectations.\nChina National Bureau of Statistics\nDespite the mixed report card, the NBS said the result provides \"a sound foundation for achieving main social and economic development goals of the year\", adding that progress in cutting structural overcapacity in the economy \"continued to deepen\".\nHowever, it cautioned that vulnerabilities remained, suggesting that \"external uncertainties are increasing and economic restructuring is in a phase of overcoming difficulties\".\n\"We should adhere to the supply-side structural reform, continuously expand effective demand, revitalize the real economy, respond actively to external challenges, guard against and dissolve risks, guide and stabilize social expectation, and coordinate the efforts in stabilizing growth, stimulating reform, adjusting structure, benefiting people's livelihood and fending off risks so as to ensure the steady and healthy development of the economy,\" it said.","url":"https://www.businessinsider.com/china-economy-gdp-growth-q2-2018-7"}
