{"authors":["David Scutt","Business Insider Australia"],"date_download":"2018-10-31 00:36:45","date_modify":"2018-10-31 00:36:45","date_publish":"2018-07-06 00:00:00","description":"In response to a 25% tariff on $34 billion worth of Chinese goods entering the United States — a move described as \"typical trade bullying\" by the Chinese government — reports suggest China's General Administration of Customs is delaying clearing US imports at major Chinese ports.","filename":"data/vaneerConsumption/ChinaisdelayingUSimportsfromenteringthecountry.json","image_url":"https://amp.businessinsider.com/images/5b3f34d94a26271b008b4c0d-2560-1280.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_china-is-delaying-us-imports-from-entering-the-country-2018-7_1540946205.html","title":"China is delaying US imports from entering the country","title_page":"    China is delaying US imports from entering the country - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Guang Niu/Getty\nAfter months of speculation as to whether or not it would occur, the trade war between the United States and China is now underway in earnest.\nA 25% tariff is now being applied to $34 billion worth of Chinese goods entering the United States, an amount China's government has previously promised to match on US imports.\nIn a statement released shortly after the US tariffs went into effect, China's Ministry of Commerce called the move \"typical trade bullying\" and warned that retaliation would be swift.\n\"The United States violated the [World Trade Organisation] rules and launched the largest trade war in economic history to date,\" the Commerce Ministry said.\n\"The Chinese side promised not to fire the first shot, but in order to defend the core interests of the country and the interests of the people, they had to be forced to make the necessary counterattacks.\"\nThe Commerce Ministry didn't immediately provide details as to whether and when its pledge to introduce reciprocal tariffs on US imports would be introduced, creating an air of optimism in financial markets that the trade war may not escalate quickly.\nHowever, while no details have been provided as yet, it looks like a Chinese retaliation may be in the works.\nAccording to reports from Reuters, citing unnamed sources, some major Chinese ports have delayed clearing goods from the United States, disrupting imports of key products such as pork and soybeans.\n\"The port of Shanghai put on hold clearing some US imports through customs, said an official at a company in the coastal city, which handles customs clearance for importers,\" Reuters said, noting the source said that he had spoken to customs officials.\nA separate source in Shanghai told Reuters that customs brokers were slowing the clearance process because of confusion about how and when to implement duties.\n\"They're holding everything … because there's uncertainty,\" he said.\n\"But overall, this weekend they should be able to identify what the taxes are and how they should be implemented, and they should be processed as normal.\"\nThe sources told Reuters that while there did not appear to be any direct instructions to hold up cargoes, some customs departments were waiting until they had received official guidance from the central government.\nChina's General Administration of Customs did not comment on the delays and said the agency will implement the tariffs as announced on Thursday, Reuters said.\nYou can read more here.","url":"https://www.businessinsider.com/china-is-delaying-us-imports-from-entering-the-country-2018-7"}
