{"authors":["Associated Press"],"date_download":"2018-10-22 22:51:54","date_modify":"2018-10-22 22:51:54","date_publish":"2017-03-16 04:59:14","description":"BEIJING (AP) - China's central bank raised short-term interest rates Thursday following the U.S. rate increase as Beijing tries to shore up the value of its...","filename":"data/vaneerConsumption/ChinaraisesshortterminterestratefollowUSincrease.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/04/wire-226461-1489640365-435_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318888_China-raises-short-term-rate-follow-US-increase_1540248714.html","title":"China raises short-term interest rate follow US increase","title_page":"China raises short-term interest rate follow US increase | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BEIJING (AP) - China's central bank raised short-term interest rates Thursday following the U.S. rate increase as Beijing tries to shore up the value of its currency and stanch an outflow of money.\nThe People's Bank of China raised the rate for its six-month and one-year medium-term lending facility and open-market repurchase operations by 0.1 percent. The benchmark one-year commercial lending rate was unchanged.\nBeijing faces a dilemma as it tries to defend the exchange rate of its yuan without depressing economic growth, which has been shored up by repeated infusions of credit.\nChinese Premier Li Keqiang listens to a reporter's question during a press conference held at the conclusion of the annual meeting of China's National People's Congress (NPC) at the Great Hall of the People in Beijing, Wednesday, March 15, 2017. China's No. 2 leader said Wednesday his government hopes for positive relations with Washington and has no desire for a trade war nor plans to devalue its currency to boost exports.(AP Photo/Mark Schiefelbein)\nEconomists have warned the yuan would face further downward pressure if higher U.S. interest rates caused money to flow out of China in search of higher returns. Beijing has spent tens of billions of dollars to prop up the currency, also known as the renminbi, after investors began moving money out of China due to expectations its value would sink.\nThe People's Bank cited the U.S. Federal Reserve's Wednesday and \"some signs of recovery\" in China's own economy.\nThe mention of the U.S. rate hike \"suggests that the PBOC may have been partly motivated by a desire to follow the Fed in order to avoid additional downward pressure on the renminbi,\" Julian Evans-Pritchard of Capital Economics said in a report.\n___\nPeople's Bank of China (in Chinese): www.pbc.gov.cn","url":"https://www.dailymail.co.uk/wires/ap/article-4318888/China-raises-short-term-rate-follow-US-increase.html"}
