{"authors":["Associated Press"],"date_download":"2018-10-23 01:27:57","date_modify":"2018-10-23 01:27:57","date_publish":"2017-03-10 09:39:07","description":"BERLIN (AP) - The Chinese Embassy in Berlin demanded Friday that a German online retailer stop selling a line of T-shirts with slogans it says are insulting...","filename":"data/vaneerConsumption/ChineseEmbassydemandsapologyfromGermanTshirtretailer.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300562_Chinese-Embassy-demands-apology-German-T-shirt-retailer_1540258077.html","title":"Chinese Embassy demands apology from German T-shirt retailer","title_page":"Chinese Embassy demands apology from German T-shirt retailer | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BERLIN (AP) - The Chinese Embassy in Berlin demanded Friday that a German online retailer stop selling a line of T-shirts with slogans it says are insulting to China.\nThe offerings from retailer Spreadshirt.de include T-shirts with slogans like \"Save a dog, Eat a Chinese,\" ''Save a shark, Eat a Chinese,\" and an image of two faux Chinese alphabet characters having sex, with the caption \"Now I understand Chinese.\"\nThe embassy said in a statement that it has complained to the German government and is seeking an apology, an explanation and for the offending shirts to be pulled.\nHowever, the head of the Leipzig-based company, Philip Rooke, said he planned to keep the disputed designs available for purchase.\nRooke said his company provides an \"open platform\" for people to create and share ideas on merchandise, and \"in a few cases, some people may find a design controversial while others do not.\"\n\"We do not judge or censor designs based on their phrasing, social or political leanings,\" he said in a written statement.\nRooke added that he had \"no intention of causing anyone offense.\"\n\"I apologize to anyone who takes any offense from the two designs in question,\" he said.","url":"https://www.dailymail.co.uk/wires/ap/article-4300562/Chinese-Embassy-demands-apology-German-T-shirt-retailer.html"}
