{"authors":[],"date_download":"2018-10-22 21:10:37","date_modify":"2018-10-22 21:10:37","date_publish":"2016-01-29 05:40:50","description":"A Chinese court sentenced three activists to prison on Friday for allegedly attempting to start a non-violent civil rights movement, family members and campa...","filename":"data/vaneerConsumption/Chinajailsthreecivildisobedienceactivists.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h73o-3bmscybNe842cce83474b50e5ab3-119_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422180_China-jails-three-civil-disobedience-activists_1540242637.html","title":"China jails three 'civil disobedience' activists","title_page":"China jails three 'civil disobedience' activists | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"China jails three 'civil disobedience' activists\nA Chinese court sentenced three activists to prison on Friday for allegedly attempting to start a non-violent civil rights movement, family members and campaign groups said, the latest example of the Communist Party's intensifying crackdown on dissent.\nTang Jingling received a five-year sentence, while Yuan Xinting and Wang Qingying were given three-and-a-half and two-and-a-half-year terms respectively, Amnesty International said in a press release.\nThe conviction for \"inciting subversion of state power\" was handed down by the Guangzhou Intermediate People's Court, the London-based group said.\nChina's Communist party does not tolerate anything it perceives as a potential threat to its rule, and dozens of activists have been imprisoned since President Xi Jinping took office two years ago ©Mark Ralston (AFP/File)\n\"This is a ridiculous verdict,\" said Tang's wife Wang Yanfang, who confirmed the sentences.\n\"They are not guilty of any crime. They just upheld values of justice,\" she told AFP.\nChina's Communist party does not tolerate anything it perceives as a potential threat to its rule, and dozens of activists have been imprisoned since President Xi Jinping took office two years ago.\nDuring the trial, police accused the Guangzhou trio of distributing the books about non-violent resistance and \"wilfully incited the subversion of state power and the overthrow of the socialist system\".\nThey added in a statement to prosecutors posted online by the activists' lawyers that the men had rented an office to study, print, and mail several books including one titled \"On Strategic Nonviolent Conflict: Thinking about the Fundamentals\".\nThey were also accused of disseminating \"From Dictatorship to Democracy\" by Gene Sharp, an expert on non-violent social movements.\nThe books \"have been confirmed to have serious political transgressions\", police added.\nTang's wife said the defendants were accused of opposing the Communist party and government, but all the evidence was \"related to five books\".\n\"In China, even spreading the ideas of non-violent civil disobedience will lead to a criminal prosecution\", she said.\nA court official declined to comment to AFP.\nThe trial in July came as China's state security detained or called in for questioning more than 200 human rights lawyers and activists, in what analysts have called one of the biggest crackdowns on dissent in years. Several were formally arrested on subversion charges two weeks ago after being held in secret for six months.\n\"The sentences for Tang, Yuan, and Wang don't bode well for the more than a dozen human rights lawyers likely to stand trial soon for similar 'subversion' charges,\" Sophie Richardson, China director for US-based Human Rights Watch, said in a statement Friday.\n\"The Chinese government needs to stop equating peaceful criticism with subversion if it is to make any progress towards respecting rights.\"\nTang, 44, was himself a prominent human rights lawyer who had aided farmers attempting to take local officials accused of illegal land seizures to court.","url":"https://www.dailymail.co.uk/wires/afp/article-3422180/China-jails-three-civil-disobedience-activists.html"}
