{"authors":["Julian Robinson For Mailonline"],"date_download":"2018-10-22 22:19:57","date_modify":"2018-10-22 22:19:57","date_publish":"2017-04-26 04:06:17","description":"The giant carrier, based on the Soviet Kuznetsov class design, was towed from its dockyard just after 9am following a ceremony in the northern Chinese port city of Dalian.","filename":"data/vaneerConsumption/Chinalaunchesfirstdomesticallybuiltaircraftcarrier.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/08/3F9D143900000578-0-image-a-50_1493191626774.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446206_China-launches-domestically-built-aircraft-carrier-media_1540246797.html","title":"China launches first domestically built aircraft carrier","title_page":"China launches first domestically built aircraft carrier | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"China has launched its first domestically designed and built aircraft carrier and has called for the US to cease military exercises with South Korea as Trump's USS Carl Vinson continues to steam towards the Korean Peninsula.\nThe 50,000-ton carrier, based on the Soviet Kuznetsov class design, was towed from its dockyard just after 9am following a ceremony in the northern port city of Dalian.\nIt comes as the US aircraft carrier USS Carl Vinson makes its way to the troubled Korean Peninsula amid fears Kim Jong-un is plotting to carry out North Korea's sixth nuclear test.\nBut China's Foreign Minister Wang Yi on Wednesday urged an end to US-South Korean military manoeuvres as well as a stop to North Korea's nuclear programme to calm tensions on the peninsula.\nTalking in Berlin, he said: 'We have to, on the one hand, stop the nuclear activities of North Korea and, on the other hand, the large-scale manoeuvres in Korean waters should cease.'\nScroll down for video\nChina has launched its first domestically designed and built aircraft carrier as America's USS Vinson continues to steam towards the Korean Peninsula\nThe 50,000-ton carrier, based on the Soviet Kuznetsov class design, was towed from its dockyard just after 9am following a ceremony in the northern port city of Dalian\nThe new unnamed Chinese aircraft carrier was launched amid great fanfare in a ceremony attended by Vice chairman of China's Central Military Commission and Communist Party Central Committee member Fan Changlong\nA newly-built aircraft carrier is transferred from dry dock into the water at a launch ceremony at a shipyard in Dalian in northeastern China's Liaoning Province this morning\nDevelopment of the new carrier began in 2013 and construction in late 2015. It's expected to be formally commissioned sometime before 2020, after sea trials and the arrival of its full air complement\nIn Pyongyang's latest provocation, Kim oversaw the country's largest-ever firing drill to mark the founding anniversary of its military.\nMeanwhile, the US has enraged China by delivering a missile defence system to a deployment site in South Korea.\nWashington is urging China - Pyongyang's sole major ally - to do more to rein North Korea in, but the Asian giant has reacted with fury to the planned installation of the Terminal High Altitude Area Defense (THAAD) system.\nThis morning, the new unnamed Chinese aircraft carrier was launched amid great fanfare in a ceremony attended by Vice chairman of China's Central Military Commission and Communist Party Central Committee member Fan Changlong.\nIt came just three days after the anniversary of the People's Liberation Army Navy's symbolic founding in 1949.\nDevelopment of the new carrier began in 2013 and construction in late 2015. It's expected to be formally commissioned sometime before 2020, after sea trials and the arrival of its full air complement.\nDalian was the same port where the carrier's predecessor, the Soviet-built Liaoning, also underwent extensive refurbishing before being commissioned in 2012.\nDalian was the same port where the carrier's predecessor, the Soviet-built Liaoning, also underwent extensive refurbishing before being commissioned in 2012\nReports of the launch said a bottle of champagne was broken across the ship's bow and other craft in the port sounded their horns in celebration\nThe main hull of the new carrier has been completed and its power supply put into place. Next up are mooring tests and the debugging of its electronic systems, the Defense Ministry said\nChina is believed to be planning to build at least two and possibly as many as four additional carriers, with one of them, the Type 002, reported to be already under construction at a shipyard outside Shanghai\nThe new carrier is based on the Soviet Kuznetsov class design, with a ski jump-style deck for taking off and a conventional oil-fuelled steam turbine power plant\nAlso attending was navy commander Vice Adm. Shen Jinlong, a former commander of the South Sea Fleet responsible for defending China's claim to virtually the entire South China Sea.\nReports of the launch said a bottle of champagne was broken across the ship's bow and other craft in the port sounded their horns in celebration.\nLike the 60,000-ton Liaoning, which was purchased from the Ukraine, the new carrier is based on the Soviet Kuznetsov class design, with a ski jump-style deck for taking off and a conventional oil-fuelled steam turbine power plant. That limits the weight of payloads its planes can carry, its speed and the amount of time it can spend at sea relative to American nuclear-powered carriers.\nThe main hull of the new carrier has been completed and its power supply put into place. Next up are mooring tests and the debugging of its electronic systems, the Defense Ministry said.\nChina is believed to be planning to build at least two and possibly as many as four additional carriers, with one of them, the Type 002, reported to be already under construction at a shipyard outside Shanghai.\nThe new carrier is part of an ambitious expansion of the Chinese navy, which is projected to have a total of 265-273 warships, submarines and logistics vessels by 2020\nWashington has deployed an aircraft carrier strike group led by the USS Carl Vinson (pictured on Sunday) to the peninsula in a show of force, amid signs the North could be preparing for a sixth nuclear test\nThe US has enraged China by delivering a missile defence system to a deployment site in South Korea. US military vehicles are pictured moving through South Korea today amid protests from those who oppose plans to install the missile system\nIn Pyongyang's latest provocation, North Korean dictator Kim Jong-un oversaw the country's largest-ever live-firing drill (pictured) to mark the founding anniversary of its military\nNorth Korea staged a 'Combined Fire Demonstration' held to celebrate the 85th anniversary of the North Korean army, in Wonsan, North Korea\nIndependent journalists were not given access to cover the event depicted in the photos. They show rows of heavy artillery and troops carrying out exercise\nThe joint drill - attended by Kim Jong-un (pictured) - involved artillery firing as well as torpedo attacks by submarines, state-run KCNA said, and demonstrated the country's determination to a 'pour merciless rain of fire on the reckless imperialist US and its dirty followers', it said\nThey are expected to be closer in size to the U.S. Navy's nuclear-powered 100,000-ton Nimitz class ships, with flat flight decks and catapults to allow planes to launch with more bombs and fuel aboard.\nAlong with their role in protecting China's maritime interests, Chinese naval strategists see the carrier programme as 'about having naval power commensurate with China's international status, to impress both external and domestic audiences,' said Michael Chase, an expert on the Chinese military at U.S. think tank the RAND Corporation.\nThe new carrier 'is likely to be seen as further evidence of China's desire to become the most powerful and influential country in the region,' Chase said. That will be especially worrying to Indian security analysts who are already concerned about Beijing's ambitions in the Indian Ocean, he said.\nIndia, along with Japan and Taiwan which also view Chinese carriers as threats, will likely respond by building new submarines and anti-ship missiles, said Ian Easton, a research Fellow at The Project 2049 Institute in Arlington, Virginia.\nChina's 'expansionist behaviour in the South China Sea and its aggressive efforts to undermine the security of Taiwan and Japan, in particular, have translated into a situation where few countries now trust that Beijing has benign motives,' Easton said.\nChina claims Taiwan as its own territory to be brought under control by force if necessary, and was seen as advertising that threat when it sailed the Liaoning through the Taiwan Strait earlier this year.\nSouth Korea and US soldiers watch from an observation post during a joint live firing drill at the Seungjin Fire Training Field in Pocheon, northeast of Seoul\nA South Korean K1A2 tank (blue) and a US M1A2 tank (red) fire live rounds during a joint live firing drill this morning\nSouth Korean K2 tanks fire live rounds during a joint live firing drill. There are mounting tensions on the peninsula amid fears North Korea is plotting a sixth nuclear test\nAccording to Chinese reports, the new, as yet unnamed, carrier will carry 24 Shenyang J-15 fighters, based on the Russian Sukhoi Su-33, along with 12 helicopters for anti-submarine warfare, airborne early warning and rescue operations. That compares to 85-90 fixed wing aircraft and helicopters carried by a Nimitz-class carrier.\nThe new carrier is part of an ambitious expansion of the Chinese navy, which is projected to have a total of 265-273 warships, submarines and logistics vessels by 2020, according to the Washington, D.C.-based Center for Naval Analysis. That compares with 275 deployable battle force ships presently in the U.S. Navy, China's primary rival in the Asia Pacific.\nThe U.S. operates 10 aircraft carriers, has 62 destroyers to China's 32, and 75 submarines to China's 68. The U.S. Navy has 323,000 personnel to China's 235,000.\nChina has offered little information about the roles it expects its carriers to play, although its planning appears to be evolving as it gains more experience. The Liaoning was initially touted mainly as an experimental and training platform, but in December was declared to be combat-ready and has taken part in live-firing exercises in the South China Sea, where tensions have risen over China's construction of man-made islands complete with airstrips and military structures.\nMeanwhile, US troops have started to deliver a missile defence system to a deployment site in South Korea Wednesday, amid heightened tensions over the North's nuclear ambitions.\nThe US and ally South Korea say the THAAD deployment, agreed last year, is intended to guard against missile threats from the nuclear-armed North.\nBut China fears it will weaken its own ballistic capabilities and says it upsets the regional security balance. It has imposed a host of measures seen as economic retaliation against the South, including a ban on tour groups.\nTV footage showed large trailers in camouflage paint carrying what appeared to be missile-related equipment entering a golf course in the southern county of Seongju on Wednesday morning.\nA US A-10 Thunderbolt II attack aircraft fires flares during a joint live firing drill this morning. America has also sent an aircraft carrier to the region\nA US AH-64 Apache helicopter fires rockets during the joint training drills. The exercises come during a war of words between North Korea and the US\nSouth Korean RF-16 jet fighters fire flares during a training session this morning. Military exercises have also taken place in North Korea\nHundreds of residents - who are concerned over the potential environmental impact - protested angrily, some clashing with police. More than 10 were injured including three who were hospitalized, activists said.\nSeoul's defence ministry said Wednesday's move was aimed at 'securing operational capability of the THAAD as soon as possible', with a goal of fully installing the batteries by the end of this year.\nThe South is holding a presidential election next month to choose a successor to ousted leader Park Geun-Hye, and Seoul and Washington are pressing ahead with the deployment with some candidates expressing ambivalence over the system, including front-runner Moon Jae-In, of the left-leaning Democratic Party.\nHis spokesman Park Kwang-On expressed 'strong regret' at the delivery, saying it ignored 'required procedures'.\n'This move has shut off any room for policy considerations by the next government and it is very improper,' he said.\nThe South's tourist industry has been hammered by Beijing's boycott over THAAD, with Chinese visitor numbers - normally more than half the total - plummeting 40 percent last month even though the ban only came into force on March 15.\nRetail conglomerate Lotte - which provided the Seongju golf course site to the Seoul government - has also been targeted, with 85 of its 99 stores in China shut down.\nTHAAD is designed to intercept and destroy short and medium-range ballistic missiles during their final phase of flight.\nThe latest move comes as tension soars on the Korean peninsula following a series of missile launches by the North and warnings from the administration of US President Donald Trump that military action was an 'option on the table'.\nWashington has deployed an aircraft carrier strike group led by the USS Carl Vinson to the peninsula in a show of force, amid signs the North could be preparing for a sixth nuclear test.\nThe impoverished, isolated state says it needs nuclear weapons to defend itself against the threat of invasion, and has issued blood-curdling promises of retaliation in the event of an atomic strike against it.\nIn Pyongyang's latest display, leader Kim Jong-Un oversaw the country's largest-ever firing drill to mark the founding anniversary of its military, state-run media said Wednesday.\nThe joint drill involved artillery firing as well as torpedo attacks by submarines, state-run KCNA said, and demonstrated the country's determination to a 'pour merciless rain of fire on the reckless imperialist US and its dirty followers', it said.\nThe US has long pushed for China to make more efforts to curb Pyongyang's behaviour.\nBut Beijing says it has less sway over its wayward neighbour than Washington believes.\nIt is also concerned that a regime collapse could trigger a flood of refugees across the border, and leave the US military on its doorstep in a unified Korea.\nChinese President Xi Jinping called Monday for 'restraint' regarding North Korea in a telephone conversation with Trump.\nUS defence leaders and other top officials are to give a classified briefing on North Korea to all senators in an unusual meeting at the White House later Wednesday.","url":"https://www.dailymail.co.uk/news/article-4446206/China-launches-domestically-built-aircraft-carrier-media.html"}
