{"authors":[],"date_download":"2018-10-22 21:17:29","date_modify":"2018-10-22 21:17:29","date_publish":"2014-06-04 20:19:16","description":"It's been 25 years since the crackdown in Tiananmen Square. China is now a much freer place, but the Communist Party retains its grip.","filename":"data/vaneerConsumption/ChinaAimstoSmotherMemoryofTiananmenSquare.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/486026/140604-tiananmen-security-main-6a_cf28f23d887a388231b9cfca90d207fb.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/nightly-news_china-aims-smother-memory-tiananmen-square-n122791_1540243049.html","title":"China Aims to Smother Memory of Tiananmen Square","title_page":"China Aims to Smother Memory of Tiananmen Square ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIn Hong Kong, tens of thousands of people marked the 25th anniversary of the Tiananmen Square crackdown when the Chinese Communist Party sent in the army to crush pro-democracy protesters, killing hundreds, possibly thousands.\nSecurity was tight on Wednesday around Tiananmen Square and Beijing was in virtual lockdown. Thousands of activists have been detained and censors have been working overtime to erase any mentions of June 4 from the Internet or social networks.\nNBC News visited Wu'er Kaixi, a prominent student leader in 1989, now living in exile in Taiwan, who says that China is trying to erase the Tiananmen Square massacre from history. He says that sooner or later they will have to confront what he calls the lie they have tried to maintain for 25 years.\nIn Beijing's gigantic National Museum, you will find the cowboy hat of former communist leader Deng Xiaoping, but no mention of the crackdown he ordered. The only museum dedicated to June 4 is in Hong Kong, which still has a high degree of autonomy, and where democracy advocate Lee Cheuk-Yan said they have a responsibility to tell the truth.","url":"https://www.nbcnews.com/nightly-news/china-aims-smother-memory-tiananmen-square-n122791"}
