{"authors":["Sophie Williams For Mailonline"],"date_download":"2018-10-23 04:06:10","date_modify":"2018-10-23 04:06:10","date_publish":"2017-03-16 15:16:12","description":"A new study has found that air pollution and smog in China could be caused by melting ice caps in the Arctic. The study was published by Science Advances.","filename":"data/vaneerConsumption/Chinasairpollutioncausedbymeltingicecaps.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/2EECD29400000578-0-image-a-40_1489672824288.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_peoplesdaily_article-4320024_China-s-air-pollution-caused-melting-ice-caps_1540267570.html","title":"China's air pollution caused by melting ice caps","title_page":"China's air pollution caused by melting ice caps | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"China's air pollution and smog could be caused by melting ice caps in the Arctic, a new study claims.\nThe study published by Science Advances says that melting Arctic sea ice and increasing Eurasian snow has helped create conditions that trap pollution over the country's populated areas, reports the People's Daily Online.\nEvery winter parts of China chokes on poor air conditions keeping residents indoors, unable to get to work or school.\nA woman wearing a mask walks in a street near Lama Temple in Beijing (File photo)\nPeople try to continue their lives as normal in Lianyungang in China's Jiangsu province\nA polar bear launches itself at a seal during the Summer drift ice season (File photo)\nThe study was conducted by a Chinese researcher in the US.\nIt claims that the melting sea ice caused by climate change has shifted China's winter monsoon.\nThis has helped to create atmospheric conditions that have trapped pollution over China's major industrial hubs and populated areas like Beijing.\nThe findings were based on the analysis of one of China's worst air pollution events ever recorded in China in 2013. During that period, smog lingered over eastern China for a month.\nYuhang Wang, a professor at Georgia's Institute of Technology told reporters: 'Emissions in China have been decreasing over the last four years, but the severe winter haze is not getting better.\nThe LED screen shows the rising sun on Tiananmen Square (File photo)\nA giant Beijing Olympics logo is barely visible in the smog (File photo)\nReitrees practice Taichi during morning exercise in Fuyang City, Anhui province (File photo)\n'Mostly that's because of a very rapid change in the high polar regions where sea ice is decreasing and snowfall is increasing. This perturbation keeps cold air from getting into the eastern parts of China where it would flush out the air pollution.'\nChina has introduced strict targets for cutting emissions from factories in a bid to curb air pollution.\nAt the opening of this year's National People's Congress on March 5, Premier Li Keqiang vowed to make China's skies blue again. He said that the country would attack the three main causes of air pollution which are coal burning, vehicle exhaust and emissions from factories.\nData analysis conducted for the research found a correlation between stagnant air conditions over China to Arctic sea ice which reached a record low at the end of 2012 and snowfall in Siberian which reached a record high in the winter.\nThick smog engulfs the Chinese capital as people make their way to work (File photo)\nMasked commuters wait for buses in haze covered Beijing, China (File photo)\nA girl puts a mask over her dog in Shijiazhuang, northern China (File photo)\nThe results suggested that the cold centre had moved.\nWang said: 'The very rapid change in polar warming is having a large impact on China.\n'Our research shows that cutting greenhouse gases would help with the winter haze problem.'\nHowever He Kebin, a Tsinghua University professor warned that weather is only an external cause of air pollution and that other measures needed to be taken to curb poor air quality in China.\nNot all professors are pleased with the research paper with Zhang Renyi, professor at Texas A&M University slamming the paper as 'weak'.","url":"https://www.dailymail.co.uk/news/peoplesdaily/article-4320024/China-s-air-pollution-caused-melting-ice-caps.html"}
