{"authors":["David Scutt","Business Insider Australia"],"date_download":"2018-10-30 23:12:04","date_modify":"2018-10-30 23:12:04","date_publish":"2018-07-20 00:00:00","description":"The Chinese yuan has been smoked over the past four months, losing 8% in onshore and offshore trade.","filename":"data/vaneerConsumption/ChinaYuanunwindjustgettingstarted.json","image_url":"https://amp.businessinsider.com/images/566ac9512340f816008b4e95-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_china-yuan-unwind-just-getting-started-2018-7_1540941124.html","title":"China: Yuan unwind just getting started","title_page":"    China: Yuan unwind just getting started - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A staff member displays the new version of the 100-yuan RMB banknotes (US 15.7 dollars) to photographers at the Bank of China Tower in Hong Kong AP/Kin Cheung\nThe Chinese yuan has been smoked over the past four months, both in onshore and offshore markets.\nThe CNY, or onshore-traded yuan, has fallen 8% against the greenback since late March. The decline in offshore-traded yuan, or CNH, has been even greater, shedding 8.4% over the same period.\nBusiness Insider Australia\nA deterioration in the external environment, courtesy of increasing trade tensions with the United States, along with a deleveraging push from Chinese officials, has acted to slow the Chinese economy, increasing speculation the People's Bank of China (PBoC) will ease monetary policy settings, a move in stark contrast to what's expected from the US Federal Reserve.\nCombined with China's current account flipping from surplus to deficit, and it's had a large impact on the yuan, and broader currency markets across Asia.\nSacha Tihanyi, Deputy Head of Emerging Markets Strategy at TD Securities, thinks the move in the yuan has got further to run yet.\n\"We are revising our CNY target to reflect more weakness,\" he said in a note released on Thursday, adding that Chinese policymakers have \"become more amenable to a more rapid pace of depreciation than we initially assumed\".\nSo how much higher will USD/CNY move from where it currently sits at 6.7701?\nA lot, says Tihanyi.\n\"We see 7.10 as our end of year target in 2018, with stabilisation at the end of Q1 next year at 7.20,\" he says.\n\"A substantial easing in trade tensions between the US and China would be helpful in ameliorating the Chinese situation, though domestic economic momentum loss and the requisite monetary policy trajectory in China as they play against the Fed trajectory will continue to pressure CNY.\"\nIn the absence of a lessening in trade tensions, or a shift in Fed policy, the yuan is likely to weaken further, in other words.\nGiven the impact the yuan move has already had on Asian currency valuations, leading to capital outflows from the region as the US dollar has strengthened, volatility seen in the first half of the year will likely continue for sometime yet if Tihanyi's call is on the money.","url":"https://www.businessinsider.com/china-yuan-unwind-just-getting-started-2018-7"}
