{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 21:08:12","date_modify":"2018-10-30 21:08:12","date_publish":"2016-12-22 00:00:00","description":null,"filename":"data/vaneerConsumption/ChineseinsurtechgiantZhongAnturnsitsbackonaUSIPO.json","image_url":"https://amp.businessinsider.com/images/585bf282f10a9a1c008b4cb0-640-320.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_chinese-insurtech-giant-zhong-an-turns-its-back-on-a-us-ipo-2016-12_1540933692.html","title":"Chinese insurtech giant Zhong An turns its back on a US IPO","title_page":"    Chinese insurtech giant Zhong An turns its back on a US IPO - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Fintech Briefing\" subscribers. To learn more and subscribe, please click here.\nChinese fintechs may be among the world's largest and most well funded, but it appears some are not yet confident they would see success outside of their home market, as evidenced by Chinese online insurer ZhongAn abandoning its plans to pursue an initial public offering (IPO) in either the US or Hong Kong.\nInstead, the insurtech will look to IPO in mainland China, according to unnamed sources close to the matter, Bloomberg reports. Back in August, ZhongAn said it planned to IPO either in the US or Hong Kong by 2017, but Bloomberg's most recent sources said ZhongAn has told its lawyers to stop preparations and focus on an IPO in its home market.\nThere are several possible reasons why ZhongAn thinks it would be better to IPO in China than the US:\nThe US market may not be as friendly as it first appeared. Firms that pursue an IPO outside of their home market usually believe that investors and analysts in an international market better understand their business model. ZhongAn may have been considering the US because numerous fintechs have already IPO'd there, setting a precedent. But there have been notably few fintech IPOs in the US this year, reflecting investor caution in the industry and toward fintechs' business models. This may have put ZhongAn off a US IPO, and it wouldn't be alone if that were the case — just this week US alt lender SoFi delayed its planned public offering.\nPresident-elect Trump's hostile stance toward Chinese business. During his election campaign, Trump repeatedly lambasted Chinese business for stealing US jobs, threatened to label China as a currency manipulator, and said he would impose high tariffs on Chinese imports. This has likely left Chinese companies uncertain about how to approach the US market, and they will probably remain cautious until Trump enters office and his policies toward foreign companies take shape.","url":"https://www.businessinsider.com/chinese-insurtech-giant-zhong-an-turns-its-back-on-a-us-ipo-2016-12"}
