{"authors":["John Hayward"],"date_download":"2018-10-30 19:33:49","date_modify":"2018-10-30 19:33:49","date_publish":"2017-04-12 00:27:34","description":"China sent fully-loaded North Korean cargo ships home and deployed 150,000 troops to the North Korean border this week.","filename":"data/vaneerConsumption/ChinaBeefsUpNorthKoreanBorderRejectsCoalShipmentsasUSPresenceGrowsNearby.json","image_url":"https://media.breitbart.com/media/2017/04/chinese-soldiers-flag-china-military-drill-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_04_11__1540928029.html","title":"China Beefs Up North Korean Border, Rejects Coal Shipments as U.S. Presence Grows Nearby","title_page":"China Beefs Up North Korean Border, Rejects Coal Shipments as U.S. Presence Grows Nearby","title_rss":"NULL","source_domain":"breitbart.com","text":"China sent fully-loaded North Korean cargo ships home and deployed 150,000 troops to the North Korean border this week, even as a U.S. carrier group approached the Korean peninsula and Pyongyang issued threats ranging up to nuclear war.\nMany observers described President Trump’s strike on Syria after a chemical weapons attack as the cause of increased North Korean tensions, combined with the possibility of impending North Korean nuclear or missile tests and China’s evident loss of patience with its feral client state.\nThe 105th birthday of the Kim regime’s founder Kim Il-sung is coming up this weekend and may be seen as an opportune moment for military provocation by current dictator Kim Jong-un.\nSome skeptical observers wonder if China’s February ban on imported North Korean coal was mostly symbolic, and the North Koreans themselves sought to downplay its impact, but China appeared to be keeping its word.\nReuters reported on Tuesday that a fleet of North Korean cargo ships was sent home, most of them still loaded with coal, following an April 7 order from the Chinese customs department to refuse deliveries. About 2 million tons of coal is said to be blocked by the customs order.\nAs Reuters observes, April 7 just happens to be the day Chinese President Xi Jinping discussed North Korea with President Trump at Trump’s estate in Florida. China has been making up the shortfall of North Korean coal by purchasing it from the United States and Russia. The opportunity for U.S. coal was made even greater by weather problems in Australia’s coal region.\nSecretary of State Rex Tillerson said China understands the danger of North Korea’s nuclear ambitions on Sunday’s edition of CBS’s Face the Nation.\n“I think even China is beginning to recognize that this presents a threat to even China’s interests. President Xi clearly understands, and I think agrees, that the situation has intensified and has reached a certain level of threat that action has to be taken,” Tillerson said.\nChina has also reportedly deployed 150,000 troops along the North Korean border, ostensibly to stem the refugee tide and respond to North Korean military movements if President Trump orders an attack on the regime of Kim Jong-un.\nThere have been questions about the accuracy of the reports on Chinese troop deployment. The Australian notes the odd detail that China’s Communist Party publication, the Global Times, published an account of the deployment sourced entirely from South Korean media rather than tapping Chinese sources or state-run news organizations.\nThese South Korean reports described medical units were included in the Chinese deployment, presumably to handle refugees. The South Korean Defense Ministry sought to downplay the rumors of “an April crisis on the peninsula.”\nPresident Trump said on Tuesday that he told President Xi “a trade deal with the U.S. will be far better for them if they solve the North Korean problem.\n“North Korea is looking for trouble. If China decides to help, that would be great. If not, we will solve the problem without them. U.S.A.,” the president added, writing on Twitter as he often does.\nNorth Korea’s response was characteristically belligerent. “We will hold the US wholly accountable for the catastrophic consequences to be entailed by its outrageous actions,” the Foreign Ministry declared, referring to the arrival of the aircraft carrier USS Carl Vinson and its strike group.\n“The DPRK is ready to react to any mode of war desired by the US,” said the Foreign Ministry, claiming that the Vinson’s approach demonstrated that America’s “reckless moves for invading had reached a serious phase.”\nNorth Korea’s state newspaper suggested nuclear war might be on tap: “Our revolutionary strong army is keenly watching every move by enemy elements with our nuclear sight focused on the U.S. invasionary bases not only in South Korea and the Pacific operation theater but also in the U.S. mainland.”\nThe Navy Times notes that over the weekend, “the head of U.S. forces in the Pacific made the unusual move of announcing that he was canceling planned port visits in Australia for Vinson and her escorts and redeploying the carrier to the waters near the Korean Peninsula.”\nU.S. officials said the move was intended to “send a message to both nervous allies and to the North Korean regime.”\nAside from its ban on North Korean coal, China has generally emphasized negotiations and a peaceful resolution to the North Korean crisis. Chinese state media both warned Pyongyang against further nuclear tests and expressed concern about the Vinson deployment as “an act that could heighten tensions.”","url":"https://www.breitbart.com/national-security/2017/04/11/tensions-mount-between-china-north-korea-and-the-united-states/"}
