{"authors":[],"date_download":"2018-10-22 22:14:03","date_modify":"2018-10-22 22:14:03","date_publish":"2014-06-09 12:43:15","description":"If the proposal is approved, such facilities would provide China with a stronger hub from which to project its naval and air strength.","filename":"data/vaneerConsumption/ChinaMayBuildArtificialIslandinDisputedWaters.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/495976/140609-china-philippines-islands-reef-8a_5770edea0c7c7be81c4108d23b905e61.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_china-may-build-artificial-island-disputed-waters-n126101_1540246443.html","title":"China May Build 'Artificial Island' in Disputed Waters","title_page":"China May Build 'Artificial Island' in Disputed Waters","title_rss":"NULL","source_domain":"nbcnews.com","text":"That installation, located in the hotly contested Fiery Cross Reef – which China, Vietnam and the Philippines all claim – is already home to a Chinese observation post which provides logistical support for Chinese military assets in the region. In the article, Li Jie, a naval expert at the Chinese Naval Research Institute explained that the expansion plans could possibly include the construction of an airstrip and port.\nIf the proposal is approved, such facilities would provide China with a stronger hub from which to project its naval and air strength over other claimants in the region. In the last year, China has more aggressively pursued its claims in the region, reportedly starting construction of an airfield on an island claimed by the Philippines and most recently moving an oil rig into waters within Vietnam’s 200-nautical-mile exclusive economic zone.\nBeijing’s moves infuriated both countries and led to anti-China protests. The demonstrations in Vietnam turned into deadly rioting that forced China to evacuate thousands of their citizens from the country last month.","url":"https://www.nbcnews.com/news/world/china-may-build-artificial-island-disputed-waters-n126101"}
