{"authors":["Tracy You For Mailonline"],"date_download":"2018-10-23 03:21:53","date_modify":"2018-10-23 03:21:53","date_publish":"2017-03-16 14:10:32","description":"Zhang Mengqiu, from China, has taught his pet dogs to perform stunts to please his elderly father. He is praised for his 'filial devotion' in China, but animal lovers have voiced concerns over his dogs.","filename":"data/vaneerConsumption/Chinesemantrainshisdogstowalktightropes.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E5380F300000578-0-image-a-32_1489671000734.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320246_Man-trains-dogs-walk-tightropes-entertain-father_1540264913.html","title":"Chinese man trains his dogs to walk tightropes","title_page":"Chinese man trains his dogs to walk tightropes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"We all want our parents to be happy, but this man from China has stirred controversy for the entertainment he prepares for his elderly father - despite his good intention.\nZhang Mengqiu, from China's Hebei Province, has taught his pet dogs to perform tightrope walking in order to please his 85-year-old father, reported Chinese media.\nMengqiu bought two dogs and trained them to do stunts after his wheelchair-bound father had expressed his liking for watching canines walking tightropes.\nScroll down for video\nZhang Mengqiu, from China's Hebei Province, has trained his dogs to walk tightropes\nThe man said he had taught the pets to perform stunt so that they could entertain his father\nZhang Mengqiu lives in the village of Xiaozhuang in Wuqiang county, Heshui city, according to a report on QQ.com.\nHis father, Zhang Yukun, was a renowned calligrapher in the region.\nThe elderly man became paralysed in 2012. Yunkun had been devastated by his wife's death in the same year and suffered a stroke, which caused him to lose the ability to move his limbs.\nIn order to look after his father, Mengqiu quit his job five years ago.\nHe feeds his father and helps him practise walking every day. He also learned various Chinese traditional medicine therapies, such as cupping and acupuncture, and applies them on his father.\nZhang Yukun (pictured) enjoyed watching canines performing stunts on TV, so Mengqiu bought two dogs (one of them pictured) and trained them up\nYukun became depressed after the family's pet dog had gone missing. To cheer him up, Mengqiu bought two Belgian Malinois dogs in 2015 to accompany the elderly man and to cheer him up.\nMengqiu told Hubei TV Station that his father liked watching dogs walking tightropes on TV. As a result, he trained the two dogs to perform the stunt so that his father could have the entertainment every afternoon in the courtyard.\nThe man claimed to have taught his dogs other stunts, including sitting up straight, climbing stairs and jumping over walls.\nApparently, Mengqiu has risen to fame in China for his devotion.\nNot only is he praised by his neighbours for the great lengths he had gone to in order to look after his father; the man is also billed as a 'filial son' by the local Hebei TV Station because he has brought 'enjoyment' to his father's life.\nOne of his neighbour told Hubei TV Station: 'Nobody in the village says bad things about him. Everyone praises him to be such a good son.'\nFurthermore, China Central Television Station has made a documentary about Mengqiu and his rope-walking dogs to promote his dedication in carrying out his duty as a child.\nMengqiu has taken care of his father for five years. He feeds his father and helps him practise walking every day\nDespite Mengqiu's national fame in China, animal lovers have voiced concerns over the well-being of his dogs.\nWendy Higgins from Humane Society International appreciated Mengqiu's intention and called it 'honourable'.\nHowever, Ms Higgins said the fact Mengqiu wants to make his ill father laugh doesn't make the dogs suffer less due to the training and performing.\nShe told MailOnline: 'No dog would walk a tightrope willingly, so punishment or fear-based training is likely to have been used.\n'[This] means that these dogs have probably suffered mental anguish and endured physical pain, such as sore or cut paws.'\nMs Higgins also pointed out that subjecting animals to such an ordeal should 'make us cry, not laugh'.\nAnimals Asia also recognised Mengqiu's dedication and called him a 'devoted son'. But the Hong Kong-based charity organisation also said Mengqiu's story is a good example of why education of animal welfare is 'so necessary' in China.\nJill Robinson MBE, the Founder and CEO of Animals Asia, told MailOnline: 'Zhang Mengqiu is in no way a bad guy, but his actions could - unbeknown to him - be harming the welfare of these dogs. '\nMs Robinson added: 'There are many more suitable ways to bond, such as simply throwing a ball for them.\n'They get the exercise and Zhang Mengqiu's father gets the positivity of seeing a happy beautiful animal behaving naturally.'","url":"https://www.dailymail.co.uk/news/article-4320246/Man-trains-dogs-walk-tightropes-entertain-father.html"}
