{"authors":[],"date_download":"2018-10-22 20:52:40","date_modify":"2018-10-22 20:52:40","date_publish":"2016-01-29 04:20:26","description":"A Chinese ship is set to join the search for Malaysia Airlines MH370, Australia's deputy prime minister said Friday, as the jet's fate remains a mystery almo...","filename":"data/vaneerConsumption/ChineseshiptojoinAustralialedsearchforMH370.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h6ya-3bmscybNe842cce83474b5010dec-591_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422176_Chinese-ship-join-Australia-led-search-MH370_1540241560.html","title":"Chinese ship to join Australia-led search for MH370","title_page":"Chinese ship to join Australia-led search for MH370 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Chinese ship to join Australia-led search for MH370\nA Chinese ship is set to join the search for Malaysia Airlines MH370, Australia's deputy prime minister said Friday, as the jet's fate remains a mystery almost two years after it vanished.\nThe Dong Hai Jiu 101 will join three other vessels contracted from Dutch firm Fugro -- Fugro Discovery, Fugro Equator and Havila Harmony -- currently scouring the depths of the southern Indian Ocean off Western Australia where the plane is believed to have crashed after diverting from its flight path.\nCarrying 239 passengers and crew, the plane disappeared during a Kuala Lumpur-Beijing flight on March 8, 2014.\nA mural representing the missing Malaysia Airlines flight MH370 pictured in Shah Alam, Kuala Lumpur ©Mohd Rasfan (AFP/File)\nSo far, only a two-metre-long (almost seven-foot) flaperon wing part that washed up on a beach on the Indian Ocean island of Reunion in July has been confirmed to have come from aircraft.\n\"The ship, offered to Prime Minister Malcolm Turnbull by Premier Li Keqiang of the People's Republic of China in November 2015, will undertake search operations in the southern Indian Ocean,\" Deputy Prime Minister Warren Truss said in a statement.\n\"The total value of the contribution by the People's Republic of China, including the ship, is around Aus$20 million (US$14 million).\"\nTruss said the Chinese vessel would be equipped with a six-kilometre (3.7-mile) long towed sonar system, which searchers will use to take a closer look at the rugged seabed.\nDong Hai Jiu 101 is set to depart Singapore for Australia on Sunday and join the hunt -- which has so far covered 85,000 square kilometres (32,820 square miles) of the 120,000 square kilometres search zone -- in late February, Truss added.\nAustralian authorities have said that if after the 120,000 square kilometres is scoured and there are no new leads to pinpoint the location of the missing aircraft, the search zone would not be expanded.","url":"https://www.dailymail.co.uk/wires/afp/article-3422176/Chinese-ship-join-Australia-led-search-MH370.html"}
