{"authors":["Will Martin"],"date_download":"2018-10-30 23:29:56","date_modify":"2018-10-30 23:29:56","date_publish":"2018-07-19 00:00:00","description":"BI Prime: Writing in his weekly Global Strategy note to clients on Thursday, Edwards argues that the growing trade conflict between the USA and China (and to some extent the European Union) is pulling focus from other issues that could have an event more marked impact on global growth.","filename":"data/vaneerConsumption/ChinaisaloomingthreattoglobaleconomyAlbertEdwardssays.json","image_url":"https://amp.businessinsider.com/images/5b5093c9bbb8831e008b4797-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_china-looming-threat-to-global-economy-albert-edwards-societe-generale-2018-7_1540942196.html","title":"China is a looming threat to global economy, Albert Edwards says","title_page":"    China is a looming threat to global economy, Albert Edwards says - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A man dressed like an ancient Chinese emperor sits in a pool in between waitresses dressed like imperial palace maids at a bathhouse during its opening ceremony in Shangtang township, Henan province. Reuters/China Daily CDIC\nFinancial market investors are \"bathing in complacency\" and are allowing themselves to be distracted from a huge issue that threatens global growth \"lurking just beneath the surface,\" according to the notoriously bearish Societe Generale strategist Albert Edwards.\nWriting in his weekly Global Strategy note to clients on Thursday, Edwards argues the growing trade conflict between the USA and China— and to some extent the European Union — is pulling focus from other issues that could have a more marked impact on global growth.\nQuoting a recent report from the International Monetary Fund that said markets are currently \"susceptible to sudden re-pricing if growth and expected corporate profits stall,\" Edwards identified a potential shock to markets in the near future — the very real prospect of growth in China slowing markedly.\nEdwards, who has long warned clients to be particularly vigilant about economic developments in China, said that recent data coming out of the world's second-largest economy should be of much greater worry to the markets than it seems to be right now.\n\"As we have often stated, investors ignore economic and market developments in China at their peril,\" he said, noting that many investors are focused on China right now, but only because of fears about what the rising trade conflict could do to global growth.\nHere's the key extract from the note (emphasis ours):\n\"This [the trade war] just diverted investor attention from the worryingly weak slew of economic data China published over the past few months, but the sudden renewed weakness in the renminbi has now refocused investor attention where it ought to be. We are not alone in thinking slowing Chinese growth should be near the top of investors' key concerns.\"\nCiting the work of his Societe Generale colleague Wei Yao, Edwards suggests that \"real economic pain is beginning to surface.\" As evidence, he points to tightening credit conditions along with the fact that nominal GDP growth slowed to less than 10% year-on-year at the latest reading.\nSociete Generale\nIf that economic pain continues, Edwards argues, a real slowdown in China could begin to materialize, bringing with it a stall in global growth, and a major shock to financial markets.\nEdwards comments come on the same day the Chinese yuan hit its lowest level against the dollar in a year. The USD/CNY, or onshore traded yuan, currently sits at 6.7824, the highest level since July last year. The higher the dollar in this pairing, the weaker the yuan\nReturning to the work of the IMF, Edwards said that beyond the headline news that the fund had cut growth forecasts for Germany, France, Italy, Japan, and the UK, the more interesting part of it's economic outlook were its \"warnings on complacency in financial markets.\"\nHere's the key extract from the IMF (emphasis ours):\n\"Financial markets seem broadly complacent in the face of these contingencies, with e levated valuations and compressed spreads in many countries. At the same time, however, high levels of public and private debt create widespread vulnerability. Asset prices are no doubt buoyed, not only by easy financial conditions, but by the generally still satisfactory global growth picture. They therefore are s usceptible to sudden re-pricing if growth and expected corporate profits stall.\"\nThat, Edwards says, is \"the danger that lurks just beneath the surface.\"","url":"https://www.businessinsider.com/china-looming-threat-to-global-economy-albert-edwards-societe-generale-2018-7"}
