{"authors":["John Hayward"],"date_download":"2018-10-30 20:43:21","date_modify":"2018-10-30 20:43:21","date_publish":"2018-07-04 17:45:47","description":"A Chinese city gave the Communist Party an unusual \"gift\" on its 97th birthday: a train filled with President Xi Jinping's propaganda.","filename":"data/vaneerConsumption/ChineseCityLoadsUrbanTrainwithXiJinpingPropaganda.json","image_url":"https://media.breitbart.com/media/2018/05/wi/afp/25/8806d8_chinese-president-xi-jinping-finally-meet-kim-jong-un-year-time-north-korean-e1530726028527.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_07_04__1540932201.html","title":"Chinese City Loads Urban Train with Xi Jinping Propaganda","title_page":"Chinese City Loads Urban Train with Xi Jinping Propaganda","title_rss":"NULL","source_domain":"breitbart.com","text":"The city of Changchun in northeastern China offered an unusual “gift” to the Communist Party on its 97th birthday: a train festooned with quotes from President-for-Life Xi Jinping and crewed by rappers who preach Xi’s ideology to the beat of bamboo instruments.\nThe South China Morning Post cheekily describes the attraction as “Xi Jinping’s Train of Thought” and quotes the government’s description of it as a rolling “condensed spiritual manual” for communist travelers. To be honest, they do not look like they are achieving enlightenment or having much fun in the photos accompanying the article. The train’s interior is an ugly blood red, festooned with Xi’s precious thoughts in gold leaf. It makes the passengers look like they are being digested rather than transported.\nThe SCMP puts the Train of Thought in context as one example of the pervasive Xi propaganda flooding every aspect of Chinese life, creating a cult of personality without equal since the days of Mao Tse-tung. The Maoist cult killed a horrifying number of people and impoverished China, putting the country in a nose dive that was corrected by the reforms of President Deng Xiaoping in the Eighties and Nineties. It is not comforting to see the pendulum swinging back around to absolute rule and cults of personality again.\nJonathan Sullivan of the China Policy Institute at the University of Nottingham told the SCMP that Xi’s personality cult was disturbing but less dangerous than the religious frenzy around Mao.\n“Mao was venerated for his thought. Indeed, his every utterance was elevated to the status of scripture, with shrine-like portraits of him in every home and the ‘little red book’ memorized like a Bible. Xi Jinping does not command that kind of religious devotion,” Sullivan judged.\nMaybe Xi does not have a Little Red Book, but he now has a Little Red Train.","url":"https://www.breitbart.com/national-security/2018/07/04/chinese-city-loads-train-xi-jinping-propaganda/"}
