{"authors":["Chloe Lyme For Mailonline"],"date_download":"2018-10-23 02:38:37","date_modify":"2018-10-23 02:38:37","date_publish":"2016-01-29 17:14:34","description":"A woman had three wheels removed from a car in central China after the owner, who owed her money, failed to show up. Pictures of the abandoned vehicle on some bricks were taken yesterday.","filename":"data/vaneerConsumption/Chinesemoneylenderstealswheelsfromcarandleavesanangrypublicmessage.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30B0959400000578-0-image-a-21_1454086960275.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_peoplesdaily_article-3423113_She-s-wheel-ly-angry-Money-loaner-fails-borrower-parts-car-vandalised-leaving-vehicle-suspended-bricks_1540262317.html","title":"Chinese money lender steals wheels from car and leaves an angry public message","title_page":"Chinese money lender steals wheels from car and leaves an angry public message | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A woman had three wheels removed from a car in central China after the owner, who owed her money, failed to show up.\nPictures of the abandoned vehicle raised on some bricks were taken yesterday morning next to a hotel in Weinan city, Shaanxi Province.\nThe owner of the green Toyota, allegedly owes the woman name Ms Zhou, 100,000 Yuan (£10,712), reports the People's Daily Online.\nAngry: Car vandalized with a sign that reads'owner of the car doesn't pay debt' pictured yesterday in China\nPayback: Woman was hoping the person who owed her money would eventually return to their car, but didn't\nAs well as having the wheels removed, Ms Zhou placed a massive sign on the car that read: 'Owner of the car doesn't pay debt.'\nStaff at the hotel said the car had been left parked on the sidewalk of Cangcheng Road since January 20, and the wheels were removed four days ago.\nEven after the car was vandalised, the owner still did not show up.\nThe two were heard having a dispute over money a few days before the wheels were taken off.\nAccording to the report, traffic police arrived at the scene, but they did not do anything about the vehicle and are yet to locate the owner of the car.\nHigh price: The owner of the green Toyota, allegedly owes the woman name Ms Zhou, 100,000 Yuan (£10,712)\nMs Zhao spoke to local reporters and said: 'I found the car was parked by the road and kept an eye on it for four days in order to find the owner. However, that person never turned up.\n'I had no choice but to take off the wheels and hope this could force the owner to appear.\nHowever, four days after the parts were taken off, still no one showed up. And I had to hire people to look after the car.'\nA police officer handing the case said Ms Zhao admitted her son had removed the wheels from the car because of money disputes.\nThe police urged both parties to find a judicial solution as spoon a s possible.","url":"https://www.dailymail.co.uk/news/peoplesdaily/article-3423113/She-s-wheel-ly-angry-Money-loaner-fails-borrower-parts-car-vandalised-leaving-vehicle-suspended-bricks.html"}
