{"authors":["Associated Press"],"date_download":"2018-10-22 22:43:12","date_modify":"2018-10-22 22:43:12","date_publish":"2017-04-26 05:25:21","description":"BEIJING (AP) - The newborn fawn walks unsteadily among the trees that were once part of the Chinese emperor's hunting grounds, where more than a century...","filename":"data/vaneerConsumption/Chinasraremiludeerreturninvictoryforconservation.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/11/wire-464505-1493202330-944_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446234_Chinas-rare-milu-deer-return-victory-conservation_1540248192.html","title":"China's rare milu deer return in victory for conservation","title_page":"China's rare milu deer return in victory for conservation | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BEIJING (AP) - The newborn fawn walks unsteadily among the trees that were once part of the Chinese emperor's hunting grounds, where more than a century before its forebears died out in their native China.\nThis April marks the start of the birthing season for the milu deer, which has long been famed as having the head of a horse, the hooves of a cow, the tail of a donkey and the antlers of a deer. As the herds across China grow each spring, they mark a rare conservation success story in a country suffering from pollution and other environmental challenges.\n\"Our protection of the milu is about protecting our living cultural heritage and natural heritage,\" said Guo Geng, vice director of the Beijing Milu Ecological Research Center, where they expect about 30 fawns this year. Known as Pere David's Deer in the West, the milu's significance to Chinese culture is embodied in its appearance in ancient Chinese poems and writings.\nIn this April 10, 2017 photo, Milu deers wrestle with their antlers at the Beijing Milu Ecological Research Center. Said to appear as an amalgam of four animals, the species was saved from extinction and brought back to its homeland as part of an unlikely tale involving a French missionary, an English duke and a Slovak-born zoologist. (AP Photo/Ng Han Guan)\n\"But if, outside of books, they become extinct, then the next generation will be extremely regretful,\" said Guo.\nToday, there are about 5,500 milu deer in China, with as many as 600 living in the wild in Hubei and Hunan provinces along the Yangtze River. How the species was spared from extinction is an unlikely tale spanning lifetimes and involving a French missionary, an English duke and a Slovak-born American zoologist.\nThe deer, which had roamed China's marshlands for thousands of years, were among the animals brought from around China to live within the emperor's hunting grounds in what is now the south of Beijing during the Yuan, Ming and Qing dynasties. The number of milu deer living in the wild waned due to loss of habitat, before finally dying out in 1900 in the hunting grounds, which were flooded and then overtaken by soldiers from the eight nations brought in to suppress the Boxer Rebellion and who slaughtered the deer for food.\nThe first break for the species was decades earlier in 1865, when the French missionary, Father Armand David, introduced the species to the West, enabling it to make its way into European zoos. Then, in the same years the final milu deer were dying in China, the 11th Duke of Bedford, an English politician who had an interest in zoology and conservation, took note and gathered 18 on his estate in England to create what became the world's only surviving herd.\nFast forward to the 1980s, and Slovak-born American zoologist Maria Boyd had taken an interest in the milu deer. Boyd's late husband happened to be friends with an important source: the 14th Duke of Bedford, or the great-grandson of the man who saved the herd. In 1985, the duke tasked Boyd with reintroducing 37 deer to China, and she chose the spot where they had last been seen alive in their native country.\nThe late Boyd wrote an account documenting the re-introduction, drawing on documents kept in five suitcases over the years, including the 9,290 British pound sterling invoice from Air France for the flight that transported the first batch of 22 deer. Her surviving partner is co-writing the book and expects it to be published in China this summer.\nBoyd initially planned to stay in China only until the reintroduction project was completed, but was still living here when she died from cancer last year at age 72.\n\"She would not let the deer go,\" said her partner, Dominic Bauquis, from France.\nGiven her love for the milu and its \"beautiful story\" of surviving against the odds, Boyd had expected it to be picked as a mascot for the 2008 Beijing Summer Olympics, Bauquis said. It lost out to other animals, including the much more famous panda. When she died, Boyd was holding out hope for the 2022 Beijing Winter Olympics.\n\"The panda doesn't have such rich experience across the world,\" said Guo.\n___\nThis story has been corrected to change spelling of partner's name to Dominic Bauquis from Dominic Bacquis.\nIn this April 10, 2017 photo, female Milu deers tend to fawns at the Beijing Milu Ecological Research Center. Said to appear as an amalgam of four animals, the species was saved from extinction and brought back to its homeland as part of an unlikely tale involving a French missionary, an English duke and a Slovak-born zoologist. (AP Photo/Ng Han Guan)\nIn this April 10, 2017 photo, a fawn test the waters at the Beijing Milu Ecological Research Center. Said to appear as an amalgam of four animals, the species was saved from extinction and brought back to its homeland as part of an unlikely tale involving a French missionary, an English duke and a Slovak-born zoologist. (AP Photo/Ng Han Guan)\nIn this April 10, 2017 photo, female Milu deers tend to fawns at the Beijing Milu Ecological Research Center. Said to appear as an amalgam of four animals, the species was saved from extinction and brought back to its homeland as part of an unlikely tale involving a French missionary, an English duke and a Slovak-born zoologist. (AP Photo/Ng Han Guan)\nIn this April 10, 2017 photo, a female Milu deer tends to a fawn at the Beijing Milu Ecological Research Center. Said to appear as an amalgam of four animals, the species was saved from extinction and brought back to its homeland as part of an unlikely tale involving a French missionary, an English duke and a Slovak-born zoologist. (AP Photo/Ng Han Guan)\nIn this April 10, 2017 photo, female Milu deers guide a fawn crossing a stream at the Beijing Milu Ecological Research Center. Said to appear as an amalgam of four animals, the species was saved from extinction and brought back to its homeland as part of an unlikely tale involving a French missionary, an English duke and a Slovak-born zoologist. (AP Photo/Ng Han Guan)\nIn this April 10, 2017 photo, Milu deers gather during feeding time at the Beijing Milu Ecological Research Center. Said to appear as an amalgam of four animals, the species was saved from extinction and brought back to its homeland as part of an unlikely tale involving a French missionary, an English duke and a Slovak-born zoologist. (AP Photo/Ng Han Guan)\nIn this photo taken April 10, 2017, a Milu deer with bloodied antlers from shedding at the Beijing Milu Ecological Research Center. Said to appear as an amalgam of four animals, the species was saved from extinction and brought back to its homeland as part of an unlikely tale involving a French missionary, an English duke and a Slovak-born zoologist. (AP Photo/Ng Han Guan)\nIn this April 10, 2017 photo, a keeper rubs the ear of Xiao Bao, a Milu deer which is used to human contact from being raised by humans after her mother abandoned her as a baby at the Beijing Milu Ecological Research Center. Said to appear as an amalgam of four animals, the species was saved from extinction and brought back to its homeland as part of an unlikely tale involving a French missionary, an English duke and a Slovak-born zoologist. (AP Photo/Ng Han Guan)\nIn this April 10, 2017 photo, Milu deers gather during feeding time at the Beijing Milu Ecological Research Center. Said to appear as an amalgam of four animals, the species was saved from extinction and brought back to its homeland as part of an unlikely tale involving a French missionary, an English duke and a Slovak-born zoologist. (AP Photo/Ng Han Guan)\nIn this April 10, 2017 photo, a keeper looks Xiao Bao, a Milu deer which is used to human contact from being raised by humans when her mother abandoned her at the Beijing Milu Ecological Research Center. Said to appear as an amalgam of four animals, the species was saved from extinction and brought back to its homeland as part of an unlikely tale involving a French missionary, an English duke and a Slovak-born zoologist. (AP Photo/Ng Han Guan)\nIn this April 10, 2017 photo, Guo Geng, vice director of the Beijing Milu Ecological Research Center talks about the Milu deer at the center in Beijing. Said to appear as an amalgam of four animals, the species was saved from extinction and brought back to its homeland as part of an unlikely tale involving a French missionary, an English duke and a Slovak-born zoologist. (AP Photo/Ng Han Guan)\nIn this April 10, 2017 photo, Guo Geng, vice director of the Beijing Milu Ecological Research Center talks about the Milu deer at the center in Beijing. Said to appear as an amalgam of four animals, the species was saved from extinction and brought back to its homeland as part of an unlikely tale involving a French missionary, an English duke and a Slovak-born zoologist. (AP Photo/Ng Han Guan)\nIn this April 10, 2017 photo, Dominic Bauquis talks about the work of his partner Maria Boyd during an interview at the Beijing Milu Ecological Research Center. Boyd, wrote an account before she died last year documenting the reintroduction of the Milu deer back to China and her fervent hope that it could become the mascot of the 2022 Beijing Winter Olympics. Her surviving partner Bauquis is co-writing the book and expects it to be published in China this summer. (AP Photo/Ng Han Guan)\nIn this April 10, 2017 photo, Dominic Bauquis holds up a book with one of the first painting depicting the Milu deer also known as the Pere David deer during an interview at the Beijing Milu Ecological Research Center. His partner Maria Boyd, wrote an account before she died last year documenting the reintroduction of the Milu deer back to China and her fervent hope that it could become the mascot of the 2022 Beijing Winter Olympics. Bauquis is co-writing the book and expects it to be published in China this summer. (AP Photo/Ng Han Guan)\nIn this April 10, 2017 photo, Dominic Bauquis talks about the work of his partner Maria Boyd during an interview at the Beijing Milu Ecological Research Center. Boyd, wrote an account before she died last year documenting the reintroduction of the Milu deer back to China and her fervent hope that it could become the mascot of the 2022 Beijing Winter Olympics. Her surviving partner Bauquis is co-writing the book and expects it to be published in China this summer. (AP Photo/Ng Han Guan)\nIn this April 10, 2017 photo, a photo of the late Maria Boyd is seen amongst documents presented by her partner Dominic Bauquis during an interview at the Beijing Milu Ecological Research Center. Boyd, wrote an account before she died last year documenting the reintroduction of the Milu deer back to China and her fervent hope that it could become the mascot of the 2022 Beijing Winter Olympics. Her surviving partner Bauquis is co-writing the book and expects it to be published in China this summer. (AP Photo/Ng Han Guan)","url":"https://www.dailymail.co.uk/wires/ap/article-4446234/Chinas-rare-milu-deer-return-victory-conservation.html"}
