{"authors":["Tiffany Lo For Mailonline"],"date_download":"2018-10-23 04:05:48","date_modify":"2018-10-23 04:05:48","date_publish":"2017-03-16 15:15:35","description":"Video footage taken in eastern China emerged yesterday showing 43-year-old Song Tao inserting buttons into his eyes and lifting the two buckets of water using a rope","filename":"data/vaneerConsumption/Chineseacrobatlifts22lbwaterbucketsbyhiseyelids.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E53BE8C00000578-0-image-a-21_1489665808372.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319770_Chinese-acrobat-lifts-22-lb-water-buckets-eyelids_1540267548.html","title":"Chinese acrobat lifts 22-lb water buckets by his eyelids","title_page":"Chinese acrobat lifts 22-lb water buckets by his eyelids | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is an incredible moment when a man lifts buckets with 22 pounds of water using just his eyelids.\nVideo footage taken in eastern China emerged yesterday showing 43-year-old Song Tao inserting buttons into his eyes and lifting the two buckets of water using a rope.\nHis act was nominated in the provincial intangible cultural heritage list of Shandong Province in 2007.\nSong Tao, 43, can lift up two buckets of water weighing 22 pounds using only his eyelids\nA teacher once taught him to practise by inserting a button into his eye before going to bed\nSong performed in Guangxi province as a dancer before learning this act.\nHe told reporters that a teacher told him to put a button into his eyes every night before sleep as practice.\nHis first performance was in 1991 and all he needs is a rope with two buttons tied to one end and hooks tied at the other end.\n'I sterilise the buttons every time before a performance, so I won't get infections in my eyes,' said Song.\nSong also sterilised the coin-size button every time before performances to prevent infection\nDo not follow! Putting buttons inside his eyes can be painful and makes his eyes water\nHis bizarre act was in Shandong's provincial intangible cultural heritage list in 2007\nThe acrobat told the reporters that putting buttons inside his eyes can be painful and makes his eyes water.\n'Please do not follow this act at home, this is dangerous if you have not practised properly or under supervision,' he added.\nAccording to Guinness World Records, Satyajit Hota from Turkey held a record of heaviest weight lifted with one eyelid in 2013.\nA video showed him achieving a weight lift of 3.40 kg (7 lb 8 oz) on the set of an Italian television programme 'Lo Show dei Record' in March 2012.","url":"https://www.dailymail.co.uk/news/article-4319770/Chinese-acrobat-lifts-22-lb-water-buckets-eyelids.html"}
