{"authors":["Frances Martel"],"date_download":"2018-10-30 20:36:30","date_modify":"2018-10-30 20:36:30","date_publish":"2016-05-04 18:19:48","description":"The Chinese government has sent folk singer Song Zuying to Fiery Cross Reef, a disputed territory in the South China Sea.","filename":"data/vaneerConsumption/ChineseFolkSingerPerformsinSpratlyIslands.json","image_url":"https://media.breitbart.com/media/2016/05/Chinese-Singer-Song-Zuying-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_05_04__1540931790.html","title":"Chinese Folk Singer Performs in Spratly Islands","title_page":"Chinese Folk Singer Performs in Spratly Islands","title_rss":"NULL","source_domain":"breitbart.com","text":"The Chinese government has sent folk singer Song Zuying to Fiery Cross Reef, a disputed territory in the South China Sea, to perform patriotic songs and begin a tour of the region titled “The People’s Army Advances.”\nFiery Cross Reef is located in the Spratly Islands, claimed by Vietnam and the Philippines. It is one of a number of reefs and rock China has been converting into artificial islands and arming with military equipment and facilities. Most recently, China landed a military aircraft on Fiery Cross Reef, alleging that it was necessary due to a medical emergency.\nSong Zuying landed on the first leg of the People’s Army Advances tour over the weekend, performing a full concert of patriotic songs in front of the Chinese military’s second-largest warship, the Kunlun Shan. She performed songs with titles such as “Ode to the South Sea Defenders,” and her musical performance reportedly included a variety of performers executing magic tricks and other entertainment for the soldiers stationed at the reef.\nThe South China Morning Post reports that Chinese state media featured at least one quote from a soldier, who described himself as “very excited.” The soldier, identified as Huang Tianqun, is quoted as saying, “We will definitely hold our ground here firmly, to defend each and every inch of the reef of our motherland.”\nThe Philippine Star adds that Chinese media is showcasing at least one other disputed territory – Cuarteron Reef – as a stop on Song’s tour. The images broadcast in Chinese media serve not only to display the singer, but the variety of military facilities already functional in the disputed territory.\nThe Chinese government has asserted dominion over the entire South China Sea, over the sovereign territories of the Philippines, Vietnam, Taiwan, Brunei, and Malaysia. Chinese ships’ presence near Natuna Island, which Beijing does not claim, has also alarmed the government of Indonesia, which has threatened to take the Chinese government to international court if it continues to trespass into Indonesian waters.\nThe government of the Philippines has filed a case before the Permanent Court of Arbitration at The Hague, which is expected to decide on the case later this year. The government of China has vowed to disregard any possible Hague verdict.\nChina has only just received international support over its claims. In late April, the government of Gambia issued a statement supporting Beijing’s claims in the South China Sea, more than 8,000 miles away. The communist governments of Laos and Cambodia have also recently issued statements supporting China, though they, too, make no claims in the region.\nThe Chinese government announced Wednesday that it would send three naval ships to a combat drill in the South China Sea, to be followed by two other missile destroyers. The article in state outlet Xinhua did not specify where in the region the warships would operate, but the government insisted such an exercise was “routine.”\nThese unilateral exercises were announced after the government of China committed to sending special forces troops to joint exercises with the Association of Southeast Nations (ASEAN) and the United States, a move interpreted as an attempt to win over ASEAN member nations into supporting the Chinese cause. The move also followed the revelation that the United States canceled a Freedom of Navigation Operation scheduled for April in an attempt to keep tensions between the two nations from growing uncontrollable. The last two such operations – in October 2015 and January of this year – triggered stern condemnation from Beijing.","url":"https://www.breitbart.com/national-security/2016/05/04/chinese-folk-singer-performs-in-spratly-islands/"}
