{"authors":[],"date_download":"2018-10-30 21:49:22","date_modify":"2018-10-30 21:49:22","date_publish":"2016-12-22 11:00:00","description":"Don’t let the holiday discourage you from going out this weekend!","filename":"data/vaneerConsumption/ChineseLanternParade5thingstodothisweekendinAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/MyAJC/2016/11/30/Images/photos.medleyphoto.12343248.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_chinese-lante_9e672d6b860a398225c0cbf273cfa30a__1540936162.html","title":"Chinese Lantern Parade: 5 things to do this weekend in Atlanta","title_page":"Chinese Lantern Parade: 5 things to do this weekend in Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"Don’t let the holiday discourage you from going out this weekend!\nWhile most people will spend Christmas Eve and Christmas day indoors with great food, family and friends, there are plenty of entertainment options for people who who are prone to cabin fever.\nHere are five things to do this weekend in metro Atlanta:\nIce Skating\nBond with loved ones on the ice rink.\nThere are several options for ice skating throughout metro Atlanta, including rinks at Avalon, Centennial Olympic Park and in the Marietta Square.\nThese rinks remain open on holidays, although some have special hours of operations.\nCheck out our Ice Skating guide to find the rink that is closest to you. Be sure to check their website for special holiday hours before you go!\nChinese Lantern Parade\nCentennial Olympic Park is currently hosting Atlanta’s first Chinese Lantern Festival as a part of an ongoing celebration of the park’s 20th anniversary. The festival includes handcrafted flowers, a three story pagoda and 200-foot-long Chinese dragon, and is open every night.\n6-11 p.m. Through Jan. 15 (tickets can be purchased up until 10 p.m.). $16 (adults), $12 (children). $12 (per person in a family of four) Centennial Olympic Park, at the corner of Andrew Young International Boulevard and Centennial Olympic Park Drive. https://centennialpark.freshtix.com.\nThe Atlanta festival began Dec. 9 and runs through Jan. 15. The festival is open from 6-11 p.m. each night. (Video by Branden Camp, edited by Erica A. Hernandez/AJC)\nKanye Saves Christmas\nThe description for this Dad’s Garage Theatre Company show emphasizes that “The real Kanye West will not be there. It will just be our poor impression of him.” Still, if you’re looking for a fun variety show to attend, this is a good option.\n10:30 p.m. Dec. 16. $14.00-$19.00. Dad’s Garage Theatre Company, 569 Ezzard St., Atlanta. Dadsgarage.com.\nNutcracker\nAtlanta Ballet’s annual production of The Nutcracker is certainly an Atlanta holiday tradition. Head to the Fox Theatre to see the collaboration with the Atlanta Ballet Orchestra through Christmas Eve.\nTimes vary. Through Dec. 24. $16.50-$105.50 (students), $21.50-$134.50 (adults). Fox Theatre, 660 Peachtree St., Atlanta. Foxtheatre.com.\nAtlantic Station’s Chanukah Menorah Lighting\nChabad Intown will light one branch of a life-size menorah every day in Atlantic Station between Dec. 24 to Jan. 1. Visit Central Park in the mixed-use community to view the menorah.\n10 a.m.-9 p.m. Dec. 24-Jan. 1. Central Park at Atlantic Station, 1380 Atlantic Dr., Atlanta. Atlanticstation.com.","url":"https://www.ajc.com/entertainment/chinese-lantern-parade-things-this-weekend-atlanta/tgcR6lRwIPOAgGdMLXW9TI/"}
