{"authors":[],"date_download":"2018-10-22 20:34:57","date_modify":"2018-10-22 20:34:57","date_publish":"2014-06-02 12:32:16","description":"Google services are being disrupted in China ahead of the 25th anniversary of the 1989 crackdown on demonstrators around Beijing's Tiananmen Square.","filename":"data/vaneerConsumption/ChinaDisruptsGoogleServicesAheadofTiananmenAnniversary.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2018_27/481011/140602-china-google-830a_17c831420f7f285a91cc55a84d613a0e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_china-disrupts-google-services-ahead-tiananmen-anniversary-n120121_1540240497.html","title":"China Disrupts Google Services Ahead of Tiananmen Anniversary","title_page":"China Disrupts Google Services Ahead of Tiananmen Anniversary","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBEIJING - Google services are being disrupted in China ahead of this week's 25th anniversary of the 1989 crackdown on pro-democracy demonstrators around Beijing's Tiananmen Square, a censorship watchdog said on Monday.\nGreatFire.org said in a blog post that the government appeared to have begun targeting Google Inc's main search engine and Gmail, among many other services, since at least last week, making them inaccessible to many users in China.\nIt added that the last time it monitored such a block was in 2012, when it only lasted 12 hours. \"It is not clear that the block is a temporary measure around the anniversary or a permanent block.\nBut because the block has lasted for four days, it's more likely that Google will be severely disrupted and barely usable from now on,\" the advocacy group said.\nAsked about the disruptions, a Google spokesman said: \"We've checked extensively and there's nothing wrong on our end.\"\nGoogle in 2010 moved its Chinese search engine service out of China, the world's second-largest economy, citing rampant censorship, and now operates it from Hong Kong.\nThe Chinese government already blocks the popular foreign websites Facebook, Twitter and Google's own YouTube.\nFor the ruling Communist Party, the 1989 demonstrations that clogged Tiananmen Square in Beijing and spread to other cities remain taboo, particularly on their 25th anniversary.\nThe government has detained several activists last month after attending a meeting about the protests, including prominent rights lawyer Pu Zhiqiang, prompting concern in the United States and Europe.\nThe anniversary of the date on which troops shot their way into central Beijing in 1989 has never been publicly marked in mainland China, though every year there are commemorations in Hong Kong.\nThe government has never released a death toll for the crackdown, but estimates from human rights groups and witnesses range from several hundred to several thousand.\nChina already has strict controls on what can be said online, and the government has been further tightening those restrictions.\nUsers of China's popular Twitter-like service Weibo sounded off about the Google blockage. \"Those officials are driving me crazy with this!\" wrote one user.\nReuters","url":"https://www.nbcnews.com/news/world/china-disrupts-google-services-ahead-tiananmen-anniversary-n120121"}
