{"authors":["David Scutt","Business Insider Australia"],"date_download":"2018-10-31 00:25:53","date_modify":"2018-10-31 00:25:53","date_publish":"2018-07-09 00:00:00","description":"Chinese inflationary pressures picked up in June — a signal that could have implications for the global inflation picture in the not too distant future","filename":"data/vaneerConsumption/Chinasinflationreportpointstoupwardpressureonpricesglobally.json","image_url":"https://amp.businessinsider.com/images/5b44277832245c2f008b4fa3-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_china-latest-inflation-report-july-2018-points-to-upward-pressure-on-prices-2018-7_1540945553.html","title":"China's inflation report points to upward pressure on prices globally","title_page":"    China's inflation report points to upward pressure on prices globally - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Yes, that way. Kevin Frayer/Getty Images\nChinese inflationary pressures picked up in June — a signal that could have implications for the global inflation picture in the not too distant future.\nAccording to China's National Bureau of Statistics (NBS), consumer price inflation (CPI) rose by 1.9% in the year to June, up from 1.8% in May.\nWhile in line with expectations, and the fastest annual expansion since March, the result was still well below the 3% level targeted by the People's Bank of China.\nThe NBS said non-food inflation was largely responsible for the increase over the year, increasing by 2.2%. In contrast, food inflation grew by just 0.3% over the same period.\nChina PPI (Red) and CPI (White) YY Thomson Reuters\nSuggesting that price pressures may build further in both China and abroad, the NBS said producer price inflation (PPI) grew by 4.7% over the year, an acceleration from the 4.1% increase seen in May.\nIt was the fastest year-on-year increase in six months, and well off the recent cyclical low of 3.1% struck in the year to March.\nWhile that points to building price pressures in downstream sectors in China, it could also have implications for inflationary pressures abroad.\nChinese PPI has a strong relationship to movements in US import prices, and US import prices tends to act as a lead indicator for CPI pressures in many major nations.\nShould that relationship hold firm in the months ahead, it points to building upside risks to global inflationary pressures, and the potential for tighter monetary policy settings from major central banks.","url":"https://www.businessinsider.com/china-latest-inflation-report-july-2018-points-to-upward-pressure-on-prices-2018-7"}
