{"authors":[],"date_download":"2018-10-22 23:12:31","date_modify":"2018-10-22 23:12:31","date_publish":"2017-04-26 06:56:30","description":"Chinese giants Guangzhou Evergrande are facing potential disciplinary action after their fans unfurled an anti-independence banner slamming \"British dogs\"...","filename":"data/vaneerConsumption/ChinafootballgiantsEvergrandeunderfireoverBritishdogsbanner.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/06/wire-463569-1493186191-432_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4446430_China-football-giants-Evergrande-fire-British-dogs-banner_1540249951.html","title":"China football giants Evergrande under fire over 'British dogs' banner","title_page":"China football giants Evergrande under fire over 'British dogs' banner | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fans of China's Guangzhou Evergrande chant slogans at supporters of Hong Kong's Eastern during an AFC Champions League football match between the two sides in Hong Kong\nChinese giants Guangzhou Evergrande are facing potential disciplinary action after their fans unfurled an anti-independence banner slamming \"British dogs\" during a game in Hong Kong.\nThe large banner, which said \"Annihilate British dogs, destroy HK independence poison\" in Chinese, was held up during Evergrande's 6-0 AFC Champions League win over Hong Kong's Eastern late on Tuesday.\nThe Asian Football Confederation said on Wednesday that it was waiting for the match commissioner's report before making a \"full assessment of the facts\".\nArticle 58 of the AFC's ethics code says clubs will be forced to play at least two games behind closed doors over any offensive \"words or actions\" by their fans concerning political opinions or national origin.\nIndividual spectators will be banned from stadiums for a minimum of two years for the offence, the code says.\nHong Kong's football association told AFP that it was looking into the banner, pictures of which were widely shared on social media.\nFormer British colony Hong Kong became a semi-autonomous Chinese territory 20 years ago, but independence feelings have been running high following mass protests against Beijing.\nTuesday's game was played in a hostile atmosphere in Mongkok, the scene of rioting last year which involved some pro-independence activists.\nFans from both sides hurled obscenities and showed each other the middle finger, with the Evergrande fans heard chanting \"Traitor!\"\nOne Eastern supporter displayed Hong Kong's colonial-era flag, which features Britain's Union Jack, while others booed and swore at the Chinese team.\nSome anti-China activists have begun to fly the old flag in protest at what is seen as Beijing's increased interference in the city.\nBut security was tight and the rival supporters were kept far apart as they were ushered in and out of the stadium through separate entrances.\nEvergrande, the two-time Asian champions and winners of the last six Chinese Super League titles, were in trouble with the AFC only last year.\nThe then defending champions were fined and forced to play their first Champions League game of the season behind closed doors for a string of offences, including wearing the wrong sponsor's name on their shirts during the 2015 final.\nThe coaches of both teams -- including Eastern's Chan Yuen-ting, the first female manager worldwide to lead a men's team into continental competition -- said they didn't see the \"British dogs\" banner.\n\"I was focused on the game, I didn't see what happened in the stands,\" said Evergrande's Luiz Felipe Scolari, who coached Brazil to the 2002 World Cup title.","url":"https://www.dailymail.co.uk/wires/afp/article-4446430/China-football-giants-Evergrande-fire-British-dogs-banner.html"}
