{"authors":["John Hayward"],"date_download":"2018-10-30 20:05:23","date_modify":"2018-10-30 20:05:23","date_publish":"2015-12-23 04:40:31","description":"China is considering new restrictions on its state-run media operations.","filename":"data/vaneerConsumption/ChinaCracksDownonTerrorismReporting.json","image_url":"https://media.breitbart.com/media/2015/12/china-anti-terrorism-police-exercise-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_12_22__1540929923.html","title":"China Cracks Down on Terrorism Reporting","title_page":"China Cracks Down on Terrorism Reporting","title_rss":"NULL","source_domain":"breitbart.com","text":"China is considering tough new restrictions on its state-run media operations, using a new anti-terrorism law that could be in effect by New Year’s Day.\nThe new law may also require exactly the sort of “back door” access to encrypted communications that social media companies have been loathe to give Western governments.\nAccording to Reuters, China’s new anti-terrorism law “includes a provision that media and social media cannot report on details of terror activities that might lead to imitation, nor show scenes that are ‘cruel and inhuman.'”\nExamples of such forbidden inhumanity include “details of hostages, how authorities have responded to terror incidents, or personal details of those on the scene.”\nThese measures are described as even tougher than existing policies that require the media to report the government’s official account of terrorist incidents without question. Reuters cites Chinese officials saying the new measures are needed because of a growing threat from militants and separatists in the West, such as the Uighur minority—a threat civil-rights groups say is exaggerated by Chinese officials looking for a pretext to suppress dissent.\n“The law raises serious concerns about restriction on freedom of expression, as the definition of terrorism in China is vague and broad,” said Amnesty International’s Patrick Poon, as quoted by DW.com. “It would expose NGOs and individuals who talk about terrorism-related issues such as the situation in Xinjiang Uighur Autonomous Region.”\nMoritz Rudolf of the Mercator Institute for China Studies told DW the definition of “terrorism” in China’s new law is extremely vague. In fact, it sounds awfully similar to the definition of “dissent,” including everything from “violence and sabotage” to “generating social panic.”\n“In accordance with the draft, a single tweet which causes an outcry on social media could be classified as an act of terrorism,” Rudolf pointed out.\nPoon brought up the case of human-rights lawyer Pu Zhiqiang, who was found guilty on Tuesday of “inciting ethnic hatred” and “picking quarrels and provoking trouble,” receiving a three-year suspended sentence. Under the new law, that would be considered exceptional leniency.\nBeijing’s interest in back doors and encryption keys is also disturbing, so much so that President Obama asked Chinese President Xi Jinping to consider changing those requirements. China has argued that Western governments also desire such backdoor access to secure communication systems but, thus far, companies like Apple have rebuffed those demands, in some cases explaining they have no master “encryption key” that could be tendered to government officials, even if they wanted to comply.\nThey might find it much harder to say “no” to China, which has not been shy about threatening to block access to its huge consumer market unless its demands are met. It would be an unpleasant twist if the vigorous argument between privacy and national security in the West is unilaterally settled by Beijing bluntly informing media companies they’ll be barred from doing business in China unless they had over encryption keys.\nAnother criticism of China’s new security law comes from VentureBeat, which cites arguments from Western government officials and business lobbies that China will combine these tougher security requirements with “new draft banking and insurance rules and a slew of anti-trust investigations” to exert “unfair regulatory pressure targeting foreign companies.”","url":"https://www.breitbart.com/national-security/2015/12/22/china-cracks-terrorism-reporting-may-demand-encryption-keys/"}
