{"authors":["David Scutt","Business Insider Australia"],"date_download":"2018-10-30 23:16:46","date_modify":"2018-10-30 23:16:46","date_publish":"2018-07-19 00:00:00","description":"The USD/CNY, or onshore traded yuan, currently sits at 6.7437, the highest level since July last year. A higher number indicates a weaker yuan.","filename":"data/vaneerConsumption/ChinaYuanselloffacceleratingnosignofBeijingsteppingin.json","image_url":"https://amp.businessinsider.com/images/56f4355191058422008b897f-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_china-yuan-selloff-accelerating-no-sign-of-beijing-stepping-in-2018-7_1540941406.html","title":"China: Yuan selloff accelerating, no sign of Beijing stepping in","title_page":"    China: Yuan selloff accelerating, no sign of Beijing stepping in - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The Chinese yuan fell to its lowest level versus the dollar in over a year. REUTERS/Jon Woo\nThe Chinese yuan is continuing to unravel, falling to a one-year low against the greenback on Thursday.\nThe USD/CNY, or onshore traded yuan, currently sits at 6.7437, the highest level since July last year. Offshore traded yuan, or CNH, is even weaker than the onshore rate, sitting at 6.7830, up 0.58% for the session. A higher number indicates a weaker yuan.\nBusiness Insider Australia\nAs opposed to being driven by diverging monetary policy outlooks, narrowing yield differentials or trade war concerns, Hannah Anderson, Global Market Strategist at JP Morgan Asset Management, says the weakness today appears to reflect a shift in policy from the People's Bank of China (PBoC).\n\"Earlier this year, yuan weakness reflected moderating Chinese economic fundamentals versus the majority of its trading partners, a strong USD, and narrowing yield differentials between it and the US,\" she said.\n\"In contrast, today's weakness seems to reflect a more explicit policy decision.\n\"After signaling it would accept more volatility in the currency, the PBoC has followed up by lowering the daily fixing rate.\nOn Thursday, the PBoC set the midpoint of the USD/CNY's daily trading range at 6.7066, up from 6.6914 a day earlier. It was the weakest fixing level this year.\n\"[The fixing] signals the PBoC is not defending any line in the sand for the exchange rate and is comfortable with gradual yuan depreciation,\" Tommy Xie, an economist at Oversea-Chinese Banking Corporation, told Bloomberg.\nSpeculation over further monetary policy easing from the PBoC may also be a factor behind the renewed weakness with China Business News reporting policy makers have made efforts to encourage bank loans and investment in lower-rated corporate debt.\nEarlier in the session, China's State Administration of Foreign Exchange, or SAFE, said China currency remains stable and strong, adding China's economic fundamentals remain sound and offer high returns for offshore investors.\nThe FX regulator said it needs to assess the impact of trade tensions with the United States on cross-broader capital flows. Despite mounting concerns from traders, it said it has ample FX reserves to cope with the challenge presented and was able to keep FX markets generally stable.\nBoth Anderson and Xie believe the path of least resistance for the yuan looking ahead is for further weakness.\n\"More weakness seems warranted given all of the factors, but Chinese authorities will likely prevent the currency from moving too sharply in any direction,\" Anderson said.\nXie told Bloomberg that the \"currency may see another wave of selling pressure ahead\".","url":"https://www.businessinsider.com/china-yuan-selloff-accelerating-no-sign-of-beijing-stepping-in-2018-7"}
