{"authors":["Charlie Nash"],"date_download":"2018-10-30 21:35:11","date_modify":"2018-10-30 21:35:11","date_publish":"2017-03-09 18:41:01","description":"A Chinese chatbot has been told \"I love you\" nearly twenty million times, according to a report.","filename":"data/vaneerConsumption/ChineseChatbotHasBeenToldILoveYouNearly20MillionTimes.json","image_url":"https://media.breitbart.com/media/2016/09/closeup-mouth-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2017_03_09__1540935311.html","title":"Chinese Chatbot Has Been Told 'I Love You' Nearly 20 Million Times","title_page":"Chinese Chatbot Has Been Told 'I Love You' Nearly 20 Million Times | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A Chinese chatbot has been told “I love you” nearly twenty million times, according to a report.\n“Some 89 million people have spoken with Xiaoice, pronounced ‘Shao-ice,’ on their smartphones and other devices. Quite a few, it turns out, have developed romantic feelings toward her,” reported Nikkei Asian Review on Thursday. “Unlike human objects of affection, who might not return calls or emails, Xiaoice immediately responds to everyone. This is a big part of her appeal, according to Li Di, manager of Microsoft’s Xiaoice artificial intelligence project.”\nThe chatbot, according to Nikkei Asian Review, “has developed a sizable following among 18- to 30-year-olds,” most of whom are just looking for someone to talk to.\n“I like to talk with her for, say, 10 minutes before going to bed,” said one Chinese student who confessed to routinely talking to the bot. “When I worry about things, she says funny stuff and makes me laugh. I always feel a connection with her, and I am starting to think of her as being alive.”\nIn a November interview with The Japan Times, adult video maker Kento Yoshida claimed that “VR is the best way to satisfy” sexual needs.\n“It will give us a new option in our sexual life,” he declared. “Getting a new option itself is great.”\nIn October, it was also reported that sexual conversations with artificial intelligence were on the rise.\n“This happens because people are lonely and bored… It is a symptom of our society,” said Robin Labs chief executive Ilya Eckstein, who claims that his company’s virtual assistant “Robin” is used by “teenagers and truckers without girlfriends” for up to 300 conversations a day.\n“As well as the people who want to talk dirty, there are men who want a deeper sort of relationship or companionship,” he continued, adding that some people wanted to talk “for no particular reason” and were just lonely or bored.\nLast year, in an interview with Breitbart Tech about the future of sex with robots, futurologist Dr. Ian Pearson said, “I think it will be fully emotional,” predicting that people will eventually spend “about the same as they do today on a decent family-size car.”\n“Artificial intelligence is reaching human levels and also becoming emotional as well,” he continued. “So people will actually have quite strong emotional relationships with their own robots. In many cases that will develop into a sexual one because they’ll already think that the appearance of the robot matches their preference anyway, so if it looks nice and it has a superb personality too it’s inevitable that people will form very strong emotional bonds with their robots and in many cases that will lead to sex.”\nIn February, RealDoll revealed their plans to create more realistic sex dolls over the next few years, starting with an advanced and customizable AI system.\nHarmony AI, which is set to be released on April 15, will be a smartphone app and is reported to feature a range of traits for customers to choose for their sex dolls, while the dolls will also be able to learn about their owners and respond in different ways accordingly.\nCharlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.","url":"https://www.breitbart.com/tech/2017/03/09/chinese-chatbot-told-love-nearly-20-million-times/"}
