{"authors":[],"date_download":"2018-10-23 04:21:35","date_modify":"2018-10-23 04:21:35","date_publish":"2017-04-26 16:01:29","description":"China's Foreign Minister Wang Yi urged an end to US-South Korean military manoeuvres Wednesday as well as a stop to North Korea's nuclear programme to calm...","filename":"data/vaneerConsumption/ChinaurgesendtoUSSKoreamilitaryexercises.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/16/wire-465971-1493218891-225_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4448190_China-urges-end-US-S-Korea-military-exercises_1540268495.html","title":"China urges end to US-S.Korea military exercises","title_page":"China urges end to US-S.Korea military exercises | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Protesters and police stand by as trailers carrying US THAAD missile defence equipment enter a deployment site in Seongju, South Korea, early on April 26, 2017\nChina's Foreign Minister Wang Yi urged an end to US-South Korean military manoeuvres Wednesday as well as a stop to North Korea's nuclear programme to calm tensions on the peninsula.\nHe said Pyongyang's continuing nuclear tests were \"a clear violation of UN resolutions\", but stressed that persisting with military manoeuvres around the peninsula \"is not in the spirit of the resolutions either\".\n\"Security and stability are very fragile at the moment and the danger is great of a new conflict breaking out at any time,\" Wang said at a joint press conference with German counterpart Sigmar Gabriel.\n\"We can't risk even a one percent possibility of war,\" he said, warning that a conflict would have \"unimaginable consequences\".\n\"Therefore, we call on all sides to be prudent and refrain from any actions or words that could lead to new provocations,\" he said.\nTensions have spiked in recent weeks with missile launches from the nuclear-armed North and strong rhetoric from US President Donald Trump's administration.\nA nuclear-powered US aircraft carrier arrived in South Korea earlier this month for joint military exercises.\nPyongyang condemns the annual joint drills, which involve tens of thousands of troops, as provocative rehearsals for invasion, while Seoul and Washington insist they are purely defensive in nature.\nWang was speaking after US troops began delivering a missile defence system to a deployment site in South Korea, a move of deterrence amid fears Pyongyang may be preparing a sixth nuclear test.\nWashington has repeatedly urged Beijing to use its influence to rein in its ally North Korea. At the same time, Trump has warned he is willing to ramp up US military pressure.\nBut Beijing has long opposed such action against Pyongyang, fearing that the regime's collapse could leave the US military on its doorstep, and has been calling for dialogue.\nWang himself warned in mid-April that \"conflict could break out at any moment\" over North Korea.\nAsked if Beijing has done enough to curb its neighbour, Gabriel said that the \"primary responsibility lies with North Korea\".","url":"https://www.dailymail.co.uk/wires/afp/article-4448190/China-urges-end-US-S-Korea-military-exercises.html"}
