{"authors":["Sophie Williams For Mailonline"],"date_download":"2018-10-22 23:28:53","date_modify":"2018-10-22 23:28:53","date_publish":"2016-01-28 12:24:45","description":"Residents in Jingjiang, China, rushed to loot grain from an overturned truck. Reports say the looters managed to take around eight tonnes of wheat from the truck before police cleared the scene.","filename":"data/vaneerConsumption/Chinesemotorwayfloodedbyvillagersascrashedtruckspillswheat.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A9EE1800000578-0-image-a-2_1453980556489.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_peoplesdaily_article-3420602_The-great-grain-robbery-HUNDREDS-villagers-cause-chaos-Chinese-motorway-flock-loot-wheat-fallen-crashed-truck_1540250933.html","title":"Chinese motorway flooded by villagers as crashed truck spills wheat","title_page":"Chinese motorway flooded by villagers as crashed truck spills wheat | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Hundreds of people in east China's Guizhou province turned out to loot eight tonnes of grain from a truck that had crashed.\nLooters rushed to the scene of the crash which occurred on January 27, blocking the road and causing chaos in Jingjiang City, the People's Daily Online reports.\nPolice were called to the scene and witnessed hundreds of people with buckets, bags and other tools taking the truck's contents.\nGrain thieves: Looters rushed to the scene with bags and buckets to take the contents of the overturned truck\nA lot to clear up: Police cordoned off the area and started the cleanup operation in Fujian province\nThe truck was passing through the city while transporting 45 tonnes of grain when it crashed into a flower bed and tipped over.\nAccording to reports, the road was wet at the time and the driver lost control crashing into a flower bed and overturning.\nThe looters rushed to collect as much grain as they could from the crashed vehicle causing disruption to traffic in the area.\nPrize haul: Locals managed to take around eight tonnes of grain from the overturned vehicle\nPolice were called to the scene at around 9:45am to disperse the crowd.\nThe truck was removed and the road was finally cleared at around noon when people returned to the scene to scavenge for any leftover grain.\nLocal police say around eight tonnes of grain were stolen.\nThis is one of many cases of looting crashed vehicles in China.\nEarlier this month, villagers in Yunnan province looted a crashed truck carrying 30 tonnes of oranges.","url":"https://www.dailymail.co.uk/news/peoplesdaily/article-3420602/The-great-grain-robbery-HUNDREDS-villagers-cause-chaos-Chinese-motorway-flock-loot-wheat-fallen-crashed-truck.html"}
