{"authors":["Sophie Williams For Mailonline"],"date_download":"2018-10-23 03:07:53","date_modify":"2018-10-23 03:07:53","date_publish":"2017-03-16 13:51:21","description":"A handyman fell from the second floor of a building and landed on metal railings today in China. He was installing an air conditioning unit when he fell, impaling his buttocks on the fence.","filename":"data/vaneerConsumption/Chinesemanimpaledbytwosteelrodsinthebuttocks.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E53D58700000578-0-image-a-43_1489664604037.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319718_Handyman-impaled-two-steel-rods-buttocks_1540264073.html","title":"Chinese man impaled by two steel rods in the buttocks","title_page":"Chinese man impaled by two steel rods in the buttocks | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"If you were having a bad day, spare a thought for this man in China.\nThe handyman fell from a height while working and landed on a metal fence impaling his buttocks.\nThe incident took place in Xi'an, China's Shaanxi province today.\nTerrible accident: The man fell while installing an air conditioning unit in Xi'an, China\nAccording to Shaanxi fire service's Weibo account, the incident took place at Xi'an Industrial Park.\nThe man was installing an air conditioning unit when he fell from the second floor.\nHe landed on the iron fence, piercing his buttocks on two metal rods.\nX-ray of the spikes: The man landed on the fence with the spiked impaling his buttocks\nThe spikes were removed during surgery and the man is said to be recovering in hospital\nThat's got to hurt: The man was rescued by firefighters who cut him free from the fence\nIn the footage, firefighters can be seen holding the man up as they try to cut off a small section of the fence.\nThe man can be heard screaming as firefighters trim the fence in order to take him to hospital.\nHe was taken to hospital where he underwent surgery.\nThe man is said to be recovering in hospital.","url":"https://www.dailymail.co.uk/news/article-4319718/Handyman-impaled-two-steel-rods-buttocks.html"}
