{"authors":["Isami Mccowan"],"date_download":"2018-10-31 01:38:29","date_modify":"2018-10-31 01:38:29","date_publish":"2018-08-28 17:13:41","description":"Chipotle fans, a brand new world is ahead of you. When you're craving a bowl or a few tacos with a side of queso, sometimes you just have to brave the long line that winds around the restaurant — but it's time to say hello to direct delivery. The…","filename":"data/vaneerConsumption/ChipotleDeliveryIsFinallyHappeningHeresHowToGetFreeDeliveryToCelebrate.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/28/7a0c9961-e2e0-4de1-b83a-aabdd1769a6f-getty-866379700.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_chipotle-delivery-is-finally-happening-heres-how-to-get-free-delivery-to-celebrate-10508188_1540949909.html","title":"Chipotle Delivery Is Finally Happening & Here’s How To Get Free Delivery To Celebrate","title_page":"Chipotle Delivery Is Finally Happening & Here’s How To Get Free Delivery To Celebrate","title_rss":"NULL","source_domain":"bustle.com","text":"Chipotle fans, a brand new world is ahead of you. When you're craving a bowl or a few tacos with a side of queso, sometimes you just have to brave the long line that winds around the restaurant — but it's time to say hello to direct delivery. The Mexican grill chain is teaming up with DoorDash to launch a delivery program where customers won't even have to leave Chipotle's website or app to place their order, and it's going to make getting your meals easier than ever. That's right — Chipotle delivery is finally happening.\nIn celebration of the newly-introduced service, customers will be able to enjoy free delivery on orders of $10 or more placed through the Chipotle website or app for a limited time. Those of us who weren't already tempted to get a Chipotle fix every day probably will be now. \"Fans have long been requesting Chipotle delivery, and as part of our commitment to make it easy for our customers to get the delicious food they love when, where and how they want it, we're rolling out our own delivery service powered through DoorDash as the last mile delivery partner,\" explained Curt Garner, chief digital and information officer at Chipotle in a news release. It seems like the company knows what the people want.\nScott Olson/Getty Images News/Getty Images\nThe best part about going to Chipotle is being able to tailor your food exactly how you want it — I'm sure we all have our go-to order memorized. With the new delivery service, you'll be able to personalize your order like you usually do and skip the line, since it'll show up right at your doorstep. \"Chipotle customers love the ability for deep customization online, and now they can get the same level of personalization for delivery. Whether it's doing half and half proteins, light rice or extra cheese, fans can now get Chipotle delivery exactly the way they want it,\" the company said in a news release. Extra guac too, please.\nPartnering up with DoorDash to introduce a direct delivery program is part of Chipotle's goal to expand their digital offerings and make food increasingly accessible for customers. This is just the latest of Chipotle's initiatives to move forward with their mission: other digital innovations the company has recently implemented include mobile shelving units and a digitally enabled second make line. The brand's top priority is making sure customers can get their hands on Chipotle orders as easily and efficiently as possible. Chipotle considered several different delivery partners before ultimately deciding to further develop their partnership with DoorDash, according to the press release. The choice was based on the food delivery app's ability to get Chipotle fans their favorite dishes as quickly as possible while still delivering high quality food.\nThe directly delivery service is officially available at the 1,800+ Chipotle restaurants that are currently on DoorDash. Say goodbye to the drives and long lines. Simply sit back and relax while you wait for your order. The new program's free delivery offer will be valid at participating locations Sept. 12, so head on over to Chipotle's site and let your lunch come to you.","url":"https://www.bustle.com/p/chipotle-delivery-is-finally-happening-heres-how-to-get-free-delivery-to-celebrate-10508188"}
