{"authors":["Hannah Al-Othman For Mailoline"],"date_download":"2018-10-23 01:11:18","date_modify":"2018-10-23 01:11:18","date_publish":"2017-03-10 08:49:54","description":"Late last year the company said it would be pulling the plug on ShopHouse restaurants, which are located in the Washington, D.C., Maryland, Los Angeles, and Chicago areas.","filename":"data/vaneerConsumption/ChipotletocloseitsAsianthemedShopHouserestaurants.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/08/3E21B94200000578-0-image-a-2_1489135339419.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300402_Chipotle-close-Asian-themed-ShopHouse-restaurants_1540257078.html","title":"Chipotle to close its Asian-themed ShopHouse restaurants","title_page":"Chipotle to close its Asian-themed ShopHouse restaurants  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Chipotle has announced plans to close all 15 of its ShopHouse restaurants next week, ending its attempt to expand into fast casual Asian cuisine.\nLate last year the company said it would be pulling the plug on ShopHouse restaurants, which are located in the Washington DC, Maryland, Los Angeles, and Chicago areas.\nThis week Chipotle said that all the restaurants would be serving their final meals next Friday.\nAsian fusion restaurant ShopHouse will be closing all of its outlets on March 17\nOnce speculated as a billion-dollar brand, Asian fusion chain ShopHouse first opened in 2011, serving customizable rice, noodle, and salad bowls with curry, tamarind, peanut, and chili sauces and various toppings.\nLast summer the chain also inexplicably started serving burritos.\nThe company has not revealed the exact reasons for axing the chain, but with only 15 stores across the country, ShopHouse never reached a critical mass as a brand, and its growth may have plateaued earlier than expected.\nThe company is also struggling to recover from a series of food safety outbreaks that have seen profits slashed.\nOne fan has set up a 'Save ShopHouse' Twitter account, protesting against the closure\nDozens of ShopHouse fans reacted with horror after the news was announced.\nMarissa Marie tweeted: 'Nooooooooo! Please don't go! What will we eat?!'\nWhile another Twitter user said: 'I'm soooo sad ShopHose is closing for good on March 17th!!!!! Omggg no. This is heart breaking it's so good.'\nAnd Jaclyn Silva‏ said simply: 'I refuse to accept this.'\nOne fan has even set up a 'Save ShopHouse' Twitter account, protesting against plans to shut the chain.\nThe chain has been in a downward spiral since October 2015 when news broke about a highly publicized E. coli outbreak\nLast month it was announced that Chipotle Mexican Grill Inc's quarterly profits had fallen by 76.5 per cent as the company struggles to recover from a prolonged food safety crisis in the fall of 2015.\nThe company is blaming minimum wage increases, higher spending on advertising, promotions and a spike in costs for avocados, the main ingredient in guacamole.\nThe company's net income fell to $15.98million, or 55 cents per share, in the fourth quarter ended Dec 31, from $67.87million, or $2.17 per share, a year earlier.\nDespite the fall in profits, Chipotle's sales rose for the first time in five quarters.\nChipotle's share prices have fallen dramatically over the past 18 months as the company struggles to recovered from a series of food safety outbreaks\nThe burrito chain is going it all it can to bring back diners after a series of food safety lapses.\nThe company said sales at established restaurants jumped 26 percent in January, putting it on track for its first quarterly increase in six quarters.\nChipotle's sales slumped in November 2015 when the chain was linked to a multi-state E. coli outbreak. A month later, at least 80 Boston College students were sickened by norovirus traced to a Chipotle restaurant.\nSince then, the company has given away free and discounted food and spent heavily on advertising and promotions in a bid to bring back diners. It also abandoned its dual CEO structure and named Steve Ells the sole chief executive.\nFollowing the closure of ShopHouse, Chipotle will focus on its two other growth concepts, the Pizzeria Locale pizza chain, and Tasty Made, its new burger joint that opened its first branch in October.","url":"https://www.dailymail.co.uk/news/article-4300402/Chipotle-close-Asian-themed-ShopHouse-restaurants.html"}
