{"authors":["Uday Sampath"],"date_download":"2018-10-30 22:58:46","date_modify":"2018-10-30 22:58:46","date_publish":"2018-07-26 00:00:00","description":"Shares soared over 56% this year, mainly buoyed by optimism around its new CEO.","filename":"data/vaneerConsumption/Chipotletopsestimatesamidpricehikesandintensecompetition.json","image_url":"https://amp.businessinsider.com/images/5b5a570889c8a130008b471f-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_chipotle-earnings-report-shares-7_1540940326.html","title":"Chipotle tops estimates amid price hikes and intense competition","title_page":"    Chipotle shares jump, tops estimates amid price hikes and intense competition - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Hollis Johnson/Business Insider\nChipotle Mexican Grill topped analysts' estimates for same-restaurant sales on Thursday, boosted by higher prices and demand for its queso cheese dip as its new CEO focuses on turning around the once-hot burrito chain.\nChipotle shares, which have soared over 56 percent this year, mainly buoyed by optimism around its new CEO, rose 6.3 percent in extended trading.\nThe company has pulled off a successful hike in prices at a time when fast-food chains are relying on low-price value menus to boost sales and market share.\nThe move shows that the premium burrito chain, despite past food safety scares, is largely escaping the intense competition in the value space that took a toll on McDonald's quarterly U.S. same-store sales earlier on Thursday.\nChipotle made a rare addition to its menu last year with queso cheese, but was met with bland reviews with some Twitter users calling it a \"crime against cheese\", forcing the company to tweak the recipe.\nA 4 percent rise in prices helped sales at Chipotle restaurants, open for at least 13 months, increase 3.3 percent in the second quarter, beating analysts' estimates of a 2.7 percent rise, according to Thomson Reuters I/B/E/S.\nNiccol — in the five months at the helm — has made top management changes, spent more on marketing and focused on its online business.\n\"We also saw in the quarter people really responded positively to the advertising that we put out there,\" Niccol said.\nNet income fell to $46.9 million, or $1.68 per share, in the quarter ended June 30, from $66.73 million, or $2.32 per share, a year earlier.\nRevenue rose 8.3 percent to $1.27 billion, hurt by a charge related to the closure of some underperforming restaurants. Excluding items, the company earned $2.87 cents per share.\nAnalysts on average had expected the company to earn $2.80 per share on revenue of $1.26 billion.\n(Reporting by Uday Sampath in Bengaluru; Editing by Shounak Dasgupta)","url":"https://www.businessinsider.com/chipotle-earnings-report-shares-7"}
