{"authors":["Rachael Levy"],"date_download":"2018-10-30 21:55:16","date_modify":"2018-10-30 21:55:16","date_publish":"2016-12-16 00:00:00","description":"Activist hedge fund manager Bill Ackman of Pershing Square Capital took a stake in Chipotle earlier this year.","filename":"data/vaneerConsumption/ChipotleboardshakeupafterBillAckmansPershingSquaretakesstake.json","image_url":"https://amp.businessinsider.com/images/5853f647a1a45e1b008b6570-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_chipotle-board-shakeup-after-bill-ackmans-pershing-square-takes-stake-2016-12_1540936516.html","title":"Chipotle board shakeup after Bill Ackman's Pershing Square takes stake","title_page":"    Chipotle board shakeup after Bill Ackman's Pershing Square takes stake - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Bill Ackman. Manuel Balce Ceneta/AP Chipotle has named four new people to its 12-person board of directors, including two people who work with the activist firm Pershing Square Capital, which took a stake in the company earlier this year.\nThe appointments are Paul T. Cappuccio, Robin S. Hickenlooper, Ali Namvar, and Matthew Paull.\nNamvar is a partner at Pershing Square and has worked there since 2006, according to a Chipotle press statement. Paull sits on Pershing Square's advisory board.\nCappuccio is Time Warner's executive vice president and general counsel, and Hicklooper is the senior vice president of corporate development at Liberty Global.\n\"We are pleased that Chipotle has taken the important step of refreshing its board, which will position the company for continued growth and long-term success,\" Bill Ackman, the founder of Pershing Square, said in the statement.\nAckman's $11 billion Pershing Square hedge fund took a 9.9% stake in Chipotle in September. The firm's performance has dropped since last year. Pershing Square Holdings, a proxy for the firm's flagship hedge fund, is down about 12% through December 13.","url":"https://www.businessinsider.com/chipotle-board-shakeup-after-bill-ackmans-pershing-square-takes-stake-2016-12"}
