{"authors":["Lisa Mcloughlin For Mailonline"],"date_download":"2018-10-23 02:40:43","date_modify":"2018-10-23 02:40:43","date_publish":"2017-03-10 11:53:08","description":"The 24-year-old reality beauty sported some head-turning eyewear as she chatted to her co-star whilst carrying multiple designer shopping bags in Brentwood, Essex.","filename":"data/vaneerConsumption/ChloeLewissportsyellowshadeswhilefilmingTOWIE.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E231ABD00000578-0-image-a-107_1489155666140.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4301008_Chloe-Lewis-sports-pair-head-turning-yellow-shades_1540262443.html","title":"Chloe Lewis sports yellow shades while filming TOWIE","title_page":"Chloe Lewis sports yellow shades while filming TOWIE | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's happily moving on with new man Danny Fisher.\nBut it appears Chloe Lewis can't get away from comparisons to her ex Jake Hall's new girlfriend Missé Beqiri after she stepped out on Thursday in the same yellow lens sunglasses as the Real Housewives of Cheshire star.\nTaking style notes from her love rival, the 24-year-old reality beauty sported the same head-turning eyewear as she chatted to her co-star Jon Clark whilst carrying multiple designer shopping bags, filming for the current series of TOWIE.\nScroll down for video\nCopy cat: It appears Chloe Lewis can't get away from comparisons to her ex Jake Hall's new girlfriend Missé Beqiri (R) after she stepped out on Thursday in the same yellow lens sunglasses as the Real Housewives of Cheshire star\nChloe's yellow lens aviators accentuated her delicate facial features as she worked a pair of skintight black denims which she teamed with a chic ribbed white hoodie.\nAdding to her eclectic look, she wrapped an oversized leather jacket around her petite frame which featured dazzling floral embroidery all over.\nEquipped with her Dionysus GG Supreme shoulder bag, she swapped her usual stilettos with a pair of chunky Doc Martin boots while laden down with her numerous bags.\nIt appears Chloe - who bears a striking resemblance to Jake's new other half - has been checking out her love rival's Instagram of late as she sported a similar look which the half-Swedish, half-Albanian beauty rocked two weeks ago.\nIn the snap, Missé can be seen boasting the same kooky eyewear and a similar statement jacket.\nOh snap! It appears Chloe has been checking out love rival Missé's Instagram of late as she sported a similar look that the half-Swedish, half-Albanian beauty rocked two weeks\nHowever, this isn't the only time the 29-year-old model - who was married to Manchester United’s Ander Lindegaard - has been snapped wearing the quirky glasses as she was first spotted seven weeks ago working the eclectic look.\nSince then, she has been photographed with the facial accessory numerous times which has now set tongues wagging that her love's former flame is copying her look.\nMissé confirmed her romance with hunky reality star Jake, who was a fleeting cast member on TOWIE in 2015, in October, when she posted a snap on Instagram while wearing a jumper adorned with his initials.\nWhile Chloe burst onto the reality scene alongside Jake, where their on-off romance played out in dramatic storylines, after he was accused of cheating with Lauren Pope and Megan McKenna but the two called it quits early 2016.\nMellow yellow: Since then, she has been photographed with the facial accessory numerous times which has now set tongues wagging that her love's former flame is copying her look\nRetail therapy: The 24-year-old reality beauty sported some head-turning eyewear as she chatted to her co-star whilst carrying multiple designer shopping bags in Brentwood, Essex\nRecently, she hit London town with her boyfriend Danny Fisher, locking lips in very affectionate display earlier this week.\nThe TOWIE star looked sensational as she climbed onto her boyfriend's back before tumbling into his arms on the street.\nChloe caused tongues to wag when she shared a number of cryptic posts regarding her new relationship shortly after her ex-boyfriend Jake Hall made his romance with Missé official.\nChatterbox: Chloe chatted away to Jon Clark in between scenes for the new series of TOWIE\nThe brunette beauty has remained relatively quiet on the love front, yet recently hinted at a new love affair - although Valentine's saw her confirm a new romance with a then-mystery man - who has now been revealed as dashing hunk Danny.\nShe shared a selfie with Danny, with the caption: 'So bloody handsome... to this one making me feel so special everyday', although did not specify the identity of her new beau, until now.\nOn Sunday night's comeback episode of TOWIE, the stunner revealed she was 'getting serious' with her new man - with her night out proving how close they are.\nLoved-up: The TOWIE star looked sensational in a typically quirky look as slipped into a patterned crop top with ruffled trousers, while she climbed onto her boyfriend's back before tumbling into his arms on the street","url":"https://www.dailymail.co.uk/tvshowbiz/article-4301008/Chloe-Lewis-sports-pair-head-turning-yellow-shades.html"}
