{"authors":["Kate Thomas And Jabeen Waheed For Mailonline"],"date_download":"2018-10-23 01:44:45","date_modify":"2018-10-23 01:44:45","date_publish":"2017-03-10 10:17:29","description":"Chloe Madeley was showcasing the results of her tough training in her latest fit-spiration photoshoot, posing in a black string bikini.","filename":"data/vaneerConsumption/ChloeMadeleyflauntssixpackandgymhonedfigure.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E22139B00000578-0-image-a-5_1489141001980.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300682_Chloe-Madeley-flaunts-six-pack-gym-honed-figure_1540259085.html","title":"Chloe Madeley flaunts six-pack and gym-honed figure","title_page":"Chloe Madeley flaunts six-pack and gym-honed figure | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's been working relentlessly over the last few years, following an intense exercise regime and strict, protein-heavy diet.\nAnd Chloe Madeley was showcasing the results of her tough training in her latest fit-spiration photoshoot, posing in a black string bikini.\nThe fitness fanatic, 28, displayed her envy-inducing, rippling six pack in the striking image, looking the picture of heath.\nScroll down for video\nFitness fanatic: Chloe Madeley was showcasing the results of her tough training in her latest fit-spiration photoshoot, posing in a black string bikini\nHooking her fingers in her bikini bottoms, Chloe showed off as much of her toned figure as possible.\nThe star proudly revealed her impressible muscle definition in the racy snap, gazing into the camera with a fierce look.\nHer blonde hair was slicked back from her face for the shoot, with rosy blusher highlighting her cheekbones.\nEarlier this week, Chloe slipped into an eye-wateringly small bikini for a sexy photoshoot at her gym - from which she shared a sizzling snap with her 137,000 Instagram followers.\nPeachy! Earlier this week, Chloe slipped into an eye-wateringly small bikini for a sexy photoshoot at her gym - as she shared a sizzling snap with her 137,000 Instagram followers\nThe star worked all her best angles in the shot as she straddled a bench while jutting out her derriere and gazing into the distance as her photographer snapped away.\nChloe is renowned for littering her Instagram with envy-inducing snaps of her flawless physique - the result of her gruelling hours spent in the gym.\nThe daughter of Richard Madeley and Judy Finnegan teased a peek at her posterior as she jutted her back and leaned forward to show off her frame.\nWith her hair styled elegantly into a quiff with French plaits, she also wore a full face of make-up in scenes which appeared to be behind the scenes of a photoshoot.\nShe poked fun at her glamorous gym look, as she penned a hilarious caption reading: 'What? This is what I wear to the gym. #FullHairAndMakeUpBikiniSwag'.\n'Light and lean': Just a day before, Chloe displayed her fine form yet again, as she took to the popular social media platform in a crop top and barely-there black underwear\nJust a day before, Chloe displayed her fine form yet again, as she took to the popular social media platform in a crop top and barely-there black underwear.\nThe superstar offspring worked her angles in two side-by-side snaps as she gushed about being the 'lightest and leanest' she's ever been.\nThe image saw Chloe don a cropped LA muscle tee which displayed her honed form in all its glory. The briefs hung incredibly low on her hips and flaunted the impressive definition in her legs.\nChloe was keen on sharing her fitness journey with her legion of followers, as she captioned the snap: 'So this was me at 8am this morning, the lightest and leanest I've ever been after 9 weeks of \"cutting\", sitting at 12.5% body #fat and 122lbs. Someone asked me yesterday why I'm going to \"throw away\" all of this hard work.\nABS-olutely fantastic: On Thursday, Chloe displayed the fruits of her hard earned gym labour on Instagram with an incredible stomach-flaunting snap\n'Here's the thing...having this low body #fat is totally fine, a lot of the horror stories you hear about #women and low #body fat are false. And I know that for a fact because in week 8 I had ALL my #bloods, urine, #hormones , swabs, every single internal test you can imagine having, I had it done.\n'And guess what? I came out with ⭐️⭐️⭐️ in every, single, category. HOWEVER, the above being said, IF you love #training like a f****** nutcase eventually it DOES become hard , #physically , to do so at such a low bodyfat, #calorie count, #carb %, etc...\n'Mentally, yes , I COULD maintain this... if I was willing to go weeks at a time without drinking or ordering cake...but that's not me either.'\nStomach flaunting: The personal trainer displayed her incredible fitness transformation eight weeks in\nShe went on to reveal that she found what works best for herself and doesn't mind gaining weight because she knows how to snap back in shape.\nLast week, Chloe displayed the fruits of her hard earned gym labour on Instagram with an incredible ab-flaunting snap on Thursday night.\nThe exercise guru shared a saucy snap of her at the beginning of her gym journey and now clad in skimpy underwear to exhibit her impressive metamorphosis.\nUpdating her social media followers on her progress, she revealed she's eight weeks into her strict 12-week diet and exercise plan as she stood in her Victoria's Secret 'Pink' branded intimates.\nThe personal trainer teased at her ample cleavage in the racy photo as she donned a grey marl sports bra for the telling picture.\nCaptioning the photo, she encouragingly wrote: '8 weeks. Find what you love and get good at it'.\nHer muscle flaunting appearance comes after she hit back at her tormentors by sharing a snap of her ripped six-pack and 11lbs weight loss last week.\nThe star snapped away in front of the mirror as she put her washboard abs and gym-honed legs on display for all to see, Chloe told her followers she was seven weeks in to her regime.\nThe gym bunny, who lost the weight in five and a half weeks, went on a rampage telling her abusers to stop trying to 'take my s**t away from me'.\nShe shared a comparison photo that showed her figure at the start of the five weeks and now.\nNot backing down: Earlier this week, Chloe hit back at cruel social media trolls by sharing yet another image of her ripped six-pack and 11lbs weight loss as she posed in her underwear\nAlongside the snap, she wrote: '7 weeks deep. Another Full Update tomorrow, on fitnessfondue.com. Ps, thanks fitfam for all your amazing messages you , me, and our 12 week party.'\nChloe's latest sizzling selfie comes after online trolls mocked the television presenter by saying 'you can't seriously call that a body transformation' after she shared a revealing picture of her weight loss.\nThe TV personality has since branded the trolls 'c**ks' for trying to undermine her hard work.\nLivid: The star, who lost the weight in five and a half weeks, went on a social media rampage telling her abusers to stop trying to 'take my s**t away from me'\n'You can't seriously call that a body transformation? Well that's 11lbs difference so I certainly f**king can. \"Try 5 stone\". Right, listen up...I don't give a f**k if you lose 2 stone or 2lbs. I don't give a f**k if you start as a size 12 or a size 18.\n'If you get up every day and you find the time to schlog your a** off in the #gym, and you find the will power to stay committed to your #diet , even when everyone around you is drinking wine and eating ice cream, and you take a measurement or a picture and see that through sheer drive you have MADE SOMETHING HAPPEN, you deserve to pat yourself on the back...BIG TIME.'\nContinuing her rant, she added: 'And if anyone comes at you telling you they've done better or your achievement isn't as good as you think it is...that person is a c**k.Fact.\n'I am damn proud that through sheer determination I have lost 11lbs of fat in 5.5 weeks, and if you lost more then well done, but don't take my s**t away from me.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300682/Chloe-Madeley-flaunts-six-pack-gym-honed-figure.html"}
