{"authors":["Hannah Paine","Jade Watkins For Daily Mail Australia"],"date_download":"2018-10-22 21:59:19","date_modify":"2018-10-22 21:59:19","date_publish":"2017-03-10 00:08:38","description":"She finally admitted this week to undergoing several cosmetic procedures.","filename":"data/vaneerConsumption/ChloeLattanzisfansaskabouthermissingbellybutton.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/23/3E1EDA4300000578-0-image-a-52_1489103373675.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299382_Chloe-Lattanzi-s-fans-ask-missing-belly-button_1540245559.html","title":"Chloe Lattanzi's fans ask about her missing belly button","title_page":"Chloe Lattanzi's fans ask about her missing belly button | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She finally admitted this week to undergoing several cosmetic procedures.\nAnd Chloe Lattanzi continues to flaunt her doll-like proportions on Instagram, sharing yet another revealing photo on Friday.\nThe 31-year-old daughter of Olivia Newton-John posted a snap which showed off her extremely thin frame, but caused fans to ask: 'Where's the belly button?'\nScroll down for video\n'Where's the belly button?' Chloe Lattanzi shows off extremely thin figure as fans ask why her belly button had disappeared\nThe Instagram photo shows Chloe posing in a skimpy bikini, blue sky in the distance.\nShe wears a pink bustier bikini top which flaunts her cleavage and tiny patterned bikini briefs.\nThe aspiring singer's face was obscured by her long blonde locks, which were blown across her face.\nCurious: While the photo had clearly been posted to inspire her fans, several were quick to point out that something appeared to be missing\nIt's there! Previous photos of Chloe baring her midriff on Instagram and at red carpet events clearly show the marijuana farmer's belly button\n'Don't take your blue sky's (sic) for granted my loves,' she captioned the photo to her 37,000 followers.\nWhile the photo had clearly been posted to inspire her fans, several were quick to point out that something appeared to be missing.\n'Wheres (sic) the bellybutton' one commenter posted.\nPrevious photos of Chloe baring her midriff on Instagram and at red carpet events show the marijuana farmer's belly button.\nComing clean: This week Chloe finally admitted she has in fact had several procedures over the years\nIn the past Chloe has been accused by fans of photoshopping pictures posted to social media and confessed in November to digitally altering her image.\n'Someone called me out, and I'm glad they did. Thanks who ever you were for calling me out on my bulls***,' she wrote.\nThis week Chloe finally admitted she has in fact had several procedures over the years.\nThe 31-year-old revealed to Woman's Day magazine that she has had not one, but two breast augmentations, following a botched boob job when she was just 18-years-old. She also had multiple fillers she injected into her face and lips, removed.\nWent under the knife: The 31-year-old revealed she has had not one, but two breast augmentations\n'All those things were a disaster,' she explains to the publication.\n'Not only did the lip implants look ridiculous, the first boob op I had in Australia when I was 18 left me looking mutilated.'\nChloe explains that it was only last year when she finally had the surgery corrected, spending $10,000 on another breast augmentation as a 'reward for myself for my sobriety', boosting her cup size to a busty 10DD.\nCaring: The blonde bombshell says her mother Olivia has been very supportive of her decisions (pictured together in 2004)\nThe blonde bombshell says her mother Olivia has been very supportive of her decisions.\n'Now I'm a 32DD (10DD), love my body and love showing my new boobs off. Mum supported my surgery decisions because she knew how unhappy I was before,' she tells the magazine.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299382/Chloe-Lattanzi-s-fans-ask-missing-belly-button.html"}
