{"authors":["Lucy Mapstone For Mailonline"],"date_download":"2018-10-22 23:11:01","date_modify":"2018-10-22 23:11:01","date_publish":"2016-01-28 11:55:58","description":"Chloe Madeley resist sharing another throwback photograph of her old figure on Instagram on Thursday, cutting a stark contrast to a new bikini snap.","filename":"data/vaneerConsumption/ChloeMadeleysharesinspirationalbeforeandafterbikinisnaps.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A841AE00000578-0-image-a-42_1453979928453.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420769_Chloe-Madeley-shares-inspirational-snaps-exposes-rock-hard-abs-skimpy-bikini_1540249861.html","title":"Chloe Madeley shares inspirational before and after bikini snaps","title_page":"Chloe Madeley shares inspirational before and after bikini snaps | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Her journey from normal girl to a woman with a sculpted, toned and honed body to die for has been well-documented.\nBut Chloe Madeley resist sharing another throwback photograph of her old figure on Instagram on Thursday, cutting a stark contrast to a new bikini snap.\nOn the left, the younger version of the pretty blonde - now 28 - is seen in a skimpy bikini while on holiday with pals, showing off her less toned but still stunning, softer curves while beaming into the camera.\nScroll down for video\nBefore and after: Chloe Madeley has shared an incredible and inspirational before and after photo montage, showing her wearing a bikini in both shots, her sculpted V-shaped abs visible in the new image\nOn the right hand side, the now-physically super-fit daughter of Richard Madeley and Judy Finnigan pouts while flaunting her eye-watering rock hard abs and tiny whittled waistline and hips.\nWearing a similar black strappy two-piece swimsuit, her body is notably leaner, the briefs slipping down almost too far over her crotch area to reveal V-shaped abs.\nHer bright blonde locks were coiffed into a sexy bed-head style, and she appeared to have a full face of make-up, suggesting it was a behind the scenes snap from a recent photo shoot.\nAlong with the breathtaking before and after shots, Chloe wrote: '#ThrowbackThursday #TBT I mean I do throwbacks all week long but I love a popular hashtag SO...\nShe's no wallflower: The 28-year-old TV star and personal trainer frequently shares images of her honed, toned and enviably lean physique on Instagram\n'I was always super happy with my body and actually really #body confident. But then I decided to try to change it and see what happened, if I actually could change it or if it really was all a load of bollocks that came down solely to #genetics.'\nShe continued on her inspirational monologue: 'What I discovered after a few weeks is that with the right #diet and #training , #consistency and sheer #willpower , you can do ANYTHING you want to your body.\n'#Training is fun. The #diet is also pretty easy until you find yourself in a social situation, and then like everything else in life, you have to choose what your priorities are. Sometimes I break and go mental eating cake and sometimes I say no...both feel equally good for very different reasons!'\nAs she was: Although Chloe was always slim, she admits she feels better now she has shed any extra weight and has sculpted her physique\nChloe concluded: 'But that in a nutshell is how I changed my body. I decided I wanted to do it and I prioritised it until it happened.\n'That's what you need to do too. Decide. Do. Don't falter until you're there. If The girl who loves sleep and cake more than all her friends can do it, ANYONE can.'\nChloe was previously more famous for being the daughter of former This Morning hosts Richard and Judy, but over the past couple of years she has made a name for herself as a reality TV star and serious fitness buff.\nBarely a day goes by that the pretty model, journalist, TV star and personal trainer doesn't share a selfie on her Instagram page, showing off her taut, toned abs, shapely buttocks and strong biceps.\nShe has shed the pounds after drastically changing her diet and working out with weights on a daily basis, and is now one of the UK's leading poster girls in the 'strong not skinny' movement.\nWoah: Her figure looks sensational, a combination of rock hard abs, shapely thighs and unwobbly arms following her dedicated diet and training regime\nAbs-olutely fabulous: Her taut stomach is one of Chloe's favourite features. In her new post, she said that if someone who loves cake as much as she does can do it, 'ANYONE can'\nWriting for MailOnline recently, Chloe - who is in a happy relationship with rugby hunk James Haskell - gave a brief run-down of how one can shed the pounds and build muscle effectively.\n'Fat is fat is fat. No matter where it decides to set up shop, it all requires the exact same protocol,' she explained.\n'Clean up your diet and reduce your portion sizes (AKA calories in) and start doing cardio, ideally High Intensity Interval Training (AKA calories out). While the bad news is that you cannot target your stubborn fat stores, you absolutely CAN target specific muscle groups.'\nContinuing with her advice, she added: 'This is where resistance training comes in. Body strength exercises, weight lifting, whatever it is, if your muscle starts to burn and eventually exhaust, you are officially body building.\n'No, this does not mean you will not get huge. Yes, this does mean you will change your body beyond belief.'\nBuff babe: Another of her recent snaps showed Chloe's impressive muscular yet still slender arms","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420769/Chloe-Madeley-shares-inspirational-snaps-exposes-rock-hard-abs-skimpy-bikini.html"}
