{"authors":[],"date_download":"2018-10-30 19:49:19","date_modify":"2018-10-30 19:49:19","date_publish":"2018-07-11 20:52:00","description":"Children’s Healthcare of Atlanta announced Tuesday that the Center for Advanced Pediatrics, a 260,0000-square-foot outpatient facility, will open July 24 in Brookhaven in DeKalb County.","filename":"data/vaneerConsumption/CHOAannouncesopeningdateforfirstpartofmassiveexpansion.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/11/Images/5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_choa-announces-o_91beadbfb743833a777c08e60f75c9b5__1540928959.html","title":"CHOA announces opening date for first part of massive expansion","title_page":"CHOA announces opening date for first part of massive expansion","title_rss":"NULL","source_domain":"ajc.com","text":"Children’s Healthcare of Atlanta announced Tuesday that the Center for Advanced Pediatrics, a 260,0000-square-foot outpatient facility, will open July 24.\nThe new center is billed as “the only one of its kind in Georgia” and will include multiple pediatric clinics, programs and specialists.\nThe center is the first structure completed at the planned Children’s North Druid Hills Campus, a major pediatric medical campus in the works at the site, which is located at the intersection of North Druid Hills Road and I-85 in Brookhaven. CHOA also intends to build a hospital, support staff offices and more than 20 acres of greenspace and miles of walking trails and paths.\nREAD: Good things coming for notorious, crime-infested DeKalb complex?\nREAD: Here are the plans for the new North DeKalb Mall and Costco\nThe Center for Advanced Pediatrics, which broke ground in January 2017, will have more than 450 physicians and employees who expect more than 100,000 outpatient visits the first year, a news release said.\n“This is a groundbreaking moment for the entire Children’s team and our community of patient families, supporters and donors,” said Donna Hyland, chief executive officer at CHOA. “The opening of the Center for Advanced Pediatrics marks a key milestone in our North Druid Hills Campus journey.”\nFor more on the center and the other plans at the site, visit www.choa.org/breakingnewground.\nLike DeKalb County News Now on Facebook | Follow on Twitter\nIn other news:","url":"https://www.ajc.com/news/local/choa-announces-opening-date-for-first-part-massive-expansion/0SYDOClevGmVe4YbtUOvoK/"}
