{"authors":["Associated Press"],"date_download":"2018-10-23 03:37:51","date_modify":"2018-10-23 03:37:51","date_publish":"2017-03-10 13:14:10","description":"NAIROBI, Kenya (AP) - South Sudan's cholera outbreak has reached the country's second-largest city, the United Nations said Friday, while the number of cases...","filename":"data/vaneerConsumption/CholerareachesSouthSudanssecondlargestcityUNsays.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4301268_Cholera-reaches-South-Sudans-second-largest-city-UN-says_1540265871.html","title":"Cholera reaches South Sudan's second-largest city, UN says","title_page":"Cholera reaches South Sudan's second-largest city, UN says | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NAIROBI, Kenya (AP) - South Sudan's cholera outbreak has reached the country's second-largest city, the United Nations said Friday, while the number of cases nationwide has risen beyond 5,500.\nThe U.N. humanitarian agency said cases of the sometimes fatal gastrointestinal disease have been confirmed in Malakal, which has been ravaged by the country's three-year civil war.\nCholera now has been confirmed in 14 of South Sudan's counties, with at least 137 deaths since June.\nThose counties include the two that recently were declared to be in the grip of famine, Mayendit and Leer.\nBut the cholera response in Mayendit remains disrupted after local authorities told aid workers late last month to leave the area because of fighting, the deputy spokesman for the U.N. secretary-general, Farhan Haq, told reporters on Friday.\nMany of South Sudan's cholera cases have been reported around the capital, Juba.\nCholera is a fast-developing, highly contagious infection that can spread in areas without clean drinking water and with poor sanitation.","url":"https://www.dailymail.co.uk/wires/ap/article-4301268/Cholera-reaches-South-Sudans-second-largest-city-UN-says.html"}
