{"authors":["Matilda Rudd For Daily Mail Australia"],"date_download":"2018-10-22 21:46:16","date_modify":"2018-10-22 21:46:16","date_publish":"2017-04-26 02:53:53","description":"Chontel Duncan, 27, from Queensland, has announced her second pregnancy. She already has a healthy one-year-old son, Jeremiah, with her personal trainer husband Sam.","filename":"data/vaneerConsumption/ChontelDuncanannouncesshesfourmonthspregnant.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/02/3F9BB27800000578-0-image-a-4_1493171348536.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4445850_Chontel-Duncan-announces-s-four-months-pregnant_1540244776.html","title":"Chontel Duncan announces she's four months pregnant","title_page":"Chontel Duncan announces she's four months pregnant  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Founder of HIIT Australia and mum-of-one Chontel Duncan has announced she is pregnant with baby number two.\nShe gave birth to a healthy baby boy, Jeremiah, in March 2016 and revealed on Tuesday that she is over four months pregnant again.\nThe 27-year-old was placed under severe scrutiny during her last pregnancy for having rock hard abs well into her third trimester.\nDespite this Chontel has decided to 'open up' and vlog her day-to-day experiences for her 576,000 followers on social media.\nScroll down for video\nChontel Duncan and her one-year-old son Jeremiah are expecting another family member in a few months\nPreviously, the fitness star shared this picture to her Instagram, showing the difference in her body just two days before giving birth and one day after her emergency caesearean\n'I have finally built up the courage to open up another journey of my life with you all,' she said in an Instagram video.\n'I have fear, I have so much fear actually. There is always going to be the negative side and I guess with any journey the fear is the unknown.\n'All I can really do is my best.'\nAt this point in the video Chontel explained the good news: She and husband Sam, who is also a personal trainer and co-owner of HIIT Australia, are expecting.\n'Come September we will be welcoming baby number two into the Duncan residence.\n'Yes, that means I'm pregnant! I'm over four months pregnant and we're so happy and cannot wait to meet baby number two.\nThe mum-of-one will vlog the duration of her pregnancy via her Youtube channel in hopes of reaching out to other women (pictured here in the online video)\n'I hope by sharing my journey I can inspire, educate and motivate and help just one person.'\nThe mum-of-one will vlog the duration of her pregnancy via her Youtube channel in hopes of reaching out to other women.\n'This time I'm doing things a little differently and adding in vlogging on my Youtube channel... to show you how I'm coping with baby number two.'\n'But guys we're expecting,' she said.\nThe mum-of-one juggles working out and running a business with raising Jeremiah\nThis isn't the first time Chontel has shared her life with the public.\nIn March last year the 27-year-old gave birth to her son Jeremiah via an emergency C-section, after complications left her unable to give birth vaginally as she had hoped.\nThe HIIT founder opened up about her birth experience and revealed that her strong core actually made it difficult for doctors to deliver her son.\n39 weeks: Australian personal trainer, Chontel Duncan, made headlines after rocking an amazing set of abs for the majority of her pregnancy\n'They struggled': Now, seven months on, the HIIT founder has revealed that her strong core made it difficult for doctors to deliver her son and shared a photo of her scar (pictured)\n'I CRIED I felt like I failed... but then Sam reminded me of my mantra which was \"to go through all means necessary so baby feels nothing\",' Ms Duncan wrote on Instagram, referring to the moment she was told she needed a C-section.\n'With confidence I signed the forms & within 20 mins had my baby in my arms. They struggled to rip Jeremiah from my tummy as my abs locked him in super tight as I began vomiting during the operation.\n'This is why my scar was cut up on my right side because the surgeon had to cut me further and use forceps to successfully get Jeremiah out. Perhaps a down side to a strong core.'\nFirst meeting: 'They struggled to rip Jeremiah from my tummy as my abs locked him in super tight as I began vomiting during the operation,' Ms Duncan wrote\n'Perhaps a down side to a strong core': 'This is why my scar was cut up on my right side because the surgeon had to cut me further and use forceps to successfully get Jeremiah out,' she wrote\nDoting mum: Despite the complications, Ms Duncan said she 'healed normally' according to her doctor but has a 'large scar'\nDespite the complications, Ms Duncan said she 'healed normally' but has a 'large scar.'\n'My scar isn't small, it's quiet large & I can feel in the centre scar tissue,' she continued.\n'I tried Bepanthen Scar Treatment & Skincerity breathable masque an this is what I have been left with. I would love 3 more children & I will always try for a vaginal birth with each one.\n'So to all the women out there wearing a cesarean scar, I am VERY proud of what mine means & for the beautiful gift I received through mine. They are memories of the day we all became mummies .'\nProud mother: 'So to all the women out there wearing a cesarean scar, I am VERY proud of what mine means & for the beautiful gift I received through mine,' she concluded\nBounced back: Ms Duncan's post has since been liked close to 12,000 times, with hundreds of mothers praising the trainer for sharing the experience\nMs Duncan's post was liked more than 12,000 times, with hundreds of mothers praising the trainer for sharing the experience.\n'You are so encouraging and powerful! I too, had a c section due to my son being breech. It does not make us any less of a mother or mean that we failed by any means,' one woman wrote.\n'Thank you so much for sharing your story. As someone who loves health & fitness and wants kids one day your honesty and realism is so inspiring,' another wrote.\nToned: After being given the all clear by doctors to return to exercise, Ms Duncan got straight back into her intense exercise regime and regularly shares inspiring snaps with followers\nAfter being given the all clear by doctors to return to exercise, Ms Duncan got back into her intense exercise regime shortly after birth and regularly shares inspiring snaps with her followers.\n'Woke up at 3:30am to kick start my day, first meeting at 7am, catch up with my girls at 8am & back on the grind in the office by 9:30am,' she wrote.","url":"https://www.dailymail.co.uk/femail/article-4445850/Chontel-Duncan-announces-s-four-months-pregnant.html"}
