{"authors":["Frank Coletta For Daily Mail Australia"],"date_download":"2018-10-22 22:47:59","date_modify":"2018-10-22 22:47:59","date_publish":"2016-01-11 04:00:26","description":"Shark hunter Chris Micallef says holidaymakers aren't taking the threat seriously enough after catching four sharks in the Hastings River in just two weeks including a 3 metre 'beast'.","filename":"data/vaneerConsumption/ChrisMicallefcatches4sharksin2weeksinHastingsRiveratPortMacquarie.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/04/3004D07500000578-0-image-a-142_1452487161545.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393233_Fishermen-catches-four-sharks-two-weeks-including-three-metre-beast-lost-NINE-Australian-river-popular-water-skiers-swimmers_1540248479.html","title":"Chris Micallef catches 4 sharks in 2 weeks in Hastings River at Port Macquarie","title_page":"Chris Micallef catches 4 sharks in 2 weeks in Hastings River at Port Macquarie | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Port Macquarie shark hunter Chris Micallef has caught four sharks in the Hastings River in just two weeks and claims nine more got away.\nMicallef, 22, and his father Anthony fought for more than two and half hours on Saturday night as they reeled in their latest catch, a three-metre-plus 250 kilogram bull shark.\n'The beast' was released by the young angler who said despite the surge in numbers of sharks being reeled in, many people weren't taking the threat seriously.\nScroll down for video\nChris Micallef pictured with the three metre bull shark reeled in by him and his father on Saturday night\nAnthony Micallef snared the bull shark with his son Chris on the Hastings River in Port Macquarie\nChris Micallef believes the three metre shark weighed between 200 and 250 kilograms\nFather and son spent more than two and a half hours fighting with the bull shark\nThe stretch of water at Port Macquarie is a holidaymakers hot-spot, popular with water skiers and swimmers alike.\n'You don't expect to see it where people are skiing and swimming, there's a holiday area right there,' Chris Micallef said.\n'It was big, too big and we had to push him back in, but it was the fourth shark in two weeks I've caught, I've lost nine too.\n'I've even seen dogs playing in there, I think people need to be aware they are there.'\nMicallef's passion for shark angling began at age 15.\n'That spot isn't a regular thing for me, been going there for the last couple of weeks and before then it was Kempsey where I really started,' he said.\nWhile his catches vary in size and weight, some are just 20 kilograms, Micallef insists there are many more 'beasts' lurking in the river.\nFellow Port Macquarie fishermen Denis Rivers pulled in this bull shark just last month from the same spot\nChris Micallef has been angling for sharks since the age of 15\nThe bull shark was the fourth caught by Chris Micallef in under two weeks on the Hastings River\nChris Micallef says he has even caught smaller sharks from a kayak\n'We have had two really big ones in just one month so I can almost guarantee there would have been five like that around here in the same time.'\nA friend, Denis Rivers, caught 'a monster' just a few weeks before in the same area.\nChris Micallef said he has even snared sharks while sitting in a kayak.\n'It's a weird attitude that society has got, if somebody posts a photo of them catching a bream or a dead jewfish no one has a problem but people would be going crazy if I killed it (the shark),' he said.\n'People take the whole don't kill a shark thing too far and as a result there are a whole heap of them there in numbers, a lot more now than ever.","url":"https://www.dailymail.co.uk/news/article-3393233/Fishermen-catches-four-sharks-two-weeks-including-three-metre-beast-lost-NINE-Australian-river-popular-water-skiers-swimmers.html"}
