{"authors":["Kadeen Griffiths"],"date_download":"2018-10-30 22:33:41","date_modify":"2018-10-30 22:33:41","date_publish":"2014-08-15 11:31:06","description":"When Chris Brown released \"New Flame\" featuring Usher and Rick Ross, the song sounded very... Chris Brown. That might not sound like a bad thing and it wasn't, necessarily, but as the first single to be released after Brown was released from jail I…","filename":"data/vaneerConsumption/ChrisBrownsNewFlameMusicVideoIsaFieryDancePartyThatsJustWhattheSongNeededVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/0ce8883f-273f-4cee-a9fd-92e28a952100.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35891-chris-browns-new-flame-music-video-is-a-fiery-dance-party-thats-just-what-the-song_1540938821.html","title":"Chris Brown's \"New Flame\" Music Video Is a Fiery Dance Party That's Just What the Song Needed - VIDEO","title_page":"Chris Brown's \"New Flame\" Music Video Is a Fiery Dance Party That's Just What the Song Needed — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"When Chris Brown released \"New Flame\" featuring Usher and Rick Ross, the song sounded very... Chris Brown. That might not sound like a bad thing and it wasn't, necessarily, but as the first single to be released after Brown was released from jail I guess I was expecting something with a little more pizazz. Something a little more flashy. I mean, this is the same man who released a dance video while he was still incarcerated and \"New Flame\" is what he came up with when he was out? Come on, Brown. Come on. However, Brown's \"New Flame\" video makes up for everything that the single itself was lacking. Essentially, it's another dance video, but it's one that benefits from the fact that Brown's not the only dancer in it.\nThe video opens on Brown dressed all in white as he sings the first verses of the song in front of a flaming symbol and/or surrounded by beautiful (and occasionally wet) women. He's later joined by Usher, also dressed in white and surrounded by beautiful women. Finally, Rick Ross — half-dressed in white — joins the song for his verse, intercut with images of Brown and Usher. The whole time, Brown and Usher are doing what they do best. No, not singing, although they do that well too: dancing. Whether they're dancing alone, together, or with an entire ensemble of backup dancers, Brown and Usher are showing off slick moves that really add something to the song that was missing before.\n\"New Flame\" sounds more like the old Chris Brown than you would expect Brown to sound after his stint in prison, but I still think that was the entire point of the single. Brown is trying to show his fans that he hasn't changed, that he's still the same love-song crooning singer and dancer that he's always been no matter what's happened to him in the past. Anyone who wasn't already on Team Breezy and is looking to be impressed should probably move on, but for those on Team Breezy who have been waiting for new music and videos from Brown then this is right up your alley.\nWatch the video below.\nChrisBrownVEVO on YouTube\nImage: YouTube","url":"https://www.bustle.com/articles/35891-chris-browns-new-flame-music-video-is-a-fiery-dance-party-thats-just-what-the-song"}
