{"authors":[],"date_download":"2018-10-30 21:53:39","date_modify":"2018-10-30 21:53:39","date_publish":"2016-12-20 00:00:00","description":"Flashback Photos: Christmas in Atlanta from 1920-1980.","filename":"data/vaneerConsumption/ChristmasinAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/MyAJC/2016/12/20/Images/christmas5.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_holiday_flashbac_573ce5674ece1b5cdd874ac1e5b55a99__1540936419.html","title":"Christmas in Atlanta","title_page":"Flashback Photos: Christmas in Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 36\nAJC FILE Whether celebrating age-old traditions or trying to sneak a peek at Santa Claus, Atlantans share joy and glad tidings each December when Christmas nears. Children surround Santa Claus as he parades through Atlanta in this 1920s photo. Note the Journal delivery truck in the background at top left.\n2 / 36\nAJC FILE Here, the late Atlanta Mayor Maynard Jackson, shown here donning a Santa suit and giving that Jolly Old Elf from the North Pole a helping hand with the youngsters down south back on Dec. 23, 1980.\n3 / 36\nCalvin Cruce / AJC File Bet Santa never has trouble finding these houses. The sign at the LaVista Road/Christmas Lane intersection is all set for the season in this 1986 photo.\n4 / 36\nMarion Crowe / AJC File Tommy Nobis, Carlton Dabney (background) and other members of the Atlanta Falcons record a Christmas carol for fans in this 1970 photo.\n5 / 36\nBud Skinner / AJC File This 8.5-ton, 120-foot-high Christmas tree towered over the old skating rink inside the Omni International hotel on November 29, 1980.\n6 / 36\nAJC FILE From tiny seeds mighty trees grow. In this 1930s photo, Buster Harris shows off a giant pine cone from which Christmas tree seeds come.\n7 / 36\nAJC FILE And you thought the line at the mall yesterday was long: Atlantans crowded into this arctic-themed entrance to see Santa Claus and his reindeer during Christmas in the 1920s. Some things never change.\n8 / 36\nDwight Ross Jr. / AJC File Former Atlanta mayor Ivan Allen Jr. enjoyed Christmas every day. That’s because his dog, shown with Allen in this 1981 photo, was named Christmas. But we’d guess that the late mayor was keen on the holiday, too.\n9 / 36\nFloyd Jillson / AJC File Here’s the original caption from this 1951 photo: “Slick streets and the glare of hundreds of automobile lights produced this confused scene on downtown Forsyth Street, looking north from Union Station. It happened during Friday night's biggest traffic jam of the current Christmas shopping season.\"\n10 / 36\nBill Grimes / AJC File These men enjoyed a hot dinner and some Christmas cheer at an Atlanta homeless shelter on December 26, 1973.\n11 / 36\nAJC FILE Atlanta residents line up to see Santa Claus in a Christmas parade in this 1920s photo.\n12 / 36\nDavid A. Lennox, Jr. Photographs / GSU Special Collections Santa seems a little surprised in this photo from the 1930s or 1940s that was taken in Atlanta.\n13 / 36\nAJC FILE This 1940s photo of Christmas decorations for home staircases proves that decking the halls is nothing new. (It may be a little flashier now, though.)\n14 / 36\nAJC FILE Shopping with Mom is a fine old Atlanta Christmas tradition...\n15 / 36\nAJC FILE Another undated downtown tree lighting on Forsyth Street photo. The floors under the tree were called the Crystal Bridge.\n16 / 36\nLANE BROS. PHOTOGRAPHIC COLLECTION / GSU Meanwhile, just up the street at Rich's downtown rival department store, Davison's, \"Santa Claus on a crane\" was drawing the crowds, too. Or at least drawing some stares from onlookers, we'd wager.\n17 / 36\nLANE BROS. PHOTOGRAPHIC COLLECTION / GSU But really now, does anything quite say \"Christmas\" like a giant fiberglass Santa welcoming shoppers at your open-air pedestrian mall? The folks at Stewart-Lakewood Shopping Center didn't think so.\n18 / 36\nAJC FILE Then again, making your way into the department store or the shopping center to see a Great Tree, a Santa on a Crane or Giant Fiberglass Santa demanded engaging in yet another Atlanta area holiday tradition: finding that kind soul willing to give the gift of ... a parking space. This was the scene around Christmas time at Atlanta's Lenox Square shopping center in the 1960s. (Some traditions never change.)\n19 / 36\nEach Christmas, the late Rev. Hosea Williams hosted a dinner for Atlanta's hungry, reminding us that giving of ourselves remains the most worthwhile gift we can offer others. Hosea's Feed the Hungry remains an Atlanta holiday tradition, now bringing sustenance and comfort to those in need at various times throughout the year.\n20 / 36\nA visit from Santa brightened the day for youngsters Judy Reliford and Harold Hicks at the Aidmore Hospital in this 1956 photo.\n21 / 36\nLANE BROS. PHOTOGRAPHIC COLLECTION / GSU All this gaggle of youngsters wants for Christmas is anything that Santa's got to offer at this Georgia Power Company \"kid party at Legion Hall\" on Dec. 23, 1941.\n22 / 36\nAJC FILE The original caption for this photo reads \"Hippie youth decorate a Christmas tree, Dec. 23, 1969.\" We're guessing that Santa, known for his lengthy beard and colorful dress, likely had no issue at all with the styles shown here.\n23 / 36\nLANE BROS. PHOTOGRAPHIC COLLECTION / GSU The old Peachtree Arcade is all dolled up for Christmas in this 1940s-era photo...\n24 / 36\n... and so is the Stone Mountain Memorial, Dec. 18, 1970.\n25 / 36\nLANE BROS. PHOTOGRAPHIC COLLECTION / GSU Some folks prefer love, sure, but this Standard Oil gas station worker had his Christmas sales display to keep him warm, Dec. 1967.\n26 / 36\nAJC FILE And maybe The Man With The Bag had a little help with keeping tabs on who was naughty and who was nice from Jerry Mandel, founder of Jerry's Pawn Shop, shown in the shop as it was decorated for Christmas time and New Year's, Dec. 1978.\n27 / 36\nLANE BROS. PHOTOGRAPHIC COLLECTION / GSU Santa's little helpers take to the airwaves with old St. Nick on Dec. 18, 1947, at WBGE Radio.\n28 / 36\nLANE BROS. PHOTOGRAPHIC COLLECTION / GSU This swingin' jazz combo entertained at the Elks Club for a Dec. 16, 1955, Christmas party given by the Davison-Paxon Company.\n29 / 36\nLANE BROS. PHOTOGRAPHIC COLLECTION / GSU Onlookers enjoy the sights at a Dec. 1, 1950 Christmas parade in Atlanta.\n30 / 36\nNothing fancy about this operation as C.H. Bishop (right) and William T. Brownlee cut a pine for use as a Christmas tree in Lilburn, Dec. 1941.\n31 / 36\nThe Christmas nativity scene in front of the old Gwinnett County Courthouse in Lawrenceville makes for a pretty scene, Dec. 1959.\n32 / 36\nLANE BROS. PHOTOGRAPHIC COLLECTION / GSU Davison's spared no expense on intricate Christmas decorations, including these lifelike figurines, which were arrayed throughout the old downtown Atlanta location off Peachtree Street, Dec. 1948.\n33 / 36\nTRACY O' NEAL PHOTOGRAPHIC COLLECTION / GSU The Formwalt Girls Club entertains youngsters at a Christmas event, Dec. 1964.\n34 / 36\nLANE BROS. PHOTOGRAPHIC COLLECTION / GSU These World War II-era soldiers enjoyed a happy holiday at a USO Servicemens' Center in Atlanta, Dec. 1943.\n35 / 36\nLANE BROS. PHOTOGRAPHIC COLLECTION / GSU We love the variety of expressions on the faces of these children getting a special greeting from Santa at the Henry Grady Hotel Christmas party, Dec. 1954. Clearly some youngsters were merrier than others.\n36 / 36","url":"https://www.ajc.com/lifestyles/holiday/flashback-photos-christmas-atlanta-1920-1980/ScQgOOPT7TdXQhTXaynRbP/"}
