{"authors":[],"date_download":"2018-10-30 01:07:52","date_modify":"2018-10-30 01:07:52","date_publish":"2018-07-10 22:12:19","description":null,"filename":"data/vaneerConsumption/ChristiansFaceMoreThreatsThanBokoHaraminNigeria.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/Nigerian-Military.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861672.html","title":"Christians Face More Threats Than Boko Haram in Nigeria","title_page":"Christians Face More Threats Than Boko Haram in NigeriaThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"On Monday, Nigerian forces transferred 183 children to UNICEF and the civilian portions of the government. Unlike the United States, which has been detaining children due to immigration status, Nigeria was holding these children on suspicion of involvement with the barbaric Islamist group Boko Haram. When the children were no longer determined to be a threat, they were transferred to UNICEF for rehabilitation, a difficult process that will help them overcome the horrors they saw and even committed while being under Boko Haram’s control. Boko Haram is infamous for using children, particularly young girls, as suicide bombers. While there were potential security risks in releasing these children, it is good to know they are on the road to recovery.\nSince 2009, Boko Haram has been engaged in a bloody bush war in Nigeria and surrounding countries. The group gained international attention in 2014 with the kidnapping of hundreds of schoolgirls in Chibok. While this is the most widely known Boko Haram activity, they have also been known to burn schoolboys alive and execute entire villages full of Christians.\nBoko Haram, which roughly translates to “Western Education Forbidden,” is a hardline Islamist group. To these terrorists, religious freedom, women’s rights, and dissent are all strictly off limits, and death is the punishment for not complying with their demands. The group is also allied to the now largely defunct Islamic State.\nWhile the Islamic State has largely been booted out of its physical caliphate, Boko Haram continues to control territory in Northern Nigeria, where they rule with an iron fist. The Nigerian military has been hard at work weeding this cancer out of their country, with help from the United States.\nThe United States and Nigeria have been cooperating against Islamic terrorist groups for quite some time with efforts including training and equipment sales. Interestingly enough, Nigeria is also cooperating with Russia to combat terrorism in their country. While U.S. and Russian relations are currently strained due to alleged election interference and Russian aggression in Eastern Europe, combatting terrorism is an area that the United States and Russia consistently cooperate on.\nWhile Boko Haram is being beaten back due to strong military efforts, persecuted groups, particularly Christians, still face tremendous trials and tribulations. While Boko Haram continues to threaten Christians practicing in Nigeria, they face a new threat.\nIn recent months, members of the Fulani ethnic group, which is largely nomadic and Islamic, have been mercilessly slaughtering Christians. In late June, 238 people were killed in a largely Christian village. The Fulani are attempting to take land from Christians as well as erase their religion from the region.\nThis year, at least 6,000 Christians in Nigeria have been killed for their beliefs, largely at the hands of Fulani herdsmen. The government claims that these attacks are isolated clashes between farmers and herdsmen, denying the accusations of genocide. This mirrors the situation in which Boer farmers are being killed in South Africa.\nWhen President Trump met with Nigerian president Muhammadu Buhari in April he stated that “We are deeply concerned by religious violence in Nigeria including the burning of churches and the killing and persecution of Christians. It’s a horrible story.” While the United States and Nigeria have been cooperating to combat the anti-Christian violence that Boko Haram is committing in Nigeria, there have not been serious efforts to combat this violence.\nAt a time when religious persecution is on the rise around the world, this is one of the starkest examples of the horrors that Christians face outside of the Western world. The Trump administration has been serious about protecting religious freedom at home and abroad, and they must act swiftly and strongly to respond to this ongoing crisis that is affecting many innocent people in Nigeria. While the Nigerian government has been eager to cooperate on fighting Boko Haram, the Fulani massacres have had a more tepid response. The United States must make it clear that this new wave of persecution will also not be tolerated.","url":"https://spectator.org/christians-face-more-threats-than-boko-haram-in-nigeria/"}
