{"authors":["Jessica Taylor","Ally Mutnick"],"date_download":"2018-10-23 01:06:40","date_modify":"2018-10-23 01:06:40","date_publish":"2015-11-10 00:00:00","description":"The New Jersey governor tried to make Hillary Clinton the target at every turn, but a feisty Bobby Jindal attacked Christie's record and tried to argue that he is the most conservative choice.","filename":"data/vaneerConsumption/ChristieGrabsTheSpotlightInUndercardDebate.json","image_url":"https://media.npr.org/assets/img/2015/11/10/ap_512734678238_wide-62093d2d57557475e797815aca0f67d4a572fcf2.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_11_10_455532919_candidates-try-to-punch-up-in-undercard-debate_1540256800.html","title":"Christie Grabs The Spotlight In Undercard Debate","title_page":"Christie Grabs The Spotlight In Undercard Debate  : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Christie Grabs The Spotlight In Undercard Debate\nEnlarge this image toggle caption Morry Gash/AP Morry Gash/AP\nThe normally staid undercard debate took a feisty turn tonight, with New Jersey Gov. Chris Christie trying to grab the spotlight after being demoted from the main stage and Louisiana Gov. Bobby Jindal attacking him at every turn.\nChristie didn't take the bait for the most part, instead using his answers to try to turn an eye toward the general election with ready attacks against Hillary Clinton.\nBut Jindal was the most forceful he's been in these face-offs, attack the New Jersey governor's record and other rivals, trying to paint himself as the only unwavering conservative in the race.\nThe two appeared to dominate the debate, which was just over an hour long. According to Facebook, Christie was the most discussed candidate on the social network, followed by Jindal.\nThe smaller stage gave Christie and former Arkansas Gov. Mike Huckabee, who was also demoted from the main stage, more time to make their case, and largely candidates had more time and freedom than the more crowded debates.\nFormer Pennsylvania Sen. Rick Santorum was again in the undercard debate, but both South Carolina Sen. Lindsey Graham and former New York Gov. George Pataki didn't make the cut for even the lower stage.\nOur liveblog of the debate is below.\n8:10 p.m. Tomorrow is Veterans' Day, and we've moved to talking about veterans issues — but it's noteworthy that the only veteran running in either party (Graham) didn't make this debate. All attack Obama for not respecting the military, and say there has to be more done for veterans once they return from Iraq, and to help aging veterans too.\n\"We've had Vietnam war veterans with tears in their eyes saying nobody has ever thanked them before. We've had World War II veterans' children saying they'd never heard the stories of their parent's heroic sacrifices,\" Jindal bemoans.\nChristie, again, manages to turn the question into an attack on Clinton: \"Hillary Clinton says there's no crisis at the VA that sends a long and hard message to our veterans that she doesn't get it and she doesn't respect their service.\"\n8:03 p.m. All the Republicans are critical of the Federal Reserve and current fed policy. \"The feds should be audited, and the feds should stop playing politics with our money supply. That's what they've done. It's been the wrong thing to do. It's hurting the American economy,\" Christie says.\nHuckabee is asked whether he would remove Janet Yellen as chairman. He would, he eventually says, but not before making a joke that his wife's name is Janet and her name reminds him of \"Janet yelling\" at him.\n7:54 p.m. Huckabee is having to defend his flat tax proposal, or \"Fair Tax\" as he calls it, which would certainly be a controversial one if he were the nominee. Would it actually hurt the economy by discouraging spending? \"Do you know an American that will just stop spending? I don't,\" he laughs. \"Americans are not going to quit shopping. Americans are not going to quit buying. But it would be nice if Americans could control how much they paid in tax rather than having the government reach into their pockets and take it out before they ever had a chance to even see it, much less spend it. And that's why the fair tax makes a heck of a lot more sense than punishing productivity and rewarding irresponsibility.\"\n7:43 p.m. CNBC moderators ask the candidates to name a Democrat they admire. Ha, silly moderators — Jindal uses it to make comparisons to CNBC moderators at last month's debate and says he's not answering any silly questions like that. Huckabee uses it to praise veterans ahead of Veterans' Day tomorrow and point to problems in the VA. Christie defends police officers. Santorum answers an infrastructure question but says he does admire the fight Democrats have — actually, he screamed the word fight into the microphone. So much for that laryngitis he says he had.\n7:40 p.m. Christie is trying to make the case that he's the most electable general election candidate, having won twice in a blue state. Santorum tries to take that message too, pointing to his wins in Pennsylvania. But the big, big wrinkle he always leaves out — he lost big in 2006 for reelection.\n7:35 p.m. Jindal — who's in his fourth straight undercard debate — is punching hard against his rivals, hitting their records and saying he's the only one has cut government and is a consistent conservative.\nWhen he tries to attack Christie though, he isn't having any of it and doesn't take the bait. Once again, he takes the opportunity to turn the attack back at Clinton. \"Chris, I'll give you a ribbon for participation & a juice box.\"\nChristie again doesn't bite though, and turns the page back to Clinton.\n7:32 p.m. Here's an interesting bit of news: when Christie is asked about China and cyberwarfare, he says he was a victim of a hack and had his social security number stolen by Chinese hackers from when he was a U.S. attorney.\nHe takes the harshest tone of the night: \"If the Chinese commit cyber warfare against us, they are going to see cyber warfare like they have never seen before...The information we take we will make sure all the Chinese people see it. That will have fun in Beijing when we show them how they're spending their money.\"\nAnd he also promises: \"I'll fly Air Force One over those islands they'll know we mean business.\"\n7:28 p.m. There aren't a lot of differences between some Republican candidates, but here's a big one on the stage tonight — Santorum gives a passionate defense of the Ex-Im bank which conservatives loathe and tried to kill. But he sees it as crucial to protecting manufacturing jobs.\n7:25 p.m. Jindal and Huckabee are going back and forth on their records as governor, but Christie has had a much different target tonight — he's managed to turn every question back as a direct hit on Democratic frontrunner Hillary Clinton.\n\"Wait until you see what Hillary Clinton will do to the country and how she will drown us in debt. She is the real adversary,\" Christie said. \"Believe me — Hillary Clinton's coming for your wallet. Everybody, don't worry about Huckabee or Jindal, worry about her.\"\n7:20 p.m. Jindal is going for the jugular, hitting not just his fellow governors for not doing enough to cut government but pointing the fingers at senators running (most of whom are on the main stage.\" Alluding to much-hyped filibusters that Texas Sen. Ted Cruz and Kentucky Sen. Rand Paul have waged, he says, quite vividly, that as soon as they walk off the Senate floor after hours to relieve themselves in the bathroom, \"their cause and the toilets get flushed at the same time.\"\n7:15 p.m. Huckabee defends his plan to protect entitlements — a sure way to woo senior voters. \"You paid for it and you shouldn't have to pay the penalty because the government screwed it up.\"\n7:13 p.m. This is an economic debate, but Santorum — who won the Iowa caucuses on 2012 with social conservative support — turns a question about tax reform into one about family. \"We've incentivized people not to marry, we incentivized people to co-habitate, not marry.\"\n7:05 p.m. Christie uses his first question to do what he does best: story telling. Namedropping New Hampshire (where he has to do well to survive) he tells a story of a woman who was worried about how to pay her bills. The answer, he says, isn't more government. \"It is suffocating small business, it is suffocating the folks trying to make a living.\"\nHe talks about reforming the tax code, and his biggest line is when he proclaims he would look forward to \"firing a bunch of IRS agents.\" Minutes later, Huckabee takes it even further — talking about his flat tax plan, he says he wouldn't just fire some people at the IRS, he would eliminate it completely \"because the government has no business knowing how much money we make and how we made it.\"","url":"https://www.npr.org/2015/11/10/455532919/candidates-try-to-punch-up-in-undercard-debate"}
