{"authors":["Jennifer Brett"],"date_download":"2018-10-30 21:34:01","date_modify":"2018-10-30 21:34:01","date_publish":"2015-05-15 12:32:29","description":"\"Captain America: Civil War\" stars Chris Evans, Scarlett Johansson and Anthony Mackie...","filename":"data/vaneerConsumption/ChrisEvansScarlettJohanssonandAnthonyMackiefilmCaptainAmeri.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_buzz_chris-evans-scarl_9a3b5bc4ba5f7d07dfb7ffc93781a475__1540935241.html","title":"Chris Evans, Scarlett Johansson and Anthony Mackie film \"Captain Ameri","title_page":"Chris Evans, Scarlett Johansson and Anthony Mackie film \"Captain Ameri","title_rss":"NULL","source_domain":"ajc.com","text":"\"Captain America: Civil War\" stars Chris Evans, Scarlett Johansson and Anthony Mackie filmed an action-packed scene in downtown Atlanta on Friday, after filming in Midtown and Buckhead earlier in the week. The project needs extras for a scene to film on Monday. Click here for details.\nUPDATES:\nChris Evans suits up for \"Captain America: Civil War\"\n“Captain America” stars cheer on the Atlanta Hawks\nScarlett Johansson, Chris Evans spotted in Buckhead\nChris Evans films a scene from \"Captain America: Civil War.\" PHOTO: Jennifer Brett, jbrett@ajc.com\nScarlett Johansson on the \"Captain America: Civil War\" set. Photo: Atlanta Filming\nChris Evans straps on his \"Captain America\" helmet before filming. PHOTO: Jennifer Brett, jbrett@ajc.com\nIt's an action-packed scene! PHOTO: Jennifer Brett, jbrett@ajc.com\nChris Evans films a scene from \"Captain America: Civil War\" in downtown Atlanta. PHOTO: Jennifer Brett, jbrett@ajc.com\nAnthony Mackie on the set of \"Captain America: Civil War.\" PHOTO: Jennifer Brett, jbrett@ajc.com\nAnthony Mackie on set at \"Captain America: Civil War.\" PHOTO: Jennifer Brett, jbrett@ajc.com\nChris Evans' stunt double for \"Captain America\" lives up to heroic status by handing out water to extras on the set of \"Captain America: Civil War.\" It is filming in downtown Atlanta. PHOTO: Jennifer Brett, jbrett@ajc.com\nMORE COVERAGE:\nPhotos from the Buckhead “Captain America” set\nPhotos from the Midtown “Captain America” set\nChris Evans spotted toning his “monster” physique at Atlanta gym\n“Captain America: Civil War” films in downtown Atlanta","url":"https://www.ajc.com/blog/buzz/chris-evans-scarlett-johansson-and-anthony-mackie-film-captain-america-downtown-atlanta/6j7DmwLdznTrp2gOiCpI3J/"}
