{"authors":["Ross Mcdonagh For Dailymail.Com"],"date_download":"2018-10-22 21:36:27","date_modify":"2018-10-22 21:36:27","date_publish":"2016-01-28 08:04:30","description":"The 34-year-old was spotted with his face all busted up, sporting a sizeable bruise on his left cheek with a matching fat lip on the right, topping it all off with a rather forlorn expression","filename":"data/vaneerConsumption/ChrisEvansbruisedafterIronManfightonCaptainAmericaCivilWarset.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/07/30A6AA0B00000578-0-image-a-44_1453966738267.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420499_Chris-Evans-bears-scars-tussle-Iron-Man-set-Captain-America-Civil-War_1540244187.html","title":"Chris Evans bruised after Iron Man fight on Captain America Civil War set","title_page":"Chris Evans bruised after Iron Man fight on Captain America Civil War set | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"If you got a smack of a repulsor gauntlet in the face, you'd have a mark too.\nChris Evans looked like he was having a rough day at the office on Wednesday on the set of Captain America: Civil War.\nThe 34-year-old was spotted with his face all busted up, sporting a sizeable bruise on his left cheek with a matching fat lip on the right, topping it all off with a rather forlorn expression.\nBattered and bruised: Chris Evans bore the scars of a tussle with Iron Man on the set of Captain America: Civil War on Wednesday\nThere are very few people in the Marvel Universe who could do that sort of damage to the super soldier Steve Rodgers.\nBut as the trailer for the upcoming comic book blockbuster movie has already shown, it is actually one of his fellow Avengers who is responsible.\nCivil War tells the story of new government laws being introduced to regulate superheros, which divides the entire team into two factions; one lead by Captain America who resists it, the other by Robert Downey Jr's Iron Man, who wants to enforce it.\nIron fist: The 34-year-old was spotted with his face all busted up, sporting a sizeable bruise on his left cheek with a matching fat lip on the right, topping it all off with a rather forlorn expression\nThe adrenaline pumping trailer for the latest chapter in the Marvel Cinematic Universe shows the two former friends kicking lumps out of each other in a mouth-watering matchup.\nIt also shows where their team-mates ally themselves: The Winter Solder, The Scarlett Witch, The Falcon and Hawkeye line-up behind the Cap, while Black Widow, War Machine and The Vision unite behind Tony Stark - as does newcomer Black Panther.\nAlso spotted on set on Wednesday was the man who plays him, 42 and Get On Up star Chadwick Boseman.\nScrap: As the trailer for the upcoming comic book blockbuster movie has already shown, it is actually one of his fellow Avengers who is responsible\nFight! The adrenaline pumping trailer for the latest chapter in the Marvel Cinematic Universe shows the two former friends kicking lumps out of each other in a mouth-watering matchup\nSince his black suit and mask covers every patch of skin, injury make-up didn't appear to be necessary... although unlike many of his his co-stars, he isn't shown taking a beating in the trailer.\nRather in his brief glimpses he is shown laying the smackdown on Bucky Barnes, before wisely fleeing the pursuing Captain America.\nCaptain America: Civil War hits theatres on May 6.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420499/Chris-Evans-bears-scars-tussle-Iron-Man-set-Captain-America-Civil-War.html"}
