{"authors":[],"date_download":"2018-10-30 21:50:28","date_modify":"2018-10-30 21:50:28","date_publish":"2016-12-20 00:00:00","description":"Step into the AJC's Wayback Machine and see how Atlanta has celebrated Christmas from the 1920s to the 1980s.","filename":"data/vaneerConsumption/ChristmasinAtlantafrom19201980.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/20/Videos/5255909648001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_c_4e80a460bd6b063bdee0aa921072d3f2__1540936228.html","title":"Christmas in Atlanta from 1920-1980","title_page":"AJC Flashback Photos: Christmas in Atlanta from 1920-1980","title_rss":"NULL","source_domain":"ajc.com","text":"Atlanta may not enjoy the cold, snowy Christmases depicted in movies, books and TV, but we certainly get into the spirit of the season here -- in our own way.\nThe photo archives here at the Atlanta Journal-Constitution and in the Georgia State University Digital Collections department remind us that even while modern Christmases are Facebooked, Tweeted, Instagrammed and Snapchatted, not much has changed about the holiday.\nWe’re still waiting in line to see Santa (you know, waiting and waiting and...), we crowd the city streets in a frenzied charge to get that last-minute shopping done and we do our part to help those less fortunate by offering them comfort and cheer.\nChildren, parents and other folks celebrating the season surround Santa Claus as he rides through a Christmas parade in Atlanta, 1920.\nOkay, so maybe when we’re having a warmer-than-usual winter Santa sweats a little more than usual in his red suit. We can’t really help that, but we appreciate his turning the reindeer south and delivering joy and happiness along with all those toys.\nAnd now we invite you to step into our Wayback Machine and see how Atlanta has been celebrating Christmas from the 1920s up through the 1980s.\nVIEW ATLANTA'S HISTORY THROUGH THE LENSES OF THE AJC AND GSU DIGITAL COLLECTIONS","url":"https://www.ajc.com/news/local-govt--politics/celebrating-christmas-atlanta-from-1920-1980/kXJuMwQcjHsLEchWyScMSL/"}
