{"authors":["Heidi Parker For Dailymail.Com"],"date_download":"2018-10-23 04:00:31","date_modify":"2018-10-23 04:00:31","date_publish":"2016-01-11 17:00:02","description":"On Sunday at the Globes the 46-year-old actor made it clear he has completely turned his life around when he gave a touching speech as he accepted a Best Supporting Actor award","filename":"data/vaneerConsumption/ChristianSlatermeltsheartswithtributetowifeBrittanyatGoldenGlobes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/300D12D400000578-0-image-a-76_1452531517503.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3394216_Christian-Slater-46-melts-hearts-romantic-tribute-wife-Brittany-Golden-Globes_1540267231.html","title":"Christian Slater melts hearts with tribute to wife Brittany at Golden Globes","title_page":"Christian Slater melts hearts with tribute to wife Brittany at Golden Globes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Christian Slater was the Harry Styles of his day back in the Eighties and Nineties when he had such mega hits as 1988's Heathers and 1990's Pump Up The Volume.\nWild partying and trouble with the law sidelined him for years as did a rocky marriage to beauty Ryan Haddon.\nBut on Sunday evening at the Golden Globe Awards, the 46-year-old actor made it clear he has completely turned his life around when he gave a touching speech as he accepted a Best Supporting Actor award for his turn in Mr Robot.\nScroll down for video\nTouching: Christian Slater said sweet things about his wife Brittany Lopez when accepting his Best Supporting Actor award at the Golden Globes on Sunday\nBashful: The beauty glowed as he said she made him happy; they met in 2013\nSlater seemed surprised and nervous but kept his speech impressive.\n'This is a phenomenal honor,' the actor said.\n'Thank you Sam Esmail for writing such a wonderful character and being such a creative genius.'\nAfter thanking his agents and publicists ('They are backstage freaking out,' he said), Christian focused on his partner.\n'My wife, oh my God, thank you for making me the happiest man alive and you make all my dreams come true,' he gushed.\nThe camera panned to Brittany Lopez, 28, who looked proud of her spouse as she smiled from ear to ear.\nSee more of the latest news and red carpet pictures from the 2016 Golden Globes\nIt's love: After thanking his agents and publicists ('They are backstage freaking out,' he said), Christian focused on his partner. 'My wife, oh my God, thank you for making me the happiest man alive and you make all my dreams come true,' he gushed\nThe beauty, who he married in Coral Gables, Florida, in 2013, wore her hair down and the side part didn't hold, causing locks to fall over her face.\nBut she paid no mind as she was overcome with joy by her husband's speech.\nSlater looked at her with love and pride as she beamed back, becoming nervous and bashful with all the attention paid to her.\nShe did not walk the carpet with the star.\nHonored: Slater seemed surprised and nervous but kept his speech impressive. 'This is a phenomenal honor,' the actor said. 'Thank you Sam Esmail for writing such a wonderful character and being such a creative genius'\nThe Robots: Carly Chaikin, Martin Wallstrom, Slater, Rami Malek, writer/producer Sam Esmail, actress Portia Doubleday and producer Chad Hamilton\nThe actor officially announced his engagement to Brittany in February 2013 during an appearance on Late Night With Jimmy Fallon.\n'Congratulations, you're engaged!' Jimmy said to Slater, who replied, 'Yeah, that's true,' before giving the audience the thumbs-up.\nSlater said that he met Lopez when he was staying on Florida's Little Palm Island a couple years ago.\n'This girl came walking along with another lady, a slightly older lady, and I was sitting in my usual spot eating my oatmeal that morning,' he explained to Fallon.\n'So I'm a filthy old man eating my oatmeal and she comes walking along. This spot, I guess, was famous for people proposing to each other, actually. It was very, very nice. So she's there with this old lady and, next thing I know, she gets down on one knee and proposes to this older lady...I'd seen a lot of crazy stuff down in the Florida Keys! I of course was very intrigued and I went over and sat down in my other usual spot.\nIn character: Slater on the set of his hit show Mr Robot in 2015\n'I thought I'd just witnessed a nice lesbian engagement so I was coming over to say congratulations.\n'But it turns out it was her aunt and she was just trying to help her aunt capture the beauty and the romance of the park...The next thing I knew we were hanging out in the Everglades.'\nSlater has two kids with ex-wife Haddon - a son, Jaden Christopher, and a daughter, Eliana. Slater and Haddon married in 2000 and separated in 2005.\nIn Slater's Globes speech he also said: 'And thank you Hollywood for allowing me to do what I love to do for the last four decades.'\nSlater got his start as a child, making commercials then had a stint on All My Children which led to Takes From The Darkside.\nAfter his success with Heathers and Pump Up The Volume, Christian starred in 1991's Mobsters, 1992's Kuffs and 1993;s Untamed Heart.\nHe worked with Brad Pitt in 1994's Interview With The Vampire and stood out in 2001's 3000 Miles To Graceland.\nAfter that he got guest roles on Alias, The Forgotten and Robot Chicken.\nHis career seemed to fade a bit, but then he got back on TV in a big way with Minda Games, Archer and now Mre Robot.\nLater this year he will appear in King Cobra with James Franco and Molly Ringwald.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3394216/Christian-Slater-46-melts-hearts-romantic-tribute-wife-Brittany-Golden-Globes.html"}
