{"authors":["Jessica Aquilina For Daily Mail Australia"],"date_download":"2018-10-22 20:30:17","date_modify":"2018-10-22 20:30:17","date_publish":"2016-01-28 01:33:29","description":"The couple that dress together","filename":"data/vaneerConsumption/ChrisHemsworthandwifeElsaPatakywearmatchingkhakiinAustralia.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/30A625C700000578-0-image-a-4_1453945577962.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420161_Chris-Hemsworth-wife-Elsa-Pataky-wear-matching-khaki-touch-Australia_1540240217.html","title":"Chris Hemsworth and wife Elsa Pataky wear matching khaki in Australia","title_page":"Chris Hemsworth and wife Elsa Pataky wear matching khaki in Australia | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Chris Hemsworth has returned home with his wife Elsa Pataky after spruiking Australia's famous sites and sounds in New York as part of his new role as global ambassador for Tourism Australia.\nThe famous couple were spotted making their way through busy Brisbane Airport on Thursday morning after a short trip spent away from their three young children - India Rose, aged three, and twins Tristan and Sasha, aged one.\nChris, 32, dressed for ultimate comfort in a loose fitting khaki T-shirt, white washed jeans and a pair of simple blue sneakers.\nScroll down for video\nCoordinating couple! Chris Hemsworth, 32, and wife Elsa Pataky, 39, arrived back in Australia wearing matching khaki on Thursday\nHe completed his cool travel look with multiple bracelets wrapped around each wrist and a watch.\nThe Thor star had his hands full as he juggled wheeling a grey suitcase and garment bag with the left hand and carried his travel wallet and a shopping bag with the other.\nMeanwhile, Elsa, 39, kept a few paces behind her buff hubby as she wheeled a simple black suitcase through the busy terminal.\nSimple but stylish! Chris, 32, dressed for ultimate comfort in a loose fitting khaki T-shirt, white washed jeans and a pair of simple blue sneakers\nCosy: Like Chris, Elsa also opted for comfort for her more than 20-hour return flight home\nAirport chic: The couple looked fresh despite travelling more than 20-hours\nLike her husband, Elsa also opted for comfort for her more than 20-hour return flight home.\nShe too wore matching khaki in the form of a camouflage T-shirt, which she paired with black track pants.\nShe kept warm with a black scarf wrapped around her neck while keeping her important belongings safe in a brown shoulder bag.\nJuggling act: The couple maneuvered their tiny suitcases through the busy airport\nThe Fast And Furious starlet wore minimal makeup and pulled her short blonde tresses up into a tight bun.\nShe completed her laidback travel look with a white beaded necklace, gold bracelets and fringed lace-up boots.\nThe pair pounded the airport's polished tiles as they made their way to their car.\nChris showed his gentlemanly side, helping the driver place the couple's luggage in the back of a car while Elsa hopped into passenger seat.\nBlonde stunner: Elsa's chic travel look consisted of black track pants, a camouflage T-shirt and fringed boots\nFinal leg home: Chris showed his gentlemanly side, helping the driver place the couple's luggage in the back of a car while Elsa hopped into passenger seat\nA few days earlier, Chris attended an event at New York's Bryant Park along with fellow Aussies - chefs Curtis Stone and Luke Mangan and Deputy Leader of the Liberal Party and Foreign Affairs Minister Julie Bishop MP.\nSpeaking about his new role as ambassador for Tourism Australia, Chris told Conde Nast Traveler that he couldn't say 'no' to the opportunity.\n'I couldn't be more proud to be Australian,' he told the publication on Tuesday evening, on the eve of Australia Day.\n'I feel incredibly fortunate for the experiences I had in Australia and to be able to share that with the world.'\nTalk time: The couple busily chatted as they took the final leg of their trip back home","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420161/Chris-Hemsworth-wife-Elsa-Pataky-wear-matching-khaki-touch-Australia.html"}
