{"authors":["Nicola Agius"],"date_download":"2018-10-31 01:46:25","date_modify":"2018-10-31 01:46:25","date_publish":"2018-09-14 12:54:56","description":"As the first Hollywood movie in 25 years to feature an all-Asian cast, Crazy Rich Asians has not only earned plaudits for representing an underserved community, it's also taken in $167 million at the box office, according to Deadline. Having been…","filename":"data/vaneerConsumption/ChrissyTeigensCrazyRichAsiansPostMadeAwkwafinaCryExclusive.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/7/611f62de-d41e-441f-9adc-a1d17e2e4cf7-1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_chrissy-teigens-crazy-rich-asians-post-made-awkwafina-cry-exclusive-11790709_1540950385.html","title":"Chrissy Teigen's 'Crazy Rich Asians' Post Made Awkwafina Cry - Exclusive","title_page":"Chrissy Teigen's 'Crazy Rich Asians' Post Made Awkwafina Cry — Exclusive","title_rss":"NULL","source_domain":"bustle.com","text":"As the first Hollywood movie in 25 years to feature an all-Asian cast, Crazy Rich Asians has not only earned plaudits for representing an underserved community, it's also taken in $167 million at the box office, according to Deadline. Having been lucky enough to see a pre-release screening, I can already tell you the question you'll be asking after you go to see it — when is the sequel? I spoke to cast members Awkwafina, Ken Jeong, Gemma Chan, and Henry Golding to find out their ideas for a Crazy Rich Asians 2, and how they feel to be part of a record-breaking movie.\nWhile the film may only be opening at the UK box office on September 14, most Brits will already be well acquainted with the adoration the film has received from its fans. Chrissy Teigen has been just one of many to sing its praises, writing, \"You never know how much you miss being represented on screen until you actually see what it’s like to be represented. And represented by all different types of characters with all different types of personalities, just like any other great movie.\"\nDuring an interview with the legendary Awkwafina (who plays Peik Lin Goh) and Ken Jeong (who plays Goh Wye Mun), the former tells me she felt super emotional when reading Teigen's review. She says: \"I actually teared up a little bit because she was talking about her baby shouting out the name for grandmother when she saw Constance’s mum — and that’s the kind of effect you really wish movies like this will have.\n\"I always say the younger generations, they should be spoiled with representation so that when they’re older, they won’t understand why this movie was so important because they will have seen it so much.\"\nThere are a couple of Brits among the cast, including Humans actress Gemma Chan, who plays the ridiculously cool, super chic, and feminist Astrid Young Teo. She tells me that it was \"really important\" to her that the film succeeded. \"I mean, I wanted the film, I hoped that the film would do well enough and be good enough so that it means that other films could be made,\" she explains. \"So that this film hopefully just opens the door to other stories that can be told, you know, from other Asian perspectives. Or from any group that’s been under-represented in the past.\"\nHowever, even Chan didn't expect the movie to perform quite as well as it has. \"It’s been amazing,\" she adds. \"The response has been beyond what any of us could have imagined really. Yeah, it’s a romantic comedy but it also, it feels significant. It feels special... These characters and these themes haven’t been shown in this way before and I think people have really responded to that.\"\nRichard Shotwell/Invision/AP/Shutterstock\nFor Henry Golding, who plays the dashing Nick Young, director Jon M. Chu was also a key part of the film's success. \"Jon really put his creative juices into it and made that flow, and weaved in these storylines so that they would be engaging and amazing,\" he told me. \"We knew it was special but it was definitely the entire crew, with Jon included, who made [the film] what it is.\"\nAccording to the Hollywood Reporter, Chu will be directing the Crazy Rich Asians sequel. I can't wait to see what he does next time around, though when I asked Awkwafina and Ken Jeong what might be in store for the sequel, they see things moving in a different direction. \"It's more about a zombie apocalypse,\" Jeong tells me of his proposed plan. \"It’s a lot like the second Lord of the Rings movie with that big battle; there’s mermen and zombies, and it's all about who’s going to win. These zombies are like hydro-based mermen.\"\nAwkwafina swears to me that this is the truth and apparently, her character Peik Lin is at the centre of it all this time round. \"Peik Lin, she actually, she becomes a squid,\" Awkwafina tells me. Jeong then drops a huge bomb and lets slip that squid Peik Lin falls in love with one of the merman soldiers that’s fighting the zombies. \"He isn't even a proper merman,\" she adds. \"He is literally just a squid. He doesn't even have a human personality. He's just a squid.\"\nAs much as I would love to see this delightfully improbable plot come to life, I'm not sure I can see Kevin Kwan or Jon M. Chu signing off on it. But hey, as long as Awkwafina, Jeong, and their comedic creativity are involved in some capacity, I'll definitely be there.\nCrazy Rich Asians opens in the UK on September 14","url":"https://www.bustle.com/p/chrissy-teigens-crazy-rich-asians-post-made-awkwafina-cry-exclusive-11790709"}
