{"authors":[],"date_download":"2018-10-30 14:30:46","date_modify":"2018-10-30 14:30:46","date_publish":"2015-08-30 00:00:00","description":null,"filename":"data/vaneerConsumption/ChrisChristiewantstotrackimmigrantslikeFedExPackages.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_08_chris_christie_wants_to_track_immigrants_like_fed_ex_packages_1540909846.html","title":"Chris Christie wants to track immigrants like Fed Ex Packages","title_page":"Chris Christie wants to track immigrants like Fed Ex Packages","title_rss":"NULL","source_domain":"americanthinker.com","text":"Gov. Chris Christie of New Jersey said on Saturday that if he were elected president he would combat illegal immigration by creating a system to track foreign visitors the way FedEx tracks packages.\nChris Christie wants to track immigrants like Fed Ex Packages . He wants to hire the head of Fed Ex to work out the details. No, this is not an article in the Onion.\nMr. Christie, who is far back in the pack of candidates for the Republican presidential nomination, said at a campaign event in New Hampshire that he would ask the chief executive of FedEx, Frederick W. Smith, to devise the tracking system. “At any moment, FedEx can tell you where that package is. It’s on the truck. It’s at the station. It’s on the airplane,” Mr. Christie told the crowd in Laconia, N.H. “Yet we let people come to this country with visas, and the minute they come in, we lose track of them.” He added: “We need to have a system that tracks you from the moment you come in.” He said 40 percent of illegal immigrants are allowed into the United States legally with a visa and then stay longer than their visa allows. “However long your visa is, then we go get you,” Mr. Christie said. “We tap you on the shoulder and say, ‘Excuse me. Thanks for coming. Time to go.’ ”\nWonderful. Just a few problems with this plan:\n1) The government doesn't seem to have any enthusiasm for deporting anyone. There is already a law on the books to deport people who overstay their visas. It is observed in the exception and not the rule.\n2) This Fedex model presumes that at the end of their visa period that people will just be waiting around to be caught and deported. They may simply move somewhere else. Unlike a Fedex package that sits in a truck until you move it somewhere, illegals are packages with legs that can move around and won't wait to be scanned or barcoded. They are not in a prison, where we know where they are at all times. They are free to move around society, and can simply move to another location. The classic example of this is when illegals are caught, ordered to appear in court, and then simply disappear before their court date.\n3) Christie's plan does nothing for illegals who cross into the country illegally, not even on a visa.\nBut maybe there are some aspects of his plan that might be workable. If we catch illegals, perhaps we should give them barcode tattoos on their foreheads, like packages, so if they reenter the country again they will be easily identifiable and put into the system. Bar code readers in check out lines in supermarkets could be programmed to scan these codes and refuse to sell to illegal aliens.\nAlternatively, perhaps we can barcode Chris Christie supporters, because there seem to be so few of them that we have trouble tracking them. Chris Christie is so far down in the polls that even he has been moved to talk about illegal immigration. His solution to compare border enforcement to package delivery only makes it that much more comical. If illegals are a package, it's one package we never want to arrive at our homes. I think that Christie needs to call on an expert in the business world who specializes in returns instead.","url":"https://www.americanthinker.com/blog/2015/08/chris_christie_wants_to_track_immigrants_like_fed_ex_packages.html"}
