{"authors":["Kadeen Griffiths"],"date_download":"2018-10-30 23:00:31","date_modify":"2018-10-30 23:00:31","date_publish":"2014-08-14 14:27:59","description":"Every since Chris Brown was released from jail, he's actually been behaving himself. Well, mostly. Sure, Brown has been doing some partying despite his claim of wanting to reduce negative influences like drugs and alcohol in his life, but he's done…","filename":"data/vaneerConsumption/ChrisBrownCelebratesSurprisinglyGoodProbationReportwithHilariouslyBadSamSmithParodyVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/9c472426-94bd-4052-a84c-2efb86be56c4.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35757-chris-brown-celebrates-surprisingly-good-probation-report-with-hilariously-bad-sam-smith-parody-video_1540940431.html","title":"Chris Brown Celebrates Surprisingly Good Probation Report with Hilariously Bad Sam Smith Parody - VIDEO","title_page":"Chris Brown Celebrates Surprisingly Good Probation Report with Hilariously Bad Sam Smith Parody — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Every since Chris Brown was released from jail, he's actually been behaving himself. Well, mostly. Sure, Brown has been doing some partying despite his claim of wanting to reduce negative influences like drugs and alcohol in his life, but he's done a lot of good things too. After his jail stint, Brown finally released a new single, he guest starred during Drake's ESPYs hosting gig, and he even got into the studio with Justin Bieber. That last one isn't really a good thing, per say, considering the reputation that Brown and Bieber have earned themselves among the general public, but considering his legal issues it's not the worst way to spend his time. In fact, Brown's probation report got him praise from the judge and the way he chose to celebrate was actually pretty funny.\nBrown appeared in court on Wednesday, where the judge complimented him on actually complying with the terms of his probation. (If this doesn't seem like the kind of thing that a person should receive special praise for, please remember that Brown basically went to jail for violating the terms of his probation by assaulting another person.) In fact, the judge was so impressed that he granted the request of Brown's attorney to have his number of random drug tests reduced from three a week to two a week.\nKevin Winter/Getty Images Entertainment/Getty Images\nHow would you celebrate that bit of good news? If you said anything other than \"by making a spoof video and posting it to Instagram\", then clear you don't have a great sense of humor. Rather than gloating on Twitter or Instagram, or making a big deal about how well his court proceedings had gone, Brown posted a video of himself doing a parody of Sam Smith's \"Stay with Me\". Except, of course, instead of singing the actual lyrics, Brown embellished it a bit.\n\"Oh won't you stay with me,\" he sang. \"'Cause I bought your new weave. Now I didn't spend my cheese. Bitch, you owe me.\" The whole thing harkened back to Justin Bieber's remix of Drake's \"0-100 (Real Quick)\", which would certainly explain why Bieber had tagged Brown in the video. Maybe doing nonsensical covers of popular songs are an inside joke of some kind for them, based on a mutual love of ridiculous covers. Or maybe Brown was just in a really good mood and this was the random way he chose to express it.\nEither way, it's nice to know that Brown is keeping himself out of trouble and sticking to his probation for now. The probation period ends in January 2015, so Brown still has a long way to go, but this is definitely a good start.\nImage: Getty Images","url":"https://www.bustle.com/articles/35757-chris-brown-celebrates-surprisingly-good-probation-report-with-hilariously-bad-sam-smith-parody-video"}
