{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 18:02:06","date_modify":"2018-10-30 18:02:06","date_publish":"2018-09-10 19:11:25","description":"A Christian university in Georgia is the latest entity to drop Nike as an athletic uniform supplier over its ad featuring Colin Kaepernick.","filename":"data/vaneerConsumption/ChristianGeorgiaUniversityDitchesNikeoverKaepernickAd.json","image_url":"https://media.breitbart.com/media/2018/09/AP-Eric-Risberg-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2018_09_10__1540922526.html","title":"Christian Georgia University Ditches Nike over Kaepernick Ad","title_page":"Christian Georgia University Ditches Nike over Kaepernick Ad","title_rss":"NULL","source_domain":"breitbart.com","text":"A Christian university in Georgia is the latest entity to drop Nike as an athletic uniform supplier because of its ad featuring former NFL player Colin Kaepernick.\nTruett McConnell University, a private Christian university in Cleveland, Georgia, announced Friday that the university would no longer do business with Nike because of the company’s decision to use Kaepernick as its spokesperson for its latest ad campaign.\n“America has sacrificially given my family the freedoms we enjoy today,” Dr. Emir Caner, the president of the university, said in a statement. “My wife, who was raised under the oppression of socialistic communism, became a citizen five years ago, joyfully pledging allegiance to these United States and her flag.”\n“For Nike to then hire Colin Kaepernick, a person known for wearing pigs on his socks, mocking law enforcement, kneeling against our flag, and mocking our troops, is reprehensible to my family and to the Truett McConnell family,” Caner added.\nAt least two other Christian universities have decided to boycott Nike over the ad by no longer using the company to supply athletic uniforms.\nThe College of the Ozarks, a Christian college in Missouri, announced Wednesday it would drop Nike as a uniform supplier due to the company’s decision to promote a spokesperson who disrespected the national anthem.\nLiberty University announced Friday it was in the market for a new athletic uniform supplier after the Nike ad, stating it wants a supplier that supports the U.S. flag, law enforcement, and American values.\nNike received a lot of fallout for its latest “Just Do It” ad campaign, which displays stories from athletes who overcame disabilities or injuries to succeed and prominently features Kaepernick.\n“Believe in something, even if it means sacrificing everything,” Kaepernick says in the ad:\nIT'S OUT: @Nike just released the full Colin Kaepernick ad and the internet is buzzing over it https://t.co/g3KhxMaTcL pic.twitter.com/5cQb9u8Tq3 — CBS News (@CBSNews) September 5, 2018\nKaepernick, an ex-NFL player for the San Francisco 49ers, became famous in August 2016 for kneeling during the national anthem to protest law enforcement, and many fans bristled at the idea of using someone who disrespected the national anthem as a spokesperson for an ad about sacrifice.\nFans began burning their Nike gear in protest of the company’s decision to use Kaepernick to promote the brand, and others publicly criticized the company’s marketing strategy.\nBoth a Gold Star mother and a police officer’s widow publicly criticized the company for making light of the word “sacrifice” and choosing a spokesperson who has publicly disparaged law enforcement.","url":"https://www.breitbart.com/sports/2018/09/10/christian-georgia-university-ditches-nike-kaepernick-ad/"}
