{"authors":["Nicole Pomarico"],"date_download":"2018-10-31 01:46:49","date_modify":"2018-10-31 01:46:49","date_publish":"2018-09-06 15:34:26","description":"So far, 2018 truly seems to be John Legend's year. Not only did he welcome his second child and score the Emmy nomination that could finally lead to his EGOT, but now, he's scored a major magazine cover, and his wife is one proud lady. On Wednesday,…","filename":"data/vaneerConsumption/ChrissyTeigenJohnLegendsPhotosCelebratingHisGQCoverAreGreatButKrisJennersCommentWins.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/6/1dd333a9-09f2-4789-9833-f18216054357-getty-1027225800.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_chrissy-teigen-john-legends-photos-celebrating-his-gq-cover-are-great-but-kris-jenners-comment-wins-11772047_1540950409.html","title":"Chrissy Teigen & John Legend’s Photos Celebrating His ‘GQ’ Cover Are Great, But Kris Jenner’s Comment Wins","title_page":"Chrissy Teigen & John Legend’s Photos Celebrating His ‘GQ’ Cover Are Great, But Kris Jenner’s Comment Wins","title_rss":"NULL","source_domain":"bustle.com","text":"So far, 2018 truly seems to be John Legend's year. Not only did he welcome his second child and score the Emmy nomination that could finally lead to his EGOT, but now, he's scored a major magazine cover, and his wife is one proud lady. On Wednesday, Legend and Chrissy Teigen celebrated his British GQ cover, and even though the photos they shared on Instagram is adorable, the comment left by Kris Jenner is really taking the cake on this one.\nTo be fair, this cover is a pretty big deal for Legend; it's the first GQ cover he's ever posed for and it's because he made their Men of the Year award. At the magazine's actual awards ceremony, Legend took home the Most Stylish Man award, and made a pretty sweet acceptance speech involving Teigen. According to Entertainment Tonight, he said:\n\"Thank you to my wonderful wife, Chrissy. She's the reason I get dressed every morning. And let's be honest, GQ probably gave me this award in hopes that my beautiful wife would show up to this party with me. We all know who the headliner in the family is. I'm Chrissy Teigen's husband.\"\nAnd speaking of his wife, of course, she was involved in the photo he shared on Instagram celebrating his accomplishment.\nEven with Teigen's ridiculous pose, this is still a gorgeous photo — and just one more example of how much fun these two have together, especially when they're cheering each other on for their accomplishments. And of course, Teigen made a few posts to celebrate Legend's win herself, including one of him holding his shiny new award.\nAnd if you happened to be scrolling through your Instagram feed at the right time, you may have noticed a comment from a celebrity friend of theirs.\nIt's official: Kris Jenner has weighed in, and yes, she wins. \"Wait... is this the headband of the day song guy???\" she commented. Yes, Jenner, it is the headband of the day song guy. And that's probably why GQ decided to honor him in the first place.\nChrissy Teigen/Instagram (screenshot)\nOf course, how could anyone forget that, despite being a Grammy-winning performer, Legend's true claim to fame is the song he sings about Teigen's headbands? Good for Jenner for reminding all of us, although is anyone actually surprised that she stole the spotlight with this comment? Nope — that's pretty much Jenner in a nutshell.\nIt's also important to point out Teigen's many other posts about Legend's GQ win, including a video of the two of them dancing at the awards. Someday, their children are going to grow up and realize they have the coolest parents ever.\nIt's awesome that Legend scored a GQ cover and an award, but let's face it: his fabulous wife and Kris Jenner both elevated what was a great accomplishment to what became an amazing one. What are the chances we could get Legend to sing about Jenner's momager looks of the day? This could become a legit series.","url":"https://www.bustle.com/p/chrissy-teigen-john-legends-photos-celebrating-his-gq-cover-are-great-but-kris-jenners-comment-wins-11772047"}
