{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 21:03:01","date_modify":"2018-10-30 21:03:01","date_publish":"2015-02-27 00:21:41","description":"Gov. Chris Christie admitted he adopted Common Core standards because his state needed the federal funds in exchange for signing onto the unpopular education reform.","filename":"data/vaneerConsumption/ChrisChristieAdmitsRegretsAdoptingCommonCoreSaysNJNeededtheMoney.json","image_url":"https://media.breitbart.com/media/2014/11/chris-christie-state-of-the-state.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_02_26__1540933381.html","title":"Chris Christie Admits ‘Regrets’ Adopting Common Core, Says NJ Needed the Money","title_page":"Chris Christie Admits ‘Regrets’ Adopting Common Core, Says NJ Needed the Money","title_rss":"NULL","source_domain":"breitbart.com","text":"In an interview at CPAC with conservative show host Laura Ingraham, New Jersey Gov. Chris Christie (R) acknowledged why many governors likely adopted the unproven Common Core standards were dangled before them by the Obama administration: He signed onto them because his state needed the federal funds that would come in exchange for adopting the unpopular education reform.\nIngraham asked Christie about his prior support for the nationalized standards, and observed that he did sign his state’s Race to the Top application for the federal funds.\n“I know you’ve had some hesitations, but why did you sign it?” she asked the governor.\n“In New Jersey we’ve always been for the standards, for high standards, and we had standards beforehand,” Christie replied. “My concern now as we travel toward implementation is not only the heavy foot of the federal government coming in, but it is not doing all that we need to have done in New Jersey.”\n“So it was all teed up when I came in by Governor Corzine,” he said. “We signed on and tried to get funds during a really difficult fiscal time.”\n“Regrets, do you have regrets?” Ingraham asked.\n“Sure, or course,” Christie responded.\n“Political regrets?” she pressed.\n“Implementation regrets,” he said. “Unlike other people who just get to talk about this stuff, we actually have to do it. Once you start to do it, what I’ve seen — the concerns that I have are significant — and I set a commission up that is now coming back to me with some recommendations, but my charge to them is that we have to keep government at the local level.”\n“With education it is most important to have parents involved, there have to be teachers involved as a part of this process and it needs to be part of this process and will be I think as we move forward in New Jersey,” Christie added.\nAs Breitbart News reported Monday, the New Jersey Assembly voted 63-7 to delay the use of the tests aligned with the Common Core standards to evaluate teachers or students.\nDuring a recent trip to Iowa, Christie, who has a Democrat-led state legislature, said he has “grave concerns” about the Common Core standards. The only action he has taken in his state, however, has been to order a commission to study student testing. At the end of January, the commission announced New Jersey schools could be testing students too often, and recommended that a research study be conducted to determine the extent of testing in the state.\nNew Jersey was one of 46 states whose state boards of education adopted the Common Core standards, a federally promoted education initiative introduced in the Obama administration’s 2009 stimulus bill through a competitive grant program called Race to the Top (RttT). States could apply and compete for federal grant money as long as they adopted a set of uniform, “common” standards and aligned testing and teacher evaluation programs, as well as massive student data collection systems.","url":"https://www.breitbart.com/politics/2015/02/26/chris-christie-admits-regrets-adopting-common-core-says-nj-needed-the-money/"}
