{"authors":[],"date_download":"2018-10-21 02:48:11","date_modify":"2018-10-21 02:48:11","date_publish":"2018-08-14 19:32:53","description":"Chris formerly supervised Vox's Perspectives section, which included the outlet's outside opinion pieces and first-person essays.","filename":"data/vaneerConsumption/ChrisSheajoinsOutlookPostEverythingteamasaneditor.json","image_url":"https://www.washingtonpost.com/resizer/ZIwdtFReqPMJh15-SBE1si-PDjE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/K745CI4HXM5QBLJKZWU3RUL5MU.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_08_14__1540090091.html","title":"Chris Shea joins Outlook/PostEverything team as an editor","title_page":"Chris Shea joins Outlook/PostEverything team as an editor - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Announcement from Outlook Editor Adam Kushner and Outlook Deputy Editor/PostEverything Editor Mike Madden:\nWe’re delighted to report that Chris Shea will become an editor on the Outlook/PostEverything team.\nAs a senior editor at Vox, Chris supervises the Perspectives section, which includes Vox’s outside opinion pieces and first-person essays. The section has published important stories about the legal and political battles over health care policy, the #MeToo movement, and the origins of support for Trump and the future of the Democratic Party.\nOver his career, Chris has written for dozens of newspapers and magazines. He wrote a column about intellectual trends for the Boston Globe’s Ideas section and has been a blogger and columnist for the Wall Street Journal’s Review section. He started his career at the Chronicle of Higher Education, where he remained a contributor for many years, and has also worked at NPR, Lingua Franca, and Bloggingheads.tv. His journalism has won a number of awards, including several from the Education Writers Association.\nChris lives in Hyattsville, MD, where he occasionally coaches his son’s sports teams (soccer, baseball, basketball) and volunteers as a tutor at Hyattsville Elementary School. He is a graduate of Princeton University.\nChris begins on August 27. Please join us in welcoming him.","url":"https://www.washingtonpost.com/pr/wp/2018/08/14/chris-shea-joins-outlook-posteverything-team-as-editor/"}
