{"authors":["Jody Phan For Daily Mail Australia"],"date_download":"2018-10-22 23:55:11","date_modify":"2018-10-22 23:55:11","date_publish":"2017-03-10 04:54:23","description":"Chris Hemsworth was quite the hands-on dad as he enjoyed quality family time with his sons Tristan and Sasha, 2, in Byron Bay on Saturday.","filename":"data/vaneerConsumption/ChrisHemsworthdotesonhischildreninByronBay.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/04/3E200EE200000578-0-image-a-117_1489121485159.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299922_Chris-Hemsworth-dotes-children-Byron-Bay_1540252511.html","title":"Chris Hemsworth dotes on his children in Byron Bay","title_page":"Chris Hemsworth dotes on his children in Byron Bay | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's set to spend a little more time away from home this year as filming gets underway for the next Avengers flick.\nAnd Chris Hemsworth was spotted enjoying quality family time with his sons Tristan and Sasha, 2, in Byron Bay on Saturday.\nThe 33-year-old movie star was quite the hands-on father as he doted on the twins during their outing at The Farm.\nScroll down for video\nDoting dad! Chris Hemsworth was spotted enjoying quality time with his twin sons Tristan and Sasha, 2, in Byron Bay on Saturday\nThe Aussie hunk was joined by his stunning wife Elsa Pataky, 40, and relatives for the excursion.\nChris was seen wrestling with Tristan and Sasha as they hung out outside the trendy eatery.\nThe Thor star wasn't afraid to get his hands dirty whilst tending to his kids, and was spotted wiping one of the twins' noses at one stage.\nHands-on father: The 33-year-old was quite the hands-on dad as he hung out with his children at The Farm in Byron\nLet me get that for you: The Thor star wasn't afraid to get his hands dirty as he wiped his son's nose while sitting outside the venue\nCutting a casual figure and showing off his bulging biceps in a black tank top, the father-of-three added a pair of shorts and sneakers to his ensemble.\nHe kept a low profile with a trucker hat and a pair of sunglasses.\nHis wife meanwhile, looked effortlessly chic in a floral sundress and appeared to be barefoot as she enjoyed family time.\nSuperdad: The superhero movie star showed off his bulging biceps as he stood casually alongside one of the twins\nFamily outing: The Aussie hunk was joined by his wife Elsa Pataky, 40, for the family lunch\nRelaxed: Chris cut a relaxed figure in a pair of black shorts and a muscle tank, teamed with sneakers and a trucker hat\nThe Spanish actress wore her short blonde locks in a loose ponytail and added several beaded bracelets and necklaces to the ensemble.\nThe genetically-blessed couple appeared in great spirits as they chatted to Elsa's brother Cristian Prieto and his partner.\nChris was seen taking one of the twins for a stroll while the rest of the family were seated at a table.\nGenetically-blessed: Chris's wife Elsa stunned in a floral sundress and appeared to be barefoot for the outing\nWorking dad: Chris is set to spend more time away from his family this year as filming gets underway for the next Avengers movie in the US\nThe couple's daughter four-year-old India Rose appeared to be missing from the family affair.\nThe doting dad is set to spend a lot more time abroad this year as he begins his next project, Avengers: Infinity War, due for release in 2018.\n'We shoot Avengers in Atlanta for most of the year actually, but it's sort of pretty spread out throughout the eight months shoot, so I'll be back in Oz a bit,' the Melbourne-born hunk told Today's Richard Wilkins in January.\n'We shoot Avengers in Atlanta for most of the year actually, but it's sort of pretty spread out throughout the eight months shoot': The Melbourne-born actor said in January\nClose to home: Chris revealed he loved filming Thor: Ragnorak in Queensland as it allowed him to stay close to his family\n'That was so good to be able to put the kids in bed every night, in their own bed': he said\nChris also explained the benefits of filming Thor: Ragnorak in Brisbane, as it allowed him to be closer to home.\n'That was so good to be able to put the kids in bed every night, in their own bed, and not be in a hotel and be working with the local crews again,' he told Richard.\n'It was one of the most enjoyable experiences I've had, a lot of fun,' the movie star added.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299922/Chris-Hemsworth-dotes-children-Byron-Bay.html"}
