{"authors":[],"date_download":"2018-10-30 00:58:35","date_modify":"2018-10-30 00:58:35","date_publish":"2015-05-18 08:00:00","description":null,"filename":"data/vaneerConsumption/ChristianPathstoAmnesty.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/05/immigration-signs_onlineathens_130118-article.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861115.html","title":"‘Christian’ Paths to Amnesty","title_page":"‘Christian’ Paths to AmnestyThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"I understand the ideological, political, economic, and perhaps even ecclesiastical scramble over immigration “reform,” with various parties exhilarated or terrified at the prospects for gain or loss. I understand the daunting practicalities of it all and calls for emergency compromise. (Exigencies can birth strange policies, including cooperation with one mass murderer, Stalin, to stop another, Hitler.) But I’m having difficulty accepting the “Christian” case for some form of amnesty, offered (albeit by good folks) at the expense of the respect for law taught in Romans 13:1-7. The more they plead, the less convinced I find myself.\nAs an aside, I’ve been surprised at how those who work with Hispanics confide matter-of-factly in me their indifference to the illegal status of their flocks and their indignation at efforts to harass them. I suppose it’s a compliment of sorts, their attributing to me a certain level of sanctification, which certainly would bring me in line with their “Christlike” position. Alas, I’m not there yet, and here are 26 factors:\n1. Not an Acts 4:20 Moment. Peter and John were right to be civilly disobedient when commanded to stop preaching the gospel. Yankee Quakers were right to defy the Fugitive Slave law. But U.S. immigration laws, though imperfect, are not an abomination.\n2. Apples and Oranges: The proof texts for the various strains of immigration antinomianism reference the Old Testament command to treat “sojourners” and “strangers” kindly. But there were no immigration laws for wandering Arameans or Cyrenians to violate.\n3. Language Games. By now, Christians should be exasperated at the way euphemism is used to shield plain truth (‘affair’ for ‘adultery’), to advance unholy agendas (‘pro-choice’ for ‘pro-abortion’), and to defame good people with the suffix ‘phobic’ (‘homophobic’). But now they scold us for saying ‘illegal’ instead of ‘undocumented,’ as if there had just been some glitch in the paperwork. Should we now speak of “undocumented drug sellers” (of meth), “undocumented doctors” (without licenses), and “undocumented drivers” (with DUI suspensions)? (And yes, ‘illegal’ is a term of civil law as well as criminal law.)\n4. Argument from Epiphany. We’re given “once I was blind, but now I see,” “I too was callous,” and “I felt your pain” testimonies as if they’re arguments for a latitudinarian approach. This rhetorical flourish is familiar in “breakthrough” testimonies regarding homosexuality, universalism, and serial monogamy. A number of years ago, I heard a college president confess that he used to preface all his policy recommendations with something like, “God led me to…” Finally, one exasperated trustee put an end to that by saying, “I didn’t fly up from Texas to vote against God.” A report of one’s supposed gains in sanctification or piety is no substitute for good reasons.\n5. Ad Misericordiam: Following the old “appeal to pity,” they dwell on the pain of “living in the shadows,” although illegals put themselves in the shadows. (Textbook entries on this logical fallacy note the parent-murderer who threw himself on the mercy of the court because he was an orphan.)\n6. Ad Hominem. Those of us who cling to the current legal structure are branded “nativist,” “xenophobic,” and other such Argumentum ad Hominem terms. We’re told that we don’t so much reason as “sloganize,” “demonize,” and “bash.”\n7. Ad Hissisfitum. A particular sort of argument short circuits all serious discussion by resorting to “How dare you, Sir!” or the dialogical equivalent of covering one’s ears and going “Lalalalala.” This is also know as Ad Snitum and Ad Coniptus. Unlike Ad Hominem, which piles the adjectives on others, this one piles them on the speaker himself, who parades his Verklemptish mindset.\n8. BOMFOG: This acronym (Brotherhood of Man, Fatherhood of God) was coined to mock Nelson Rockefeller’s deployment of feel-good platitudes in his run for the presidency. It’s also called Ad Populum talk, and there’s a lot of it swirling around, particular concerning family and children. (See the statement of principles of the Evangelical Immigration Table, with its talk of regard for “ the God-given dignity of every person” and “the unity of the immediate family.”)\nNot long after the song “Welfare Cadillac” evinced national disdain for “welfare queens” and “deadbeat dads,” Marian Wright Edelman founded the Children’s Defense Fund, confident that a “poster child” was just the ticket when the “poster adult” was losing its charm. Never mind that the social ideology her Great Society agenda served has not been the children’s best friend. Similarly, we should be wary when amnesty advocates play the child card. Of course, children count, but it’s important to know who’s doing the counting, and how, and why.\n9. False Dichotomy. We’re led to understand that either we believe that people are made in the image of God or we oppose amnesty. Hmmm, tough choice. What if someone with a disadvantaged background resorted to plagiarism to fashion the crackerjack term paper he needed to pass the course? In calling for mercy, should he remind the authorities that he’s made in the image of God? (And no, I’m not saying you either agree with me or you hold the law in contempt — another false dichotomy. I’m saying the burden of proof is on the one who would suspend the law.)\n10. Red Herring. Of course, some are the victims kidnapping and trafficking, sexual or otherwise, or are on the run from murderous brutes. But millions are simply looking for a better situation. To use the plight of the former to finesse policy for the latter is cheesy.\n11. Fool Me Once, It’s Your Fault; Fool Me Twice, It’s Mine. For all the talk of “secure the borders,” “back of the line,” and “special circumstances,” I can’t think of any argument they deploy that they couldn’t and wouldn’t replay the next time we have millions of new illegals in our midst — just more beleaguered “sojourners” to accommodate. It’s sophistry on a loop.\n12. Ad hoc Pronouncements. Serious ethical thinking distills broad principles and rules for determining fresh cases. So what are they here? Do we amiably accommodate all who manage to sneak into our country from less blessed countries, e.g., boat people from Haiti or a clandestine airlift of middle-class Tunisians landing in wilds of Maine? Should all the nations of the world do the same with their illegals? Should India give its ten million illegal immigrants from Bangladesh a path to citizenship? Perhaps, but you don’t have to be Kant to demand universal rules or principles in this connection.\n13. The Compromised Pulpit. I heard a pastor say that if he addressed such illegality from the pulpit, those involved would leave for another church, and so the opportunity to minister to them would be lost. So he didn’t bring it up. But where else will he muffle/muzzle his preaching to keep the peace and numbers?\n14. The Rich Young Ruler: While I was witnessing to a single man cohabiting with a divorcee, we were nearing the point of decision when he asked if he’d have to give up his “conjugal” arrangement? He brought it up, not I. But once he showed his resistance to Christ’s lordship, I put things on hold.You’re not saved by personal righteousness, or baptism for that matter, but you can show yourself lost by your indifference or contempt toward them. We cloud the gospel when we play fast and lose here.\n15. The Onesimus Template: One earnest fellow has suggested that, like Philemon, we should first win them to the Lord and then suggest that they voluntarily set things right with the law. But what if they don’t convert? Do we indulge their lawlessness indefinitely? What if Onesimus has stolen his master’s silver? Just let it go until his conscience kicks in, either before or after regeneration, and then only with a gentle nudge?\n16. The Golden Rule? Pointing to Leviticus 19:34 (“love the foreigner as yourself”), they invoke the Golden Rule, saying we should treat them as we would desire to be treated. Of course, the Golden Rule only works when we’re at our moral best. (I think of the Nazi who said he would want to be eliminated if it were found that he had a drop of Jewish blood in his veins, so, following the Golden Rule, he could go on murdering Jews.) And we’re not at our moral best when we are willing to flout law for our own convenience. Furthermore, don’t we hold ourselves accountable to the contracts we make with the government? We don’t excuse soldiers who go AWOL after taking the oath of enlistment. So, why should the 40 percent of illegals who came here legally, and then violated their pledges, be given better treatment than we give ourselves?\n17. The Providence Maneuver. They say, “Who knows but God is using this for great things.” Indeed. But who knows how he might use a firmer approach? And who knows what provision he might make for those who are faithful to obey the law? Do we really want to teach illegal immigrants and their supporters the way of expediency when they complain, in effect, that “God is either unwilling or impotent” to provide for those who take a more honorable path? Does it really boil down to either illegality or personal ruin?\n18. Ole Saint Nick. Using the Britishism for “appropriate,” we’re asked to ignore the enormous bill sent our nation by those who wish to walk illegally into our social welfare system, our state-school scholarship pool, etc. When we ask how one man in a sleigh can make it around to all the houses on earth in a night, we’re shushed. (And this Santa Claus has the unsettling tendency to reward folks who’ve misbehaved.)\n19. Attractive Nuisance. We’re well briefed on the agony of living in the shadows and of the terrors of negotiating rivers and desert in the dead of night, turning one’s fortunes over to callous coyotes, and such. In this light, Americans are neighbors who don’t build a fence around their backyard pool and are thus responsible for drawing innocents to their ruin.\n20. Crocodile Tears. We’re told mournfully that “the system is broken,” which necessitates revision. This sounds a little like the passive, “Mistakes happened.” Somebody broke it, actively, including the Attorney General who neither enforced the border nor respected the Arizona governor, who tried to enforce it. What if the church said, “I guess we’ll have to change our policy on marrying gays since the tide has turned and America, including many young evangelicals, has accepted it.”\n21. Taking ‘Christlikeness’ in Vain. Our culture has equated ‘Christlike’ with ‘indulgent,’ and pro-amnesty discourse continues the trend. Are we to understand that Jesus would have us disregard the law of the land? How do you work WWJD for magistrates sworn to uphold the law?\n22. Question-Begging Hierarchicalism. A popular, corollary maneuver among the professionally sensitive is to play grace/love/mercy off against law/justice/judgment, saying that both are very important. But we know who wins, since Jesus is the grace/love/mercy man. They deploy this to knock down whatever “negative” standards they find onerous. (Of course, Jesus didn’t ignore justice, but rather satisfied it to the nth degree on the cross.)\n23. Simulated Inquiry. Good faith interlocutors are in short supply in an arena where points well taken are not taken. William James said admirably that philosophy is “an uncommonly stubborn attempt to think clearly.” Unfortunately, much of what we hear is an uncommonly stubborn attempt to win. More forensics, gymnastics, and histrionics than solid apologetics.\n24. Cross Dressing. We might admire a lady who tells a car thief, “Go ahead and keep it. No problem. I forgive you.” But we can’t admire a district attorney who beats her to the punch with the same declaration. He has to look for mitigating or exculpatory evidence; she doesn’t. When officials say “Never mind,” they exchange their robes for granny dresses, lab coats, denim jackets, cassocks, or bespoke suits.\n25. A Deficit in Fairness. As a pastor in the 1980s, I sought to hire a Zimbabwean woman attending an American seminary to serve as our children’s ministry director. It proved to be impossible since we had to demonstrate to the INS that no American could do the job. This past summer, our Jordanian tour guide rehearsed at length his dismay that he couldn’t get a visa to join his relatives in America. But now we’re asked to receive millions from the south who’ve flouted our laws. (I can’t help think of the Voyage of the Damned, the story of a shipload of 915 Jews fleeing Germany in 1939; the U.S. turned them away, and approximately 200 of them ultimately died in Nazi death camps in Europe. Today, the entire Jewish population of Israel is less than that of our illegals from the South.)\n26. Split-the-Difference Ethics. We’re told that “polarization” and “stalemate” are leading to “tragic human cost.” Rather we need a “bipartisan solution” which will “make our nation proud.” So how does that work on other issues, say, gay marriage? Where’s that happy path where GLAAD and the FRC can walk hand in hand? And how did this mediating approach work out in Plessy v. Ferguson, with its “separate but equal” accommodation.\nAll that being said, I think there are ways to address this more appropriately. Here’s one that comes to mind:\nEnforce the laws we now have, including border security and prosecution of those who hire illegals; be generous in granting asylum to those fleeing tyrannical mayhem; dramatically hike the immigration-toward-citizenship quotas for Mexico and Central America, recognizing a special relationship these benighted neighbors (perhaps hundreds of thousands a year). Let them bring their immediate families. We’ve got room for good folks.\nThe catch is that they must apply in their home country and go through the vetting process at our foreign embassies. Those “living in the shadows” have to go home to get in line. Otherwise, they’ll be “stuck in the shadows” while millions of their countrymen are living lives in the sunshine.\nMinisters to Hispanics will have big flocks. Many poor people will have a better life. The American economy could enjoy their efforts and taxes — all of the good things that immigration antinomians are trumpeting. But it will all be legal.\nI suspect that this change in policy would lead many to self-deport, and perhaps lessen the need for casuistry.","url":"https://spectator.org/62745_christian-paths-amnesty/"}
