{"authors":["Ryan Smith For Mailonline"],"date_download":"2018-10-23 00:45:50","date_modify":"2018-10-23 00:45:50","date_publish":"2017-04-26 10:37:55","description":"The 19-year-old made the most of the sunny spring weather, stepping out in a blue Hurley T-shirt, teamed with white Adidas shorts, which bore his college's 'M' symbol.","filename":"data/vaneerConsumption/ChristopherSchwarzeneggerluncheswithmumMariaShriver.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9D9B7E00000578-0-image-a-68_1493199470788.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446838_Christopher-Schwarzenegger-lunches-mum-Maria-Shriver_1540255550.html","title":"Christopher Schwarzenegger lunches with mum Maria Shriver","title_page":"Christopher Schwarzenegger lunches with mum Maria Shriver | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"At the end of summer last year, he switched the sunny climes of his native Los Angeles for the chilly Midwest as he enrolled at the University of Michigan.\nAnd Christopher Schwarzenegger appeared thrilled to be back in the company of his family, as he joined his mother Maria Shriver and sister Katherine for a lunch outing in Beverly Hills on Tuesday.\nThe 19-year-old, whose father is Hollywood action hero Arnold Schwarzenegger, made the most of the sunny spring weather, stepping out in a blue Hurley T-shirt, teamed with white Adidas shorts, which bore his college's 'M' symbol.\nScroll down for video\nFamily time: Christopher Schwarzenegger was seen stepping out for lunch in Beverly Hills with his Katherine, left, and mother Maria Shriver\nSporting light stubble, the handsome teen strolled ahead of his glamorous mother, who looked casually cool in an all-black ensemble that included a bomber jacket, leggings and a printed T-shirt.\nWith her chestnut brown tresses styled in a casual bun, she shielded her eyes from the sunshine with a stylish pair of shades while toting shopping bags.\nHis 27-year-old sister also stepped out in style, wearing a black leather jacket over a grey crop top skinny jeans, while a blue leather handbag added a flourish of colour.\nCasually cool: The 19-year-old, who recently enrolled at the University of Michigan, looked casually cool in a blue Hurley T-shirt with white Adidas shorts\nWe are family: At 27, Katherine is Maria's first daughter with estranged husband Arnold Schwarzenegger, while Christopher is the youngest\nBig changes: At the end of August, journalist Maria revealed that she was dropping her son off at college - and she sought advice on living without her children at home\nChristopher was nursed back to health by his close-knit family after he got into a surfing accident while boogie-boarding off the coast of Malibu when he was 13.\nHe ended up suffering a collapsed lung, broken bones and broken ribs - injuries which subsequently landed him in intensive care in a Los Angeles-area hospital.\nAt the time his big sister Katherine tweeted: 'Thank you guys for ur concern and prayers for my baby brother! He’s a tough little guy and getting better! Please keep praying for him!' (sic)\nFamily outing: Maria is seen with her children (l-r) Patrick, Christina, Katherine and Christopher at August's Comedy Central Roast of Rob Lowe in Los Angeles\nLike father, like son: Arnold Schwarzegger and his lookalike love child, Joseph Baena, worked out at Gold's Gym in LA before embarking on a bike ride together on August 25\nAt the end of August, his 61-year-old mother Maria - who hails from the Kennedy political dynasty - was seen accompanying her son on a flight from Calfornia to Michigan as he embarked on his new life as a college student.\nAs the mother-of-four prepared to live in a home without any of her children, she tweeted: 'Drum roll please... Dropping my last kid off at college. Empty-nesters: what advice do you have for me about sending off the youngest?'\nMaria and Austrian-born Arnold are also parents to Christina, 25, and model Patrick, 23, who famous dated pop singer Miley Cyrus.\nTheir marriage came to an end in 2011 after 25 years, following the revelation that Arnold had fathered a love child with the family's household staffer Mildred Patricia 'Patty' Baena. Their son, Joseph, is now 19 years old.\nFamily first: Model Patrick often shares snapshots of himself with his siblings\nIn a land Down Under: The ex-boyfriend of Miley Cyrus recently uploaded a snapshot of himself soaking up the sights of Sydney with his father","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446838/Christopher-Schwarzenegger-lunches-mum-Maria-Shriver.html"}
