{"authors":["Allyson Koerner"],"date_download":"2018-10-31 01:42:17","date_modify":"2018-10-31 01:42:17","date_publish":"2018-09-14 17:47:55","description":"It's a beloved celebrity couple's anniversary and they are celebrating in a way that speaks to exactly who they are as a duo. Chrissy Teigen shared an anniversary post for John Legend on Instagram on Friday. As you can imagine, it definitely shows…","filename":"data/vaneerConsumption/ChrissyTeigensAnniversaryPostToJohnLegendIsAsHilariousAsItIsSweetPHOTO.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/4faa3157-8efa-4d33-bcd9-595086f7ecba-getty-888023726.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_chrissy-teigens-anniversary-post-to-john-legend-is-as-hilarious-as-it-is-sweet-photo-11922567_1540950137.html","title":"Chrissy Teigen’s Anniversary Post To John Legend Is As Hilarious As It Is Sweet - PHOTO","title_page":"Chrissy Teigen’s Anniversary Post To John Legend Is As Hilarious As It Is Sweet — PHOTO","title_rss":"NULL","source_domain":"bustle.com","text":"It's a beloved celebrity couple's anniversary and they are celebrating in a way that speaks to exactly who they are as a duo. Chrissy Teigen shared an anniversary post for John Legend on Instagram on Friday. As you can imagine, it definitely shows how much Teigen loves Legend (hint: a lot), but the cookbook author also didn't hold back on making her caption funny. Even an annivesary isn't going to stop Teigen from trolling her EGOT winner of a husband.\nNext to a stunning photo of the couple standing in front of a gorgeous backdrop in Lake Como at their wedding (yes, they got married in Italy), Teigen wrote,\n\"12 years ago today, I met the man of my dreams. And 5 years ago today, we got married. We have two babies and some pups and a life I am grateful to have. My everything, I love you and am so proud of the story we’ve created. But you are an asshole for releasing your @nbcthevoice news on my target launch day for real.\"\nClassic Teigen, right? She's never afraid to be sappy and sarcastic all in the same moment. She truly loves her musician husband. The fact that they joke around like they do also shows the two still know how to have fun with one another, which is so important as a couple.\nFor those unaware, on Sept. 13, Legend announced he was joining The Voice as a coach for Season 16. On Instagram, the recent Emmy winner wrote, \"I'm thrilled to join the coaches of @nbcthevoice. I've been a guest and mentor on the show multiple times and I’m so excited to discover talented singers and help them make the most of their gift. I hope the world is ready for #TeamJL.\"\nHis big news came on the same day as Teigen's announcement that she's launching en exclusive Target line for kitchen and table top wares. How huge is that? As you can probably imagine, Teigen was overjoyed about the partnership with Target to release her Cravings by Chrissy Teigen collection. According to the company's official press release, \"The collection features all of the essentials that Chrissy uses to prep, cook and serve up her favorite recipes.\"\n\"I’M IN TARGET!!!!\" the Cravings: Hungry For More author wrote on Instagram on Thursday. \"My new #CHRISSYxTARGET collection will be avail exclusively at @Target starting 9/30!!!! I truly can’t believe any of this is happening and can’t wait for you all to see it.\"\nAs you can see above, Luna and Legend celebrated the exciting news right alongside Teigen. The \"A Good Night\" singer praised his wife's amazing new business venture on Twitter by writing, \"Chrissy's new Cravings kitchenware line is coming soon to a @Target near you. And it's beautiful!!!\"\nYeah, he's just as thrilled as Teigen. Even though they may troll each other (well, mainly Teigen) from time to time, it's all fun and games. There's no doubt they support each other 100 percent. Heck, here they are 12 years later in their relationship and they are still head over heels in love with each other — and still laughing. Their milestone definitely deserves a celebration.","url":"https://www.bustle.com/p/chrissy-teigens-anniversary-post-to-john-legend-is-as-hilarious-as-it-is-sweet-photo-11922567"}
