{"authors":["Christopher Stevens Reviews For The Daily Mail"],"date_download":"2018-10-22 21:46:27","date_modify":"2018-10-22 21:46:27","date_publish":"2017-03-16 01:56:00","description":"Christopher Stevens is back with another round-up of Wednesday night's television offerings focusing on The Royal House of Windsor and Benidorm.","filename":"data/vaneerConsumption/ChristopherStevensreviewsC4sTheRoyalHouseofWindsor.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/01/3544A3C400000578-0-image-a-35_1489628637991.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318652_Christopher-Stevens-reviews-night-s-TV_1540244787.html","title":"Christopher Stevens reviews C4s The Royal House of Windsor","title_page":"Christopher Stevens reviews C4s The Royal House of Windsor | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Royal House of Windsor\nRating:\nHe’s a stuffy waffler with a penchant for ancient jokes, but there was a time when the Prince of Wales was portrayed as a playboy and the world’s most eligible bachelor: action man by day, ruthless womaniser by night.\nAnd that louche reputation was no accident — as The Royal House Of Windsor (C4) revealed, it was an image carefully cultivated by a puppet-master whose real ambition was to see Prince Charles wed his granddaughter.\nThis series has become an unmissable exposé, not only for the extraordinary private papers it uncovers, but with its unerring instinct for the telling phrase. Instead of filling the screen with long interviews by talking heads, it selects the pithiest quotes from its contributors.\nWednesday's episode of The Royal House of Windsor delves into Prince Charles' dramatic early love life\nAnd amid the mass of information about the royals, it homes in on fragments that supply us with new perspectives. The cameras lingered on the 21-year-old Charles at his investiture in Caernarfon Castle in 1969, for instance, wearing his crown like a prop in a pageant.\nThe ceremony was devised with TV cameras in mind, the voiceover revealed — and the orb on the Prince’s coronet was actually a gilded ping-pong ball.\nThat kingmaker, who secretly steered the royal progress in the Seventies, was Lord Louis Mountbatten, uncle of the Duke of Edinburgh. Though well aware that the sensitive, depressive Charles was hopelessly in love with a married woman — Camilla Parker Bowles — he urged the young man to act the lothario.\n‘In a case like yours,’ he wrote, ‘the man should sow his wild oats and have as many affairs as he can before settling down, but for a wife he should choose a suitable, attractive and sweet-charactered girl before she met anyone she might fall for.’\nIt was a blueprint for royal catastrophe, the plan that first paraded Charles like a screen idol and then saw him wed to the virginal Diana Spencer.\nBut, in fact, Lady Di was not Mountbatten’s choice of bride. He expected the Prince to marry his granddaughter, Amanda Knatchbull, and the show unearthed pictures from a family album that laid bare his machinations.\nHe took Charles and Amanda to a Caribbean island and had them posing for the camera in their skimpiest swimwear, wearing broad grins and virtually nothing else.\nShortly after that, Charles proposed to Miss K aboard the Royal Yacht. The wise girl, guessing that he still adored Camilla, turned him down. And a fortnight later, the puppet-master Lord Louis was dead — murdered by an IRA bomb. Such melodrama and secret photos make for eye-popping TV.\nBenidorm\nRating:\nWearing just boxers and their cheesiest grins, the likely lads of Benidorm (ITV), Joey and Tiger (Nathan Bryon and Danny Walters), were pole-dancing in the street — not so much eye-popping as cover-your-face TV.\nThe broadest farce on the box is shamelessly trawling lower than ever for its laughs. One recurring gag saw the oldest swinger in town, Jacqueline (Janine Duvitski), belching her way through her lines after downing a bottle of cheapo cava for breakfast.\nBenidorm with Paul Bazely as Troy, Janine Duvitski as Jacqueline Stewart and Tony Maudsley as Kenneth Du Beke\nThe script is a cascade of smutty puns and single entendres — Paul Chan as Mr Wu even did a routine of music hall jokes about dodgy meat pies.\n‘I have panda,’ he giggled — ‘it tastes like penguin, but less fishy.’\nThe most shameful thing is that this barrage of corny comedy wears you down, till you can’t stifle a laugh. ‘The chicken is going cheap … and the beef goes moo!’ Arrgghhh!","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318652/Christopher-Stevens-reviews-night-s-TV.html"}
