{"authors":["Alicia Lu"],"date_download":"2018-10-30 23:30:06","date_modify":"2018-10-30 23:30:06","date_publish":"2014-08-13 17:57:56","description":"This last week has been a living nightmare for Christy Mack, an adult film star who described being brutally attacked last Friday. According to Mack, her ex-boyfriend, MMA fighter Jon Koppenhaver, showed up unannounced at her home and beat both Mack…","filename":"data/vaneerConsumption/ChristyMackSharesBravePhotosOfHerAllegedAssaultByExBoyfriendJonKoppenhaver.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/64638d2e-465a-402c-8648-c03dd496602d.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35609-christy-mack-shares-brave-photos-of-her-alleged-assault-by-ex-boyfriend-jon-koppenhaver_1540942206.html","title":"Christy Mack Shares Brave Photos Of Her Alleged Assault By Ex-Boyfriend Jon Koppenhaver","title_page":"Christy Mack Shares Brave Photos Of Her Alleged Assault By Ex-Boyfriend Jon Koppenhaver","title_rss":"NULL","source_domain":"bustle.com","text":"This last week has been a living nightmare for Christy Mack, an adult film star who described being brutally attacked last Friday. According to Mack, her ex-boyfriend, MMA fighter Jon Koppenhaver, showed up unannounced at her home and beat both Mack and an unidentified man. After the attack, Mack tweeted horrific photos of her injuries as she lay in the hospital healing. Since the alleged incident, Mack has received overwhelming support online from fans, starting a necessary discussion on domestic violence.\nMack, an adult film star and tattoo model who has appeared in Rebel Ink and Inked Girls, went public with her relationship with Koppenhaver in June 2013. In November 2013, Koppenhaver tweeted a joke about rape: \"Just raped [Christy Mack] She tried to make me wait until 'after errands' As if! [sic].\" He has since deleted it.\nWhen the tweet was — understandably — met with anger, he tried to defend it by tweeting, \"Real men rape. (Their GF’s and wives, not strangers, don’t get your panties in a bunch.)\" This early evidence of their troubled relationship is now being further bolstered by her account of Friday's attack.\nOn Monday, Mack released a statement on her Twitter detailing the attack along with photos of her injuries.\nAt around 2 am Friday morning, Jon Koppenhaver arrived unannounced to my home in Las Vegas, NV.... Without a single word spoken, he began beating my friend; once he was finished, he sent my friend away and turned his attention to me. He made me undress and shower in front of him, then dragged me out and beat my face. I have no recollection of how many times I was hit, I just know my injuries that resulted from my beating.My injuries include 18 broken bones around my eyes, my nose is broken in 2 places, I am missing teeth and several more are broken. I am unable to chew, or see out of my left eye. My speech is slurred from my swelling and lack of teeth. I have a fractured rib and severely ruptured liver from a kick to my side. My leg is so badly injured I have not been able to walk on my own.... He also sawed much of my hair off with this dull knife. After some time, the knife broke off of the handle and continued to threaten me with the blade. I believed I was going to die. He has beaten me many times before, but never this badly.\nLater in her statement, she recalls that Koppenhaver said he was going to rape her but was \"disappointed in himself when he could not get hard.\" He also allegedly canceled all of her appointments in her phone so that no one would wonder about her whereabouts.\nHandout/Getty Images Entertainment/Getty Images\nKoppenhaver is a professional mixed martial arts fighter, known by his stage name War Machine. After the incident, Koppenhaver took to Twitter to address the issue and mentioned being cursed several times.\nKoppenhaver is currently wanted by the police for questioning, but no charges have been brought on the pro fighter. Though many assume Koppenhaver's guilt, the conversation sparked by the alleged incident are a positive reflection of the public's zero-tolerance attitude toward domestic violence.\nEven Dog the Bounty Hunter is jumping in to offer his aid.\nImages: Christy Mack/Facebook","url":"https://www.bustle.com/articles/35609-christy-mack-shares-brave-photos-of-her-alleged-assault-by-ex-boyfriend-jon-koppenhaver"}
