{"authors":[],"date_download":"2018-10-30 21:51:00","date_modify":"2018-10-30 21:51:00","date_publish":"2016-12-20 16:30:00","description":"Police are searching for thieves who took Christmas gifts from a local teacher’s house an...","filename":"data/vaneerConsumption/Christmasgiftsstolenfromteachershome.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/19/Videos/5254648583001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_christmas-gifts-stolen-from-teacher-home__1540936260.html","title":"Christmas gifts stolen from teacher’s home","title_page":"Christmas gifts stolen from teacher’s home","title_rss":"NULL","source_domain":"ajc.com","text":"Police are searching for thieves who took Christmas gifts from a local teacher’s house and may have also been involved in two other burglaries in DeKalb County.\nLauren Bolsen told Channel 2 Action News she was in her third-grade classroom just before 10:30 a.m. Monday when she received a text from her alarm company.\nFrom her classroom, she pulled up home surveillance and watched as the burglary unfolded. She saw a man in red pants and two others steal about $2,500 in Christmas gifts from her Northlake Creek Drive home.\nShe said they kicked in her front door and drove away in a dark Honda.\nFamily says thieves broke into home, stole Christmas presents https://t.co/DcOmB8K40B pic.twitter.com/WlGCJkdMvg — WSB-TV (@wsbtv) December 20, 2016\nPolice are trying to determine if the break-in is related to two others a few miles from Bolsen’s home. The other break-ins occurred about 45 minutes after Bolsen’s home was hit.\nBolsen told Channel 2 her family is offering a reward for the arrest and conviction of the people who broke into her home.\n“To think that people are getting robbed in broad daylight,” she said, “it's so brazen.”\nRead more of the story here.","url":"https://www.ajc.com/news/christmas-gifts-stolen-from-teacher-home/TH2dmgO3vSrclkR8KdUW7N/"}
