{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 21:02:10","date_modify":"2018-10-22 21:02:10","date_publish":"2017-03-16 00:32:19","description":"The Boston native, 35, said he found it 'unbelievable' that The Celebrity Apprentice host was able to defeat rival Hillary Clinton last November in the U.S. election.","filename":"data/vaneerConsumption/ChrisEvansfeelsrageatDonaldTrumpspresidency.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/15/23/3E4FA18400000578-0-image-a-5_1489620846096.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318334_Chris-Evans-feels-rage-Donald-Trump-s-presidency_1540242130.html","title":"Chris Evans feels 'rage' at Donald Trump's presidency","title_page":"Chris Evans feels 'rage' at Donald Trump's presidency | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Chris Evans feels 'rage' and 'fury' at President Donald Trump's ascension to the Oval Office.\nThe Captain America star dished on his political views in an expansive interview with Esquire, explaining why he feels so strongly in opposition to the commander-in-chief and certain members of his cabinet.\nThe Boston native, 35, said he found it 'unbelievable' that The Celebrity Apprentice host was able to defeat rival Hillary Clinton last November by selling a bill of goods to those who felt disenfranchised with the system.\nUpset: Captain America actor Chris Evans, 35, told Esquire that he feels 'rage' and 'fury' at the idea that Donald Trump is the current president\nThe key? Evans said of Trump supporters: 'They were just so happy to hear that someone was angry'\n''I feel rage. I feel fury. It's unbelievable. People were just so desperate to hear someone say that someone is to blame,' Evans told the magazine.\n'They were just so happy to hear that someone was angry. Hear someone say that Washington sucks. They just want something new without actually understanding.'\nThe Hollywood action hero singled out Trump adviser Steve Bannon - who's been dogged by whispers of Anti-Semitism based on revelations from his 2007 divorce - as a 'man [who] has no place in politics.'\nBannon's ex-wife Mary Louise Piccard said in court docs that Bannon opposed their daughters 'going to school with Jews,' and in a separate instance asked why a school had 'so many Chanukah books in the library.'\nAvengers assemble! He is best known for his work as Captain America in the Marvel comic book films\nNot a fan: Evans (left) said that Trump adviser Steve Bannon (right) has 'no place in politics'\nThe actor acknowledged that it might not be the best professional move to potentially alienate fans of his films who support the current presidential administration, but said his personal values over-weighed self-preservation in this case.\n'Look, I'm in a business where you've got to sell tickets, but, my God, I would not be able to look at myself in the mirror if I felt strongly about something and didn't speak up,' he said. 'I think it's about how you speak up. We're allowed to disagree.'\nEvans said he could accept losing some fans as a price for speaking his mind.\n'If I state my case and people don't want to go see my movies as a result,' he said, 'I'm okay with that.'\nWalking the walk: The A-list star has lent his presence to cheer up the troops overseas\nStanding his ground: Evans says he's OK with losing fans by stating his pointed political views\nEvans, who appears in the upcoming drama Gifted opposite Octavia Spencer and Jenny Slate, stressed that he aims to stay calm and reasonable in his political chatter.\n'Not everyone who voted for Trump is going to be some horrible bigot,' he said. 'There are a lot of people in that middle; those are the people you can't lose your credibility with.\n'If you're trying to change minds, by spewing too much rhetoric you can easily become white noise.'\nGifted opens April 7.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318334/Chris-Evans-feels-rage-Donald-Trump-s-presidency.html"}
