{"authors":["Nikki Schwab","U.S. Political Reporter For Dailymail.Com"],"date_download":"2018-10-22 20:48:25","date_modify":"2018-10-22 20:48:25","date_publish":"2016-01-29 03:54:41","description":"New Jersey Gov. Chris Christie delivered the line of the night as he promised Republicans that if nominated he would strong arm Hillary Clinton away from the White House.","filename":"data/vaneerConsumption/ChrisChristiegetsthebiggestcheersofthenightforHillaryClintonattack.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/03/30AEBA4B00000578-0-image-a-6_1454038732065.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422141_The-days-Clintons-public-housing-Chris-Christie-gets-biggest-cheers-night-attack-Hillary_1540241305.html","title":"Chris Christie gets the biggest cheers of the night for Hillary Clinton attack","title_page":"Chris Christie gets the biggest cheers of the night for Hillary Clinton attack | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"New Jersey Gov. Chris Christie delivered the line of the night as he promised Republicans that if nominated he would strong arm Hillary Clinton away from the White House.\n'The days of the Clintons in public housing are over,' Christie bellowed.\nHe argued on the Fox News Channel debate stage that his background as a federal prosecutor would come in handy for prosecuting Clinton over her ongoing email scandal.\n'I will be ready, I will take her on and when I take her on I guarantee to you one thing – she will never get withing 10 miles of the White House,' Christie said.\nScroll down for video\nChris Christie had one heck of a zinger reserved for Hillary Clinton telling the audience: 'The days of the Clintons in public housing are over'\nMarco Rubio also had strong words for Hillary Clinton suggesting that as president she would have to pardon herself over her ongoing email scandal and the 2012 terror attacks in Benghazi\nChristie was again asked about the Bridgegate scandal, which has tainted him politically since the story of lane closures on the George Washington Bridge broke.\nThe moderators asked Christie why GOP voters should trust that the scandal is literally water under the bridge, to which Christie pointed to several investigations that cleared his name and then segued to Clinton's ongoing scandals\nChristie's forceful anti-Clinton assault came just minutes after Sen. Marco Rubio barked about the Democrats as well.\nRubio first had a laugh line ready for Bernie Sanders, who has virtually caught up with Clinton in Iowa and surged past her in New Hampshire, a neighboring state to his own Vermont.\n'Bernie Sanders is a socialist,' Rubio said. 'I think Bernie Sanders is a good candidate for president ... of Sweden.'\n'We don't want to Sweden,' he emphasized. 'We want to be the United States of America.'\nThen it was Clinton's turn.\nRubio said the former secretary of state was 'disqualified' from being commander in chief because of her handling of the Benghazi terror attacks in 2012 and the email scandal.\nRand Paul explained that it was hard to view Hillary Clinton as a defender of women when a corporate CEO, had he engaged in behavior with an intern like Bill Clinton, would be publicly scorned\n'In fact,' he said. 'One of her first acts as president may very well be to pardon herself.'\n'Because Hillary Clinton stores classified information on her private server and Hillary Clinton lied to the families of those four brave Americans who lost their lives in Benghazi,' Rubio said.\nKentucky Sen. Rand Paul was asked a direct question about the Clintons – how Bill Clinton's sexual shenanigans in the '90s should impact his wife's candidacy.\n'You know, I've never really brought this up unless asked the question,' Paul shirked at first. 'But I have responded to the question.'\nPaul said he didn't blame Hillary Clinton for her husband's affairs, including his relations with intern Monica Lewinsky in the White House, but suggested the former president be compared to other powerful American men.\n'That if what Bill Clinton did, any CEO in our country did with an intern, with a 22-year-old, 21-year-old intern in their office they would be fired,' Paul suggested. 'They would never be hired again. Fired, never hired again and probably shunned in their community.'\n'And the thing is, she can't be a champion of women's rights at the same time she's got this that is always lurking out there, this type of behavior,' Paul continued.\nHe also took on the dealings that the Clinton Foundation has made in parts of the world where women's right are nowhere near to equal.","url":"https://www.dailymail.co.uk/news/article-3422141/The-days-Clintons-public-housing-Chris-Christie-gets-biggest-cheers-night-attack-Hillary.html"}
