{"authors":["Mary Chastain"],"date_download":"2018-10-30 17:59:59","date_modify":"2018-10-30 17:59:59","date_publish":"2015-09-10 01:39:31","description":"Those who survived recent attacks on Christians in India are demanding the president do more to bring the people responsible to justice.","filename":"data/vaneerConsumption/ChristiansinIndiaDemandJusticeYearsAfterDeadlyAttack.json","image_url":"https://media.breitbart.com/media/2015/02/christian-protestors-india.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_09_09__1540922399.html","title":"Christians in India Demand Justice Years After Deadly Attack","title_page":"Christians in India Demand Justice Years After Deadly Attack","title_rss":"NULL","source_domain":"breitbart.com","text":"Those who survived recent deadly attacks on Christians in India are demanding the president do more to bring the people responsible to justice. Despite the violence, though, Christianity is growing in India.\nIn 2008, a riot in Odisha [then Orissa] led to the deaths of 90-100 people and forced 56,000 out of their homes. Hindus erupted against the Christians “after the murder of a Hindu religious leader.” Those affected pushed through “thousands of complaints of physical and sexual assault, destruction of property, theft and intimidation made by victims.” However, the Kandhamal Committee for Peace and Justice claims the police have not done much against the accused. From Channel NewsAsia:\nThe group said that only 827 out of 3,232 complaints were registered by police at the time, and that 273 of these cases were then thrown out due to a lack of evidence as witnesses were scared to come forward and no protection was afforded to them. Only 33 cases have reached a judgement and most of those convicted for crimes such as murder are out on bail, it added.\n“Justice has alluded us,” declared Father Ajay Singh of the Kandhamal Committee for Peace and Justice. “After knocking on every door within the state government, we found no one willing to come forward to secure justice for the victims of Kandhamal.”\nHe also said President Pranab Mukherjee told the group “he will bring the issues before the government to see what could be done.”\nThe violence sparked massive international criticism. Human rights activists said Hindus and Christians participated, but “Christians bore the brunt of the attacks.” Mobs destroyed 6,500 homes and 395 churches. The Hindus accused their victims “of converting Indians to Christianity.”\nChristians gathered to mark the seventh anniversary of the attacks on August 31. Archbishop of Cuttack-Bhubaneswar, His Exc. Mgr. John Barwa SVD, found that Christianity continues to grow in India, “strengthened the faith of Christians” who suffered, and met many who refused to abandon their faith.\n“They suffered horrific anti-Christian violence,” he said, adding:","url":"https://www.breitbart.com/national-security/2015/09/09/christians-in-india-demand-justice-years-after-deadly-attack/"}
