{"authors":["Lianna Brinded"],"date_download":"2018-10-30 21:35:06","date_modify":"2018-10-30 21:35:06","date_publish":"2016-12-19 00:00:00","description":"Chris Philp MP spoke to BI about the spate of strikes rocking London and how best to change legislation.","filename":"data/vaneerConsumption/ChrisPhilpinterviewSouthernRailASLEFRMTPostOfficestrikes.json","image_url":"https://amp.businessinsider.com/images/5857a747dd0895d61f8b476d-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_chris-philp-interview-southern-rail-aslef-rmt-post-office-strikes-2016-12_1540935306.html","title":"Chris Philp interview: Southern Rail, ASLEF, RMT, Post Office strikes","title_page":"    Chris Philp interview: Southern Rail, ASLEF, RMT, Post Office strikes - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Chris Philp, MP for Croydon South. Parliament TV\nLONDON — Conservative MP Chris Philp is calling for the government to revisit current legislation over how workers strike as many of Britain's key infrastructure networks come to a near stand-still this week.\nPhilp, MP for Croydon South, told Business Insider that \"there are now 300,000 people who can't get into work or see their family because of the completely unfair and disproportionate strike action\" from unions like the RMT and ASLEF.\nBritain is encountering one of the worst bouts of strikes in the last couple of decades. Already, strikes from unions have led to several days where Southern Rail services have been completely cancelled. This affects 300,000 passengers.\nThis week, only a few days before Christmas, thousands of workers across rail companies, airlines, and postal services will be on strike.\nRMT general secretary Mick Cash said in a statement this week: \"Our conductor members on Southern are on strike this week in defence of the safety of the travelling public and that remains the focus of the entire union.\"\nPhilp told us that the government should revise current legislation to stop strike workers bringing Britain's infrastructure to a standstill.\nIt should be a legal requirement for public sector strikes to go before a High Court judge\nSpeaking to us on Monday, he said: \"There are two things we should do. It should be a legal requirement for public sector strikes to go before a High Court judge, who would determine whether the strike was unreasonable and disproportionate for it to continue,\" said Philp.\n\"The second point should be that we follow what Canada, Italy, and Spain do by making sure that even if there are public sector strikes, 50% of the services should still be running.\"\n\"I understand that there may be grievances from unions but they always have to be reasonable and proportionate. The judge should balance up the injury suffered from workers versus injuries suffered by the general public [to determine this]. And if unions had a problem with this, they are effectively asking for the legal right to strike disproportionately and unreasonably.\"\nGovernment 'rules nothing out' on strikes\nAsked by Business Insider whether the government plans to push ahead with Philp's proposals, a spokesperson for the prime minister said that they would not rule out taking tougher action.\n\"The Trade Union act has only recently been passed and we will keep it under review. Nothing is being ruled out,\" they said.\nThe worst set of strikes in a decade\nCommuters stage a protest at Victoria Station, London, before marching to the Department for Transport. PA The dispute is over a proposed expansion of Southern's driver-only train network, whereby the driver operates the train doors rather than a guard. It has been rumbling on for years.\nAccording to the BBC, Southern has so far paid out around £38 million to compensate passengers for late or cancelled services and set aside an extra £15 million for season-ticket holders.\nDriver-only-operated (DOO) trains were first introduced in the early 1980s and a third of the UK's services currently operate this way. The whole of the London tube network is DOO.\nThe unions have claimed that an expansion of driver-only trains risks endangering passengers in the event of an accident. However, the rail safety regulator has ruled that it is safe.\nBut mainly the unions also see widespread use of DOO trains as a path to job cuts in the future. Southern Rail has claimed that there will not be job cuts or pay cuts.\nPhilp pointed out that if the public wanted to get \"insight into the mentality\" of some of the union leaders, they should look towards the president of the RMT union Sean Hoyle.\nAccording to The Times, Hoyle said industrial action had been coordinated to \"bring down this bloody working-class-hating Tory government\" and that the union's \"rule number one\" was to \"strive to replace the capitalist system with a socialist order.\"\nMeanwhile, Labour MP Meg Hillier broke ranks and criticised union leaders and the strikes:\n\"It is absolutely right that people should have the right to strike but I think it is a very unfortunate combination for people travelling. And I think that all trade unions need to really think about the impact on the people they are actually there to serve, their customers or their passengers.\n\"There needs to be a bit of a wake-up call.\"\nAsked today whether they believe the strikes are being co-ordinated, the prime minister's spokesperson said the strikes were clearly being \"designed\" to disrupt people over the festive period.\n\"If these strikes share one thing in common it is a shared contempt for ordinary people trying to go about their daily lives,\" they added.","url":"https://www.businessinsider.com/chris-philp-interview-southern-rail-aslef-rmt-post-office-strikes-2016-12"}
