{"authors":["Allum Bokhari"],"date_download":"2018-10-30 18:22:15","date_modify":"2018-10-30 18:22:15","date_publish":"2015-04-22 13:12:40","description":"Equity feminist and former philosophy professor Christina Hoff Sommers is not a particularly threatening figure. But student activists at Oberlin and |","filename":"data/vaneerConsumption/ChristinaHoffSommersLectureLeadstoTriggerWarningsandSafeSpacesatOberlinandGeorgetown.json","image_url":"https://media.breitbart.com/media/2015/04/christina-hoff-summers.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_04_22__1540923735.html","title":"Christina Hoff Sommers Lecture Leads to 'Trigger Warnings' and 'Safe Spaces' at Oberlin and Georgetown","title_page":"Christina Hoff Sommers Lecture Leads to 'Trigger Warnings' and 'Safe Spaces' at Oberlin and Georgetown | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Equity feminist and former philosophy professor Christina Hoff Sommers is not a particularly threatening figure. But student activists at Oberlin and Georgetown colleges, where Sommers recently spoke, were insistent that her presence on their campuses posed a threat to the student population.\nActivists at Georgetown University held up “trigger warning” placards at Sommers’ lectures, warning that her arguments would be potentially traumatizing. They also posted signs directing students to a “safe space” in another part of the college. Much like the recent Calgary Expo, the prospect of having their beliefs challenged was enough to make the activists feel “unsafe”.\nThose who wish to judge for themselves how “traumatizing” Sommers’ lecture was can find a recording below.\nThe former professor has become increasingly prominent in recent years for her anti-victimhood, anti-censorship brand of feminism. In her series of “Factual Feminist” videos for the American Enterprise Institute, she challenges a host of feminist dogmas, including the belief that there is a rape culture on college campuses and the idea that the gender wage gap is a result of discrimination.\nShe also took a stance on the #GamerGate controversy last year, arguing that there was little evidence to show that video games or the video game industry were sexist. Her independent views on gender issues has given her an enthusiastic online fan base, with hundreds of thousands of views on her YouTube segments.\nCampus activists are less enthusiastic. According to them, Sommers’ questioning of the inaccurate yet widespread belief that 1 in 4 women are raped on US campuses is tantamount to “denying the experience of survivors.” They also accuse Sommers, who founded an entire school of feminist thought, of being an anti-feminist.\nThe zealotry of Georgetown’s activists was matched by their counterparts at Oberlin, who ramped up the rhetoric a few days later. According to the Ohio-based blog Third Base Politics, who reported from the event, activists accused Sommers of being an “internalised misogynist” who “participates in rape culture” and engages in “hate speech”.\nThe atmosphere was so hostile that campus police decided there was a credible threat to Professor Sommers’ safety, and provided her with an escort. On Twitter, Sommers noted the irony of requiring police protection from advocates of safe spaces.\nOberlin activists had \"safe space\" for those triggered by my talk.Oberlin admin. provided police security to protect me from safe spacers. — Christina H. Sommers (@CHSommers) April 21, 2015\nTold students that women could narrow wage gap by changing majors from, say, sociology to engineering.Room erupted.Horrified gasps & jeers. — Christina H. Sommers (@CHSommers) April 21, 2015\nDuring my talk a kindly philosophy professor stood up & urged students to be civil. He was jeered, mocked & crowd angrily yelled \"Sit down.\" — Christina H. Sommers (@CHSommers) April 21, 2015\nThe attack on Sommers is the latest symptom of a rising wave of political intolerance among the US student population. The Foundation for Individual Rights in Education (FIRE), which monitors acts of censorship on campuses, has found a steady increase in the number of politically-motivated speaker dis-invitations on campuses since 2000, with a huge surge occurring from 2012. Spiked Online’s Free Speech University Rankings record a similar increase in political and intellectual intolerance in the United Kingdom.\nMainstream commentators including Jonathan Chait and Bill Maher have drawn parallels between the current cultural climate and that of the early 1990s, when a growth in authoritarian left-wing language codes led to a backlash against “political correctness” from moderates. Then, as now, anti-authoritarian feminists like Sommers and Camille Paglia spoke out against a surge in the politics of victimhood and censorship on the part of their peers in feminist circles.\nDespite the bluster of activists, Sommers and her supporters are likely to win the debate once again. Campus screamers may be annoying, but they aren’t great at persuasion. Social psychologists have actually found a negative correlation between contact with stereotypical activists and commitment to their social causes. Even if few go through the trouble of publicly challenging them, activists are more likely to alienate onlookers than convince them.\nOnce again, readers can make their own minds up. Compare the video below to Sommers’ lecture at Georgetown, and decide for yourselves which seems more persuasive. You can also read activists’ response to Sommers in the Oberlin Review. The piece is entitled “A Love Letter to Ourselves.”\nSommers, who sits on the board of advisers of the Foundation for Individual Rights in Education, says the trend towards safe spaces and trigger warnings on college campuses is a danger to intellectual freedom. “Trigger warnings are creating a hostile environment for critical thinking and free expression,” Ms. Sommers said. “Professors at leading colleges and universities have to carefully scan their classroom materials for anything that might conceivably make a student uncomfortable.”\nMany agree with her. But in the current climate, will they speak up?","url":"https://www.breitbart.com/europe/2015/04/22/christina-hoff-sommers-lecture-leads-to-trigger-warnings-and-safe-spaces-at-oberlin-and-georgetown/"}
