{"authors":["Mika Doyle"],"date_download":"2018-10-31 01:41:48","date_modify":"2018-10-31 01:41:48","date_publish":"2018-09-14 18:50:41","description":"Awesome human and the internet’s bestie Chrissy Teigen recently opened up about her journey with postpartum depression during her first pregnancy in a candid op-ed in Glamour. Never one to shy away from the harder parts of life, Teigen talked about…","filename":"data/vaneerConsumption/ChrissyTeigenSaysEatingHerPlacentaHelpedHerAvoidPostpartumDepressionHeresWhatExpertsSay.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/545c3ffe-8eb6-4cec-9729-ec4d9a0fb94d-getty-954369680.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_chrissy-teigen-says-eating-her-placenta-helped-her-avoid-postpartum-depression-heres-what-experts-say-11920688_1540950108.html","title":"Chrissy Teigen Says Eating Her Placenta Helped Her Avoid Postpartum Depression - Here’s What Experts Say","title_page":"Chrissy Teigen Says Eating Her Placenta Helped Her Avoid Postpartum Depression — Here’s What Experts Say","title_rss":"NULL","source_domain":"bustle.com","text":"Awesome human and the internet’s bestie Chrissy Teigen recently opened up about her journey with postpartum depression during her first pregnancy in a candid op-ed in Glamour. Never one to shy away from the harder parts of life, Teigen talked about that journey in an interview with Rita Braver on CBS Sunday Morning, revealing that she ate her placenta after the birth of her second child, Miles Theodore, to avoid postpartum depression a second time around. Braver told Teigen she didn't think she could have her on primetime TV eating her placenta, to which Teigen laughed and said, \"Really? That's not a normal thing? I'm in L.A., it's very normal. They grill it here! You can try some of mine after.\"\nIf you’re having a bit of an ick moment, know that consuming the placenta after giving birth is actually not that unusual. According to Medical News Today, some moms are turning to what’s called “placentophagy” to treat their postpartum depression, which essentially means they’re consuming their placentas in various forms, like grilling it, drinking it in a smoothie, or swallowing it in capsules. But is eating your placenta all that beneficial? According to experts, there’s actually a lot of reasons why you shouldn’t eat your placenta to treat postpartum depression — or any other medical condition.\nDr. Adeeti Gupta, founder of Walk In GYN Care in New York, tells Bustle that consuming the placenta has become a popular remedy because the placenta is very rich in the hormones estrogen, progesterone, and other growth hormones. “Since one of the causes of postpartum depression is a sudden drop in these hormones,” Dr. Gupta tells Bustle, “theoretically, ingesting these hormones makes sense.”\nJerod Harris/Getty Images Entertainment/Getty Images\nDr. Mary Kimmel, assistant professor and medical director for the Perinatal Psychiatry Inpatient Unit at the University of North Carolina at Chapel Hill School of Medicine, tells Bustle the growth in popularity may be because people are starting to recognize postpartum depression, but there's still a stigma surrounding seeking treatment for it. For some people, says Dr. Kimmel, medications can cause unwanted side effects, so they may seek natural treatments instead.\nHowever, Dr. Gupta tells Bustle that the risks of consuming the placenta outweigh the benefits because the placenta contains many unknown infection-causing bacteria that could be ingested, even if you cook the placenta. “We have no evidence yet or proven safe practices on how to recover these hormones from a human placenta safely,” Dr. Gupta tells Bustle. “At this point, until we know of safe processes to ensure safe eradication of any infections that may harboring in that rich placental tissue, I would go with dangerous [to consume].”\nAccording to The New York Times, proponents for consuming the placenta say this is an ancient practice akin to traditional Chinese medicine. But the earliest reports of consuming the placenta as a medical remedy, says The New York Times, is actually in the early 1970s. And Medical News Today says reports of the health benefits of eating your placenta are mostly anecdotal. The research, says Medical News Today, doesn’t support what people are saying.\nStephen Brashear/Getty Images Sport/Getty Images\nAccording to The New York Times, the CDC reported a case of neonatal sepsis linked to a mom who handled or consumed a placenta that was contaminated with strep. And in 2017, the CDC released a case report about a mom who consumed placenta pills and contracted strep and then passed it on to her baby, Medical News Today reports. The CDC report said that no standards exist for processing placenta for human consumption, and that there's currently no scientific evidence to support the health benefits for postpartum depression. The report was based on a single case, but the fact remains that the Centers for Disease Control warns consumers that there are no standards for how the placenta is processed for consumption.\nChrissy Teigen is not alone in experiencing postpartum depression. Estimates vary, but the CDC says postpartum depression can affect as many as 1 in 5 people. According to the Mayo Clinic, treatment for postpartum depression usually includes a depression screening, therapy with a mental health professional, and sometimes antidepressants. Mayo Clinic also recommends asking your family and friends for support, and making sure you take time for yourself. There are many treatment options available, so if you think you might be experiencing postpartum depression, talk to your doctor about the treatment path that's right for you.\n\"The placenta is an amazing organ and research should continue to understand it and all that it does,\" Dr. Kimmel says. However, \"It is critical we continue to put resources towards the study of causes and treatments of postpartum depression, [and] continue to work to develop new treatments for women and their families.\"","url":"https://www.bustle.com/p/chrissy-teigen-says-eating-her-placenta-helped-her-avoid-postpartum-depression-heres-what-experts-say-11920688"}
