{"authors":["Jennifer Brett"],"date_download":"2018-10-30 21:34:05","date_modify":"2018-10-30 21:34:05","date_publish":"2015-06-04 10:50:13","description":"Chris Evans, in Atlanta filming \"Captain America: Civil War,\" is not only a fine actor but a good sp...","filename":"data/vaneerConsumption/ChrisEvansmakesitraininBuckheadlauncheshisownCaptainAmeri.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/10/20/Images/WPIMAGE_cmgajcbuzz_5548.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_buzz_chris-evans-makes_99c3f4804e681df83cc607ddf5d2f2d7__1540935245.html","title":"Chris Evans makes it rain in Buckhead, launches his own \"Captain Ameri","title_page":"Chris Evans makes it rain in Buckhead, launches his own \"Captain Ameri","title_rss":"NULL","source_domain":"ajc.com","text":"Chris Evans, in Atlanta filming \"Captain America: Civil War,\" is not only a fine actor but a good sport.\nThe star dined at Chops Lobster Bar on Tuesday night, enjoying an eight-ounce filet with a steamed lobster tail.\nBefore his crime fighting resumed, Chris posed for this fun photo with some fellow diners and autographed a dollar bill for Chef Ryan Delesandro - after customizing it a bit! Hilarious!\n[More \"Captain America: Civil War\" filming details and star sightings are below]\nChris Evans at Chops\nIn Cap We Trust!\nMore coverage:\nJeremy Renner takes you behind the scenes at “Captain America: Civil War” set\nScarlett Johansson, Chris Evans, Anthony Mackie on the set of Marvel’s “Captain America: Civil War”\nRobert Downey Jr. spotted in Atlanta\nChris Evans suits up for “Captain America” Civil War”\nJeremy Renner on the “Captain America: Civil War” set\nCap vs Crossbones! Chris Evans, Frank Grillo film action scenes at Marvel’s “Captain America: Civil War” set\n“Captain America” stars cheer on the Atlanta Hawks\nScarlett Johansson, Chris Evans spotted in Buckhead\nPhotos from the Buckhead set\nPhotos from the Midtown set\nChris Evans spotted toning his “monster” physique at Atlanta gym","url":"https://www.ajc.com/blog/buzz/chris-evans-makes-rain-buckhead-launches-his-own-captain-america-currency/ChaEov5ICx9gi1TFMW7fYK/"}
