{"authors":["Courtney Laermer"],"date_download":"2018-10-30 23:33:09","date_modify":"2018-10-30 23:33:09","date_publish":"2014-08-13 17:20:21","description":"Having been nominated in the Facebook-fueled ALS ice bucket challenge, Chris Christie posted his own ice-bucket video on Facebook on Tuesday night. In the video, Christie stands outside his home in his T-shirt and shorts, and announces he was…","filename":"data/vaneerConsumption/ChrisChristieTakesALSIceBucketChallengeIsAChampAboutIt.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/eb1648b7-e2d2-4115-9018-12c3c0166723.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_chris-christie-takes-als-ice-bucket-challenge-is-a-champ-about-it-4012424_1540942389.html","title":"Chris Christie Takes ALS Ice Bucket Challenge, Is A Champ About It","title_page":"Chris Christie Takes ALS Ice Bucket Challenge, Is A Champ About It","title_rss":"NULL","source_domain":"bustle.com","text":"Having been nominated in the Facebook-fueled ALS ice bucket challenge, Chris Christie posted his own ice-bucket video on Facebook on Tuesday night. In the video, Christie stands outside his home in his T-shirt and shorts, and announces he was nominated by Scott O'Neill of the New Jersey Devils to participate in this challenge and help to raise awareness for ALS. Christie joins millions of others in supporting this debilitating and deadly disease. It was only a matter of time before the \"Ice Bucket Challenge\" reached the Statehouse.\nThe Kennedys aren't the only ones nominating fellow celebrities for this challenge. And unlike other celebrities who turned down the challenge for various reasons (come on Obama! — well, at least he still made a monetary contribution), Christie proudly let that freezing water make a man out of him.\nAnd Christie continued to the play the \"public figures nominate public figures\" game — on Facebook, he wrote, \"I now nominate NJ Senator Cory Booker, Facebook’s Mark Zuckerberg and The Tonight Show Starring Jimmy Fallon. You all have 24 hours or you must donate $100 to ALS. Good Luck!\"\nPersonally, I'm just excited to see what Jimmy Fallon does.","url":"https://www.bustle.com/p/chris-christie-takes-als-ice-bucket-challenge-is-a-champ-about-it-4012424"}
