{"authors":["Press Association"],"date_download":"2018-10-23 00:56:45","date_modify":"2018-10-23 00:56:45","date_publish":"2016-01-29 14:33:51","description":"It has never been more important for Christians to stand up for their faith, Sir Michael Wilshaw has said, warning that society is becoming increasingly \"sec...","filename":"data/vaneerConsumption/Christiansmuststandupforfaithsayschiefschoolsinspector.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-1070b6e9-6c37-4b1e-a0e1-df9f876e531f-4PuZeKVXE7cd9005b2c876b0bd2b-866_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3422851_Christians-stand-faith-says-chief-schools-inspector_1540256205.html","title":"Christians 'must stand up for faith', says chief schools inspector","title_page":"Christians 'must stand up for faith', says chief schools inspector | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Christians 'must stand up for faith', says chief schools inspector\nIt has never been more important for Christians to stand up for their faith, Sir Michael Wilshaw has said, warning that society is becoming increasingly \"secular and materialistic\".\nYoung people today can easily \"lose sight of what really matters\", and schools can help to instil good morals and values such as tolerance and compassion, the Ofsted chief suggested.\nIn a speech to the Catholic Association of Teachers, Schools and Colleges' (CATSC) annual conference, Sir Michael said when he was working in schools he saw it as his duty as a teacher and a Christian to help give pupils values that they could live by throughout their lives.\nSir Michael Wilshaw warned against an 'increasingly materialistic' secular society\n\"It was about helping them to realise they would all transgress and make mistakes at some stage in their journey through life, but that there was always a way back into God's loving fold.\n\"The parable of the Prodigal Son was always my touchstone for the way I dealt with difficult situations and intransigent youngsters.\n\"As a headteacher, nothing gave me more joy and satisfaction than seeing someone who had started out badly, and been written off, coming right in the end.\n\"It was also about helping students to understand that by living a good life and living by Gospel values, they would eventually come to God.\"\nSir Michael went on to say: \" It doesn't need me to tell you that we are living in an increasingly secular and materialistic society where young people can so easily have their heads turned and lose sight of what really matters.\n\"At the same time, we are also living through an era marked by seemingly ever greater intolerance of other people's beliefs, views and ways of living.\n\"Therefore, it has never been more important for Christians to stand up for their faith and for the Gospel values of love, compassion and tolerance. Not just because of what's happening in this country, but in the context of what is happening in the Middle East and other parts of the world, where Christians are suffering brutal persecution for what they believe.\"\nThe chief schools inspector said that it is important for Catholic school leaders to inform pupils about other religions, even if their first role is to promote and celebrate their own faith.\n\"When I led a Catholic school in the heart of an overwhelmingly Muslim area of East London, I always made sure my pupils understood and respected the fact that others followed different customs and subscribed to a different set of beliefs. We didn't go into any great detail about other world religions, but I saw it as my obligation to teach pupils about the synergies between the great faiths and that all people are equal in the eyes of God.\n\"It is so important that, as Catholic leaders, we adopt this approach. All of us understand that erecting barriers and pushing others away breeds suspicion, insularity and division. This is certainly what we saw in a number of schools in Birmingham.\"\nOfsted is now actively inspecting how well schools are promoting values such as tolerance and respect, a move that came in the wake of the alleged Trojan Horse plot by hardline Islamists to take over some schools in Birmingham.\nA number of secular and faith schools have been failed by the watchdog for failing to promote these values and narrowing the curriculum, Sir Michael said.\n\"Let me be quite clear about this. It is perfectly legitimate for individuals and faith groups to hold firm to a particular set of values and beliefs, which may run counter to existing social norms.\n\"What is not legitimate is to use these beliefs to condone or even encourage intolerance and discrimination.\"","url":"https://www.dailymail.co.uk/wires/pa/article-3422851/Christians-stand-faith-says-chief-schools-inspector.html"}
