{"authors":["Paul Chavez For Dailymail.Com"],"date_download":"2018-10-22 23:02:44","date_modify":"2018-10-22 23:02:44","date_publish":"2017-03-10 01:56:07","description":"The 31-year-old model and John Legend, 38, opted for casual chic while shopping Thursday with their baby Luna in Beverly Hills, California.","filename":"data/vaneerConsumption/ChrissyTeigenandJohnLegendgoshoppingwithbabyLuna.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/01/3E1F15EB00000578-0-image-a-37_1489110559153.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299716_Chrissy-Teigen-John-Legend-shopping-baby-Luna_1540249364.html","title":"Chrissy Teigen and John Legend go shopping with baby Luna","title_page":"Chrissy Teigen and John Legend go shopping with baby Luna | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Chrissy Teigen and John Legend opted for casual chic while shopping Thursday with their baby Luna in Beverly Hills, California.\nThe 31-year-old model wore a loose white crew neck blouse over heavily distressed cuffed blue jeans.\nShe completed her look with a black fedora, black coat and open-toed black heels.\nScroll down for video\nShopping trip: Chrissy Teigen and John Legend took their baby Luna shopping with them Thursday in Beverly Hills, California\nChrissy accessorized with sunglasses and studded earrings.\nJohn, 38, kept it simple in an all-black attire with matching T-shirt, jacket, jeans and sneakers.\nHe wore black glasses and sported a bit of facial stubble.\nLuna wore a cute pink outfit with black stars while being pushed in a stroller by Chrissy and carried around by John.\nFather and daughter: John carried Luna as the family left an upscale department store\nCute baby: Luna wore a pink onesie with black stars while being carried by Chrissy\nWheeling around: Chrissy was on stroller duty and pushed Luna on the eight-wheeled buggy\nHaving fun: Luna played with a toy while her mother pushed the stroller\nChrissy earlier this week wrote an essay for Glamour in which she revealed suffering from postpartum depression after the birth of Luna in April 2016.\nThe former Sports Illustrated Swimsuit Issue cover girl admitted feeling 'selfish' about struggling after Luna's birth, but reported feeling better with the help of anti-depressants and therapy.\n'Getting out of bed to get to set on time was painful,' she wrote about co-hosting Lip Sync Battle.\nBig smile: Chrissy beamed as she carried Luna out of Barneys New York\nTender moment: Barefoot baby Luna received a tender kiss from Chrissy\nOpening up: Chrissy recently penned an essay for Glamour magazine revealing that she's been suffering from postpartum depression\n'My lower back throbbed; my shoulders - even my wrists - hurt. I didn't have an appetite. I would go two days without a bite of food... I couldn't figure out why I was so unhappy.'\n'When I wasn't in the studio, I never left the house. I had every shade closed. Most days were spent on the exact same spot on the couch and rarely would I muster up the energy to make it upstairs for bed.\n'John would sleep on the couch with me, sometimes four nights in a row. I started keeping robes and comfy clothes in the pantry so I wouldn't have to go upstairs when John went to work. There was a lot of spontaneous crying,' she revealed.\nBig kiss: The former Sports Illustrated Swimsuit Issue cover girl kissed Luna on her head\nTaking off: The family gathered after getting their car from a valet\nFan favorite: John waved as they left the department store\nChrissy said her postpartum depression forced her to postpone her second cookbook.\nShe praised John for his understanding and 'being incredible over the past nine months'.\n'He wants me to be happy, silly, and energetic again, but he's not making me feel bad when I'm not in that place,' she wrote.\nChrissy who has grown a reputation for her candor on social media was relieved to announce that she was coping with postpartum depression.\nShe ended her essay by writing: 'Phew! I've hated hiding this from you. XX, Chrissy.'\nMultiple bags: The singer carried multiple shopping bags from the upscale department store","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299716/Chrissy-Teigen-John-Legend-shopping-baby-Luna.html"}
