{"authors":["Carly Stern For Dailymail.Com"],"date_download":"2018-10-23 02:32:00","date_modify":"2018-10-23 02:32:00","date_publish":"2016-01-28 17:19:13","description":"Christie, 61, Ashley, 28, and Lana, 49, join Bridget, 44, who appeared in NYDJ's last ads. The 'diverse and multigenerational cast' poses together in the first image from the campaign.","filename":"data/vaneerConsumption/ChristieBrinkleyBridgetMoynahanandAshleyGrahamfrontdenimcampaign.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AC687B00000578-0-image-a-2_1453999341257.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3421264_It-s-jeans-Christie-Brinkley-Bridget-Moynhan-Ashley-Graham-star-studded-denim-campaign-celebrating-beauty-women-ages-sizes_1540261920.html","title":"Christie Brinkley, Bridget Moynahan, and Ashley Graham front denim campaign","title_page":"Christie Brinkley, Bridget Moynahan, and Ashley Graham front denim campaign | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Denim brand NYDJ's new campaign is totally star-packed, featuring not one but four beautiful women flaunting their good genes - and their jeans.\nChristie Brinkley, 61, Ashley Graham, 28, Bridget Moynahan, 44, and model Lana Ogilvie, 49 all appear in the brand's 'Fit to Be' campaign, which was unveiled on Wednesday.\nNYDJ noted that the 'diverse and multi-generational cast... highlights the feminine strength and beauty of women of all ages and all sizes'.\nScroll down for video\nStar power: Lana Ogilvie (left), Bridget Moynahan (second from left), Christie Brinkley (second from right), and Ashley Graham (right) all star in NYDJ's new campaign\nGorgeous: The brand shared a behind-the-scenes snap of the 'multigenerational' cast between shots\nMixing up the styles: The women are also in New York City today, promoting the campaign and modeling even more denim\nThe first image to be released features the four women posing close together, each wearing a while button-down and a different style of denim.\nChristie, the campaign's only blonde, rocks medium-wash flares, while Bridget - who also appeared in the last campaign - dons a light-wash boot-cut style.\nPlus-size model Ashley's dark-wash pair is cuffed to show off heels underneath, and Lana shows of a dark, slim-cut pair.\nThe brand has also revealed a behind-the-scenes shot on Instagram, in which the women are seen laughing in front of a wind machine.\n'I'm a FAN of these FABULOUS lovelies,' wrote Christie of her co-stars, sharing the image on her own account.\nFast friends: Lana, 49, also shared a picture of herself with Ashley, 28, on Instagram\nGuess who! Before revealing the stars yesterday, the brand teased a photo of just their feet\nWork it, girl: Ashley seemed to be trying to demonstrate how easy it is to move and stretch in the jeans at the NYC event\nBeauties: Bridget, 44, and Christie, 61, hammed it up at Manhattan's Lord & Taylor department store\nAll of the images were shot shot by photographer TESH, who has also worked with Reese Witherspoon, Heidi Klum, Penelope Cruz, and Sarah Jessica Parker.\nThe campaign certainly stands out among other fashion ads, bringing together women of different ages and shapes.\n'It was important for us to demonstrate that NYDJ is a brand that celebrates every woman’s unique body type,' explained NYDJ's President and CEO Bob Skinner. 'Whether she’s a size 2 or 22, we hear from our customers that there is a distinct emotional moment when she slips on NYDJ and experiences our signature, slimming fit.\nBring on the blues: The ladies hammed for the camera, modeling not just jeans but denim tops and jackets, too\nComing back for more: Bridget starred in the brand's last denim campaign (not pictured)\nShe wears it well: Christie rocked a double denim look in skinny jeans and a fitted jacket, left, as well as a more formal style of jeans with a black blouse\n'She feels beautiful, sexy, and empowered to take on her day, and we believe that the remarkable talent in our new campaign perfectly captures this transformative experience.'\nThough the stars steal the show, the campaign will actually feature 58 women in all, including bloggers and other 'influencers'.\nThe images will fall into a 'Fit to Be' theme, spotlighting that the women are Fit to Be Powerful, Fit to Be Sexy, and Fit to Be Confident.\nLook what I got! The blonde bombshell was later seen signing mementos for fans\nSmile! Christie made a fans day as she posed up with his baseball","url":"https://www.dailymail.co.uk/femail/article-3421264/It-s-jeans-Christie-Brinkley-Bridget-Moynhan-Ashley-Graham-star-studded-denim-campaign-celebrating-beauty-women-ages-sizes.html"}
