{"authors":[],"date_download":"2018-10-22 20:34:53","date_modify":"2018-10-22 20:34:53","date_publish":"2014-06-02 13:31:52","description":"U.S. safety regulators are investigating whether a recall to fix air bags on nearly 745,000 Chrysler SUVs is working properly.","filename":"data/vaneerConsumption/ChryslerAirbagRecallProbedbySafetyWatchdog.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/481181/140602-chrysler_0928_332476383d1a756fbe2b2f2334a9ef88.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_autos_chrysler-airbag-recall-probed-safety-watchdog-n120201_1540240493.html","title":"Chrysler Airbag Recall Probed by Safety Watchdog","title_page":"Chrysler Airbag Recall Probed by Safety Watchdog","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nU.S. safety regulators are investigating whether a recall to fix air bags on nearly 745,000 Chrysler SUVs is working properly.\nThe company recalled older-model Jeep Grand Cherokees and Libertys in 2012 because the air bags could inflate without a crash, causing injuries.\nChrysler installed an electrical filter to eliminate electrical spikes on air bag circuits and thought that would solve the problem.\nBut since the recall, the company has received six reports of air bags inflating without a crash on SUVs that had the recall repairs.\nNo crashes were reported, but owners said there were some cuts and burns, according to documents posted Monday on the National Highway Traffic Safety Administration website.\nThe safety agency says it's investigating whether the recall is working. Chrysler says it's cooperating but hasn't determined whether the recall is working.\nThe investigation affects Libertys from the 2002 and 2003 model years and Grand Cherokees from 2002 to 2004.","url":"https://www.nbcnews.com/business/autos/chrysler-airbag-recall-probed-safety-watchdog-n120201"}
