{"authors":[],"date_download":"2018-10-30 21:45:24","date_modify":"2018-10-30 21:45:24","date_publish":"2016-12-20 22:51:00","description":"Anniversary service: The 10th anniversary of Episcopal Church of the Common Ground will feature Chri...","filename":"data/vaneerConsumption/Churchservicesandmusicevents.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/20/Images/newsEngin.17103223_MJCCA-Intown-Theatre-Program_1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_religion_atlanta_fc7b9d5dd8852bd852b0317da260fb36__1540935924.html","title":"Church services and music events","title_page":"Christmas in Atlanta 2016: Church services and music events","title_rss":"NULL","source_domain":"ajc.com","text":"Anniversary service: The 10th anniversary of Episcopal Church of the Common Ground will feature Christmas carols, poetry and an outdoor worship service from 1-2 p.m. Dec. 24 in Woodruff Park (91 Peachtree St. N.W., Atlanta). This church without walls has no building, but for a decade has served the spiritual needs of people who struggle to live on the streets of Atlanta. Bishop Keith Whitmore of the Episcopal Diocese of Atlanta will lead Common Ground church members, volunteers and special guests in worship and celebration. Information: 404-873-7667, www.churchofthecommonground.org.\nChristmas services: Perimeter Church will offer the following services on Dec. 24, Christmas Eve: 2, 4, 6 and 9 p.m. On Dec. 25, Christmas Day, the service will be held at 10:45 a.m. Information: 9500 Medlock Bridge Road, Johns Creek. 678-405-2000, www.perimeter.org.\nChristmas services: St. Mark United Methodist Church will offer the following services on Dec. 24, Christmas Eve: a family friendly service at 5 p.m. as well as pre-music followed by a candlelight service at 7 and 11 p.m. On Dec. 25, Christmas Day, worship will begin at 10 a.m. Information: 781 Peachtree St. N.E., Atlanta. 404-873-2636, www.stmarkumc.org.\nChristmas Day service: To celebrate the season, a special service titled “Oh, Come Let Us Adore Him” will feature holiday music and excerpts from George Frideric Handel’s “Messiah,” which will begin at 9:15 a.m. Dec. 25 at Ebenezer Baptist Church. Information: 101 Jackson St. N.E., Atlanta. 404-688-7300, www.historicebenezer.org.\nRELATED: Wait: Is your church closed on Christmas Sunday?\nRELATED: Find more Christmas services in our online calendar\nUPCOMING\nNew Year’s Eve service: Bring in the new year with music, laughter and prayer. R&B/soul recording artist Winston Warrior and comedian Jeremy Hill will perform during a special service beginning at 10 p.m. Dec. 31 at Hillside International Truth Center Inc. Prepare for the traditional burning bowl by writing on a sheet of paper the things you do not want to bring into the new year. Toss it into the flames of the burning bowl to reinforce your awareness that it is over and out of your life. Prepare your letter to God by listing your desires, goals and objectives for the coming year, then place it in a self-addressed, stamped envelope and bring it into the service with you, where it will be collected. Bishop Dr. Barbara King will deliver a sermon to help guide attendees into the new year. Information: 2450 Cascade Road S.W., Atlanta. 404-758-6811, www.hillsideinternational.org.\nTheater boot camp: A new theater sampler course for children in the fourth through eighth grades, which will culminate in a musical revue with songs, scenes and monologues, will be held from 4:30-6 p.m. Tuesdays, Jan. 3-March 28, 2017, at Congregation Shearith Israel (1180 University Drive N.E., Atlanta). The participation fee is $280 for Marcus Jewish Community Center of Atlanta and Shearith Israel members and $360 for all others. Call 678-812-4073 for additional details. Information: 678-812-4002, www.atlantajcc.org.\nHave an event you’d like to publicize? Send an email with all event details, a contact phone number and photo (if available) in the body to: ajcfaithcalendar@gmail.com. You can also post your event at www.ajc.com/calendars.","url":"https://www.ajc.com/lifestyles/religion/atlanta-christmas-events-church-services-carols-this-weekend/X9RQIxgRfGfwATHYYIMt4I/"}
4I/?hnbjm"}
