{"authors":["Donna Rachel Edmunds"],"date_download":"2018-10-30 18:15:05","date_modify":"2018-10-30 18:15:05","date_publish":"2015-03-09 13:01:04","description":"A charity whose patrons include the Archbishop of Canterbury Justin Welby and journalist Jeremy Paxman is taking Welfare Secretary Iain Duncan Smith to |","filename":"data/vaneerConsumption/ChurchLinkedCharityInvolvedinLegalFightAgainstWelfareReform.json","image_url":"https://media.breitbart.com/media/2014/12/Archbishop-of-Canterbury-Justin-Welby.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_03_09__1540923305.html","title":"Church-Linked Charity Involved in Legal Fight Against Welfare Reform","title_page":"Church-Linked Charity Involved in Legal Fight Against Welfare Reform | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A charity whose patrons include the Archbishop of Canterbury Justin Welby and journalist Jeremy Paxman is taking Welfare Secretary Iain Duncan Smith to court over welfare reforms including the spare room subsidy and stricter guidelines on discretionary housing payments.\nThe church is already at muted war with the Conservative party following a pastoral letter, published last month, which suggested the reversal of a number of welfare policies enacted by this government. Prime Minister David Cameron hit back saying “welfare system that pays people to stay idle when they could work is not the sign of . . . a strong or good society”.\nNow it has emerged that Justin Welby is one of the patrons of the Zacchaeus 2000 Trust (Z2K), which is currently involved in legal challenges to the spare room subsidy (also known as the bedroom tax), and personal independence payments (PIPs) for sick and disabled people, the Sunday Times has reported.\nNext month, Z2K will act as “intervener” in a judicial review of PIPs. It is also awaiting the outcome of another judicial review that it supported, regarding claims from disabled tenants that they were unfairly penalised by the end of the spare room subsidy.\nIt has in the past mounted a legal challenge to Westminster Council’s policy on discretionary housing benefit, a fund which is handed out short term upon application to tenants struggling to pay their rent, although that challenge has since been withdrawn.\nAnd it has applied to intervene in the Supreme Court in the case of Titina Nzolameso, a single mother of five who became homeless when Westminster council attempted to relocate her to a location near Milton Keynes in Buckinghamshire.\nZ2K has admitted to taking casework referrals from Karen Buck, the Labour member of Parliament for Westminster North and an outspoken opponent of the government’s welfare reforms. But the charity countered that it had offered to do the same for Conservative MPs, but had had no response.\nMajor donors to the charity include Baron Sainsbury of Turville, a philanthropist who served as science minister under Tony Blair, and Richard Curtis, creator of BBC show The Vicar of Dibley. That series was filmed in Turville. Buckinghamshire, where the founder of Z2K, Rev Paul Nicolson, was a parish priest. Richard Curtis also had a hand in founding Comic Relief, to which Z2K has applied for funds.\nA source close to Iain Duncan Smith has criticised the charity, saying “Our welfare reforms are about transforming lives and I think the public would be surprised to learn how their money is being misspent by these charities. Maybe they too should concentrate on transforming lives on the ground instead of using donations to attack government policies.”\nA spokesman for Justin Welby said that he had agreed to be a patron of the charity two years ago on the understanding that he would not be expected to play a day to day role in the running of the charity, or to solicit financial support.","url":"https://www.breitbart.com/europe/2015/03/09/church-linked-involved-in-legal-fight-against-welfare-reform/"}
