{"authors":["Npr Staff"],"date_download":"2018-10-23 00:48:05","date_modify":"2018-10-23 00:48:05","date_publish":"2016-05-06 00:00:00","description":"\"My Old Kentucky Home\" is sung every year at the Kentucky Derby. Written in 1852 as an anti-slavery ballad, the song has a more sinister meaning upon closer examination.","filename":"data/vaneerConsumption/ChurchillDownerTheForgottenRacialHistoryOfKentuckysStateSong.json","image_url":"https://media.npr.org/assets/img/2016/05/05/gettyimages-94857284_wide-3da178857ad71a5fc1a13ffeba87f2cc6baa16b0.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_codeswitch_2016_05_06_476890004_churchill-downer-the-forgotten-racial-history-of-kentuckys-state-song_1540255685.html","title":"Churchill Downer: The Forgotten Racial History Of Kentucky's State Song","title_page":"Churchill Downer: The Forgotten Racial History Of Kentucky's State Song : Code Switch : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Churchill Downer: The Forgotten Racial History Of Kentucky's State Song\nEnlarge this image toggle caption Bloomberg via Getty Images Bloomberg via Getty Images\nEvery year at the Kentucky Derby, crazy hat-wearing, mint julep-guzzling horse-gazers break into a passionate rendition of Kentucky's state song, \"My Old Kentucky Home.\" As tradition goes, the University of Louisville Cardinal Marching Band accompanies the crowd as they croon a ballad that seems to be about people who miss their happy home. \"The sun shines bright on my old Kentucky home/'Tis summer and the people are gay,\" begins one version.\nBut Frank X Walker, Kentucky's former poet laureate, suspects that most people are missing the point.\n\"I'm a Kentuckian, and I love my state,\" Walker says. \"But at the same time, you know, the memories, the history this conjures up, I think people sing it and are totally disconnected from the history, from the truth.\"\nHe refers to these lyrics:\n\"The young folks roll on the little cabin floor,\nAll merry, all happy and bright.\nBy 'n by hard times comes a-knocking at the door,\nThen my old Kentucky home, good night.\"\nWalker says that though it may sound like \"a happy family environment in a humble cabin experience,\" there's definitely something more going on. \"My Old Kentucky Home\" was written by Stephen Foster in 1852, years before the Civil War. Foster was an American composer, famous in part for his minstrel music. The characters he references — the ones who had to leave Kentucky — were slaves.\nIn fact, \"My Old Kentucky Home\" was originally sold as an anti-slavery song. The final verse shows slaves being \"sold down the river,\" as it was called in those days — sent down the Ohio and Mississippi to serve on sugar cane plantations, where they might be worked to death in the sun.\nIt includes the lyrics, \"A few more days and the trouble all will end, in the field where the sugar cane grows.\" Paul Robeson sang that verse generations ago; today, people rarely do.\nAnother part of the song has vanished today. Foster's lyrics called the enslaved people \"darkies.\" These days, that word is no longer sung, which leaves no explicit reference to black people.\nBut Walker wants people to know the real story behind Kentucky's state song, even if they always thought they were hearing a simple, romantic song of home.\n\"[Foster] wasn't from Kentucky, so he imagined, or he witnessed something that suggested that is was a great place to be a slave,\" Walker says. \"My issue is that there was no good place to be a slave.\"","url":"https://www.npr.org/sections/codeswitch/2016/05/06/476890004/churchill-downer-the-forgotten-racial-history-of-kentuckys-state-song"}
