{"authors":["Frances Martel"],"date_download":"2018-10-30 19:24:31","date_modify":"2018-10-30 19:24:31","date_publish":"2015-01-30 17:59:50","description":"The former head of security for Venezuela's Second in Command has defected to the United States, accused his old boss of running an international drug cartel, and now claims that deceased dictator Hugo Chávez Frías died months before the official announcement of his death, hidden from the public eye by current Venezuelan leaders who used his name to pass legislation convenient for them under Chávez's name. |","filename":"data/vaneerConsumption/ChvezDiedMonthsBeforeAnnounced.json","image_url":"https://media.breitbart.com/media/2015/01/Hugo-Chavez-Death-2013-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_01_30__1540927471.html","title":"Chávez Died Months Before Announced","title_page":"Venezuelan Security: Chávez Died Months Before Announced","title_rss":"NULL","source_domain":"breitbart.com","text":"The former head of security for Venezuela’s Second in Command has defected to the United States, accused his old boss of running an international drug cartel, and now claims that deceased dictator Hugo Chávez Frías died months before the official announcement of his death, hidden from the public eye by current Venezuelan leaders who used his name to pass legislation convenient for them under Chávez’s name.\nLeamsy Salazar is the highest ranking military official in the history of Venezuela to defect. Before taking on the position of leading security personally for Diosdado Cabello, the leader of Venezuela’s National Assembly and second-in-command in the nation’s Socialist Party, he served as the head of security for Hugo Chávez. In this position, he reportedly told U.S. officials, he witnessed how the current government in Venezuela hid the news of Chávez’s death from the public for months.\nAccording to Guillermo Cochez, an ex-ambassador to the Organization of American States (OAS), Salazar told U.S. officials that Chávez died in December 2012 — not March 2013 — this week, after he was confirmed to have arrived in the United States to work on an indictment in the New York Southern District Court against Cabello.\nLeamsy Salazar confirma q Chávez murió a las 7:32 pm del 30Dic12. Cuanta mentira dijeron para ocultar q estaba muerto. Sinvergüenzas — Guillermo A. Cochez (@willycochez) January 28, 2015\nThe tweet reads: “Leamsy Salazar confirms that Chavez died at 7:32 PM on 30 Dec 12. How many lies have they told to hide that he was dead. Shameless.”\nArgentine news outlet Infobae notes that, if this allegation is true, the current Venezuelan government would have to explain who approved dozens of legislative initiatives and executive orders previously believed to have been signed by Chávez between December and March 5, the date of his official death. “Those in charge of this public manipulation would have benefitted politically and economically with the signing of mandates allegedly validated by the dead commander,” the paper reports.\nAs head of Chávez’s security services, Salazar held a beloved position in the dead leader’s private court. In footage from Chávez’s multi-hour television program Aló Presidente unearthed by Latin American media sources, Chávez can be seen heaping praise on Salazar as a “humble and great soldier of our marine forces.”\nThe Venezuelan government has not responded to the allegations regarding Chávez’s death, but have responded to the cartel accusation. Salazar is planning to testify in New York, according to reports, that Cabello is the capo of the Cartel de los Soles, named after the Venezuelan military uniform due to the high number of members believed to also be serving in Venezuela’s armed forces. The Cartel de los Soles specializes in trafficking cocaine in Venezuela, Colombia, Mexico, and the United States. The government of Cuba has also been implicated in aiding Cartel members with finding trade routes in the Caribbean less accessible to law enforcement.\n“Imperialist hands are behind this,” said President Nicolás Maduro of the allegations in a trademark extensive speech Tuesday, warning, “A hell of solitude awaits whoever betrays the revolution.”\nU.S. State Department officials have not remarked on the Salazar comments in detail, but William Brownfield, the State Department’s top anti-narcotics official, has not ruled out the veracity of Salazar’s alleged testimony. Salazar’s claim, Brownfield told the press, “is not inconsistent with that narrative. That is as far as I am inclined to go.”\nIn addition to Salazar, eight other members of President Maduro’s personal security force have deserted Venezuela and defected to the United States, according to reports in Venezuelan newspaper El Nacional.","url":"https://www.breitbart.com/national-security/2015/01/30/venezuelan-security-head-chavez-died-months-before-official-announcement/"}
