{"authors":["Caroline Pate"],"date_download":"2018-10-30 23:09:53","date_modify":"2018-10-30 23:09:53","date_publish":"2014-08-13 23:52:05","description":"It seems all the celebrity news has taken a turn for the worse this week: R&B princess Ciara has broken off her engagement to AutoTune rapper and father of her child Future, reportedly due to cheating allegations. Sure, they're no Jay Z and Beyonce,…","filename":"data/vaneerConsumption/CiaraFutureSplitButWellMissTheirDynamicCollaborationstheMostVIDEOS.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/96e0535b-9bf1-491c-b800-2ec6abc25588.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35689-ciara-future-split-but-well-miss-their-dynamic-collaborations-the-most-videos_1540940993.html","title":"Ciara & Future Split But We'll Miss Their Dynamic Collaborations the Most - VIDEOS","title_page":"Ciara & Future Split But We'll Miss Their Dynamic Collaborations the Most — VIDEOS","title_rss":"NULL","source_domain":"bustle.com","text":"It seems all the celebrity news has taken a turn for the worse this week: R&B princess Ciara has broken off her engagement to AutoTune rapper and father of her child Future, reportedly due to cheating allegations. Sure, they're no Jay Z and Beyonce, but the duo was the reigning couple for the younger generations of mainstream hip-hop. And while we know Ciara will be just fine on her own, it's not only the loss of their relationship that is being mourned: it's their collaborations.\nAfter all, it was their first collaboration that brought Ciara her biggest and best hit since the early 2000's. The pair worked naturally well together: Future's warbly AutoTuned voice brought an interesting edge to Ciara's music, while Ciara's sultry croon made Future's alien voice sound a little more human. Through their music, fans were able to see their relationship progress before their eyes...or ears, rather. And now that the love is gone, what will happen to their careers? Alas, we shall never know what the future (or the Future) holds. All we can do is remember the good times. So here are some of the best collaborations between the parents of the Future (no, really):\n\"Body Party\"\nCiaraVEVO on YouTube\nIt was the beginning of a beautiful relationship (it was also my jam for the better part of Summer 2013). Sure, you can credit the song's success to the liberal use of samples from the incredible '90s Miami bass song, \"My Boo\" by Ghost Town DJs (which is my eternal jam). But I like to think the song got a little something from the spark of romance between Ciara and Future — just watch the video for their awkwardly scripted flirting.\n\"Sorry pt. 2 Remix Feat. Future\"\nCiara on YouTube\nThis is one of a couple remixes from Future and Ciara, and both improved upon the original. \"Sorry,\" released as a digital download before Ciara's self-titled album, was a watered-down midtempo ballad that showed a lot of promise. The remix turns up the bass and the Future-Ciara duet sounds more urgent and passionate than the original vocals.\n\"Turn on the Lights Remix Feat. Ciara\"\nCiara on YouTube\nIn this remix of Future's hit song \"Turn on the Lights,\" the song is giving a glittering wash of synth. Future's digital crackle of a voice can often begin to sound monotonous, so Ciara brought her bad girl attitude to croon a counterpoint.\n\"Anytime feat. Future\"\nYouTube\nCiara and Future go a little arena rock in this duet, and it's not their best work. But it's seemingly genuine love song between the two, and it's pretty sad to hear in retrospect.","url":"https://www.bustle.com/articles/35689-ciara-future-split-but-well-miss-their-dynamic-collaborations-the-most-videos"}
