{"authors":["Quinn Keaney"],"date_download":"2018-10-30 23:39:05","date_modify":"2018-10-30 23:39:05","date_publish":"2014-08-13 14:53:33","description":"Say it isn't so! \"I'm Out\" R&B diva Ciara, 28, is officially out of her relationship with baby daddy and rapper Future (a.k.a. Nayvadius DeMun Wilburn) 30, with multiple reports leaking that the hip-hop power couple Ciara and Future has called off…","filename":"data/vaneerConsumption/CiaraLyricsProveShellSurviveaBreakupWithFianceFuture.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/22ef5b1e-eb2c-4ec7-a539-cebed5c3ea02.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35578-ciara-lyrics-prove-shell-survive-a-breakup-with-fiance-future_1540942745.html","title":"Ciara Lyrics Prove She'll Survive a Breakup With Fiance Future","title_page":"Ciara Lyrics Prove She'll Survive a Breakup With Fiance Future","title_rss":"NULL","source_domain":"bustle.com","text":"Say it isn't so! \"I'm Out\" R&B diva Ciara, 28, is officially out of her relationship with baby daddy and rapper Future (a.k.a. Nayvadius DeMun Wilburn) 30, with multiple reports leaking that the hip-hop power couple Ciara and Future has called off their engagement due to Future cheating. Although it's seems a little unbelievable that anyone would dare cheat on a bad bitch like Ciara (like, are you serious Future?) the dream team duo and new parents to three-month-old baby Future Zahir Wilburn, otherwise known as the \"baby with the most interesting name ever,\" are no more. Though they've been together since their engagement on Ciara's birthday in Oct. of 2013 when Future popped the question with a stunning 15-carat diamond ring, the amount of rumors that have been recently surrounding the couple unfortunately makes the news come as no surprise.\nUs Weekly was the first to break the news, after a source came forward citing Future's wandering eye as the cause for the split.\n\"He cheated on her. Game over.\" Another Us source adds: \"She's devastated. Ciara's focus now is the baby.\"\nThis comes as very sad news, especially since they seemed like a match made in hip-hop heaven. In an interview with Brides magazine in May 2014, Ciara couldn't stop gushing about her hubby-to-be.\nI went into the studio strictly to work, but he was very calm and sweet, a gentleman…I knew right away that he was different. Now he's my best friend in the world, my partner.\nSigh.\nIf there's any possible bright side to this breakup, it's that Ciara will come through this on top, and might even give her enough material to crank out a few hits down the road. For now, though, let's take a look at past Ciara songs that prove her future without Future will be just fine.\n\"Like A Boy\"\nWhat if I/Had a thing on the side/Made ya cry/Would the rules change up/Or would they still apply/If I played you like a toy/Sometimes I wish I could act like a boy\nSomething about the lyrics in \"Like A Boy\" gives me the feeling that Ciara will have zero qualms about getting a little payback on Future.\n\"Hotline\"\nCall me up/Hot line I got some conversation/I can be your operator/Baby you should call me later\nIf Future thinks for one minute Ciara is going to be crying by the phone instead of using it to call up the countless eligible bachelors out there who would kill to date her, he's crazy.\n\"Ride\"\nImeh Akpanudosen/Getty Images Entertainment/Getty Images\nCatch me in the mall/You know I buy it out/G5 plane, yeah I fly it out\nWhile Ciara must be absolutely heartbroken over all of this, the piles and piles of money she has will no doubt help get her through.\n\"Pretty Girl Swag\"\nAnd you can find me on the stage (all day)/Don't you know (I go hard)/Givenchy on my shades/I'm the girl around the way/Still the princess of the A (hey)\nShe's smokin' hot, has a bangin' voice, and confidence out the wazoo. Get it, Ciara.\n\"I'm Out\"\nIf you know that you better/Than the new girl that he on/Go 'head and tell him now/'You gon' miss me when I'm gone.'\nPeace out, Future.","url":"https://www.bustle.com/articles/35578-ciara-lyrics-prove-shell-survive-a-breakup-with-fiance-future"}
