{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 20:33:12","date_modify":"2018-10-22 20:33:12","date_publish":"2016-01-29 02:03:04","description":"All of the documents are dated from the late 1940s to the 1960s, but were top-secret until the organization posted them online this week following the return of The X-Files on television.","filename":"data/vaneerConsumption/CIAreleases1000sofdeclassifiedXfilesonaliensandUFOs.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/30AE3F1400000578-0-image-a-33_1454029801033.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422014_The-truth-really-CIA-releases-thousands-declassified-X-files-aliens-flying-saucers-unexplained-phenomena_1540240392.html","title":"CIA releases 1000s of declassified 'X-files' on aliens and UFOs","title_page":"CIA releases 1000s of declassified 'X-files' on aliens and UFOs | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The CIA has released thousands of declassified documents on flying saucers, aliens and other unexplained phenomena.\n'We've decided to highlight a few documents both skeptics and believers will find interesting,' the agency said on its website.\nThe post continued: 'Below you will find five documents we think X-Files character Agent Fox Mulder would love to use to try and persuade others of the existence of extraterrestrial activity.'\nAll of the documents are dated from the late 1940s to the 1960s, but were top-secret until now.\nScroll down for video\nUnexplained happenings: The CIA recently released files from its archives investigating reports of alien and UFO sightings. The organization said the declassified documents will interest both believers and skeptics\nInvestigations: Some of the documents do not find an explanation for the reported UFO sightings, but also do not have evidence they happened in the first place\nOne of the files attached to the post is a document from East Germany in 1952, where agents were called to investigate what witnesses described as a 'huge flying pan'.\nThe object was said to have a diameter of about 15 meters, according to the document.\nSimilar flying saucers were also spotted in North Africa and Spain, the report said.\n'The picture [of the object] shows a diagonal stripe of diminishing width and lighter in shade than the sky over the dark bulk of a building cornice,' it was noted.\nIncluded with some of the documents were three pictures of the alleged extraterrestrials.\nOne of the photos - taken by British student Alex Birch in 1962 - claimed to show a group of flying saucers flying over the city of Sheffield in the UK.\nFlying saucer: This picture of an unexplained flying object was taken over Passoria, New Jersey in July 1952\nA police officer stands near to his patrol car outside the town of Socorro, New Mexico where a flying saucer was spotted in 1964\nSome of the pictures taken at the scene of the incident, for which no explanation has been offered\nHowever the photo was proven to be a hoax.\nThe files also detail a case of flying saucers that were spotted over what was formerly Belgian Congo.\nThe document reveals that two 'fiery discs' were seen over a uranium mine, and that the discs had 'glided curves and changed position many times'.\nIt then adds: 'Suddenly, both discs hovered in one spot and then took off in a unique zigzag flight to the north east.\n'A penetrating hissing and buzzing sound was audible to onlooker below. The whole performance lasted 10 to 12 minutes.'\nSubject - Flying Saucers: This is one of the documents released by the organization investing sightings, dated October 5, 1952\nThe CIA has released thousand of top secret UFO files from its archives. One of the documents is seen here, showing a sketch of a 'flying saucer'\nAn aircraft was then set to investigate the object, and got with meters of the saucer and according to the pilot, the inner core of it remained totally still while the a knob opening could be seen from the outside.\nThe pilot then gave up his pursuit when the 'disc' appeared to disappear.\nAlso contained in the files is the case in Socorro, New Mexico in 1964, when police officer Lonnie Zamoraspotted a large flame rise from the ground and pierce the sky above a remote patch of desert.\nHe went to investigate and found a shiny object the size of a sedan perched on the hilltop, which was oval in shape and aluminium in color.\nThe object then began to rise into the air and then sped away from him over the mountains and disappeared.\nOne of the files attached to the post is a document from East Germany in 1952 (pictured in part), where agents were called to investigate what witnesses described as a 'huge flying pan'\nOne of CIA documents even gave a 10-point list on what to do if someone were to spot a purported UFO, which was posted to Twitter.\n'Take several pictures of the object; as many as you can. If you can, include some ground in the picture of the UFO,' the agency advised.\nHowever the CIA seemed to side more with Agent Dana Scully, the character played by Gillian Anderson, who for the entire succession of the cult Sci Fi series denounced her belief in the supernatural.\nIn releasing the documents, the CIA said they were proving that 'there is a scientific explanation for UFO sightings'.\nThe CIA even tweeted a list of what to do in the event of sighting a possible UFO. It tagged The X-Files, Gillian Anderson and David Duchovny in the post\nThe CIA has always denied having any proper intelligence about aliens.\nBut it has often organized scientific panels to discuss the nature of these allegedly alien objects.\nThe scientists typically concluded that 'the subject UFO is not of direct intelligence interest', the website RT reported.\nThe release of the documents coincide with the long-awaited return of The X-Files on Sunday.\nThe beloved show was rebooted by the Fox Network after 10 years, with its two original stars reprising their roles.\nStephen Bassett, executive director of the Paradigm Research Group, who is campaigning for the US government to admit aliens are visiting Earth, told The Mirror that the CIA appears to have used the return of The X-Files to their benefit.\n'It appears the CIA used the revival of the X-Files franchise as a convenient time to remind the public the agency has, in fact, engaged the extraterrestrial presence issue in the past,' Bassett told the newspaper.\n'Post-disclosure the CIA will have substantial public relations issues as it has played a significant role in maintaining the truth embargo over six decades.\n'These recent postings could have an inoculative effect in service to the agency's future PR strategy.'\nThey're back: Fox Mulder (David Duchovny) and Dana Scully (Gillian Anderson) are drawn back into the world of the X-Files in this still from the new season of the show\nAgents Scully and Mulder are seen here in a still from season seven of The X-Files, which aired in May 2000","url":"https://www.dailymail.co.uk/news/article-3422014/The-truth-really-CIA-releases-thousands-declassified-X-files-aliens-flying-saucers-unexplained-phenomena.html"}
