{"authors":["Cheyenne Macdonald For Dailymail.Com"],"date_download":"2018-10-23 03:19:08","date_modify":"2018-10-23 03:19:08","date_publish":"2016-01-29 18:08:30","description":"To help amateur alien hunters launch their own investigations, the CIA has released ‘ 10 Tips When Investigating a Flying Saucer .’ This comes after the release of the CIA's own 'X-Files' documents.","filename":"data/vaneerConsumption/CIAreveals10tipstocarryoutyourownXFilessearch.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30ADF30C00000578-0-image-a-29_1454089358868.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3423107_How-flying-saucer-CIA-reveals-carry-X-Files-investigation-unexplained-phenomenon_1540264748.html","title":"CIA reveals 10 tips to carry out your own X-Files search","title_page":"CIA reveals 10 tips to carry out your own X-Files search | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Earlier this week, the CIA released a glimpse into its own set of 'X-Files,' a small compilation of documents pulled from its expansive UFO collection, dating back to the 1940s.\nThe agency said that these documents appeal to both skeptics and believers – the Scully's and Mulder's of the world – who seek to prove scientific explanations, or confirm the existence of extraterrestrial activity.\nTo help amateur alien hunters launch their own investigations, the CIA has released '10 Tips When Investigating a Flying Saucer.'\nUnexplained happenings: The CIA recently released files from its archives investigating reports of alien and UFO sightings. The organization said the declassified documents will interest both believers and skeptics\nCIA'S 10 TIPS FOR ALIEN HUNTERS 1. Establish a group to investigate and evaluate sightings 2. Determine the objectives of your investigation 3. Consult with experts 4. Create a reporting system to organize incoming cases 5. Eliminate false positives 6. Develop methodology to identify common aircraft and other aerial phenomena often mistaken for UFOs 7. Examine witness documentation 8. Conduct controlled experiments 9. Gather and test physical and forensic evidence 10. Discourage false reporting\nThis release coincides with the return of The X-Files and its beloved characters, Agent Fox Mulder and Agent Dana Scully, after 10 years off the air.\nLike Scully, the CIA takes a skeptical approach to these cases of unexplained phenomena.\nThe U.S. Air Force's UFO investigation program, called Project Blue Book, began operations in the 1940s, but was terminated just over 20 years later.\nNow, the agency only pays 'peripheral attention' to UFO sightings, but is offering its expertise to help you continue the search.\n'With over 20 years of investigations, from the late 1940s until Project Blue Book's termination in 1968, the CIA and USAF have learned a thing or two about how to investigate a UFO sighting,' the agency writes.\nMuch of the report comes accounts by Hector Quintanilla, the last chief officer of Project Blue Book.\nWhether you're a believer or a skeptic, these 10 historically-supported tips from the CIA can help you add method your investigation, and distinguish between truth and hoax.\n1. Establish a group to investigate and evaluate sightings\nAgents Scully and Mulder are seen here in a still from season seven of The X-Files, which aired in May 2000\nWithout an organization, there are no standards by which to evaluate reports of UFOs and other unexplained phenomena, the CIA explains.\nEstablishing a group will allow for the unified collection of measurable data points, and results from controlled experiments.\n2. Determine the objectives of your investigation\nProject Blue Book operated under three main objectives: to determine the threat of UFOs to national security, to determine if UFO technology could be harnessed by US researchers, and to explain what caused a person to report such an incident.\nFor the CIA, the main concern centred on national security, and the potential for UFOs to be advanced Soviet weapons.\n3. Consult with experts\nIn the Project Blue Book investigations, the teams often consulted with an advisory panel, along with astrophysicists, Federal Aviation officials, pilots, the US Weather Bureau, local weather stations, academics, the National Center for Atmospheric Research, NASA, Kodak (for photo analysis), and various laboratories, for physical specimens, the agency writes.\nFlying saucer: This picture of an unexplained flying object was taken over Passoria, New Jersey in July 1952\n4. Create a reporting system to organize incoming cases\nThe Air Force developed questionnaires to help narrow down the origins of reported UFOs.\nThey categorized sightings as: Astronomical, Aircraft, Balloons, Satellites, Other (including reflections, missiles, mirages, birds, and hoaxes), Insufficient Data, and 'Unidentified.'\nThe agency writes, 'According to Quintanilla, 'a sighting is considered unidentified when a report apparently contains all the data necessary to suggest a valid hypothesis, but its description cannot be correlated with any known object or phenomenon.'\nA police officer stands near to his patrol car outside the town of Socorro, New Mexico where a flying saucer was spotted in 1964\nSome of the pictures taken at the scene of an incident in Socorro, New Mexico, where a flying saucer was spotted in 1964. No explanation has been offered\n5. Eliminate false positives\nIn order to focus on 'unexplained' cases, investigators should eliminate all known causes to rule out common explanations.\nThe CIA writes that misidentified aircraft, celestial events, mass hysteria and hallucination, hoaxes, publicity stunts, and misinterpretation of known objects can all be false positives in a UFO report.\n6. Develop methodology to identify common aircraft and other aerial phenomena often mistaken for UFOs\nAircraft can be mistaken for a UFO, especially secret military craft. To determine if an alleged UFO sighting was actually a known craft, investigators wrote detailed descriptions of aircraft and astronomical phenomena.\n7. Examine witness documentation\n'Any photographs, videos, or audio recordings can be immensely helpful in evaluating a reported UFO sighting,' the agency writes.\nUnexplained happenings: The CIA recently released files from its archives investigating reports of alien and UFO sightings. The organization said the declassified documents will interest both believers and skeptics\n8. Conduct controlled experiments\nThrough a controlled experiment, scientists can try to replicate the conditions that created the unexplained event or sighting.\n9. Gather and test physical and forensic evidence\nResearchers can gather materials from the site and put them through lab analysis to determine the origins. In one historical case, soil was collected from the location of a sighting, revealing no extraterrestrial evidence.\n10. Discourage false reporting\nEducation for the military, researchers, and the even public can help to reduce false-positive reports, the agency writes. If people are able to recognize 'unusually illuminated objects,' and natural phenomena in the sky, false reports can be quickly eliminated.\nThe CIA even tweeted a list of what to do in the event of sighting a possible UFO. It tagged The X-Files, Gillian Anderson and David Duchovny in the post (left). Some of the documents do not find an explanation for the reported UFO sightings, but also do not have evidence they happened in the first place","url":"https://www.dailymail.co.uk/sciencetech/article-3423107/How-flying-saucer-CIA-reveals-carry-X-Files-investigation-unexplained-phenomenon.html"}
