{"authors":["Kadeen Griffiths"],"date_download":"2018-10-30 23:04:46","date_modify":"2018-10-30 23:04:46","date_publish":"2014-08-14 11:46:43","description":"What's going on with Ciara and Future right now? We thought we knew when US Weekly broke the news that Ciara and Future had split three months after the birth of their son due to Future's infidelity. It was sad, especially considering similar rumors…","filename":"data/vaneerConsumption/CiaraDeniesSplitWithFutureinaConfusingAccusationThatDoesntMakeThingsAnyClearer.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/db42199e-b580-4c94-8598-064736383917.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35731-ciara-denies-split-with-future-in-a-confusing-accusation-that-doesnt-make-things-any-clearer_1540940686.html","title":"Ciara Denies Split With Future in a Confusing Accusation That Doesn't Make Things Any Clearer","title_page":"Ciara Denies Split With Future in a Confusing Accusation That Doesn't Make Things Any Clearer","title_rss":"NULL","source_domain":"bustle.com","text":"What's going on with Ciara and Future right now? We thought we knew when US Weekly broke the news that Ciara and Future had split three months after the birth of their son due to Future's infidelity. It was sad, especially considering similar rumors of an upcoming split between Beyoncé and Jay Z have already been dragging everyone down, but I think we'd all prefer for Ciara to do her own thing rather than stay with someone who isn't faithful to her. However, Ciara's reaction to the news story has been so outraged that it casts a lot of doubt on her current relationship status, to say the least.\nOn Wednesday, Ciara tweeted a furious response to the US Weekly story, calling it \"tasteless\" and \"a lie\". According to her, she had done a different interview with their Beauty Editor on a different subject and her words were taken out of context to create this story. However, the thing that really cast doubt on the current state of things is the fact that it's very unclear what words Ciara is referring to that were taken out of context. The story is based off quotes from insiders and anonymous sources and Ciara isn't quoted at all, outside of a reference to a past Brides magazine article.\nConsidering the timing, the only US Weekly story that Ciara could possibly be referring to is the one claiming that her engagement has been called off and yet her comments don't really line up with it. Aside from the fact that she wasn't quoted in the article, there's also a bit of confusion about what exactly she could have said in a beauty-based interview that could have been twisted to be about calling off her engagement due to infidelity. Maybe it's just me, but those two subjects seem mutually exclusive.\nIf these tweets are in reference to the split, then this is a huge relief. Ciara and Future have seemed incredibly happy both before and after the birth of son Future Zahir Wilburn and I'd love to see them remain that way. If these tweets aren't in reference to the split, and that unfortunate situation is still one that Ciara has on her plate right now, then I hope whatever story she's actually referring to doesn't give her added stress.","url":"https://www.bustle.com/articles/35731-ciara-denies-split-with-future-in-a-confusing-accusation-that-doesnt-make-things-any-clearer"}
