{"authors":["Andrew Bullock For Mailonline"],"date_download":"2018-10-23 02:16:59","date_modify":"2018-10-23 02:16:59","date_publish":"2017-04-26 13:13:50","description":"Cillian Murphy, 40, has been spied on the Peaky Blinders set brandishing a gun playing his famous Tommy Shelby character.","filename":"data/vaneerConsumption/CillianMurphybrandishesagunonPeakyBlindersset.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA0860D00000578-0-image-a-5_1493220562980.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4447578_Cillian-Murphy-brandishes-gun-Peaky-Blinders-set_1540261019.html","title":"Cillian Murphy brandishes a gun on Peaky Blinders set","title_page":"Cillian Murphy brandishes a gun on Peaky Blinders set | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fans of Peaky Blinders are desperately awaiting the fourth season, which is currently in production in various locations around the UK.\nBut until then, sneak peeks from the set will have to suffice; the latest of which is sure to please die hard followers.\nCillian Murphy, 40, has been spied on set brandishing a gun playing his famous Tommy Shelby character, alongside new co-star Adrien Brody.\nScroll down for video\nKill-ian Murphy! Peaky Blinders actor Cillian is back to his violent ways as Tommy Shelby, as he's seen brandishing a gun and taking aim on the set of the hit show's fourth season\nDouble trouble: His new co-star Adrien Brody was also spotted pointing a deadly weapon - he is new to the show and his character's name is as yet unknown\nThe Irish actor was seen clad in his character's signature get-up of a three-piece suit, layered beneath a long-line coat and teamed with his iconic baker's cap.\nHe was snapped on a fire-exit-style wrought iron staircase, where he was seen descending the steps looking characteristically broody and morose.\nKeeping his head down, and shielding his eyes under the rim of the cap, the Red Eye star was being closely watched by a film crew as he took aim with his shotgun from atop the steps.\nBack with a bang: Cillian Murphy, 40, brandished a gun in his hand to film the fourth series of Peaky Blinders\nTaking aim: Keeping his head down, and shielding his eyes under the rim of the cap, the Red Eye star was being closely watched by a film crew as he took aim with his shotgun from atop the steps\nDramatic: As the scene progressed, Cillian was seen rushing down the metal steps\nTom's back: The Irish actor was seen clad in his character's signature get-up of a three-piece suit, layered beneath a long-line coat and teamed with his iconic baker's cap\nHe then climbed down further, with the long weapon over his shoulder before jumping down into the alleyway beneath.\n43-year-old Oscar winner Adrien Brody, joins the series as a newcomer.\nAlthough it's not certain who he's playing, creator Steven Knight has previously said: 'He genuinely was the actor in my head when I wrote the part. I’m sure he will be a formidable presence in the world of the Peaky Blinders.'\nCillian, Adrien and other cast members Tom Hardy, Paul Anderson, Helen McCrory and Joe Cole have been using derelict houses and other 1920s-looking areas around the UK which have been dressed to look like Birmingham in that era.\nWhile Cillian and Adrien were shooting in Manchester, several week ago Cillian was seen filming on the streets of Liverpool.\nJoining in: Adrien arrived in casual clothing for his scenes on location\nShoot-out: But he soon took on the guise of a merciless killer as he was put through his paces\n...And action! Adrien appeared to be taking his new role in his stride as the cameras rolled\nDapper: Dressed smartly in a suit, he pointed his finger in a forthright fashion as filming continued\nFirst shooting a number of scenes with a cigarette in his mouth, the actor was then seen removing his jacket as he embarked on a more dramatic chase around the street - with a foreboding pistol in hand.\nAs the shoot progressed, Cillian and his co-stars became surrounded by a haze of white smoke, implying shots had been fired in one the show's famously tense scenes.\nFilming kicked off a few weeks ago, as the yellow lines on the roads they filmed around were concealed and props such as vintage cars, retro billboards, period lampposts and a horse and cart are brought in, to add to the gritty and old-fashioned feel of the show.\nLooks like rain: Adrien extended his arms as the weather took a turn for the worse during filming\nFilming: Despite the turn of weather, Adrian proved to be a true professional as got into character with his gun\nOne shot: Filming is expected to last four months but it is unknown how many episodes Adrien will star in\nGetting into gear: His finger pointing continued apace as the day wore on\nSomething on his mind? The actor appeared deep in thought at times as he stared into space\nFilming is expected to take four months, followed by three months of editing - meaning the show could return to BBC Two as early as October this year.\nThe gangster drama follows the antics of the Romani Peaky Blinders gang in post-war Birmingham.\nThe most recent series, which aired in the UK in May last year, was set two years after the second season in 1924 - and followed the gang's attempts to expand internationally.\nThe fourth series however has been much-anticipated by fans over the last few months, as the final episode of series three saw the family be taken away by police in handcuffs - with their fate unknown.\nLet's do this: He then climbed down further, with the long weapon at the ready\nHigh tension: While this was taking place in Manchester, several week ago he was seen shooting on the streets of Liverpool\nHowever the untouchable Tommy of course, avoided arrest, leaving fans to question what will happen to him and his sidekicks in the next chapter of the story.\nCillian recently spoke about his iconic gang leader role, and how it requires an intense dedication to make so realistic.\nHe told the Sunday People: 'The nature of the character is immersive. You have to cancel reality for four months while you're playing him.\n'I always come out of it destroyed but ­having felt like we have made something amazing. I enjoy those type of characters where you have to travel quite a distance from yourself to get to.'\nHowever he went on to explain that the show's huge popularity makes it all worth it - and that he hopes the series will continue all the way to the World War II.\nHe added: 'I can see this going on for many years. The ambition is the first air raid siren of the Second World War. When we hear that it'll be the last episode.'\nAfter huge success in both the UK and the States, the show's fourth season was confirmed late last year.\nArmed: The actor was seen with the shotgun over his shoulders as he walked down the stairs\nBrooding: Filming is expected to take four months, followed by three months of editing - meaning the show could return to BBC Two as early as October this year\nDescent: Cillian ended up hopping off the end of the steps and running along the alleyway beneath","url":"https://www.dailymail.co.uk/tvshowbiz/article-4447578/Cillian-Murphy-brandishes-gun-Peaky-Blinders-set.html"}
