{"authors":["Becky Freeth For Mailonline"],"date_download":"2018-10-23 02:18:10","date_modify":"2018-10-23 02:18:10","date_publish":"2017-03-16 12:43:17","description":"Two years after the beloved television personality passed away, her legacy will be revived with the return of one a programme she led for 18 years.","filename":"data/vaneerConsumption/CillaBlacksfriendPaulOGradyconfirmedforBlindDate.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/18BB87EE00000578-0-image-a-6_1489668000948.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320004_Cilla-Black-s-friend-Paul-O-Grady-confirmed-Blind-Date_1540261090.html","title":"Cilla Black's friend Paul O'Grady confirmed for Blind Date","title_page":"Cilla Black's friend Paul O'Grady confirmed for Blind Date | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A reboot of Cilla Black's famous dating show Blind Date will be fronted by her best friend, Paul O'Grady.\nPaul, 61, confirmed on Thursday that he had been named for the role when it moves to Channel 5.\nReality star Vicky Pattison, 29, had previously been the favourite for the job - but sources have revealed that she could still have a role on the dating show.\nConfirmed: Paul O'Grady (left) is set to take over a reboot of his late best friend Cilla Black's (here together in 2011) dating show Blind Date\nIn the first statement released to MailOnline confirming the new show, Paul said: 'Blind Date is an incredibly special family show which brought laughter, tears and joy to TV viewers throughout out the land.\n'I am honoured to present the brand new series and after speaking to Channel 5, I know the series is in safe hands. I can't wait to see if we can find love.'\nThe announcement comes after former Geordie Shore star Vicky had been widely touted for the hosting role, but sources suggest that she will still be involved in the reboot.\nA source told the Sun: 'Vicky is so excited to be working on such an iconic show as Blind Date. She knows Paul is perfect to step into Cilla's shoes.\n'To be considered to work alongside such a legend is a dream come true for her.'\nMaking a comeback: Cilla's Blind Date will make a comeback with a 'sexy and young' new image\nSnubbed: Previously, Vicky Pattison was thought to be bringing a 'young and sexy' edge to the show, having previously been named as a favourite\nConfirming that LGBT contestants will be welcomed for the first time, producers went on to say: 'The show will reflect the present day whilst maintaining the humour, charm and cheekiness of the original show.'\nAccording to the statement, Blind Date will be 'updated to reflect the present day' with the same 'humour, charm and cheekiness' of the original show in mind.\nA source told MailOnline that more news on the Blind Date reboot is expected to follow in the next few weeks.\nAged 72, Cilla passed away two years ago, 12 years after the last episode of Blind Date, leaving her long-time friend Paul 'destroyed' by her sudden death.\nShe died of a traumatic head injury after an accidental fall at her home in Spain on August 1, 2015.\nIn October that year, Paul spoke of his dear friend, admitting that he sometimes forgot she was gone.\nOld friends: Paul and Cilla met on chat show Parkinson in 1998\nHe told Loose Women 'We used to go clubbing, we'd go on holiday together, I spoke to her all the time, and even now I think, 'I must ring Cilla and tell her that'.'\nPaul and Cilla met on chat show Parkinson in 1998 and said they immediately struck up an 'unbreakable' bond because of their scouse roots.\n'God I'm going miss her,' he told Liverpool ECHO in August 2015: 'She was a very loyal friend Cilla. She was more like a sister.\n'I've lost my good mate. It's very sad. It just doesn't seem real. We used to get invited to dinner parties as the entertainment, of course we didn't mind.\n'We were just being ourselves but people said we were like a double act. We had the same roots you see, that's how we connected. We were both from similar working class backgrounds.'\nFreshening it up: Paul said he felt 'honoured' to be fronting the family show\nPaul is a surprise host for the revamped show, as Vicky was originally thought to be bringing a 'young and sexy' spin to the show.\nHot on the heels of popular franchises First Dates and Take Me Out, the original dating reality show was first reported to be making a return, last month.\nA source told The Sun newspaper at the time: 'It's a classic format that will be rebooted to make it young, sexy and modern. Expect sparks to fly.'\nOther names reportedly originally put forward for the hosting job included, Olly Murs, 32, Georgia May Foote, 25, and Helen Flanagan, 26.\nBlind Date ran for 18 years, airing its final 373rd episode in 2003 following the news that Cilla was stepping down as host.\nBig return: Matchmaker Cilla was best-loved for her cupid set-ups\nMatchmaker: Vicky had been put forward for the role of matchmaker, replacing Cilla Black\nThe format saw three hopefuls aiming to secure a date with their answers to the dater's three burning love questions.\nIt's a complete contrast to dating apps such as Tinder where looks and first impressions serve as the basis for whether you decide to meet someone.\nAs the name suggests, Blind Daters are set behind a large screen and therefore never get to see their date unless they're picked.\nDuring its decade of dating, famous faces tried their hand at love including TV presenter Ortis Deley and, famously, a pre-fame Amanda Holden.\nThough it was unlike such recent shows as Celebs Go Dating, where dates are aware they're about to date a famous personality.\nPick your questions wisely: Daters can ask three burning questions, the answers of which will decide whether they bag a date","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320004/Cilla-Black-s-friend-Paul-O-Grady-confirmed-Blind-Date.html"}
