{"authors":["Michelle Moons"],"date_download":"2018-10-30 21:39:35","date_modify":"2018-10-30 21:39:35","date_publish":"2015-03-30 02:54:37","description":"Cindy McCain has joined a fundraising effort in a hard sell for donations that comes as John McCain appears to be feeling the heat.","filename":"data/vaneerConsumption/CindyMcCainJoinsFundingPleaAmidstJohnMcCainChallengeFears.json","image_url":"https://media.breitbart.com/media/2015/03/cindy-mccain-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_29__1540935575.html","title":"Cindy McCain Joins Funding Plea Amidst John McCain Challenge Fears","title_page":"Cindy McCain Joins Funding Plea Amidst John McCain Challenge Fears | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"U.S. Senator John McCain’s wife Cindy has joined in an intensifying fundraising effort in a Saturday hard sell for donations that comes as the incumbent, some call weakened, appears to be feeling the heat from dissatisfied constituents and impending primary challengers heading into 2016.\nThis new fundraising plea uses fear-invoking language in the first line of Cindy’s message, “The challenges facing our nation right now are grave.” Moving on, the message suggests Senator McCain is the “tough leader” who isn’t “afraid to do what is necessary” in correcting the wayward path of America.\nPotential McCain primary challenger Arizona State Senator Kelli Ward pointed out Arizonans’s dissatisfaction with the decades-sitting Senator McCain in a Breitbart News Saturday interview, “I know here in Arizona there is some dissatisfaction with the representation that’s been going down, at least the last couple of terms he’s been in office. I don’t think that he’s as popular as he used to be, and maybe that worries him that there are people out there looking and thinking and considering jumping into that race.”\nFearful language continued later in Cindy’s fundraising message with another contention of Senator McCain’s vigilance, “Every day when I turn on the news, I am horrified at the state of the world today, but I take comfort in knowing that leaders like my husband are working day and night to right the wrongs of the world.”\nLast week’s message from John McCain projected a more vulnerable stance, telling potential donors his impending re-election campaign would face a “unique set of challenges,” while acknowledging conservative critics, “I’m going to be the target of a wide array of powerful groups.”\nAs in last week’s message, the new plea urges donations are needed to persuade the long-time Senator to run for re-election, though early in her appeal Mrs. McCain leaves little to question, urging the need to make sure “leaders like my husband… stay in Congress.”\nThough the new funding plea was brief, as in the prior email, no less than six links were provided linking readers to a donation page.\nDespite the message being marked as from Cindy McCain, the new email comes from the same address as the earlier one marked as from John McCain, john@johnmccain.com. Both this and last week’s fundraising pleas are marked “Paid for by Friends of John McCain.”\nFollow Michelle Moons on Twitter @MichelleDiana.","url":"https://www.breitbart.com/politics/2015/03/29/cindy-mccain-joins-funding-plea-amidst-john-mccain-challenge-fears/"}
