{"authors":["Zoe Nauman For Dailymail.Com"],"date_download":"2018-10-23 04:18:35","date_modify":"2018-10-23 04:18:35","date_publish":"2016-01-28 20:19:58","description":"Cindy Crawford, 49, made sure she enjoyed some exercise leisure time with her daughter Kaia, 14, on Thursday as the pair enjoyed a hike in Los Angeles","filename":"data/vaneerConsumption/CindyCrawfordgoesmakeupfreeassheenjoyshikewithdaughterKaia.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/20/30AC558F00000578-0-image-a-11_1454012349273.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421639_Mother-daughter-bonding-Cindy-Crawford-49-goes-make-free-enjoys-hike-daughter-Kaia-14_1540268315.html","title":"Cindy Crawford goes make-up free as she enjoys hike with daughter Kaia","title_page":"Cindy Crawford goes make-up free as she enjoys hike with daughter Kaia | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They say the family that plays together stays together.\nAnd Cindy Crawford made sure she enjoyed some exercise leisure time with her daughter Kaia on Thursday.\nThe original supermodel posted a shot of herself with her daughter enjoying a hike in Los Angeles.\nScroll down for video\nMother and daughter bonding: Cindy Crawford made sure she enjoyed some exercise leisure time with her daughter Kaia on Thursday\nCindy looked fresh faced, going au naturel for the shot, captioning it: 'Morning girls hike.'\nShe pursed her lips in a pout showing off her famous mole and elegant cheekbones.\nThe mother-of-two kept her eyes covered with a pair of over-sized sunglasses.\nThe 14-year-old is the spitting image of her mother - they are seen here at the Barely Famous screening at The London in LA, in March 2015\nMeanwhile her 14-year-old daughter pursed her lips as well and looked like she was going to plant a kiss on her mum's cheek.\nBoth of them had their brunette locks blowing in the breeze.\nThere was no doubt at all Kaia had inherited her mother's stunning looks.\nShe has all the makings of a catwalk Queen even in her early teens.\nTasty breakfast: Kaia clearly also takes care of her health - she posted a photo of herself enjoying a morning cuppa with a friend in bed on Thursday\nShe clearly also takes care of her health - she posted a photo of herself enjoying a morning cuppa with a friend in bed on Thursday.\nThe pair can be seen in bed, with a selection of nutritious treats including strawberry and blueberry pancakes, avocado and scrambled egg whites, and the only nod to naughtiness, some bacon.\nCindy has spoken in the past of how proud she is of her daughter, and also joked about being a little jealous.\nWhen asked on FABLife if she sees herself in her daughter recently she said; 'I do and I'm really jealous.'\nShe added: 'No, I'm joking. I always tease her \"You have my old legs. Give them back. What do they say? Youth is wasted on the young.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421639/Mother-daughter-bonding-Cindy-Crawford-49-goes-make-free-enjoys-hike-daughter-Kaia-14.html"}
