{"authors":["Jennifer Pearson For Dailymail.Com"],"date_download":"2018-10-23 03:24:32","date_modify":"2018-10-23 03:24:32","date_publish":"2016-01-28 18:47:01","description":"The two famous moms had lots to talk about as they met for a power dinner at Nobu restaurant in Malibu, California on Wednesday.","filename":"data/vaneerConsumption/CindyCrawfordenjoysapowermealwithKrisJenneratNobuinMalibu.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30ACABFD00000578-0-image-a-32_1454004949927.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421432_Cindy-Crawford-49-enjoys-power-meal-Kris-Jenner-60-Nobu-Malibu_1540265072.html","title":"Cindy Crawford enjoys a power meal with Kris Jenner at Nobu in Malibu","title_page":"Cindy Crawford enjoys a power meal with Kris Jenner at Nobu in Malibu  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Cindy Crawford helped coin the word 'supermodel' in the 1990s and Kris Jenner fashioned herself as reality TV's top 'momager' a decade later.\nNo doubt the two famous moms had lots to talk about as they met for a power dinner at Nobu restaurant in Malibu, California on Wednesday.\nCindy, 49, was looking cool and casual in bell-bottomed jeans and white top with a blue velvet patterned jacket as she stood chatting with Kris, 60, in the valet car park.\nScroll down for video\nPower meal: Cindy Crawford and Kris Jenner met up for dinner at Nobu in Malibu, CA on Wednesday\nKris bundled up in typical ostentatious style, opting for a black and grey fur coat with clingy black leggings and a graphic print black T-shirt.\nJudging by their smiles as they lingered on waiting for their cars, everything went well during the meeting.\nWhile it's not certain why the two power women met up, it might have had something to do with their famous offspring.\nLots to discuss: Kris, whose daughter is model Kendall, and Cindy, whose daughter Kaia is also a model, appeared to be continuing the conversation to the valet car park\nRising stars: Cindy has said her daughter Kaia is a fan of Kendall's and is landing modelling gigs herself\nSmile of success: The dinner appeared to have gone well judging by Kris' beaming smile\nCindy's daughter Kaia is following her mother's famous footsteps into modeling and has already landed several fashion gigs including a shoot for Teen Vogue.\nCindy, who is also mom to son Presley, 16, raved about her mini-me daughter Kaia last September at a promotional event in New York City for her book Becoming.\n'She's such a great girl, both my kids are incredible,' Cindy told E! News of the 14-year-old model and social media butterfly who already boasts 336k followers on Instagram.\nShe added: 'And Kaia's smart, she's got her head on straight... she's interested in fashion, loves Kendall Jenner.\nMuse in the making: Kendall Jenner walked the runway at the Chanel show during Paris Fashion Week in Paris, France on Tuesday\nEnough braids? One more from @TeenVogue. A photo posted by Kaia Gerber (@kaiagerber) on Nov 23, 2015 at 2:30pm PST\nApple of her eye: Cindy shared a cute smooch with Kaia during a 'morning girls hike' on Thursday\n'So she's gotten a few opportunities to do little modeling things, and at least in this area of her life she'll take my advice. I'm happy that she loves doing it in little bits and pieces.'\nAnd Kris' daughter Kendall, 20, is already a top model that many designers from Donna Karan to Chanel are clamoring for.\nThe 5 ft 10 in beauty walked the runway for Chanel during Paris Fashion Week in France on Tuesday, wearing a billowing black gown with delicate crisscrossing pattern.\nKris couldn't resist crowing about her lookalike daughter on Twitter, as she re-posted an image of Kendall modeling Calvin Klein jeans.\n'Proud mama,' the mother-of-six shared.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421432/Cindy-Crawford-49-enjoys-power-meal-Kris-Jenner-60-Nobu-Malibu.html"}
