{"authors":["Lani Seelinger"],"date_download":"2018-10-31 01:47:36","date_modify":"2018-10-31 01:47:36","date_publish":"2018-08-27 18:33:38","description":"After the nation has moved on from the initial stages of mourning such a highly respected politician as John McCain, who died on Saturday after a long battle with brain cancer, a practical matter arises: who will fill his spot in the Senate?…","filename":"data/vaneerConsumption/CindyMcCainCouldReplaceJohnIntheSenateUnderTheseRules.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/bd31d71f-71f7-47ef-9ab3-fca36e0c6e6e-getty-83564561.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_cindy-mccain-could-replace-john-in-the-senate-under-these-rules-10250653_1540950456.html","title":"Cindy McCain Could Replace John In the Senate Under These Rules","title_page":"Cindy McCain Could Replace John In the Senate Under These Rules","title_rss":"NULL","source_domain":"bustle.com","text":"After the nation has moved on from the initial stages of mourning such a highly respected politician as John McCain, who died on Saturday after a long battle with brain cancer, a practical matter arises: who will fill his spot in the Senate? According to some predictions, John's widow Cindy McCain could fill his Senate seat. Such a move would be not be out of the ordinary, nor would it be an unreasonable career move for Cindy.\nCindy has already made herself into a known quantity in Washington, where she's distinguished herself in the worlds of business and philanthropy, according to Vox. She was first on the Arizona Republic's list of potential replacements for McCain, where the paper noted that she could fittingly pursue her husband's objectives while also adding in her own priorities. Those include, according to the Arizona Republic, fighting against human trafficking and clearing communities scarred from war of the land mines left there.\nThe true speculation of who will replace McCain is only really beginning now, because the job falls by law to Arizona Gov. Doug Ducey, and he told KTAR News that he wouldn't even consider the question as long as the former senator still lived. Anyone who was already pushing themselves into contention for the spot, he said, had immediately taken themselves out of contention.\n“They basically disqualified themselves for showing their true character,” Ducey told KTAR News in December of 2017. “I fully expect to see the senator back in January and I am looking forward to it.”\nRumors swirled among Arizona politicians about Cindy being on Ducey's shortlist for a long time, although a Phoenix New Times report said that Ducey would never confirm the claim one way or another. According to the same report, many Arizona Republicans wouldn't be happy with that particular choice of replacement, either. McCain himself never strayed too far right of center, and Cindy — who has expressed more socially liberal views on such hot button issues as marriage quality and abortion — is even farther to the left of her husband.\nDucey will announce the former senator's replacement after McCain's funeral takes place on Saturday, according to Newsweek. Whoever he picks will serve until 2020, when there will be an election to determine who will serve out the rest of McCain's term, which runs until 2022.\nThere are still numerous other potential contenders for McCain's seat, and many of them have the more professionally political backgrounds that Cindy lacks — although, of course, they're missing the deep personal connection with the deceased senator. According to CBS News, this list includes Kirk Adams, Ducey's chief of staff; John Kyl, a former senator from Arizona; and Barbara Barrett, a former ambassador to Finland.\nEven so soon before he announces his pick, Ducey is choosing to keep the focus on John McCain and McCain's legacy rather that fuel public speculation.\n\"Now is a time for remembering and honoring a consequential life well lived,\" a senior advisor to Ducey told CBS News. This statement may not offer any direction towards who Ducey will pick — but remembering and honoring McCain's life in his old senate seat could be an ideal job for his widow.","url":"https://www.bustle.com/p/cindy-mccain-could-replace-john-in-the-senate-under-these-rules-10250653"}
