{"authors":[],"date_download":"2018-10-22 21:07:16","date_modify":"2018-10-22 21:07:16","date_publish":"2014-05-06 00:34:50","description":"Aerialists say their daredevil work infuses every circus worker with a family bond and a keen sense of danger.","filename":"data/vaneerConsumption/CircusFamiliesBondedbyDaringandDanger.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/419536/140504-hair-hanging-jms-2245_eff90c28512b63162caa59cfdf049a66.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_circus-accident_circus-families-bonded-daring-danger-n97761_1540242436.html","title":"Circus 'Families' Bonded by Daring and Danger","title_page":"Circus 'Families' Bonded by Daring and Danger","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAerialists who mesmerize their fans high in the air say that daredevil work infuses every circus worker with a snug family bond – and a keen sense that everything could suddenly go very wrong.\nEight acrobats in the Ringling Bros. and Barnum & Bailey Circus remained hospitalized Monday in Providence, R.I., — four in serious condition, four in good condition — after a mid-air platform collapsed during an act Sunday, sending eight acrobats careening 35 feet to the stage.\n“Everybody in that show, from all of the other performers to the guys on the floor who watch them every night, they all are feeling this as a family incident, just as if someone in your family had suffered a bad car accident,” said Phil McKinley, who directed Ringling Bros. events for more than 10 years. Starting in 2011, he also directed Broadway’s aerial-musical hit, “Spider-Man.”\n“The circus is a traveling town, a town without a zip code. You are never separated from each other as you live on the train together, going from city to city. Your children go to school together,” McKinley added. “And that town is very connected as far as personal relationships.”\nBut within that circus community, where accidents are rare, the risk of serious injury or a lethal crash is a steady, sobering reality that performers and crew accept and internalize daily, no different than firefighters or soldiers, members say.\nThey willfully put their lives on the line in order to feel the thrill of flight and hear the sounds of crowds in awe, and to know they are part of a select club of athletes who pull off high-wire walks, trapeze grabs or, like the women injured Sunday, the “hair hang.”\n“You can't choose what you love doing. I loved it, and it's irrational – it doesn't make a lot of sense.\"\n“It (death) is always something to be aware of. You have to respect what it is we're doing,” said aerialist Jaleen Francois, who this spring quit her San Francisco office job to join the Ramos Bros. Circus, a small tent show that tours California. She pairs with another woman, performing tricks on a hanging steel hoop called the lyra. “It is a lifestyle. We are all in. And it’s why we’re here, doing the things we’re doing.\n“We don’t have very high-risk tricks, relatively. But I guess you could ask: Relative to what? Because also I live in this sort of distorted version of normal,” said Francois, 33. “So we do take it for granted that we can hook onto this steel hoop with one knee while hanging onto each, to know that we’re going to do this, and this is all fine.”\nEven when accidents happen, some circus families start talking about a performer's return to a high-flying act even as broken bones are being mended.\nThe father of Widny Neves, one of the injured hair-hangers in Rhode Island, told NBC News in a phone interview that Neves, 24, will undoubtedly be back under the big top once she's fully healed. She sustained a broken arm.\n\"All circus acts are dangerous jobs,\" said Roiter Neves, also a veteran circus performer. \"If you work in that field, you accept the risk.\"\nThe daily care and safety checks of their apparatus falls to the performers and the “riggers,” and such inspections are done with fine-detailed scrutiny given the lives at stake, Francois said. She and lyra partner, Emily Rose, look over all of the carabineers, the swivel and the hoop’s special taped wrapping, scouring for any signs of slippage.\n“We have a good relationship with the head rigger. And knowing the rigger, knowing how to ask the right questions, how to ask for changes (in the equipment) is all part of the job,” she said. “I’m actually learning how to tie knots and I’m expanding my knot vocabulary because, well, that’s helpful.”\nFrancois said a short taste of trapeze training at age 25 put the thought of a circus career in her mind. She went to graduate school but could never shake that aerialist calling. The tent for the Ramos Bros. Circus holds about 900 people and the show typically moves to a new town every two weeks.\n“Went to grad school and tried to repress it and an act like a normal person but I was always on the fringe of the circus world,” Francois said. “You can't choose what you love doing. I loved it, and it's irrational – it doesn't make a lot of sense.”\nBut that innate pull to swoop and swing in front of bug-eyed crowds is more typically a mindset found in a performer’s DNA as many aerialists and wire walkers come from multiple generations of circus acrobats.\n\"It’s all about man’s desire to fly. Aerialists are the humans who come the closest to achieving that desire.\"\n“People in the United States think circus is like carnival. And it's not. It’s circus,” McKinley said. “There’s always been this saying that people ‘ran away to the circus.’ All of the people I know have run to the circus.”\nWhile there is no hierarchy within the circus family, aerialists can earn a slightly loftier status among their peers – and the higher they go off the floor, the more quiet respect they earn, McKinley said.\n“It’s all about man’s desire to fly. Aerialists are the humans who come the closest to achieving that desire,” McKinley said. “They say there’s something so wondrous about it, that their souls come alive when they’re floating, when they’re flying.”","url":"https://www.nbcnews.com/storyline/circus-accident/circus-families-bonded-daring-danger-n97761"}
