{"authors":[],"date_download":"2018-10-30 19:38:30","date_modify":"2018-10-30 19:38:30","date_publish":"2018-08-03 14:37:00","description":"Corteo, the latest Cirque du Soleil’s arena production, will perform at the Infinite Energy Arena in Duluth GA for only five days around Labor Day Weekend. Date: August 29 to September 2, 2018","filename":"data/vaneerConsumption/CirqueduSoleilCorteoinAtlantaAug29Sep22018.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p2/AJC/2011/08/25/Videos/1128795633001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_cirque-soleil-co_944b753852b7b131a712b7e0df74c354__1540928310.html","title":"Cirque du Soleil Corteo in Atlanta, Aug 29-Sep 2 2018","title_page":"Cirque du Soleil Corteo in Atlanta, Aug 29-Sep 2 2018","title_rss":"NULL","source_domain":"ajc.com","text":"“Corteo,” the latest Cirque du Soleil’s arena production, will perform at the Infinite Energy Arena in Duluth for only five days beginning in late August.\nThis unique production, directed by Daniele Finzi Pasca, first premiered in Montreal under the Big Top in April 2005, will be in Duluth from August 29 to Sept. 2 for a limited run of seven performances.\nCorteo, which means “cortege” in Italian, is a joyous procession, a festive parade imagined by a clown. The show brings together the passion of the actor with the power of the acrobat to plunge the audience into a theatrical world of fun, comedy and spontaneity all talking place in a mysterious space between heaven and earth.\n(Lucas Saporiti)\nThe concept of the stage presents a unique theatrical atmosphere. The set curtains, inspired by the Eiffel Tower, and the central curtains, which were hand painted, give a grandiose feel to the stage.\n(Lucas Saporiti)\nThe cast of Corteo includes 51 acrobats, musicians, singers and actors from all around the world.\nWednesday, Aug. 29-Sunday Sept. 2. $49-$139, 6400 Sugarloaf Pkwy, Duluth. 1-800-745-3000 cirquedusoleil.com/corteo.\nMORE:Things to do Aug. 3-5: Goat yoga, Jackie Wilson and all the wings you can eat","url":"https://www.ajc.com/lifestyles/cirque-soleil-corteo-comes-duluth-for-only-seven-shows/pKQPuoChDejuxvJbvYO4wN/"}
