{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 23:59:14","date_modify":"2018-10-30 23:59:14","date_publish":"2016-12-05 00:00:00","description":"Turbulence has hit markets in the wake of Prime Minister Matteo Renzi's resignation.","filename":"data/vaneerConsumption/CITIPrepareforenhancedvolatilityinItalianbanks.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_citi-note-on-volatility-in-italian-banks-post-referendum-renzi-constitution-2016-12_1540943954.html","title":"CITI: Prepare for 'enhanced volatility' in Italian banks","title_page":"    Citi note on volatility in Italian banks post-referendum - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The Italian air force aerobatic team, \"Frecce Tricolori\" (Tri-colour Arrows), leave trails of green, white and red smoke, the colours of the national flag, during a flypast over Rome November 9, 2008. REUTERS/Chris Helgren\nWith political turmoil in Italy, the spotlight has turned once again to the country's troubled banking sector.\nTurbulence has hit markets in the wake of Prime Minister Matteo Renzi's resignation, and the share prices of the banks have plunged and recovered in the space of minutes.\nBefore the referendum, it was feared that market volatility would spell the end for Italy's poor performing banks, which have been weighed down with bad loans.\nOfficials cited by the Financial Times last week, were concerned that Banca Monte dei Paschi di Siena, along with Popolare di Vicenza, Veneto Banca, Carige, Banca Etruria, CariChieti, Banca delle Marche, and CariFerrara could all be at risk if Renzi lost the referendum.\nThe sector needs an injection of fresh capital. That is harder to pull off in times of political crisis and market stress because investors are more wary.\nHere is the chart for BMPS, the world's oldest bank, in early trading on Monday:\nInvesting\nBut while it does not look good for Italian banks in the short term, analysts at Citi believe the sector will survive.\n\"We expect banks' share prices to react negatively to the referendum results, and to suffer a period of enhanced volatility,\" Citi analysts Azzurra Guelfi and Borja Ramirez Segura said in a note to clients on Monday.\n\"However, we believe that spreads / asset quality / capital increases are the fundamental driver of banks' valuation long term, and those do not depend solely on political developments.\"\nWhile the political crisis will make it harder to raise capital in the short term, the volatility won't stop them altogether, according to Citi.\n\"The pending UniCredit restructuring/potential capital increase (to be announced on 13th December) could be still be surrounded by volatility/completion risk, and this could affect also company decisions (alternatives / size?),\" the analysts said.\n\"Nevertheless, as it could go live in a few months (February 2017?), there could be many possible political developments by then, and our base case is that it could feasible (depending also on the size).\"\nThe Italian banking sector has struggled to shed its bad loans and raise more capital in the past year. Steve Eisman, an investor who made a fortune by successfully predicting the 2007-2008 financial crash, said last month that the entire sector should be insolvent.\n\"In the Italian system, the banks say they are worth 45-50 cents in the dollar. But the bid price is 20 cents. If they were to mark them down, they would be insolvent,\" Eisman said.\nEisman rose to fame after being featured in Michael Lewis' award-winning book, \"The Big Short,\" as one of the few people to correctly predict the 2007 mortgage crisis. His character was played by Steve Carrell in the film of the book.","url":"https://www.businessinsider.com/citi-note-on-volatility-in-italian-banks-post-referendum-renzi-constitution-2016-12"}
