{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 22:23:42","date_modify":"2018-10-30 22:23:42","date_publish":"2016-12-13 00:00:00","description":null,"filename":"data/vaneerConsumption/CitiAppusersgetmorebiometricauthenticationoptions.json","image_url":"https://amp.businessinsider.com/images/58500e41a1a45e38468b4f13-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_citi-app-users-get-more-biometric-authentication-options-2016-12_1540938222.html","title":"Citi App users get more biometric authentication options","title_page":"    Citi App users get more biometric authentication options - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Bank of America launches messenger bot\nThis story was delivered to BI Intelligence \"Payments Briefing\" subscribers. To learn more and subscribe, please click here.\nCiti announced that US Citigold clients are getting added functionality on the Citi Mobile App, which most importantly includes three forms of biometric authentication.\nThe update allows users to log in by using biometric authentication, including fingerprint, voice, and facial recognition. This should help alleviate the kinds of security concerns that can hinder adoption of mobile banking apps.\nCiti could leverage these new security features to boost interest in the banks mobile wallet.In November, Citi announced it will be releasing its own proprietary mobile wallet which will allow its customers to make online, in-app, and in-store payments. The bank is likely hoping to leverage consumer sentiment when it comes to mobile wallets — 75% of customers trust their banks most to provide mobile wallets. And although the mobile wallet industry is extremely fragmented, with adoption being low, Citi could attract users by pushing a superior product. This likely why it is including convenient and secure biometric technology in its mobile app, which it could leverage to attract consumers to its mobile wallet, by providing a similar experience.\nPasswords and PINs are being rendered irrelevant thanks to rising digital fraud, growing concern about data privacy, and difficulty remembering an endless stream of letters and numbers. That's been leading both software and hardware firms to explore new methods of verifying user identity. One such method is biometrics — unique biological measurements that can be digitized and turned into a trackable record.\nThese methods, which include fingerprint scanners, voice verification, or retina and vein scans, are steadily gaining popularity for unlocking smartphones or accessing sensitive apps — BI Intelligence forecasts that by 2021, 99% of US smartphones will be biometrics-enabled. But they're also becoming increasingly popular as a way to verify payments, because they keep consumer data secure without inconveniencing consumers.\nBut as these methods are implemented, firms face unique security challenges. Because of the way biological data is stored and encrypted, it's much harder for hackers to access and use. But if it is accessed, it's extremely valuable, since biological data can't be changed or replaced in the event of a breach. And though those risks could deter consumer, merchant, and vendor adoption, it appears as though most parties believe the benefits outweigh the risks and will likely implement biometrics-based authentication in their applications moving forward.\nJaime Toplin, research associate for BI Intelligence, Business Insider's premium research service, has compiled a detailed report that sizes the market for biometrics-enabled smartphones in the U.S., described various types of biometrics authentication, evaluates their utility in the payments space, investigates the potential security risks and hurdles to adoption for both front- and back-end applications, and assesses the types that are most likely to see widespread application.\nHere are some key takeaways from the report:\nUS smartphone makers are rapidly integrating biometrics-based features, such as fingerprint scanners, into their devices. BI Intelligence forecasts that 99% of installed smartphones in the US will be equipped with fingerprint scanners by 2021. The shift will happen much sooner for the installed base of iPhones in the US — nearly all of which will be biometrics-enabled by 2018.\nBiometric technology is moving beyond fingerprints. Right now, biometric verification is largely concentrated on fingerprint-scanning technology on mobile phones. But the technology is expanding, and other verification methods, including facial recognition and iris scanning, are becoming more popular.\nBiometrics do pose their own security challenges. The unique nature of biometric verification, and the fact that the digitized record is stored locally in a secure portion of the phone, makes this data far more protected than traditional verification methods. But the risk to this type of data is also greater because unique, permanent biological identifiers are very valuable to hackers.\nIn full, the report:\nForecasts the number of US smartphones that will include fingerprint scanning technology through 2021 and assesses industry growth\nProvides data showing why biometrics relieve pain points associated with in-store and online purchasing without eliminating security\nExplores different types of biometrics and evaluates differ net payments use cases\nEvaluates whether security risks and other challenges will hinder adoption of biometrics\nAssesses which type of biometrics will become most popular among consumers and developers moving forward\nInterested in getting the full report? Here are two ways to access it:\nSubscribe to an All-Access pass to BI Intelligence and gain immediate access to this report and over 100 other expertly researched reports. As an added bonus, you'll also gain access to all future reports and daily newsletters to ensure you stay ahead of the curve and benefit personally and professionally. >> START A MEMBERSHIP Purchase & download the full report from our research store. >> BUY THE REPORT\nThe choice is yours. But however you decide to acquire this report, you've given yourself a powerful advantage in your understanding of how biometrics are changing the payments industry.","url":"https://www.businessinsider.com/citi-app-users-get-more-biometric-authentication-options-2016-12"}
