{"authors":["Edith Hancock"],"date_download":"2018-10-30 21:44:45","date_modify":"2018-10-30 21:44:45","date_publish":"2016-12-18 00:00:00","description":"We've teamed up with the Michelin Guide to rank the most-starred cities in the world.","filename":"data/vaneerConsumption/CitieswiththemostMichelinstarsintheworld.json","image_url":"https://amp.businessinsider.com/images/58564c4bdd08951a208b4732-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_cities-with-the-most-michelin-stars-in-the-world-2016-12_1540935885.html","title":"Cities with the most Michelin stars in the world","title_page":"    Cities with the most Michelin stars in the world - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Restaurant Gordon Ramsay is one of few restaurants in London with three Michelin stars. Sebastian Aristizabal-Oviedo/Restaurant Gordon Ramsay When the Michelin guide awards restaurants with stars, they are split into three categories: One means \"worth a stop\", two means \"worth a detour,\" while the highest accolade — three stars — means \"worth a special trip.\"\nIt's safe to assume, then, that anywhere with more than 225 Michelin-starred restaurants is definitely worth planning a holiday around.\nWe've teamed up with the Michelin Guide to rank the most-starred cities in the world.\nWhile Japan is leading the way in culinary tourism, with four cities in the country sharing a total of 557 stars between 429 restaurants — European capitals like London and Paris are still highly respected foodie destinations.\nFrom Molecular gastronomy in Chicago to Fugu in Tokyo, here are 18 cities with the most Michelin stars in the world.\nNote: The most-starred cities were calculated by looking at the most recent Michelin ratings for restaurants in every destination and the number of stars each venue has received.","url":"https://www.businessinsider.com/cities-with-the-most-michelin-stars-in-the-world-2016-12"}
