{"authors":["Will Martin"],"date_download":"2018-10-31 00:36:39","date_modify":"2018-10-31 00:36:39","date_publish":"2018-07-08 00:00:00","description":"BI PRIME: Phase four of the global market cycle is characterized by \"a full-on global bear market\" and usually associated with a US recession. \"Stock market bubbles burst. Dips should be sold not bought. More defensive and contrarian strategies deliver.\"","filename":"data/vaneerConsumption/Citiwarnswecouldbemonthsawayfromafullonglobalbearmarket.json","image_url":"https://amp.businessinsider.com/images/5b3e585c64444521008b4795-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_citi-full-on-global-bear-market-warning-2018-7_1540946199.html","title":"Citi warns we could be months away from a 'full-on global bear market'","title_page":"    Citi warns we could be months away from a 'full-on global bear market' - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Youtube/WoodlandParkZoo\nMarkets may be only a few months from entering a \"full-on bear market\" if historical precedents are recreated, a note released by analysts at Citi this week suggests. That doesn't mean there's no money left to be made, however.\nWriting in the bank's quarterly Global Equity update, a team led by the equity strategist Robert Buckland breaks down global market activity into four \"phases\" — arguing that we are in the third phase but that the fourth phase is on its way. That phase, the team says, is characterized by \"a full-on global bear market, usually associated with a US recession.\"\nThey add: \"Stock market bubbles burst. Dips should be sold not bought. More defensive and contrarian strategies deliver.\"\nWe're not there yet, they make clear, but given that phase three lasted only four months during the most recent market cycle, it may not be far off — especially given that by Citi's estimations the third phase of the cycle started in February. The analysts noted, however, that it lasted 16 months in the late 1980s and 32 months in the late 1990s.\nPhase three, Citi says, comes after the peak of the market and is analogous with the period usually known as the \"late cycle,\" which usually \"favours growth and momentum trades and has produced bubbles in the past,\" Citi says. Phase four is when things start to go downhill, with the markets and generally the economy entering a downturn. This often includes a recession.\nIn fact, just three of the 18 indicators tracked by Citi are showing red flags, whereas nearly all of them did prior to the 2000 bear market, which was triggered by the dot-com crash.\nCiti\nWhile the market is still in reasonably good shape, the team believes there are opportunities to make money, recommending that investors pull out of markets like Japan and Australia while going overweight on US equities and equities in emerging markets, particularly Korea, Taiwan, Russia, and Brazil.\nLooking globally, the bank is telling clients to put money into growth stocks, while also favoring — at least for the time being — procyclical stocks.\nHere's the key extract from Citi's team (emphasis ours):\n\"Expansion in the global economy should boost EPS for cyclical stocks. Alternatively, a roll-over in global PMIs, flattening yield curves and rising credit spreads would indicate more caution. In addition, Phase 3 of the credit/equity clock is usually associated with market leadership narrowing into growth and momentum trades.\n\"Putting this together means we are now Overweight Materials, IT and Health Care and Underweight Consumer Discretionary, Utilities and Consumer Staples. This keeps a general preference for cyclicals over defensives, although that is reduced by downgrading Energy and Financials to Neutral. We stay Overweight IT given it is the obvious candidate to provide leadership in this narrowing bull market. Our favored defensive is now Health Care.\"\nInvestors should remain vigilant of signs the bear market is approaching while managing their portfolios, Citi says, with Buckland and his team pointing to two key indicators to watch.\n\"Factors that we'd watch most closely include the US yield curve and IG credit spreads,\" the team writes.\n\"A flat or downward sloping US curve has been a good predictor of previous recessions, EPS collapse and global equity bear market. A flat curve indicates that Fed policy is tight and likely to drive a slowdown in the economy.\"\nOn Thursday, the spread between the two- and 10-year US Treasury yields fell to 28.6 basis points, making for the flattest yield curve since the third quarter of 2007 — just before the financial crisis started to crystallize.\nOn the issue of credit spreads, Citi warns to look at spreads rising above 175 basis points — from their current level of about 120 — at which point, it says, it \"would be much more worried about the future direction of global equities.\"","url":"https://www.businessinsider.com/citi-full-on-global-bear-market-warning-2018-7"}
