{"authors":["Linette Lopez"],"date_download":"2018-10-30 23:16:35","date_modify":"2018-10-30 23:16:35","date_publish":"2016-12-08 00:00:00","description":"Express Script is down almost 7%.","filename":"data/vaneerConsumption/CitronAndrewLeftshortExpressScripts.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_citron-andrew-left-short-express-scripts-2016-12_1540941395.html","title":"Citron, Andrew Left short Express Scripts","title_page":"    Citron, Andrew Left short Express Scripts - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Andrew Left, the founder of Citron Research. Bloomberg On Thursday, the short-selling firm Citron Research tweeted that Express Scripts, a pharmacy benefits manager, might be targeted during the Trump administration.\n\"When @realdonaldtrump tells $ESRX ' you're fired' heads will roll. The culprit behind pharmaceutical price gouging. Price Target $45,\" the firm, which was founded by investor Andrew Left, tweeted.\nThe stock is now down by about 7%. In an interview with Time, President-elect Donald Trump said he thought drug-price gauging across the pharmaceutical industry was wrong, but he gave little detail about what he would do about the practice.\nAnd that's where Express Scripts come in.\nPharmacy benefit managers manage lists called formularies for insurance companies. Those lists determine which drugs insurers will pay for and how much they'll pay. PBMs also collect a rebate from drug companies that they may or may not pass on to their clients. Those rebates are secret, as are the fees that insurers pay to the PBMs.\nThat lack of transparency has led critics to believe that PBMs contribute to high drug costs by taking big rebates for drugs without passing them on to customers, among other shady practices. They have some powerful enemies on Capitol Hill, too — Republican Reps. Earl \"Buddy\" Carter and Doug Collins, each of whom is from Georgia.\nBusiness Insider\nExpress Scripts is facing a lawsuit from one of its largest clients, Insurer Anthem, accusing it of self-dealing. Multiple pharmacies are also suing the company, accusing it of diverting prescriptions from them to Express Scripts' in-house mail-order pharmacy without permission. Federal investigators in New York and Massachusetts are also looking into the company.\n\"$ESRX is Philidor of the pharma industry,\" Citron also tweeted, referring to the secret pharmacy that was discovered inside battered drug company Valeant Pharmaceuticals last year. \"@therealdonaldtrump promises to fix drug pricing? Two words: EXPRESS SCRIPTS.\"\nThree PBMs dominate the market, combing for an 80% share. Of those three, Express Scripts is the largest and the only one that is not part of another company. The other two large PBMs are CVS Caremark and UnitedHealth's OptumRx.","url":"https://www.businessinsider.com/citron-andrew-left-short-express-scripts-2016-12"}
