{"authors":["Will Martin"],"date_download":"2018-10-30 23:39:33","date_modify":"2018-10-30 23:39:33","date_publish":"2018-07-18 00:00:00","description":"PRIME: On one side of the City are those who believe that Prime Minister Theresa May and her government will end up steering the UK to the softest possible Brexit. Others believe the UK will end up crashing out of the EU with no deal.","filename":"data/vaneerConsumption/CitytornoverhardorsoftBrexitfortheUK.json","image_url":"https://amp.businessinsider.com/images/5b4f118fc1ab53e8018b460b-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_city-torn-over-hard-or-soft-brexit-for-the-uk-2018-7_1540942773.html","title":"City torn over hard or soft Brexit for the UK","title_page":"    City torn over hard or soft Brexit for the UK - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"John Singleton Copley's \"Death of Major Pierson\" provides a fairly accurate facsimile of British politics right now. Wikimedia Commons\nLONDON — Analysts across the City of London can't agree on the type of Brexit Britain is heading towards, with less than nine months left until the country actually leaves the European Union.\nThe likes of Macquarie and Pantheon Macroeconomics believe Prime Minister Theresa May and her government will end up steering the UK to the softest possible Brexit, whereby the UK maintains close links to the EU and stays in the European Single Market.\nAt the other end of the spectrum are those City analysts who believe that the chaos of the last few weeks and the fact that we're so close to Brexit means Britain is now hurtling headlong towards a so-called \"no deal\" exit. That would mean no-trade deals, or real arrangements of any sort, and could have huge negative repercussions for the British economy. UBS is the loudest voice in this camp.\nNo deal is coming\nHardline Brexiteer and ERG member, Jacob Rees-Mogg. REUTERS/Toby Melville\nIn the no deal, or \"disorderly\" camp, is John Wraith, a UK-focused strategist at Swiss banking giant UBS. London-based Wraith wrote to clients earlier this week and said he now believes a disorderly Brexit is increasingly likely, thanks largely to the political chaos triggered by May's Brexit white paper.\nThe paper, released last week, led to the resignations of two of May's cabinet, Brexit Secretary David Davis and Foreign Secretary Boris Johnson. It also caused fury among the Brexiteer wing of the Conservative Party and failed to appease Tory MPs set on a soft Brexit.\nThe cabinet just about backed the paper, but in reality, very few people were satisfied. Add to that the fact that the opposition Labour Party has said it will not back May's proposals in their current form, and it's clear that something has to give.\nAs a result, things look more complicated than ever before for the government, Wraith wrote, and the odds of no deal are rising. Here's one of the key extracts from his latest note (emphasis ours):\n\"It has been clear for some time that there is not a sufficient number of MPs who advocate a hard Brexit for such an outcome to be approved, and nor is it one the EU is likely to be willing to sign up to. However, recent events and the strength of the reaction to them from a large number of Conservative backbenchers and former ministers, suggests that unless Labour (or a large majority of their MPs) can be persuaded to back the Government, in the process passing up the chance of a possible early General Election, a soft exit may also be impossible to approve in Parliament.\"\nWraith's argument centres around the fact that the government needs to create a Brexit proposal that can be approved by MPs, while also satisfying an immensely stringent set of criteria from Brussels.\nThat looks increasingly difficult for May, especially after the events of the last few days, which have seen her forced to amend the white paper to satisfy Tory rebels from the European Research Group (ERG), a hardline pro-Brexit fringe group.\nIf she is forced to make further concessions to either hardline Brexiteers or Remainers, it may prove impossible for the eventual Brexit legislation to make it through Parliament, forcing Britain to drop out of the EU without a deal.\nMay came within a few minutes of disaster on Tuesday evening when the House of Commons narrowly voted against an amendment to the Trade Bill which would have forced the prime minister to pursue a full customs union with the EU if she fails to secure frictionless trade by January.\nThe amendment, tabled by pro-EU Conservative MPs Stephen Hammond and Nicky Morgan, was defeated by 307 votes to 301.\nPotential rebels were warned by Conservative whips that defeating May on the bill could trigger a vote of no confidence in the prime minister and a general election.\nAs soft as possible\nBritish Prime Minister Theresa May. Matt Cardy/Pool via REUTERS\nOn the other side of the coin, there are some analysts who believe that Britain is heading for the softest of Brexits. These include Australian investment bank Macquarie and research house Pantheon Macroeconomics.\nMacquarie's belief in a soft Brexit stems from their view of the white paper, which effectively boils down to an argument that May will continually soften her stance until a deal is struck with the EU.\n\"The maneuver [her soft white paper] has reinforced our expectations that we are headed for the softest of Brexits,\" a team from Macquarie led by Gareth Berry wrote on Monday.\n\"We think further concessions will be made, eventually leading to an arrangement that resembles joint membership of the EEA (like Norway) and the customs union (like Turkey).\"\nPantheon's chief UK economist Samuel Tombs is of a similar opinion, but believes Britain will only secure a soft Brexit if May is able to prevent a leadership challenge.\n\"We still think Mrs. May will cling on, ensuring that a hard Brexit does not come to pass,\" Tombs wrote to clients on Monday evening.\n\"The rebellion among Tory MPs has lost steam. A week now has passed since Boris Johnson's resignation with no major departures and a confidence vote has not been triggered yet. Brexiteers still face an uphill battle if they wish to dethrone the PM.\"\nOne of the reasons Tombs believes May will likely cling to power is that she has at least one major trump card up her sleeve — call another referendum.\nSome MPs, including former minister Justine Greening, have already called for a second vote. The government has rejected these calls but Tombs believes May could use the threat of a second referendum as a tool to hold on.\n\"It is the best way for her and her party to move forward and ensure that the public supports whatever step they take on Brexit, thereby avoiding some of the damage that would be inflicted at the next election if they force through an unpopular departure,\" he wrote.\nThe only viable options\nA note circulated by Oxford Economics on Wednesday eloquently summarises the debate in the City, noting that the only two options that now seem to be on the table for the UK are either a no deal exit into the WTO, or what it calls BINO (short for Brexit in name only).\nOxford's UK team, led by Andrew Goodwin, argue that \"there is a roughly equal chance of the BINO and 'WTO' outcomes, with both at a little over 30%.\"\nEconomically speaking, Goodwin and co. argue that BINO would effectively see the UK continue as normal, while the no deal Brexit would be the worst of all possible outcomes.\n\"Though we did not explicitly model a BINO scenario in our Brexit Research Programme, we would expect the long term economic impact to be similar in nature to remaining in the EU,\" they write.\n\"By contrast, trading on WTO rules was found to be the most damaging of all outcomes.\"","url":"https://www.businessinsider.com/city-torn-over-hard-or-soft-brexit-for-the-uk-2018-7"}
