{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 22:02:19","date_modify":"2018-10-30 22:02:19","date_publish":"2015-11-13 21:07:26","description":"As the city of Baltimore has been hit with a $75 million budget shortfall for the next fiscal year, a report says.","filename":"data/vaneerConsumption/CityofBaltimoreHitwith75MillionBudgetShortfall.json","image_url":"https://media.breitbart.com/media/2015/11/Baltimore-Riots-and-Looting-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_13__1540936939.html","title":"City of Baltimore Hit with $75 Million Budget Shortfall","title_page":"City of Baltimore Hit with $75 Million Budget Shortfall","title_rss":"NULL","source_domain":"breitbart.com","text":"As the city of Baltimore continues to deal with the aftermath of the tens of millions in damage caused by this summer’s riots, the city has been hit with a $75 million budget shortfall for the next fiscal year, a report says.\nAccording to The Baltimore Sun, embattled Mayor Stephanie Rawlings-Blake asked each city agency to cut its spending by five percent in hopes of closing this budget chasm.\nThe shortfall was announced by city finance officials on Thursday.\nOfficials also warn that the city’s financial health will likely worsen as tourism and businesses slow as repercussions from the riots continue to reverberate throughout the city.\nThe mounting deficit for the coming year is only added to the $6.3 million shortfall in the closing 2015 budget.\nDespite being tens of millions in the red, though, city budget director Andrew Kleine insists that there is no emergency.\n“It’s not an emergency by any means,” Kleine told the Sun. But he went on to say, “We want to make sure we correct the course right away. If we let it go on, it gets much more difficult.”\nThe Baltimore budget is in stark contrast to the fortunes of the state itself, as the Governor’s office reported this month that for the first time in a decade, Maryland will be starting a fiscal year with a budget surplus.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com","url":"https://www.breitbart.com/politics/2015/11/13/city-baltimore-hit-75-million-budget-shortfall/"}
