{"authors":["Jack Montgomery"],"date_download":"2018-10-30 22:07:18","date_modify":"2018-10-30 22:07:18","date_publish":"2017-04-12 13:22:53","description":"The use of \"the machinery of government\" to support the Remain campaign in the EU referendum has undermined public trust in the Civil Service","filename":"data/vaneerConsumption/CivilServiceReputationDamagedbyInappropriateandCounterproductiveBrexitBias.json","image_url":"https://media.breitbart.com/media/2016/04/wi/afp_b1d8faad7e9dd7c87e2f55cb22fe06c136f28eb2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_04_12__1540937238.html","title":"Civil Service Reputation 'Damaged' by 'Inappropriate and Counterproductive' Brexit Bias","title_page":"Civil Service Reputation 'Damaged' by 'Inappropriate and Counterproductive' Brexit Bias","title_rss":"NULL","source_domain":"breitbart.com","text":"A senior parliamentary committee believes that “inappropriate” interventions in the Brexit referendum by government officials have undermined public trust in Civil Service impartiality.\nThe Public Administration and Constitutional Affairs select committee recommended the Civil Service code be amended so that, in future, officials would have to maintain the same neutrality in referendum campaigns as they do in General Election campaigns.\nThe David Cameron administration had civil servants produce a number of forecasts and reports predicting economic calamity in the event of a Leave vote – none of which proved to be accurate – with the George Osborne-led Treasury playing a particularly active role in what came to be known as ‘Project Fear’.\n“The use of the machinery of government during referendums has a significant effect on public trust and confidence,” commented Bernard Jenkin MP, who chairs the committee.\n“Referendums, therefore, need to be designed in such a way as to provide the utmost clarity for parliamentarians, campaigners and, above all, the electorate.\n“It is of the highest importance that the referendum process is seen to be fair, by both sides, and that the result is agreed to, even if not with, by both sides.”\nNo more Treasury talk of loss of 500,000 jobs. Employment forecast to grow every year. — Andrew Neil (@afneil) March 8, 2017\nThe government’s most controversial use of state resources during the referendum campaign came in the form of a glossy £9.3 million leaflet urging a Remain vote, which was distributed to every household in the country.\nThe leaflet was widely promoted on social media platforms including Facebook, Instagram, Twitter, and YouTube, and given advertising space on government websites worth hundreds of thousands of pounds.\nNone of this was counted towards the Remain campaign’s official spending limit of £7 million, prompting a petition signed by 220,000 people decrying what was perceived as an attempt to rig the referendum.\nThe select committee’s report states: “During the run-up to the EU referendum, there were many occasions when it appeared to many that civil servants were being drawn into referendum controversy. This damaged the reputations of the Civil and Diplomatic Services for impartiality.\n“The manner of the presentation of Government reports, particularly those from the Treasury, and the decision to spend £9.3million on sending a leaflet, advocating a Remain vote, to all UK households, were inappropriate and counterproductive for the Government.”\n“The use of the machinery of Government during the referendum contributed to a perception that the Civil Service were, in some way, biased. That any such perception exists was deeply regrettable and entirely avoidable.”","url":"https://www.breitbart.com/europe/2017/04/12/civil-service-reputation-damaged-inappropriate-counterproductive-brexit-bias/"}
