{"authors":[],"date_download":"2018-10-22 20:57:52","date_modify":"2018-10-22 20:57:52","date_publish":"2014-05-05 13:27:29","description":"Pro-Russian separatists are using \"heavy guns and mortars,\" according to Ukraine's interior minister.","filename":"data/vaneerConsumption/CiviliansinSlovyanskUkraineAllegedlyUsedasHumanShields.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/420226/140505-ukraine-slavyansk-russia-950a_a42572b931a023ed6f4d8e756f3e2288.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_civilians-slovyansk-ukraine-allegedly-used-human-shields-n97156_1540241872.html","title":"Civilians in Slovyansk, Ukraine, Allegedly Used as Human Shields","title_page":"Civilians in Slovyansk, Ukraine, Allegedly Used as Human Shields","title_rss":"NULL","source_domain":"nbcnews.com","text":"The statement alleged the pro-Russians were shooting from apartment buildings and using locals as \"human shields\" for cover.\nRussian media carried several reports saying that the heavy artillery was used by the Ukrainian military. There was no counter statement on the allegations of human shields issued by the separatists or Russian government by 4.30 p.m. local time (9.30 a.m. ET).\nWith presidential elections looming on May 25, Ukraine's fledgling government is in the midst of what it called an \"anti-terrorism\" operation to wrest back control of the industrial and Russian-speaking east of the country. Slavyansk is one of the main cities in the Donetsk region seized by separatists last month.\nOn Monday the self-proclaimed Donetsk People's Republic issued a call to arms and asked people to join an armed insurrection against the government on Friday.\nThe bitter divisions between those leaning toward Russia and those looking West came to a head Friday when more than 40 people died in the southwestern city of Odessa, many of them in a fire inside a government building.\n- Maria Stromova and Alexander Smith","url":"https://www.nbcnews.com/storyline/ukraine-crisis/civilians-slovyansk-ukraine-allegedly-used-human-shields-n97156"}
