{"authors":[],"date_download":"2018-10-30 14:31:07","date_modify":"2018-10-30 14:31:07","date_publish":"2015-07-23 00:00:00","description":null,"filename":"data/vaneerConsumption/CivilsocietytorpedoedRestaurantscantrefuseservice.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_07_civil_society_torpedoed_restaurants_cant_refuse_service_1540909867.html","title":"Civil society torpedoed: Restaurants can't refuse service","title_page":"Civil society torpedoed: Restaurants can't refuse service","title_rss":"NULL","source_domain":"americanthinker.com","text":"McDonald’s, on Eighth Avenue between 34th and 35th Streets, is a throwback to a seedier era in New York... within a three-minute walk there are a clinic that dispenses methadone, the substitute opioid used to treat heroin addiction; two outpatient substance-abuse programs; and a needle exchange.\nSome customers pour beer into clear McCafé plastic cups and drink it right in the open. A man called Shamrock swills straight vodka from a Dasani water bottle at a table near the entrance. The other day, a man headed straight for the bathroom, pausing only to open his backpack and grab a bag of heroin, known as “dog food.” On a recent Wednesday, an ambulance showed up to carry away a regular who had been stabbed in an adjacent doorway, leaving blood all over the sidewalk.\nMany of the patrons run a circuit, from the methadone clinic to the front of the needle exchange and then down to the restaurant for a few hours to come down after the methadone, hang out with friends and maybe hustle some business.\nAlmost anything is for sale. An iPod is $40. A six-pack of white socks goes for $3. Fancy headphones, still in their packaging from a nearby Duane Reade, run $8...\nOne regular said a bag of heroin runs $10 in the bathroom. A stick costs $5. A pin is $2 or $2.50. But all those prices vary, depending on the customer. A man from Wall Street regularly paid $25 a bag.\nThey have won this McDonald’s. They have won with sheer numbers, and because they always return. They have won despite the “no loitering sign” that sets a time limit of “30 minutes while consuming food.” They have won despite the police, who went there 200 times last year, mainly responding to disorderly conduct calls but also to arrest people selling drugs. They have won despite the security guard, one man against dozens, who has been on the job more than 20 years and sometimes shoos away the customers who pass out on the tables. He was stabbed in the leg by a regular about four years ago.","url":"https://www.americanthinker.com/blog/2015/07/civil_society_torpedoed_restaurants_cant_refuse_service.html"}
