{"authors":[],"date_download":"2018-10-30 18:13:50","date_modify":"2018-10-30 18:13:50","date_publish":"2014-06-16 23:02:00","description":"Atlanta, the cradle of the civil rights movement, finally has a museum that tells its story. Atlanta's civil rights museum, the National Center for Civil and Human Rights, offers visitors a history of the freedom movement in this country told from Atlanta’s perspective, including Martin Luther King","filename":"data/vaneerConsumption/CivilRightsMuseumOpensinAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/MyAJC/2014/06/20/Videos/3634136268001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_what-expect-t_25337fee760feb935e92e08c9a65e741__1540923230.html","title":"Civil Rights Museum Opens in Atlanta","title_page":"Civil Rights Museum Opens in Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"Atlanta, the cradle of the civil rights movement, finally has a museum that tells its story.\nOn Monday, June 23, 2014, the National Center for Civil and Human Rights opened its doors, offering visitors a history of the freedom movement in this country (told from Atlanta’s perspective) and an accounting of the modern human rights activism that civil rights pioneers inspired.\nThe NCCHR is housed downtown in an elegantly curved structure with a moss lawn for a roof. Its immediate neighbors in the Pemberton Place tourist mecca are the World of Coke and the Georgia Aquarium; nearby are Centennial Olympic Park and the CNN Center.\nIn comparison to these lighthearted attractions, the downtown facility offers more serious fare: scholarship, a walk through history and some consciousness-raising.\nExhibitions director David Mandel said the average visitor — the “stroller” — will spend 75 minutes at the center. (Less for “streakers,” more for “scholars.”) All tours are self-guided and will take visitors to any or all of three galleries.\nOutside of the King collection, the center is not a repository of artifacts. Instead, it is what Mandel calls “experiential.”\nHere’s what to expect there:\nRolls Down Like Water: The American Civil Rights Movement\nThis gallery was curated by George C. Wolfe, a Tony Award-winning playwright and director, best-known for directing “Bring in ‘da Noise/Bring in ‘da Funk” and “Angels in America — Millennium Approaches.” This is his first museum — not including the fictional attraction in his 1986 play “The Colored Museum.” As might be expected, he has created a theatrical experience.\nVisitors enter this gallery on the second floor of the 42,000-square-foot center. They walk through a compact anteroom papered with everyday scenes from the pre-civil rights era. On the right, in neon script, is the word “Colored,” over photos of nightlife on Auburn Avenue, the Black Crackers baseball team and church services. On the left under “White” are similar scenes — featuring bobby soxers and college football.\nFarther along is a wall emblazoned with Jim Crow laws banning interracial marriage and requiring separate restrooms for white and black customers of public facilities.\nThen visitors pass through the first of what Wolfe calls “portals,” or defining moments, in this case the Brown v. Board of Education decision. This ushers them into a wash of sound and video.\nHere we see films of police dogs attacking protesters, a wall-sized photo of a baby-faced Emmett Till, a life-size re-creation of a Freedom Rider bus, covered with portraits of actual Freedom Riders. Some of the photographs are interactive, and can trigger a short audio narrative.\nThe most dramatic installation is an interactive lunch counter at which guests don headphones and experience a simulation of a sit-in during the 1960s. Taped voices level threats, and a vibrating jolt can give the impression that someone has just kicked the visitor’s chair. It is unnerving.\nIn the next room, a panoramic screen tells the story of the 1963 March on Washington. Then, past a touching stained-glass tribute to the four young girls killed in the Birmingham church bombing, is a tableau of moments from the day in April 1968 when the Rev. Martin Luther King Jr. was murdered. We see Walter Cronkite announcing King’s death on national television. We walk up a staircase illuminated by an eerie re-creation of the sign outside the Lorraine Motel in Memphis, Tenn.\nIn the final room, a different set of laws is inscribed on the walls: laws banning segregation and guaranteeing equal rights for all Americans, laws that were passed as a result of the massive freedom movement. It’s an uplifting outcome, and demonstrates Wolfe’s guiding philosophy: This story is a success story.\nSpark of Conviction: The Global Human Rights Movement\nWhile the civil rights exhibit is a one-way path that moves from darkness to light, the human rights exhibit is open, and visitors are free to choose their own direction.\nSix illuminated figures dominate the main room. They are “human rights defenders.” Their life-size portraits were captured by New Yorker magazine photographer Platon and mounted on light boxes. These figures stand like monoliths in the open area. They include Anastasia Smirnova, who works for LGBT rights in Russia; Denis Mukwege, of the Congo, who has spent the last 15 years treating women who have been traumatized by rape; and Sussan Tahmasebi, of Iran, who campaigns to abolish laws that discriminate against women.\nTo one side are the human rights “villains” — including Adolf Hitler, Joseph Stalin and Chilean dictator Augusto Pinochet — also life size, but pictured in black and white, standing against a wall, their height measured off in inches, as if in preparation for a mug shot.\n“You have the hall of fame on one side and the hall of shame on the other side,” said Atlanta artist Ross Rossin, who painted seven super-realistic portraits of human rights heroes for the exhibit, including King, Gandhi and Nelson Mandela. “You feel the energy of the conflict; it’s kind of powerful.”\nExhibit curator Jill Savitt said her goal is to “put the ‘human’ in ‘human rights,’” and so the room is full of people with whom the visitors can see eye to eye.\nThis philosophy deepens in an exhibit called “Who Like Me.” Here guests look into an interactive mirror and pick (from a list) a characteristic that they would use to describe themselves: “worker,” “Christian,” “Muslim,” “activist.” Swimming up in the mirror is video of an individual who shares the same attribute, one for which they were harassed and persecuted in their home country.\nVoice to the Voiceless: The Morehouse College Martin Luther King Jr. Collection\nThe scrap of paper had been folded and unfolded so many times it was coming apart at the creases. When King was assassinated, it was in his pocket. On it was a quote from Mahatma Gandhi: “In the midst of death, life persists; in the midst of darkness light persists.”\nA facsimile of that piece of paper is among the items being displayed in the center’s King gallery, where visitors can see his youthful report cards, handwritten sermons, notes for speeches, rough drafts of writings and correspondence.\nAlso on display is an edited draft of “Letter From a Birmingham Jail,” and, in King’s tiny script on torn sheets from a notebook, or perhaps motel stationery, the words to his sermon “Drum Major Instinct,” delivered just months before he was killed.\nThe lighting is dim. Projected on one wall is “Yo tengo un sueno,” “J’ai un rêve,” “Ich habe einen Traum” — the phrase “I have a dream” in 25 languages.\nIn the small gallery’s nine cases only a sample of the 13,000 documents from the King collection can be displayed. “It speaks to all sides of Dr. King,” said Loretta Parham, director of the Atlanta University Center’s Woodruff Library, where the rest of the collection resides, “not only his activism, but his life as a student, his life as a preacher and his life as a scholar.”\nTraveling from one end of the facility to the other provokes a mix of feelings, but employee Tangelia Roberts, who this week was sweeping the stairs in the darkest part of the exhibit, in the section just after King’s assassination, said the top of those stairs brings reconciliation and light.\n“I love it,” she said. “Once you get to the top, you feel like you’ve made it to the mountaintop.”","url":"https://www.ajc.com/entertainment/what-expect-the-national-center-for-civil-and-human-rights/1EKTIK4lavUmDEBX2l5InI/"}
