{"authors":["Nick Purewal","Press Association Sport"],"date_download":"2018-10-23 02:26:50","date_modify":"2018-10-23 02:26:50","date_publish":"2016-01-29 16:59:07","description":"South Africa-born flanker CJ Stander has admitted to frantically learning the Gaelic lyrics to Ireland's anthem Amhran na bhFiann (The Soldier's Song) in case of his Test debut in the Six Nations.","filename":"data/vaneerConsumption/CJStanderhaslearnedGaeliclyricstoIrelandsanthemAmhrannabhFiannasSouthAfricanbornflankerpreparesforSixNationsdebut.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B2D02800000578-0-image-a-111_1454086275314.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-3423115_CJ-Stander-learned-Gaelic-lyrics-Ireland-s-anthem-Amhran-na-bhFiann-South-African-born-flanker-prepares-Six-Nations-debut_1540261610.html","title":"CJ Stander has learned Gaelic lyrics to Ireland's anthem Amhran na bhFiann as South African-born flanker prepares for Six Nations debut","title_page":"CJ Stander has learned Gaelic lyrics to Ireland's anthem Amhran na bhFiann as South African-born flanker prepares for Six Nations debut | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"South Africa-born flanker CJ Stander has admitted to frantically learning the Gaelic lyrics to Ireland's anthem Amhran na bhFiann (The Soldier's Song) in case of his Test debut in the RBS 6 Nations.\nMunster's European Champions Cup captain excelled for South Africa's Under-20s but later opted to join the Thomond Park province and chase qualification for Ireland.\nNow eligible on residency, Stander has been drafted into Ireland's Six Nations ranks and could well feature in the back-row for the opener against Wales on Sunday, February 7.\nIreland's CJ Stander takes a selfie with supporters at an open training session\nIRISH NATIONAL ANTHEM Irish version Amhrán na bhFiann Sinne Fianna Fáil, atá faoi gheall ag Éirinn, Buíon dár slua thar toinn do ráinig chugainn, Faoi mhóid bheith saor Seantír ár sinsear feasta, Ní fhágfar faoin tíorán ná faoin tráill. Anocht a théam sa bhearna baoil, Le gean ar Ghaeil, chun báis nó saoil, Le gunna scréach faoi lámhach na bpiléar, Seo libh canaídh amhrán na bhfiann English version The Soldiers' Song Soldiers are we, whose lives are pledged to Ireland, Some have come from a land beyond the wave, Sworn to be free, no more our ancient sireland, Shall shelter the despot or the slave. Tonight we man the 'bearna baoil', In Erin's cause, come woe or weal, 'Mid cannon's roar and rifles' peal, We'll chant a soldier's song\nThe 25-year-old admitted 'the heart's been pumping' even getting his hands on official Ireland training gear, so accepted he has no idea how he would keep calm in the event of his international bow.\n'I've been very excited all week in camp, walking around with a smile.\n'The heart's pumping even just putting on the kit in training.\n'It will be very difficult to keep myself level, but that's the big challenge.\n'My wife has brought up the anthem on Youtube, there's a clip with the words there added.\n'Donnacha Ryan's fluent, so he's been helping me with the words.\n'So we'll see how good his teaching has been if the chance comes up!'\nStander comfortably had the pedigree to force a Springboks breakthrough had he remained on home soil, but insisted he has battled for the last three years not just to qualify for Ireland on residency - but also to prove his worth and commitment.\nIreland players line-up for the anthem in their pre-World Cup game with England last year\n'I can't even describe it; it's something I'm very passionate about and something I've worked very hard for,' said Stander.\n'I've worked so hard to get here. I'm very proud to be in the squad.\n'I played my first few matches at Munster at six and that's where I started out.\n'I'd just be delighted to be involved anywhere. I just want to put my hand up and see what happens.'\nStander hailed new three-year Irish Rugby Football Union (IRFU) and Munster dual contracts for Keith Earls and Conor Murray after a testing campaign for Anthony Foley's side.\nStander believes both Earls and Murray can continue to sprinkle their 'magic' across both Munster and Ireland now they have resolved their long-term futures.\n'It's great for the team, it's great to get the backing from them,' said Stander.\n'It's great to know they will be here, we're building down in the south.\n'It's good to see the smiles on them when they finalise it.\n'I reckon the boys and coaches in Cork will be happy.","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-3423115/CJ-Stander-learned-Gaelic-lyrics-Ireland-s-anthem-Amhran-na-bhFiann-South-African-born-flanker-prepares-Six-Nations-debut.html"}
