{"authors":["Kipp Jones"],"date_download":"2018-10-30 21:19:54","date_modify":"2018-10-30 21:19:54","date_publish":"2015-04-09 03:10:18","description":"While attending the University of Texas in 1990, Mad Men superstar Jon Hamm was accused of abusing a fraternity pledge in a hazing ritual that included battery, setting the man on fire, and dragging him around by his genitals with the claw end of a hammer. |","filename":"data/vaneerConsumption/ClaimJonHammAbusedFraternityPledgesGenitalswithaHammerSetHimonFire.json","image_url":"https://media.breitbart.com/media/2015/04/jonhamm-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_04_08__1540934394.html","title":"Claim: Jon Hamm Abused Fraternity Pledge's Genitals with a Hammer, Set Him on Fire","title_page":"Claim: Jon Hamm Abused Fraternity Pledge's Genitals with a Hammer, Set Him on Fire | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"While attending the University of Texas in 1990, Mad Men superstar Jon Hamm was accused of abusing a fraternity pledge in a hazing ritual that included battery, setting the man on fire, and dragging him around by his genitals with the claw end of a hammer.\nAccording to arrest warrants and other documents reportedly obtained by Star magazine, the 44-year-old former Longhorn-turned actor was later charged with assault in connection with the November 1990 initiation, but escaped any jail time before his meteoric rise to fame.\nPer Star, court documents reveal while the Missouri native was a sophomore in Austin, an unidentified 21-year-old prospective pledge was ordered to the Sigma Nu fraternity house after 2 am one night.\nTravis County Court documents reveal upon his arrival, other Simga Nu members joined a then 20-year-old Hamm, in saying “It’s going to be a long night!” the mag reports.\nMaking good on their promise, Hamm and the others then allegedly put the unidentified college junior through hours of physical attacks as part of an initiation process.\nThe man would later claim he was hit by Hamm and the others with a paddle at least 30 times, and then lifted off the ground by his underwear, “pulling it back and forth in a sawing motion.”\nFurthermore, the man alleged he was led to a basement where Hamm slammed his face into the ground after he coerced him into doing push-ups. After standing on the pledge’s spine with his full weight, the documents claim Hamm set the young man’s pants on fire, and would only allow him to extinguish the flames by blowing them out.\nAt the end of the “ritual,” the man was taken to the fraternity’s “Party Room,” where Hamm allegedly “hooked” the claw of a hammer underneath his genitals and led him around the room.\nWarrants were later issued for 8 member of Sigma Nu, including Hamm.\nThe following year, the New York Times reported the story, but made no mention of Hamm.\nFrom the NYT, August 4, 1991:\nThree former members of Sigma Nu fraternity at the University of Texas were sentenced to up to 30 days in jail by an Austin judge last month for hazing violations, in the first such convictions in the state. …A fourth former fraternity member, Todd Bowden, 22, of Dallas, was convicted of a lesser hazing violation and fined $500. The men were accused of participating in a hazing incident last November, when a pledge was repeatedly beaten, humiliated and led nude by means of a claw hammer. The chapter was subsequently disbanded by Sigma Nu’s national office. New Power to Discipline.\nHamm’s official Biography page states: “He decided to go to the University of Texas, turning down offers to play football at several Ivy League colleges. His time at University of Texas turned out to be brief, however, due to some personal hardships.”\nThe Daily Mail reports a warrant was issued for his arrest in 1992, but he reached a plea deal in 1995 and the charges were dismissed.\nAfter the incident, Hamm returned home to live with his family and finished school at the University of Missouri.\nA friend reportedly told Star, “The hazing incident was an isolated incident in Jon’s life. Since then, he’s been strong enough to take steps to make himself a better person.”","url":"https://www.breitbart.com/entertainment/2015/04/08/claim-jon-hamm-abused-fraternity-pledges-genitals-with-a-hammer-set-him-on-fire/"}
