{"authors":[],"date_download":"2018-10-21 02:47:08","date_modify":"2018-10-21 02:47:08","date_publish":"2018-08-16 17:53:12","description":"Clare distinguished herself with her collaborative approach and design creativity over the past year as a contractor.","filename":"data/vaneerConsumption/ClareRamirezjoinsDesign.json","image_url":"https://www.washingtonpost.com/resizer/ZIwdtFReqPMJh15-SBE1si-PDjE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/K745CI4HXM5QBLJKZWU3RUL5MU.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_08_16__1540090028.html","title":"Clare Ramirez joins Design","title_page":"Clare Ramirez joins Design - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Announcement from Design Director Greg Manifold and Deputy Design Director Brian Gross:\nWe’re thrilled to announce that Clare Ramirez will join the Design department as a full-time designer.\nClare distinguished herself with her collaborative approach and design creativity over the past year as a contractor. She’s built numerous enterprise stories — including “Seoul success” and “White and in the minority” and handled design for all of our daily print sections. She also spent time on our Google Amp Stories (Stamp) team, working on pieces such as “Before and after: Kilauea’s wrath on the Big Island” and Symbolism of Olympic Logos.\nClare earned a journalism degree from Syracuse University where she also worked on the school newspaper, The Daily Orange. She showed her versatility there as presentation director, features editor, copy chief and as reporter. While on a study abroad weekend tour of Paris, she wrote three powerful accounts of the November 2015 terrorist attacks.\nClare grew up in the Philippines before her family moved to Los Angeles. Her hobbies include playing music, going to movies and shows.\nPlease join us in congratulating Clare.","url":"https://www.washingtonpost.com/pr/wp/2018/08/16/clare-ramirez-joins-design/"}
