{"authors":[],"date_download":"2018-10-30 20:21:57","date_modify":"2018-10-30 20:21:57","date_publish":"2015-12-14 11:06:16","description":"An autopsy is scheduled Tuesday for Clarkesville Mayor Terry Greene, who died after being shot Sunday during a domestic disturbance at his home in the town about 85 miles northeast of Atlanta.","filename":"data/vaneerConsumption/Clarkesvillemayordiesafterbeingshotinthehead.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_clarkesvill_36fbe79da2d50a0ed78fd63248286f7c__1540930917.html","title":"Clarkesville mayor dies after being shot in the head","title_page":"Clarkesville mayor dies after being shot in the head","title_rss":"NULL","source_domain":"ajc.com","text":"An autopsy is scheduled Tuesday for Clarkesville Mayor Terry Greene, who died after being shot Sunday during a domestic disturbance at his home in the town about 85 miles northeast of Atlanta.\nAuthorities have not said who they believe fired the shot that struck Greene in the head.\nAccording to the Georgia Bureau of Investigation, the shooting happened around 7 p.m. Sunday and was the result of “a reported domestic disturbance at the residence between Mayor Greene and his wife.” Greene, 53, was taken to Habersham Medical Center, then flown to Atlanta Medical Center, where he died.\nGBI spokesman Scott Dutton said local authorities asked his agency to investigate the shooting. Tuesday’s autopsy will be completed at the GBI Medical Examiner’s Office in Decatur.\nGreene, a Habersham County physician, was first elected to the Clarkesville City Council in 1999 after serving four years on the city’s planning and zoning commission.\nA graduate of the University of Georgia and the Medical College of Georgia, Greene had been mayor since 2005. He and his wife have four children, according to a previous post on the city’s website.\nJerry Wise, chief operating officer of Habersham Medical Center, issued the following statement on the hospital’s Facebook page Monday:\n“The Habersham Medical Center family is filled with unimaginable grief and sadness upon learning of the passing of Dr. Terry Greene. Our hearts go out to his family, office staff, patients and countless others who admired and appreciated his medical expertise and leadership. Dr. Greene served for 23 years on the HMC Medical Staff, including serving as Chief of Staff from 2012 to 2014. His passing is a huge loss to our medical family, and we join the entire Habersham County community in mourning.”","url":"https://www.ajc.com/news/crime--law/clarkesville-mayor-dies-after-being-shot-the-head/NR9xHj25qOOVmuc1D9GouN/"}
