{"authors":[],"date_download":"2018-10-22 21:17:08","date_modify":"2018-10-22 21:17:08","date_publish":"2014-05-05 13:33:05","description":"Teachers and students want to use new technology in the classroom. Investors want to fund it. So what's the problem?","filename":"data/vaneerConsumption/Classroom20CanTeachersTakeAdvantageoftheEdTechBoom.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/423951/140506-laptopclassroom-1321_ea51e853a4f3bb46fe898153534c0d75.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_tech-news_classroom-2-0-can-teachers-take-advantage-ed-tech-boom-n97171_1540243028.html","title":"Classroom 2.0: Can Teachers Take Advantage of the Ed-Tech Boom?","title_page":"Classroom 2.0: Can Teachers Take Advantage of the Ed-Tech Boom?","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIf Silicon Valley builds it, will educators come?\nDevelopers are getting mountains of cash to create digital tools for the classroom and teachers are eager to incorporate technology into their lesson plans. But school districts only have so much money to spend and teachers only have so much time to discover and learn how to use new software, raising questions about whether an ed-tech bubble is forming.\nIn 2013, venture investment in K-12 education technology jumped 6 percent to $452 million, according to statistics from the New School Venture Fund. Google's products are especially popular with teachers, which would explain why the company on Tuesday launched Google Classroom, which ties together Docs, Drive and Gmail into one student-friendly package.\nDevelopers might be flush, but only 54 percent of teachers think the most popular ed-tech tools are effective, according to a survey of 3,100 educators released in April by the Bill and Melinda Gates Foundation. Teachers were able to recognize less than half (47 percent) of the 964 educational programs mentioned in the survey.\n\"How many of those companies actually have teachers helping them design the software and hardware they are creating?\" Michael Berman, vice president of technology and communication at California State University Channel Islands, asked NBC News. \"They will create something and sell it to school administrators without an idea of how it will work in the classroom.\"\nHow a wired classroom should look\nTeachers might use only a fraction of the tools launched by Silicon Valley, but some are using them very effectively.\nThere are no computer labs at Philadelphia Science Academy. Instead, high school kids carry Dell Chromebooks around with them and even have their own school email addresses.\nIt’s all part of the school’s strategy to make technology “ubiquitous, necessary and invisible” in the classroom.\n“It shouldn’t be, ‘Ooh, we are doing a technology project now,'” Chris Lehmann, principal of the Philadelphia Science Academy, told NBC News.\n“Technology shouldn’t be something special,” he said. “It should be a deeply embedded, essential part of the way we learn today, which is how we treat technology in every other aspect of our lives.”\nHis kids use Google’s suite of free, cloud-based apps to turn in work. So do the students in Katharine Giertych’s high school English class, at Antioch Community High School in Antioch, Illinois, where turning in essays is a thing of the past — at least ones printed on paper.\nInstead, the kids simply upload them to Google Drive, eliminating that bane of teachers everywhere: piles of papers to grade. (An app called RemindMe lets students know, yes, that essay on Shakespeare is due tomorrow).\n“I found that grading online is actually a lot easier for me,” Giertych told NBC News. “I can be a little clearer in my comments because I don’t have to fit them into one-inch margins.”\nMarielle Sallo, assistant principal of curriculum and math teacher at San Gabriel Mission High School, in San Gabriel, California, uses Google’s software as well, plus other apps like Notability, a note-taking app, and Splice, for video-editing.","url":"https://www.nbcnews.com/tech/tech-news/classroom-2-0-can-teachers-take-advantage-ed-tech-boom-n97171"}
