{"authors":[],"date_download":"2018-10-23 01:16:30","date_modify":"2018-10-23 01:16:30","date_publish":"2017-03-16 11:08:20","description":"Clashes broke out Thursday in Tripoli hours after armed groups signed a ceasefire deal ending a four-day battle for control of the Libyan capital.Gunfire...","filename":"data/vaneerConsumption/ClashesinTripoliafterLibyafactionsagreeceasefire.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/19/wire-230477-1489694300-192_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4319698_Libya-factions-agree-ceasefire-Tripoli-battle_1540257390.html","title":"Clashes in Tripoli after Libya factions agree ceasefire","title_page":"Clashes in Tripoli after Libya factions agree ceasefire | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Libyan security forces flash victory signs outside the Guest Palace, a complex of luxury villas in central Tripoli on March 15, 2017\nClashes broke out Thursday in Tripoli hours after armed groups signed a ceasefire deal ending a four-day battle for control of the Libyan capital.\nGunfire could be heard in Tripoli's southern neighbourhood of Hadba al-Khadra, residents and a Facebook page dedicated to informing citizens on unrest said.\nA woman, who declined to give her name, said all the main roads in Hadba al-Khadra were closed and that residents were staying indoors.\nIt was not immediately clear who was responsible for the clashes, but Tripoli is rife with heavily armed militias.\nThe new fighting came hours after two powerful armed groups, Thowar Tarabulus and the Abu Slim Brigade, denounced the ceasefire announced by the UN-backed Government of National Accord (GNA).\nThowar Tarabulus controls the city centre of Tripoli while Abu Slim controls the southern working-class district of the same name.\nBoth groups denied agreeing to the truce that put an end to four days of fierce fighting in Tripoli.\nThe city had been paralysed amid exchanges of rocket and artillery fire between pro-unity government forces and rival militias including groups allied with former prime minister Khalifa Ghweil.\nClashes on Wednesday night rocked the southern Salaheddine district, where several rival militias occupy barracks.\nThe truce deal -- signed by the GNA, local mayors and militias from Tripoli and third city Mistrata, was aimed at cementing the UN-backed government's control over large parts of the capital.\nIt provided for an \"immediate ceasefire\" and called for armed groups that do not recognise the GNA to leave Tripoli within 30 days.\nIt also demanded the release of people arrested since Monday, the GNA's defence ministry said.\nBut Thowar Tarabulus, in a statement on their Facebook page, said the \"agreement signed in the presence of the presidential council does not represent us\".\nThe Abu Slim Brigade said, in a separate online statement, \"we did not sign the (ceasefire) agreement... we will only accept full solutions\".\n- Operation well-prepared -\nMilitias have been key power brokers in a country plagued by violence and lawlessness since the NATO-backed ouster of longtime dictator Moamer Kadhafi in 2011.\nCharred vehicles sit outside the Tripoli offices of Al-Nabaa TV on March 15, 2017 amid an intense battle for the capital\nThe battle, triggered Monday night after the killing of a bank guard, saw pro-GNA forces expand their clout in the capital.\nThey took several districts from rival militias including groups allied with Ghweil, who was forced from power when the GNA arrived in Tripoli.\nThe GNA operation appeared to be well-prepared and coordinated. Thursday's deal charges GNA forces with securing areas controlled by rival groups.\nObservers said it was in line with an inter-Libyan political deal backed by the UN and signed in December 2015.\nThat agreement, which gave rise to the GNA, called for armed groups to leave Tripoli and other Libyan towns.\nBut the capital remains home to dozens of militias. Since taking office, the unity government has secured the backing of several, but many parts of Tripoli remain out of its control.\nThe GNA wants to see heavy weapons withdrawn to allow its security forces to operate effectively.","url":"https://www.dailymail.co.uk/wires/afp/article-4319698/Libya-factions-agree-ceasefire-Tripoli-battle.html"}
