{"authors":[],"date_download":"2018-10-30 18:55:38","date_modify":"2018-10-30 18:55:38","date_publish":"2016-07-06 18:17:11","description":"From acting to set production, here are 7 acting classes and workshops around metro Atlanta for those interested in making their mark on Hollywood.","filename":"data/vaneerConsumption/ClassesandworkshopsforGeorgiasfilmandTVindustry.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/06/20/Images/photos.medleyphoto.10227643.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_employment_take-th_567303cf411ae733b652207d8344b544__1540925738.html","title":"Classes and workshops for Georgia's film and TV industry","title_page":"Classes and workshops for Georgia's film and TV industry","title_rss":"NULL","source_domain":"ajc.com","text":"It's no secret that Atlanta's film and TV industry is booming. Mayor Kasim Reed recently launched the City of Atlanta Entertainment Training Program, the first job training program in the United States focused on helping the film industry build a pool of talent.\nLuckily, for aspiring actors, there's more where that came from. Here are 7 acting classes and workshops around metro Atlanta for those interested in making their mark on Hollywood.\n>>RELATED: These 4 Atlanta film, TV companies have been looking for interns\nAct Tactical For Film\n5725 Buford Highway NW, Doraville.\nFrom learning how to brandish a firearm to properly using a medical instrument, these classes are designed to help actors convincingly play doctors, policemen and other physically active characters. Prices range from $150 to $400, and classes are available this month.\nPralgo's Acting Class\n585 Cobb Parkway, Marietta.\nTaught by Robert Pralgo, who's landed roles in Tyler Perry's The Have and the Have Nots and Furious 7, Pralgo's Acting class offers sessions for both children and adults. While classes only hold up to eight students, unlimited space for auditors is available.\nKristen Shaw Acting Studio\n3040 Holcomb Bridge Road, Norcross.\nInstructor Kristen Shaw has appeared in more than two dozen film and television projects and over 25 national commercials. She's sharing her expertise with up-and-coming actors with classes on acting, marketing, audition taping and agent preparation. Check out the website for the full schedule.\nGray Studios Atlanta\n500 Bishop St. SW, Atlanta.\nGray Studios specializes in training young actors ages 4 to 17. Classes are offered weekly and are taught by thespian experts David Gray, Anthony Ocasio, Curt Mega, Rachid Fakhoury.\nNick Conti's Professional Actor's Studio\n2849 Piedmont Road NE, Atlanta.\nWhether you're interested in improving your acting or learning some combat or improv, there are a plethora of classes for students to choose from. With six instructors and more than 10 classes and workshops offered, you'll be ready for the big screen in no time.\nScreenwriting 101\n4859 Martin Court SE, Smyrna.\nTune your writing skills with this one-day workshop at Boob Tube Studios. For $110, you will go over character development, formatting, structure and plot to help you become a more confident screenwriter.\n>>RELATED: Interested in writing fot film and TV? This UGA program is for you\nSet Production Assistant Workshop\n461 Sandy Creek Road, Fayetteville.\nThis two-day workshop offers hands-on training, set protocol, production language, resume preparation and tips on how and where to find a job. It is offered on multiple dates with early registration costing $125.\nGet Connected\nVarious locations.\nGet Connected is a monthly mixer for individuals working in the film and entertainment industry in Atlanta. The event charges a nominal door fee of about $10, which is donated to charity. The goal of the event is to connect filmmakers and entertainers by providing a relaxing and fun venue.","url":"https://www.ajc.com/business/employment/take-these-classes-and-workshops-break-into-georgia-film-and-industry/1jfX83qbadTf6KvYV2pwrN/"}
