{"authors":[],"date_download":"2018-10-30 01:18:15","date_modify":"2018-10-30 01:18:15","date_publish":"2016-10-14 00:13:21","description":null,"filename":"data/vaneerConsumption/ClassicHalloweenFilmGhostbustersTeachesBasicEconomicTruths.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/10/original-ghostbusters-return-theaters-remake-copy.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862295.html","title":"Classic Halloween Film ‘Ghostbusters’ Teaches Basic Economic Truths","title_page":"Classic Halloween Film ‘Ghostbusters’ Teaches Basic Economic TruthsThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Popular cultural touchstones resonate with audiences because of their basis in common experiences and truths. One of those touchstones is Ghostbusters, a 1984 movie telling the tale of how Bill Murray, Dan Aykroyd, and Harold Ramis saved New York City from a rampaging Stay-Puft Marshmallow Man. Although the focus of this well-known film is providing audiences with comedic relief, hidden beneath the film’s surface is another theme focused on a group of everyday individuals, free-market principles, and the dangers of government agencies run amok.\nAfter losing their jobs as professors in Columbia University’s Parapsychology Department, professors Peter Venkman, Raymond Stanz, and Egon Spengler choose to enter the private sector, mortgaging Stanz’s home to raise seed capital for a new business venture: solving the New York City’s growing ghost problem.\nStanz sums up the difference between their former lives in academia and their new lives as entrepreneurs, saying in reference to their time working for Columbia, “[The university] gave us money and facilities. We didn’t have to produce anything!”\nTo make money and survive in “the real world,” as Stanz calls it, the Ghostbusters must produce services or goods meeting consumers’ needs and desires. Using their talents and experience, the Ghostbusters do just that, designing an “ecto-containment system,” “PKE meters,” and “proton packs” to track, rein in, and capture poltergeist pests.\nAlthough the movie doesn’t explicitly state how the trio sourced parts for those tools, one can assume many of the electronic parts were manufactured by companies in other countries, such as Japan.\nDuring the 1980s, the period in which Ghostbusters is set, some U.S. lawmakers feared the impact of trade deficits with Japan. Japanese companies sold many more electronics and electronics parts to meet American consumers’ interest in goods — such as electronic parts to be installed in a ghost-catching nuclear backpack — than U.S. companies sold to Japanese consumers.\nThese fears would later be shown to be totally irrational, as consumers realized the benefits of obtaining cheaper products they want, such as less expensive cars and Ghost-catching machinery, outweigh the costs of the trade imbalance.\nVoluntary exchange is why people work every day, and the three Ghostbusters are no different. Hired by the manager of the Sedgewick Hotel, the Ghostbusters manage to capture a ghost haunting the rooms and scaring away guests. Venkman tells the manager how much the removal will cost, but the manager balks at the price, refusing to pay. After Venkman threatens to release the ghost if the manager refuses to execute his end of the exchange, the manager quickly realizes the value of the removal of the “class-5 free-roaming vapor” and agrees to Venkman’s price.\nTo paraphrase Adam Smith, it is not from the benevolence of the Ghostbusters that ghosts are removed or the benevolence of the manager that Venkman is paid $5,000, “but from their regard to their own interest.”\nThis exchange and negotiation is the same calculus one makes when deciding which goods or services one wishes to purchase and for what amount of money they are willing to pay to purchase them. Just as one may get more enjoyment from purchasing a candy bar for $1 at the grocery store, the owner of the grocery store derives more benefit from receiving $1 than he or she does from having the candy bar.\nWithout even thinking about it, people interact with a countless number of providers of goods and services, all seeking to fill a need, however small, through the free market, just as the Ghostbusters do in this classic film.\nThe power of the free market to connect and fulfill needs and wants as displayed in Ghostbusters may seem like spooky magic, but it’s not; it’s just an example of the same American spirit each of us sees every single day as we live our daily lives.","url":"https://spectator.org/classic-halloween-film-ghostbusters-teaches-basic-economic-truths/"}
