{"authors":["Anton K. Nilsson For Dailymail.Com"],"date_download":"2018-10-23 04:09:19","date_modify":"2018-10-23 04:09:19","date_publish":"2016-01-28 20:03:02","description":"A Russian assault weapons classic is coming to Florida. Kalashnikov USA is opening a gun manufacturing plant in Florida, where it will produce weapons including the iconic AK-47.","filename":"data/vaneerConsumption/ClassicRussianassaultweaponAK47iscomingtoFlorida.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/20/30AD00FA00000578-0-image-a-16_1454011376725.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421625_Classic-Russian-assault-weapon-AK-47-coming-Florida_1540267759.html","title":"Classic Russian assault weapon AK-47 is coming to Florida","title_page":"Classic Russian assault weapon AK-47 is coming to Florida | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Russian assault weapons classic is coming to Florida.\nThe Kalashnikov company's U.S. arm is working to open a gun manufacturing plant in Pompano Beach, Florida, where it will produce weapons including the iconic AK-47.\nThe AK-47 was invented by Mikhail Kalashnikov in the early 1940s as he lay wounded in hospital after fighting in World War II.\nMikhail Kalashnikov (1919-2013) holding his most famous design in a 2005 file photo\nThe AK-47 was conceived as a Soviet alternative to the assault rifles used by the German army\nIt was presented in 1947 as a Soviet alternative to the assault rifles used by the German army.\nOriginally used by members of the Warsaw Pact and distributed to their allies around the world, the AK-47 has been the weapon-of-choice for both national armies and guerrilla troops.\nKalashnikov USA originally imported weapons from Russia, but after the United States imposed trade sanctions on the country in 2014, the American business severed ties with the Russian company.\nIn 2015, Kalashnikov USA began assembling guns in a small facility in Tullytown, Pennsylvania.The proposed facility in Florida will be a full-fledged manufacturing plant.\nHowever, the company is not allowed to make ammunition or sell the weapons in Pompano Beach, CNNMoney reported.","url":"https://www.dailymail.co.uk/news/article-3421625/Classic-Russian-assault-weapon-AK-47-coming-Florida.html"}
