{"authors":["A.B. Sanderson"],"date_download":"2018-10-30 20:51:11","date_modify":"2018-10-30 20:51:11","date_publish":"2014-11-25 11:40:00","description":"Private school educated Dr Tristram Hunt has said that a Labour government would launch an attack on independent schools claiming charity tax breaks. |","filename":"data/vaneerConsumption/ClassWarLabourThreatensPrivateSchoolTaxBreaks.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-London/2014/11/25/Tristram-Hunt_AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2014_11_25__1540932671.html","title":"Class War: Labour Threatens Private School Tax Breaks","title_page":"Class War: Labour Threatens Private School Tax Breaks | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Private school educated Dr Tristram Hunt has said that a Labour government would launch an attack on independent schools claiming charity tax breaks.\nWriting in The Guardian, Dr Hunt, who went to £18,000 a year University College School in Hampstead, said that “private schools have done too little for too long.”\nUnder plans being drawn up by Ed Miliband, fee paying schools would be stripped of £700million in tax breaks which could add around £200 to the annual fees for each pupil.\nAt the moment, private schools in Britain can claim up to 80 per cent off their business rates because they are charities. For the 2,000 independent schools this works out at around £150million a year.\nBut Labour, who abolished the assisted places scheme in 1997 which meant bright children from poorer backgrounds missed out on the chance of a better education, say these schools will only qualify for these tax breaks if they pass a new “schools partnership standard”.\nIt has been calculated that Independent schools generate about £4.7 billion in tax. But on top of this direct injection into the Treasury coffers they also save the tax payer a further £4 billion by taking children out of the state school scheme. Effectively, parents of private school educated children pay twice: fees to the school and state school costs in their taxes.\nDr Hunt wrote that Labour ‘will also bring to an end the charade of those schools who think a spurious bursary scheme, hanging up some artwork or allowing access to gardens fulfils their social responsibility.’\n‘It doesn’t. With a Labour government, private schools will only be exempt from business rates if they can show a meaningful impact on state education.’\nBut a source told Breitbart London the plans were a snide way of closing down schools which don’t fit in with their ideology and syphoning their money off for the Treasury.\n“Labour have been quietly boasting about this plan for 18 months now,” the source said.\nBarnaby Lenon, the chairman of the Independent Schools Council, told The Telegraph that stripping schools of business rate relief would be “a very ineffective tool to improve social mobility in any meaningful way.”\n“Independent schools are committed to helping widen access to their schools and to improving social mobility. Already 90 percent of our schools are already involved in meaningful and effective partnerships with state schools and their local communities,” he said.\nOnly days after his fellow Labour colleague Emily Thornberry caused outrage by posting a tweet apparently sneering at a ‘white van man’ in Rochester, the son of Baron Hunt attempted to launch a fight back against accusations that the party were governed by champagne socialists.\nHe said schools would lose the tax breaks if they did not break down the “corrosive divide of privilege”, saying it was creating a “Berlin Wall” in the country’s education system.\n“The next government will say to them: step up and play your part. Earn your keep. Because the time you could expect something for nothing is over,” he said.\nThis is the latest in a long line of attacks Labour have sprung on private schools. Back in 2006 the then government introduced the ‘Charities Act’ which said the schools were no longer entitled to charitable status.\nSchools had to prove they provided ‘wider benefit’ on top of offering excellent educational opportunities for their pupils who are offered places based on ability and potential.\nThey had to demonstrate they provided heavily subsidised places for poorer children – the same scheme Labour took away – as well as offering the use of their facilities.\nBut Dr Hunt says that these measures have not gone far enough and ‘it’s time to stop asking politely’. He claims many private schools are failing to earn their charitable status by making only ‘token benefits to their communities’.\nBut the increase in prices could end up costing the tax payer more. Andrew Halls, head of King’s College School in Wimbledon warned that middle class British families were already being priced out of independent schools and consequently would have to rely on the state system, putting pressure on the Department of Education and local authorities.","url":"https://www.breitbart.com/europe/2014/11/25/labour-launches-class-war-on-private-schools/"}
