{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 19:59:29","date_modify":"2018-10-30 19:59:29","date_publish":"2017-03-09 15:00:00","description":"Classic cocktail pop-up bar alert (with rare and vintage cocktail books).","filename":"data/vaneerConsumption/ClassiccocktailpopupTheTravellerBarlandsatLoewsAtla.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/09/Images/WPIMAGE_cmgajcfoodandmore_14545.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_up_732fe5c56179914362259c0b8d6acdb0__1540929569.html","title":"Classic cocktail pop-up The Traveller Bar lands at Loews Atla","title_page":"UPDATED: Classic cocktail pop-up The Traveller Bar lands at Loews Atla","title_rss":"NULL","source_domain":"ajc.com","text":"Classic cocktail pop-up bar alert (with rare and vintage cocktail books).\nThe aptly-named Traveller Bar has landed in Atlanta in March as part of an 18-city cocktail tour at the 25 North American Loews Hotel locations. The 4-seater bar constructed from an old elevator car has been reassembled in the lobby of Midtown’s Loews Atlanta after a month-long stint in New Orleans.\nTraveller features eight rarely-seen-on-menus classic cocktails and is equipped with a library of close to 50 rare and vintage cocktail books on loan from a collector for perusing while you sip. That library is also home to a coveted $8000 first edition copy of the 1862 “Bartender’s Guide: How to Mix Drinks” written by Jerry Thomas (considered the “father of modern mixology”--the professor, if you will.) This month-long cocktail and history nerd haven is a unique opportunity for those who dig our current drinks culture and the bartenders who forged its foundation beginning 150 years ago.\nTraveller features eight classic cocktails and is equipped with a library of close to 50 rare and vintage cocktail books on loan from a collector. Photo courtesy of Loews Brand Hotels.\nSpeaking via email, Christopher Matthew director of food and beverage at Loews Atlanta told us, “We’re lucky Atlanta has a strong cocktail culture and is home to a talented community of bartenders and mixologists. The Traveller Bar puts a new twist on that cocktail experience for locals, and educates guests on the history and evolution of their favorite drinks.”\nWhile at Traveller this past Monday, we held in our hot little hands a 1946 reprint of Charles Baker’s famed “The Gentleman's Companion” as well as an 1892 copy of the encyclopedic “The Flowing Bowl”. All of the books are available to read via the bar’s two iPads and are displayed on shelves behind the bar; although the 1862 “Bartender’s Guide” is under lock and key but makes unannounced guest appearances before being whisked away again to the vault in which it’s kept.\nWe sipped the classic Lucien Gaudin (named for a French Olympic fencer) from the 1929 “Cocktails de Paris”. It’s what happens when a negroni meets a martini and includes gin, vermouth, Campari and Cointreau. Sip this if you’re a fan of either cocktail (or both.) Upon a return visit this Thursday, we savored a Fedora with cognac, Cointreau and bourbon as well as a Whiskey Cocktail containing bourbon, Cointreau and demerara syrup.\nAs for what Matthew and his bar staff plan to do with these eight classic cocktails once Traveller moves on in April to Washington, DC, he told us, “ The Traveller is a great representation of the creativity behind food and beverage in the Loews brand. The spirit of the bar and this project will live on in our hotel long after its departure within our beverage offerings.”\nSip and savor the classics Mar. 6. - Apr. 3, 6 p.m. to 10 p.m. nightly. Valet parking available.\nLoews Atlanta Hotel, 1065 Peachtree St. NE, Atlanta. 404-745-5000, loewshotels.com/Atlanta, thetravellerbar.com.\nRead more of our coverage of the Atlanta bar scene\n4 new Atlanta-distilled spirits to add to your home bar\nWe predict Atlanta’s top 5 cocktail trends for 2017\n10 best drinks of 2016 in Atlanta\nWhy aren’t you drinking aperitif cocktails?\nRead The A List: The faces, places, dishes and drinks defining the Atlanta dining scene right now\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following@ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/updated-classic-cocktail-pop-the-traveller-bar-lands-loews-atlanta-march/Qqw3zNRSWI8y3Z1tdeqC2N/"}
