{"authors":[],"date_download":"2018-10-30 19:56:11","date_modify":"2018-10-30 19:56:11","date_publish":"2018-10-30 11:52:00","description":"Highly-prized Porsches net $25.8 million in sales at Atlanta auction","filename":"data/vaneerConsumption/ClassicPorschesnet258millioninsalesatAtlantaauction.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/29/Images/103018%20porsche%20restoration%20HS07.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_highly-prized-pors_133f723ae501fff9d9216fb36097477c__1540929371.html","title":"Classic Porsches net $25.8 million in sales at Atlanta auction","title_page":"Classic Porsches net $25.8 million in sales at Atlanta auction","title_rss":"NULL","source_domain":"ajc.com","text":"Several dozen of the world’s most sought-after cars generated more than $25 million during RM Sotherby’s Porsche 70th Anniversary Auction.\nThe event, held last weekend at Porsche’s North America headquarters in Atlanta, showcased 63 of the world’s best privately-owned vehicles.\nThe top seller was a 1985 Porsche 959 Paris-Dakar rally car that generated $5,945,000 when the hammer dropped.\nVIDEO: Learn more about Porsche\nLearn more about the luxury auto and racing car company in the AJC's \"5 things to know\" online series. (Mandi Albright/The Atlanta Journal-Constitution)\nDozens of bidders, representing 25 countries, also bid on a treasure trove of Porsche memorabilia, which accounted for more than $600,000 in sales - including a collection of Porsche 911 sales information that one bidder paid $20,000 for, surpassing the estimate of between $3,000 to $3,400.\nOne of the higlights of the auction was the sale of a 2011 Porsche 911 GT3 RS 4.0 owned by comedian Jerry Seinfeld, which went for $566,000.\nAnother hightlight was a spirited session between an online bidder and one in-house for the 2018 Porsche 911 Turbo Classic Series “Project Gold”, which sold for $3,415,000, another top-selling vehicle in the auction.\nThis show car, a 911 Turbo with an air-cooled engine, is painted in the carmaker’s Golden Yellow Metallic, the same color as its 2018 911 Turbo S Exclusive Series. This car also features black wheels with gold highlights, while seats and interior trim also are finished in black with Golden Yellow details.\nExterior features include the air intakes of the 993 Turbo S that were also available as an option for the regular 911 Turbo in 1998. Porsche stopped production of the 993 about 20 years ago.","url":"https://www.ajc.com/business/highly-prized-porsches-net-million-sales-atlanta-auction/obSYbWHDsarFiWsARg120K/"}
