{"authors":[],"date_download":"2018-10-22 22:49:32","date_modify":"2018-10-22 22:49:32","date_publish":"2014-05-12 20:43:47","description":"Crisco and Aiken competed in last Tuesday’s Democratic primary, but the race had not been called nearly a week later as both candidates awaited an official canvassing tomorrow","filename":"data/vaneerConsumption/ClayAikenOpponentKeithCriscoDead.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_20/427951/140507-clay-aiken-jms-2050_17f9e590b07858f80011ad16f85d5778.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_elections_clay-aiken-opponent-keith-crisco-dead-n103551_1540248572.html","title":"Clay Aiken Opponent Keith Crisco Dead","title_page":"Clay Aiken Opponent Keith Crisco Dead","title_rss":"NULL","source_domain":"nbcnews.com","text":"Crisco and Aiken competed in last Tuesday’s Democratic primary, but the race had not been called nearly a week later as both candidates awaited an official canvassing tomorrow. Those results could trigger a full recount or a two-man runoff.\nAs of Monday, Aiken held a 369 vote lead with 40.83% of the vote.\nAiken announced he is suspending all campaign activities \"as we pray for his family and friends.\"\n\"He was a gentleman, a good and honorable man and an extraordinary public servant. I was honored to know him,\" Aiken said in a statement.\nCrisco, a textile entrepreneur, previously served as North Carolina's Secretary of Commerce. His campaign did not immediately respond to requests for information.\nThe North Carolina State Board of Elections expressed condolences in a statement.\n\"A native of North Carolina, we are grateful for Mr. Crisco’s service to our state and his community through the years,\" the board said. \"Our thoughts and prayers are with the Crisco family during this difficult time.\"\nCrisco poured several hundred thousand dollars of his own money into his campaign and ran a tough ad during the primary against Aiken over the singer's absence at meetings for a Bush-era presidential appointment to a committee on people with intellectual disabilities.\nThe winner of the Democratic primary would face Republican Rep. Renee Ellmers in the general election.\nEllmers also released a statement saying she was \"deeply saddened\" by Crisco's death.\n\"His kindness and dedication to his principles were models we should all strive toward, and he will be dearly missed,\" she said.\nNBC's Carrie Dann and Frank Thorp contributed.","url":"https://www.nbcnews.com/politics/elections/clay-aiken-opponent-keith-crisco-dead-n103551"}
