{"authors":[],"date_download":"2018-10-30 18:48:54","date_modify":"2018-10-30 18:48:54","date_publish":"2018-08-28 19:24:00","description":"Robert Hawes, who plans to run for Clayton sheriff in 2020, turned himself in Monday after current Sheriff Victor Hill issued warrants for his arrest","filename":"data/vaneerConsumption/ClaytonSheriffHillfirstjailsrivalswifethenjailsrival.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/28/Videos/4470664.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_c_706a2a0bf465836759f0edf24681c1cf__1540925334.html","title":"Clayton Sheriff Hill first jails rival's wife, then jails rival","title_page":"Clayton Sheriff Hill first jails rival's wife, then jails rival","title_rss":"NULL","source_domain":"ajc.com","text":"An ex-Clayton County deputy who plans to challenge Sheriff Victor Hill in 2020 turned himself into police Monday after his former boss issued warrants for his arrest.\nRobert Hawes, who says Hill has been trying to intimidate him and his wife since he announced in early August his intention to run for sheriff, was jailed late Monday on charges of filing false documentation and violation of oath of office.\nHis bond was set at $26,000 early Tuesday and he was expected to be released.\n“He was in very, very good spirits,” Gerrian Hawes said in a Facebook livestream after her husband turned himself in. “Well as good as, you know, spirits can be” in the situation.\n>> AJC VIDEO: 5 things to know about Victor Hill\nHawes’ incarceration comes a week after Hill had Gerrian Hawes arrested and jailed over several emails she sent Hill earlier this year. Hill said the emails were harassing and that Gerrian Hawes refused to discontinue the communication even after he asked her to stop.\nClayton County Sheriff Victor Hill is being accused by Gerrian Hawes, whom he had arrested Wednesday, of using his office to punish her husband for planning to run against him in 2020. (AJC FILE PHOTO) (The Atlanta Journal-Constitution)\nThe dispute with the couple marks continued controversy surrounding Hill, a divisive figure in Clayton County who immediately fired 27 employees when he first took office in 2005, dramatically placing snipers on the sheriff’s department roof as the staffers were escorted out.\nIn 2015, he accidentally shot a female friend while demonstrating “police tactics” during a date. And last year, his law enforcement certification was put on probation for two years by the Georgia Peace Officer Standards and Training Council.\nThe arrest last Wednesday of Gerrian Hawes was livestreamed by her husband on Facebook. Gerrian Hawes also livestreamed a follow up on the social network after being released Thursday.\n“The last 24 hours have been crazy,” Hawes said in the livestream before thanking supporters. “I’m not crying because I’m hurt, I’m not crying because I’m sad. I’m just so emotional now.”\nHer husband, Robert, started a GoFundMe page to pay for his wife’s legal fees. To date, $670 of a $12,000 goal has been raised since the page launched 10 days ago.\nThe couple has accused Hill of trying to intimidate them because Robert Hawes plans to challenge him for sheriff in 2020. Neither Hill nor his representatives have returned repeated calls for comment, but Hill denied any nefarious motives in a release about the warrants.\n“Even though there is no record anywhere of an announcement by Hawes before August 10, Hawes and his wife were able to manipulate the media into running stories to suggest that the actions on the Sheriff’s Office were in response to their announcement even-though the timeline clearly shows it was not,” Hill said in a Twitter post.\nRobert Hawes, a former deputy in the Clayton County Sheriff’s Office, was arrested after Clayton County Sheriff Victor Hill issued a warrant. Hawes planned to run for Hill's position. (Photo by: (WSBTV.com)) (WSBTV.com)\nIn Monday’s arrest warrants of Robert Hawes, Hill said his actions relate to a late 2017 incident in which the former deputy could not account for the whereabouts of his service weapon.\nThe department, seeking in October 2017 to replace its Glock 42 models with Glock 43s, had sought the old pistol assigned to Hawes. The former deputy allegedly turned in a Glock 42 that had been purchased from a pawn shop.\nAfter an investigation was launched, Hawes told the office that he mistakenly sold his assigned weapon to an Atlanta Police Department officer, the Clayton Sheriff’s Office said. That later turned out to be a lie, the department alleged, and after being put on administrative leave without pay, Hawes resigned to avoid being fired.\nThe sheriff’s office also alleged a past issue with a missing weapon assigned to Hawes dating back to 2014. Hawes said that weapon was in a place where his son and his son’s friends could access it.\nIn addition, the report said that a lieutenant was demoted to sergeant and another was fired for lying to investigators and for tipping off Hawes that officers planned to arrest Hawes’ son on July 30.\nHawes’s son is suspected in the disappearance of two weapons, the sheriff’s office said. But it did not provide details about the guns or from where they were taken.","url":"https://www.ajc.com/news/local-govt--politics/clayton-sheriff-hill-rival-jailed-accused-violating-oath-office/JvZI2jZnBlQ9p9ILf5YzpN/"}
