{"authors":[],"date_download":"2018-10-30 18:49:03","date_modify":"2018-10-30 18:49:03","date_publish":"2018-08-03 21:41:00","description":"Prime Healthcare Services, owner of Southern Regional Hospital Center in Clayton, settles fraud lawsuit","filename":"data/vaneerConsumption/ClaytonCohospitalownertopay65millioninfraudsettlement.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/03/Images/newsEngin.22695372_061315-prokesch-ed.jpg-Southern-Regional-Medical-Center-in-River.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional_clayto_266db06cb639174591ddb824fe746c5b__1540925343.html","title":"Clayton Co. hospital owner to pay $65 million in fraud settlement","title_page":"Clayton Co. hospital owner to pay $65 million in fraud settlement","title_rss":"NULL","source_domain":"ajc.com","text":"Prime Healthcare billed itself as capable of turning around failing hospitals, including Southern Regional Medical Center in Clayton County.\nBut its formula, the federal government alleged, was to systematically defraud Medicare and other government programs.\nNow, the California-based chain has agreed to pay $65 million to settle a federal lawsuit accusing it of violating the federal False Claims Act. CEO Prem Reddy, a cardiologist, is to pay $3.25 million of the settlement himself.\nVIDEO: More Clayton County news\nTeachers and parents were just as excited as the students during a ribbon-cutting.\nAtlanta attorney Marlan Wilbanks on Friday praised the ruling and his firm’s client, Karin Berntsen, a Prime Healthcare nurse who alerted the government to her employer’s practices.\nBerntsen, who secretly recorded evidence supporting the case, accused the hospital of imposing quotas on admissions of Medicare patients and having executives question emergency room doctors for discharging patients instead of admitting them.\n“Employees were pressured to admit patients who were not sick enough to be put in the hospital and should have been discharged or placed in ‘observation’ status,” Wilbanks, a partner at Wilbanks & Gouinlock, said in a release.\n“Because of her courage, the government obtained damning evidence that supported the facts described in our complaint against Prime and its owner, Dr. Reddy,” he said.\nBerntsen will receive more than $17 million for bringing the case to the government’s attention.\nIn an email, Prime said there was no finding of “improper conduct or wrongdoing” by the company in the case.\n“Prime Healthcare will always support independent physicians who provide quality, compassionate care while fulfilling our mission to save hospitals, save jobs and save lives,” said Joel Richlin, deputy general counsel for Prime.\nPrime told the public that it was able to turn around distressed hospitals by investing in the facilities and maintaining emergency departments open and accessible to all, including the uninsured and poor, the government’s complaint said.\nBut Prime’s ploy, the government said, was to maximize revenue by admitting emergency room patients to the hospital when they didn’t need that level of care. The scheme allowed its hospitals to bill at the higher inpatient rates, while giving patients what may have been medically unnecessary care, according to the lawsuit.\n“Patients and taxpayers who finance health care programs such as Medicare deserve to know that doctors are making decisions solely based on medical need — and not based on a corporate desire to increase billings,” said Tracy Wilkison, First Assistant U.S. Attorney for the Central District of California, in a written statement.\nThe case involves Prime’s California hospitals and their practices from 2006 through September 2013.\nPrime stepped in at Southern Regional in 2015, when the 331-bed Riverdale hospital was continuing to lose money despite a $50 million taxpayer bailout. The sale was completed in 2016. Prime also acquired Spivey Station, an ambulatory care center in Jonesboro. The deal called for Prime to spend $50 million on equipment and improvements over five years.\nPrime is now one of the nation’s largest hospital systems, with 45 acute-care hospitals in 14 states.","url":"https://www.ajc.com/news/state--regional/clayton-hospital-owner-pay-million-fradulent-care-settlement/W5HvVtT5O2cZzOGASz03yJ/"}
