{"authors":[],"date_download":"2018-10-30 18:49:01","date_modify":"2018-10-30 18:49:01","date_publish":"2018-08-08 18:52:43","description":"Clayton County Commission stopped airing public comments after combative exchanges between residents and the board.","filename":"data/vaneerConsumption/Claytonsonaircommissionmeetingstoincludepubliccomments.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/08/Images/newsEngin.22729046_newsEngin.18019039_IMG_3114.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_c_4dda8bfc2531a59db721c7f9fbe430d3__1540925341.html","title":"Clayton's on-air commission meetings to include public comments","title_page":"Clayton's on-air commission meetings to include public comments","title_rss":"NULL","source_domain":"ajc.com","text":"The public comments portion of Clayton County Commission meetings once again will be televised.\nAlmost 20 months after pulling the plug on on-air comments by those attending meetings, the board voted 3-2 Tuesday to approve Commissioner Michael Edmondson’s proposal to bring remarks back to CCTV 23 — with a caveat.\nResidents will have to wait until commissioners have gone through their agenda to hear the public’s views.\nPublic comments previously were near the beginning of the agenda.\nThe move is a win for the Clayton residents who have complained about the Commission’s decision at almost every meeting since it made the change in February 2017, prompted by combative exchanges between residents and the board. Upset residents said they believed commissioners were trying to silence them, even though public comments remained a part of the body’s twice-a-month meetings.\nCommissioner Felicia Franklin Warner, who has been a champion for airing the comments, objected to moving comments to the agenda’s end.\n“I don’t recommend that because it does not give the citizens the ability to speak to what’s on the agenda,” Warner said.\nCommissioner Chairman Jeff Turner, who also rejected the change, agreed that the comments should stay at the beginning of the meeting. “That is only fair to our citizens,” he said. “We work for them, not the other way around.”","url":"https://www.ajc.com/news/local-govt--politics/clayton-air-commission-meetings-include-public-comments-again/ku0NEAEps63yfMkHKi4TCM/"}
