{"authors":["Stephen Johnson For Daily Mail Australia"],"date_download":"2018-10-23 00:57:32","date_modify":"2018-10-23 00:57:32","date_publish":"2017-04-26 10:59:38","description":"Feminist author Clementine Ford has launched an expletive-laden petition calling for Muslim ABC presenter Yassmin Abdel-Magied to be supported following her Anzac Day post.","filename":"data/vaneerConsumption/ClementineFordstartspetitionforYassminAbdelMagied.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9EF8AC00000578-0-image-a-25_1493201825522.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446804_Clementine-Ford-starts-petition-Yassmin-Abdel-Magied_1540256252.html","title":"Clementine Ford starts petition for Yassmin Abdel-Magied","title_page":"Clementine Ford starts petition for Yassmin Abdel-Magied | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Feminist author Clementine Ford has launched an expletive-laden petition calling for Muslim ABC presenter Yassmin Abdel-Magied to be supported following her Anzac Day post.\nThe ABC is standing by Ms Abdel-Magied despite two separate petitions, with a combined 29,000 signatures, and federal politicians calling for her to be sacked over the post that has been labelled 'disgraceful' and 'disgusting'.\nMs Abdel-Magied, who hosts Australia Wide on ABC News 24, apologised for her since deleted message which said: 'Lest . We. Forget. (Manus, Nauru, Syria, Palestine...).'\nMs Ford began her change.org petition describing those calling for Ms Abdel-Magied's sacking as 'd***heads'.\nScroll down for video\nFeminist Clementine Ford has inked together a petition defending Yassmin Abdel-Magied\nYassmin Abdel-Magied's original Facebook post which she deleted and apologised for\nYassmin Abdel-Magied is under fire for a petition politicising the Anzac Day message\n'Petitioning people who aren't d***heads: Yassmin Abdel-Magied is a dead-set legend,' it said.\n'She puts herself on the line and cops a lot of crap from racist bigots and Strayan d***heads.'\nShe went to say she had been 'hounded by hundreds of d***heads on Facebook many of whom are calling for her to be deported, stoned, beheaded. You know, all in the name of freedom'.\nMs Ford didn't cite any examples of these vile Facebook messages.\nHowever, she did acknowledge her petition, which has attracted 530 supporters, did not have a lot of support.\n'Yes, this is a meaningless petition - but so is the one circulating demanding the ABC fire her. (Very few signatures so far.) Send Yass some love by letting her know that you support her and recognise she deserves to be given a pony,' Ms Ford said.\nClementine Ford has used the word 'd***head' three times to defend Yassmin Abdel-Magied\nA petition started by conservative activist Avi Yemeni has attracted more than 8,600 supporters\nAnother petition started by Mark Klein has now attracted more than 20,000 since it was posted on Tuesday afternoon (when this screen shot was taken)\nSince Anzac Day, two petitions calling for Ms Abdel-Magied to be sacked from the ABC have received more than 29,000 signatures.\nOne by conservative activist Avi Yemeni has attracted 8,635 supporters while another change.org petition posted by Sydney man Mark Klein has amassed 20,387 signatures.\nOne Nation leader Pauline Hanson and federal Nationals MP George Christensen have both called for Ms Abdel-Magied to be sacked while Immigration Minister Peter Dutton and his Liberal colleague Eric Abetz have strongly condemned her post.\nClementine Ford uses the same expletive starting with 'd' to attack Yassmin Abdel-Magied's critics\nOne Nation leader Pauline Hanson says she is 'disgusted' with Yassmin Abdel-Magied\nAn ABC spokesman on Tuesday night explained why Ms Abdel-Magied was keeping her job, acknowledging how she had apologised and deleted the post.\n'Ms Abdel-Magied is a part-time presenter on the ABC program Australia Wide, introducing stories done by ABC reporters from around the country,' he said.\n'When presenting for the ABC she works in accordance with ABC editorial and other policies. Ms Abdel-Magied is also engaged in a range of other activities and work that is not related to the ABC.\n'Her views and opinions in that capacity are her own and do not represent those of the ABC.'\nYassmin Abdel-Magied travelled to the Middle East on a taxpayer-funded trip\nMs Abdel-Magied was a national finalist for Young Australian of the Year in 2015 for her work as a member of the Federal Anzac Centenary Commemoration Youth Working Group.\nIn February, another change.org petition calling for her sacking amassed more than 31,000 signatures after Ms Abdel-Magied told the national broadcaster's Q&A program that Islam is the 'most feminist religion' in a clash with Senator Jacqui Lambie.\nShe had also said sharia law to her was praying five times a day as a Muslim, neglecting to mention how it is also a legal system based on fundamentalist Islamic principles.\nAfter that TV appearance, it emerged she sought advice from Wassim Doureihi, a spokesman in Australia for Islamist extremist group Hizb-ut Tahrir, which is banned in Germany, The Netherlands and Muslim-majority nations including Bangladesh, Pakistan and even Saudi Arabia.","url":"https://www.dailymail.co.uk/news/article-4446804/Clementine-Ford-starts-petition-Yassmin-Abdel-Magied.html"}
