{"authors":["Lana Shadwick"],"date_download":"2018-10-30 19:55:42","date_modify":"2018-10-30 19:55:42","date_publish":"2016-07-18 13:33:19","description":"The president of the Cleveland Police Patrolmen’s Association said he is a “Second Amendment guy” but asks people who are protesting at the Republican National Convention to leave their guns at home.","filename":"data/vaneerConsumption/ClevelandPoliceUnionOpenCarryatRNCTakesAwayOurResources.json","image_url":"https://media.breitbart.com/media/2016/07/open-carry-cleveland-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_07_18__1540929342.html","title":"Cleveland Police Union: Open Carry at RNC Takes Away Our Resources","title_page":"Cleveland Police Union: Open Carry at RNC Takes Away Our Resources","title_rss":"NULL","source_domain":"breitbart.com","text":"The president of the Cleveland Police Patrolmen’s Association said he is a “Second Amendment guy” but asks people who are protesting at the Republican National Convention to leave their guns at home: “We will be watching you if you are carrying and this takes away our resources.”\nOhio permits citizens to open carry and protesters may do so outside of the convention “hard zone”. Cleveland police association president Steve Loomis argued, “It would be completely irresponsible and unreasonable to have two groups with different ideologies carrying weapons.”\nHe added, “It would be very easy to get very close to people posing as a Second Amendment guy.” The police union president said he has told anyone who will listen that he “does not want anyone to be mistaken as a bad guy.”\nThe New Black Panthers have announced that they are going to protest in Cleveland and say they are going to carry arms when they do so.\nAs reported by Breitbart Texas, Micah Xavier Johnson, the sniper who killed five officers in Dallas and wounded seven others, was a member of the Houston New Black Panther Party.\nLoomis explained that if officers are observing those who are carrying weapons, “we will not be able to look for the guy who isn’t.”\nThe GOP convention and the hard zone around the convention area has been designated a gun-free zone. As reported by Breitbart Texas’ Bob Price, the Secret Service announced in late March that guns will not be allowed at the convention site.\nSome of the participants in the Black Lives Matter protest in Dallas on the night of the execution of the Dallas police officers were openly carrying weapons during the protest. At least one who was carrying a weapon was named as a person of interest and his photo was widely circulated on social media by the Dallas Police Department. The black man wearing a camouflage shirt gave law enforcement officers his AR-15 rifle after the shooting began. He did not want to be mistaken as the shooter, and he did not want anyone to mistakenly think his weapon had been fired.\nWFAA8 News in Dallas reported that the man’s lawyers expressed condolences for all the officers killed and wounded but said they are examining his legal options. They say they believe there was a gross violation of his civil rights.\nAs reported by AWR Hawkins, Ohio Governor John Kasich has rejected any call by law enforcement officials to suspend the right to open carry in Ohio. A statement provided by the Governor’s office said, “Ohio governors do not have the power to arbitrarily suspend federal and state constitutional rights or state laws as suggested.”\nLana Shadwick is a contributing writer and legal analyst for Breitbart Texas. She has served as a prosecutor and associate judge in Texas. Follow her on Twitter @LanaShadwick2.","url":"https://www.breitbart.com/border/2016/07/18/cleveland-police-union-open-carry-rnc-takes-away-resources/"}
