{"authors":["Matt Hunter For Mailonline"],"date_download":"2018-10-23 00:03:11","date_modify":"2018-10-23 00:03:11","date_publish":"2016-01-29 12:46:16","description":"Cleveland officers attended the scene to find a man wearing a tank top within the cordoned off area shining a torch on the ground.","filename":"data/vaneerConsumption/Clevelandmurderscenecopcapturesmanposingasadetective.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B1513000000578-0-image-a-49_1454069526922.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422625_If-detective-wearing-school-crossing-badge-Bizarre-moment-cop-s-body-cam-captures-man-posing-detective-Cleveland-murder-scene_1540252991.html","title":"Cleveland murder scene cop captures man posing as a detective","title_page":"Cleveland murder scene cop captures man posing as a detective | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mills said he was\nOfficers had no record of a detective Mills working for them\nHe held out his school crossing badge as proof of identity\nOfficers have released a video taken on a body camera showing a man posing as a detective at the scene of a murder in America.\nCleveland officers attended the scene to find a man wearing a tank top within the cordoned off area shining a torch on the ground.\nPolice from Warrensville Heights asked the man, William Mills, to state who he was and what he was doing.\nHe replied and said he was a detective working for the police department.\nThe officer asks: 'What are you doing here?' Mills answers: 'Detective.'\nOfficer then says: 'And you work for Warrensville Heights police department as a detective?' Mills: 'Yes, I do.'\nOfficer: 'And you've got a school guard crossing badge on you?' Mills: 'Yes, I do.'\nOfficer finally asks: 'Why do you have a school guard crossing badge if you're a detective?'\nCleveland Police found Mills had no connection to Warrensville Heights Police and he was arrested at the scene near East 150th and Harvard in Cleveland in June.\nInvestigators had been there following up on the murder of Michael Kidd, 20. He had been shot multiple times.\nMills claiming to be a detective at the scene of a murder in Cleveland - he admitted carrying a school crossing patrol card as his identification\nOfficers checked their records and found no one from Warrensville Heights police force with the name 'William Mills'\nMills was then arrested for impersonating a police officer and taken away, he later said he was only honoring a detective friend who died\nMills went to court for his arrest and he entered into a special program for low-level offenders and had his record for this case wiped clean.\nFox8 reported they had no answer at his house and he didn't return calls from journalists.\nA police report shows when police questioned Mills later he told them he knew an officer who had passed away, and Mills wanted to go to the crime scene in his honor.","url":"https://www.dailymail.co.uk/news/article-3422625/If-detective-wearing-school-crossing-badge-Bizarre-moment-cop-s-body-cam-captures-man-posing-detective-Cleveland-murder-scene.html"}
