{"authors":["Laurel Rosenhall","Dan Morain","Julie Cart","Guest Commentary"],"date_download":"2018-10-31 00:12:37","date_modify":"2018-10-31 00:12:37","date_publish":"2016-08-03 08:00:00","description":"Gov. Jerry Brown has taken the national stage to tout California’s fight against global warming, telling cheering throngs at the Democratic National","filename":"data/vaneerConsumption/ClimateretreatLegislaturecouldditchplantoradicallycutemissions.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/GreenhouseGasPhotoEricDemarcq-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944757.html","title":"Climate retreat? Legislature could ditch plan to radically cut emissions","title_page":"Climate retreat? Legislature could ditch plan to radically cut emissions | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Gov. Jerry Brown has taken the national stage to tout California’s fight against global warming, telling cheering throngs at the Democratic National Convention that the state has “the toughest climate laws in the country.” Yet inside the state Capitol, the fate of the policy’s centerpiece—legislation to drastically reduce greenhouse gas emissions—is in peril.\nOne ominous sign: Brown on Thursday opened a fundraising committee, taking the first step toward putting an environmental initiative on the 2018 ballot in case the bill fails in the Legislature.\nFailure was already a looming threat, with Assembly Speaker Anthony Rendon saying earlier in the week that “it’s not imperative” the bill clear his house this year.\n“We just want to make sure that if we’re going to set something up for the long term, that we get it right,” said Rendon (D-Paramount), who has a background as an environmentalist but rose to speaker this year with support from a powerful bloc of business-friendly Democrats.\nSenate Bill 32 had been shaping up as the biggest fight lawmakers faced in what remains of the legislative year. It pits environmentalist Democrats, mostly from the state’s more prosperous coastal areas, against Democrats and Republicans from struggling inland areas who side with oil companies and other businesses, and whose constituents could be harder hit by rising energy prices.\nThe bill, which sets ambitious targets to cut planet-warming emissions by 2030, faces a critical deadline with the Legislature set to wrap up for the year on Aug. 31. Brown’s office expressed support for the bill’s goal while signaling that it might not get done this month.\n“We are going to extend our climate goals and cap-and-trade program – one way or another,” Brown aide Nancy McFadden wrote in a statement. “The Governor will continue working with the Legislature to get this done this year, next year or on the ballot in 2018.”\nSen. Fran Pavley—the Agoura Hills Democrat widely regarded as an environmental champion—authored SB 32 to build on a pioneering climate change agenda the Legislature enacted a decade ago, when it passed her Assembly Bill 32. That bill set targets for reducing greenhouse gas emissions by 2020 and led to California’s cap-and-trade system, which limits how much climate-warming gas businesses can emit while allowing them to buy and sell permits to pollute.\nCap and Trade in Two and a Half Minutes\nPavley, now serving her last year in the Legislature, wants to extend the approach further into the future. But the Legislature has changed a lot since her earlier bill passed in 2006—no one currently in the Assembly was in office then—and the lower house rejected SB 32 last year amid intense lobbying by the oil industry.\nFailure again this month would indicate a major about-face for the California Legislature, reversing course on the environmental leadership role that Brown routinely boasts of in national and international appearances. It would also mark defeat for Pavley, a maverick in the war on global warming who is leaving the Capitol because of term limits.\n“It’s really not about me,” she said earlier in the week, but about the Legislature’s commitment to keep combatting climate change.\n“This should be easier to pass this year than it was 10 years ago, because now we can show that putting a cap on emissions and rolling it back does send signals for investment (in clean energy businesses). And we’re seeing those new jobs here in California. We have success stories to tell but the challenge has been that the Assembly, of course, hasn’t been paying close attention because they weren’t here.”\nCalifornia’s Emissions, Population and Economic Growth\nHer effort is backed by a big advertising push from environmental groups. NextGen Climate, headed by San Francisco billionaire Tom Steyer, is spending $1.2 million to air television ads around the state criticizing oil companies for “trying to weaken our clean air laws.” The California League of Conservation Voters has launched a social media campaign urging voters to contact Democrats who helped defeat SB 32 last year.\n“We saw what happened last year,” said spokeswoman Jenesse Miller, “so this year going in we knew we were going to have to ask those lawmakers to do the right thing and vote the way their constituents want.”\nCampaign for SB 32 Environmentalists are waging a Twitter campaign targeting lawmakers by name.\nRecent polling found that a majority of Californians support reducing greenhouse gas emissions, even if it means paying more for gas and electricity.\nBut businesses that use lots of electricity say their costs have already gone up too much—and they fear SB 32 will trigger continual increases without enough oversight from legislators.\n“When we’re moving from 2020 to 2030, we need to understand what the policies are going to be that will be available to be used,” said Dorothy Rothrock, president of the California Manufacturers and Technology Association, which opposes the bill. “With simply a goal with nothing else attached to it, it’s throwing it all over to (the Air Resources Board) to do whatever they want to do.”\nThat board, largely made up of Brown appointees and beyond the Legislature’s control, is already at work on a Plan B—drafting rules that could act as a back-up for Brown’s environmental agenda in case SB 32 withers. But environmentalists want the state’s climate policy to have the political backing of the Legislature, knowing that it’s hard to reverse a law. If the policy is carried out simply as the go-it-alone work of a governor who will leave office in two years, it could be undone, or face a legal challenge.\nAnd the board’s work to require emissions cuts and continue cap and trade—along with a Chamber of Commerce lawsuit asserting that cap and trade is an illegal tax—could also stymie climate policy action in the Legislature. Dean Florez, a former state lawmaker who now sits on the air board, said he’s talked to lawmakers who feel less pressure to vote for a controversial bill because the governor is pursuing his agenda without them.\n“They are ‘sitting pretty’ because they can say the Governor has spoken and the courts will ultimately decide and thus there’s no hurry to act on SB 32 now,” Florez said by text message.\nThese Democrats “can have their cake and eat it too,” he wrote. “They get to say they are with the Governor AND with the oil companies.”\nThursday’s statement from Brown’s aide emphasized California’s leading role in curbing carbon pollution and “our dangerous addiction to oil.”\n“That’s why we can’t buy into the fallacy that a vote on any single measure over the next 27 days will make or break our climate agenda. We will not play into the hands of oil companies by telegraphing our strategy or settle for measures that weaken, undermine or diminish our world-leading climate programs,” McFadden wrote.\nPavley was not available to comment following the announcement from Brown’s office. Earlier this summer she had been trying to rescue her bill by working with new allies. One of those is Assemblyman Eduardo Garcia, a Coachella Democrat who did not support SB 32 last year. The two got to know each other during the global climate negotiations in Paris last year.\nNow, Garcia is carrying a bill to give legislators more oversight of the Air Resources Board, and it is linked to Pavley’s emissions reductions bill—each one can only pass if the other one does too. The alliance illustrates how Pavley is working to win over previous opponents, particularly Democrats who represent people in struggling inland areas who could be hit harder by rising gas and electricity prices.\n“The goal is to be more encompassing of California’s economically disadvantaged communities,” Garcia said of his bill. “I think it is a piece of the puzzle in order to get people closer to supporting Senate Bill 32.”\nAnother puzzle piece: money.\nAssemblyman Jim Cooper, an Elk Grove Democrat who leads the caucus of moderate Democrats, argues that too many incentives for solar panels and electric vehicles have gone to California’s wealthy enclaves. “Take care of the poor people first,” he said.\nDemocrats who objected to SB 32 last year could be persuadable if, say, their districts get new money for environmental projects. And it just so happens the state is sitting on $1.4 billion from cap-and-trade auctions—money that legally must be spent on projects that reduce emissions.\nThis story was updated at 5:16 p.m. to reflect the announcement from the office of Gov. Jerry Brown.","url":"https://calmatters.org/articles/climate-retreat-legislature-could-ditch-plan-to-radically-cut-emissions/"}
