{"authors":["Penny Starr"],"date_download":"2018-10-30 18:09:14","date_modify":"2018-10-30 18:09:14","date_publish":"2018-09-13 00:17:45","description":"Climate change zealots are using the approaching Hurricane Florence as a way to advance the case for manmade global warming.","filename":"data/vaneerConsumption/ClimateChangeZealotsEmbraceHurricaneFlorenceasthePerfectStorm.json","image_url":"https://media.breitbart.com/media/2017/04/climate.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_09_12__1540922954.html","title":"Climate Change Zealots Embrace Hurricane Florence as the Perfect Storm","title_page":"Climate Change Zealots Embrace Hurricane Florence as the Perfect Storm","title_rss":"NULL","source_domain":"breitbart.com","text":"While most people who live along the southeastern coast of the United States are packing up and heading for higher ground ahead of an expected landfall of Hurricane Florence as early as Thursday, climate change zealots see the potentially devastating storm as an opportunity to advance the idea of manmade global warming.\nA Google search of “Hurricane Florence and climate change” yielded almost 45 million results.\nOne site that pops up in the search is National Public Radio (NPR), the left-wing, taxpayer-funded news outlet that regularly promotes the idea of manmade climate change.\n“Slow-moving storms like Harvey are getting more common. A study published earlier this year by Kossin found that tropical cyclones around the world have slowed down 10 percent in the past 70 years,” NPR reported.\n“We’re seeing that in every ocean basin except the northern Indian Ocean,” James Kossin, an atmospheric scientist for the National Oceanic and Atmospheric Administration (NOAA) and the University of Wisconsin, Madison, said in the NPR report.\n“Possibly because climate change is causing the wind currents that hurricanes ride to slow down,” NPR reported. “If Florence slows down and stalls when it hits land, it will be the latest example of that trend.”\nNPR also spoke to Kevin Trenberth of the National Center for Atmospheric Research in Boulder, Colo.\n“We have global warming, and so this actually makes these storms bigger and more intense,” Trenberth said.\nHumans are to blame for this because we use fossil fuels for our cars, use power plants to make our lives comfortable and fly in airplanes — all acts that allegedly warm the ocean, which fuels hurricanes like Florence.\nThe Baltimore Sun editorial board hopes Hurricane Florence will “reshape the climate change debate.” The editorial, published on Tuesday, slams the Trump administration’s efforts to reverse burdensome Environmental Protection Agency’s (EPA) regulations that hurt Americans and their livelihoods.\nThe editorial also praises the man responsible for those regulations.\nAs Hurricane Florence, fed by unusually warm ocean waters, closes in on the East Coast and millions flee the Carolina shores for safer ground, what a great time for the U.S. Environmental Protection Agency to be relaxing the rules for one of the most potent greenhouse gases of all. Well, at least somebody in the Trump administration must think so because the EPA is reportedly on the verge of announcing its plans to make it easier for energy companies to release methane into the atmosphere. The rollback is specifically aimed at what should be the most inexcusable of leaks — those coming from oil and gas wells that sometimes vent excess methane or “flare” by burning the gas. Under President Barack Obama, the EPA developed the regulations as part of a broader campaign to fight climate change. Scientists say methane, as a greenhouse gas, is about 25 times more potent than carbon dioxide. But oil and gas companies said fixing methane leaks in a timely manner was burdensome. Naturally, the Trump administration agreed.\nWhile the editorial board admits that the hurricane isn’t “entirely a product of climate change” and that severe weather has existed for eons before fossil fuels were used, “it is safe to say that climate change is a major reason why Florence may be bigger and stronger and why there are likely to be more such monster storms in our future.”\n(Note: Despite these kinds of predictions, before last year’s hurricane season, no major storm has hit the United States since 2008, according to the National Oceanic and Atmospheric Administration (NOAA).)\nThe editorial also slams Trump for withdrawing the U.S. for the Paris climate agreement.\nAnd in perhaps the most zealous climate change report out there, CBS blamed North Carolina — which weather officials say is in the direct path of what could be a Category 3 storm when it makes landfall — for damage Hurricane Florence might inflict.\nNorth Carolina could find itself more vulnerable to damage from storms like Hurricane Florence due to a state law passed six years ago that banned using recent climate science to plan for the consequences of rising sea levels. Climate scientists had warned for years that North Carolina’s low-lying coast left it open to intensifying floods and hurricanes that could cost the state billions of dollars in damage, declining property values and lost recreation and tourism near the end of the 21st century. Climate scientists have also projected that rises in sea levels will make coastal storms more damaging, since more water will flood land. But in 2012, state lawmakers responded by saying these studies could not be used for forecasts, arguing that the science wasn’t solid enough to justify laws that could change property values. A Republican-led legislature pushed a bill that said projections for rising sea levels could only be based on historical data, rather than newer studies predicting problems for the future.\nBut the author of the bill — demonized by CBS — said she believed the climate change model used for the recommendations to the state was “the most extreme in the world.”\n“They need to use some science that we can all trust when we start making laws in North Carolina that affect property values on the coast,” State Rep. Pat McElraft said during a floor debate on the bill, according to CBS.\nFollow Penny Starr on Twitter","url":"https://www.breitbart.com/politics/2018/09/12/climate-change-zealots-embrace-hurricane-florence-as-the-perfect-storm/"}
