{"authors":["John Hayward"],"date_download":"2018-10-30 18:51:35","date_modify":"2018-10-30 18:51:35","date_publish":"2015-02-25 22:08:26","description":"A scientist gets the message: Stop questioning climate change. Intimidation is the new scientific method, apparently. |","filename":"data/vaneerConsumption/ClimateScientistTargetedByDemocratsForGlobalWarmingApostasy.json","image_url":"https://media.breitbart.com/media/2015/02/Occupy-Wall-Street-Climate-Protest-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_02_25__1540925495.html","title":"Climate Scientist Targeted By Democrats For Global-Warming Apostasy","title_page":"Climate Scientist Targeted By Democrats For Global-Warming Apostasy | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Dr. Roger Pielke Jr. of the University of Colorado has published a lengthy blog post about his “investigation” by Rep. Raul Grijalva (D-AZ) of the House Natural Resources Committee. The post sheds further light on the remarkable similarity between “climate science” and good old-fashioned witch hunting.\nThe new scientific method involves intimidating skeptics into silence, until only an unchallenged “consensus” remains. (The global climate has sadly refused all such efforts at intimidation, stubbornly refusing to do anything the Church of Global Warming predicted it would do, but evidently that’s not much of a problem for the new politicized “science” if everyone is afraid to talk about it.)\nPielke is a great believer in clearing the pollutants of politics from the atmosphere of science, so you can see why politicized science would want him burned at the stake (with all due precautions against the release of atmospheric carbon that would entail, of course.)\nHe wrote a well-reviewed book called “The Climate Fix: What Scientists and Politicians Won’t Tell You About Global Warming,” in which he presents measured skepticism of climate-change orthodoxy – for example, he believes the role of carbon emissions from human industry is greatly exaggerated by politicized science, but he doesn’t think human carbon emissions are irrelevant, and is not implacably hostile to the goal of reducing them. He criticizes politicians for over-simplifying enormously complex systems and exaggerating the beneficial effects of their centrally-planned solutions.\nEvidently his mortal sin against the Climate Cult was pointing out that human-caused climate change is not inflicting greater economic damage due to extreme weather, an empirical truth that cuts against one of the most sacred dogmas of politicized science. (How can the Little People be terrorized into giving up control over their lives, unless they think their actions are causing spectacular and destructive weather events? The face of the Angry Sky Gods is not easily seen in miniscule local temperature variations that scarcely register on sensitive instruments.) He has a recent book devoted to that argument, “The Rightful Place of Science: Disasters & Climate Change.”\nWith the cultists very excited about the prospect of hounding skeptics from the public square by accusing them of secret allegiance to Demon Oil and its evil petro-dollars, Pielke found himself targeted by Rep. Grijalva, who is essentially prosecuting him for the crime of saying something inconvenient that even the grand poobahs of global warming at the Intergovernmental Panel on Climate Change at the United Nations admit is true:\nAs some of you will already know, I am one of 7 US academics being investigated by US Representative Raúl Grijalva (D-AZ) who is the ranking member of the House of Representatives Committee on Environment and Natural Resources. Rep. Grijalva has sent a letter to the president of my university requesting a range of information, including my correspondence, the letter is here in PDF. Before continuing, let me make one point abundantly clear: I have no funding, declared or undeclared, with any fossil fuel company or interest. I never have. Representative Grijalva knows this too, because when I have testified before the US Congress, I have disclosed my funding and possible conflicts of interest. So I know with complete certainty that this investigation is a politically-motivated “witch hunt” designed to intimidate me (and others) and to smear my name. For instance, the Congressman and his staff, along with compliant journalists, are busy characterizing me in public as a “climate skeptic” opposed to action on climate change. This of course is a lie. I have written a book calling for a carbon tax, I have publicly supported President Obama’s proposed EPA carbon regulations, and I have just published another book strongly defending the scientific assessment of the IPCC with respect to disasters and climate change. All of this is public record, so the smears against me must be an intentional effort to delegitimize my academic research.\nI must admit I find myself in strong disagreement with Dr. Pielke about the wisdom of these measures, being an out-and-proud unreconstructed climate skeptic myself, but it would never occur to me to hound him off the public stage or target him with intimidating government investigations. I’ve got some very old-fashioned ideas about how “science” and “debate” are supposed to work.\nAs Pielke goes on to observe, the “crime” that brought this “investigation” to bear was saying something true – “it is incorrect to associate the increasing costs of disasters with the emission of greenhouse gases” – and being a prominent scientist while doing it. It’s great that congressional Democrats have time for this sort of thing, isn’t it? They’re worse than useless when it comes to the IRS abusing its power against American citizens, the Department of Veterans Affairs turning into a horror show, the Administration lying about a deadly attack on a U.S. consulate, or the Justice Department running guns into Mexico, but they’ve got plenty of time and resources to crack down on uppity climate scientists.\nThe media’s all over this abuse of government power, right? Not so much, says Pielke: “So far, I have been contacted by only 2 reporters at relatively small media outlets. I’d say that the lack of interest in a politician coming after academics is surprising, but to be honest, pretty much nothing surprises me in the climate debate anymore. Even so, there is simply no excuse for any reporter to repeat incorrect claims made about me, given how easy I am to find and just ask.”\nThere might not be any excuse for it, Dr. Pielke, but there certainly are reasons. Come have a few sustainable, renewable drinks with the Vast Right-Wing Conspiracy sometime, and we’ll compare notes on how modern “journalism” works.\nThe sad epilogue to the story is that the intimidation tactics worked; Pielke has concluded that participating in the climate debate is more trouble than it’s worth. “The incessant attacks and smears are effective, no doubt, I have already shifted all of my academic work away from climate issues,” he writes. “I am simply not initiating any new research or papers on the topic and I have ring-fenced my slowly diminishing blogging on the subject. I am a full professor with tenure, so no one need worry about me – I’ll be just fine as there are plenty of interesting, research-able policy issues to occupy my time. But I can’t imagine the message being sent to younger scientists. Actually, I can: ‘when people are producing work in line with the scientific consensus there’s no reason to go on a witch hunt.'” (There’s a long story behind that Orwellian quote, which Pielke provided a link to.)\nOld Science was all about challenging theories. New Science is pure politics, and the worst sort of politics at that: victory not through persuasion or proof, but the suppression of dissent. It works, so we’ll get more of it, and that’s a scientific fact.","url":"https://www.breitbart.com/politics/2015/02/25/climate-scientist-targeted-by-democrats-for-global-warming-apostasy/"}
