{"authors":["Press Association"],"date_download":"2018-10-22 23:56:56","date_modify":"2018-10-22 23:56:56","date_publish":"2016-01-28 13:14:29","description":"Government advisers have repeated calls for a 57% cut in UK greenhouse gases by 2030 in the wake of a new global climate deal. The Committee on Climate Chang...","filename":"data/vaneerConsumption/Climatedealpromptsrepeatcallfor57cutinukgreenhousegasesby2030.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-f6a7b9ac-dbf9-4f18-9aa9-b8bc0c190909-4vVdYopwYQ7f641721b07ad9a4bf-292_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420762_Climate-deal-prompts-repeat-call-57-cut-UK-greenhouse-gases-2030_1540252616.html","title":"Climate deal prompts repeat call for 57% cut in uk greenhouse gases by 2030","title_page":"Climate deal prompts repeat call for 57% cut in uk greenhouse gases by 2030 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Climate deal prompts repeat call for 57% cut in UK greenhouse gases by 2030\nGovernment advisers have repeated calls for a 57% cut in UK greenhouse gases by 2030 in the wake of a new global climate deal.\nThe Committee on Climate Change said its advice on cutting emissions for the period 2028-2032 was the \"minimum level of UK ambition necessary\" in light of the Paris Agreement - the global deal to avoid dangerous climate change agreed late last year.\nAnd after the Government abruptly cancelled a £1 billion competition to develop technology to capture and store underground emissions from power stations, the committee warned there was a need to \"urgently\" come up with a new approach to the sector.\nThe Paris Agreement committed countries to curbing global temperature rises\nIn a letter to Energy and Climate Change Secretary Amber Rudd, the committee warned meeting long-term UK targets to cut climate emissions would be twice as expensive without the \"carbon capture and storage\" (CCS) technology.\nThe Paris Agreement, negotiated in December, committed countries to curbing global temperature rises to well below 2C above pre-industrial levels, pursue efforts to limit them to 1.5C, and reduce net emissions to zero in the second half of the century.\nIt is more ambitious in its calls for zero-net emissions - needed to stabilise temperatures - than the UK's Climate Change Act, which requires the country to reduce its greenhouse gases by 80% by 2050.\nBut as European targets and those of other countries have not changed, the existing recommendation for the fifth \"carbon budget\" for 2028 to 2030, which equates to a 57% cut by 2030, is sufficient, the Committee on Climate Change said.\nThe Government will need to set new policies and plans for tackling climate change during this Parliament to meet its targets, the committee said, and a tighter budget may be needed in the future.\nThe latest advice comes after the Government admitted it was falling further behind on efforts to meet the fourth carbon budget, which covers the mid-2020s.\nThe committee called for steps including extending funding for green electricity - paid for on consumer bills - beyond 2020 to cut emissions from the power sector, boosting low-carbon heating in buildings and maintaining support for electric vehicles.\nAnd it said ministers must urgently develop a new approach to carbon capture and storage in the UK.\nSpeaking to the parliamentary Liaison Committee earlier this month, Prime Minister David Cameron said the Government had cancelled the £1 billion CCS scheme because it was too expensive, costing around £170 per megawatt hour (MWh) of power.\nBut the Committee on Climate Change said its plans for cost-effective ways to meet the emissions cuts targets included CCS, with costs expected to fall from £150-£170 MWh for the first scheme to £100 MWh with more deployment.","url":"https://www.dailymail.co.uk/wires/pa/article-3420762/Climate-deal-prompts-repeat-call-57-cut-UK-greenhouse-gases-2030.html"}
