{"authors":["James Delingpole"],"date_download":"2018-10-30 19:33:30","date_modify":"2018-10-30 19:33:30","date_publish":"2015-10-03 01:16:24","description":"Climate Alarmist Caught in 'Largest Science Scandal in U.S. History'","filename":"data/vaneerConsumption/ClimateAlarmistLargestScienceScandalinUSHistory.json","image_url":"https://media.breitbart.com/media/2015/10/GettyImages-globalwarming.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_02__1540928010.html","title":"Climate Alarmist 'Largest Science Scandal in U.S. History'","title_page":"Climate Alarmist 'Largest Science Scandal in U.S. History'","title_rss":"NULL","source_domain":"breitbart.com","text":"The plan by climate alarmists to have other scientists imprisoned for their ‘global warming’ skepticism is backfiring horribly, and the chief alarmist is now facing a House investigation into what has been called “the largest science scandal in US history.”\nRep. Lamar Smith, Chairman of the House Committee on Space, Science and Technology, has written to Professor Jagadish Shukla of George Mason University, in Virginia, requesting that he release all relevant documents pertaining to his activities as head of a non-profit organization called the Institute of Global Environment And Society.\nSmith has two main areas of concern.\nFirst, the apparent engagement by the institute in “partisan political activity” – which, as a non-profit, it is forbidden by law from doing.\nSecond, what precisely has the IGES institute done with the $63 million in taxpayer grants which it has received since 2001 and which appears to have resulted in remarkably little published research?\nFor example, as Watts Up With That? notes, a $4.2 million grant from the National Science Foundation to one of the institute’s offshoots appears to have resulted in just one published paper.\nBut the amount which has gone into the pockets of Shukla and his cronies runs into the many hundreds of thousands of dollars. In 2013 and 2014, for example, Shukla and his wife enjoyed a combined income in excess of $800,000 a year.\nSteve McIntyre, the investigator who shattered Michael Mann’s global-warming ‘Hockey Stick’ claim, has done a detailed breakdown of the sums involved. He calls it Shukla’s Gold.\nIn 2001, the earliest year thus far publicly available, in 2001, in addition to his university salary (not yet available, but presumably about $125,000), Shukla and his wife received a further $214,496 in compensation from IGES (Shukla -$128,796; Anne Shukla – $85,700). Their combined compensation from IGES doubled over the next two years to approximately $400,000 (additional to Shukla’s university salary of say $130,000), for combined compensation of about $530,000 by 2004. Shukla’s university salary increased dramatically over the decade reaching $250,866 by 2013 and $314,000 by 2014. (In this latter year, Shukla was paid much more than Ed Wegman, a George Mason professor of similar seniority). Meanwhile, despite the apparent transition of IGES to George Mason, the income of the Shuklas from IGES continued to increase, reaching $547,000 by 2013. Combined with Shukla’s university salary, the total compensation of Shukla and his wife exceeded $800,000 in both 2013 and 2014. In addition, as noted above, Shukla’s daughter continued to be employed by IGES in 2014; IGES also distributed $100,000 from its climate grant revenue to support an educational charity in India which Shukla had founded.\nThe story began last month when, as we reported at Breitbart, twenty alarmist scientists – led by Shukla – wrote a letter to President Obama urging him to use RICO laws to crush climate skeptics.\nShukla’s second big mistake was to send the letter not from his university address but from his non-profit, the IGES.\nBut his first, far bigger mistake, was his hubris in organizing the letter in the first place. It drew the attention of Shukla’s critics to something which, presumably, he would have preferred to keep secret: that for nearly 14 years, he, his family and his friends have been gorging themselves on taxpayers’ money at IGES; and that this money comes on top of the very generous salary he receives for doing much the same work at George Mason University (GMU).\nIt’s the latter detail which has led former Virginia State Climatologist Pat Michaels – one of the skeptics who might have been affected by Shukla’s proposed RICO prosecutions – to describe this as “the largest science scandal in US history.”\nUnder federal law, state employees may not be remunerated for doing work which falls under their state employee remit. As a Professor at GMU, Shukla is definitely an employee of the state. And the work for which he has most lavishly been rewarding himself at IGES appears to be remarkably similar to the work he does at GMU as professor of climate dynamics.\nIf GMU was aware of these extra-curricular payments, then it was in breach of its own policy on “financial conflicts of interest in federally funded research.”\nIf it wasn’t aware of them, then, Shukla legally may be required to send half of that $63 million in federal grants to his employer, GMU.\nFor many readers, though, perhaps the biggest take-home message of this extraordinary story is: Who do these climate alarmists think they are?\nPerhaps $63 million in federal grants is just peanuts if you’re gorging on the climate-change smorgasbord, but for most of the rest of us, that constitutes a serious sum of money. Especially when we know it is being taken from us in the form of taxes.\nDo they really feel under no obligation to spend it well?\nDo they actually feel so sanctified by the rightness of their cause that they deserve to be immune from scrutiny or criticism?","url":"https://www.breitbart.com/politics/2015/10/02/climate-alarmist-caught-largest-science-scandal-u-s-history/"}
