{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 19:14:07","date_modify":"2018-10-30 19:14:07","date_publish":"2016-11-23 03:07:31","description":"During the weeks before the final day of the campaign, both the Clinton camp and the media attacked Donald Trump for refusing to say he would | Politics","filename":"data/vaneerConsumption/ClintonCampaignLookingintoChallengingOutcomeofElectiontoUnderminetheVote.json","image_url":"https://media.breitbart.com/media/2016/11/Hillary-Justin-Sullivan-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_11_22__1540926847.html","title":"Clinton Campaign Looking into Challenging Outcome of Election to Undermine the Vote","title_page":"Clinton Campaign Looking into Challenging Outcome of Election to Undermine the Vote | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"During the weeks before the final day of the campaign, both the Clinton camp and the media attacked Donald Trump for refusing to say he would automatically accept the outcome of the vote on Election Day. But now Clinton’s campaign chief is taking meetings with groups urging him to do just that by considering a challenge to the final vote in several of the key states that gave Trump the White House.\nReports from several sources revealed on November 22 that Clinton campaign chief John Podesta was taking meetings with a group claiming it had discovered “irregularities” in several counties of some of the states that Trump won.\ngroup of prominent academics & election lawyers held conference call w/ Podesta and Elias last week lobbying recounthttps://t.co/EnHq9woAcw — Gabriel Sherman (@gabrielsherman) November 22, 2016\nApparently a “group of prominent computer scientists and election lawyers” met with Podesta to express their belief that they “found persuasive evidence that results in Wisconsin, Michigan, and Pennsylvania may have been manipulated or hacked,” according to New York magazine.\nThe academics presented findings showing that in Wisconsin, Clinton received 7 percent fewer votes in counties that relied on electronic-voting machines compared with counties that used optical scanners and paper ballots. Based on this statistical analysis, Clinton may have been denied as many as 30,000 votes; she lost Wisconsin by 27,000.\nIn order to overturn the election, these challenges would have to succeed in multiple counties and multiple states all at the same time to swing the Electoral College to Clinton, so it certainly seems like a desperate long shot.\nIt is such a long shot that even the left’s favorite numbers guru, Nate Silver, essentially dismissed the effort.\nTo follow: some *very* quick analysis which suggests the claim here of rigged results in Wisconsin is probably BS: https://t.co/SYlE76bnmQ — Nate Silver (@NateSilver538) November 23, 2016\nAnother Nate, Nate Cohn of The New York Times, called this forlorn hope incredibly “weak.”\nIt's hard to stress how weak this is. https://t.co/H3xSvrHT8y — Nate Cohn (@Nate_Cohn) November 22, 2016\nNaturally, many liberals on Twitter are all excited over the idea of a challenge to the election results. Some of the replies to Gabriel Sherman’s Tweet on the matter are revealing.\n@gabrielsherman Hillary has expert legal and technology professionals to make her case. Go for it. Please. — Elaine Taylor (@JessesLaw) November 22, 2016\n@gabrielsherman Please Lord Jesus, let this come to pass… — Maggie 4NoH8 (@Maggie4NoH8) November 23, 2016\n@gabrielsherman @HitsandMisses @intelligencer all norms have been thrown out the window- peaceful transfer of power should no longer exist — mechelle young (@ebonieyes4u) November 22, 2016\n@gabrielsherman @MalcolmNance Don't understand the reluctance. This is a \"clear and present danger\" scenario. What are they afraid of? — Baka Karasu 馬鹿 八咫烏 (@BakaKarasu) November 22, 2016\nBut these are exactly the attitudes and actions for which liberals excoriated Donald Trump when he merely hinted at trying — actions he never directly said he would take.\nDuring the final presidential debate in October, Fox News moderator Chris Wallace asked Trump if he’d accept the results of the election no matter what they were. But Trump demurred, causing a chorus of Democrats and members of the Old Media Complex to condemn the GOP nominee.\nAfter the debate, the media erupted in attacks calling Trump a “destroyer” of our democracy. The Clinton campaign even insisted that filing any challenges to the election was somehow contrary to American political tradition.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com.","url":"https://www.breitbart.com/politics/2016/11/22/clinton-campaign-looking-into-challenging-outcome-of-election-to-undermine-the-vote/"}
