{"authors":["Jerome Hudson"],"date_download":"2018-10-30 21:46:29","date_modify":"2018-10-30 21:46:29","date_publish":"2016-07-31 14:32:38","description":"\"Clinton Cash,\" the groundbreaking documentary film exposing the Clinton Foundation’s global corruption, has been viewed more than 2 million times in the opening week of its global online premiere. | Entertainment","filename":"data/vaneerConsumption/ClintonCashMovieViewedOver2MillionTimesinOpeningWeek.json","image_url":"https://media.breitbart.com/media/2016/07/Clinton-Cash-poster-bw.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_07_31__1540935989.html","title":"'Clinton Cash' Movie Viewed Over 2 Million Times in Opening Week","title_page":"'Clinton Cash' Movie Viewed Over 2 Million Times in Opening Week | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Clinton Cash, the groundbreaking documentary film exposing the Clinton Foundation’s global corruption, has been viewed more than 2 million times in the opening week of its global online premiere.\nViews of the film on Breitbart News’ YouTube channel and the Philly Blunt pirated YouTube version have exceeded a combined viewer count of more than 2 million views; however, that number doesn’t include an accounting of those who’ve watch the recently released director’s cut of the film, attended watch parties, watched the film during its debut over the weekend on One America News Network, or viewed it via myriad other pirated formats.\nInitial reaction to Clinton Cash was overwhelming, with more than 170,000 viewers watching the film within the first three hours of it’s worldwide release.\nThe film, directed by M.A. Taylor and written and produced by Breitbart News Executive Chairman Stephen K. Bannon, was promoted — and praised — by both sides of the political spectrum.\nIndeed, for the first three days of the Democratic Party’s week-long coronation of Hillary Clinton as their presidential nominee, Clinton Cash was sitting atop Facebook’s trending topics list.\nMuch of the viral online explosion of the Clinton Cash documentary was the result of Bernie Sanders supporters, who flocked to their respective Facebook accounts and urged their followers and fans to watch and share the groundbreaking movie.\nThe film is based on the explosive New York Times bestselling book Clinton Cash, authored by Government Accountability Institute President and Breitbart Senior Editor-at-Large Peter Schweizer, which first exposed the record-high speaking fees to Bill Clinton and donations to the Clinton Foundation from foreign contributors, which coincided with favors for those closest to the Clintons and their foundation donors while Hillary Clinton served as Secretary of State.\nThe paperback version of Clinton Cash was released on Tuesday, July 26.\nNext month, on August 8, the much-anticipated Clinton Cash graphic novel will be available for audiences everywhere and is sure to capture the imagination of millennial audiences for generations to come. You can pre-order the graphic novel here.\nFollow Jerome Hudson on Twitter: @jeromeehudson","url":"https://www.breitbart.com/entertainment/2016/07/31/clinton-cash-movie-viewed-2-million-times-opening-week/"}
