{"authors":["Peter Over"],"date_download":"2018-10-22 21:38:34","date_modify":"2018-10-22 21:38:34","date_publish":"2016-07-21 00:00:00","description":"The reports from the Clinton committees put her in better financial shape than either President Obama or challenger Mitt Romney in 2012. Trump's fundraising has improved but still lags Clinton's.","filename":"data/vaneerConsumption/ClintonsFundraisingOutpacesTrumpsAsTheGeneralElectionSeasonBegins.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_07_21_486884485_clintons-fundraising-outpaces-trumps-as-the-general-election-season-begins_1540244314.html","title":"Clinton's Fundraising Outpaces Trump's As The General Election Season Begins","title_page":"Clinton's Fundraising Outpaces Trump's As The General Election Season Begins : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Clinton's Fundraising Outpaces Trump's As The General Election Season Begins\nDonald Trump's presidential fundraising produced its first strong numbers for a big-budget fall campaign last month, but the financial powerhouse backing Hillary Clinton continued to hold a strong lead.\nTeam Clinton outraised Team Trump $146.3 million to $81.1 million. Cash-on-hand totals were also lopsided: $139.2 million to $61.4 million. These totals include activity by the candidate committees, national party committees, joint fundraising committees and supporting superPACs.\nThe mandatory monthly reports were filed Wednesday night at the Federal Election Commission.\nTrump's numbers show a dramatic jump from May. His campaign committee finished that month with $1.3 million in the bank. On June 30 it had $20.2 million.\nThe reports also showed that Trump fulfilled his pledge to cancel campaign loans worth $47.5 million. He lent the money to underwrite most of his primary campaign. He and his aides said for months he wouldn't seek repayment.\nThe reports from the Clinton committees put her in better financial shape than either President Obama or challenger Mitt Romney as of July 1, 2012.\nShe kept her financial lead over Trump even after spending heavily to build infrastructure — ground operations and technology — for a full-throttle run from the conventions to Election Day. Trump, despite his recent surge, hasn't yet made similar investments. With barely any pro-Trump TV ads airing in June, the Clinton campaign reported its highest monthly spending of the campaign: $34.4 million, much of it going for TV in the battleground states.\nThe pro-Clinton superPAC Priorities USA Action was even more aggressive; it spent $23.7 million, more than triple its total for May. Its June fundraising came to nearly $12 million, about the same as May. More than half of the funds came from four donors: philanthropist Mary Pritzker, Diamond Resorts International CEO Stephen Cloobeck, and investors Donald Sussman and Laure Woods.\nThree much-talked-about Trump superPACs from May failed to get traction in June. Great America PAC, Rebuilding America Now and the Committee for American Sovereignty raised a combined total of less than $5 million and closed the month with less than $2 million on hand. Despite reports that casino magnate Sheldon Adelson would generously seed a pro-Trump superPAC, such a group has not materialized.","url":"https://www.npr.org/2016/07/21/486884485/clintons-fundraising-outpaces-trumps-as-the-general-election-season-begins"}
