{"authors":["John Sexton"],"date_download":"2018-10-30 21:45:16","date_modify":"2018-10-30 21:45:16","date_publish":"2015-09-25 16:55:57","description":"Clinton's Aides Face Possible Criminal Charges From FBI Investigation","filename":"data/vaneerConsumption/ClintonsAidesFacePossibleChargesFromFBIInvestigation.json","image_url":"https://media.breitbart.com/media/2015/09/hillarycharges.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_09_25__1540935916.html","title":"Clinton's Aides Face Possible Charges From FBI Investigation","title_page":"Clinton's Aides Face Possible Charges From FBI Investigation","title_rss":"NULL","source_domain":"breitbart.com","text":"At least three emails containing Top Secret information were sent to Hillary Clinton by her aides at the State Department, via her poorly protected, personal email network. The FBI is investigating whether the staffers who sent those emails could be charged for mishandling classified information.\nThe New York Times published details of the three emails currently being examined by the FBI:\nAn email from State official Timmy Davis relaying information about the movements of Ambassador Chris Stevens in Benghazi. The email also included data from the U.S. African Command with specific details on the locations and strength of Qaddafi’s forces.\nAn email about North Korea’s nuclear weapons program which the intelligence community says was based on Top Secret satellite data.\nAn email in which State Department officials discuss a New York Times story about the CIA’s Top Secret drone program.\nThe FBI is examining the emails to determine whether any of Clinton’s aides “broke federal rules or laws when they sent her information.”\nIf the FBI determines the aides did break the law, the aides in question could face prosecution. That would make the e-mail scandal even worse for Clinton as she runs for president in 2016.\nThe three emails above were identified after only a portion of Clinton’s total work emails were examined.\nCombing through the entire collection of emails, as well as whatever new emails the FBI may recover from her server, is expected to take several more months.\nBoth the State Department and Hillary Clinton’s spokesman contest the claim that any of the emails contained classified information. For instance, the email on Qaddafi’s troop strength stated he had, “five vehicles at the eastern gate and 50 at the western gate.” That detailed intelligence was classified Top Secret according to the Intelligence Community, but Clinton’s spokesman Nick Merrill tells the NY Times information on troop movements had appeared in newspapers before the email in question was sent.\nThe Times offers a link to one of their own stories to back up this assertion; however, the story in question does not contain the specific information mentioned in the email. Curiously, the Times does not mention this omission or offer a link to any story that does contain the details on how many trucks were at each gate.\nClinton has offered a shifting series of explanations for her decision to create a private email server since March when the story became public. Last month the FBI seized the server from the private IT company that had possession of it. Earlier this month, Clinton apologized for her choice for the first time. She continues to claim she broke no rules, sent no classified information and received no information “marked” classified.","url":"https://www.breitbart.com/politics/2015/09/25/clintons-aides-face-possible-criminal-charges-fbi-investigation/"}
