{"authors":["Dustin Stockton"],"date_download":"2018-10-30 21:47:13","date_modify":"2018-10-30 21:47:13","date_publish":"2016-06-06 03:09:56","description":"Vermont Sen. Bernie Sanders questioned the financial relationship between foreign governments and the Clinton Global Initiative.","filename":"data/vaneerConsumption/ClintonCashBernieSandersHitsHillaryClintononForeignContributionstoClintonFoundation.json","image_url":"https://media.breitbart.com/media/2016/05/bernie-sanders-hillary-clinton-reuters-photos.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_06_05__1540936033.html","title":"Clinton Cash: Bernie Sanders Hits Hillary Clinton on Foreign Contributions to Clinton Foundation","title_page":"Clinton Cash: Bernie Sanders Hits Hillary Clinton on Foreign Contributions to Clinton Foundation | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Vermont Sen. Bernie Sanders questioned the financial relationship between foreign governments and the Clinton Global Initiative during Hillary Clinton’s tenure as Secretary of State in an interview on CNN’s State of the Union with Jake Tapper Sunday.\nThe troubling relationships between the Clintons and foreign governments were brought to light by Breitbart’s Peter Schweizer in his book, Clinton Cash, and are also the subject of the recently premiered documentary by the same name. Sanders has largely refrained from using the information as a line of attack until his interview with Tapper Sunday.\nJake Tapper: “You have not been critical of the Clinton foundation, but there are those who say that there is something inherently wrong with an American charity, especially one with ties to a Secretary of State, taking money from the Saudis and other foreign governments that don’t represent our values, is that a fair criticism?”\nSenator Sanders: “Yes it is, it is. If you ask me about the Clinton Foundation — do I have a problem when a sitting Secretary of State and a foundation run by her husband collects many millions of dollars from foreign governments, governments which are dictatorships, you don’t have a lot of civil liberties with democratic rights in Saudi Arabia. You don’t have a lot of respect there for divergent opposition points of view, for gay rights, for women rights. Do I have a problem with that? Yeah, I do.”\nJake Tapper: “Do you think it creates an appearance of conflict of interest?”\nSenator Sanders: “Yeah, I do, I do.”\nDustin Stockton is a political reporter for Breitbart News, a community liaison for Gun Owners of America, and a political strategist. Follow him on Twitter@DustinStockton or Facebook.","url":"https://www.breitbart.com/politics/2016/06/05/bernie-sanders-hits-hillary-foreign-contributions-clinton-foundation/"}
