{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:09:00","date_modify":"2018-10-30 21:09:00","date_publish":"2016-03-09 13:10:53","description":"Hillary Rodham Clinton is against UN Security Council imposing terms for an Israeli-Palestinian peace process \"from without,\" her campaign said.","filename":"data/vaneerConsumption/ClintonAgainstUNImposedPeaceinIsraeliPalestinianConflict.json","image_url":"https://media.breitbart.com/media/2016/03/ahil.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_03_09__1540933740.html","title":"Clinton Against UN-Imposed Peace in Israeli-Palestinian Conflict","title_page":"Clinton Against UN-Imposed Peace in Israeli-Palestinian Conflict","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Hillary Rodham Clinton is against the UN Security Council imposing terms for an Israeli-Palestinian peace process “from without,” her campaign said on Tuesday.\nIn an op-ed Clinton wrote for the Jewish newspaper the Forward, the presidential hopeful claimed that “while no solution can be imposed from outside, I believe the United States has a responsibility to help bring Israelis and Palestinians to the table and to encourage the difficult but necessary decisions that will lead to peace.”\nClinton reiterated a statement she made at the Brooking Institution’s Saban Forum in December.\nClinton’s position differs slightly from that of the Obama administration, which said it would consider measures at the UN in reaction to Israel’s continued settlement construction policy. According to the White House, this policy runs contrary to the pursuit of peace.\nThe Wall Street Journal reported Monday that the administration is considering a UN Security Council resolution to serve as a basis for negotiations in a final bid for peace before Obama leaves office.\nAccording to the Jerusalem Post, White House press secretary Josh Earnest told reporters on Tuesday that the U.S. “will continue to oppose one-sided resolutions” – but not all resolutions.\n“What we have acknowledged is that our policy when it relates to UN resolutions has not changed. We obviously will consider future engagement if and when we reach that point,” Earnest said.\nIn the past, the U.S. has on many occasions vetoed such resolutions, but in March of last year the White House said it was “rethinking” its policy in light of the fact that Israel is no longer “committed” to direct negotiations.\n“The reason that the United States on a number of previous occasions has opposed a resolution like the one that you’ve described is that we have made the case to the international community that a solution shouldn’t be imposed on the outside because the two parties should come to the table and reach a negotiated settlement face to face,” Earnest said.\n“The only thing that’s changed is that our ally in those conversations, Israel, has indicated that they’re not committed to that approach anymore,” he continued. “And so if that’s the case, it means that we need to sort of rethink what our approach is going to be in the United Nations.”\nClinton, on the other hand, considers cooperation with the Security Council to be the wrong move. Her campaign’s foreign policy advisor, Laura Rosenberger, told the Jerusalem Post that the former secretary of state “believes that a solution to this conflict cannot be imposed from without.”","url":"https://www.breitbart.com/politics/2016/03/09/clinton-im-un-imposed-solution-israeli-palestinian-conflict/"}
