{"authors":["Associated Press"],"date_download":"2018-10-22 20:52:47","date_modify":"2018-10-22 20:52:47","date_publish":"2016-01-28 04:58:40","description":"ADEL, Iowa (AP) — Hillary Clinton pressed the Democratic National Committee on Wednesday to add a presidential debate before next month's New Hampshire prima...","filename":"data/vaneerConsumption/ClintonpressesfordebatebeforeNewHampshireprimary.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:e83c3e742dc64b73aa57a6dd8d675b69-2vdWmEltwXfba0ce28e632427dab-531_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3419778_Clinton-presses-debate-New-Hampshire-primary_1540241567.html","title":"Clinton presses for debate before New Hampshire primary","title_page":"Clinton presses for debate before New Hampshire primary | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Clinton presses for debate before New Hampshire primary\nADEL, Iowa (AP) — Hillary Clinton pressed the Democratic National Committee on Wednesday to add a presidential debate before next month's New Hampshire primary, seeking another high-profile exchange with rival Bernie Sanders as she trails him in the first primary state.\nSanders' campaign responded that it would be willing to participate in a Feb. 4 New Hampshire forum if she was willing to agree to three more debates — one each in March, April and May.\nThe push by Clinton for more debates underscores Sanders' strength in Iowa and New Hampshire and the heightened concern within Clinton's team that she could lose both of the early voting states. Sanders' interest in adding debates during the spring shows his campaign's eye toward an extended fight for the nomination leading up to the party's July convention.\nDemocratic presidential candidate, Sen. Bernie Sanders, I-Vt, speaks during a campaign event at Music Man Square, Wednesday, Jan. 27, 2016 in Mason City, Iowa. (AP Photo/Chris Carlson)\nClinton is trailing Sanders in New Hampshire and locked in a tight contest in Monday's Iowa caucuses, raising the possibility that the Democratic front-runner could lose both. Adding another debate before New Hampshire's Feb. 9 primary would give her a large television audience that might help her reach undecided voters.\n\"I am, you know, anxious if we can get something set up to be able to be there. So let's try to make it happen,\" Clinton said in a phone interview with MSNBC, which announced the new debate with the Union Leader, New Hampshire's largest newspaper.\nClinton said she wanted DNC chair Debbie Wasserman Schultz to approve the debate and for Sanders to join her. But both have resisted.\nAmy Dacey, the DNC's chief executive officer, said on Twitter earlier Wednesday that \"Democrats have a debate schedule, and we're sticking to it.\" The DNC has said it wants to reconvene with the campaigns after the Iowa and New Hampshire contests to review the debate schedule. The three major candidates are also scheduled to appear on the same stage on Feb. 5 at a New Hampshire Democratic Party dinner.\nFormer Maryland Gov. Martin O'Malley, who has long criticized the DNC's debate schedule, supports adding the debate in New Hampshire.\nSanders' campaign said earlier it had no plans to participate in the New Hampshire event because the DNC hasn't sanctioned the proposed debate. The Vermont senator's campaign has warned it could jeopardize their ability to participate in upcoming debates scheduled in Wisconsin and Florida.\nBut Sanders campaign manager Jeff Weaver said late Wednesday that Sanders would be willing to participate in New Hampshire if the DNC added three more debates after the ones currently scheduled. Weaver said none of the debates could be held on a Friday, Saturday or holiday weekend and the three Democratic candidates must be invited.\nWeaver said Clinton was \"asking to change the rules to schedule a debate next week that is not sanctioned by the DNC. Why is that? The answer is obvious. The dynamics of the race have changed and Sen. Sanders has significant momentum.\"\nFor months, O'Malley and some of Sanders' supporters have claimed that the national committee is rigging the schedule to benefit Clinton, scheduling fewer debates to avoid undermining her national lead in the polls. Many of the televised events have been held on weekend evenings, giving it a limited audience.\nClinton's push for more debates signals her deficit in New Hampshire against Sanders, who has represented neighboring Vermont in Congress for more than two decades.\n__\nThomas reported from Mason City, Iowa.\nDemocratic presidential candidate Hillary Clinton speaks at a campaign event at Adel Family Fun Center Wednesday, Jan. 27, 2016, in Adel, Iowa. (AP Photo/Jae C. Hong)","url":"https://www.dailymail.co.uk/wires/ap/article-3419778/Clinton-presses-debate-New-Hampshire-primary.html"}
