{"authors":["Compiled Democrat-Gazette Staff Wire Reports"],"date_download":"2018-10-30 19:37:35","date_modify":"2018-10-30 19:37:35","date_publish":"2016-06-01 00:00:00","description":"Hillary Clinton on Wednesday cast presumptive Republican presidential nominee Donald Trump as a \"fraud\" intent on scamming the American people, citing new revelations about the now-defunct Trump University.","filename":"data/vaneerConsumption/ClintonlabelsTrumpfraud.json","image_url":"https://media.arkansasonline.com/img/photos/2016/06/01/resized_99263-senate_scene_3_72-21288_t600.JPG?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_jun_02_clinton-labels-trump-fraud-20160602-1__page=5_1540928255.html","title":"Clinton labels Trump 'fraud'","title_page":"Clinton labels Trump 'fraud'","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Sens. Marco Rubio (left), R-Fla., and Patrick Leahy, D-Vt., walk through the Senate basement last month. Rubio, who in campaign speeches criticized rival Donald Trump over his Trump University, has said he’s eager to help the GOP defeat Hillary Clinton, the Democratic front-runner. - Photo by The New York Times / ZACK GIBSON\nNEWARK, N.J. -- Hillary Clinton on Wednesday cast presumptive Republican presidential nominee Donald Trump as a \"fraud\" intent on scamming the American people, citing new revelations about the now-defunct Trump University.\nRELATED ARTICLE Obama attacks economic 'myth'\nPhoto by JULIO CORTEZ / AP\nHillary Clinton shares the stage with musician Jon Bon Jovi during a campaign stop Wednesday at the Newark, N.J., campus of Rutgers University.\nPhoto by JIM WILSON / The New York Times\nSen. Bernie Sanders speaks during a campaign rally May 18 in San Jose, Calif. At a rally Tuesday night, Sanders predicted he will win the California primary next week and gather enough momentum to flip the allegiance of superdelegates who support Hillary Clinton.\nIn the first minutes of her speech at a rally at the Newark campus of Rutgers University, Clinton brought up newly released testimony by former employees of what she called \"the so-called Trump University,\" telling the crowd, \"You can't make this up.\"\nThe testimony, released Tuesday as part of three lawsuits, portrayed Trump University as an unscrupulous business that used high-pressure sales tactics and deceptive marketing to lure thousands of people to enroll in classes. In many cases, the employees said, customers were persuaded to purchase classes they could not afford by opening credit-card accounts or borrowing the money.\nTrump vigorously maintains that customers were overwhelmingly pleased with the offerings, and the documents do include testimony from several satisfied customers. His campaign released a video Wednesday featuring several people speaking positively about their experiences.\nA case against Trump University in San Diego is to go to trial shortly after the November presidential election.\nIn New Jersey, Clinton told the crowd that employees had testified \"that Trump U was a fraudulent scheme where Donald Trump enriched himself at the expense of hardworking people.\" She said Trump and those who worked for him \"took advantage of vulnerable Americans.\"\n\"This is just more evidence that Donald Trump himself is a fraud,\" Clinton added. \"He is trying to scam America the way he scammed all those people at Trump U.\"\nOn the campaign trail, Clinton has unleashed attacks against Trump on a variety of subjects, including his views on foreign policy, his failure to release his tax returns and his stated hopes, before the last recession, that the real estate market would crash.\n\"It's important that we recognize what he has done, because that's usually a pretty good indicator of what he will do,\" she told the crowd Wednesday.\n'You sell feelings'\nThe key features of the Trump-owned education organization were pricey seminars and other offerings that promised to share his business insights. Trump University offered a three-day seminar for $1,495, using it as a springboard to sell more expensive \"Trump Elite\" packages for up to $34,995 per year.\nTrump University's core customers are identified in the documents as male heads of households between 40 and 54 years old with annual household incomes of at least $90,000, a college education and a net worth of more than $200,000.\nThe documents released Tuesday underscore that the selling point of Trump University was Trump's unshakable self-confidence and his own success story.\nThe program's 2009 playbook boasts that Trump is \"the most celebrated entrepreneur on earth. He makes more money in a day than most people do in a lifetime.\"\nThe playbooks, which are guides for those running the Trump University seminars, are chock-full of advice on how to seal the deal with prospective students, including specific instructions on seminar-room setups and music selections.\nAn operating guide for supervisors contains \"Sales Wisdoms\" that appear to echo Trump's speaking strategy at his rallies at which he rails about the nation's problems -- from immigration to trade deals to the death of the American dream -- without offering much in the way of specific solutions.\n\"When you talk to customers, it usually works best if the subject is problems,\" one document reads. Another declares that \"the customers must perceive the problem.\" And a third makes clear that \"you don't sell products, benefits or solutions -- you sell feelings.\"\nThe Trump University material also seems to foreshadow Trump's run-ins with the media, offering tips for what organizers should do if a reporter attempts to conduct an interview at a seminar. Among the guidelines: \"You don't have to deliver what the reporter wants\" and \"Reporters are rarely on your side and they are not sympathetic.\"\nAs Trump campaigns through the GOP primary season, some of his fellow candidates raised Trump University as a liability for the businessman, and at least five outside groups mentioned the business in attack ads. U.S. Sen. Marco Rubio of Florida also brought up Trump University in his campaign speeches in an attempt to blunt the real estate mogul's political rise.\n\"It was targeted at people that were struggling,\" Rubio said in March. They were retirees, single mothers and young people trying to start a business, he said. \"They were people that were hurting, and they specifically targeted them.\"\nRubio said last week that he's eager to help the party defeat Clinton.\nWhile details about the business did little to slow Trump in the primary, Clinton allies say GOP candidates were too slow in raising concerns and inconsistent in their attacks. Clinton aides have vowed to avoid repeating those mistakes, and officials said that Wednesday marked the beginning of a concerted campaign on the subject.\nSanders in California\nClinton's criticism of Trump's school came as she campaigned in Newark ahead of next week's New Jersey primary. California, Montana, New Mexico, North Dakota and South Dakota also have primaries or caucuses Tuesday.\nCampaigning Wednesday in Spreckels, Calif., in the state's vast agricultural midsection, Bernie Sanders noted that Clinton and her husband, former President Bill Clinton, are devoting several days to campaigning in the state in the run-up to the primary.\n\"I wonder why Secretary Clinton and her husband, Bill, are back in California? I thought we had lost and it was all over,\" the U.S. senator from Vermont told reporters, with a note of sarcasm.\nAt a rally the night before in Santa Cruz, Sanders warned that media outlets are expected to declare \"the primary process is over, Secretary Clinton has won.\" His statement was met with boos.\n\"That is factually incorrect. It's just not factually correct,\" he said, predicting that he would win California and some other states next Tuesday and head into the convention with enough momentum to flip allegiances of \"superdelegates\" who previously have announced support for Clinton.\nSenate Minority Leader Harry Reid, who serves with Sanders in Congress, weighed in Wednesday, saying the Vermonter needs to recognize that \"sometimes you just have to give up.\"\nReid, who has endorsed Clinton, stopped short of calling on Sanders to drop out and added that Sanders has a right to continue his campaign through the convention. But Reid stressed that \"math is math.\"\n\"The numbers aren't there,\" he said.\nCounting public backing from 543 superdelegates, Clinton needs just 71 pledged delegates to claim the Democratic nomination. Sanders, who has support from 44 superdelegates, needs 838 more delegates to claim the nomination.\nFor Trump, having already amassed enough delegates to claim the nomination, his campaign has turned full tilt to the November election, broadening the scope of the businessman's campaign to introduce some international flair.\nOn Wednesday, Trump's Turnberry resort in the United Kingdom announced that the New Yorker will be visiting the country later this month, his first trip abroad since becoming the presumptive Republican presidential nominee.\nThe visit will come June 24, and will be about business, not politics, according to a statement issued by Wednesday the Turnberry resort. He's to attend the official opening of one of his Scottish golf courses that day.\n\"Very exciting that one of the great resorts of the world, Turnberry, will be opening today after a massive 200 million [British-pound] investment,\" Trump was quoted as saying as he referred to an amount that comes to about $288 million. \"I own it and I am very proud of it. I look forward to attending the official opening of this great development on June 24th.\"\nThe visit will be a day after the U.K. votes in a referendum on whether to stay in the European Union. The result may not be known until the following morning, when Trump is to fly in. Trump has publicly backed the idea of a British exit.\nNo plans were announced for Trump to meet with any British government leaders during the business trip.\nInformation for this article was contributed by Thomas Kaplan and Michael Barbaro of The New York Times; by Julie Pace, Jill Colvin, Jonathan Lemire, David Porter, Julie Bykowicz and Jeff Horwitz, Michael R. Blood and Ken Thomas of The Associated Press; and by Griff Witte and Karla Adam of The Washington Post.\nA Section on 06/02/2016","url":"https://www.arkansasonline.com/news/2016/jun/02/clinton-labels-trump-fraud-20160602-1/?page=5"}
