{"authors":["Jerome Hudson"],"date_download":"2018-10-30 21:44:28","date_modify":"2018-10-30 21:44:28","date_publish":"2017-01-19 04:24:28","description":"The impending implosion of the Clinton Foundation and the looming layoff of 22 staffers due to the closure of the Clinton Global Initiative are the result of Breitbart News and its Editor-at-Large Peter Schweizer's book Clinton Cash. | Politics","filename":"data/vaneerConsumption/ClintonCashBreitbartNewsandtheNarrativesthatLedtotheClintonFoundationsDemise.json","image_url":"https://media.breitbart.com/media/2016/04/Clinton-Cash-Poster.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_01_18__1540935868.html","title":"'Clinton Cash,' Breitbart News, and the Narratives that Led to the Clinton Foundation's Demise","title_page":"'Clinton Cash,' Breitbart News, and the Narratives that Led to the Clinton Foundation's Demise | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The impending implosion of the Clinton Foundation and the looming layoff of 22 staffers due to the closure of the Clinton Global Initiative are the result of Breitbart News and its Editor-at-Large Peter Schweizer’s book Clinton Cash.\nClinton Cash revealed the worldwide nexus of shady deal-making between Clinton Foundation donors, the six-figure speeches given by Bill Clinton, and the corresponding actions approved by the U.S. State Department while Hillary Clinton was secretary of state.\nPerhaps no political tome did more to expose and explain the web of corruption at Clinton, Inc., which is why the New York Times described Clinton Cash as “the most anticipated and feared book of a presidential cycle.” Such anticipation was proven justified when John Podesta’s hacked emails revealed how panicked Clinton’s campaign staff was in May 2015, just days before the release of Clinton Cash.\nIn the ensuing months, Breitbart News was leading the charge and crafting the narratives behind some of the most explosive details uncovered in Clinton Cash.\nBy June 2015, myriad media outlets — dozens in fact — across the ideological spectrum had confirmed or independently reported and verified many of the facts found in Schweizer’s book.\nBelow is a small sampling of some of the book’s biggest bombshells, as previously highlighted by Breitbart:\nNew York Times: Hillary Clinton’s Campaign Claims She Had No Idea Her State Dept. Was Considering Approving the Transfer of 20% of U.S. Uranium to the Russian Govt.—Even as the Clinton Foundation Bagged $145 Million in Donations from Investors in the Deal.\nBill Clinton Bagged $500,000 for a Speech in Moscow Paid for by a Kremlin-linked Bank.\nHillary’s Brother Sat on the Board of a Mining Company that Scored an Extremely Rare “Gold Exploitation Permit” in Haiti as Hillary and Bill Clinton Disbursed Billions of U.S. Taxpayer Dollars in Haiti.\nBill Clinton Delivered Numerous Speeches Paid for By Individuals and Corporations with Pending Business Before Hillary’s State Dept.\nHillary’s Foundation Accepted $1 Million from Human Rights Violator Morocco for a Lavish Event\nSeemingly stunned by the growing chorus of criticism, Bill Clinton defended accepting six-figure speech fees and seven-figure donations to his family foundation from governments or corperations with business before his wife’s State Department, saying, “I got to pay our bills.”\nBut the damage was already done.\nAccording to former View co-host and White House Communications Director for President George W. Bush Nicolle Wallace, the revelations found in Clinton Cash had already “eroded” Hillary Clinton’s “trustworthiness in the view of voters.”\nNearly a year later — and just days before Hillary Clinton’s coronation at the Democratic National Convention — the Clinton Cash documentary saw its global premiere at Breitbart.com.\nWithin hours of its release, the Clinton Cash documentary, which MSNBC called a “devastating” film, had been seen by more than 170,000 viewers and was being touted by Bernie Sanders supporters who flocked to their respective social media accounts and urged their followers to watch and share the groundbreaking movie.\nBefore long, the Clinton Cash documentary had hijacked the Democratic National Convention. The film was endorsed by Black Men for Bernie, who promoted the movie during a massive rally near the Democratic confab in Philadelphia.\nOn Sunday July 31, Hillary Clinton was asked by Fox News host Chris Wallace about the allegations found in Clinton Cash. Stunningly, Clinton said she is “really proud of the Clinton Foundation,” despite the fact that not a single speaker at the Democratic National Convention — not even Bill or Chelsea Clinton — mentioned her embattled Foundation.\nA week later, on August 8, the much-anticipated Clinton Cash graphic novel hit the shelves.\nWithin 24 hours of its release, The Clinton Cash graphic novel — inspired by Schweizer’s bestselling investigative blockbuster Clinton Cash — sold out and hit #5 on the Amazon bestsellers list.\nThe graphic novel, adapted by comic book writer Chuck Dixon and longtime DC Comics cover artist Brett R. Smith, went on to debut at #1 on The New York Times graphic novel bestsellers list.\nIn August, Bill Clinton told a room full of the foundation’s staff that he will resign from the Clinton Foundation board should Hillary Clinton win the White House in November. The former Presidential also said that he would cease giving paid speeches.\nBut it was too little too late, as Schweizer noted. Calls were already coming from several liberal establishment media outlets — including the Huffington Post, the Washington Post, and Slate — demanding that the Clintons either shutter the Foundation altogether or pass off its assets to some other unaffiliated nonprofit.\nBy September, two months before Election Day, a majority of Americans believed Bill and Hillary Clinton failed to avoid conflicts of interest as millions of dollars flowed into their family foundation, according to a national Suffolk University/USA Today poll. The poll indicated that 33 percent of likely Democrat voters said the Clintons did not do enough to avoid conflicts of interest.\nA couple weeks after Hillary Clinton loss the election, financial disclosure forms revealed that the Clinton Foundation’s donations had plummeted by 37 percent.\nLast week, Schweizer, who predicted the Clinton Foundation’s implosion, called the Clinton Global Initiative’s shutdown a “remarkable event.”\n“Because let’s face it,” Schweizer said this week on Breitbart News Daily, “what we talked about has been confirmed by the Podesta emails, it’s been confirmed by these events: if they can’t sell access to political power, they just don’t have a product, in the form of their form of philanthropy, that people want to donate to.”\nFollow Jerome Hudson on Twitter: @JeromeEHudson","url":"https://www.breitbart.com/politics/2017/01/18/clinton-cash-breitbart-news-and-the-narratives-that-led-to-the-clinton-foundations-demise/"}
