{"authors":[],"date_download":"2018-10-22 21:13:56","date_modify":"2018-10-22 21:13:56","date_publish":"2014-05-06 15:57:55","description":"Just how dysfunctional does Hillary Clinton think Congress is right now?","filename":"data/vaneerConsumption/ClintonJokeDontLetCongressNameMyGrandchild.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/423671/140506-clinton_congress_grandchild-1156_59df91dc50ce47d6e6e89b4f3b79858d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_elections_clinton-joke-dont-let-congress-name-my-grandchild-n98256_1540242836.html","title":"Clinton Joke: Don't Let Congress Name My Grandchild","title_page":"Clinton Joke: Don't Let Congress Name My Grandchild","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nJust how dysfunctional does Hillary Clinton think Congress is right now?\nSo bad that it would take around 18 years for them to decide on a baby name for her forthcoming grandchild.\n\"Given what's going on, the poor child would never get a name,\" the potential presidential frontrunner said Tuesday when asked what role Congress should play in naming the child. \"It would be 'Baby' until he or she went to college and could probably choose it for themselves.\"\nThe comments were just one of many the former secretary of state has recently made voicing her displeasure with Congressional paralysis. She has previously said the gridlock is one of the dissuading factors in considering a presidential run.\nClinton again acknowledged she is considering a White House bid while delivering remarks at the National Council of Behavioral Health Conference. “I just have to decide whether I’m ready to do that,” she said. “So stay tuned, when I know, you'll know.\"\nThe conversation pivoted between light-hearted and serious, addressing a wide range of issues including the Clinton Foundation's work to prevent prescription drug misuse and gun control.\n\"We need to rein in what has almost become an article of faith that anyone can have a gun anywhere anytime and I don't believe that is in the best interests of the vast majority of people,\" Clinton said.\nHowever the former secretary of state may have been most stumped when asked what her \"guilty pleasure\" is.\n\"I'm just trying to think of the, you know, G-Rated ones,\" she said while pondering the question.\nHer final answer was chocolate.\n-- NBC's Andrew Rafferty and Carrie Dann","url":"https://www.nbcnews.com/politics/elections/clinton-joke-dont-let-congress-name-my-grandchild-n98256"}
