{"authors":["Associated Press"],"date_download":"2018-10-23 05:27:00","date_modify":"2018-10-23 05:27:00","date_publish":"2016-01-28 21:22:56","description":"COLUMBIA, S.C. (AP) — At Hillary Clinton's South Carolina headquarters, a young staffer readies a stack of pictures showing the former secretary of state wit...","filename":"data/vaneerConsumption/ClintonsfirewallBlackvotersthekeyinSouthCarolina.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:1656d89a067f4e39b19045078676d222-4PuZeKVXE7cd9005b2c876164052-934_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421721_Clintons-firewall-Black-voters-key-South-Carolina_1540272420.html","title":"Clinton's firewall? Black voters the key in South Carolina","title_page":"Clinton's firewall? Black voters the key in South Carolina | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Clinton's firewall? Black voters the key in South Carolina\nCOLUMBIA, S.C. (AP) — At Hillary Clinton's South Carolina headquarters, a young staffer readies a stack of pictures showing the former secretary of state with her old boss, President Barack Obama. Then the staffer bolts out the door.\nHis destination: African-American businesses across South Carolina's largest city.\n\"If you don't have tape, I'll bring some to you,\" Brandon Lewis offers to business owner Catherine Kelly, who has said she'll hang the photo in her Columbia beauty shop.\nDemocratic presidential candidate Hillary Clinton, center, hands a smartphone to her aide for photos with supporters at a campaign event at Adel Family Fun Center Wednesday, Jan. 27, 2016, in Adel, Iowa. (AP Photo/Jae C. Hong)\n\"I've already got a picture of Obama,\" Kelly tells him, expressing pride in the nation's first black president. She assures him: \"We're with Hillary.\"\nBlack voters represent a solid majority of the Democratic electorate in South Carolina — and could make all the difference in the state's Feb. 27 primary. A new NBC News-Wall Street Journal-Marist poll shows Clinton with 64 percent of South Carolina's likely Democratic votes, while her rival, Vermont Sen. Bernie Sanders, has 27 percent. Clinton leads in all demographics, but her 74-17 advantage among South Carolina's black voters explains her overall 37-point margin.\nSanders isn't conceding. Across town, teams of his staffers are going door-to-door in predominantly black neighborhoods. The senator has visited college campuses with mostly African-American student bodies. African-American radio stations are filled with ads touting his record on civil rights and his promise to overhaul a criminal justice system that he says disproportionately targets black men.\nBoth campaigns acknowledge that South Carolina could be crucial in shaping the fight for the Democratic nomination. Even if Sanders builds momentum with wins in the overwhelmingly white states of Iowa and New Hampshire, that lead could evaporate quickly if he can't attract more black voters in South Carolina and the bulk of Southern states voting in March.\nThis is Clinton's firewall, and Sanders' campaign is trying to break it down.\nSanders offers \"many ideas that appeal across the spectrum,\" says South Carolina Democratic Chairman Jaime Harrison, who is black. Harrison notes the senator's emphasis on economic inequality and systemic racism. \"But he has to make that real to African-American voters on the ground,\" Harrison says. \"For most folks, Wall Street is as foreign as Moscow.\"\nClinton has recently pegged Sanders as unwilling to take on gun violence given his occasional voting record against Democrats on gun regulation. It's an issue that resonates among black voters following the April shooting of Walter Scott, an unarmed black man killed by a white police officer in North Charleston, and the June massacre of nine people by a white gunman at the Emanuel African Methodist Episcopal Church in Charleston.\n\"That's as real as it gets to people here,\" Harrison said.\nBryanta Maxwell, the 31-year-old president of Young Democrats in South Carolina, said she's aware of Sanders' gun votes but supports him because of his emphasis on ending mass incarceration and curbing police violence. \"I read and I researched, and I said, you know, this resonates with me as the mother a young black boy,\" she said.\nMaxwell expressed frustration over Clinton's criticism of Sanders on guns and health care. Besides panning Sanders' universal health care pitch as politically impossible, Clinton frames it as disloyal to Obama.\n\"Whoever succeeds President Obama is going to do something to the Affordable Care Act, change it, tweak it, improve it, repeal it, and she knows that,\" Maxwell said.\nYet Clinton's argument may have taken root.\n\"It seems to me that he wants to almost scrap the whole ACA, and where is that going to leave people?\" wonders Maryann Wright, 62, a retired teacher who is black. \"What we need to do is stay the course and do some tweaking.\"\nClinton, meanwhile, plays up her associations in the black community, often traced to her husband's successful presidential bid in 1992, sometimes earlier, and extending to her relationship with Obama. Sanders notes that he attended the 1963 March on Washington and Martin Luther King Jr.'s \"I Have a Dream\" speech, but Clinton calls local black leaders by name at many of her stops, often recalling some past work they've done together.\n\"She's a brand; he isn't,\" Maxwell said. \"He has to figure out a way to set himself apart.\"\nClinton has had paid staff on the ground in South Carolina since last spring, led by her state director, Clay Middleton, an African-American alumnus of The Citadel, the military college in Charleston. Sanders more than matches her staffing levels now, but only after a recent buildup — and his top paid leaders come from outside the state.\nClinton's campaign \"is younger, more vibrant,\" said Bakari Sellers, a former state lawmaker who backed Obama in 2008 and now campaigns for Clinton. \"It's in the churches. It's out in the streets.\"\nClinton's list of endorsements is long, and she's using outside surrogates to tap into existing black organizations. This weekend, Alexis Herman, a former Cabinet member for Bill Clinton, will address a South Carolina state alumni meeting of her college sorority.\n\"That reaches all ages in the black community with one of their own,\" Maxwell, the Sanders supporter, acknowledged.\nSanders this week picked up a noteworthy flip from the Clinton camp, winning an endorsement from state Rep. Justin Bamberg, a lawyer who represents the Walter Scott family. Whether Sanders gains ground depends on whether more black South Carolinians take Bamberg's approach.\n\"From the beginning, as is the case for many Americans, I did not give Sen. Sanders a fair shake,\" Bamberg said. He switched sides, he said, after \"paying close attention.\"\n------\nAssociated Press writer Meg Kinnard contributed.\n------\nFollow Bill Barrow on Twitter at https://twitter.com/BillBarrowAP .","url":"https://www.dailymail.co.uk/wires/ap/article-3421721/Clintons-firewall-Black-voters-key-South-Carolina.html"}
