{"authors":[],"date_download":"2018-10-23 05:14:11","date_modify":"2018-10-23 05:14:11","date_publish":"2016-01-28 21:15:26","description":"Bernie Sanders wears a serious look as he steps onto the stage, his lips pinched, conceding a smile only due to the warmth of the welcoming ovation. Hillary ...","filename":"data/vaneerConsumption/ClintonandSanderstwovisionstwocampaignstyles.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h4j4-4PuZeKVXE7cd9005b2c876156ed4-110_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421727_Clinton-Sanders--two-visions-two-campaign-styles_1540271651.html","title":"Clinton and Sanders -- two visions, two campaign styles","title_page":"Clinton and Sanders -- two visions, two campaign styles | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Clinton and Sanders -- two visions, two campaign styles\nBernie Sanders wears a serious look as he steps onto the stage, his lips pinched, conceding a smile only due to the warmth of the welcoming ovation.\nHillary Clinton bursts energetically into view, shouting, laughing, mouthing \"thank you\" and appearing genuinely amazed by the warm support.\nThe first wants the masses to rise up in a \"political revolution\"; he promises thunderbolts of change if elected.\nDemocratic presidential candidates Hillary Clinton (L) and Senator Bernie Sanders participate in the Democratic Candidates Debate on January 17, 2016 in Charleston, South Carolina ©Andrew Burton (Getty/AFP/File)\nThe second promises to plow steadily ahead, assuring her listeners she will finish the job begun by Barack Obama, but warning Americans of the hard work ahead.\nAnd so each of the leading Democratic presidential candidates, in his or her own style, girds for the electoral marathon that opens on Monday with the caucuses in a state often overlooked in non-presidential years: Iowa.\n- 'Bernie!' -\nSanders prefers university campuses. His arrival is simple and on time.\nTall and slightly stooped, the 74-year-old senator from Vermont steps up to the podium, unfolds a deeply creased piece of paper and cracks a joke about the fulsome introduction given him by the preceding speaker.\n\"So, I'm going home,\" he told a crowd Sunday at the University of Northern Iowa, in Cedar Falls.\nThen, with no transition, he launches directly into the essential message he hopes his listeners will absorb for the evening: \"What this campaign is about is the belief that we are living with a rigged economy\" in a nation with \"a corrupt campaign finance system. Does that word sound too cruel?\"\n\"No!\" the audience shouts back.\nIn full professorial mode, he continues calling on the crowd.\n\"Are you guys ready for a radical idea?\"\n\"Yes!\" the crowd replies.\nSanders goes on, covering his favorite topics: Wall Street, the high cost of prescription drugs, corruption, for starters.\n\"Bernie, we love you!\" one young woman shouts out during a lull.\nThat brings a smile to the senator's lips. After an hour-long \"class,\" he comes back down to Earth, stepping off the stage to be surrounded by dozens of young people.\nHe signs autographs but, seemingly no fan of selfies, begins to edge away, ignoring the desperate cries of his fans.\nSanders is also a master of deadpan humor.\nThe notoriously unkempt senator draws a big laugh when he quips that he \"combs his hair absolutely beautifully\" and calls himself \"a GQ type of guy,\" referring to the men's magazine.\nEveryone seems to know him simply as \"Bernie\" -- not the more formal \"Senator Sanders\" or \"Mr. Sanders.\"\nIt is with a raised fist and a serious expression that the self-described \"democratic socialist\" arrives at the local offices of a steelworkers union. Workers, including some nurses, enthusiastically chant \"Bernie! Bernie! Bernie!\"\nTweaking the country's bosses, he asks the union members: \"If you are more productive, why are millions of people working longer hours?\"\n\"Greed!\" the crowd cries out, to which Sanders replies, \"All right!\"\n- Madam Secretary -\nEverything about the way Clinton moves between campaign stops evokes the stateswoman, starting with the logistics of her public appearances.\nThe former first lady, who is 68, has Secret Service protection, so metal detectors are mandatory everywhere she goes. Participants arrive long ahead of time.\nHer crowds are smaller, quieter and older. There are diehard supporters who have been with her from the start, and younger women who admire Clinton's historic commitment to women's rights.\nThey invariably speak of her experience as the reason for their support.\nThe candidate arrives on stage pumping her arms to mime a short sprint; she seems in almost exaggeratedly high spirits.\nShe thanks her hosts and the volunteers before laying out her agenda, from the economy to foreign affairs, and always ends with her tenure as secretary of state.\nClinton's voice is firm and gradually gains force; it is that of an experienced fighter, ready to stand up to the Republican-controlled Congress. But she struggles to sum up her candidacy in an idea as simple as Sanders's \"rigged economy.\"\n\"You campaign in poetry, you govern in prose,\" she often says, quoting longtime New York governor and Democratic party heavyweight Mario Cuomo.\nClinton spent the first month of her campaign, in April 2015, attending roundtables, eager to shed the image of an entitled heir. She regularly shares the stories she has heard from the people she has met in cafes and at small businesses.\nAt the end of her campaign events, she submits to the ritual of selfies, even asking people, \"Do you want to get a picture?\"\nAnd if someone fumbles with their device, she takes the iPhone, changes its orientation, and snaps the photo herself.\nDemocratic presidential candidate Bernie Sanders speaks during a forum at Roosevelt High School on January 28, 2016 in Des Moines, Iowa ©Joe Raedle (Getty/AFP)\nPeople listen as Democratic presidential candidate Bernie Sanders speaks on January 28, 2016 in Des Moines, Iowa ©Joe Raedle (Getty/AFP)\nDemocratic presidential candidate Hillary Clinton, greeting supporters on January 27, 2016 in Adel, Iowa, is an experienced fighter and not easily intimidated ©Justin Sullivan (Getty/AFP/File)","url":"https://www.dailymail.co.uk/wires/afp/article-3421727/Clinton-Sanders--two-visions-two-campaign-styles.html"}
