{"authors":["Jerome Hudson"],"date_download":"2018-10-30 21:37:54","date_modify":"2018-10-30 21:37:54","date_publish":"2016-10-20 17:44:32","description":"Reportedly, millions in taxpayer dollars were used to build a clothing factory in Haiti for a company that donated to the Clinton Foundation.","filename":"data/vaneerConsumption/ClintonFoundationDonorLandsTaxpayerFundedFactoryinHaiti.json","image_url":"https://media.breitbart.com/media/2016/10/Clinton-Foundation-Haiti-SAE-A-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_10_20__1540935474.html","title":"Clinton Foundation Donor Lands Taxpayer-Funded Factory in Haiti","title_page":"REPORT: Clinton Foundation Donor Lands Taxpayer-Funded Factory in Haiti","title_rss":"NULL","source_domain":"breitbart.com","text":"Reports reveal that tens of millions in taxpayer dollars were used to build a clothing factory in Haiti for a company that has donated to the Clinton Foundation and whose owner invested in Cheryl Mills’ private consulting company.\nBy 2012, Sae-A Trading Company, a South Korean clothing manufacture, had become the flagship tenant in a much-celebrated Haitian industrial park. Both Bill and then-Secretary of State Hillary Clinton attended the factory’s ribbon-cutting ceremony.\n“A single building was not here a year ago, and now more than a thousand Haitians are coming to work,” Hillary Clinton said at the ceremony, according to ABC News. “This is something that is remarkable.”\nHillary Clinton’s former chief of staff, Cheryl Mills, according to the New York Times, played a prominent roll in bringing Sae-A to Haiti.\n“Ms. Mills took the lead on smoothing the way for the company, Sae-A Trading,” the Times reports. “When [Mills] presided over the project’s unveiling in September 2010, she introduced Sae-A’s chairman, Woong-ki Kim, as the most important person at the ceremony, which included Mrs. Clinton and the Haitian prime minister.”\nIndeed, the Korean clothing company’s Clinton connections run deep.\nAn ABC News investigation shows that after opening its factory in Haiti, Sae-A donated between $50,000 and $100,000 to the Clinton Foundation.\nThe chairman of Sae-A, Woong-Ki Kim, also invested in a startup company, BlackIvy Group, owned by Hillary Clinton’s former chief of staff Cheryl Mills.\n“The chairman’s investment in BlackIvy was a personal investment that was not made until late in 2014,” SAE-A spokesman Lon Garwood told ABC News.\nThe revelations are among the latest examples of the sordid connections and transactions between the global nexus of Clinton Foundation donors and the favorable treatment they received and the shady deal-making during Hillary Clinton’s tenure as secretary of state.\nAs part of a U.S.-led effort to spur investment in the earthquake-ravaged country, Sae-A received millions in taxpayer subsidies to build its factory in Haiti.\nThe Haitian government, the New York Times reports, provided the land for Sae-A’s new facility near the densely populated Port-au-Prince region. Nearly $124 million in U.S. tax dollars went to “develop a power plant, housing, and other improvements for the Haiti industrial park, while an international development bank contributed $100 million,” the Times reports.\n“This is business,” a Sae-A spokesman reportedly said around the time construction began. “At the end of the day, it’s about making a profit.”\nAlas, Sae-A breaking ground in Haiti was no accident.\n“Just a few months after becoming secretary of state, Mrs. Clinton was being forwarded emails from Ms. Mills containing economic development ideas,” the Times reports, adding:\nSome of those ideas were from Jean-Louis Warnholz, an economist whose consulting business provided “intelligence on African markets.” In emails and meetings with the Clintons and Ms. Mills, he advocated investment in textiles and agriculture as a way to create jobs, a theory that was fast-tracked in Haiti after the earthquake with a proposal for an industrial park anchored by a major garment factory.\nMills, who is listed as CEO of the BlackIvy Group, “hired Mr. Warnholz as her own adviser at the State Department — he would later join her at BlackIvy — and the two worked closely to push the industrial park concept,” the Times reports.\nManagers at Sae-A facilities in multiple countries have faced accusation of bullying, bilking workers’ pay, and sexual harassment.\nFollow Jerome Hudson on Twitter @jeromeehudson.","url":"https://www.breitbart.com/politics/2016/10/20/report-clinton-foundation-donor-lands-taxpayer-funded-factory-haiti-invests-top-clinton-aides-company/"}
