{"authors":["Amanda Ulrich For Dailymail.Com"],"date_download":"2018-10-23 03:00:08","date_modify":"2018-10-23 03:00:08","date_publish":"2017-04-26 14:22:29","description":"Charles Short, an African American man who worked at The Lions Model Management as a models agent, filed the lawsuit against the company, Burkle and four other executives.","filename":"data/vaneerConsumption/ClintonpalRonBurklehitwithracialdiscriminationsuit.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/14/3F9FD0A700000578-0-image-a-65_1493212545517.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4444186_Clinton-pal-Ron-Burkle-hit-racial-discrimination-suit_1540263608.html","title":"Clinton pal Ron Burkle hit with racial discrimination suit","title_page":"Clinton pal Ron Burkle hit with racial discrimination suit | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The owner of a New York-based modeling agency, billionaire investor Ron Burkle, has been sued by a former employee for racial discrimination.\nCharles Short, an African American man who worked at The Lions Model Management as an agent and talent manager from 2013 until this March, filed the lawsuit against Burkle and four other executives.\nHe is seeking damages as a result of harassment based on race, a hostile work environment, retaliation and wrongful termination.\nInvestor Ron Burkle, pictured at a charity benefit in 2016 with a date, and four executives at his modeling agency have been sued for discrimination\nAccording to court documents obtained by DailyMail.com, Short was initially 'praised for his performance' and 'negotiated lucrative contracts' for clients with companies like J Crew, Express, Bebe and Moroccanoil.\nBut problems arose when it came to the genre of music being played over the agency's speakers.\nShort's former supervisors and now defendants in the case - Ali Kavoussi, Louie Chaban, Christiana Tran and Julia Kisla - allegedly 'allowed their employees to select and play songs on the office iPod to be played throughout the office, containing the word \"n****r\" or \"n***a\" and referring to offensive stereotypes about African-Americans throughout the day.'\nDuring Bill Clinton’s presidency, Burkle was a key fundraiser and the two became close friends. Burkle donated heavily to Hillary's 2008 campaign\nShort argued that he was 'forced to endure a barrage of racially offensive lyrics.'\nSome of the songs that were played included 'Lookin' A**' by Nicki Minaj, where she raps: 'Look at ya'll smokin' a** n****s/ After every pull, n****s start chokin' a** n****s.'\nDrake's song 'Over' and J Cole's 'Ville Mentality' were also reportedly played.\nShort said that he protested by asking if the group could listen to other songs, but his complaints were 'simply ignored.'\nIn his suit, Short also claimed that he was forced to listen to lyrics that were 'discriminatory based on gender and national origin,' like Lil Wayne's 'Every Girl.'\nOne song too many finally put him over the edge. When Short formally complained to HR about the lyrics, they promised to rectify the situation. And for a while Short said they stopped playing the music.\nBut eventually, he claimed, his supervisors started making pointed comments.\nIn front of clients, Ali Kavoussi allegedly said, 'I really want to listen to some rap music but I know that [Charles] would get offended.'\nIn another incident he asked, 'Do you guys want to see this video I got from [model] Irina Shayk?' But according to court documents, he laughed when Short stood up, saying, 'Nevermind, Charles, I don't think you'll like it because she's using the n-word.'\nCharles Short, a former models agents and talent manager at the company, accused his ex-supervisors - pictured from left to right, Ali Kavoussi, Julia Kisla and Christiana Tran, of constantly playing offensive rap music\nIn one incident, Ali Kavoussi asked, 'Do you guys want to see this video I got from [model] Irina Shayk?' But according to court documents, he laughed when Short stood up, saying, 'Never mind, Charles, I don't think you'll like it because she's using the n-word.' Pictured, Kavoussi with model Shayk\nFrom 2014 on, the music continued with 'parental controls,' yet the preventative measure failed to block all offensive language.\nShort said he was 'subjected to over eight hours of racially offensive and derogatory music on a daily basis.'\nLast month, Short sat down at his desk and 'again heard the lyrics of Nicki Minaj's song 'Lookin' A**.' He walked over, stopped the song and removed the iPod from its speakers.\n'I find this music to be very disrespectful as an African American man. This is crude, vulgar and very inappropriate for the workplace,' Short claimed to have said. He emailed his supervisors afterwards, ordering that the offensive music stop or he would have to leave the agency.\nHis supervisors decided to meet with Short in person. Julia Kisla allegedly told Short: 'We got your email, and it was very harsh. [The Lions] is a very welcoming and inclusive place. We are not racists.'\n'You're just overreacting and projecting,' Louie Chaban then said, according to the documents. 'The word n****r doesn't mean what it used to. This generation uses that word everywhere. You hear it on the street, on the subway, at photo shoots, and most people using it are black.\n'Most of the songs played in the office are rapped by black rappers. Even some of the models we represent use the n-word,' he added.\nDuring one of his final confrontations about the music, Louie Chaban (pictured with Julia Kisla) allegedly told Short that when he worked at DNA Models he wore a bracelet with a swastika on it. He argued that it was a symbol Nazis took from Native Americans and was not offensive\nShort alleged that he replied: 'I can't believe that someone who has never been African American a day in his life is giving me a lecture on the merits of the word n****r in a workplace environment.\n'I cannot control what people do on the street, but this is a place of business,' he said, adding that he does not hear the word when he enters a store or bank.\nChaban then reportedly claimed that when he worked at DNA Models, another popular agency in New York, he wore a bracelet with a swastika on it. According to Short, Chaban argued that it was a symbol Nazis originally took from Native Americans and should not be taken offensively.\n'We don't work in a bank,' Chaban allegedly said. 'We work in a creative field. Just get over it.'\nA day later, Short said he was called at home and fired. His belongings at the office were boxed up for him.\nHe claims that as a result of the agency's actions, he has suffered 'emotional distress' and 'the loss of income, the loss of salary, bonuses [and] benefits.' He is requesting unspecified damages.\nLawyers for Ron Burkle, however, stated in a letter responding to the lawsuit that Short had been aggressive in the workplace before, and had even been told to take anger management classes.\nThey also argued that Burkle should be removed as a defendant in the case, due to his indirect relationship with the agency. He has allegedly never met or spoken to Short.\nBurkle is a co-founder of The Yucaipa Companies, a private equity firm, and was ranked on Forbes’ list of ‘The Richest People On The Planet 2014.’\nHe is also a multi-million dollar donor to the Democratic Party, and though he raised a considerable sum for Hillary Clinton during her 2008 presidential run, he publicly backed John Kasich in 2016.","url":"https://www.dailymail.co.uk/news/article-4444186/Clinton-pal-Ron-Burkle-hit-racial-discrimination-suit.html"}
