{"authors":["Andrew Bullock For Mailonline"],"date_download":"2018-10-23 00:15:47","date_modify":"2018-10-23 00:15:47","date_publish":"2017-03-16 09:18:59","description":"One of Rachel Riley's most notably racy ensembles  seems to have gone over Countdown viewers' heads - until now.","filename":"data/vaneerConsumption/ClipofRachelRileybralesssuddenlygoesviral.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E53182700000578-0-image-a-21_1489656102707.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319348_Clip-Rachel-Riley-bra-suddenly-goes-viral_1540253747.html","title":"Clip of Rachel Riley bra-less suddenly goes viral","title_page":"Clip of Rachel Riley bra-less suddenly goes viral | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's known for her brains and her beauty - the latter of which she is seen showcasing on a daily basis on Channel 4's Countdown in a variety of stunning outfits.\nBut one of Rachel Riley's most notably racy ensembles seems to have gone over viewers' heads - until now.\nRachel went bra-less in an episode of the letters and numbers game-show in 2015, showcasing her stunning figure in a light pink mini-dress.\nScroll down for video\nTwo from the top please Rachel! 18-month old clip of maths genius Riley suddenly goes viral as online viewers realise she's BRA-LESS under her sensational pink mini-dress\nBut only now, 18 months on, has it caught the internet's attention and gone viral - amassing just shy of 300,000 hits on YouTube.\nThe cute ensemble featured a slanting off-centre neckline.\nBut despite not being particularly 'plunging' in design, her lack of supportive underwear drew viewers' attention to her bust, given the fact that the outline of her assets could be clearly seen through the silky fabric.\nThe video has of course attracted a slew of iffy comments from over-excited fans - but most notable is the fact that the clip has only collected attention now, in 2017.\nStunning: The blonde looked truly glam in the frock, which was a shade of light pink\nThe TV star is no stranger to titillating commentary - but more so on the late-night version of her show - 8 Out Of 10 Cats Does Countdown.\nHowever, this racy number appeared on the daytime version of the show.\nLast week, again on the regular version, her boyfriend Pasha Kovalev, who was sitting in Dictionary Corner with expert Susie Dent, spelled out the word 'Phallus', a term for a penis - much to the cast's amusement.\nThis left Rachel a little red-faced as she had to arrange the letters into the word and stand next to it in all it's glory.\nPerks of the job: Rachel went bra-less in an episode of the letters and numbers game-show in 2015, showcasing her stunning figure in a light pink mini-dress\nThe mathematics whiz was looking as glamorous as ever on Tuesday too, as she arrived at the TRIC Awards, hosted by the Television And Radio Industries Club, in London.\nThe 31-year-old showed off her enviably slender figure in a sexy but sophisticated blue lace midi dress as she made her glamorous arrival at the star-studded bash.\nThe blonde looked truly stunning in the frock, which saw a figure-hugging strapless dress layered beneath a thin layer of delicate blue lace.\nWith the under-layer cutting off in a sweetheart neckline, the semi-sheer material gave a sexy glimpse of her bust by pulling into a high neck over her bare skin.\nKeeping utterly sophisticated however, the dress then cinched in at her slim waist with a satin belt, before skimming her slender figure all the way to its classy knee-length hem.\nAccessorising with simple nude pointed heels and a metallic clutch, Rachel kept all eyes on her show-stopping look as she comfortably posed for cameras.\nThe former Strictly Come Dancing star styled her hair into big, bouncy curls and added a heavy slick of eyeliner for a finishing touch of glamour.\nThe blonde mingled with a number of stars at the event, including TV favourite Eamonn Holmes - but left her beau Pasha at home.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319348/Clip-Rachel-Riley-bra-suddenly-goes-viral.html"}
