{"authors":[],"date_download":"2018-10-22 20:55:21","date_modify":"2018-10-22 20:55:21","date_publish":"2014-06-03 18:38:09","description":"A U.S. Air Force plane flying over the Pacific in April was intercepted by a Russian jet that came dangerously close to the American aircraft.","filename":"data/vaneerConsumption/CloseCallUSPlaneRussianJetNearlyCollideOverPacific.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_close-call-u-s-plane-russian-jet-nearly-collide-over-n121506_1540241721.html","title":"Close Call: U.S. Plane, Russian Jet Nearly Collide Over Pacific","title_page":"Close Call: U.S. Plane, Russian Jet Nearly Collide Over Pacific","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA U.S. Air Force plane flying over the Pacific in April was intercepted by a Russian jet that came dangerously close to the American aircraft, defense officials confirmed to NBC News.\nThe Air Force RC-135U was flying in international airspace about 60 miles off the Russian Far East coast, north of Japan, on April 23 when a Russian SU-27 Flanker flew within 100 feet of the nose of the plane. The Flanker maneuvered itself so it exposed its belly, presumably to indicate that it was armed.\nThere was no radio communication between the planes.\nPentagon spokesman Col. Steven Warren said the interception happened as the RC-135U was conducting a routine surveillance mission over the Sea of Okhotsk, reported The Washington Times.\n“The SU-27 approached the RC-135U and crossed the nose of the U.S. aircraft within approximately 100 feet,” Warren said in a statement. “Senior department leaders have communicated our concerns directly to the Russian military.”\nThere is no word on whether there has been a response from the Russians.\nThe aerial encounter came two days after Japanese warplanes intercepted two Russian military aircraft anti-submarine patrols near the Japanese island of Hokkaido, the Washington Times said.\n— Courtney Kube and Elizabeth Chuck","url":"https://www.nbcnews.com/news/world/close-call-u-s-plane-russian-jet-nearly-collide-over-n121506"}
