{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 21:02:52","date_modify":"2018-10-30 21:02:52","date_publish":"2015-03-12 00:32:49","description":"Hundreds of millions of dollars have already been paid to corporations since 2012 in contracts related to the Common Core standards.","filename":"data/vaneerConsumption/CNBCCommonCoreaCashCowtoCorporations.json","image_url":"https://media.breitbart.com/media/2015/01/standardized-testing-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_11__1540933372.html","title":"CNBC: Common Core a Cash Cow to Corporations","title_page":"CNBC: Common Core a Cash Cow to Corporations | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Hundreds of millions of dollars have already been paid to corporations like Pearson, McGraw-Hill, Houghton Mifflin Harcourt, Scholastic, and Apple since 2012 in contracts related to the controversial Common Core standards.\nAccording to CNBC, despite the intense debate and unpopularity of the nationalized standards and their aligned testing and data collection, “more contracts potentially worth billions of dollars for testing, instructional materials and teacher training are on the way.”\nEarly funding, about $360 million, of the federally-driven standards came from Race to the Top (RttT), a competitive grant program for states launched in President Obama’s 2009 stimulus bill. Federal funds also went to two interstate test consortia—the Partnership for Assessment of Readiness for College and Careers (PARCC) and the Smarter Balanced Assessment Consortium (SBAC).\nThe two test consortia then distributed the funds to vendors to develop Common Core testing and related materials.\nAs Education Week reported last October, McGraw-Hill, owned by Apollo Global Management, received $72.5 million from SBAC, while Pearson was given $63 million from PARCC. Educational Testing Services (ETS) received a combined $42 million from both consortia.\nIn May of 2012, the pro-Common Core Thomas B. Fordham Institute estimated that schools would spend “between $3 billion and $12.1 billion nationally” on Common Core implementation, not including the necessary technology improvements to administer the online tests.\n“Common Core has clearly been an important market for the large education companies,” said Paul Irby, a market analyst with business intelligence firm Onvia, according to CNBC.\nSimilarly, Philip Gorham, a senior equity analyst at Morningstar, has estimated that Common Core-related business will be one of two reasons for more than three percent growth for the U.K.-based Pearson over 2015.","url":"https://www.breitbart.com/politics/2015/03/11/cnbc-common-core-a-cash-cow-to-corporations/"}
