{"authors":["John Nolte"],"date_download":"2018-10-30 19:26:35","date_modify":"2018-10-30 19:26:35","date_publish":"2015-12-31 16:00:41","description":"CNN political contributor Errol Louis went off-script Thursday morning when he reported out loud one of the truths the DC Media has spent decades covering |","filename":"data/vaneerConsumption/CNN14WomenHaveMadeClaimsOfSexualAbuseAgainstBillClinton.json","image_url":"https://media.breitbart.com/media/2015/12/47704530.cached-11.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_12_31__1540927595.html","title":"CNN: '14 Women Have Made Claims' Of Sexual Abuse Against Bill Clinton","title_page":"CNN: '14 Women Have Made Claims' Of Sexual Abuse Against Bill Clinton | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"CNN political contributor Errol Louis went off-script Thursday morning when he reported out loud one of the truths the DC Media has spent decades covering up: that a total of 14 women have accused former President Bill Clinton of some form of sexual abuse, from rape to groping to harassment.\n“After what we’ve seen with Bill Cosby and with old accusations,” Louis said, “There are about 14 women who could be said to have made claims at one time or another” against Bill Clinton.\nProving she hasn’t done her homework on one of the biggest stories of the day, an astonished Alisyn Camerota chimed in, “Is that right? Fourteen.”\nAt this point, after apparently realizing the mistake he made uttering this long-hidden truth, Louis attributed the number, not to the women who claim they are victims of Bill Clinton, but to “right-wing sites.” He then dishonestly dismissed two of Clinton’s most notorious sexual indiscretions.\nIf you go to sort of the right wing websites and the talk radio crowd, there are about 14 names out there, [but] the ones we all remember are not in that list of 14. We remember Gennifer Flowers, we remember Monica Lewinsky, we remember Paula Jones. Paula Jones was an accusation, the other two were consensual relationships.\nLewinsky was much more than just a “consensual relationship,” it was a sordid affair that went on in the Oval Office involving the exploitation of a much younger, vulnerable 21 year-old intern and her boss, the Chief Executive of the United States.\nAs far as Paula Jones, she accused Clinton of harassment and he not only paid out a $850,000 settlement, this is the case that resulted in Clinton being impeached (for committing perjury) and losing his license to practice law in Arkansas. It was MUCH MORE than an accusation. Under oath, when asked on three different occasions if he had an affair with Monica Lewinsky, Clinton replied:\n“No.” “It’s certainly not the truth. It would not be the truth.” “I have never had sexual relations with Monica Lewinsky. I’ve never had an affair with her.”\nThe Clinton News Network is always going to be the Clinton News Network but Trump has accomplished one mission no one else could: he has all of the DC Media on defense over Bill Clinton’s real and alleged sexual predations. We are finally litigating this media cover up, and that includes the women who say that Hillary Clinton victimized them a second to protect their abuser — her husband.\nFollow John Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/the-media/2015/12/31/cnn-14-women-have-made-claims-of-sexual-abuse-against-bill-clinton/"}
