{"authors":["John Nolte"],"date_download":"2018-10-30 21:09:29","date_modify":"2018-10-30 21:09:29","date_publish":"2018-08-18 14:49:23","description":"CNN is being accused of attempting to intimidate the Manafort jury after the network and six other media outlets sued to name the jurors.","filename":"data/vaneerConsumption/CNNAccusedofIntimidatingPaulManafortJury.json","image_url":"https://media.breitbart.com/media/2018/08/Jeff-Zucker-pout-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2018_08_18__1540933769.html","title":"CNN Accused of Intimidating Paul Manafort Jury","title_page":"CNN Accused of Intimidating Paul Manafort Jury","title_rss":"NULL","source_domain":"breitbart.com","text":"CNN is being accused of attempting to intimidate the Paul Manafort jury after the far-left cable channel (and six other anti-Trump outlets) requested the jurors’ names and home addresses.\nManafort, who worked for a short time as President Trump’s campaign chairman during the 2016 presidential election, has been charged by special counsel Robert Mueller with various financial crimes, none of which have anything to do with Trump or the campaign.\nManafort’s fate now sits with the jury, and after two days of deliberations, anti-Trump media outlets like CNN are becoming concerned Manafort could be acquitted, which would be a major blow to Mueller’s credibility and his ability to remove Trump from office — an outcome the establishment media are desperate to orchestrate.\nAnd so, on Thursday, CNN, along with six other far-left media outlets (the Washington Post, BuzzFeed, Politico, the New York Times, NBC, and the AP) sued for the release of the names and home addresses of all of the Manafort jurors, a move that is both disturbing and almost unprecedented.\nAs Bre Payton at the Federalist points out, “Publicly outing the names and home addresses of jurors is considered ethically questionable, as outlined in this guidance sheet on the topic from the Reporter’s Committee for Freedom of the Press.”\nTo begin with, it is seen as unseemly to thrust jurors into the spotlight against their will when they are not volunteering for publicity; they are chosen.\nWhat many see here, and not without precedent, is yet another attempt by the media, most especially CNN, to bully and intimidate private, everyday citizens into convicting Manafort.\nCNN’s intimidation tactics have been well-established over the years.\nAfter President Trump tweeted out a short video (or GIF) mocking CNN last July, the last-place cable channel launched a jihad against the GIF’s creator with the public threat to dox (expose this person’s personal information to online mobs) if he is ever again caught criticizing the network.\nIn February, CNN sent one of its reporters and a TV crew to dox and humiliate an elderly Trump supporter who might have unwittingly promoted a post-election event “coordinated by the Russians.” It worked. Afterwards, she was abused and threatened online.\nIn 2013, CNN led the mob in a campaign to destroy the career of a local rodeo clown who performed while wearing an Obama mask. During the previous administration, this same rodeo clown had performed in a George W. Bush mask.\nAlso in 2013, CNN broadcast the social security number of George Zimmerman, the Hispanic man who shot Trayvon Martin in self-defense.\nCNN’s overall behavior during the Zimmerman case (he was acquitted) revealed the network’s desperation for a conviction in that case. Among other things, CNN fabricated evidence against Zimmerman, falsely described the Hispanic man as “white,” and spread the fake news that Zimmerman was motivated by racial prejudice, though the evidence showed the exact opposite.\nEven more disturbing was CNN’s coming out this week to legitimize violence against Trump supporters.\nWisely, the judge overseeing the Manafort trial, U.S. District Judge T.S. Ellis, who says threats against him require his own round-the-clock security detail, declined CNN’s request to out the jurors.\nNevertheless, many still see the move as a desperate attempt on CNN’s part to intimidate the jury, primarily because the media showed no interest in knowing the names and home addresses of the jury during the 13-day trial.\nIt was only after deliberations began and the jury started asking questions about the meaning of “reasonable doubt” that the media sued to out the names and home addresses of these private citizens.\nThe timing is also suspect because CNN and its left-wing confederates did not wait until after the verdict to request this information. In other words, this is not a sequestered jury, and as we head into a weekend break from deliberations, jurors are almost certain to learn that these powerful anti-Trump outlets are hunting them down.\nHow can that not be intimidating?\nAt the American Thinker, Monica Showalter writes:\nLess than a week after making a stink about freedom of the press, President Trump and ‘enemies of the people, CNN and apparently other news outlets have decided to get into the harassment business given that reporting news is just not good enough for them. … Wow. So now they’ve gotten into the jury-tampering business. They’re more interested in who the jury is than the court trial itself. And that may well be because they suspect Manafort, whose real crime seems to be serving as Donald Trump’s campaign manager, will walk.\nPowerline’s John Hinderaker:\nWhy do you suppose seven news organizations–all liberal, presumably–wanted to know who the jurors are and where they live? They are worried that the jury, having heard the evidence, may not render the “right” verdict, i.e., the one that helps the Democratic Party. So they want to know who the jurors are so they can apply pressure on them through mob action, newspaper denunciations, online harassment and so on. This is how today’s Democratic Party operates. If the jury fails to render the Democrats’ preferred verdict, what do you suppose Maxine Waters will suggest Democrats should do to the jurors if they venture out in public?\nEven the Never Trump RedState writes, “So the message has been delivered from the Resistance to the jury by way of the media.”\nWilliam Jacobson at Legal Insurrection:\nIn a case such as this, that could be seen as an act of media intimidation — the jury is not sequestered so they certainly would hear about it. In an environment of online mobs and CNN having threatened to doxx a gif maker who mocked CNN, the jurors rightly would be concerned if the judge released their personal information to the media. The media could have waited until after the verdict, but that would not have allowed the media to camp outside jurors homes in time for the immediate news cycle. Jurors also could have been given the choice, after the verdict, whether to have their names revealed. That’s not to say these same media outlets won’t take it on themselves to out the jurors, particularly if there is a not guilty verdict, but the judge wasn’t going to make it easy for them.\nThe Manafort jury resumes deliberations on Monday.\nFollow John Nolte on Twitter @NolteNC. Follow his Facebook Page here.","url":"https://www.breitbart.com/the-media/2018/08/18/cnn-accused-intimidating-paul-manafort-jury/"}
