{"authors":["John Nolte"],"date_download":"2018-10-30 18:26:41","date_modify":"2018-10-30 18:26:41","date_publish":"2018-08-03 14:46:30","description":"A CNN analyst pushed the lie Thuirsday that Trump is responsible for a mass murder at a Annapolis, Maryland newsroom","filename":"data/vaneerConsumption/CNNAnalystStillPushingLieTrumpCausedAnnapolisNewsroomMurders.json","image_url":"https://media.breitbart.com/media/2018/08/Brian-Karem.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2018_08_03__1540924001.html","title":"CNN Analyst Still Pushing Lie Trump Caused Annapolis Newsroom Murders","title_page":"CNN Analyst Still Pushing Lie Trump Caused Annapolis Newsroom Murders","title_rss":"NULL","source_domain":"breitbart.com","text":"CNN’s Brian Karem pushed the lie Thursday that President Trump is somehow responsible for the mass murder of five people at a newspaper office in Maryland in June.\nKarem, an analyst for CNN, spread this lie as White House Press Secretary Sarah Sanders laid out all the horrors she and other targets of the increasingly unhinged establishment media have faced during the Trump era.\nResponding to CNN’s Jim Acosta, who remains bitter over Trump supporters chanting “CNN sucks” and flipping him the bird at Monday’s Trump rally in Florida (CNN has spent years provoking this kind of reaction by smearing Trump supporters as Nazis and racists), Sanders said:\nSANDERS: It’s ironic, Jim, that not only you and the media attack the President for his rhetoric when they frequently lower the level of conversation in this country. Repeatedly — repeatedly — the media resorts to personal attacks without any content other than to incite anger. The media has attacked me personally on a number of occasions, including your own network; said I should be harassed as a life sentence; that I should be choked. ICE officials are not welcome in their place of worship, and personal information is shared on the Internet. When I was hosted by the Correspondents’ Association, of which almost all of you are members of, you brought a comedian up to attack my appearance and called me a traitor to my own gender. In fact, as I know — as far as I know, I’m the first Press Secretary in the history of the United States that’s required Secret Service protection. CNN’S KAREM: Tell that to the five dead people in Annapolis.\nAnd so, while Sanders is attempting to calmly explain the real world consequence of the media’s fake news, anti-Trump hyperbole, and hysterical rhetoric, here is CNN engaging in all of that in the middle of a White House briefing.\nBy suggesting the Annapolis massacre had something to do with the Trump administration, CNN is not only lying, the far-left cable channel is deliberately misleading the American people and intentionally whipping up even more hate and violence against the Trump administration by falsely connecting them to the horrific, cold-blooded murders of five innocent people.\nThe truth, and CNN knows this, is that the man charged with murders had a grudge with the newspaper in question going back to 2012, when he lost a defamation case against the newspaper that had to do with a 2011 criminal conviction and nothing to do with politics.\nUsing his verified Twitter account, Karem is proudly bragging about spreading this lie…\nUmmm I interrupted her monologue to mention Annapolis today. — Brian J. Karem (@BrianKarem) August 2, 2018\nYesterday, as CNN was lying about the White House somehow being responsible for five murders, five incidents of violence against Trump supporters were added to an ever-growing list of over 540.\nFollow John Nolte on Twitter @NolteNC. Follow his Facebook Page here.","url":"https://www.breitbart.com/the-media/2018/08/03/cnn-analyst-still-pushing-lie-trump-caused-annapolis-newsroom-murders/"}
