{"authors":["John Nolte"],"date_download":"2018-10-30 20:30:55","date_modify":"2018-10-30 20:30:55","date_publish":"2015-07-15 19:33:21","description":"During Wednesday's national press conference about his Iran deal, President Obama played the media like a fiddle. It was a situation where the media was |","filename":"data/vaneerConsumption/CNNBlastsCBSNewssMajorGarrettforAskingObamaToughQuestion.json","image_url":"https://media.breitbart.com/media/2015/03/zucker_cnn_rect.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_07_15__1540931455.html","title":"CNN Blasts CBS News's Major Garrett for Asking Obama Tough Question","title_page":"CNN Blasts CBS News's Major Garrett for Asking Obama Tough Question | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"During Wednesday’s national press conference about his Iran deal, President Obama played the media like a fiddle. It was a situation where the media was so compliant the questioners were hand-picked by the White House beforehand, the president filibustered throughout, and Obama ended the event by asking himself the questions he wanted to answer.\nOnly Major Garrett of CBS News asked a truly tough question, a question that was obviously framed in a way to cut through the president’s rigorously-rehearsed talking points. For daring to question the Lightbringer in the same way the media questioned President George W. Bush for 8 years, CNN went hard after Garrett over two news hours (thus far).\nBefore Don Lemon was brought on later to beclown himself, CNN’s congressional correspondent, Dana Bash, attacked Garrett as “disrespectful.”\nI’ve been a White House reporter, you’ve been a White House report… You know what it’s like to stand up and ask the president a question — and you do want to be tough. But there’s a fine line, especially standing in the East Room — a fine line between asking a tough question and maybe crossing that line a little bit, and maybe being disrespectful. So I think that that happened there.\nBut that wasn’t enough. In the following hour, CNN hauled out Don Lemon and Gloria Borger to attack Garrett.\nLemon, who obviously finds himself adorable, assumed the role of Angry Obama Translator to attack Garrett:\n“Well, let me tell you basically what [Obama] was saying [in his response to Garrett], which was, ‘Man, look here, are you out of your damn mind.’ That’s exactly what the tone was,” Lemon continued in his own voice. “To put the question in that form, I was at home watching, going ‘Wait a minute.’ It was a little out of school.”\nBorger ripped Garrett’s question as “loaded.”\nCNN hasn’t yet described Major Garrett as a racist.\nYet.\nDemocrats sure got it good…\n…Especially at left-wing CNN, where sanctuary cities don’t exist, Bristol Palin being assaulted is funny, evidence is fabricated against working-class Hispanic men, Hispanics are labeled as white, and inner-city riots are made-to-order for the left-wing cause.\nFollow John Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/the-media/2015/07/15/cnn-blasts-cbs-newss-major-garrett-for-asking-obama-tough-question/"}
