{"authors":[],"date_download":"2018-10-30 14:21:37","date_modify":"2018-10-30 14:21:37","date_publish":"2018-08-20 00:00:00","description":null,"filename":"data/vaneerConsumption/CNNbreakingnewsimminentinvasionofwhitesupremacists.json","image_url":"https://www.americanthinker.com/images/bucket/2018-08/208310.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2018_08_cnn_breaking_news_imminent_invasion_of_white_supremacists_1540909297.html","title":"CNN breaking news: imminent invasion of white supremacists","title_page":"CNN breaking news: imminent invasion of white supremacists","title_rss":"NULL","source_domain":"americanthinker.com","text":"CNN breaking news: imminent invasion of white supremacists\nIn the past few days, CNN has re-introduced the narrative that President Trump is the cause of, and should be blamed for, a rise in white supremacy movements in America. Like all excellent reporting from CNN, the underlying fiction is buried in hysteria, hyperbole, and outright fabrication. In a Developing Story, \"Neo-Nazi says he is emboldened by Trump: This is my country,\" Erin Burnett moderates fifteen minutes of reporting about a single man in Ulysses, Pennsylvania, a town of barely seven hundred people, who claims that he speaks for the \"rural America who spoke up when they elected Trump.\" Reporter Sara Sidner speaks to the man about his beliefs, in his driveway, alone, and after she is chased away, meets with a dozen of his neighbors in a \"church down the street.” The man's neighbors dutifully state that they don't share his beliefs, and they are concerned that, \"Well, he [Trump] hasn't helped the situation a whole lot.\"\nCNN apparently isn't familiar with Google. If it were, it would have learned that the same person subject to its report, one Daniel Burnside, when interviewed in 2017 didn't credit Trump with any \"growing movement.\" He credited Marvel comics. Well, not exactly. But he was interviewed for an article crediting a growing belief in the ancient Nordic religion known as Odinism: \"Odinists worship ancient Norse gods such as Thor and Odin. They typically wear pendants of Thor’s hammer around their necks and meet for rituals in the woods, where they drink mead from a communal horn, read ancient poetry and occasionally slaughter animals in sacrifice to the gods. For many white supremacists, Odinism’s motifs of revenge and action resonate far more than the values of Christianity, which was once their religion of choice.\" Moreover, Google reveals that, far from being a \"recent\" organization newly formed and motivated by the 2016 election, even prior to the election the alleged \"group\" of Thor-loving, mead-drinking, poem-reading racists from Ulysses, Pennsylvania was bragging it \"has been around for a very long time, and its the most active, largest group in American that stands up for the civil liberties of whites.\" This according to a single spokesman. The Washington Post, apparently Google-capable, was able to obtain and publish a picture from 2001, when the \"group\" moved to Ulysses. The picture depicts a significantly larger group than that portrayed by CNN, by the way. Two people, one masked, appear in the 2001 photo in front of the county court house. CNN could find only a single obviously disturbed person to represent the \"growing\" white supremacist movement, and the obvious lack of any analysis, other than his own claims, standing alone in his driveway, surrounded by exactly zero supporters. We are supposed to believe that he represents a growing movement, but there is nothing resembling analysis of how or why this has anything to with Trump (other than the \"White Nationalist Admits He is Emboldened By Trump\" chyron perpetually onscreen during the story). Erin Burnett does get Sara Sidner's final, that is, concluding thoughts: rather than a horror story of the thousands of angry racists she encountered on her trip to Ulysses, she depicts the courageous townspeople who have rejected racism, and who have \"managed\" to have survived living in close proximity to the village idiot. Sidner sums up as follows: \"As for Ulysses, the Burrough President told us they have dealt with an outspoken neo-nazi in their midst before, and they pushed him out several years ago, but that was because he broke the law, and he says that there is nothing they can do about Burnside unless he does the same.\" Sidnernwittingly betrays the narrative with the truth: we are talking about a single person! It’s understandable that CNN, deprived of modern tools of reporting like Google, could mistake a single person as a growing movement. Erin Burnett probably could not read her correspondent’s lips, or hear her, as she betrayed the narrative, because she looked on with an expression of deep concern befitting fear of the imminent invasion.","url":"https://www.americanthinker.com/blog/2018/08/cnn_breaking_news_imminent_invasion_of_white_supremacists.html"}
