{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 21:12:58","date_modify":"2018-10-30 21:12:58","date_publish":"2016-09-20 12:05:57","description":"CNN is falsely accusing Donald Trump of calling for \"racial profiling\" in the wake of the recent terror attacks.","filename":"data/vaneerConsumption/CNNFalselyAccusesTrumpofRacialProfiling.json","image_url":"https://media.breitbart.com/media/2016/01/GettyImages-501501888.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2016_09_20__1540933978.html","title":"CNN Falsely Accuses Trump of 'Racial Profiling'","title_page":"CNN Falsely Accuses Trump of 'Racial Profiling' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"CNN is falsely accusing Republican presidential nominee Donald Trump of calling for “racial profiling” in the wake of the recent terror attacks.\nIn articles such as “Trump defends racial profiling in wake of bombs,” posted Tuesday morning, and in on-air commentary, CNN adopts the Hillary Clinton campaign’s rhetoric, and implicitly accepts the left-wing argument that profiling people based on country of origin or based on religion is necessarily “racial profiling,” and hence racist, and wrong.\nTrump’s exact quote, given to Fox News Fox and Friends on Monday morning, was:\nOur police are amazing. Our local police — they know who a lot of these people are. They are afraid to do anything about it because they don’t want to be accused of profiling and they don’t want to be accused of all sorts of things. You know, in Israel they profile. They’ve done an unbelievable job, as good as you can do. But Israel has done an unbelievable job, and they’ll profile. They see somebody that’s suspicious, they will profile. They will take that person and they’ll check out. Do we have a choice? Look what’s going on. Do we really have a choice? We’re trying to be so politically correct in our country. And this is only going to get worse.\nNote that Trump never once used the term “racial.” The quote was reported by several Israeli news outlets without further comment, and without the word “racial,” because he accurately described certain Israeli practices — such as screening people in airport security lines, for example, where officials will ask passengers questions about their communities, their education, and their religion, often going into considerable detail to determine whether any individual poses a likely security risk.\nThe American left argues that such practices amount to racial profiling, and are hence racist, but these practices have nothing to do with race.\nIn December, following the San Bernardino Islamic terror attack, a neighbor who noticed suspicious activity at the terrorists’ home said he had wanted to report them to authorities but was afraid of being accused of racial profiling.\nThe Hill noted Wednesday that CNN had falsely added the word “racial” to Trump’s comments on profiling to prevent terror. Other outlets, including the avowedly left-wing Mother Jones and Rolling Stone, had also picked up the false “Trump calls for racial profiling” meme. CNN, which purports to be nonpartisan, nevertheless followed the same false, partisan description.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. His new book, See No Evil: 19 Hard Truths the Left Can’t Handle, is available from Regnery through Amazon. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/the-media/2016/09/20/racial-profiling-cnn-falsely-accuses-trump/"}
