{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 21:05:54","date_modify":"2018-10-30 21:05:54","date_publish":"2016-12-28 18:03:09","description":"CNN reported Wednesday that U.S. Secretary of State John Kerry's speech on Israel at the State Department had \"missed the mark.\"","filename":"data/vaneerConsumption/CNNKerrysSpeechonIsraelMissedtheMark.json","image_url":"https://media.breitbart.com/media/2016/12/John-Kerry-Speech-Israel-Associated-Press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_12_28__1540933554.html","title":"CNN: Kerry's Speech on Israel 'Missed the Mark'","title_page":"CNN: Kerry's Speech on Israel 'Missed the Mark' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"CNN’s correspondent in Israel, Oren Liebermann, reported Wednesday that U.S. Secretary of State John Kerry’s speech at the State Department had “missed the mark” if Kerry’s intent had been to reach Israeli viewers and convince them that lame duck President Barack Obama was serious about peace.\nLibermann reported from Jerusalem that none of the Israeli television networks had carried the speech live, though it was held during prime viewing time. Those in Israel who wanted to hear Kerry’s remarks — which lasted well over an hour — would have had to watch CNN or find satellite or Internet coverage.\n“Many here didn’t want to hear what Kerry had to say after last week’s UN Security Council vote,” Liebermann added later.\nCNN international anchor Hala Gorani agreed, suggesting that Kerry’s point may simply have been to record, for history, how the Obama administration felt about the settlements and the Israeli-Palestinian conflict.\nIn his remarks, Kerry made the case for a two-state solution to the Israeli-Palestinian conflict, and attempted to defend the Obama administration’s decision to abstain from UN Security Council Resolution 2334 last week, effectively allowing the resolution to pass. The resolution declares Israel’s presence in the West Bank and Jerusalem — including in areas holy to, and inhabited by, Jews for millennia — to be a “flagrant violation” of international law.\nKerry made several statements that seem to contradict the resolution, including that “certain settlements would become part of Israel.” While the U.S. did not agree with “every word” of the resolution, he said, the U.S. “could not” veto it, because of the need to make a statement against settlements and in support of the two-state solution.\nIn addition, Kerry also attacked the Israeli government — which he called “the most right-wing in Israeli history, with an agenda driven by the most extreme elements.” And he denied that the U.S. was the “driving force” behind the UN resolution, though he did not deny that the U.S. had encouraged it.\nKerry also defended the Obama administration’s general record on Israel. He did not mention the Iran nuclear deal.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, See No Evil: 19 Hard Truths the Left Can’t Handle, is available from Regnery through Amazon. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/middle-east/2016/12/28/cnn-kerry-speech-israel-missed-mark/"}
